{
  "id": "1aa22c69-6041-45bd-9aa1-36da8131a086",
  "title": "Semester Studio creates exhibition pavilion for Camerich using \"borrowed materials\"",
  "link": "https://www.dezeen.com/2024/11/07/semester-studio-camerich-temporary-storage-garden-pavilion/",
  "description": "This pavilion, designed by architecture firm Semester Studio for a furniture exhibition in Shanghai, was built entirely using materials that were separated and returned to their source after the show. The Temporary Storage Garden pavilion was created by Semester Studio for furniture producer Camerich's presentation at the 2023 China International Furniture Fair. Rather than displaying The post Semester Studio creates exhibition pavilion for Camerich using \"borrowed materials\" appeared first on Dezeen.",
  "author": "Alyn Griffiths",
  "published": "Thu, 07 Nov 2024 06:00:11 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "Pavilions",
    "all",
    "Architecture",
    "Exhibitions",
    "Interiors",
    "China",
    "Shanghai"
  ],
  "byline": "Alyn Griffiths",
  "length": 8830,
  "excerpt": "This pavilion by Semester Studio for an exhibition in Shanghai was built entirely using materials that were returned to their source after the show.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "This pavilion, designed by architecture firm Semester Studio for a furniture exhibition in Shanghai, was built entirely using materials that were separated and returned to their source after the show. The Temporary Storage Garden pavilion was created by Semester Studio for furniture producer Camerich's presentation at the 2023 China International Furniture Fair. Rather than displaying its latest collections, Camerich wanted to highlight its commitment to social and environmental sustainability, which informed its new research and manufacturing campuses in China. The Temporary Storage Garden pavilion was designed by Semester Studio for CamerichThe pavilion was organised around a central garden that recalled the brand's landscaped campuses and provided visitors with an opportunity for respite in the midst of the bustling trade fair. The structure was built with materials from Camerich's production, which were unaltered and labelled with their origin and destination to aid in the logistics of their return following the expo. \"We set for ourselves the simple challenge of achieving zero waste in realising the transient structure,\" said Semester Studio, adding that its design offered an alternative to typical exhibition stands that are typically discarded after just a brief period of use. Materials from Camerich's production were used to build the structure\"The pavilion is conceived as a temporary storage of materials diverted from the furniture maker's intricate supply chains and production lines,\" it added. \"The borrowed materials are carefully arranged to avoid damage, allowing them to be returned to their original use when dismantled.\" Its walls enclose a central gardenThe pavilion's base was made from ash planks bound together using orange tie-down straps and ratchets to create a stable space frame without the need for screw fixings. Rolls of the base-upholstery fabric used for Camerich's sofas were used in their original 100-metre length to create draped curtains above the wooden base without the need for cutting. Architectural models were displayed on wooden cratesThe temporary garden provided the setting for an exhibition of seven architectural models that showcased the designs of Camerich's facilities in Beijing and Jiaxing. The models were displayed on top of the wooden crates they were transported in, which were then reused to return them. The exhibition also included historical photographs of the campuses, along with construction images and drawings. Task lamps used to illuminate the displays were borrowed from the Beijing Campus, while the linear lights that provided ambient lighting were forwarded to the Jianxing factory to be used as supplementary lighting. The trees, plants and gravel in the garden were also sent to Jiaxing to become part of the campus's landscaping. All of the maple trees and plants with roots were packaged at the nursery to enable transport and replanting. The concept of placing a garden at the centre of the exhibition space was informed by Camerich's Beijing creative campus, which features a garden that employees pass through as they move between the various buildings. Rolls of sofa upholstery fabric were draped above the ash plank baseAs part of the exhibition, Camerich produced a special-edition newspaper made from recycled paper and eco-friendly ink that provided information about the planning of the new campuses, as well as its ideas around sustainability and social responsibility. Semester worked closely with Camerich after the exhibition to monitor how the materials were returned and reused. The studio claimed that 92 per cent of material costs were recovered, accounting for £84,000 of the £94,000 production cost. The pavilion's materials were reused after the eventThe pavilion was also reinstalled at two subsequent exhibitions by other companies, providing rental revenue for the client and optimising the use of materials before they were returned to the warehouse. The designers also suggested that the pavilion influenced various other brands that witnessed its success, with similar sustainability-themed pavilions appearing at the next edition of the China International Furniture Fair. The pavilion was displayed at the 2023 China International Furniture Fair\"The idea of using 'borrowed' materials inspired other designers in the industry to become more aware of the construction waste produced and be more mindful in their choice of construction method and materials,\" they added. The Temporary Storage Garden was long-listed in the installation design category of Dezeen Awards 2024, alongside projects including an all-wood temple with a 24-metre-tall spire created by designers Ela Madej and Reed Finlay for the Burning Man festival. It has been longlisted in this year's Dezeen AwardsCamerich previously worked with Pritzker Prize-winning architect Álvaro Size on an aluminium foil-covered pavilion for its presentation at the 2019 China International Furniture Fair. Semester Studio was founded by Manus Leung, Wenting Guo and Yun Fu during their student days at Harvard's Graduate School of Design. The practice, which has offices in Boston and Hong Kong, aims to bring a playful and sustainability-led approach to its international projects. Subscribe to our newsletters Your email address New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/10/hero-semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_2-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2132941\" data-article-id=\"2132941\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/hero-semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_9.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/10/hero-semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_9-852x479.jpg\" alt=\"Temporary Storage Garden pavilion by Semester Studio\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/10/hero-semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_9-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/10/hero-semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_9-1704x959.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eThis \u003ca href=\"https://www.dezeen.com/architecture/pavilions/\"\u003epavilion\u003c/a\u003e, designed by architecture firm Semester Studio for a furniture \u003ca href=\"https://www.dezeen.com/tag/exhibitions-tag/\"\u003eexhibition\u003c/a\u003e in \u003ca href=\"https://www.dezeen.com/tag/shanghai/\"\u003eShanghai\u003c/a\u003e, was built entirely using materials that were separated and returned to their source after the show.\u003cspan id=\"more-2132941\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Temporary Storage Garden pavilion was created by \u003ca href=\"https://semesterstudio.com/\"\u003eSemester Studio\u003c/a\u003e for furniture producer \u003ca href=\"https://www.camerich.com/\"\u003eCamerich\u003c/a\u003e\u0026#39;s presentation at the 2023 \u003ca href=\"https://www.ciff-gz.com/en/\"\u003eChina International Furniture Fair\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eRather than displaying its latest collections, Camerich wanted to highlight its commitment to social and environmental sustainability, which informed its new research and manufacturing campuses in China.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2137266\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_1.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_1-852x569.jpg\" alt=\"Pavilion for a Camerich furniture exhibition\" width=\"2364\" height=\"1578\" srcset=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_1-852x569.jpg 1x, https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_1-1704x1137.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2137266\"\u003eThe Temporary Storage Garden pavilion was designed by Semester Studio for Camerich\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe pavilion was organised around a central garden that recalled the brand\u0026#39;s landscaped campuses and provided visitors with an opportunity for respite in the midst of the bustling trade fair.\u003c/p\u003e\n\u003cp\u003eThe structure was built with materials from Camerich\u0026#39;s production, which were unaltered and labelled with their origin and destination to aid in the logistics of their return following the expo.\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;We set for ourselves the simple challenge of achieving zero waste in realising the transient structure,\u0026#34; said Semester Studio, adding that its design offered an alternative to typical exhibition stands that are typically discarded after just a brief period of use.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2137267\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_3.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_3-852x568.jpg\" alt=\"Temporary Storage Garden pavilion by Semester Studio\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_3-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_3-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2137267\"\u003eMaterials from Camerich\u0026#39;s production were used to build the structure\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The pavilion is conceived as a temporary storage of materials diverted from the furniture maker\u0026#39;s intricate supply chains and production lines,\u0026#34; it added.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The borrowed materials are carefully arranged to avoid damage, allowing them to be returned to their original use when dismantled.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2137268\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_4.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_4-852x568.jpg\" alt=\"Temporary Storage Garden pavilion by Semester Studio\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_4-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_4-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2137268\"\u003eIts walls enclose a central garden\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe pavilion\u0026#39;s base was made from ash planks bound together using orange tie-down straps and ratchets to create a stable space frame without the need for screw fixings.\u003c/p\u003e\n\u003cp\u003eRolls of the base-upholstery fabric used for Camerich\u0026#39;s sofas were used in their original 100-metre length to create draped curtains above the wooden base without the need for cutting.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2137269\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_5.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_5-852x567.jpg\" alt=\"Camerich exhibition in Shanghai\" width=\"2364\" height=\"1572\" srcset=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_5-852x567.jpg 1x, https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_5-1704x1133.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2137269\"\u003eArchitectural models were displayed on wooden crates\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe temporary garden provided the setting for an exhibition of seven architectural models that showcased the designs of Camerich\u0026#39;s facilities in Beijing and Jiaxing.\u003c/p\u003e\n\u003cp\u003eThe models were displayed on top of the wooden crates they were transported in, which were then reused to return them. The exhibition also included historical photographs of the campuses, along with construction images and drawings.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eTask lamps used to illuminate the displays were borrowed from the Beijing Campus, while the linear lights that provided ambient lighting were forwarded to the Jianxing factory to be used as supplementary lighting.\u003c/p\u003e\n\u003cp\u003eThe trees, plants and gravel in the garden were also sent to Jiaxing to become part of the campus\u0026#39;s landscaping. All of the maple trees and plants with roots were packaged at the nursery to enable transport and replanting.\u003c/p\u003e\n\u003cp\u003eThe concept of placing a garden at the centre of the exhibition space was informed by Camerich\u0026#39;s Beijing creative campus, which features a garden that employees pass through as they move between the various buildings.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2137274\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_12.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_12-852x567.jpg\" alt=\"Camerich garden exhibition\" width=\"2364\" height=\"1572\" srcset=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_12-852x567.jpg 1x, https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_12-1704x1133.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2137274\"\u003eRolls of sofa upholstery fabric were draped above the ash plank base\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eAs part of the exhibition, Camerich produced a special-edition newspaper made from recycled paper and eco-friendly ink that provided information about the planning of the new campuses, as well as its ideas around sustainability and social responsibility.\u003c/p\u003e\n\u003cp\u003eSemester worked closely with Camerich after the exhibition to monitor how the materials were returned and reused. The studio claimed that 92 per cent of material costs were recovered, accounting for £84,000 of the £94,000 production cost.\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2137273\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_10-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_10-852x1284.jpg\" alt=\"Temporary Storage Garden pavilion by Semester Studio\" width=\"1568\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_10-852x1284.jpg 1x, https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_10-1704x2568.jpg 2x\" sizes=\"(max-width: 1568px) 100vw, 1568px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2137273\"\u003eThe pavilion\u0026#39;s materials were reused after the event\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe pavilion was also reinstalled at two subsequent exhibitions by other companies, providing rental revenue for the client and optimising the use of materials before they were returned to the warehouse.\u003c/p\u003e\n\u003cp\u003eThe designers also suggested that the pavilion influenced various other brands that witnessed its success, with similar sustainability-themed pavilions appearing at the next edition of the China International Furniture Fair.\u003c/p\u003e\n\u003cfigure id=\"preload-6\" aria-describedby=\"caption-attachment-2137277\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_16.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_16-852x568.jpg\" alt=\"Temporary Storage Garden pavilion by Semester Studio in Shanghai\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_16-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_16-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2137277\"\u003eThe pavilion was displayed at the 2023 China International Furniture Fair\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The idea of using \u0026#39;borrowed\u0026#39; materials inspired other designers in the industry to become more aware of the construction waste produced and be more mindful in their choice of construction method and materials,\u0026#34; they added.\u003c/p\u003e\n\u003cp\u003eThe Temporary Storage Garden was long-listed in the \u003ca href=\"https://www.dezeen.com/awards/2024/longlists/design/installation-design/\"\u003einstallation design category of Dezeen Awards 2024\u003c/a\u003e, alongside projects including \u003ca href=\"https://www.dezeen.com/2023/08/15/burning-man-temple-2023/\"\u003ean all-wood temple with a 24-metre-tall spire\u003c/a\u003e created by designers Ela Madej and Reed Finlay for the Burning Man festival.\u003c/p\u003e\n\u003cfigure id=\"preload-7\" aria-describedby=\"caption-attachment-2137271\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_8.jpg\" data-orientation=\"square\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_8-852x852.jpg\" alt=\"Temporary Storage Garden pavilion by Semester Studio\" width=\"2364\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_8-852x852.jpg 1x, https://static.dezeen.com/uploads/2024/10/semester-studio-camerich-temporary-storage-garden-pavilion_dezeen_2364_col_8-1704x1704.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2137271\"\u003eIt has been longlisted in this year\u0026#39;s Dezeen Awards\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eCamerich previously worked with Pritzker Prize-winning architect Álvaro Size on \u003ca href=\"https://www.dezeen.com/2019/10/03/alvaro-siza-pavilion-architecture-china-international-furniture-fair/\"\u003ean aluminium foil-covered pavilion\u003c/a\u003e for its presentation at the 2019 China International Furniture Fair.\u003c/p\u003e\n\u003cp\u003eSemester Studio was founded by Manus Leung, Wenting Guo and Yun Fu during their student days at Harvard\u0026#39;s Graduate School of Design. The practice, which has offices in Boston and Hong Kong, aims to bring a playful and sustainability-led approach to its international projects.\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#40303229362123390024253a25252e6e232f2d\"\u003e\u003cspan data-cfemail=\"6a1a18031c0b09132a0e0f100f0f0444090507\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-11-07T06:00:11Z",
  "modifiedTime": "2024-11-06T14:45:27Z"
}
