{
  "id": "2a50590a-4b22-46a7-b2de-abbc24902e59",
  "title": "Julia’s Lemon Oregano Chicken + Grilled Zucchini Salad",
  "link": "https://thedesignfiles.wpenginepowered.com/2024/10/food-julia-ostro-lemon-oregano-chicken-zucchini-salad/",
  "description": "Some of the best meals are the ones you can pop in the oven and forget about for an hour, then when it’s time to serve, whip up a quick and delicious salad to go alongside — hey presto, dinner is served! Julia Busuttil Nishimura’s Greek chicken is one of those meals. Paired with a fresh zucchini and herb salad, it will be your go-to for easy summer dinners. Find the recipe below!",
  "author": "The Design Files",
  "published": "Thu, 24 Oct 2024 19:00:28 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2024,
  "excerpt": "Dinner is served with this easy-to-make and utterly delicious oregano lemon chicken with a fresh herb and zucchini salad!",
  "siteName": "",
  "favicon": "",
  "text": "Lemon Oregano Chicken + Grilled Zucchini Salad (Serves 4)  1.4 kg whole chicken, butterflied 2 tbsp extra virgin olive oil, plus extra for drizzling Juice and zest of 1 lemon 2 cloves garlic, finely grated 1 tbsp dried oregano 4 potatoes, peeled and sliced into .5 cm thick rounds Zucchini and herb salad 4 Zucchini (approximately 750g), halved lengthways 3 tbsp extra virgin olive oil 1 tbsp red wine vinegar 1 tsp dried oregano 3 sprigs fresh oregano, leaves picked Handful of dill fronds, roughly torn Handful of mint leaves, roughly torn 125g Greek feta, crumbled Salt and pepper, to taste Pita, to serve Method: In a large bowl or container, place the chicken, olive oil, lemon, garlic and oregano. Season well with salt and massage into the chicken. Cover and allow to marinate in the fridge for 2 hours or ideally overnight. Preheat the oven to 190C. Arrange the potatoes on the bottom of a roasting dish or tray and place the chicken, skin side up onto the potatoes. Drizzle everything with a little more olive oil, season the potatoes with salt and roast in the preheated oven for 50-55 minutes or until the chicken is cooked and the potatoes are golden. Remove the chicken from the tray to rest and if you want more colour on the potatoes, continue cooking the potatoes for a further 15 minutes. Meanwhile, make the zucchini salad by coating the zucchini in 1 tbsp of the oil and grilling them until tender and nicely coloured. Cut the zucchini into 4cm pieces. Place the remaining oil and vinegar in a large bowl and whisk to combine. Add the zucchini and remaining ingredients and season to taste. Cut the chicken into 8 pieces and serve with the roast potatoes, zucchini salad and pita. What else I’m cooking: Zucchini flowers are so incredible right now and have recently been stuffing them with a mixture of rice, herbs, currants and pine nuts and cooking them in the oven with a fresh tomato sauce. So delicious. What else I’m eating: The vanilla and saffron buns from Bread Club. Warmed up at home, heaven!!",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2024/10/greekchicken-tdf-food6-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eLemon Oregano Chicken + Grilled Zucchini Salad\u003c/h3\u003e\n\u003cp\u003e\u003cem\u003e(Serves 4) \u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e1.4 kg whole chicken, butterflied\u003cbr/\u003e\n2 tbsp extra virgin olive oil, plus extra for drizzling\u003cbr/\u003e\nJuice and zest of 1 lemon\u003cbr/\u003e\n2 cloves garlic, finely grated\u003cbr/\u003e\n1 tbsp dried oregano\u003cbr/\u003e\n4 potatoes, peeled and sliced into .5 cm thick rounds\u003c/p\u003e\n\u003ch3\u003eZucchini and herb salad\u003c/h3\u003e\n\u003cp\u003e4 Zucchini (approximately 750g), halved lengthways\u003cbr/\u003e\n3 tbsp extra virgin olive oil\u003cbr/\u003e\n1 tbsp red wine vinegar\u003cbr/\u003e\n1 tsp dried oregano\u003cbr/\u003e\n3 sprigs fresh oregano, leaves picked\u003cbr/\u003e\nHandful of dill fronds, roughly torn\u003cbr/\u003e\nHandful of mint leaves, roughly torn\u003cbr/\u003e\n125g Greek feta, crumbled\u003cbr/\u003e\nSalt and pepper, to taste\u003c/p\u003e\n\u003cp\u003ePita, to serve\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMethod:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn a large bowl or container, place the chicken, olive oil, lemon, garlic and oregano. Season well with salt and massage into the chicken. Cover and allow to marinate in the fridge for 2 hours or ideally overnight.\u003c/p\u003e\n\u003cp\u003ePreheat the oven to 190C. Arrange the potatoes on the bottom of a roasting dish or tray and place the chicken, skin side up onto the potatoes. Drizzle everything with a little more olive oil, season the potatoes with salt and roast in the preheated oven for 50-55 minutes or until the chicken is cooked and the potatoes are golden. Remove the chicken from the tray to rest and if you want more colour on the potatoes, continue cooking the potatoes for a further 15 minutes.\u003c/p\u003e\n\u003cp\u003eMeanwhile, make the zucchini salad by coating the zucchini in 1 tbsp of the oil and grilling them until tender and nicely coloured. Cut the zucchini into 4cm pieces. Place the remaining oil and vinegar in a large bowl and whisk to combine. Add the zucchini and remaining ingredients and season to taste.\u003c/p\u003e\n\u003cp\u003eCut the chicken into 8 pieces and serve with the roast potatoes, zucchini salad and pita.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat else I’m cooking:\u003c/strong\u003e Zucchini flowers are so incredible right now and have recently been stuffing them with a mixture of rice, herbs, currants and pine nuts and cooking them in the oven with a fresh tomato sauce. So delicious.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat else I’m eating:\u003c/strong\u003e The vanilla and saffron buns from \u003ca href=\"https://www.instagram.com/breadclubofficial/?hl=en\" target=\"_blank\" rel=\"noopener\"\u003eBread Club\u003c/a\u003e. Warmed up at home, heaven!!\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
