{
  "id": "2ed82889-0f6a-49fe-bd44-f03e7d24eb98",
  "title": "This Melbourne Artist’s Paintings Are Filled With Childlike Wonder",
  "link": "https://thedesignfiles.wpenginepowered.com/2024/12/studio-visit-morgan-blue/",
  "description": "There’s a dream-like energy to Melbourne artist Morgan Blue’s psychedelic artworks. Her comforting and colourful canvases are filled with childhood motifs and curiosity, reflecting her unique worldview influenced by synaesthesia: the phenomenon where people experience sensory crossovers, like seeing colours in music. We visited her studio ahead of her new exhibition, Featherbed, which opens at Backwoods Gallery this weekend.",
  "author": "The Design Files",
  "published": "Wed, 11 Dec 2024 19:00:44 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2849,
  "excerpt": "Local artist Morgan Blue combines motifs from childhood and comforting colours in her personal new exhibition.",
  "siteName": "",
  "favicon": "",
  "text": "Making art is a personal act like writing a diary entry, and then hanging it on a wall for all to see. For Melbourne artist Morgan Blue, drawing or painting has always been a ‘personal refuge’. And her latest body of work is truly a window into her world. ‘I grew up in a very creative household with my parents exploring their artistic dreams through their respective fields in music and theatre,’ Morgan says. ‘It might sound strange, but I believe the sounds of my father playing Bach on the piano in the morning and my mother introducing me to the cadence of writers like Dylan Thomas really shaped the way I paint today.’ Her paintings are layered with nostalgia and memories. They reveal psychedelic motifs with animals and flowers dancing around the canvas, often drawing on her own childhood and her experience with synaesthesia — which informed what Morgan calls her ‘animistic’ view of the world. It also means she can find inspiration anywhere, from something as simple as a ‘bold blue sky’ to myths and images from ancient history. ‘I am constantly inspired by the experience of childhood, how our introduction to the world sits in our bodies and our hearts and how it is played out creatively (or suppressed) through the choices we make,’ Morgan says. In fact, while she studied a Bachelor of Fine Arts at RMIT, Morgan says most of her painting process is built on self-guided learning and interactions with art teachers throughout her lifetime —  and not being afraid to make mistakes. ‘Curiosity is how I continually learn my craft,’ she adds. ‘When I begin making work for a show, I spend a couple of weeks filling up a new sketchbook, taking time to sit with what is feeling most resonant for me in the moment and dreaming it all up on paper. My sketchbooks become this catalogue of symbols and phrases.’ Her new show, Featherbed at Backwoods Gallery in Collingwood, reflects her experimental approach. The exhibition features 17 new pieces made from a mix of acrylic and graphite on canvas, dotted with playful sketches in crayon or chalk. ‘I have been working on this show only for the past four months due to a big surgery I had earlier on in the year and a few extra deadlines which cut into my painting time — but miraculously it worked out!’ ‘The works are very much informed by the experience I had in hospital, exploring ideas of a benevolent and playful universe in the face of hardship. The title Featherbed originates from a quote by [American ethnobotanist] Terence McKenna, who postulates that nature rewards courage. And when one “throws themselves into the abyss of experience”, they discover it’s a featherbed.’ In short, it’s about feeling fear, and doing it anyway. Because as Morgan’s art proves, that’s where the magic happens! Featherbed by Morgan Blue opens at Backwoods Gallery this Friday December 13 at 6pm.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2024/12/MorganBlue-tdf-SV21-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eMaking art is a personal act like writing a diary entry, and then hanging it on a wall for all to see.\u003c/h3\u003e\n\u003cp\u003eFor Melbourne artist \u003ca href=\"https://www.mm-blue.com/\" target=\"_blank\" rel=\"noopener\"\u003eMorgan Blue\u003c/a\u003e, drawing or painting has always been a ‘personal refuge’. And her latest body of work is truly a window into her world.\u003c/p\u003e\n\u003cp\u003e‘I grew up in a very creative household with my parents exploring their artistic dreams through their respective fields in music and theatre,’ Morgan says.\u003c/p\u003e\n\u003cp\u003e‘It might sound strange, but I believe the sounds of my father playing Bach on the piano in the morning and my mother introducing me to the cadence of writers like Dylan Thomas really shaped the way I paint today.’\u003c/p\u003e\n\u003cp\u003eHer paintings are layered with nostalgia and memories. They reveal psychedelic motifs with animals and flowers dancing around the canvas, often drawing on her own childhood and her experience with synaesthesia — which informed what Morgan calls her ‘animistic’ view of the world.\u003c/p\u003e\n\u003cp\u003eIt also means she can find inspiration anywhere, from something as simple as a ‘bold blue sky’ to myths and images from ancient history.\u003c/p\u003e\n\u003cp\u003e‘I am constantly inspired by the experience of childhood, how our introduction to the world sits in our bodies and our hearts and how it is played out creatively (or suppressed) through the choices we make,’ Morgan says.\u003c/p\u003e\n\u003cp\u003eIn fact, while she studied a Bachelor of Fine Arts at RMIT, Morgan says most of her painting process is built on self-guided learning and interactions with art teachers throughout her lifetime —  and not being afraid to make mistakes. ‘Curiosity is how I continually learn my craft,’ she adds.\u003c/p\u003e\n\u003cp\u003e‘When I begin making work for a show, I spend a couple of weeks filling up a new sketchbook, taking time to sit with what is feeling most resonant for me in the moment and dreaming it all up on paper. My sketchbooks become this catalogue of symbols and phrases.’\u003c/p\u003e\n\u003cp\u003eHer new show, \u003cem\u003e\u003ca href=\"https://www.backwoods.gallery/2024-morgan-blue\" target=\"_blank\" rel=\"noopener\"\u003eFeatherbed\u003c/a\u003e \u003c/em\u003eat \u003ca href=\"https://www.backwoods.gallery/\" target=\"_blank\" rel=\"noopener\"\u003eBackwoods Gallery\u003c/a\u003e in Collingwood, reflects her experimental approach. The exhibition features 17 new pieces made from a mix of acrylic and graphite on canvas, dotted with playful sketches in crayon or chalk.\u003c/p\u003e\n\u003cp\u003e‘I have been working on this show only for the past four months due to a big surgery I had earlier on in the year and a few extra deadlines which cut into my painting time — but miraculously it worked out!’\u003c/p\u003e\n\u003cp\u003e‘The works are very much informed by the experience I had in hospital, exploring ideas of a benevolent and playful universe in the face of hardship. The title \u003cem\u003eFeatherbed\u003c/em\u003e originates from a \u003ca href=\"https://www.goodreads.com/quotes/355306-nature-loves-courage-you-make-the-commitment-and-nature-will\" target=\"_blank\" rel=\"noopener\"\u003equote by [American ethnobotanist] Terence McKenna\u003c/a\u003e, who postulates that nature rewards courage. And when one “throws themselves into the abyss of experience”, they discover it’s a featherbed.’\u003c/p\u003e\n\u003cp\u003eIn short, it’s about feeling fear, and doing it anyway. Because as Morgan’s art proves, that’s where the magic happens!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.backwoods.gallery/2024-morgan-blue\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003e\u003cstrong\u003eFeatherbed by Morgan Blue opens at Backwoods Gallery this Friday December 13 at 6pm.\u003c/strong\u003e\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
