{
  "id": "2fdd9dd6-0503-4507-9371-a9c43a090b6a",
  "title": "\"I wander into office lobbies wherever I go and it delivers no end of disappointment\"",
  "link": "https://www.dezeen.com/2024/12/03/lobbies-anthony-paletta-opinion/",
  "description": "Too many office-building lobbies are being turned into soulless spaces with the same Apple Store aesthetic, writes Anthony Paletta. Lobbies are all too easily lost lately. Roche-Dinkeloo's postmodern 60 Wall Street atrium in New York is gone. Helmut Jahn's Thompson Center atrium in Chicago will survive, but sheared of its harlequin colours to become a The post \"I wander into office lobbies wherever I go and it delivers no end of disappointment\" appeared first on Dezeen.",
  "author": "Anthony Paletta",
  "published": "Tue, 03 Dec 2024 10:00:10 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "all",
    "Architecture",
    "Interiors",
    "Opinion",
    "Office architecture",
    "Office interiors"
  ],
  "byline": "Anthony Paletta",
  "length": 11119,
  "excerpt": "Too many office building lobbies are being turned into soulless spaces with the same Apple Store aesthetic, writes Anthony Paletta.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Too many office-building lobbies are being turned into soulless spaces with the same Apple Store aesthetic, writes Anthony Paletta. Lobbies are all too easily lost lately. Roche-Dinkeloo's postmodern 60 Wall Street atrium in New York is gone. Helmut Jahn's Thompson Center atrium in Chicago will survive, but sheared of its harlequin colours to become a dutifully drab space for Google. Even more esteemed spaces are at routine risk: the exuberant mint art deco lobby of Raymond Hill's 1931 McGraw Hill building was carted off in 2021. Noguchi ceiling and wall installations were removed from 660 5th Avenue in 2020. The replacements are as monotonous as Netflix suggestions. Buildings will look real from the sidewalk but AI-generated once you go inside These egregious examples make the news; many others don't. I wander into office lobbies wherever I go and it is a habit that delivers no end of disappointment. The recurrent trouble is the sheer number of buildings that look like 1930 or 1960 or 1980 outside and then look like 2020 inside. Vague nods to the exterior style of the buildings can sometimes be found, but often even that minimal bar isn't cleared. It is frequently an uncanny experience – buildings will look real from the sidewalk but AI-generated once you go inside. This is partly a preservation problem; interior landmarking designations are bestowed far more parsimoniously than interior ones, in New York at least. Existing protections for the facades of McGraw Hill and 60 Wall Street were no help for their interiors. Not every lobby deserves the force of law to keep itself intact. Lobbies can – and do – benefit from refreshes. Some shifts by ownership about how these spaces should work are welcome. It's good that they are decreasingly antechambers where you will be judged witheringly and more often social spaces with seating and amenities. This is welcome for everyone, especially flaneurs like myself who never have any actual business to contract inside. The problem is that rarely do these makeovers merely add things – they tend to take out everything that isn't load-bearing. These spaces are constantly flayed down to their structural elements in the dubious thought that this will make them welcoming. They tend to emerge with exactly the same etiolated Apple Store aesthetic Does this result in a flowering of vibrant and varied new spaces? No. An overwhelming problem is that they tend to emerge with exactly the same etiolated Apple Store aesthetic. The palate is neutral, the accents are wood, and the results are overwhelmingly boring. This Invasion of the Lobby Snatchers keeps leaving us spaces for Airpod people. The logic of commercial lobby design is the same now as ever; it's the one place in a large building that everyone is sure to see. Most will encounter only one or a few other floors. It is the place to make an impression. Unfortunately, nearly everyone seems to have settled on making exactly the same impression. If you read professional advice on lobby design lately you encounter perennial buzzwords. \"Timeless finishes\" are uniformly encouraged, invariably, \"a neutral palette that is inspired by nature hues\". The trouble is that timeless almost always means right now, and that's soon as dated as whatever they're ripping out. 60 Wall Street's Egyptianate joys of marble tiles and granite-faced columns are gone, to be replaced by white surfaces, wooden accents, and a green wall. Promotional materials for the renovation say, \"This isn't your dad's Wall Street.\" Maybe your father was right about some things. Postmodernism has suffered particularly recently. Blue and salmon panels are out at the Thompson Center; red paint on the space frame is gone in renders. Fujikawa Johnson's CME Center in Chicago was renovated in 2019, with banded marble out and enormous windows, whites and greys in. Yugene Cha, an associate principal at Krueck + Sexton who worked on this project, explained in an Architectural Digest interview: \"It had this 9-to-5 formal office building feel, like you had to be wearing a suit and tie. It was a little bit overstated and imposing. The goal was to attract millennial talent to the offices, and they couldn't care less about that ideal.\" As we have seen in so many spheres lately, chasing the presumed taste of millennials results in TikTok-level trash. The frustration is that these anonymous lobbies so often fail to achieve their own goal The list goes on. Philip Johnson's Flemish-guildhall inspired atrium in the TC Energy Center in Houston was choked up with white mezzanines in 2018. The lobby of his Franklin Square in Washington DC was revamped in 2021. Limestone walls accented with black marble and red jasper and a coffered ceiling were out. White walls and enormous backlit glass panels were in. This is also called \"timeless\". You'll find such examples virtually everywhere: Roche-Dinkeloo's 1993 Bank of America lobby in Atlanta, once an appealing postmodern space, is now full of garage-door-like wooden slats. Pei Cobb Freed's U.S. Bank Tower in Los Angeles once had terrazzo; now it has wood accents, a green wall, and a wooden floor. You can avoid any association with Gordon Gecko and Patrick Bateman contrast collars and still face the knife. Ely Jacques Kahn's Garment Center lobby is white wood and glass. Carrere and Hastings' 1921 250 West 57th Street had a grand beaux-arts lobby not long ago; it now has a 76-foot video ceiling. It doesn't have to be this way. SOM's renovation of their own Lever House last year was superb. Amenities can also be added seamlessly; coffee is now available in Allison and Rible's California Edison building in Los Angeles and it didn't require turning the lobby into a Starbucks. Tasteful alterations that actually cohere with a building's aesthetic aren't impossible. MdeAS Architects' and Vocon Architects' renovation of Eero Saarinen's CBS building lobby last year is new and good. Norman Kelley found inspiration in Johnson's own work in buffing up his 190 South LaSalle Street lobby in Chicago. Pei Cobb Freed undid a faulty 1990s renovation of the lobby at Harrison and Abramovitz's 717 5th Avenue and left a Joseph Albers piece in a better situation than they found it. The frustration is that these anonymous lobbies so often fail to achieve their own goal – they are the reverse of successful branding. If you go into The Guardian Building in Detroit or 30 Rockefeller Plaza in New York or The Guaranty Building in Buffalo or any number of glorious spaces you'll never be uncertain as to where you are. Go into most recent lobby revamps and it'll be a strain to have any idea. Anthony Paletta is an architecture journalist based in New York City. His writing has appeared in The Wall Street Journal, The Guardian, Bloomberg CityLab, The Architect's Newspaper and Metropolis, among others. The photo is by Yann Maignan via Unsplash. Dezeen In DepthIf you enjoy reading Dezeen's interviews, opinions and features, subscribe to Dezeen In Depth. Sent on the last Friday of each month, this newsletter provides a single place to read about the design and architecture stories behind the headlines. Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/11/office-lobby-hero_dezeen_2364_col_0-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2139593\" data-article-id=\"2139593\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/office-lobby-hero_dezeen_2364_col_0.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/11/office-lobby-hero_dezeen_2364_col_0-852x479.jpg\" alt=\"Office lobby with wood and neutral tones\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/11/office-lobby-hero_dezeen_2364_col_0-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/11/office-lobby-hero_dezeen_2364_col_0-1704x959.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eToo many \u003ca href=\"https://www.dezeen.com/tag/office-interiors/\"\u003eoffice\u003c/a\u003e-building lobbies are being turned into soulless spaces with the same \u003ca href=\"https://www.dezeen.com/tag/apple-stores/\"\u003eApple Store\u003c/a\u003e aesthetic, writes Anthony Paletta.\u003cspan id=\"more-2139593\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\u003cp\u003e\u003cstrong\u003eLobbies are all too easily lost lately.\u003c/strong\u003e Roche-Dinkeloo\u0026#39;s postmodern 60 Wall Street atrium in New York is gone. Helmut Jahn\u0026#39;s \u003ca href=\"https://www.dezeen.com/tag/james-r-thompson-center/\"\u003eThompson Center\u003c/a\u003e atrium in Chicago will survive, but sheared of its harlequin colours to become a dutifully drab space for Google.\u003c/p\u003e\n\u003cp\u003eEven more esteemed spaces are at routine risk: the exuberant mint art deco lobby of Raymond Hill\u0026#39;s 1931 McGraw Hill building was carted off in 2021. \u003ca href=\"https://www.dezeen.com/tag/isamu-noguchi/\"\u003eNoguchi\u003c/a\u003e ceiling and wall installations were removed from 660 5th Avenue in 2020. The replacements are as monotonous as Netflix suggestions.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eBuildings will look real from the sidewalk but AI-generated once you go inside\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eThese egregious examples make the news; many others don\u0026#39;t. I wander into office lobbies wherever I go and it is a habit that delivers no end of disappointment. The recurrent trouble is the sheer number of buildings that look like 1930 or 1960 or 1980 outside and then look like 2020 inside.\u003c/p\u003e\n\n\n\u003cp\u003eVague nods to the exterior style of the buildings can sometimes be found, but often even that minimal bar isn\u0026#39;t cleared. It is frequently an uncanny experience – buildings will look real from the sidewalk but AI-generated once you go inside.\u003c/p\u003e\n\u003cp\u003eThis is partly a preservation problem; interior landmarking designations are bestowed far more parsimoniously than interior ones, in New York at least. Existing protections for the facades of McGraw Hill and 60 Wall Street were no help for their interiors.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eNot every lobby deserves the force of law to keep itself intact. Lobbies can – and do – benefit from refreshes.\u003c/p\u003e\n\u003cp\u003eSome shifts by ownership about how these spaces should work are welcome. It\u0026#39;s good that they are decreasingly antechambers where you will be judged witheringly and more often social spaces with seating and amenities. This is welcome for everyone, especially flaneurs like myself who never have any actual business to contract inside.\u003c/p\u003e\n\u003cp\u003eThe problem is that rarely do these makeovers merely add things – they tend to take out everything that isn\u0026#39;t load-bearing. These spaces are constantly flayed down to their structural elements in the dubious thought that this will make them welcoming.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eThey tend to emerge with exactly the same etiolated Apple Store aesthetic\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eDoes this result in a flowering of vibrant and varied new spaces? No. An overwhelming problem is that they tend to emerge with exactly the same etiolated Apple Store aesthetic. The palate is neutral, the accents are wood, and the results are overwhelmingly boring. This Invasion of the Lobby Snatchers keeps leaving us spaces for Airpod people.\u003c/p\u003e\n\u003cp\u003eThe logic of commercial lobby design is the same now as ever; it\u0026#39;s the one place in a large building that everyone is sure to see. Most will encounter only one or a few other floors. It is the place to make an impression. Unfortunately, nearly everyone seems to have settled on making exactly the same impression.\u003c/p\u003e\n\u003cp\u003eIf you read professional advice on lobby design lately you encounter perennial buzzwords. \u0026#34;Timeless finishes\u0026#34; are uniformly encouraged, invariably, \u003ca href=\"https://aocontractors.com/three-commercial-lobby-features-that-attract-tenants/\"\u003e\u0026#34;a neutral palette that is inspired by nature hues\u0026#34;\u003c/a\u003e. The trouble is that timeless almost always means right now, and that\u0026#39;s soon as dated as whatever they\u0026#39;re ripping out.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003e60 Wall Street\u0026#39;s Egyptianate joys of marble tiles and granite-faced columns \u003ca href=\"https://www.archpaper.com/2023/08/alexandra-lange-robert-am-stern-docomomo-preservation-futures-60-wall-street-lobby/\"\u003eare gone\u003c/a\u003e, to be replaced by white surfaces, wooden accents, and a green wall. Promotional materials for the renovation say, \u0026#34;This isn\u0026#39;t your dad\u0026#39;s Wall Street.\u0026#34; Maybe your father was right about some things.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/tag/postmodernism/\"\u003ePostmodernism\u003c/a\u003e has suffered particularly recently. Blue and salmon panels are out at the Thompson Center; red paint on the space frame is gone in renders. Fujikawa Johnson\u0026#39;s CME Center in Chicago was renovated in 2019, with banded marble out and enormous windows, whites and greys in.\u003c/p\u003e\n\u003cp\u003eYugene Cha, an associate principal at \u003ca href=\"https://www.dezeen.com/tag/krueck-sexton/\"\u003eKrueck + Sexton\u003c/a\u003e who worked on this project, explained \u003ca href=\"https://www.architecturaldigest.com/story/chicagos-cme-center-unveils-its-ambitious-lobby-transformation\"\u003ein an Architectural Digest interview\u003c/a\u003e: \u0026#34;It had this 9-to-5 formal office building feel, like you had to be wearing a suit and tie. It was a little bit overstated and imposing. The goal was to attract millennial talent to the offices, and they couldn\u0026#39;t care less about that ideal.\u0026#34; As we have seen in so many spheres lately, chasing the presumed taste of millennials results in TikTok-level trash.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eThe frustration is that these anonymous lobbies so often fail to achieve their own goal\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eThe list goes on. \u003ca href=\"https://www.dezeen.com/tag/philip-johnson/\"\u003ePhilip Johnson\u003c/a\u003e\u0026#39;s Flemish-guildhall inspired atrium in the TC Energy Center in Houston was choked up with white mezzanines in 2018. The lobby of his Franklin Square in Washington DC was revamped in 2021. Limestone walls accented with black marble and red jasper and a coffered ceiling were out. White walls and enormous backlit glass panels were in. This is \u003ca href=\"https://hickokcole.com/project/franklin-square/\"\u003ealso called \u0026#34;timeless\u0026#34;\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eYou\u0026#39;ll find such examples virtually everywhere: Roche-Dinkeloo\u0026#39;s 1993 Bank of America lobby in Atlanta, once an appealing postmodern space, is \u003ca href=\"https://atlanta.urbanize.city/post/bank-of-america-plaza-project-renovation-images-tallest-skyscraper-atl\"\u003enow full of garage-door-like wooden slats\u003c/a\u003e. Pei Cobb Freed\u0026#39;s U.S. Bank Tower in Los Angeles once had terrazzo; \u003ca href=\"https://la.urbanize.city/post/silverstein-completes-60m-renovation-us-bank-tower\"\u003enow it has wood accents\u003c/a\u003e, a green wall, and a wooden floor.\u003c/p\u003e\n\u003cp\u003eYou can avoid any association with Gordon Gecko and Patrick Bateman contrast collars and still face the knife. Ely Jacques Kahn\u0026#39;s Garment Center lobby is white wood and glass. Carrere and Hastings\u0026#39; 1921 250 West 57th Street had a grand beaux-arts lobby not long ago; it now has \u003ca href=\"https://commercialobserver.com/2017/11/the-plan-a-look-at-esrts-76-foot-video-ceiling-at-250-west-57th-street/\"\u003ea 76-foot video ceiling\u003c/a\u003e.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eIt doesn\u0026#39;t have to be this way. \u003ca href=\"https://www.dezeen.com/2023/11/17/som-redevelopment-new-yorks-historic-lever-house/\"\u003eSOM\u0026#39;s renovation of their own Lever House last year\u003c/a\u003e was superb. Amenities can also be added seamlessly; coffee is now available in Allison and Rible\u0026#39;s California Edison building in Los Angeles and it didn\u0026#39;t require turning the lobby into a Starbucks.\u003c/p\u003e\n\u003cp\u003eTasteful alterations that actually cohere with a building\u0026#39;s aesthetic aren\u0026#39;t impossible. \u003ca href=\"https://www.dezeen.com/2024/04/30/eero-saarinens-block-rock-skyscraper-refurbished-new-york/\"\u003eMdeAS Architects\u0026#39; and Vocon Architects\u0026#39; renovation of Eero Saarinen\u0026#39;s CBS building lobby last year\u003c/a\u003e is new and good. Norman Kelley found inspiration in Johnson\u0026#39;s own work in \u003ca href=\"https://www.dezeen.com/2022/06/01/norman-kelley-lobby-postmodern-chicago-tower/\"\u003ebuffing up his 190 South LaSalle Street lobby in Chicago\u003c/a\u003e. Pei Cobb Freed undid a faulty 1990s renovation of the lobby at Harrison and Abramovitz\u0026#39;s 717 5th Avenue and left a Joseph Albers piece in a better situation than they found it.\u003c/p\u003e\n\u003cp\u003eThe frustration is that these anonymous lobbies so often fail to achieve their own goal – they are the reverse of successful branding. If you go into \u003ca href=\"https://www.guardianbuilding.com/\"\u003eThe Guardian Building\u003c/a\u003e in Detroit or \u003ca href=\"https://www.rockefellercenter.com/leasing/30-rockefeller-plaza/\"\u003e30 Rockefeller Plaza\u003c/a\u003e in New York or \u003ca href=\"https://archeyes.com/louis-sullivans-masterpiece-the-guaranty-building/\"\u003eThe Guaranty Building in Buffalo\u003c/a\u003e or any number of glorious spaces you\u0026#39;ll never be uncertain as to where you are. Go into most recent lobby revamps and it\u0026#39;ll be a strain to have any idea.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAnthony Paletta is an architecture journalist based in New York City. His writing has appeared in \u003c/em\u003e\u003cem\u003eThe Wall Street Journal, The Guardian, Bloomberg CityLab, The Architect\u0026#39;s Newspaper and Metropolis, among others.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photo is by \u003ca href=\"https://unsplash.com/@paris_interieurs\"\u003eYann Maignan\u003c/a\u003e via Unsplash.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eDezeen In Depth\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003eIf you enjoy reading Dezeen\u0026#39;s interviews, opinions and features, \u003ca href=\"https://www.dezeen.com/dezeenindepth/\"\u003esubscribe to Dezeen In Depth\u003c/a\u003e. Sent on the last Friday of each month, this newsletter provides a single place to read about the design and architecture stories behind the headlines.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#0373716a7562607a4367667966666d2d606c6e\"\u003e\u003cspan data-cfemail=\"d5a5a7bca3b4b6ac95b1b0afb0b0bbfbb6bab8\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-12-03T10:00:10Z",
  "modifiedTime": "2024-12-03T10:15:05Z"
}
