{
  "id": "3ba74934-efbc-4d67-ad26-096da5bebfeb",
  "title": "Studio Shoo combines \"various material textures\" for Armenian homeware boutique",
  "link": "https://www.dezeen.com/2025/02/05/studio-shoo-armenian-homeware-boutique/",
  "description": "Interior design practice Studio Shoo has completed a store in Yerevan, Armenia, blending sculptural elements, chrome furniture and bright accents. The Milan-based studio transformed the retail space into a calm store for Estil.io, which was consistent with the brand's identity. The 144-square-metre (1550-square-foot) retail space, selling homeware, coffee table books and art objects, was designed The post Studio Shoo combines \"various material textures\" for Armenian homeware boutique appeared first on Dezeen.",
  "author": "Charlie Bird",
  "published": "Wed, 05 Feb 2025 10:30:05 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "Retail",
    "all",
    "Interiors"
  ],
  "byline": "Charlie Bird",
  "length": 7166,
  "excerpt": "Studio Shoo has completed a store in Yerevan, Armenia, blending sculptural elements, chrome furniture and bright accents.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Interior design practice Studio Shoo has completed a store in Yerevan, Armenia, blending sculptural elements, chrome furniture and bright accents. The Milan-based studio transformed the retail space into a calm store for Estil.io, which was consistent with the brand's identity. Blue upholstered seats provide seating for customersThe 144-square-metre (1550-square-foot) retail space, selling homeware, coffee table books and art objects, was designed to feel comfortable and inviting, providing space for visitors to relax in. The store includes tables of varying heights, shapes and colours that were designed to give flexibility when showcasing products. White walls provide a neutral backdrop for the store's product rangeWhite walls and brown shelves with smooth contouring provide a neutral backdrop for the store's vivid products, emphasising their individuality and echoing Estil.io's philosophy of naturalness. \"Our key objective was to design a background for the displayed items that would not contradict, but rather emphasise, the products' distinctiveness,\" Studio Shoo founder Shushana Khachatrian told Dezeen. \"Tones of warm white were chosen as the project's primary hues, and the emphasis was turned to the diversity and blend of various material textures.\" Smooth plaster walls are blended with a raw concrete floorThe interiors contrast texture and materials, balancing raw concrete floors with smooth plaster walls and Estil.io's signature hues of cobalt blue and red as bright accent colours. A large modular counter has a single blue leg, while the upholstery of the seats and tabletop in the lounge area are painted brick red and cobalt blue. \"We focused on tactile materials to make the customer's engagement with the store more compelling and enjoyable,\" Khachatrian said. \"After eliminating the excessive use of colour, we opted to zone the area and accent essential elements using textures. This ensures that the product variety does not fade into the background, but rather stands out.\" Large metal ribbon twists down from ceiling to floorThe reception desk forms the centrepiece of the store, featuring a large, undulating metal strip, or ribbon, that twists down from the ceiling to the floor. Visible from both the entrance and the windows, the strip supports the circular walls and shelves. \"We picked stainless steel to make the twisting bar because of its effective interaction with the interior's surrounding space,\" explained Shushana Khachatrian. \"The bar's smooth, twisted style conveys a sense of lightness, as if it weighs nearly nothing and is in motion.\" Studio Shoo intended to create a calming and relaxing interiorThe reception desk also includes a bar where visitors can order refreshments. To the left of the bar area, there is a seating area with a coffee table, armchairs and a sofa. Bold resin and stainless steel coffee tables feature in the seating areaAll interiors in Estil.io, including shelving, exhibit stands, reception, sofas and tables were custom made by local Armenian artisans. Other retail spaces recently featured on Dezeen include London's Koibird store and a Mumbai boutique designed by Sanjay Puri Architects. The photography is by Katie Kutuzova Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2025/01/Untitled-design-14-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2165491\" data-article-id=\"2165491\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/Untitled-design-14-scaled.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2025/01/Untitled-design-14-852x479.jpg\" alt=\"store interior\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2025/01/Untitled-design-14-852x479.jpg 1x, https://static.dezeen.com/uploads/2025/01/Untitled-design-14-1704x959.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eInterior design practice Studio Shoo has completed a \u003ca href=\"https://www.dezeen.com/tag/retail-tag/\"\u003estore\u003c/a\u003e in Yerevan, Armenia, blending sculptural elements, chrome \u003ca href=\"https://www.dezeen.com/tag/furniture/\"\u003efurniture\u003c/a\u003e and bright accents.\u003cspan id=\"more-2165491\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe \u003ca href=\"https://www.dezeen.com/tag/milan/\"\u003eMilan\u003c/a\u003e-based studio transformed the retail space into a calm store for \u003ca href=\"https://estil.io/en/\"\u003eEstil.io\u003c/a\u003e, which was consistent with the brand\u0026#39;s identity.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2165506\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_6-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_6-852x1278.jpg\" alt=\"seating area \" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_6-852x1278.jpg 1x, https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_6-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2165506\"\u003eBlue upholstered seats provide seating for customers\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe 144-square-metre (1550-square-foot) retail space, selling homeware, coffee table books and art objects, was designed to feel comfortable and inviting, providing space for visitors to relax in.\u003c/p\u003e\n\u003cp\u003eThe store includes tables of varying heights, shapes and colours that were designed to give flexibility when showcasing products.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2165510\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_11-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_11-852x1278.jpg\" alt=\"product shelves\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_11-852x1278.jpg 1x, https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_11-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2165510\"\u003eWhite walls provide a neutral backdrop for the store\u0026#39;s product range\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eWhite walls and brown shelves with smooth contouring provide a neutral backdrop for the store\u0026#39;s vivid products, emphasising their individuality and echoing Estil.io\u0026#39;s philosophy of naturalness.\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;Our key objective was to design a background for the displayed items that would not contradict, but rather emphasise, the products\u0026#39; distinctiveness,\u0026#34; \u003ca href=\"https://studioshoo.com/\"\u003eStudio Shoo\u003c/a\u003e founder Shushana Khachatrian told Dezeen. \u0026#34;Tones of warm white were chosen as the project\u0026#39;s primary hues, and the emphasis was turned to the diversity and blend of various material textures.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2165511\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_14.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_14-852x568.jpg\" alt=\"plaster walls\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_14-852x568.jpg 1x, https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_14-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2165511\"\u003eSmooth plaster walls are blended with a raw concrete floor\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe \u003ca href=\"https://www.dezeen.com/interiors/\"\u003einteriors\u003c/a\u003e contrast texture and materials, balancing raw \u003ca href=\"https://www.dezeen.com/tag/concrete/\"\u003econcrete\u003c/a\u003e floors with smooth plaster walls and Estil.io\u0026#39;s signature hues of cobalt blue and red as bright accent colours.\u003c/p\u003e\n\u003cp\u003eA large modular counter has a single blue leg, while the upholstery of the seats and tabletop in the lounge area are painted brick red and cobalt blue.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003e\u0026#34;We focused on tactile materials to make the customer\u0026#39;s engagement with the store more compelling and enjoyable,\u0026#34; Khachatrian said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;After eliminating the excessive use of colour, we opted to zone the area and accent essential elements using textures. This ensures that the product variety does not fade into the background, but rather stands out.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2165517\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_20-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_20-852x1278.jpg\" alt=\"bar area\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_20-852x1278.jpg 1x, https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_20-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2165517\"\u003eLarge metal ribbon twists down from ceiling to floor\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe reception desk forms the centrepiece of the store, featuring a large, undulating metal strip, or ribbon, that twists down from the ceiling to the floor. Visible from both the entrance and the windows, the strip supports the circular walls and shelves.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We picked \u003ca href=\"https://www.dezeen.com/tag/stainless-steel/\"\u003estainless steel\u003c/a\u003e to make the twisting bar because of its effective interaction with the interior\u0026#39;s surrounding space,\u0026#34; explained Shushana Khachatrian. \u0026#34;The bar\u0026#39;s smooth, twisted style conveys a sense of lightness, as if it weighs nearly nothing and is in motion.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2165504\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_3-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_3-852x1278.jpg\" alt=\"bar area\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_3-852x1278.jpg 1x, https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_3-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2165504\"\u003eStudio Shoo intended to create a calming and relaxing interior\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe reception desk also includes a \u003ca href=\"https://www.dezeen.com/tag/bar/\"\u003ebar\u003c/a\u003e where visitors can order refreshments.\u003c/p\u003e\n\u003cp\u003eTo the left of the bar area, there is a seating area with a coffee table, armchairs and a sofa.\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2165575\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_8-1-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_8-1-852x1278.jpg\" alt=\"seating area \" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_8-1-852x1278.jpg 1x, https://static.dezeen.com/uploads/2025/01/estilio-studio-shoo-flagship-yerevan-armenia-interiors_dezeen_2364_col_8-1-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2165575\"\u003eBold resin and stainless steel coffee tables feature in the seating area\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eAll interiors in Estil.io, including shelving, exhibit stands, reception, sofas and tables were custom made by local Armenian artisans.\u003c/p\u003e\n\u003cp\u003eOther retail spaces recently featured on Dezeen include \u003ca href=\"https://www.dezeen.com/2025/01/13/uchronia-koibird-london-colourful-revamp/\"\u003eLondon\u0026#39;s Koibird store\u003c/a\u003e and a \u003ca href=\"https://www.dezeen.com/2025/01/07/sanjay-puri-architects-nezo-showroom-mumbai/\"\u003eMumbai boutique designed by Sanjay Puri Architect\u003c/a\u003es.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cspan\u003eThe photography is by \u003ca href=\"https://www.instagram.com/katie.kutuzova/\"\u003eKatie Kutuzova\u003c/a\u003e\u003c/span\u003e\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#bececcd7c8dfddc7fedadbc4dbdbd090ddd1d3\"\u003e\u003cspan data-cfemail=\"eb9b99829d8a8892ab8f8e918e8e85c5888486\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-02-05T10:30:05Z",
  "modifiedTime": "2025-02-05T10:43:40Z"
}
