{
  "id": "700fb749-060f-4467-bc6f-40e9bb53b5ea",
  "title": "For Sale: An Architectural Family Haven In Brunswick",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/03/on-the-market-63-donald-street-brunswick-nelson-alexander/",
  "description": "With the help of Melbourne-based architects Mihaly Slocombe, the owners of this early-1900s double-fronted Brunswick terrace have transformed it into an open, light-filled home that pays homage to its past. Now, it’s on the market for someone else to enjoy its northern aspect, warm brick-lined interior and open-plan living. See more below!",
  "author": "The Design Files",
  "published": "Fri, 14 Mar 2025 19:00:19 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 1656,
  "excerpt": "This four-bedroom Brunswick terrace has managed to maintain its period charm alongside a contemporary re-build designed by Mihaly Slocombe.",
  "siteName": "",
  "favicon": "",
  "text": "This early-1900s double-fronted Brunswick terrace had all the makings of a perfect property when it was purchased in 2021; great street, northern aspect, decent land size and solid charm. The property ‘ticked all boxes’ for its current owners, who were looking for a character-filled period home they could renovate and update. They engaged Melbourne-based architects Mihaly Slocombe to design a complete renovation and re-build, retaining only the facade and part of the roof structure. The four-bedroom home is now perfectly designed for indoor-outdoor flow, with an internal courtyard and pockets of greenery woven into the design. From the front, the period charm is retained with green stained-glass windows and a pink and brown checkerboard-tiled porch hinting at the design choices within. As you move through the house, the living, dining and kitchen spaces open out, lined in warm red brick as a nod to the former brickworks in the area. Two living spaces are separated by a fernery and the kitchen, which extends out to a brick patio and the garden beyond. The colour palette is warm and rustic with striking cool accents from the stainless steel kitchen and dining pendant light. Pops of colour can be found in the ensuite and main bathroom where bold cabinetry in pink and burgundy, respectively, also hark back to Brunswick’s brickworks past. The charming home, just listed for sale, has been thoughtfully renovated and brought into a new century, whilst managing to maintain its roots. 63 Donald Street, Brunswick, is listed with Charlie Barham and Angus McPherson from Nelson Alexander and will go to auction at 12pm AEDT, Saturday March 29.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/03/63DonaldSt-tdf-otm6-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eThis early-1900s \u003ca href=\"https://www.nelsonalexander.com.au/property/1647455/63-donald-street-brunswick-vic-3056/\" target=\"_blank\" rel=\"noopener\"\u003edouble-fronted Brunswick terrace\u003c/a\u003e had all the makings of a perfect property when it was purchased in 2021; great street, northern aspect, decent land size and solid charm.\u003c/h3\u003e\n\u003cp\u003eThe property ‘ticked all boxes’ for its current owners, who were looking for a character-filled period home they could renovate and update.\u003c/p\u003e\n\u003cp\u003eThey engaged Melbourne-based architects \u003ca href=\"https://mihalyslocombe.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eM\u003c/a\u003e\u003ca href=\"https://mihalyslocombe.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eihaly Slocombe\u003c/a\u003e to design a complete renovation and re-build, retaining only the facade and part of the roof structure.\u003c/p\u003e\n\u003cp\u003eThe four-bedroom home is now perfectly designed for indoor-outdoor flow, with an internal courtyard and pockets of greenery woven into the design.\u003c/p\u003e\n\u003cp\u003eFrom the front, the period charm is retained with green stained-glass windows and a pink and brown checkerboard-tiled porch hinting at the design choices within.\u003c/p\u003e\n\u003cp\u003eAs you move through the house, the living, dining and kitchen spaces open out, lined in warm red brick as a nod to the former brickworks in the area. Two living spaces are separated by a fernery and the kitchen, which extends out to a brick patio and the garden beyond.\u003c/p\u003e\n\u003cp\u003eThe colour palette is warm and rustic with striking cool accents from the stainless steel kitchen and dining pendant light.\u003c/p\u003e\n\u003cp\u003ePops of colour can be found in the ensuite and main bathroom where bold cabinetry in pink and burgundy, respectively, also hark back to Brunswick’s brickworks past.\u003c/p\u003e\n\u003cp\u003eThe charming home, just listed for sale, has been thoughtfully renovated and brought into a new century, whilst managing to maintain its roots.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003e\u003ca href=\"https://www.nelsonalexander.com.au/property/1647455/63-donald-street-brunswick-vic-3056/\" target=\"_blank\" rel=\"noopener\"\u003e63 Donald Street, Brunswick\u003c/a\u003e, is listed with \u003ca href=\"https://www.nelsonalexander.com.au/real-estate-agents/charlie-barham/50/\" target=\"_blank\" rel=\"noopener\"\u003eCharlie Barham\u003c/a\u003e and \u003ca href=\"https://www.nelsonalexander.com.au/real-estate-agents/angus-mcpherson/572/\" target=\"_blank\" rel=\"noopener\"\u003eAngus McPherson\u003c/a\u003e from \u003ca href=\"https://www.nelsonalexander.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eNelson Alexander\u003c/a\u003e and will go to auction at 12pm AEDT, Saturday March 29.\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
