{
  "id": "8be58657-d0e2-4eec-b7b5-2104c770e5cb",
  "title": "Industrial Design Case Study: The PureTorque Training Aid",
  "link": "https://www.core77.com/posts/134415/Industrial-Design-Case-Study-The-PureTorque-Training-Aid",
  "description": "\"An elite physical trainer came to us with a prototype of what would become the PureTorque, a scientifically proven tool for more effectively targeting the muscles in your torso,\" writes industrial design firm The Metcalfe Group. \"We were able to refine his original idea to create something that was light, easy to use, strong, visually compelling, and, most importantly, incredibly effective.\" Early prototypes removed mass from the inventor's prototype and focused how the device should be held and contact the body. This prototype sought to replicate the final materials for the pads and was adjustable to make sure we got the size, shape, and ergonomics just right. Once this was approved through testing with users, we 3D scanned the prototype for use in the next phase. Once the function and ergonomics were worked out, we created concepts to explore aesthetics and manufacturing methods. These started with hand sketches then were developed further in CAD iterations. In order to keep the device as light as possible while ensuring it was robust enough to handle the toughest workouts from professional athletes, we ran numerous finite element analysis (FEA) simulations that tested its strength digitally. This allowed us to iterate quickly and fix any potential trouble spots before moving to more expensive and time intensive CNC prototypes and production tooling. EMG testing (used to measure muscle activity) was done using a CNC machined prototype to measure the PureTorque's effectiveness. These scientific tests showed a 40%-75% increase in utilization of core muscle groups, leading to a more effective workout. After the design was thoroughly vetted, we moved to production using die-cast aluminum. The Metcalfe Group was relied on to take the product all the way from sketches and rough prototypes through manufacturing sourcing.Tyreek Hill, one of the fastest players in NFL, endorsed the product, saying \"The very first moment I used PureTorque I thought, 'Damn, this thing is different.' I have been hooked ever since.\" You can see more of The Metcalfe Group's work here.",
  "author": "Rain Noe",
  "published": "",
  "source": "http://feeds.feedburner.com/core77/blog",
  "categories": [
    "Design Business|Design-Business"
  ],
  "byline": "",
  "length": 2463,
  "excerpt": "\"An elite physical trainer came to us with a prototype of what would become the PureTorque, a scientifically proven tool for more effectively targeting the muscles in your torso,\" writes industrial design firm The Metcalfe Group. \"We were able to refine his original idea to create something that was light,",
  "siteName": "Core77",
  "favicon": "https://static.core77.com/images/favicons/favicon-192x192.png",
  "text": "Industrial Design Case Study: The PureTorque Training Aid By industrial design firm The Metcalfe Group \"An elite physical trainer came to us with a prototype of what would become the PureTorque, a scientifically proven tool for more effectively targeting the muscles in your torso,\" writes industrial design firm The Metcalfe Group. \"We were able to refine his original idea to create something that was light, easy to use, strong, visually compelling, and, most importantly, incredibly effective.\" Early prototypes removed mass from the inventor's prototype and focused how the device should be held and contact the body. This prototype sought to replicate the final materials for the pads and was adjustable to make sure we got the size, shape, and ergonomics just right. Once this was approved through testing with users, we 3D scanned the prototype for use in the next phase. Once the function and ergonomics were worked out, we created concepts to explore aesthetics and manufacturing methods. These started with hand sketches then were developed further in CAD iterations. In order to keep the device as light as possible while ensuring it was robust enough to handle the toughest workouts from professional athletes, we ran numerous finite element analysis (FEA) simulations that tested its strength digitally. This allowed us to iterate quickly and fix any potential trouble spots before moving to more expensive and time intensive CNC prototypes and production tooling. EMG testing (used to measure muscle activity) was done using a CNC machined prototype to measure the PureTorque's effectiveness. These scientific tests showed a 40%-75% increase in utilization of core muscle groups, leading to a more effective workout. After the design was thoroughly vetted, we moved to production using die-cast aluminum. The Metcalfe Group was relied on to take the product all the way from sketches and rough prototypes through manufacturing sourcing.Tyreek Hill, one of the fastest players in NFL, endorsed the product, saying \"The very first moment I used PureTorque I thought, 'Damn, this thing is different.' I have been hooked ever since.\" You can see more of The Metcalfe Group's work here. Favorite This Comment",
  "image": "https://s3files.core77.com/blog/images/lead_n_spotlight/1599796_lead_400_134415_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \n    \u003cdiv id=\"post_header\"\u003e\n        \n\n            \u003cul\u003e\n                \n\n\n                            \u003c/ul\u003e\n        \n\n            \u003ch2\u003eIndustrial Design Case Study: The PureTorque Training Aid \u003c/h2\u003e\n                    \u003ch2\u003eBy industrial design firm The Metcalfe Group\u003c/h2\u003e\n                    \n\n        \n    \u003c/div\u003e\n\n    \n\n\n\n\n            \u003csection id=\"post\"\u003e\n\n\n\n\n\u003cp id=\"170036_1259\" data-ic-marker=\"842cbb_3554\"\u003e\u0026#34;An elite physical trainer came to us with a prototype of what would become the PureTorque, a scientifically proven tool for more effectively targeting the muscles in your torso,\u0026#34; writes industrial design firm \u003ca href=\"https://www.metcalfegroup.com/\" rel=\"\"\u003eThe Metcalfe Group\u003c/a\u003e. \u0026#34;We were able to refine his original idea to create something that was light, easy to use, strong, visually compelling, and, most importantly, incredibly effective.\u0026#34;\u003c/p\u003e\u003cp id=\"c92611_4401\" data-ic-marker=\"a42b24_806\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1599798_81_134415_K7XUp7Og4.jpg\"/\u003e \u003c/p\u003e\u003cblockquote id=\"c7044e_4976_c\"\u003eEarly prototypes removed mass from the inventor\u0026#39;s prototype and focused how the device should be held and contact the body. This prototype sought to replicate the final materials for the pads and was adjustable to make sure we got the size, shape, and ergonomics just right. Once this was approved through testing with users, we 3D scanned the prototype for use in the next phase.\u003c/blockquote\u003e\u003cp id=\"d38b1f_940\" data-ic-marker=\"224eea_882\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1599808_81_134415_xAQyWayYE.gif\"/\u003e \u003c/p\u003e\u003cblockquote id=\"cc51dc_2423_c\"\u003eOnce the function and ergonomics were worked out, we created concepts to explore aesthetics and manufacturing methods. These started with hand sketches then were developed further in CAD iterations.\u003c/blockquote\u003e\u003cp id=\"dc82b6_2766\" data-ic-marker=\"7819e6_3186\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1599799_81_134415_n9JxJhLyj.jpg\"/\u003e \u003c/p\u003e\u003cblockquote id=\"38a919_2260_c\"\u003eIn order to keep the device as light as possible while ensuring it was robust enough to handle the toughest workouts from professional athletes, we ran numerous finite element analysis (FEA) simulations that tested its strength digitally. This allowed us to iterate quickly and fix any potential trouble spots before moving to more expensive and time intensive CNC prototypes and production tooling.\u003c/blockquote\u003e\u003cp id=\"4d040b_5746\" data-ic-marker=\"b3eb21_3651\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1599803_81_134415_8G4mqz90x.jpg\"/\u003e \u003c/p\u003e\u003cblockquote id=\"c093dc_841_c\"\u003eEMG testing (used to measure muscle activity) was done using a CNC machined prototype to measure the PureTorque\u0026#39;s effectiveness. These scientific tests showed a 40%-75% increase in utilization of core muscle groups, leading to a more effective workout. After the design was thoroughly vetted, we moved to production using die-cast aluminum.\u003c/blockquote\u003e\u003cp id=\"50b2c8_2311\" data-ic-marker=\"5e0723_3835\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1599804_81_134415_4WYteeMj5.jpg\"/\u003e \u003c/p\u003e\u003cblockquote id=\"b4191_2270_c\"\u003eThe Metcalfe Group was relied on to take the product all the way from sketches and rough prototypes through manufacturing sourcing.\u003cbr/\u003e\u003c/blockquote\u003e\u003cblockquote id=\"7a3ab7_7972\"\u003eTyreek Hill, one of the fastest players in NFL, endorsed the product, saying \u0026#34;\u003ci\u003eThe very first moment I used PureTorque I thought, \u0026#39;Damn, this thing is different.\u0026#39; I have been hooked ever since.\u003c/i\u003e\u0026#34;\u003c/blockquote\u003e\u003cp id=\"3b4621_229\" data-ic-marker=\"4e17a6_958\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1599801_81_134415_MX5sUxgju.jpg\"/\u003e \u003c/p\u003e\u003cp id=\"66477d_9059\" data-ic-marker=\"c29878_718\"\u003eYou can see more of The Metcalfe Group\u0026#39;s work \u003ca href=\"https://www.metcalfegroup.com/\" rel=\"\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\n            \u003c/section\u003e\n\n                \n\n\n                \n\n\n\u003cdiv\u003e\n    \u003cul\u003e\n        \u003cli data-this-post-id=\"134415\" data-this-author-id=\"0\"\u003e\n            \n            \n            \u003cp\u003eFavorite This\u003c/p\u003e\n        \u003c/li\u003e\n       \u003cli data-this-post-title=\"Industrial Design Case Study: The PureTorque Training Aid \" data-this-post-id=\"134415\" data-this-author-id=\"0\"\u003e\n            \n            \n            \u003cp\u003eComment\u003c/p\u003e\n        \u003c/li\u003e\n        \n    \u003c/ul\u003e \n\u003c/div\u003e\n\n\n\n\n\n\n           \n\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
