{
  "id": "9e4e579a-1819-4978-b13d-59c2308353db",
  "title": "Eight moody bedrooms with colour palettes that embrace the dark side",
  "link": "https://www.dezeen.com/2024/10/27/moody-dark-bedrooms-lookbooks/",
  "description": "Our latest lookbook steps into the shadows with dark and moody bedrooms that use rich colour palettes to create a sense of tranquility. Making a dramatic departure from more minimalist bedrooms with light-toned interiors, these bedrooms embrace dark colours to form restful sanctuaries. Many use a mix of materials to add depth and warmth to The post Eight moody bedrooms with colour palettes that embrace the dark side appeared first on Dezeen.",
  "author": "Amy Peacock",
  "published": "Sun, 27 Oct 2024 10:00:26 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "all",
    "Interiors",
    "Residential",
    "Lookbooks",
    "Residential architecture and interiors",
    "Roundups",
    "Bedrooms"
  ],
  "byline": "Amy Peacock",
  "length": 8034,
  "excerpt": "Our latest lookbook steps into the shadows with dark and moody bedrooms that use rich colour palettes to create a sense of tranquility.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Our latest lookbook steps into the shadows with dark and moody bedrooms that use rich colour palettes to create a sense of tranquility. Making a dramatic departure from more minimalist bedrooms with light-toned interiors, these bedrooms embrace dark colours to form restful sanctuaries. Many use a mix of materials to add depth and warmth to the moody interiors, including stained timbers, plush textiles and tactile plaster. This is the latest in our lookbooks series, which provides visual inspiration from Dezeen's archive. For more inspiration, see previous lookbooks featuring transparent bathrooms, light-filled homes extensions in London and eclectic pizzerias. Photo by Serhii KadulinShkrub, Ukraine, by Sergey Makhno Designed by architect and designer Sergey Makhno for his family, Shkrub is a home in the Ukrainian village of Kozin that features a garden and interiors inspired by trips to Japan. The main bedroom has a dramatic atmosphere with an artistic headboard decorated in a smokey pattern, a low-slung bed with dark grey-blue bedding and dark wood walls and floors. Find out more about Shkrub › Photo by Fabian MartinezColonia Condesa house, Mexico, by Chloé Mason Gray A richly hued brown plaster coats the walls in the bedroom of this home in Colonia Condesa, Mexico, which was complemented with a leather headboard and forest green linen bedding and curtains. The home was renovated by Mexico City interiors studio Chloé Mason Gray, which wanted to embrace the home's lack of natural light by creating dark and moody settings. Find out more about the Colonia Condesa house › Photo by Cristobal PalmaPrism House and Terrace Room, Chile, by Smiljan Radić Architect Smiljan Radić designed an A-frame structure and a mono-pitched structure placed on either end of a stilted wooden deck for this home, which is located in a forest in Chile. Beds were tucked under the sloping roof of the A-frame building on the upper floor, which features surfaces lined with blackened Oregon pine wood and a glazed gable end overlooking the surrounding woodlands. Find out more about Prism House and Terrace Room › Photo by Chase DanielHouse 001, USA, by Melanie Raines Interior designer Melanie Raines aimed to create a relaxing atmosphere in the bedroom at House 001, a family home in Austin, Texas. Blackened walls and plush navy bedding add a sense of cosiness and are contrasted with orange-hued leather covering the bedframe and side tables. Find out more about House 001 › Photo by Patrick ReynoldsKawakawa House, New Zealand, by Herbst Architects Surrounded by a canopy of pōhutukawa trees, Kawakawa House was designed by Auckland-based practice Herbst Architects to celebrate the dramatic natural landscape of Piha, New Zealand. Birch wall panels in the bedroom create a dark backdrop against the views of the trees and dappled light filtering through the canopy. Find out more about Kawakawa House › Shelter, Denmark, by Vipp Shelter is a 55-square-metre prefabricated micro dwelling designed by Danish retailer Vipp as a nature retreat. The dwelling is made up of a metal-and-glass rectangular box with two chambers protruding through the roof, one of which contains a compact, dark grey sleeping loft illuminated by skylights. Find out more about Shelter › Photo by Andrey Bezuglov and Maryan BereshModern log cabin, Ukraine, by Balbek Bureau Architecture studio Balbek Bureau revamped this home in Ukraine, retaining dark-toned log walls and adding stainless steel and concrete elements to create a modern interpretation of a log cabin. Two of the bedrooms feature grey upholstered padded sleeping nooks adjoining the existing log walls, with sloping roofs and soft textures creating a sense of cosiness. Find out more about the modern log cabin › Photo by Gareth HackerLondon Victorian terrace, UK, by Daytrip Interiors studio Daytrip worked with architecture practice Studio 30 to extend and update this Victorian terrace in London, intending to give it a new aesthetic. While the rest of the home was finished with white walls, the walls in the bedroom were decorated in a muted green, and linen curtains add a soft and tactile quality. Find out more about the London Victorian terrace › This is the latest in our lookbooks series, which provides visual inspiration from Dezeen's archive. For more inspiration, see previous lookbooks featuring transparent bathrooms, light-filled homes extensions in London and eclectic pizzerias. Subscribe to our newsletters Your email address New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/10/hero-dark-moody-bedrooms-lookbooks_dezeen_2364_col_0-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2134087\" data-article-id=\"2134087\"\u003e\n\n            \n                \u003cheader\u003e\n                    \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/hero-dark-moody-bedrooms-lookbooks_dezeen_2364_col_0.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/10/hero-dark-moody-bedrooms-lookbooks_dezeen_2364_col_0-852x479.jpg\" alt=\"Dark bedroom with slanted ceiling\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/10/hero-dark-moody-bedrooms-lookbooks_dezeen_2364_col_0-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/10/hero-dark-moody-bedrooms-lookbooks_dezeen_2364_col_0-1704x959.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                    \n\n                    \n\n                    \n\n                \u003c/header\u003e\n\n                \u003csection\u003e\n                    \n\n                    \n                    \n                    \u003cp\u003eOur latest \u003ca href=\"https://www.dezeen.com/lookbooks/\"\u003elookbook\u003c/a\u003e steps into the shadows with dark and moody \u003ca href=\"https://www.dezeen.com/tag/bedrooms/\"\u003ebedrooms\u003c/a\u003e that use rich colour palettes to create a sense of tranquility.\u003cspan id=\"more-2134087\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eMaking a dramatic departure from more minimalist bedrooms with light-toned interiors, these bedrooms embrace dark colours to form restful sanctuaries.\u003c/p\u003e\n\u003cp\u003eMany use a mix of materials to add depth and warmth to the moody interiors, including stained timbers, plush textiles and tactile plaster.\u003c/p\u003e\n\u003cp\u003eThis is the latest in our lookbooks series, which provides visual inspiration from Dezeen\u0026#39;s archive. For more inspiration, see previous lookbooks featuring \u003ca href=\"https://www.dezeen.com/2024/10/20/transparent-bathrooms-lookbooks/\"\u003etransparent bathrooms\u003c/a\u003e, \u003ca href=\"https://www.dezeen.com/2024/10/19/london-house-extensions/\"\u003elight-filled homes extensions in London\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2024/10/13/nine-electic-pizzerias-lookbooks/\"\u003eeclectic pizzerias\u003c/a\u003e.\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-1421658\" data-lightboximage=\"https://static.dezeen.com/uploads/2019/10/shkrub-sergey-makhno-architects-residential-architecture-ukraine-thatch-roof_dezeen_1704_col_49.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2019/10/21/shkrub-sergey-makhno-thatch-roof-house-architecture/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2019/10/shkrub-sergey-makhno-architects-residential-architecture-ukraine-thatch-roof_dezeen_1704_col_49-852x1217.jpg\" alt=\"Shkrub by Sergey Makhno Architects\" width=\"1704\" height=\"2434\" srcset=\"https://static.dezeen.com/uploads/2019/10/shkrub-sergey-makhno-architects-residential-architecture-ukraine-thatch-roof_dezeen_1704_col_49-852x1217.jpg 1x, https://static.dezeen.com/uploads/2019/10/shkrub-sergey-makhno-architects-residential-architecture-ukraine-thatch-roof_dezeen_1704_col_49-1704x2434.jpg 2x\" sizes=\"(max-width: 1704px) 100vw, 1704px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1421658\"\u003ePhoto by Serhii Kadulin\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2019/10/21/shkrub-sergey-makhno-thatch-roof-house-architecture/\"\u003e\u003cstrong\u003eShkrub, Ukraine, by Sergey Makhno\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\u003cp\u003e\u003cspan\u003eDesigned by architect and designer \u003ca href=\"https://www.dezeen.com/tag/sergey-makhno/\" target=\"_blank\" rel=\"noopener\"\u003eSergey Makhno\u003c/a\u003e for his family, Shkrub is a home in the Ukrainian village of Kozin that features a garden and interiors inspired by trips to \u003ca href=\"https://www.dezeen.com/tag/japan/\"\u003eJapan\u003c/a\u003e.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe main bedroom has a dramatic atmosphere with an artistic headboard decorated in a smokey pattern, a low-slung bed with dark grey-blue bedding and dark wood walls and floors.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2019/10/21/shkrub-sergey-makhno-thatch-roof-house-architecture/\"\u003e\u003cem\u003eFind out more about Shkrub ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-1841355\" data-lightboximage=\"https://static.dezeen.com/uploads/2022/09/mexico-city-house_chloe-gray_dezeen_2364_col_5-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2022/10/08/mexico-city-bachelor-pad-renovation-chloe-mason-gray/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2022/09/mexico-city-house_chloe-gray_dezeen_2364_col_5-852x1068.jpg\" alt=\"Bedroom reflected in mirrored wardrobe\" width=\"1887\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2022/09/mexico-city-house_chloe-gray_dezeen_2364_col_5-852x1068.jpg 1x, https://static.dezeen.com/uploads/2022/09/mexico-city-house_chloe-gray_dezeen_2364_col_5-1704x2135.jpg 2x\" sizes=\"(max-width: 1887px) 100vw, 1887px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1841355\"\u003ePhoto by Fabian Martinez\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2022/10/08/mexico-city-bachelor-pad-renovation-chloe-mason-gray/\"\u003e\u003cstrong\u003eColonia Condesa house, Mexico, by Chloé Mason Gray\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eA richly hued brown plaster coats the walls in the bedroom of this home in Colonia Condesa, \u003ca href=\"https://www.dezeen.com/tag/mexico/\"\u003eMexico\u003c/a\u003e, which was complemented with a leather headboard and forest green linen bedding and curtains.\u003c/p\u003e\n\u003cp\u003eThe home was renovated by \u003ca href=\"https://www.dezeen.com/tag/mexico-city\"\u003eMexico City\u003c/a\u003e interiors studio Chloé Mason Gray, which wanted to embrace the home\u0026#39;s lack of natural light by creating dark and moody settings.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2022/10/08/mexico-city-bachelor-pad-renovation-chloe-mason-gray/\"\u003e\u003cem\u003eFind out more about the Colonia Condesa house ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-1565985\" data-lightboximage=\"https://static.dezeen.com/uploads/2020/09/prism-house-room-terrace-smiljan-radic-chile_dezeen_2364_col_77-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2020/09/11/prism-house-room-smiljan-radic-conguillio-chile/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2020/09/prism-house-room-terrace-smiljan-radic-chile_dezeen_2364_col_77-852x1172.jpg\" alt=\"Prism House + Room by Smiljan Radić\" width=\"1862\" height=\"2560\" srcset=\"https://static.dezeen.com/uploads/2020/09/prism-house-room-terrace-smiljan-radic-chile_dezeen_2364_col_77-852x1172.jpg 1x, https://static.dezeen.com/uploads/2020/09/prism-house-room-terrace-smiljan-radic-chile_dezeen_2364_col_77-1704x2343.jpg 2x\" sizes=\"(max-width: 1862px) 100vw, 1862px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1565985\"\u003ePhoto by Cristobal Palma\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2020/09/11/prism-house-room-smiljan-radic-conguillio-chile/\"\u003e\u003cstrong\u003ePrism House and Terrace Room, Chile, by Smiljan Radić\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eArchitect \u003ca href=\"https://www.dezeen.com/tag/smiljan-radic/\"\u003eSmiljan Radić\u003c/a\u003e designed an \u003ca href=\"https://www.dezeen.com/tag/a-frame-structures/\"\u003eA-frame structure\u003c/a\u003e and a mono-pitched structure placed on either end of a stilted wooden deck for this home, which is located in a forest in \u003ca href=\"https://www.dezeen.com/tag/chile/\"\u003eChile\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eBeds were tucked under the sloping roof of the A-frame building on the upper floor, which features surfaces lined with blackened Oregon \u003ca href=\"https://www.dezeen.com/tag/pine/\"\u003epine\u003c/a\u003e wood and a glazed \u003ca href=\"https://www.dezeen.com/tag/gables/\"\u003egable\u003c/a\u003e end overlooking the surrounding woodlands.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2020/09/11/prism-house-room-smiljan-radic-conguillio-chile/\"\u003e\u003cem\u003eFind out more about Prism House and Terrace Room ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-1851421\" data-lightboximage=\"https://static.dezeen.com/uploads/2022/10/house-001_austin-texas_melanie-raines_dezeen_2364_col_9-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2022/10/23/melanie-raines-house-001-interior-design-austin-texas/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2022/10/house-001_austin-texas_melanie-raines_dezeen_2364_col_9-852x1136.jpg\" alt=\"Primary bedroom\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2022/10/house-001_austin-texas_melanie-raines_dezeen_2364_col_9-852x1136.jpg 1x, https://static.dezeen.com/uploads/2022/10/house-001_austin-texas_melanie-raines_dezeen_2364_col_9-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1851421\"\u003ePhoto by Chase Daniel\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2022/10/23/melanie-raines-house-001-interior-design-austin-texas/\"\u003e\u003cstrong\u003eHouse 001, USA, by Melanie Raines\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eInterior designer Melanie Raines aimed to create a relaxing atmosphere in the bedroom at House 001, a family home in \u003ca href=\"https://www.dezeen.com/tag/austin/\"\u003eAustin\u003c/a\u003e, Texas.\u003c/p\u003e\n\u003cp\u003eBlackened walls and plush navy bedding add a sense of cosiness and are contrasted with orange-hued \u003ca href=\"https://www.dezeen.com/tag/leather/\"\u003eleather\u003c/a\u003e covering the bedframe and side tables.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2022/10/23/melanie-raines-house-001-interior-design-austin-texas/\"\u003e\u003cem\u003eFind out more about House 001 ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-1401178\" data-lightboximage=\"https://static.dezeen.com/uploads/2019/08/kawakawa-house-herbst-architects-piha-new-zealand_dezeen_1704_col_9.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2019/08/31/kawakawa-house-herbst-architects-piha-new-zealand/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2019/08/kawakawa-house-herbst-architects-piha-new-zealand_dezeen_1704_col_9-852x1279.jpg\" alt=\"Dark bedroom in Kawakawa House by Herbst Architects\" width=\"1704\" height=\"2557\" srcset=\"https://static.dezeen.com/uploads/2019/08/kawakawa-house-herbst-architects-piha-new-zealand_dezeen_1704_col_9-852x1279.jpg 1x, https://static.dezeen.com/uploads/2019/08/kawakawa-house-herbst-architects-piha-new-zealand_dezeen_1704_col_9-1704x2557.jpg 2x\" sizes=\"(max-width: 1704px) 100vw, 1704px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1401178\"\u003ePhoto by Patrick Reynolds\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2019/08/31/kawakawa-house-herbst-architects-piha-new-zealand/\"\u003e\u003cstrong\u003eKawakawa House, New Zealand, by Herbst Architects\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eSurrounded by a canopy of pōhutukawa trees, Kawakawa House was designed by Auckland-based practice Herbst Architects to celebrate the dramatic natural landscape of Piha, \u003ca href=\"http://dezeen.com/tag/new-zealand\"\u003eNew Zealand\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eBirch wall panels in the bedroom create a dark backdrop against the views of the trees and dappled light filtering through the canopy.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2019/08/31/kawakawa-house-herbst-architects-piha-new-zealand/\"\u003e\u003cem\u003eFind out more about Kawakawa House ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-5\" data-lightboximage=\"https://static.dezeen.com/uploads/2017/05/shelter-vipp-micro-tiny-dwelling-house-prefab-kasper-egelund-denmark-architecture-cabin_dezeen_20.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2017/05/15/vipp-prefabricated-shelter-cabin-battery-charging-station-humans/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2017/05/shelter-vipp-micro-tiny-dwelling-house-prefab-kasper-egelund-denmark-architecture-cabin_dezeen_20-852x973.jpg\" alt=\"Dark grey bedroom in Shelter by Vipp\" width=\"2364\" height=\"2699\" srcset=\"https://static.dezeen.com/uploads/2017/05/shelter-vipp-micro-tiny-dwelling-house-prefab-kasper-egelund-denmark-architecture-cabin_dezeen_20-852x973.jpg 1x, https://static.dezeen.com/uploads/2017/05/shelter-vipp-micro-tiny-dwelling-house-prefab-kasper-egelund-denmark-architecture-cabin_dezeen_20-1704x1945.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2017/05/15/vipp-prefabricated-shelter-cabin-battery-charging-station-humans/\"\u003e\u003cstrong\u003eShelter, Denmark, by Vipp\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eShelter is a 55-square-metre prefabricated \u003ca href=\"https://www.dezeen.com/tag/micro-homes/\"\u003emicro dwelling\u003c/a\u003e designed by Danish retailer \u003ca href=\"https://www.dezeen.com/tag/vipp/\"\u003eVipp\u003c/a\u003e as a nature retreat.\u003c/p\u003e\n\u003cp\u003eThe dwelling is made up of a metal-and-glass rectangular box with two chambers protruding through the roof, one of which contains a compact, dark grey sleeping loft illuminated by \u003ca href=\"https://www.dezeen.com/tag/skylights/\"\u003eskylights\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2017/05/15/vipp-prefabricated-shelter-cabin-battery-charging-station-humans/\"\u003e\u003cem\u003eFind out more about Shelter ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-6\" aria-describedby=\"caption-attachment-1969648\" data-lightboximage=\"https://static.dezeen.com/uploads/2023/08/relogged-cabin-balbek-bureau_dezeen_2364_col_9-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2023/08/25/modern-log-cabin-relogged-balbek-bureau-ukraine/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2023/08/relogged-cabin-balbek-bureau_dezeen_2364_col_9-852x1278.jpg\" alt=\"Padded dark bedroom in a log cabin\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2023/08/relogged-cabin-balbek-bureau_dezeen_2364_col_9-852x1278.jpg 1x, https://static.dezeen.com/uploads/2023/08/relogged-cabin-balbek-bureau_dezeen_2364_col_9-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1969648\"\u003ePhoto by Andrey Bezuglov and Maryan Beresh\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2023/08/25/modern-log-cabin-relogged-balbek-bureau-ukraine/\"\u003e\u003cstrong\u003eModern log cabin, Ukraine, by Balbek Bureau\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eArchitecture studio \u003ca href=\"https://www.dezeen.com/tag/balbek-bureau/\"\u003eBalbek Bureau\u003c/a\u003e revamped this home in \u003ca href=\"https://www.dezeen.com/tag/ukraine/\"\u003eUkraine\u003c/a\u003e, retaining dark-toned log walls and adding stainless steel and concrete elements to create a modern interpretation of a \u003ca href=\"https://www.dezeen.com/tag/log-cabins/\"\u003elog cabin\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eTwo of the bedrooms feature grey upholstered padded sleeping nooks adjoining the existing log walls, with sloping roofs and soft textures creating a sense of cosiness.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2023/08/25/modern-log-cabin-relogged-balbek-bureau-ukraine/\"\u003e\u003cem\u003eFind out more about the modern log cabin ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-7\" aria-describedby=\"caption-attachment-2134594\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/dark-moody-bedrooms-lookbooks_dezeen_2364_col_0.jpg\" data-orientation=\"square\"\u003e\u003ca href=\"https://www.dezeen.com/2023/06/11/daytrip-imbues-victorian-terrace-in-highbury-with-gallery-like-minimalism/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/dark-moody-bedrooms-lookbooks_dezeen_2364_col_0-852x852.jpg\" alt=\"Dark bedroom with green walls\" width=\"2364\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/10/dark-moody-bedrooms-lookbooks_dezeen_2364_col_0-852x852.jpg 1x, https://static.dezeen.com/uploads/2024/10/dark-moody-bedrooms-lookbooks_dezeen_2364_col_0-1704x1704.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2134594\"\u003ePhoto by Gareth Hacker\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2023/06/11/daytrip-imbues-victorian-terrace-in-highbury-with-gallery-like-minimalism/\"\u003e\u003cstrong\u003eLondon Victorian terrace, UK, by Daytrip\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eInteriors studio \u003ca href=\"https://www.dezeen.com/tag/daytrip/\"\u003eDaytrip\u003c/a\u003e worked with architecture practice Studio 30 to extend and update this Victorian terrace in \u003ca href=\"https://www.dezeen.com/tag/london/\"\u003eLondon\u003c/a\u003e, intending to give it a new aesthetic.\u003c/p\u003e\n\u003cp\u003eWhile the rest of the home was finished with white walls, the walls in the bedroom were decorated in a muted green, and linen curtains add a soft and tactile quality.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2023/06/11/daytrip-imbues-victorian-terrace-in-highbury-with-gallery-like-minimalism/\"\u003e\u003cem\u003eFind out more about the London Victorian terrace ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis is the latest in our lookbooks series, which provides visual inspiration from Dezeen\u0026#39;s archive. For more inspiration, see previous lookbooks featuring \u003ca href=\"https://www.dezeen.com/2024/10/20/transparent-bathrooms-lookbooks/\"\u003etransparent bathrooms\u003c/a\u003e, \u003ca href=\"https://www.dezeen.com/2024/10/19/london-house-extensions/\"\u003elight-filled homes extensions in London\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2024/10/13/nine-electic-pizzerias-lookbooks/\"\u003eeclectic pizzerias\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n                    \n                    \n                    \n\n\n                \u003c/section\u003e\n\n                \n                \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#29595b405f484a50694d4c534c4c47074a4644\"\u003e\u003cspan data-cfemail=\"5424263d2235372d1430312e31313a7a373b39\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n                \n\n                \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-10-27T10:00:26Z",
  "modifiedTime": "2024-10-25T13:22:17Z"
}
