{
  "id": "9fc66953-0a68-49c9-a554-0b25ab837a55",
  "title": "A Breezy Blairgowrie Beach House Inspired By Swedish Functionalism",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/02/architecture-blairgowrie-beach-club-bower/",
  "description": "This newly-built holiday house is affectionately known as Blairgowrie Beach Club — a nickname that reflects its life as a generous base for entertaining friends and family. Designed by Bower Architecture and Interiors, the house is entirely tailored to its coastal site on Victoria’s Mornington Peninsula, while integrating elements of Swedish functionalism to celebrate the owners’ heritage. The architects carefully designed the floor plan to support both regular hosting and a quieter existence when only the two owners are present.",
  "author": "The Design Files",
  "published": "Mon, 24 Feb 2025 03:00:55 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 4192,
  "excerpt": "This new beach house by Bower is very much tailored to its Mornington Peninsula site, while integrating elements of Swedish functionalism.",
  "siteName": "",
  "favicon": "",
  "text": "Homeowners Fio and Katarina came to Bower Architecture and Interiors seeking a more comfortable and practical beach house where their well-loved small fibro beach shack once stood. With their two children now into adulthood, they desired a more generous house, large enough to accommodate several families and friends at a time. The brief stipulated integrating the owners’ heritage, particularly Katarina’s Swedish background. Jess King, project architect and associate at Bower Architecture and Interiors explains, ‘She introduced us to Funkis, the design concept of Swedish Functionalism developed early in the 20th Century, which was to be reflected in the design of the house. ‘The people-centric design concept of Funkis drove the Bower team to always revert back to simplicity, to focus on the inhabitants relaxation and enjoyment, as well as the honest expression of materials in the way the house is put together.’ The Blairgowrie house required more space than its predecessor, but Fio and Katarina wanted to maintain its casual and welcoming spirit, and intimacy when staying in the house as a couple. Carefully considered proportions ensure that the large house retains a cosy feel when used by a small group. The house and key rooms can also be accessed in multiple ways, allowing guests to directly enter bathrooms from the outside, and providing them with uninterrupted access to the outdoor entertaining areas (barbecue area, decks, terrace, and tennis court) wrapping around the front of the home to the north east. Jess says, ‘We carefully considered the holiday rituals of the family — returning from the beach; relaxing outside; playing on the tennis court — to name a few. ‘The large protected outdoor spaces, a bathroom with internal and external access, an outdoor shower, and a spot for towels and beach gear are some examples that respond to these rituals and allow for ease and enjoyment of these activities.’ Everything Fio and Katarina need day to day is located on the ground floor to maintain the feeling of a smaller home when no guests are present. Robust materials set the tone of each space and respond to the home’s coastal environment. The exterior features Australian silvertop Ash and blackbutt, blockwork, brickwork, and granite all intended to age gracefully. ‘All external timber elements were coated to evenly pre-age to both protect and create a light tone — a nod to Scandinavian design and craftsmanship,’ says Jess. ‘It protects from the elements but celebrates the seasons.’ Internally, the front of the house showcases a softer palette of textured painted bricks, Victorian ash flooring, seagrass carpets, and Willie Weston wallpaper. The soft green of the cabinets, reminiscent of vintage Scandinavian kitchens, was selected by Katarina, further linking to memories of her homeland. Simple, practical square white wall tiles likewise reflect the Swedish ‘Funkis’ concept, while the speckled terrazzo bathroom flooring is a nod to Fio’s Italian heritage. Hardiness takes centre stage towards the rear of the home, where the flooring changes to polished concrete for the rumpus room. The landscape design by Kate LePage Garden Design was carefully designed to retain as much of the existing coastal vegetation as possible and add significant screening trees for privacy along the north boundary. ‘At the front, olive trees link back to Fio’s Italian heritage. Layered native violets and ground covers pop up between organic rock pavers in a beautiful, wandering terraced garden leading up to the entry stairs,’ says Jess. ‘The loose, natural feel contrasts so well with the rectilinear built form and we love how the lawn driveway brings even more greenery.’ With its retained large front and rear setbacks and sympathetic landscaping, Bower believe this project sets a precedent for future coastal developments on the Mornington Peninsula. The house maintains a positive relationship with the street and surrounds, encouraging passersby to engage with the clients on the front deck, which they love! ‘Visitors come to the house via the informal entry up the stairs to easily join Fio and Katarina on the deck for an afternoon drink,’ says Jess.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/02/Blairgowri-tdf-archi6-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eHomeowners Fio and Katarina came to \u003ca href=\"https://www.bowerarchitecture.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eBower Architecture and Interiors\u003c/a\u003e seeking a more comfortable and practical beach house where their well-loved small fibro beach shack once stood.\u003c/h3\u003e\n\u003cp\u003eWith their two children now into adulthood, they desired a more generous house, large enough to accommodate several families and friends at a time.\u003c/p\u003e\n\u003cp\u003eThe brief stipulated integrating the owners’ heritage, particularly Katarina’s Swedish background.\u003c/p\u003e\n\u003cp\u003eJess King, project architect and associate at Bower Architecture and Interiors explains, ‘She introduced us to Funkis, the design concept of Swedish Functionalism developed early in the 20th Century, which was to be reflected in the design of the house.\u003c/p\u003e\n\u003cp\u003e‘The people-centric design concept of Funkis drove the Bower team to always revert back to simplicity, to focus on the inhabitants relaxation and enjoyment, as well as the honest expression of materials in the way the house is put together.’\u003c/p\u003e\n\u003cp\u003eThe Blairgowrie house required more space than its predecessor, but Fio and Katarina wanted to maintain its casual and welcoming spirit, and intimacy when staying in the house as a couple.\u003c/p\u003e\n\u003cp\u003eCarefully considered proportions ensure that the large house retains a cosy feel when used by a small group.\u003c/p\u003e\n\u003cp\u003eThe house and key rooms can also be accessed in multiple ways, allowing guests to directly enter bathrooms from the outside, and providing them with uninterrupted access to the outdoor entertaining areas (barbecue area, decks, terrace, and tennis court) wrapping around the front of the home to the north east.\u003c/p\u003e\n\u003cp\u003eJess says, ‘We carefully considered the holiday rituals of the family — returning from the beach; relaxing outside; playing on the tennis court — to name a few.\u003c/p\u003e\n\u003cp\u003e‘The large protected outdoor spaces, a bathroom with internal and external access, an outdoor shower, and a spot for towels and beach gear are some examples that respond to these rituals and allow for ease and enjoyment of these activities.’\u003c/p\u003e\n\u003cp\u003eEverything Fio and Katarina need day to day is located on the ground floor to maintain the feeling of a smaller home when no guests are present.\u003c/p\u003e\n\u003cp\u003eRobust materials set the tone of each space and respond to the home’s coastal environment.\u003c/p\u003e\n\u003cp\u003eThe exterior features Australian silvertop Ash and blackbutt, blockwork, brickwork, and granite all intended to age gracefully.\u003c/p\u003e\n\u003cp\u003e‘All external timber elements were coated to evenly pre-age to both protect and create a light tone — a nod to Scandinavian design and craftsmanship,’ says Jess.\u003c/p\u003e\n\u003cp\u003e‘It protects from the elements but celebrates the seasons.’\u003c/p\u003e\n\u003cp\u003eInternally, the front of the house showcases a softer palette of textured painted bricks, Victorian ash flooring, seagrass carpets, and Willie Weston wallpaper.\u003c/p\u003e\n\u003cp\u003eThe soft green of the cabinets, reminiscent of vintage Scandinavian kitchens, was selected by Katarina, further linking to memories of her homeland.\u003c/p\u003e\n\u003cp\u003eSimple, practical square white wall tiles likewise reflect the Swedish ‘Funkis’ concept, while the speckled terrazzo bathroom flooring is a nod to Fio’s Italian heritage.\u003c/p\u003e\n\u003cp\u003eHardiness takes centre stage towards the rear of the home, where the flooring changes to polished concrete for the rumpus room.\u003c/p\u003e\n\u003cp\u003eThe landscape design by \u003ca href=\"https://klpgardendesign.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eKate LePage Garden Design\u003c/a\u003e was carefully designed to retain as much of the existing coastal vegetation as possible and add significant screening trees for privacy along the north boundary.\u003c/p\u003e\n\u003cp\u003e‘At the front, olive trees link back to Fio’s Italian heritage. Layered native violets and ground covers pop up between organic rock pavers in a beautiful, wandering terraced garden leading up to the entry stairs,’ says Jess.\u003c/p\u003e\n\u003cp\u003e‘The loose, natural feel contrasts so well with the rectilinear built form and we love how the lawn driveway brings even more greenery.’\u003c/p\u003e\n\u003cp\u003eWith its retained large front and rear setbacks and sympathetic landscaping, Bower believe this project sets a precedent for future coastal developments on the Mornington Peninsula.\u003c/p\u003e\n\u003cp\u003eThe house maintains a positive relationship with the street and surrounds, encouraging passersby to engage with the clients on the front deck, which they love!\u003c/p\u003e\n\u003cp\u003e‘Visitors come to the house via the informal entry up the stairs to easily join Fio and Katarina on the deck for an afternoon drink,’ says Jess.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
