{
  "id": "a91b75ea-4225-45b4-b8e3-03b6596aca66",
  "title": "There’s Nothing Boring About This 1980s Treehouse Makeover",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/04/interiors-treehouse-is-design/",
  "description": "The original look of this 1980s house in Wollongong has a mid-century treehouse feel, owed to its elevated position on stilts, and vaulted timber ceilings. These features have been retained in a recent renovation by IS Design and Morgan Dickson Architecture, and enhanced by colourful material interventions. The number one goal: avoiding an ‘all-white house’!",
  "author": "The Design Files",
  "published": "Mon, 31 Mar 2025 19:00:39 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 1805,
  "excerpt": "The original vibe of this 1980s Wollongong home has been retained and enhanced with colourful renovations by IS Design.",
  "siteName": "",
  "favicon": "",
  "text": "Tanya Van Der Water, owner of Buckaroo Leatherworks, and her family love this 1980s timber house so much, they leased the Woonona property in Wollongong NSW twice, before eventually purchasing the home in 2021. By then, the interiors of the house were drab and dated, and in need of revitalising to suit a family of seven. The family engaged IS Design and Morgan Dickson Architecture to rework the original home and add a new storey, with a large bathroom and three more bedrooms. The original house was essentially gutted during the renovation, but its soul was retained through the retention of its signature vaulted ceilings, plenty of timber surfaces, and intimate sized rooms. Tanya explains,  ‘All bedrooms were to be kept small and cosy, and with no en suite for the main. Rather, we opted for a walk-in wardrobe and have no regrets.’ She envisioned the new interiors as a ‘warm, safe space’ — private and homely, and breezy in all the right ways. This was achieved by introducing colour at every opportunity, or as Tanya puts it, being ‘allergic to white, unless unavoidable.’ She adds, ‘The idea was to use as much colour as possible in the finishes, and not be afraid to have clashing colours… ‘We were adamant we didn’t create a white house; that’s just not our idea of calm.’ Some of the more daring choices in the house include smooth lilac aluminium against textured Artedomus Japanese tiles in the kitchen, green carpet on the stairs and in the bedrooms, and statement kids bedroom joinery in vibrant yellow. The use of colour is both authentic to the quirky 1980s design of the original house, and perfectly reflects Tanya’s family. ‘We are pretty excited by life and also known as risk takers within our inner circle, so it’s a blessing to have a home that reflects our spirit,’ she says.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/03/Treehouse-tdf-archi11-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eTanya Van Der Water, owner of \u003ca href=\"https://www.instagram.com/buckarooleatherworks/?hl=en\"\u003eBuckaroo Leatherworks\u003c/a\u003e, and her family love this 1980s timber house so much, they leased the Woonona property in Wollongong NSW twice, before eventually purchasing the home in 2021.\u003c/h3\u003e\n\u003cp\u003eBy then, the interiors of the house were drab and dated, and in need of revitalising to suit a family of seven.\u003c/p\u003e\n\u003cp\u003eThe family engaged \u003ca href=\"https://www.instagram.com/is____design/\"\u003eIS Design\u003c/a\u003e and \u003ca href=\"https://morgandickson.com.au/\"\u003eMorgan Dickson Architecture\u003c/a\u003e to rework the original home and add a new storey, with a large bathroom and three more bedrooms.\u003c/p\u003e\n\u003cp\u003eThe original house was essentially gutted during the renovation, but its soul was retained through the retention of its signature vaulted ceilings, plenty of timber surfaces, and intimate sized rooms.\u003c/p\u003e\n\u003cp\u003eTanya explains,  ‘All bedrooms were to be kept small and cosy, and with no en suite for the main. Rather, we opted for a walk-in wardrobe and have no regrets.’\u003c/p\u003e\n\u003cp\u003eShe envisioned the new interiors as a ‘warm, safe space’ — private and homely, and breezy in all the right ways.\u003c/p\u003e\n\u003cp\u003eThis was achieved by introducing colour at every opportunity, or as Tanya puts it, being ‘allergic to white, unless unavoidable.’\u003c/p\u003e\n\u003cp\u003eShe adds, ‘The idea was to use as much colour as possible in the finishes, and not be afraid to have clashing colours…\u003c/p\u003e\n\u003cp\u003e‘We were adamant we didn’t create a white house; that’s just not our idea of calm.’\u003c/p\u003e\n\u003cp\u003eSome of the more daring choices in the house include smooth lilac aluminium against textured \u003ca href=\"https://thedesignfiles.wpenginepowered.com/directory/collections/tiles-2?filter=Artedomus\"\u003eArtedomus\u003c/a\u003e Japanese tiles in the kitchen, green carpet on the stairs and in the bedrooms, and statement kids bedroom joinery in \u003ca href=\"https://www.dulux.com.au/specifier/colour/s17/jubilation/?srsltid=AfmBOop8f15CrthUrmVMmvnR7s-GuZgOZtqNOrlEPIPzaIUYbmOALNLj\" target=\"_blank\" rel=\"noopener\"\u003evibrant yellow\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe use of colour is both authentic to the quirky 1980s design of the original house, and perfectly reflects Tanya’s family.\u003c/p\u003e\n\u003cp\u003e‘We are pretty excited by life and also known as risk takers within our inner circle, so it’s a blessing to have a home that reflects our spirit,’ she says.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
