{
  "id": "b491fe4a-524c-4422-b23f-1d66ac6042f7",
  "title": "An Interior Designer’s Cosy Miner’s Cottage Renovation",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/03/interiors-ballarat-house-genevieve-wallis/",
  "description": "Renovating interior designer Genevieve Wallis’ family home was a true labour of love. The family was looking for a fresh start when Genevieve snapped up an old miner’s cottage in Ballarat Central that was the perfect canvas for a full cosmetic renovation. Without any structural changes, the regional Victorian home has since become a cosy and cohesive sanctuary for the newly single mum, her kids Lenny (14), Wilbur (12) and Clementine (10), and their two dogs.",
  "author": "The Design Files",
  "published": "Tue, 04 Mar 2025 03:00:40 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2341,
  "excerpt": "Marking a fresh start for her family, Victorian-based designer Genevieve Wallis has filled an old cottage with lots of heart.",
  "siteName": "",
  "favicon": "",
  "text": "You know the phrase home is where the heart is? Well, Genevieve Wallis has filled this old miner’s cottage with plenty of heart in a deeply personal renovation. After experiencing a divorce amid the height of the pandemic, the Ballarat-based interior designer was on the hunt for fresh start when she came across the 1900-built home — right before the regional property market boomed. ‘I was looking for something centrally located that we could renovate, with a small, maintainable yard,’ Genevieve says. ‘When I drove past the house, the facade jumped out at me immediately, the Victorian details have enormous street appeal. It was a beautiful house just needing a bit of love.’ Even the mid-century lean-to at the rear was in great structural condition. In other words, it was a perfect blank canvas for a cosmetic transformation. Almost every surface was replaced, from installing new chevron engineered timber floorboards to lighting, carpet, fixings and hardware. Genevieve also designed all the joinery, the new kitchen and bathroom, which reveals floor-to-ceiling mosaic tiles — inspired by her love of mid-century aesthetics. The new living spaces feel wonderfully layered and cosy, thanks to the use of natural materials like walnut timber and brushed nickel alongside warm greys, beiges, greens, and rust hues. ‘I didn’t touch the footprint at all, though I did move the European laundry from the bathroom, creating a larger bathroom to cater for the three bedrooms, as it’s the only bathroom in the house,’ she adds. But the biggest challenge was living in the home — with her three kids and two dogs — while the renovation took place. ‘I recited “short-term pain, long-term gain” to myself daily. The kids were absolute legends while we navigated holes in floors, no toilet or shower in the house for five weeks, and trades coming in and out constantly during home school,’ Genevieve says. ‘This was the first home for the kids and I after the breakdown of my marriage, I wanted it to feel comfortable and warm, but mostly I wanted it to feel like a home where we could belong and rebuild as a little family of four.’ It’s fair to say the process was a true labour of love, but the resulting house marked the perfect fresh start: ‘Everyone who visits comments on the warmth the interior exudes, which is really lovely to hear.’",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/03/BallaratHouse-tdf-homesextras2-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eYou know the phrase home is where the heart is?\u003c/h3\u003e\n\u003cp\u003eWell, \u003ca href=\"https://genevievewallis.com/\" target=\"_blank\" rel=\"noopener\"\u003eGenevieve Wallis\u003c/a\u003e has filled this old miner’s cottage with plenty of heart in a deeply personal renovation.\u003c/p\u003e\n\u003cp\u003eAfter experiencing a divorce amid the height of the pandemic, the Ballarat-based interior designer was on the hunt for fresh start when she came across the 1900-built home — right before the regional property market boomed.\u003c/p\u003e\n\u003cp\u003e‘I was looking for something centrally located that we could renovate, with a small, maintainable yard,’ Genevieve says.\u003c/p\u003e\n\u003cp\u003e‘When I drove past the house, the facade jumped out at me immediately, the Victorian details have enormous street appeal. It was a beautiful house just needing a bit of love.’\u003c/p\u003e\n\u003cp\u003eEven the mid-century lean-to at the rear was in great structural condition. In other words, it was a perfect blank canvas for a cosmetic transformation.\u003c/p\u003e\n\u003cp\u003eAlmost every surface was replaced, from installing new chevron engineered timber floorboards to lighting, carpet, fixings and hardware. Genevieve also designed all the joinery, the new kitchen and bathroom, which reveals floor-to-ceiling mosaic tiles — inspired by her love of mid-century aesthetics.\u003c/p\u003e\n\u003cp\u003eThe new living spaces feel wonderfully layered and cosy, thanks to the use of natural materials like walnut timber and brushed nickel alongside warm greys, beiges, greens, and rust hues.\u003c/p\u003e\n\u003cp\u003e‘I didn’t touch the footprint at all, though I did move the European laundry from the bathroom, creating a larger bathroom to cater for the three bedrooms, as it’s the only bathroom in the house,’ she adds.\u003c/p\u003e\n\u003cp\u003eBut the biggest challenge was living in the home — with her three kids and two dogs — while the renovation took place.\u003c/p\u003e\n\u003cp\u003e‘I recited “short-term pain, long-term gain” to myself daily. The kids were absolute legends while we navigated holes in floors, no toilet or shower in the house for five weeks, and trades coming in and out constantly during home school,’ Genevieve says.\u003c/p\u003e\n\u003cp\u003e‘This was the first home for the kids and I after the breakdown of my marriage, I wanted it to feel comfortable and warm, but mostly I wanted it to feel like a home where we could belong and rebuild as a little family of four.’\u003c/p\u003e\n\u003cp\u003eIt’s fair to say the process was a true labour of love, but the resulting house marked the perfect fresh start: ‘Everyone who visits comments on the warmth the interior exudes, which is really lovely to hear.’\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
