{
  "id": "cb337f1a-d7fa-4cc1-a952-190fb8546dfb",
  "title": "Style Scouting: Vol. 246",
  "link": "https://inmyownstyle.com/style-scouting-vol-246.html",
  "description": "This post is from the blog, InMyOwnStyle.com Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. It has been a very rainy and windy spring in South Carolina. I am hoping it is not a prelude to what the... If you enjoyed this post you may also enjoy the easy to follow DIY Decorating Tutorials and Creative Ideas on my blog, In My Own Style.com Republishing this article in full or in part is a violation of Copyright law @2009-2021, all rights reserved",
  "author": "Diane Henkler",
  "published": "Sun, 15 Jun 2025 09:00:00 +0000",
  "source": "https://inmyownstyle.com/feed",
  "categories": [
    "Drafts"
  ],
  "byline": "Diane Henkler",
  "length": 1474,
  "excerpt": "Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. photo: The Handmade Home It has been a",
  "siteName": "In My Own Style",
  "favicon": "",
  "text": "Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. It has been a very rainy and windy spring in South Carolina. I am hoping it is not a prelude to what the summer will be like since I will be taking over the weekly lawn duties from Ed. He is getting his right shoulder replaced this week and will be out of commission for a while. A soggy lawn is not easy to cut. Ed showed me how to start and use all the controls on the riding tractor-style mower yesterday. I have only used the push mower in the past. Once I start cutting the grass I know I am going to feel like Mr. Douglas and start singing… “Green Acres is the place to be. Farm livin’ is the life for me. Land spreadin’ out so far and wide…” If you have no idea what I am referencing… you didn’t grow up in the late 1960’s – early 1970’s. :-) Anywho… Whatever you’re up to this week. I hope it’s wonderful. XO Now onto the links I found for you this week. Posts You May Have Missed This Week: Pretty New Drapes for my Daughter’s House (open in same tab) If you enjoy these posts – You can find past Style Scouting posts here. And… If you’re catching up on blog posts you may have missed, be sure to sign-up to get my newest posts via email to stay up to date with everything that’s happening here on the blog and more. Post navigation",
  "image": "https://inmyownstyle.com/wp-content/uploads/2025/06/sunset_garden.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\t\t\u003cmain id=\"main\" role=\"main\"\u003e\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003carticle id=\"post-101483\"\u003e\n\t\u003cdiv\u003e\n\t\n\u003cdiv\u003e\n\u003cp\u003eThanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eIt has been a very rainy and windy spring in South Carolina. I am hoping it is not a prelude to what the summer will be like since I will be taking over the weekly lawn duties from Ed. He is getting his right shoulder replaced this week and will be out of commission for a while. A soggy lawn is not easy to cut.  \u003c/p\u003e\n\n\n\n\u003cp\u003eEd showed me how to start and use all the controls on the riding tractor-style mower yesterday.  I have only used the push mower in the past. Once I start cutting the grass I know I am going to feel like Mr. Douglas and start singing… \u003cem\u003e“Green Acres is the place to be. Farm livin’ is the life for me. Land spreadin’ out so far and wide…”\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you have no idea what I am referencing… you didn’t grow up in the late 1960’s – early 1970’s.  :-) \u003c/p\u003e\n\n\n\n\u003cp\u003eAnywho… Whatever you’re up to this week. I hope it’s wonderful. XO\u003c/p\u003e\n\n\n\n\u003cp\u003eNow onto the links I found for you this week.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-posts-you-may-have-missed-this-week\"\u003ePosts You May Have Missed This Week:\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://inmyownstyle.com/twopages-curtain-and-drapery-review.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePretty New Drapes\u003c/a\u003e for my Daughter’s House (\u003ca href=\"https://inmyownstyle.com/twopages-curtain-and-drapery-review.html\"\u003eopen in same tab\u003c/a\u003e)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cp\u003eIf you enjoy these posts – You can find past \u003ca href=\"https://inmyownstyle.com/category/creative-stylish-ideas-for-home-and-living\"\u003e\u003cem\u003eStyle Scouting\u003c/em\u003e posts here\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eAnd…\u003c/strong\u003e If you’re catching up on blog posts you may have missed, be sure \u003cstrong\u003e\u003ca href=\"https://inmyownstyle.com/subscribe-to-in-my-own-style-blog\"\u003eto sign-up\u003c/a\u003e \u003c/strong\u003eto get my \u003cstrong\u003enewest posts via email \u003c/strong\u003eto stay up to date with everything that’s happening here on the blog and more.\u003c/p\u003e\n\u003c/div\u003e\n    \n\n\t\u003cnav aria-label=\"Posts\"\u003e\n\t\t\u003ch2\u003ePost navigation\u003c/h2\u003e\n\t\t\n\t\u003c/nav\u003e\u003c/div\u003e\n\u003c/article\u003e\n\n\n\n\t\t\t\t\t\u003c/div\u003e\u003c/main\u003e\n\t\t\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-06-15T09:00:00Z",
  "modifiedTime": "2025-06-14T18:47:17Z"
}
