{
  "id": "edc81ed5-058e-4ca9-83ec-d6490b4053f7",
  "title": "This Weatherboard Hides A Beautiful Barn-Like Extension",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/03/architecture-ghost-gum-house-say-architecture/",
  "description": "When SAY Architecture’s clients moved from Tasmania to Melbourne, they wanted to bring their love of the outdoors into their new inner-city weatherboard cottage. In a considered renovation of their Collingwood home, the period residence has been reinvented with a bold, barn-like extension featuring raw, honest materials — strictly no plasterboard was allowed. Exposed brick and timber-lined interiors give the house a warm mid-century inspired character, while the small floorplan dedicates more space to the newly planted backyard.",
  "author": "The Design Files",
  "published": "Mon, 03 Mar 2025 19:00:32 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2952,
  "excerpt": "Strictly no plaster was used in this Melbourne cottage's innovative extension, instead prioritising natural materials and garden spaces.",
  "siteName": "",
  "favicon": "",
  "text": "Strictly no plasterboard was used in the extension of this Collingwood family home. ‘The approach was to keep materials honest and pared back, allowing their natural qualities to take centre stage,’ SAY Architecture director and architect Eleanor Eade says of the recently completed ‘Ghost Gum House’. The owners had moved from Tasmania to the inner city cottage, which consisted of a ‘beautiful, although dilapidated’ Victorian facade with veranda and four principal front rooms. However, the rear of the property had multiple ad-hoc additions: ranging from weird windows to random downpipes and plumbing solutions, and so much external concrete paving that only two square metres of the garden was permeable. ‘It was a concrete jungle,’ Eleanor says. ‘Coming from Tasmania, the couple had an inherent love of nature and landscape and a keen knack for plants.’ As a result, their brief was focused on ‘not building more than they needed’ to prioritise landscaping and backyard space. Respecting the original dwelling was also paramount. They sought to renovate the non-original elements at the rear with a new addition that would sit neatly alongside the heritage frontage — enhancing rather than overpowering. SAY Architecture devised a design that would maximise space on the urban corner block: an open and airy barn-like extension with a deck. ‘The barn is a wonderful form. It works particularly well for small sites,’ Eleanor says. ‘It expresses the strong residential character and street presence we were looking for. Simple and clean. It is a complimentary opposite to the heritage character of existing dwelling.’ The pitched roof provided a large internal volume that now houses the open plan living, kitchen, and dining area. Meanwhile, the use of textural materials like brick and timber brings a warm, mid-century feel to the interiors, emphasised by other must-have features like a wood heater and a large barn door that slides to conceal the main living space. After moving through the original hallway and bedrooms, a linkway lined in terrazzo flooring with skylights overhead ‘offers a moment of pause’, leading to the laundry and powder room. ‘As you draw through the home the floor level is raised and ceiling lowered as you transition to the new addition, forming a threshold between old and new,’ Eleanor says. Not only was the barn structure successful in decreasing the home’s footprint without sacrificing amenity, but it helped connect the hub of the home to the north-facing gardens with large bi-folding doors. Rather than simply blending the existing Victorian with a contemporary extension, the resulting house offers a ‘dialogue’ between the home’s contrasting materials — weatherboard and plaster, to brick and timber — and in form — heritage eaves, and a hip and valley roof. And thanks to all the owners’ impressive work on the gardens, this neat family home feels like a little oasis, right in the heart of the city.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/02/HothamProject-tdf-archi16-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eStrictly no plasterboard was used in the extension of this Collingwood family home.\u003c/h3\u003e\n\u003cp\u003e‘The approach was to keep materials honest and pared back, allowing their natural qualities to take centre stage,’ \u003ca href=\"https://www.instagram.com/say_architecture/\" target=\"_blank\" rel=\"noopener\"\u003eSAY Architecture\u003c/a\u003e director and architect Eleanor Eade says of the recently completed ‘Ghost Gum House’.\u003c/p\u003e\n\u003cp\u003eThe owners had moved from Tasmania to the inner city cottage, which consisted of a ‘beautiful, although dilapidated’ Victorian facade with veranda and four principal front rooms.\u003c/p\u003e\n\u003cp\u003eHowever, the rear of the property had multiple ad-hoc additions: ranging from weird windows to random downpipes and plumbing solutions, and so much external concrete paving that only two square metres of the garden was permeable.\u003c/p\u003e\n\u003cp\u003e‘It was a concrete jungle,’ Eleanor says. ‘Coming from Tasmania, the couple had an inherent love of nature and landscape and a keen knack for plants.’\u003c/p\u003e\n\u003cp\u003eAs a result, their brief was focused on ‘not building more than they needed’ to prioritise landscaping and backyard space.\u003c/p\u003e\n\u003cp\u003eRespecting the original dwelling was also paramount. They sought to renovate the non-original elements at the rear with a new addition that would sit neatly alongside the heritage frontage — enhancing rather than overpowering.\u003c/p\u003e\n\u003cp\u003eSAY Architecture devised a design that would maximise space on the urban corner block: an open and airy barn-like extension with a deck.\u003c/p\u003e\n\u003cp\u003e‘The barn is a wonderful form. It works particularly well for small sites,’ Eleanor says.\u003c/p\u003e\n\u003cp\u003e‘It expresses the strong residential character and street presence we were looking for. Simple and clean. It is a complimentary opposite to the heritage character of existing dwelling.’\u003c/p\u003e\n\u003cp\u003eThe pitched roof provided a large internal volume that now houses the open plan living, kitchen, and dining area.\u003c/p\u003e\n\u003cp\u003eMeanwhile, the use of textural materials like brick and timber brings a warm, mid-century feel to the interiors, emphasised by other must-have features like a wood heater and a large barn door that slides to conceal the main living space.\u003c/p\u003e\n\u003cp\u003eAfter moving through the original hallway and bedrooms, a linkway lined in terrazzo flooring with skylights overhead ‘offers a moment of pause’, leading to the laundry and powder room.\u003c/p\u003e\n\u003cp\u003e‘As you draw through the home the floor level is raised and ceiling lowered as you transition to the new addition, forming a threshold between old and new,’ Eleanor says.\u003c/p\u003e\n\u003cp\u003eNot only was the barn structure successful in decreasing the home’s footprint without sacrificing amenity, but it helped connect the hub of the home to the north-facing gardens with large bi-folding doors.\u003c/p\u003e\n\u003cp\u003eRather than simply blending the existing Victorian with a contemporary extension, the resulting house offers a ‘dialogue’ between the home’s contrasting materials — weatherboard and plaster, to brick and timber — and in form — heritage eaves, and a hip and valley roof.\u003c/p\u003e\n\u003cp\u003eAnd thanks to all the owners’ impressive work on the gardens, this neat family home feels like a little oasis, right in the heart of the city.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
