{
  "id": "f1ac65f2-ad86-40f9-bb59-4f227d83c1f7",
  "title": "The Great Exhibition adds \"world's first office rollercoaster\" to its Stockholm studio",
  "link": "https://www.dezeen.com/2024/11/14/office-rollercoaster-great-exhibition-stockholm/",
  "description": "Creative studio The Great Exhibition has created a permanent, fully functioning rollercoaster in its office in Stockholm. Named The Frontal Lobe, the 60-metre-long rollercoaster winds through the seating areas, kitchen and bar on the ground floor of The Great Exhibition's office in the Liljeholmen district. The studio, formerly known as PJADAD, created the structure to The post The Great Exhibition adds \"world's first office rollercoaster\" to its Stockholm studio appeared first on Dezeen.",
  "author": "Tom Ravenscroft",
  "published": "Thu, 14 Nov 2024 11:15:59 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "all",
    "Interiors",
    "Stockholm",
    "The Great Exhibition",
    "Office interiors"
  ],
  "byline": "Tom Ravenscroft",
  "length": 8600,
  "excerpt": "Creative studio The Great Exhibition has created a permanent, fully functioning rollercoaster in its office in Stockholm.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Creative studio The Great Exhibition has created a permanent, fully functioning rollercoaster in its office in Stockholm. Named The Frontal Lobe, the 60-metre-long rollercoaster winds through the seating areas, kitchen and bar on the ground floor of The Great Exhibition's office in the Liljeholmen district. The studio, formerly known as PJADAD, created the structure to demonstrate its ethos. It claims it is the \"world's first office rollercoaster\". The Great Exhibition created the \"world's first office rollercoaster\"\"The idea of adding a rollercoaster to our office started years ago as what many people would call an impossible dream, fun but unfeasible, and honestly, a little ridiculous,\" The Great Exhibition's creative director Per Cromwell told Dezeen. \"Over the years, the rollercoaster became something more significant. It was a challenge, a commitment to keeping the human creativity,\" he continued. \"In a world increasingly driven by AI and algorithms, where everything is optimised, predictable, and a little soulless, the rollercoaster represents something random, spontaneous, and maybe more than anything, something real.\" It winds through the studio's Stockholm officeThe rollercoaster is constructed from red-lacquered steel and operates in a loop around the toilets at the centre of the office's ground floor. Raised on steel supports bolted to the floor, the rollercoaster is cranked up to a height of four metres before being released to travel past the kitchen, rise above the building's entrance and pass through a seating area – wrapping around a circular table, before returning to the start. The rounded, polished car seats one person. The track is made from red-lacquered steelPerhaps unsurprisingly, the studio faced numerous challenges to make the idea of a rollercoaster in a tight office space a reality. As the studio had no knowledge of rollercoaster engineering it contacted numerous companies and engineers along with backyard rollercoaster communities. \"The challenges were endless,\" said Cromwell. \"The biggest issue was our near-zero knowledge of rollercoaster engineering, things like calculating radius, managing g-forces, and other technical essentials. \"Eventually, after hundreds of design tweaks, we had a workable plan,\" he continued. \"The next hurdle was finding someone who could bend steel pipes to our precise needs; it took ages to locate the right equipment, and buying our own pipe-bending machine was a little out of budget. Somehow, we made it happen without breaking the bank, or the ceiling.\" It has a one-person carCromwell explained that along with the technical issues, the studio also had to navigate getting permissions from the city for the unusual structure. \"The permit in Sweden, this is a complicated matter,\" he said. \"We registered the rollercoaster first as a 'steel structure' then changed it into 'interior design object'.\" \"There are no fitting classifications for indoor rollercoasters in Sweden,\" he continued. \"So there are no clear rules or legislations against them either. Honestly, we're not sure about the permits but hey, how could anyone complain on a rollercoaster?\" The car is cranked up to four metresAlong with being a fun, unique addition to the office, Cromwell believes that the rollercoaster symbolises the physicality of the studio's work compared to AI-driven design. \"The rollercoaster is a reminder of what we stand for: against the predictable, the polished, and the overly analysed,\" he explained. \"In a world where algorithms and AI shape so much of what we see and experience, everything risks becoming more uniform, almost soulless.\" \"We're all surrounded by data-driven content that's increasingly tailored to be 'attractive', yet it lacks that human touch, the imperfections, the spontaneity, the surprises,\" he continued. \"This coaster is a statement against that trend. It's unexpected, maybe even a little impractical, but it's an illustration of the spirit of exploration and imagination.\" The structure represents the studio's design ethosCromwell reports that now the rollercoaster is operating, it has become part of many of the studio's employees' daily routines. \"People definitely use the rollercoaster,\" he said. \"It's become part of our morning routine, some people start their day with a ride, and it's a great pick-me-up when someone's feeling low.\" \"Not everyone's a rollercoaster person, though, so for some, coffee wins out. It's also a popular end-of-day ritual, but the rush to pick up kids and wrap up projects sometimes means we skip that last ride,\" he continued. \"The coaster was only finished recently, so there's still a lot of excitement. We even have a camera set up on the fastest turn, which has quickly become a favourite.\" Other offices interiors with unusual playful features include MR Design Office in Japan, within which Schemata Architects hid a slide behind a mirrored wall, and Airbnb's London office, which features a \"village green\". The photography is courtesy of The Great Exhibition.  Subscribe to our newsletters Your email address New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_hero.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2134818\" data-article-id=\"2134818\"\u003e\n\n            \n            \u003cheader\u003e\n                    \n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eCreative studio \u003ca href=\"https://www.dezeen.com/tag/pjadad/\"\u003eThe Great Exhibition\u003c/a\u003e has created a permanent, fully functioning rollercoaster in its \u003ca href=\"https://www.dezeen.com/tag/office-interiors/\"\u003eoffice\u003c/a\u003e in \u003ca href=\"https://www.dezeen.com/tag/stockholm/\"\u003eStockholm\u003c/a\u003e.\u003cspan id=\"more-2134818\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eNamed The Frontal Lobe, the 60-metre-long rollercoaster winds through the seating areas, kitchen and bar on the ground floor of \u003ca href=\"https://tge1851.com/\"\u003eThe Great Exhibition\u003c/a\u003e\u0026#39;s office in the Liljeholmen district.\u003c/p\u003e\n\u003cp\u003eThe studio, formerly known as PJADAD, created the structure to demonstrate its ethos. It claims it is the \u0026#34;world\u0026#39;s first office rollercoaster\u0026#34;.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2140994\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_3.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_3-852x609.jpg\" alt=\"World\u0026#39;s first office rollercoaster\" width=\"2364\" height=\"1689\" srcset=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_3-852x609.jpg 1x, https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_3-1704x1217.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2140994\"\u003eThe Great Exhibition created the \u0026#34;world\u0026#39;s first office rollercoaster\u0026#34;\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The idea of adding a rollercoaster to our office started years ago as what many people would call an impossible dream, fun but unfeasible, and honestly, a little ridiculous,\u0026#34; The Great Exhibition\u0026#39;s creative director Per Cromwell told Dezeen.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Over the years, the rollercoaster became something more significant. It was a challenge, a commitment to keeping the human creativity,\u0026#34; he continued.\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;In a world increasingly driven by AI and algorithms, where everything is optimised, predictable, and a little soulless, the rollercoaster represents something random, spontaneous, and maybe more than anything, something real.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2141012\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_21.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_21-852x639.jpg\" alt=\"World\u0026#39;s first office rollercoaster\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_21-852x639.jpg 1x, https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_21-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2141012\"\u003eIt winds through the studio\u0026#39;s Stockholm office\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe rollercoaster is constructed from red-lacquered steel and operates in a loop around the toilets at the centre of the office\u0026#39;s ground floor.\u003c/p\u003e\n\u003cp\u003eRaised on steel supports bolted to the floor, the rollercoaster is cranked up to a height of four metres before being released to travel past the kitchen, rise above the building\u0026#39;s entrance and pass through a seating area – wrapping around a circular table, before returning to the start.\u003c/p\u003e\n\u003cp\u003eThe rounded, polished car seats one person.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2141004\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_13.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_13-852x639.jpg\" alt=\"Red indoor rollercoaster\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_13-852x639.jpg 1x, https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_13-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2141004\"\u003eThe track is made from red-lacquered steel\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003ePerhaps unsurprisingly, the studio faced numerous challenges to make the idea of a rollercoaster in a tight office space a reality.\u003c/p\u003e\n\u003cp\u003eAs the studio had no knowledge of rollercoaster engineering it contacted numerous companies and engineers along with backyard rollercoaster communities.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003e\u0026#34;The challenges were endless,\u0026#34; said Cromwell. \u0026#34;The biggest issue was our near-zero knowledge of rollercoaster engineering, things like calculating radius, managing g-forces, and other technical essentials.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Eventually, after hundreds of design tweaks, we had a workable plan,\u0026#34; he continued.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The next hurdle was finding someone who could bend steel pipes to our precise needs; it took ages to locate the right equipment, and buying our own pipe-bending machine was a little out of budget. Somehow, we made it happen without breaking the bank, or the ceiling.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2141003\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_12.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_12-852x639.jpg\" alt=\"Indoor rollercoaster\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_12-852x639.jpg 1x, https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_12-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2141003\"\u003eIt has a one-person car\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eCromwell explained that along with the technical issues, the studio also had to navigate getting permissions from the city for the unusual structure.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The permit in Sweden, this is a complicated matter,\u0026#34; he said. \u0026#34;We registered the rollercoaster first as a \u0026#39;steel structure\u0026#39; then changed it into \u0026#39;interior design object\u0026#39;.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;There are no fitting classifications for indoor rollercoasters in Sweden,\u0026#34; he continued. \u0026#34;So there are no clear rules or legislations against them either. Honestly, we\u0026#39;re not sure about the permits but hey, how could anyone complain on a rollercoaster?\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2141008\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_17-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_17-852x1136.jpg\" alt=\"Red metal track\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_17-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_17-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2141008\"\u003eThe car is cranked up to four metres\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eAlong with being a fun, unique addition to the office, Cromwell believes that the rollercoaster symbolises the physicality of the studio\u0026#39;s work compared to AI-driven design.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The rollercoaster is a reminder of what we stand for: against the predictable, the polished, and the overly analysed,\u0026#34; he explained. \u0026#34;In a world where algorithms and AI shape so much of what we see and experience, everything risks becoming more uniform, almost soulless.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;We\u0026#39;re all surrounded by data-driven content that\u0026#39;s increasingly tailored to be \u0026#39;attractive\u0026#39;, yet it lacks that human touch, the imperfections, the spontaneity, the surprises,\u0026#34; he continued.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This coaster is a statement against that trend. It\u0026#39;s unexpected, maybe even a little impractical, but it\u0026#39;s an illustration of the spirit of exploration and imagination.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2140995\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_4.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_4-852x639.jpg\" alt=\"Rollercoaster in Stockholm \" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_4-852x639.jpg 1x, https://static.dezeen.com/uploads/2024/11/office-roller-coaster-great-exhibition-stockholm_dezeen_2364_col_4-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2140995\"\u003eThe structure represents the studio\u0026#39;s design ethos\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eCromwell reports that now the rollercoaster is operating, it has become part of many of the studio\u0026#39;s employees\u0026#39; daily routines.\u003c/p\u003e\n\u003cp\u003e\u0026#34;People definitely use the rollercoaster,\u0026#34; he said. \u0026#34;It\u0026#39;s become part of our morning routine, some people start their day with a ride, and it\u0026#39;s a great pick-me-up when someone\u0026#39;s feeling low.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;Not everyone\u0026#39;s a rollercoaster person, though, so for some, coffee wins out. It\u0026#39;s also a popular end-of-day ritual, but the rush to pick up kids and wrap up projects sometimes means we skip that last ride,\u0026#34; he continued.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The coaster was only finished recently, so there\u0026#39;s still a lot of excitement. We even have a camera set up on the fastest turn, which has quickly become a favourite.\u0026#34;\u003c/p\u003e\n\u003cp\u003eOther offices interiors with unusual playful features include \u003ca href=\"https://www.dezeen.com/2011/01/14/mr-design-office-by-schemata-architecture-office/\"\u003eMR Design Office in Japan\u003c/a\u003e, within which Schemata Architects hid a slide behind a mirrored wall, and \u003ca href=\"https://www.dezeen.com/2016/05/06/airbnb-adaptable-office-space-designs-london-sao-paulo-singapore/\"\u003eAirbnb\u0026#39;s London office\u003c/a\u003e, which features a \u0026#34;village green\u0026#34;.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is courtesy of The Great Exhibition. \u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#e090928996818399a084859a85858ece838f8d\"\u003e\u003cspan data-cfemail=\"f484869d8295978db490918e91919ada979b99\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-11-14T11:15:59Z",
  "modifiedTime": "2024-11-14T10:21:07Z"
}
