{
  "id": "183b6cbf-df92-4da2-92e2-56a91dbfbe36",
  "title": "Texas Outlaws Temporary Paper Tags, Dealers Must Issue Permanent Metal Plates Upon Purchase",
  "link": "https://www.jalopnik.com/1900135/texas-outlaws-temporary-paper-tags-dealer-issue-metal-plates/",
  "description": "Starting July 1, dealers in Texas will be required to put permanent metal plates onto every car they sell and immediately register them in the buyer's name.",
  "author": "Logan K. Carter",
  "published": "Mon, 30 Jun 2025 21:52:26 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "News",
    "Crime"
  ],
  "byline": "Logan K. Carter",
  "length": 2434,
  "excerpt": "Starting July 1, dealers in Texas will be required to put permanent metal plates onto every car they sell and immediately register them in the buyer's name.",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "Many states use temporary paper license plates or tags on newly purchased cars in the interim before permanent metal license plates are issued by the Department of Motor Vehicles, but authorities say these paper tags are too easy to counterfeit and are used in crimes. Starting Tuesday, July 1, dealers in the state of Texas will be legally required to put permanent metal plates onto every car they sell and immediately register them in the buyer's name. In order to prepare for the transition, the Texas DMV told Fox 26 Houston that it has been shipping permanent metal license plates to dealers since May, and offering training sessions for months. If a dealer runs out of plates to issue, one of four colors of new temporary metal plates will be issued for different use cases. Business cases like transferring between dealerships get blue plates, out of state buyers get green plates, red plates are issued for one-day or 30-day temporary plates, and purple plates are issued when specific plates, such as specialized plates for disabled drivers, are not available. Paper plates are linked to fraud and scams The scheme behind temporary paper plates is not a new one; we even explored how dealers can scam the system with illegal fake license plates in 2023, the same year that Texas lawmakers passed the bill outlawing temporary paper plates. The bill in question, House Bill 718, was unanimously passed and endorsed by law enforcement officers from across the state. Texas has over 8 million automobiles registered to drive on its roads, and officials estimate that there were 1.8 million fraudulent paper plates on the roads in the state in 2021. The law states that it will become illegal to have paper tags on vehicles 60 days from July 1, making August 30, 2025 the deadline to get metal plates. If you sell a car privately, the DMV says the seller can remove their plate, or transfer the plate to another vehicle they own, or to the new owner, but that the seller needs to submit a Vehicle Transfer Notification to the DMV within 30 days. Private market buyers are responsible for submitting a title and registration application to their county tax assessor and obtain new plates to register the vehicle within 30 days of purchase.",
  "image": "https://www.jalopnik.com/img/gallery/texas-outlaws-temporary-paper-tags-dealers-must-issue-permanent-metal-plates-upon-purchase/l-intro-1751320221.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                \n                \n\u003cp dir=\"ltr\"\u003eMany states use \u003ca href=\"https://www.jalopnik.com/texas-woman-sold-1000-dealer-tags-without-selling-a-car-1850739569/\" target=\"_blank\"\u003etemporary paper license plates\u003c/a\u003e or tags on newly purchased cars in the interim before permanent metal license plates are issued by the Department of Motor Vehicles, but authorities say these paper tags are too easy to \u003ca href=\"https://www.jalopnik.com/customs-agents-seize-1-4-million-in-counterfeit-vehicl-1851729482/\" target=\"_blank\"\u003ecounterfeit\u003c/a\u003e and are used in crimes. Starting Tuesday, July 1, dealers in the state of Texas will be legally required to put permanent metal plates onto every car they sell and immediately register them in the buyer\u0026#39;s name.\u003c/p\u003e\n\u003cp\u003eIn order to prepare for the transition, the Texas DMV told \u003ca href=\"https://www.fox26houston.com/news/no-paper-tags-texas-car-metal-plates-july-1\" target=\"_blank\"\u003eFox 26 Houston\u003c/a\u003e that it has been shipping permanent metal license plates to dealers since May, and offering training sessions for months. If a dealer runs out of plates to issue, one of four colors of new temporary metal plates will be issued for different use cases. Business cases like transferring between dealerships get blue plates, out of state buyers get green plates, red plates are issued for one-day or 30-day temporary plates, and purple plates are issued when specific plates, such as specialized plates for disabled drivers, are not available.\u003c/p\u003e\n\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003ePaper plates are linked to fraud and scams\u003c/h2\u003e\n                                \u003cp data-post-url=\"https://www.jalopnik.com/1900135/texas-outlaws-temporary-paper-tags-dealer-issue-metal-plates/\" data-post-title=\"Texas Outlaws Temporary Paper Tags, Dealers Must Issue Permanent Metal Plates Upon Purchase\" data-slide-num=\"1\" data-post-id=\"1900135\"\u003e\n                                         \u003ciframe src=\"https://www.youtube.com/embed/PCUS_Q0vufE?v=PCUS_Q0vufE\" frameborder=\"0\" allowfullscreen=\"\" data-slide-url=\"https://www.jalopnik.com/1900135/texas-outlaws-temporary-paper-tags-dealer-issue-metal-plates/\" data-slide-num=\"1\" data-post-id=\"1900135\" data-slide-title=\"Texas Outlaws Temporary Paper Tags, Dealers Must Issue Permanent Metal Plates Upon Purchase: Paper plates are linked to fraud and scams\"\u003e\u003c/iframe\u003e\n                    \u003c/p\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eThe scheme behind temporary paper plates is not a new one; \u003ca href=\"https://www.jalopnik.com/how-dealers-scam-system-illegal-fake-license-plates-1850529433/\" target=\"_blank\"\u003ewe even explored how dealers can scam the system with illegal fake license plates in 2023\u003c/a\u003e, the same year that Texas lawmakers passed the bill outlawing temporary paper plates. The bill in question, \u003ca href=\"https://www.txdmv.gov/dealers/HB718\" target=\"_blank\"\u003eHouse Bill 718\u003c/a\u003e, was unanimously passed and endorsed by law enforcement officers from across the state. Texas has over 8 million automobiles registered to drive on its roads, and officials estimate that there were 1.8 million fraudulent paper plates on the roads in the state in 2021. The law states that it will become illegal to have paper tags on vehicles 60 days from July 1, making August 30, 2025 the deadline to get metal plates.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eIf you sell a car privately, the DMV says the seller can remove their plate, or transfer the plate to another vehicle they own, or to the new owner, but that the seller needs to submit a Vehicle Transfer Notification to the DMV within 30 days. Private market buyers are responsible for submitting a title and registration application to their county tax assessor and obtain new plates to register the vehicle within 30 days of purchase.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-30T21:52:26Z",
  "modifiedTime": "2025-06-30T21:52:26Z"
}
