{
  "id": "1d1d4378-a985-46fb-a311-522683dbdb37",
  "title": "Mahindra unveils new design studio in India",
  "link": "https://www.autocarindia.com/industry/mahindra-unveils-new-design-studio-in-india-435026#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "Mahindra and Mahindra officially inaugurated its new design studio in Mumbai today. Called the Mahindra India Design Studio (MIDS), it is located within the company’s Kandivali plant and is a major update to the earlier facility, which was set up in 2015. The company says the new studio has doubled in size and houses just over one hundred design employees.  New India studio employs over 100 designers MIDS will serve the new last-mile mobility and auto divisions It will work alongside Mahindra Advanced Design Europe in the UK Mahindra India Design Studio: what is it for? To serve both commercial and private auto divisions The upgrade has been designed to cater to Mahindra’s growing portfolio of its auto business as well as support its new businesses like its Last Mile Mobility (LME) division. MIDS has the capability to design its last mile commercial vehicles and small tractors to the brand’s trucks and buses, too. It also includes three modelling plates, one of which is large enough to handle truck cabins. A modelling plate is a work area upon which a 1:1 scale clay model can be built using a 5-axis modelling robot and skilled modellers. Speaking to Autocar India at the inauguration Ajay Saran Sharma, Sr. Vice President of Design and Head of MIDS said “the facility includes all design functions required today right from exterior, interior to quality realisation and tech HMI design too”. Has its own paint shop for clay models and body panels Mahindra says MIDS will work along with Mahindra’s global design centre – Mahindra Advanced Design Europe (MADE), situated in the UK. Speaking to Autocar India at the inauguration Pratap Bose, Mahindra’s Chief Design and Creative Officer said “both centres will exist and work together, but I’m happy that with this investment in design in India, we can attract and keep talented designers in an India automotive company”. The design centre also has a paint shop for the clay models and car panels which Bose says saves time for the design team as well as the management who can come in for quicker reviews. Also See: Maruti Wagon R takes top sales spot for fourth consecutive year Auto wholesales FY2025: Maruti, Hyundai and Tata Motors maintain top 3 positions",
  "author": "Sergius Barretto",
  "published": "Mon, 7 Apr 2025 18:24:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Sergius Barretto",
  "length": 2362,
  "excerpt": "The new design facility is a major update of Mahindra\u0026amp;#8217;s earlier design studio, which was set up in 2015 and houses over 100 employees.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "The new design facility is a major update of Mahindra’s earlier design studio, which was set up in 2015 and houses over 100 employees.Mahindra and Mahindra officially inaugurated its new design studio in Mumbai today. Called the Mahindra India Design Studio (MIDS), it is located within the company’s Kandivali plant and is a major update to the earlier facility, which was set up in 2015. The company says the new studio has doubled in size and houses just over one hundred design employees. New India studio employs over 100 designers MIDS will serve the new last-mile mobility and auto divisionsIt will work alongside Mahindra Advanced Design Europe in the UKMahindra India Design Studio: what is it for?To serve both commercial and private auto divisions The upgrade has been designed to cater to Mahindra’s growing portfolio of its auto business as well as support its new businesses like its Last Mile Mobility (LME) division. MIDS has the capability to design its last mile commercial vehicles and small tractors to the brand’s trucks and buses, too. It also includes three modelling plates, one of which is large enough to handle truck cabins. A modelling plate is a work area upon which a 1:1 scale clay model can be built using a 5-axis modelling robot and skilled modellers.Speaking to Autocar India at the inauguration Ajay Saran Sharma, Sr. Vice President of Design and Head of MIDS said “the facility includes all design functions required today right from exterior, interior to quality realisation and tech HMI design too”.Has its own paint shop for clay models and body panels Mahindra says MIDS will work along with Mahindra’s global design centre – Mahindra Advanced Design Europe (MADE), situated in the UK.Speaking to Autocar India at the inauguration Pratap Bose, Mahindra’s Chief Design and Creative Officer said “both centres will exist and work together, but I’m happy that with this investment in design in India, we can attract and keep talented designers in an India automotive company”.The design centre also has a paint shop for the clay models and car panels which Bose says saves time for the design team as well as the management who can come in for quicker reviews.Also See:Maruti Wagon R takes top sales spot for fourth consecutive yearAuto wholesales FY2025: Maruti, Hyundai and Tata Motors maintain top 3 positionsImagesVideos",
  "image": "https://img.autocarindia.com/ExtraImages/20250407062405_1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eThe new design facility is a major update of Mahindra’s earlier design studio, which was set up in 2015 and houses over 100 employees.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/mahindra\"\u003eMahindra and Mahindra\u003c/a\u003e\u003c/strong\u003e officially inaugurated its new design studio in Mumbai today. Called the Mahindra India Design Studio (MIDS), it is located within the company’s Kandivali plant and is a major update to the earlier facility, which was set up in 2015. The company says the new studio has doubled in size and houses just over one hundred design employees. \u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eNew India studio employs over 100 designers \u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003e\u003cstrong\u003eMIDS\u003c/strong\u003e will serve the new last-mile mobility and auto divisions\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eIt will work alongside \u003c/strong\u003e\u003cstrong\u003eMahindra Advanced Design Europe\u003c/strong\u003e\u003cstrong\u003e in the UK\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMahindra India Design Studio: what is it for?\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003e\u003cstrong\u003eTo serve both commercial and private auto divisions \u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eThe upgrade has been designed to cater to Mahindra’s growing portfolio of its auto business as well as support its new businesses like its Last Mile Mobility (LME) division. MIDS has the capability to design its last mile commercial vehicles and small tractors to the brand’s trucks and buses, too. It also includes three modelling plates, one of which is large enough to handle truck cabins. A modelling plate is a work area upon which a 1:1 scale clay model can be built using a 5-axis modelling robot and skilled modellers.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/News/20250407062320_3.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003eSpeaking to Autocar India at the inauguration Ajay Saran Sharma, Sr. Vice President of Design and Head of MIDS said “the facility includes all design functions required today right from exterior, interior to quality realisation and tech HMI design too”.\u003c/p\u003e\u003ch3\u003e\u003cspan\u003e\u003cstrong\u003eHas its own paint shop for clay models and body panels \u003c/strong\u003e\u003c/span\u003e\u003c/h3\u003e\u003cp\u003eMahindra says MIDS will work along with Mahindra’s global design centre – \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/made-to-be-design-hub-for-all-future-mahindra-evs-425433\"\u003eMahindra Advanced Design Europe (MADE)\u003c/a\u003e\u003c/strong\u003e, situated in the UK.\u003c/p\u003e\u003cp\u003eSpeaking to Autocar India at the inauguration Pratap Bose, Mahindra’s Chief Design and Creative Officer said “both centres will exist and work together, but I’m happy that with this investment in design in India, we can attract and keep talented designers in an India automotive company”.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://img.autocarindia.com/News/20250407062431_2.jpg?w=700\u0026amp;c=0\"/\u003e\u003c/p\u003e\u003cp\u003eThe design centre also has a paint shop for the clay models and car panels which Bose says saves time for the design team as well as the management who can come in for quicker reviews.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso See:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/industry/maruti-wagon-r-takes-top-sales-spot-for-fourth-consecutive-year-435002\"\u003e\u003cstrong\u003eMaruti Wagon R takes top sales spot for fourth consecutive year\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/industry/auto-wholesales-fy2025-maruti-hyundai-and-tata-motors-maintain-top-3-positions-435001\"\u003e\u003cstrong\u003eAuto wholesales FY2025: Maruti, Hyundai and Tata Motors maintain top 3 positions\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-435026\"\u003e\u003cul id=\"tab-id-435026\"\u003e\u003cli\u003e\u003ca id=\"tab-imghref-id-435026\" href=\"#.\" rel=\"#tab-images-container-435026\"\u003eImages\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-435026\" href=\"#.\" rel=\"#tab-videos-container-435026\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-07T18:24:00+05:30",
  "modifiedTime": null
}
