{
  "id": "23cd26ab-e130-4623-a875-60c77dcd205d",
  "title": "Suzuki puts future EVs on hold as it \"monitors\" electric car market",
  "link": "https://www.autocar.co.uk/car-news/consumer/suzuki-puts-future-evs-hold-it-monitors-electric-car-market",
  "description": "President Toshihiro Suzuki says decision down to slowdown in EV growth and popularity in cheap Chinese electric cars Suzuki has put its future electric cars on hold while it “monitors the market” amid a general slowdown in EV interest, president Toshihiro Suzuki has said. Four electric models were due before the turn of the decade as part of a $35 billion EV investment, starting with the eVitara which was launched today. These models have already been teased in silhouette form (below), and although Suzuki has yet to confirm which segments they will occupy, they are clear matches for the likes of the S-Cross and Ignis suggesting the brand will look to electrify some of its most popular models. However, at the launch of the eVitara – its first EV – Toshihiro Suzuki would not set a date for when the next electric car would arrive, nor if the target was still to launch five EVs by 2030. “We are in a very difficult situation at this moment as the sales of BEVs are slowing down,” he said, “and on the other hand affordable and cheap EVs from China are coming into the market, so it is a very difficult time to introduce [further] BEVs.” He added: “Looking at the current situations, the government incentives for BEVs are going out and [coupled] with Chinese EVs that have very strong [segment] competitiveness you have to think carefully about what type of BEV should be introduced to the market and in what time.” Speaking about the next EV, which will be “smaller than the eVitara”, Toshihiro Suzuki said: “All I can say is look forward to it, but again we have to keep watching how eVitara sales will go but also how the market trends goes [before setting a date].” Despite this, EVs are still a key part of the brand’s future. “Although I said we have to monitor the situation, that does mean we are leaving BEV development, so we are going to keep up the development,” said Toshihiro Suzuki. “But, we are not going to concentrate on just EVs,” he added, “and the other idea is to merge pathways such as with biogas fuel in India; we want to keep our development in parallel.” For Suzuki, some 48% of its annual car sales come from India, a market that while pushing towards carbon neutrality, is still heavily dependent on combustion engine vehicles. “From Suzuki point of view, EV is not the only solution,” said Toshihiro Suzuki. “Suzuki thinks [with a varied] pathway, which means hybrids of course and e-fuels and also projects such as biogas in India. So we are going for many options.\"",
  "author": "",
  "published": "Mon, 4 Nov 2024 17:51:20 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Will Rimell",
  "length": 1081,
  "excerpt": "President Toshihiro Suzuki says decision down to slowdown in EV growth and popularity in cheap Chinese electric cars",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Speaking about the next EV, which will be “smaller than the eVitara”, Toshihiro Suzuki said: “All I can say is look forward to it, but again we have to keep watching how eVitara sales will go but also how the market trends goes [before setting a date].” Despite this, EVs are still a key part of the brand’s future. “Although I said we have to monitor the situation, that does mean we are leaving BEV development, so we are going to keep up the development,” said Toshihiro Suzuki. “But, we are not going to concentrate on just EVs,” he added, “and the other idea is to merge pathways such as with biogas fuel in India; we want to keep our development in parallel.” For Suzuki, some 48% of its annual car sales come from India, a market that while pushing towards carbon neutrality, is still heavily dependent on combustion engine vehicles. “From Suzuki point of view, EV is not the only solution,” said Toshihiro Suzuki. “Suzuki thinks [with a varied] pathway, which means hybrids of course and e-fuels and also projects such as biogas in India. So we are going for many options.\"",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/suzuki-evitara-front-quarter_0.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n\u003cp\u003e\u003cimg alt=\"\" height=\"508\" width=\"768\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/suzuki_future_evs_silhouttes_.jpg?itok=RaCOmv4_\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/suzuki_future_evs_silhouttes_.jpg?itok=RaCOmv4_\"/\u003e\u003c/p\u003e\n\u003cp\u003eSpeaking about the next EV, which will be “smaller than the eVitara”, Toshihiro Suzuki said: “All I can say is look forward to it, but again we have to keep watching how eVitara sales will go but also how the market trends goes [before setting a date].”\u003c/p\u003e\n\u003cp\u003eDespite this, EVs are still a key part of the brand’s future. “Although I said we have to monitor the situation, that does mean we are leaving BEV development, so we are going to keep up the development,” said Toshihiro Suzuki.\u003c/p\u003e\n\u003cp\u003e“But, we are not going to concentrate on just EVs,” he added, “and the other idea is to merge pathways such as with biogas fuel in India; we want to keep our development in parallel.”\u003c/p\u003e\n\u003cp\u003eFor Suzuki, some 48% of its annual car sales come from India, a market that while pushing towards carbon neutrality, is still heavily dependent on combustion engine vehicles.\u003c/p\u003e\n\u003cp\u003e“From Suzuki point of view, EV is not the only solution,” said Toshihiro Suzuki. “Suzuki thinks [with a varied] pathway, which means hybrids of course and e-fuels and also projects such as biogas in India. So we are going for many options.\u0026#34;\u003c/p\u003e\n            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-04T17:51:20Z",
  "modifiedTime": null
}
