{
  "id": "2506c09a-0663-4add-966c-e5c2cec08c7a",
  "title": "Tesla’s FSD Runs Over Child Mannequin, But It’s Not To Blame",
  "link": "https://www.carscoops.com/2025/06/teslas-fsd-botches-another-test-but-its-not-to-blame/",
  "description": "Expecting a semi-autonomous driving system to be perfect is a recipe for disaster",
  "author": "Michael Gauthier",
  "published": "Sat, 14 Jun 2025 01:02:00 +0000",
  "source": "https://www.carscoops.com/feed/",
  "categories": [
    "news",
    "Autonomous",
    "Elon Musk",
    "Safety",
    "Tesla",
    "Video"
  ],
  "byline": "Michael Gauthier",
  "length": 3867,
  "excerpt": "Expecting a semi-autonomous driving system to be perfect is a recipe for disaster",
  "siteName": "Carscoops",
  "favicon": "https://www.carscoops.com/wp-content/uploads/2022/12/apple-icon-152x152-1.png",
  "text": "Expecting a semi-autonomous driving system to be perfect is a recipe for disaster June 13, 2025 at 21:02 by Michael Gauthier A series of tests shows a Tesla Model Y hitting a child-sized mannequin while using FSD. The scenario replicates a child running toward a school bus and getting struck while crossing. While the footage grabs attention, FSD (Supervised) is meant for use by a “fully attentive driver.” Two Tesla foes have joined forces to attack the company and its semi-autonomous driving technology. In this case, The Dawn Project teamed up with the Tesla Takedown movement to demonstrate “critical safety defects” in Full Self-Driving (Supervised) software. As you can see in the clips, a Tesla Model Y with the latest version of Full-Self Driving was subjected to a test where a school bus is stopped with its flashing lights and stop signs activated. A child-sized mannequin is then pulled across the street to replicate a kid attempting to catch the school bus. More: Deadly Tesla Crash Raises Questions About Vision-Based Self-Driving Systems The test was conducted eight times and The Dawn Project said, “Full Self-Driving ran down the child mannequin while illegally blowing past the school bus on every single” attempt. They added, “Tesla’s Full Self-Driving software did not disengage or even alert the driver to the fact there had been a collision on any of the test runs.” Dawn Project founder Dan O’Dowd said, “Self-driving software that illegally blows past stopped school buses and runs down children crossing the road must be banned immediately. Tesla’s failure to address this critical safety defect demonstrates Elon Musk’s utter negligence and contempt for public safety.” However, it’s important to note Full-Self Driving doesn’t mean fully autonomous. The name says it all: Full Self-Driving (Supervised). Tesla specifically states that the system is designed for “use with a fully attentive driver, who has their hands on the wheel and is prepared to take over at any moment.” That clearly wasn’t the case in these tests as an attentive driver would have stopped for the school bus, even if FSD didn’t. This effectively makes it operator error, although Tesla doesn’t exactly come out smelling like roses. Tesla Takedown Takes Aim At Electrify Expo In other news, the Tesla Takedown movement is now trying to pressure Electrify Expo to remove Tesla as an exhibitor from their events. That seems highly unlikely, but the group sent organizers an e-mail saying “Tesla is not just a car company – it’s the financial engine of Elon Musk, who is using his wealth to fund far-right politics, normalize extremism, and push unregulated tech into our communities.” The e-mail went on to say, “Every Tesla sale – and every brand showcase like Electrify Expo or car commercial on the White House lawn – helps sustain his divisive power.” While the group praised Electrify Expo’s efforts to “make electric mobility more accessible and exciting,” they stated “disassociating from Tesla would send a clear message: extremism has consequences.”",
  "image": "https://www.carscoops.com/wp-content/uploads/2025/06/Tesla-FSD-Crash-Tests002.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                    \u003cheader\u003e\n                        \n                        \u003cp\u003e\n                            Expecting a semi-autonomous driving system to be perfect is a recipe for disaster                        \u003c/p\u003e\n                        \u003cdiv\u003e\n                            \n                            \u003cp\u003eJune 13, 2025 at 21:02\u003c/p\u003e\n                            \u003cp\u003e\u003ca href=\"#thread__container\"\u003e\n\n                                \u003cimg width=\"24px\" loading=\"lazy\" height=\"22px\" alt=\"comments\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/msg.png\"/\u003e \n                                \n                            \u003c/a\u003e\u003c/p\u003e\n                        \u003c/div\u003e\n                        \u003cdiv\u003e\n                            \n                                                                                    \n                            \u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://www.carscoops.com/wp-content/uploads/webp/2025/06/Tesla-FSD-Crash-Tests002.webp 1326w, https://www.carscoops.com/wp-content/uploads/webp/2025/06/Tesla-FSD-Crash-Tests002-400x225.webp 400w, https://www.carscoops.com/wp-content/uploads/webp/2025/06/Tesla-FSD-Crash-Tests002-1024x576.webp 1024w, https://www.carscoops.com/wp-content/uploads/webp/2025/06/Tesla-FSD-Crash-Tests002-768x432.webp 768w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\"/\u003e\u003cimg src=\"https://www.carscoops.com/wp-content/uploads/2025/06/Tesla-FSD-Crash-Tests002-1024x576.jpg\" srcset=\"https://www.carscoops.com/wp-content/uploads/2025/06/Tesla-FSD-Crash-Tests002.jpg 1326w, https://www.carscoops.com/wp-content/uploads/2025/06/Tesla-FSD-Crash-Tests002-400x225.jpg 400w, https://www.carscoops.com/wp-content/uploads/2025/06/Tesla-FSD-Crash-Tests002-1024x576.jpg 1024w, https://www.carscoops.com/wp-content/uploads/2025/06/Tesla-FSD-Crash-Tests002-768x432.jpg 768w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\" alt=\" Tesla’s FSD Runs Over Child Mannequin, But It’s Not To Blame\" width=\"1326\" height=\"746\"/\u003e\u003c/picture\u003e                        \u003c/div\u003e\n                        \n                        \u003cp\u003e\n                            \u003ch4\u003e\n                                by \u003ca href=\"https://www.carscoops.com/author/mikecarscoops-com/\"\u003e\u003cspan\u003eMichael Gauthier\u003c/span\u003e\u003c/a\u003e\n                            \u003c/h4\u003e    \n                        \u003c/p\u003e\n                    \u003c/header\u003e\n\n                    \u003cdiv\u003e\n                        \n                        \n                        \n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eA series of tests shows a Tesla Model Y hitting a child-sized mannequin while using FSD.\u003c/li\u003e\n\n\n\n\u003cli\u003eThe scenario replicates a child running toward a school bus and getting struck while crossing.\u003c/li\u003e\n\n\n\n\u003cli\u003eWhile the footage grabs attention, FSD (Supervised) is meant for use by a “fully attentive driver.”\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003eTwo Tesla foes have joined forces to attack the company and its semi-autonomous driving technology. In this case, \u003ca href=\"https://www.carscoops.com/2022/11/organization-that-said-tesla-fsd-failed-to-avoid-child-sized-dummy-runs-full-page-ad-in-nyt/\"\u003eThe Dawn Project\u003c/a\u003e teamed up with the Tesla Takedown movement to demonstrate “critical safety defects” in Full Self-Driving (Supervised) software.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eAs you can see in the clips, a \u003ca href=\"https://www.carscoops.com/2025/04/tesla-finally-launches-standard-model-y-juniper-from-48990/\"\u003eTesla Model Y\u003c/a\u003e with the latest version of Full-Self Driving was subjected to a test where a school bus is stopped with its flashing lights and stop signs activated. A child-sized mannequin is then pulled across the street to replicate a kid attempting to catch the school bus.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMore: \u003ca href=\"https://www.carscoops.com/2025/06/tesla-fatal-crash-arizona-fsd-vision-only-safety-investigation/\"\u003eDeadly Tesla Crash Raises Questions About Vision-Based Self-Driving Systems\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe test was conducted eight times and The Dawn Project said, “Full Self-Driving ran down the child mannequin while illegally blowing past the school bus on every single” attempt. They added, “Tesla’s Full Self-Driving software did not disengage or even alert the driver to the fact there had been a collision on any of the test runs.”\u003c/p\u003e\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n\n\u003cp\u003eDawn Project founder Dan O’Dowd said, “Self-driving software that illegally blows past stopped school buses and runs down children crossing the road must be banned immediately. Tesla’s failure to address this critical safety defect demonstrates \u003ca href=\"https://www.carscoops.com/tag/elon-musk/\"\u003eElon Musk’s\u003c/a\u003e utter negligence and contempt for public safety.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ciframe src=\"\" frameborder=\"0\" allow=\"autoplay; fullscreen; picture-in-picture; clipboard-write; encrypted-media; web-share\" title=\"3 Minutes - Footage of The Dawn Project and Tesla Takedown’s Live Austin Safety Tests of Tesla FSD\" data-src=\"https://player.vimeo.com/video/1093108701?h=2fd4e51b61\u0026amp;badge=0\u0026amp;autopause=0\u0026amp;player_id=0\u0026amp;app_id=58479\" onload=\"resizeIframe(this,this.parentElement);\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, it’s important to note Full-Self Driving doesn’t mean \u003ca href=\"https://www.carscoops.com/tag/autonomous/\"\u003efully autonomous\u003c/a\u003e. The name says it all: Full Self-Driving (Supervised). Tesla \u003ca href=\"https://www.tesla.com/fsd\"\u003especifically states\u003c/a\u003e that the system is designed for “use with a fully attentive driver, who has their hands on the wheel and is prepared to take over at any moment.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThat clearly wasn’t the case in these tests as an attentive driver would have stopped for the school bus, even if FSD didn’t. This effectively makes it operator error, although Tesla doesn’t exactly come out smelling like roses.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ciframe src=\"\" frameborder=\"0\" allow=\"autoplay; fullscreen; picture-in-picture; clipboard-write; encrypted-media; web-share\" title=\"Raw Footage - Live Demonstration of Tesla Full Self-Driving\u0026#39;s Critical Safety Defects in Collaboration with Tesla Takedown\" data-src=\"https://player.vimeo.com/video/1093113127?h=e1fb6c359c\u0026amp;badge=0\u0026amp;autopause=0\u0026amp;player_id=0\u0026amp;app_id=58479\" onload=\"resizeIframe(this,this.parentElement);\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eTesla Takedown Takes Aim At Electrify Expo\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eIn other news, the Tesla Takedown movement is now trying to pressure Electrify Expo to remove Tesla as an exhibitor from their events. That seems highly unlikely, but the group sent organizers an e-mail saying “Tesla is not just a car company – it’s the financial engine of Elon Musk, who is using his wealth to fund far-right politics, normalize extremism, and push unregulated tech into our communities.”\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eThe e-mail went on to say, “Every Tesla sale – and every brand showcase like Electrify Expo or car commercial on the White House lawn – helps sustain his divisive power.” While the group praised Electrify Expo’s efforts to “make electric mobility more accessible and exciting,” they stated “disassociating from Tesla would send a clear message: extremism has consequences.”\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\n\n                        \n                    \u003c/div\u003e\n\n                    \n                                        \n                    \n                \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-13T21:02:00-04:00",
  "modifiedTime": "2025-06-14T00:18:18Z"
}
