{
  "id": "2ae4a318-3886-4804-ace3-946fd0ee968e",
  "title": "Why Some Trucks Still Use Leaf Springs In 2025",
  "link": "https://www.jalopnik.com/1842170/why-trucks-still-use-leaf-springs/",
  "description": "With modern technology, you would expect antiquated gear to be a thing of the past. However, even in 2025, some trucks can be found with old leaf springs.",
  "author": "Nicholas Werner",
  "published": "Sun, 27 Apr 2025 20:25:00 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "Jalopnik Explains"
  ],
  "byline": "Nicholas Werner",
  "length": 4745,
  "excerpt": "With modern technology, you would expect antiquated gear to be a thing of the past. However, even in 2025, some trucks can be found with old leaf springs.",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "Nurma Agung Firmansyah /Getty Leaf springs were a hot new technology several years ago, and by \"several years,\" we mean the Bronze Age. Vehicles have evolved somewhat since the chariot, what with trotting and biting horses being replaced by horsepower, so you might be forgiven for thinking that this suspension system from elder days belongs in a museum. For the most part, you'd be right: Modern cars almost universally use coil springs instead, which are more comfortable and more adjustable. They do a great job of making sure your ride is smooth and comfortable on your commute, but then stiff and rigid when it's time to throw it around a corner on a racetrack.  So in 2025, at a time when cars are getting crammed with more and more cutting-edge technology, why do trucks and even some SUVs still use old-school horse-and-buggy leaf springs? Turns out, there are some very good reasons for that, because while leaf springs might be from the Bronze Age, it's the coil springs that have an Achilles heel: They can't handle a lot of weight. The key strength of leaf springs is, well, strength. They can take on a much higher total load without risking failure. Plus, they're everybody's favorite thing – cheap! What are leaf springs? Toa55/Getty Images At its most basic explanation, a leaf spring is a thin strip of steel bent into a curve, like a smile. Its lowest point connects to the axle. This way, if the axle moves upwards or downwards, like after hitting a bump, that motion is resisted by the steel, which bends as it absorbs the move. Because a leaf spring is mostly horizontal, along that smile-shaped curve, the force of a bump against the heaviness of the vehicle is distributed all along it. In other words, there's no one point of the leaf spring taking all the force directly, and since modern leaf springs are actually many steel strips stacked on top of one another, that force is distributed even further. That means leaf springs can take a beating over rough roads with heavy loads and keep on working, which makes them deal for long-haul trucks and the best off-road vehicles. Of course, with enough mileage, any part will fail. So if your vehicle is constantly driving across the country, like long-haul trucks, your suspension will likely need to be replaced with some frequency. That means leaf springs, which are cheaper and can add up to big savings quickly. So you're not wrong — leaf springs are a technology your most distant ancestors might have been familiar with. However, so are wheels, and there's a reason we still use those in 2025. What about coil springs? Aleksei Kochev/Shutterstock The main problem with leaf springs is that each of those steel strips has friction with the others it touches, meaning that it takes a bit of energy to get them bending in the first place to overcome the friction. So, as a matter of energy, more of the bumps in the road make it into the chassis — and thus, your seat — than you might otherwise like. That discomfort is why coil springs replaced them in basically all modern cars. Coil springs, which are basically just steel loops wrapped around a strut, pretty much eliminate any frictional issues, meaning they start absorbing the bump right away. Because of this, coil springs are more comfortable for passengers than leaf springs. What's more, coils can be easily tuned for either smoothness or rigid performance, giving them great flexibility, given your preferences. For lighter vehicles, they're the obvious choice. Their weakness is that they are mostly vertical, meaning the up-down force of a bump versus the weight of the vehicle is going to be heavily concentrated. Under heavy loads in heavy vehicles, a coil spring would be likely to snap. Even so, trucks and SUVs often have coil springs on their front axle for the comfort of the passengers. It's the rear axle, underneath the cargo, that tends to need those rugged leaf springs to handle the burden.",
  "image": "https://www.jalopnik.com/img/gallery/why-some-trucks-still-use-leaf-springs-in-2025/l-intro-1745432708.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                \n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1842170/why-trucks-still-use-leaf-springs/\" data-post-title=\"Why Some Trucks Still Use Leaf Springs In 2025\" data-slide-num=\"0\" data-post-id=\"1842170\"\u003e\n                                             \u003cpicture id=\"p152111e75126cf2c17c34dbf24a74eac\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/why-some-trucks-still-use-leaf-springs-in-2025/intro-1745432708.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/why-some-trucks-still-use-leaf-springs-in-2025/intro-1745432708.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/why-some-trucks-still-use-leaf-springs-in-2025/intro-1745432708.jpg\" data-slide-url=\"https://www.jalopnik.com/1842170/why-trucks-still-use-leaf-springs/\" data-post-id=\"1842170\" data-slide-num=\"0\" data-slide-title=\"Why Some Trucks Still Use Leaf Springs In 2025: \" width=\"780\" height=\"438\" alt=\"A set of leaf springs on a truck\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNurma Agung Firmansyah /Getty\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp\u003eLeaf springs were a hot new technology several years ago, and by \u0026#34;several years,\u0026#34; we mean the Bronze Age. Vehicles have evolved somewhat since the chariot, what with \u003ca href=\"https://www.jalopnik.com/i-may-not-know-much-about-horses-but-by-god-ill-learn-1851318996/\" target=\"_blank\"\u003etrotting and biting horses\u003c/a\u003e being replaced by horsepower, so you might be forgiven for thinking that this suspension system from elder days belongs in a museum.\u003c/p\u003e\n\u003cp\u003eFor the most part, you\u0026#39;d be right: Modern cars almost universally use coil springs instead, which are more comfortable and more adjustable. They do a great job of making sure your ride is smooth and comfortable on your commute, but then stiff and rigid when it\u0026#39;s time to throw it around a corner on a racetrack. \u003c/p\u003e\n\u003cp\u003eSo in 2025, at a time when cars are getting \u003ca href=\"https://www.jalopnik.com/drivers-hate-the-tech-in-cars-1851631523/\" target=\"_blank\"\u003ecrammed with more and more cutting-edge technology\u003c/a\u003e, why do trucks and even some SUVs still use old-school horse-and-buggy leaf springs? Turns out, there are some very good reasons for that, because while leaf springs might be from the Bronze Age, it\u0026#39;s the coil springs that have an Achilles heel: They can\u0026#39;t handle a lot of weight. The key strength of leaf springs is, well, strength. They can take on a much higher total load without risking failure. Plus, they\u0026#39;re everybody\u0026#39;s favorite thing – cheap!\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eWhat are leaf springs?\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1842170/why-trucks-still-use-leaf-springs/\" data-post-title=\"Why Some Trucks Still Use Leaf Springs In 2025\" data-slide-num=\"1\" data-post-id=\"1842170\"\u003e\n                                             \u003cpicture id=\"pf7a03e47982776da2004ac7f1edaa00b\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/why-some-trucks-still-use-leaf-springs-in-2025/what-are-leaf-springs-1745432709.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/why-some-trucks-still-use-leaf-springs-in-2025/what-are-leaf-springs-1745432709.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/why-some-trucks-still-use-leaf-springs-in-2025/what-are-leaf-springs-1745432709.jpg\" data-slide-url=\"https://www.jalopnik.com/1842170/why-trucks-still-use-leaf-springs/\" data-post-id=\"1842170\" data-slide-num=\"1\" data-slide-title=\"Why Some Trucks Still Use Leaf Springs In 2025: What are leaf springs?\" width=\"780\" height=\"438\" alt=\"Leaf springs connected to a truck\u0026#39;s axle\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eToa55/Getty Images\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eAt its most basic explanation, a leaf spring is a thin strip of steel bent into a curve, like a smile. Its lowest point connects to the axle. This way, if the axle moves upwards or downwards, like after hitting a bump, that motion is resisted by the steel, which bends as it absorbs the move.\u003c/p\u003e\n\u003cp\u003eBecause a leaf spring is mostly horizontal, along that smile-shaped curve, the force of a bump against the heaviness of the vehicle is distributed all along it. In other words, there\u0026#39;s no one point of the leaf spring taking all the force directly, and since modern leaf springs are actually many steel strips stacked on top of one another, that force is distributed even further. That means leaf springs can take a beating over rough roads with heavy loads and keep on working, which makes them deal for long-haul trucks and \u003ca href=\"https://www.jalopnik.com/the-best-off-roaders-of-all-time-according-to-you-1851624101/\" target=\"_blank\"\u003ethe best off-road vehicles\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eOf course, with enough mileage, any part will fail. So if your vehicle is constantly driving across the country, like long-haul trucks, your suspension will likely need to be replaced with some frequency. That means leaf springs, which are cheaper and can add up to big savings quickly. So you\u0026#39;re not wrong — leaf springs are a technology your most distant ancestors might have been familiar with. However, so are wheels, and there\u0026#39;s a reason we still use those in 2025.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eWhat about coil springs?\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1842170/why-trucks-still-use-leaf-springs/\" data-post-title=\"Why Some Trucks Still Use Leaf Springs In 2025\" data-slide-num=\"2\" data-post-id=\"1842170\"\u003e\n                                             \u003cpicture id=\"pee1416b4ff53beffc4f9a0f16657d655\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/why-some-trucks-still-use-leaf-springs-in-2025/what-about-coil-springs-1745432710.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/why-some-trucks-still-use-leaf-springs-in-2025/what-about-coil-springs-1745432710.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/why-some-trucks-still-use-leaf-springs-in-2025/what-about-coil-springs-1745432710.jpg\" data-slide-url=\"https://www.jalopnik.com/1842170/why-trucks-still-use-leaf-springs/\" data-post-id=\"1842170\" data-slide-num=\"2\" data-slide-title=\"Why Some Trucks Still Use Leaf Springs In 2025: What about coil springs?\" width=\"780\" height=\"438\" alt=\"Black leaf springs in a truck\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eAleksei Kochev/Shutterstock\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eThe main problem with leaf springs is that each of those steel strips has friction with the others it touches, meaning that it takes a bit of energy to get them bending in the first place to overcome the friction. So, as a matter of energy, more of the bumps in the road make it into the chassis — and thus, your seat — than you might otherwise like. That discomfort is why coil springs replaced them in basically all modern cars.\u003c/p\u003e\n\u003cp\u003eCoil springs, which are basically just steel loops wrapped around a strut, pretty much eliminate any frictional issues, meaning they start absorbing the bump right away. Because of this, coil springs are more comfortable for passengers than leaf springs. What\u0026#39;s more, coils can be easily tuned for either smoothness or rigid performance, giving them great flexibility, given your preferences. For lighter vehicles, they\u0026#39;re the obvious choice.\u003c/p\u003e\n\u003cp\u003eTheir weakness is that they are mostly vertical, meaning the up-down force of a bump versus the weight of the vehicle is going to be heavily concentrated. Under heavy loads in heavy vehicles, a coil spring would be likely to snap. Even so, trucks and SUVs often have coil springs on their front axle for the comfort of the passengers. It\u0026#39;s the rear axle, underneath the cargo, that tends to need those rugged leaf springs to handle the burden.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-04-27T20:25:00Z",
  "modifiedTime": "2025-04-27T20:25:00Z"
}
