{
  "id": "30514e2c-3677-423f-8372-e4e0047a06dc",
  "title": "Original-Owner 2002 Morgan Plus 8",
  "link": "https://bringatrailer.com/listing/2002-morgan-plus-8-5/",
  "description": "This 2002 Morgan Plus 8 was acquired new by the seller from Cantab Motors of Purcellville, Virginia, and has since traveled approximately 12k miles. Finished in black over Claret leather, the car is powered by a 4.0-liter V8 paired with a five-speed manual transmission, and it has Rutherford shock absorbers, aftermarket engine-management software, a stainless-steel dual exhaust system, and a Moto-Lita steering wheel. This Plus 8 is offered with build photos, a certificate of origin, a 2002 sales invoice, a hood and tonneau cover, side curtains, service records, two keys, and a clean Ohio title in the seller's name.",
  "author": "bringatrailer",
  "published": "Sat, 19 Oct 2024 20:50:17 +0000",
  "source": "https://bringatrailer.com/feed/",
  "categories": null,
  "byline": "Update Credit Card",
  "length": 2766,
  "excerpt": "Bid for the chance to own a Original-Owner 2002 Morgan Plus 8 at auction with Bring a Trailer, the home of the best vintage and classic cars online. Lot #168,246.",
  "siteName": "Bring a Trailer",
  "favicon": "https://bringatrailer.com/wp-content/themes/bringatrailer/assets/img/apple-touch-icon-ipad-retina-152x152.png?v=http://ee39140c5f",
  "text": "This 2002 Morgan Plus 8 was acquired new by the seller from Cantab Motors of Purcellville, Virginia, and has since traveled approximately 12k miles. Finished in black over Claret leather, the car is powered by a 4.0-liter V8 paired with a five-speed manual transmission, and it has Rutherford shock absorbers, aftermarket engine-management software, a stainless-steel dual exhaust system, and a Moto-Lita steering wheel. This Plus 8 is offered with build photos, a certificate of origin, a 2002 sales invoice, a hood and tonneau cover, side curtains, service records, two keys, and a clean Ohio title in the seller’s name. Exterior details include triple windshield wipers, a driver’s side mirror, and a high-mount third brake light. Body and lighting modifications completed in 2003 by C. Cook Enterprises of Erlanger, Kentucky, are itemized in service records shown in the gallery below. Rutherford adjustable shock absorbers were sourced in 2016, and the 15″ wheels were mounted with 195/65 Michelin CrossClimate tires in 2020. The brake system has braided stainless-steel lines, cross-drilled ventilated front rotors, and Alfin finned rear drums. The brake fluid was bled and the brakes were adjusted in 2024. The sport seats are trimmed in Muirhead Shetland Claret leather upholstery, and burr walnut trim accents the dashboard. A Pioneer stereo is fitted, and Wolf Performance pedals were installed in 2022. The 14″ wood-rimmed Moto-Lita steering wheel is stained to match the dash and frames cream-dial VDO instruments. The digital odometer indicates fewer than 12k miles. The aluminum 4.0-liter Rover V8 has a replacement aluminum radiator and an oil cooler with braided stainless lines in addition to aftermarket chips for its GEMS engine management. The exhaust system was replaced in 2006 with components sourced from RPi Engineering of Norwich, England, including stainless-steel exhaust manifolds and downpipes linked with 100-cell catalytic converters. Power is supplied to the rear wheels through an R380 five-speed manual transmission and a limited-slip differential. Photos of the build process are included in the sale along with service records, side curtains, a 2002 sales invoice, and other items pictured at the end of the gallery. The Carfax report is free of accidents or other reported damage. You are not connected to real-time updates. Attempting to connect. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.",
  "image": "https://bringatrailer.com/wp-content/uploads/2024/08/Morgan-11-43402-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv tabindex=\"0\"\u003e\n\t\t\u003cp\u003eThis 2002 Morgan Plus 8 was acquired new by the seller from Cantab Motors of Purcellville, Virginia, and has since traveled approximately 12k miles. Finished in black over Claret leather, the car is powered by a 4.0-liter V8 paired with a five-speed manual transmission, and it has Rutherford shock absorbers, aftermarket engine-management software, a stainless-steel dual exhaust system, and a Moto-Lita steering wheel. This Plus 8 is offered with build photos, a certificate of origin, a 2002 sales invoice, a hood and tonneau cover, side curtains, service records, two keys, and a clean Ohio title in the seller’s name.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/Morgan-72-41052-scaled.jpg?w=620\u0026amp;resize=620%2C414\" alt=\"Original-Owner 2002 Morgan Plus 8\" width=\"620\" height=\"414\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eExterior details include triple windshield wipers, a driver’s side mirror, and a high-mount third brake light. Body and lighting modifications completed in 2003 by C. Cook Enterprises of Erlanger, Kentucky, are itemized in service records shown in the gallery below.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/Morgan-13-43432-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"Original-Owner 2002 Morgan Plus 8\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eRutherford adjustable shock absorbers were sourced in 2016, and the 15″ wheels were mounted with 195/65 Michelin CrossClimate tires in 2020. The brake system has braided stainless-steel lines, cross-drilled ventilated front rotors, and Alfin finned rear drums. The brake fluid was bled and the brakes were adjusted in 2024.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/Morgan-86-41282-scaled.jpg?w=620\u0026amp;resize=620%2C414\" alt=\"Original-Owner 2002 Morgan Plus 8\" width=\"620\" height=\"414\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe sport seats are trimmed in Muirhead Shetland Claret leather upholstery, and burr walnut trim accents the dashboard. A Pioneer stereo is fitted, and Wolf Performance pedals were installed in 2022.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/Morgan_2-5-38279-scaled.jpg?w=620\u0026amp;resize=620%2C414\" alt=\"Original-Owner 2002 Morgan Plus 8\" width=\"620\" height=\"414\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe 14″ wood-rimmed Moto-Lita steering wheel is stained to match the dash and frames cream-dial VDO instruments. The digital odometer indicates fewer than 12k miles.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/Morgan-109-43189-scaled.jpg?w=620\u0026amp;resize=620%2C414\" alt=\"Original-Owner 2002 Morgan Plus 8\" width=\"620\" height=\"414\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe aluminum 4.0-liter Rover V8 has a replacement aluminum radiator and an oil cooler with braided stainless lines in addition to aftermarket chips for its GEMS engine management. The exhaust system was replaced in 2006 with components sourced from RPi Engineering of Norwich, England, including stainless-steel exhaust manifolds and downpipes linked with 100-cell catalytic converters.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/Morgan-14-39505-scaled.jpg?w=620\u0026amp;resize=620%2C414\" alt=\"Original-Owner 2002 Morgan Plus 8\" width=\"620\" height=\"414\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003ePower is supplied to the rear wheels through an R380 five-speed manual transmission and a limited-slip differential.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2024/08/Morgan-6-43332-scaled.jpg?w=620\u0026amp;resize=620%2C414\" alt=\"Original-Owner 2002 Morgan Plus 8\" width=\"620\" height=\"414\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003ePhotos of the build process are included in the sale along with service records, side curtains, a 2002 sales invoice, and other items pictured at the end of the gallery.\u003c/p\u003e\n\n\u003cp\u003eThe Carfax report is free of accidents or other reported damage.\u003c/p\u003e\n\t\u003c/div\u003e\u003cp\u003e\n\t\tYou are not connected to real-time updates. Attempting to connect.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
