{
  "id": "336904b2-71eb-4d9b-b2a9-0d2d1862d3c9",
  "title": "Renault 5 vs Ford Capri: When do retro cars hit the mark?",
  "link": "https://www.autocar.co.uk/opinion/new-cars/renault-5-vs-ford-capri-when-do-retro-cars-hit-mark",
  "description": "Reprising an old nameplate is nothing new and has proven successful for brands like Renault To nobody’s great surprise, the other day the Renault 5 and Alpine A290 jointly won the 2025 Car of the Year award (the original and still the best of the big international car awards thingies). I haven’t driven the regular model, but I have driven the performance variant and enjoyed it very much. A friend of a relative has decided to order one on the back of my review, so I hope I wasn’t wrong. Anyway, what also appealed to them about the 5/A290 is the treatment that Renault has given this car, resurrecting not just a famous name but also the looks to go with it. In the face of huge competition not just from traditional rivals but also a surging Chinese car industry, it’s a trick that has been recommended by marketers and brewing for a while. The idea is to remind customers that one has been making cars for a long time and is particularly good at it, so this is a model you can trust. Hence if you remember the 5 from the first time around, you will have a slightly warm, fuzzy feeling towards the new one already. China’s SAIC bought and uses the MG brand here for precisely that reason, but applying the heritage trick to a particular model is an advantage that young car makers can’t mimic. For some customers and in market research clinics, maybe it doesn’t register, but there are enough new Fiat 500s and Minis on the road to suggest it’s a strategy that works. It’s almost a surprise to me that more car makers don’t do it more often – but then I talk to some designers and realise why. They think it’s clear that you don’t progress in life by looking backwards, that the world moves ever onwards and they didn’t become designers or creatives for a living to just redraw something somebody did 30 years ago. Many, many designers are allergic to retro. They would rather create icons than recreate them. Think of bands that don’t like playing their early hits, and they even wrote them. I get it. But at a point, if it’s clear that it will be what customers want, because it confers a sense of familiarity and trust or nostalgia, it takes dispassionate leadership to say: “Suck it up, team, and get on with it.” (I’m not suggesting this is what happened at Renault, by the way; the designers there might have all loved the idea from the outset.) And in Renault’s case, on early showing of interest, it looks like it will pay off. Less convincing is the approach of Ford, a company I worry about. It has found making money out of cars in Europe difficult in the past, which has bothered it less than it might other manufacturers, because it sells so many vans here (it’s our biggest light commercial vehicle provider). If it wasn’t for the cars living alongside them, it wouldn’t be able to utilise economies of scale to make the overall operation profitable. Cars and vans have fed happily alongside each other. But the cars have to make a contribution and, particularly in the UK, where Ford has been under-equipped to cope with the zero-emission vehicle mandate, I wonder how bad the situation is. Ford has half of the retro idea right, by bringing back a classic name, but for me and I think a lot of the buying public, it’s not hitting the mark without a fitting product attached to it. How much would you like an actual Capri that looked the bomb – a drop-dead update of the classic coupé? Yes, me too. But something called a Capri, a Mustang or an Explorer or whatever that doesn’t have killer looks and does the same kind of thing and looks as normal and unfamiliar as any number of other models and, well, what’s the hook? Why would I be interested, beyond thinking that this wasn’t what the name was designed for? If I were Ford, or indeed another established car maker in the squeezed middle, I would swallow my pride, find a big name from my back catalogue and attach the right looks to it.",
  "author": "",
  "published": "Sat, 1 Feb 2025 08:01:31 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Opinion"
  ],
  "byline": "Matt Prior",
  "length": 2265,
  "excerpt": "Reprising an old nameplate is nothing new and has proven successful for brands like Renault",
  "siteName": "Autocar",
  "favicon": "",
  "text": "To nobody’s great surprise, the other day the Renault 5 and Alpine A290 jointly won the 2025 Car of the Year award (the original and still the best of the big international car awards thingies). I haven’t driven the regular model, but I have driven the performance variant and enjoyed it very much. A friend of a relative has decided to order one on the back of my review, so I hope I wasn’t wrong. Anyway, what also appealed to them about the 5/A290 is the treatment that Renault has given this car, resurrecting not just a famous name but also the looks to go with it. In the face of huge competition not just from traditional rivals but also a surging Chinese car industry, it’s a trick that has been recommended by marketers and brewing for a while. The idea is to remind customers that one has been making cars for a long time and is particularly good at it, so this is a model you can trust. Hence if you remember the 5 from the first time around, you will have a slightly warm, fuzzy feeling towards the new one already. China’s SAIC bought and uses the MG brand here for precisely that reason, but applying the heritage trick to a particular model is an advantage that young car makers can’t mimic. For some customers and in market research clinics, maybe it doesn’t register, but there are enough new Fiat 500s and Minis on the road to suggest it’s a strategy that works. It’s almost a surprise to me that more car makers don’t do it more often – but then I talk to some designers and realise why. They think it’s clear that you don’t progress in life by looking backwards, that the world moves ever onwards and they didn’t become designers or creatives for a living to just redraw something somebody did 30 years ago. Many, many designers are allergic to retro. They would rather create icons than recreate them. Think of bands that don’t like playing their early hits, and they even wrote them. I get it. But at a point, if it’s clear that it will be what customers want, because it confers a sense of familiarity and trust or nostalgia, it takes dispassionate leadership to say: “Suck it up, team, and get on with it.” (I’m not suggesting this is what happened at Renault, by the way; the designers there might have all loved the idea from the outset.)",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/retro-car-names-prior-column.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eTo nobody’s great surprise, the other day the \u003ca href=\"https://www.autocar.co.uk/car-review/renault/5\"\u003eRenault 5\u003c/a\u003e and \u003ca href=\"https://www.autocar.co.uk/car-review/alpine/a290\"\u003eAlpine A290\u003c/a\u003e jointly won the 2025 Car of the Year award (the original and still the best of the big international car awards thingies).\u003c/p\u003e\n\u003cp\u003eI haven’t driven the regular model, but I have driven the performance variant and enjoyed it very much. A friend of a relative has decided to order one on the back of my review, so I hope I wasn’t wrong.\u003c/p\u003e\n\u003cp\u003eAnyway, what also appealed to them about the 5/A290 is the treatment that \u003ca href=\"https://www.autocar.co.uk/car-review/renault\"\u003eRenault \u003c/a\u003ehas given this car, resurrecting not just a famous name but also the looks to go with it.\u003c/p\u003e\n\n\u003cp\u003eIn the face of huge competition not just from traditional rivals but also a surging Chinese car industry, it’s a trick that has been recommended by marketers and brewing for a while.\u003c/p\u003e\n\u003cp\u003eThe idea is to remind customers that one has been making cars for a long time and is particularly good at it, so this is a model you can trust. Hence if you remember the 5 from the first time around, you will have a slightly warm, fuzzy feeling towards the new one already.\u003c/p\u003e\n\u003cp\u003eChina’s SAIC bought and uses the \u003ca href=\"https://www.autocar.co.uk/car-review/mg-motor\"\u003eMG\u003c/a\u003e brand here for precisely that reason, but applying the heritage trick to a particular model is an advantage that young car makers can’t mimic.\u003c/p\u003e\n\u003cp\u003eFor some customers and in market research clinics, maybe it doesn’t register, but there are enough new \u003ca href=\"https://www.autocar.co.uk/car-review/fiat/500\"\u003eFiat 500s\u003c/a\u003e and \u003ca href=\"https://www.autocar.co.uk/car-review/mini\"\u003eMinis \u003c/a\u003eon the road to suggest it’s a strategy that works.\u003c/p\u003e\n\u003cp\u003eIt’s almost a surprise to me that more car makers don’t do it more often – but then I talk to some designers and realise why.\u003c/p\u003e\n\u003cp\u003eThey think it’s clear that you don’t progress in life by looking backwards, that the world moves ever onwards and they didn’t become designers or creatives for a living to just redraw something somebody did 30 years ago.\u003c/p\u003e\n\u003cp\u003eMany, many designers are allergic to retro. They would rather create icons than recreate them. Think of bands that don’t like playing their early hits, and they even wrote them.\u003c/p\u003e\n\u003cp\u003eI get it. But at a point, if it’s clear that it will be what customers want, because it confers a sense of familiarity and trust or nostalgia, it takes dispassionate leadership to say: “Suck it up, team, and get on with it.” (I’m not suggesting this is what happened at Renault, by the way; the designers there might have all loved the idea from the outset.)\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-01T08:01:31Z",
  "modifiedTime": null
}
