{
  "id": "33e725ba-7386-4bb5-83f6-86767b594090",
  "title": "Maruti e Vitara features, colour options revealed",
  "link": "https://www.autocarindia.com/car-news/maruti-e-vitara-features-colour-options-revealed-434387#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "In the run up to the Maruti e Vitara's launch in March, more details about the brand’s first EV are surfacing. We now have details of the features and safety kit the top-spec e Vitara will come with, and the colour options that Maurit will offer on its Tata Curvv EV and Mahindra BE 6 rival. Maruti e Vitara colours Maruti Suzuki will offer the e Vitara with 10 exterior colour options – six monotone and four dual-tone. The six single-tone colours are Nexa Blue, Splendid Silver, Arctic White, Grandeur Grey, Bluish Black and Opulent Red. The dual-tone colours will get a black roof and A- and B-pillars, with contrasting Arctic White, Land Breeze Green, Splendid Silver and Opulent Red colour options. Maruti e Vitara feature highlights LED headlights, Daytime Running Lamps and tail-lights 18-inch wheels Active air vents on grille Panoramic sunroof Multi-colour interior ambient lighting Wireless charger 10.25-inch digital instrument cluster 10.1-inch infotainment touchscreen Wireless Apple CarPlay and Android Auto Infinity by Harman audio system In-car connectivity tech Single-zone auto climate control PM 2.5 air filter Ventilated front seats 10-way power adjustable driver's seat Reclining, sliding and split (60:40) rear seats Drive modes – Eco, Normal, Sport Snow mode One-pedal driving and regen modes   Maruti e Vitara safety kit Level 2 ADAS suite including lane keep assist, adaptive cruise control, etc. 7 airbags Blind spot monitor Tyre pressure monitor 360-degree camera Front and rear parking sensors Rear disc brakes Electronic parking brake with auto-hold function Acoustic Vehicle Alarm System (AVAS) – for pedestrians Also see: Maruti e Vitara walkaround video at Auto Expo 2025 EV charger every 5-10km is the goal: Maruti MD Takeuchi Maruti low cost electric hatchback in the works",
  "author": "Rivan RS",
  "published": "Tue, 28 Jan 2025 16:50:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Rivan RS",
  "length": 1887,
  "excerpt": "Maruti\u0026#39;s first EV, the e Vitara, will come with 10 colour options that include four dual-tone exterior finishes.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "Maruti's first EV, the e Vitara, will come with 10 colour options that include four dual-tone exterior finishes.In the run up to the Maruti e Vitara's launch in March, more details about the brand’s first EV are surfacing. We now have details of the features and safety kit the top-spec e Vitara will come with, and the colour options that Maurit will offer on its Tata Curvv EV and Mahindra BE 6 rival.Maruti e Vitara coloursMaruti Suzuki will offer the e Vitara with 10 exterior colour options – six monotone and four dual-tone. The six single-tone colours are Nexa Blue, Splendid Silver, Arctic White, Grandeur Grey, Bluish Black and Opulent Red. The dual-tone colours will get a black roof and A- and B-pillars, with contrasting Arctic White, Land Breeze Green, Splendid Silver and Opulent Red colour options.Maruti e Vitara feature highlightsLED headlights, Daytime Running Lamps and tail-lights18-inch wheelsActive air vents on grillePanoramic sunroofMulti-colour interior ambient lightingWireless charger10.25-inch digital instrument cluster10.1-inch infotainment touchscreenWireless Apple CarPlay and Android AutoInfinity by Harman audio systemIn-car connectivity techSingle-zone auto climate controlPM 2.5 air filterVentilated front seats10-way power adjustable driver's seatReclining, sliding and split (60:40) rear seatsDrive modes – Eco, Normal, SportSnow modeOne-pedal driving and regen modesMaruti e Vitara safety kitLevel 2 ADAS suite including lane keep assist, adaptive cruise control, etc.7 airbagsBlind spot monitorTyre pressure monitor360-degree cameraFront and rear parking sensorsRear disc brakesElectronic parking brake with auto-hold functionAcoustic Vehicle Alarm System (AVAS) – for pedestriansAlso see:Maruti e Vitara walkaround video at Auto Expo 2025EV charger every 5-10km is the goal: Maruti MD TakeuchiMaruti low cost electric hatchback in the worksVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20250128043653_Maruti_e_Vitara_colours.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eMaruti\u0026#39;s first EV, the e Vitara, will come with 10 colour options that include four dual-tone exterior finishes.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eIn the run up to the Maruti e Vitara\u0026#39;s launch in March, more details about the \u003ca href=\"https://www.autocarindia.com/car-news/maruti-e-vitara-revealed-with-over-500km-range-auto-expo-2025-434152\" title=\"Maruti e Vitara revealed with over 500km range: Auto Expo 2025\"\u003e\u003cstrong\u003ebrand’s first EV\u003c/strong\u003e\u003c/a\u003e are surfacing. We now have details of the features and safety kit the top-spec e Vitara will come with, and the colour options that Maurit will offer on its \u003ca href=\"https://www.autocarindia.com/cars/tata/curvv-ev\"\u003e\u003cstrong\u003eTata Curvv EV\u003c/strong\u003e\u003c/a\u003e and \u003ca href=\"https://www.autocarindia.com/cars/mahindra/be-6e\"\u003e\u003cstrong\u003eMahindra BE 6\u003c/strong\u003e\u003c/a\u003e rival.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMaruti e Vitara colours\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Maruti e Vitara colours\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/Maruti-e-Vitara-colour-options.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Maruti e Vitara colours\"/\u003e\u003c/p\u003e\u003cp\u003eMaruti Suzuki will offer the e Vitara with 10 exterior colour options – six monotone and four dual-tone. The six single-tone colours are Nexa Blue, Splendid Silver, Arctic White, Grandeur Grey, Bluish Black and Opulent Red. The dual-tone colours will get a black roof and A- and B-pillars, with contrasting Arctic White, Land Breeze Green, Splendid Silver and Opulent Red colour options.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMaruti e Vitara feature highlights\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cul\u003e\u003cli\u003eLED headlights, Daytime Running Lamps and tail-lights\u003c/li\u003e\u003cli\u003e18-inch wheels\u003c/li\u003e\u003cli\u003eActive air vents on grille\u003c/li\u003e\u003cli\u003ePanoramic sunroof\u003c/li\u003e\u003cli\u003eMulti-colour interior ambient lighting\u003c/li\u003e\u003cli\u003eWireless charger\u003c/li\u003e\u003cli\u003e10.25-inch digital instrument cluster\u003c/li\u003e\u003cli\u003e10.1-inch infotainment touchscreen\u003c/li\u003e\u003cli\u003eWireless Apple CarPlay and Android Auto\u003c/li\u003e\u003cli\u003eInfinity by Harman audio system\u003c/li\u003e\u003cli\u003eIn-car connectivity tech\u003c/li\u003e\u003cli\u003eSingle-zone auto climate control\u003c/li\u003e\u003cli\u003ePM 2.5 air filter\u003c/li\u003e\u003cli\u003eVentilated front seats\u003c/li\u003e\u003cli\u003e10-way power adjustable driver\u0026#39;s seat\u003c/li\u003e\u003cli\u003eReclining, sliding and split (60:40) rear seats\u003c/li\u003e\u003cli\u003eDrive modes – Eco, Normal, Sport\u003c/li\u003e\u003cli\u003eSnow mode\u003c/li\u003e\u003cli\u003eOne-pedal driving and regen modes\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Maruti e Vitara interior\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20250128045105_Maruti-e-Vitara-interior.jpg\u0026amp;c=0\u0026amp;w=700\" title=\"Maruti e Vitara interior\"/\u003e\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMaruti e Vitara safety kit\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cul\u003e\u003cli\u003eLevel 2 ADAS suite including lane keep assist, adaptive cruise control, etc.\u003c/li\u003e\u003cli\u003e7 airbags\u003c/li\u003e\u003cli\u003eBlind spot monitor\u003c/li\u003e\u003cli\u003eTyre pressure monitor\u003c/li\u003e\u003cli\u003e360-degree camera\u003c/li\u003e\u003cli\u003eFront and rear parking sensors\u003c/li\u003e\u003cli\u003eRear disc brakes\u003c/li\u003e\u003cli\u003eElectronic parking brake with auto-hold function\u003c/li\u003e\u003cli\u003eAcoustic Vehicle Alarm System (AVAS) – for pedestrians\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eAlso see:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/auto-videos/maruti-e-vitara-walkaround-video-at-auto-expo-2025-434219\"\u003eMaruti e Vitara walkaround video at Auto Expo 2025\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/industry/goal-is-to-have-an-ev-charger-every-5-10km-maruti-md-takeuchi-434301\"\u003eEV charger every 5-10km is the goal: Maruti MD Takeuchi\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/maruti-low-cost-electric-hatchback-in-the-works-434166\"\u003eMaruti low cost electric hatchback in the works\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-434387\"\u003e\u003cul id=\"tab-id-434387\"\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-434387\" href=\"#.\" rel=\"#tab-videos-container-434387\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-28T16:50:00+05:30",
  "modifiedTime": null
}
