{
  "id": "45244f62-7f54-4314-a1c5-ff3c4a617ddf",
  "title": "Audi confirms plans to shut Brussels plant as sale falls through",
  "link": "https://www.autocar.co.uk/car-news/new-cars/audi-confirms-plans-shut-brussels-plant-sale-falls-through",
  "description": "Audi Q8 E-tron was heavily updated in 2022 Factory currently builds the Audi Q8 E-tron; it's successor is tipped to be produced in Mexico Audi will close its Brussels plant after the German car maker was unable to find a buyer. The factory, which will shut 28 February, currently builds the Q8 E-tron electric SUV, again sparking the question that Audi could end its production earlier than planned. Its successor is tipped to be produced in Mexico. “The decision to close the Brussels factory is painful,” Audi’s production boss Gerd Walker said, reports Reuters. “Personally, it was the toughest decision I have ever had to make in my professional career.” Audi was said to be in talks with a number of car makers over potentially buying the plant; Belgian media reported that Chinese EV maker Nio was the front runner; its CEO William Li denied this. However an Audi spokesperson confirmed in November that talks had broken down, leaving the plant’s closure inevitable. This brings into question the future of the current generation Q8 E-tron. Originally known just as the E-tron, Audi’s first series-production electric car went into production in 2018 and was heavily updated in 2022 with a new name, tweaked styling and a much larger battery. It was expected to remain in production until around the middle of the decade as the flagship for an electric SUV line-up that now also includes the smaller Q4 E-tron and mid-sized Q6 E-tron. In July, Audi said that a \"global decline in customer orders in the electric luxury-class segment\" threatened the large SUV's viability. Audi noted the drop in demand for the Q8 E-tron is \"segment specific\" and has not indicated that any of its other EVs are affected.  It says the \"ramp-up of new models on the [EV-specific] Premium Platform Electric\", including the new Q6 E-tron, is one factor in the diminishing popularity of the Q8 E-tron, which is based on an adapted version of the Volkswagen Group's ubiquitous MLB architecture. The similarly sized, combustion-powered Audi Q8 is built in Bratislava, Slovakia, and is unaffected by the announcement.  While Audi has not given any sales figures, the Brussels plant produced just 53,555 examples of the Q8 E-tron and its Sportback sibling in 2023, around half the number of Q4 E-trons that were built in Zwickau, Germany. Audi says it also faced \"long-standing structural challenges\" at the Brussels plant. Its location close to the city centre made restructuring unfeasible with greater logistical costs associated with deliveries and shipments compared with other factories located outside of cities",
  "author": "",
  "published": "Fri, 13 Dec 2024 15:10:00 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Felix Page",
  "length": 2461,
  "excerpt": "Drop in demand for Audi's first electric car has prompted the firm to consider shutting its Belgium factory",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Audi will close its Brussels plant after the German car maker was unable to find a buyer. The factory, which will shut 28 February, currently builds the Q8 E-tron electric SUV, again sparking the question that Audi could end its production earlier than planned. Its successor is tipped to be produced in Mexico. “The decision to close the Brussels factory is painful,” Audi’s production boss Gerd Walker said, reports Reuters. “Personally, it was the toughest decision I have ever had to make in my professional career.” Audi was said to be in talks with a number of car makers over potentially buying the plant; Belgian media reported that Chinese EV maker Nio was the front runner; its CEO William Li denied this. However an Audi spokesperson confirmed in November that talks had broken down, leaving the plant’s closure inevitable. This brings into question the future of the current generation Q8 E-tron. Originally known just as the E-tron, Audi’s first series-production electric car went into production in 2018 and was heavily updated in 2022 with a new name, tweaked styling and a much larger battery. It was expected to remain in production until around the middle of the decade as the flagship for an electric SUV line-up that now also includes the smaller Q4 E-tron and mid-sized Q6 E-tron. In July, Audi said that a \"global decline in customer orders in the electric luxury-class segment\" threatened the large SUV's viability. Audi noted the drop in demand for the Q8 E-tron is \"segment specific\" and has not indicated that any of its other EVs are affected.  It says the \"ramp-up of new models on the [EV-specific] Premium Platform Electric\", including the new Q6 E-tron, is one factor in the diminishing popularity of the Q8 E-tron, which is based on an adapted version of the Volkswagen Group's ubiquitous MLB architecture. The similarly sized, combustion-powered Audi Q8 is built in Bratislava, Slovakia, and is unaffected by the announcement.  While Audi has not given any sales figures, the Brussels plant produced just 53,555 examples of the Q8 E-tron and its Sportback sibling in 2023, around half the number of Q4 E-trons that were built in Zwickau, Germany. Audi says it also faced \"long-standing structural challenges\" at the Brussels plant. Its location close to the city centre made restructuring unfeasible with greater logistical costs associated with deliveries and shipments compared with other factories located outside of cities",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/red-audi-q8-e-tron-cornering-front.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/car-reviews/audi\"\u003eAudi\u003c/a\u003e will close its Brussels plant after the German car maker was unable to find a buyer.\u003c/p\u003e\n\u003cp\u003eThe factory, which will shut 28 February, currently builds the \u003ca href=\"https://www.autocar.co.uk/car-review/audi/q8-etron\"\u003eQ8 E-tron\u003c/a\u003e electric SUV, again sparking the question that Audi could end its production earlier than planned. Its successor is tipped to be produced in Mexico.\u003c/p\u003e\n\u003cp\u003e“The decision to close the Brussels factory is painful,” Audi’s production boss Gerd Walker said, reports Reuters. “Personally, it was the toughest decision I have ever had to make in my professional career.”\u003c/p\u003e\n\n\u003cp\u003eAudi was said to be in talks with a number of car makers over potentially buying the plant; Belgian media reported that Chinese EV maker Nio was the front runner; its CEO William Li denied this.\u003c/p\u003e\n\u003cp\u003eHowever an Audi spokesperson confirmed in November that talks had broken down, leaving the plant’s closure inevitable.\u003c/p\u003e\n\u003cp\u003eThis brings into question the future of the current generation Q8 E-tron. Originally known just as the E-tron, Audi’s first series-production electric car went into production in 2018 and was heavily updated in 2022 with a new name, tweaked styling and a much larger battery.\u003c/p\u003e\n\u003cp\u003eIt was expected to remain in production until around the middle of the decade as the flagship for an electric SUV line-up that now also includes the smaller Q4 E-tron and mid-sized Q6 E-tron.\u003c/p\u003e\n\u003cp\u003eIn July, Audi said that a \u0026#34;global decline in customer orders in the electric luxury-class segment\u0026#34; threatened the large SUV\u0026#39;s viability.\u003c/p\u003e\n\u003cp\u003eAudi noted the drop in demand for the Q8 E-tron is \u0026#34;segment specific\u0026#34; and has not indicated that any of its other EVs are affected. \u003c/p\u003e\n\u003cp\u003eIt says the \u0026#34;ramp-up of new models on the [EV-specific] Premium Platform Electric\u0026#34;, including the new Q6 E-tron, is one factor in the diminishing popularity of the Q8 E-tron, which is based on an adapted version of the Volkswagen Group\u0026#39;s ubiquitous MLB architecture.\u003c/p\u003e\n\u003cp\u003eThe similarly sized, combustion-powered Audi Q8 is built in Bratislava, Slovakia, and is unaffected by the announcement. \u003c/p\u003e\n\u003cp\u003eWhile Audi has not given any sales figures, the Brussels plant produced just 53,555 examples of the Q8 E-tron and its Sportback sibling in 2023, around half the number of Q4 E-trons that were built in Zwickau, Germany.\u003c/p\u003e\n\u003cp\u003eAudi says it also faced \u0026#34;long-standing structural challenges\u0026#34; at the Brussels plant. Its location close to the city centre made restructuring unfeasible with greater logistical costs associated with deliveries and shipments compared with other factories located outside of cities\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-07-10T09:20:35Z",
  "modifiedTime": null
}
