{
  "id": "45e7b38c-1072-4b6e-a175-30dee7fea689",
  "title": "Callum Skye EV edges closer to production as interior unveiled",
  "link": "https://www.autocar.co.uk/car-news/new-cars/callum-skye-ev-edges-closer-production-interior-unveiled",
  "description": "The Skye has a target weight of just 1150kg, distributed 50:50 front to rear Former Jaguar design chief’s Ariel Nomad rival has been designed as one of the lightest EVs available Former Jaguar design boss Ian Callum's eponymous car company has unveiled the interior of its debut model, the Skye, edging it closer to production. It has been designed to help the electric sports car to hit a target weight of just 1150kg, which would make the Skye one of the lightest EVs on the market. As such, it has a minimalist look, with a spine-like centre console, leather straps in place of traditional door-pulls and a smallcentrally mounted infotainment touchscreen. Key features such as the air conditioning are controlled using a pair of rotating dials placed on the centre console, in similar fashion to the new Bugatti Tourbillon. Instrumentation, meanwhile, comes in the form of traditional printed dials with additional readouts for range, battery charge and temperature. The rest of the interior is upholstered in white leather with contrasting 'Vitamin C' orange elements, supplied by Scottish company Bridge of Weir. The car has seating for four, with two bucket seats up front and a simple bench in the rear. The Callum company said it would show another variation of the interior, said to be more rugged, next year. The Skye is expected to launch in summer 2026, and between 50 and 250 units will be produced annually, priced between £80,000-£110,000.  That lines the electric off-roader up against the similarly conceived Ariel Nomad, which entered its second generation earlier this year. The Skye is powered by two electric motors (one on each axle) with combined outputs of 247bhp and 221lb ft, as well as a 42kWh battery that yields a claimed range of 170 miles. Speaking at the car’s public debut at the Savile Row Concours earlier this year, Ian Callum told Autocar: “This is not just a pretty street car. It’s going to have real off-road capability. \"We’ve been working on this for two years so far, and now we're ready to start developing prototypes. So now is the right time to let the world see it, and we’ll be in production within two years.” He added: “I do see this as a west coast of America-inspired car. It’s an off-road car, it’s a sand car, it’s a mud car, and I think the west coast will be where a lot of our customers are based.” As such, Skye will be available in two guises: one tailored more towards off-road ability, the other for on-road dynamics. The off-road car will feature a higher ride height and up to 100mm of suspension travel - as well as a pared-back interior with less of a focus on luxury than the on-road edition.  The Skye’s bold shape, which the company says is “driven by its capabilities”, is based on a strong ‘accent loop’ surrounding the door apertures, with a horizontal body structure running through the whole car and providing mountings for the two large doors, which are glazed below the waistline as well as above it. Its chassis is a rugged steel spaceframe with plenty of ground clearance and travel for its bespoke all-independent suspension, and it sports a lightweight composite body. Underneath, most of its chassis componentry has been developed in-house, but the battery and electric motors are sourced from an unnamed supplier. Callum director of engineering Adam Donfrancesco said: “We’ll take motors from places we like and include that with a lot of powertrain electronics that have been created for us, including wiring looms. Anything more serious we’ll get from our trusted supply network.” Francesco added that the influence of rally cars was key in making it enjoyable to drive. He said: “It's not just about how fast it goes down the road, because it wants to have great steering feel, it wants to have nice suspension feel, it wants to be like a Tarmac rally car.” Before customer deliveries begin, the Skye will be taken on a testing programme around the Midlands, as well as more extreme locations, but without the traditional testing camouflage usually worn by test mules. Ian Callum said: “OEMs camouflage the cars because they want to take them out testing. And they camouflage them because the competition is out there and they don't want other people to see it.  “We don’t really have any competition. It’s quite a unique product. So we’re not averse to letting the world see what we’re doing. We’ll be out in the open testing it.” \"We want to make the car as usable as possible”, said Ian Callum. “Is ingress going to be perfect? It’s not bad. It’s easier than some sports cars. We think the inside of a classic Porsche is big enough for most people to still enjoy the car. That, in some ways, has been our dimensional benchmark.” The Callum company’s total staff now runs to more than 20 people, although Ian Callum says the firm’s intention is always to remain “small and agile”. As the first all-new Callum model, the Skye succeeds successful programmes unveiled since the company was founded in 2019, including a highly individualistic reinterpretation of the 2001 Aston Martin Vanquish (an Ian Callum original), a string of impressive forays into product design and some still-secret collaborative projects. Q\u0026A with Ian Callum, design chief, Callum Did you consider a sports car as your first own-brand product? “We did but decided it would be a bit predictable. We settled on something that would show our versatility and that we’re about all kinds of vehicles, not just one.” Will you make more bespoke Callum cars? \"That’s our intention. The Vanquish project was something we did to prepare ourselves for the phase that starts with Skye, doing our own projects. We don’t want just to be an agency for other brands. We have a way of creating simple but beautifully crafted cars with special detail design.” Would you do the next one in bigger numbers? “There’s lots to do before we get to that kind of decision, but if things go well we could imagine making our own cars in batches of up to 1000. David, Adam and I have been doing this car creation thing together for quite a few years. It’s not a mystery to us; we know our capabilities.”",
  "author": "",
  "published": "Wed, 11 Dec 2024 00:01:00 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Jonathan Bryce, Steve Cropley",
  "length": 7988,
  "excerpt": "Ex-Jaguar design chief’s Ariel Nomad rival is one of the lightest EVs on the market",
  "siteName": "Autocar",
  "favicon": "",
  "text": "\"We’ve been working on this for two years so far, and now we're ready to start developing prototypes. So now is the right time to let the world see it, and we’ll be in production within two years.” He added: “I do see this as a west coast of America-inspired car. It’s an off-road car, it’s a sand car, it’s a mud car, and I think the west coast will be where a lot of our customers are based.” As such, Skye will be available in two guises: one tailored more towards off-road ability, the other for on-road dynamics. The off-road car will feature a higher ride height and up to 100mm of suspension travel - as well as a pared-back interior with less of a focus on luxury than the on-road edition.  The Skye’s bold shape, which the company says is “driven by its capabilities”, is based on a strong ‘accent loop’ surrounding the door apertures, with a horizontal body structure running through the whole car and providing mountings for the two large doors, which are glazed below the waistline as well as above it. Its chassis is a rugged steel spaceframe with plenty of ground clearance and travel for its bespoke all-independent suspension, and it sports a lightweight composite body. Underneath, most of its chassis componentry has been developed in-house, but the battery and electric motors are sourced from an unnamed supplier. Callum director of engineering Adam Donfrancesco said: “We’ll take motors from places we like and include that with a lot of powertrain electronics that have been created for us, including wiring looms. Anything more serious we’ll get from our trusted supply network.” Francesco added that the influence of rally cars was key in making it enjoyable to drive. He said: “It's not just about how fast it goes down the road, because it wants to have great steering feel, it wants to have nice suspension feel, it wants to be like a Tarmac rally car.” Before customer deliveries begin, the Skye will be taken on a testing programme around the Midlands, as well as more extreme locations, but without the traditional testing camouflage usually worn by test mules. Ian Callum said: “OEMs camouflage the cars because they want to take them out testing. And they camouflage them because the competition is out there and they don't want other people to see it.  “We don’t really have any competition. It’s quite a unique product. So we’re not averse to letting the world see what we’re doing. We’ll be out in the open testing it.” \"We want to make the car as usable as possible”, said Ian Callum. “Is ingress going to be perfect? It’s not bad. It’s easier than some sports cars. We think the inside of a classic Porsche is big enough for most people to still enjoy the car. That, in some ways, has been our dimensional benchmark.” The Callum company’s total staff now runs to more than 20 people, although Ian Callum says the firm’s intention is always to remain “small and agile”. As the first all-new Callum model, the Skye succeeds successful programmes unveiled since the company was founded in 2019, including a highly individualistic reinterpretation of the 2001 Aston Martin Vanquish (an Ian Callum original), a string of impressive forays into product design and some still-secret collaborative projects. Q\u0026A with Ian Callum, design chief, Callum Did you consider a sports car as your first own-brand product? “We did but decided it would be a bit predictable. We settled on something that would show our versatility and that we’re about all kinds of vehicles, not just one.” Will you make more bespoke Callum cars? \"That’s our intention. The Vanquish project was something we did to prepare ourselves for the phase that starts with Skye, doing our own projects. We don’t want just to be an agency for other brands. We have a way of creating simple but beautifully crafted cars with special detail design.” Would you do the next one in bigger numbers? “There’s lots to do before we get to that kind of decision, but if things go well we could imagine making our own cars in batches of up to 1000. David, Adam and I have been doing this car creation thing together for quite a few years. It’s not a mystery to us; we know our capabilities.” Jonathan Bryce Title: Editorial Assistant Jonathan is an editorial assistant working with Autocar. He has held this position since March 2024, having previously studied at the University of Glasgow before moving to London to become an editorial apprentice and pursue a career in motoring journalism.  His role at work involves running Autocar's sister title Move Electric, which is most notably concerned with electric cars. His other roles include writing new and updating existing new car reviews, and appearing on Autocar's social media channels including Instagram, TikTok, and YouTube. Charlie Martin Title: Editorial assistant, Autocar As part of Autocar’s news desk, Charlie plays a key role in the title’s coverage of new car launches and industry events. He’s also a regular contributor to its social media channels, providing videos for Instagram, Tiktok, Facebook and Twitter. Charlie joined Autocar in July 2022 after a nine-month stint as an apprentice with sister publication What Car?, during which he acquired his gold-standard NCTJ diploma with the Press Association. Charlie is the proud owner of a Fiat Panda 100HP, which he swears to be the best car in the world. Until it breaks. Steve Cropley Title: Editor-in-chief Steve Cropley is the oldest of Autocar’s editorial team, or the most experienced if you want to be polite about it. He joined over 30 years ago, and has driven many cars and interviewed many people in half a century in the business.  Cropley, who regards himself as the magazine’s “long stop”, has seen many changes since Autocar was a print-only affair, but claims that in such a fast moving environment he has little appetite for looking back.  He has been surprised and delighted by the generous reception afforded the My Week In Cars podcast he makes with long suffering colleague Matt Prior, and calls it the most enjoyable part of his working week. used cars for sale BMW X6 3.0 30d Auto XDrive Euro 5 5dr Volvo XC40 2.0 B4 MHEV Inscription Pro DCT Auto Euro 6 (s/s) 5dr Honda CR-V 1.6 I-DTEC SR Euro 6 (s/s) 5dr Seat Ateca 1.6 TDI XCELLENCE Euro 6 (s/s) 5dr Vauxhall Corsa 1.6T 16V VXR Nurburgring Euro 5 3dr Skoda KAROQ 1.5 TSI ACT SE Drive DSG Euro 6 (s/s) 5dr Ford KUGA 2.0 TDCi EcoBlue ST-Line Euro 6 (s/s) 5dr Polestar POLESTAR 2 Single Motor 78kWh Long Range Fastback Auto FWD 5dr Mercedes-Benz C CLASS 1.6 C180 AMG Line Euro 6 4dr Next Prev Powered By NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/callum-skye-front-quarter-with-interior.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n\u003cp\u003e\u0026#34;We’ve been working on this for two years so far, and now we\u0026#39;re ready to start developing prototypes. So now is the right time to let the world see it, and we’ll be in production within two years.”\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"600\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/callum_skye_front_lights_on.jpg?itok=8Hdq88ZM\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/callum_skye_front_lights_on.jpg?itok=8Hdq88ZM\"/\u003e\u003c/p\u003e\n\u003cp\u003eHe added: “I do see this as a west coast of America-inspired car. It’s an off-road car, it’s a sand car, it’s a mud car, and I think the west coast will be where a lot of our customers are based.”\u003c/p\u003e\n\u003cp\u003eAs such, Skye will be available in two guises: one tailored more towards off-road ability, the other for on-road dynamics. The off-road car will feature a higher ride height and up to 100mm of suspension travel - as well as a pared-back interior with less of a focus on luxury than the on-road edition. \u003c/p\u003e\n\u003cp\u003eThe Skye’s bold shape, which the company says is “driven by its capabilities”, is based on a strong ‘accent loop’ surrounding the door apertures, with a horizontal body structure running through the whole car and providing mountings for the two large doors, which are glazed below the waistline as well as above it.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"600\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/callum_skye_rear_right_three_quarter.jpg?itok=wIrOyPGD\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/callum_skye_rear_right_three_quarter.jpg?itok=wIrOyPGD\"/\u003e\u003c/p\u003e            \u003c/div\u003e\u003cdiv\u003e\n              \n\u003cp\u003eIts chassis is a rugged steel spaceframe with plenty of ground clearance and travel for its bespoke all-independent suspension, and it sports a lightweight composite body.\u003c/p\u003e\n\u003cp\u003eUnderneath, most of its chassis componentry has been developed in-house, but the battery and electric motors are sourced from an unnamed supplier. Callum director of engineering Adam Donfrancesco said: “We’ll take motors from places we like and include that with a lot of powertrain electronics that have been created for us, including wiring looms. Anything more serious we’ll get from our trusted supply network.”\u003c/p\u003e\n\u003cp\u003eFrancesco added that the influence of rally cars was key in making it enjoyable to drive. He said: “It\u0026#39;s not just about how fast it goes down the road, because it wants to have great steering feel, it wants to have nice suspension feel, it wants to be like a Tarmac rally car.”\u003c/p\u003e\n\u003cp\u003eBefore customer deliveries begin, the Skye will be taken on a testing programme around the Midlands, as well as more extreme locations, but without the traditional testing camouflage usually worn by test mules.\u003c/p\u003e\n\u003cp\u003eIan Callum said: “OEMs camouflage the cars because they want to take them out testing. And they camouflage them because the competition is out there and they don\u0026#39;t want other people to see it. \u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"600\" width=\"900\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/callum_skye_front_three_quarter.jpg?itok=eR78zHpE\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/callum_skye_front_three_quarter.jpg?itok=eR78zHpE\"/\u003e            \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n              \n\u003cp\u003e“We don’t really have any competition. It’s quite a unique product. So we’re not averse to letting the world see what we’re doing. We’ll be out in the open testing it.”\u003c/p\u003e\n\u003cp\u003e\u0026#34;We want to make the car as usable as possible”, said Ian Callum. “Is ingress going to be perfect? It’s not bad. It’s easier than some sports cars. We think the inside of a classic \u003ca href=\"https://www.autocar.co.uk/car-review/porsche\"\u003ePorsche\u003c/a\u003e is big enough for most people to still enjoy the car. That, in some ways, has been our dimensional benchmark.”\u003c/p\u003e\n\u003cp\u003eThe Callum company’s total staff now runs to more than 20 people, although Ian Callum says the firm’s intention is always to remain “small and agile”.\u003c/p\u003e\n\u003cp\u003eAs the first all-new Callum model, the Skye succeeds successful programmes unveiled since the company was founded in 2019, including a highly individualistic reinterpretation of the 2001 \u003ca href=\"https://www.autocar.co.uk/car-news/new-cars/ian-callums-vanquish-25-production-version-revealed\"\u003eAston Martin Vanquish\u003c/a\u003e (an Ian Callum original), a string of impressive forays into product design and some still-secret collaborative projects.\u003c/p\u003e\n\u003ch2\u003e\u003cspan\u003eQ\u0026amp;A with Ian Callum, design chief, Callum\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eDid you consider a sports car as your first own-brand product?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“We did but decided it would be a bit predictable. We settled on something that would show our versatility and that we’re about all kinds of vehicles, not just one.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWill you make more bespoke Callum cars?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u0026#34;That’s our intention. The Vanquish project was something we did to prepare ourselves for the phase that starts with Skye, doing our own projects. We don’t want just to be an agency for other brands. We have a way of creating simple but beautifully crafted cars with special detail design.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWould you do the next one in bigger numbers? \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“There’s lots to do before we get to that kind of decision, but if things go well we could imagine making our own cars in batches of up to 1000. David, Adam and I have been doing this car creation thing together for quite a few years. It’s not a mystery to us; we know our capabilities.”\u003c/p\u003e\n            \u003c/div\u003e\u003cdiv\u003e\n                    \u003csection id=\"outer_author_information\"\u003e\u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n        \u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/jonathan-bryce\"\u003eJonathan Bryce\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\n    \u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/users/jonathan-bryce\"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/mugshot.jpg\" width=\"1080\" height=\"1080\" alt=\"Jonathan Bryce\" title=\"Jonathan Bryce\"/\u003e\u003c/a\u003e      \u003c/p\u003e\n      \u003cp\u003e\u003cspan\u003eTitle:\u003c/span\u003e\n        \u003cspan\u003eEditorial Assistant \u003c/span\u003e\n            \u003c/p\u003e\n\n      \n\n    \u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003eJonathan is an editorial assistant\u003c/span\u003e\u003cspan\u003e working with Autocar. He has held this position since March 2024\u003c/span\u003e\u003cspan\u003e, having previously studied at the \u003c/span\u003e\u003cspan\u003eUniversity of Glasgow\u003c/span\u003e\u003cspan\u003e before moving to London to become an editorial apprentice and \u003c/span\u003e\u003cspan\u003epursue a career in motoring journalism. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHis role at work involves running Autocar\u0026#39;s sister title \u003ca href=\"http://www.moveelectric.com/\"\u003eMove Electric\u003c/a\u003e, which is most notably concerned with electric cars. His other roles include writing new and updating existing new car reviews, and appearing on Autocar\u0026#39;s social media channels including Instagram, TikTok, and YouTube.\u003c/p\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n\u003c/div\u003e\n  \u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/charlie-martin\"\u003eCharlie Martin\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\n    \u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/users/charlie-martin\"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/charlie-martin-autocar.jpg\" width=\"1067\" height=\"1067\" alt=\"Charlie Martin Autocar\" title=\"Charlie Martin Autocar\"/\u003e\u003c/a\u003e      \u003c/p\u003e\n      \u003cp\u003e\u003cspan\u003eTitle:\u003c/span\u003e\n        \u003cspan\u003eEditorial assistant, Autocar\u003c/span\u003e\n            \u003c/p\u003e\n\n      \n\n    \u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003eAs part of Autocar’s news desk, Charlie plays a key role in the title’s coverage of new car launches and industry events. \u003cspan\u003eHe’s also a regular contributor to its social media channels, providing videos for Instagram, Tiktok, Facebook and Twitter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eCharlie joined Autocar in July 2022 after a nine-month stint as an apprentice with sister publication \u003c/span\u003e\u003ca href=\"https://www.whatcar.com/\" target=\"_blank\"\u003eWhat Car?\u003c/a\u003e\u003cspan\u003e, during which he acquired his gold-standard NCTJ diploma\u003c/span\u003e\u003cspan\u003e with the Press Association\u003c/span\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eCharlie is the proud owner of a \u003ca href=\"https://www.autocar.co.uk/car-news/used-cars-used-car-buying-guides/used-car-buying-guide-fiat-panda-100hp\"\u003eFiat Panda 100HP\u003c/a\u003e, which he swears to be the best car in the world. Until it breaks.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n\u003c/div\u003e\n  \u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/steve-cropley\"\u003eSteve Cropley\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\n    \u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/users/steve-cropley\"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/steve-cropley-autocar.jpg\" width=\"150\" height=\"150\" alt=\"Steve Cropley Autocar \" title=\"Steve Cropley Autocar\"/\u003e\u003c/a\u003e      \u003c/p\u003e\n      \u003cp\u003e\u003cspan\u003eTitle:\u003c/span\u003e\n        \u003cspan\u003eEditor-in-chief\u003c/span\u003e\n            \u003c/p\u003e\n\n      \n\n    \u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003eSteve Cropley is the oldest of Autocar’s editorial team, or the most experienced if you want to be polite about it. He joined over 30 years ago, and has driven many cars and interviewed many people in half a century in the business. \u003c/p\u003e\n\u003cp\u003eCropley, who regards himself as the magazine’s “long stop”, has seen many changes since Autocar was a print-only affair, but claims that in such a fast moving environment he has little appetite for looking back. \u003c/p\u003e\n\u003cp\u003eHe has been surprised and delighted by the generous reception afforded the My Week In Cars podcast he makes with long suffering colleague Matt Prior, and calls it the most enjoyable part of his working week.\u003c/p\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n\u003c/div\u003e\n    \u003c/div\u003e\u003c/block\u003e\u003c/section\u003e\n\n\u003cdiv\u003e\n  \n        \u003ch2\u003eused   cars for sale\u003c/h2\u003e\n    \n  \n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eBMW X6 3.0 30d Auto XDrive Euro 5 5dr \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eVolvo XC40 2.0 B4 MHEV Inscription Pro DCT Auto Euro 6 (s/s) 5dr \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eHonda CR-V 1.6 I-DTEC SR Euro 6 (s/s) 5dr \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eSeat Ateca 1.6 TDI XCELLENCE Euro 6 (s/s) 5dr \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eVauxhall Corsa 1.6T 16V VXR Nurburgring Euro 5 3dr \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eSkoda KAROQ 1.5 TSI ACT SE Drive DSG Euro 6 (s/s) 5dr \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eFord KUGA 2.0 TDCi EcoBlue ST-Line Euro 6 (s/s) 5dr \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003ePolestar POLESTAR 2 Single Motor 78kWh Long Range Fastback Auto FWD 5dr \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eMercedes-Benz C CLASS 1.6 C180 AMG Line Euro 6 4dr \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \n    \n\n    \n    \u003cp\u003eNext\u003c/p\u003e\n    \u003cp\u003ePrev\u003c/p\u003e\n  \u003c/div\u003e\n  \n  \u003cp\u003e\u003cspan\u003ePowered By\n      \u003cspan\u003e\n        \u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/themes/custom/autocar/images/whatcar_logo.svg\"/\u003e\n      \u003c/span\u003e\n    \u003c/span\u003e\n  \u003c/p\u003e\n\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-05-23T08:02:54Z",
  "modifiedTime": null
}
