{
  "id": "5112e74b-b48a-4ab4-bc77-821d7cfdb742",
  "title": "Koenigsegg Sadair's Spear Is An Even Faster Jesko With An Even Bigger Wing",
  "link": "https://www.jalopnik.com/1895912/koenigsegg-sadairs-spear-faster-jesko-reveal/",
  "description": "Somehow, Koenigsegg keeps making its already extremely fast cars even faster.",
  "author": "Justin Hughes",
  "published": "Wed, 25 Jun 2025 20:56:48 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "News",
    "Car Design"
  ],
  "byline": "Justin Hughes",
  "length": 2742,
  "excerpt": "Somehow, Koenigsegg keeps making its already extremely fast cars even faster.",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "Somehow, Koenigsegg keeps making its already extremely fast cars even faster. The latest addition to the lineup is Sadair's Spear, a no-compromise track-focused \"megacar\" that remains just civilized enough to be legal for public roads. Though it does not officially include the Jesko name (a tribute to CEO Christian von Koenigsegg's father), Sadair's Spear (the name of Jesko's last race horse) is the ultimate evolution of the Jesko, with even more track capabilities than the Jesko Attack. Top speed capabilities remain with the Jesko Absolut, as the 224-mph top speed of Sadair's Spear can't touch the Absolut's 248.5-mph record runs. That lower top speed is the result of a unique aerodynamics package to help it stick to the track. It begins to generate usable downforce \"at more typical track speeds,\" lower than the Jesko Attack's setup. At higher speeds, downforce reaches a maximum of 3,891 pounds compared to 3,086 pounds on the Jesko Attack. That's even more downforce than its 3,053-pound curb weight. The active double-blade rear wing is partly responsible for this, as well as bigger canards up front and a bigger hood vent with a Gurney flap to improve both aero and cooling. Louvers at all four wheel arches and underfloor strakes also help air flow more smoothly around the car at high speeds. Simplify, then add lightness and power Some of Colin Chapman's philosophy shows in Sadair's Spear, though not to the exclusion of more power. Unique hood scoops funnel more air into the same twin-turbo 5.0-liter V8 as the Jesko. That plus a revised engine tune bumps Sadair's Spear up slightly to 1,300 horsepower on pump gas and 1,625 hp on E85. The Light Speed Transmission remains the same, but the car loses the gearshift lever of the Jesko, relying solely on paddle shifters. Much of the sound deadening has been removed, saving nearly six pounds. New carbon fiber seats and other parts drop a total of 77 pounds. In some markets, those seats are also available with six-point racing harnesses in addition to the standard three-point seat belts, a testament to just how serious Koenigsegg is about this car's trackworthiness.  That's not to say Sadair's Spear is without any creature comforts, though. It retains the Jesko's SmartCluster display and SmartCenter command interface, USB ports as well as wireless phone charging, and birds-eye parking assist. Do you want one? Well, you can't have one. Only 30 Sadair's Spears will be built, and they all sold immediately at a private unveiling event. Of course, at a price just under $5.2 million, not many of us can afford one anyway. Koenigsegg",
  "image": "https://www.jalopnik.com/img/gallery/koenigsegg-sadairs-spear-is-an-even-faster-jesko-with-an-even-bigger-wing/l-intro-1750884880.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                \n                \n\u003cp\u003eSomehow, Koenigsegg keeps making its already extremely fast cars even faster. The latest addition to the lineup is \u003ca href=\"https://www.koenigsegg.com/model/sadairs-spear\" target=\"_blank\"\u003eSadair\u0026#39;s Spear\u003c/a\u003e, a no-compromise track-focused \u0026#34;megacar\u0026#34; that remains just civilized enough to be legal for public roads. Though it does not officially include the Jesko name (a tribute to CEO Christian von Koenigsegg\u0026#39;s father), Sadair\u0026#39;s Spear (the name of Jesko\u0026#39;s last race horse) is the ultimate evolution of the Jesko, with even more track capabilities than the Jesko Attack. Top speed capabilities remain with the Jesko Absolut, as the 224-mph top speed of Sadair\u0026#39;s Spear can\u0026#39;t touch \u003ca href=\"https://www.jalopnik.com/koenigsegg-breaks-its-own-record-by-doing-0-250-0-mph-r-1851570608/\" target=\"_blank\"\u003ethe Absolut\u0026#39;s 248.5-mph record runs\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThat lower top speed is the result of a unique aerodynamics package to help it stick to the track. It begins to generate usable downforce \u0026#34;at more typical track speeds,\u0026#34; lower than the Jesko Attack\u0026#39;s setup. At higher speeds, downforce reaches a maximum of 3,891 pounds compared to 3,086 pounds on the Jesko Attack. That\u0026#39;s even more downforce than its 3,053-pound curb weight.\u003c/p\u003e\n\n\u003cp\u003eThe active double-blade rear wing is partly responsible for this, as well as bigger canards up front and a bigger hood vent with a Gurney flap to improve both aero and cooling. Louvers at all four wheel arches and underfloor strakes also help air flow more smoothly around the car at high speeds.\u003c/p\u003e\n\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eSimplify, then add lightness and power\u003c/h2\u003e\n                                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eSome of Colin Chapman\u0026#39;s philosophy shows in Sadair\u0026#39;s Spear, though not to the exclusion of more power. Unique hood scoops funnel more air into the same twin-turbo 5.0-liter V8 as the Jesko. That plus a revised engine tune bumps Sadair\u0026#39;s Spear up slightly to 1,300 horsepower on pump gas and 1,625 hp on E85. The Light Speed Transmission remains the same, but the car loses the gearshift lever of the Jesko, relying solely on paddle shifters.\u003c/p\u003e\n\n\u003cp\u003eMuch of the sound deadening has been removed, saving nearly six pounds. New carbon fiber seats and other parts drop a total of 77 pounds. In some markets, those seats are also available with six-point racing harnesses in addition to the standard three-point seat belts, a testament to just how serious Koenigsegg is about this car\u0026#39;s trackworthiness. \u003c/p\u003e\n\u003cp\u003eThat\u0026#39;s not to say Sadair\u0026#39;s Spear is without any creature comforts, though. It retains the Jesko\u0026#39;s SmartCluster display and SmartCenter command interface, USB ports as well as wireless phone charging, and birds-eye parking assist.\u003c/p\u003e\n\u003cp\u003eDo you want one? Well, you can\u0026#39;t have one. Only 30 Sadair\u0026#39;s Spears will be built, and they all sold immediately at a private unveiling event. Of course, at a price just under $5.2 million, not many of us can afford one anyway.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg alt=\"Rear end of a Koenigsegg Jesko Sadair\u0026#39;s Spear\" data-lazy-src=\"https://www.jalopnik.com/img/uploads/embed/it-KEJLI0-1750884667.jpg\" src=\"https://www.jalopnik.com/img/uploads/embed/it-KEJLI0-1750884667.jpg\"/\u003e\u003cspan\u003eKoenigsegg\u003c/span\u003e\n\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-25T20:56:48Z",
  "modifiedTime": "2025-06-25T20:56:48Z"
}
