{
  "id": "532dde1b-6cd8-42ca-8058-b3a84ab98d3d",
  "title": "Mainstream car TV’s future is perilous in a way it hasn’t been before",
  "link": "https://www.autocar.co.uk/opinion/new-cars/mainstream-car-tv%E2%80%99s-future-perilous-way-it-hasn%E2%80%99t-been",
  "description": "The casual TV viewer isn’t currently getting a motoring fix - and that's worrying And on that bombshell, Amazon’s motoring show has come to an end. Which means there’s no The Grand Tour or Top Gear to watch, nor a clear prospect of either returning, for the first time in yonks. There have been times we’ve been without either show in the past two decades, but this time feels different and, I think, important. Not just to car geeks like you and me: there are car shows and videos out there for us, of course – ours included. But if you will excuse the modesty, I think we/they talk to a specialist audience. Autocar occupies a specialist space on the newsstand; Top Gear and The Grand Tour are the ones that make headlines in national newspapers, the ones that talk to people who don’t otherwise consume car ‘content’. In a world of village music society gigs, they’re the Proms. Which means that the casual TV viewer isn’t currently getting a motoring fix. And I’m a bit worried about that. I think the populace has more affection for cars than many in the TV business realise. On Ben Collins’ (#2 Stig) podcast recently, Andy Wilman, the erstwhile producer of The Grand Tour and Top Gear, said the BBC liked having the latter because it spoke to an audience that the national broadcaster didn’t otherwise really understand and took that responsibility out of its hands. In fairness, the BBC remained committed to its car show and hadn’t intended Top Gear’s current hiatus. But with it gone and no Grand Tour, the future of mainstream car TV feels to me perilous in a way that it hasn’t before. Cars occupy an inordinate amount of space and time in people’s lives, and it’s not just us enthusiasts who have a real affection for them. The average Brit spends almost an hour a day travelling, and nearly 80% of the miles they travel are in a car, which means many adults spend as much time driving as they do cooking. Could you imagine wondering when the next mainstream cookery show was going to arrive?",
  "author": "",
  "published": "Sat, 19 Oct 2024 07:01:15 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Opinion"
  ],
  "byline": "Matt Prior",
  "length": 1924,
  "excerpt": "The casual TV viewer isn’t currently getting a motoring fix - and that's worrying",
  "siteName": "Autocar",
  "favicon": "",
  "text": "And on that bombshell, Amazon’s motoring show has come to an end. Which means there’s no The Grand Tour or Top Gear to watch, nor a clear prospect of either returning, for the first time in yonks. There have been times we’ve been without either show in the past two decades, but this time feels different and, I think, important. Not just to car geeks like you and me: there are car shows and videos out there for us, of course – ours included. But if you will excuse the modesty, I think we/they talk to a specialist audience. Autocar occupies a specialist space on the newsstand; Top Gear and The Grand Tour are the ones that make headlines in national newspapers, the ones that talk to people who don’t otherwise consume car ‘content’. In a world of village music society gigs, they’re the Proms. Which means that the casual TV viewer isn’t currently getting a motoring fix. And I’m a bit worried about that. I think the populace has more affection for cars than many in the TV business realise. On Ben Collins’ (#2 Stig) podcast recently, Andy Wilman, the erstwhile producer of The Grand Tour and Top Gear, said the BBC liked having the latter because it spoke to an audience that the national broadcaster didn’t otherwise really understand and took that responsibility out of its hands. In fairness, the BBC remained committed to its car show and hadn’t intended Top Gear’s current hiatus. But with it gone and no Grand Tour, the future of mainstream car TV feels to me perilous in a way that it hasn’t before. Cars occupy an inordinate amount of space and time in people’s lives, and it’s not just us enthusiasts who have a real affection for them. The average Brit spends almost an hour a day travelling, and nearly 80% of the miles they travel are in a car, which means many adults spend as much time driving as they do cooking. Could you imagine wondering when the next mainstream cookery show was going to arrive?",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/mp-column-2509.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eAnd on that bombshell, Amazon’s motoring show has come to an end. Which means there’s no The Grand Tour or Top Gear to watch, nor a clear prospect of either returning, for the first time in yonks.\u003c/p\u003e\n\u003cp\u003eThere have been times we’ve been without either show in the past two decades, but this time feels different and, I think, important. Not just to car geeks like you and me: there are car shows and videos out there for us, of course – \u003ca href=\"https://www.youtube.com/@autocar\"\u003eours included.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eBut if you will excuse the modesty, I think we/they talk to a specialist audience.\u003c/p\u003e\n\n\u003cp\u003eAutocar occupies a specialist space \u003ca href=\"https://www.themagazineshop.com/autocar/?_gl=1*1iywxeb*_gcl_au*ODc3Njk1NzUuMTcyMjIzODU3OA..*_ga*NDIxOTkwNjE1LjE2MzQ1NzE2Mjk.*_ga_DE6XSW8CD2*MTcyNjQ5Mzc3Mi4yMTc4LjEuMTcyNjQ5Mzg0Ni40Ny4wLjI3MjYzNzI1Ng..\"\u003eon the newsstand\u003c/a\u003e; Top Gear and The Grand Tour are the ones that make headlines in national newspapers, the ones that talk to people who don’t otherwise consume car ‘content’.\u003c/p\u003e\n\u003cp\u003eIn a world of village music society gigs, they’re the Proms. Which means that the casual TV viewer isn’t currently getting a motoring fix.\u003c/p\u003e\n\u003cp\u003eAnd I’m a bit worried about that. I think the populace has more affection for cars than many in the TV business realise. On Ben Collins’ (#2 Stig) podcast recently, Andy Wilman, the erstwhile producer of The Grand Tour and Top Gear, said the BBC liked having the latter because it spoke to an audience that the national broadcaster didn’t otherwise really understand and took that responsibility out of its hands.\u003c/p\u003e\n\u003cp\u003eIn fairness, the BBC remained committed to its car show and hadn’t intended Top Gear’s current hiatus. But with it gone and no Grand Tour, the future of mainstream car TV feels to me perilous in a way that it hasn’t before.\u003c/p\u003e\n\u003cp\u003eCars occupy an inordinate amount of space and time in people’s lives, and it’s not just us enthusiasts who have a real affection for them.\u003c/p\u003e\n\u003cp\u003eThe average Brit spends almost an hour a day travelling, and nearly 80% of the miles they travel are in a car, which means many adults spend as much time driving as they do cooking.\u003c/p\u003e\n\u003cp\u003eCould you imagine wondering when the next mainstream cookery show was going to arrive?\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-19T07:01:15Z",
  "modifiedTime": null
}
