{
  "id": "55c44610-20b7-403f-897e-2a86d9815616",
  "title": "2022 Porsche 911 Turbo S Coupe",
  "link": "https://bringatrailer.com/listing/2022-porsche-911-turbo-s-coupe-58/",
  "description": "This 2022 Porsche 911 Turbo S coupe was initially delivered through Larchmont Porsche in New York with nearly $40k in options and was acquired by the selling dealer in 2025 from the original owner. It is finished in Jet Black Metallic over a Pure Black Heritage Design interior and is powered by a twin-turbocharged 3.7L flat-six linked with an eight-speed PDK dual-clutch automatic transaxle and all-wheel drive. Equipment includes the SportDesign and Sport Chrono Packages, a sport exhaust system, a front-axle lift system, Porsche Active Suspension Management, Porsche Ceramic Composite Brakes, Turbo S Exclusive Design wheels, LED Matrix-Design headlights, lightweight glass, adaptive front sport seats, a surround-view camera system, navigation, and Porsche Communication Management linked with a Burmester sound system. This 992.1 Turbo S has 4,600 miles and is offered by the selling dealer with a window sticker, an owner's manual, spare parts, a clean Carfax report, and a clean New York title.",
  "author": "bringatrailer",
  "published": "Sat, 11 Jan 2025 21:00:12 +0000",
  "source": "https://bringatrailer.com/feed/",
  "categories": null,
  "byline": "Update Credit Card",
  "length": 3783,
  "excerpt": "Bid for the chance to own a 2022 Porsche 911 Turbo S Coupe at auction with Bring a Trailer, the home of the best vintage and classic cars online. Lot #177,596.",
  "siteName": "Bring a Trailer",
  "favicon": "https://bringatrailer.com/wp-content/themes/bringatrailer/assets/img/google-chrome-icon-192x192.png?v=7c1d59ca17",
  "text": "This 2022 Porsche 911 Turbo S coupe was initially delivered through Larchmont Porsche in New York with nearly $40k in options and was acquired by the selling dealer in 2025 from the original owner. It is finished in Jet Black Metallic over a Pure Black Heritage Design interior and is powered by a twin-turbocharged 3.7L flat-six linked with an eight-speed PDK dual-clutch automatic transaxle and all-wheel drive. Equipment includes the SportDesign and Sport Chrono Packages, a sport exhaust system, a front-axle lift system, Porsche Active Suspension Management, Porsche Ceramic Composite Brakes, Turbo S Exclusive Design wheels, LED Matrix-Design headlights, lightweight glass, adaptive front sport seats, a surround-view camera system, navigation, and Porsche Communication Management linked with a Burmester sound system. This 992.1 Turbo S has 4,600 miles and is offered by the selling dealer with a window sticker, an owner’s manual, spare parts, a clean Carfax report, and a clean New York title. The car is finished in Jet Black Metallic (C9X) and features the SportDesign Package, which added a revised front bumper cover, lip spoiler, and rear spoiler. Additional exterior equipment includes LED Matrix-Design headlights with black housings and Porsche Dynamic Lighting System Plus (PDLS+) as well as lightweight noise-insulated glass, a sunroof, and front and rear parking sensors. All exterior painted surfaces are covered in paint protection film, and paint meter readings from around the car can be viewed in the gallery. Center-locking 20″ and 21″ Turbo S Exclusive Design alloy wheels are mounted with Goodyear Eagle F1 Supersport tires. The car is equipped with a front-axle lift system, Porsche Active Suspension Management (PASM), and rear-axle steering. Stopping power is provided by Porsche Ceramic Composite Brakes (PCCB) with yellow-finished multi-piston calipers. The Heritage Design Interior features heated adaptive front sport seats and folding rear seats trimmed in black leather with cloth inserts. Additional features include dual-zone automatic climate control, ambient lighting, a fire extinguisher, an aluminum gear selector and pedal covers, a surround-view camera system, navigation, and a Porsche Communication Management touchscreen infotainment system linked to a Burmester surround sound system. The heated GT Sport steering wheel is trimmed in black Race-Tex and is equipped with paddle shifters and a drive-mode selector dial. Instrumentation includes a central tachometer flanked by configurable TFT displays. The Sport Chrono Package added launch control as well as a stopwatch atop the dashboard, and the suite of electronic driving aids includes Lane Change Assist. The digital odometer indicates 4,600 miles. The twin-turbocharged 3.7L flat-six was factory rated at 640 horsepower and 590 lb-ft of torque and features an optional sport exhaust system. The most recent oil change was performed in July 2024. Power is routed to all four wheels through an eight-speed PDK dual-clutch automatic transaxle and an all-wheel-drive system. The window sticker lists initial delivery to Porsche Larchmont in New York along with factory colors, optional equipment, and a total price of $245,610. The Carfax report is free of accidents and other reported damage and lists history in New York from new. You are not connected to real-time updates. Attempting to connect. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished. Your real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.",
  "image": "https://bringatrailer.com/wp-content/uploads/2025/01/2022_porsche_911-turbo-s-coupe_IMG-50729-78683-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv tabindex=\"0\"\u003e\n\t\t\u003cp\u003eThis 2022 Porsche 911 Turbo S coupe was initially delivered through Larchmont Porsche in New York with nearly $40k in options and was acquired by the selling dealer in 2025 from the original owner. It is finished in Jet Black Metallic over a Pure Black Heritage Design interior and is powered by a twin-turbocharged 3.7L flat-six linked with an eight-speed PDK dual-clutch automatic transaxle and all-wheel drive. Equipment includes the SportDesign and Sport Chrono Packages, a sport exhaust system, a front-axle lift system, Porsche Active Suspension Management, Porsche Ceramic Composite Brakes, Turbo S Exclusive Design wheels, LED Matrix-Design headlights, lightweight glass, adaptive front sport seats, a surround-view camera system, navigation, and Porsche Communication Management linked with a Burmester sound system. This 992.1 Turbo S has 4,600 miles and is offered by the selling dealer with a window sticker, an owner’s manual, spare parts, a clean Carfax report, and a clean New York title.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/IMG-50552-55678-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"2022 Porsche 911 Turbo S Coupe\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe car is finished in Jet Black Metallic (C9X) and features the SportDesign Package, which added a revised front bumper cover, lip spoiler, and rear spoiler. Additional exterior equipment includes LED Matrix-Design headlights with black housings and Porsche Dynamic Lighting System Plus (PDLS+) as well as lightweight noise-insulated glass, a sunroof, and front and rear parking sensors. All exterior painted surfaces are covered in paint protection film, and paint meter readings from around the car can be viewed in the gallery.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/IMG-50546-55620-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"2022 Porsche 911 Turbo S Coupe\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eCenter-locking 20″ and 21″ Turbo S Exclusive Design alloy wheels are mounted with Goodyear Eagle F1 Supersport tires. The car is equipped with a front-axle lift system, Porsche Active Suspension Management (PASM), and rear-axle steering. Stopping power is provided by Porsche Ceramic Composite Brakes (PCCB) with yellow-finished multi-piston calipers.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/2022_porsche_911-turbo-s-coupe_IMG-50683-59970-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"2022 Porsche 911 Turbo S Coupe\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe Heritage Design Interior features heated adaptive front sport seats and folding rear seats trimmed in black leather with cloth inserts. Additional features include dual-zone automatic climate control, ambient lighting, a fire extinguisher, an aluminum gear selector and pedal covers, a surround-view camera system, navigation, and a Porsche Communication Management touchscreen infotainment system linked to a Burmester surround sound system.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/2022_porsche_911-turbo-s-coupe_IMG-50656-59650-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"2022 Porsche 911 Turbo S Coupe\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe heated GT Sport steering wheel is trimmed in black Race-Tex and is equipped with paddle shifters and a drive-mode selector dial. Instrumentation includes a central tachometer flanked by configurable TFT displays. The Sport Chrono Package added launch control as well as a stopwatch atop the dashboard, and the suite of electronic driving aids includes Lane Change Assist. The digital odometer indicates 4,600 miles.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/2022_porsche_911-turbo-s-coupe_IMG-50642-59492-scaled.jpg?w=620\u0026amp;resize=620%2C413\" alt=\"2022 Porsche 911 Turbo S Coupe\" width=\"620\" height=\"413\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe twin-turbocharged 3.7L flat-six was factory rated at 640 horsepower and 590 lb-ft of torque and features an optional sport exhaust system. The most recent oil change was performed in July 2024.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/2022_porsche_911-turbo-s-coupe_IMG_9866-75402-scaled.jpg?w=620\u0026amp;resize=620%2C465\" alt=\"2022 Porsche 911 Turbo S Coupe\" width=\"620\" height=\"465\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003ePower is routed to all four wheels through an eight-speed PDK dual-clutch automatic transaxle and an all-wheel-drive system.\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://bringatrailer.com/wp-content/uploads/2025/01/IMG_5502-55748-scaled.jpeg?w=620\u0026amp;resize=620%2C436\" alt=\"2022 Porsche 911 Turbo S Coupe\" width=\"620\" height=\"436\" data-recalc-dims=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe window sticker lists initial delivery to Porsche Larchmont in New York along with factory colors, optional equipment, and a total price of $245,610.\u003c/p\u003e\n\n\u003cp\u003eThe Carfax report is free of accidents and other reported damage and lists history in New York from new.\u003c/p\u003e\n\t\u003c/div\u003e\u003cp\u003e\n\t\tYou are not connected to real-time updates. Attempting to connect.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003cp\u003e\n\t\tYour real-time updates could not be connected. Missed updates will be sent once your connection has been reestablished.\t\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
