{
  "id": "563b2d84-6ff0-465f-a444-42e898764aad",
  "title": "Trump Strikes Down California's Emissions Standards, California Sues Back",
  "link": "https://www.jalopnik.com/1885085/trump-strikes-down-emissions-standards-california-sues-back/",
  "description": "Trump signed three new laws that would roll back the state's ambitious emissions and electrification plans, and California responded with extreme swiftness.",
  "author": "Nicholas Werner",
  "published": "Thu, 12 Jun 2025 22:10:56 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "News"
  ],
  "byline": "Nicholas Werner",
  "length": 4857,
  "excerpt": "Trump signed three new laws that would roll back the state's ambitious emissions and electrification plans, and California responded with extreme swiftness.",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "Win Mcnamee/Getty Images Not content to merely federalize its National Guard and deploy active duty troops to its biggest city, President Donald Trump doubled (tripled? quadrupled?) down on his confrontation with California today by signing three new laws that would roll back the state's ambitious emissions and electrification plans. Each of the three new federal laws simply rolls back a California state rule: The Advanced Clean Cars II rule, which would famously ban the sale of ICE-only cars by 2035; the Advanced Clean Trucks rule, which would mandate a certain number of trucks be zero-emission; and the Heavy-Duty Engine and Vehicle Omnibus rule, setting stricter standards for truck emissions. California retaliated instantly, so instantly that the state's Attorney General Rob Bonta was holding a press conference before Trump's had even finished. His office is suing the federal government, alleging that the new laws themselves were not passed under the proper authority. So far, ten other states (all with Democratic governors) have joined the suit, which makes sense given that various states follow California's stricter-than-federal emissions standards. Expect this all to grind its way through court for a while. At his press conference today, Trump claimed he was doing all this to \"rescue the U.S. auto industry from destruction.\" If he were really worried about the American car industry, he might want to reconsider his tariffs on its manufacturing partners and on aluminum and steel. The legality of California's rules (and Trump's new laws) Westend61/Getty Images Legally speaking, what's at issue is not technically the emissions and electrification rules themselves, but the way they were implemented. California has long suffered from poor air quality and smog, which in the 1960s and '70s were so bad that people would wear gas masks. To address this, the state started laying down stricter tailpipe standards, but to do that, it had to get waivers from the EPA, which sets standards nationwide. That was all going along fine until 2019, when Trump yanked away California's waivers. President Joe Biden restored them in 2022, and for now at least, those remain in place. What's at stake today are the waivers for the three specific rules mentioned above, which are only very recent; the most recent two were only granted in December 2024, at the very end of the Biden administration. The Congressional Review Act of 1996 explicitly grants Congress the power to review last-minute rules from a previous administration, and in fact, it's this exact authority that Republicans used to pass the laws that Trump signed today. There's only one problem: They weren't supposed to. The Government Accountability Office and the Senate Parliamentarian found that the CRA couldn't be applied to this instance, determining that the waivers don't formally qualify as \"rules.\" Republicans, apparently using the strategy of plugging their ears, just went ahead and did it anyway. Bonta's lawsuit challenges the laws on these grounds. What California's rules would do Alexander Spatari/Getty Images If implemented, this trio of California rules would force all new cars and most new trucks to be at least partially electric by 2035 (the rules do not affect used sales). As explained by the LA Times, they were collectively expected to save over 1,200 people from air quality-related deaths by 2040, while also prevent 395 million metric tons of carbon emissions, what 100 coal plants would belch out in a year. That's fantastic for anyone in California who breathes, but also for anybody on all of planet Earth who doesn't want the oceans to rise. Trump has been vehemently opposed to this for years and skewered the \"electric vehicle mandate\" throughout his 2024 campaign. That lead to a Day 1 executive order in which he called on the federal government to do what it could to \"eliminate\" the mandate. The EO didn't particularly go anywhere, but Republicans in Congress stepped up and did it via legislation (via the CRA, challenged by Bonta).",
  "image": "https://www.jalopnik.com/img/gallery/trump-strikes-down-californias-emissions-standards-california-sues-back/l-intro-1749766114.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1885085/trump-strikes-down-emissions-standards-california-sues-back/\" data-post-title=\"Trump Strikes Down California\u0026#39;s Emissions Standards, California Sues Back\" data-slide-num=\"0\" data-post-id=\"1885085\"\u003e\n                                             \u003cpicture id=\"p082a1576a0e58a5c6f743d7f01170b99\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/trump-strikes-down-californias-emissions-standards-california-sues-back/intro-1749766114.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/trump-strikes-down-californias-emissions-standards-california-sues-back/intro-1749766114.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/trump-strikes-down-californias-emissions-standards-california-sues-back/intro-1749766114.jpg\" data-slide-url=\"https://www.jalopnik.com/1885085/trump-strikes-down-emissions-standards-california-sues-back/\" data-post-id=\"1885085\" data-slide-num=\"0\" data-slide-title=\"Trump Strikes Down California\u0026#39;s Emissions Standards, California Sues Back: \" width=\"780\" height=\"438\" alt=\"President Donald Trump at a signing ceremony rolling back California\u0026#39;s recent emissions rules\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eWin Mcnamee/Getty Images\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp\u003eNot content to merely federalize its National Guard and deploy active duty troops to its biggest city, President Donald Trump doubled (tripled? quadrupled?) down on his confrontation with California today by signing three new laws that would roll back the state\u0026#39;s ambitious emissions and electrification plans. Each of the three new federal laws simply rolls back a California state rule: The Advanced Clean Cars II rule, which would famously ban the sale of ICE-only cars by 2035; the Advanced Clean Trucks rule, which would mandate a certain number of trucks be zero-emission; and the Heavy-Duty Engine and Vehicle Omnibus rule, setting stricter standards for truck emissions.\u003c/p\u003e\n\u003cp\u003eCalifornia retaliated instantly, so instantly that the state\u0026#39;s Attorney General Rob Bonta was holding a press conference before Trump\u0026#39;s had even finished. His office is suing the federal government, alleging that the new laws themselves were not passed under the proper authority. So far, ten other states (all with Democratic governors) have joined the suit, which makes sense given that various states follow California\u0026#39;s stricter-than-federal emissions standards. Expect this all to grind its way through court for a while.\u003c/p\u003e\n\u003cp\u003eAt his press conference today, Trump claimed he was doing all this to \u0026#34;rescue the U.S. auto industry from destruction.\u0026#34; If he were really worried about the American car industry, he might want to reconsider \u003ca href=\"https://www.jalopnik.com/1803638/car-part-tracking-across-na-trump-tariff-impact/\" target=\"_blank\"\u003ehis tariffs on its manufacturing partners\u003c/a\u003e and \u003ca href=\"https://www.jalopnik.com/1831300/auto-tariffs-imports-exports-impact/\" target=\"_blank\"\u003eon aluminum and steel\u003c/a\u003e.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eThe legality of California\u0026#39;s rules (and Trump\u0026#39;s new laws)\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1885085/trump-strikes-down-emissions-standards-california-sues-back/\" data-post-title=\"Trump Strikes Down California\u0026#39;s Emissions Standards, California Sues Back\" data-slide-num=\"1\" data-post-id=\"1885085\"\u003e\n                                             \u003cpicture id=\"p92f32cb582fca92d7c935a4a1781763b\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/trump-strikes-down-californias-emissions-standards-california-sues-back/the-legality-of-californias-rules-and-trumps-new-laws-1749766114.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/trump-strikes-down-californias-emissions-standards-california-sues-back/the-legality-of-californias-rules-and-trumps-new-laws-1749766114.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/trump-strikes-down-californias-emissions-standards-california-sues-back/the-legality-of-californias-rules-and-trumps-new-laws-1749766114.jpg\" data-slide-url=\"https://www.jalopnik.com/1885085/trump-strikes-down-emissions-standards-california-sues-back/\" data-post-id=\"1885085\" data-slide-num=\"1\" data-slide-title=\"Trump Strikes Down California\u0026#39;s Emissions Standards, California Sues Back: The legality of California\u0026#39;s rules (and Trump\u0026#39;s new laws)\" width=\"780\" height=\"438\" alt=\"A smoggy day in sunny Los Angeles\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eWestend61/Getty Images\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eLegally speaking, what\u0026#39;s at issue is not technically the emissions and electrification rules themselves, but the way they were implemented. California has long suffered from poor air quality and smog, which in the 1960s and \u0026#39;70s were so bad that people would wear gas masks. To address this, the state started laying down stricter tailpipe standards, but to do that, it had to get waivers from the EPA, which sets standards nationwide. That was all going along fine until 2019, when Trump yanked away California\u0026#39;s waivers. President Joe Biden restored them in 2022, and for now at least, those remain in place.\u003c/p\u003e\n\u003cp\u003eWhat\u0026#39;s at stake today are the waivers for the three specific rules mentioned above, which are only very recent; the most recent two were only granted in December 2024, at the very end of the Biden administration. The Congressional Review Act of 1996 explicitly grants Congress the power to review last-minute rules from a previous administration, and in fact, it\u0026#39;s this exact authority that Republicans used to pass the laws that Trump signed today.\u003c/p\u003e\n\u003cp\u003eThere\u0026#39;s only one problem: They weren\u0026#39;t supposed to. The Government Accountability Office and the Senate Parliamentarian found that the CRA couldn\u0026#39;t be applied to this instance, determining that the waivers don\u0026#39;t formally qualify as \u0026#34;rules.\u0026#34; Republicans, apparently using the strategy of plugging their ears, just went ahead and did it anyway. Bonta\u0026#39;s lawsuit challenges the laws on these grounds.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eWhat California\u0026#39;s rules would do\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1885085/trump-strikes-down-emissions-standards-california-sues-back/\" data-post-title=\"Trump Strikes Down California\u0026#39;s Emissions Standards, California Sues Back\" data-slide-num=\"2\" data-post-id=\"1885085\"\u003e\n                                             \u003cpicture id=\"p4ca17d92591d162cd524f217e237d443\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/trump-strikes-down-californias-emissions-standards-california-sues-back/what-californias-rules-would-do-1749766114.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/trump-strikes-down-californias-emissions-standards-california-sues-back/what-californias-rules-would-do-1749766114.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/trump-strikes-down-californias-emissions-standards-california-sues-back/what-californias-rules-would-do-1749766114.jpg\" data-slide-url=\"https://www.jalopnik.com/1885085/trump-strikes-down-emissions-standards-california-sues-back/\" data-post-id=\"1885085\" data-slide-num=\"2\" data-slide-title=\"Trump Strikes Down California\u0026#39;s Emissions Standards, California Sues Back: What California\u0026#39;s rules would do\" width=\"780\" height=\"438\" alt=\"An EV street parked at a charging station\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eAlexander Spatari/Getty Images\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eIf implemented, this trio of California rules would force all new cars and most new trucks to be at least partially electric by 2035 (the rules do not affect used sales). As explained by the \u003ca href=\"https://www.latimes.com/environment/story/2025-05-22/senate-votes-in-bid-to-overturn-california-gas-only-car-ban\" target=\"_blank\"\u003e\u003cem\u003eLA Times\u003c/em\u003e\u003c/a\u003e, they were collectively expected to save over 1,200 people from air quality-related deaths by 2040, while also prevent 395 million metric tons of carbon emissions, what 100 coal plants would belch out in a year. That\u0026#39;s fantastic for anyone in California who breathes, but also for anybody on all of planet Earth who doesn\u0026#39;t want the oceans to rise.\u003c/p\u003e\n\u003cp\u003eTrump has been vehemently opposed to this for years and skewered the \u0026#34;electric vehicle mandate\u0026#34; throughout his 2024 campaign. That lead to a Day 1 executive order in which he called on the federal government to do what it could to \u0026#34;eliminate\u0026#34; the mandate. The EO didn\u0026#39;t particularly go anywhere, but Republicans in Congress stepped up and did it via legislation (via the CRA, challenged by Bonta).\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-12T22:10:56Z",
  "modifiedTime": "2025-06-12T22:10:56Z"
}
