{
  "id": "62d0bb54-5d21-44aa-a0a2-6dc9ccd241a0",
  "title": "GM Bails On Cruise To Focus On Super Cruise After Burning Billions On Robotaxi Development",
  "link": "https://jalopnik.com/gm-bails-on-cruise-to-focus-on-super-cruise-after-burni-1851718099",
  "description": "General Motors’ Cruise robotaxi mapping unit returned to the Bay Area in September, about a year after one of its cars hit a pedestrian. That didn’t last long, though, as GM announced today that it “plans to realign its autonomous driving strategy and prioritize development of advanced driver assistance systems on a…Read more...",
  "author": "Collin Woodard",
  "published": "Tue, 10 Dec 2024 23:33:22 GMT",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "cruise",
    "robotaxi",
    "business finance",
    "robotics",
    "general motors",
    "mary barra",
    "self driving car",
    "taxis",
    "vehicular automation",
    "advanced driver assistance system",
    "general motors"
  ],
  "byline": "Collin Woodard",
  "length": 2804,
  "excerpt": "The future of General Motors' self-driving technology is in privately owned cars.",
  "siteName": "Jalopnik",
  "favicon": "https://i.kinja-img.com/image/upload/c_fill,h_80,q_80,w_80/341329e55edf8a8a922929e6eb19ebde.png",
  "text": "Photo: Shutterstock/Phil Pasquini (Shutterstock)General Motors’ Cruise robotaxi mapping unit returned to the Bay Area in September, about a year after one of its cars hit a pedestrian. That didn’t last long, though, as GM announced today that it “plans to realign its autonomous driving strategy and prioritize development of advanced driver assistance systems on a path to fully autonomous personal vehicles.” If you don’t speak press release, that’s GM’s way of saying it’s done with robotaxis and will instead focus on bringing more advanced versions of its Super Cruise automated driving technology to privately owned vehicles.Suggested ReadingIt's Time To Discontinue The Model S | JalopinionsOffEnglishSuggested ReadingGM cited the time and resources it would take the scale up Cruise’s robotaxi business as the motivation for the decision, as well as the competition in the market. While this announcement is probably disappointing for many of the employees who dedicated years of their lives to making Cruise robotaxis a reality, the good news for them is that they should still have jobs for now. GM says it plans to acquire the remaining 10 percent of the self-driving tech company that it doesn’t already own and have its internal technology team eventually absorb Cruise. That said, GM also plans to “restructure and refocus Cruise’s operations” after it acquires the remaining shares, a move that it believes will cut annual spending by more than $1 billion starting in mid-2025. With cuts that large incoming, it’s hard to imagine some jobs won’t be lost in the process. Then again, it’s also possible some employees will simply be assigned to different roles within the company. We’ve reached out to GM for more information on how this decision will impact Cruise’s employees and will update when we receive a response. “GM is committed to delivering the best driving experiences to our customers in a disciplined and capital efficient manner,” said GM Chair and CEO Mary Barra said in a statement. “Cruise has been an early innovator in autonomy, and the deeper integration of our teams, paired with GM’s strong brands, scale, and manufacturing strength, will help advance our vision for the future of transportation.”GM’s decision to focus on bringing self-driving technology to privately owned vehicles will likely be disappointing for urbanists, environmentalists and pedestrian safety advocates who understand that self-driving cars would ruin cities instead of fixing them, but let’s also not forget another group that will be impacted by this decision — the thrill seekers who enjoy playing a forbidden game of Hide the Hog in the back seat of Cruise’s robotaxis. Without driverless taxis to hook up in, what are they supposed to do? Use the bed in an apartment like the rest of us?",
  "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/f5a4fd2e6ee753cf82abf6ef68557faf.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cfigure id=\"\" data-id=\"f5a4fd2e6ee753cf82abf6ef68557faf\" data-recommend-id=\"image://f5a4fd2e6ee753cf82abf6ef68557faf\" data-format=\"jpg\" data-width=\"4959\" data-height=\"2791\" data-lightbox=\"true\" data-alt=\"Cruise Robotaxi\" data-recommended=\"false\" data-hide=\"false\" contenteditable=\"false\" draggable=\"false\"\u003e\u003cdiv contenteditable=\"false\" data-alt=\"Cruise Robotaxi\" data-link-reference=\"\" data-link-target=\"\" data-syndicationrights=\"true\" data-imagerights=\"shutterstock\" data-hide=\"false\" data-hidecredit=\"false\"\u003e\u003cp\u003e\u003cspan\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource media=\"(max-width: 37.31em)\" type=\"image/jpeg\" srcset=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_645/f5a4fd2e6ee753cf82abf6ef68557faf.jpg\"/\u003e\u003csource media=\"(min-width: 37.37em)\" type=\"image/jpeg\" srcset=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_1315/f5a4fd2e6ee753cf82abf6ef68557faf.jpg\"/\u003e\u003cimg alt=\"Cruise Robotaxi\" data-chomp-id=\"f5a4fd2e6ee753cf82abf6ef68557faf\" data-format=\"jpg\" data-height=\"2791\" data-alt=\"Cruise Robotaxi\" data-anim-src=\"\" src=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_645/f5a4fd2e6ee753cf82abf6ef68557faf.jpg\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cfigcaption\u003ePhoto: Shutterstock/Phil Pasquini (Shutterstock)\u003c/figcaption\u003e\u003c/p\u003e\u003c/div\u003e\u003cspan data-id=\"f5a4fd2e6ee753cf82abf6ef68557faf\" data-recommend-id=\"image://f5a4fd2e6ee753cf82abf6ef68557faf\" data-format=\"jpg\" data-width=\"4959\" data-height=\"2791\" data-lightbox=\"true\" data-alt=\"Cruise Robotaxi\" data-recommended=\"false\" data-hide=\"false\"\u003e\u003c/span\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://jalopnik.com/cruise-robotaxis-are-back-after-maiming-a-pedestrian-la-1851653409\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://jalopnik.com/cruise-robotaxis-are-back-after-maiming-a-pedestrian-la-1851653409\"\u003eGeneral Motors’ Cruise robotaxi mapping unit returned to the Bay Area\u003c/a\u003e\u003c/span\u003e in September, about a year after \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://jalopnik.com/gms-cruise-didnt-admit-to-pedestrian-crash-because-of-a-1851200241\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://jalopnik.com/gms-cruise-didnt-admit-to-pedestrian-crash-because-of-a-1851200241\"\u003eone of its cars hit a pedestrian\u003c/a\u003e\u003c/span\u003e. That didn’t last long, though, as GM announced today that it “plans to realign its autonomous driving strategy and prioritize development of advanced driver assistance systems on a path to fully autonomous personal vehicles.” If you don’t speak press release, that’s GM’s way of saying it’s done with robotaxis and will instead focus on bringing more advanced versions of its \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://jalopnik.com/gms-super-cruise-is-handy-but-it-definitely-has-its-qu-1851453268\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://jalopnik.com/gms-super-cruise-is-handy-but-it-definitely-has-its-qu-1851453268\"\u003eSuper Cruise automated driving technology\u003c/a\u003e\u003c/span\u003e to privately owned vehicles.\u003c/p\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cdiv data-video-id=\"197316\" data-monetizable=\"true\" data-position=\"sidebar\" data-video-title=\"It\u0026#39;s Time To Discontinue The Model S | Jalopinions\" data-video-blog-id=\"12\" data-video-network=\"jalopnik\" data-video-duration=\"136\" data-playlist=\"197316,197315,197310\" data-current=\"197316\"\u003e\u003cdiv\u003e\u003cp\u003eIt\u0026#39;s Time To Discontinue The Model S | Jalopinions\u003c/p\u003e\u003c/div\u003e\u003cvideo disablepictureinpicture=\"\" muted=\"\" playsinline=\"\" width=\"100%\" height=\"100%\" crossorigin=\"anonymous\" preload=\"none\"\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197316/197316_240p.mp4\" label=\"240p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197316/197316_480p.mp4\" label=\"480p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197316/197316_720p.mp4\" label=\"720p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197316/197316_1080p.mp4\" label=\"1080p\" type=\"video/mp4\"/\u003e\u003ctrack kind=\"captions\" label=\"English\" src=\"https://kinja.com/api/videoupload/caption/22854.vtt\" srclang=\"en\"/\u003e\u003c/video\u003e\u003cdiv\u003e\u003cul\u003e\u003cli data-label=\"\"\u003eOff\u003c/li\u003e\u003cli data-label=\"English\"\u003eEnglish\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cp\u003eGM cited the time and resources it would take the scale up Cruise’s robotaxi business as the motivation for the decision, as well as the competition in the market. While this announcement is probably disappointing for many of the employees who dedicated years of their lives to making Cruise robotaxis a reality, the good news for them is that they should still have jobs for now. GM says it plans to acquire the remaining 10 percent of the self-driving tech company that it doesn’t already own and have its internal technology team eventually absorb Cruise. \u003c/p\u003e\u003cp\u003eThat said, GM also plans to “restructure and refocus Cruise’s operations” after it acquires the remaining shares, a move that it believes will cut annual spending by more than $1 billion starting in mid-2025. With cuts that large incoming, it’s hard to imagine some jobs won’t be lost in the process. Then again, it’s also possible some employees will simply be assigned to different roles within the company. We’ve reached out to GM for more information on how this decision will impact Cruise’s employees and will update when we receive a response. \u003c/p\u003e\u003cp\u003e“GM is committed to delivering the best driving experiences to our customers in a disciplined and capital efficient manner,” said GM Chair and CEO Mary Barra said in a statement. “Cruise has been an early innovator in autonomy, and the deeper integration of our teams, paired with GM’s strong brands, scale, and manufacturing strength, will help advance our vision for the future of transportation.”\u003c/p\u003e\u003cp\u003eGM’s decision to focus on bringing self-driving technology to privately owned vehicles will likely be disappointing for urbanists, environmentalists and pedestrian safety advocates who understand that \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://jalopnik.com/self-driving-cars-will-ruin-cities-not-fix-them-1851695025\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://jalopnik.com/self-driving-cars-will-ruin-cities-not-fix-them-1851695025\"\u003eself-driving cars would ruin cities instead of fixing them\u003c/a\u003e\u003c/span\u003e, but let’s also not forget another group that will be impacted by this decision — \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://jalopnik.com/people-are-already-having-sex-in-san-franciscos-robotax-1850731157\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://jalopnik.com/people-are-already-having-sex-in-san-franciscos-robotax-1850731157\"\u003ethe thrill seekers who enjoy playing a forbidden game of Hide the Hog in the back seat of Cruise’s robotaxis\u003c/a\u003e\u003c/span\u003e. Without driverless taxis to hook up in, what are they supposed to do? Use the bed in an apartment like the rest of us?\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-10T18:33:22-05:00",
  "modifiedTime": null
}
