{
  "id": "6c68838e-6860-48e6-9d65-a8d72dcecf63",
  "title": "Renault launches Ferrari-style support scheme for classic cars",
  "link": "https://www.autocar.co.uk/car-news/new-cars/renault-launches-ferrari-style-support-scheme-classic-cars",
  "description": "New service will launch in France first, but global expansion is planned Brand will recommend mechanics and suppliers for its historic models as part of wider heritage push Renault is aiming to bolster the appeal and values of its historic cars with a new certification for specialist technicians and suppliers, comparable to the Ferrari Classiche and Porsche Classic programmes. Different garages will be recommended for specific models and services. For example, a classic Renault 5 owner would be guided to mechanics particularly well versed in maintaining the 1970s supermini. An extension of Renault’s The Originals division, dedicated to promoting its historic models and selling merchandise, the seal of approval will initially be applied to eight sites, exclusively in France. Renault said it plans to gradually grow the network to 25 approved garages across the nation, putting people in 80% of the country within 100km (62 miles) of a specialist. Thereafter, it will look to global expansion. Alongside the new service, Renault has published 50 original repair manuals for classic models online, free of charge, in addition to a series of how-to videos. “Clearly, the reference is Porsche and Ferrari, because they really take care of the collectors,” Renault marketing boss Arnaud Belloni said at the Rétromobile classic car show. Belloni suggested that going big on Renault’s heritage was a means of fighting off younger and highly competitive brands from China, because “there is no strong brand in the world without legacy”.  “We’ve got young brands coming from everywhere but they have no legacy – they can succeed, sure, but you are stronger if you have legacy,” he said. “Each time you valorise legacy; each time you respect legacy; each time you talk about legacy, make it alive, you are stronger.” Belloni said that, in addition to the subjective strength of a brand, there is a tangible financial benefit to focusing on heritage too.  He explained: “Economists admit that legacy is one of the big assets of a company, and it provides the value to the company, but it also provides the value to the modern company – each time we do events around legacy cars, it [increases] the value of all the cars of the same range. “When we did the Renault 17 restomod, the value of Renault 17s grew, and it gives a higher value to the current Renault range that has nothing to do with the 17.” This has particular relevance for Renault, which is majoring on retro model revivals with the new 4 and 5 imminent, and a new Twingo due next year. Belloni said: “Why should we do cars that people don’t want when we can do cars that people want?  “That’s the definition of our job – everybody was asking for Renault 5, we did Renault 5; everyone was asking for Renault 4, we did Renault 4; [van] guys were asking for Estafette, we’re going to provide Estafette.”",
  "author": "",
  "published": "Tue, 11 Feb 2025 08:57:48 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Charlie Martin",
  "length": 2066,
  "excerpt": "Brand will recommend mechanics and suppliers for its historic models, amid wider heritage push",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Renault is aiming to bolster the appeal and values of its historic cars with a new certification for specialist technicians and suppliers, comparable to the Ferrari Classiche and Porsche Classic programmes. Different garages will be recommended for specific models and services. For example, a classic Renault 5 owner would be guided to mechanics particularly well versed in maintaining the 1970s supermini. An extension of Renault’s The Originals division, dedicated to promoting its historic models and selling merchandise, the seal of approval will initially be applied to eight sites, exclusively in France. Renault said it plans to gradually grow the network to 25 approved garages across the nation, putting people in 80% of the country within 100km (62 miles) of a specialist. Thereafter, it will look to global expansion. Alongside the new service, Renault has published 50 original repair manuals for classic models online, free of charge, in addition to a series of how-to videos. “Clearly, the reference is Porsche and Ferrari, because they really take care of the collectors,” Renault marketing boss Arnaud Belloni said at the Rétromobile classic car show. Belloni suggested that going big on Renault’s heritage was a means of fighting off younger and highly competitive brands from China, because “there is no strong brand in the world without legacy”.  “We’ve got young brands coming from everywhere but they have no legacy – they can succeed, sure, but you are stronger if you have legacy,” he said. “Each time you valorise legacy; each time you respect legacy; each time you talk about legacy, make it alive, you are stronger.” Belloni said that, in addition to the subjective strength of a brand, there is a tangible financial benefit to focusing on heritage too.  He explained: “Economists admit that legacy is one of the big assets of a company, and it provides the value to the company, but it also provides the value to the modern company – each time we do events around legacy cars, it [increases] the value of all the cars of the same range.",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/classic-renault-5-front-cornering.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eRenault is aiming to bolster the appeal and values of its historic cars with a new certification for specialist technicians and suppliers, comparable to the \u003ca href=\"https://www.autocar.co.uk/car-reviews/ferrari\"\u003eFerrari\u003c/a\u003e Classiche and \u003ca href=\"https://www.autocar.co.uk/car-review/porsche\"\u003ePorsche\u003c/a\u003e Classic programmes.\u003c/p\u003e\n\u003cp\u003eDifferent garages will be recommended for specific models and services. For example, a classic \u003ca href=\"https://www.autocar.co.uk/car-review/renault/5\"\u003eRenault 5\u003c/a\u003e owner would be guided to mechanics particularly well versed in maintaining the 1970s supermini.\u003c/p\u003e\n\u003cp\u003eAn extension of \u003ca href=\"https://www.autocar.co.uk/car-review/renault\"\u003eRenault\u003c/a\u003e\u003cspan\u003e’\u003c/span\u003es The Originals division, dedicated to promoting its historic models and selling merchandise, the seal of approval will initially be applied to eight sites, exclusively in France.\u003c/p\u003e\n\n\u003cp\u003eRenault said it plans to gradually grow the network to 25 approved garages across the nation, putting people in 80% of the country within 100km (62 miles) of a specialist. Thereafter, it will look to global expansion.\u003c/p\u003e\n\u003cp\u003eAlongside the new service, Renault has published 50 original repair manuals for classic models online, free of charge, in addition to a series of how-to videos.\u003c/p\u003e\n\u003cp\u003e“Clearly, the reference is Porsche and \u003ca href=\"https://www.autocar.co.uk/car-review/ferrari\"\u003eFerrari\u003c/a\u003e, because they really take care of the collectors,” Renault marketing boss Arnaud Belloni said at the Rétromobile classic car show.\u003c/p\u003e\n\u003cp\u003eBelloni suggested that going big on Renault’s heritage was a means of fighting off younger and highly competitive brands from China, because “there is no strong brand in the world without legacy”. \u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"Renault 4 front turning\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/renault-4-front-turning.jpg?itok=BxILWub0\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/renault-4-front-turning.jpg?itok=BxILWub0\"/\u003e\u003c/p\u003e\n\u003cp\u003e“We’ve got young brands coming from everywhere but they have no legacy – they can succeed, sure, but you are stronger if you have legacy,” he said. “Each time you valorise legacy; each time you respect legacy; each time you talk about legacy, make it alive, you are stronger.”\u003c/p\u003e\n\u003cp\u003eBelloni said that, in addition to the subjective strength of a brand, there is a tangible financial benefit to focusing on heritage too. \u003c/p\u003e\n\u003cp\u003eHe explained: “Economists admit that legacy is one of the big assets of a company, and it provides the value to the company, but it also provides the value to the modern company – each time we do events around legacy cars, it [increases] the value of all the cars of the same range.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "1970-01-01T01:00:00Z",
  "modifiedTime": null
}
