{
  "id": "6f05cebf-4947-426a-b7cd-29b7c3fd5251",
  "title": "Millionaire Tricked Into Paying $5.4M For Fake Mercedes-AMG ONE Sale",
  "link": "https://www.carscoops.com/2025/03/millionaire-loses-5400000-to-fake-mercedes-amg-one-scam/",
  "description": "The perpetrator is already in jail for a separate crime police say",
  "author": "Stephen Rivers",
  "published": "Fri, 07 Mar 2025 00:50:00 +0000",
  "source": "https://www.carscoops.com/feed/",
  "categories": [
    "news",
    "AMG",
    "Mercedes-AMG One",
    "Offbeat News",
    "Police",
    "Reports"
  ],
  "byline": "Stephen Rivers",
  "length": 4144,
  "excerpt": "The perpetrator is already in jail for a separate crime police say",
  "siteName": "Carscoops",
  "favicon": "https://www.carscoops.com/wp-content/uploads/2022/12/apple-icon-152x152-1.png",
  "text": "The perpetrator is already in jail for a separate crime police say March 6, 2025 at 19:50 by Stephen Rivers Revolve CEO Michael Mente lost $5.4M after falling for a fake Mercedes-AMG One deal. The scammer posed as a French dealer, offering the nonexistent hypercar for sale. Mente learned of the scam when Homeland Security revealed his payment was stolen. It’s a hard pill to swallow, but even the ultra-wealthy and financially savvy aren’t immune to being scammed. That’s exactly what happened to Revolve CEO Michael Mente, who learned this lesson the hard way. According to newly released court documents, Mente fell victim to a scam that cost him a staggering $5.4 million. The scam? A nonexistent Mercedes-AMG ONE, which, as you might have guessed, he never received. And Mente wasn’t the first target of this particular con artist. The man allegedly behind the scheme is Traveon Rogers, a Texas resident with a criminal history. Authorities say Rogers pretended to be Jean-Pierre M.R. Clement, a French car dealer, and used this fake identity to lure Mente into a deal. When Mente went on a search for a Mercedes-AMG One in 2021, Rogers’ attorney facilitated the connection between the two men. Rogers, playing the part of an exclusive dealer, claimed to have an allocation for sale. Mente, eager to secure the supercar, agreed to pay $5.4 million and waited patiently for the production and delivery of his prized vehicle. But, as it turns out, neither of those things were ever coming. More: Facebook Marketplace Scam Leaves Ram Buyer With Stolen Truck Surrounded By Cops And Out $28,000 Instead, Mente heard from the U.S. Department of Homeland Security in 2022 that his money was gone and that J.P.M.R. Clement didn’t exist. Now, documents obtained by the Denver Post disclose that Mente is trying to get his money back from Rogers in addition to other damages. Interestingly, Rogers’ attorney, Scott Oliver, practices in Longmont, Colorado and said he knew nothing of the scheme. “Rogers was quite a character. Clearly he was able to convince people and get them to pay money and defraud people out of a lot of money,” he said. Notably, this isn’t the first time Rogers has reportedly attempted this kind of scam. In 2023, he faced a separate lawsuit for trying to sell an AMG One that didn’t exist. In that case, he allegedly obtained $3.19 million in the deal. Here he is in a video making various claims about his wealth. On top of that, he’s faced charges of forging contracts, forging banking documents, and impersonating representatives from Aston Martin and a Cleveland car dealer. As reported by Jalopnik, in the world of online sleuths he’s becoming a bit notorious too. Investigations detailing his misdeeds have popped up on X and YouTube. If anything, it just goes to show that anyone can fall victim to a scam if they’re not careful.  The Mercedes-AMG ONE, which is at the heart of this debacle, is not your average car. With just 275 units produced, it’s a rare breed. Powered by a 1.6-liter turbocharged hybrid six-cylinder engine derived from Mercedes’ F1 cars and boosted by electric motors and a turbocharger system, it produces a monstrous 1,048 horsepower. This German rocket can hit 62 mph in just 2.9 seconds. Originally priced at $2.7 million, the hypercar’s value has skyrocketed, with second-hand models now fetching several million more.",
  "image": "https://www.carscoops.com/wp-content/uploads/2025/03/5gf4rvecdc.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \n                        \u003cp\u003e\n                            The perpetrator is already in jail for a separate crime police say                        \u003c/p\u003e\n                        \u003cdiv\u003e\n                            \n                            \u003cp\u003eMarch 6, 2025 at 19:50\u003c/p\u003e\n                            \u003cp\u003e\u003ca href=\"#thread__container\"\u003e\n\n                                \u003cimg width=\"24px\" loading=\"lazy\" height=\"22px\" alt=\"comments\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/msg.png\"/\u003e \n                                \n                            \u003c/a\u003e\u003c/p\u003e\n                        \u003c/div\u003e\n                        \u003cdiv\u003e\n                            \n                                                                                    \n                            \u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://www.carscoops.com/wp-content/uploads/webp/2025/03/5gf4rvecdc.webp 2450w, https://www.carscoops.com/wp-content/uploads/webp/2025/03/5gf4rvecdc-400x225.webp 400w, https://www.carscoops.com/wp-content/uploads/webp/2025/03/5gf4rvecdc-1024x576.webp 1024w, https://www.carscoops.com/wp-content/uploads/webp/2025/03/5gf4rvecdc-768x432.webp 768w, https://www.carscoops.com/wp-content/uploads/webp/2025/03/5gf4rvecdc-1536x864.webp 1536w, https://www.carscoops.com/wp-content/uploads/webp/2025/03/5gf4rvecdc-2048x1152.webp 2048w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\"/\u003e\u003cimg src=\"https://www.carscoops.com/wp-content/uploads/2025/03/5gf4rvecdc-1024x576.jpg\" srcset=\"https://www.carscoops.com/wp-content/uploads/2025/03/5gf4rvecdc.jpg 2450w, https://www.carscoops.com/wp-content/uploads/2025/03/5gf4rvecdc-400x225.jpg 400w, https://www.carscoops.com/wp-content/uploads/2025/03/5gf4rvecdc-1024x576.jpg 1024w, https://www.carscoops.com/wp-content/uploads/2025/03/5gf4rvecdc-768x432.jpg 768w, https://www.carscoops.com/wp-content/uploads/2025/03/5gf4rvecdc-1536x864.jpg 1536w, https://www.carscoops.com/wp-content/uploads/2025/03/5gf4rvecdc-2048x1152.jpg 2048w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\" alt=\" Millionaire Tricked Into Paying $5.4M For Fake Mercedes-AMG ONE Sale\" width=\"2450\" height=\"1378\"/\u003e\u003c/picture\u003e                        \u003c/div\u003e\n                        \n                        \u003cp\u003e\n                            \u003ch4\u003e\n                                by \u003ca href=\"https://www.carscoops.com/author/stephen-rivers/\"\u003e\u003cspan\u003eStephen Rivers\u003c/span\u003e\u003c/a\u003e\n                            \u003c/h4\u003e    \n                        \u003c/p\u003e\n                    \u003c/div\u003e\u003cdiv\u003e\n                        \n                        \n                        \n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eRevolve CEO Michael Mente lost $5.4M after falling for a fake Mercedes-AMG One deal.\u003c/li\u003e\n\n\n\n\u003cli\u003eThe scammer posed as a French dealer, offering the nonexistent hypercar for sale.\u003c/li\u003e\n\n\n\n\u003cli\u003eMente learned of the scam when Homeland Security revealed his payment was stolen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003eIt’s a hard pill to swallow, but even the ultra-wealthy and financially savvy aren’t immune to being \u003ca href=\"https://www.carscoops.com/2024/08/scammers-use-fake-parking-tickets-to-steal-your-banking-information/\"\u003escammed\u003c/a\u003e. That’s exactly what happened to Revolve CEO Michael Mente, who learned this lesson the hard way. According to newly released court documents, Mente fell victim to a scam that cost him a staggering $5.4 million. The scam? A nonexistent Mercedes-AMG ONE, which, as you might have guessed, he never received. And Mente wasn’t the first target of this particular con artist.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eThe man allegedly behind the scheme is Traveon Rogers, a Texas resident with a criminal history. Authorities say Rogers pretended to be Jean-Pierre M.R. Clement, a French car dealer, and used this fake identity to lure Mente into a deal.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen Mente went on a search for a \u003ca href=\"https://www.carscoops.com/tag/mercedes-amg-one/\"\u003eMercedes-AMG One\u003c/a\u003e in 2021, Rogers’ attorney facilitated the connection between the two men. Rogers, playing the part of an exclusive dealer, claimed to have an allocation for sale. Mente, eager to secure the supercar, agreed to pay $5.4 million and waited patiently for the production and delivery of his prized vehicle. But, as it turns out, neither of those things were ever coming.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMore: \u003ca href=\"https://www.carscoops.com/2025/03/facebook-marketplace-scam-leaves-ram-buyer-with-stolen-truck-surrounded-by-cops-and-out-28000/\"\u003eFacebook Marketplace Scam Leaves Ram Buyer With Stolen Truck Surrounded By Cops And Out $28,000\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n\n\u003cp\u003eInstead, Mente heard from the U.S. Department of Homeland Security in 2022 that his money was gone and that J.P.M.R. Clement didn’t exist. Now, documents obtained by the \u003ca href=\"https://www.denverpost.com/2025/03/04/traveon-rogers-lawsuit-mercedes-amg-one-scott-oliver/?clearUserState=true\"\u003e\u003cem\u003eDenver Post\u003c/em\u003e\u003c/a\u003e disclose that Mente is trying to get his money back from Rogers in addition to other damages. Interestingly, Rogers’ attorney, Scott Oliver, practices in Longmont, Colorado and said he knew nothing of the scheme.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Rogers was quite a character. Clearly he was able to convince people and get them to pay money and defraud people out of a lot of money,” he said. Notably, this isn’t the first time Rogers has reportedly attempted this kind of scam. In 2023, he faced a separate lawsuit for trying to sell an \u003ca href=\"https://www.carscoops.com/tag/amg/\"\u003eAMG\u003c/a\u003e One that didn’t exist. In that case, he allegedly obtained $3.19 million in the deal. Here he is in a video making various claims about his wealth.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eOn top of that, he’s faced charges of forging contracts, forging banking documents, and impersonating representatives from \u003ca href=\"https://www.carscoops.com/tag/aston-martin/\"\u003eAston Martin\u003c/a\u003e and a Cleveland car dealer. As reported by \u003cem\u003e\u003ca href=\"https://www.jalopnik.com/1804906/online-retail-ceo-5-million-dollar-mercedes-amg-one-scam/\"\u003eJalopnik\u003c/a\u003e\u003c/em\u003e, in the world of online sleuths he’s becoming a bit notorious too. Investigations detailing his misdeeds have popped up on X and YouTube. If anything, it just goes to show that anyone can fall victim to a scam if they’re not careful. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe Mercedes-AMG ONE, which is at the heart of this debacle, is not your average car. With just 275 units produced, it’s a rare breed. Powered by a 1.6-liter turbocharged hybrid six-cylinder engine derived from Mercedes’ F1 cars and boosted by electric motors and a turbocharger system, it produces a monstrous 1,048 horsepower. This German rocket can hit 62 mph in just 2.9 seconds. Originally priced at $2.7 million, the \u003ca href=\"https://www.carscoops.com/2024/01/the-worlds-wildest-1-6-liter-hypercar-the-mercedes-amg-one-is-now-available-to-anyone/\"\u003ehypercar’s value has skyrocketed\u003c/a\u003e, with second-hand models now fetching several million more.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Serial Scammer lies about $420 Million in Viral Interview\" width=\"500\" height=\"281\" src=\"\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/9t2Qcc47Yh0?feature=oembed\" onload=\"resizeIframe(this,this.parentElement);\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n                        \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-07T00:50:00Z",
  "modifiedTime": "2025-03-07T00:35:15Z"
}
