{
  "id": "713ba80d-dd34-44e4-8d4d-dd7d62baa52e",
  "title": "Bharat Mobility Expo 2025 exhibitor list revealed",
  "link": "https://www.autocarindia.com/industry/bharat-mobility-global-expo-2025-brand-list-revealed-433684#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "The second Bharat Mobility Global Expo (BMGE), which was earlier known as the Auto Expo will be held from January 17-22, 2025. The event will see participation of more brands than in its first edition. The 2025 Bharat Mobility Global Expo will be held at Bharat Mandapam in New Delhi and will have almost all mainstream car brands along with some luxury carmakers. Read on to find out what’s in store. Event to have over 10 mass market car brands EV-only brands like Ather, Ola, Vinfast and BYD to be present Bajaj, Honda, Hero Moto Corp among major two wheeler brands Bharat Mobility Global Expo list of car, SUV brands The confirmed list of mass-market carmakers participating in the event includes Toyota, Maruti Suzuki, Hyundai, Mahindra, Tata Motors, Skoda and Volkswagen, Isuzu, Kia and JSW MG Motor India. Luxury car brands like Mercedes-Benz, Audi and BMW have also confirmed their presence. Additionally, Vietnamese EV-only brand Vinfast, which plans to enter India, will also showcase its line-up at the show. Chinese all-EV brand, BYD, will also have its cars and SUVs on display. Bharat Mobility Global Expo list bike, scooter brands Two-wheeler brands like Ather Energy, Bajaj Auto, BMW Motorrad, Honda Scooters, Hero MotoCorp, Yamaha India, Ola Electric, Suzuki Motorcycle India and TVS, among others will be showcase their line-up at the show. Bharat Mobility Global Expo component show details Apart from the event at Bharat Mandapam, there will be a components show as well that will be held between January 18 and 21 at the new Yashobhoomi (India International Convention and Expo Centre) in Dwarka, New Delhi. Stay tuned for a detailed list of new launches and concepts from each automaker.  Also See: Mahindra XEV 9e launched at Rs 21.90 lakh Mahindra BE 6e launched at Rs 18.90 lakh",
  "author": "Akbar Merchant",
  "published": "Wed, 27 Nov 2024 13:45:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Akbar Merchant",
  "length": 1899,
  "excerpt": "Previously called the Auto Expo, the BMGE 2025 will have over 25 car and bike makers showcasing their models.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "Previously called the Auto Expo, the BMGE 2025 will have over 25 car and bike makers showcasing their models.The second Bharat Mobility Global Expo (BMGE), which was earlier known as the Auto Expo will be held from January 17-22, 2025. The event will see participation of more brands than in its first edition. The 2025 Bharat Mobility Global Expo will be held at Bharat Mandapam in New Delhi and will have almost all mainstream car brands along with some luxury carmakers. Read on to find out what’s in store.Event to have over 10 mass market car brandsEV-only brands like Ather, Ola, Vinfast and BYD to be presentBajaj, Honda, Hero Moto Corp among major two wheeler brandsBharat Mobility Global Expo list of car, SUV brandsThe confirmed list of mass-market carmakers participating in the event includes Toyota, Maruti Suzuki, Hyundai, Mahindra, Tata Motors, Skoda and Volkswagen, Isuzu, Kia and JSW MG Motor India. Luxury car brands like Mercedes-Benz, Audi and BMW have also confirmed their presence. Additionally, Vietnamese EV-only brand Vinfast, which plans to enter India, will also showcase its line-up at the show. Chinese all-EV brand, BYD, will also have its cars and SUVs on display.Bharat Mobility Global Expo list bike, scooter brandsTwo-wheeler brands like Ather Energy, Bajaj Auto, BMW Motorrad, Honda Scooters, Hero MotoCorp, Yamaha India, Ola Electric, Suzuki Motorcycle India and TVS, among others will be showcase their line-up at the show.Bharat Mobility Global Expo component show detailsApart from the event at Bharat Mandapam, there will be a components show as well that will be held between January 18 and 21 at the new Yashobhoomi (India International Convention and Expo Centre) in Dwarka, New Delhi.Stay tuned for a detailed list of new launches and concepts from each automaker. Also See:Mahindra XEV 9e launched at Rs 21.90 lakhMahindra BE 6e launched at Rs 18.90 lakh",
  "image": "https://cdni.autocarindia.com/ExtraImages/20241127022220_Bharat Mobility 2025 Web _1_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003ePreviously called the Auto Expo, the BMGE 2025 will have over 25 car and bike makers showcasing their models.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe second \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/industry/bharat-mobility-global-expo-2025-dates-confirmed-430960\"\u003eBharat Mobility Global Expo\u003c/a\u003e \u003c/strong\u003e(BMGE), which was earlier known as the Auto Expo will be held from January 17-22, 2025. The event will see participation of more brands than in its first edition. The 2025 Bharat Mobility Global Expo will be held at Bharat Mandapam in New Delhi and will have almost all mainstream car brands along with some luxury carmakers. Read on to find out what’s in store.\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eEvent to have over 10 mass market car brands\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eEV-only brands like Ather, Ola, Vinfast and BYD to be present\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eBajaj, Honda, Hero Moto Corp among major two wheeler brands\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eBharat Mobility Global Expo list of car, SUV brands\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eThe confirmed list of mass-market carmakers participating in the event includes Toyota, Maruti Suzuki, Hyundai, Mahindra, Tata Motors, Skoda and Volkswagen, Isuzu, Kia and JSW MG Motor India. Luxury car brands like Mercedes-Benz, Audi and BMW have also confirmed their presence. Additionally, \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/vinfast-india-likely-to-begin-innings-with-vf-5-vf-e34-e-suvs-431261\"\u003eVietnamese EV-only brand Vinfast\u003c/a\u003e\u003c/strong\u003e, which plans to enter India, will also showcase its line-up at the show. Chinese all-EV brand, BYD, will also have its cars and SUVs on display.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eBharat Mobility Global Expo list bike, scooter brands\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eTwo-wheeler brands like Ather Energy, Bajaj Auto, BMW Motorrad, Honda Scooters, Hero MotoCorp, Yamaha India, Ola Electric, Suzuki Motorcycle India and TVS, among others will be showcase their line-up at the show.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eBharat Mobility Global Expo component show details\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eApart from the event at Bharat Mandapam, there will be a components show as well that will be held between January 18 and 21 at the new Yashobhoomi (India International Convention and Expo Centre) in Dwarka, New Delhi.\u003c/p\u003e\u003cp\u003eStay tuned for a detailed list of new launches and concepts from each automaker. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso See:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/mahindra-xev-9e-launched-at-rs-2190-lakh-433680\"\u003e\u003cstrong\u003eMahindra XEV 9e launched at Rs 21.90 lakh\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/mahindra-be-6e-launched-at-rs-1890-lakh-433679\"\u003e\u003cstrong\u003eMahindra BE 6e launched at Rs 18.90 lakh\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-27T13:45:00+05:30",
  "modifiedTime": null
}
