{
  "id": "7985b4b6-44bd-4b46-abf6-43d20216a41d",
  "title": "New performance cars launching in 2025",
  "link": "https://www.autocarindia.com/car-news/new-performance-cars-launching-in-2025-434043#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "If you are a performance car enthusiast and if you’re lucky enough to afford one, it seems like you’ll be spoilt for choices for new cars to choose from in 2025. From an all-new Lamborghini and Ferrari, two new Aston Martins, updates to existing nameplates, and even some new electric sportscars, there are a lot of high-performance machines arriving in India this year. Let’s take a closer look at each. Aston Martin Vanquish The all-new Vanquish, Aston Martin’s flagship front-engine tourer, is powered by a 5.2-litre twin-turbo V12 that produces 835hp and a massive 1,000Nm. The company claims a 0-100kph time of just 3.3 seconds, and a top speed of 345kph. It casts a longer, more flowing silhouette than its siblings, the DB12 and Vantage, befitting of its ‘hyper tourer’ status. The launch is expected in the first quarter of 2025, and prices are likely to be around the Rs 6 crore mark. (ex-showroom). Aston Martin Vantage Roadster Vantage coupe used for representation Aston Martin will bring the drop-top version of its Vantage sports car here shortly after its global debut. Other than the convertible roof top, the updates from the coupé will carry over, including the AMG-sourced 665hp V8, and the generous equipment list. There’s nothing entry-level about Aston’s junior sportscar though, with prices expected to be around the Rs 5 crore mark (ex-showroom). The Vantage Roadster will arrive by the middle of the year, but before that, the updated DBX 707, with its new interior, is also scheduled to arrive in the first quarter of 2025. Audi e-tron GT facelift The facelift for Audi’s all-electric performance sedan is headed here to take on the Porsche Taycan and Mercedes EQS. Along with subtle cosmetic changes, the e-tron GT gets quite a significant power boost and battery upgrade. The 97kWh battery (up from 84kWh) powers a 680hp dual-motor setup in the entry-level e-tron GT, an 857hp setup in the RS e-tron GT, and 925hp in the range-topping RS e-tron GT Performance. Prices for the e-tron GT are expected to be in the range of Rs 1.90 crore and Rs 2.20 crore (ex-showroom), and the launch is expected in the first quarter of this year. Audi RS Q8 Performance The fastest production SUV around the Nürburgring, the RS Q8 Performance will sit atop the Q8 range in India. Its V8 engine has been tuned to produce 640hp (up 40hp from the RS Q8), and it is 0.2 seconds quicker to 100kph, which it completes in a supercar-baiting 3.6 seconds. Along with sportier design outside and in, the RS Q8 Performance also gets a sportier, more evocative sounding exhaust. It is expected to arrive in the first quarter of this year, with an expected price of around Rs 2.50 crore (ex-showroom). Bentley Continental GT The all-new Continental GT, in Speed guise, eschews the iconic W12 engine for a hybridised V8, which makes 782hp and 1,000Nm of torque. Power is channelled to all four wheels via an 8-speed automatic gearbox. Bentley claims a 0-100kph time of 3.2 seconds, a top speed of 335kph, and an all-electric range of 80km. The exterior is very Batur-inspired and while the interior layout is familiar, there’s more tech on offer. The launch is expected in the second quarter of this year, and prices are likely to be north of 6 crores (ex-showroom). Ferrari 12Cilindri Ferrari’s celebration of 12-cylinder engines in their purest form is the appropriately named 12Cilindri. The 6.5-litre V12 unit from the 812 now makes a staggering 830hp and 678Nm, with the Italian marque claiming a 0-100kph time of 2.9 seconds, and a top speed of over 340kph. The 12Cilindri is undeniably Ferrari’s best GT car, one that can thrill on both road and track while boasting a bold mix of cutting-edge tech and heritage design inspired by the likes of the 1968 Ferrari 365 GTB/4. While its interior is similar to that of the Purosangue, the GT features a 10.25-inch central infotainment touchscreen. Apart from the coupe, Ferrari also revealed the Spider, which gets a roof that can retract in just 14 seconds at speeds of up to 45kph. But whether both will come to India is still unknown. The launch is expected before mid-2025, and it will likely cost around Rs 7.5c crores (ex-showroom). Lamborghini Temerario The Huracán’s successor is powered by an all-new hybrid V8 making a staggering 920hp and 800Nm of torque. The Temerario, which has clear visual links to the Huracán and the Gallardo, sprints from 0-100kph in a claimed 2.7 seconds, and has a top speed in excess of 340kph. The interior also carries the hexagonal motifs seen outside, along with Lambo’s typical fighter jet-themed cockpit. It is, however, only arriving much later in the fourth quarter of 2025 with prices expected to around Rs 5 crores (ex-showroom). Lotus Emira What may be the last ICE sportscar from Lotus, and a purists’ delight, will arrive in India with three powertrain options. The Emira will get an AMG-sourced 360hp four-cylinder turbo-petrol paired to an 8-speed dual-clutch auto, and a Toyota-sourced 400hp supercharged V6 that comes with either a 6-speed manual or an automatic. The launch is expected over the next couple of months, but with prices expected to exceed Rs 3 crores (ex-showroom), it will be quite expensive for what is only an entry-level sportscar. Lotus Emeya Lotus’ first performance sedan since the 1990 Carlton will arrive in India with a 102kWh battery that has up to 600km of range, and powers motors on each axle making a combined 918hp and 984Nm. The Emeya has a Porsche Taycan Turbo S-matching 0-100kph time of 2.8 seconds, and its wow factor outside and inside, and performance and handling makes a compelling case for itself as an addition to a multi-crore garage. The launch is expected around December this year with prices expected to range between Rs 2.25 crore and Rs 3.0 crore (ex-showroom). Maserati GranCabrio The GranTurismo’s drop-top sibling will come with a twin-turbo V6 engine that produces 550hp; all-wheel drive is standard. The heavier GranCabrio is slightly slower to 100kph (the coupe does it in 3.5 seconds), but its folding fabric top can be lowered or raised in 14 seconds, at speeds of up to 50kph. It will be more expensive than its coupe counterpart, likely touching the Rs 3 crores mark (ex-showroom), and the launch is expected by mid-2025. Maserati GranTurismo Folgore The electric counterpart of the Maserati’s GT, called the GranTurismo Folgore, is coming this year with an 83kWh (usable) battery with a claimed range of 450km. It produces 761hp and 1,350Nm of troque, which propels the coupé from 0-100kph in just 2.7 seconds. The GT Folgore also sports a slightly tweaked, EV-specific design. The launch is expected in the second half of 2025 with prices expected to be around Rs 3.5 crores. (ex-showroom). Mercedes-AMG CLE 53 The performance-focused CLE has a mild-hybrid twin-turbo straight-six making 449hp and up to 600Nm. Merc claims a 0-100kph time of 4.4 seconds, which can be lowered to 4.2 seconds with the AMG performance package. Mercedes also sells the CLE 53 AMG convertible in international markets, but it is yet to be ascertained which one is headed to India. As for pricing, we expect the AMG CLE 53 coupe to have a price tag of around Rs 2 crore, and the launch is expected by late-2025. MG Cyberster MG will dial up the cool quotient with the all-electric Cyberster that goes on sale this January at the Bharat Mobility Show. The Cyberster is based on a born-electric platform, and in India, it will be offered with a 77kWh battery pack, paired with two electric motors on each axle, simulating an AWD setup. This powertrain produces 510hp and 725Nm of peak torque, with a claimed 0-100kph sprint time of 3.2 seconds. MG claims a maximum range of 580km on a single charge (CLTC cycle). The convertible all-electric sports car will come to India as an import but pricing will be competitive. Also See: All new mass-market EVs launching in 2025 New car and SUV launches lined up in January 2025",
  "author": "Rivan RS",
  "published": "Sat, 4 Jan 2025 08:00:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Rivan RS",
  "length": 8026,
  "excerpt": "These include new models from Ferrari, Bentley, Aston Martin and even MG.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "These include new models from Ferrari, Bentley, Aston Martin and even MG. If you are a performance car enthusiast and if you’re lucky enough to afford one, it seems like you’ll be spoilt for choices for new cars to choose from in 2025. From an all-new Lamborghini and Ferrari, two new Aston Martins, updates to existing nameplates, and even some new electric sportscars, there are a lot of high-performance machines arriving in India this year. Let’s take a closer look at each.Aston Martin Vanquish The all-new Vanquish, Aston Martin’s flagship front-engine tourer, is powered by a 5.2-litre twin-turbo V12 that produces 835hp and a massive 1,000Nm. The company claims a 0-100kph time of just 3.3 seconds, and a top speed of 345kph. It casts a longer, more flowing silhouette than its siblings, the DB12 and Vantage, befitting of its ‘hyper tourer’ status. The launch is expected in the first quarter of 2025, and prices are likely to be around the Rs 6 crore mark. (ex-showroom).Aston Martin Vantage Roadster Vantage coupe used for representationAston Martin will bring the drop-top version of its Vantage sports car here shortly after its global debut. Other than the convertible roof top, the updates from the coupé will carry over, including the AMG-sourced 665hp V8, and the generous equipment list. There’s nothing entry-level about Aston’s junior sportscar though, with prices expected to be around the Rs 5 crore mark (ex-showroom). The Vantage Roadster will arrive by the middle of the year, but before that, the updated DBX 707, with its new interior, is also scheduled to arrive in the first quarter of 2025.Audi e-tron GT faceliftThe facelift for Audi’s all-electric performance sedan is headed here to take on the Porsche Taycan and Mercedes EQS. Along with subtle cosmetic changes, the e-tron GT gets quite a significant power boost and battery upgrade. The 97kWh battery (up from 84kWh) powers a 680hp dual-motor setup in the entry-level e-tron GT, an 857hp setup in the RS e-tron GT, and 925hp in the range-topping RS e-tron GT Performance. Prices for the e-tron GT are expected to be in the range of Rs 1.90 crore and Rs 2.20 crore (ex-showroom), and the launch is expected in the first quarter of this year.Audi RS Q8 Performance The fastest production SUV around the Nürburgring, the RS Q8 Performance will sit atop the Q8 range in India. Its V8 engine has been tuned to produce 640hp (up 40hp from the RS Q8), and it is 0.2 seconds quicker to 100kph, which it completes in a supercar-baiting 3.6 seconds. Along with sportier design outside and in, the RS Q8 Performance also gets a sportier, more evocative sounding exhaust. It is expected to arrive in the first quarter of this year, with an expected price of around Rs 2.50 crore (ex-showroom).Bentley Continental GT The all-new Continental GT, in Speed guise, eschews the iconic W12 engine for a hybridised V8, which makes 782hp and 1,000Nm of torque. Power is channelled to all four wheels via an 8-speed automatic gearbox. Bentley claims a 0-100kph time of 3.2 seconds, a top speed of 335kph, and an all-electric range of 80km. The exterior is very Batur-inspired and while the interior layout is familiar, there’s more tech on offer. The launch is expected in the second quarter of this year, and prices are likely to be north of 6 crores (ex-showroom).Ferrari 12Cilindri Ferrari’s celebration of 12-cylinder engines in their purest form is the appropriately named 12Cilindri. The 6.5-litre V12 unit from the 812 now makes a staggering 830hp and 678Nm, with the Italian marque claiming a 0-100kph time of 2.9 seconds, and a top speed of over 340kph. The 12Cilindri is undeniably Ferrari’s best GT car, one that can thrill on both road and track while boasting a bold mix of cutting-edge tech and heritage design inspired by the likes of the 1968 Ferrari 365 GTB/4. While its interior is similar to that of the Purosangue, the GT features a 10.25-inch central infotainment touchscreen. Apart from the coupe, Ferrari also revealed the Spider, which gets a roof that can retract in just 14 seconds at speeds of up to 45kph. But whether both will come to India is still unknown. The launch is expected before mid-2025, and it will likely cost around Rs 7.5c crores (ex-showroom).Lamborghini Temerario The Huracán’s successor is powered by an all-new hybrid V8 making a staggering 920hp and 800Nm of torque. The Temerario, which has clear visual links to the Huracán and the Gallardo, sprints from 0-100kph in a claimed 2.7 seconds, and has a top speed in excess of 340kph. The interior also carries the hexagonal motifs seen outside, along with Lambo’s typical fighter jet-themed cockpit. It is, however, only arriving much later in the fourth quarter of 2025 with prices expected to around Rs 5 crores (ex-showroom).Lotus Emira What may be the last ICE sportscar from Lotus, and a purists’ delight, will arrive in India with three powertrain options. The Emira will get an AMG-sourced 360hp four-cylinder turbo-petrol paired to an 8-speed dual-clutch auto, and a Toyota-sourced 400hp supercharged V6 that comes with either a 6-speed manual or an automatic. The launch is expected over the next couple of months, but with prices expected to exceed Rs 3 crores (ex-showroom), it will be quite expensive for what is only an entry-level sportscar.Lotus Emeya Lotus’ first performance sedan since the 1990 Carlton will arrive in India with a 102kWh battery that has up to 600km of range, and powers motors on each axle making a combined 918hp and 984Nm. The Emeya has a Porsche Taycan Turbo S-matching 0-100kph time of 2.8 seconds, and its wow factor outside and inside, and performance and handling makes a compelling case for itself as an addition to a multi-crore garage. The launch is expected around December this year with prices expected to range between Rs 2.25 crore and Rs 3.0 crore (ex-showroom).Maserati GranCabrio The GranTurismo’s drop-top sibling will come with a twin-turbo V6 engine that produces 550hp; all-wheel drive is standard. The heavier GranCabrio is slightly slower to 100kph (the coupe does it in 3.5 seconds), but its folding fabric top can be lowered or raised in 14 seconds, at speeds of up to 50kph. It will be more expensive than its coupe counterpart, likely touching the Rs 3 crores mark (ex-showroom), and the launch is expected by mid-2025.Maserati GranTurismo Folgore The electric counterpart of the Maserati’s GT, called the GranTurismo Folgore, is coming this year with an 83kWh (usable) battery with a claimed range of 450km. It produces 761hp and 1,350Nm of troque, which propels the coupé from 0-100kph in just 2.7 seconds. The GT Folgore also sports a slightly tweaked, EV-specific design. The launch is expected in the second half of 2025 with prices expected to be around Rs 3.5 crores. (ex-showroom).Mercedes-AMG CLE 53The performance-focused CLE has a mild-hybrid twin-turbo straight-six making 449hp and up to 600Nm. Merc claims a 0-100kph time of 4.4 seconds, which can be lowered to 4.2 seconds with the AMG performance package. Mercedes also sells the CLE 53 AMG convertible in international markets, but it is yet to be ascertained which one is headed to India. As for pricing, we expect the AMG CLE 53 coupe to have a price tag of around Rs 2 crore, and the launch is expected by late-2025.MG Cyberster MG will dial up the cool quotient with the all-electric Cyberster that goes on sale this January at the Bharat Mobility Show. The Cyberster is based on a born-electric platform, and in India, it will be offered with a 77kWh battery pack, paired with two electric motors on each axle, simulating an AWD setup. This powertrain produces 510hp and 725Nm of peak torque, with a claimed 0-100kph sprint time of 3.2 seconds. MG claims a maximum range of 580km on a single charge (CLTC cycle). The convertible all-electric sports car will come to India as an import but pricing will be competitive.Also See:All new mass-market EVs launching in 2025New car and SUV launches lined up in January 2025ImagesVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20250103065445_Upcoming Performance Cars in 2025.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eThese include new models from Ferrari, Bentley, Aston Martin and even MG. \u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eIf you are a performance car enthusiast and if you’re lucky enough to afford one, it seems like you’ll be spoilt for choices for new cars to choose from in 2025. From an all-new Lamborghini and Ferrari, two new Aston Martins, updates to existing nameplates, and even some new electric sportscars, there are a lot of high-performance machines arriving in India this year. Let’s take a closer look at each.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eAston Martin Vanquish \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20240903041000_Vanquish.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eThe all-new \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/new-aston-martin-vanquish-revealed-as-835hp-v12-flagship-432736\"\u003eVanquish\u003c/a\u003e\u003c/strong\u003e, Aston Martin’s flagship front-engine tourer, is powered by a 5.2-litre twin-turbo V12 that produces 835hp and a massive 1,000Nm. The company claims a 0-100kph time of just 3.3 seconds, and a top speed of 345kph. It casts a longer, more flowing silhouette than its siblings, the DB12 and Vantage, befitting of its ‘hyper tourer’ status. The launch is expected in the first quarter of 2025, and prices are likely to be around the Rs 6 crore mark. (ex-showroom).\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eAston Martin Vantage Roadster \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/Aston Martin Vantage Web.008.jpeg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003cem\u003eVantage coupe used for representation\u003c/em\u003e\u003c/p\u003e\u003cp\u003eAston Martin will bring the drop-top version of its Vantage sports car here shortly after its global debut. Other than the convertible roof top, the updates from the coupé will carry over, including the AMG-sourced 665hp V8, and the generous equipment list. There’s nothing entry-level about Aston’s junior sportscar though, with prices expected to be around the Rs 5 crore mark (ex-showroom). The Vantage Roadster will arrive by the middle of the year, but before that, the updated DBX 707, with its new interior, is also scheduled to arrive in the first quarter of 2025.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eAudi e-tron GT facelift\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/2 - 2024-09-16T225742.915.png\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eThe facelift for Audi’s all-electric performance sedan is headed here to take on the Porsche Taycan and Mercedes EQS. Along with subtle cosmetic changes, the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-reviews/2025-audi-e-tron-gt-facelift-review-warp-speed-432872\"\u003ee-tron GT\u003c/a\u003e\u003c/strong\u003e gets quite a significant power boost and battery upgrade. The 97kWh battery (up from 84kWh) powers a 680hp dual-motor setup in the entry-level e-tron GT, an 857hp setup in the RS e-tron GT, and 925hp in the range-topping RS e-tron GT Performance. Prices for the e-tron GT are expected to be in the range of Rs 1.90 crore and Rs 2.20 crore (ex-showroom), and the launch is expected in the first quarter of this year.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eAudi RS Q8 Performance \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/1 (46).jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eThe fastest production SUV around the Nürburgring, the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-reviews/2024-audi-rs-q8-review-identity-crisis-433976\"\u003eRS Q8 Performance\u003c/a\u003e\u003c/strong\u003e will sit atop the Q8 range in India. Its V8 engine has been tuned to produce 640hp (up 40hp from the RS Q8), and it is 0.2 seconds quicker to 100kph, which it completes in a supercar-baiting 3.6 seconds. Along with sportier design outside and in, the RS Q8 Performance also gets a sportier, more evocative sounding exhaust. It is expected to arrive in the first quarter of this year, with an expected price of around Rs 2.50 crore (ex-showroom).\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eBentley Continental GT \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20240625070405_2 _33_.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eThe all-new \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/new-bentley-continental-gt-and-gtc-revealed-432016\"\u003eContinental GT\u003c/a\u003e\u003c/strong\u003e, in Speed guise, eschews the iconic W12 engine for a hybridised V8, which makes 782hp and 1,000Nm of torque. Power is channelled to all four wheels via an 8-speed automatic gearbox. Bentley claims a 0-100kph time of 3.2 seconds, a top speed of 335kph, and an all-electric range of 80km. The exterior is very Batur-inspired and while the interior layout is familiar, there’s more tech on offer. The launch is expected in the second quarter of this year, and prices are likely to be north of 6 crores (ex-showroom).\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eFerrari 12Cilindri \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/6 (5).jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eFerrari’s celebration of 12-cylinder engines in their purest form is the appropriately named \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-reviews/ferrari-12cilindri-review-the-ultimate-v12-433056\"\u003e12Cilindri\u003c/a\u003e\u003c/strong\u003e. The 6.5-litre V12 unit from the 812 now makes a staggering 830hp and 678Nm, with the Italian marque claiming a 0-100kph time of 2.9 seconds, and a top speed of over 340kph. The 12Cilindri is undeniably Ferrari’s best GT car, one that can thrill on both road and track while boasting a bold mix of cutting-edge tech and heritage design inspired by the likes of the 1968 Ferrari 365 GTB/4. While its interior is similar to that of the Purosangue, the GT features a 10.25-inch central infotainment touchscreen. Apart from the coupe, Ferrari also revealed the Spider, which gets a roof that can retract in just 14 seconds at speeds of up to 45kph. But whether both will come to India is still unknown. The launch is expected before mid-2025, and it will likely cost around Rs 7.5c crores (ex-showroom).\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eLamborghini Temerario \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20250103070600_20240817043735_5.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eThe Huracán’s successor is powered by an all-new hybrid V8 making a staggering 920hp and 800Nm of torque. The \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/new-lamborghini-temerario-succeeds-huracan-with-920hp-v8-phev-432582\"\u003eTemerario\u003c/a\u003e\u003c/strong\u003e, which has clear visual links to the Huracán and the Gallardo, sprints from 0-100kph in a claimed 2.7 seconds, and has a top speed in excess of 340kph. The interior also carries the hexagonal motifs seen outside, along with Lambo’s typical fighter jet-themed cockpit. It is, however, only arriving much later in the fourth quarter of 2025 with prices expected to around Rs 5 crores (ex-showroom).\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eLotus Emira \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/Lotus-Emira-review-rear-static.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eWhat may be the last ICE sportscar from Lotus, and a purists’ delight, will arrive in India with three powertrain options. The \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-reviews/lotus-emira-review-for-the-purist-433527\"\u003eEmira\u003c/a\u003e\u003c/strong\u003e will get an AMG-sourced 360hp four-cylinder turbo-petrol paired to an 8-speed dual-clutch auto, and a Toyota-sourced 400hp supercharged V6 that comes with either a 6-speed manual or an automatic. The launch is expected over the next couple of months, but with prices expected to exceed Rs 3 crores (ex-showroom), it will be quite expensive for what is only an entry-level sportscar.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eLotus Emeya \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20240702060153_10.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eLotus’ first performance sedan since the 1990 Carlton will arrive in India with a 102kWh battery that has up to 600km of range, and powers motors on each axle making a combined 918hp and 984Nm. The \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-reviews/lotus-emeya-review-going-the-distance-432097\"\u003eEmeya\u003c/a\u003e\u003c/strong\u003e has a Porsche Taycan Turbo S-matching 0-100kph time of 2.8 seconds, and its wow factor outside and inside, and performance and handling makes a compelling case for itself as an addition to a multi-crore garage. The launch is expected around December this year with prices expected to range between Rs 2.25 crore and Rs 3.0 crore (ex-showroom).\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMaserati GranCabrio \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20240229064959_2.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eThe GranTurismo’s drop-top sibling will come with a twin-turbo V6 engine that produces 550hp; all-wheel drive is standard. The heavier \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/maserati-grancabrio-convertible-revealed-with-550hp-v6-engine-430826\"\u003eGranCabrio\u003c/a\u003e\u003c/strong\u003e is slightly slower to 100kph (the coupe does it in 3.5 seconds), but its folding fabric top can be lowered or raised in 14 seconds, at speeds of up to 50kph. It will be more expensive than its coupe counterpart, likely touching the Rs 3 crores mark (ex-showroom), and the launch is expected by mid-2025.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMaserati GranTurismo Folgore \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20240416024259_Maserati_GranCabrio_Folgore_front.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eThe electric counterpart of the Maserati’s GT, called the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/maserati-grancabrio-folgore-revealed-as-761hp-convertible-ev-431276\"\u003eGranTurismo Folgore\u003c/a\u003e\u003c/strong\u003e, is coming this year with an 83kWh (usable) battery with a claimed range of 450km. It produces 761hp and 1,350Nm of troque, which propels the coupé from 0-100kph in just 2.7 seconds. The GT Folgore also sports a slightly tweaked, EV-specific design. The launch is expected in the second half of 2025 with prices expected to be around Rs 3.5 crores. (ex-showroom).\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMercedes-AMG CLE 53\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20241228124808_AMG_CLE_53.png\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eThe performance-focused CLE has a mild-hybrid twin-turbo straight-six making 449hp and up to 600Nm. Merc claims a 0-100kph time of 4.4 seconds, which can be lowered to 4.2 seconds with the AMG performance package. Mercedes also sells the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/mercedes-amg-cle-53-india-launch-in-second-half-of-2025-433962\"\u003eCLE 53 AMG\u003c/a\u003e\u003c/strong\u003e convertible in international markets, but it is yet to be ascertained which one is headed to India. As for pricing, we expect the AMG CLE 53 coupe to have a price tag of around Rs 2 crore, and the launch is expected by late-2025.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMG Cyberster \u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20250103071246_20241223055628_MG Cyberster front.png\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eMG will dial up the cool quotient with the all-electric \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/mg-cyberster-india-spec-details-revealed-433931\"\u003eCyberster\u003c/a\u003e\u003c/strong\u003e that goes on sale this January at the Bharat Mobility Show. The Cyberster is based on a born-electric platform, and in India, it will be offered with a 77kWh battery pack, paired with two electric motors on each axle, simulating an AWD setup. This powertrain produces 510hp and 725Nm of peak torque, with a claimed 0-100kph sprint time of 3.2 seconds. MG claims a maximum range of 580km on a single charge (CLTC cycle). The convertible all-electric sports car will come to India as an import but pricing will be competitive.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso See:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/all-new-mass-market-evs-launching-in-2025-433998\"\u003e\u003cstrong\u003eAll new mass-market EVs launching in 2025\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/new-car-and-suv-launches-in-january-2025-433995\"\u003e\u003cstrong\u003eNew car and SUV launches lined up in January 2025\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-434043\"\u003e\u003cul id=\"tab-id-434043\"\u003e\u003cli\u003e\u003ca id=\"tab-imghref-id-434043\" href=\"#.\" rel=\"#tab-images-container-434043\"\u003eImages\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-434043\" href=\"#.\" rel=\"#tab-videos-container-434043\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-01-04T08:00:00+05:30",
  "modifiedTime": null
}
