{
  "id": "7c54bd72-2f53-40ce-bbc6-28f8b051decd",
  "title": "Official: Toyota to build GR Corolla in UK",
  "link": "https://www.autocar.co.uk/car-news/new-cars/official-toyota-build-gr-corolla-uk",
  "description": "Massive demand from the US will boost the Burnaston plant's output Toyota will build the GR Corolla hot hatch in the UK from next year in a bid to cater to increasing demand. Confirming this week's report from Reuters, the Japanese manufacturer said it had chosen the Corolla plant in Burnaston, Derbyshire, to boost GR Corolla production and preparations had been under way since last year. The hot Corolla will be the first GR model to be built outside Japan. Toyota said Burnaston – Toyota Manufacturing UK – was a natural fit because of the capability of the factory and its staff. It also pointed to the \"deep motorsport culture\" in the UK aligning with its GR (Gazoo Racing) sub-brand. The business case was almost certainly swayed by the fact that Burnaston also has a large and ready supply of Corolla bodies and ancillaries. Toyota added that the decision comes as part of a wider production overhaul aimed at accelerating production and customer delivery times. Indeed, GR Corolla buyers in the US have typically faced long waiting lists and dealer-added cost mark-ups since the car's launch in 2022, owing to strong demand for the model. Production and investment levels will be announced by the firm at a later date, but Reuters previously said it would cost £41 million to add the new line at Burnaston and that would give a capacity of 10,000 cars annually. Reuters added that Toyota’s Motomachi plant in Japan – the so-called GR Factory, responsible for output of the GR Corolla, GR Yaris and GR86 – is currently at full capacity. It assembled 25,000 GR cars last year, of which around a third were Corollas. As well as boosting overall output of GR Corollas, the addition of UK production will surely give Toyota additional flexibility to build other models at Motomachi. It could ramp up GR Yaris production, for example, or add entirely new models at the factory. As previously reported by Autocar, Toyota-owned Lexus is priming a new flagship sports car that is expected to compete in GT3 racing series from next year. It is most likely that Motomachi would host assembly of this model, given it previously housed its predecessor, the LFA supercar. The GR division has also been working on an all-new Celica coupé and is thought to be considering replacements for the MR2 (discontinued in 2007) and Supra, plus a Mazda MX-5 rival. Although the plan to boost GR Corolla production through the UK has not been informed by US president Donald Trump’s tariffs, given it pre-dates Trump's presidency, the decision to export from the UK surely benefits the company on that front. The US currently charges a tariff of 25% on all cars imported to the country from abroad, including Japan. However, the UK recently agreed to negotiate a deal that will cut the fee for its exports to 10%, within a national quota of 100,000 cars. Final details have yet to be confirmed but at present Toyota would have to pay a smaller fee on UK-built GR Corollas than on those from Japan. The prospect of adding production in the UK also lends weight to the possibility that the GR Corolla – currently offered in only a handful of markets, including the US and Japan – could be set for a launch in Europe. Prototypes were last year spotted testing at Germany's Nürburgring, hinting at a launch. A spokesperson suggested it was standard procedure to test global products at the circuit but did not deny the prospect. Toyota currently sells the GR Yaris and the GR Supra in Europe, the GR86 having been killed off in that market (including the UK) by the European Union’s GSR2 safety regulations. The Supra is soon to follow. Regardless, the plan to produce GR Corollas in the UK will come as welcome news to staff at the Burnaston plant, which last year built its five millionth car since opening in 1992. In a statement, Yoshihiro Nakata, president and CEO of Toyota Motor Europe, said: “We are proud that TMUK, our first plant in Europe, has also been selected as the first overseas Toyota plant to produce GR vehicles, securing this expansion project for TGR worldwide. We very much appreciate the historical support and recognition of the United Kingdom and would like to continue to contribute to UK society as a ‘Best in Town’ company.”",
  "author": "",
  "published": "Fri, 30 May 2025 08:50:59 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Charlie Martin",
  "length": 1526,
  "excerpt": "Massive demand from the US could boost the Burnaston plant's output, according to Reuters",
  "siteName": "Autocar",
  "favicon": "",
  "text": "As previously reported by Autocar, Toyota-owned Lexus is priming a new flagship sports car that is expected to compete in GT3 racing series from next year. It is most likely that Motomachi would host assembly of this model, given it previously housed its predecessor, the LFA supercar. The GR division has also been working on an all-new Celica coupé and is thought to be considering replacements for the MR2 (discontinued in 2007) and Supra, plus a Mazda MX-5 rival. Although the plan to boost GR Corolla production through the UK has not been informed by US president Donald Trump’s tariffs, given it pre-dates Trump's presidency, the decision to export from the UK surely benefits the company on that front. The US currently charges a tariff of 25% on all cars imported to the country from abroad, including Japan. However, the UK recently agreed to negotiate a deal that will cut the fee for its exports to 10%, within a national quota of 100,000 cars. Final details have yet to be confirmed but at present Toyota would have to pay a smaller fee on UK-built GR Corollas than on those from Japan. The prospect of adding production in the UK also lends weight to the possibility that the GR Corolla – currently offered in only a handful of markets, including the US and Japan – could be set for a launch in Europe. Prototypes were last year spotted testing at Germany's Nürburgring, hinting at a launch. A spokesperson suggested it was standard procedure to test global products at the circuit but did not deny the prospect.",
  "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/toyota-gr-corolla-front-quarter-tracking_0.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n\u003cp\u003eAs previously reported by Autocar, Toyota-owned Lexus is priming a \u003ca href=\"https://www.autocar.co.uk/car-news/new-cars/lexus-launch-vantage-rivalling-v8-supercar-600bhp\"\u003enew flagship sports car\u003c/a\u003e that is expected to compete in GT3 racing series from next year. It is most likely that Motomachi would host assembly of this model, given it previously housed its predecessor, the \u003ca href=\"https://www.autocar.co.uk/car-review/lexus/lfa-2010-2012\"\u003eLFA supercar\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe GR division has also been working on an all-new Celica coupé and is thought to be considering \u003ca href=\"https://www.autocar.co.uk/car-news/new-cars/toyota-preparing-new-mr2-celica-and-lexus-supercar\"\u003ereplacements for the MR2\u003c/a\u003e (discontinued in 2007) and Supra, plus a \u003ca href=\"https://www.autocar.co.uk/car-news/new-cars/toyota-mr2-primed-revival-combustion-only-mazda-mx-5-rival\"\u003eMazda MX-5 rival\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAlthough the plan to boost GR Corolla production through the UK has not been informed by US president \u003ca href=\"https://www.autocar.co.uk/car-news/business-car-sales/us-tariffs-25-all-foreign-made-cars-will-go-ahead-despite-talks\"\u003eDonald Trump’s tariffs\u003c/a\u003e, given it pre-dates Trump\u0026#39;s presidency, the decision to export from the UK surely benefits the company on that front.\u003c/p\u003e\n\u003cp\u003eThe US currently charges a tariff of 25% on all cars imported to the country from abroad, including Japan. However, the UK recently agreed to negotiate a deal that will \u003ca href=\"https://www.autocar.co.uk/car-news/business-government-and-legislation/trump-slashes-import-tariff-uk-made-vehicles-10\"\u003ecut the fee\u003c/a\u003e for its exports to 10%, within a national quota of 100,000 cars. Final details have yet to be confirmed but at present Toyota would have to pay a smaller fee on UK-built GR Corollas than on those from Japan.\u003c/p\u003e\n\u003cp\u003eThe prospect of adding production in the UK also lends weight to the possibility that the GR Corolla – currently offered in only a handful of markets, including the US and Japan – could be set for a launch in Europe.\u003c/p\u003e\n\u003cp\u003ePrototypes were last year spotted testing at Germany\u0026#39;s Nürburgring, hinting at a launch. A spokesperson suggested it was standard procedure to test global products at the circuit but did not deny the prospect.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"Toyota GR Corolla prototype driving at the Nurburgring\" data-src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/gr_corolla_driving_front.jpg?itok=bhCUl_XR\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/gr_corolla_driving_front.jpg?itok=bhCUl_XR\"/\u003e\u003c/p\u003e            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-05-27T10:38:25Z",
  "modifiedTime": null
}
