{
  "id": "91d41269-8e6e-4827-8500-179241d6ef7e",
  "title": "New Royal Enfield Himalayan long-term review, 5,200km report",
  "link": "https://www.autocarindia.com/bike-long-termer/new-royal-enfield-himalayan-long-term-review-5200km-report-434138#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
  "description": "It has been a few months since you last read a Himalayan report, and I must take some of the blame. Between a prolonged period of illness and some intense travel, the bike hasn’t received the attention it should have. On top of this, it ended up being with RE for a couple of months when I sent it in to address some issues, and I didn’t push for it to be returned sooner. TFT is easy to read and legible even under harsh sunlight. The first of those issues was that the usually fiddly toggle switch for the display stopped working entirely and had to be replaced. I also wanted the company to permanently address the problem with the bike pulling to the right when the handlebar was released – something I’ve written about in the previous report. As I understand it, the second issue had something to do with rectifying various torque settings on bolts that connect the engine to the frame. The bike returned with working switchgear and the right-leaning problem almost entirely sorted out – it’s still marginally noticeable but no longer to a troubling extent. Switching modes on the Himalayan can be a task, given how often it’s denied. As soon as the Himalayan was back, I realised why I enjoyed it so much in the first place. Its big size, incredible suspension, and fantastic overall comfort are a class apart. But since this bike deserved some good running after such a long downtime, I gave it to Gavin for his ride down to IBW, and what you’ll read from hereon is his account. Our Himalayan is equipped with the optional touring seat, which was a boon on my nearly 1,200km ride to Goa and back. It was firm yet supportive and kept saddle soreness at bay for the majority of my journey. Thanks to its abundant mounting points, strapping a tail bag on is a piece of cake. A little more wind protection would have been nice, though. The carrier and grab rail make for perfect mounting points for all your luggage. My issues with the Himalayan are mostly nothing new. Despite being replaced, the switchgear is sometimes unresponsive. While this motor performs well, the high-speed vibrations can render your palms numb on long rides. The one quality issue is that the right mirror keeps coming loose, and its threads have now been damaged, meaning a new one will have to be purchased. Finally, the headlight offers adequate illumination, but most owners are better off getting auxiliary lights. The right mirror keeps coming loose, and the threading is now damaged.   Despite these shortcomings, the Himalayan is an excellent motorcycle with a handful of minor gripes. While I was fortunate not to have any punctures, the fear of one always looms over me. Thankfully, we will soon be getting a set of tubeless wheels installed. Before we end, our bike has developed the typical Himalayan loose steering cone set, and that’s something we’ll address in the next report. With inputs from GAVIN RODRIGUES Also See: New Royal Enfield Himalayan long-term review, 1,900km report New Royal Enfield Himalayan long-term review, 1,000km report",
  "author": "Rishaad Mody",
  "published": "Mon, 20 Jan 2025 07:00:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
  "categories": null,
  "byline": "Rishaad  Mody",
  "length": 3119,
  "excerpt": "The Himalayan is nearly the perfect tourer, making almost every journey a comfortable one.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "The Himalayan is nearly the perfect tourer, making almost every journey a comfortable one.It has been a few months since you last read a Himalayan report, and I must take some of the blame. Between a prolonged period of illness and some intense travel, the bike hasn’t received the attention it should have. On top of this, it ended up being with RE for a couple of months when I sent it in to address some issues, and I didn’t push for it to be returned sooner.TFT is easy to read and legible even under harsh sunlight.The first of those issues was that the usually fiddly toggle switch for the display stopped working entirely and had to be replaced. I also wanted the company to permanently address the problem with the bike pulling to the right when the handlebar was released – something I’ve written about in the previous report. As I understand it, the second issue had something to do with rectifying various torque settings on bolts that connect the engine to the frame. The bike returned with working switchgear and the right-leaning problem almost entirely sorted out – it’s still marginally noticeable but no longer to a troubling extent.Switching modes on the Himalayan can be a task, given how often it’s denied.As soon as the Himalayan was back, I realised why I enjoyed it so much in the first place. Its big size, incredible suspension, and fantastic overall comfort are a class apart. But since this bike deserved some good running after such a long downtime, I gave it to Gavin for his ride down to IBW, and what you’ll read from hereon is his account.Our Himalayan is equipped with the optional touring seat, which was a boon on my nearly 1,200km ride to Goa and back. It was firm yet supportive and kept saddle soreness at bay for the majority of my journey. Thanks to its abundant mounting points, strapping a tail bag on is a piece of cake. A little more wind protection would have been nice, though.The carrier and grab rail make for perfect mounting points for all your luggage.My issues with the Himalayan are mostly nothing new. Despite being replaced, the switchgear is sometimes unresponsive. While this motor performs well, the high-speed vibrations can render your palms numb on long rides. The one quality issue is that the right mirror keeps coming loose, and its threads have now been damaged, meaning a new one will have to be purchased. Finally, the headlight offers adequate illumination, but most owners are better off getting auxiliary lights.The right mirror keeps coming loose, and the threading is now damaged.Despite these shortcomings, the Himalayan is an excellent motorcycle with a handful of minor gripes. While I was fortunate not to have any punctures, the fear of one always looms over me. Thankfully, we will soon be getting a set of tubeless wheels installed. Before we end, our bike has developed the typical Himalayan loose steering cone set, and that’s something we’ll address in the next report.With inputs from GAVIN RODRIGUESAlso See: New Royal Enfield Himalayan long-term review, 1,900km reportNew Royal Enfield Himalayan long-term review, 1,000km reportVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20250113035057_H1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eThe Himalayan is nearly the perfect tourer, making almost every journey a comfortable one.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eIt has been a few months since you last read a Himalayan report, and I must take some of the blame. Between a prolonged period of illness and some intense travel, the bike hasn’t received the attention it should have. On top of this, it ended up being with RE for a couple of months when I sent it in to address some issues, and I didn’t push for it to be returned sooner.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/20250113035223_H4.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eTFT is easy to read and legible even under harsh sunlight.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe first of those issues was that the usually fiddly toggle switch for the display stopped working entirely and had to be replaced. I also wanted the company to permanently address the problem with the bike pulling to the right when the handlebar was released – something I’ve written about in the previous report. As I understand it, the second issue had something to do with rectifying various torque settings on bolts that connect the engine to the frame. The bike returned with working switchgear and the right-leaning problem almost entirely sorted out – it’s still marginally noticeable but no longer to a troubling extent.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/20250113035327_H2.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eSwitching modes on the Himalayan can be a task, given how often it’s denied.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAs soon as the Himalayan was back, I realised why I enjoyed it so much in the first place. Its big size, incredible suspension, and fantastic overall comfort are a class apart. But since this bike deserved some good running after such a long downtime, I gave it to Gavin for his ride down to IBW, and what you’ll read from hereon is his account.\u003c/p\u003e\u003cp\u003eOur Himalayan is equipped with the optional touring seat, which was a boon on my nearly 1,200km ride to Goa and back. It was firm yet supportive and kept saddle soreness at bay for the majority of my journey. Thanks to its abundant mounting points, strapping a tail bag on is a piece of cake. A little more wind protection would have been nice, though.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/20250113035149_H5.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe carrier and grab rail make for perfect mounting points for all your luggage.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eMy issues with the Himalayan are mostly nothing new. Despite being replaced, the switchgear is sometimes unresponsive. While this motor performs well, the high-speed vibrations can render your palms numb on long rides. The one quality issue is that the right mirror keeps coming loose, and its threads have now been damaged, meaning a new one will have to be purchased. Finally, the headlight offers adequate illumination, but most owners are better off getting auxiliary lights.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/Reviews/20250113035250_H3.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe right mirror keeps coming loose, and the threading is now damaged.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eDespite these shortcomings, the Himalayan is an excellent motorcycle with a handful of minor gripes. While I was fortunate not to have any punctures, the fear of one always looms over me. Thankfully, we will soon be getting a set of tubeless wheels installed. Before we end, our bike has developed the typical Himalayan loose steering cone set, and that’s something we’ll address in the next report.\u003c/p\u003e\u003cp\u003eWith inputs from \u003cstrong\u003eGAVIN RODRIGUES\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso See: \u003ca href=\"https://www.autocarindia.com/bike-long-termer/new-royal-enfield-himalayan-long-term-review-1900km-report-431467\"\u003eNew Royal Enfield Himalayan long-term review, 1,900km report\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/bike-long-termer/new-royal-enfield-himalayan-long-term-review-1000km-report-430621\"\u003eNew Royal Enfield Himalayan long-term review, 1,000km report\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-434138\"\u003e\u003cul id=\"tab-id-434138\"\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-434138\" href=\"#.\" rel=\"#tab-videos-container-434138\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-20T07:00:00+05:30",
  "modifiedTime": null
}
