{
  "id": "97545e3b-7fcf-4efc-bfa6-135b3c3d7e69",
  "title": "Want Better MPG? This Is When You Should Be Shifting Gears",
  "link": "https://www.jalopnik.com/1864672/when-to-shift-gears-manual-transmission-best-mpg/",
  "description": "If you're driving a manual-transmission car, you may be wondering when to shift gears to get the best mileage. There's a simple trick for doing just that.",
  "author": "Jordan A. Rodriguez",
  "published": "Mon, 26 May 2025 00:25:00 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "Jalopnik Explains"
  ],
  "byline": "Jordan A. Rodriguez",
  "length": 3254,
  "excerpt": "If you're driving a manual-transmission car, you may be wondering when to shift gears to get the best mileage. There's a simple trick for doing just that.",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "Lordhenrivoton/Getty Images Unlike an automatic transmission that switches gears depending on the vehicle's speed, a manual transmission requires the driver to make the change with the stick shift. For drivers new to manual transmission, shifting to different gears can be a difficult skill to learn. It can even lead to decreased performance and fuel economy if done incorrectly.  It's not just the speed, either. The current rpm is also a signal for when to change gears. A car's rpm, or revolutions per minute, refers to how quickly the engine is spinning. We all have a tachometer in our cars that displays the rpm, and for those new to manual transmission, this is a good meter to keep your eye on. Otherwise, you may find yourself driving at too low a gear when going fast, or vice-versa. This can lead to losing some of the miles per gallon your car should be able to deliver. That's important because while U.S. News \u0026 World Report says manual transmissions are slowly being phased out in favor of automatics with improved fuel economy, the sales numbers say otherwise. In 2024, manual transmission vehicles sold well, with many automakers claiming a large percentage of their consumer base chose manual transmission. So it doesn't seem like they're going anywhere anytime soon. In fact, for the 2025 model year, there are plenty of cars with manual transmission consumers can choose from. The gear you drive in affects fuel economy AmpYang Images/Shutterstock Saving fuel in a manual-transmission car may sound simple — just drive slower, right? But a lot of it has to do with which gear you're driving in. Each gear works within a range of speeds. While you press on the gas pedal, the engine revolves continuously. The more it rotates, the higher the \"revolutions per minute,\" or rpm, displayed on the tachometer. When that meter hits 2,500-3,000 rpm, it's time to shift into a higher gear. Failure to switch into the appropriate gear puts more pressure on the engine, hence the high rpm, leading to decreased performance and fuel economy. The vehicle's engine load also affects fuel consumption — it's the pressure you're putting on the engine via such things as acceleration, speed, air conditioning, engine friction, and increased alternator activity. Driving more slowly leads to a lighter load and the air-intake opening becoming tighter, making it harder for air to travel through the throttle. In contrast, a higher load opens the throttle up wider. Maintain a low rpm, keep the vehicle at a cruising speed of 45 mph or more, and you can get more mpg with a manual transmission. Typically, the highest gear you can drive in while cruising can improve your fuel efficiency. But don't shift too early – aim for acceleration with an rpm over 1,500 to avoid negative impact on your fuel economy.",
  "image": "https://www.jalopnik.com/img/gallery/want-better-mpg-this-is-when-you-should-be-shifting-gears/l-intro-1747752702.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1864672/when-to-shift-gears-manual-transmission-best-mpg/\" data-post-title=\"Want Better MPG? This Is When You Should Be Shifting Gears\" data-slide-num=\"0\" data-post-id=\"1864672\"\u003e\n                                             \u003cpicture id=\"pace38711bdc2305d65d897fedc99d608\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/want-better-mpg-this-is-when-you-should-be-shifting-gears/intro-1747752702.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/want-better-mpg-this-is-when-you-should-be-shifting-gears/intro-1747752702.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/want-better-mpg-this-is-when-you-should-be-shifting-gears/intro-1747752702.jpg\" data-slide-url=\"https://www.jalopnik.com/1864672/when-to-shift-gears-manual-transmission-best-mpg/\" data-post-id=\"1864672\" data-slide-num=\"0\" data-slide-title=\"Want Better MPG? This Is When You Should Be Shifting Gears: \" width=\"780\" height=\"438\" alt=\"Close-up of someone hand-shifting with manual transmission.\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eLordhenrivoton/Getty Images\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp\u003eUnlike an automatic transmission that switches gears depending on the vehicle\u0026#39;s speed, a manual transmission requires the driver to make the change with the stick shift. For drivers new to manual transmission, shifting to different gears can be a difficult skill to learn. It can even lead to decreased performance and fuel economy if done incorrectly. \u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s not just the speed, either. The current rpm is also a signal for when to change gears. A car\u0026#39;s rpm, or revolutions per minute, refers to how quickly the engine is spinning. We all have a tachometer in our cars that displays the rpm, and for those new to manual transmission, this is a good meter to keep your eye on. Otherwise, you may find yourself driving at too low a gear when going fast, or vice-versa. This can lead to losing some of the miles per gallon your car should be able to deliver.\u003c/p\u003e\n\u003cp\u003eThat\u0026#39;s important because while \u003ca href=\"https://cars.usnews.com/cars-trucks/advice/best-cars-blog/2016/09/why-are-manual-transmissions-disappearing\" target=\"_blank\"\u003eU.S. News \u0026amp; World Report\u003c/a\u003e says manual transmissions are slowly being phased out in favor of automatics with improved fuel economy, the sales numbers say otherwise. \u003ca href=\"https://www.jalopnik.com/heres-how-well-manual-transmissions-sold-in-2024-1851740380/\" target=\"_blank\"\u003eIn 2024, manual transmission vehicles sold well\u003c/a\u003e, with many automakers claiming a large percentage of their consumer base chose manual transmission. So it doesn\u0026#39;t seem like they\u0026#39;re going anywhere anytime soon. In fact, for the \u003ca href=\"https://www.jalopnik.com/every-car-you-can-get-with-a-manual-1851735234/\" target=\"_blank\"\u003e2025 model year, there are plenty of cars with manual transmission\u003c/a\u003e consumers can choose from.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eThe gear you drive in affects fuel economy\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1864672/when-to-shift-gears-manual-transmission-best-mpg/\" data-post-title=\"Want Better MPG? This Is When You Should Be Shifting Gears\" data-slide-num=\"1\" data-post-id=\"1864672\"\u003e\n                                             \u003cpicture id=\"p1cd5cba414e02af9898bade08b903a27\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/want-better-mpg-this-is-when-you-should-be-shifting-gears/the-gear-you-drive-in-affects-fuel-economy-1747752702.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/want-better-mpg-this-is-when-you-should-be-shifting-gears/the-gear-you-drive-in-affects-fuel-economy-1747752702.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/want-better-mpg-this-is-when-you-should-be-shifting-gears/the-gear-you-drive-in-affects-fuel-economy-1747752702.jpg\" data-slide-url=\"https://www.jalopnik.com/1864672/when-to-shift-gears-manual-transmission-best-mpg/\" data-post-id=\"1864672\" data-slide-num=\"1\" data-slide-title=\"Want Better MPG? This Is When You Should Be Shifting Gears: The gear you drive in affects fuel economy\" width=\"780\" height=\"438\" alt=\"Average fuel economy displayed on car dashboard.\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eAmpYang Images/Shutterstock\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eSaving fuel in a manual-transmission car may sound simple — just drive slower, right? But a lot of it has to do with which gear you\u0026#39;re driving in. Each gear works within a range of speeds. While you press on the gas pedal, the engine revolves continuously. The more it rotates, the higher the \u0026#34;revolutions per minute,\u0026#34; or rpm, displayed on the tachometer. When that meter hits 2,500-3,000 rpm, it\u0026#39;s time to shift into a higher gear. Failure to switch into the appropriate gear puts more pressure on the engine, hence the high rpm, leading to decreased performance and fuel economy.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThe vehicle\u0026#39;s engine load also affects fuel consumption — it\u0026#39;s the pressure you\u0026#39;re putting on the engine via such things as acceleration, speed, air conditioning, engine friction, and increased alternator activity. Driving more slowly leads to a lighter load and the air-intake opening becoming tighter, making it harder for air to travel through the throttle. In contrast, a higher load opens the throttle up wider. Maintain a low rpm, keep the vehicle at a cruising speed of 45 mph or more, and you can get more mpg with a manual transmission.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eTypically, the highest gear you can drive in while cruising can improve your fuel efficiency. But don\u0026#39;t shift too early – aim for acceleration with an rpm over 1,500 to avoid negative impact on your fuel economy.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-26T00:25:00Z",
  "modifiedTime": "2025-05-26T00:25:00Z"
}
