{
  "id": "98f7c630-d33d-4a20-b6ce-69efb66e9bcc",
  "title": "Trump's New Auto Tariffs Could Add $1,700+ to Your Next Car",
  "link": "https://www.autoblog.com/news/car-prices-rise-tariffs-impact",
  "description": "If you’ve been saving your pennies, hoping to scrimp together enough money to afford the new vehicle you’ve been wanting, you may need to dig deeper into the couch cushions. Its price is likely to go up by nearly $2,000 – and possibly a good bit more thanks to Pres. Donald Trump’s new tariffs on ...",
  "author": "Paul Eisenstein",
  "published": "Fri, 20 Jun 2025 22:05:00 GMT",
  "source": "https://www.autoblog.com/rss.xml",
  "categories": [
    "Car Buying",
    "Electric",
    "News",
    "Luxury"
  ],
  "byline": "Paul Eisenstein",
  "length": 5009,
  "excerpt": "A new study finds U.S. car prices are set to spike under Trump’s auto tariffs, with entry-level models disappearing and EVs hit hardest. See what’s at risk.",
  "siteName": "Autoblog",
  "favicon": "https://www.autoblog.com/.image/c_fill,g_faces:center/NzowMDAwMDAwMDAwODc4Nzc5/cropped-autoblog-favicon.png",
  "text": "Jun 20, 2025 6:05 PM EDTAutomakers Expected to Pass Tariff Costs to Consumers If you’ve been saving your pennies, hoping to scrimp together enough money to afford the new vehicle you’ve been wanting, you may need to dig deeper into the couch cushions. Its price is likely to go up by nearly $2,000 – and possibly a good bit more thanks to Pres. Donald Trump’s new tariffs on imported autos and auto parts. All told, automakers will take a $30 billion hit this year due to the new trade sanctions and while manufacturers will swallow some of the tab, predicts a new study, they’ll pass 80% of the cost onto consumers. Don’t be surprised to see some products disappear from the market entirely, said suburban Detroit consultancy AlixPartners, especially some of the import models likely to be hit hardest by the new tariffs. “A Big Wall of Cost” “These tariffs bring a big wall of cost,” Mark Wakefield, the head of AlixPartners’ auto practice said during an online briefing with reporters, with “consumers taking the majority of the hit.” If there’s any shred of a silver lining to the 2025 AlixPartners Global Automotive Outlook it’s that we could see the White House continue to revise its tariffs on import autos and auto parts, even as it works up trade deals that. The consultancy anticipates this will eventually lower the sanctions from 25% to an average closer to 7.5%. Even Domestic Models Will be Impacted The White House has rolled out an assortment of new tariffs and has yet to fully lock down the rules, David Steinert, a partner in the AlixPartners auto practice, said during a follow-up interview with Autoblog. “The tariffs have changed a lot over the last 60 days,” and will likely continue to be revised in the months ahead. As a result, it’s difficult to come up with hard numbers – but the consultancy’s “best guess,” he added, is that the typical vehicle will cost at least $1,760 more than before the tariffs went into effect. And for foreign-made luxury models that could ran into the tens of thousands. “Vehicles that are produced in the US today are the most advantaged,” Steinert said, “but even domestically-sourced vehicles bring in lots of (foreign-made) parts” that are now subject to tariffs. And the duties will be especially high if those parts come in from China. Entry-Level Cars May Vanish as Costs Rise Automakers are expected to pass on about 80% of their tariff costs – though they won’t do it uniformly, the AlixPartners study anticipates. “Entry-level and mainstream cars will have less of a pass-through” than luxury and exotic models, explained Steinert. Automakers want to avoid driving budget buyers out of the new vehicle market. On the other hand, with “higher-end brands, with customers who are less price-sensitive, more of the tariffs (will be) passed through.” In some cases, manufacturers may not find it worthwhile to absorb tariff costs. Nissan has already decided to dump the Versa, what is today the most affordable product line in the U.S., at the end of this year, according to Automotive News. Even some higher-end models could be dropped, said Steinert, if manufacturers find higher prices dry up sales. Luxury and Imported EVs Face Steepest Increases Battery-electric vehicles are seen as especially vulnerable, warned AlixPartners. A number of today’s models, such as the Audi Q5 e-tron and Mercedes EQE sedan, are imported and face hefty tariffs. Even domestically assembled models, like the Tesla Model Y, typically rely on batteries either shipped in from China or built domestically using Chinese raw materials. Complicating matters: the federal budget bill backed by the Trump administration and now working its way through Congress. It is expected to eliminate federal tax credits of up to $7,500. And, said Wakefield, buyers are likely to “follow their pocketbook” and stick to more affordable vehicles with internal combustion engines. In its 2023 Global Automotive Outlook, AlixPartners forecast EVs would account for 31% of the U.S. market. It now anticipates a figure closer to 17%. New Car Sales Likely to Decline Through 2027 Conventional wisdom suggests the new tariffs will result in declining new vehicle sales. The real question is how much of a slump might they trigger. Last month, Cox Automotive forecast demand could drop to as low as 15 million, about 1 million below the 2024 total. And the study warned that could dip into the low 14 million range in the event of a recession. For his part, AlixPartner’s Wakefield is more upbeat. He thinks the U.S. market will decline by about 1 million – but over a three-year period – and then begin to bounce back. But there’s a caveat. This would require the Trump administration to deliver on its promise to negotiate new trade agreements with key partners. So far, however, it’s struggling to follow through, with only one big deal in place with the United Kingdom. About the AuthorPaul Eisenstein",
  "image": "https://www.autoblog.com/.image/w_1200,h_630,g_faces,c_fill/NzowMDAwMDAwMDAwODgzNzEw/audi-q5-c.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003ctime datetime=\"2025-06-20T22:05:00.000Z\"\u003eJun 20, 2025 6:05 PM EDT\u003c/time\u003e\u003c/p\u003e\u003ch2 id=\"automakers-expected-to-pass-tariff-costs-to-consumers\"\u003eAutomakers Expected to Pass Tariff Costs to Consumers\u003c/h2\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eIf you’ve been saving your pennies, hoping to scrimp together enough money to afford the new vehicle you’ve been wanting, you may need to dig deeper into the couch cushions. Its price is likely to go up by nearly $2,000 – and possibly a good bit more thanks to Pres. \u003ca href=\"https://www.autoblog.com/news/trump-likely-keeping-european-tariffs\"\u003eDonald Trump’s new tariffs \u003c/a\u003eon imported autos and auto parts.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eAll told, automakers will take a $30 billion hit this year due to the new trade sanctions and while manufacturers will swallow some of the tab, predicts a new study, they’ll pass 80% of the cost onto consumers.\u003c/p\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eDon’t be surprised to see some products disappear from the market entirely, said suburban Detroit consultancy AlixPartners, especially some of the import models likely to be hit hardest by the new tariffs.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch2 id=\"a-big-wall-of-cost\"\u003e“A Big Wall of Cost”\u003c/h2\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003e“These tariffs bring a big wall of cost,” Mark Wakefield, the head of AlixPartners’ auto practice said during an online briefing with reporters, with “consumers taking the majority of the hit.”\u003c/p\u003e\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eIf there’s any shred of a silver lining to the 2025 AlixPartners Global Automotive Outlook it’s that we could see the White House continue to revise its tariffs on import autos and auto parts, even as it works up trade deals that. The consultancy anticipates this will eventually lower the sanctions from 25% to an average closer to 7.5%.\u003c/p\u003e\n\n\n\n\n\n\u003ch2 id=\"even-domestic-models-will-be-impacted\"\u003eEven Domestic Models Will be Impacted\u003c/h2\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eThe White House has rolled out an assortment of new tariffs and has yet to fully lock down the rules, David Steinert, a partner in the AlixPartners auto practice, said during a follow-up interview with \u003cem\u003eAutoblog\u003c/em\u003e. “The tariffs have changed a lot over the last 60 days,” and will likely continue to be revised in the months ahead.\u003c/p\u003e\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eAs a result, it’s difficult to come up with hard numbers – but the consultancy’s “best guess,” he added, is that the typical vehicle will cost at least $1,760 more than before the tariffs went into effect. And for foreign-made luxury models that could ran into the tens of thousands.\u003c/p\u003e\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003e“Vehicles that are produced in the US today are the most advantaged,” Steinert said, “but even domestically-sourced vehicles bring in lots of (foreign-made) parts” that are now subject to tariffs. And the duties will be especially high if those \u003ca href=\"https://www.autoblog.com/news/ev-discounts-in-china-reach-record-high-with-profits-limited-to-3-automakers\"\u003eparts come in from China\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\n\n\u003ch2 id=\"entry-level-cars-may-vanish-as-costs-rise\"\u003eEntry-Level Cars May Vanish as Costs Rise\u003c/h2\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eAutomakers are expected to pass on about 80% of their tariff costs – though they won’t do it uniformly, the AlixPartners study anticipates.\u003c/p\u003e\n\n\n\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003e“Entry-level and mainstream cars will have less of a pass-through” than luxury and exotic models, explained Steinert. Automakers want to avoid driving budget buyers out of the new vehicle market. On the other hand, with “higher-end brands, with customers who are less price-sensitive, more of the tariffs (will be) passed through.”\u003c/p\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eIn some cases, manufacturers may not find it worthwhile to absorb tariff costs. \u003ca href=\"https://www.autoblog.com/nissan/\" rel=\"noopener nofollow\" target=\"_blank\"\u003eNissan\u003c/a\u003e has already decided to dump the Versa, what is today the most affordable product line in the U.S., at the end of this year, according to Automotive News. Even some higher-end models could be dropped, said Steinert, if manufacturers find higher prices dry up sales.\u003c/p\u003e\n\n\n\n\n\u003ch2 id=\"luxury-and-imported-evs-face-steepest-increases\"\u003eLuxury and Imported EVs Face Steepest Increases\u003c/h2\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eBattery-electric vehicles are seen as especially vulnerable, warned AlixPartners.\u003c/p\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eA number of today’s models, such as the \u003ca href=\"https://www.autoblog.com/audi/\" rel=\"noopener nofollow\" target=\"_blank\"\u003eAudi\u003c/a\u003e Q5 e-tron and Mercedes EQE sedan, are imported and face hefty tariffs. Even domestically assembled models, like the \u003ca href=\"https://www.autoblog.com/tesla/\" rel=\"noopener nofollow\" target=\"_blank\"\u003eTesla\u003c/a\u003e Model Y, typically rely on batteries either shipped in from China or built domestically using Chinese raw materials.\u003c/p\u003e\n\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eComplicating matters: the federal budget bill backed by the Trump administration and now working its way through Congress. It is expected to eliminate federal tax credits of up to $7,500. And, said Wakefield, buyers are likely to “follow their pocketbook” and stick to more affordable vehicles with internal combustion engines.\u003c/p\u003e\n\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eIn its 2023 Global Automotive Outlook, AlixPartners forecast EVs would account for 31% of the U.S. market. It now anticipates a figure closer to 17%.\u003c/p\u003e\n\n\n\n\n\u003cfigure\u003e\u003cimg alt=\"Mercedes-Benz EQE 350\" loading=\"lazy\" width=\"1600\" height=\"900\" decoding=\"async\" data-nimg=\"1\" sizes=\"(min-width: 750px) 750px, calc(100vw - 60px)\" srcset=\"https://www.autoblog.com/.image/w_16,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 16w, https://www.autoblog.com/.image/w_32,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 32w, https://www.autoblog.com/.image/w_48,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 48w, https://www.autoblog.com/.image/w_64,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 64w, https://www.autoblog.com/.image/w_96,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 96w, https://www.autoblog.com/.image/w_128,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 128w, https://www.autoblog.com/.image/w_256,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 256w, https://www.autoblog.com/.image/w_384,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 384w, https://www.autoblog.com/.image/w_640,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 640w, https://www.autoblog.com/.image/w_750,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 750w, https://www.autoblog.com/.image/w_828,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 828w, https://www.autoblog.com/.image/w_1080,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 1080w, https://www.autoblog.com/.image/w_1200,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 1200w, https://www.autoblog.com/.image/w_1920,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 1920w, https://www.autoblog.com/.image/w_2048,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 2048w, https://www.autoblog.com/.image/w_3840,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg 3840w\" src=\"https://www.autoblog.com/.image/w_3840,q_auto:good,c_limit/MjA5MTIyMTc5Mzc0NjU1MzMy/mercedes-benz-eqe-350-2.jpg\"/\u003e\u003c/figure\u003e\n\n\n\u003ch2 id=\"new-car-sales-likely-to-decline-through-2027\"\u003eNew Car Sales Likely to Decline Through 2027\u003c/h2\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eConventional wisdom suggests the new tariffs will result in declining new vehicle sales. The real question is how much of a slump might they trigger.\u003c/p\u003e\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eLast month, Cox Automotive forecast demand could drop to as low as 15 million, about 1 million below the 2024 total. And the study warned that could dip into the low 14 million range in the event of a recession.\u003c/p\u003e\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eFor his part, AlixPartner’s Wakefield is more upbeat. He thinks the U.S. market will decline by about 1 million – but over a three-year period – and then begin to bounce back. But there’s a caveat. This would require the Trump administration to deliver on its promise to negotiate new trade agreements with key partners. So far, however, it’s struggling to follow through, with only one big deal in place with the United Kingdom.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003eAbout the Author\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" decoding=\"async\" data-nimg=\"fill\" sizes=\"100px\" srcset=\"https://www.autoblog.com/.image/w_16,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 16w, https://www.autoblog.com/.image/w_32,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 32w, https://www.autoblog.com/.image/w_48,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 48w, https://www.autoblog.com/.image/w_64,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 64w, https://www.autoblog.com/.image/w_96,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 96w, https://www.autoblog.com/.image/w_128,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 128w, https://www.autoblog.com/.image/w_256,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 256w, https://www.autoblog.com/.image/w_384,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 384w, https://www.autoblog.com/.image/w_640,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 640w, https://www.autoblog.com/.image/w_750,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 750w, https://www.autoblog.com/.image/w_828,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 828w, https://www.autoblog.com/.image/w_1080,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 1080w, https://www.autoblog.com/.image/w_1200,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 1200w, https://www.autoblog.com/.image/w_1920,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 1920w, https://www.autoblog.com/.image/w_2048,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 2048w, https://www.autoblog.com/.image/w_3840,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg 3840w\" src=\"https://www.autoblog.com/.image/w_3840,q_auto:good,c_fill,ar_1:1/NzowMDAwMDAwMDAwODk4NTg5/1747774662839blob.jpg\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch2\u003ePaul Eisenstein\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-20T18:05:00Z",
  "modifiedTime": null
}
