{
  "id": "9aeefab9-112f-4e6a-ad27-c19711de97ad",
  "title": "Dacia Spring",
  "link": "https://www.autocar.co.uk/car-review/dacia/spring",
  "description": "Budget car specialist Dacia introduces its first electric car to the UK, and it's a bargain Ignoring the Dacia Spring is impossible if you’re hunting for a small electric car. Its headline-grabbing starting price of £14,995 makes it comfortably the cheapest electric car on sale in the UK today, undercutting the Citroën ë-C3 by £6995 and the Fiat 500e by £10,000.The arrival of the Spring expands Dacia's value offering to six models, ahead of the launch of the much larger Bigster next year. With its supermini proportions, the Spring is by far the smallest of the lot. Given that it’s punily powered (44bhp) at that headline price and that moving up the model hierarchy is unlikely to prove prohibitive for most cash customers, it’s surprising to learn that many are ordering this new city car in its most basic form: at less than 15 grand, please, with 44bhp, and no matter that it takes 19.1sec to reach 62mph.Of more interest to most customers, though is the more powerful Dacia Spring 65, which has a whopping 64bhp motor, pulling its acceleration from a 1965 Hillman Minx-equalling level to that of a 1992 Renault Clio 1.2 (13.7sec) in one fell swoop. Dacia Spring range at a glanceThe Dacia Spring is nice and simple. There are just two models to choose from - 45 and 65 - and two specification levels: Expression and Extreme. The 26.8kWh battery is officially good for 140 miles between charges. Before you scoff, it’s a really usable range for city drivers. Dacia says most drivers average 23 miles a day at an average speed of 23mph, and it claims drivers could expect up to 180 miles per charge in those circumstances.VersionPowerSpring 4544bhpSpring 6564bhpBut how does the Dacia Spring actually drive, and are too many compromises made to reach that low entry price? Read on as we reveal all...",
  "author": "",
  "published": "Wed, 13 Nov 2024 00:01:00 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Car review"
  ],
  "byline": "Title: Editor-at-large Follow:",
  "length": 18816,
  "excerpt": "Budget car specialist Dacia introduces its first electric car to the UK, and it's a bargain",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Find Dacia Spring deals Offers from our trusted partners on this car and its predecessors... New car dealsFrom £14,995Nearly-new car dealsFrom £16,995Sell your car84% get more money with Powered by Ignoring the Dacia Spring is impossible if you’re hunting for a small electric car. Its headline-grabbing starting price of £14,995 makes it comfortably the cheapest electric car on sale in the UK today, undercutting the Citroën ë-C3 by £6995 and the Fiat 500e by £10,000. The arrival of the Spring expands Dacia's value offering to six models, ahead of the launch of the much larger Bigster next year. With its supermini proportions, the Spring is by far the smallest of the lot.  Given that it’s punily powered (44bhp) at that headline price and that moving up the model hierarchy is unlikely to prove prohibitive for most cash customers, it’s surprising to learn that many are ordering this new city car in its most basic form: at less than 15 grand, please, with 44bhp, and no matter that it takes 19.1sec to reach 62mph. Of more interest to most customers, though is the more powerful Dacia Spring 65, which has a whopping 64bhp motor, pulling its acceleration from a 1965 Hillman Minx-equalling level to that of a 1992 Renault Clio 1.2 (13.7sec) in one fell swoop.  Dacia Spring range at a glance The Dacia Spring is nice and simple. There are just two models to choose from - 45 and 65 - and two specification levels: Expression and Extreme.  The 26.8kWh battery is officially good for 140 miles between charges. Before you scoff, it’s a really usable range for city drivers. Dacia says most drivers average 23 miles a day at an average speed of 23mph, and it claims drivers could expect up to 180 miles per charge in those circumstances. Version Power Spring 45 44bhp Spring 65 64bhp But how does the Dacia Spring actually drive, and are too many compromises made to reach that low entry price? Read on as we reveal all... Verdict Dacia's Spring budget electric vehicle is compact, likeable and for an EV very, very affordable GoodLighter and more compact than other EVsGood boot space and reasonable rear accommodationExcellent value for moneyBadA bit of wind noiseLowish charge speed (though it's a small battery)Driving position and seat lack adjustability DESIGN \u0026 STYLING7 Pros Very compactReasonable equipmentFive stars from Green NCAP Cons Poor rear spaceValue positioning lowers qualityOne star from Euro NCAP The Spring is built, as is helpful for budget EVs, in China, on a platform originally created for India’s combustion-engined Renault Kwid. It's been on sale in left-hand-drive markets since 2021, but a mid-life facelift has allowed Dacia to make it in right-hand-drive form too after calculating that the profitability numbers stack up – or at least if they don’t quite stack up for the Spring alone, they will push the Renault Group’s EV sales into a zone where it can sell some more profitable ICE cars alongside it. Unlike several other boxy EVs on sale today that market themselves as ‘small’, the Dacia Spring is genuinely dinky. Measuring 3701mm long, 1583mm wide and 1480mm high, it’s very similar in size to the Hyundai i10. Perhaps more significant is the redesigned interior, which while not using terrifically plush-feeling materials does feature some interesting design touches, a 10in infotainment touchscreen and a 7in digital instrument cluster. There’s a new steering wheel that’s now height-adjustable. Dynamically, there’s a revised power steering tune, but the spring and damper rates are unchanged.  White is only the no-cost paint colour (add £650 for one of the other five), while 64bhp cars have 15in alloys instead of 14s, and UK cars all get air conditioning, electric front windows, remote central locking, rear parking sensors, USB ports, a 12V socket and cruise control.  Extreme trim adds some copper-coloured finishing touches, electric mirrors and rear windows, sat-nav, smartphone integration and a bi-directional charger (which allows the car to power external devices). Dacia says the Spring is the greenest electric car on sale, owing to the fact that as well as emitting no tailpipe gases, it’s a small car with a small frontal area and carries very few added kilos and extras where they’re not needed. Remarkably for an EV, it comes in at under a tonne. An organisation called Green NCAP gave it five stars.  The other NCAP, the one you will have heard of, feels differently about it, giving it a one-star safety rating that Dacia has reacted to with a shrug of its shoulders and a reminder that it meets all mandatory regulations and that buyers don’t care. The latest Spring still hasn't been tested under NCAP regulations, but it'll likely be a similarly low rating.  That said, it has been given lane keeping and speed limit assistance to comply with the EU's new General Safety Regulations, plus a button to easily switch them in and out. The Spring’s motor and inverter sit under the bonnet, where there’s room for an optional cable storage box. Both the 45 and 65 Springs come equipped with a 26.8kWh battery, positioned beneath the rear seats. It can charge on three-pin or 7kW AC power and up to 30kW on DC power. It gives a 140-mile official range with either motor, thanks to an energy consumption of 4.6mpkWh.  This kind of range is something that a combustion city car like the Kia Picanto would laugh at, of course, but Dacia is finding that buyers take four trips on average a day, measuring just 23 miles in total, and with 75% of them charging from home, it’s the very definition of a runabout. Apparently, more than half of current buyers are rural and have a Spring as their only car. We suspect it will be more of an urban or second car in the UK, but Dacia insists an increasing number of buyers in Europe are starting to use the Spring as their primary method of transport.  Pros Decent-sized bootCharacterfulLots of easy-to-reach buttons Cons Not the best qualityRear legroom is poorSeat height is non-adjustable For a car so small – just 3.7m long, about 10cm longer than a Kia Picanto – the Spring has reasonable accommodation. The front seats are set high and are non-adjustable for height. They're reasonably comfortable but not the most supportive. The Spring is very well packaged with reasonable space up front for both the driver and any front passengers.  Taller drivers might struggle for comfort (our 6ft 2in tester found his knee interfering with the window controls). If the driver is shorter than 6ft, there's just enough room behind for a passenger, but rear space is otherwise limited.  The interior quality is as you would expect in such a cheap car, but it’s a characterful environment. There’s a lot of hard plastic and a few rattles, but the infotainment system is intuitive enough. Buttons for the assistance systems and other key functions are easily accessible. There's no infotainment system in the entry-level Spring, but the top-spec Extreme model gets a clear and intuitive 10.0in touchscreen. The Spring also get a 7.0in digital driver display that is customisable and displays all the information you'd likely need. Boot space is good, though. It’s rated at 308 litres, one litre less than the larger Peugeot e-208, and the rear bench folds (but doesn’t split) to raise that to 1004 litres. There's also a Sring Cargo, which is the UK's cheapest 'van'. It's capable of carrying up to 382kg.  The Spring is a four- rather than five-seater, and with a body width of just 1.58m (a thumb's width narrower than a Picanto) and it's not the most spacious one at that. But if you like small cars, there’s lots to admire about its compactness and manoeuvrability; the turning radius is just 4.8m.  ENGINES \u0026 PERFORMANCE6 Pros Easy to drive smoothlyPlenty of power between 10- and 40mphIdeal for city driving Cons 44bhp model is the slowest car on the marketStruggles at higher speedsNo regen adjustability Entry-level Springs come with a measly 44bhp electric motor, which will eventually propel the car from 0-62mph in 19.1sec. We're still yet to drive this variant, It’s comfortably the slowest car on the market today and makes our range-topping, £16,995 Extreme model a more enticing proposition. That’s equipped with a more powerful 64bhp motor with 81lb ft of torque, slashing its 0-62mph time to 13.7sec. It will go on to a top speed of 78mph. The 64bhp Spring is sprightly off the line. It gets up to 50mph easily and is effective in traffic – as is the one-pedal regenerative B mode – but, of course, there’s not much urgency at higher speeds. There's gentle throttle tip-in so it's easy to drive smoothly, and the brake pedal feel is pleasingly weighted and responsive. Drivers can select between a gentle lift-off and a harsher regenerative mode: our preference was to coast more and, in our experience, that contributes to better efficiency too. RIDE \u0026 HANDLING8 Pros Generally comfortable Light handlingWell damped Cons Lots of bodyroll when pushedDoesn't enjoy harder cornersSeats aren't the most supportive We've only driven a 64bhp Spring with 15in wheels, but the springs and dampers give an acceptable amount of compliance to the ride. It's sometimes bouncy but never crashes, and the suspension is by MacPherson struts at the front and a torsion beam at the rear. With such a low kerb weight, it’s not like the suspension needs to be stiff to keep body movements in check. That said, ride comfort isn't always good, which is to be expected given the Spring relies on fairly basic hardware. Its raised stance helps navigate speed bumps, but potholes and larger cracks in the road can vibrate the unisolated cabin. Thankfully, the Spring’s comfortable, spongy seats soak up much of the impact. The Spring's handling is very light and remote, but it takes full advantage of the model's 9.6m turning circle. It’s really not a car that enjoys high-speed cornering, exhibiting significant body lean when worked hard. There is fun to be had wiggling in and out of traffic and around other cars though. It’s hard not to make a light car feel willing and agile, even if you do fit it with 165/55 R15 Linglong eco tyres, but dynamism and style aren’t ultimately really what Dacia is into. And if you think it has a crossover-ish appearance, know that it’s 1519mm tall – only 34mm taller than the Picanto. Even the Fiat 500e 70kW is barely a competitor: most owners are faced with choosing between a Dacia or a used car, not a new one.  MPG \u0026 RUNNING COSTS10 Pros It's the cheapest EV on saleEfficient in the cityAttractive PCP pricing Cons Rivals aren't as cheap but offer more rangeEfficiency will drop when you push it and use the airconUnimpressive max charging speed There is nothing - yet - that comes close to the price of a Dacia Spring. Most customers will opt for the higher-spec Extreme model, which is still impressively priced. It's also available at a seriously enticing £169pcm on PCP.  All cars get the same 26.8kWh with an official range of 140 miles. Our tests, which included a 30-mile trip through city streets and some faster A-roads, returned an economy figure of 4.7mpkWh, equal to a range of around 125 miles. A 12-mile run through packed London roads returned an impressive 7.1mpkWh, which in theory would translate to about 190 miles. The Spring is capable of charging at speeds of up to 48kW, but Dacia expects three-quarters of customers to charge at home. With a 7kW home charger, it will get from 20% to 100% in four hours. Either way, the Spring’s affordability is remarkable for a new car, as is Dacia’s way, to which nobody else has yet come close. Verdict Dacia's Spring budget electric vehicle is compact, likeable and for an EV very, very affordable GoodLighter and more compact than other EVsGood boot space and reasonable rear accommodationExcellent value for moneyBadA bit of wind noiseLowish charge speed (though it's a small battery)Driving position and seat lack adjustability To heck with the one-star Euro NCAP rating, which Dacia says it’s happy to live with until 2027, and so what if it can’t go 200 miles on a tank of juice? The Spring is a budget car with a compelling ‘matchy-matchy’ finance scheme. That’s Dacia’s in-house term for an arrangement where your deposit on the car is the same as the ongoing monthly payments, and in the Spring’s case, it’s about £250. All for a new car with a three-year warranty, an eight-year battery warranty and no tailpipe emissions. Above all else, the Spring is a charming car. It’s smartly styled, well equipped and reasonably practical, but it’s the price and its £169 per month PCP offering that will seal the deal. For many, it the Dacia Spring will be all the car they ever need, and it will raise a smile or two as well. TECHNICAL SPECS Model tested: Dacia Spring 65 Extreme Electric motor/s: Permanent magnet synchronous motor Drive battery: Lithium ion, 26.8kWh (usable) Driveline layout: Front, transverse, front-wheel drive Model tested Dacia Spring 65 Extreme Electric motor/s Permanent magnet synchronous motor View all specs and rivals Drive battery Lithium ion, 26.8kWh (usable) Driveline layout Front, transverse, front-wheel drive Power 64bhp at 4057-6000rpm Torque 83lb ft 500-4057rpm Energy efficiency 4.6mpkWh Max. charge rate 7.4/30kW (AC/DC) Power 64bhp at 4057-6000rpm Torque 83lb ft 500-4057rpm Energy efficiency 4.6mpkWh Max. charge rate 7.4/30kW (AC/DC) Matt Prior Matt is Autocar’s lead features writer and presenter, is the main face of Autocar’s YouTube channel, presents the My Week In Cars podcast and has written his weekly column, Tester’s Notes, since 2013. Matt is an automotive engineer who has been writing and talking about cars since 1997. He joined Autocar in 2005 as deputy road test editor, prior to which he was road test editor and world rally editor for Channel 4’s automotive website, 4Car.  Into all things engineering and automotive from any era, Matt is as comfortable regularly contributing to sibling titles Move Electric and Classic \u0026 Sports Car as he is writing for Autocar. He has a racing licence, and some malfunctioning classic cars and motorbikes.  used Dacia Spring cars for sale Dacia SPRING 27Kwh Extreme 65 48Kw 5Dr Auto Dacia SPRING 27Kwh Extreme 65 48Kw 5Dr Auto Dacia Spring Extreme Electric 65hp Dacia Spring 27Kwh Extreme 65 48Kw 5Dr Auto Dacia Spring 27Kwh Extreme 65 48Kw 5Dr Auto Next Prev Powered By NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/dacia_spring_review_-_front.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \n    \u003cdiv id=\"chapter-introduction\"\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eFind Dacia Spring deals\u003c/p\u003e\n    \u003cp\u003eOffers from our trusted partners on this car and its predecessors...\u003c/p\u003e\n  \u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003eNew car deals\u003c/p\u003e\u003cp\u003eFrom \u003cspan\u003e£14,995\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" href=\"https://www.whatcar.com/make/dacia/spring/car/deals\"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/default/themes/custom/autocar/images/navigate_icon.svg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003eNearly-new car deals\u003c/p\u003e\u003cp\u003eFrom \u003cspan\u003e£16,995\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" href=\"https://www.whatcar.com/used-cars/dacia/spring?sort=priceAsc\u0026amp;minManufacturedYear=24\u0026amp;minOdometerReadingMiles=1\u0026amp;maxOdometerReadingMiles=5000\u0026amp;minPlate=24\u0026amp;maxPlate=74\"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/default/themes/custom/autocar/images/navigate_icon.svg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003eSell your car\u003c/p\u003e\u003cp\u003e84% get more money with \u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" href=\"https://motorway.co.uk/partner/autocar?utm_source=autocar\u0026amp;utm_medium=affiliate\u0026amp;utm_campaign=reviews \"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/default/themes/custom/autocar/images/navigate_icon.svg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003ePowered by \u003ca href=\"https://www.whatcar.com\" target=\"_blank\"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/default/themes/custom/autocar/images/what_car_logo_red.svg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003eIgnoring the \u003cstrong\u003eDacia Spring\u003c/strong\u003e is impossible if you’re hunting for a small electric car. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIts headline-grabbing starting price of £14,995 makes it comfortably the \u003ca href=\"https://www.autocar.co.uk/car-news/electric-cars/cheapest-electric-cars\"\u003echeapest electric car\u003c/a\u003e on sale in the UK today, undercutting the \u003c/span\u003e\u003ca href=\"https://www.autocar.co.uk/car-review/citroen/e-c3\"\u003eCitroën ë-C3\u003c/a\u003e\u003cspan\u003e by £6995 and the \u003c/span\u003e\u003ca href=\"https://www.autocar.co.uk/car-review/fiat/500-electric\"\u003eFiat 500e\u003c/a\u003e\u003cspan\u003e by £10,000.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe arrival of the Spring expands Dacia\u0026#39;s value offering to six models, ahead of the launch of the much larger Bigster next year. With its supermini proportions, the Spring is by far the smallest of the lot. \u003c/p\u003e\n\u003cp\u003e\u003ciframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" referrerpolicy=\"strict-origin-when-cross-origin\" src=\"https://www.youtube.com/embed/SiClZQu_d9U?si=4o6YlQPL8TE31bcq\" title=\"YouTube video player\" width=\"560\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eGiven that it’s punily powered (44bhp) at that headline price and that moving up the model hierarchy is unlikely to prove prohibitive for most cash customers, it’s surprising to learn that many are ordering this new city car in its most basic form: at less than 15 grand, please, with 44bhp, and no matter that it takes 19.1sec to reach 62mph.\u003c/p\u003e\n\u003cp\u003eOf more interest to most customers, though is the more powerful Dacia Spring 65, which has a whopping 64bhp motor, pulling its acceleration from a 1965 Hillman Minx-equalling level to that of a 1992 Renault Clio 1.2 (13.7sec) in one fell swoop. \u003c/p\u003e\n\u003ch2\u003eDacia Spring range at a glance\u003c/h2\u003e\n\u003cp\u003eThe Dacia Spring is nice and simple. There are just two models to choose from - 45 and 65 - and two specification levels: Expression and Extreme. \u003c/p\u003e\n\u003cp\u003eThe 26.8kWh battery is officially good for 140 miles between charges. Before you scoff, it’s a really usable range for city drivers. Dacia says most drivers average 23 miles a day at an average speed of 23mph, and it claims drivers could expect up to 180 miles per charge in those circumstances.\u003c/p\u003e\u003c/div\u003e\n\n                    \n              \u003cdiv\u003e\n              \u003cdiv\u003e\n\u003ctable\u003e\n\u003ctbody\u003e\u003ctr\u003e\n\u003cth scope=\"col\"\u003eVersion\u003c/th\u003e\n\u003cth scope=\"col\"\u003ePower\u003c/th\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eSpring 45\u003c/td\u003e\n\u003ctd\u003e44bhp\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eSpring 65\u003c/td\u003e\n\u003ctd\u003e64bhp\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\u003c/table\u003e\n\u003cp\u003eBut how does the Dacia Spring actually drive, and are too many compromises made to reach that low entry price? Read on as we reveal all...\u003c/p\u003e\n\u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003eDacia\u0026#39;s Spring budget electric vehicle is compact, likeable and for an EV very, very affordable \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eLighter and more compact than other EVs\u003c/p\u003e\u003cp\u003eGood boot space and reasonable rear accommodation\u003c/p\u003e\u003cp\u003eExcellent value for money\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eA bit of wind noise\u003c/p\u003e\u003cp\u003eLowish charge speed (though it\u0026#39;s a small battery)\u003c/p\u003e\u003cp\u003eDriving position and seat lack adjustability\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n            \u003c/div\u003e\n      \n  \n  \n    \n\n\n        \n  \n\n  \n\n  \n\u003cdiv data-id=\"design\" id=\"chapter-design\"\u003e\n      \n  \n      \u003cdiv\u003e\n                                            \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eDESIGN \u0026amp; STYLING\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e7\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eVery compact\u003c/p\u003e\u003cp\u003eReasonable equipment\u003c/p\u003e\u003cp\u003eFive stars from Green NCAP\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003ePoor rear space\u003c/p\u003e\u003cp\u003eValue positioning lowers quality\u003c/p\u003e\u003cp\u003eOne star from Euro NCAP\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eThe Spring is built, as is helpful for budget EVs, in China, on a platform originally created for India’s combustion-engined Renault Kwid.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s been on sale in left-hand-drive markets since 2021, but a mid-life facelift has allowed Dacia to make it in right-hand-drive form too after calculating that the profitability numbers stack up – or at least if they don’t quite stack up for the Spring alone, they will push the Renault Group’s EV sales into a zone where it can sell some more profitable ICE cars alongside it.\u003c/p\u003e\n\u003cp\u003eUnlike several other boxy EVs on sale today that market themselves as ‘small’, the Dacia Spring is genuinely dinky. Measuring 3701mm long, 1583mm wide and 1480mm high, it’s very similar in size to the Hyundai i10.\u003c/p\u003e\n\u003cp\u003ePerhaps more significant is the redesigned interior, which while not using terrifically plush-feeling materials does feature some interesting design touches, a 10in infotainment touchscreen and a 7in digital instrument cluster. There’s a new steering wheel that’s now height-adjustable.\u003c/p\u003e\n\u003cp\u003eDynamically, there’s a revised power steering tune, but the spring and damper rates are unchanged. \u003c/p\u003e\n\u003cp\u003eWhite is only the no-cost paint colour (add £650 for one of the other five), while 64bhp cars have 15in alloys instead of 14s, and UK cars all get air conditioning, electric front windows, remote central locking, rear parking sensors, USB ports, a 12V socket and cruise control. \u003c/p\u003e\n\u003cp\u003eExtreme trim adds some copper-coloured finishing touches, electric mirrors and rear windows, sat-nav, smartphone integration and a bi-directional charger (which allows the car to power external devices).\u003c/p\u003e\u003c/div\u003e                                          \u003c/div\u003e\n   \n                     \n            \u003cdiv\u003e\n\u003cp\u003eDacia says the Spring is the greenest electric car on sale, owing to the fact that as well as emitting no tailpipe gases, it’s a small car with a small frontal area and carries very few added kilos and extras where they’re not needed. Remarkably for an EV, it comes in at under a tonne. An organisation called Green NCAP gave it five stars. \u003c/p\u003e\n\u003cp\u003eThe other NCAP, the one you will have heard of, feels differently about it, giving it a one-star safety rating that Dacia has reacted to with a shrug of its shoulders and a reminder that it meets all mandatory regulations and that buyers don’t care. The latest Spring still hasn\u0026#39;t been tested under NCAP regulations, but it\u0026#39;ll likely be a similarly low rating. \u003c/p\u003e\n\u003cp\u003eThat said, it has been given lane keeping and speed limit assistance to comply with the EU\u0026#39;s new General Safety Regulations, plus a button to easily switch them in and out.\u003c/p\u003e\n\u003cp\u003eThe Spring’s motor and inverter sit under the bonnet, where there’s room for an optional cable storage box.\u003c/p\u003e\n\u003cp\u003eBoth the 45 and 65 Springs come equipped with a 26.8kWh battery, positioned beneath the rear seats. It can charge on three-pin or 7kW AC power and up to 30kW on DC power. It gives a 140-mile official range with either motor, thanks to an energy consumption of 4.6mpkWh. \u003c/p\u003e\n\u003cp\u003eThis kind of range is something that a combustion city car like the \u003ca href=\"https://www.autocar.co.uk/car-review/kia/picanto\"\u003eKia Picanto\u003c/a\u003e would laugh at, of course, but Dacia is finding that buyers take four trips on average a day, measuring just 23 miles in total, and with 75% of them charging from home, it’s the very definition of a runabout.\u003c/p\u003e\n\u003cp\u003eApparently, more than half of current buyers are rural and have a Spring as their only car. We suspect it will be more of an urban or second car in the UK, but Dacia insists an increasing number of buyers in Europe are starting to use the Spring as their primary method of transport. \u003c/p\u003e\n\u003c/div\u003e\n        \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"interior\" id=\"chapter-interior\"\u003e\n                                        \n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eDecent-sized boot\u003c/p\u003e\u003cp\u003eCharacterful\u003c/p\u003e\u003cp\u003eLots of easy-to-reach buttons \u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eNot the best quality\u003c/p\u003e\u003cp\u003eRear legroom is poor\u003c/p\u003e\u003cp\u003eSeat height is non-adjustable\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eFor a car so small – just 3.7m long, about 10cm longer than a Kia Picanto – the Spring has reasonable accommodation.\u003c/p\u003e\n\u003cp\u003eThe front seats are set high and are non-adjustable for height. They\u0026#39;re reasonably comfortable but not the most supportive. \u003cspan\u003eThe Spring is very well packaged with reasonable space up front for both the driver and any front passengers. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eTaller drivers might struggle for comfort (our 6ft 2in tester found his knee interfering with the window controls). If the driver is shorter than 6ft, there\u0026#39;s just enough room behind for a passenger, but rear space is otherwise limited. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe interior quality is as you would expect in such a cheap car, but it’s a characterful environment. There’s a lot of hard plastic and a few rattles, but the infotainment system is intuitive enough. Buttons for the assistance systems and other key functions are easily accessible.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThere\u0026#39;s no infotainment system in the entry-level Spring, but the top-spec Extreme model gets a clear and intuitive 10.0in touchscreen. The Spring also get a 7.0in digital driver display that is customisable and displays all the information you\u0026#39;d likely need.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBoot space is good, though. It’s rated at 308 litres, one litre less than the larger Peugeot e-208, and the rear bench folds (but doesn’t split) to raise that to 1004 litres. There\u0026#39;s also a Sring Cargo, which is the UK\u0026#39;s cheapest \u0026#39;van\u0026#39;. It\u0026#39;s capable of carrying up to 382kg. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe Spring is a four- rather than five-seater, and with a body width of just 1.58m (a thumb\u0026#39;s width narrower than a Picanto) and it\u0026#39;s not the most spacious one at that. But if you like small cars, there’s lots to admire about its compactness and manoeuvrability; the turning radius is just 4.8m. \u003c/p\u003e\n\u003c/div\u003e\n                                        \n                  \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"performance\" id=\"chapter-performance\"\u003e\n                                      \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eENGINES \u0026amp; PERFORMANCE\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e6\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eEasy to drive smoothly\u003c/p\u003e\u003cp\u003ePlenty of power between 10- and 40mph\u003c/p\u003e\u003cp\u003eIdeal for city driving\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003e44bhp model is the slowest car on the market\u003c/p\u003e\u003cp\u003eStruggles at higher speeds\u003c/p\u003e\u003cp\u003eNo regen adjustability\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eEntry-level Springs come with a measly 44bhp electric motor, which will eventually propel the car from 0-62mph in 19.1sec.\u003c/p\u003e\n\u003cp\u003eWe\u0026#39;re still yet to drive this variant, It’s comfortably the slowest car on the market today and makes our range-topping, £16,995 Extreme model a more enticing proposition.\u003c/p\u003e\n\u003cp\u003eThat’s equipped with a more powerful 64bhp motor with 81lb ft of torque, slashing its 0-62mph time to 13.7sec. It will go on to a top speed of 78mph.\u003c/p\u003e\n\u003cp\u003eThe 64bhp Spring is sprightly off the line. It gets up to 50mph easily and is effective in traffic – as is the one-pedal regenerative B mode – but, of course, there’s not much urgency at higher speeds.\u003c/p\u003e\n\u003cp\u003eThere\u0026#39;s gentle throttle tip-in so it\u0026#39;s easy to drive smoothly, and the brake pedal feel is pleasingly weighted and responsive.\u003c/p\u003e\n\u003cp\u003eDrivers can select between a gentle lift-off and a harsher regenerative mode: our preference was to coast more and, in our experience, that contributes to better efficiency too.\u003c/p\u003e\n\u003c/div\u003e\n                                                      \u003c/div\u003e\n    \n\n        \n\u003cdiv data-id=\"ride\" id=\"chapter-ride\"\u003e\n                                      \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eRIDE \u0026amp; HANDLING\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eGenerally comfortable \u003c/p\u003e\u003cp\u003eLight handling\u003c/p\u003e\u003cp\u003eWell damped\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eLots of bodyroll when pushed\u003c/p\u003e\u003cp\u003eDoesn\u0026#39;t enjoy harder corners\u003c/p\u003e\u003cp\u003eSeats aren\u0026#39;t the most supportive\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eWe\u0026#39;ve only driven a 64bhp Spring with 15in wheels, but the springs and dampers give an acceptable amount of compliance to the ride.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s sometimes bouncy but never crashes, and the suspension is by MacPherson struts at the front and a torsion beam at the rear. With such a low kerb weight, it’s not like the suspension needs to be stiff to keep body movements in check.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThat said, ride comfort isn\u0026#39;t always good, which is to be expected given the Spring relies on fairly basic hardware. Its raised stance helps navigate speed bumps, but potholes and larger cracks in the road can vibrate the unisolated cabin. Thankfully, the Spring’s comfortable, spongy seats soak up much of the impact.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe Spring\u0026#39;s handling is very light and remote, but it takes full advantage of the model\u0026#39;s 9.6m turning circle. It’s really not a car that enjoys high-speed cornering, exhibiting significant body lean when worked hard.\u003c/p\u003e\n\u003cp\u003eThere is fun to be had wiggling in and out of traffic and around other cars though. It’s hard not to make a light car feel willing and agile, even if you do fit it with 165/55 R15 Linglong eco tyres, but dynamism and style aren’t ultimately really what Dacia is into.\u003c/p\u003e\n\u003cp\u003eAnd if you think it has a crossover-ish appearance, know that it’s 1519mm tall – only 34mm taller than the Picanto.\u003c/p\u003e\n\u003cp\u003eEven the \u003ca href=\"https://www.autocar.co.uk/car-review/fiat/500-electric\"\u003eFiat 500e\u003c/a\u003e 70kW is barely a competitor: most owners are faced with choosing between a Dacia or a used car, not a new one. \u003c/p\u003e\n\u003c/div\u003e\n                                                      \u003c/div\u003e\n \n\n \n\u003cdiv data-id=\"mpg\" id=\"chapter-mpg\"\u003e\n                                    \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eMPG \u0026amp; RUNNING COSTS\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e10\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eIt\u0026#39;s the cheapest EV on sale\u003c/p\u003e\u003cp\u003eEfficient in the city\u003c/p\u003e\u003cp\u003eAttractive PCP pricing\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eRivals aren\u0026#39;t as cheap but offer more range\u003c/p\u003e\u003cp\u003eEfficiency will drop when you push it and use the aircon\u003c/p\u003e\u003cp\u003eUnimpressive max charging speed\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eThere is nothing - yet - that comes close to the price of a Dacia Spring. Most customers will opt for the higher-spec Extreme model, which is still impressively priced. It\u0026#39;s also available at a seriously enticing £169pcm on PCP. \u003c/p\u003e\n\u003cp\u003eAll cars get the same 26.8kWh with an official range of 140 miles. Our tests, which included a 30-mile trip through city streets and some faster A-roads, returned an economy figure of 4.7mpkWh, equal to a range of around 125 miles.\u003c/p\u003e\n\u003cp\u003eA 12-mile run through packed London roads returned an impressive 7.1mpkWh, which in theory would translate to about 190 miles.\u003c/p\u003e\n\u003cp\u003eThe Spring is capable of charging at speeds of up to 48kW, but Dacia expects three-quarters of customers to charge at home. With a 7kW home charger, it will get from 20% to 100% in four hours.\u003c/p\u003e\n\u003cp\u003eEither way, the Spring’s affordability is remarkable for a new car, as is Dacia’s way, to which nobody else has yet come close.\u003c/p\u003e\n\u003c/div\u003e\n                                                    \u003c/div\u003e\n \n\n  \n\n  \n\n\n\n \n\u003cdiv data-id=\"verdict\" id=\"chapter-verdict\"\u003e\n                                    \n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003eDacia\u0026#39;s Spring budget electric vehicle is compact, likeable and for an EV very, very affordable \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eLighter and more compact than other EVs\u003c/p\u003e\u003cp\u003eGood boot space and reasonable rear accommodation\u003c/p\u003e\u003cp\u003eExcellent value for money\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eA bit of wind noise\u003c/p\u003e\u003cp\u003eLowish charge speed (though it\u0026#39;s a small battery)\u003c/p\u003e\u003cp\u003eDriving position and seat lack adjustability\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003eTo heck with the one-star Euro NCAP rating, which Dacia says it’s happy to live with until 2027, and so what if it can’t go 200 miles on a tank of juice?\u003c/p\u003e\n\u003cp\u003eThe Spring is a budget car with a compelling ‘matchy-matchy’ finance scheme.\u003c/p\u003e\n\n\u003cp\u003eThat’s Dacia’s in-house term for an arrangement where your deposit on the car is the same as the ongoing monthly payments, and in the Spring’s case, it’s about £250. All for a new car with a three-year warranty, an eight-year battery warranty and no tailpipe emissions.\u003c/p\u003e\n\u003cp\u003eAbove all else, the Spring is a charming car. It’s smartly styled, well equipped and reasonably practical, but it’s the price and its £169 per month PCP offering that will seal the deal.\u003c/p\u003e\n\u003cp\u003eFor many, it the Dacia Spring will be all the car they ever need, and it will raise a smile or two as well.\u003c/p\u003e\n\u003c/div\u003e\n                                                    \u003c/div\u003e\n    \n          \u003cdiv\u003e\n                \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003e\u003ch2\u003eTECHNICAL SPECS\u003c/h2\u003e\u003c/p\u003e\n    \u003cdiv\u003e\n      \n      \u003cdiv\u003e\n                  \u003cdiv\u003e\n            \u003cp\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/thumbnail/public/dacia_spring_review_-_front.jpg?itok=5cY6OZ0J\" alt=\"Dacia Spring review   front\"/\u003e\u003c/p\u003e            \u003cdiv\u003e\n              \u003cp\u003eModel tested:\u003c/p\u003e\n              \u003cp\u003eDacia Spring 65 Extreme\u003c/p\u003e\n            \u003c/div\u003e\n          \u003c/div\u003e\n                  \n                  \u003cdiv\u003e\n              \u003cp\u003eElectric motor/s:\u003c/p\u003e\n              \u003cp\u003ePermanent magnet synchronous motor\u003c/p\u003e\n            \u003c/div\u003e\n                  \u003cdiv\u003e\n              \u003cp\u003eDrive battery:\u003c/p\u003e\n              \u003cp\u003eLithium ion, 26.8kWh (usable)\u003c/p\u003e\n            \u003c/div\u003e\n                  \u003cdiv\u003e\n              \u003cp\u003eDriveline layout:\u003c/p\u003e\n              \u003cp\u003eFront, transverse, front-wheel drive\u003c/p\u003e\n            \u003c/div\u003e\n                \n                \n\n      \u003c/div\u003e\n      \n      \n      \u003cdiv\u003e\n                          \u003cdiv\u003e\n              \u003cp\u003eModel tested\u003c/p\u003e\n                              \u003cp\u003eDacia Spring 65 Extreme\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eElectric motor/s\u003c/p\u003e\n                              \u003cp\u003ePermanent magnet synchronous motor\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                      \u003cp\u003eView all specs and rivals\u003c/p\u003e\n                                      \u003cdiv\u003e\n              \u003cp\u003eDrive battery\u003c/p\u003e\n                              \u003cp\u003eLithium ion, 26.8kWh (usable)\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eDriveline layout\u003c/p\u003e\n                              \u003cp\u003eFront, transverse, front-wheel drive\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003ePower\u003c/p\u003e\n                              \u003cp\u003e64bhp at 4057-6000rpm\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eTorque\u003c/p\u003e\n                              \u003cp\u003e83lb ft 500-4057rpm\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eEnergy efficiency\u003c/p\u003e\n                              \u003cp\u003e4.6mpkWh \u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eMax. charge rate\u003c/p\u003e\n                              \u003cp\u003e7.4/30kW (AC/DC)\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                  \u003c/div\u003e\n              \n          \u003c/div\u003e\n    \n      \u003c/div\u003e\n  \n    \u003cdiv\u003e\n                  \u003cdiv\u003e\n            \u003cp\u003ePower\u003c/p\u003e\n            \u003cp\u003e64bhp at 4057-6000rpm\u003c/p\u003e\n          \u003c/div\u003e\n                  \u003cdiv\u003e\n            \u003cp\u003eTorque\u003c/p\u003e\n            \u003cp\u003e83lb ft 500-4057rpm\u003c/p\u003e\n          \u003c/div\u003e\n                  \n                  \n                  \n                  \n                  \u003cdiv\u003e\n            \u003cp\u003eEnergy efficiency\u003c/p\u003e\n            \u003cp\u003e4.6mpkWh \u003c/p\u003e\n          \u003c/div\u003e\n                  \n                  \u003cdiv\u003e\n            \u003cp\u003eMax. charge rate\u003c/p\u003e\n            \u003cp\u003e7.4/30kW (AC/DC)\u003c/p\u003e\n          \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/div\u003e\n\u003csection id=\"outer_author_information\"\u003e\u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/matt-prior\"\u003eMatt Prior\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\u003cp\u003eMatt is Autocar’s lead features writer and presenter, is the main face of Autocar’s YouTube channel, presents the My Week In Cars podcast and has written his weekly column, Tester’s Notes, since 2013.\u003c/p\u003e\n\u003cp\u003eMatt is an automotive engineer who has been writing and talking about cars since 1997. He joined Autocar in 2005 as deputy road test editor, prior to which he was road test editor and world rally editor for Channel 4’s automotive website, 4Car. \u003c/p\u003e\n\u003cp\u003eInto all things engineering and automotive from any era, Matt is as comfortable regularly contributing to sibling titles \u003ca href=\"https://www.moveelectric.com/e-motorbikes/maeving-rm1-electric-motorbike-review\" target=\"_blank\"\u003eMove Electric\u003c/a\u003e and \u003ca href=\"https://www.classicandsportscar.com/features/future-classic-ford-bronco\" target=\"_blank\"\u003eClassic \u0026amp; Sports Car\u003c/a\u003e as he is writing for Autocar. He has a racing licence, and some malfunctioning classic cars and motorbikes. \u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\u003c/div\u003e\u003c/block\u003e\u003c/section\u003e\n\u003cdiv\u003e\n  \n        \u003ch2\u003eused Dacia Spring cars for sale\u003c/h2\u003e\n    \n  \n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eDacia SPRING 27Kwh Extreme 65 48Kw 5Dr Auto \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eDacia SPRING 27Kwh Extreme 65 48Kw 5Dr Auto \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eDacia Spring Extreme Electric 65hp \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eDacia Spring 27Kwh Extreme 65 48Kw 5Dr Auto \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n                  \u003cfigure\u003e\n            \n          \u003c/figure\u003e\n                \u003cp\u003e\u003cspan\u003eDacia Spring 27Kwh Extreme 65 48Kw 5Dr Auto \u003c/span\u003e\n      \u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \n    \n\n    \n    \u003cp\u003eNext\u003c/p\u003e\n    \u003cp\u003ePrev\u003c/p\u003e\n  \u003c/div\u003e\n  \n  \u003cp\u003e\u003cspan\u003ePowered By\n      \u003cspan\u003e\n        \u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/themes/custom/autocar/images/whatcar_logo.svg\"/\u003e\n      \u003c/span\u003e\n    \u003c/span\u003e\n  \u003c/p\u003e\n\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n              \u003c/div\u003e\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "20 min read",
  "publishedTime": null,
  "modifiedTime": null
}
