{
  "id": "9be2397a-da39-4301-bc15-aeca88e821ed",
  "title": "Kia Syros panoramic sunroof confirmed",
  "link": "https://www.autocarindia.com/car-news/kia-syros-panoramic-sunroof-confirmed-433658#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "Ahead of its debut in the coming months, Kia India has dropped yet another teaser of the Syros compact SUV, this time confirming a panoramic sunroof. The Kia Syros will have a more premium positioning than the Sonet, and will pack in several other premium features such as ventilated and powered front seats, drive modes, traction modes, leatherette upholstery and a Bose audio system. Kia Syros will have a design inspired by EV9 and Carnival Will likely be offered with both ICE and electric powertrains Launch expected in early 2025 Kia Syros: what do we know so far As we've reported earlier, the new Syros will differentiate itself from other compact SUVs by having a greater focus on rear-seat space and comfort. It features a boxy design with a flat roof and an upright rear, in order to liberate maximum cabin space. There are talks of the Syros having more interior room than the Sonet, and in a league similar to the Seltos, despite measuring under 4 metres. Teaser images from Kia have suggested design details that resemble the flagship EV9. It sports a rather unique silhouette with a clamshell bonnet that sharply swoops down to a tall and upright nose. A distinctive feature is the window line that rises up with a sharp kink for the rear quarter glass area. The break in the window line at the B-pillar, finished in body colour, is reminiscent of the Skoda Yeti. There are no details on the powertrain front yet, but sources have previously said it will get both ICE and electric powertrain options. Kia will likely launch it with the internal combustion engines first, and the EV version will arrive later. Both versions will be based on the same platform and will be offered in front-wheel drive guise. The upcoming compact SUV will be positioned above the existing crop of the sub-4m SUVs, like the Hyundai Venue, Kia Sonet, Maruti Brezza and the recently launched Skoda Kylaq. Although there’s no confirmation on this yet, Kia could showcase the Syros in production-spec at the upcoming Bharat Mobility Show in January 2025. Also See: Kia EV6 GT to get 650hp powertrain from Hyundai Ioniq 5 N Mahindra BE 6e, XEV 9e prices to be revealed on November 26",
  "author": "Saptarshi Mondal",
  "published": "Mon, 25 Nov 2024 17:30:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Saptarshi  Mondal",
  "length": 2271,
  "excerpt": "Technical details are sparse, but the Syros is expected to get both ICE and electric powertrains.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "Technical details are sparse, but the Syros is expected to get both ICE and electric powertrains.Ahead of its debut in the coming months, Kia India has dropped yet another teaser of the Syros compact SUV, this time confirming a panoramic sunroof. The Kia Syros will have a more premium positioning than the Sonet, and will pack in several other premium features such as ventilated and powered front seats, drive modes, traction modes, leatherette upholstery and a Bose audio system.Kia Syros will have a design inspired by EV9 and CarnivalWill likely be offered with both ICE and electric powertrainsLaunch expected in early 2025 Kia Syros: what do we know so farAs we've reported earlier, the new Syros will differentiate itself from other compact SUVs by having a greater focus on rear-seat space and comfort. It features a boxy design with a flat roof and an upright rear, in order to liberate maximum cabin space. There are talks of the Syros having more interior room than the Sonet, and in a league similar to the Seltos, despite measuring under 4 metres.Teaser images from Kia have suggested design details that resemble the flagship EV9. It sports a rather unique silhouette with a clamshell bonnet that sharply swoops down to a tall and upright nose. A distinctive feature is the window line that rises up with a sharp kink for the rear quarter glass area. The break in the window line at the B-pillar, finished in body colour, is reminiscent of the Skoda Yeti.There are no details on the powertrain front yet, but sources have previously said it will get both ICE and electric powertrain options. Kia will likely launch it with the internal combustion engines first, and the EV version will arrive later. Both versions will be based on the same platform and will be offered in front-wheel drive guise.The upcoming compact SUV will be positioned above the existing crop of the sub-4m SUVs, like the Hyundai Venue, Kia Sonet, Maruti Brezza and the recently launched Skoda Kylaq. Although there’s no confirmation on this yet, Kia could showcase the Syros in production-spec at the upcoming Bharat Mobility Show in January 2025.Also See:Kia EV6 GT to get 650hp powertrain from Hyundai Ioniq 5 NMahindra BE 6e, XEV 9e prices to be revealed on November 26ImagesVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20241125052937_Syros Sunroof Teaser.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eTechnical details are sparse, but the Syros is expected to get both ICE and electric powertrains.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eAhead of its debut in the coming months, Kia India has dropped yet another teaser of the Syros compact SUV, this time confirming a panoramic sunroof. The \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/kia/syros\"\u003eKia Syros\u003c/a\u003e\u003c/strong\u003e will have a more premium positioning than the Sonet, and will pack in several other premium features such as ventilated and powered front seats, drive modes, traction modes, leatherette upholstery and a Bose audio system.\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eKia Syros will have a design inspired by EV9 and Carnival\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eWill likely be offered with both ICE and electric powertrains\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eLaunch expected in early 2025 \u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eKia Syros: what do we know so far\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eAs we\u0026#39;ve reported earlier, the new Syros will differentiate itself from other compact SUVs by having a \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/new-kia-clavis-compact-suv-to-focus-on-rear-seat-space-433369\"\u003egreater focus on rear-seat space and comfort\u003c/a\u003e\u003c/strong\u003e. It features a boxy design with a flat roof and an upright rear, in order to liberate maximum cabin space. There are talks of the Syros having more interior room than the Sonet, and in a league similar to the Seltos, despite measuring under 4 metres.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/new-kia-compact-suv-teased-with-ev9-like-styling-433448\"\u003eTeaser images\u003c/a\u003e\u003c/strong\u003e from Kia have suggested design details that resemble the flagship \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/kia/ev9\"\u003eEV9\u003c/a\u003e\u003c/strong\u003e. It sports a rather unique silhouette with a clamshell bonnet that sharply swoops down to a tall and upright nose. A distinctive feature is the window line that rises up with a sharp kink for the rear quarter glass area. The break in the window line at the B-pillar, finished in body colour, is reminiscent of the Skoda Yeti.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20241106012525_2 _35_.png\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eThere are no details on the powertrain front yet, but sources have previously said it will get both \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/all-new-kia-compact-suv-coming-with-electric-petrol-powertrains-426805\"\u003eICE and electric powertrain\u003c/a\u003e\u003c/strong\u003e options. Kia will likely launch it with the internal combustion engines first, and the EV version will arrive later. Both versions will be based on the same platform and will be offered in front-wheel drive guise.\u003c/p\u003e\u003cp\u003eThe upcoming compact SUV will be positioned above the existing crop of the sub-4m SUVs, like the Hyundai Venue, Kia Sonet, Maruti Brezza and the recently launched \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/skoda/kylaq\"\u003eSkoda Kylaq\u003c/a\u003e\u003c/strong\u003e. Although there’s no confirmation on this yet, Kia could showcase the Syros in production-spec at the upcoming \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/industry/bharat-mobility-global-expo-2025-dates-confirmed-430960\"\u003eBharat Mobility Show\u003c/a\u003e\u003c/strong\u003e in January 2025.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso See:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/kia-ev6-gt-to-get-650hp-powertrain-from-hyundai-ioniq-5-n-433631\"\u003e\u003cstrong\u003eKia EV6 GT to get 650hp powertrain from Hyundai Ioniq 5 N\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/car-news/mahindra-be-6e-xev-9e-prices-to-be-revealed-on-november-26-433639\"\u003e\u003cstrong\u003eMahindra BE 6e, XEV 9e prices to be revealed on November 26\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-433658\"\u003e\u003cul id=\"tab-id-433658\"\u003e\u003cli\u003e\u003ca id=\"tab-imghref-id-433658\" href=\"#.\" rel=\"#tab-images-container-433658\"\u003eImages\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-433658\" href=\"#.\" rel=\"#tab-videos-container-433658\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-25T17:30:00+05:30",
  "modifiedTime": null
}
