{
  "id": "a0e17b9b-f835-46af-971e-ccb54f1e7c44",
  "title": "The Rise of 84-Month Car Loans: Why Buyers Are Trapped",
  "link": "https://www.autoblog.com/news/the-rise-of-84-month-car-loans",
  "description": "Regardless of whether you've nervously scrolled through endless listings on dealer websites or wasted hours of your life configuring your dream cars online, it hurts to know that new cars are expensive. According to analysts from Kelley Blue Book and Cox Automotive, dealers are doing the most they ...",
  "author": "James Ochoa",
  "published": "Mon, 07 Jul 2025 01:00:00 GMT",
  "source": "https://www.autoblog.com/rss.xml",
  "categories": [
    "News",
    "Car Buying"
  ],
  "byline": "James Ochoa",
  "length": 5842,
  "excerpt": "84-month car loans are becoming the norm, but they come with a hefty price. Discover how these extended terms trap buyers in negative equity and cost thousands more in interest over the long run.",
  "siteName": "Autoblog",
  "favicon": "https://www.autoblog.com/.image/c_fill,g_faces:center/NzowMDAwMDAwMDAwODc4Nzc5/cropped-autoblog-favicon.png",
  "text": "Jul 6, 2025 9:00 PM EDTNew cars are expensive, and it hurts Regardless of whether you’ve nervously scrolled through endless listings on dealer websites or wasted hours of your life configuring your dream cars online, it hurts to know that new cars are expensive. According to analysts from Kelley Blue Book and Cox Automotive, dealers are doing the most they can to keep car prices steady; however, the average new car in the U.S. still costs a whopping $48,799 in May 2025, a 2.1% increase from the same month in 2024. Although data shows that tariffs have influenced some buyers in the U.S. to defer or delay their buying decisions, other buyers must finance their cars, which keeps a disturbing trend alive among new car buyers. More drivers are taking out longer loans with higher interest, says Edmunds According to new data released by car buying authority Edmunds, Americans’ auto loans are reaching a point where Dave Ramsay and Caleb Hammer would declare a personal finance armageddon. While automakers and dealer groups would advertise their single-digit promotional financing rates as terms that extend over 60 months (5 years) or 72 months (6 years), buyers are stretching their payment plans for much longer. Edmunds reports that in Q2 2025, more buyers than ever are taking out loans over the course of 84 months (7 years), making up about 22.4% of new-vehicle financing in the quarter, up from 20.4% in Q1 2025 and 17.6% during the same period last year. Though buyers are willing to stretch and spread out their loan terms for a lower monthly payment, they aren’t being spared from paying out the wazoo every month. According to Edmunds, over 19.3% of new car buyers had monthly payments that exceeded $1,000 in Q2 2025, a notable increase from the 17.7% in the previous quarter. As more buyers opt for extended loan terms, Edmunds’ consumer insights analyst Joseph Yoon warns that this could have later consequences, especially as the risks and tribulations of car ownership, such as upkeep costs and depreciation, kick in. “While extended loan terms may make a monthly payment more palatable, consumers need to keep in mind the risks associated with a loan extended that far into the future, including increased costs for upkeep down the line and the risk of being underwater on the loan if the car is traded in before it’s paid off,” Yoon said. “If payments on a more standard 60- or 72-month loan don’t fit your budget, you might consider leasing. While you won’t be building equity in your vehicle the way you do with a purchase, leases afford time to get your finances in better shape with lower monthly payments in the meantime.” APRs remain high, but buyers are putting less money down Although ads on TV during select promotional periods, like certain federal holidays, show that your local [insert automotive brand here] dealer is offering 0% APR loans, or a number close to it (such as 0.9%) on a specific model, these kinds of rates are far out of reach for the average new car buyer. Edmunds says that the average buyer financed their cars at an annual percentage rate (APR) of 7.2%. However, this doesn’t mean that 0% finance deals don’t exist; in fact, they accounted for 0.9% of new-vehicle loans in Q2 2025. This was the lowest share Edmunds recorded since 2004, down from 1% in Q1 2025 and 2.9% in Q2 2024. However, while it is commonly known that a sizable down payment is required to achieve manageable monthly payments, in addition to accepting longer loan terms, Edmunds found that buyers are putting less money down on their new car loans than ever before. According to their data, the average down payment that buyers put down on their new-car loans was $6,433 in Q2 2025, which is down from $6,511 during the previous quarter and $6,579 during the same time last year. At the same time, Edmunds found that new car buyers are financing increasingly expensive vehicles. They found that the average amount financed for new cars climbed to an all-time high of $42,388 in Q2 2025, up from $41,473 during the last quarter and $40,873 during the same time last year. Final thoughts In a statement, Ivan Drury, Edmunds’ director of insights, noted that while it would be easy to assume and point fingers at the Trump administration’s tariffs, car prices remain steady at a level that car buyers still can’t afford. “It’s clear that buyers are pulling the few levers they can control to manage affordability, whether that’s by taking on longer loans, financing more, or putting less money down — even if some of those decisions increase their total costs,” Drury said. “Consumers are continuously stretching to afford new vehicles in this market, and while tariffs haven’t directly driven these Q2 numbers, they’re certainly not going to make things any easier for shoppers moving forward.” We are seeing automakers react to the reality of extended loan payments, too. In fact, the Stellantis-backed Ram Trucks began to offer a best-in-class 10-year/100,000-mile powertrain warranty, which gives Ford and Chevy something to think about. However, in its press release, Ram acknowledges that the warranty comes as “more buyers opt for extended loan terms.” “Everything is more expensive, and trucks are certainly no exception. Truck buyers are financing purchases for longer periods of time, with nearly 80% of new truck loans exceeding five years,” Ram Trucks CEO Tim Kuniskis said in a statement. It is one thing for automakers to recognize this reality, but it is another to enable it. This data comes at the same time when auto loan delinquency is at its highest, as 1.4% of auto borrowers were at least 60 days behind on their auto loan payments during the first quarter of 2025, per TransUnion. About the AuthorJames Ochoa",
  "image": "https://www.autoblog.com/.image/w_1200,h_630,g_faces,c_fill/NzowMDAwMDAwMDAwOTE0NDQx/gettyimages-2221949730.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003ctime datetime=\"2025-07-07T01:00:00.000Z\"\u003eJul 6, 2025 9:00 PM EDT\u003c/time\u003e\u003c/p\u003e\u003ch2 id=\"new-cars-are-expensive-and-it-hurts\"\u003eNew cars are expensive, and it hurts\u003c/h2\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eRegardless of whether you’ve nervously scrolled through endless listings on dealer websites or wasted hours of your life configuring your dream cars online, it hurts to know that new cars are expensive. According to analysts from Kelley Blue Book and Cox Automotive, dealers are doing the most they can to keep car prices steady; however, the average \u003ca href=\"https://www.autoblog.com/reviews/\" rel=\"noopener nofollow\" target=\"_blank\"\u003enew car\u003c/a\u003e in the U.S. still costs a whopping $48,799 in May 2025, a 2.1% increase from the same month in 2024.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003e\u003cspan\u003eAlthough data shows that \u003ca href=\"https://www.autoblog.com/news/gen-z-and-millennials-are-feeling-the-most-car-buying-pressure\" target=\"_blank\"\u003etariffs have influenced some buyers in the U.S. to defer or delay their buying decisions\u003c/a\u003e, other buyers must finance their cars, which keeps a disturbing trend alive among new car buyers\u003c/span\u003e.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg alt=\"BMW vehicles are displayed for sale on a lot at the BMW of South Austin dealership\" loading=\"lazy\" width=\"3992\" height=\"2657\" decoding=\"async\" data-nimg=\"1\" sizes=\"(min-width: 750px) 750px, calc(100vw - 60px)\" srcset=\"https://www.autoblog.com/.image/w_16,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 16w, https://www.autoblog.com/.image/w_32,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 32w, https://www.autoblog.com/.image/w_48,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 48w, https://www.autoblog.com/.image/w_64,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 64w, https://www.autoblog.com/.image/w_96,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 96w, https://www.autoblog.com/.image/w_128,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 128w, https://www.autoblog.com/.image/w_256,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 256w, https://www.autoblog.com/.image/w_384,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 384w, https://www.autoblog.com/.image/w_640,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 640w, https://www.autoblog.com/.image/w_750,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 750w, https://www.autoblog.com/.image/w_828,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 828w, https://www.autoblog.com/.image/w_1080,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 1080w, https://www.autoblog.com/.image/w_1200,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 1200w, https://www.autoblog.com/.image/w_1920,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 1920w, https://www.autoblog.com/.image/w_2048,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 2048w, https://www.autoblog.com/.image/w_3840,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg 3840w\" src=\"https://www.autoblog.com/.image/w_3840,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTA0NTMw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs.jpg\"/\u003e\u003c/figure\u003e\n\n\n\u003ch2 id=\"more-drivers-are-taking-out-longer-loans-with-higher-interest-says-edmunds\"\u003eMore drivers are taking out longer loans with higher interest, says Edmunds\u003c/h2\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eAccording to new data released by car buying authority Edmunds, Americans’ auto loans are reaching a point where Dave Ramsay and Caleb Hammer would declare a personal finance armageddon. While automakers and dealer groups would advertise their single-digit promotional financing rates as terms that extend over 60 months (5 years) or 72 months (6 years), buyers are stretching their payment plans for much longer.\u003c/p\u003e\n\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eEdmunds reports that in Q2 2025, more buyers than ever are taking out loans over the course of 84 months (7 years), making up about 22.4% of new-vehicle financing in the quarter, up from 20.4% in Q1 2025 and 17.6% during the same period last year.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eThough buyers are willing to stretch and spread out their loan terms for a lower monthly payment, they aren’t being spared from paying out the wazoo every month. According to Edmunds, over 19.3% of new car buyers had monthly payments that exceeded $1,000 in Q2 2025, a notable increase from the 17.7% in the previous quarter. As more buyers opt for extended loan terms, Edmunds’ consumer insights analyst Joseph Yoon warns that this could have later consequences, especially as the risks and tribulations of car ownership, such as upkeep costs and depreciation, kick in.\u003c/p\u003e\n\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003e“While extended loan terms may make a monthly payment more palatable, consumers need to keep in mind the risks associated with a loan extended that far into the future, including increased costs for upkeep down the line and the risk of being underwater on the loan if the car is traded in before it’s paid off,” Yoon said. “If payments on a more standard 60- or 72-month loan don’t fit your budget, you might consider leasing. While you won’t be building equity in your vehicle the way you do with a purchase, leases afford time to get your finances in better shape with lower monthly payments in the meantime.”\u003c/p\u003e\n\n\n\n\n\u003ch2 id=\"aprs-remain-high-but-buyers-are-putting-less-money-down\"\u003eAPRs remain high, but buyers are putting less money down\u003c/h2\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eAlthough ads on TV during select promotional periods, like certain federal holidays, show that your local [insert automotive brand here] dealer is offering 0% APR loans, or a number close to it (such as 0.9%) on a specific model, these kinds of rates are far out of reach for the average new car buyer. Edmunds says that the average buyer financed their cars at an annual percentage rate (APR) of 7.2%. However, this doesn’t mean that 0% finance deals don’t exist; in fact, they accounted for 0.9% of new-vehicle loans in Q2 2025. This was the lowest share Edmunds recorded since 2004, down from 1% in Q1 2025 and 2.9% in Q2 2024.\u003c/p\u003e\n\n\n\n\n\n\n\u003cfigure\u003e\u003cimg alt=\"BMW vehicles are displayed for sale on a lot at the BMW of South Austin dealership\" loading=\"lazy\" width=\"3992\" height=\"2657\" decoding=\"async\" data-nimg=\"1\" sizes=\"(min-width: 750px) 750px, calc(100vw - 60px)\" srcset=\"https://www.autoblog.com/.image/w_16,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 16w, https://www.autoblog.com/.image/w_32,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 32w, https://www.autoblog.com/.image/w_48,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 48w, https://www.autoblog.com/.image/w_64,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 64w, https://www.autoblog.com/.image/w_96,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 96w, https://www.autoblog.com/.image/w_128,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 128w, https://www.autoblog.com/.image/w_256,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 256w, https://www.autoblog.com/.image/w_384,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 384w, https://www.autoblog.com/.image/w_640,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 640w, https://www.autoblog.com/.image/w_750,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 750w, https://www.autoblog.com/.image/w_828,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 828w, https://www.autoblog.com/.image/w_1080,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 1080w, https://www.autoblog.com/.image/w_1200,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 1200w, https://www.autoblog.com/.image/w_1920,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 1920w, https://www.autoblog.com/.image/w_2048,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 2048w, https://www.autoblog.com/.image/w_3840,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg 3840w\" src=\"https://www.autoblog.com/.image/w_3840,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0NDQw/eu-exports-to-us-hit-a-record-high-ahead-of-expected-tariffs-914440.jpg\"/\u003e\u003c/figure\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eHowever, while it is commonly known that a sizable down payment is required to achieve manageable monthly payments, in addition to accepting longer loan terms, Edmunds found that buyers are putting less money down on their new car loans than ever before. According to their data, the average down payment that buyers put down on their new-car loans was $6,433 in Q2 2025, which is down from $6,511 during the previous quarter and $6,579 during the same time last year.\u003c/p\u003e\n\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eAt the same time, Edmunds found that new car buyers are financing increasingly expensive vehicles. They found that the average amount financed for new cars climbed to an all-time high of $42,388 in Q2 2025, up from $41,473 during the last quarter and $40,873 during the same time last year.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch2 id=\"final-thoughts\"\u003eFinal thoughts\u003c/h2\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eIn a statement, Ivan Drury, Edmunds’ director of insights, noted that while it would be easy to assume and point fingers at the Trump administration’s tariffs, car prices remain steady at a level that car buyers still can’t afford.\u003c/p\u003e\n\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003e“It’s clear that buyers are pulling the few levers they can control to manage affordability, whether that’s by taking on longer loans, financing more, or putting less money down — even if some of those decisions increase their total costs,” Drury said. “Consumers are continuously stretching to afford new vehicles in this market, and while tariffs haven’t directly driven these Q2 numbers, they’re certainly not going to make things any easier for shoppers moving forward.”\u003c/p\u003e\n\n\n\n\n\u003cfigure\u003e\u003cimg alt=\"2025 Ram Power Wagon\" loading=\"lazy\" width=\"3000\" height=\"2000\" decoding=\"async\" data-nimg=\"1\" sizes=\"(min-width: 750px) 750px, calc(100vw - 60px)\" srcset=\"https://www.autoblog.com/.image/w_16,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 16w, https://www.autoblog.com/.image/w_32,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 32w, https://www.autoblog.com/.image/w_48,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 48w, https://www.autoblog.com/.image/w_64,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 64w, https://www.autoblog.com/.image/w_96,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 96w, https://www.autoblog.com/.image/w_128,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 128w, https://www.autoblog.com/.image/w_256,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 256w, https://www.autoblog.com/.image/w_384,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 384w, https://www.autoblog.com/.image/w_640,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 640w, https://www.autoblog.com/.image/w_750,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 750w, https://www.autoblog.com/.image/w_828,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 828w, https://www.autoblog.com/.image/w_1080,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 1080w, https://www.autoblog.com/.image/w_1200,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 1200w, https://www.autoblog.com/.image/w_1920,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 1920w, https://www.autoblog.com/.image/w_2048,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 2048w, https://www.autoblog.com/.image/w_3840,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg 3840w\" src=\"https://www.autoblog.com/.image/w_3840,q_auto:good,c_limit/NzowMDAwMDAwMDAwOTE0MTI0/2025-ram-power-wagon-914124.jpg\"/\u003e\u003c/figure\u003e\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eWe are seeing automakers react to the reality of extended loan payments, too. In fact, the Stellantis-backed \u003ca href=\"https://www.autoblog.com/ram/\" rel=\"noopener nofollow\" target=\"_blank\"\u003eRam\u003c/a\u003e Trucks began to offer a best-in-class 10-year/100,000-mile powertrain warranty, which gives \u003ca href=\"https://www.autoblog.com/ford/\" rel=\"noopener nofollow\" target=\"_blank\"\u003eFord\u003c/a\u003e and Chevy something to think about. However, in its press release, Ram acknowledges that the warranty comes as “more buyers opt for extended loan terms.”\u003c/p\u003e\n\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003e“Everything is more expensive, and trucks are certainly no exception. Truck buyers are financing purchases for longer periods of time, with nearly 80% of new truck loans exceeding five years,” Ram Trucks CEO Tim Kuniskis said in a statement.\u003c/p\u003e\n\n\n\n\n\u003cp data-wp-block=\"{\u0026#34;dropCap\u0026#34;:false}\" data-wp-block-name=\"core/paragraph\"\u003eIt is one thing for automakers to recognize this reality, but it is another to enable it. This data comes at the same time when auto loan delinquency is at its highest, as 1.4% of auto borrowers were at least 60 days behind on their auto loan payments during the first quarter of 2025, per TransUnion.\u003c/p\u003e\n\n\n\n\n\n\u003cdiv\u003e\u003cp\u003eAbout the Author\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" decoding=\"async\" data-nimg=\"fill\" sizes=\"100px\" srcset=\"https://www.autoblog.com/.image/w_16,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 16w, https://www.autoblog.com/.image/w_32,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 32w, https://www.autoblog.com/.image/w_48,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 48w, https://www.autoblog.com/.image/w_64,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 64w, https://www.autoblog.com/.image/w_96,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 96w, https://www.autoblog.com/.image/w_128,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 128w, https://www.autoblog.com/.image/w_256,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 256w, https://www.autoblog.com/.image/w_384,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 384w, https://www.autoblog.com/.image/w_640,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 640w, https://www.autoblog.com/.image/w_750,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 750w, https://www.autoblog.com/.image/w_828,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 828w, https://www.autoblog.com/.image/w_1080,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 1080w, https://www.autoblog.com/.image/w_1200,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 1200w, https://www.autoblog.com/.image/w_1920,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 1920w, https://www.autoblog.com/.image/w_2048,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 2048w, https://www.autoblog.com/.image/w_3840,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg 3840w\" src=\"https://www.autoblog.com/.image/w_3840,q_auto:good,c_fill,ar_1:1/MjA5ODY2MDc4MTc0NTg2NTM3/img_0833-2.jpg\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch2\u003eJames Ochoa\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-07-06T21:00:00Z",
  "modifiedTime": null
}
