{
  "id": "a40a4596-5a64-4971-99c9-effcd6076def",
  "title": "Breaking: Volkswagen to cut 35,000 jobs by 2030",
  "link": "https://www.autocar.co.uk/car-news/new-cars/breaking-volkswagen-cut-35000-jobs-2030",
  "description": "German car maker says decision is part of comprehensive restructuring plan to save up to €4 billion Volkswagen will cut 35,000 jobs over the next five years as part of a comprehensive restructuring plan to save up to €4 billion (£3.4 billion). The decision was announced this evening after the car maker finalised an agreement with its works council. The manufacturer said the plan is designed to streamline operations, enhance efficiency, and secure a competitive financial footing as it pivots to electric vehicles.  The majority of the reduction will be implemented through voluntary measures, including early retirement and severance packages, in an effort to minimise social disruption, says the German car maker. VW has approximately 120,000 employees in Germany, about half of whom work at the main plant in Wolfsburg. The restructuring will also prioritise optimising production efficiency and reallocating resources towards Volkswagen’s electric vehicle strategy in a move aimed at reducing the overall capacity in its German manufacturing network by 700,000 vehicles annually. Volkswagen confirms the historic former Karmann factory in Osnabrück, which dates back to 1901 and was acquired by Volkswagen in 2009, and the Transparent Factory in Dresden, originally opened in 2002 to produce the now-discontinued Phaeton, will remain in operation, but they are planned to be repurposed in a bid to slash costs. According to reports by Wards Auto, Osnabrück will remain open until 2026 to fulfil a contract to produce the existing T-Roc Cabriolet. It is claimed there are plans for a defence company to step in and preserve as many jobs at the plant as possible. The Dresden site, where ID 3 models are currently manufactured, has been earmarked to cease vehicle production. In the future, it is expected to house a yet-to-be-confirmed Volkswagen-run technical operation. The announcement of the restructuring follows weeks of intense negotiations between Volkswagen management and worker representatives. The talks were prompted by Volkswagen Group CEO Oliver Blume’s earlier calls for dramatic measures to cut labour costs, citing Germany's high wages as a barrier to competing with key rivals. Blume had controversially proposed a 20 per cent wage reduction and warned that factory closures were essential for Volkswagen's long-term competitiveness. The potential closure of the Osnabrück and Dresden facilities has drawn sharp criticism in Germany, sparking debates in the German parliament. While Volkswagen management had also pushed for the closure of a third plant, both its Zwickau and Emden facilities have been spared in the cost-cutting measures. Volkswagen’s restructuring underscores the delicate balancing act it faces: maintaining production of traditional best-sellers like the Golf, Tiguan and Passat, while ramping up output of newer electric offerings, including the ID 3, ID 4 and ID 7. The agreement represents a crucial step towards securing greater profit margins amid growing competition from Chinese automakers such as BYD, Chery, and Geely. Volkswagen's supervisory board approved the agreement in a special session on Friday, signalling strong support for the restructuring. Meanwhile, the works council, a powerful force in Volkswagen’s corporate governance, succeeded in securing measures to cushion the impact on affected workers, including a job security clause through to 2030, but has agreed to waive wage increases until 2030.",
  "author": "",
  "published": "Fri, 20 Dec 2024 19:15:23 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Greg Kable",
  "length": 2814,
  "excerpt": "German car maker says decision is part of comprehensive restructuring plan to save up to €4 billion (£3.4 billion)",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Volkswagen will cut 35,000 jobs over the next five years as part of a comprehensive restructuring plan to save up to €4 billion (£3.4 billion). The decision was announced this evening after the car maker finalised an agreement with its works council. The manufacturer said the plan is designed to streamline operations, enhance efficiency, and secure a competitive financial footing as it pivots to electric vehicles.  The majority of the reduction will be implemented through voluntary measures, including early retirement and severance packages, in an effort to minimise social disruption, says the German car maker. VW has approximately 120,000 employees in Germany, about half of whom work at the main plant in Wolfsburg. The restructuring will also prioritise optimising production efficiency and reallocating resources towards Volkswagen’s electric vehicle strategy in a move aimed at reducing the overall capacity in its German manufacturing network by 700,000 vehicles annually. Volkswagen confirms the historic former Karmann factory in Osnabrück, which dates back to 1901 and was acquired by Volkswagen in 2009, and the Transparent Factory in Dresden, originally opened in 2002 to produce the now-discontinued Phaeton, will remain in operation, but they are planned to be repurposed in a bid to slash costs. According to reports by Wards Auto, Osnabrück will remain open until 2026 to fulfil a contract to produce the existing T-Roc Cabriolet. It is claimed there are plans for a defence company to step in and preserve as many jobs at the plant as possible. The Dresden site, where ID 3 models are currently manufactured, has been earmarked to cease vehicle production. In the future, it is expected to house a yet-to-be-confirmed Volkswagen-run technical operation. The announcement of the restructuring follows weeks of intense negotiations between Volkswagen management and worker representatives. The talks were prompted by Volkswagen Group CEO Oliver Blume’s earlier calls for dramatic measures to cut labour costs, citing Germany's high wages as a barrier to competing with key rivals. Blume had controversially proposed a 20 per cent wage reduction and warned that factory closures were essential for Volkswagen's long-term competitiveness. The potential closure of the Osnabrück and Dresden facilities has drawn sharp criticism in Germany, sparking debates in the German parliament. While Volkswagen management had also pushed for the closure of a third plant, both its Zwickau and Emden facilities have been spared in the cost-cutting measures. Volkswagen’s restructuring underscores the delicate balancing act it faces: maintaining production of traditional best-sellers like the Golf, Tiguan and Passat, while ramping up output of newer electric offerings, including the ID 3, ID 4 and ID 7.",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/vw_wolfsburg_0.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/car-reviews/vw\"\u003eVolkswagen\u003c/a\u003e will cut 35,000 jobs over the next five years as part of a comprehensive restructuring plan to save\u003cspan\u003e up to €4 billion (£3.4 billion).\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe \u003cspan\u003edecision was announced this evening after the car maker finalised an agreement with its works council. The manufacturer said the plan is \u003c/span\u003edesigned to streamline operations, enhance efficiency, and secure a competitive financial footing as it pivots to electric vehicles. \u003c/p\u003e\n\u003cp\u003eThe majority of the reduction will be implemented through voluntary measures, including early retirement and severance packages, in an effort to minimise social disruption, says the German car maker. VW has approximately 120,000 employees in Germany, about half of whom work at the main plant in Wolfsburg.\u003c/p\u003e\n\n\u003cp\u003eThe restructuring will also prioritise optimising production efficiency and reallocating resources towards Volkswagen’s electric vehicle strategy in a move aimed at reducing the overall capacity in its German manufacturing network by 700,000 vehicles annually.\u003c/p\u003e\n\u003cp\u003eVolkswagen confirms the historic former Karmann factory in Osnabrück, which dates back to 1901 and was acquired by Volkswagen in 2009, and the Transparent Factory in Dresden, originally opened in 2002 to produce the now-discontinued Phaeton, will remain in operation, but they are planned to be repurposed in a bid to slash costs.\u003c/p\u003e\n\u003cp\u003eAccording to reports by Wards Auto, Osnabrück will remain open until 2026 to fulfil a contract to produce the existing T-Roc Cabriolet. It is claimed there are plans for a defence company to step in and preserve as many jobs at the plant as possible.\u003c/p\u003e\n\u003cp\u003eThe Dresden site, where ID 3 models are currently manufactured, has been earmarked to cease vehicle production. In the future, it is expected to house a yet-to-be-confirmed Volkswagen-run technical operation.\u003c/p\u003e\n\u003cp\u003eThe announcement of the restructuring follows weeks of intense negotiations between Volkswagen management and worker representatives. The talks were prompted by Volkswagen Group CEO Oliver Blume’s earlier calls for dramatic measures to cut labour costs, citing Germany\u0026#39;s high wages as a barrier to competing with key rivals. Blume had controversially proposed a 20 per cent wage reduction and warned that factory closures were essential for Volkswagen\u0026#39;s long-term competitiveness.\u003c/p\u003e\n\u003cp\u003eThe potential closure of the Osnabrück and Dresden facilities has drawn sharp criticism in Germany, sparking debates in the German parliament. While Volkswagen management had also pushed for the closure of a third plant, both its Zwickau and Emden facilities have been spared in the cost-cutting measures.\u003c/p\u003e\n\u003cp\u003eVolkswagen’s restructuring underscores the delicate balancing act it faces: maintaining production of traditional best-sellers like the Golf, Tiguan and Passat, while ramping up output of newer electric offerings, including the ID 3, ID 4 and ID 7.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-20T19:15:23Z",
  "modifiedTime": null
}
