{
  "id": "a6630217-dac5-4f51-af0c-276e17de42b8",
  "title": "Will fake gearshifts in hybrids and EVs win over enthusiasts?",
  "link": "https://www.autocar.co.uk/opinion/new-cars/will-fake-gearshifts-hybrids-and-evs-win-over-enthusiasts",
  "description": "The inbound Honda Prelude will have a 'fake' gearbox much like the Hyundai Ioniq 5 N News that the upcoming Honda Prelude will have fake gearshifts has caused some consternation among enthusiasts in the various bits of the internet where we’re currently scattered. Quite a lot of sceptics, not much wild enthusiasm. In their earlier incarnations, Preludes were among the best affordable driver’s coupés on the market, with high-revving VTEC engines mated to good manual gearboxes. There are plenty of people – and I will admit that I’m one of them – who mourn the demise of cars like that. Some say, then, that Honda should just fit the new Prelude with a proper manual ’box, like you can still get in an Integra in some markets, and to heck with the inefficiency, because the Prelude is a sports coupé. Others say Honda should do away with even the idea of a gearshift, because it’s obviously not real and we should just grow up and get over ourselves, because this transmission is trying to dupe us. As Cypher said in the 1999 film The Matrix (nothing but the latest cultural references for you here, reader): “I know this steak doesn’t exist. I know that when I put it in my mouth, The Matrix is telling my brain that it is juicy and delicious.” Disliking fake technology is, I can see, an argument with merit too. And it is, ultimately, fake tech. What this Prelude’s new S+ Shift system will do is take hybrid technology but make it less efficient while still not being real. As referenced on page 11, it has a clever way of working, developed as it is from the transmission of the latest Civic. This is sometimes referred to erroneously as a CVT (continuously variable transmission), when it’s nothing of the sort. Rather unhelpfully, e-CVT is even how Honda initially referred to it. It’s kind of the opposite, in that it’s not a variable transmission at all. A petrol engine acts the vast majority of the time solely as a generator, making electricity for an electric traction motor that does all of the driving. In the Civic, the engine does very occasionally drive the wheels itself too, but only through one, single fixed ratio at motorway-type speeds. Most of the time it’s just coupled to a system that makes electricity, with the motor doing the driving. There is a speed at which an engine is running at peak efficiency for power generation, but there is a problem with that: an engine running at a steady RPM sounds boring. One can live with that noise, or make it inaudible if possible, or do as Honda has done with the Civic and try to zhuzh it up a bit. The Civic’s engine revs through pretend ratios to sound like an engine that’s driving things. Yet if you pull a flappy paddle on the steering wheel, you change the regeneration from the motor but have no effect on the ‘gears’. The Prelude will change that part, with the paddles changing those fake gear ratios instead. I don’t know what it will do in terms of lift-off regeneration, but it’s not difficult technically to basically mimic engine braking. The Hyundai Ioniq 5 N can do the same with no engine at all. So at high revs, you would get a lot of regen; at low revs, less. The difference between the Ioniq 5 N and the Prelude is that while the gears are still fake, the engine is real. That’s less thermally efficient than an EV and less efficient than an engine spinning at fixed-rev maximum efficiency. But it’s more efficient than driving the wheels through an actual transmission with all the heat and noise losses that entails, which is why the Prelude is a hybrid in the first place, plus it’s lighter than an EV and comes with other ICE-car advantages, like quick refuelling. And finally it creates, hopes Honda, some old-fashioned driver engagement. If this all sounds like a bit of a fudge, I suppose that’s because ultimately it is. But while the purist in me is sceptical, if it works well I can see myself coming around to Cypher’s views on the steak and wine that his brain tells him are real: “You know what I realise? Ignorance is bliss.”",
  "author": "",
  "published": "Sat, 18 Jan 2025 08:01:44 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Opinion"
  ],
  "byline": "Matt Prior",
  "length": 2184,
  "excerpt": "The inbound Honda Prelude will have a 'fake' gearbox much like the Hyundai Ioniq 5 N",
  "siteName": "Autocar",
  "favicon": "",
  "text": "News that the upcoming Honda Prelude will have fake gearshifts has caused some consternation among enthusiasts in the various bits of the internet where we’re currently scattered. Quite a lot of sceptics, not much wild enthusiasm. In their earlier incarnations, Preludes were among the best affordable driver’s coupés on the market, with high-revving VTEC engines mated to good manual gearboxes. There are plenty of people – and I will admit that I’m one of them – who mourn the demise of cars like that. Some say, then, that Honda should just fit the new Prelude with a proper manual ’box, like you can still get in an Integra in some markets, and to heck with the inefficiency, because the Prelude is a sports coupé. Others say Honda should do away with even the idea of a gearshift, because it’s obviously not real and we should just grow up and get over ourselves, because this transmission is trying to dupe us. As Cypher said in the 1999 film The Matrix (nothing but the latest cultural references for you here, reader): “I know this steak doesn’t exist. I know that when I put it in my mouth, The Matrix is telling my brain that it is juicy and delicious.” Disliking fake technology is, I can see, an argument with merit too. And it is, ultimately, fake tech. What this Prelude’s new S+ Shift system will do is take hybrid technology but make it less efficient while still not being real. As referenced on page 11, it has a clever way of working, developed as it is from the transmission of the latest Civic. This is sometimes referred to erroneously as a CVT (continuously variable transmission), when it’s nothing of the sort. Rather unhelpfully, e-CVT is even how Honda initially referred to it. It’s kind of the opposite, in that it’s not a variable transmission at all. A petrol engine acts the vast majority of the time solely as a generator, making electricity for an electric traction motor that does all of the driving. In the Civic, the engine does very occasionally drive the wheels itself too, but only through one, single fixed ratio at motorway-type speeds. Most of the time it’s just coupled to a system that makes electricity, with the motor doing the driving.",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/honda-prelude-front-concept-prior-column.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eNews that the upcoming \u003ca href=\"https://www.autocar.co.uk/car-news/new-cars/confirmed-new-honda-prelude-feature-simulated-gearbox\"\u003eHonda Prelude\u003c/a\u003e will have fake gearshifts has caused some consternation among \u003ca href=\"https://www.autocar.co.uk/car-news/used-cars-best-of/best-value-used-cars\"\u003eenthusiasts\u003c/a\u003e in the various bits of the internet where we’re currently scattered. Quite a lot of sceptics, not much wild enthusiasm.\u003c/p\u003e\n\u003cp\u003eIn their earlier incarnations, Preludes were among the best affordable driver’s coupés on the market, with high-revving VTEC engines mated to good manual gearboxes.\u003c/p\u003e\n\u003cp\u003eThere are plenty of people – and I will admit that I’m one of them – who mourn the demise of cars like that.\u003c/p\u003e\n\n\u003cp\u003eSome say, then, that \u003ca href=\"https://www.autocar.co.uk/honda\"\u003eHonda\u003c/a\u003e should just fit the new Prelude with a proper manual ’box, like you can still get in an Integra in some markets, and to heck with the inefficiency, because the Prelude is a \u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/best-sports-cars\"\u003esports coupé.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eOthers say Honda should do away with even the idea of a gearshift, because it’s obviously not real and we should just grow up and get over ourselves, because this transmission is trying to dupe us.\u003c/p\u003e\n\u003cp\u003eAs Cypher said in the 1999 film The Matrix (nothing but the latest cultural references for you here, reader): “I know this steak doesn’t exist. I know that when I put it in my mouth, The Matrix is telling my brain that it is juicy and delicious.”\u003c/p\u003e\n\u003cp\u003eDisliking fake technology is, I can see, an argument with merit too.\u003c/p\u003e\n\u003cp\u003eAnd it is, ultimately, fake tech. What this Prelude’s new S+ Shift system will do is take \u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/best-hybrid-cars\"\u003ehybrid\u003c/a\u003e technology but make it less efficient while still not being real.\u003c/p\u003e\n\u003cp\u003eAs referenced on page 11, it has a clever way of working, developed as it is from the transmission of the latest \u003ca href=\"https://www.autocar.co.uk/car-review/honda/civic\"\u003eCivic\u003c/a\u003e. This is sometimes referred to erroneously as a CVT (continuously variable transmission), when it’s nothing of the sort.\u003c/p\u003e\n\u003cp\u003eRather unhelpfully, e-CVT is even how Honda initially referred to it. It’s kind of the opposite, in that it’s not a variable transmission at all.\u003c/p\u003e\n\u003cp\u003eA petrol engine acts the vast majority of the time solely as a generator, making electricity for an\u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/best-electric-cars\"\u003e electric\u003c/a\u003e traction motor that does all of the driving. In the Civic, the engine does very occasionally drive the wheels itself too, but only through one, single fixed ratio at motorway-type speeds.\u003c/p\u003e\n\u003cp\u003eMost of the time it’s just coupled to a system that makes electricity, with the motor doing the driving.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-18T08:01:44Z",
  "modifiedTime": null
}
