{
  "id": "a7be97eb-a446-4482-951b-a305af27d77a",
  "title": "How To Fix Curb Rash On Black Rims",
  "link": "https://www.jalopnik.com/1899484/fix-curb-rash-black-rims/",
  "description": "Not only is it annoying to get curb rash on your black rims, but buying new ones is expensive. Instead, here's how you can fix it on your own.",
  "author": "Jordan A. Rodriguez",
  "published": "Sun, 06 Jul 2025 00:25:00 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "Wrenching"
  ],
  "byline": "Jordan A. Rodriguez",
  "length": 4694,
  "excerpt": "Not only is it annoying to get curb rash on your black rims, but buying new ones is expensive. Instead, here's how you can fix it on your own.",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "Fangstw/Shutterstock If you've ever been driving around a little carelessly and happened to bump into the curb, you know the dreaded feeling of what damage you just caused. Or maybe you're a careful driver and your tire size is causing curb rash. Whatever the situation may be, no one wants to ride around with scuffed up rims. So today, we're talking about another Do-It-Yourself (DIY) project: curb rash on black rims and how to fix it. All it takes is a little sandpaper, some filler, spray paint, patience, and you're golden. If it sounds daunting, don't worry. Luckily, it's an easy fix, whether you want to take it to a professional and burn some cash, or do this yourself. Some drivers these days like a little DIY to learn a new skill and save some money. It may take more time, but the end result will be worth it. So, let's go over how to fix the curb rash on your rims. Materials needed for fixing curb rash on black rims GS23/Shutterstock First off, let's assess the damage. Just how bad is it? Scratches and scrapes on the rims are the usual mark of curb rash, concentrated closer to the outer edge where the rim meets the tire. Take your time inspecting each wheel carefully to get an idea of how much damage there is. It can be anywhere from minor surface scratches or scuffed paint to deep cuts and bent rims. Once you know the level of damage you're working with, it's time to collect the right tools. Every situation of curb rash is different, so you may not need all of these: Varying grits of sandpaper, from 100 to 320. Some sources even suggest up to 400 grit, but it's better to have various grit levels to sand and smooth things out. Rim cleaning solution isn't mandatory, but fixing anything is easier with a clean surface. Filler and hardener for any cracks or deep cuts. Putty also works. Spray paint to repaint the rim. For this project, we want black spray paint. Matte finish or semi-gloss, your choice. A rubber mallet in case you have those bent rims we talked about. Painter's tape to cover up parts we're not painting, Gloves, goggles, and a face mask.  Whether or not you want to pay your auto shop to remove the wheels or leave them on is up to you. Personally, we think taking them off is easier for this project, but you can also leave them on if you want. Fixing curb rash Tomasz Majchrowicz/Shutterstock Start by cleaning the wheel with the rim cleaning solution. We want to prepare the rim, so we want to get it clean and then sand it down. 80 to 120 grit is not only versatile, but great for sanding in general, so we can use this to sand down the scuffed areas and even out the metal caught up in the curb rash. Next, if you're using spot putty, you can squeeze out a small amount and spread it along the damaged area. If using filler, you may need to mix things up a bit to make sure the filler and hardener combine. Then apply and wait for it to dry. After the putty/filler dries, it's back to sanding. We want to sand it down and get it smooth again. 100 grit is a good bet. Don't worry if you sand off too much, you can always reapply the putty/filter and sand again. Take your time. Go over it again, but increase the sandpaper grit to get this baby looking smooth. If your rims are bent, this would be a good time to put that rubber mallet to use. Take solid but gentle swings to avoid cracking the rims (if they're made of aluminum). Now comes the paint job. Use painter's tape to cover an inch or two into the tires, plus the valve stem, lug nets, tire pressure cap, and if you didn't take the rims off, anything behind the wheel you don't want to get paint on. Apply the paint to your rims. Multiple coats, again from light to heavy. Using some touch-up paint or a clear coat can also help protect the rims from corrosion if there's any exposed metal. Think about investing into a rim protector to protect your rims from future curb rash.",
  "image": "https://www.jalopnik.com/img/gallery/how-to-fix-curb-rash-on-black-rims/l-intro-1751296760.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1899484/fix-curb-rash-black-rims/\" data-post-title=\"How To Fix Curb Rash On Black Rims\" data-slide-num=\"0\" data-post-id=\"1899484\"\u003e\n                                             \u003cpicture id=\"pb330093693dd012c356e7758c7bc6193\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/how-to-fix-curb-rash-on-black-rims/intro-1751296760.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/how-to-fix-curb-rash-on-black-rims/intro-1751296760.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/how-to-fix-curb-rash-on-black-rims/intro-1751296760.jpg\" data-slide-url=\"https://www.jalopnik.com/1899484/fix-curb-rash-black-rims/\" data-post-id=\"1899484\" data-slide-num=\"0\" data-slide-title=\"How To Fix Curb Rash On Black Rims: \" width=\"780\" height=\"438\" alt=\"Curb rash on a black rim\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eFangstw/Shutterstock\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp\u003eIf you\u0026#39;ve ever been driving around a little carelessly and happened to bump into the curb, you know the dreaded feeling of what damage you just caused. Or maybe you\u0026#39;re a careful driver and \u003ca href=\"https://www.jalopnik.com/1851206/tire-size-impact-stop-curb-rash/\" target=\"_blank\"\u003eyour tire size is causing curb rash\u003c/a\u003e. Whatever the situation may be, no one wants to ride around with scuffed up rims. So today, we\u0026#39;re talking about another Do-It-Yourself (DIY) project: curb rash on black rims and how to fix it. All it takes is a little sandpaper, some filler, spray paint, patience, and you\u0026#39;re golden.\u003c/p\u003e\n\u003cp\u003eIf it sounds daunting, don\u0026#39;t worry. Luckily, it\u0026#39;s an easy fix, whether you want to take it to a professional and burn some cash, or do this yourself. Some drivers these days like a little DIY to learn a new skill and save some money. It may take more time, but the end result will be worth it. So, let\u0026#39;s go over how to fix the curb rash on your rims.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eMaterials needed for fixing curb rash on black rims\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1899484/fix-curb-rash-black-rims/\" data-post-title=\"How To Fix Curb Rash On Black Rims\" data-slide-num=\"1\" data-post-id=\"1899484\"\u003e\n                                             \u003cpicture id=\"pa73ebcf21ab227687e1f9bdc5e0e9b79\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/how-to-fix-curb-rash-on-black-rims/materials-needed-for-fixing-curb-rash-on-black-rims-1750430006.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/how-to-fix-curb-rash-on-black-rims/materials-needed-for-fixing-curb-rash-on-black-rims-1750430006.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/how-to-fix-curb-rash-on-black-rims/materials-needed-for-fixing-curb-rash-on-black-rims-1750430006.jpg\" data-slide-url=\"https://www.jalopnik.com/1899484/fix-curb-rash-black-rims/\" data-post-id=\"1899484\" data-slide-num=\"1\" data-slide-title=\"How To Fix Curb Rash On Black Rims: Materials needed for fixing curb rash on black rims\" width=\"780\" height=\"438\" alt=\"Materials for reparing car damage\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eGS23/Shutterstock\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eFirst off, let\u0026#39;s assess the damage. Just how bad is it? Scratches and scrapes on the rims are the usual mark of curb rash, concentrated closer to the outer edge where the rim meets the tire. Take your time inspecting each wheel carefully to get an idea of how much damage there is. It can be anywhere from minor surface scratches or scuffed paint to deep cuts and bent rims. Once you know the level of damage you\u0026#39;re working with, it\u0026#39;s time to collect the right tools.\u003c/p\u003e\n\u003cp\u003eEvery situation of curb rash is different, so you may not need all of these:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eVarying grits of sandpaper, from 100 to 320. Some sources even suggest up to 400 grit, but it\u0026#39;s better to have various grit levels to sand and smooth things out.\u003c/li\u003e\n\u003cli\u003eRim cleaning solution isn\u0026#39;t mandatory, but fixing anything is easier with a clean surface.\u003c/li\u003e\n\u003cli\u003eFiller and hardener for any cracks or deep cuts. Putty also works.\u003c/li\u003e\n\u003cli\u003eSpray paint to repaint the rim. For this project, we want black spray paint. Matte finish or semi-gloss, your choice.\u003c/li\u003e\n\u003cli\u003eA rubber mallet in case you have those bent rims we talked about.\u003c/li\u003e\n\u003cli\u003ePainter\u0026#39;s tape to cover up parts we\u0026#39;re not painting,\u003c/li\u003e\n\u003cli\u003eGloves, goggles, and a face mask. \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhether or not you want to pay your auto shop to remove the wheels or leave them on is up to you. Personally, we think taking them off is easier for this project, but you can also leave them on if you want.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eFixing curb rash\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.jalopnik.com/1899484/fix-curb-rash-black-rims/\" data-post-title=\"How To Fix Curb Rash On Black Rims\" data-slide-num=\"2\" data-post-id=\"1899484\"\u003e\n                                             \u003cpicture id=\"p5fff1eeacdfc09eee1054cc9bf507450\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.jalopnik.com/img/gallery/how-to-fix-curb-rash-on-black-rims/fixing-curb-rash-1750429991.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.jalopnik.com/img/gallery/how-to-fix-curb-rash-on-black-rims/fixing-curb-rash-1750429991.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.jalopnik.com/img/gallery/how-to-fix-curb-rash-on-black-rims/fixing-curb-rash-1750429991.jpg\" data-slide-url=\"https://www.jalopnik.com/1899484/fix-curb-rash-black-rims/\" data-post-id=\"1899484\" data-slide-num=\"2\" data-slide-title=\"How To Fix Curb Rash On Black Rims: Fixing curb rash\" width=\"780\" height=\"438\" alt=\"Mechanic spraying black paint on rims\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eTomasz Majchrowicz/Shutterstock\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003col\u003e\n\u003cp\u003eStart by cleaning the wheel with the rim cleaning solution. We want to prepare the rim, so we want to get it clean and then sand it down. 80 to 120 grit is not only versatile, but great for sanding in general, so we can use this to sand down the scuffed areas and even out the metal caught up in the curb rash. Next, if you\u0026#39;re using spot putty, you can squeeze out a small amount and spread it along the damaged area. If using filler, you may need to mix things up a bit to make sure the filler and hardener combine. Then apply and wait for it to dry.\u003c/p\u003e\n\u003cp\u003eAfter the putty/filler dries, it\u0026#39;s back to sanding. We want to sand it down and get it smooth again. 100 grit is a good bet. Don\u0026#39;t worry if you sand off too much, you can always reapply the putty/filter and sand again. Take your time. Go over it again, but increase the sandpaper grit to get this baby looking smooth. If your rims are bent, this would be a good time to put that rubber mallet to use. Take solid but gentle swings to avoid cracking the rims (if they\u0026#39;re made of aluminum).\u003c/p\u003e\n\u003cp\u003eNow comes the paint job. Use painter\u0026#39;s tape to cover an inch or two into the tires, plus the valve stem, lug nets, tire pressure cap, and if you didn\u0026#39;t take the rims off, anything behind the wheel you don\u0026#39;t want to get paint on. Apply the paint to your rims. Multiple coats, again from light to heavy. Using some touch-up paint or a clear coat can also help protect the rims from corrosion if there\u0026#39;s any exposed metal. Think about investing into a rim protector to protect your rims from future curb rash.\u003c/p\u003e\n\u003c/ol\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-06T00:25:00Z",
  "modifiedTime": "2025-07-06T00:25:00Z"
}
