{
  "id": "abb0214c-1aaa-4a4c-8ba7-e42c7ccd3876",
  "title": "Pink G-Wagen Looks Wild Outside And Even Wilder Inside",
  "link": "https://www.carscoops.com/2025/04/carlexs-pink-mercedes-g63-vintage-is-straight-outta-barbie-world/",
  "description": "The tuner made extensive changes inside and out, giving the G-Class a distinctive, if somewhat controversial, character",
  "author": "Brad Anderson",
  "published": "Sat, 05 Apr 2025 00:16:00 +0000",
  "source": "https://www.carscoops.com/feed/",
  "categories": [
    "news",
    "Carlex",
    "Galleries",
    "Mercedes",
    "Mercedes AMG",
    "Mercedes G-Class",
    "Tuning"
  ],
  "byline": "Brad Anderson",
  "length": 3525,
  "excerpt": "The tuner made extensive changes inside and out, giving the G-Class a distinctive, if somewhat controversial, character",
  "siteName": "Carscoops",
  "favicon": "https://www.carscoops.com/wp-content/uploads/2022/12/apple-icon-152x152-1.png",
  "text": "The tuner made extensive changes inside and out, giving the G-Class a distinctive, if somewhat controversial, character April 4, 2025 at 20:16 by Brad Anderson Carlex gives the Mercedes G-Class a retro twist with chrome accents and custom bodywork. The customized interior features pink leather, Alcantara, and subtle white contrast elements. The Mercedes-Benz G-Class has always had a way of turning heads, but that hasn’t stopped aftermarket tuners from trying to make it even more of a spectacle. Last year, Carlex Design joined the mix with its line of ‘Vintage’ G-Wagens, giving the modern off-roader a distinctly retro twist. This example, painted in a soft pink, might not be for everyone, but the surprisingly subtle execution makes it work better than you’d expect. Read: Carlex Can Build You A One-Off Mercedes G-Wagen Like This Known simply as the Carlex Rose Vintage, this special edition sports a unique body kit that’s refreshingly restrained compared to many of the wilder G-Class conversions out there. That’s a welcome change. The G-Wagen already commands plenty of attention on its own, and some of those oversized tuner kits do little more than shout for the sake of shouting. The front of the G-Class Vintage comes with a chrome bumper and push bar alongside a new grille and the firm’s own logo in place of the three-pointed star. Flared wheel arches are also standard, while the rear sports a chrome bumper. Two-Tone Throwback The paint scheme is where things really start to stand out. The lower half of the body is painted in a soft shade of pink, while the upper half in white. There is also a set of retro wheels with pink centers, chrome spokes, and whitewall tires. Carlex’s spare wheel carrier completes the new design, perfectly mimicking the shape and finish of the actual wheels. Inside the Barbie Dream Cabin Of course, Carlex didn’t stop at the paint. If the exterior alone wasn’t enough to make you feel like you’re living in Barbie world, the interior surely will. Pink leather, which perfectly matches the hue of the exterior, now covers almost all interior surfaces, including the seats, steering wheel, dashboard, door panels, and even the trunk lining. Other cabin highlights include pink Alcantara on the headliner, white contrast stitching, and some subtle white leather on the center console. So, is a pastel-pink, retro-themed Mercedes-Benz G-Wagen like this your thing, or would you stick with the understated menace of a factory-spec version? And if you prefer the tuner’s creation, would you go for this pink shade or something more ubiquitous? Let us know in the comments below.",
  "image": "https://www.carscoops.com/wp-content/uploads/2025/04/Carlex-Rose-Vintage-4rf3dfsw2wre.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-3182981\"\u003e\n            \n            \u003carticle\u003e\n                \u003cdiv\u003e\n                    \u003cheader\u003e\n                        \n                        \u003cp\u003e\n                            The tuner made extensive changes inside and out, giving the G-Class a distinctive, if somewhat controversial, character                        \u003c/p\u003e\n                        \u003cdiv\u003e\n                            \n                            \u003cp\u003eApril 4, 2025 at 20:16\u003c/p\u003e\n                            \u003cp\u003e\u003ca href=\"#thread__container\"\u003e\n\n                                \u003cimg width=\"24px\" loading=\"lazy\" height=\"22px\" alt=\"comments\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/msg.png\"/\u003e \n                                \n                            \u003c/a\u003e\u003c/p\u003e\n                        \u003c/div\u003e\n                        \u003cdiv\u003e\n                            \n                                                                                    \n                            \u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://www.carscoops.com/wp-content/uploads/webp/2025/04/Carlex-Rose-Vintage-4rf3dfsw2wre.webp 1920w, https://www.carscoops.com/wp-content/uploads/webp/2025/04/Carlex-Rose-Vintage-4rf3dfsw2wre-400x225.webp 400w, https://www.carscoops.com/wp-content/uploads/webp/2025/04/Carlex-Rose-Vintage-4rf3dfsw2wre-1024x576.webp 1024w, https://www.carscoops.com/wp-content/uploads/webp/2025/04/Carlex-Rose-Vintage-4rf3dfsw2wre-768x432.webp 768w, https://www.carscoops.com/wp-content/uploads/webp/2025/04/Carlex-Rose-Vintage-4rf3dfsw2wre-1536x864.webp 1536w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\"/\u003e\u003cimg src=\"https://www.carscoops.com/wp-content/uploads/2025/04/Carlex-Rose-Vintage-4rf3dfsw2wre-1024x576.jpg\" srcset=\"https://www.carscoops.com/wp-content/uploads/2025/04/Carlex-Rose-Vintage-4rf3dfsw2wre.jpg 1920w, https://www.carscoops.com/wp-content/uploads/2025/04/Carlex-Rose-Vintage-4rf3dfsw2wre-400x225.jpg 400w, https://www.carscoops.com/wp-content/uploads/2025/04/Carlex-Rose-Vintage-4rf3dfsw2wre-1024x576.jpg 1024w, https://www.carscoops.com/wp-content/uploads/2025/04/Carlex-Rose-Vintage-4rf3dfsw2wre-768x432.jpg 768w, https://www.carscoops.com/wp-content/uploads/2025/04/Carlex-Rose-Vintage-4rf3dfsw2wre-1536x864.jpg 1536w\" sizes=\"(min-width: 1300px) 832px, (min-width: 1055px) calc(100vw - 372px), 100vw\" alt=\" Pink G-Wagen Looks Wild Outside And Even Wilder Inside\" width=\"1920\" height=\"1080\"/\u003e\u003c/picture\u003e                        \u003c/div\u003e\n                        \n                        \u003cp\u003e\n                            \u003ch4\u003e\n                                by \u003ca href=\"https://www.carscoops.com/author/bradcarscoops-com/\"\u003e\u003cspan\u003eBrad Anderson\u003c/span\u003e\u003c/a\u003e\n                            \u003c/h4\u003e    \n                        \u003c/p\u003e\n                    \u003c/header\u003e\n\n                    \u003cdiv\u003e\n                        \n                        \n                        \n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eCarlex gives the Mercedes G-Class a retro twist with chrome accents and custom bodywork.\u003c/li\u003e\n\n\n\n\u003cli\u003eThe customized interior features pink leather, Alcantara, and subtle white contrast elements.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003eThe Mercedes-Benz G-Class has always had a way of turning heads, but that hasn’t stopped aftermarket tuners from trying to make it even more of a spectacle. Last year, Carlex Design joined the \u003ca href=\"https://www.carscoops.com/2024/09/carlex-showcases-first-three-mercedes-g-vintage-builds-with-a-retro-vibe/\"\u003emix with its line of ‘Vintage’ G-Wagens\u003c/a\u003e, giving the modern off-roader a distinctly retro twist. \u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eThis example, painted in a soft pink, might not be for everyone, but the surprisingly subtle execution makes it work better than you’d expect.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eRead: \u003ca href=\"https://www.carscoops.com/2025/01/carlex-can-build-you-a-one-off-mercedes-g-wagen-like-this/\"\u003eCarlex Can Build You A One-Off Mercedes G-Wagen Like This\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eKnown simply as the \u003ca href=\"https://www.carscoops.com/tag/carlex/\"\u003eCarlex\u003c/a\u003e Rose Vintage, this special edition sports a unique body kit that’s refreshingly restrained compared to many of the wilder G-Class conversions out there. That’s a welcome change. The G-Wagen already commands plenty of attention on its own, and some of those oversized tuner kits do little more than shout for the sake of shouting.\u003c/p\u003e\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n\n\u003cp\u003eThe front of the G-Class Vintage comes with a chrome bumper and push bar alongside a new grille and the firm’s own logo in place of the three-pointed star. Flared wheel arches are also standard, while the rear sports a chrome bumper.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eTwo-Tone Throwback\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe paint scheme is where things really start to stand out. The lower half of the body is painted in a soft shade of pink, while the upper half in white. There is also a set of retro wheels with pink centers, chrome spokes, and whitewall tires. Carlex’s spare wheel carrier completes the new design, perfectly mimicking the shape and finish of the actual wheels.\u003c/p\u003e\n\n\n\n                            \u003cdiv\u003e\n                \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" alt=\"\" data-src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" data-type=\"inarticle-image\"/\u003e\u003c/p\u003e\n                \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" alt=\"\" data-src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" data-type=\"inarticle-image\"/\u003e\u003c/p\u003e\n            \u003c/div\u003e\n                     \n\n\n\n\u003cp\u003e\u003cstrong\u003eInside the Barbie Dream Cabin\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eOf course, Carlex didn’t stop at the paint. If the exterior alone wasn’t enough to make you feel like you’re living in Barbie world, the interior surely will. Pink leather, which perfectly matches the hue of the exterior, now covers almost all interior surfaces, including the seats, steering wheel, dashboard, door panels, and even the trunk lining. Other cabin highlights include pink Alcantara on the headliner, white contrast stitching, and some subtle white leather on the center console.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eSo, is a pastel-pink, retro-themed \u003ca href=\"https://www.carscoops.com/tag/mercedes/\"\u003eMercedes-Benz\u003c/a\u003e G-Wagen like this your thing, or would you stick with the understated menace of a factory-spec version? And if you prefer the tuner’s creation, would you go for this pink shade or something more ubiquitous? Let us know in the comments below.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n                            \u003cdiv\u003e\n                \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" alt=\"\" data-src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" data-type=\"inarticle-image\"/\u003e\u003c/p\u003e\n                \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" alt=\"\" data-src=\"https://www.carscoops.com/wp-content/themes/carscoops/assets/images/icons/arrow.png\" data-type=\"inarticle-image\"/\u003e\u003c/p\u003e\n            \u003c/div\u003e\n                     \n\n                        \n                    \u003c/div\u003e\n\n                    \n                                        \n                    \n                \u003c/div\u003e\n                                \n                                \n                \n            \u003c/article\u003e\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-04T20:16:00-04:00",
  "modifiedTime": "2025-04-04T23:40:41Z"
}
