{
  "id": "bb2df2e8-a29b-4d94-b10f-707f864d786f",
  "title": "Is Rustproofing Still Worth It For Modern Cars?",
  "link": "https://www.jalopnik.com/1872917/is-rustproofing-still-worth-it-modern-cars/",
  "description": "Rustproofing cars used to be big business, but automakers upped their games and the rustproofing industry dwindled. Is rustproofing still worth it today?",
  "author": "Charles Krome",
  "published": "Sat, 31 May 2025 22:25:00 +0000",
  "source": "https://jalopnik.com/rss",
  "categories": [
    "Wrenching"
  ],
  "byline": "Charles Krome",
  "length": 3817,
  "excerpt": "Rustproofing cars used to be big business, but automakers upped their games and the rustproofing industry dwindled. Is rustproofing still worth it today?",
  "siteName": "Jalopnik",
  "favicon": "https://www.jalopnik.com/img/jalopnik-favicon.png",
  "text": "Unscrupulous auto dealers trying to aggressively push rustproofing is generally thought of to be a scam nowadays. Even the folks at Consumer Reports recommend skipping it. Well, I'm not going to contradict those experts, but I will say that, like much in life, the decision about whether to rustproof a modern car comes down to timing. You can think of it this way: Most new cars today come straight from the factory with enough rust protection for automakers to provide multiple years and tens of thousands of miles of warranty coverage against the issue. Companies wouldn't risk the expense of paying for rust damage if they didn't think their cars were well-protected against it. The impact of high warranty costs can be a killer for a company's financial reports.  On the other hand, the warranty coverage doesn't last forever, and that's because neither do the manufacturers' rustproofing materials. They can be compromised over time by wear and tear and other damage. That's why aftermarket rustproofing does make sense for modern cars that have had their current layer of protection broken, whether it's by sudden damage or simply the effect of time on the road. Getting salty about rust and corrosion To explain, it's going to be helpful to look at how rust and rustproofing work. Rust is the result of a chemical reaction between iron (used in the steel to make vehicles), water, and oxygen, and it can begin as soon as a drop of water hits your car's bare metal.  You'll probably notice that I didn't include salt in that recipe, which is because salt does not actually cause rust. What the salt does is act as a catalyst to the reaction. Now, I flunked chemistry in high school, but it's something about ions and electrons. In the end then, salt doesn't make rust, but it makes rust happen much more quickly. The point is that rustproofing is all about putting barriers, physical and chemical, between the metal and the environment. Galvanization is a great example. Invented by the French engineer Stanislas Sorel, the process was patented in 1836 and involves coating steel with zinc, which acts as a the barrier material against the rust reaction. True, automakers didn't really start using galvanized steel until the late 1980s, but it's become a core weapon in the battle against rusty cars. Needless to say, cars from the pre-galvanization era can benefit big time from modern rustproofing. The bottom line about buying aftermarket rustproofing Let's review, shall we? Preventing rust means preventing the environment from reaching unprotected steel, and automakers believe their own rustproofing, anchored by galvanization, will do the job for a guaranteed number of miles or years on the road. It's also important to realize there are many ways you can void your warranty before its term runs out.  Let's say you take your brand-new luxury sedan from the showroom to your local rock-crawling trail, and you bang up the undercarriage. That could cancel your warranty for \"misuse\" at the same time you need it most, because you may have caused cracks/chips that expose the car's metal to rain and salt. In that situation, aftermarket rustproofing is essentially replacing the damaged factory protection. And that's the key right there: Modern rustproofing is great, but it doesn't last forever, and as Neil Young likes to say, rust never sleeps. (This is where I was going to include a joke about getting lockjaw from a rusty car, but here's a public service announcement: Rusty metal does not in fact cause tetanus. Now you know!)",
  "image": "https://www.jalopnik.com/img/gallery/is-rustproofing-still-worth-it-for-modern-cars/l-intro-1748545211.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                \n                \n\u003cp dir=\"ltr\"\u003eUnscrupulous auto dealers trying to aggressively push rustproofing is generally thought of to be a scam nowadays. Even the folks at Consumer Reports recommend skipping it. Well, I\u0026#39;m not going to contradict those experts, but I will say that, like much in life, the decision about whether to rustproof a modern car comes down to timing.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eYou can think of it this way: Most new cars today come straight from the factory with enough rust protection for automakers to provide multiple years and tens of thousands of miles of warranty coverage against the issue. Companies wouldn\u0026#39;t risk the expense of paying for rust damage if they didn\u0026#39;t think their cars were well-protected against it. \u003ca href=\"https://www.jalopnik.com/ford-s-warranty-costs-rose-800-million-in-the-second-q-1851604656/\" target=\"_blank\"\u003eThe impact of high warranty costs can be a killer for a company\u0026#39;s financial reports.\u003c/a\u003e \u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eOn the other hand, the warranty coverage doesn\u0026#39;t last forever, and that\u0026#39;s because neither do the manufacturers\u0026#39; rustproofing materials. They can be compromised over time by wear and tear and other damage. That\u0026#39;s why aftermarket rustproofing does make sense for modern cars that have had their current layer of protection broken, whether it\u0026#39;s by sudden damage or simply the effect of time on the road.\u003c/p\u003e\n\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eGetting salty about rust and corrosion\u003c/h2\u003e\n                                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eTo explain, it\u0026#39;s going to be helpful to look at how rust and rustproofing work. Rust is the result of a chemical reaction between iron (used in the steel to make vehicles), water, and oxygen, and it can begin as soon as a drop of water hits your car\u0026#39;s bare metal. \u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eYou\u0026#39;ll probably notice that I didn\u0026#39;t include salt in that recipe, which is because salt does not actually cause rust. What the salt does is act as a catalyst to the reaction. Now, I flunked chemistry in high school, but it\u0026#39;s something about ions and electrons. In the end then, salt doesn\u0026#39;t make rust, but it makes rust happen much more quickly. The point is that rustproofing is all about putting barriers, physical and chemical, between the metal and the environment.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eGalvanization is a great example. Invented by the French engineer Stanislas Sorel, the process was patented in 1836 and involves coating steel with zinc, which acts as a the barrier material against the rust reaction. True, automakers didn\u0026#39;t really start using galvanized steel until the late 1980s, but it\u0026#39;s become a core weapon in the battle against rusty cars. Needless to say, \u003ca href=\"https://www.jalopnik.com/how-i-got-my-car-professionally-undercoated-and-injecte-1848173258/\" target=\"_blank\"\u003ecars from the pre-galvanization era can benefit big time from modern rustproofing\u003c/a\u003e.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eThe bottom line about buying aftermarket rustproofing\u003c/h2\u003e\n                                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eLet\u0026#39;s review, shall we? Preventing rust means preventing the environment from reaching unprotected steel, and automakers believe their own rustproofing, anchored by galvanization, will do the job for a guaranteed number of miles or years on the road. It\u0026#39;s also important to realize there are many ways you can void your warranty before its term runs out. \u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eLet\u0026#39;s say you take your brand-new luxury sedan from the showroom to your local rock-crawling trail, and you bang up the undercarriage. That could cancel your warranty for \u0026#34;misuse\u0026#34; at the same time you need it most, because you may have caused cracks/chips that expose the car\u0026#39;s metal to rain and salt. In that situation, aftermarket rustproofing is essentially replacing the damaged factory protection. And that\u0026#39;s the key right there: Modern rustproofing is great, but it doesn\u0026#39;t last forever, and as Neil Young likes to say, rust never sleeps.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e(This is where I was going to include a joke about getting lockjaw from a rusty car, but here\u0026#39;s a public service announcement: \u003ca href=\"https://share.upmc.com/2022/08/is-rust-harmful-to-skin/\" target=\"_blank\"\u003eRusty metal does not in fact cause tetanus\u003c/a\u003e. Now you know!)\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-31T22:25:00Z",
  "modifiedTime": "2025-05-31T22:25:00Z"
}
