{
  "id": "d01ba09b-46b4-4b1a-bc1c-a2c15e5647a7",
  "title": "2025 Tata Tigor gets 360-degree camera, bigger infotainment screen",
  "link": "https://www.autocarindia.com/car-news/2025-tata-tigor-gets-360-degree-camera-bigger-infotainment-screen-434107#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "The 2025 Tata Tigor has been launched at Rs 5.99 lakh. Tata Motors' answer to the recently updated Dzire and Amaze, the Tigor, features mild styling tweaks, additional features, and tech in some variants. There are no mechanical changes for the 2025 model, meaning the compact sedan continues with the 1.2-litre petrol engine, along with a petrol-CNG option. Prices for the Tigor CNG start at Rs 7.70 lakh. The 2025 Tigor gets two new colour options It gets 10.25-inch infotainment screen, 360-degree camera It comes with a new interior shade, more creature comforts 2025 Tata Tigor features, tech details The 2025 Tigor, like the refreshed Tiago and the 2025 Nexon, gets mild styling tweaks on the outside. The grille and front bumper get minor design updates, and some variants feature a small bootlid spoiler. The alloy wheel design remains the same, but the hyperstyle wheel has an altered look. The interior theme is new, and all variants now come with the new illuminated steering wheel, with a dual-tone leather finish in higher trims. As for variant upgrades, the 2025 Tigor XT, priced at Rs 6.70 lakh, gets a 3.5-inch music system display, steering-mounted controls, follow-me-home headlamps, and other features. The Tigor XT CNG starts at Rs 7.70 lakh. The new Tigor XZ is priced at Rs 7.30 lakh for the petrol variant and gets LED headlamps with daytime running lamps, 15-inch hyperstyle wheels, individual front armrests, ESP, Hill Hold Control, a 7-inch infotainment screen with a reverse parking camera, as well as wired Android Auto and Apple CarPlay. The Tigor XZ CNG starts at Rs 8.30 lakh. The Tigor XZ+ comes with a freestanding 10.25-inch infotainment screen with an HD reverse camera, wireless Android Auto and Apple CarPlay, and a 4-inch digital instrument display. This variant is priced at Rs 7.90 lakh for the petrol version and Rs 8.90 lakh for the CNG. The top-spec 2025 Tigor XZ+ Lux gets all the new features of the XZ+ and adds a 360-degree camera, 15-inch alloy wheels, and rear A- and C-type charging ports. Prices for the Tigor XZ+ start at Rs 8.50 lakh for the petrol and Rs 9.50 lakh for the CNG. While Tata Motors has updated the Tigor and the Tigor CNG for 2025, there is no news on the Tigor EV getting any updates at the moment. Source",
  "author": "Akbar Merchant",
  "published": "Sat, 11 Jan 2025 09:00:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Akbar Merchant",
  "length": 2357,
  "excerpt": "The 2025 Tata Tigor also gets mild styling tweaks, additional features, and two new colours.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "The 2025 Tata Tigor also gets mild styling tweaks, additional features, and two new colours.The 2025 Tata Tigor has been launched at Rs 5.99 lakh. Tata Motors' answer to the recently updated Dzire and Amaze, the Tigor, features mild styling tweaks, additional features, and tech in some variants. There are no mechanical changes for the 2025 model, meaning the compact sedan continues with the 1.2-litre petrol engine, along with a petrol-CNG option. Prices for the Tigor CNG start at Rs 7.70 lakh.The 2025 Tigor gets two new colour optionsIt gets 10.25-inch infotainment screen, 360-degree cameraIt comes with a new interior shade, more creature comforts2025 Tata Tigor features, tech detailsThe 2025 Tigor, like the refreshed Tiago and the 2025 Nexon, gets mild styling tweaks on the outside. The grille and front bumper get minor design updates, and some variants feature a small bootlid spoiler. The alloy wheel design remains the same, but the hyperstyle wheel has an altered look. The interior theme is new, and all variants now come with the new illuminated steering wheel, with a dual-tone leather finish in higher trims.As for variant upgrades, the 2025 Tigor XT, priced at Rs 6.70 lakh, gets a 3.5-inch music system display, steering-mounted controls, follow-me-home headlamps, and other features. The Tigor XT CNG starts at Rs 7.70 lakh.The new Tigor XZ is priced at Rs 7.30 lakh for the petrol variant and gets LED headlamps with daytime running lamps, 15-inch hyperstyle wheels, individual front armrests, ESP, Hill Hold Control, a 7-inch infotainment screen with a reverse parking camera, as well as wired Android Auto and Apple CarPlay. The Tigor XZ CNG starts at Rs 8.30 lakh.The Tigor XZ+ comes with a freestanding 10.25-inch infotainment screen with an HD reverse camera, wireless Android Auto and Apple CarPlay, and a 4-inch digital instrument display. This variant is priced at Rs 7.90 lakh for the petrol version and Rs 8.90 lakh for the CNG.The top-spec 2025 Tigor XZ+ Lux gets all the new features of the XZ+ and adds a 360-degree camera, 15-inch alloy wheels, and rear A- and C-type charging ports. Prices for the Tigor XZ+ start at Rs 8.50 lakh for the petrol and Rs 9.50 lakh for the CNG.While Tata Motors has updated the Tigor and the Tigor CNG for 2025, there is no news on the Tigor EV getting any updates at the moment. Source",
  "image": "https://cdni.autocarindia.com/ExtraImages/20250110054059_TIGORX1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eThe 2025 Tata Tigor also gets mild styling tweaks, additional features, and two new colours.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe 2025 Tata Tigor has been launched at Rs 5.99 lakh. \u003ca href=\"https://www.autocarindia.com/cars/tata\"\u003e\u003cstrong\u003eTata Motors\u003c/strong\u003e\u003c/a\u003e\u0026#39; answer to the recently updated Dzire and Amaze, the Tigor, features mild styling tweaks, additional features, and tech in some variants. There are no mechanical changes for the 2025 model, meaning the compact sedan continues with the 1.2-litre petrol engine, along with a petrol-CNG option. Prices for the Tigor CNG start at Rs 7.70 lakh.\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eThe 2025 Tigor gets two new colour options\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eIt gets 10.25-inch infotainment screen, 360-degree camera\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eIt comes with a new interior shade, more creature comforts\u003c/strong\u003e\u003c/li\u003e\u003c/ul\u003e\u003ch2\u003e\u003cspan\u003e2025 Tata Tigor features, tech details\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eThe \u003ca href=\"https://www.autocarindia.com/cars/tata/tigor\"\u003e\u003cstrong\u003e2025 Tigor\u003c/strong\u003e\u003c/a\u003e, like the \u003ca href=\"https://www.autocarindia.com/car-news/tata-tiago-tiago-ev-get-bigger-infotainment-screen-more-features-for-2025-434106\"\u003e\u003cstrong\u003erefreshed Tiago\u003c/strong\u003e\u003c/a\u003e and the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/car-news/2025-tata-nexon-gets-a-variant-rejig-more-features-434110\"\u003e2025 Nexon\u003c/a\u003e\u003c/strong\u003e, gets mild styling tweaks on the outside. The grille and front bumper get minor design updates, and some variants feature a small bootlid spoiler. The alloy wheel design remains the same, but the hyperstyle wheel has an altered look. The interior theme is new, and all variants now come with the new illuminated steering wheel, with a dual-tone leather finish in higher trims.\u003c/p\u003e\u003cp\u003eAs for variant upgrades, the 2025 Tigor XT, priced at Rs 6.70 lakh, gets a 3.5-inch music system display, steering-mounted controls, follow-me-home headlamps, and other features. The Tigor XT CNG starts at Rs 7.70 lakh.\u003c/p\u003e\u003cp\u003eThe new Tigor XZ is priced at Rs 7.30 lakh for the petrol variant and gets LED headlamps with daytime running lamps, 15-inch hyperstyle wheels, individual front armrests, ESP, Hill Hold Control, a 7-inch infotainment screen with a reverse parking camera, as well as wired Android Auto and Apple CarPlay. The Tigor XZ CNG starts at Rs 8.30 lakh.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/TIGOR3.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eThe Tigor XZ+ comes with a freestanding 10.25-inch infotainment screen with an HD reverse camera, wireless Android Auto and Apple CarPlay, and a 4-inch digital instrument display. This variant is priced at Rs 7.90 lakh for the petrol version and Rs 8.90 lakh for the CNG.\u003c/p\u003e\u003cp\u003eThe top-spec 2025 Tigor XZ+ Lux gets all the new features of the XZ+ and adds a 360-degree camera, 15-inch alloy wheels, and rear A- and C-type charging ports. Prices for the Tigor XZ+ start at Rs 8.50 lakh for the petrol and Rs 9.50 lakh for the CNG.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eWhile Tata Motors has updated the Tigor and the Tigor CNG for 2025, there is no news on the Tigor EV getting any updates at the moment.\u003c/p\u003e\u003cp\u003e  \u003ca href=\"https://x.com/MotorArenaIndia\"\u003e\u003cstrong\u003eSource\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-11T09:00:00+05:30",
  "modifiedTime": null
}
