{
  "id": "dd333c52-9eaa-4573-934c-96f4d6e96cf2",
  "title": "Formula E: Rowland wins title at Berlin; Mahindra on podium",
  "link": "https://www.autocarindia.com/motor-sports-news/formula-e-rowland-wins-title-at-berlin-mahindra-on-podium-436155#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "Nissan driver Oliver Rowland was crowned 2025 Formula E champion at the Berlin E-Prix, with two rounds still to go. The title battle was prolonged to the second Berlin race after Rowland retired on Saturday, while his prime rival Pascal Wehrlein finished P2. However, Sunday’s race saw a reversal of fortune. Wehrlein didn’t score any points in the race, leaving the door open for Rowland to clinch the title with a P4 finish. Berlin also ended up being a strong round for two Indian-backed teams – Jaguar TCS Racing and Mahindra Racing. Rowland wraps up title with 59 point lead over Wehrlein Jaguar wins both races Mahindra third in Race 1 Berlin E Prix: Nissan’s Rowland seals 2025 Formula E title Porsche leads Teams’ championship. Not only did Rowland retire from a wet race on Saturday but he was also handed a five-place grid penalty for causing a collision with Maserati’s Stoffel Vandoorne. He started Sunday’s race from eighth on the grid, while Wehrlein started from pole. In fact, Wehrlein was leading till Lap 29 of 41, but started losing ground during the Attack Mode activations. While those around him opted to use their first Attack Mode activation for four minutes, Wehrlein used it for just two minutes. He slipped out of the points as a result and ended up finishing P16. Rowland, meanwhile, pulled off some key moves to finish P4 – enough for him to seal the title with two rounds still to go. “After a tough day yesterday, I approached the race thinking about limiting the potential damage to my lead, but that strategy almost never works in Formula E, especially in this kind of race. So in the end, I trusted myself and focused on delivering the best possible performance, and it paid off,” explained Rowland. “Since I came back, Nissan created an environment which I can thrive in, and this is the perfect fairytale. The whole team has worked tirelessly and delivered to the highest standard, and I would like to thank each and every one of them for their amazing effort throughout this campaign,” he added. While the drivers’ title is wrapped up, the battle is very much on in the teams’ championship. Porsche currently leads the standings, 23 points ahead of Nissan. Berlin E Prix: Jaguar scores double victory Evans, Cassidy win a race each. Jaguar took a clean sweep at Berlin, with both Mitch Evans and Nick Cassidy winning a race each. Evans controlled Saturday’s race from the very start and even built a lead of over five seconds before a late Safety Car wiped out his advantage. Nevertheless, he held on to score his first win (and points) since the season-opening Sao Paulo E-Prix. Cassidy took a specular win on Sunday, battling his way up from 20th on the grid. The Kiwi has scored more points than any other driver in the last eight races (92 points, precisely), and moves up to fifth in the standings as a result. Berlin E Prix: Mahindra on podium Mortara clinches back-to-back podiums. Mahindra Racing continued its strong form, scoring back-to-back podium results. Edoardo Mortara secured his first podium finish of the season at the Jakarta E-Prix, and he followed it up with a P3 finish at the first Berlin race. He made a strong start in Race 2, but the Safety Car came out just as he took his first Attack Mode activation, hampering his strategy. He clawed back towards the top 10, but ended up finishing P11 after making contact in the closing laps. 2022 F2 champion Felipe Drugovich, meanwhile, was called in to replace Nyck de Vries, who was competing in the 6 Hours of Sao Paulo. He finished his debut race P17 after a number of setbacks, including a drive-through penalty for a gearbox change. But he bounced back in Race 2, going from P19 to P7 to score his first points in Formula E. Mahindra is now sixth in the teams’ championship, just one point behind McLaren and 20 points behind Jaguar. Reflecting on the weekend, Mahindra Racing CEO and team principal Frederic Bertrand said, “The weekend as a whole has been another promising one for the team – another podium, points on debut for Felipe and we will go to London with a chance of finishing in the top five in the World Championship, which has been the goal all season.” He added, “We have two weeks now to reset and get ready for the season finale in London. I’m sure it will be dramatic as always, but we will bring our ‘A game’ to make sure we end what has been a promising season on a high note.” Formula E will now head to London for the last two races of the season on July 26 and 27. 2025 Berlin E Prix Round 13 results 2025 Berlin E Prix Round 13 resultsPosDriverTeam1Mitch EvansJaguar2Pascal WehrleinPorsche3Edoardo MortaraMahindra Racing4Taylor BarnardMcLaren5Nick CassidyJaguar6Max GuentherDS Penske7Sebastien BuemiEnvision Racing8Nico MuellerAndretti9Dan TicktumCupra Kiro10Antonio Felix da CostaPorsche11Sam BirdMcLaren12Stoffel VandoorneMaserati13Robin FrijnsEnvision Racing14Jake HughesMaserati15Sergio Sette CamaraNissan16Zane MaloneyLola Yamaha ABT17Felipe DrugovichMahindra Racing18Lucas di GrassiLola Yamaha ABTNCOliver RowlandNissanNCJean-Eric VergneDS PenskeNCDavid BeckmannCupra KiroNCJake DennisAndretti 2025 Berlin E Prix Round 14 results 2025 Berlin E Prix Round 14 resultsPosDriverTeam1Nick CassidyJaguar2Jake DennisAndretti3Jean-Eric VergneDS Penske4Oliver RowlandNissan5Mitch EvansJaguar6Taylor BarnardMcLaren7Felipe DrugovichMahindra Racing8Antonio Felix da CostaPorsche9Sergio Sette CamaraNissan10Jake HughesMaserati11Edoardo MortaraMahindra Racing12Lucas di GrassiLola Yamaha ABT13Stoffel VandoorneMaserati14Dan TicktumCupra Kiro15Pascal WehrleinPorsche16David BeckmannCupra Kiro17Nico MuellerAndretti18Zane MaloneyLola Yamaha ABTNCRobin FrijnsEnvision RacingNCMax GuentherDS PenskeNCSam BirdMcLarenNCSebastien BuemiEnvision Racing Also see: 2025 Formula E: Mahindra Racing on podium at Jakarta E Prix",
  "author": "Unnatee Gidithuri",
  "published": "Mon, 14 Jul 2025 16:26:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Unnatee  Gidithuri",
  "length": 5927,
  "excerpt": "Jaguar\u0026amp;#8217;s Evans and Cassidy scored a win each at Berlin, as Nissan driver Rowland wrapped up the championship early.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "Jaguar’s Evans and Cassidy scored a win each at Berlin, as Nissan driver Rowland wrapped up the championship early.Nissan driver Oliver Rowland was crowned 2025 Formula E champion at the Berlin E-Prix, with two rounds still to go. The title battle was prolonged to the second Berlin race after Rowland retired on Saturday, while his prime rival Pascal Wehrlein finished P2.However, Sunday’s race saw a reversal of fortune. Wehrlein didn’t score any points in the race, leaving the door open for Rowland to clinch the title with a P4 finish. Berlin also ended up being a strong round for two Indian-backed teams – Jaguar TCS Racing and Mahindra Racing.Rowland wraps up title with 59 point lead over WehrleinJaguar wins both racesMahindra third in Race 1Berlin E Prix: Nissan’s Rowland seals 2025 Formula E titlePorsche leads Teams’ championship.Not only did Rowland retire from a wet race on Saturday but he was also handed a five-place grid penalty for causing a collision with Maserati’s Stoffel Vandoorne. He started Sunday’s race from eighth on the grid, while Wehrlein started from pole.In fact, Wehrlein was leading till Lap 29 of 41, but started losing ground during the Attack Mode activations. While those around him opted to use their first Attack Mode activation for four minutes, Wehrlein used it for just two minutes. He slipped out of the points as a result and ended up finishing P16.Rowland, meanwhile, pulled off some key moves to finish P4 – enough for him to seal the title with two rounds still to go. “After a tough day yesterday, I approached the race thinking about limiting the potential damage to my lead, but that strategy almost never works in Formula E, especially in this kind of race. So in the end, I trusted myself and focused on delivering the best possible performance, and it paid off,” explained Rowland.“Since I came back, Nissan created an environment which I can thrive in, and this is the perfect fairytale. The whole team has worked tirelessly and delivered to the highest standard, and I would like to thank each and every one of them for their amazing effort throughout this campaign,” he added.While the drivers’ title is wrapped up, the battle is very much on in the teams’ championship. Porsche currently leads the standings, 23 points ahead of Nissan.Berlin E Prix: Jaguar scores double victoryEvans, Cassidy win a race each.Jaguar took a clean sweep at Berlin, with both Mitch Evans and Nick Cassidy winning a race each. Evans controlled Saturday’s race from the very start and even built a lead of over five seconds before a late Safety Car wiped out his advantage. Nevertheless, he held on to score his first win (and points) since the season-opening Sao Paulo E-Prix.Cassidy took a specular win on Sunday, battling his way up from 20th on the grid. The Kiwi has scored more points than any other driver in the last eight races (92 points, precisely), and moves up to fifth in the standings as a result.Berlin E Prix: Mahindra on podiumMortara clinches back-to-back podiums.Mahindra Racing continued its strong form, scoring back-to-back podium results. Edoardo Mortara secured his first podium finish of the season at the Jakarta E-Prix, and he followed it up with a P3 finish at the first Berlin race.He made a strong start in Race 2, but the Safety Car came out just as he took his first Attack Mode activation, hampering his strategy. He clawed back towards the top 10, but ended up finishing P11 after making contact in the closing laps.2022 F2 champion Felipe Drugovich, meanwhile, was called in to replace Nyck de Vries, who was competing in the 6 Hours of Sao Paulo. He finished his debut race P17 after a number of setbacks, including a drive-through penalty for a gearbox change. But he bounced back in Race 2, going from P19 to P7 to score his first points in Formula E.Mahindra is now sixth in the teams’ championship, just one point behind McLaren and 20 points behind Jaguar. Reflecting on the weekend, Mahindra Racing CEO and team principal Frederic Bertrand said, “The weekend as a whole has been another promising one for the team – another podium, points on debut for Felipe and we will go to London with a chance of finishing in the top five in the World Championship, which has been the goal all season.”He added, “We have two weeks now to reset and get ready for the season finale in London. I’m sure it will be dramatic as always, but we will bring our ‘A game’ to make sure we end what has been a promising season on a high note.”Formula E will now head to London for the last two races of the season on July 26 and 27.2025 Berlin E Prix Round 13 results2025 Berlin E Prix Round 13 resultsPosDriverTeam1Mitch EvansJaguar2Pascal WehrleinPorsche3Edoardo MortaraMahindra Racing4Taylor BarnardMcLaren5Nick CassidyJaguar6Max GuentherDS Penske7Sebastien BuemiEnvision Racing8Nico MuellerAndretti9Dan TicktumCupra Kiro10Antonio Felix da CostaPorsche11Sam BirdMcLaren12Stoffel VandoorneMaserati13Robin FrijnsEnvision Racing14Jake HughesMaserati15Sergio Sette CamaraNissan16Zane MaloneyLola Yamaha ABT17Felipe DrugovichMahindra Racing18Lucas di GrassiLola Yamaha ABTNCOliver RowlandNissanNCJean-Eric VergneDS PenskeNCDavid BeckmannCupra KiroNCJake DennisAndretti2025 Berlin E Prix Round 14 results2025 Berlin E Prix Round 14 resultsPosDriverTeam1Nick CassidyJaguar2Jake DennisAndretti3Jean-Eric VergneDS Penske4Oliver RowlandNissan5Mitch EvansJaguar6Taylor BarnardMcLaren7Felipe DrugovichMahindra Racing8Antonio Felix da CostaPorsche9Sergio Sette CamaraNissan10Jake HughesMaserati11Edoardo MortaraMahindra Racing12Lucas di GrassiLola Yamaha ABT13Stoffel VandoorneMaserati14Dan TicktumCupra Kiro15Pascal WehrleinPorsche16David BeckmannCupra Kiro17Nico MuellerAndretti18Zane MaloneyLola Yamaha ABTNCRobin FrijnsEnvision RacingNCMax GuentherDS PenskeNCSam BirdMcLarenNCSebastien BuemiEnvision RacingAlso see:2025 Formula E: Mahindra Racing on podium at Jakarta E Prix",
  "image": "https://img.autocarindia.com/ExtraImages/20250714042617_Nissan_Rowland_Formula_E.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eJaguar’s Evans and Cassidy scored a win each at Berlin, as Nissan driver Rowland wrapped up the championship early.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/nissan\"\u003eNissan\u003c/a\u003e \u003c/strong\u003edriver Oliver Rowland was crowned 2025 Formula E champion at the Berlin E-Prix, with two rounds still to go. The title battle was prolonged to the second Berlin race after Rowland retired on Saturday, while his prime rival Pascal Wehrlein finished P2.\u003c/p\u003e\u003cp\u003eHowever, Sunday’s race saw a reversal of fortune. Wehrlein didn’t score any points in the race, leaving the door open for Rowland to clinch the title with a P4 finish. Berlin also ended up being a strong round for two Indian-backed teams – \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/jaguar\"\u003eJaguar\u003c/a\u003e\u003c/strong\u003e TCS Racing and \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/mahindra\"\u003eMahindra\u003c/a\u003e\u003c/strong\u003e Racing.\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eRowland wraps up title with 59 point lead over Wehrlein\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eJaguar wins both races\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eMahindra third in Race 1\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eBerlin E Prix: Nissan’s Rowland seals 2025 Formula E title\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003e\u003cstrong\u003ePorsche leads Teams’ championship.\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Oliver Rowland Formula E Berlin\" src=\"https://img.autocarindia.com/News/Oliver-Rowland-Berlin-E-Prix.jpg?w=700\u0026amp;c=0\" title=\"Oliver Rowland Formula E Berlin\"/\u003e\u003c/p\u003e\u003cp\u003eNot only did Rowland retire from a wet race on Saturday but he was also handed a five-place grid penalty for causing a collision with \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/maserati\"\u003eMaserati\u003c/a\u003e\u003c/strong\u003e’s Stoffel Vandoorne. He started Sunday’s race from eighth on the grid, while Wehrlein started from pole.\u003c/p\u003e\u003cp\u003eIn fact, Wehrlein was leading till Lap 29 of 41, but started losing ground during the Attack Mode activations. While those around him opted to use their first Attack Mode activation for four minutes, Wehrlein used it for just two minutes. He slipped out of the points as a result and ended up finishing P16.\u003c/p\u003e\u003cp\u003eRowland, meanwhile, pulled off some key moves to finish P4 – enough for him to seal the title with two rounds still to go. “After a tough day yesterday, I approached the race thinking about limiting the potential damage to my lead, but that strategy almost never works in Formula E, especially in this kind of race. So in the end, I trusted myself and focused on delivering the best possible performance, and it paid off,” explained Rowland.\u003c/p\u003e\u003cp\u003e“Since I came back, Nissan created an environment which I can thrive in, and this is the perfect fairytale. The whole team has worked tirelessly and delivered to the highest standard, and I would like to thank each and every one of them for their amazing effort throughout this campaign,” he added.\u003c/p\u003e\u003cp\u003eWhile the drivers’ title is wrapped up, the battle is very much on in the teams’ championship. Porsche currently leads the standings, 23 points ahead of Nissan.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eBerlin E Prix: Jaguar scores double victory\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003e\u003cstrong\u003eEvans, Cassidy win a race each.\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Jaguar Formula E Berlin\" src=\"https://img.autocarindia.com/News/jaguar-formula-e-berlin.jpg?w=700\u0026amp;c=0\" title=\"Jaguar Formula E Berlin\"/\u003e\u003c/p\u003e\u003cp\u003eJaguar took a clean sweep at Berlin, with both Mitch Evans and Nick Cassidy winning a race each. Evans controlled Saturday’s race from the very start and even built a lead of over five seconds before a late Safety Car wiped out his advantage. Nevertheless, he held on to score his first win (and points) since the season-opening Sao Paulo E-Prix.\u003c/p\u003e\u003cp\u003eCassidy took a specular win on Sunday, battling his way up from 20th on the grid. The Kiwi has scored more points than any other driver in the last eight races (92 points, precisely), and moves up to fifth in the standings as a result.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eBerlin E Prix: Mahindra on podium\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003e\u003cstrong\u003eMortara clinches back-to-back podiums.\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003e\u003cimg loading=\"lazy\" alt=\"Mahindra Formula E Berlin\" src=\"https://img.autocarindia.com/News/mahindra-formula-e-berlin.jpg?w=700\u0026amp;c=0\" title=\"Mahindra Formula E Berlin\"/\u003e\u003c/p\u003e\u003cp\u003eMahindra Racing continued its strong form, scoring back-to-back podium results. Edoardo Mortara secured his first podium finish of the season at the Jakarta E-Prix, and he followed it up with a P3 finish at the first Berlin race.\u003c/p\u003e\u003cp\u003eHe made a strong start in Race 2, but the Safety Car came out just as he took his first Attack Mode activation, hampering his strategy. He clawed back towards the top 10, but ended up finishing P11 after making contact in the closing laps.\u003c/p\u003e\u003cp\u003e2022 F2 champion Felipe Drugovich, meanwhile, was called in to replace Nyck de Vries, who was competing in the 6 Hours of Sao Paulo. He finished his debut race P17 after a number of setbacks, including a drive-through penalty for a gearbox change. But he bounced back in Race 2, going from P19 to P7 to score his first points in Formula E.\u003c/p\u003e\u003cp\u003eMahindra is now sixth in the teams’ championship, just one point behind \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/cars/mclaren\"\u003eMcLaren\u003c/a\u003e \u003c/strong\u003eand 20 points behind Jaguar. Reflecting on the weekend, Mahindra Racing CEO and team principal Frederic Bertrand said, “The weekend as a whole has been another promising one for the team – another podium, points on debut for Felipe and we will go to London with a chance of finishing in the top five in the World Championship, which has been the goal all season.”\u003c/p\u003e\u003cp\u003eHe added, “We have two weeks now to reset and get ready for the season finale in London. I’m sure it will be dramatic as always, but we will bring our ‘A game’ to make sure we end what has been a promising season on a high note.”\u003c/p\u003e\u003cp\u003eFormula E will now head to London for the last two races of the season on July 26 and 27.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003e2025 Berlin E Prix Round 13 results\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cdiv oncopy=\"return false\" onpaste=\"return false\" oncut=\"return false\"\u003e\u003ctable\u003e\u003cthead\u003e\u003ctr\u003e\u003cth colspan=\"3\" scope=\"col\"\u003e2025 Berlin E Prix Round 13 results\u003c/th\u003e\u003c/tr\u003e\u003c/thead\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003ePos\u003c/td\u003e\u003ctd\u003eDriver\u003c/td\u003e\u003ctd\u003eTeam\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e1\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eMitch Evans\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eJaguar\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e2\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003ePascal Wehrlein\u003c/td\u003e\u003ctd data-label=\"Team\"\u003ePorsche\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e3\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eEdoardo Mortara\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eMahindra Racing\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e4\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eTaylor Barnard\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eMcLaren\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e5\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eNick Cassidy\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eJaguar\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e6\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eMax Guenther\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eDS Penske\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e7\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eSebastien Buemi\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eEnvision Racing\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e8\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eNico Mueller\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eAndretti\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e9\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eDan Ticktum\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eCupra Kiro\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e10\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eAntonio Felix da Costa\u003c/td\u003e\u003ctd data-label=\"Team\"\u003ePorsche\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e11\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eSam Bird\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eMcLaren\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e12\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eStoffel Vandoorne\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eMaserati\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e13\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eRobin Frijns\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eEnvision Racing\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e14\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eJake Hughes\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eMaserati\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e15\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eSergio Sette Camara\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eNissan\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e16\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eZane Maloney\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eLola Yamaha ABT\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e17\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eFelipe Drugovich\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eMahindra Racing\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e18\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eLucas di Grassi\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eLola Yamaha ABT\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eNC\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eOliver Rowland\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eNissan\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eNC\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eJean-Eric Vergne\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eDS Penske\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eNC\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eDavid Beckmann\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eCupra Kiro\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eNC\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eJake Dennis\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eAndretti\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/div\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003e2025 Berlin E Prix Round 14 results\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003cdiv oncopy=\"return false\" onpaste=\"return false\" oncut=\"return false\"\u003e\u003ctable\u003e\u003cthead\u003e\u003ctr\u003e\u003cth colspan=\"3\" scope=\"col\"\u003e2025 Berlin E Prix Round 14 results\u003c/th\u003e\u003c/tr\u003e\u003c/thead\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003ePos\u003c/td\u003e\u003ctd\u003eDriver\u003c/td\u003e\u003ctd\u003eTeam\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e1\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eNick Cassidy\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eJaguar\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e2\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eJake Dennis\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eAndretti\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e3\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eJean-Eric Vergne\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eDS Penske\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e4\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eOliver Rowland\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eNissan\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e5\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eMitch Evans\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eJaguar\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e6\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eTaylor Barnard\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eMcLaren\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e7\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eFelipe Drugovich\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eMahindra Racing\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e8\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eAntonio Felix da Costa\u003c/td\u003e\u003ctd data-label=\"Team\"\u003ePorsche\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e9\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eSergio Sette Camara\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eNissan\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e10\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eJake Hughes\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eMaserati\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e11\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eEdoardo Mortara\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eMahindra Racing\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e12\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eLucas di Grassi\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eLola Yamaha ABT\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e13\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eStoffel Vandoorne\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eMaserati\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e14\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eDan Ticktum\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eCupra Kiro\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e15\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003ePascal Wehrlein\u003c/td\u003e\u003ctd data-label=\"Team\"\u003ePorsche\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e16\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eDavid Beckmann\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eCupra Kiro\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e17\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eNico Mueller\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eAndretti\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e18\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eZane Maloney\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eLola Yamaha ABT\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eNC\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eRobin Frijns\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eEnvision Racing\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eNC\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eMax Guenther\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eDS Penske\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eNC\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eSam Bird\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eMcLaren\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eNC\u003c/td\u003e\u003ctd data-label=\"Driver\"\u003eSebastien Buemi\u003c/td\u003e\u003ctd data-label=\"Team\"\u003eEnvision Racing\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003eAlso see:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/motor-sports-news/2025-formula-e-mahindra-racing-on-podium-at-jakarta-e-prix-435817\"\u003e2025 Formula E: Mahindra Racing on podium at Jakarta E Prix\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-07-14T16:26:00+05:30",
  "modifiedTime": null
}
