{
  "id": "ea8908ba-b057-480f-b131-c0d064cedfa4",
  "title": "Triumph Rocket 3 Evel Knievel edition unveiled",
  "link": "https://www.autocarindia.com/bike-news/triumph-rocket-3-evel-knievel-edition-unveiled-433992#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
  "description": "Triumph Motorcycles has introduced two exclusive limited-edition models of its Rocket 3 R and GT motorcycles, commemorating the legendary stuntman Evel Knievel.  Pays tribute to the partnership between Triumph and Evel Knievel Only 500 units for the entire world Triumph Rocket 3 Evel Knievel edition details The partnership between Triumph and Evel Knievel dates back to the 1960s, when Knievel first performed stunts on Triumph bikes, including his famous jump over the fountains at Caesars Palace. The bike adorns a design inspired by Knievel’s iconic white jumpsuit, adorned with stars and stripes. Although the Rocket would not have been the bike of choice for Knievel owing to its heavy weight.  The Rocket 3 R and GT Evel Knievel Limited Editions feature full chrome fuel tanks, reflecting the stuntman’s signature aesthetic. The bold design includes contrasting matte Sapphire Black panels and matching rear bodywork, while the leather seats are embossed with Knievel’s gold-embroidered signature logo. Triumph has also added a custom start-up screen animation for the instrument cluster. Both models also include unique black and gold cam cover plates, each individually numbered. In addition, every purchaser will receive a specially commissioned collector’s edition hardback book that chronicles Knievel's legendary stunts and his connection with Triumph. Each book is individually numbered to match the bike it accompanies and is signed by Triumph CEO Nick Bloor. The mechanical specifications of the Rocket 3 R and GT Limited Editions are identical to those of the standard models. The Rocket 3 R offers a roadster design and a more committed rider’s triangle, while the GT leans more toward a cruiser style, featuring a taller flyscreen, a pillion grab rail, and footpegs positioned slightly further forward than those on the R. A standout feature of the Rocket 3 has always been its massive 2,500cc three-cylinder engine, the largest ever installed in a production motorcycle. This engine generates 182hp and an impressive 221Nm of peak torque. The Standard Rocket 3 is available in the ‘Storm’ variant in India which features a complete black-out look with a matte black paint job coupled with a black powder coating to the exhaust and engine. It cost Rs. 21.9 lakh (Ex-showroom, India). Also see: Triumph Bobber TFC limited edition unveiled Triumph Speed T4 review: Less is more",
  "author": "Autocar India News Desk",
  "published": "Wed, 1 Jan 2025 07:00:00 +1000",
  "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
  "categories": null,
  "byline": "Autocar India News Desk",
  "length": 2526,
  "excerpt": "Triumph\u0026#39;s Rocket 3 series is a motorcycle that features the world\u0026#39;s largest series production engine with 2500cc of displacement.",
  "siteName": "AutocarIndia",
  "favicon": "",
  "text": "Triumph's Rocket 3 series is a motorcycle that features the world's largest series production engine with 2500cc of displacement.Triumph Motorcycles has introduced two exclusive limited-edition models of its Rocket 3 R and GT motorcycles, commemorating the legendary stuntman Evel Knievel. Pays tribute to the partnership between Triumph and Evel KnievelOnly 500 units for the entire worldTriumph Rocket 3 Evel Knievel edition detailsThe partnership between Triumph and Evel Knievel dates back to the 1960s, when Knievel first performed stunts on Triumph bikes, including his famous jump over the fountains at Caesars Palace. The bike adorns a design inspired by Knievel’s iconic white jumpsuit, adorned with stars and stripes. Although the Rocket would not have been the bike of choice for Knievel owing to its heavy weight. The Rocket 3 R and GT Evel Knievel Limited Editions feature full chrome fuel tanks, reflecting the stuntman’s signature aesthetic. The bold design includes contrasting matte Sapphire Black panels and matching rear bodywork, while the leather seats are embossed with Knievel’s gold-embroidered signature logo. Triumph has also added a custom start-up screen animation for the instrument cluster.Both models also include unique black and gold cam cover plates, each individually numbered. In addition, every purchaser will receive a specially commissioned collector’s edition hardback book that chronicles Knievel's legendary stunts and his connection with Triumph. Each book is individually numbered to match the bike it accompanies and is signed by Triumph CEO Nick Bloor.The mechanical specifications of the Rocket 3 R and GT Limited Editions are identical to those of the standard models. The Rocket 3 R offers a roadster design and a more committed rider’s triangle, while the GT leans more toward a cruiser style, featuring a taller flyscreen, a pillion grab rail, and footpegs positioned slightly further forward than those on the R. A standout feature of the Rocket 3 has always been its massive 2,500cc three-cylinder engine, the largest ever installed in a production motorcycle. This engine generates 182hp and an impressive 221Nm of peak torque.The Standard Rocket 3 is available in the ‘Storm’ variant in India which features a complete black-out look with a matte black paint job coupled with a black powder coating to the exhaust and engine. It cost Rs. 21.9 lakh (Ex-showroom, India).Also see: Triumph Bobber TFC limited edition unveiledTriumph Speed T4 review: Less is moreImagesVideos",
  "image": "https://cdni.autocarindia.com/ExtraImages/20241231124725_2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cb\u003eTriumph\u0026#39;s Rocket 3 series is a motorcycle that features the world\u0026#39;s largest series production engine with 2500cc of displacement.\u003c/b\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTriumph Motorcycles has introduced two exclusive limited-edition models of its Rocket 3 R and GT motorcycles, commemorating the legendary stuntman Evel Knievel. \u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003ePays tribute to the partnership between Triumph and Evel Knievel\u003c/strong\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eOnly 500 units for the entire world\u003c/strong\u003e\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cspan\u003eTriumph Rocket 3 Evel Knievel edition details\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eThe partnership between Triumph and Evel Knievel dates back to the 1960s, when Knievel first performed stunts on Triumph bikes, including his famous jump over the fountains at Caesars Palace. The bike adorns a design inspired by Knievel’s iconic white jumpsuit, adorned with stars and stripes. Although the Rocket would not have been the bike of choice for Knievel owing to its heavy weight. \u003c/p\u003e\u003cp\u003eThe Rocket 3 R and GT Evel Knievel Limited Editions feature full chrome fuel tanks, reflecting the stuntman’s signature aesthetic. The bold design includes contrasting matte Sapphire Black panels and matching rear bodywork, while the leather seats are embossed with Knievel’s gold-embroidered signature logo. Triumph has also added a custom start-up screen animation for the instrument cluster.\u003c/p\u003e\u003cp\u003e\u003cimg loading=\"lazy\" src=\"https://cdni.autocarindia.com/Utils/ImageResizer.ashx?n=https://cdni.autocarindia.com/News/20241231124744_1.jpg\u0026amp;c=0\u0026amp;w=700\"/\u003e\u003c/p\u003e\u003cp\u003eBoth models also include unique black and gold cam cover plates, each individually numbered. In addition, every purchaser will receive a specially commissioned collector’s edition hardback book that chronicles Knievel\u0026#39;s legendary stunts and his connection with Triumph. Each book is individually numbered to match the bike it accompanies and is signed by Triumph CEO Nick Bloor.\u003c/p\u003e\u003cp\u003eThe mechanical specifications of the \u003cstrong\u003e\u003ca href=\"https://www.autocarindia.com/bike-news/triumph-rocket-3-storm-r-gt-revealed-make-182hp-225nm-431029\"\u003eRocket 3 R and GT\u003c/a\u003e\u003c/strong\u003e Limited Editions are identical to those of the standard models. The Rocket 3 R offers a roadster design and a more committed rider’s triangle, while the GT leans more toward a cruiser style, featuring a taller flyscreen, a pillion grab rail, and footpegs positioned slightly further forward than those on the R. A standout feature of the Rocket 3 has always been its massive 2,500cc three-cylinder engine, the largest ever installed in a production motorcycle. This engine generates 182hp and an impressive 221Nm of peak torque.\u003c/p\u003e\u003cp\u003eThe Standard Rocket 3 is available in the ‘Storm’ variant in India which features a complete black-out look with a matte black paint job coupled with a black powder coating to the exhaust and engine. It cost Rs. 21.9 lakh (Ex-showroom, India).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlso see: \u003ca href=\"https://www.autocarindia.com/bike-news/triumph-bobber-tfc-limited-edition-unveiled-433839\"\u003eTriumph Bobber TFC limited edition unveiled\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.autocarindia.com/bike-reviews/triumph-speed-t4-review-less-is-more-433016\"\u003e\u003cstrong\u003eTriumph Speed T4 review: Less is more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"tagged-articles-container-433992\"\u003e\u003cul id=\"tab-id-433992\"\u003e\u003cli\u003e\u003ca id=\"tab-imghref-id-433992\" href=\"#.\" rel=\"#tab-images-container-433992\"\u003eImages\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca id=\"tab-vidhref-id-433992\" href=\"#.\" rel=\"#tab-videos-container-433992\"\u003eVideos\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-01T07:00:00+05:30",
  "modifiedTime": null
}
