{
  "id": "eecb847b-94cc-4cbc-9170-9b0a7415dfde",
  "title": "Rivian And Cadillac Hit Rock Bottom In Consumer Reports’ Reliability Rankings",
  "link": "https://www.carscoops.com/2024/12/rivian-and-cadillac-at-the-very-bottom-of-consumer-reports-reliability-study/",
  "description": "Despite its abysmal reliability rating, Rivian has the highest score among all brands in customer satisfaction",
  "author": "Thanos Pappas",
  "published": "Sat, 14 Dec 2024 22:39:00 +0000",
  "source": "https://www.carscoops.com/feed/",
  "categories": [
    "news",
    "Cadillac",
    "Consumer Reports",
    "GMC",
    "Jeep",
    "Lexus",
    "Rivian",
    "Study",
    "Subaru",
    "Toyota"
  ],
  "byline": "Thanos Pappas",
  "length": 5869,
  "excerpt": "Despite its abysmal reliability rating, Rivian has the highest score among all brands in customer satisfaction",
  "siteName": "Carscoops",
  "favicon": "https://www.carscoops.com/wp-content/uploads/2022/12/apple-icon-152x152-1.png",
  "text": "According to CR, Rivian has the worst predicted reliability rating among all brands for 2025. Cadillac is second last, with GMC, Jeep, and Volkswagen rounding off the bottom 5 spots. The top 6 is dominated by Japanese brands including Subaru, Lexus, Toyota, Honda, and Acura. Consumer Reports has released its latest rankings of the most and least reliable car brands, and – no surprises here – Asian automakers continue to dominate. They claimed eight of the top ten spots, while American and European brands are left battling for middle-of-the-road respectability. But the most glaring highlight (or lowlight, depending on how you look at it) is Rivian, which finishes dead last. Apparently, building EVs isn’t as easy as it looks. The reliability rankings are based on annual surveys completed by Consumer Reports members. This year’s survey includes vehicles from 2022 to 2024 model years, along with some early 2025 models. More: Subaru Dethrones BMW In Consumer Report’s 2025 Brand Rankings, Rivian And Jeep Dead Last Rivian’s place at the bottom is hardly surprising for anyone taking a look at the numerous issues owners have reported on specialized forums and groups, particularly those struggling to get timely appointments at service centers, with many quoting wait times of several months. Both the R1S and R1T posted well-below-average scores, culminating in an abysmal predicted reliability rating of just 14%. Yet paradoxically, Rivian still manages to top Consumer Reports’ overall customer satisfaction chart, with 86% of owners claiming they’d buy again. Meanwhile, Cadillac isn’t doing much better with a reliability score of 27%, thanks in part to its electric Lyriq, which apparently hates functioning as much as your printer hates connecting to Wi-Fi. GMC, Jeep, and Volkswagen round out the bottom five, proving that if you’re looking for a sturdy vehicle, maybe skip the Jeep dealership (or bring your mechanic along as a full-time passenger). Jeep also takes the overall brand L this year, finishing dead last in Consumer Reports’ broader rankings, which factor in stuff like maintenance costs and road test performance. Congrats, Jeep, you’re consistent – just not in a good way. The Top Dogs At the other end of the spectrum, Subaru is now king of the reliability hill, dethroning Lexus and Toyota with a score of 68%. How did they pull it off? By basically doing nothing. Subaru’s success stems from keeping things boring, as minimal redesigns and shared components across their lineup mean fewer opportunities for things to go wrong. More: Rivian Quietly Removes Front Under-Seat Storage In R1 Gen 2—Here’s Why Unsurprisingly, Japanese automakers dominate the top six spots, with Subaru, Lexus, Toyota, Honda, Acura, and Mazda continuing their streak of reliability. Filling out the top 10 are Audi, BMW, Kia, and Hyundai, with Buick landing in 11th as the first American brand to sneak into the rankings. Yes, Buick. The car your grandparents bought when they were “living a little” is apparently a better bet than a Tesla or anything else GM churns out these days. 2025 CR’s PREDICTED RELIABILITY RANKINGS Brand Rankings Aren’t Telling The Whole Story Before you rush out to buy a Subaru Crosstrek because it tops the charts, Consumer Reports’ Jake Fisher wants you to step back and not always rely on the general brand rankings. “While brand rankings can guide you to the showroom, it is critical to also look at reliability for specific models before making a purchase decision,” says Fisher. “Even within high-ranking companies, there can be significant variation in reliability.” An example is the below-average reliability ratings of the Tacoma, Tundra, and bZ4X, which negatively impacted Toyota’s ranking compared to the rest of its lineup. The same applies to the Subaru Solterra EV, which shared the same below-average score as its Toyota bZ4X twin. EVs and Hybrids: Proceed With Caution This year’s data includes more electrified models than ever, and the verdict is clear: hybrids are still your safest bet when it comes to reliability. EVs and plug-in hybrids are improving, but they’re not quite ready for the big leagues yet. Think of them as talented but unreliable rookies; great when they work, but just as likely to throw the game. Cadillac Lyriq The findings suggest that it’s better to wait a few years before buying an all-new model, allowing the automaker time to resolve any issues and streamline production. Two notable examples from the EV world are the Cadillac Lyriq and the Chevrolet Blazer EV, both of which faced problems with batteries, electrical accessories, climate systems, in-car electronics, and other components. Similarly, both the ICE-powered and PHEV versions of the fresh-off-the-shelves Mazda CX-90 experienced issues with transmission, steering, suspension, and in-car electronics, while the latest generations of the Chevrolet Colorado and GMC Canyon pickups posted well-below-average reliability scores. Oldies, But Goodies Meanwhile, more established models like the Ford Bronco Sport and Genesis GV80, which have been around since the 2021 MY, have steadily improved over time. Even the Ford Explorer, once the reliability equivalent of a trust fall gone wrong, has clawed its way into “recommended” status. So, if you’re eyeing a brand-new model, maybe give it a couple of years to work out the kinks – let someone else beta test it for you. Ford Explorer",
  "image": "https://www.carscoops.com/wp-content/uploads/2024/12/54ffrcvd-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \n                        \n                        \n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eAccording to CR, Rivian has the worst predicted reliability rating among all brands for 2025.\u003c/li\u003e\n\n\n\n\u003cli\u003eCadillac is second last, with GMC, Jeep, and Volkswagen rounding off the bottom 5 spots.\u003c/li\u003e\n\n\n\n\u003cli\u003eThe top 6 is dominated by Japanese brands including Subaru, Lexus, Toyota, Honda, and Acura.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.carscoops.com/tag/consumer-reports\"\u003eConsumer Reports\u003c/a\u003e has released its latest rankings of the most and least reliable car brands, and – no surprises here – Asian automakers continue to dominate. They claimed eight of the top ten spots, while American and European brands are left battling for middle-of-the-road respectability. But the most glaring highlight (or lowlight, depending on how you look at it) is Rivian, which finishes dead last. Apparently, building EVs isn’t as easy as it looks.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eThe reliability rankings are based on annual surveys completed by Consumer Reports members. This year’s survey includes vehicles from 2022 to 2024 model years, along with some early 2025 models.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMore: \u003ca href=\"https://www.carscoops.com/2024/12/subaru-tops-consumer-reports-rankings-for-2025-jeep-finishes-last/\"\u003eSubaru Dethrones BMW In Consumer Report’s 2025 Brand Rankings, Rivian And Jeep Dead Last\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.carscoops.com/tag/Rivian\"\u003eRivian’s\u003c/a\u003e place at the bottom is hardly surprising for anyone taking a look at the numerous issues owners have reported on specialized forums and groups, particularly those struggling to get timely appointments at service centers, with many quoting wait times of several months. Both the R1S and R1T posted well-below-average scores, culminating in an abysmal predicted reliability rating of just 14%. Yet paradoxically, Rivian still manages to top Consumer Reports’ overall \u003ca href=\"https://www.consumerreports.org/cars/car-reliability-owner-satisfaction/most-and-least-liked-car-brands-a1291429338/\"\u003ecustomer satisfaction chart\u003c/a\u003e, with 86% of owners claiming they’d buy again.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eMeanwhile, Cadillac isn’t doing much better with a reliability score of 27%, thanks in part to its electric Lyriq, which apparently hates functioning as much as your printer hates connecting to Wi-Fi. GMC, Jeep, and Volkswagen round out the bottom five, proving that if you’re looking for a sturdy vehicle, maybe skip the Jeep dealership (or bring your mechanic along as a full-time passenger). \u003c/p\u003e\n\n\n\n\u003cp\u003eJeep also takes the overall brand L this year, finishing dead last in Consumer Reports’ broader rankings, which factor in stuff like maintenance costs and road test performance. Congrats, Jeep, you’re consistent – just not in a good way.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThe Top Dogs\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n        \u003ca href=\"https://www.carscoops.com/wp-content/uploads/2024/10/2025-Subaru-Crosstrek-Hybrid-1018-12.jpg\" data-type=\"inarticle-image-block\"\u003e \n            \u003cfigure\u003e\n                \u003cpicture\u003e\n                    \u003csource type=\"image/webp\" srcset=\"https://www.carscoops.com/wp-content/uploads/webp/2024/10/2025-Subaru-Crosstrek-Hybrid-1018-12.webp 823w, https://www.carscoops.com/wp-content/uploads/webp/2024/10/2025-Subaru-Crosstrek-Hybrid-1018-12-400x267.webp 400w, https://www.carscoops.com/wp-content/uploads/webp/2024/10/2025-Subaru-Crosstrek-Hybrid-1018-12-768x512.webp 768w\" sizes=\"(max-width: 1920px) 100vw, (max-width: 1535px) 100vw, (max-width: 1024px) 100vw, (max-width: 768px) 1000px, (max-width: 300px) 600px, (max-width: 200px) 200px\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.carscoops.com/wp-content/uploads/2024/10/2025-Subaru-Crosstrek-Hybrid-1018-12.jpg\" srcset=\"https://www.carscoops.com/wp-content/uploads/2024/10/2025-Subaru-Crosstrek-Hybrid-1018-12.jpg 823w, https://www.carscoops.com/wp-content/uploads/2024/10/2025-Subaru-Crosstrek-Hybrid-1018-12-400x267.jpg 400w, https://www.carscoops.com/wp-content/uploads/2024/10/2025-Subaru-Crosstrek-Hybrid-1018-12-768x512.jpg 768w\" sizes=\"(max-width: 1920px) 100vw, (max-width: 1535px) 100vw, (max-width: 1024px) 100vw, (max-width: 768px) 1000px, (max-width: 300px) 600px, (max-width: 200px) 200px\" alt=\" Rivian And Cadillac Hit Rock Bottom In Consumer Reports’ Reliability Rankings\" width=\"823\" height=\"549\" data-src=\"https://www.carscoops.com/wp-content/uploads/2024/10/2025-Subaru-Crosstrek-Hybrid-1018-12.jpg\" data-type=\"inarticle-image\"/\u003e\n                \u003c/picture\u003e\n            \u003c/figure\u003e\n        \u003c/a\u003e  \n        \n\n\n\u003cp\u003eAt the other end of the spectrum, \u003ca href=\"https://www.carscoops.com/tag/Subaru\"\u003eSubaru\u003c/a\u003e is now king of the reliability hill, dethroning Lexus and Toyota with a score of 68%. How did they pull it off? By basically doing nothing. Subaru’s success stems from keeping things boring, as minimal redesigns and shared components across their lineup mean fewer opportunities for things to go wrong.\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003e\u003cstrong\u003eMore: \u003ca href=\"https://www.carscoops.com/2024/12/rivian-quietly-removes-front-under-seat-storage-in-gen-2-r1t-and-r1s-heres-why/\"\u003eRivian Quietly Removes Front Under-Seat Storage In R1 Gen 2—Here’s Why\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eUnsurprisingly, \u003ca href=\"https://www.carscoops.com/tag/Japan\"\u003eJapanese\u003c/a\u003e automakers dominate the top six spots, with Subaru, Lexus, Toyota, Honda, Acura, and Mazda continuing their streak of reliability. Filling out the top 10 are Audi, \u003ca href=\"https://www.carscoops.com/tag/BMW/\" title=\"BMW\" target=\"_blank\"\u003eBMW\u003c/a\u003e, Kia, and Hyundai, with Buick landing in 11th as the first American brand to sneak into the rankings. Yes, Buick. The car your grandparents bought when they were “living a little” is apparently a better bet than a Tesla or anything else GM churns out these days.\u003c/p\u003e\n\n\n\n\u003ch5\u003e2025 CR’s PREDICTED RELIABILITY RANKINGS\u003c/h5\u003e\n\n\n\n            \n            \n\n\n\u003cp\u003e\u003cstrong\u003eBrand Rankings Aren’t Telling The Whole Story\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eBefore you rush out to buy a Subaru Crosstrek because it tops the charts, \u003ca href=\"https://www.consumerreports.org/cars/car-reliability-owner-satisfaction/who-makes-the-most-reliable-cars-a7824554938/\"\u003eConsumer Reports\u003c/a\u003e’ Jake Fisher wants you to step back and not always rely on the general brand rankings. “While brand rankings can guide you to the showroom, it is critical to also look at reliability for specific models before making a purchase decision,” says Fisher. “Even within high-ranking companies, there can be significant variation in reliability.”\u003c/p\u003e\n\t\t\n\t\t\n\n\n\n\u003cp\u003eAn example is the below-average reliability ratings of the Tacoma, Tundra, and bZ4X, which negatively impacted Toyota’s ranking compared to the rest of its lineup. The same applies to the \u003ca href=\"https://www.carscoops.com/tag/subaru-solterra/\"\u003eSubaru Solterra\u003c/a\u003e EV, which shared the same below-average score as its Toyota bZ4X twin.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eEVs and Hybrids: Proceed With Caution \u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThis year’s data includes more electrified models than ever, and the verdict is clear: \u003ca href=\"https://www.carscoops.com/tag/hybrids\"\u003ehybrids\u003c/a\u003e are still your safest bet when it comes to reliability. EVs and plug-in hybrids are improving, but they’re not quite ready for the big leagues yet. Think of them as talented but unreliable rookies; great when they work, but just as likely to throw the game.\u003c/p\u003e\n\n\n\n\n        \u003ca href=\"https://www.carscoops.com/wp-content/uploads/2024/02/2023-cadillac-lyriq-505-copy.jpg\" data-type=\"inarticle-image-block\"\u003e \n            \u003cfigure\u003e\n                \u003cpicture\u003e\n                    \u003csource type=\"image/webp\" srcset=\"https://www.carscoops.com/wp-content/uploads/webp/2024/02/2023-cadillac-lyriq-505-copy.webp 2450w, https://www.carscoops.com/wp-content/uploads/webp/2024/02/2023-cadillac-lyriq-505-copy-400x225.webp 400w, https://www.carscoops.com/wp-content/uploads/webp/2024/02/2023-cadillac-lyriq-505-copy-1024x576.webp 1024w, https://www.carscoops.com/wp-content/uploads/webp/2024/02/2023-cadillac-lyriq-505-copy-768x432.webp 768w, https://www.carscoops.com/wp-content/uploads/webp/2024/02/2023-cadillac-lyriq-505-copy-1536x864.webp 1536w, https://www.carscoops.com/wp-content/uploads/webp/2024/02/2023-cadillac-lyriq-505-copy-2048x1152.webp 2048w\" sizes=\"(max-width: 1920px) 100vw, (max-width: 1535px) 100vw, (max-width: 1024px) 100vw, (max-width: 768px) 1000px, (max-width: 300px) 600px, (max-width: 200px) 200px\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.carscoops.com/wp-content/uploads/2024/02/2023-cadillac-lyriq-505-copy-1024x576.jpg\" srcset=\"https://www.carscoops.com/wp-content/uploads/2024/02/2023-cadillac-lyriq-505-copy.jpg 2450w, https://www.carscoops.com/wp-content/uploads/2024/02/2023-cadillac-lyriq-505-copy-400x225.jpg 400w, https://www.carscoops.com/wp-content/uploads/2024/02/2023-cadillac-lyriq-505-copy-1024x576.jpg 1024w, https://www.carscoops.com/wp-content/uploads/2024/02/2023-cadillac-lyriq-505-copy-768x432.jpg 768w, https://www.carscoops.com/wp-content/uploads/2024/02/2023-cadillac-lyriq-505-copy-1536x864.jpg 1536w, https://www.carscoops.com/wp-content/uploads/2024/02/2023-cadillac-lyriq-505-copy-2048x1152.jpg 2048w\" sizes=\"(max-width: 1920px) 100vw, (max-width: 1535px) 100vw, (max-width: 1024px) 100vw, (max-width: 768px) 1000px, (max-width: 300px) 600px, (max-width: 200px) 200px\" alt=\" Rivian And Cadillac Hit Rock Bottom In Consumer Reports’ Reliability Rankings\" width=\"2450\" height=\"1378\" data-src=\"https://www.carscoops.com/wp-content/uploads/2024/02/2023-cadillac-lyriq-505-copy-1024x576.jpg\" data-type=\"inarticle-image\"/\u003e\n                \u003c/picture\u003e\u003cfigcaption\u003eCadillac Lyriq\u003c/figcaption\u003e\n            \u003c/figure\u003e\n        \u003c/a\u003e  \n        \n\n\n\u003cp\u003eThe findings suggest that it’s better to wait a few years before buying an all-new model, allowing the automaker time to resolve any issues and streamline production. Two notable examples from the EV world are the \u003ca href=\"https://www.carscoops.com/tag/cadillac-lyriq/\"\u003eCadillac Lyriq\u003c/a\u003e and the Chevrolet Blazer EV, both of which faced problems with batteries, electrical accessories, climate systems, in-car electronics, and other components.\u003c/p\u003e\n\n\n\n\u003cp\u003eSimilarly, both the ICE-powered and PHEV versions of the fresh-off-the-shelves \u003ca href=\"https://www.carscoops.com/tag/Mazda-CX-90\"\u003eMazda CX-90\u003c/a\u003e experienced issues with transmission, steering, suspension, and in-car electronics, while the latest generations of the Chevrolet Colorado and GMC Canyon pickups posted well-below-average reliability scores.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eOldies, But Goodies\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eMeanwhile, more established models like the Ford Bronco Sport and Genesis GV80, which have been around since the 2021 MY, have steadily improved over time. Even the \u003ca href=\"https://www.carscoops.com/tag/ford-explorer/\"\u003eFord Explorer\u003c/a\u003e, once the reliability equivalent of a trust fall gone wrong, has clawed its way into “recommended” status. \u003c/p\u003e\n\n\n\n\u003cp\u003eSo, if you’re eyeing a brand-new model, maybe give it a couple of years to work out the kinks – let someone else beta test it for you.\u003c/p\u003e\n\n\n\n\n        \u003ca href=\"https://www.carscoops.com/wp-content/uploads/2024/02/2025-Ford-Explorer-ST-3.jpg\" data-type=\"inarticle-image-block\"\u003e \n            \u003cfigure\u003e\n                \u003cpicture\u003e\n                    \u003csource type=\"image/webp\" srcset=\"https://www.carscoops.com/wp-content/uploads/webp/2024/02/2025-Ford-Explorer-ST-3.webp 2200w, https://www.carscoops.com/wp-content/uploads/webp/2024/02/2025-Ford-Explorer-ST-3-400x224.webp 400w, https://www.carscoops.com/wp-content/uploads/webp/2024/02/2025-Ford-Explorer-ST-3-1024x573.webp 1024w, https://www.carscoops.com/wp-content/uploads/webp/2024/02/2025-Ford-Explorer-ST-3-768x429.webp 768w, https://www.carscoops.com/wp-content/uploads/webp/2024/02/2025-Ford-Explorer-ST-3-1536x859.webp 1536w, https://www.carscoops.com/wp-content/uploads/webp/2024/02/2025-Ford-Explorer-ST-3-2048x1145.webp 2048w\" sizes=\"(max-width: 1920px) 100vw, (max-width: 1535px) 100vw, (max-width: 1024px) 100vw, (max-width: 768px) 1000px, (max-width: 300px) 600px, (max-width: 200px) 200px\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.carscoops.com/wp-content/uploads/2024/02/2025-Ford-Explorer-ST-3-1024x573.jpg\" srcset=\"https://www.carscoops.com/wp-content/uploads/2024/02/2025-Ford-Explorer-ST-3.jpg 2200w, https://www.carscoops.com/wp-content/uploads/2024/02/2025-Ford-Explorer-ST-3-400x224.jpg 400w, https://www.carscoops.com/wp-content/uploads/2024/02/2025-Ford-Explorer-ST-3-1024x573.jpg 1024w, https://www.carscoops.com/wp-content/uploads/2024/02/2025-Ford-Explorer-ST-3-768x429.jpg 768w, https://www.carscoops.com/wp-content/uploads/2024/02/2025-Ford-Explorer-ST-3-1536x859.jpg 1536w, https://www.carscoops.com/wp-content/uploads/2024/02/2025-Ford-Explorer-ST-3-2048x1145.jpg 2048w\" sizes=\"(max-width: 1920px) 100vw, (max-width: 1535px) 100vw, (max-width: 1024px) 100vw, (max-width: 768px) 1000px, (max-width: 300px) 600px, (max-width: 200px) 200px\" alt=\" Rivian And Cadillac Hit Rock Bottom In Consumer Reports’ Reliability Rankings\" width=\"2200\" height=\"1230\" data-src=\"https://www.carscoops.com/wp-content/uploads/2024/02/2025-Ford-Explorer-ST-3-1024x573.jpg\" data-type=\"inarticle-image\"/\u003e\n                \u003c/picture\u003e\u003cfigcaption\u003eFord Explorer\u003c/figcaption\u003e\n            \u003c/figure\u003e\n        \u003c/a\u003e  \n        \n                        \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-14T22:39:00Z",
  "modifiedTime": "2024-12-14T17:24:53Z"
}
