{
  "id": "f1565aa4-8cd4-49bf-8022-2f9b26350e69",
  "title": "EVs eligible for new £3750 grant to be confirmed on 11 August",
  "link": "https://www.autocar.co.uk/car-news/consumer/evs-eligible-new-%C2%A33750-grant-be-confirmed-11-august",
  "description": "Around a third of the electric cars currently on sale in the UK are expected to qualify Car buyers are set to learn which models qualify for the UK government’s new Electric Car Grant (ECG) on August 11. Speaking at a briefing to announce the UK’s latest automotive manufacturing figures, Society of Motor Manufactures and Traders (SMMT) boss Mike Hawes confirmed the August date and said he expected around one third of electric cars on the market to qualify for the grant based on the criteria set out by government. This criteria includes not just a £37,000 cap for a qualifying model but also science-based targets around emissions from a car company and its models’ manufacturing location. Should a car qualify, grants will be banded at either £1500 or £3750.  On the basis that half the market is ruled out on price, that means around two thirds of EV model ranges with a sub-£37,000 model look set to qualify for a grant, based on early projections.  Hawes confirmed that the automotive industry had not been consulted on the ECG ahead of its publication and said that while “any support is the right thing”, the fact that it “will help some but not all OEMs” isn't ideal. The fact that some manufacturers and models would be denied access to the grant also meant that for them “the route to ZEV mandate compliance is worse\" and \"at £37,000 you split the market”.  The SMMT had been advocating for VAT cuts on EVs sold to private buyers as a way of ensuring support was targeted at the area of the market that needed it most.  “We understand the ambition, but there is a lack of clarity,” said Hawes. Hawes believes that the ECG isn't intended to disadvantage any particular region or manufacturer, despite cars originating from South Korea and China set to miss out, saying it looked to have been formulated to target “products with broader sustainability goals, not just zero tailpipe emissions”. It's also worth noting that “the government has said it will look to support local manufacturing if possible”, he added. The chances of access to the ECG convincing any foreign car maker to invest in UK EV manufacturing is incredibly slim, said Hawes, as it's likely the £650 million purse would have run out by the time production could be ramped up.  In response to the fact that the ECG is also available to business buyers (who already get EV subsidies through favourable BIK tax rates), Hawes said the “objective of the government is to get EVs on the road, and that includes fleet, rightly or wrongly”.  Car makers will also be able to get the ECG paid to themselves through registering the likes of demonstrators and staff vehicles, but Hawes said that for manufacturers, “the grant will be monitored by the government to ensure it flows through” to the right places. “Invariably there might be sales channels that are easier than others,\" he said, \"but ultimately this is going to shift the market.” To that end, Hawes believes the scheme \"will be a success, as consumers respond to carrots”. Now the challenge is to ensure that investment in charging infrastructure keeps up with a likely increase in demand. One test of the ECG scheme's success will be whether it tempts new buyers into EVs, rather than existing EV drivers to swap one EV for another, added Hawes, saying: “It needs to be the former.”",
  "author": "",
  "published": "Thu, 24 Jul 2025 00:01:04 +0100",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "News"
  ],
  "byline": "Mark Tisshaw",
  "length": 2426,
  "excerpt": "Around a third of electric cars on sale in the UK are expected to qualify",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Car buyers are set to learn which models qualify for the UK government’s new Electric Car Grant (ECG) on August 11. Speaking at a briefing to announce the UK’s latest automotive manufacturing figures, Society of Motor Manufactures and Traders (SMMT) boss Mike Hawes confirmed the August date and said he expected around one third of electric cars on the market to qualify for the grant based on the criteria set out by government. This criteria includes not just a £37,000 cap for a qualifying model but also science-based targets around emissions from a car company and its models’ manufacturing location. Should a car qualify, grants will be banded at either £1500 or £3750.  On the basis that half the market is ruled out on price, that means around two thirds of EV model ranges with a sub-£37,000 model look set to qualify for a grant, based on early projections.  Hawes confirmed that the automotive industry had not been consulted on the ECG ahead of its publication and said that while “any support is the right thing”, the fact that it “will help some but not all OEMs” isn't ideal. The fact that some manufacturers and models would be denied access to the grant also meant that for them “the route to ZEV mandate compliance is worse\" and \"at £37,000 you split the market”.  The SMMT had been advocating for VAT cuts on EVs sold to private buyers as a way of ensuring support was targeted at the area of the market that needed it most.  “We understand the ambition, but there is a lack of clarity,” said Hawes. Hawes believes that the ECG isn't intended to disadvantage any particular region or manufacturer, despite cars originating from South Korea and China set to miss out, saying it looked to have been formulated to target “products with broader sustainability goals, not just zero tailpipe emissions”. It's also worth noting that “the government has said it will look to support local manufacturing if possible”, he added. The chances of access to the ECG convincing any foreign car maker to invest in UK EV manufacturing is incredibly slim, said Hawes, as it's likely the £650 million purse would have run out by the time production could be ramped up.  In response to the fact that the ECG is also available to business buyers (who already get EV subsidies through favourable BIK tax rates), Hawes said the “objective of the government is to get EVs on the road, and that includes fleet, rightly or wrongly”.",
  "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/images/car-reviews/first-drives/legacy/byd-dolphin-surf-renault-5-citroen-e-c3-front-static_0.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eCar buyers are set to learn which models qualify for the UK government’s new \u003ca href=\"https://www.autocar.co.uk/car-news/consumer/government-launches-new-ev-grant-discount-%C2%A33750\"\u003eElectric Car Grant\u003c/a\u003e (ECG) on August 11.\u003c/p\u003e\n\u003cp\u003eSpeaking at a briefing to announce the UK’s latest automotive manufacturing figures, Society of Motor Manufactures and Traders (SMMT) boss Mike Hawes confirmed the August date and said he expected around one third of \u003ca href=\"https://www.autocar.co.uk/car-news/best-cars/best-electric-cars\"\u003eelectric cars\u003c/a\u003e on the market to qualify for the grant based on the criteria set out by government.\u003c/p\u003e\n\u003cp\u003eThis criteria includes not just a £37,000 cap for a qualifying model but also science-based targets around emissions from a car company and its models’ manufacturing location.\u003c/p\u003e\n\u003cp\u003eShould a car qualify, grants will be banded at either £1500 or £3750. \u003c/p\u003e\n\u003cp\u003eOn the basis that half the market is ruled out on price, that means around two thirds of EV model ranges with a sub-£37,000 model look set to qualify for a grant, based on early projections. \u003c/p\u003e\n\u003cp\u003eHawes confirmed that the automotive industry had not been consulted on the ECG ahead of its publication and said that while “any support is the right thing”, the fact that it “will help some but not all OEMs” isn\u0026#39;t ideal.\u003c/p\u003e\n\u003cp\u003eThe fact that some manufacturers and models would be denied access to the grant also meant that for them “the route to ZEV mandate compliance is worse\u0026#34; and \u0026#34;at £37,000 you split the market”. \u003c/p\u003e\n\u003cp\u003eThe SMMT had been advocating for VAT cuts on EVs sold to private buyers as a way of ensuring support was targeted at the area of the market that needed it most. \u003c/p\u003e\n\u003cp\u003e“We understand the ambition, but there is a lack of clarity,” said Hawes.\u003c/p\u003e\n\u003cp\u003eHawes believes that the ECG isn\u0026#39;t intended to disadvantage any particular region or manufacturer, despite cars originating from South Korea and China set to miss out, saying it looked to have been formulated to target “products with broader sustainability goals, not just zero tailpipe emissions”.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s also worth noting that “the government has said it will look to support local manufacturing if possible”, he added.\u003c/p\u003e\n\u003cp\u003eThe chances of access to the ECG convincing any foreign car maker to invest in UK EV manufacturing is incredibly slim, said Hawes, as it\u0026#39;s likely the £650 million purse would have run out by the time production could be ramped up. \u003c/p\u003e\n\u003cp\u003eIn response to the fact that the ECG is also available to business buyers (who already get EV subsidies through favourable BIK tax rates), Hawes said the “objective of the government is to get EVs on the road, and that includes fleet, rightly or wrongly”. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "1970-01-01T01:00:00Z",
  "modifiedTime": null
}
