{
  "id": "fba05f3c-ebf8-4787-9fe8-1666fa830313",
  "title": "Land Rover Defender Octa",
  "link": "https://www.autocar.co.uk/car-review/land-rover/defender-octa",
  "description": "Gaydon goes very large indeed on both performance and 4x4 capability for its very first ultimate Defender On a rutted, unsealed gravel road about 200 miles north of Cape Town, South Africa, a very special new Land Rover - the Defender Octa - is doing its thing. It’s been doing it all day, to be honest - over rock, sand, mud and asphalt. But right now, it’s hitting a truly spectacular and unbelievably composed stride.There is very little besides us on this dead-straight, bumpy stretch that beams out towards a horizon wonderfully broad and invitingly mountain-spiked. Local speed limits on minor roads like these are are ‘surprisingly high’, say our guides; and, led by them, our convoy soon finds itself approaching UK motorway speeds - on surfaces on which you simply wouldn’t contemplate going nearly so quickly unless utterly confident that you were driving a very rare and particular kind of performance car.Here and now, we’re probably carrying 40-50% more speed than you would dare in most modern fast SUVs - Porsche Cayenne, Lamborghini Urus and even Mercedes-AMG G-Class included - for fear of being bounced off course, blowing a tyre or simply losing control and careering heaven knows where. But this Land Rover is very evidently made of different stuff, and its chassis is simply cutting through the dust, clawing at terra firma underneath and sucking up what punishment it finds, staying incredibly level and composed all the while.And so, alongside names and reputations like the Ariel Nomad and Ford Ranger Raptor, we must now rank the Defender Octa: a fast 4x4 that, it seems, can do absolutely everything and go everywhere that a regular Defender 110 can but an awful lot more quickly.",
  "author": "",
  "published": "Mon, 20 Jan 2025 00:00:01 +0000",
  "source": "https://www.autocar.co.uk/rss",
  "categories": [
    "Car review"
  ],
  "byline": "Matt SaundersRoad test editor",
  "length": 20311,
  "excerpt": "Gaydon goes very large indeed on both performance and 4x4 capability for its very first ultimate Defender",
  "siteName": "Autocar",
  "favicon": "",
  "text": "Find Land Rover Defender Octa deals Other ServicesSell your car84% get more money with On a rutted, unsealed gravel road about 200 miles north of Cape Town, South Africa, a very special new Land Rover - the Defender Octa - is doing its thing. It’s been doing it all day, to be honest - over rock, sand, mud and asphalt. But right now, it’s hitting a truly spectacular and unbelievably composed stride. There is very little besides us on this dead-straight, bumpy stretch that beams out towards a horizon wonderfully broad and invitingly mountain-spiked. Local speed limits on minor roads like these are are ‘surprisingly high’, say our guides; and, led by them, our convoy soon finds itself approaching UK motorway speeds - on surfaces on which you simply wouldn’t contemplate going nearly so quickly unless utterly confident that you were driving a very rare and particular kind of performance car. Here and now, we’re probably carrying 40-50% more speed than you would dare in most modern fast SUVs - Porsche Cayenne, Lamborghini Urus and even Mercedes-AMG G-Class included - for fear of being bounced off course, blowing a tyre or simply losing control and careering heaven knows where. But this Land Rover is very evidently made of different stuff, and its chassis is simply cutting through the dust, clawing at terra firma underneath and sucking up what punishment it finds, staying incredibly level and composed all the while. And so, alongside names and reputations like the Ariel Nomad and Ford Ranger Raptor, we must now rank the Defender Octa: a fast 4x4 that, it seems, can do absolutely everything and go everywhere that a regular Defender 110 can but an awful lot more quickly. Verdict Ambitious, uncompromising technical makeover makes the Octa an even more capable and exciting off-roader than a regular Defender, if no conventional fast 4x4. GoodIncredible outright 4x4 capabilitySuspension makeover adds rally-car-like high-speed composure on dirt and gravelGives up no carrying versatility and very little touring comfortBadBoosted on-road handling dynamism is of moderately low priorityWill test the Defender's limits of acceptability on price DESIGN \u0026 STYLING9 Pros New axles boost 4x4 credentials to supreme levelsWheel-arch extensions and wide tracks add a new dimension to the Defender's visual toughness Cons It's particularly high and wide and fairly heavy Performance SUVs aren’t typically like this. So many come on more road-biased tyres than the bread-and-butter models on which they’re based and give up wheel travel, ground clearance and genuine dual-purpose capability. They pile on excessive power and speed and seek to justify their place by narrowing down on their dynamic brief. But in setting out to be the ultimate Defender, the Octa needed more of everything. More ground clearance and bigger approach and departure angles. More grip and handling dynamism - both on road and off it. More performance - but no less any-surface drivability. More driver appeal everywhere. No compromises anywhere. Chuck out the rulebook and start again. Land Rover addressed that challenge by taking the BMW-sourced, 627bhp, 4.4-litre turbo petrol V8 engine and eight-speed automatic gearbox that it recently lavished on the Range Rover Sport SV and adopting that car’s quickened steering rack and Tenneco ‘6D’ interlinked adaptive damping system – and then did a whole lot else besides. The Octa gets axle hardware entirely different from a regular Defender’s (longer wishbones, new hubs and uprights, new mountings and bushings and more). It sits on tracks wide enough to drool over, stretched by a herculean 68mm front and rear and covered by wickedly pumped-up wheel-arch extensions. But it also rides 28mm higher than a regular Defender, on air suspension that allows the car to hike itself up or hunker down with selected driving mode, just as does the regular car’s. And so it handles like a spinning top, right? Nope. The axle makeover creates extra capability, sure enough: wading depth boosted from 900 to 1000mm, a maximum departure angle taken from 40 to 43deg and maximum ground clearance of an epic 323mm (up from 291mm; entry stilts at the ready).  But crucially, it also allows the Octa’s axles to match those of a normal Defender for roll centre height – and concurrently for the car to keep its roll axis from migrating upwards along with its body profile. And so, despite standing so much taller than a standard Defender and having more wheel travel to put to use, the Octa doesn’t ever actually roll harder when cornering - and very often leans an awful lot less.  It's also the first modern Land Rover to come on factory-fitted all-terrain tyres: triple-ply Goodyear Wranglers tougher and more puncture-resistant even than regular ATs (although you can have road-biased Michelins or all-seasons if you prefer).  The 6D interlinked damping hydraulics have much to do with its uncanny body control on rough surfaces. That system, if you’re wondering, won’t currently package within the shortened chassis of a Defender 90 - which helps to explain why the Octa can only be had as a 110. But note also that up to 80% of the Defender’s sales volume (with a little variance depending on sales region) is accounted for by the 110. If that’s the right-sized model as far as so much of the customer base is concerned, it would have been silly for Gaydon to have started anywhere else. Pros Lots of outright space and useful cabin storagePerformance treatment is a subtle one and doesn't harm comfort levels Cons Side-hinged boot door can be a pain in tight parking spacesSix- and seven-seat interior layouts aren't available here Like any other Defender, then, the Octa is a car whose appeal is defined almost entirely by what it does. On the inside, but for the ‘chopped’ carbonfibre trim of Edition One trim level and some new, well-shaped, comfortable ‘body and soul’ bucket seats (which, like those of the Range Rover Sport SV, have built-in speakers that can broadcast bass-frequency sound directly at your backside; I’m still not entirely sure why), our test car had no performance-derivative cabin frippery at all. All the usual space and versatility is present. Coming as a 110 model only, the Octa offers four passenger doors, plus the wide-swinging, side-opening boot 'door' with the spare wheel attached – which you will likely have cause to curse in tight parking spaces for how tricky it can make boot access (and may be why so many Defender owners prefer parking nose-in). It's available only with a five-seat cabin layout. Look carefully and you will find one or two black diamond motifs - the badge ident of the Octa derivative - around the interior, most notably on the drive-mode button at six o'clock on the steering wheel, whose function we will come to shortly. Otherwise, the cabin offers lots of useful storage areas, lots of room for adults in both rows of seats and a useful quantity of physical secondary controls up front also.  JLR's Pivi Pro infotainment console proves mostly easy to navigate and has useful off-roading display modes (external cameras help you to judge the extremities of the car when driving over and around obstacles, for example). ENGINES \u0026 PERFORMANCE8 Pros BMW V8 is properly prepared and thoroughly retuned to work off-roadAutomatic gearbox allows excellent close control of momentum when crawling Cons Not as antisocially loud or eye-poppingly fast as rival hot SUVs To the function of that new button at the base of the steering boss, then. Prod it once to put the Octa into Dynamic mode (suspension set to low and firm, exhaust to noisy and stability control dialled back for fast road driving); hold it down to enter Octa mode. This maintains the car’s ride height but hikes its damping reserves; shifts its default four-wheel-drive torque split to about 80% rear; disables its roll stability control (RSC) system; and reprograms its traction and stability controls - and even its anti-lock brakes - for maximum fun “on the loose”. The quad-piped exhaust makes quite a lot more noise in Octa mode, too – although still perhaps not as much as it should. A Defender of this car's pace and capability should announce its presence more vocally than BMW's V8 allows, which is just a little muted and lacking in audible soul compared with the Mercedes-AMG G63, for example, or even the old Range Rover Sport SVR. The eight-speed automatic gearbox needs to be in S mode to hang onto gears and bring as much noise and attitude from the engine as possible. When it does, it makes the Octa feel rapid through the lower intermediate gears and up to about 70mph. After that, the Octa's sheer bulk and rather unaerodynamic body profile begin to prevent it from going quiet as hard as some rival performance 4x4s can, although it never feels underendowed or slow. It should also be noted that if you order a Octa on all-terrain tyres, it will come with a 99mph speed limiter. Less rugged all-season tyres or Michelin Primacy road tyres can be had as alternatives. RIDE \u0026 HANDLING8 Pros Loves to be hustled and hurried across harsh, gritty terrainHas a breadth of capability oceans wideMore indulgent and entertaining than a regular Defender on the right surface Cons Not as grippy or accurate on the road as more exotic rivals Even in its eponymous driving mode, the Octa doesn’t exactly dart into dusty 90deg corners or swivel and powerslide like some high-rise Lancia Stratos - but it’s plenty of fun all right. Land Rover has tuned it to be playful and adjustable as it progressively tucks itself into corners at speed, deliberately beginning to lock and bury its front wheels into the dirt under braking, thanks to special ABS tuning, and then rotating gamely around them. Stability then gathers with power and corrective steering angle, as you would probably want in a high-sided, 2.5-tonne car. The point is that you really can play with the Octa’s handling attitude on a trailing throttle and 'back it into' turns at will - as long as there’s room to. But you will need plenty of room. Widening the Defender’s already fulsome tracks certainly hasn’t made it feel any smaller and, on the road especially, it exhibits plenty of body roll in quicker bends.  Those all-terrain tyres don’t drum on the road quite as obstreperously as you might expect, and they allow the Octa an assured Tarmac grip level for a fast road car and a steering rack whose precision can certainly be enjoyed - up to a point. But if anywhere, this is where you will find the car’s key compromise - and, whether Gaydon admits it or not, it does impose one. Although it’s as quick as anything its size and profile needs to be, the Octa is really only a mildly enticing, exciting prospect on sealed roads. While very competent and comfortable, it just feels a bit like it’s between skits - or costume changes, if you prefer. And so you tend to just press on until the next hat is donned. And then you find, once you’ve flicked your way to the right Terrain Response 2 traction and driveline control mode, that it can hop, heave and gradually claw its way up a rocky 30deg incline with incredible confidence - and the sort of fine controllability of throttle, drive and momentum that makes you feel as if you can advance tread block by tread block when you need to.  Turn on Land Rover’s excellent off-roading cameras and you can watch as obstacles you would reckon unpassable simply pass right by underneath you without even a tap on a prone sill. Then, on sand, the superlative breadth of this car’s operating repertoire just keeps on unfolding. BMW’s V8 feels generously torquey even without big revs and is easy to keep simmering as the car shovels its way up and along the dunes. Over ruts, the authority of that damping system comes to the fore all over again, filtering out body pitch and vertical oscillation remarkably well and grabbing and controlling wheels that would otherwise be clattering into their top mounts. MPG \u0026 RUNNING COSTS6 Pros Not quite super-SUV money Cons It's still only a Defender, when you could buy a Porsche, Range Rover or any number of other more desirable rivals The Octa is being launched in special Edition One trim, a familiar kind of 'curated' limited-volume specification that combines particular paint and trim colours with some richer trim materials, which inflates a price that's already punchy. And so while £142,500 will be enough to get you into a regular Octa in time, for now it will take £158,000. That's not quite super-SUV money, nor will it get you into a G63, which may be the Octa's closest notional rival, but it will certainly take you deep into Cayenne territory – and it will test just how much people might desire a super-capable but undeniably functional and versatile Land Rover. VERDICT Verdict Ambitious, uncompromising technical makeover makes the Octa an even more capable and exciting off-roader than a regular Defender, if no conventional fast 4x4. GoodIncredible outright 4x4 capabilitySuspension makeover adds rally-car-like high-speed composure on dirt and gravelGives up no carrying versatility and very little touring comfortBadBoosted on-road handling dynamism is of moderately low priorityWill test the Defender's limits of acceptability on price The Octa is a phenomenally capable 4x4, and for Land Rover to have executed it by extending the already fathoms-wide breadth of the Defender’s capability, rather than narrowing or focusing it, is a very rare and singular tribute to the talents and determination of its engineers. As those engineers freely admit, however, you will have to look quite hard, quite a long way from the beaten track, to find something that a regular Defender won’t do that an Octa will. And when you find it, you may have to be prepared to go at it hard, which not everyone who has just spent £150,000 on their ultimate 4x4 may be prepared to do. But once you have? If you’re anything like me, you will be left somewhere between deeply impressed, highly entertained and just a little bit awestruck. For those truly adventurous of spirit, this extra-special off-roader should probably be in a class of one. It's tough, unusual and in so many ways a really compelling driver's car. TECHNICAL SPECS Model tested: Land Rover Defender Octa Edition One Price as tested: unspecified Engine: V8, 4395cc, twin-turbocharged, petrol; with mild-hybrid assist Transmission: 8-spd automatic Driveline layout: Front, longitudinal; four-wheel drive, with locking centre \u0026 rear diffs Model tested Land Rover Defender Octa Edition One Price as tested unspecified View all specs and rivals Engine V8, 4395cc, twin-turbocharged, petrol; with mild-hybrid assist Transmission 8-spd automatic Driveline layout Front, longitudinal; four-wheel drive, with locking centre \u0026 rear diffs Power 627bhp at 5800-7000rpm Torque 590lb ft at 1800-6000rpm (launch control only) Top speed 155mph (limited to 99mph on all-terrain tyres) Power 627bhp at 5800-7000rpm Torque 590lb ft at 1800-6000rpm (launch control only) Top speed 155mph (limited to 99mph on all-terrain tyres) Matt Saunders Title: Road test editor As Autocar’s chief car tester and reviewer, it’s Matt’s job to ensure the quality, objectivity, relevance and rigour of the entirety of Autocar’s reviews output, as well contributing a great many detailed road tests, group tests and drive reviews himself. Matt has been an Autocar staffer since the autumn of 2003, and has been lucky enough to work alongside some of the magazine’s best-known writers and contributors over that time. He served as staff writer, features editor, assistant editor and digital editor, before joining the road test desk in 2011. Since then he’s driven, measured, lap-timed, figured, and reported on cars as varied as the Bugatti Veyron, Rolls-Royce Phantom, Tesla Roadster, Ariel Hipercar, Tata Nano, McLaren Senna, Renault Twizy and Toyota Mirai. Among his wider personal highlights of the job have been covering Sebastien Loeb’s record-breaking run at Pikes Peak in 2013; doing 190mph on derestricted German autobahn in a Brabus Rocket; and driving McLaren’s legendary ‘XP5’ F1 prototype. His own car is a trusty Mazda CX-5. NewsletterGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send See our full privacy notice for more details Subscribe Never miss an issue of the world's oldest car magazine – subscribe to Autocar magazine today. Subscribe",
  "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/land-rover-defender-octa-review-2025-001.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \n    \u003cdiv id=\"chapter-introduction\"\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eFind Land Rover Defender Octa deals\u003c/p\u003e\n  \u003c/div\u003e\u003cp\u003eOther Services\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003eSell your car\u003c/p\u003e\u003cp\u003e84% get more money with \u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca target=\"_blank\" href=\"https://motorway.co.uk/partner/autocar?utm_source=autocar\u0026amp;utm_medium=affiliate\u0026amp;utm_campaign=reviews \"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/themes/custom/autocar/images/navigate_icon.svg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003eOn a rutted, unsealed gravel road about 200 miles north of Cape Town, South Africa, a very special new Land Rover - the \u003cstrong\u003eDefender Octa\u003c/strong\u003e - is doing its thing. It’s been doing it all day, to be honest - over rock, sand, mud and asphalt. But right now, it’s hitting a truly spectacular and unbelievably composed stride.\u003c/p\u003e\n\u003cp\u003eThere is very little besides us on this dead-straight, bumpy stretch that beams out towards a horizon wonderfully broad and invitingly mountain-spiked. Local speed limits on minor roads like these are are ‘surprisingly high’, say our guides; and, led by them, our convoy soon finds itself approaching UK motorway speeds - on surfaces on which you simply wouldn’t contemplate going nearly so quickly unless utterly confident that you were driving a very rare and particular kind of performance car.\u003c/p\u003e\n\u003cp\u003eHere and now, we’re probably carrying 40-50% more speed than you would dare in most modern fast SUVs - \u003ca href=\"https://www.autocar.co.uk/car-review/porsche/cayenne\"\u003ePorsche Cayenne\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/lamborghini/urus-se\"\u003eLamborghini Urus\u003c/a\u003e and even \u003ca href=\"https://www.autocar.co.uk/car-review/mercedes-amg/g-63\"\u003eMercedes-AMG G-Class\u003c/a\u003e included - for fear of being bounced off course, blowing a tyre or simply losing control and careering heaven knows where. But this Land Rover is very evidently made of different stuff, and its chassis is simply cutting through the dust, clawing at terra firma underneath and sucking up what punishment it finds, staying incredibly level and composed all the while.\u003c/p\u003e\u003c/div\u003e\n                    \n              \u003cdiv\u003e\n              \u003cdiv\u003e\u003cp\u003eAnd so, alongside names and reputations like the \u003ca href=\"https://www.autocar.co.uk/car-review/ariel/nomad\"\u003eAriel Nomad\u003c/a\u003e and \u003ca href=\"https://www.autocar.co.uk/car-review/ford/ranger-raptor\"\u003eFord Ranger Raptor\u003c/a\u003e, we must now rank the Defender Octa: a fast 4x4 that, it seems, can do absolutely everything and go everywhere that a regular \u003ca href=\"https://www.autocar.co.uk/car-review/land-rover/defender\"\u003eDefender 110\u003c/a\u003e can but an awful lot more quickly.\u003c/p\u003e\n\u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003eAmbitious, uncompromising technical makeover makes the Octa an even more capable and exciting off-roader than a regular Defender, if no conventional fast 4x4.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eIncredible outright 4x4 capability\u003c/p\u003e\u003cp\u003eSuspension makeover adds rally-car-like high-speed composure on dirt and gravel\u003c/p\u003e\u003cp\u003eGives up no carrying versatility and very little touring comfort\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eBoosted on-road handling dynamism is of moderately low priority\u003c/p\u003e\u003cp\u003eWill test the Defender\u0026#39;s limits of acceptability on price\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n            \u003c/div\u003e\n      \n  \n  \n    \n\n\n        \n  \n\n  \n\n  \n\u003cdiv data-id=\"design\" id=\"chapter-design\"\u003e\n      \n  \n      \u003cdiv\u003e\n                                            \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eDESIGN \u0026amp; STYLING\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e9\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eNew axles boost 4x4 credentials to supreme levels\u003c/p\u003e\u003cp\u003eWheel-arch extensions and wide tracks add a new dimension to the Defender\u0026#39;s visual toughness\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eIt\u0026#39;s particularly high and wide and fairly heavy\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003ePerformance SUVs aren’t typically like this. So many come on more road-biased tyres than the bread-and-butter models on which they’re based and give up wheel travel, ground clearance and genuine dual-purpose capability. They pile on excessive power and speed and seek to justify their place by narrowing down on their dynamic brief.\u003c/p\u003e\n\u003cp\u003eBut in setting out to be the ultimate Defender, the Octa needed more of everything. More ground clearance and bigger approach and departure angles. More grip and handling dynamism - both on road and off it. More performance - but no less any-surface drivability. More driver appeal everywhere. No compromises anywhere. Chuck out the rulebook and start again.\u003c/p\u003e\n\u003cp\u003eLand Rover addressed that challenge by taking the BMW-sourced, 627bhp, 4.4-litre turbo petrol V8 engine and eight-speed automatic gearbox that it recently lavished on the \u003ca href=\"https://www.autocar.co.uk/car-review/land-rover/range-rover-sport-sv\"\u003eRange Rover Sport SV\u003c/a\u003e and adopting that car’s quickened steering rack and Tenneco ‘6D’ interlinked adaptive damping system – and then did a whole lot else besides.\u003c/p\u003e\n\u003cp\u003eThe Octa gets axle hardware entirely different from a regular Defender’s (longer wishbones, new hubs and uprights, new mountings and bushings and more). It sits on tracks wide enough to drool over, stretched by a herculean 68mm front and rear and covered by wickedly pumped-up wheel-arch extensions. But it also rides 28mm higher than a regular Defender, on air suspension that allows the car to hike itself up or hunker down with selected driving mode, just as does the regular car’s.\u003c/p\u003e\n\u003cp\u003eAnd so it handles like a spinning top, right? Nope. The axle makeover creates extra capability, sure enough: wading depth boosted from 900 to 1000mm, a maximum departure angle taken from 40 to 43deg and maximum ground clearance of an epic 323mm (up from 291mm; entry stilts at the ready). \u003c/p\u003e\u003c/div\u003e                                          \u003c/div\u003e\n   \n                     \n            \u003cdiv\u003e\n\u003cp\u003eBut crucially, it also allows the Octa’s axles to match those of a normal Defender for roll centre height – and concurrently for the car to keep its roll axis from migrating upwards along with its body profile. And so, despite standing so much taller than a standard Defender and having more wheel travel to put to use, the Octa doesn’t ever actually roll harder when cornering - and very often leans an awful lot less. \u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s also the first modern Land Rover to come on factory-fitted all-terrain tyres: triple-ply Goodyear Wranglers tougher and more puncture-resistant even than regular ATs (although you can have road-biased Michelins or all-seasons if you prefer). \u003c/p\u003e\n\u003cp\u003eThe 6D interlinked damping hydraulics have much to do with its uncanny body control on rough surfaces. That system, if you’re wondering, won’t currently package within the shortened chassis of a Defender 90 - which helps to explain why the Octa can only be had as a 110. But note also that up to 80% of the Defender’s sales volume (with a little variance depending on sales region) is accounted for by the 110. If that’s the right-sized model as far as so much of the customer base is concerned, it would have been silly for Gaydon to have started anywhere else.\u003c/p\u003e\n\u003c/div\u003e\n        \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"interior\" id=\"chapter-interior\"\u003e\n                                        \n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eLots of outright space and useful cabin storage\u003c/p\u003e\u003cp\u003ePerformance treatment is a subtle one and doesn\u0026#39;t harm comfort levels\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eSide-hinged boot door can be a pain in tight parking spaces\u003c/p\u003e\u003cp\u003eSix- and seven-seat interior layouts aren\u0026#39;t available here\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eLike any other Defender, then, the Octa is a car whose appeal is defined almost entirely by what it does. On the inside, but for the ‘chopped’ carbonfibre trim of Edition One trim level and some new, well-shaped, comfortable ‘body and soul’ bucket seats (which, like those of the Range Rover Sport SV, have built-in speakers that can broadcast bass-frequency sound directly at your backside; I’m still not entirely sure why), our test car had no performance-derivative cabin frippery at all.\u003c/p\u003e\n\u003cp\u003eAll the usual space and versatility is present. Coming as a 110 model only, the Octa offers four passenger doors, plus the wide-swinging, side-opening boot \u0026#39;door\u0026#39; with the spare wheel attached – which you will likely have cause to curse in tight parking spaces for how tricky it can make boot access (and may be why so many Defender owners prefer parking nose-in). It\u0026#39;s available \u003cspan\u003eonly\u003c/span\u003e with a five-seat cabin layout.\u003c/p\u003e\n\u003cp\u003eLook carefully and you will find one or two black diamond motifs - the badge ident of the Octa derivative - around the interior, most notably on the drive-mode button at six o\u0026#39;clock on the steering wheel, whose function we will come to shortly.\u003c/p\u003e\n\u003cp\u003eOtherwise, the cabin offers lots of useful storage areas, lots of room for adults in both rows of seats and a useful quantity of physical secondary controls up front also. \u003c/p\u003e\n\u003cp\u003eJLR\u0026#39;s Pivi Pro infotainment console proves mostly easy to navigate and has useful off-roading display modes (external cameras help you to judge the extremities of the car when driving over and around obstacles, for example).\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\" height=\"600\" src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/body-image/public/land-rover-defender-octa-review-2025-018_0.jpg?itok=nyVh3SLV\" width=\"900\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n                                        \n                  \u003c/div\u003e\n  \n\n  \n\u003cdiv data-id=\"performance\" id=\"chapter-performance\"\u003e\n                                      \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eENGINES \u0026amp; PERFORMANCE\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eBMW V8 is properly prepared and thoroughly retuned to work off-road\u003c/p\u003e\u003cp\u003eAutomatic gearbox allows excellent close control of momentum when crawling\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eNot as antisocially loud or eye-poppingly fast as rival hot SUVs\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eTo the function of that new button at the base of the steering boss, then. Prod it once to put the Octa into Dynamic mode (suspension set to low and firm, exhaust to noisy and stability control dialled back for fast road driving); hold it down to enter Octa mode.\u003c/p\u003e\n\u003cp\u003eThis maintains the car’s ride height but hikes its damping reserves; shifts its default four-wheel-drive torque split to about 80% rear; disables its roll stability control (RSC) system; and reprograms its traction and stability controls - and even its anti-lock brakes - for maximum fun “on the loose”.\u003c/p\u003e\n\u003cp\u003eThe quad-piped exhaust makes quite a lot more noise in Octa mode, too – although still perhaps not as much as it should. A Defender of this car\u0026#39;s pace and capability should announce its presence more vocally than BMW\u0026#39;s V8 allows, which is just a little muted and lacking in audible soul compared with the Mercedes-AMG G63, for example, or even the old Range Rover Sport SVR.\u003c/p\u003e\n\u003cp\u003eThe eight-speed automatic gearbox needs to be in S mode to hang onto gears and bring as much noise and attitude from the engine as possible. When it does, it makes the Octa feel rapid through the lower intermediate gears and up to about 70mph. After that, the Octa\u0026#39;s sheer bulk and rather unaerodynamic body profile begin to prevent it from going quiet as hard as some rival performance 4x4s can, although it never feels underendowed or slow.\u003c/p\u003e\n\u003cp\u003eIt should also be noted that if you order a Octa on all-terrain tyres, it will come with a 99mph speed limiter. Less rugged all-season tyres or Michelin Primacy road tyres can be had as alternatives.\u003c/p\u003e\n\u003c/div\u003e\n                                                      \u003c/div\u003e\n    \n\n        \n\u003cdiv data-id=\"ride\" id=\"chapter-ride\"\u003e\n       \n  \n      \u003cdiv\u003e\n                                      \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eRIDE \u0026amp; HANDLING\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e8\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eLoves to be hustled and hurried across harsh, gritty terrain\u003c/p\u003e\u003cp\u003eHas a breadth of capability oceans wide\u003c/p\u003e\u003cp\u003eMore indulgent and entertaining than a regular Defender on the right surface\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eNot as grippy or accurate on the road as more exotic rivals\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eEven in its eponymous driving mode, the Octa doesn’t exactly dart into dusty 90deg corners or swivel and powerslide like some high-rise Lancia Stratos - but it’s plenty of fun all right.\u003c/p\u003e\n\u003cp\u003eLand Rover has tuned it to be playful and adjustable as it progressively tucks itself into corners at speed, deliberately beginning to lock and bury its front wheels into the dirt under braking, thanks to special ABS tuning, and then rotating gamely around them. Stability then gathers with power and corrective steering angle, as you would probably want in a high-sided, 2.5-tonne car. The point is that you really can play with the Octa’s handling attitude on a trailing throttle and \u0026#39;back it into\u0026#39; turns at will - as long as there’s room to.\u003c/p\u003e\u003cblockquote\u003e\u003c/blockquote\u003e\n\u003cp\u003eBut you will need plenty of room. Widening the Defender’s already fulsome tracks certainly hasn’t made it feel any smaller and, on the road especially, it exhibits plenty of body roll in quicker bends. \u003c/p\u003e\n\u003cp\u003eThose all-terrain tyres don’t drum on the road quite as obstreperously as you might expect, and they allow the Octa an assured Tarmac grip level for a fast road car and a steering rack whose precision can certainly be enjoyed - up to a point. But if anywhere, this is where you will find the car’s key compromise - and, whether Gaydon admits it or not, it does impose one.\u003c/p\u003e\u003c/div\u003e                                                      \u003c/div\u003e\n  \n                    \n            \u003cdiv\u003e\n\u003cp\u003eAlthough it’s as quick as anything its size and profile needs to be, the Octa is really only a mildly enticing, exciting prospect on sealed roads. While very competent and comfortable, it just feels a bit like it’s between skits - or costume changes, if you prefer.\u003c/p\u003e\n\u003cp\u003eAnd so you tend to just press on until the next hat is donned. And then you find, once you’ve flicked your way to the right Terrain Response 2 traction and driveline control mode, that it can hop, heave and gradually claw its way up a rocky 30deg incline with incredible confidence - and the sort of fine controllability of throttle, drive and momentum that makes you feel as if you can advance tread block by tread block when you need to. \u003c/p\u003e\n\u003cp\u003eTurn on Land Rover’s excellent off-roading cameras and you can watch as obstacles you would reckon unpassable simply pass right by underneath you without even a tap on a prone sill.\u003c/p\u003e\n\u003cp\u003eThen, on sand, the superlative breadth of this car’s operating repertoire just keeps on unfolding. BMW’s V8 feels generously torquey even without big revs and is easy to keep simmering as the car shovels its way up and along the dunes.\u003c/p\u003e\n\u003cp\u003eOver ruts, the authority of that damping system comes to the fore all over again, filtering out body pitch and vertical oscillation remarkably well and grabbing and controlling wheels that would otherwise be clattering into their top mounts.\u003c/p\u003e\u003c/div\u003e\n        \u003c/div\u003e\n \n\n \n\u003cdiv data-id=\"mpg\" id=\"chapter-mpg\"\u003e\n                                    \u003cdiv id=\"price_rating\"\u003e\u003ch2\u003eMPG \u0026amp; RUNNING COSTS\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e6\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003ePros\u003c/span\u003e\n        \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eNot quite super-SUV money\u003c/p\u003e\u003c/div\u003e\n      \u003c/div\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cspan\u003eCons\u003c/span\u003e\n      \u003c/p\u003e\n      \u003cdiv\u003e\u003cp\u003eIt\u0026#39;s still only a Defender, when you could buy a Porsche, Range Rover or any number of other more desirable rivals\u003c/p\u003e\u003c/div\u003e\n    \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cdiv\u003e\n\u003cp\u003eThe Octa is being launched in special Edition One trim, a familiar kind of \u0026#39;curated\u0026#39; limited-volume specification that combines particular paint and trim colours with some richer trim materials, which inflates a price that\u0026#39;s already punchy.\u003c/p\u003e\n\u003cp\u003eAnd so while £142,500 will be enough to get you into a regular Octa in time, for now it will take £158,000.\u003c/p\u003e\n\u003cp\u003eThat\u0026#39;s not quite super-SUV money, nor will it get you into a G63, which may be the Octa\u0026#39;s closest notional rival, but it will certainly take you deep into Cayenne territory – and it will test just how much people might desire a super-capable but undeniably functional and versatile Land Rover.\u003c/p\u003e\n\u003c/div\u003e\n                                                    \u003c/div\u003e\n \n\n  \n\n  \n\n\n\n \n\u003cdiv data-id=\"verdict\" id=\"chapter-verdict\"\u003e\n                                    \u003cdiv\u003e\n  \n      \n  \n  \u003cp id=\"price_rating\"\u003e\u003ch2\u003eVERDICT\u003c/h2\u003e\u003c/p\u003e\n  \n  \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003eVerdict\u003c/p\u003e\n      \n  \n  \u003cdiv\u003e\u003cp\u003eAmbitious, uncompromising technical makeover makes the Octa an even more capable and exciting off-roader than a regular Defender, if no conventional fast 4x4.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eGood\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eIncredible outright 4x4 capability\u003c/p\u003e\u003cp\u003eSuspension makeover adds rally-car-like high-speed composure on dirt and gravel\u003c/p\u003e\u003cp\u003eGives up no carrying versatility and very little touring comfort\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBad\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eBoosted on-road handling dynamism is of moderately low priority\u003c/p\u003e\u003cp\u003eWill test the Defender\u0026#39;s limits of acceptability on price\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003eThe Octa is a phenomenally capable 4x4, and for Land Rover to have executed it by extending the already fathoms-wide breadth of the Defender’s capability, rather than narrowing or focusing it, is a very rare and singular tribute to the talents and determination of its engineers.\u003c/p\u003e\n\u003cp\u003eAs those engineers freely admit, however, you will have to look quite hard, quite a long way from the beaten track, to find something that a regular Defender won’t do that an Octa will. And when you find it, you may have to be prepared to go at it hard, which not everyone who has just spent £150,000 on their ultimate 4x4 may be prepared to do.\u003c/p\u003e\n\u003cp\u003eBut once you have? If you’re anything like me, you will be left somewhere between deeply impressed, highly entertained and just a little bit awestruck. For those truly adventurous of spirit, this extra-special off-roader should probably be in a class of one. It\u0026#39;s tough, unusual and in so many ways a really compelling driver\u0026#39;s car.\u003c/p\u003e\n\u003c/div\u003e\n                                                    \u003c/div\u003e\n    \n          \u003cdiv\u003e\n                \u003cdiv\u003e\n  \u003cdiv\u003e\n    \u003cp\u003e\u003ch2\u003eTECHNICAL SPECS\u003c/h2\u003e\u003c/p\u003e\n    \u003cdiv\u003e\n      \n      \u003cdiv\u003e\n                  \u003cdiv\u003e\n            \u003cp\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/thumbnail/public/land-rover-defender-octa-review-2025-001.jpg?itok=-Adf_841\" alt=\"Land Rover Defender Octa review 2025 001\"/\u003e\u003c/p\u003e            \u003cdiv\u003e\n              \u003cp\u003eModel tested:\u003c/p\u003e\n              \u003cp\u003eLand Rover Defender Octa Edition One\u003c/p\u003e\n            \u003c/div\u003e\n          \u003c/div\u003e\n                  \n                  \u003cdiv\u003e\n              \u003cp\u003ePrice as tested:\u003c/p\u003e\n              \u003cp\u003eunspecified\u003c/p\u003e\n            \u003c/div\u003e\n                  \u003cdiv\u003e\n              \u003cp\u003eEngine:\u003c/p\u003e\n              \u003cp\u003eV8, 4395cc, twin-turbocharged, petrol; with mild-hybrid assist\u003c/p\u003e\n            \u003c/div\u003e\n                  \u003cdiv\u003e\n              \u003cp\u003eTransmission:\u003c/p\u003e\n              \u003cp\u003e8-spd automatic\u003c/p\u003e\n            \u003c/div\u003e\n                  \u003cdiv\u003e\n              \u003cp\u003eDriveline layout:\u003c/p\u003e\n              \u003cp\u003eFront, longitudinal; four-wheel drive, with locking centre \u0026amp; rear diffs\u003c/p\u003e\n            \u003c/div\u003e\n                \n                \n\n      \u003c/div\u003e\n      \n      \n      \u003cdiv\u003e\n                          \u003cdiv\u003e\n              \u003cp\u003eModel tested\u003c/p\u003e\n                              \u003cp\u003eLand Rover Defender Octa Edition One\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003ePrice as tested\u003c/p\u003e\n                              \u003cp\u003eunspecified\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                      \u003cp\u003eView all specs and rivals\u003c/p\u003e\n                                      \u003cdiv\u003e\n              \u003cp\u003eEngine\u003c/p\u003e\n                              \u003cp\u003eV8, 4395cc, twin-turbocharged, petrol; with mild-hybrid assist\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eTransmission\u003c/p\u003e\n                              \u003cp\u003e8-spd automatic\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eDriveline layout\u003c/p\u003e\n                              \u003cp\u003eFront, longitudinal; four-wheel drive, with locking centre \u0026amp; rear diffs\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003ePower\u003c/p\u003e\n                              \u003cp\u003e627bhp at 5800-7000rpm\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eTorque\u003c/p\u003e\n                              \u003cp\u003e590lb ft at 1800-6000rpm (launch control only)\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \u003cdiv\u003e\n              \u003cp\u003eTop speed\u003c/p\u003e\n                              \u003cp\u003e155mph (limited to 99mph on all-terrain tyres)\u003c/p\u003e\n                          \u003c/div\u003e\n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                      \n          \n                    \n                                  \u003c/div\u003e\n              \n          \u003c/div\u003e\n    \n      \u003c/div\u003e\n  \n    \u003cdiv\u003e\n                  \u003cdiv\u003e\n            \u003cp\u003ePower\u003c/p\u003e\n            \u003cp\u003e627bhp at 5800-7000rpm\u003c/p\u003e\n          \u003c/div\u003e\n                  \u003cdiv\u003e\n            \u003cp\u003eTorque\u003c/p\u003e\n            \u003cp\u003e590lb ft at 1800-6000rpm (launch control only)\u003c/p\u003e\n          \u003c/div\u003e\n                  \n                  \u003cdiv\u003e\n            \u003cp\u003eTop speed\u003c/p\u003e\n            \u003cp\u003e155mph (limited to 99mph on all-terrain tyres)\u003c/p\u003e\n          \u003c/div\u003e\n                  \n                  \n                  \n                  \n            \u003c/div\u003e\n    \n\u003c/div\u003e\n\u003csection id=\"outer_author_information\"\u003e\u003cblock id=\"author_information\"\u003e\u003cdiv\u003e\n\u003ch2\u003e\u003ca href=\"https://www.autocar.co.uk/users/matt-saunders\"\u003eMatt Saunders\u003c/a\u003e\u003c/h2\u003e\n  \u003cdiv\u003e\n\n    \u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/users/matt-saunders\"\u003e\u003cimg src=\"https://www.autocar.co.uk/sites/autocar.co.uk/files/matt-saunders-autocar.jpg\" width=\"150\" height=\"150\" alt=\"Matt Saunders Autocar\" title=\"Matt Saunders Autocar\"/\u003e\u003c/a\u003e      \u003c/p\u003e\n      \u003cp\u003e\u003cspan\u003eTitle:\u003c/span\u003e\n        \u003cspan\u003eRoad test editor\u003c/span\u003e\n            \u003c/p\u003e\n\n      \n\n    \u003c/div\u003e\n    \u003cdiv\u003e\n\u003cp\u003eAs Autocar’s chief car tester and reviewer, it’s Matt’s job to ensure the quality, objectivity, relevance and rigour of the entirety of Autocar’s reviews output, as well contributing a great many detailed road tests, group tests and drive reviews himself.\u003c/p\u003e\n\u003cp\u003eMatt has been an Autocar staffer since the autumn of 2003, and has been lucky enough to work alongside some of the magazine’s best-known writers and contributors over that time. He served as staff writer, features editor, assistant editor and digital editor, before joining the road test desk in 2011.\u003c/p\u003e\n\u003cp\u003eSince then he’s driven, measured, lap-timed, figured, and reported on cars as varied as the \u003ca href=\"https://www.autocar.co.uk/car-review/bugatti/veyron-2005-2015\"\u003eBugatti Veyron\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/rolls-royce/phantom\"\u003eRolls-Royce Phantom\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/tesla/roadster-2008-2012\"\u003eTesla Roadster\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/ariel/hipercar\"\u003eAriel Hipercar\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/tata/nano\"\u003eTata Nano\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/mclaren/senna\"\u003eMcLaren Senna\u003c/a\u003e, \u003ca href=\"https://www.autocar.co.uk/car-review/renault/twizy\"\u003eRenault Twizy\u003c/a\u003e and \u003ca href=\"https://www.autocar.co.uk/car-review/toyota/mirai\"\u003eToyota Mirai\u003c/a\u003e. Among his wider personal highlights of the job have been covering Sebastien Loeb’s record-breaking run at Pikes Peak in 2013; \u003cspan\u003edoing 190mph on derestricted German autobahn in a Brabus Rocket; \u003c/span\u003eand driving McLaren’s legendary ‘XP5’ F1 prototype. His own car is a trusty Mazda CX-5.\u003c/p\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n\u003c/div\u003e\u003c/block\u003e\u003c/section\u003e\n\u003cdiv\u003e\n  \n      \n  \n  \u003cdiv id=\"signup-replace\"\u003e\u003ch4\u003e\u003ca href=\"https://p.autocar.co.uk/signup\" target=\"_blank\" id=\"edit-0--2\"\u003eNewsletter\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u003cspan\u003eGet all the best car news, reviews and opinions direct to your inbox three times a week. You can unsubscribe via any email we send\u003c/span\u003e\n\u003cspan\u003eSee our full \u003cstrong\u003e\u003ca href=\"https://www.haymarket.com/privacy-policy/\" target=\"_blank\"\u003eprivacy notice\u003c/a\u003e\u003c/strong\u003e for more details\u003c/span\u003e\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\u003c/h4\u003e\n      \u003cp\u003e\u003cspan\u003eNever miss an issue of the world\u0026#39;s oldest car magazine – subscribe to Autocar magazine today.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n    \u003cp\u003e\u003ca href=\"https://www.autocar.co.uk/magazine-subscriptions\" target=\"_blank\"\u003eSubscribe\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\n\n  \n  \u003c/div\u003e\n              \u003c/div\u003e\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "22 min read",
  "publishedTime": null,
  "modifiedTime": null
}
