[
  {
    "id": "0b0fe5de-2716-4ed5-9889-4a2e7bf4c0d0",
    "title": "Laneige Glaze Craze Tinted Polypeptide Lip Serum",
    "link": "https://thebeautylookbook.com/2025/02/laneige-glaze-craze-tinted-polypeptide-lip-serum.html",
    "description": "Laneige Glaze Craze Tinted Polypeptide Lip Serums. Review + swatches of the new donut-inspired tinted lip serums from Laneige.",
    "author": "Sabrina",
    "published": "Mon, 24 Feb 2025 21:25:55 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/02/Laneige-Glaze-Craze-Tinted-Lip-Serum-Review-SABRINA-BEAUTYLOOKBOOK.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/lips' target='_blank' style='color:currentColor;text-decoration:none;'\u003eLips\u003c/a\u003e"
    ]
  },
  {
    "id": "2f88c8ca-a964-47f6-bee6-fb870802fc80",
    "title": "Natasha Denona Hy-Blush Cloudy Cream Cheek Duo",
    "link": "https://thebeautylookbook.com/2025/02/natasha-denona-hy-blush-cloudy-cream-cheek-duo.html",
    "description": "Natasha Denona Hy-Blush Cloudy Cream Cheek Duo. Swatching the new cheek duos for spring.",
    "author": "Sabrina",
    "published": "Wed, 12 Feb 2025 14:03:37 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/02/Natasha-Denona-Hy-Blush-Review-beautylookbook.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/brand/natasha-denona' target='_blank' style='color:currentColor;text-decoration:none;'\u003eNatasha Denona\u003c/a\u003e",
      "Natasha Denona"
    ]
  },
  {
    "id": "6643cb7d-422a-4ae3-97fd-285a5088a50e",
    "title": "Experts Swear By These Lip Treatments for Chronically Chapped Lips",
    "link": "https://www.elle.com/beauty/makeup-skin-care/g63906135/best-lip-treatments/",
    "description": "Including lip peels, masks, and balms.",
    "author": "",
    "published": "Tue, 25 Feb 2025 22:47:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "83c52fff-8bf4-4da0-bac7-4515c53ab621",
    "title": "Here’s Why Hydrogel Face Masks Are Better Than Your Favorite Formulas",
    "link": "https://www.elle.com/beauty/makeup-skin-care/g63902509/best-hydrogel-face-masks/",
    "description": "Once you try one, you’ll never look back.",
    "author": "",
    "published": "Tue, 25 Feb 2025 22:19:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "b8d564ba-9ef0-4e52-ae92-2b3c653cc51d",
    "title": "Digi Beauty: A Press-On Nail Brand Targeting Gen Z and Gen Alpha With Colorful Designs",
    "link": "https://fashionista.com/2025/02/digi-beauty-press-on-nails-brand",
    "description": "Brand Bio is Fashionista's guide to the best independent fashion and beauty brands — a resource for retailers, job seekers, B2B companies and consumers alike. If you'd like your brand to be featured, fill out this form. Digi BeautyHeadquarters: Los Angeles, CAE-commerce: digibeauty.comSocial Media: ...Continue reading",
    "author": "Fashionista",
    "published": "Mon, 24 Feb 2025 16:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyNzkyMDUzMzY4MTA0NTc2/digi-beauty-brand-bio-1.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "nails",
      "Brand Bio Nail Care",
      "Digi Beauty",
      "Brand Bio",
      "Gen Z",
      "Brand Bio Beauty",
      "Gen Alpha",
      "Network",
      "Indie Beauty",
      "Shopping",
      "Beauty"
    ]
  },
  {
    "id": "64c5f92c-bd89-4c82-963e-c2e7a9c4e695",
    "title": "Lilis: A Luxury Korean Body-Care Brand Merging 'Skin-Care Innovation and Spa Culture'",
    "link": "https://fashionista.com/2025/02/lilis-body-care-brand",
    "description": "Brand Bio is Fashionista's guide to the best independent fashion and beauty brands — a resource for retailers, job seekers, B2B companies and consumers alike. If you'd like your brand to be featured, fill out this form. LilisHeadquarters: New York, NYE-commerce: lilis.coSocial Media: Instagram ...Continue reading",
    "author": "Fashionista",
    "published": "Fri, 21 Feb 2025 13:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyNzkxMzQ3MzgyMzMxMDA4/lilis-brand-bio.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Lilis",
      "Brand Bio Skin Care",
      "Network",
      "Shopping",
      "Indie Beauty",
      "Skin Care",
      "Brand Bio Beauty",
      "Brand Bio",
      "Beauty"
    ]
  },
  {
    "id": "8bb2ac31-7f8d-4e04-8363-f66529681210",
    "title": "ITG Goes To Fashion Week – Fall ‘25 Edition",
    "link": "https://intothegloss.com/2025/02/nyfw-best-beauty-fall-winter-2025/",
    "description": "Feat. Diotima, Sandy Liang, Luar + Christopher John Rogers (and more!)",
    "author": "",
    "published": "Thu, 20 Feb 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "4d904395-984a-46a1-b592-b259b30f5e19",
    "title": "The Sauna To Baby Pipeline",
    "link": "https://intothegloss.com/2025/02/richelle-dom-marty-plump-skincare-routine/",
    "description": "A Valentine's Day story for you",
    "author": "",
    "published": "Fri, 14 Feb 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "b8997689-ae2c-43d5-9aa0-533151280c0a",
    "title": "Nordstrom Anniversary Sale Haul Try-On",
    "link": "http://www.frmheadtotoe.com/2020/08/nordstrom-anniversary-sale-try-on.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-17T12:17:00.016-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "38f40ce6-975a-48b5-b702-6e60f78ab1a8",
    "title": "Best In-Stock Items! Nordstrom Anniversary Sale Picks 2020",
    "link": "http://www.frmheadtotoe.com/2020/08/best-in-stock-items-nordstrom.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-13T11:38:00.002-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "84a47fcf-36e5-49f6-b2c8-8db57754ea7f",
    "title": "7 Skincare Products Experts Ditch Before Spring (\u0026 What They Use Instead)",
    "link": "https://www.refinery29.com/en-us/skincare-products-stop-using-cold-weather?utm_source=feed\u0026utm_medium=rss",
    "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Along with the gloomy weather, the transitional period between winter and early spring brings forth myriad skincare challenges. Think dry skin, dullness, and chapped lips, to name a few. Some products just don’t cut it in when the air is cold and dry, as they are either not hydrating enough or too harsh on already-compromised skin. I speak to dermatologists and beauty experts for a living, and one piece of advice I hear time and again is to make subtle tweaks to your skincare routines around different times of year to adapt to your skin’s changing needs. So which products are they phasing out for the season, and which ones are they using instead? I’ve made it my mission to find out. Ahead, I spoke to a handful of dermatologists and skincare experts to find out the formulas they tend to sideline between winter and spring — and more importantly, the replacements they are bringing back into the fold. From swapping out foaming cleansers for gentler alternatives to ditching certain ingredients in favor of others, their recommendations will help keep your skin watered, balanced, and glowing through February and beyond. The following quotes have been edited for clarity and length. DashDividers_1_500x100 Skip: Your foaming cleanser Use instead: Uriage Cleansing Oil, $21.69 “I tend to skip foaming cleansers because they often contain harsher surfactants that can strip the skin of its natural oils — and the colder weather already dries out my skin. During the winter and months leading up to spring, the skin needs extra hydration and protection so I prefer to use more hydrating, gentle cleansers that help maintain my skin’s barrier. Consider an oil-based option like the Uriage Cleansing Oil, $21.69. Oil-based cleansers help remove impurities and maintain the skin’s moisture barrier while being gentle — without stripping essential oils, which is crucial during harsher winter months. Additionally, their nourishing properties help keep my skin soft and hydrated.” — Dr Derrick Phillips, consultant dermatologist Shop our favorite cleansing oils DashDividers_1_500x100 Skip: Your face oil Use instead: Chanel No. 1 De Chanel Revitalizing Serum, $165 “I’ve invested more time in my gua sha routine during the colder months, as it noticeably improves my skin’s firmness. While I used to rely on sunflower seed oil for its emollient benefits, my skin has become more sensitive, leading to breakouts. I’ve since moved on to the No. 1 De Chanel Revitalizing Serum, $165. Its lightweight formula — packed with moisturizing glycerin — lends enough slip for my gua sha tool without tugging and dragging at my skin, or clogging my pores. The star ingredient is red camellia extract, an antioxidant that boosts the skin’s radiance and firmness. I pair it with the No. 1 De Chanel Massage Accessory, $70, a tool that boasts 85% bio-based materials and features a ridged side for gentle exfoliation. Together, they keep my skin glowy and plump. When I finish the routine with a dose of No. 1 De Chanel Red Camellia Cream, $120, my hydration levels are even more enhanced.” — Venus Wong, Refinery29 senior writer Shop our favorite serums DashDividers_1_500x100 Skip: Your exfoliating scrub Use instead: SkinCeuticals Triple Lipid Restore Moisturizer, $155 “The colder weather makes skin dry, and abrasive scrubs with rough, physical exfoliants can irritate or strip away too much of the skin’s natural oils. Instead, look for [milder cleansers] with hydrating ingredients like glycerin, aloe, or ceramides. These ingredients help maintain moisture balance while still effectively cleansing. I’ve found that [such] cleansers leave skin feeling soft, fresh and nourished, without the dry, tight sensation that harsher exfoliants can cause. “This is [also] a time when skin needs extra hydration and protection. [Besides a mild cleanser] I’d recommend a richer, cream-based moisturizer to keep skin hydrated and prevent moisture loss. One of my top picks is SkinCeuticals Triple Lipid Restore, $155. Not only is it hydrating, but it also helps replenish the skin’s natural lipids, which are often depleted in colder weather. It’s rich without being too heavy or greasy, leaving the skin feeling soft and nourished.” — Dr Edel Woods, consultant dermatologist and founder of ORA Skin Clinic Shop our favorite rich moisturizers DashDividers_1_500x100 Skip: Your lightweight body lotion Use instead: La Roche-Posay Lipikar Baume AP+M, $17.99 “I tend to skip lightweight body lotions in the colder months, as the formulation feels too light. My legs get particularly dry and wearing tights worsens this. I replace my body lotion with La Roche-Posay Lipikar Baume AP+M, $17.99. I don’t like anything that feels too heavy or sticky, and this one still melts into my skin, which feels better hydrated. It combines humectants (like glycerin, which draws in moisture), with emollients (such as shea butter) to soften the skin. There are also prebiotics to balance the microbiome of the skin barrier [the outermost layer of skin] so that it hydrates my body effectively.” — Dr Ellie Rashid, consultant dermatologist and pro medical director of Klira Shop our favorite moisturizing body balms DashDividers_1_500x100 Skip: Your lip balm Use instead: The Ordinary 7% Glycolic Acid Exfoliating Toner, $8.70 “My lips always bear the brunt of the changing weather. You might instinctively reach for lip balm, but I need something a little stronger to tackle flaky skin — otherwise, I’ll end up picking at it. Enter: glycolic acid. This potent alpha hydroxy acid (AHA) is an excellent exfoliator, effortlessly sweeping away dry, peeling skin. I recently had the chance to try dermatologist Dr. Idriss’ Barrier Baste Lip Peel, which harnesses the power of glycolic acid. “In the past, I’ve used The Ordinary 7% Glycolic Acid Exfoliating Toner, $8.70, on a cotton swab, followed by a rich moisturizer — something substantial like La Roche-Posay Cicaplast Baume B5, $18.99, — and the results have been impressive. Dr Idriss calls this method “lip basting”, and it’s a simple yet game-changing way to step up your lip care routine during transitional weather.” — Jacqueline Kilikita, Refinery29 beauty director Shop our favorite glycolic acid treatments DashDividers_1_500x100 Skip: Your sulphate face wash Use instead: Avène Tolerance Control Extremely Gentle Cleanser, $27 “Foaming cleansers, especially those with sulphates like sodium lauryl sulfate (SLS), can be too harsh in the colder months. While they effectively remove oil and debris, they also strip away essential lipids, leaving the skin dry, tight and more prone to irritation — especially when the skin barrier is already compromised. For my patients with more sensitive skin types, I recommend the Avène Tolerance Control Extremely Gentle Cleanser, $27. This ultra-mild, creamy cleanser is soap-free, fragrance-free and formulated with minimal ingredients to support the skin’s natural barrier. It relies on Avène’s signature thermal spring water and a milky, lotion-like texture to cleanse without disrupting hydration. It’s perfect for winter and early spring, especially for dry, sensitive, or reactive skin.” — Dr Ashley Magovern, consultant dermatologist and Dermstore medical advisory board member Alternatively, use: iS Clinical Cleansing Complex, $49 “I recommend the iS Clinical Cleansing Complex, $49, to patients with oily or acne-prone skin. This gel-based cleanser is gentle but deeply cleans the skin without disrupting its natural moisture balance. It contains antioxidants and mild resurfacing ingredients, such as white willow bark (a natural form of salicylic acid), which help with congestion without overdrying. This cleanser works well for all skin types, including sensitive skin.” — Dr Ashley Magovern, consultant dermatologist and Dermstore medical advisory board member Shop our favorite gentle cleansers DashDividers_1_500x100 Skip: Your petroleum jelly ointment Use instead: A hand cream with ceramides and urea, like Eucerin Urea Repair Plus 5% Hand Cream, $14.99 “I wouldn’t recommend applying just petroleum jelly on the hands, since it’s an occlusive [an ingredient that forms a protective layer on the skin but isn’t particularly moisturising when used on its own]. If your hands are very dry, you ideally need to have a moisturizer with ceramides to hydrate the skin from within. [Ceramides are lipids, or fat molecules, that make up your skin’s natural barrier and help retain moisture, keeping the skin smooth, plump and hydrated.] I’d also suggest looking for a hand cream with urea, which helps remove the dead skin cell build-up and further draws water into the skin for hydration.” — Dr Zainab Laftah, consultant dermatologist \u0026 British Skin Foundation spokesperson Based on Dr Laftah’s advice, we recommend trying Eucerin Urea Repair Plus 5% Hand Cream, $14.99. It’s rich in both urea and ceramides and is adored for its ability to alleviate cracks and flakiness on the hands, especially for people with contact dermatitis. If you really want to lock that moisture in, that’s when sealing your hand cream with a top layer of a petroleum jelly product, like Vaseline, can come in: This technique is also known as ‘hand slugging’. Shop our favorite hand creams Like what you see? How about some more R29 goodness, right here?I Tried $195 Worth Of Hand Creams To Find The BestI Tried Every Clinique Black Honey Makeup ProductThe Ordinary's New Serum Ended My Botox Obsession",
    "author": "Venus Wong",
    "published": "Tue, 25 Feb 2025 22:23:08 +0000",
    "image": "https://www.refinery29.com/images/11856665.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "4e067a39-e5dc-4a0b-8026-85700631ebdb",
    "title": "Refinery29 Loves: Everything To See \u0026 Shop In February",
    "link": "https://www.refinery29.com/en-us/fashion-beauty-news-february?utm_source=feed\u0026utm_medium=rss",
    "description": "Welcome to Refinery29 Loves, the monthly news bulletin where you’ll find our editor-approved lineup of the best to shop and see in fashion and beauty right now.Fashion Month is finally here to save us from the cold, dark winter nights. Just kidding, it’s still going to be cold and dark, but that doesn’t mean we can’t enjoy watching some outrageous beauty and fashion moments while firmly wrapped up inside in our blankets. Of course, we’ve already had a little taste of what’s to come thanks to Men’s Fashion Week and Couture Week taking over Paris, as well as Copenhagen Fashion Week landing in Denmark’s capital. Tyla took on sub-zero temperatures by turning heads in a navy side slit dress at the Jacquemus Spring/Summer 2025 show and Jenna Ortega proved that black is the new black with her ultra-chic goth girl ensemble at Christian Dior. There were plenty of eye-catching looks on the runways, too, with Willy Chavarria making the case for barely there brows and red hot lips and Schiaparelli proving that sometimes it’s about not overtaking the outfit by embracing a minimalistic slick-back bun. Plus, Copenhagen has been serving us all the street style inspo, with colored faux fur jackets, knitted hoods, and office-appropriate neck ties going straight on our mood boards.As we head into the marathon of women’s shows lined up across New York, London, Milan, and Paris we’re still keeping one eye on all of the major fashion and beauty drops happening across February. From a designer luggage collaboration to a new bouncy mascara, click through to discover all the new launches heading your way this month. Beyoncé and Levi’s Launch Chapter 2When Beyoncé dropped “Levi’s Jeans” on her Grammy-winning album, Cowboy Carter, it was all but inevitable that the superstar would team up with the iconic denim brand in some way. After reimagining a 1985 laundromat-set ad last year, Beyoncé is back with Chapter 2 of her Levi’s Campaign, this time reimagining a 1991 ad. Set to the backdrop of the musician’s country-tinged track, the video (directed by Melina Matsoukas) stars Beyoncé clad in a bedazzled denim outfit at a pool hall, where she takes on Justified actor Timothy Olyphant in a game. Highlighted pieces include Levi’s Ribcage Wide Leg Jeans, Braided Vest, and Spade Trench. “There isn’t another wardrobe piece that evokes comfort, modern elegance, classic Americana attire, and nostalgia the way denim does,” Beyoncé said in a press release.  “And when I think of all those things, I think of Levi’s. For the second chapter in our collaboration we had even more fun in reimagining the denim on denim narrative, through the lens of a woman, who can be sexy, bold and a fierce competitor, all at once. We wanted to celebrate the duality of grace and power.” J.Crew Partners with Barbour to Create the Perfect Barn Jacket J.Crew is teaming up with UK heritage brand Barbour for the first time since 2019, combining creative forces to make the perfect barn jacket. The pair’s answer to the on-trend outerwear piece is made with transitional-weather-friendly waxed cotton, lined with Barbour’s signature tartan, and features a corduroy collar. The limited-edition unisex jacket is available for $425. Shop now at J.Crew. J.Crew x Barbour Limited-Edition Barn Jacket, $, available at J.CrewVictoria's Secret Launches Designer Collaboration With AltuzarraVictoria’s Secret has unveiled a new designer series: Atelier Victoria’s Secret x Alturzarra. The collaboration names New York-based designer Joseph Altuzarra as the lingerie brand’s first-ever designer in residence, a title under which he will create a number of limited-edition collections throughout the year. The debut spring 2025 collection features 11 pieces focused on closet basics, such as a bodysuit in the style of a classic white button-up shirt, a satin trench coat, tailored black trousers, a knit cropped cardigan, and a fitted wool blazer. “With this partnership, I wanted to bring my perspective to a brand known for celebrating femininity and sensuality,” Altuzarra said in a press release. “I focused on pieces that felt effortless and sensual, and imbued them with subtle elements of discovery — classic wardrobe styles, but always with a twist.” Prices range from $95 to $500.Shop now at Victoria’s Secret Atelier Victoria's Secret x Altuzarra Satin Bias-Cut Dress, $, available at Victoria's SecretMango Launches Selection Collection Mango has dropped a new edition of its Selection Collection — a premium line that emphasizes high-level tailoring and luxe fabrics — for warm weather. Created with stylist Malina Joseph Gilcrest, the new drop digs into the contrasts of masculine and feminine wear with an array of structured and fluid pieces. Find high-neck silk blouses, oversized soft suits, trenches and leather jackets, a see-through knitted dress with long fringe, and so much more. The Mango Selection Spring/Summer 2025 Collection is available now, with prices ranging from $39.99 to $649.99.Shop now at Mango. Mango Oversized Trench Coat with Lapels, $, available at MangoMango Short Chiffon Combined Dress, $, available at MangoMango Animal-Print Open-Back Leather Heeled Shoes, $, available at MangoStarface x Hello KittyStarface stickers are often seen to adorn famous faces including Justin Bieber, PinkPantheress, and Anne Hathaway to name just a few. This month, the skincare brand is flipping the switch, putting the famous faces on the stickers themselves. Returning after a long hiatus, the new drop features the beloved Hello Kitty cartoon characters, this time introducing two new friends into the fold: classic red bow Hello Kitty, bunny-eared My Melody, and black hat-wearing Kuromi. Plus, the collection also comes with a Hello Kitty Apple Star Lip Balm made with moisturizing shea butter and sweet apples.Shop now at StarfaceStarface Big Hello Kitty, $, available at StarfaceLouis Vuitton Launches LV Biker BagA new luxury handbag style is about to take over this spring, courtesy of Louis Vuitton: the LV Biker. Originally debuting during the fashion house’s SS25 runway show, the leather bag is inspired by biker jackets, featuring side straps and buckles similar to LV’s iconic trunks. Available in three sizes, the bag is also ultra versatile: it can be worn as a clutch, on the elbow, over the shoulders, or as a cross-body, and it boasts a collapsible construction for easy storage, too.  Shop now at Louis Vuitton Louis Vuitton LV Biker PM, $, available at Louis VuittonHalfdays x ILIA Collaboration Winter is wintering, which means two things are an absolute must: hydrating skincare and big warm layers. Thankfully, outdoor apparel label Halfdays has launched a collaboration with this in mind, teaming up with beauty brand ILIA on a limited-edition ski suit and face cream duo. For those hitting the slopes, the set includes the bestselling Lawrence jacket and Alessandra pants in ILIA’s natural lip blush shade, with each order coming with a full size of the lightweight Barrier Build Skin Protectant Cream.Shop now at HalfdaysILIA x Halfdays Lawrence Jacket, $, available at HalfdaysGloRilla Becomes The First-Ever Savage X Fenty, Fenty Beauty, Fenty Skin + Fenty Hair Exclusive PartnerFor the first time ever, all of Rihanna’s covetable Fenty lines — Savage X Fenty, Fenty Beauty, Fenty Skin, and Fenty Hair — have the same partner: GloRilla. The Grammy-nominated rapper was personally chosen by Rihanna for her authenticity and unapologetic style, and will star in Spring 2025 campaigns sporting products from each of the brands. “Rihanna has always been such an icon and inspiration and being chosen to represent her vision across Savage X Fenty and Fenty Beauty is an honor,” GloRilla said in a press release. “This spring season is all about celebrating confidence, boldness, and embracing your glow.\"  Shop now at Savage X Fenty.Savage x Fenty Puff Cherries String Bikini Panty, $, available at Savage x FentySavage x Fenty Puff Cherries Unlined Demi Bra, $, available at Savage x FentyJ.Crew x New YorkerTwo New York City stalwarts have joined forces: To celebrate The New Yorker’s 100th anniversary, heritage brand J.Crew has launched a capsule collection inspired by the media institution. Find on-trend rugby shirts, graphic tees (with signature cartoons etched across), and classic logo canvas totes that fuse the fashion label’s preppy style with the outlet’s timeless aesthetic. Prices range from $32.50 to $168.Shop now at J.Crew J.Crew x The New Yorker Étienne Oversized Shirt, $, available at J.CrewReformation Clara Cashmere Crew Cardigan Color Extension Cozy cardigan season is in full effect and lucky for us, Reformation is expanding its uber-popular Clara Cashmere Cardigan family (Olivia Rodrigo and Keke Palmer are fans!) with a whole bunch of new colorways. Made using a fine 5 percent cashmere and 95 percent recycled cashmere blend, the new selection includes a grey-and-baby pink argyle print and a sherbet lemon cable knit (our favorites!), as well as two other colorways. We expect the new drop to sell out faster than you say “hand wash only.”Shop at ReformationReformation Clara Cashmere Crew Cardigan, $, available at ReformationBenefit Badgal BOUNCE! Mascara Benefit has a long line of steadfast mascara fans thanks to its best-selling BADgal BANG and Roller Lash formulas. Now, the San Francisco-based beauty brand is bringing beauty lovers an entirely new lash-lengthening product. Introducing: BADgal Bounce. It’s all about creating fluttery, fluffy lashes thanks to the brush, which boasts a fine-tooth plastic comb on one side and full fiber bristles on the other. Packed with ingredients including provitamin B5 and castor seed oil for moisturizing lashes, not to mention rice wax for separation and definition, this promises to be the most volumizing formula yet.  Shop now at BenefitBenefit BADgal Bounce, $, available at BenefitCos Launches Alcove BagCos has just launched your next go-to handbag: the Alcove. Available in buttery black leather and rich brown and moss-green suedes, the Alove is a sculptural tote that folds over its center and features a top handle that can comfortably fit over your shoulder and a detachable zip-up pouch. Find it in stores and online for $320. Shop now at Cos COS Alcove Tote, $, available at COSRowen Rose x CasalinaThere was a time when Lauren Mize and Lamar McKinley, founders of resortwear online shopping platform Casalina, carried around an image — a model wearing a red-and-white striped bikini with a matching skirt — from Rowen Rose’s spring/summer 2023 collection. That’s how much the duo loves the Paris-based label. So, naturally, when they were ready to launch Casalina’s first fashion collaboration, they wanted it to be with Rowen Rose. Enter the new Rowen Rose x Casalina collection, which was inspired by the Amalfi Coast and the image Mize and McKinley held dear. The limited-edition capsule features five styles — all of which are red — that can be mixed and matched: a one-piece swimsuit with a keyhole cut-out, a bikini, a maxi skirt, and two vacation-ready dresses. Prices range from $230 to $525. Shop now at Casalina. Rowen Rose x Casalina Amalfi Dress, $, available at CasalinaMedik8 Liquid Peptides SerumIf you haven’t heard about growth factors by now, let us catch you up. Essentially a type of peptide, or protein, growth factors can stimulate skin cell growth over time, boosting the collagen and elastin which naturally depletes as we age. When used in skincare, they can have promising results for fine lines, with some calling growth factors \"Botox in a bottle\" — hence why they feature in Medik8’s latest serum. Packed with Dual MiniProteins™, the serum aims to combine the \"deep penetration of peptides with the enhanced potency of proteins\" helping to support skin structure and bring back firmness to the face. Further enhanced by moisture-grabbing hyaluronic acid and a skin barrier-saving prebiotic complex, the serum is all about achieving smoother skin.Shop now at Medik8Medik8 Liquid Peptides Advanced Face Serum, $, available at Medik8RIMOWA x Rick Owens It just got even more exciting to travel with a Rimowa suitcase. The high-end suitcase brand has teamed up with the Lord of Darkness himself, aka legendary designer Rick Owens. The collaboration infuses Owens’ minimalist edge with Rimowa’s sleek and minimalist design and sees the Original Cabin Bronze suitcase transformed using a manual pigmentation process. The result is a dark aged effect on the suitcases’ aluminum exterior, with each case having its own distinct finish. Plus, the interior has been upgraded to all-black leather and the suitcase is finished off with a cowhide luggage tag for a subtle touch of texture.Shop now at RIMOWARimowa x Rick Owens Cabin, $, available at RimowaCalvin Klein Returns to New York Fashion WeekCalvin Klein returned to New York Fashion Week for the first time in six and a half years! Veronica Leoni’s debut collection featured men’s and women’s looks, promising to “mark a new era of innovation and creativity” for the label that has become synonymous with denim and sexy underwear, while still paying homage to its much adored Americana roots. Klein himself was in attendance at the show, which really leaned into the brand’s signature minimalist style.Megan Trainor x e.l.f. CosmeticsThere’s nothing we love more than a beauty bundle and this one just so happens to be endorsed by pop superstar Megan Trainor. Marking 10 years since her number one album, Title, e.l.f. has released an all-new product to celebrate: Halo Glow Powder Filter. Helping you to achieve \"cloud skin,\" the pressed finishing powder is both lightweight and blurring, and is the key step to nailing a soft focus effect. Plus, the travel-friendly bundle also includes a new Glow Reviver Lip Oil Glimmer in a shimmering pink shade, as well as Halo Glow Liquid Filter and a limited-edition fluffy eye mask.Shop now at e.l.f.e.l.f. Cosmetics Destination: Cloud Skin Bundle, $, available at e.l.f. CosmeticsElemis Black Cherry Cleansing BalmWhen it comes to hero products, Elemis’ Pro-Collagen Cleansing Balm is top of the list. Packed with a triple blend of nourishing oils and moisture-enhancing macroalgae from the Mediterranean, the smooth balm is much-loved thanks to its ability to melt away makeup with ease. Now, Elemis has gone one step further and enhanced the experience by launching a black cherry edition. Vanilla and almond complement the juicy note and take the chore out of cleansing at the end of the day — it smells that good.Shop now at ElemisElemis Pro-Collagen Black Cherry Cleansing Balm, $, available at ElemisLike what you see? How about some more R29 goodness, right here?15 Under $100 Buys R29 Editors Tried In JanuaryRefinery29 Loves: Everything To See \u0026 Shop In JanWinter Fashion Must-Haves R29 Editors Are Wearing",
    "author": "Alicia Lansom",
    "published": "Tue, 25 Feb 2025 21:43:29 +0000",
    "image": "https://www.refinery29.com/images/11860078.jpg?auto=webp\u0026width=2500\u0026height=1517\u0026quality=85\u0026crop=2500:1517",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "a8b67e62-2642-4c71-aa9c-c66f85e49acb",
    "title": "What we have written",
    "link": "https://thebeautybrains.com/2024/03/this-is-a-test/",
    "description": "Here is the beauty brains test blog page",
    "author": "Perry Romanowski",
    "published": "Mon, 04 Mar 2024 22:05:47 +0000",
    "image": "",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "64ce7b4e-9056-4d14-b81c-9630e4295e0a",
    "title": "Is scalp exfoliation helpful for hair? episode 226",
    "link": "https://thebeautybrains.com/2020/07/6890/",
    "description": "Welcome to the Beauty Brains, a show where real cosmetic chemists answer your beauty product questions and give you an insider’s look at the cosmetic industry. This is Episode 226. Hosts Perry Romanowski, and Valerie George Is glycerin bad for curly hair? Are encapsulated ingredients better? Do scalp exfoliators help? Can beauty companies hide allergens […]",
    "author": "Perry Romanowski",
    "published": "Thu, 02 Jul 2020 17:22:57 +0000",
    "image": "http://thebeautybrains.com/wp-content/uploads/podcast/Episode226.mp3",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Podcast"
    ]
  },
  {
    "id": "ba3297a0-7474-450e-a7d6-b70cb79e21b8",
    "title": "I Tested the Viral Overnight Collagen Sheet Mask, and I’m Actually Obsessed",
    "link": "https://www.popsugar.com/beauty/biodance-collagen-mask-review-49386172",
    "description": "As someone who spends a lot of time on TikTok (and I mean a lot), I've found myself more than a little susceptible to testing out products and hacks that come across my FYP. For the most part, the things I've decided to try have been winners (like almost every single hair hack), but there have been a few questionable trends I've had to forgo (like using hemorrhoid cream for undereye bags). Recently, I've been seeing an overnight collagen face mask, the Biodance Bio-Collagen Real Deep Mask ($19) for 4, all over my social media feeds - both TikTok and Instagram alike. People trying it out would go to bed with what looked like a regular sheet mask on their face, but they'd wake up with what looked like a clear snakeskin on that they needed to peel it off. I really wasn't sure if the mask was legit, and I especially wasn't sure if the results were real because everyone woke up with perfect glass skin. Of course, I had to try it, and I won't lie - the results are just as good as everyone says they are. And if you're one of those people that isn't swayed in the slightest by TikTok, know that the mask has over 2,500 five-star reviews on Amazon as well. Right now, you can get it 30 percent off as an early Black Friday deal on Amazon, and it's the perfect time to stock up on a hydrating booster for your winter skin-care routine. Keep scrolling to read my full review of the Biodance Bio-Collagen Real Deep Mask and find out why it's an automatic re-purchase for me, especially during Black Friday. About the Biodance Bio-Collagen Real Deep Mask This product is a sheet mask that is meant to be worn overnight. It's formulated for all skin types. The key ingredients include low molecular weight fish collagen, hyaluronic acid, and niacinamide. It's available in two different packaging sizes: a four-count or a 16-count. What I Like About the Biodance Bio-Collagen Real Deep Mask Although I've seen this mask used tons of times on social media, I still wasn't entirely sure how it worked. It starts out as an opaque mask that has almost a silicone-like feel to it, but when you wake up in the morning, it's transparent and needs to be peeled off. The first time I tried it, I put it on before bed, popped a melatonin, and went to sleep. When I woke up, I was shocked to see that the mask had, in fact, completely changed. It looked like I was wearing a clear mask instead. I've used it three times since I initially purchased a pack of four. Once when my skin was fairly normal, once when I was experiencing some annoying breakouts, and once when I had a massive sunburn on my face. I'm genuinely not sure how, but the mask seemed to help with all of my skin issues. I find it to be ultra-hydrating, and it hasn't bothered my acne-prone skin or exacerbated any breakouts. I fully plan on continuing to purchase this mask and use it once a week, especially the night before a date or a special event. Just a heads up, however, this collagen face mask won't actually stimulate collagen production because the molecular weight of collagen is too high to be absorbed by the skin. It will, however, help with hydration. How to Use the Biodance Bio-Collagen Real Deep Mask You can use this mask two different ways. The first is as an overnight mask. For that, the brand recommends applying the mask at the end of your skin-care routine, leaving it on overnight, then removing it in the morning. It comes in two pieces - a top half and a bottom half - but it doesn't matter which piece you put on first. If you want to use it during the day, prep your skin with a toner or serum, apply the mask, and leave it on for at least three to four hours - once it becomes transparent, you can remove it. Personally, I've only used the mask overnight. I use a gentle cleanser to wash my face, and then I apply it directly to clean dry skin. In the morning, I peel it off and wash my face with lukewarm water. From there, I apply my moisturizer. What to Consider Before Trying the Biodance Bio-Collagen Real Deep Mask Since this mask is most typically applied overnight, it does take a little getting used to. I've been training myself to sleep on my back as of late, so going to bed with a slippery sheet mask on my face wasn't too hard. However, if you put it on and try to do other things - like bend over - just know that the mask could very well come sliding off. If you're a side or a stomach sleeper, I'd recommend trying this mask out during the day because it will probably be too difficult to keep it on your face while you're in bed. Where Is the Biodance Bio-Collagen Real Deep Mask Available? You can purchase the Biodance Bio-Collagen Real Deep Mask from Amazon. Rating: Renee Rodriguez is a staff writer and social producer for PS. She writes across all verticals, but her main areas of expertise focus on fashion and beauty content with an emphasis on reviews and editor experiments. She also produces social content for the PS TikTok and Instagram accounts.",
    "author": "Renee Rodriguez",
    "published": "Tue, 25 Feb 2025 12:55:02 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/o1Iy6N1Q2nSImiOsw3QgBUXCON0/0x443:2316x2759/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2024/08/13/994/n/1922153/f6aa059566bbe3b0dde325.56393776_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Beauty Reviews",
      "Product Reviews",
      "Black Friday",
      "Sales",
      "TikTok",
      "Skin Care",
      "Editor's Pick",
      "Face Masks"
    ]
  },
  {
    "id": "89945ded-60cb-43aa-ab09-9130a6e6f487",
    "title": "Scent Master: Harry Slatkin of Dwell212 (and Bath \u0026 Body Works Fame)",
    "link": "https://www.popsugar.com/beauty/harry-slatkin-fragrance-interview-49429795",
    "description": "While you might not know Harry Slatkin by name, it's very likely his work has made its way to your home through one of his many fragrances over the years. Having led the creation of Bath \u0026 Body Works' iconic White Barn home fragrance collection, plus countless nostalgic scents for brands like Ralph Lauren and Victoria's Secret, Slatkin has become one of the most respected \"noses\" in the business. Along with his wife, Nest Fragrances founder Laura, Slatkin has been creating scents for more than 30 years; however, his entry to the industry happened quite by chance. Back then, Slatkin - who just launched his newest home fragrance brand, Dwell212 - was working in finance but was seeking a career that would provide him with more fulfillment and creative opportunity. And it was at this fortuitous moment in time that the perfect path presented itself. \"I didn't love finance - it was just numbers and a way to make money, which is not what interests me,\" he tells PS. \"My brother was an interior designer who began creating home fragrances for clients, but it wasn't what he wanted to do. So when Laura and I married, he offered his home fragrance line to us as a wedding gift.\" Since then, the Slatkins have built a fragrance dynasty while producing iconic scents that have revolutionized the home fragrance industry. Throw it back to the early 2000s, for example, and Bath \u0026 Body Works was filled with Slatkin's work. Whether you favored the Honeysuckle Candle ($27) or the Mahogany Teakwood ($27), Slatkin had a hand in making sure your home smelled its best - and he's far from done. PS: How did you first get involved in the world of fragrance? Harry Slatkin: I started my first company when I was 15. That's when I fell into this entrepreneurial world that I live in. Needless to say, once you get the bite of entrepreneurship, it continues. Years later, my brother, who is an interior designer, offered to give my wife and I his home fragrance line as a wedding gift, and we decided to do it. We were both working in finance, and we were bored. But I knew that, if I was going to succeed at home fragrance, I couldn't be on the home floor, I had to be in cosmetics. It had to be like a lipstick, an instant purchase. So that's what we pushed for - and it changed the industry. PS: What made you decide to team up with Bath \u0026 Body Works? HS: We launched our own brand, Slatkin + Co., and seven years into the business, I guess we were the darlings of the industry because we were the first to launch home fragrance as part of the beauty space. Then we got a phone call from Les Wexner, who founded Victoria's Secret and Bath \u0026 Body Works, and he had a fledgling home fragrance business called White Barn Candle. He invited us to his home for dinner, and at the end, the vice chairman of the company said, \"Les would like to buy your company.\" So, he bought the company and me with it. And we made a bet that we could grow the company to $1 billion, and when I got there we were doing $100 million, and five years later, I walked away as we got to $1.3 billion. Today it does $3.4 billion, and it is the largest home fragrance brand in the world. PS: How has the fragrance industry evolved during your career? HS: The reason home fragrance has become what it is today is because of the young people who grew up with home fragrance as part of their lives. The younger generations burn home fragrance differently than my generation did. When my generation was growing up, we lit a candle when a guest came over. No more. But the younger generations light them when they're doing homework, when friends are coming over. . . It has become a different way of growing up with scent around you. PS: Have your own tastes changed over time? HS: I haven't really changed, I have been a natural nose since the start. My nose luckily has been one that has worked to make people happy in scent. I've tried to keep that nose whether I'm doing a cheesecake candle, mashed potato candle, or I'm doing the most wonderful French peony, or a limoncello that takes you to the coast of Capri in the summer. PS: What inspired you to launch Dwell212? HS: I created it for my daughter. She's 26, and I wanted to create something for people her age with her lifestyle. Mental health is a big issue for that generation. My wife and I have a son with autism, which led us into the world of mental health. Life has become so fast and it's created a lot more anxiety in our world, as well as other mental health issues. I wanted to create Dwell212 to really speak to that way of being. So when you wake up, it's not just that you're putting on a scent because it's nice and pretty, but more about how those scents take you through your day. So you wake up in the morning and you're dragging yourself into the shower, you have to go to work. OK, well that means you need to be uplifted. So I created a Citrus Collection that can actually lift your spirits throughout the day when you're at work, and a Lavender range for when you feel anxious, and you want to calm down. Dwell212 really came out of talking to a Gen Z consumer and understanding mental health in their world. Charlie Lankston is a freelance beauty, fashion, and lifestyle writer and media strategist based in New York City, having relocated to the US in 2014 from her home in London. Charlie spent 10 years working at DailyMail.com, where she oversaw the website's style, beauty, fashion, and lifestyle content. Charlie also appears as an on-air royal and celebrity correspondent.",
    "author": "Charlie Lankston",
    "published": "Tue, 25 Feb 2025 11:20:00 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/SQZUqXZI0PdIG7fTteCtsBL73X0/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/02/25/834/n/1922153/34cc09b067be13a0efb0a4.49425992_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Beauty Interview",
      "Perfume",
      "Scent Master"
    ]
  }
]
