[
  {
    "id": "7ead5f64-3d1f-4f6d-8b17-32301dbe0ca9",
    "title": "May Favorites: Hair, Skin + Body Edition",
    "link": "https://thebeautylookbook.com/2025/06/may-favorites-hair-skin-body-edition.html",
    "description": "May Favorites: Hair, Skin + Body Edition. Rounding up my beauty favorites for the month of May.",
    "author": "Sabrina",
    "published": "Wed, 04 Jun 2025 17:44:20 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/06/May-Beauty-Favorites-Chanel-InnBeautyProject-Osea.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/beauty-favorites' target='_blank' style='color:currentColor;text-decoration:none;'\u003eBeauty Favorites\u003c/a\u003e"
    ]
  },
  {
    "id": "4b2ec6be-d34e-4d9c-afae-251948c8ab57",
    "title": "Valentino Puffer Lip Plumper Gloss",
    "link": "https://thebeautylookbook.com/2025/05/valentino-puffer-lip-plumper-gloss.html",
    "description": "Valentino Puffer Lip Plumper Gloss. Swatches + review of the latest from Valentino Beauty.",
    "author": "Sabrina",
    "published": "Thu, 29 May 2025 21:20:36 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/05/Valentino-Puffer-Gloss-Review.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/lips' target='_blank' style='color:currentColor;text-decoration:none;'\u003eLips\u003c/a\u003e"
    ]
  },
  {
    "id": "53dd2507-8819-45f0-97bd-77347dd7df01",
    "title": "These Waterproof Mascaras Survive Sweat, Surf, and Summer Heat",
    "link": "https://www.elle.com/beauty/makeup-skin-care/g64968065/best-waterproof-mascaras/",
    "description": "Your longest lashes yet—no raccoon eyes in sight.",
    "author": "",
    "published": "Mon, 09 Jun 2025 21:46:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "c213126a-a4bd-47da-a9a7-cc5ee41c023f",
    "title": "These Expert-Loved Toners Gently Exfoliate and Brighten Skin",
    "link": "https://www.elle.com/beauty/makeup-skin-care/g61625508/best-exfoliating-toners/",
    "description": "Swap harsh scrubs for these texture-smoothing formulas.",
    "author": "",
    "published": "Mon, 09 Jun 2025 19:18:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "6d72c486-bc34-4e48-8249-1c6416b26e8f",
    "title": "The Glow-Up You Didn't Know You Needed: This Daily Gummy Ritual Is the Wellness Reset Your Schedule Has Been Missing",
    "link": "https://fashionista.com/2025/06/the-glow-up-you-didnt-know-you-needed-this-daily-gummy-ritual-is-the-wellness-reset-your-schedule-has-been-missing-acknowledge",
    "description": "Meet your new ritual: The Daily Reset Garden Gummy Bundle from Acknowledge—a woman-owned wellness brand growing their ingredients on a regenerative organic farm in Maryland. These aren’t your average gummies. They're plant-powered, sun-grown, and crafted to support your energy, mood, and ...Continue reading",
    "author": "Acknowledge",
    "published": "Mon, 09 Jun 2025 15:35:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE1NDMyMzM2MTk0NDEzOTM1/acknowledge_fashionista_3.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Sponsored Content",
      "Wellness",
      "Beauty",
      "Acknowledge"
    ]
  },
  {
    "id": "79601ac2-a922-4371-b12a-e59798ac0049",
    "title": "After Popularizing Blowouts, Alli Webb Is Leading a Movement Against Them",
    "link": "https://fashionista.com/2025/06/alli-webb-messy-hair-brand-products",
    "description": "If you're an adult woman with wavy, curly or coily hair, chances are you've spent much — if not most — of your life in a quiet battle against your natural texture, struggling to tame it with toxic chemicals, hours of heat styling and expensive, frequent salon visits. Beauty entrepreneur Alli Webb ...Continue reading",
    "author": "Dhani Mau",
    "published": "Mon, 09 Jun 2025 14:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE1NDI5NzUzMzA4NDU2NDY3/alli-webb-messy.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Hair Care",
      "Blowout",
      "Curls",
      "hair",
      "Network",
      "Sephora",
      "Textured Hair",
      "Beauty",
      "Messy",
      "Alli Webb",
      "DryBar",
      "Natural Hair",
      "News"
    ]
  },
  {
    "id": "aacad224-0a45-424c-971e-f0b21ea574ce",
    "title": "Nordstrom Anniversary Sale Haul Try-On",
    "link": "http://www.frmheadtotoe.com/2020/08/nordstrom-anniversary-sale-try-on.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-17T12:17:00.016-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "56892fe3-ae16-45bf-8c74-18e0df12309d",
    "title": "Best In-Stock Items! Nordstrom Anniversary Sale Picks 2020",
    "link": "http://www.frmheadtotoe.com/2020/08/best-in-stock-items-nordstrom.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-13T11:38:00.002-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "9ce0ea2c-803a-4a7d-b10d-a8d69d7f2995",
    "title": "Karah Katenkamp, Curve Model",
    "link": "https://intothegloss.com/2025/03/karah-katenkamp-curve-model-beauty-routine/",
    "description": "With a probiotic rec to fight rosacea, under-the-radar tubing mascaras, and a masseter treatment that's not Botox",
    "author": "",
    "published": "Wed, 05 Mar 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "41d516fb-8a18-4132-a2eb-2899917d8c74",
    "title": "How Tracey Cunningham Colored 17 Stars’ Hair For The Oscars",
    "link": "https://intothegloss.com/2025/03/tracey-cunningham-meche-celeb-colorist-oscars-diary/",
    "description": "5 days, 17 celebs, so much Olaplex",
    "author": "",
    "published": "Mon, 03 Mar 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "6f459ac1-c69a-4d46-a036-5d9ae4fd7223",
    "title": "What we have written",
    "link": "https://thebeautybrains.com/2024/03/this-is-a-test/",
    "description": "Here is the beauty brains test blog page",
    "author": "Perry Romanowski",
    "published": "Mon, 04 Mar 2024 22:05:47 +0000",
    "image": "",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "9bfd082f-bfe4-4598-be08-f5ec3fd95d52",
    "title": "Is scalp exfoliation helpful for hair? episode 226",
    "link": "https://thebeautybrains.com/2020/07/6890/",
    "description": "Welcome to the Beauty Brains, a show where real cosmetic chemists answer your beauty product questions and give you an insider’s look at the cosmetic industry. This is Episode 226. Hosts Perry Romanowski, and Valerie George Is glycerin bad for curly hair? Are encapsulated ingredients better? Do scalp exfoliators help? Can beauty companies hide allergens […]",
    "author": "Perry Romanowski",
    "published": "Thu, 02 Jul 2020 17:22:57 +0000",
    "image": "http://thebeautybrains.com/wp-content/uploads/podcast/Episode226.mp3",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Podcast"
    ]
  },
  {
    "id": "fdb95f58-07e4-45e6-a36e-79d64fd40602",
    "title": "Blurring Is The New Matte — \u0026 It’s Summer’s Softest Makeup Trend",
    "link": "https://www.refinery29.com/en-us/blur-makeup-trend-products?utm_source=feed\u0026utm_medium=rss",
    "description": "It doesn’t seem like that long ago that our feeds were flooded with images of hyper-glowy skin that looked fresh (but never sweaty), with a healthy sheen. (Dewy makeup got so big, it even permeated pop culture; “my skin is gleamin,’” whisper-sang Ariana Grande in 2019’s “7 rings.”) Glow was the antithesis of the “Instaglam” look that predated it in the mid-2010s; think heavy highlight and contour, a full-coverage base, and bold, matte lipstick. But if there’s one thing we can count on, it’s that trends come, go…and find a way of coming back again. And sure enough, one word has been popping up everywhere in beauty launches lately: Blur. It’s not quite matte, but not quite glowy either. The blurred makeup trend occupies an interesting place between dualities that seems to be striking a chord these days. It delivers all the luminosity of dewy makeup with the diffused velvetiness of ultra-matte glam.  “The trend seems to be gaining momentum in response to the sharp makeup looks that have dominated social media for years,” makeup artist and Sephora Beauty Director David Razzano tells Refinery29. “Bold black cat eyeliner, graphic eyeshadow, intense contouring, and ultra-defined lip lines are beginning to feel a bit dated and overdone.” In comparison, ‘blurred’ makeup has a “fresh, effortless vibe,” per Razzano, that lends the skin a “filtered,” poreless effect. (I never thought I’d say this, but was Maybelline Dream Matte Mousse…ahead of its time?) The more I thought about it, the less surprising the trend was. After all, digitally airbrushed skin via social media filters had given way to products like e.l.f.’s Poreless Putty Primer and Milk Makeup’s (sadly discontinued) Blur Stick. But the 2025 version of blurred-finish products isn’t just about poreless, diffused skin. Instead of bottling blur in primers and touchup products, the soft-focus effect has made its way into lipstick, blush, eyeshadows, and more. Ahead, get the scoop on how to wear blurred makeup from lids to lips — and the pro-approved products to get the look this summer and beyond. DashDividers_1_500x100 Eyes When it comes to eyes, there are several ways to achieve a soft, diffused wash of color. I personally find cream-to-powder eyeshadows like Glossier Skywash or Merit’s new Solo Shadow the quickest, most foolproof way to get a blurred finish. “The Sephora Collection PRO Eyeshadow Brush #18 is my go-to ‘blurring brush’ for both eyes and lips,” says Razzano. “It has a small domed tip, which can be used to blur eyeliner or lipstick out – just gently sweep on the edge of any area.”  DashDividers_1_500x100 Skin When I hear “blurred makeup,” I first think of a soft, creamy complexion resembling something from a Vermeer portrait. Foundations like R29’s Beauty Innovator Award-winning Huda Beauty’s Easy Blur and Covergirl’s new (and already sold out) Clean Fresh Blurring Skin Tint SPF 30 are great options for one-and-done coverage with a petal-soft finish. You can also achieve a beautiful, blurred effect with your finishing products. Razzano loves Kosas’ Cloud Set Baked Setting \u0026 Smoothing Powder for lending a soft veil that reduces shine, not glow. “I’m obsessed with this powder! It sets your makeup in place while delivering an ultra-soft blurring effect, all while maintaining a natural, radiant finish,” he says. “This powder works particularly well when it comes to setting concealer — it blurs out fine lines and wrinkles, without creating dryness under the eyes.” DashDividers_1_500x100 Cheeks The blush craze shows no signs of slowing down anytime soon, and the latest launches all seem to have blur as a priority. There’s the Dua Lipa-fronted YSL Beauty’s new Make Me Blush, which comes in eight candy-colored shades and contains squalane to lend an optical blurring effect on skin. Some of Razzano’s go-to’s include Lawless’ Pinch My Cheeks Soft-Blur Cream Blush, which our editors also loved for its longwear properties and beautiful pigmentation. Another fave comes in the form of Danessa Myricks’ Yummy Skin Blurring Balm Powder, which also happens to be among my most-used products as well. “This formula is nothing short of pure brilliant beauty innovation,” Razzano declares. “Danessa created a hydrating balm-to-powder that instantly blurs the skin, while maintaining a hyper-natural look and feel. Plus, she has carried this formula into blushes and highlighters – so you can blur and add glow simultaneously.” On the bronzer side of things, Makeup By Mario’s SoftSculpt Blurring Bronzer offers the same sun-kissed glow you’d get from a bronzing powder with ingredients like spherical powders that provide an optical blurring effect. DashDividers_1_500x100 Lips Make it a summer of blurred kisses with products that have a soft, romantic finish that’s never dry or flat. “Refy’s Blur Liner boasts a domed tip, creating a natural, soft, and blurred look — an easy step in your routine,” Razzano explains. He also loves Prada Beauty’s Monochrome Soft Matte Blur Lipstick, which has the creamy texture of your favorite lippie but with a velvet finish. “No need to perfectly line your lips, since it softly blurs itself,” he says. “A few taps of your finger will blend it to perfection.” We also love Rhode’s Peptide Lip Shape crayons, which come in a variety of beautiful neutral tones with a soft matte finish. Like what you see? How about some more R29 goodness, right here?",
    "author": "Karina Hoshikawa",
    "published": "Fri, 06 Jun 2025 20:02:45 +0000",
    "image": "https://www.refinery29.com/images/11902660.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "7ac31a66-e74a-4343-9eb2-ea385e60723e",
    "title": "7 Black-Owned Summer Scents That Give Main Character Energy",
    "link": "https://www.refinery29.com/en-us/must-have-black-owned-summer-perfume-scents?utm_source=feed\u0026utm_medium=rss",
    "description": "\"To all the ladies in the place with style and grace,\" this one is for you! Summer's here, and we're not just outside; we're showing up, showing out and smelling like a whole vibe. Not only are we trying to look good, we're trying to smell good too. But let’s be real—perfume isn’t one-size-fits-all. Your signature scent should match your energy. I'm talking scents that still linger in the room long after you leave, giving off that main character energy that'll have heads turning and your presence unforgettable. Is it soft and sweet? Bold and spicy? Warm and woody with a little intrigue? Either way, that’s why we pulled together this list of handpicked must-have perfumes that are, of course, made for us, by us. Ready to smell like your higher self? Get your wallets ready, and let’s get into it.This fragrance speaks volumes, literally and figuratively. Founder Maya Nije developed her love for perfumery by using scents as a way to bottle memories, moments and emotions in time. Inspired by Minnie Riperton's 1970 song of the same name, \"Les Fleurs,\" it is a celebration of life with a fresh and fruity, genderless blend crafted with eco-friendly and sustainable best practices in mind. Maya Njie Les Fleurs Eau de Parfum 50ml, $, available at Liberty LondonLife is lifin' for so many of us, and we all need and deserve a pick-me-up. What better way to reinvigorate your spirit than with a scent that embodies self-care? Founded in 2023 by Keta Burke-Williams, this award-winning, Bronx-born brand is centered on intention, with each note crafted to exude intimacy and harmony. As Keta puts it, “Scent is a language everyone can understand—but few have the opportunity to speak.”Ourside Dusk Eau de Parfum, 1.7 oz., $, available at Bergdorf GoodmanAn ode to the rich legacy of Josephine Baker, Harlem’s own “Bronze Goddess,” this fragrance from the Harlem Candle Co. captures her bold and radiant essence. It is one of many scents that pays homage to the beauty and brilliance of Harlem, exuding elegance and timeless charm with every note. The perfect aroma for wherever life takes you, it is flirtatious and free-spirited and comes in travel and full sizes.Harlem Candle Co The Harlem Perfume Josephine Eau de Parfum, $, available at Saks Fifth AvenueThe name says it all: \"LEGENDARY.\" And that’s exactly what you are. This scent is confident, unforgettable and magnetic—designed to leave your mark wherever you are. Bold yet balanced, it’s a gender-neutral fragrance blended to perfection and made specifically for you. Because let’s be real, you’re in a class of your own. So own it.Octavia Morgan Los Angeles LEGENDARY EDP, $, available at Octavia Morgan Los AngelesDon't you just love a delicate floral smell that reminds you of the beauty of a fresh flower bouquet? This fragrance captures love in all its forms, from self-love to platonic, romantic and even familial love. It's the kind of scent that'll lift you, soften you and remind you you’re worthy of every kind of tenderness. It's intimate, with beauty in every note, from jasmine, rose, orange blossom and pear. Consider this a love letter in fragrance form. MAIR Women's Peony Silk Eau De Parfum Spray, 3.4 Oz, $, available at Macy'sTalk about a thoughtfully crafted eau de parfum that sets the tone for your soft girl era and girl-next-door mood. Designed for all skin types, this scent taps into something deeper. With top notes of white tea and orange blossom, and heart notes of red rose, lavender and fresh greens, this one feels soft, thoughtful and smells like luxury in a bottle. MOODEAUX Worthy IntenScenual Eau De Parfum, $, available at Credo BeautyLet's talk details about this vegan, cruelty-free fragrance. Think warm woods with an earthy scent wrapped in keynotes of marshmallow, vanilla and sandalwood. It's giving summer romance, warm skin, wild thoughts and a gentle reminder that, yes, you are that girl. Brown Girl Jane Casablanca Eau de Parfum, $, available at SephoraLike what you see? How about some more R29 goodness, right here?What To Buy From Nordstrom's Fragrance Sale10 Perfume Trends That Are Going To Dominate 2025Valentino's New Perfumes Take Luxe To A New Level",
    "author": "Dontaira Terrell",
    "published": "Fri, 06 Jun 2025 18:06:03 +0000",
    "image": "https://www.refinery29.com/images/11900275.png?auto=webp\u0026width=792\u0026height=940\u0026quality=85\u0026crop=198:235",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "8b7e35dd-1d00-40e3-be38-078c88cdae17",
    "title": "I Think I Had Dua Lipa’s Exact Manicure in 2004",
    "link": "https://www.popsugar.com/beauty/dua-lipa-flower-nails-49446891",
    "description": "Image Source: Cindy Ord/MG24/Getty Images for The Met Museum/Vogue It's not often that we spot a celebrity-loved manicure that we can easily re-create at home, but Dua Lipa is here to deliver. Not only is her latest manicure one of the easiest to DIY (more on that later), but it also drums up major feelings of nostalgia. If you went to the nail salon even once in the early aughts, chances are you got the exact flower manicure she's currently sporting during a trip to Italy. Obviously, the nail art space has evolved a lot since then, but there's something so sweet about Lipa's fresh take on this vintage (can we call the early 2000s vintage?) design. Even if you never got your nails professionally done as a kid, you probably came across this nail-art book at sleepovers teaching you exactly how to achieve this floral mani at home. That book, along with magazines, were the original source for nail inspiration long before Instagram was a thing. If you didn't try your hand at it when you were younger, now's your chance. View this post on Instagram A post shared by DUA LIPA (@dualipa) Lipa used just two colors to create hers: black and white. The color palette automatically elevates the look. She has two flowers on each fingernail, with one on the very edge and bleeding off the side of the nail. This allows the design to work on both shorter natural nails or nail extensions. How to Re-create the Look If you want to re-create this look at home, you'll need a base shade of your choice. We recommend something neutral like a pale pink or beige or even just your natural nail with a clear coat on top. Then, you'll need two more shades to create the flower designs. It's helpful to pick contrasting colors to help the different parts of the flower stand out. We love the O.P.I. Opaque Dark Black ($12) and the O.P.I. Opaque Light White ($12) polishes because they're not runny or see-through. Then, you'll need a tool with a rounded end to create the petals and middle of the flower. You can grab Art Dotting Tools ($6) on Amazon, or just use the tip of a bobby pin. Start by creating the center of the flower in one shade. To make the petals, first wipe off your tool and switch to a different shade to make the five dots surrounding the center. Yes, it really is as easy as you remember. Brittany Leitner (she/her) is a New York-based contributing beauty writer at PS. She has over 10 years of experience working in beauty, health, wellness, travel, and celebrity news. Brittany holds a degree in magazine journalism from Syracuse University and previously held editorial positions at Elite Daily and \"The Dr. Oz Show\" before working as a freelance journalist for the past three years.",
    "author": "Brittany Leitner",
    "published": "Mon, 09 Jun 2025 13:45:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/dvlvKQl-q3cHnUcayuGoPBuHiFg/198x0:1168x970/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/06/09/814/n/1922153/935e79a4684728fd0bd4f8.44740510_.png",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Beauty News",
      "Nails",
      "Celebrity Beauty",
      "Celebrity Nails",
      "Nail Art",
      "Beauty at Home"
    ]
  },
  {
    "id": "1b0e6b6f-11a7-4239-a7e1-8b1ece401523",
    "title": "Miley Cyrus's Tattoos Are a Collection of Meaningful Moments",
    "link": "https://www.popsugar.com/beauty/miley-cyrus-tattoos-meanings-47709211",
    "description": "Miley Cyrus has a massive tattoo collection that seems to grow as the days go by. The singer got her first piece of ink in 2009 at the age of 17, and she hasn't stopped since. Now, after her three Grammy wins - in which she performed her hit song \"Flowers\" and displayed many of her patchwork designs - fans both old and new are curious about her collection. A quick search into her body art will reveal that, unlike many other celebrities who have their go-to tattooists, Cyrus's tattoos are the work of various artists - but several have some very special meanings behind them. Most recently in June 2025, Cyrus got the word \"Muse\" from an artist at Bang Bang Tattoo in New York City. Before that, in March of 2020 she got a design inspired by \"Dance Me to the End of Love,\" a book that visualizes Leonard Cohen's song of the same name with illustrations by Matisse. The video shows the silhouette of a body that is etched onto her upper right arm, and it looks like one of Matisse's signature works inspired by his affinity for cutouts. Around that same time, she got a handwritten note that she received from Yoko Ono traced onto her shoulder (it read: \"I'm proud of you, Yoko\") and a cursive-script piece over her knuckles that read \"Freedom,\" both in December 2019. There's plenty more where that came from, too. Read ahead for a brief guide to some of Cyrus's most meaningful tattoos.",
    "author": "Danielle Jackson",
    "published": "Mon, 09 Jun 2025 09:35:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/Is-aaPWYbSUjXUhyGdjWEi0hd0M/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/06/09/653/n/1922153/5600b03f6846f27234fa69.40371075_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Miley Cyrus",
      "Tattoos",
      "Celebrity Beauty",
      "Celebrity Tattoos"
    ]
  }
]
