[
  {
    "id": "11e8a4fe-ac20-4f8d-b855-417ccc4618ae",
    "title": "Nordstrom Anniversary Sale 2025 Preview",
    "link": "https://thebeautylookbook.com/2025/07/nordstrom-anniversary-sale-2025-preview.html",
    "description": "Nordstrom Anniversary Sale 2025 Preview. The Anniversary Sale starts for Icon Cardmembers! Sharing a preview roundup of what's on my radar for this year's sale.",
    "author": "Sabrina",
    "published": "Tue, 08 Jul 2025 01:40:37 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/07/beautylookbook-Nordstrom-Anniversary-Sale-NSALE-2025.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/sales' target='_blank' style='color:currentColor;text-decoration:none;'\u003eSales\u003c/a\u003e",
      "Sales"
    ]
  },
  {
    "id": "eb96e286-3369-4e48-bfa9-be490231c066",
    "title": "New Chanel Le Vernis for Summer 2025",
    "link": "https://thebeautylookbook.com/2025/07/new-chanel-le-vernis-for-summer-2025.html",
    "description": "New Chanel Le Vernis for Summer 2025. Six new limited-edition shades of nail polish launched for the summer season.",
    "author": "Sabrina",
    "published": "Sun, 06 Jul 2025 18:31:39 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/07/New-Chanel-Le-Vernis-Summer-2025-BEAUTYLOOKBOOK.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/brand/chanel' target='_blank' style='color:currentColor;text-decoration:none;'\u003eChanel\u003c/a\u003e",
      "Chanel"
    ]
  },
  {
    "id": "de6a4f08-f5c8-4d0d-bfb7-42e1be0c726b",
    "title": "Hailey Bieber’s Go-to Barrier Repair Cream Is 30 Percent off for Prime Day",
    "link": "https://www.elle.com/beauty/a65355003/hailey-bieber-avene-cream-prime-day-deal-2025/",
    "description": "Calling all sensitive skin girlies!",
    "author": "",
    "published": "Thu, 10 Jul 2025 17:34:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "7ed43d2f-042a-4750-a63d-63b8dab069b7",
    "title": "If I Were You, I’d Grab These Beauty Deals ASAP",
    "link": "https://www.elle.com/beauty/makeup-skin-care/a65207360/best-nordstrom-anniversary-sale-beauty-deals-2025/",
    "description": "From Pat McGrath to Tom Ford, these are the luxe finds you won’t want to miss.",
    "author": "",
    "published": "Thu, 10 Jul 2025 15:11:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "98df6ff5-f0a3-451f-875b-4777f094b9ff",
    "title": "P\u0026G Bets on Bottle-Free Packaging With New Water-Activated Hair-Care Brand Gemz",
    "link": "https://fashionista.com/2025/07/gemz-hair-care-brand-launch-procter-and-gamble",
    "description": "After 14 years of research and development, P\u0026G is unveiling its latest venture: a new, water-activated hair-care brand called Gemz. Instead of traditional solid shampoos that function similarly to your average bar soap (i.e. lather, rinse, repeat), Gemz offers single-dose shampoos and ...Continue reading",
    "author": "Catie Pusateri",
    "published": "Thu, 10 Jul 2025 12:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE2MTk0NjA2NzIxNjcyNTU5/gemz-procter-and-gamble-launch.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Gen Z",
      "Procter \u0026 Gamble",
      "Beauty Brands",
      "Target",
      "Conditioner",
      "Shampoo",
      "Hair Care",
      "Beauty",
      "sustainability",
      "Network",
      "News"
    ]
  },
  {
    "id": "bf2646f5-6450-45b5-9de3-e4205c84d4fe",
    "title": "Beauty Creations: A Los Angeles-Based Cosmetics Brand With Accessible Pricing",
    "link": "https://fashionista.com/2025/07/beauty-creations-cosmetics-brand",
    "description": "Brand Bio is Fashionista's guide to the best independent fashion and beauty brands — a resource for retailers, job seekers, B2B companies and consumers alike. If you'd like your brand to be featured, fill out this form. Beauty CreationsHeadquarters: Los Angeles, CAE-commerce: ...Continue reading",
    "author": "Fashionista",
    "published": "Wed, 09 Jul 2025 15:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE2MDE0NTA2MTI2NDg0ODQ3/beauty-creations-brand-bio.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Shopping",
      "Hair Care",
      "Brand Bio Skin Care",
      "makeup",
      "Beauty",
      "Brand Bio",
      "Beauty Creations",
      "Brand Bio Makeup",
      "Brand Bio",
      "Brand Bio Hair Care",
      "Beauty Brands",
      "Skin Care",
      "Brand Bio Beauty",
      "Network",
      "Indie Beauty"
    ]
  },
  {
    "id": "71a99b17-4cc9-43ed-a72c-3c5c382990d4",
    "title": "Karah Katenkamp, Curve Model",
    "link": "https://intothegloss.com/2025/03/karah-katenkamp-curve-model-beauty-routine/",
    "description": "With a probiotic rec to fight rosacea, under-the-radar tubing mascaras, and a masseter treatment that's not Botox",
    "author": "",
    "published": "Wed, 05 Mar 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "12790907-c060-449f-a3fc-c1cb9391e58a",
    "title": "How Tracey Cunningham Colored 17 Stars’ Hair For The Oscars",
    "link": "https://intothegloss.com/2025/03/tracey-cunningham-meche-celeb-colorist-oscars-diary/",
    "description": "5 days, 17 celebs, so much Olaplex",
    "author": "",
    "published": "Mon, 03 Mar 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "80ed3d00-a1c5-403b-9c53-8ba289ecd5b2",
    "title": "What we have written",
    "link": "https://thebeautybrains.com/2024/03/this-is-a-test/",
    "description": "Here is the beauty brains test blog page",
    "author": "Perry Romanowski",
    "published": "Mon, 04 Mar 2024 22:05:47 +0000",
    "image": "",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "232330e9-e75a-4e56-9c6b-0c6bf168565f",
    "title": "Is scalp exfoliation helpful for hair? episode 226",
    "link": "https://thebeautybrains.com/2020/07/6890/",
    "description": "Welcome to the Beauty Brains, a show where real cosmetic chemists answer your beauty product questions and give you an insider’s look at the cosmetic industry. This is Episode 226. Hosts Perry Romanowski, and Valerie George Is glycerin bad for curly hair? Are encapsulated ingredients better? Do scalp exfoliators help? Can beauty companies hide allergens […]",
    "author": "Perry Romanowski",
    "published": "Thu, 02 Jul 2020 17:22:57 +0000",
    "image": "http://thebeautybrains.com/wp-content/uploads/podcast/Episode226.mp3",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Podcast"
    ]
  },
  {
    "id": "2353b4f1-a6c2-4ee2-80d5-c7cab6bffe6c",
    "title": "Nordstrom Anniversary Sale Haul Try-On",
    "link": "http://www.frmheadtotoe.com/2020/08/nordstrom-anniversary-sale-try-on.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-17T12:17:00.016-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "a4ab87f5-79b5-4ccf-856e-d94dcf392b75",
    "title": "Best In-Stock Items! Nordstrom Anniversary Sale Picks 2020",
    "link": "http://www.frmheadtotoe.com/2020/08/best-in-stock-items-nordstrom.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-13T11:38:00.002-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "e5ab7614-f62e-4085-8ff5-0f3cc60e4877",
    "title": "57 Beauty Products On Sale During Amazon Prime Day",
    "link": "https://www.refinery29.com/en-us/best-amazon-prime-day-beauty-deals?utm_source=feed\u0026utm_medium=rss",
    "description": "Super Sale Alert: Products in this story may be marked down for Prime Day. Shop our full coverage of the event here — or, dive directly into the deals here.Amazon’s Prime Day starts today, and ICYMI: The deals are already shaping up to be bigger and better than ever. Prime Day is one of the biggest shopping events of the calendar year, and this year, the sale is lasting for an unprecedented four-day stretch from July 8-11. As always, it’s a smart time to buy things like TVs, household items, clothing, and accessories, but Prime Day also offers a unique opportunity to save on everyday essentials — including products in your beauty routine. What makes Prime Day’s beauty deals different from other beauty sales is the broad — bordering on encyclopedic — range of brands, including everything from drugstore staples to luxury labels. (Some names to get excited for: Sol de Janeiro, Nécessaire, Vacation, and Ouai, among many others.) To save you both time and money, we've done the legwork for you, corralling all the best Prime Day beauty deals to shop across makeup, hair, skincare, and more. Ahead, shop 57 beauty deals worth adding to your haul.At Refinery29, we’re here to help you navigate this overwhelming world of stuff. All our market picks are independently selected and curated by the editorial team. All product details reflect the price and availability at the time of publication. If you buy or click on something we link to on our site, Refinery29 may earn commission.For more can't-miss shopping stories delivered straight to your inbox, sign up for our Most Wanted newsletter. CrestPromo: Up to 35% off select productsShop CrestCrest 3D Whitestrips Professional Effects Kit, 44 Strips, $, available at AmazonSol de JaneiroPromo: 20% off all full-sized products and 20% off select product bundlesShop Sol de JaneiroSol de Janeiro Hair \u0026 Body Perfume Mist, $, available at AmazonEltaMDPromo: 20% off select products  Shop EltaMDEltaMD UV Clear Tinted Face Sunscreen, SPF 46, $, available at AmazonLaneigePromo: Up to 20% off bestsellersShop LaneigeLaneige Lip Glowy Balm, $, available at AmazonIGKPromo: Up to 30% off select productsShop IGKIGK GOOD BEHAVIOR 4-in-1 Prep Spray, $, available at AmazonHero CosmeticsPromo: 20% off select productsShop Hero CosmeticsHero Cosmetics Mighty Patch™ Original (36 count), $, available at AmazonMedihealPromo: 30% off select productsShop MedihealMediheal Collagen Ampoule Facial Toner Pads, $, available at AmazonStarfacePromo: 20% off select products Shop StarfaceStarface Hydro-Star Salicylic Acid and Big Blue Compact, $, available at AmazonPHLURPromo: Farewell Sale on all items, plus 20% off select fan-favorite fragrances: Not Your Baby, Somebody Wood, Tangerine Boy, Mood Ring, Dragon Fruit, Moonstone, Amber Haze, and Mango Mood.Shop PhlurPhlur Somebody Wood Eau de Parfum, $, available at AmazonVacationPromo: 20% off all productsShop VacationVacation Super Spritz SPF 50 Face Mist \u0026 Air Freshener Bundle, $, available at AmazonNécessairePromo: Up to 25% off all productsShop NécessaireNécessaire The Body Wash, $, available at AmazonEssiePromo: 15% off select nail products and kitsShop EssieEssie Gel Couture Nail Polish Kit, Fairy Tailor + Top Coat, $, available at AmazonKiehl’sPromo: 30% off select productsShop Kiehl’sKiehl's Better Screen UV Serum SPF 50+, $, available at AmazonNeutrogenaPromo: 15-30% off select productsShop NeutrogenaNeutrogena Hydro Boost Water Gel, $, available at AmazonStila Cosmetics Promo: Up to 40% off select productsShop Stila CosmeticsStila Magnificent Metals Glitter And Glow Liquid Eye Shadow, $, available at AmazonBlissPromo: 20-50% off select productsShop BlissBliss Block Star SPF 30 Daily Tinted Sunscreen, $, available at AmazonBilliePromo: 15% off select productsShop BillieBillie Dermaplane Starter Kit (Malibu), $, available at AmazonThe OutsetPromo: Up to 50% off select productsShop The OutsetThe Outset Gentle Micellar Antioxidant Cleanser, $, available at AmazonChillhousePromo: 25% off all products Shop ChillhouseChillhouse Chill Tips Signatures | Editor-in-Chill, $, available at AmazonDysonPromo: Get $100 off Airwrap Multi-Styler Complete Long and Supersonic Hair Dryer Shop DysonDyson Supersonic Nural™ Hair Dryer, $, available at AmazonElizabeth ArdenPromo: 25% off select productsShop Elizabeth ArdenElizabeth Arden Eight Hour Cream Skin Protectant, $, available at AmazonMedicubePromo: Up to 52% off productsShop MedicubeMedicube Zero Pore Facial Toner Pads, $, available at AmazonCliniquePromo: Up to 30% off select productsShop CliniqueClinique Almost Lipstick in Black Honey, $, available at AmazonCosRXPromo: Up to 52% off all productsShop CosRXCosRx 6X Peptide Collagen Booster Toner Serum, $, available at AmazonMedik8Promo: 30% off select productsShop Medik8Medik8 Advanced Regenerating Multi Peptide Serum, $, available at AmazonSquigs BeautyPromo: 25% off all productsShop Squigs BeautySquigs Gooseberry Delight Hair Oil, $, available at AmazonGoop BeautyPromo: 20-30% off select Goop Beauty and good.clean.goop skincare and body products Shop Goop Beautygood.clean.goop The Daily Juice Cleanser, $, available at AmazonBeekman 1802Promo: 30% off select productsShop Beekman 1802Beekman 1802 Whipped Body Cream, $, available at AmazonForeoPromo: 40% off LUNA 4Shop ForeoForeo LUNA 4, $, available at AmazonFirst Aid BeautyPromo: 25% off all products, 40% off select productsShop First Aid BeautyFirst Aid Beauty Ultra Repair Face Moisturizer with Sunscreen, SPF 30, $, available at AmazonBondi SandsPromo: Up to 50% off select productsShop Bondi SandsBondi Sands Self Tanning Foam, $, available at AmazonGlow RecipePromo: Up to 30% off select productsShop Glow RecipeGlow Recipe Avocado Melt Retinol Eye Cream, $, available at AmazonCocokindPromo: 25% off select productsShop Cocokindcocokind Electrolyte Water Cream, $, available at AmazonShani DardenPromo: 20% off select productsShop Shani DardenShani Darden Triple Acid Signature Peel, $, available at AmazonDr. Dennis GrossPromo: 20% off all products (excluding LED and new launches)Shop Dr. Dennis GrossDr. Dennis Gross Skincare Extra Strength Daily Peel (30 Treatments), $, available at AmazonLa Roche-PosayPromo: Up to 30% off select productsShop La Roche-PosayLa Roche-Posay Toleriane Purifying Foaming Facial Cleanser, $, available at AmazonMilk MakeupPromo: 20% off select productsShop Milk MakeupMilk Makeup Hydro Grip Primer, $, available at AmazonGisouPromo: Up to 25% off select productsShop GisouGisou Honey Infused Hair Oil, $, available at AmazonEOSPromo: 15% off select productsShop EOSeos 24H Moisture Super Balm- 4 Flavor Combo Pack, $, available at AmazonBriogeoPromo: Up to 40% off bestsellersShop BriogeoBriogeo Scalp Revival Rosemary Pre-Wash Oil, $, available at AmazonBloomeffectsPromo: 35% off select productsShop BloomeffectsBloomeffects Royal Tulip Moisturizing Nectar, $, available at AmazonSnifPromo: 20% off all candles, scent boosters, and detergentShop SnifSnif Sweet Ash Laundry Detergent, $, available at AmazonLumineuxPromo: Up to 40% off all productsShop LumineuxLumineux Teeth Whitening Strips 21 Treatments, $, available at AmazonSmashboxPromo: 30% off all productsShop SmashboxSmashbox The Original Photo Finish Smooth \u0026 Blur Makeup Primer, $, available at AmazonR+CoPromo: Up to 30% off select productsShop R+CoR+Co Dallas Thickening Shampoo, $, available at AmazonBatistePromo: 30% off all productsShop BatisteBatiste Light Dry Shampoo, Zen Matcha, $, available at AmazonFunction of BeautyPromo: 20% off all products and 25% off bundlesShop Function of BeautyFunction of Beauty Wavy Hair Shampoo \u0026 Conditioner Set, 11 oz, $, available at AmazonOuaiPromo: 20% off all products Shop OuaiOuai Detox Shampoo, $, available at AmazonIsle of ParadisePromo: 20% off select productsShop Isle of ParadiseIsle Of Paradise Self-Tanning Water, $, available at AmazonOriginsPromo: 30% off skincare Shop OriginsOrigins Checks and Balances Frothy Face Wash, $, available at AmazonSunday RileyPromo: Up to 30% off select productsShop Sunday RileySunday Riley Good Genes All-in-One Lactic Acid Treatment Face Serum, $, available at AmazonLolaViePromo: 30% off Glossing Detangler and Intensive Repair TreatmentShop LolaVieLolaVie Glossing Detangler, $, available at AmazonEllis BrooklynPromo: Up to 20% off all productsShop Ellis BrooklynEllis Brooklyn Perfume Oil Roll-On, $, available at AmazonRose and Ben Promo: 25% off the entire catalog Shop Rose and BenRose and Ben Beauty C41 Blush Brush, $, available at AmazonInnisfreePromo: Up to 30% off bestsellersShop InnisfreeInnisfree Daily UV Defense SPF 36, $, available at AmazonDrybarPromo: 20% off select products and toolsShop DrybarDryBar The Single Shot, $, available at AmazonL’Oréal ParisPromo: Up to 20% off select productsShop L’Oréal ParisL'Oreal Paris True Match Lumi Glotion, $, available at AmazonHerbivorePromo: 15% off select productsShop HerbivoreHerbivore Bakuchiol Retinol Smoothing Serum, $, available at AmazonNYX Professional MakeupPromo: 30% off select productsShop NYX Professional MakeupNYX Professional Makeup Fat Oil Lip Drip, $, available at AmazonVerbPromo: 30% off select productsShop VerbVERB Jumbo Ghost Oil, $, available at AmazonReal TechniquesPromo: Up to 30% off bestsellersShop Real TechniquesReal Techniques Makeup Brush Set with 2 Sponge Blenders, $, available at AmazonSulwhasooPromo: Up to 30% off all productsShop SulwhasooSulwhasoo Gentle Cleansing Oil, $, available at AmazonMadison ReedPromo: 30% off Radiant Hair Color Kit, Root Perfection Touch Up Kit, and ColorWonder Demi-Permanent Hair Color ßShop Madison ReedMadison Reed Radiant Hair Color Kit, $, available at AmazonYouth To The PeoplePromo: 25% off all productsShop Youth to the PeopleYouth To The People Kale + Antioxidant Superfood Face Cleanser, $, available at AmazonBK BeautyPromo: Up to 43% off brushes and brush setsShop BK BeautyBK Beauty 101 Contoured Foundation Brush, $, available at AmazonKate SomervillePromo: 30% off all productsShop Kate SomervilleKate Somerville EradiKate 3% Sulfur Daily Foaming Cleanser, $, available at AmazonMuradPromo: 30% off select productsShop MuradMurad Rapid Dark Spot Correcting Serum, $, available at AmazonUrban DecayPromo: Up to 40% off select productsShop Urban DecayUrban Decay All Nighter Waterproof Makeup Setting Spray, $, available at AmazonJack BlackPromo: Up to 25% off select productsShop Jack BlackJack Black Double Duty Face Moisturizer SPF 20, $, available at AmazonLiving ProofPromo: 20% off select products Shop Living ProofLiving Proof Perfect Hair Day Dry Shampoo, $, available at AmazonMoroccanoilPromo: 20-30% off select productsShop MoroccanoilMoroccanoil Frizz Shield Styling Spray, $, available at AmazonNaturiumPromo: 20% off select productsShop NaturiumNaturium Skin-Renewing Retinol Body Lotion, $, available at AmazonIt CosmeticsPromo: Up to 40% off select productsShop It CosmeticsIt Cosmetics Your Skin But Better CC+ Cream Illumination, $, available at AmazonFable \u0026 ManePromo: Up to 30% off select productsShop Fable \u0026 ManeFable \u0026 Mane HoliRoots Hair Growth Oil \u0026 Scalp Treatment, $, available at AmazonLike what you see? How about some more R29 goodness, right here?Last Chance: Score These Prime Day Fashion DealsCrest Whitestrips' Prime Big Deal Day Sale Is HereAll The Details About Amazon Prime Big Deal Days",
    "author": "Karina Hoshikawa",
    "published": "Thu, 10 Jul 2025 12:45:50 +0000",
    "image": "https://www.refinery29.com/images/11913852.jpg?auto=webp\u0026width=1500\u0026height=1500\u0026quality=85\u0026crop=1:1",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "24218b77-5fe1-4e73-ab0e-b9d7c7eb68fe",
    "title": "Huda Beauty’s Lip Contour Stains Are Causing A Commotion",
    "link": "https://www.refinery29.com/en-us/huda-beauty-lip-contour-stain-controversy?utm_source=feed\u0026utm_medium=rss",
    "description": "When Huda Beauty unveiled its Lip Contour Stains — a smudge-proof lip stain-meets-lip liner promising 12-hour wear — the internet went… mild. Unlike the brand’s Easy Bake Setting Powder and Easy Blur Foundation (both recent viral hits among beauty enthusiasts, makeup artists, and editors alike), the stains have received a wave of less-than-glowing reviews.  What are people saying about Huda Beauty’s Lip Contour Stains? On TikTok, it doesn’t take long to find videos claiming that the $25 products arrive completely dry or dry out after just a couple of uses. In response, beauty lovers are flooding the comments with tips and suggestions, like wetting the felt-tip brush before use. The commotion even prompted a TikTok response from Huda Beauty founder Huda Kattan herself. @monalisahater Got it yesterday and stored it upside down to see if that would help… it did not 💔 Is this a me problem #hudabeauty #hudabeautylipcontour #lipstain #helpme #makeup ♬ original sound – nora 🫂 In a video with 1.7 million views and climbing, Kattan defended the product as a sleek new innovation she believes will soon be everywhere, adding that some users may simply be using it incorrectly. Referring to the tapered felt-tip applicator, she added, “Right now, there’s nothing on the market that looks like this. [It was] made in Japan, and the formula was made in Germany — it’s fancy. It’s the crème de la crème of quality.” With costs rising across the board, we’ve come to expect serious quality, not to mention ease of use, from every makeup product we buy. But it’s clear that the brand’s claims don’t match the reality of some consumers. So what’s gone wrong? @hudabeauty Addressing all the questions you have about our NEW Lip Contour Stains 💖 #lipcontourstains #hudabeauty 🎥: @champagnebecca, @christxiee, @memefrederick,  @slaybyjess, @sallysa3eed_, @taontm, @freddiechen, @thefashionfreakk, @makeupbybrooktiffany, @nemesismarie06, @aysha_harun, @rohiimaaa, @not_another_hanna ♬ original sound – Huda Beauty Why is my Huda Beauty Lip Contour Stain dry? Cosmetic chemist Javon Ford took to Instagram to explain why your Lip Contour Stain might dry out quickly: “This is partly because it’s a marker, but also because of this specific marker’s composition,” said Ford. Without diving too deep into science, he explained that beyond water and aloe vera juice, the main ingredient is a film-former called polyurethane-35, which helps the color adhere to the lips: “It’s long-lasting and fast-drying,” said Ford.  View this post on Instagram A post shared by Javon Ford (@javonford16) He said that all markers can dry out quickly as the volatile substance — in this case, water — can slowly evaporate from the cap. But where Huda Beauty’s is concerned, it can become even more noticeable when there’s a large percentage of a non-water-soluble ingredient, in the case of polyurethane-35. Ford added that while other lip stains are solely water-based (like CoverGirl’s Outlast Lip Stain) or oil-based, such as Haus Laboratories’ Hybrid Lip Oil Stain, Huda Beauty’s formula needs extra attention to work properly. Zobia Ahmed, a cosmetic chemist and product developer, agrees that the creamier, more viscous liquid inside Huda Beauty’s lip stains might make the product trickier to use: “Emulsions have a habit of thickening over time, so maybe that viscous liquid gets ‘stuck’ and you have to tap it on a hard surface or tip upside down to force the liquid to the tip. Or maybe the viscous liquid becomes thicker just by sitting in the marker,” she says. But here’s the catch-22: that thicker consistency — also made of glycerin and plant oils — is what cushions the lips, making it more moisturizing and flexible, and helping to prevent dryness and bleeding outside the lip line, says Ahmed.  For consumers whose pens aren’t working at all, Ahmed says it’s possible that during the manufacturing or filling stage, the tip might not have been primed adequately: “If you don’t saturate marker tips and felt tips properly, they will feel dry upon first use,” she says. If yours isn’t doing anything, just reach out to the brand. View this post on Instagram A post shared by Zobia | Cosmetic Chemist (@zobssssa) How do you stop the Huda Beauty Lip Contour Stains from drying out? Besides this, Ahmed says that user error could contribute: “When this product was developed, it was done so with clear instructions: store the marker cap-side down,” she says. “If users aren’t following the instructions, chances are they’ll experience these drying issues.”  Makeup artist Maria Asadi says that dried-out tips are a common issue with pen-style applicators like these: “The ink inside behaves a lot like a felt-tip pen, so how you store it really matters,” she confirms. “If you’re holding or storing it with the tip facing up, the ink naturally sinks away, travelling down from the tip, making it dry out faster.”  Alicia Lartey, an aesthetician, product developer, and cosmetic chemist in training, also recommends shaking it downwards before applying and ensuring the cap is firmly closed when you’re finished. Lastly, because it’s a stain, Lartey recommends applying it directly onto bare skin — and Kattan agrees: “I don’t apply it on top of foundation,” she said, as it simply won’t stick. “What will also happen is you’ll clog the tip,” Kattan added, though running it under hot water can help unclog it. How much product do you get in the Huda Beauty Lip Contour Stains? Another of Kattan’s concerns was the criticism around the product’s fill — a seemingly paltry 1ml, according to users. In her video, Kattan addressed this, explaining that while it might not feel like a lot, it is. “The product is full,” she said. Adding, “If we were to make it chubbier and fill it more, it would just be… a not great experience.” Kattan and her team tested the product strictly as a lip liner, and she claims you’ll get around 200 uses — but only if used as a liner. @hudabeauty Let’s talk texture 💋 Our Lip Contour Stain = water-based, pigmented, soft matte finish, 12-hour stay. 8 shades from soft pink to juicy red 💧FAUX FILLER Jelly Oil = high-shine and packed with passion fruit oil \u0026 shea butter for soft, glossy lips. Grab yours at HudaBeauty.com before they vanish 🛍️ ♬ original sound – Huda Beauty Compared to similar pen liners, 1ml does feel quite scant. I asked Ahmed whether this is normal for lip liner pens. “In theory, 1ml may contain enough pigment for hundreds of applications when the formula is thin — like CoverGirl’s,” she tells me. Thicker formulas like Huda Beauty’s, however, would likely have fewer applications: “This is because they don’t distribute as easily as their thinner counterparts,” says Ahmed. But there are merits to a thicker formula: “It’s more concentrated, so there’s less swiping back and forth, and less of a need for reapplication.” Lartey adds that as a beauty consumer, she wants her lip liners to contain a reasonable amount of product that allows her to get enough use out of them without the formula going bad. “With that in mind — and with moderate use and correct storage — I do think 1ml is fair,” she says. What are the Huda Beauty Lip Contour Stains like IRL? Having tried the Lip Contour Stains myself, I can confirm they leave very little room for error. Even as a seasoned lip liner wearer, I feel a little nervous every time I use one. Since the product behaves like ink, you only have a few seconds to blend with your finger if you want a diffused lip look, and micellar water only does so much to clean up any mistakes. But that’s the entire point, says Lartey: “I think people need to remember that the primary job of a lip stain is to stain. Plus, it’s marketed as such.” That said, Kattan is listening to her customers, though she seems hesitant to change the formula too much: “I will work on how long you guys have to play with the product, but I don’t know if it’s going to work,” she said in her video. She added, “It might make the product less long-lasting. We want to give you guys a product that lasts all day long.”  What’s a good alternative to Huda Beauty’s Lip Contour Stains? Asadi doesn’t typically reach for lip stains unless a makeup client specifically requests them or she’s working in very humid conditions and needs waterproof makeup. Instead, she likes to use VIEVE’s Modern Lip Definer, $23, and KIKO Milano’s Everlasting Color Precision Lip Liner, $12.50. “These are my go-to for a bulletproof lip liner that holds throughout the day,” says Asadi. “They’re super long-wearing, richly pigmented, and don’t smudge.” For maximum wear, she likes to apply the liner all over the lips as a base, skipping gloss or balm. “This gives you a clean, matte finish that lasts for hours without needing touch-ups, and that will take you through the day,” she adds. Speaking of excellent staying power, Kattan is aware of the comparisons to other lip stains, particularly KIKO Milano’s Long Lasting Color Lip Marker, $14.50, and CoverGirl’s Outlast Lip Stain, $11.99. Ahmed has used the latter — and she has thoughts: “While it’s beautiful and effective, it lacks the conditioning agents and flexible film formers that would add to the user’s comfort,” she says. Adding, “CoverGirl also relies on a high-alcohol system for quick drying, which is effective but may feel drier over time.” However, Ahmed doesn’t think we’d notice the difference if we were only using the stains as lip liners, rather than all over the lips. Likewise, Kattan maintains that the Lip Contour Stain is different — in the best way: “We’re not here to give you the same products as other brands,” she said in her video. “Once you get the use right, I’m confident you’re going to love it.” With the right technique and storage, the Lip Contour Stain can deliver on its long-wear promise, but for many, a lip product that demands more effort might not feel worth the payoff. Like what you see? How about some more R29 goodness, right here?7 Low-Maintenance Makeup Trends For SummerBlurred Makeup Is Summer’s Softest Makeup TrendWe Tried Clinique's New Makeup-Skincare Hybrid",
    "author": "Jacqueline Kilikita",
    "published": "Thu, 10 Jul 2025 11:00:13 +0000",
    "image": "https://www.refinery29.com/images/11914969.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "4d9422fc-fd85-410e-b579-5cd60d7b0c16",
    "title": "The 2025 Prime Day Beauty Deals We're Purchasing, From Laneige to CeraVe",
    "link": "https://www.popsugar.com/beauty/amazon-prime-day-beauty-deals-49212329",
    "description": "Beauty lovers, it's day three of Amazon Prime Day, and the deals are even better this year, running today through July 11. The annual shopping event is packed with steep discounts on products in home, kitchen, tech, wellness, fashion, and (of course) beauty. As shopping experts and Prime Day pros, we understand how overwhelming it can be to scroll through all the offers and find the best deals, but there's no need to worry or stress - we're here to help. If you're looking for the best early deals on beauty products, we've got your back! Amazon Prime Day has no shortage of bang-for-your-buck beauty deals, including makeup, hair care, skin care, nail care, and body care, plus several editor-favorite picks from brands like Laneige, Maybelline, and La Roche Posay (yes, that includes Sydney Sweeney's viral lip mask). Regardless of your beauty needs, this is your chance to stock up on beauty essentials on a budget or try something new without breaking the bank. We're talking the perfect face sunscreen for the summer, a vitamin C serum for your skin-care routine, and an acne treatment you'll never get tired of. Prime Day also offers plenty of makeup, body care, and nail must haves. Our Favorite Prime Day Beauty Deals to Shop A lip mask approved by Sydney Sweeney: Laneige Lip Sleeping Mask at $17, originally $24 A sunscreen to keep you safe all year long: Neutrogena Ultra Sheer Dry-Touch Sunscreen For Face \u0026 Body at $9, originally $13 The best toner pads on the market: Medicube Deep Vita C Pad at $15, originally $32 The best mascara for long lashes: Lancôme Lash Idôle Lash-Lifting \u0026 Volumizing Mascara at $18, originally $30 A viral antiaging beauty massager: Medicube Age-R Booster Pro Beauty Massager at $150, originally $228 Shop more of Popsugar's editor-curated Amazon Prime Day Sale picks and subscribe to our newsletter for more shopping recommendations. And, if you aren't already a Prime Member, you can sign up here. Update on July 10, 2025 at 6:30 PM ET: Updated prices and checked stock for all products.",
    "author": "Anvita Reddy",
    "published": "Thu, 10 Jul 2025 15:30:01 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/okxLVusk2pVifzr4QxRMBTg2laY/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/06/18/757/n/1922153/44d41c486852f339b4f847.89273359_.png",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Beauty Shopping",
      "Sales",
      "Prime Day",
      "Amazon",
      "Shopping"
    ]
  },
  {
    "id": "10b4202c-eadf-4290-aa33-95b0883e9a61",
    "title": "Kourtney Kardashian Barker Loves This K-Beauty Line - Get 40% Off Its Glass Skin Kit",
    "link": "https://www.popsugar.com/beauty/peach-lily-glass-skin-discovery-kit-deal-49451328",
    "description": "Parched skin and summer often go hand-in-hand. Whether it's a long flight, sun-bathing, or cocktails by the pool, this season is full of dehydration culprits. For dewy skin, we're turning to one of Kourtney Kardashian Barker's favorite skincare brands, Peach \u0026 Lily. The Korean beauty line is currently offering a 40 percent discount on their Peach \u0026 Lily Glass Skin Discovery Kit ($39, originally $65), and we're ready to stock our carry-ons. The kit offers travel sizes of their popular four-step skincare routine which cleanses, hydrates, calms, and brightens skin while protecting from skin radicals. It's created for all skin types, so whether you're battling acne or dryness, key ingredients like hyaluronic acid, niacinamide, chammomile flower extract, matcha, and peach extract will help you get your glow back. So what exactly is included? You'll get the Peach \u0026 Lily Power Calm Hydrating Cleanser ($29) (Kardashian Barker's go-to!), the Peach \u0026 Lily Wild Dew Treatment Essence ($39), the Peach \u0026 Lily Glass Skin Refining Serum ($39), and the Peach \u0026 Lily Matcha Pudding Anti-Oxidant Cream ($72). In true Kardashian Barker form, the products feature clean ingredients that are cruelty-free and vegan. Even our editors are fans (just read our Peach \u0026 Lily Glass Skin Collagen Mask review). Make sure to get your hands on a kit while supplies (and the sale!) last. Angela Elias (she/her) is a contributing editor for PS Shopping, where she reviews everything from beauty products to kitchen gadgets, curates can't-miss sales, and creates \"best of\" shopping roundups. In her former roles at PS, she led the relaunch of its Latine identity and family-focused verticals, directed its Home vertical, and hosted shopping segments. She has nearly 15 years of experience working in the lifestyle space as a writer, editor, content strategist, director, on-camera talent, and publicist.",
    "author": "Angela Elias",
    "published": "Thu, 10 Jul 2025 11:30:03 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/JzD08Rf3C7NARPHTj8dcBYnLxGY/0x434:1440x1874/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/07/10/785/n/1922153/c11cba32686ffd989b2a71.61199299_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Kourtney Kardashian",
      "Beauty Shopping",
      "Sales",
      "Celebrity Beauty",
      "Skin Care"
    ]
  }
]
