[
  {
    "id": "f1e2dc30-7561-4e70-9e71-dc2c2aaadf8d",
    "title": "Favorite Perfumes of 2024",
    "link": "https://thebeautylookbook.com/2024/12/favorite-perfumes-of-2024.html",
    "description": "Favorite Perfumes of 2024. Rounding up the best scents this year including a few new discoveries!",
    "author": "Sabrina",
    "published": "Wed, 18 Dec 2024 20:05:27 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2024/12/Best-Perfumes-2024-Celine-Phlur-CreedFragrance.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/beauty-favorites' target='_blank' style='color:currentColor;text-decoration:none;'\u003eBeauty Favorites\u003c/a\u003e",
      "Fragrance"
    ]
  },
  {
    "id": "28fc68ac-5c57-4128-b492-d15d14cd634d",
    "title": "Dior Beauty Holiday Launches 2024",
    "link": "https://thebeautylookbook.com/2024/12/dior-beauty-holiday-launches-2024.html",
    "description": "Dior Beauty Holiday Launches 2024. Rounding up a little luxury beauty haul with picks from Dior Beauty this year.",
    "author": "Sabrina",
    "published": "Mon, 16 Dec 2024 13:24:31 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2024/12/Dior-Beauty-Holiday-2024.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/brand/dior' target='_blank' style='color:currentColor;text-decoration:none;'\u003eDior\u003c/a\u003e",
      "Dior"
    ]
  },
  {
    "id": "7c28e8c4-4c50-4071-9a33-0b7d95519ac3",
    "title": "Glamnetic: A TikTok-Viral Brand Known for Press-On Nails and Magnetic Lashes",
    "link": "https://fashionista.com/2024/12/glamnetic-nail-lash-brand",
    "description": "Brand Bio is Fashionista's guide to the best independent fashion and beauty brands — a resource for retailers, job seekers, B2B companies and consumers alike. If you'd like your brand to be featured, fill out this form. GlamneticHeadquarters: Los Angeles, CA and Miami, FLE-commerce: ...Continue reading",
    "author": "Fashionista",
    "published": "Thu, 26 Dec 2024 13:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjExNTMzNjk4ODE2ODEzMDQ0/glamnetic-nails-1.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "nails",
      "Brand Bio Nail Care",
      "Lashes",
      "Brand Bio",
      "Press-on Nails",
      "Glamnetic",
      "Brand Bio Beauty",
      "Beauty",
      "Indie Beauty",
      "Shopping",
      "Network"
    ]
  },
  {
    "id": "a1c67e5d-2fa8-466c-b247-47f1e8ae36e8",
    "title": "Deinde: A Skin-Care Brand That Focuses on 'Inflammaging'",
    "link": "https://fashionista.com/2024/12/deinde-skin-care-brand",
    "description": "Brand Bio is Fashionista's guide to the best independent fashion and beauty brands — a resource for retailers, job seekers, B2B companies and consumers alike. If you'd like your brand to be featured, fill out this form. DeindeHeadquarters: San Diego, CAE-commerce: deinde.comSocial Media: Instagram ...Continue reading",
    "author": "Fashionista",
    "published": "Mon, 23 Dec 2024 15:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjExMzczMTYwNDU1NDgxMzMy/deinde-skin-care-four.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Brand Bio",
      "Brand Bio Skin Care",
      "Brand Bio Beauty",
      "Beauty",
      "Skin Care",
      "Network",
      "Indie Beauty",
      "Shopping"
    ]
  },
  {
    "id": "6ecd6960-299c-4185-bdeb-f552b9d97cf2",
    "title": "The Best-Smelling Shampoo I’ve Tried This Year",
    "link": "https://www.elle.com/beauty/makeup-skin-care/a63240436/suite-reyad-shampoo-conditioner-review/",
    "description": "",
    "author": "",
    "published": "Thu, 26 Dec 2024 15:00:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "5284e229-d33d-4698-b578-f5466d99daf0",
    "title": "Dry January Forever: How Gen Z Is Turning Sobriety Into a Lifestyle",
    "link": "https://www.elle.com/beauty/health-fitness/a63136446/gen-z-sobriety-lifestyle-trend-explained/",
    "description": "Welcome to the mocktail era.",
    "author": "",
    "published": "Thu, 26 Dec 2024 13:00:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "53400f6e-c799-4fd6-ab8d-c004efb73343",
    "title": "Melissa Barrera, Actor",
    "link": "https://intothegloss.com/2024/12/melissa-barrera-your-monster-beauty-routine/",
    "description": "The mascara on every telenovela's actor's lids, a NAD+ skincare routine, and the fruity fragrance she just can't quit",
    "author": "",
    "published": "Thu, 19 Dec 2024 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "5edf9cdd-1cba-498f-a2e9-2cf74acc6a80",
    "title": "Valeria Yamin, Dancer, The Rockettes",
    "link": "https://intothegloss.com/2024/12/rockettes-valeria-yamin-beauty-routine/",
    "description": "Sometimes the perfect bun is only a 'twist fit' away",
    "author": "",
    "published": "Thu, 12 Dec 2024 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "97ac9a76-8707-4a5b-943f-8e336076d7ee",
    "title": "Nordstrom Anniversary Sale Haul Try-On",
    "link": "http://www.frmheadtotoe.com/2020/08/nordstrom-anniversary-sale-try-on.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-17T12:17:00.016-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "57164fd1-8ae5-4bd9-89c3-1d2272a595fa",
    "title": "Best In-Stock Items! Nordstrom Anniversary Sale Picks 2020",
    "link": "http://www.frmheadtotoe.com/2020/08/best-in-stock-items-nordstrom.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-13T11:38:00.002-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "c81e32a3-9d65-4f38-9e32-70ae7c3656c5",
    "title": "9 Winter Perfumes Guaranteed To Brighten Up The Gloomiest Days",
    "link": "https://www.refinery29.com/en-us/best-winter-perfume-fragrances?utm_source=feed\u0026utm_medium=rss",
    "description": "They say that winter is the most magical time of the year, though I'd have to argue differently. Besides slippery sidewalks and static hair, there's chapped lips, Seasonal Affective Disorder (SAD), crowded subway stations, and coming to terms with how bad you are at wrapping presents.But peel back all the heavy layers that make you sweat through your commute and take a moment to unwind, and maybe you'll start to feel some semblance of the cozy, festive vibes all those holiday movies promised. And if you ask us, reaching for the right fragrance definitely helps.From Maison Francis Kurkdjian to Kayali, the biggest fragrance houses have been busy whipping up perfumes that feel like the comforting hug we've been yearning for all season — and whether you can't get enough of cozy vanilla notes or cool winter florals are more your thing, there's something to suit every budget. All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.For more can't-miss shopping stories delivered straight to your inbox, sign up for our Most Wanted newsletter.Kayali Yum Boujee Marshmallow 81 Eau de Parfum Intense“A perfume with this name is a far cry from the musky, spicy scents I typically gravitate to. However, Kayali previously won me over with another sweet concoction, Burning Cherry, so I was intrigued to try this latest offering. Yum Boujee Marshmallow creates a first impression that’s nothing like its name. The scent is bright, zesty, and decidedly fruity and floral, relying heavily on its top notes of freesia, lemon, and apple. It’s almost a bit too intense for my nose, but, luckily, it has a gorgeous dry down. It’s warm and musky at the base, balanced with hints of sweetness that's really wearable. This is where it lives up to its marshmallow name, aided by notes of whipped cream and vanilla. This new launch reminds of the sweet body sprays from my teens, but a lot more elegant and refined (and a lot less cloying). I can still smell it on my clothes at the end of the day.” — Esther Newman, affiliate writerShop SephoraKayali Yum Boujee Marshmallow 81 Eau de Parfum Intense, $, available at SephoraD.S. \u0026 Durga Big Sur Eucalyptus Eau de Parfum“I’ve been sharing Big Sur Eucalyptus with my partner; it’s the ultimate genderless fragrance. Initially, it’s a burst of fresh, woody, green crunchiness thanks to eucalyptus, rosemary and wet wood, but as it settles into the skin, it takes on a warm and spicy feel with hints of cardamom and dry leaves. It’s the perfect balance between a breath of crisp winter air and cozying up in an oversized hoodie. I love the chic bottle, too, which takes pride of place on my bedside cabinet.” — Jacqueline Kilikita, beauty directorShop NordstromD.S. \u0026 Durga Big Sur Eucalyptus Eau de Parfum, $, available at NordstromZara Shades Of Lust Eau de Parfum“This was my first time trying a Zara fragrance, and I have to say that I’m pleasantly surprised. Not only does Shades Of Lust come in an intricate glass bottle that looks way more expensive than it actually is (and bears a striking resemblance to Guerlain perfumes), the longevity and projection are both incredible for the $23 price tag. Just one spray on my wrists fills my nose — and my immediate surroundings — with a delicious aroma of white peach and orange blossom, which takes a good few hours to fade. Anyone who likes fruity floral scents will be absolutely on board, especially if you’re already a fan of peach-centered perfumes like Parfums de Marly Valaya or Kilian Paris Good Girl Gone Bad.” — Venus Wong, senior writerShop ZaraZara Shades Of Lust Eau de Parfum, $, available at ZaraJo Malone Fir \u0026 Artemisia Cologne“To my nose, this perfume doesn’t lean feminine or masculine. The woodsy note of fir tree is the star here, and there’s a quiet dash of something minty and bitter in the background. I don’t normally love patchouli as I find it too masculine for my taste, but here it’s subtle. This scent reminds me of the holiday in that it’s warm, but not spicy. Don’t expect robust staying power, but I think that works perfectly here. It stays close to the skin, making it quite an intimate and cozy scent. If this did have intense projection, it would be too overbearing (off-putting, even). All in all, this scent reminds me of hugging someone you love while wearing a thick sweater.” — Tanyel Mustafa, senior writerShop Blue MercuryJo Malone Fir \u0026 Artemisia Cologne, $, available at Blue MercuryMerit Retrospect L'Extrait de Parfum“Upon first sniff, Retrospect does give the impression of a grandma scent, but hear me out: it’s chic,like you’ve just discovered her vintage Chanel jacket hiding in the back of the closet, and her perfume is still clinging to the fabric. It’s familiar and comforting. The pear top note hits you first, and while that initial blast is strong, it dries down and begins to smell more unique and skin-like. This is where it starts to shine. The florals (jasmine, orris, and rose) peek through, and aldehydes cut them with a sharp, clean zing. The notes of musk, jasmine, and moss then linger for hours, wrapping you in a warm, nostalgic hug. I love to wear this with knits — there’s just something so soothing about it on a chilly winter’s day.” — Humeara Mohamed, Contributing WriterShop MeritMerit Retrospect L’Extrait de Parfum, $, available at MeritMaison Francis Kurkdjian APOM Eau de Parfum“APOM, which stands for 'A Part of Me’, is the perfume I’ve been turning to whenever the winter blues have been getting to me. I like to think of it as a bottled up ray of sunshine that feels surprisingly appropriate for cold and gloomy days. The main characters are ylang-ylang and neroli, which are both notes that bring back some of my happiest memories traveling through Southeast Asia (as these types of scents are heavily featured in spa products out there). The two florals are elevated by orange blossom, which creates a scent profile that’s much more sophisticated than your average floral perfume. Notes of amber and white musk further ground the scent, making it a more warm and nostalgic experience. This perfume has The White Lotus season three (which just so happens to be set in Thailand) written all over it, and I’ve been reaching for my bottle whenever I need to channel my inner rich auntie.” — Venus Wong, senior writerShop NordstromMaison Francis Kurkdjian APOM Eau de Parfum, $, available at NordstromBDK Parfums Rouge Smoking Eau de Parfum“From Kayali Burning Cherry to Zara Cherry Smoothie, I have an obsession with cherry perfumes. They’re often tart and syrupy in equal measure and therefore a lot more nuanced than your typical fruity fragrances, which can be overly saccharine. At first spritz, BDK’s Rouge Smoking is quite similar to Kayali’s offering, thanks to notes of cherry, almondy heliotrope flower and zingy bergamot, but the dry down is where it stands out and triumphs. It becomes clean and comforting (that’ll be the white musk, vanilla and cashmere wood) and I’ve never known a fragrance to cling to the skin and clothes quite like it. The staying power is incredible. It’s a sexy cherry scent for grown ups that transcends seasons but works particularly well in winter. I always look forward to spritzing it.” — Jacqueline Kilikita, beauty directorShop Neiman MarcusBDK Parfums Rouge Smoking Eau de Parfum, $, available at Neiman MarcusChanel No.5 Limited-Edition Eau de Parfum“Despite the influx of tourists around the holiday season, I do appreciate seeing all the festive decorations around London. One of my favorite strolls has been via New Bond Street, which is currently decked out with glorious Christmas lights shaped like Chanel No.5 bottles. I’ve definitely developed a stronger love for this classic perfume since entering my 30s, especially with how the sharp and piercing aldehydes interact with my body chemistry to create a luxurious, soapy scent that doesn’t smell like anything else. For the holiday season, Chanel has released a special edition of No.5, featuring a bottle draped in handwoven silk to create a ‘snowfall’ effect. The fairytale packaging makes this an even more worthy collector’s item, if you ask me.” — Venus Wong, senior writerShop ChanelChanel No.5 Limited-Edition Eau de Parfum, $, available at ChanelJo Loves Black Cashmeran and Tonka Parfum“This would make the perfect addition to any winter perfume wardrobe. With spicy cardamom, a heavy helping of ginger and a dash of rum, it’s like a warming masala chai with a slab of dark chocolate on the side — rich but never bitter thanks to vanilla-esque tonka bean, which lends a subtle sweetness. Whenever I wear this, I feel so powerful.” — Jacqueline Kilikita, beauty directorShop Jo LovesJo Loves Black Cashmeran and Tonka Parfum, $, available at Jo LovesLike what you see? How about some more R29 goodness, right here?The Very Best Beauty Products Of 2024Valentino's New Perfumes Take Luxe To A New LevelHow To Find Your Signature Scent According To Pros",
    "author": "Venus Wong",
    "published": "Tue, 24 Dec 2024 12:40:00 +0000",
    "image": "http://s1.r29static.com/bin/2/7de/0,200,2000,2200/1200x900,100/2096295/image.jpg",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "939eda5d-1c81-4dbe-acd8-3eb0a1258821",
    "title": "Bows Are Everywhere — Here’s How To Style The Accessory On All Hair",
    "link": "https://www.refinery29.com/en-us/how-to-style-hair-bow-accessory?utm_source=feed\u0026utm_medium=rss",
    "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. It’s been a comeback year for hair accessories — but forget your trusty claw clip and shelve the chunky Alice band for a moment. It’s the humble bow that is currently taking over Instagram feeds and flooding TikTok hair tutorials. Of course, bows and ribbons are nothing new; they’ve adorned our hair for centuries. From the last queen of France, Marie Antoinette, whose hairdresser is said to have spent 20,000 francs on ribbons, to young women in the Victorian era, coquettish hair bows have proven enduringly popular. You know what they say, though: All beauty trends come full circle. Samantha Cusick, hairstylist, podcast host and owner of her eponymous London salon chain, puts this 21st century resurgence down to Gossip Girl character Blair Waldorf, not to mention the rise of the ‘quiet luxury’ aesthetic. “Using bows is the easiest way to look like you tried, without actually trying,” she says. It’s effortless. If you’re keen to try the trend but don’t know where to start, let TikTok’s beauty enthusiasts guide you. Here’s how to style the playful bow on all hair. How to style a bow on long hair @kylei.ann gaslighting myself into loving styling my hair #airwrap #hairbow #easyhairstyles #finehair #thinhairhairstyle ♬ original sound – kylei halbakken If your hair is on the straight side, make like TikToker Kylei Halbakken and give it a little texture and movement with a curling iron or hot tool. Halbakken uses the Dyson Airwrap, $599, to create tousles, but if you’d rather spend less, try the Shark FlexStyle Air Styling \u0026 Drying System, $249.99, or BaByliss Air Style 1000 Hot Air Multi Styler, $88. Run a brush through your lengths to loosen the curls into soft waves and pull a little hair oil through the mid-lengths and ends to add shine. Halbakken enlists Gisou Honey Infused Hair Oil, $46, but you can also try OGX Renewing+ Argan Oil of Morocco Penetrating Oil, $10.69. A half-up, half-down style is the easiest way to wear a bow on long lengths. Starting at your temples, use the tail end of a comb to gather half of your hair into a ponytail and fix in place with a small hair elastic, which will make tying your bow less of a chore. Halbakken ties a long piece of ribbon around the elastic, but you could fasten a bow-adorned barrette through the top section of your hair, just above the hair elastic.  If this style looks too princessy for you, then hair stylist Chlöe Swift Bow recommends teasing your roots to create a long and voluminous Brigitte Bardot-inspired pony, finishing with a ribbon or bow scrunchie tied around the base. How to style a bow on layered hair  @sanjureddyyyy bow hairstyles🎀 #bowhairstyles #easyhairstyletutorials #bowhairtutorial #mediumlengthhairstyles #hairstyleideasforyou #grwmhair #hairstyles ♬ original sound – EX7STENCE™ Take inspiration from TikToker Sanjana and section off the front of your hair on either side, so that it frames your face. Moving further inwards, Sanjana fashions a delicate braid on both sides, leaving around two inches of hair free at the end. Secure your plait with a hair elastic, like Kitsch No-Snag Clear Elastics, $3. Now for the ribbon, which you can find on Etsy or at your local craft store. The key is making sure it’s long enough to tie easily. Cut off a piece that is around seven inches long to begin with — you can always trim the ends to suit your preferences. Simply tie the ribbon around each hair elastic and pull tight so that it doesn’t unravel. A veil of strong-hold hairspray over the bow will keep it in place for longer.  How to style a bow on short hair @kylaleelee day 8 of the 10 days of short hairstyles series 💝 super easy \u0026 cutesy! #shorthairstyles #shorthair #easyhairstyles #bowhairstyles #shorthairstyleideas #hairinspo #shorthairinspo #shorthaircut #quickhairstyles #10daysofhairstyles #shorthaircut ♬ som original – chica TikToker Kyla Lee is proof that a hair bow looks just as good on a bob haircut. If you have face-framing bangs like Lee, give it some bounce with a roller, like Drybar High Tops Self-Grip Rollers, $12. Lee gathers small sections of their hair from either side, twists them and then ties them together at the back using a hair elastic. Finally, you’ll need a bow clip with a barrette fastening. Lee passes the open barrette clip just underneath the hair elastic and pins it into place. A chunky bow will complement a shorter cut like this. How to style a bow on natural hair @mochasburner Another day, another cute holiday hairstyle 🎀 #lowbun #sleeklowbun #slickbun #hairbows #bowhairclips #bowhairstyles #hairbowdiy #4chairtutorials #type4a4b #fallhairstyleideas #winterhairtrends #christmashairbow #blackgirlhairtutorial ♬ La belle vie – Sacha Distel Using Aunt Jackie’s Don’t Shrink Flaxseed Curling Gel, $8.99, hair and lifestyle TikToker, Mocha, creates two small braids on either side and plaits the remainder of their hair at the back, then secures this into a low bun. Enlist both a hair tie and bobby pins to keep it tight. You could tie a ribbon around the low bun, but a bow with a barrette clip or scrunchie requires less effort. Fasten yours just above the bun so that the bow tails tumble down over it.  How to style a bow on curly hair @curlyhairstylesandtips #curls #curlytiktok #curlyhairstyles #bowhairstyle #curlmagic #naturalcurls #curlyhairtutorial #curlyhairstyle #bowhairclips #cutehairstyles #easyhairstyles ♬ original sound – Curlswithlove “It’s all about letting the texture do its thing,” says Cusick. Look to TikToker @curlswithlove for inspiration, who makes a case for letting her natural curls shine in a half-up-half-down style. Use your thumbs to gather approximately half of your hair up, so that it resembles a ponytail. You can tie this up using a hair tie or hold this section in place with one hand and pass your barrette clip bow underneath with the other. Pull out some curly tendrils to frame your face and dial up the coquette effect.  @itsmikaylanicolee Hair Inspo 01| Pigtails with Ribbons🎀🫶🏽 #hairinspo #hairbowtutorial #fallhairstyles #curls ♬ Last Christmas (Pudding Mix) – Wham! If your hair is long, take cue from TikToker Mikayla Nicole: Part your hair in the middle, section the front into two ponytails, fix with a hair tie and grace with a bow on each side.  How to style a bow on medium-length hair @adelialaughs The bows 🎀🎀 #mediumhairstyles #slickbackhairstyle #bowhairstyle ♬ original sound – 𝑵𝑨𝑻𝑪𝑺𝑳𝑼𝑽𝑹❦ Mid-length haircuts are far from boring — but they’re even better with a bow. After a generous helping of hair cream (try Moroccanoil Hydrating Styling Cream, $36, or Lee Stafford Grow Strong \u0026 Long Protein Treatment Styling Cream, $14.59), TikToker Adelia whips their hair up into a high ponytail, fashions a chunky braid and ties a short, black ribbon around the base and end for a look that’s sophisticated and playful in equal measure. If you think you might struggle to knot the perfect bow, use a bow-adorned hair tie to make this style easier to recreate at home. How to style a bow on thick hair @_yaliah Adding a bow to every hairstyle \u003e\u003e\u003e #curlyhair #curlyhairstyles #hairstyle #hairstyleideas #hairstyleinspo #hairinspo #fallhairstyles #fall #fallhairinspo #easyhairstyles ♬ family affair – JÆ The slicked-back ponytail shows no sign of letting up, but a bow gives the otherwise utilitarian style an endearing edge. “For thick hair, go bold,” says Cusick. “Oversized bows in textured fabrics like linen or velvet add balance and drama without getting lost.” Use a bristle brush like Cantu Up Do Brush with Natural Bristles, $3.99, and a gentle hair gel like Eco Style Olive Oil Styling Gel, $2.49, to slick your hair back seamlessly, then secure with a hair tie. Passing that big, bold barrette bow clip through your hair just above the base of the ponytail is the cherry on top.  How to style a bow on fine hair @alyssarayelee Step by step for this viral bow hairstyle!! #shorthairstyles #finehairstyles #hairstyleinspo #hairhack #hairtrends ♬ Maria Maria (feat. The Product G\u0026B) (sped up) – Santana \u0026 sped up + slowed TikToker Alyssa has a hack for styling fine hair. Using a fine tooth comb like Maison Pearson Tail Comb, $34, take a section of hair from the front and rake it back, then fasten in the middle with a clear hair elastic. Using your fingers, hollow out a section at the base, just above the elastic and loop the ends through the space. Repeat on the other side. This should create the illusion of four sections of hair. All you need now is a long ribbon to pass through the gaps and tie into a bow. If you find your hair is too fine and slippery to hold a bow, Chlöe suggests adding texture and grip with a dry shampoo or texture spray, like ARKIVE Headcare The Reset Dry Shampoo, $13.50, or Living Proof Full Dry Volume \u0026 Texture Spray, $24.61.   Like what you see? How about some more R29 goodness, right here?The '90s Bun Is Everywhere — Here's How To Do ItThe Snatched Bun Is Trending, Here's How To Do ItHow To Do Fashion Week's Looped Bun In Minutes",
    "author": "Jacqueline Kilikita",
    "published": "Mon, 23 Dec 2024 17:27:17 +0000",
    "image": "https://www.refinery29.com/images/11630815.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "2d0a96e6-f9b3-49bb-9bbf-a9ceb3ddeaf3",
    "title": "What we have written",
    "link": "https://thebeautybrains.com/2024/03/this-is-a-test/",
    "description": "Here is the beauty brains test blog page",
    "author": "Perry Romanowski",
    "published": "Mon, 04 Mar 2024 22:05:47 +0000",
    "image": "",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "cdefaa63-8d71-43ea-9f4b-4a1a0358ece3",
    "title": "Is scalp exfoliation helpful for hair? episode 226",
    "link": "https://thebeautybrains.com/2020/07/6890/",
    "description": "Welcome to the Beauty Brains, a show where real cosmetic chemists answer your beauty product questions and give you an insider’s look at the cosmetic industry. This is Episode 226. Hosts Perry Romanowski, and Valerie George Is glycerin bad for curly hair? Are encapsulated ingredients better? Do scalp exfoliators help? Can beauty companies hide allergens […]",
    "author": "Perry Romanowski",
    "published": "Thu, 02 Jul 2020 17:22:57 +0000",
    "image": "http://thebeautybrains.com/wp-content/uploads/podcast/Episode226.mp3",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Podcast"
    ]
  },
  {
    "id": "c2a18104-ec00-4392-80c4-96f2db651477",
    "title": "20 New Year's Eve Nail Ideas to Help You Start 2025 in Style",
    "link": "https://www.popsugar.com/beauty/New-Year-Eve-Nail-Art-Ideas-36323748",
    "description": "We know, you just got your holiday nails done, but if you're already itching to change things up, you might want to start thinking about your New Year's Eve nails. You might think you're all ready for New Year's Eve - hair, makeup, outfit, and shoes are set - but what about your manicure? It would be a shame not to end the year with amazing nails. To ring in 2025, and to kiss last year goodbye, it's time to pull out all the stops. Whether you're attending a glamorous dinner party with friends or watching the ball drop from your couch with takeout in hand, great New Year's eve nails are never out of place. You can go the traditional route with your New Year's Eve nail art designs and adorn your fingertips with the numbers 2025 (extra points if you do it with rhinestones) or approach the night with a more subtle vibe, like a glittery french manicure or hand-painted stars. All that matters is you find a winter nail design that suits your personal style and makes you feel like you're putting your best nails forward for the new year. Metallic nail polishes, 3D accents, and eye-catching glitter lacquer all make for great New Year's nail designs. There's nothing like a fun and bubbly manicure to really get you into the celebratory spirit. Whether you plan to DIY your look or visit a salon, ahead, find New Year's Eve nail designs to help you welcome 2025 when the clock strikes midnight on Dec. 31. Keep scrolling for the best New Year nail art ideas to save.",
    "author": "Jessica Harrington",
    "published": "Thu, 26 Dec 2024 08:20:02 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/amBUiSFi1OvtAR9zRGcQsmueNf8/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2023/12/13/862/n/1922153/7a7e8bcd657a08fe362148.26510992_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Holiday Beauty",
      "Holiday",
      "Nails",
      "Nail Polish",
      "Nail Art",
      "New Year's Eve"
    ]
  },
  {
    "id": "51437a1d-28ee-43ae-9dee-a096b83d7933",
    "title": "\"Ozempic Face\" Is Real - Here's What That Means",
    "link": "https://www.popsugar.com/beauty/ozempic-face-49125408",
    "description": "If you've been on the internet at all over the last few months, you've more than likely heard of the drug Ozempic. The brand name of the semaglutide medication is intended to be used by people with type two diabetes in order to improve their blood sugar levels and address appetite. In addition to its use for a host of other health concerns, Ozempic is reportedly being used off-label to help people lose weight in a short amount of time. Many have hinted at its popularity among celebrities over the last year, so much so that it's become somewhat of an open secret, with people like Oprah Winfrey and Sharon Osbourne weighing in. The former mentioned that she considered it during her \"Oprah Daily's 'The Life You Want Class: The State of Weight'\" panel, People Magazine reports. \"Even when I first started hearing about the weight loss drugs, at the same time I was going through knee surgery, and I felt, 'I've got to do this on my own,'\" Winfrey said at the event. \"'Because if I take the drug, that's the easy way out.'\" Osbourne recently commented on how she didn't necessarily want to lose as much weight as she did in the process of using the injections. \"You can't stay on it forever,\" the star said on \"Piers Morgan Uncensored.\" \"I lost 42 pounds now and it's just enough.\" Ethics of the practice aside, some people who have used the drug for weight loss are noticing a few additional side effects (like Ozempic butt) once they stop taking it, namely: \"Ozempic face,\" the gaunt facial appearance some may experience post-injection. If you want to learn more about ozempic face, keep reading. Experts Featured in This Article Michelle Henry, MD, FAAD, is a board-certified dermatologist based in NYC. What Is Ozempic Face? If you look up \"Ozempic face photos,\" you'll find some key traits. Think: hollowed cheekbones, sagging skin, and overall signs of aging. \"'Ozempic face' refers to a loss of facial fat or subcutaneous adipose tissue, which can result in changes in the appearance of the face,\" dermatologist Michelle Henry, MD, FAAD, tells PS. \"This can cause a sunken appearance.\" The meteoric rise in conversations surrounding Ozempic has subsequently resulted in accusations of Ozempic face flying at celebrities left and right. If you're curious about the latest discourse on the possible side effects of the drug, Dr. Henry explains why Ozempic face occurs as well as how it can be addressed here. Why Does Ozempic Face Happen? The answer as to why this sudden sagging happens is still unclear. \"The drug works by mimicking the activity of a hormone called glucagon-like peptide-1 or GLP-1, which regulates blood sugar levels and appetite,\" Dr. Henry says. \"It is thought that prolonged stimulation of GLP-1 receptors in the body may interfere with the storage and metabolism of fat in certain areas of the body including the face.\" In other words, if the body is being forced to regulate blood sugar levels and appetite, it may not be able to get back to homeostasis normally, causing fat to be stored (or in some cases lost) improperly. However, Dr. Henry does note that the rapid loss of weight most likely causes Ozempic face once users stop taking the medication. How to Treat Ozempic Face On the plus side, there are ways to reverse Ozempic face (and that is if the phenomenon even occurs in the first place). \"Some people may experience partial or complete reversal of the condition if they stop taking the medication,\" Dr. Henry says. \"Other treatments that may help improve the appearance of the face include dermal fillers, a fat transfer, or surgical interventions such as facelifts or facial implants.\" There is a chance that you may not even get Ozempic face at all. But if you do, these solutions tend to be primarily cosmetic, so do note that they most likely will not be covered by insurance and can cost upward of thousands of dollars. Additionally, as with any other procedure, you will want to go to a board-certified doctor who can host a consultation to address your concerns and align with your expectations properly. Ozempic Face Before and After View this post on Instagram A post shared by Jennifer Wilson MSN, FNP-C (@nursepractitionerjen) While your health choices are your own, it is imperative to understand Ozempic should be used under very specific circumstances and should in no way be used as a quick way to lose weight. \"Ozempic is an FDA-approved medication for the treatment of type 2 diabetes and for weight loss in people with a body mass index (BMI) of 27 or greater who also have at least one weight-related health condition,\" Dr. Henry says. \"While it can be an effective tool for weight loss, it is not a magic bullet and should be used as part of a comprehensive weight loss plan that includes a healthy diet and regular exercise.\" The shortage of Ozempic is indicative that its misuse is causing is another issue entirely, but if you're on the drug or are considering it and are concerned about Ozempic face, prevention is always better than a cure. So instead of worrying about the types of procedures you'd need to fix this issue but are struggling to lose weight, speak to a trusted health professional who can provide you with healthy and sustainable options for long-term (and safe) results. Ariel Baker is the former associate editor of PS Beauty. Her areas of expertise include celebrity news, beauty trends, and product reviews. She has additional bylines with Essence and Forbes Vetted.",
    "author": "Ariel Baker",
    "published": "Thu, 26 Dec 2024 08:20:01 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/xLDWjSNnyzpxRIWftdN4xPG5VzE/912x1:4702x3791/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2023/05/24/937/n/1922153/e38a04d7646e81ada14bf2.27338641_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Beauty Trends",
      "Weight Loss",
      "Medicine",
      "Beauty Explainer"
    ]
  }
]
