{
  "id": "001ccf86-910a-4c54-9a08-bfbcbbecb9bd",
  "title": "Halo Infinite head of design's NetEase studio \"halting work\" on first game as it searches for new publisher",
  "link": "https://www.eurogamer.net/halo-infinite-head-of-designs-netease-studio-halting-work-on-first-game-as-it-searches-for-new-publisher",
  "description": "Jar of Sparks, the Seattle-based \"AAA\" studio established by Halo Infinite head of design Jerry Hook back in 2022, has halted work its currently unannounced first title as it searches for a new publishing partner, and that's it's looking to \"find all of our team new homes\" as a result. Read more",
  "author": "Matt Wales",
  "published": "Wed, 08 Jan 2025 00:21:45 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Halo: Infinite",
    "PC",
    "Multiplayer Competitive",
    "343 Industries",
    "Shooter",
    "Xbox Series X/S",
    "Single Player",
    "Third person",
    "First person",
    "Action Adventure",
    "Multiplayer Cooperative",
    "PS5",
    "PS4",
    "Xbox Game Studios",
    "Xbox One"
  ],
  "byline": "Matt Wales",
  "length": 2285,
  "excerpt": "Jar of Sparks, the Seattle-based \"AAA\" studio established by Halo Infinite head of design Jerry Hook back in 2022, has …",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/79a3c6a608b8d531aa9aa7eb1db4ec8d/icon/apple-touch-icon-152x152.png",
  "text": "\"We will be working over the next few weeks to find all of our team new homes.\" Jar of Sparks, the Seattle-based \"AAA\" studio established by Halo Infinite head of design Jerry Hook back in 2022, has halted work its currently unannounced first title as it searches for a new publishing partner, and that's it's looking to \"find all of our team new homes\" as a result. When Jar of Sparks was initially unveiled in July 2022, it was described as a first-party developer for Chinese publisher NetEase that would focus on creating the \"next generation of narrative-driven action games\". Little has been heard from the studio since then, but Hook - who announced his departure from 343 Industries and Microsoft back in May 2002 - has now shared a statement on LinkedIn, suggesting Jar of Sparks' future is uncertain. \"Earlier today,\" Hook wrote, \"we notified our team that Jar of Sparks will be halting work on our current title as we search for a new publishing partner who can help bring our creative vision to life. Throughout this journey, our passionate, driven, and innovative team took bold risks and pushed boundaries, striving to create something truly new and exciting for the industry. We couldn’t be prouder of the groundwork we’ve laid together.\" \"As we prepare for this next step,\" Hook continued, \"our talented team members will be exploring new opportunities... From the day we formed Jar of Sparks to this very moment, this team has accomplished remarkable feats—proving that a small, focused, and dedicated group can achieve great results. We thank each of them for their courage, skill, and friendship.\" Jar of Sparks' announcement doesn't mention layoffs explicitly, but a separate post from Hook says the studio \"will be working over the next few weeks to find all of our team new homes as we close our first project\", suggesting the majority of staff will be departing following today's news. Eurogamer has reached out to Jar of Sparks for clarification, and to NetEase regarding its current relationship with the studio. \"Thank you to everyone who supported us throughout our journey here at Jar of Sparks,\" the statement concludes. \"We look forward to updating you all with our next step in our journey.\"",
  "image": "https://assetsio.gnwcdn.com/jerry-hook.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv\u003e\n        \n\n        \u003cp\u003e\u0026#34;We will be working over the next few weeks to find all of our team new homes.\u0026#34;\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/jerry-hook.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/jerry-hook.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/jerry-hook.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/jerry-hook.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nJar of Sparks, the Seattle-based \u0026#34;AAA\u0026#34; studio established by \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/halo-infinite\"\u003eHalo Infinite\u003c/a\u003e head of design Jerry Hook back in 2022, has halted work its currently unannounced first title as it searches for a new publishing partner, and that\u0026#39;s it\u0026#39;s looking to \u0026#34;find all of our team new homes\u0026#34; as a result.\n\u003c/p\u003e\n\u003cp\u003e\nWhen Jar of Sparks was \u003ca href=\"https://www.eurogamer.net/halo-infinite-head-of-design-jerry-hook-leading-new-netease-studio-jar-of-sparks\"\u003einitially unveiled\u003c/a\u003e in July 2022, it was described as a first-party developer for Chinese publisher NetEase that would focus on creating the \u0026#34;next generation of narrative-driven action games\u0026#34;. Little has been heard from the studio since then, but Hook - who \u003ca href=\"https://www.eurogamer.net/halo-infinites-head-of-design-jerry-hook-leaves-343-industries\"\u003eannounced his departure\u003c/a\u003e from \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/companies/343-industries\"\u003e343 Industries\u003c/a\u003e and Microsoft back in May 2002 - has now \u003ca href=\"https://www.linkedin.com/company/jar-of-sparks/posts/\"\u003eshared a statement on LinkedIn\u003c/a\u003e, suggesting Jar of Sparks\u0026#39; future is uncertain.\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;Earlier today,\u0026#34; Hook wrote, \u0026#34;we notified our team that Jar of Sparks will be halting work on our current title as we search for a new publishing partner who can help bring our creative vision to life. Throughout this journey, our passionate, driven, and innovative team took bold risks and pushed boundaries, striving to create something truly new and exciting for the industry. We couldn’t be prouder of the groundwork we’ve laid together.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;As we prepare for this next step,\u0026#34; Hook continued, \u0026#34;our talented team members will be exploring new opportunities... From the day we formed Jar of Sparks to this very moment, this team has accomplished remarkable feats—proving that a small, focused, and dedicated group can achieve great results. We thank each of them for their courage, skill, and friendship.\u0026#34;\n\u003c/p\u003e\u003cp\u003e\nJar of Sparks\u0026#39; announcement doesn\u0026#39;t mention layoffs explicitly, but a \u003ca href=\"https://www.linkedin.com/posts/jerry-hook-1807781_earlier-today-we-notified-our-team-that-activity-7282186867880407040-fNNK\"\u003eseparate post from Hook\u003c/a\u003e says the studio \u0026#34;will be working over the next few weeks to find all of our team new homes as we close our first project\u0026#34;, suggesting the majority of staff will be departing following today\u0026#39;s news. Eurogamer has reached out to Jar of Sparks for clarification, and to NetEase regarding its current relationship with the studio.\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;Thank you to everyone who supported us throughout our journey here at Jar of Sparks,\u0026#34; the statement concludes. \u0026#34;We look forward to updating you all with our next step in our journey.\u0026#34;\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-08T00:21:45.346166Z",
  "modifiedTime": null
}
