{
  "id": "0a94911f-5571-43d8-b805-30c372cfaccb",
  "title": "Makeup and Beauty Blog Monday Poll, Vol. 885",
  "link": "https://makeupandbeautyblog.com/just-for-fun/makeup-and-beauty-blog-monday-poll-vol-885/",
  "description": "So…what is the Monday Poll? Excellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years (since 2007). 1. Do you keep backups of your favorite products? These days, the only backups I buy are things I know I’ll finish on a regular basis (like shampoo and conditioner, or body lotion). I don’t even bother with makeup backups anymore, though. If I finish something like a blush or an eyebrow pencil, great, and if it’s still around when it’s time to restock, that’s even better. If it’s discontinued, I might mourn it a little bit, but there’s always something new coming out, and I don’t mind trying new things, so I don’t stress about it too much. 2. Something that you read/watched/listened to recently that was surprisingly great? I watched “KPop Demon Hunters” on Netflix with Connor over the weekend, and I was surprised to enjoy[Continue reading...] The post Makeup and Beauty Blog Monday Poll, Vol. 885 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
  "author": "Karen",
  "published": "Mon, 07 Jul 2025 23:22:18 +0000",
  "source": "https://www.makeupandbeautyblog.com/feed/",
  "categories": [
    "Just For Fun"
  ],
  "byline": "Karen",
  "length": 2027,
  "excerpt": "So...what is the Monday Poll? Excellent question! It isn't, contrary to its name, an actual poll, like with little clicky buttons. It's just a list of",
  "siteName": "Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup",
  "favicon": "https://www.makeupandbeautyblog.com/wp-content/uploads/2013/08/favicon.png",
  "text": "So…what is the Monday Poll? Excellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years (since 2007). 1. Do you keep backups of your favorite products? These days, the only backups I buy are things I know I’ll finish on a regular basis (like shampoo and conditioner, or body lotion). I don’t even bother with makeup backups anymore, though. If I finish something like a blush or an eyebrow pencil, great, and if it’s still around when it’s time to restock, that’s even better. If it’s discontinued, I might mourn it a little bit, but there’s always something new coming out, and I don’t mind trying new things, so I don’t stress about it too much. 2. Something that you read/watched/listened to recently that was surprisingly great? I watched “KPop Demon Hunters” on Netflix with Connor over the weekend, and I was surprised to enjoy it as much as I did. If you liked “Jem and the Holograms” back in the day, I think you’ll enjoy this movie, too. 3. Something beauty-related that you want to try? The new tinted SPF by Merit seems intriguing! 4. Documentaries or TV shows about serial killers: yes or no? Nope! Hard pass. 5. Something that you’re relieved to finally have gotten done? GIRL. I finally did my nails. You don’t even want to know how tragic my pedicure has been for the last three weeks! But now everything is freshly polished and nice, and all is well with the world. Your friendly neighborhood beauty addict, Karen P.S. Here are the questions to copy/paste with your answers in a comment. Talk to ya soon. 1. Do you keep backups of your favorite products? 2. Something that you read/watched/listened to recently that was surprisingly great? 3. Something beauty-related that you want to try? 4. Documentaries or TV shows about serial killers: yes or no? 5. Something that you’re relieved to finally have gotten done? Reader Interactions",
  "image": "https://makeupandbeautyblog.com/wp-content/uploads/2025/07/monday-poll-summer-sun.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"genesis-content\"\u003e\u003carticle aria-label=\"Makeup and Beauty Blog Monday Poll, Vol. 885\"\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://makeupandbeautyblog.com/wp-content/uploads/2025/07/monday-poll-summer-sun.jpg\" alt=\"\" width=\"1000\" height=\"1000\" srcset=\"https://makeupandbeautyblog.com/wp-content/uploads/2025/07/monday-poll-summer-sun.jpg 1000w, https://makeupandbeautyblog.com/wp-content/uploads/2025/07/monday-poll-summer-sun-610x610.jpg 610w, https://makeupandbeautyblog.com/wp-content/uploads/2025/07/monday-poll-summer-sun-150x150.jpg 150w, https://makeupandbeautyblog.com/wp-content/uploads/2025/07/monday-poll-summer-sun-768x768.jpg 768w, https://makeupandbeautyblog.com/wp-content/uploads/2025/07/monday-poll-summer-sun-75x75.jpg 75w, https://makeupandbeautyblog.com/wp-content/uploads/2025/07/monday-poll-summer-sun-600x600.jpg 600w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/p\u003e\n\u003cblockquote\u003e\n\u003ch2\u003eSo…what is the Monday Poll?\u003c/h2\u003e\n\u003cp\u003eExcellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years \u003cstrong\u003e(since 2007)\u003c/strong\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n\u003ch3\u003e1. Do you keep backups of your favorite products?\u003c/h3\u003e\n\u003cp\u003eThese days, the only backups I buy are things I know I’ll finish on a regular basis (like shampoo and conditioner, or body lotion). I don’t even bother with makeup backups anymore, though. If I finish something like a blush or an eyebrow pencil, great, and if it’s still around when it’s time to restock, that’s even better. If it’s discontinued, I might mourn it a little bit, but there’s always something new coming out, and I don’t mind trying new things, so I don’t stress about it too much.\u003c/p\u003e\n\u003ch3\u003e2. Something that you read/watched/listened to recently that was surprisingly great?\u003c/h3\u003e\n\u003cp\u003eI watched “KPop Demon Hunters” on Netflix with Connor over the weekend, and I was surprised to enjoy it as much as I did. If you liked “Jem and the Holograms” back in the day, I think you’ll enjoy this movie, too.\u003c/p\u003e\n\u003ch3\u003e3. Something beauty-related that you want to try? \u003c/h3\u003e\n\u003cp\u003eThe new tinted SPF by Merit seems intriguing! \u003c/p\u003e\n\u003ch3\u003e4. Documentaries or TV shows about serial killers: yes or no?\u003c/h3\u003e\n\u003cp\u003eNope! Hard pass.\u003c/p\u003e\n\u003ch3\u003e5. Something that you’re relieved to finally have gotten done?\u003c/h3\u003e\n\u003cp\u003eGIRL. I finally did my nails. You don’t even want to know how tragic my pedicure has been for the last three weeks! But now everything is freshly polished and nice, and all is well with the world. \u003c/p\u003e\n\u003cp\u003eYour friendly neighborhood beauty addict,\u003c/p\u003e\n\u003cp\u003eKaren\u003c/p\u003e\n\u003cp\u003eP.S. Here are the questions to copy/paste with your answers in a comment. Talk to ya soon.\u003c/p\u003e\n\u003cp\u003e1. Do you keep backups of your favorite products?\u003cbr/\u003e\n2. Something that you read/watched/listened to recently that was surprisingly great?\u003cbr/\u003e\n3. Something beauty-related that you want to try?\u003cbr/\u003e\n4. Documentaries or TV shows about serial killers: yes or no?\u003cbr/\u003e\n5. Something that you’re relieved to finally have gotten done?\u003c/p\u003e\n\u003c/div\u003e\u003c/article\u003e\u003ch2\u003eReader Interactions\u003c/h2\u003e\t\n\t\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-07T23:22:18Z",
  "modifiedTime": null
}
