{
  "id": "0b0692c0-40ac-465f-b83a-71e5f0b5d436",
  "title": "Minecraft is getting two theme parks, with the first due in 2026",
  "link": "https://www.rockpapershotgun.com/minecraft-is-getting-two-theme-parks-with-the-first-due-in-2026",
  "description": "Two theme parks are being planned based on Minecraft. Mojang are partnering with Merlin Entertainments to open the destinations, including rides, hotel rooms and shops, in the UK and US in 2026 and 2027. Merlin are the operator of existing theme parks and attractions including Alton Towers, Legoland, Sea Life, and Madame Tussauds. Read more",
  "author": "Graham Smith",
  "published": "Wed, 20 Nov 2024 21:52:44 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Simulation",
    "First person",
    "Third person",
    "PS4",
    "Microsoft Studios",
    "Minecraft",
    "Multiplayer Competitive",
    "Multiplayer Cooperative",
    "PS5",
    "PC",
    "Android",
    "Virtual Reality",
    "Nintendo Switch",
    "Xbox Series X/S",
    "Xbox One",
    "MMORPG",
    "Single Player",
    "Mojang",
    "iOS",
    "Action Adventure"
  ],
  "byline": "Graham Smith",
  "length": 1498,
  "excerpt": "Minecraft have partnered with the second biggest theme park operator in the world to open two parks in the UK and US.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/e719164d2bebfbc0eefa32a99aab709c/icon/apple-touch-icon.png",
  "text": "Coming to the UK and US as a start Image credit: Merlin Entertainments / Mojang Two theme parks are being planned based on Minecraft. Mojang are partnering with Merlin Entertainments to open the destinations, including rides, hotel rooms and shops, in the UK and US in 2026 and 2027. Merlin are the operator of existing theme parks and attractions including Alton Towers, Legoland, Sea Life, and Madame Tussauds. The Minecraft parks will be opened as part of an existing theme park or as new city centre attractions, according to The Guardian. Mojang and Merlin also have plans to expand to other countries and territories. These attractions won't be the first time Mincraft has crossed in the real world. Earlier this year, Mojang partnered with Supply + Demand to launch Minecraft Experience: Villager Rescue, an \"immersive, interactive Minecraft quest\" in Plano, Texas. The partnership with Merlin seems an order of magnitude more ambitious, however. Minecraft is shaping up to have a busy few years, with a live action movie on the way and a Netflix animated series. It could also be a big few years for UK theme parks, with Universal planning a potential park as well. The biggest news for Minecraft is obviously that we just named it the best PC game ever. Yes, I will be taking my son to the Minecraft theme park, even if it just turns out to be a shed full of cardboard boxes. I can't resist.",
  "image": "https://assetsio.gnwcdn.com/minecraft-theme-park.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \n\n    \u003cdiv\u003e\n  \n\n        \u003cp\u003eComing to the UK and US as a start\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/minecraft-theme-park.jpg?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/minecraft-theme-park.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/minecraft-theme-park.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/minecraft-theme-park.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A mockup of what a Minecraft theme park entrance might look like.\" width=\"382\" height=\"229\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eMerlin Entertainments / Mojang\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv\u003e\n\n\n\n            \u003cp\u003eTwo theme parks are being planned based on \u003ca href=\"https://www.rockpapershotgun.com/best-minecraft-seeds-java-survival-seeds\"\u003eMinecraft\u003c/a\u003e. Mojang are partnering with Merlin Entertainments to open the destinations, including rides, hotel rooms and shops, in the UK and US in 2026 and 2027. Merlin are the operator of existing theme parks and attractions including Alton Towers, Legoland, Sea Life, and Madame Tussauds.\n\u003c/p\u003e\n\n\u003cp\u003eThe Minecraft parks will be opened as part of an existing theme park or as new city centre attractions, \u003ca href=\"https://www.theguardian.com/business/2024/nov/19/minecraft-theme-park-deal-uk-us-merlin-entertainments\"\u003eaccording to The Guardian\u003c/a\u003e. Mojang and Merlin also have plans to expand to other countries and territories.\n\u003c/p\u003e\n\u003cp\u003eThese attractions won\u0026#39;t be the first time Mincraft has crossed in the real world. Earlier this year, Mojang partnered with Supply + Demand to launch \u003ca href=\"https://www.minecraftexperience.com/\"\u003eMinecraft Experience: Villager Rescue\u003c/a\u003e, an \u0026#34;immersive, interactive Minecraft quest\u0026#34; in Plano, Texas. The partnership with Merlin seems an order of magnitude more ambitious, however.\n\u003c/p\u003e\n\u003cp\u003eMinecraft is shaping up to have a busy few years, with \u003ca href=\"https://www.rockpapershotgun.com/the-first-minecraft-movie-trailer-looks-expensively-naff\"\u003ea live action movie on the way\u003c/a\u003e and \u003ca href=\"https://www.eurogamer.net/minecraft-animated-series-announced-for-netflix\"\u003ea Netflix animated series. It could also be a big few years for UK theme parks, with \u003c/a\u003e\u003ca href=\"https://universalukproject.co.uk/\"\u003eUniversal planning a potential park as well\u003c/a\u003e.\n\u003c/p\u003e\u003cp\u003eThe biggest news for Minecraft is obviously that we just named it \u003ca href=\"https://www.rockpapershotgun.com/the-rps-100-2024\"\u003ethe best PC game ever\u003c/a\u003e. Yes, I will be taking my son to the Minecraft theme park, even if it just turns out to be a shed full of cardboard boxes. I can\u0026#39;t resist.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-20T21:52:44.597243Z",
  "modifiedTime": null
}
