{
  "id": "0b0f5abd-9f37-4d97-b8f3-819f1130580e",
  "title": "How Marvel Rivals does right by its Asian characters",
  "link": "https://www.polygon.com/analysis/521934/marvel-rivals-asian-characters-hero-shooters-luna-snow-iron-fist-posylocke-shang-chi",
  "description": "Marvel Rivals took the game industry by storm when it was released in December 2024, proving that the hero shooter space still has plenty to offer after games like Overwatch, Valorant, and Apex Legends dominated the genre. The Marvel universe is composed of many different origins and cultures, and it’s impressive to see Marvel Rivals reflect […]",
  "author": "George Yang",
  "published": "2025-02-16T11:00:00-05:00",
  "source": "https://www.polygon.com/rss/index.xml",
  "categories": [
    "Analysis",
    "Culture",
    "Gaming",
    "Marvel"
  ],
  "byline": "George Yang",
  "length": 9283,
  "excerpt": "Marvel Comics’ rich history has a lot to offer",
  "siteName": "Polygon",
  "favicon": "https://www.polygon.com/static-assets/icons/android-chrome-512x512.png",
  "text": "Marvel Rivals took the game industry by storm when it was released in December 2024, proving that the hero shooter space still has plenty to offer after games like Overwatch, Valorant, and Apex Legends dominated the genre. The Marvel universe is composed of many different origins and cultures, and it’s impressive to see Marvel Rivals reflect that with such a diverse playable character roster. Marvel writers take real-life cultures and implements elements of their legends and stories to create new characters that can represent them. It’s a way for everyone around the world to be seen. The game’s representation is not just skin deep, though — its inclusion of Asian characters like Iron Fist, Peni Parker, Psylocke, and Luna Snow reflects that.Iron Fist is particularly notable because of his character’s somewhat controversial background, which Marvel Rivals’ interpretation of the character rectifies, whether intentionally or not. In the last few years alone, Marvel stories have embraced Asian characters — Luna Snow tapped into the growing K-pop industry while Psylocke and Peni Parker took notable roles in other Marvel media.Polygon spoke with NetEase creative director Guangyun Chen via email to discuss Marvel Rivals’ Asian characters, their backstories, and what kind of representation we might see in the game in the future.A new origin for Iron FistImage: NetEase Games, Marvel GamesWhen it came to deciding which characters to add to Marvel Rivals’ roster, Chen said, the obvious ones came to mind — Iron Man, Hulk, Thor. The team at NetEase, however, also wanted to add in some lesser-known yet interesting characters. Marvel Rivals was a chance to create new interpretations of older characters, and one of the most interesting ones is the game’s version of Iron Fist. The hero is usually known as Danny Rand, a white kung fu enthusiast born into a wealthy New York City family. In 2022’s Iron Fist vol 6 #1 comic, a young Chinese man named Lin Lie became the new Iron Fist — this is the version that joins Marvel Rivals.This interesting choice led to an interesting revelation: it avoids the conversation of cultural appropriation around Iron Fist. Back in 2015, Disney and Marvel announced that they would be creating a live-action Iron Fist adaptation. Subsequently, the Asian American community called for a change in making the hero Asian instead of white. Ultimately, Danny Rand was played by English actor Finn Jones. While Chen and NetEase declined to comment on whether this controversy was a factor in bringing on Lin Lie instead of Danny Rand, Chen said, “When we’re designing character backgrounds, we always keep the latest comic storylines in mind to make sure everything feels fresh and in tune with the current Marvel universe.” Marvel introduced Lin Lie 2018 as Sword Master in a partnership with NetEase to attract more readers in East Asia. This sequence of events ended up being convenient for Marvel Rivals’ Iron Fist. It’s a fresh take on the hero and one that actually makes sense within the lore rather than simple racebending, and circumvents controversy regarding its origins. Other heroes have been racebent before. One example is The Human Torch from 2015’s Fantastic Four, played by actor Michael B. Jordan. In that case, The Human Torch is traditionally white, but the hero’s origins didn’t necessarily demand that he’d be. So having a Black actor play the character was a much different interpretation. After all, having fire powers isn’t inherently linked to being a specific race.When it comes to Iron Fist, however, his kung fu abilities directly tie back to Asian culture, so it would make sense for the hero to be of a similar race. That’s not to say other races and cultures can’t practice kung fu or martial arts, but considering how a majority of prominent heroes are white, having an Asian Iron Fist is a great step towards representation.Where K-pop comes inImage: NetEase GamesLin Lie’s Iron Fist isn’t the only Marvel character born out of a collaboration with Asian studios. In 2018, mobile game developer NetMarble introduced Luna Snow in Marvel Future Fight. Luna Snow is a South Korean K-pop idol with ice-based powers, and she is now a playable character in Marvel Rivals.With the growing popularity of K-pop, it was only a matter of time until video game developers took notice. Boy group BTS collaborated with games like Among Us and Maple Story, while one of its members, Jung Kook, promoted Xbox Game Pass. Girl group LE SSERAFIM wrote a song called “Perfect Night” for Overwatch 2, and the global juggernaut NewJeans worked on “Gods” for League of Legends. With Luna Snow in Marvel Rivals, it’s possible the game will have some sort of big K-pop collaboration — though when pressed for a comment, Chen simply said to stay tuned.Much like how Lin Lie was added to the Marvel universe to appeal to more Chinese readers, Luna Snow’s inclusion undoubtedly brought in more Korean readers. There’s been a recent wave of reactionary sentiment among DEI initiatives, especially in gaming, but in my eyes, expanding your audience by creating diverse characters helps create a much richer and interesting universe. Having different interpretations of characters and bringing in lesser-known ones is what helped Marvel Rivals stand out among its peers, which even include other Marvel games like 2020’s Marvel’s Avengers and 2022’s Marvel’s Midnight Suns.Two other playable Asian characters in Marvel Rivals, Psylocke and Peni Parker, saw a resurgence in other Marvel projects. Psylocke appeared in the 2003 film X-Men: the Last Stand and 2016’s X-Men: Apocalypse. She’s a mutant assassin with psychic abilities, but her portrayal in these live-action adaptations dampened her butterfly motif, which is a visible manifestation of her powers, most notably seen in the Wolverine and the X-Men Animated series. However, her Marvel Rivals character brings that back — and it’s in a much more Japanese-inspired design thanks to its more cartoonish art direction.“Peach Momoko’s hit comic ‘Demon Days’ has really taken off, and the character of the Spirit Butterfly is just unforgettable,” Chen explained. “We absolutely love her! We think that her unique origin story gives her a great fit for Marvel Rivals.”Peni Parker is most known from the incredible Spider-Verse movies, and her Marvel Rivals version has garnered plenty of comparisons to D.Va from Overwatch. It’s not hard to see why; they’re both Asian and both pilot a giant robot around the battlefield. Like Luna Snow in Marvel Rivals, Overwatch’s D.Va is the game’s Korean representation. She’s a professional gamer, and esports is enormously popular in South Korea, known as the “capital of esports.”Looking forwardWhile Marvel Rivals has a stacked roster filled with diverse characters, there are some obvious Asian heroes missing. Shang-Chi and Silk immediately come to mind. Shang-Chi has a live-action adaptation in the dominating Marvel Cinematic Universe, while Silk is a popular Spider-Man character. She was briefly introduced in the ending of Insomniac’s Marvel’s Spider-Man 2. Although it’s unclear how they would be differentiated from Iron Fist and Spider-Man, respectively — Shang-Chi’s powers are based on martial arts, like Iron Fists, and Silk’s powers came from the radioactive spider, like Spider-Man’s.Even with its diverse roster of heroes, Marvel Rivals has room to improve on its representation. For starters, its Asian characters consist of East Asians, with South and Southeast Asian characters being woefully underrepresented, which is unfortunately very common. That’s easily fixable, however. The popular Kamala Khan, aka Ms. Marvel, is Pakistani-American and seems to be a no-brainer for Marvel Rivals. Not only was she the star protagonist of Marvel’s Avengers’ story campaign, but she’s also in the Marvel Cinematic Universe.Jubilee from X-Men should be considered, too. While she’s the daughter of Chinese immigrants, Vietnamese-American actress Lana Condor played her in X-Men: Apocalypse. It’d be a minor difference, but interpreting Jubilee as Vietnamese in Marvel Rivals would go a long way considering the dearth of Vietnamese heroes in general.Let’s not stop at heroes either! Villains are important as well. The Chinese Martin Li, aka Mister Negative, was a major antagonist in Insomniac’s Marvel’s Spider-Man universe. While Asians have been portrayed as stereotypical villains, particularly in Western media, Mister Negative has depth to his character. He’s a clever representation of the Asian theme of yin and yang as he’s both an owner of a homeless shelter as well as a ruthless crime lord in Insomniac’s games. He shows that Asian characters can not only embody heroic qualities, but also flawed ones, to make them fully realized beings.Despite my hopes for more additions, Marvel Rivals has a bright future ahead, both in terms of being a long-lasting fun game and as a beacon of representation. Its initial roster is miles better than many other games when it comes to diversity, and that’s due to Marvel’s rich history. But what’s even more impressive is that its characters come from all sorts of real-world cultures and inspirations, and as a result, Marvel Rival stands heads and shoulders above its competition.",
  "image": "https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/luna-snow-marvel-rivals-mvp-intro-mirae-2099.jpg?quality=90\u0026strip=all\u0026crop=0%2C3.4613147178592%2C100%2C93.077370564282\u0026w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"zephr-anchor\"\u003e\u003cp\u003e\u003ca href=\"https://www.polygon.com/impressions/493325/marvel-rivals-chaotic-overwatch\"\u003e\u003cem\u003eMarvel Rivals\u003c/em\u003e took the game industry by storm\u003c/a\u003e when it was released in December 2024, proving that the hero shooter space still has plenty to offer after games like Overwatch, Valorant, and Apex Legends dominated the genre. The Marvel universe is composed of many different origins and cultures, and it’s impressive to see \u003cem\u003eMarvel Rivals\u003c/em\u003e reflect that with such a diverse playable character roster. Marvel writers take real-life cultures and implements elements of their legends and stories to create new characters that can represent them. It’s a way for everyone around the world to be seen. The game’s representation is not just skin deep, though — its inclusion of Asian characters like Iron Fist, Peni Parker, Psylocke, and Luna Snow reflects that.\u003c/p\u003e\u003cp\u003eIron Fist is particularly notable because of his character’s somewhat controversial background, which \u003cem\u003eMarvel Rivals\u003c/em\u003e’ interpretation of the character rectifies, whether intentionally or not. In the last few years alone, Marvel stories have embraced Asian characters — Luna Snow tapped into the growing K-pop industry while Psylocke and Peni Parker took notable roles in other Marvel media.\u003c/p\u003e\u003cp\u003ePolygon spoke with NetEase creative director Guangyun Chen via email to discuss \u003cem\u003eMarvel Rivals\u003c/em\u003e’ Asian characters, their backstories, and what kind of representation we might see in the game in the future.\u003c/p\u003e\u003cdiv\u003e\u003cp id=\"a-new-origin-for-iron-fist\"\u003e\u003ch2\u003eA new origin for Iron Fist\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0,0,100,100\" data-pswp-height=\"1080\" data-pswp-width=\"1920\" target=\"_blank\" rel=\"noreferrer\"\u003e\u003cimg alt=\"Marvel Rivals’ Iron Fist stands with his arms crossed\" data-chromatic=\"ignore\" loading=\"lazy\" decoding=\"async\" data-nimg=\"fill\" sizes=\"(max-width: 639px) 100vw, (max-width: 1023px) 50vw, 700px\" srcset=\"https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=256 256w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=376 376w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=384 384w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=415 415w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=480 480w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=540 540w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=640 640w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=750 750w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=828 828w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1080 1080w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1200 1200w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1440 1440w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1920 1920w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=2048 2048w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=2400 2400w\" src=\"https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/iron-fist.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=2400\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ccite\u003eImage: NetEase Games, Marvel Games\u003c/cite\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eWhen it came to deciding which characters to add to Marvel Rivals’ roster, Chen said, the obvious ones came to mind — Iron Man, Hulk, Thor. The team at NetEase, however, also wanted to add in some lesser-known yet interesting characters. \u003c/p\u003e\u003cp\u003e\u003cem\u003eMarvel Rivals\u003c/em\u003e was a chance to create new interpretations of older characters, and one of the most interesting ones is the game’s version of Iron Fist. The hero is usually known as Danny Rand, a white kung fu enthusiast born into a wealthy New York City family. In 2022’s \u003cem\u003eIron Fist vol 6 #1\u003c/em\u003e comic, a young Chinese man named Lin Lie became the new Iron Fist — this is the version that joins Marvel Rivals.\u003c/p\u003e\u003cp\u003eThis interesting choice led to an interesting revelation: it avoids the conversation of cultural appropriation around Iron Fist. Back in 2015, Disney and Marvel announced that they would be creating a \u003ca href=\"https://www.polygon.com/tv/2017/3/8/14712744/iron-fist-review\"\u003elive-action Iron Fist adaptation\u003c/a\u003e. Subsequently, the Asian American community called for a change in making the hero Asian instead of white. Ultimately, Danny Rand was played by English actor Finn Jones. \u003c/p\u003e\u003cp\u003eWhile Chen and NetEase declined to comment on whether this controversy was a factor in bringing on Lin Lie instead of Danny Rand, Chen said, “When we’re designing character backgrounds, we always keep the latest comic storylines in mind to make sure everything feels fresh and in tune with the current Marvel universe.” Marvel introduced Lin Lie 2018 as Sword Master in a partnership with \u003ca href=\"https://www.scmp.com/news/china/society/article/2145602/chinese-superheroes-sword-master-and-aero-join-fight-against-evil\"\u003eNetEase to attract more readers in East Asia\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eThis sequence of events ended up being convenient for \u003cem\u003eMarvel Rivals\u003c/em\u003e’ Iron Fist. It’s a fresh take on the hero and one that actually makes sense within the lore rather than simple \u003ca href=\"https://www.polygon.com/24079373/avatar-last-airbender-live-action-racebending\"\u003eracebending\u003c/a\u003e, and circumvents controversy regarding its origins. Other heroes have been racebent before. One example is The Human Torch from 2015’s \u003cem\u003eFantastic Four\u003c/em\u003e, played by actor Michael B. Jordan. In that case, The Human Torch is traditionally white, but the hero’s origins didn’t necessarily demand that he’d be. So having a Black actor play the character was a much different interpretation. After all, having fire powers isn’t inherently linked to being a specific race.\u003c/p\u003e\u003cp\u003eWhen it comes to Iron Fist, however, his kung fu abilities directly tie back to Asian culture, so it would make sense for the hero to be of a similar race. That’s not to say other races and cultures can’t practice kung fu or martial arts, but considering how a majority of prominent heroes are white, having an Asian Iron Fist is a great step towards representation.\u003c/p\u003e\u003cdiv\u003e\u003cp id=\"where-k-pop-comes-in\"\u003e\u003ch2\u003eWhere K-pop comes in\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0,0,100,100\" data-pswp-height=\"1080\" data-pswp-width=\"1920\" target=\"_blank\" rel=\"noreferrer\"\u003e\u003cimg alt=\"Marvel Rivals hero Luna Snow with purple and pink hair and headphones on a blue background\" data-chromatic=\"ignore\" loading=\"lazy\" decoding=\"async\" data-nimg=\"fill\" sizes=\"(max-width: 639px) 100vw, (max-width: 1023px) 50vw, 700px\" srcset=\"https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=256 256w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=376 376w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=384 384w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=415 415w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=480 480w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=540 540w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=640 640w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=750 750w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=828 828w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1080 1080w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1200 1200w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1440 1440w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=1920 1920w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=2048 2048w, https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=2400 2400w\" src=\"https://platform.polygon.com/wp-content/uploads/sites/2/2025/02/marvel-rivals-mirae-2099-luna-snow-skin.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=2400\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ccite\u003eImage: NetEase Games\u003c/cite\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eLin Lie’s Iron Fist isn’t the only Marvel character born out of a collaboration with Asian studios. In 2018, mobile game developer NetMarble introduced Luna Snow in \u003cem\u003eMarvel Future Fight\u003c/em\u003e. Luna Snow is a South Korean K-pop idol with ice-based powers, and she is now a playable character in \u003cem\u003eMarvel Rivals\u003c/em\u003e.\u003c/p\u003e\u003cp\u003eWith the growing popularity of K-pop, it was only a matter of time until video game developers took notice. Boy group BTS collaborated with games like \u003cem\u003eAmong Us\u003c/em\u003e and \u003cem\u003eMaple Story\u003c/em\u003e, while one of its members, Jung Kook, \u003ca href=\"https://x.com/Xbox/status/1721580812980601338\"\u003epromoted Xbox Game Pass\u003c/a\u003e. Girl group LE SSERAFIM wrote a song called “Perfect Night” for \u003cem\u003eOverwatch 2\u003c/em\u003e, and the global juggernaut NewJeans worked on “Gods” for \u003cem\u003eLeague of Legends\u003c/em\u003e. With Luna Snow in \u003cem\u003eMarvel Rivals\u003c/em\u003e, it’s possible the game will have some sort of big K-pop collaboration — though when pressed for a comment, Chen simply said to stay tuned.\u003c/p\u003e\u003cp\u003eMuch like how Lin Lie was added to the Marvel universe to appeal to more Chinese readers, Luna Snow’s inclusion undoubtedly brought in more Korean readers. There’s been a recent wave of reactionary sentiment among DEI initiatives, \u003ca href=\"https://www.pcgamer.com/gaming-industry/lords-of-the-fallen-studio-embraces-the-dei-bugbear-says-it-will-not-include-any-social-or-political-agendas-in-its-games/\"\u003eespecially in gaming\u003c/a\u003e, but in my eyes, expanding your audience by creating diverse characters helps create a much richer and interesting universe. Having different interpretations of characters and bringing in lesser-known ones is what helped \u003cem\u003eMarvel Rivals\u003c/em\u003e stand out among its peers, which even include other Marvel games like 2020’s \u003cem\u003eMarvel’s Avengers\u003c/em\u003e and 2022’s \u003cem\u003eMarvel’s Midnight Suns\u003c/em\u003e.\u003c/p\u003e\u003cp\u003eTwo other playable Asian characters in Marvel Rivals, Psylocke and Peni Parker, saw a resurgence in other Marvel projects. Psylocke appeared in the 2003 film \u003cem\u003eX-Men: the Last Stand\u003c/em\u003e and 2016’s \u003cem\u003eX-Men: Apocalypse\u003c/em\u003e. She’s a mutant assassin with psychic abilities, but her portrayal in these live-action adaptations dampened her butterfly motif, which is a visible manifestation of her powers, most notably seen in the \u003ca href=\"https://marvelanimated.fandom.com/wiki/Psylocke_(Yost_Universe)\"\u003e\u003cem\u003eWolverine and the X-Men\u003c/em\u003e Animated series\u003c/a\u003e. However, her \u003cem\u003eMarvel Rivals\u003c/em\u003e character brings that back — and it’s in a much more \u003ca href=\"https://x.com/peachmomoko60/status/1838482890784674245\"\u003eJapanese-inspired design\u003c/a\u003e thanks to its more cartoonish art direction.\u003c/p\u003e\u003cp\u003e“Peach Momoko’s hit comic ‘Demon Days’ has really taken off, and the character of the Spirit Butterfly is just unforgettable,” Chen explained. “We absolutely love her! We think that her unique origin story gives her a great fit for \u003cem\u003eMarvel Rivals\u003c/em\u003e.”\u003c/p\u003e\u003cp\u003ePeni Parker is most known from the incredible Spider-Verse movies, and her \u003cem\u003eMarvel Rivals\u003c/em\u003e version has garnered plenty of comparisons to D.Va from Overwatch. It’s not hard to see why; they’re both Asian and both pilot a giant robot around the battlefield. Like Luna Snow in \u003cem\u003eMarvel Rivals\u003c/em\u003e, \u003cem\u003eOverwatch\u003c/em\u003e’s D.Va is the game’s Korean representation. She’s a professional gamer, and esports is \u003ca href=\"https://kotaku.com/league-legends-riot-games-worlds-23-interview-1851071665\"\u003eenormously popular in South Korea\u003c/a\u003e, known as the “capital of esports.”\u003c/p\u003e\u003cdiv\u003e\u003cp id=\"looking-forward\"\u003e\u003ch2\u003eLooking forward\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eWhile \u003cem\u003eMarvel Rivals\u003c/em\u003e has a stacked roster filled with diverse characters, there are some obvious Asian heroes missing. Shang-Chi and Silk immediately come to mind. \u003ca href=\"https://www.polygon.com/reviews/22633102/shang-chi-review\"\u003eShang-Chi has a live-action adaptation\u003c/a\u003e in the dominating Marvel Cinematic Universe, while Silk is a popular Spider-Man character. She was briefly introduced in the ending of Insomniac’s \u003cem\u003e\u003ca href=\"https://www.polygon.com/reviews/23910756/spider-man-2-review-insomniac-release-date-ps5\"\u003eMarvel’s Spider-Man 2\u003c/a\u003e\u003c/em\u003e. Although it’s unclear how they would be differentiated from Iron Fist and Spider-Man, respectively — Shang-Chi’s powers are based on martial arts, like Iron Fists, and Silk’s powers came from the radioactive spider, like Spider-Man’s.\u003c/p\u003e\u003cp\u003eEven with its diverse roster of heroes, \u003cem\u003eMarvel Rivals\u003c/em\u003e has room to improve on its representation. For starters, its Asian characters consist of East Asians, with South and Southeast Asian characters being woefully underrepresented, which is unfortunately very common. That’s easily fixable, however. The popular Kamala Khan, aka Ms. Marvel, is Pakistani-American and seems to be a no-brainer for \u003cem\u003eMarvel Rivals\u003c/em\u003e. Not only was she the star protagonist of \u003cem\u003eMarvel’s Avengers\u003c/em\u003e’ story campaign, but she’s also in the Marvel Cinematic Universe.\u003c/p\u003e\u003cp\u003eJubilee from X-Men should be considered, too. While she’s the daughter of Chinese immigrants, Vietnamese-American actress Lana Condor played her in \u003cem\u003eX-Men: Apocalypse\u003c/em\u003e. It’d be a minor difference, but interpreting Jubilee as Vietnamese in \u003cem\u003eMarvel Rivals\u003c/em\u003e would go a long way considering the dearth of Vietnamese heroes in general.\u003c/p\u003e\u003cp\u003eLet’s not stop at heroes either! Villains are important as well. The Chinese Martin Li, aka Mister Negative, was a major antagonist in Insomniac’s Marvel’s Spider-Man universe. While Asians have been portrayed as stereotypical villains, particularly in Western media, Mister Negative has depth to his character. He’s a clever representation of the Asian theme of yin and yang as he’s both an owner of a homeless shelter as well as a ruthless crime lord in Insomniac’s games. He shows that Asian characters can not only embody heroic qualities, but also flawed ones, to make them fully realized beings.\u003c/p\u003e\u003cp\u003eDespite my hopes for more additions, \u003cem\u003eMarvel Rivals\u003c/em\u003e has a bright future ahead, both in terms of being a long-lasting fun game and as a beacon of representation. Its initial roster is miles better than many other games when it comes to diversity, and that’s due to Marvel’s rich history. But what’s even more impressive is that its characters come from all sorts of real-world cultures and inspirations, and as a result, \u003cem\u003eMarvel Rival\u003c/em\u003e stands heads and shoulders above its competition.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-02-16T16:00:00Z",
  "modifiedTime": "2025-02-16T16:00:00Z"
}
