{
  "id": "167c9f16-cab2-4b21-b880-bfcaac906bfa",
  "title": "McFarlane Toys on Their Lilith and Doom Slayer Figures, Mortal Kombat and More | IGN Live 2025",
  "link": "https://www.ign.com/articles/mcfarlane-toys-doom-diablo-mortal-kombat-ign-live-2025",
  "description": "McFarlane Toys’ Brian Walters (Director, Brand Creative) stopped by IGN Live to talk about what they have in the pipeline, including their new Elite Edition series that’s kicking off with Doom Slayer from Doom: The Dark Ages, followed by Lilith from Diablo IV.",
  "author": "NormanOsborn",
  "published": "Sun, 8 Jun 2025 23:56:08 +0000",
  "source": "http://feeds.ign.com/ign/all",
  "categories": null,
  "byline": "Eric Goldman",
  "length": 2428,
  "excerpt": "McFarlane Toys’ Brian Walters (Director, Brand Creative) stopped by IGN Live to talk about what they have in the pipeline, including their new Elite Edition series that’s kicking off with Doom Slayer from Doom: The Dark Ages, followed by Lilith from Diablo IV.",
  "siteName": "IGN",
  "favicon": "",
  "text": "New Elite Edition series on the way.During a special IGN Live edition of Up at Noon today, McFarlane Toys’ Brian Walters (Director, Brand Creative) stopped by to chat with Max Scoville and Brian Altano about what the company has in the pipeline, including their new Elite Edition series that’s kicking off with Doom Slayer from Doom: The Dark Ages, followed by Lilith from Diablo IV. Walters said the idea behind the Elite Edition was “to create highly decorated, super detailed, iconic version of characters from games.” One way these figures stand out is by their inclusion of soft goods, such as the fur cloak on Doom Slayer, and Walters noted they were “Introducing new materials we haven’t used.” Walters pointed out the many accessories Doom Slayer came with, including the Pulveriser, flail, combat shotgun, and shield saw, saying he felt it was ”a really great first item for [Elite Edition].” Though pre-orders for Doom Slayer were currently sold out, Walters said the figure would be available at retailers like Walmart and Gamestop upon release. And yes, it was implied some monsters are in the works for the Doom Slayer to battle. Lilith in the meantime just went up for pre-order today, tied to IGN Live. Her accessories include multiple palace fates for a variety of expressions, and Williams said the idea was they were “holding nothing back with this figure,” including articulated wings and “a soft PVC tail so you can pose it however you want.” Williams said the challenge with a figure like Lilith was “the balance of executing the design but still making a functional toy. You have to make tough decisions.” He added that probably the hardest thing was pulling off “the engineering without compromising the look of the character.”As for what else McFarlane Toys had in the pipeline, there’s the Power Armor from Fallout, which is based on the game, not the series. The previous figures they made for the TV version were from the Movie Maniacs line, so the Power Armor will be the first articulated Fallout figure. Williams teased there was “more to come here. We’ve got some good surprises coming.” Last but not least, Williams showed off two of the figures from the upcoming Mortal Kombat Classics line - including a boxed Sub-Zero, featuring very fun retro arcade packaging that includes joystick controls on the box art and the original character select image of Sub-Zero, along with his bio, on the back.",
  "image": "https://assets-prd.ignimgs.com/2025/06/08/lilithdiablo4figure-blogroll-1749425537268.png?width=1280",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-cy=\"page-header\"\u003e\u003ch2 data-cy=\"article-sub-headline\"\u003eNew Elite Edition series on the way.\u003c/h2\u003e\u003c/div\u003e\u003csection data-cy=\"article-content\"\u003e\u003cp data-cy=\"paragraph\"\u003eDuring a special IGN Live edition of Up at Noon today, McFarlane Toys’ Brian Walters (Director, Brand Creative) stopped by to chat with Max Scoville and Brian Altano about what the company has in the pipeline, including their new Elite Edition series that’s kicking off with Doom Slayer from Doom: The Dark Ages, followed by Lilith from Diablo IV. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eWalters said the idea behind the Elite Edition was “to create highly decorated, super detailed, iconic version of characters from games.” One way these figures stand out is by their inclusion of soft goods, such as the fur cloak on Doom Slayer, and Walters noted they were “Introducing new materials we haven’t used.” \u003c/p\u003e\u003ca href=\"https://assets-prd.ignimgs.com/2025/06/08/purple-and-white-modern-business-youtube-thumbnail-2-1749426039362.png\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003coutput\u003e\u003cfigure\u003e\u003cspan\u003e\u003cimg decoding=\"async\" alt=\"undefined\" src=\"https://assets-prd.ignimgs.com/2025/06/08/purple-and-white-modern-business-youtube-thumbnail-2-1749426039362.png?width=1280\u0026amp;fit=bounds\u0026amp;height=720\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/output\u003e\u003c/a\u003e\u003cp data-cy=\"paragraph\"\u003eWalters pointed out the many accessories Doom Slayer came with, including the Pulveriser, flail, combat shotgun, and shield saw, saying he felt it was ”a really great first item for [Elite Edition].” Though pre-orders for Doom Slayer were currently sold out, Walters said the figure would be available at retailers like Walmart and Gamestop upon release. And yes, it was implied some monsters are in the works for the Doom Slayer to battle. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eLilith in the meantime just went up for pre-order today, tied to IGN Live. Her accessories include multiple palace fates for a variety of expressions, and Williams said the idea was they were “holding nothing back with this figure,” including articulated wings and “a soft PVC tail so you can pose it however you want.” \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eWilliams said the challenge with a figure like Lilith was “the balance of executing the design but still making a functional toy. You have to make tough decisions.” He added that probably the hardest thing was pulling off “the engineering without compromising the look of the character.”\u003c/p\u003e\u003ca href=\"https://assets-prd.ignimgs.com/2025/06/08/purple-and-white-modern-business-youtube-thumbnail-3-1749426293886.png\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003coutput\u003e\u003cfigure\u003e\u003cspan\u003e\u003cimg decoding=\"async\" alt=\"undefined\" src=\"https://assets-prd.ignimgs.com/2025/06/08/purple-and-white-modern-business-youtube-thumbnail-3-1749426293886.png?width=1280\u0026amp;fit=bounds\u0026amp;height=720\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/output\u003e\u003c/a\u003e\u003cp data-cy=\"paragraph\"\u003eAs for what else McFarlane Toys had in the pipeline, there’s the Power Armor from Fallout, which is based on the game, not the series. The previous figures they made for the TV version were from the Movie Maniacs line, so the Power Armor will be the first articulated Fallout figure. Williams teased there was “more to come here. We’ve got some good surprises coming.” \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eLast but not least, Williams showed off two of the figures from the upcoming Mortal Kombat Classics line - including a boxed Sub-Zero, featuring very fun retro arcade packaging that includes joystick controls on the box art and the original character select image of Sub-Zero, along with his bio, on the back. \u003c/p\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-08T23:56:08.614Z",
  "modifiedTime": "2025-06-09T00:06:01.276Z"
}
