{
  "id": "1c7034c7-58cc-41b2-be21-a62a6a8dc2d1",
  "title": "Beyond Citadel is a fascinating, melancholy FPS, but you'll need a high tolerance for gore and titillation",
  "link": "https://www.rockpapershotgun.com/beyond-citadel-is-a-fascinating-melancholy-fps-but-youll-need-a-high-tolerance-for-gore-and-titillation",
  "description": "The first time I died in Beyond Citadel, the game treated to me a close-up shot of my character's scantily clad, bisected body lying in a pool of guts and ripped underwear. It turns out you can turn off a lot of the gore and nudity. You can also swaddle yourself in some nice, sturdy, PG-13 body armor. But you're seemingly stuck with a certain base percentage of bulging, softcore gratuitousness in both the character portrait on bottom left, and in the mildly boobulent background art of the world. I'm not sure I can put up with all that, which is a shame, because Beyond Citadel is otherwise a promising, eerie FPS that mixes ideas from 90s shooters in pretty appealing ways. Read more",
  "author": "Edwin Evans-Thirlwell",
  "published": "Thu, 09 Jan 2025 17:08:19 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Shooter: First Person",
    "Fantasy",
    "Horror",
    "Beyond Citadel",
    "PC",
    "Anime"
  ],
  "byline": "Edwin Evans-Thirlwell",
  "length": 3979,
  "excerpt": "The first time I died in Beyond Citadel, the game treated to me a close-up shot of my character's scantily clad, bisect…",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/78813ef66c4d48aed643ad8c3a57062a/icon/apple-touch-icon.png",
  "text": "Is... is that you, Doomguy? Image credit: doekuramori The first time I died in Beyond Citadel, the game treated to me a close-up shot of my character's scantily clad, bisected body lying in a pool of guts and ripped underwear. It turns out you can turn off a lot of the gore and nudity. You can also swaddle yourself in some nice, sturdy, PG-13 body armor. But you're seemingly stuck with a certain base percentage of bulging, softcore gratuitousness in both the character portrait on bottom left, and in the mildly boobulent background art of the world. I'm not sure I can put up with all that, which is a shame, because Beyond Citadel is otherwise a promising, eerie FPS that mixes ideas from 90s shooters in pretty appealing ways. Beyond Citadel trailer Watch on YouTube As the name suggests, Beyond Citadel is a sequel to The Citadel, which launched in 2020. It's the work of Japanese developer doekuramori, who I'm not familiar with. The premise: it is Armageddon O' Clock. You are the Martyr, gun-toting anime girl agent of seven guardian angels. Your task is to \"cancel the apocalypse\" by defeating the forces of the rapacious Trumpeters, and unearthing the buried secrets of humankind's final stronghold. \"Cancel the apocalypse\" is seemingly a reference to Pacific Rim, but I have yet to meet Idris Elba in Beyond Citadel. His agent probably wouldn't let him anywhere near a hot potato like this. In any case, the more appropriate parallel here is surely Neon Genesis Evangelion, with its hyper-depressive Biblical imagery and penchant for grotesquely magnified bodily suffering.Based on the Steam demo, the world is a mixture of rolling, external wastelands and square, multiple-elevation corridors and chambers where you'll play find-the-keycard, and also disembowel-the-demon. The gunplay is broadly Doom-to-Dark-Forces, but with corner-peeking and ironsight aiming. You also get options to make the handling more elaborate. You can turn on weapon deterioration, which might cause guns to jam, and there's a manual reload feature where you have to cock the firearm after feeding in shells. I love this latter system: it makes life harder, of course, but it creates a satisfying tempo and makes the combat feel more intricate and tactile. I like when video game guns go clicky-clack, perhaps even more than when they go boom. I also like the setting, which reminds me a little of Lucah: Born Of A Dream and its sequel Death Of A Wish. It's a universe of dense runes, gangrene-daubed monoliths, and hollow-eyed anime people slumped in attitudes of foreboding and despair. The menus and intermission screens consist of drawings of additional, hollow-eyed anime people, all of them huddled up gripping battleaxes and rifles while showing a lot of thigh. There is plenty to read, with in-game writing that ranges from clipped computer logs to snippets of scripture. The English localisation is a bit scruffy, but it doesn't seem any more obscure than it intends to be. God is dead, I gather. \"0-919 activation in process\". Truth lies below. Image credit: doekuramori I'm always keen on video games that involve a relentless descent through layers of mounting unearthliness, such as Void Stranger. In this case, looking down a shaft to the next area also means gazing directly into your character's pixelart cleavage. Which doesn't feel like an accident, on the developer's part. I suspect there's something more thoughtful to say about the relationship between the game's themes and its borderline-absurdist nudity and gore, perhaps touching on the ethereal, alien symbology of anime girls in general, but I'm not sure I'm the best writer for the job. Still, I like Beyond Citadel's gunplay and spaces enough that I'll probably play a little more. I'll let you know if it proves worth the journey, but if you're convinced already, you can buy it on Steam right now.",
  "image": "https://assetsio.gnwcdn.com/1_TUJUEcf.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv\u003e\n  \n\n        \u003cp\u003eIs... is that you, Doomguy?\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/1_TUJUEcf.jpg?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/1_TUJUEcf.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/1_TUJUEcf.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/1_TUJUEcf.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A first-person view of somebody firing a shotgun down a blue-green corridor at a figure in robes, from FPS Beyond Citadel\" width=\"382\" height=\"215\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003edoekuramori\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eThe first time I died in Beyond Citadel, the game treated to me a close-up shot of my character\u0026#39;s scantily clad, bisected body lying in a pool of guts and ripped underwear. It turns out you can turn off a lot of the gore and nudity. You can also swaddle yourself in some nice, sturdy, PG-13 body armor. But you\u0026#39;re seemingly stuck with a certain base percentage of bulging, softcore gratuitousness in both the character portrait on bottom left, and in the mildly boobulent background art of the world. I\u0026#39;m not sure I can put up with all that, which is a shame, because Beyond Citadel is otherwise a promising, eerie FPS that mixes ideas from 90s shooters in pretty appealing ways.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Beyond Citadel trailer\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/0ih8zpHXi_M?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/0ih8zpHXi_M/hqdefault.jpg\"/\u003e\u003cspan\u003eBeyond Citadel trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/0ih8zpHXi_M?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/0ih8zpHXi_M?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003ca href=\"https://www.youtube.com/watch?v=0ih8zpHXi_M\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figure\u003e\n\u003cp\u003eAs the name suggests, Beyond Citadel is a sequel to The Citadel, which launched in 2020. It\u0026#39;s the work of Japanese developer doekuramori, who I\u0026#39;m not familiar with. The premise: it is Armageddon O\u0026#39; Clock. You are the Martyr, gun-toting anime girl agent of seven guardian angels. Your task is to \u0026#34;cancel the apocalypse\u0026#34; by defeating the forces of the rapacious Trumpeters, and unearthing the buried secrets of humankind\u0026#39;s final stronghold.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Cancel the apocalypse\u0026#34; is seemingly a reference to Pacific Rim, but I have yet to meet Idris Elba in Beyond Citadel. His agent probably wouldn\u0026#39;t let him anywhere near a hot potato like this. In any case, the more appropriate parallel here is surely Neon Genesis Evangelion, with its hyper-depressive Biblical imagery and penchant for grotesquely magnified bodily suffering.\u003c/p\u003e\u003cp\u003eBased on the Steam demo, the world is a mixture of rolling, external wastelands and square, multiple-elevation corridors and chambers where you\u0026#39;ll play find-the-keycard, and also disembowel-the-demon. The gunplay is broadly Doom-to-Dark-Forces, but with corner-peeking and ironsight aiming. You also get options to make the handling more elaborate. You can turn on weapon deterioration, which might cause guns to jam, and there\u0026#39;s a manual reload feature where you have to cock the firearm after feeding in shells. I love this latter system: it makes life harder, of course, but it creates a satisfying tempo and makes the combat feel more intricate and tactile. I like when video game guns go clicky-clack, perhaps even more than when they go boom.\u003c/p\u003e\n\u003cp\u003eI also like the setting, which reminds me a little of \u003ca href=\"https://www.rockpapershotgun.com/games/lucah-born-of-a-dream\"\u003eLucah: Born Of A Dream\u003c/a\u003e and its sequel \u003ca href=\"https://www.rockpapershotgun.com/games/death-of-a-wish\"\u003eDeath Of A Wish\u003c/a\u003e. It\u0026#39;s a universe of dense runes, gangrene-daubed monoliths, and hollow-eyed anime people slumped in attitudes of foreboding and despair. The menus and intermission screens consist of drawings of additional, hollow-eyed anime people, all of them huddled up gripping battleaxes and rifles while showing a lot of thigh.\u003c/p\u003e\n\u003cp\u003eThere is plenty to read, with in-game writing that ranges from clipped computer logs to snippets of scripture. The English localisation is a bit scruffy, but it doesn\u0026#39;t seem any more obscure than it intends to be. God is dead, I gather. \u0026#34;0-919 activation in process\u0026#34;. Truth lies below.\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/20250109150112_1.jpg?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A wasteland with a green monolith in the distance and a tipped over statue of an anime girl in the nearground, from the FPS Beyond Citadel\" height=\"215\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/20250109150112_1.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/20250109150112_1.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/20250109150112_1.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"382\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003edoekuramori\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eI\u0026#39;m always keen on video games that involve a relentless descent through layers of mounting unearthliness, such as \u003ca href=\"https://www.rockpapershotgun.com/games/void-stranger\"\u003eVoid Stranger\u003c/a\u003e. In this case, looking down a shaft to the next area also means gazing directly into your character\u0026#39;s pixelart cleavage. Which doesn\u0026#39;t feel like an accident, on the developer\u0026#39;s part. I suspect there\u0026#39;s something more thoughtful to say about the relationship between the game\u0026#39;s themes and its borderline-absurdist nudity and gore, perhaps touching on the ethereal, alien symbology of anime girls in general, but I\u0026#39;m not sure I\u0026#39;m the best writer for the job.\u003c/p\u003e\n\u003cp\u003eStill, I like Beyond Citadel\u0026#39;s gunplay and spaces enough that I\u0026#39;ll probably play a little more. I\u0026#39;ll let you know if it proves worth the journey, but if you\u0026#39;re convinced already, \u003ca href=\"https://store.steampowered.com/app/3371240/Beyond_Citadel/\"\u003eyou can buy it on Steam right now\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-09T17:08:19.306083Z",
  "modifiedTime": null
}
