{
  "id": "27268d97-f362-4308-bde0-449cc7b8d2af",
  "title": "Friday Bullet Points About Various Financial Reports",
  "link": "https://tagn.wordpress.com/2025/02/14/friday-bullet-points-about-various-financial-reports/",
  "description": "It is Friday, and St. Valentine’s Day for you romantics.  But I am going to take the day to talk about money.  Several companies I keep an eye on reported their Q4 2024 earnings over the last week or so and I don’t have it in me to make any of them the subject of […]",
  "author": "Wilhelm Arcturus",
  "published": "Fri, 14 Feb 2025 16:15:42 +0000",
  "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
  "categories": [
    "CCP",
    "Daybreak Game Company",
    "entertainment",
    "EVE Online",
    "EverQuest",
    "EverQuest II",
    "Friday Bullet Points",
    "Guild Wars 2",
    "Lord of the Rings Online",
    "ArenaNet",
    "EG7",
    "Embracer",
    "Enad Global 7",
    "Lars from Mars",
    "Lars Wingefors",
    "NCsoft",
    "No War But Class War",
    "Pearl Abyss"
  ],
  "byline": "by Wilhelm Arcturus",
  "length": 6560,
  "excerpt": "It is Friday, and St. Valentine’s Day for you romantics. But I am going to take the day to talk about money. Several companies I keep an eye on reported their Q4 2024 earnings over the last…",
  "siteName": "The Ancient Gaming Noob",
  "favicon": "",
  "text": "It is Friday, and St. Valentine’s Day for you romantics.  But I am going to take the day to talk about money.  Several companies I keep an eye on reported their Q4 2024 earnings over the last week or so and I don’t have it in me to make any of them the subject of a full blog post, so I am just going to speed run through them I guess, just so I have the links handy at some future date. Enad Global 7 Q4 2024 \u0026 2024 Overall Financial Results EG7 – Year End and Q4 2024 Report EG7 – Q4 2024 Investor Presentation Massively OP Coverage There is, no doubt, a lot of ink that could be spilled here.  It has been a strange year for EG7, what with the PlanetSide 2 IP sale, then moving it under Toadman, then liquidating Toadman. Overall Q4 was good for EG7, up from Q4 in 2023, but overall 2024 saw a 16% decline in net revenue.  The report highlights the EverQuest, EverQuest II, and Lord of the Rings Online expansions in Q4 for Daybreak… but the revenue and earnings chart isn’t exactly something to get excited about if you’re a Daybreak fan. EG7 Q4 2024 Financials – Slide 10 Q3 was actually better for Daybreak that Q4… which makes one wonder if the Q4 expansions were all that helpful frankly… and Q4 margins for Daybreak were bad.  Not as bad as Q2, but 13% for a software company is in the “layoffs are coming” zone.  Meanwhile, Big Blue Bubble brought in less than half the revenue but delivered almost double the net contribution to the bottom line. But even more interesting is the fact that the “rest of the group” section, usually a bit of an after thought, came in with higher revenues and more profits than either of the highlighted leading studios.  Somebody in there might need to get their own chart at some point. Ji Ham puts a typical acting CEO spin on things, saying everything will be better in 2025.  But it feels like a Daybreak shakeup might be imminent, that we’ll be back to the old days of slash and burn to keep the numbers good. Oh, and that new H1Z1 title… still out there somewhere, though I now think there is maybe a 60% chance it will just disappear by the end of 2025. Pearl Abyss Q4 2024 Financial Results PA – Q424 Earnings Presentation The Nosy Gamer Coverage Massively OP Coverage The Oz Coverage The studio behind Black Desert Online and the parent company of CCP, the only surprise here of late is that they haven’t jumped on the AI bandwagon, because their history is one of failing to ship anything new and looking to solve that by finding a gimmick like VR, the metaverse, or crypto to fall back on.  But they’re still on the crypto kick, so I guess there is still time to embrace AI.  They’ll probably do so after Lord British says you’re dumb to not be making an AI title, the usual harbinger of death for any such trend. Anyway, they’ve had a year that ended with a stronger Q4 as the revenue breakdown chart shows. Pearl Abyss Q4 2024 The mystery is which games contributed to this Q4 uptick because PA eliminated the breakdown by IP chart.  When a company removes a chart or data point from their reporting, it is always because they want to hide something.  Remember when Blizz stopped reporting WoW subscriber numbers and substituted in MAUs instead?  Just an attempt to hide a metric that showed they were having trouble. (And then MAUs tanked over time, so it was a wasted effort to hide the truth of Blizzard’s inability to produce content.  They’ve since changed to running 97 flavors of WoW to cover that gap.) Over at TNG there is speculation that they are trying to hide the results of a disappointing launch of Black Desert Online in China… and The Oz is guessing that it might have been a very good quarter for EVE Online… but we can’t tell because they’ve chosen to hide the data. NCsoft Q4 2024 Financial Results NCsoft – Q4 2024 Earnings Release Massively OP Coverage Mostly here because of Guild Wars 2, which shipped an expansion in the back half of 2024.  Anyway, GW2 had a good 2024. NCsoft 2024 PC Game Revenue by Title I suppose in a world where World of Warcraft has made more than a billion dollars annually more than a few times maybe their number doesn’t impress, but a lot of companies would dearly love to have that much annual revenue. Cloud Imperium MOP – Star Citizen is slowing down its content and comms cadence MOP – Star Citizen and its “Maybe Monthly” content cadence TNG – Cloud Imperium Issues $5 Million in New Shares TNG – Management Updates at Cloud Imperium TNG – Cloud Imperium January 2025 Sales I normally don’t bother saying much about Star Citizen.  I was skeptical Chris Roberts could deliver what he promised a decade back and I remain so today.  It is what it is. But what it is feels mostly like a hype machine, so I was quite surprised by a recent announcement.  It wasn’t the layoffs that surprised me; those were going to come some day.  It wasn’t the slow down of the pace of updates that surprised me; the game is more than a decade past due, how much slower could they go? Otherwise they’re still bringing in an enviable amount of cash… but they are also planning to slow down on the comms as well… and that is what generates the hype that gets people to throw money at them based on some promised future ship or feature.  Is that going to have an impact going forward? Embracer’s Skateboard Keeps Rolling A friend once remarked that if you fall off your skateboard, the board itself will likely keep rolling for some time… but that doesn’t mean you’re actually going anywhere. I haven’t mentioned Embracer Group or their embarrassingly bad CEO who managed to wreck the company recently.  I think Q2 was my last mention… because Lars from Mars continues to bumble along trying to hide his incompetence, another mediocre rich kid breaking things while being shielded from any consequence. And the Embracer 2024 results were nothing to write home about.  2024 was down from 2023, which was down from 2022, and so on. But then something went right for the company, Kingdom Come: Deliverance II did well with its recent launch because the people who do the actual work… those who remain… worked hard and accomplished something, and now Lars is out there telling people how his brilliant plan to save the company is coming together.  He absolutely wants adulation for a small bounce back from the problems that he and his incompetent leadership caused in the first place. You don’t get credit for fixing a problem you caused! It is the sort of thing that makes you want to go out and spray pain “NO WAR BUT CLASS WAR” on buildings downtown.",
  "image": "https://tagn.wordpress.com/wp-content/uploads/2025/02/eg7-2024-q4-daybreakbbbothers.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\u003cp\u003eIt is Friday, and St. Valentine’s Day for you romantics.  But I am going to take the day to talk about money.  Several companies I keep an eye on reported their Q4 2024 earnings over the last week or so and I don’t have it in me to make any of them the subject of a full blog post, so I am just going to speed run through them I guess, just so I have the links handy at some future date.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eEnad Global 7 Q4 2024 \u0026amp; 2024 Overall Financial Results\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eEG7 – \u003ca href=\"https://storage.mfn.se/46414dfb-6be1-4d70-966c-ebb5b80baa0c/q4-2024-interim-report-eng.pdf\"\u003eYear End and Q4 2024 Report\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eEG7 – \u003ca href=\"https://storage.mfn.se/a/enad-global-7/b681a3b1-b145-440e-8b68-7ceed0627fe5/q4-2024-investor-presentation-v-12-5.pdf\"\u003eQ4 2024 Investor Presentation\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://massivelyop.com/2025/02/10/eg7-q3-2024-palia-hits-console-this-spring-as-everquest-lotro-drive-daybreak-revenue/\"\u003eMassively OP Coverage\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThere is, no doubt, a lot of ink that could be spilled here.  It has been a strange year for EG7, what with the \u003cem\u003ePlanetSide 2\u003c/em\u003e IP sale, then moving it under Toadman, then liquidating Toadman.\u003c/p\u003e\n\u003cp\u003eOverall Q4 was good for EG7, up from Q4 in 2023, but overall 2024 saw a 16% decline in net revenue.  The report highlights the \u003cem\u003eEverQuest, EverQuest II,\u003c/em\u003e and \u003cem\u003eLord of the Rings Online\u003c/em\u003e expansions in Q4 for Daybreak… but the revenue and earnings chart isn’t exactly something to get excited about if you’re a Daybreak fan.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_132448\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/eg7-2024-q4-daybreakbbbothers.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-132448\" data-attachment-id=\"132448\" data-permalink=\"https://tagn.wordpress.com/2025/02/14/friday-bullet-points-about-various-financial-reports/eg7-2024-q4-daybreakbbbothers/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/eg7-2024-q4-daybreakbbbothers.png\" data-orig-size=\"1819,970\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"EG7-2024-q4-DaybreakBBBothers\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;EG7 Q4 2024 Financials – Slide 10\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/eg7-2024-q4-daybreakbbbothers.png?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/eg7-2024-q4-daybreakbbbothers.png?w=600\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/eg7-2024-q4-daybreakbbbothers.png?w=600\" alt=\"\" width=\"600\" height=\"320\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/eg7-2024-q4-daybreakbbbothers.png?w=600 600w, https://tagn.wordpress.com/wp-content/uploads/2025/02/eg7-2024-q4-daybreakbbbothers.png?w=1200 1200w, https://tagn.wordpress.com/wp-content/uploads/2025/02/eg7-2024-q4-daybreakbbbothers.png?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/02/eg7-2024-q4-daybreakbbbothers.png?w=500 500w, https://tagn.wordpress.com/wp-content/uploads/2025/02/eg7-2024-q4-daybreakbbbothers.png?w=768 768w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-132448\"\u003eEG7 Q4 2024 Financials – Slide 10\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eQ3 was actually better for Daybreak that Q4… which makes one wonder if the Q4 expansions were all that helpful frankly… and Q4 margins for Daybreak were bad.  Not as bad as Q2, but 13% for a software company is in the “layoffs are coming” zone.  Meanwhile, Big Blue Bubble brought in less than half the revenue but delivered almost double the net contribution to the bottom line.\u003c/p\u003e\n\u003cp\u003eBut even more interesting is the fact that the “rest of the group” section, usually a bit of an after thought, came in with higher revenues and more profits than either of the highlighted leading studios.  Somebody in there might need to get their own chart at some point.\u003c/p\u003e\n\u003cp\u003eJi Ham puts a typical acting CEO spin on things, saying everything will be better in 2025.  But it feels like a Daybreak shakeup might be imminent, that we’ll be back to the old days of slash and burn to keep the numbers good.\u003c/p\u003e\n\u003cp\u003eOh, and that new \u003cem\u003eH1Z1\u003c/em\u003e title… still out there somewhere, though I now think there is maybe a 60% chance it will just disappear by the end of 2025.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003ePearl Abyss Q4 2024 Financial Results\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003ePA – \u003ca href=\"https://irsvc.teletogether.com/pearlabyss/pdf/pearlabyss2024Q4_eng.pdf?2\"\u003eQ424 Earnings Presentation\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://nosygamer.blogspot.com/2025/02/pearl-abyss-q4-2024-earnings-call.html\"\u003eThe Nosy Gamer Coverage\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://massivelyop.com/2025/02/13/pearl-abyss-q4-2024/\"\u003eMassively OP Coverage\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/watch?v=GgK3go5UnQk\"\u003eThe Oz Coverage\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe studio behind \u003cem\u003eBlack Desert Online\u003c/em\u003e and the parent company of CCP, the only surprise here of late is that they haven’t jumped on the AI bandwagon, because their history is one of failing to ship anything new and looking to solve that by finding a gimmick like VR, the metaverse, or crypto to fall back on.  But they’re still on the crypto kick, so I guess there is still time to embrace AI.  They’ll probably do so after Lord British says you’re dumb to not be making an AI title, the usual harbinger of death for any such trend.\u003c/p\u003e\n\u003cp\u003eAnyway, they’ve had a year that ended with a stronger Q4 as the revenue breakdown chart shows.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_132446\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/pearlabyssq42024.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-132446\" data-attachment-id=\"132446\" data-permalink=\"https://tagn.wordpress.com/2025/02/14/friday-bullet-points-about-various-financial-reports/pearlabyssq42024/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/pearlabyssq42024.png\" data-orig-size=\"1333,716\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"PearlAbyssQ42024\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Pearl Abyss Q4 2024 \u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/pearlabyssq42024.png?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/pearlabyssq42024.png?w=600\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/pearlabyssq42024.png?w=600\" alt=\"\" width=\"600\" height=\"322\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/pearlabyssq42024.png?w=600 600w, https://tagn.wordpress.com/wp-content/uploads/2025/02/pearlabyssq42024.png?w=1200 1200w, https://tagn.wordpress.com/wp-content/uploads/2025/02/pearlabyssq42024.png?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/02/pearlabyssq42024.png?w=500 500w, https://tagn.wordpress.com/wp-content/uploads/2025/02/pearlabyssq42024.png?w=768 768w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-132446\"\u003ePearl Abyss Q4 2024\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eThe mystery is which games contributed to this Q4 uptick because PA eliminated the breakdown by IP chart.  When a company removes a chart or data point from their reporting, it is always because they want to hide something.  Remember when Blizz stopped reporting \u003cem\u003eWoW\u003c/em\u003e subscriber numbers and substituted in MAUs instead?  Just an attempt to hide a metric that showed they were having trouble. (And then MAUs tanked over time, so it was a wasted effort to hide the truth of Blizzard’s inability to produce content.  They’ve since changed to running 97 flavors of \u003cem\u003eWoW\u003c/em\u003e to cover that gap.)\u003c/p\u003e\n\u003cp\u003eOver at TNG there is speculation that they are trying to hide the results of a disappointing launch of \u003cem\u003eBlack Desert Online\u003c/em\u003e in China… and The Oz is guessing that it might have been a very good quarter for \u003cem\u003eEVE Online\u003c/em\u003e… but we can’t tell because they’ve chosen to hide the data.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eNCsoft Q4 2024 Financial Results\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eNCsoft – \u003ca href=\"https://static-brand.ncsoft.com/ncsoft/invest/result/20250212/report/4Q24_PT_ENG.pdf\"\u003eQ4 2024 Earnings Release\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://massivelyop.com/2025/02/12/ncsoft-q4-2024/\"\u003eMassively OP Coverage\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMostly here because of \u003cem\u003eGuild Wars 2\u003c/em\u003e, which shipped an expansion in the back half of 2024.  Anyway, \u003cem\u003eGW2\u003c/em\u003e had a good 2024.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_132447\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/ncsoft2024revenuebygames.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-132447\" data-attachment-id=\"132447\" data-permalink=\"https://tagn.wordpress.com/2025/02/14/friday-bullet-points-about-various-financial-reports/ncsoft2024revenuebygames/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/ncsoft2024revenuebygames.png\" data-orig-size=\"578,549\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"NCsoft2024RevenueByGames\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;NCsoft 2024 PC Game Revenue by Title \u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/ncsoft2024revenuebygames.png?w=421\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/ncsoft2024revenuebygames.png?w=474\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/ncsoft2024revenuebygames.png?w=474\" alt=\"\" width=\"474\" height=\"450\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/02/ncsoft2024revenuebygames.png?w=474 474w, https://tagn.wordpress.com/wp-content/uploads/2025/02/ncsoft2024revenuebygames.png?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/02/ncsoft2024revenuebygames.png?w=421 421w, https://tagn.wordpress.com/wp-content/uploads/2025/02/ncsoft2024revenuebygames.png 578w\" sizes=\"(max-width: 474px) 100vw, 474px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-132447\"\u003eNCsoft 2024 PC Game Revenue by Title\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eI suppose in a world where \u003cem\u003eWorld of Warcraft\u003c/em\u003e has made more than a billion dollars annually more than a few times maybe their number doesn’t impress, but a lot of companies would dearly love to have that much annual revenue.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eCloud Imperium\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eMOP – \u003ca href=\"https://massivelyop.com/2025/02/07/following-layoffs-and-an-exec-purge-star-citizen-is-slowing-down-its-update-and-comms-cadence/\"\u003eStar Citizen is slowing down its content and comms cadence\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eMOP – \u003ca href=\"https://massivelyop.com/2025/02/14/star-citizen-elaborates-on-its-new-cadence-and-plot-based-content-release-plans/\"\u003eStar Citizen and its “Maybe Monthly” content cadence\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eTNG – \u003ca href=\"https://nosygamer.blogspot.com/2025/02/cloud-imperium-games-issues-5-million.html\"\u003eCloud Imperium Issues $5 Million in New Shares\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eTNG – \u003ca href=\"https://nosygamer.blogspot.com/2025/02/more-management-updates-at-cloud.html\"\u003eManagement Updates at Cloud Imperium\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eTNG – \u003ca href=\"https://nosygamer.blogspot.com/2025/02/cloud-imperium-january-2025-sales.html\"\u003eCloud Imperium January 2025 Sales\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eI normally don’t bother saying much about \u003cem\u003eStar Citizen\u003c/em\u003e.  I was skeptical Chris Roberts could deliver what he promised a decade back and I remain so today.  It is what it is.\u003c/p\u003e\n\u003cp\u003eBut what it is feels mostly like a hype machine, so I was quite surprised by a recent announcement.  It wasn’t the layoffs that surprised me; those were going to come some day.  It wasn’t the slow down of the pace of updates that surprised me; the game is more than a decade past due, how much slower could they go?\u003c/p\u003e\n\u003cp\u003eOtherwise they’re still bringing in an enviable amount of cash… but they are also planning to slow down on the comms as well… and that is what generates the hype that gets people to throw money at them based on some promised future ship or feature.  Is that going to have an impact going forward?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eEmbracer’s Skateboard Keeps Rolling\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eA friend once remarked that if you fall off your skateboard, the board itself will likely keep rolling for some time… but that doesn’t mean you’re actually going anywhere.\u003c/p\u003e\n\u003cp\u003eI haven’t mentioned Embracer Group or their embarrassingly bad CEO who managed to wreck the company recently.  I think \u003ca href=\"https://tagn.wordpress.com/2024/08/16/embracer-group-trust-the-plan/\"\u003eQ2 was my last mention\u003c/a\u003e… because Lars from Mars continues to bumble along trying to hide his incompetence, another mediocre rich kid breaking things while being shielded from any consequence.\u003c/p\u003e\n\u003cp\u003eAnd the Embracer 2024 results were nothing to write home about.  2024 was down from 2023, which was down from 2022, and so on.\u003c/p\u003e\n\u003cp\u003eBut then something went right for the company, \u003cem\u003eKingdom Come: Deliverance II\u003c/em\u003e did well with its recent launch because the people who do the actual work… those who remain… worked hard and accomplished something, and now \u003ca href=\"https://www.gamedeveloper.com/business/embracer-says-gutting-its-business-has-created-strong-foundation-for-future-value-creation-\"\u003eLars is out there telling people\u003c/a\u003e how his brilliant plan to save the company is coming together.  He absolutely wants adulation for a small bounce back from the problems that he and his incompetent leadership caused in the first place.\u003c/p\u003e\n\u003cp\u003eYou don’t get credit for fixing a problem you caused!\u003c/p\u003e\n\u003cp\u003eIt is the sort of thing that makes you want to go out and spray pain “NO WAR BUT CLASS WAR” on buildings downtown.\u003c/p\u003e\n\n\t\t\t\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-02-14T16:15:42Z",
  "modifiedTime": "2025-02-14T15:48:31Z"
}
