{
  "id": "36c2a8a8-6143-4e92-9eff-3a7513cb1e60",
  "title": "Avowed and the Living Lands Are the Next Great Frontier for Obsidian",
  "link": "https://news.xbox.com/en-us/2025/02/07/avowed-living-lands-next-great-frontier-for-obsidian/",
  "description": "The post Avowed and the Living Lands Are the Next Great Frontier for Obsidian appeared first on Xbox Wire.",
  "author": "Mike Nelson, Xbox Wire Editor",
  "published": "Fri, 07 Feb 2025 16:00:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Avowed",
    "Cloud Gaming",
    "Games",
    "PC Gaming",
    "Xbox Game Pass",
    "Avowed Premium Edition",
    "Obsidian Entertainment",
    "pc gaming",
    "Pillars of Eternity",
    "Xbox App for Windows PC",
    "Xbox Game Studios"
  ],
  "byline": "Mike Nelson, Xbox Wire Editor",
  "length": 15965,
  "excerpt": "Discover how Obsidian has meticulously developed the Living Lands, a wild frontier full of mystery and magic, and positioned it as the centerpiece of their next great RPG, Avowed.",
  "siteName": "Xbox Wire",
  "favicon": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "SummaryThe Living Lands in Avowed is an entirely new region to explore within the Pillar’s of Eternity universe of Eora.The environmental designs feed into the ethos of player choice, with a tangible purpose for your adventure beyond expanded lore and being stunning to look at.Avowed is launching February 18, 2025, for Xbox Series X|S, the Xbox app for Windows PC, Battle.net, Steam, cloud, and will be available on day one with Game Pass. The more I learn about the Living Lands of Avowed, an island ripe with riches, mystery, and magic, the more it feels like it’s the Wild West of Eora. A frontier full of adventurers, mercenaries, and thieves, all looking to stake a claim — as a player, that’s exactly where I want to be. It projects this unique, early-modern period look and feel where it’s not quite medieval, but sophisticated enough that society is utilizing things like gunpowder and blast furnaces, with cultures developing their own distinct means of survival – much like moments in the history of our world. In talking with the team at Obsidian, I learned that all of this is intentional in its design, giving us a look at what a new frontier would look like if it were a first-person fantasy role-playing game. Borrowing elements from our world also helps to inform the “rules” Obsidian follows for crafting a player experience within the Living Lands, turning the dials just enough to give us something wholly unique, where souls are real and gods exist – but not necessarily in a way that we think of them. “When you’re informed by those two basic facts, it guides a lot about both the kind of content you develop and the tone and flavor you give it,” explains Game Director Carrie Patel. “The flow of souls, the presence and existence of that energy, is key and core to life continuing in Eora in a way that will resonate with players who have been through Pillars of Eternity II: Deadfire. We have a traditional pantheon in the world of Pillars, and you will get glimpses of some of these gods in Avowed.” This all feeds into the various cultures you will encounter along the way — what’s important to them (like their gods) is what gives life to the game. The Aedyrans, for example, are a nation that heavily values the ideas of rightful rule, leadership, and order – and now they’re plopped into the greatest frontier of Eora. What would it look like as they start to try and blend in with the locals? It may be a small change in their outfit or adapting to how they choose to live. This “Wild West” attracts all sorts, and rigidity may not blend very well with what’s required to survive the Living Lands. “Someone who primarily reveres [the goddess] Woedica, values her emphasis on law, order, justice, and rightful rulership above other things. If you venerate Abydon, who is the Smith, it’s not that you don’t believe in the other gods, but you value that sense of industry, hard work, and dedication above other things. This allows us to imbue those factions and groups with certain ideals that are recognizable and help us clearly inform the player about what they’re about,” adds Patel. I see this in the architecture and outfit design as well, and how the two feel intricately woven together. “This world has been an actual, living, breathing thing. It’s represented in the game, but it feels like it’s been like that in the development,” explains Lead Environment Artist Dennis Presnell. “It’s such an iterative process that as we go, and as our team members come up with new assets or clever ideas or storytelling, we all build upon that and stand on each other’s shoulders. All of it coalesces into something that has so much variety; a big, cohesive, authentic world.” “With all our games, and certainly with the lore of Pillars, we want to make everything intentional,” explains Patel. “Dwarves don’t need to have Scottish accents just because they do in other fantasy settings, and elves don’t need to all speak with Received Pronunciation. It’s about stripping back those tropes. One example was the idea of mountain dwarves tending to be more itinerant. Traditional dwarven societies build impressive places but then scatter and move on due to resources, personal disagreements, or political rifts. This created an interesting opportunity for us in Avowed to explore: What it would be like if one of these settlements stuck around. What would that culture be like? Why would those characters have made that decision, and what would that mean for the story?” Much like real-life isolated island locations, such as New Zealand, Australia, or Madagascar, these places can feel alien because they’ve evolved on their own timeline, without interference from the rest of the world and its ecosystem. That’s true for the Living Lands as well. You’ll see this manifest in dramatic environments, with metaphysical and spiritual reasons to account for these differences, with hints of evidence of past civilizations that remains a mystery, and that’s a fascinating aspect of Avowed’s environments — the haunting mystery of the civilizations that came before. “Part of what made the Living Lands an appealing setting is the promise of having distinct environments and biomes, making you feel like you’re traversing a big, wild land,” explains Patel. “In the lore of Pillars, the Living Lands is described as a strange island where you see things you don’t see anywhere else. It’s carved up by mountains and valleys, allowing for distinct biomes and climate zones to exist in proximity to one another.” All the regions that players will explore in Avowed are entirely new and very different aesthetically. We’ve never been to the Living Lands before in any prior Pillars of Eternity game or DLC, so it has been ripe for creation and creativity from the game design team. There’s this excitement that comes with that, this sense of a living world that you are a part of rather than a world built just for you, with player choice feeding into how you choose to explore this unique world, full of nooks and crannies of hidden adventures for players to find, it all makes the world feel so much more alive. “We really wanted to build an authentic-feeling world,” explains Presnell. “Even if it’s not populated with NPCs or player characters, there’s a history there, and you’ve seen evidence of activity that makes it feel authentic. There’s so much to explore; there’s no way you’re going to see everything available in the first playthrough.” So far, we’ve seen big chunks of Dawnshore from our hands-on experience, as well as elements of the Emerald Stair region on the Xbox Podcast last June, which is a very lush, but slightly gloomy region. And we’ve seen glimpses of Shatterscarp in other gameplay footage, which is a high desert region. This is to illustrate that the Living Lands are going to be a wild, big place of both promise and danger, and it’s something that civilization is just starting to move into. That brings both good and bad — it’s a space of conflict and transition that will be very interesting to play in and feels like a natural evolution of what Obsidian has been doing from game to game in Pillars. “We know that whether someone is returning from having played Pillars of Eternity, or they are entirely new to the IP, the setting of the Living Lands and the story of Avowed will be new,” Patel explains. “As with any larger IP, you have this sense of connectedness with the larger world and timeline through current events and characters with experiences and perspectives. But you want to be careful that the bulk of your content is focused on the present story in this time and place. That’s where you draw the line between references and the core content that players are concerned with.” Helping to get new players up to speed will be the in-game glossary tooltip system that lets you look up lore terms and the names of gods to help onboard you to these concepts without derailing the experience with too many explanations. As Patel notes to me, there’s been a lot of iteration and playtesting to hit that sweet spot. “We’ve done several hours of playtests through Microsoft’s user research department, focusing on clarity in mechanics, story, and player direction in the first few hours. From the prologue level, which you played, to the early Dawnshore experience, we’ve made adjustments based on feedback and played through it again. We’ve probably spent more time adjusting and tweaking the prologue than anything else.” These environmental designs also have a purpose for your adventure beyond expanded lore and being stunning to look at. Early on, you are shown the various ways you can approach a situation while circumventing the environment by tapping into the power of a grimoire, setting fire to a blocked passageway. How you choose to interact with this game’s world will build upon the incredible immersion factor as you move through the Living Lands. “We always want to give the player a few different ways to solve some of the problems ahead of them,” explains Patel. “For example, there are certain obstacles that might require fire to burn through. In combat, fire also does great damage over time. You can use it to ignite things like explosive barrels to do more damage. You could have a spell or an enchanted weapon that does fire damage. You may have Magran’s Fury, which are essentially little fire grenades you can find in the world that will do the same thing. You can also have (your companion) Kai use one of his special abilities outside of combat to burn through obstacles that require fire to continue traversing.” And it’s not just how magic allows you to interact with this world in tangible ways. It’s also how you choose to explore the world of Eora. As Presnell shares with me, lots of attention has been given to rewarding players who choose to veer outside of the main quests or the quick path. “It’s something I personally love in games when developers take the time to populate and world-build off the beaten path,” explains Presnell. “I’ve always checked around corners and looked over and under things, and I was overjoyed when I saw the time and care put into detailing those parts. We do so much of that in this game. We really reward the player for exploring the world as much as possible. Our team is so good at telling amazing little stories for those detail-oriented enough to look for them and put the pieces together.” Obsidian’s work has always stood out to me as being some of the most immersive experiences in gaming. In the last few years, we’ve seen them invest in their craft like never before and build out these wholly original universes, like with Pillars of Eternity, Pentiment, Grounded, and The Outer Worlds. They’re cooking right now like they’ve never cooked before and we’re feasting on this bounty of gaming. It feels like this is now coalescing around Avowed, while Obsidian pushes themselves creatively to give us a new perspective to one of their most engaging and lore-rich worlds. Even though we’re on the cusp of being able to dive further into this new frontier of Eora, it still feels like they’re just getting started on telling even grander and more immersive stories than ever before. Avowed is the next great chapter for Obsidian’s rich history, their next great frontier, and I’m all aboard. Giddy up! Avowed is launching February 18, 2025, for Xbox Series X|S, the Xbox app for Windows PC, Battle.net, Steam, cloud, and will be available on day one with Game Pass. Players who purchase the game for either Xbox or Battle.net or have a Game Pass Ultimate or PC Game Pass membership can play on both Xbox and Battle.net by linking their Xbox and Battle.net accounts. Avowed is currently available for pre-order on the Xbox Store, Battle.net, and Steam. The Premium Edition offers up to five days early access, two premium skin packs, and access to the Avowed Digital Artbook \u0026 Soundtrack. Avowed Premium Edition Premium Edition includes: – Avowed base game – Up to 5 days early access – Two Premium Skin Packs – Access to Avowed Digital Artbook \u0026 Original Soundtrack Welcome to the Living Lands, a mysterious island filled with adventure and danger. Set in the fictional world of Eora that was first introduced to players in the Pillars of Eternity franchise, Avowed is a first-person fantasy action RPG from the award-winning team at Obsidian Entertainment. You are the envoy of Aedyr, a distant land, sent to investigate rumors of a spreading plague throughout the Living Lands – an island full of mysteries and secrets, danger and adventure, and choices and consequences, and untamed wilderness. You discover a personal connection to the Living Lands and an ancient secret that threatens to destroy everything. Can you save this unknown frontier and your soul from the forces threatening to tear them asunder? The Weird and Wonderful Living Lands The Living Lands is a place that feels foreign yet somewhat intrinsic to you as it feels the island itself is calling out to you for help. Explore an island home to many different environments and landscapes, each with their own unique ecosystem. Visceral Combat to Play Your Way Mix and match swords, spells, guns, and shields to fight your way. Dig into your grimoire for spells to trap, freeze or burn enemies, bash them with your shield, or use range bows to attack from a distance. Companions as part of your journey Companions from a spread of species will fight alongside you, with their own unique set of abilities. From a former mercenary to an eccentric wizard, they will be part of your journey with your choices shaping them as you help them with their quests. Avowed Standard Edition Welcome to the Living Lands, a mysterious island filled with adventure and danger. Set in the fictional world of Eora that was first introduced to players in the Pillars of Eternity franchise, Avowed is a first-person fantasy action RPG from the award-winning team at Obsidian Entertainment. You are the envoy of Aedyr, a distant land, sent to investigate rumors of a spreading plague throughout the Living Lands – an island full of mysteries and secrets, danger and adventure, and choices and consequences, and untamed wilderness. You discover a personal connection to the Living Lands and an ancient secret that threatens to destroy everything. Can you save this unknown frontier and your soul from the forces threatening to tear them asunder? The Weird and Wonderful Living Lands The Living Lands is a place that feels foreign yet somewhat intrinsic to you as it feels the island itself is calling out to you for help. Explore an island home to many different environments and landscapes, each with their own unique ecosystem. Visceral Combat to Play Your Way Mix and match swords, spells, guns, and shields to fight your way. Dig into your grimoire for spells to trap, freeze or burn enemies, bash them with your shield, or use range bows to attack from a distance. Companions as part of your journey Companions from a spread of species will fight alongside you, with their own unique set of abilities. From a former mercenary to an eccentric wizard, they will be part of your journey with your choices shaping them as you help them with their quests. Avowed Premium Upgrade Addon Xbox Game Studios $24.99 $22.49 Upgrade* from Standard Edition and receive the following content: – Up to 5 days early access – Premium Skin Packs: 2 sets of bonus skins for your companions – Access to Avowed Digital Artbook \u0026 Original Soundtrack *Requires base game or Xbox Game Pass membership (PC or Ultimate only), all sold separately.",
  "image": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/avowed_09-ffd2ad2f610d02378553-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\t\n\n\u003cdiv\u003e\n\n\u003cdiv\u003e\u003ch3\u003eSummary\u003c/h3\u003e\u003cul\u003e\u003cli\u003eThe Living Lands in \u003cem\u003e\u003cstrong\u003e\u003ca href=\"https://www.xbox.com/games/avowed\"\u003eAvowed\u003c/a\u003e\u003c/strong\u003e \u003c/em\u003eis an entirely new region to explore within the \u003cem\u003ePillar’s of Eternity \u003c/em\u003euniverse of Eora.\u003c/li\u003e\u003cli\u003eThe environmental designs feed into the ethos of player choice, with a tangible purpose for your adventure beyond expanded lore and being stunning to look at.\u003c/li\u003e\u003cli\u003e\u003cem\u003eAvowed\u003c/em\u003e is launching February 18, 2025, for Xbox Series X|S, the Xbox app for Windows PC, Battle.net, Steam, cloud, and will be available on day one with Game Pass.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003eThe more I learn about the Living Lands of \u003cem\u003e\u003cstrong\u003e\u003ca href=\"https://www.xbox.com/games/avowed\"\u003eAvowed\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e, an island ripe with riches, mystery, and magic, the more it feels like it’s the Wild West of Eora. A frontier full of adventurers, mercenaries, and thieves, all looking to stake a claim — as a player, that’s exactly where I want to be. It projects this unique, early-modern period look and feel where it’s not quite medieval, but sophisticated enough that society is utilizing things like gunpowder and blast furnaces, with cultures developing their own distinct means of survival – much like moments in the history of our world.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn talking with the team at Obsidian, I learned that all of this is intentional in its design, giving us a look at what a new frontier would look like if it were a first-person fantasy role-playing game. Borrowing elements from our world also helps to inform the “rules” Obsidian follows for crafting a player experience within the Living Lands, turning the dials just enough to give us something wholly unique, where souls are real and gods exist – but not necessarily in a way that we think of them.\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cdiv\u003e\n\t\t\t\u003cp\u003e“When you’re informed by those two basic facts, it guides a lot about both the kind of content you develop and the tone and flavor you give it,” explains Game Director Carrie Patel. “The flow of souls, the presence and existence of that energy, is key and core to life continuing in Eora in a way that will resonate with players who have been through \u003cem\u003ePillars of Eternity II: Deadfire. \u003c/em\u003eWe have a traditional pantheon in the world of Pillars, and you will get glimpses of some of these gods in \u003cem\u003eAvowed\u003c/em\u003e.”\u003c/p\u003e\t\t\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003cp\u003eThis all feeds into the various cultures you will encounter along the way — what’s important to them (like their gods) is what gives life to the game. The Aedyrans, for example, are a nation that heavily values the ideas of rightful rule, leadership, and order – and now they’re plopped into the greatest frontier of Eora. What would it look like as they start to try and blend in with the locals? It may be a small change in their outfit or adapting to how they choose to live. This “Wild West” attracts all sorts, and rigidity may not blend very well with what’s required to survive the Living Lands.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Someone who primarily reveres [the goddess] Woedica, values her emphasis on law, order, justice, and rightful rulership above other things. If you venerate Abydon, who is the Smith, it’s not that you don’t believe in the other gods, but you value that sense of industry, hard work, and dedication above other things. This allows us to imbue those factions and groups with certain ideals that are recognizable and help us clearly inform the player about what they’re about,” adds Patel.\u003c/p\u003e\n\n\n\n\u003cp\u003eI see this in the architecture and outfit design as well, and how the two feel intricately woven together. “This world has been an actual, living, breathing thing. It’s represented in the game, but it feels like it’s been like that in the development,” explains Lead Environment Artist Dennis Presnell. “It’s such an iterative process that as we go, and as our team members come up with new assets or clever ideas or storytelling, we all build upon that and stand on each other’s shoulders. All of it coalesces into something that has so much variety; a big, cohesive, authentic world.”\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\t\t\t\u003cp\u003e“With all our games, and certainly with the lore of Pillars, we want to make everything intentional,” explains Patel. “Dwarves don’t need to have Scottish accents just because they do in other fantasy settings, and elves don’t need to all speak with Received Pronunciation. It’s about stripping back those tropes. One example was the idea of mountain dwarves tending to be more itinerant. Traditional dwarven societies build impressive places but then scatter and move on due to resources, personal disagreements, or political rifts. This created an interesting opportunity for us in \u003cem\u003eAvowed\u003c/em\u003e to explore: What it would be like if one of these settlements stuck around. What would that culture be like? Why would those characters have made that decision, and what would that mean for the story?”\u003c/p\u003e\t\t\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003cp\u003eMuch like real-life isolated island locations, such as New Zealand, Australia, or Madagascar, these places can feel alien because they’ve evolved on their own timeline, without interference from the rest of the world and its ecosystem. That’s true for the Living Lands as well. You’ll see this manifest in dramatic environments, with metaphysical and spiritual reasons to account for these differences, with hints of evidence of past civilizations that remains a mystery, and that’s a fascinating aspect of \u003cem\u003eAvowed’s \u003c/em\u003eenvironments — the haunting mystery of the civilizations that came before.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Part of what made the Living Lands an appealing setting is the promise of having distinct environments and biomes, making you feel like you’re traversing a big, wild land,” explains Patel. “In the lore of Pillars, the Living Lands is described as a strange island where you see things you don’t see anywhere else. It’s carved up by mountains and valleys, allowing for distinct biomes and climate zones to exist in proximity to one another.”\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\t\t\t\u003cp\u003eAll the regions that players will explore in \u003cem\u003eAvowed\u003c/em\u003e are entirely new and very different aesthetically. We’ve never been to the Living Lands before in any prior Pillars of Eternity game or DLC, so it has been ripe for creation and creativity from the game design team. There’s this excitement that comes with that, this sense of a living world that you are a part of rather than a world built just for you, \u003ca href=\"https://news.xbox.com/en-us/2025/01/24/avowed-choose-your-own-adventure-incredible-freedom/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ewith player choice feeding into how you choose to explore this unique world\u003c/a\u003e, full of nooks and crannies of hidden adventures for players to find, it all makes the world feel so much more alive.\u003c/p\u003e\t\t\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003cp\u003e“We really wanted to build an authentic-feeling world,” explains Presnell. “Even if it’s not populated with NPCs or player characters, there’s a history there, and you’ve seen evidence of activity that makes it feel authentic. There’s so much to explore; there’s no way you’re going to see everything available in the first playthrough.”\u003c/p\u003e\n\n\n\n\u003cp\u003eSo far, we’ve seen big chunks of Dawnshore from our hands-on experience, as well as elements of the \u003ca href=\"https://news.xbox.com/en-us/podcast/xbox-games-showcase-deep-dive-avowed/\"\u003eEmerald Stair region on the Xbox Podcast last June\u003c/a\u003e, which is a very lush, but slightly gloomy region. \u003ca href=\"https://news.xbox.com/en-us/2024/01/22/avowed-developer-direct-side-quest-deep-dive/\"\u003eAnd we’ve seen glimpses of Shatterscarp in other gameplay footage\u003c/a\u003e, which is a high desert region. This is to illustrate that the Living Lands are going to be a wild, big place of both promise and danger, and it’s something that civilization is just starting to move into. That brings both good and bad — it’s a space of conflict and transition that will be very interesting to play in and feels like a natural evolution of what Obsidian has been doing from game to game in Pillars.\u003c/p\u003e\n\n\n\n\u003cp\u003e“We know that whether someone is returning from having played \u003cem\u003ePillars of Eternity\u003c/em\u003e, or they are entirely new to the IP, the setting of the Living Lands and the story of \u003cem\u003eAvowed\u003c/em\u003e will be new,” Patel explains. “As with any larger IP, you have this sense of connectedness with the larger world and timeline through current events and characters with experiences and perspectives. But you want to be careful that the bulk of your content is focused on the present story in this time and place. That’s where you draw the line between references and the core content that players are concerned with.”\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\t\t\t\u003cp\u003eHelping to get new players up to speed will be the in-game glossary tooltip system that lets you look up lore terms and the names of gods to help onboard you to these concepts without derailing the experience with too many explanations. As Patel notes to me, there’s been a lot of iteration and playtesting to hit that sweet spot. “We’ve done several hours of playtests through Microsoft’s user research department, focusing on clarity in mechanics, story, and player direction in the first few hours. \u003ca href=\"https://news.xbox.com/en-us/2024/11/21/player-choice-avowed-approach-to-combat/\"\u003eFrom the prologue level, which you played\u003c/a\u003e, to the early Dawnshore experience, we’ve made adjustments based on feedback and played through it again. We’ve probably spent more time adjusting and tweaking the prologue than anything else.”\u003c/p\u003e\t\t\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003cp\u003eThese environmental designs also have a purpose for your adventure beyond expanded lore and being stunning to look at. Early on, you are shown the various ways you can approach a situation while circumventing the environment by tapping into the power of a grimoire, setting fire to a blocked passageway. How you choose to interact with this game’s world will build upon the incredible immersion factor as you move through the Living Lands\u003cstrong\u003e.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e“We always want to give the player a few different ways to solve some of the problems ahead of them,” explains Patel. “For example, there are certain obstacles that might require fire to burn through. In combat, fire also does great damage over time. You can use it to ignite things like explosive barrels to do more damage. You could have a spell or an enchanted weapon that does fire damage. You may have Magran’s Fury, which are essentially little fire grenades you can find in the world that will do the same thing. You can also have (your companion) Kai use one of his special abilities outside of combat to burn through obstacles that require fire to continue traversing.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd it’s not just how magic allows you to interact with this world in tangible ways. It’s also how you choose to explore the world of Eora. As Presnell shares with me, lots of attention has been given to rewarding players who choose to veer outside of the main quests or the quick path.\u003c/p\u003e\n\n\n\n\u003cp\u003e“It’s something I personally love in games when developers take the time to populate and world-build off the beaten path,” explains Presnell. “I’ve always checked around corners and looked over and under things, and I was overjoyed when I saw the time and care put into detailing those parts. We do so much of that in this game. We really reward the player for exploring the world as much as possible. Our team is so good at telling amazing little stories for those detail-oriented enough to look for them and put the pieces together.”\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003cp\u003eObsidian’s work has always stood out to me as being some of the most immersive experiences in gaming. In the last few years, we’ve seen them invest in their craft like never before and build out these wholly original universes, like with \u003cem\u003ePillars of Eternity,\u003c/em\u003e \u003cem\u003ePentiment, Grounded\u003c/em\u003e, and \u003cem\u003eThe Outer Worlds\u003c/em\u003e. They’re cooking right now like they’ve never cooked before and we’re feasting on this bounty of gaming.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt feels like this is now coalescing around \u003cem\u003eAvowed\u003c/em\u003e, while Obsidian pushes themselves creatively to give us a new perspective to one of their most engaging and lore-rich worlds. Even though we’re on the cusp of being able to dive further into this new frontier of Eora, it still feels like they’re just getting started on telling even grander and more immersive stories than ever before. \u003cem\u003eAvowed \u003c/em\u003eis the next great chapter for Obsidian’s rich history, their next great frontier, and I’m all aboard. Giddy up!\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003e\u003ca href=\"https://www.xbox.com/games/avowed\"\u003eAvowed\u003c/a\u003e\u003c/strong\u003e is launching February 18, 2025, for Xbox Series X|S, the Xbox app for Windows PC, Battle.net, Steam, cloud, and will be available on day one with Game Pass. Players who purchase the game for either Xbox or Battle.net or have a Game Pass Ultimate or PC Game Pass membership can play on both Xbox and Battle.net by linking their Xbox and Battle.net accounts.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003e\u003ca href=\"https://www.xbox.com/games/avowed\"\u003eAvowed\u003c/a\u003e\u003c/strong\u003e is currently available for pre-order on the Xbox Store, Battle.net, and Steam. The Premium Edition offers up to five days early access, two premium skin packs, and access to the Avowed Digital Artbook \u0026amp; Soundtrack.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cdiv data-product-id=\"9nfhq2719j83\" id=\"msp1738866613742\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9nfhq2719j83\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.54988.13594600110987132.5376950b-9493-4428-9d55-8d6df3956a11.4c4f796b-ac3a-4272-af0d-2b7d861b2fb7?w=400\u0026amp;h=600\" alt=\"Avowed Premium Edition\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png\" alt=\"Xbox Play Anywhere\"/\u003e\n\t\t\t\t\t\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\t\u003ch2\u003eAvowed Premium Edition\u003c/h2\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tPremium Edition includes:  \n– Avowed base game  \n– Up to 5 days early access \n– Two Premium Skin Packs  \n– Access to Avowed Digital Artbook \u0026amp; Original Soundtrack \n\nWelcome to the Living Lands, a mysterious island filled with adventure and danger.\nSet in the fictional world of Eora that was first introduced to players in the Pillars of Eternity franchise, Avowed is a first-person fantasy action RPG from the award-winning team at Obsidian Entertainment. \nYou are the envoy of Aedyr, a distant land, sent to investigate rumors of a spreading plague throughout the Living Lands – an island full of mysteries and secrets, danger and adventure, and choices and consequences, and untamed wilderness. You discover a personal connection to the Living Lands and an ancient secret that threatens to destroy everything. Can you save this unknown frontier and your soul from the forces threatening to tear them asunder?\n\nThe Weird and Wonderful Living Lands\nThe Living Lands is a place that feels foreign yet somewhat intrinsic to you as it feels the island itself is calling out to you for help. Explore an island home to many different environments and landscapes, each with their own unique ecosystem.\n \nVisceral Combat to Play Your Way\nMix and match swords, spells, guns, and shields to fight your way. Dig into your grimoire for spells to trap, freeze or burn enemies, bash them with your shield, or use range bows to attack from a distance.\n \nCompanions as part of your journey\nCompanions from a spread of species will fight alongside you, with their own unique set of abilities. From a former mercenary to an eccentric wizard, they will be part of your journey with your choices shaping them as you help them with their quests.\t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cdiv data-product-id=\"9MSVPJCHHRPR\" id=\"msp1738866613742\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9MSVPJCHHRPR\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.63195.13820323619932134.5084b99b-fe55-4c94-bfca-21c13de340a9.c0c8b861-44c1-4a02-af47-73dad90e1322?w=400\u0026amp;h=600\" alt=\"Avowed Standard Edition\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://assets.onestore.ms/cdnfiles/sfw-service-web-onestore-onerf-2017-11-8-12/store/common/images/xpalogo_black.png\" alt=\"Xbox Play Anywhere\"/\u003e\n\t\t\t\t\t\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\t\u003ch2\u003eAvowed Standard Edition\u003c/h2\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tWelcome to the Living Lands, a mysterious island filled with adventure and danger.\nSet in the fictional world of Eora that was first introduced to players in the Pillars of Eternity franchise, Avowed is a first-person fantasy action RPG from the award-winning team at Obsidian Entertainment. \nYou are the envoy of Aedyr, a distant land, sent to investigate rumors of a spreading plague throughout the Living Lands – an island full of mysteries and secrets, danger and adventure, and choices and consequences, and untamed wilderness. You discover a personal connection to the Living Lands and an ancient secret that threatens to destroy everything. Can you save this unknown frontier and your soul from the forces threatening to tear them asunder?\n\nThe Weird and Wonderful Living Lands\nThe Living Lands is a place that feels foreign yet somewhat intrinsic to you as it feels the island itself is calling out to you for help. Explore an island home to many different environments and landscapes, each with their own unique ecosystem.\n \nVisceral Combat to Play Your Way\nMix and match swords, spells, guns, and shields to fight your way. Dig into your grimoire for spells to trap, freeze or burn enemies, bash them with your shield, or use range bows to attack from a distance.\n \nCompanions as part of your journey\nCompanions from a spread of species will fight alongside you, with their own unique set of abilities. From a former mercenary to an eccentric wizard, they will be part of your journey with your choices shaping them as you help them with their quests.\t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cdiv data-product-id=\"9n4h79fddwlc\" id=\"msp1738866613742\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9n4h79fddwlc\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.63769.13983244855702772.5e149439-f6b3-4bb6-9086-c593e65b9327.d0981893-fba4-4369-9707-ddf702229a92?w=400\u0026amp;h=600\" alt=\"Avowed Premium Upgrade Addon\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\u003ch2\u003eAvowed Premium Upgrade Addon\u003c/h2\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003eXbox Game Studios\u003c/p\u003e\n\t\t\n\t\u003cp\u003e\u003cspan\u003e\n\t\t\t\u003cspan\u003e$24.99\u003c/span\u003e\n\t\t\u003c/span\u003e\n\t\t\u003cspan\u003e$22.49\u003c/span\u003e\n\t\t\t\u003c/p\u003e\n\n\n\t\t\t\t\u003c/div\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tUpgrade* from Standard Edition and receive the following content:   \n– Up to 5 days early access \n– Premium Skin Packs: 2 sets of bonus skins for your companions \n– Access to Avowed Digital Artbook \u0026amp; Original Soundtrack  \n \n*Requires base game or Xbox Game Pass membership (PC or Ultimate only), all sold separately. \t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\n\n\n\u003chr/\u003e\n\n\u003c/div\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": "2025-02-07T16:00:00Z",
  "modifiedTime": "2025-02-07T15:00:17Z"
}
