{
  "id": "399691c9-0eb8-4772-b693-ce8300f01d2b",
  "title": "Sunless Sea studio Failbetter's Mandrake is a rural life sim with a folklore twist",
  "link": "https://www.eurogamer.net/sunless-sea-studio-failbetters-mandrake-is-a-rural-life-sim-with-a-folklore-twist",
  "description": "Sunless Sea and Mask of the Rose developer Failbetter Games has unveiled Mandrake, its very first project away from the Fallen London universe. It's a rural life sim set in a \"world of old, wild powers\" where horticulture is forbidden, and it'll eventually be making its way to PC. Read more",
  "author": "Matt Wales",
  "published": "Sun, 08 Jun 2025 21:55:36 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Summer of Gaming",
    "PC",
    "Life Simulation",
    "Mandrake",
    "Story Rich"
  ],
  "byline": "Matt Wales",
  "length": 2303,
  "excerpt": "Sunless Sea and Mask of the Rose developer Failbetter Games has unveiled Mandrake, its very first project away from the…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/10d755d6883c36c8018859c27159cee5/icon/apple-touch-icon-152x152.png",
  "text": "Image credit: Failbetter Games Sunless Sea and Mask of the Rose developer Failbetter Games has unveiled Mandrake, its very first project away from the Fallen London universe. It's a rural life sim set in a \"world of old, wild powers\" where horticulture is forbidden, and it'll eventually be making its way to PC. Taking inspiration from British history and folklore, Mandrake casts players as the last in a line of horticultural sorcerers - one who finally returns to their family's abandoned home in the 'small, complicated' village of Chandley after a long time away. Initially at least, Mandrake sounds like pretty familiar stuff. You'll tend to your garden, fish, forage, cook, and craft furniture to decorate your home; you'll venture into the woods, to the beach, to the mine in search of minerals, and into the community to befriend the locals, learning their stories and becoming intertwined with their lives. Mandrake || PC Gaming Show 2025 Announcement Trailer Mandrake announcement trailer.Watch on YouTube But Failbetter's announcement hints at something a little darker and more mysterious around Mandrake's periphery, and it's here the studio's knack for the peculiar starts to peek through. Soon, for instance, you'll be trading turnips and runner beans for stranger, more intriguing seeds; you can befriend a river, eavesdrop on the dead, drink with a god who lives in your chimney, and spend a haunted night at the Butcher's Oak. The eccentric locals, meanwhile, include a hunter who makes pacts with the woods, and a girl saved from the sea, who still hears voices calling to her from beneath the waves. Chandley is home to spirits and other strange creatures too, including the long-armed Granny Jakes who lives in a hidden orchard, and Hroame, \"sometimes stone and sometimes not\". But not everything is friendly. \"Don't go out after dark,\" Failbetter warns, \"the night is not for you.\" Mandrake doesn't have a release date yet, but Failbetter says that due to its complexity and \"some very unusual features\" it'll be seeking player feedback as the game continues its journey toward launch. To that end, it expects to run a number of playtests prior to Mandrake's release, so curious sorts should considering wishlisting it on Steam.",
  "image": "https://assetsio.gnwcdn.com/mandrake.jpeg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/mandrake.jpeg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/mandrake.jpeg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/mandrake.jpeg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Mandrake screenshot showing its caped protagonist traversing a painterly landscape as they head toward the dark opening of an abandoned mine.\" data-src-full=\"https://assetsio.gnwcdn.com/mandrake.jpeg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eFailbetter Games\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\n\u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/sunless-sea\"\u003eSunless Sea\u003c/a\u003e and Mask of the Rose developer Failbetter Games has unveiled Mandrake, its very first project away from the \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/fallen-london\"\u003eFallen London\u003c/a\u003e universe. It\u0026#39;s a rural life sim set in a \u0026#34;world of old, wild powers\u0026#34; where horticulture is forbidden, and it\u0026#39;ll eventually be making its way to PC.\n\u003c/p\u003e\n\u003cp\u003e\nTaking inspiration from British history and folklore, Mandrake casts players as the last in a line of horticultural sorcerers - one who finally returns to their family\u0026#39;s abandoned home in the \u0026#39;small, complicated\u0026#39; village of Chandley after a long time away. \n\u003c/p\u003e\n\u003cp\u003e\nInitially at least, Mandrake sounds like pretty familiar stuff. You\u0026#39;ll tend to your garden, fish, forage, cook, and craft furniture to decorate your home; you\u0026#39;ll venture into the woods, to the beach, to the mine in search of minerals, and into the community to befriend the locals, learning their stories and becoming intertwined with their lives.\n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Mandrake || PC Gaming Show 2025 Announcement Trailer\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/XzN0BNiX5E0?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/XzN0BNiX5E0/hqdefault.jpg\"/\u003e\u003cspan\u003eMandrake || PC Gaming Show 2025 Announcement Trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/XzN0BNiX5E0?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/XzN0BNiX5E0?autoplay=1\" title=\"Mandrake || PC Gaming Show 2025 Announcement Trailer\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eMandrake announcement trailer.\u003ca href=\"https://www.youtube.com/watch?v=XzN0BNiX5E0\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\nBut Failbetter\u0026#39;s announcement hints at something a little darker and more mysterious around Mandrake\u0026#39;s periphery, and it\u0026#39;s here the studio\u0026#39;s knack for the peculiar starts to peek through. Soon, for instance, you\u0026#39;ll be trading turnips and runner beans for stranger, more intriguing seeds; you can befriend a river, eavesdrop on the dead, drink with a god who lives in your chimney, and spend a haunted night at the Butcher\u0026#39;s Oak.\n\u003c/p\u003e\n\u003cp\u003e\nThe eccentric locals, meanwhile, include a hunter who makes pacts with the woods, and a girl saved from the sea, who still hears voices calling to her from beneath the waves. Chandley is home to spirits and other strange creatures too, including the long-armed Granny Jakes who lives in a hidden orchard, and Hroame, \u0026#34;sometimes stone and sometimes not\u0026#34;. But not everything is friendly. \u0026#34;Don\u0026#39;t go out after dark,\u0026#34; Failbetter warns, \u0026#34;the night is not for you.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nMandrake doesn\u0026#39;t have a release date yet, but Failbetter says that due to its complexity and \u0026#34;some very unusual features\u0026#34; it\u0026#39;ll be seeking player feedback as the game continues its journey toward launch. To that end, it expects to run a number of playtests prior to Mandrake\u0026#39;s release, so curious sorts should \u003ca href=\"https://store.steampowered.com/app/3710210/Mandrake/\"\u003econsidering wishlisting it on Steam\u003c/a\u003e.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-08T21:55:36.775734Z",
  "modifiedTime": null
}
