{
  "id": "3b0dd52f-c375-432e-aa12-43832199925a",
  "title": "Riot Games opens the door to betting sponsorships in professional League of Legends and Valorant",
  "link": "https://www.eurogamer.net/riot-games-opens-the-door-to-betting-sponsorships-in-professional-league-of-legends-and-valorant",
  "description": "Betting sponsorships are being introduced into tier one Valorant and League of Legends esports, Riot Games has revealed. Read more",
  "author": "Connor Makar",
  "published": "Fri, 27 Jun 2025 12:55:20 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Bird view / Isometric",
    "Garena",
    "MOBA",
    "Riot Games",
    "Single Player",
    "PC",
    "Shooter",
    "RPG",
    "Valorant",
    "League of Legends",
    "First person",
    "Multiplayer Competitive",
    "Strategy",
    "Multiplayer Cooperative"
  ],
  "byline": "Connor Makar",
  "length": 6066,
  "excerpt": "Riot Games opens the door to gambling sponsorships in professional League of Legends and Valorant",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/18fa95f6c5c7c798abcf185fa1057ba8/icon/apple-touch-icon-152x152.png",
  "text": "Quite the gamble, but here's why it's happening. Image credit: Riot Betting sponsorships are being introduced into tier one Valorant and League of Legends esports, Riot Games has revealed. This announcement came in the form of a lengthy post by John Needham, head of publishing and esports at Riot Games. In it, Needham justifies the inclusion of sports betting as part of the company's desire to build \"a sustainable ecosystem\" for its games. Needham said this is something professional teams \"have been asking us to consider for years\". Gambling sponsors will be permitted across the Americas and EMEA regions, with no stated plans to permit these sorts of sponsorships among other regions around the world. Hall of Legends: Uzi Riot Games is promoting esports heavily in League of Legends right now, focused on pro player Uzi.Watch on YouTube Needham goes on to explain: \"We know sports betting isn't for everyone, and that some fans have strong feelings about it, and we respect that. However, the reality is that betting activity already exists around our sports and will continue whether we engage with it or not.\" He continued: \"Historically, this has been a restricted sponsorship category, and Riot has not engaged with betting companies. Teams have asked us to reconsider our stance, and after years of analysis to ensure we got it right, we agreed it was time to open up this category to create more revenue opportunities for teams.\" Needham goes on to explain that, according to sports technology company Sportradar, total betting turnover in just League of Legends esports exceeded $10.7bn, with 70 percent of those bets taking place on unregulated sites via unlicensed bookmakers. As such, it is Riot's position from here on out that if betting is going to happen, it may as well happen under its watch. Needham also established three \"guardrails\" for its new sports betting partnership program. These include opening up sponsorship opportunities with betting brands to generate revenue, supporting the development of regulations and education programs around esports betting, and strengthening competitive integrity around Riot's esports events. If you can believe it, this sort of event is expensive. | Image credit: Riot Games/ Lol Esports It's worth noting that recently the tier two Valorant scene was in the midst of a serious competitive integrity scandal, as Sean Gares, general manager of esports team Shopify Rebels, released a video exposing the prevalence of match-fixing and the intentional throwing of games. In the post Needham then stated Riot would be vetting all betting partners, mandate team integrity checks, and that it would use the proceeds of these betting partnerships to maintain its tier two competitive scene. That tier two scene being an aspect of the wider Riot esports space that has struggled immensely with financial stability. Finally, Needham assured the public that no Riot-owned broadcasts would feature advertisements for betting companies. A nice stance, though it's worth noting that according to a report by esports charts, 40 percent of English speaking viewership for Worlds (the biggest annual event for League of Legends) come from co-streams. These aren't Riot-owned, and judging by Needham's statement won't be barred from taking betting sponsorships. many esports watchers spectate events with streamers like this, rather than directly. | Image credit: Twitch / Caedrel Okay, so why is this happening? Well, as you may or may not know, esports has largely been a hole in which you burn money in. It has historically struggled with generating profit. It has long been true that esports has been sold as a way to reach a younger audience to plenty of massive companies, many of them have since pulled back from the industry following the collapse of the Overwatch League. Add on top of this an increase in expansion and investment during Covid when interest in gaming was incredibly high. This growth did not continue as expected, leading to a real financial crisis for the esports sector with layoffs hitting the sector in the years following. If you've been paying attention to the ongoing game development layoffs these past years, it's a similar thing. But it's actually worse. The problem is that throughout all these years esports teams have either failed to, or ignored the need to, use the money they had to create a stable income revenue. If you release a game, you can sell the game itself or microtransactions. If you own an esports team, you sell… T-shirts? All the games are streamed online for free, you don't have the equivalent of a football stadium. It's dire. As such esports teams have essentially spent the last few years hopping from one wallet to another, looking for capital to stay afloat. With the speculative investors walking out the door, they've turned to the Saudi Arabian government and its Esports World Cup in recent years. Saudi Arabia, a country with an ongoing history of human rights abuses, also happens to have a lot of money, and is keen on spending it on PR to make the country look appealing. This is called Sportswashing: it's prevalent in football, F1, and yes, video games. But even this isn't sustainable. Saudi Arabia could twist the money faucet off any time it wants to, and given the country will be hosting the video game olympics starting in 2027, maybe the need to throw away so much money will lessen. So esports teams need another source of income: gambling. As you can see yourself in Needham's statement, it repeatedly mentions the push from the teams themselves to implement betting sponsors into the ecosystem. Ultimately, regardless of all the guardrails Riot Games may implement, it's a bummer. Sports betting is addictive. It has and will ruin lives. A UK government report cites two quantitative studies that found deaths from suicide were \"significantly higher among adults with gambling disorder or problems compared to the general adult population.\"",
  "image": "https://assetsio.gnwcdn.com/valorant-tips-tricks-7031-1591368969133.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n        \n\n        \u003cp\u003eQuite the gamble, but here\u0026#39;s why it\u0026#39;s happening.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/valorant-tips-tricks-7031-1591368969133.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/valorant-tips-tricks-7031-1591368969133.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/valorant-tips-tricks-7031-1591368969133.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Valorant artwork showing multiple player characters posing against a red background\" data-src-full=\"https://assetsio.gnwcdn.com/valorant-tips-tricks-7031-1591368969133.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"387\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eRiot\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eBetting sponsorships are being introduced into tier one Valorant and \u003ca href=\"https://www.eurogamer.net/games/league-of-legends\"\u003eLeague of Legends\u003c/a\u003e esports, Riot Games has revealed.\u003c/p\u003e\n\u003cp\u003eThis announcement \u003ca href=\"https://x.com/riotgames/status/1938282007148253261\"\u003ecame in the form of a lengthy post by John Needham\u003c/a\u003e, head of publishing and esports at Riot Games. In it, Needham justifies the inclusion of sports betting as part of the company\u0026#39;s desire to build \u0026#34;a sustainable ecosystem\u0026#34; for its games.\u003c/p\u003e\n\u003cp\u003eNeedham said this is something professional teams \u0026#34;have been asking us to consider for years\u0026#34;. Gambling sponsors will be permitted across the Americas and EMEA regions, with no stated plans to permit these sorts of sponsorships among other regions around the world.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Hall of Legends: Uzi\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/LwYOQl1vptg?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/LwYOQl1vptg/hqdefault.jpg\"/\u003e\u003cspan\u003eHall of Legends: Uzi\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/LwYOQl1vptg?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/LwYOQl1vptg?autoplay=1\" title=\"Hall of Legends: Uzi\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eRiot Games is promoting esports heavily in League of Legends right now, focused on pro player Uzi.\u003ca href=\"https://www.youtube.com/watch?v=LwYOQl1vptg\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eNeedham goes on to explain: \u0026#34;We know sports betting isn\u0026#39;t for everyone, and that some fans have strong feelings about it, and we respect that. However, the reality is that betting activity already exists around our sports and will continue whether we engage with it or not.\u0026#34;\u003c/p\u003e\n\u003cp\u003eHe continued: \u0026#34;Historically, this has been a restricted sponsorship category, and Riot has not engaged with betting companies. Teams have asked us to reconsider our stance, and after years of analysis to ensure we got it right, we agreed it was time to open up this category to create more revenue opportunities for teams.\u0026#34;\u003c/p\u003e\n\u003cp\u003eNeedham goes on to explain that, according to sports technology company Sportradar, total betting turnover in just League of Legends esports exceeded $10.7bn, with 70 percent of those bets taking place on unregulated sites via unlicensed bookmakers. As such, it is Riot\u0026#39;s position from here on out that if betting is going to happen, it may as well happen under its watch.\u003c/p\u003e\n\u003cp\u003eNeedham also established three \u0026#34;guardrails\u0026#34; for its new sports betting partnership program. These include opening up sponsorship opportunities with betting brands to generate revenue, supporting the development of regulations and education programs around esports betting, and strengthening competitive integrity around Riot\u0026#39;s esports events.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cimg alt=\"League of Legends esports arena photo\" data-src-full=\"https://assetsio.gnwcdn.com/league-of-legends-esports-photo.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/league-of-legends-esports-photo.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/league-of-legends-esports-photo.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/league-of-legends-esports-photo.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e\n\u003cfigcaption\u003eIf you can believe it, this sort of event is expensive. | \u003cspan\u003eImage credit: \u003ccite\u003eRiot Games/ Lol Esports\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eIt\u0026#39;s worth noting that recently the tier two Valorant scene was in the midst of a serious competitive integrity scandal, as Sean Gares, general manager of esports team Shopify Rebels, \u003ca href=\"https://www.youtube.com/watch?v=Q-hHuBN27Nk\u0026amp;t=2s\u0026amp;ab_channel=seangares\"\u003ereleased a video exposing \u003c/a\u003ethe prevalence of match-fixing and the intentional throwing of games.\u003c/p\u003e\n\u003cp\u003eIn the post Needham then stated Riot would be vetting all betting partners, mandate team integrity checks, and that it would use the proceeds of these betting partnerships to maintain its tier two competitive scene. That tier two scene being an aspect of the wider Riot esports space that has struggled immensely with \u003ca href=\"https://www.polygon.com/23619393/disguised-toast-twitch-streamer-valorant-dsg\"\u003efinancial stability\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFinally, Needham assured the public that no Riot-owned broadcasts would feature advertisements for betting companies. A nice stance, though it\u0026#39;s worth noting that \u003ca href=\"https://escharts.com/news/top-casters-viewership-results-worlds-2024\"\u003eaccording to a report by esports charts\u003c/a\u003e, 40 percent of English speaking viewership for Worlds (the biggest annual event for League of Legends) come from co-streams. These aren\u0026#39;t Riot-owned, and judging by Needham\u0026#39;s statement won\u0026#39;t be barred from taking betting sponsorships.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cimg alt=\"League of Legends streamer Caedrel\" data-src-full=\"https://assetsio.gnwcdn.com/league-of-legends-streamer-caedral.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/league-of-legends-streamer-caedral.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/league-of-legends-streamer-caedral.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/league-of-legends-streamer-caedral.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e\n\u003cfigcaption\u003emany esports watchers spectate events with streamers like this, rather than directly. | \u003cspan\u003eImage credit: \u003ccite\u003eTwitch / Caedrel\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eOkay, so why is this happening? Well, as you may or may not know, esports has largely been a hole in which you burn money in. It has historically struggled with generating profit. It has long been true that esports has been sold as a way to reach a younger audience to plenty of massive companies, many of them have since pulled back from the industry \u003ca href=\"https://digiday.com/media/how-the-worlds-most-ambitious-esports-league-shrank-to-nothing-an-oral-history-of-the-overwatch-league/\"\u003efollowing the collapse of the Overwatch League\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAdd on top of this an increase in expansion and investment during Covid when interest in gaming was incredibly high. This growth did not continue as expected, leading to a real financial crisis for the esports sector \u003ca href=\"https://esportsinsider.com/2024/03/esports-layoff-tracker-2024\"\u003ewith layoffs hitting the sector in the years \u003c/a\u003efollowing. If you\u0026#39;ve been paying attention to the \u003ca href=\"https://www.eurogamer.net/what-is-going-on-with-the-video-games-industry\"\u003eongoing game development layoffs these past years\u003c/a\u003e, it\u0026#39;s a similar thing.\u003c/p\u003e\n\u003cp\u003eBut it\u0026#39;s actually worse. The problem is that throughout all these years esports teams have either failed to, or ignored the need to, use the money they had to create a stable income revenue. If you release a game, you can sell the game itself or microtransactions. If you own an esports team, you sell… T-shirts? All the games are streamed online for free, you don\u0026#39;t have the equivalent of a football stadium. It\u0026#39;s dire.\u003c/p\u003e\n\u003cp\u003eAs such esports teams have essentially spent the last few years hopping from one wallet to another, looking for capital to stay afloat. With the speculative investors walking out the door, they\u0026#39;ve turned to the Saudi Arabian government and its Esports World Cup in recent years. Saudi Arabia, a country with \u003ca href=\"https://www.amnesty.org/en/location/middle-east-and-north-africa/middle-east/saudi-arabia/report-saudi-arabia/\"\u003ean ongoing history of human rights abuses\u003c/a\u003e, also happens to have a lot of money, and is keen on spending it on PR to make the country look appealing. This is called Sportswashing: it\u0026#39;s prevalent in football, F1, and yes, video games.\u003c/p\u003e\n\u003cp\u003eBut even this isn\u0026#39;t sustainable. Saudi Arabia could twist the money faucet off any time it wants to, and given the country will be \u003ca href=\"https://www.olympics.com/ioc/news/inaugural-olympic-esports-games-to-be-held-in-riyadh-in-2027-road-to-the-games-to-start-this-year\"\u003ehosting the video game olympics starting in 2027\u003c/a\u003e, maybe the need to throw away so much money will lessen.\u003c/p\u003e\n\u003cp\u003eSo esports teams need another source of income: gambling. As you can see yourself in Needham\u0026#39;s statement, it repeatedly mentions the push from the teams themselves to implement betting sponsors into the ecosystem.\u003c/p\u003e\n\u003cp\u003eUltimately, regardless of all the guardrails Riot Games may implement, it\u0026#39;s a bummer. \u003ca href=\"https://www.gov.uk/government/publications/gambling-related-harms-evidence-review/gambling-related-harms-evidence-review-summary--2\"\u003eSports betting is addictive\u003c/a\u003e. It has and will ruin lives. A UK government report cites two quantitative studies that found deaths from suicide were \u0026#34;significantly higher among adults with gambling disorder or problems compared to the general adult population.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-06-27T12:55:20.134796Z",
  "modifiedTime": null
}
