{
  "id": "3fe2907b-f152-440a-b9e2-9e38d5d099a8",
  "title": "Makeup and Beauty Blog Monday Poll, Vol. 867",
  "link": "https://makeupandbeautyblog.com/just-for-fun/makeup-and-beauty-blog-monday-poll-vol-867/",
  "description": "So…what is the Monday Poll? Excellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years (since 2007). 1. What would you rather do on a rainy day: go to the movies with a friend, cozy up at home with a good book and a cup of tea, or go on an adventurous and fun (and very wet) hike? Right now movies with a friend sounds like it would be fun! Of course we’d have to have all the snacks – popcorn, M\u0026Ms and bubbly water. 2. What game show would you absolutely dominate: Wheel of Fortune, Jeopardy or The Price Is Right? I’d have the best chances at The Price Is Right. Can’t say I’d dominate it, though. Hahaha! 3. Do you wear more makeup now or less makeup than you did a year ago? I wear a little less these days, but that’s mostly[Continue reading...] The post Makeup and Beauty Blog Monday Poll, Vol. 867 appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
  "author": "Karen",
  "published": "Tue, 04 Feb 2025 01:27:53 +0000",
  "source": "https://www.makeupandbeautyblog.com/feed/",
  "categories": [
    "Just For Fun"
  ],
  "byline": "Karen",
  "length": 2142,
  "excerpt": "So...what is the Monday Poll? Excellent question! It isn't, contrary to its name, an actual poll, like with little clicky buttons. It's just a list of",
  "siteName": "Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup",
  "favicon": "https://www.makeupandbeautyblog.com/wp-content/uploads/2013/08/favicon.png",
  "text": "So…what is the Monday Poll? Excellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years (since 2007). 1. What would you rather do on a rainy day: go to the movies with a friend, cozy up at home with a good book and a cup of tea, or go on an adventurous and fun (and very wet) hike? Right now movies with a friend sounds like it would be fun! Of course we’d have to have all the snacks – popcorn, M\u0026Ms and bubbly water. 2. What game show would you absolutely dominate: Wheel of Fortune, Jeopardy or The Price Is Right? I’d have the best chances at The Price Is Right. Can’t say I’d dominate it, though. Hahaha! 3. Do you wear more makeup now or less makeup than you did a year ago? I wear a little less these days, but that’s mostly because of time constraints. I miss having a good 15 or 20 minutes to paint my face. Now I just kinda slap it on and hope for the best. 4. How’s your mental health these days? I feel steadier than I’ve felt in a while, and I think I’m finally reaching the point where I can push myself to do a little more. Last year really kicked my butt (long story short, I had a health scare, and now things are better), and it’s been taking a long time to recover from living with that fear for over a year. 5. ‘80s colorful mascara or ‘80s style bold blush? Um, both? They’re both so fun. I obvs wouldn’t rock it to work. Well, maybe I would. 🙂 Your friendly neighborhood beauty addict, Karen P.S. Here are the questions to copy/paste with your answers in a comment. Talk to ya soon. 1. What would you rather do on a rainy day: go to the movies with a friend, cozy up at home with a good book and a cup of tea, or go on an adventurous and fun (and very wet) hike? 2. What game show would you absolutely dominate: Wheel of Fortune, Jeopardy or The Price Is Right? 3. Do you wear more makeup now or less makeup than you did a year ago? 4. How’s your mental health these days? 5. ‘80s colorful mascara or ‘80s style bold blush? Reader Interactions",
  "image": "https://makeupandbeautyblog.com/wp-content/uploads/2024/01/happy-monday-fabulous-week-ahead.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"genesis-content\"\u003e\u003carticle aria-label=\"Makeup and Beauty Blog Monday Poll, Vol. 867\"\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://makeupandbeautyblog.com/wp-content/uploads/2024/01/happy-monday-fabulous-week-ahead.jpg\" alt=\"\" width=\"1080\" height=\"1080\" srcset=\"https://makeupandbeautyblog.com/wp-content/uploads/2024/01/happy-monday-fabulous-week-ahead.jpg 1080w, https://makeupandbeautyblog.com/wp-content/uploads/2024/01/happy-monday-fabulous-week-ahead-610x610.jpg 610w, https://makeupandbeautyblog.com/wp-content/uploads/2024/01/happy-monday-fabulous-week-ahead-1000x1000.jpg 1000w, https://makeupandbeautyblog.com/wp-content/uploads/2024/01/happy-monday-fabulous-week-ahead-150x150.jpg 150w, https://makeupandbeautyblog.com/wp-content/uploads/2024/01/happy-monday-fabulous-week-ahead-768x768.jpg 768w, https://makeupandbeautyblog.com/wp-content/uploads/2024/01/happy-monday-fabulous-week-ahead-75x75.jpg 75w, https://makeupandbeautyblog.com/wp-content/uploads/2024/01/happy-monday-fabulous-week-ahead-600x600.jpg 600w\" sizes=\"(max-width: 1080px) 100vw, 1080px\"/\u003e\u003c/p\u003e\n\u003cblockquote\u003e\n\u003ch2\u003eSo…what is the Monday Poll?\u003c/h2\u003e\n\u003cp\u003eExcellent question! It isn’t, contrary to its name, an actual poll, like with little clicky buttons. It’s just a list of more or less random questions I’ve been posting on this blog every Monday morning for the past quadrillion years \u003cstrong\u003e(since 2007)\u003c/strong\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n\u003ch3\u003e1. What would you rather do on a rainy day: go to the movies with a friend, cozy up at home with a good book and a cup of tea, or go on an adventurous and fun (and very wet) hike?\u003c/h3\u003e\n\u003cp\u003eRight now movies with a friend sounds like it would be fun! Of course we’d have to have all the snacks – popcorn, M\u0026amp;Ms and bubbly water.\u003c/p\u003e\n\u003ch3\u003e2. What game show would you absolutely dominate: Wheel of Fortune, Jeopardy or The Price Is Right?\u003c/h3\u003e\n\u003cp\u003eI’d have the best chances at The Price Is Right. Can’t say I’d dominate it, though. Hahaha!\u003c/p\u003e\n\u003ch3\u003e3. Do you wear more makeup now or less makeup than you did a year ago?\u003c/h3\u003e\n\u003cp\u003eI wear a little less these days, but that’s mostly because of time constraints. I miss having a good 15 or 20 minutes to paint my face. Now I just kinda slap it on and hope for the best.\u003c/p\u003e\n\u003ch3\u003e4. How’s your mental health these days?\u003c/h3\u003e\n\u003cp\u003eI feel steadier than I’ve felt in a while, and I think I’m finally reaching the point where I can push myself to do a little more. Last year really kicked my butt (long story short, I had a health scare, and now things are better), and it’s been taking a long time to recover from living with that fear for over a year. \u003c/p\u003e\n\u003ch3\u003e5. ‘80s colorful mascara or ‘80s style bold blush?\u003c/h3\u003e\n\u003cp\u003eUm, both? They’re both so fun. I obvs wouldn’t rock it to work. Well, maybe I would. 🙂 \u003c/p\u003e\n\u003cp\u003eYour friendly neighborhood beauty addict,\u003c/p\u003e\n\u003cp\u003eKaren\u003c/p\u003e\n\u003cp\u003eP.S. Here are the questions to copy/paste with your answers in a comment. Talk to ya soon.\u003c/p\u003e\n\u003cp\u003e1. What would you rather do on a rainy day: go to the movies with a friend, cozy up at home with a good book and a cup of tea, or go on an adventurous and fun (and very wet) hike?\u003cbr/\u003e\n2. What game show would you absolutely dominate: Wheel of Fortune, Jeopardy or The Price Is Right?\u003cbr/\u003e\n3. Do you wear more makeup now or less makeup than you did a year ago?\u003cbr/\u003e\n4. How’s your mental health these days?\u003cbr/\u003e\n5.  ‘80s colorful mascara or ‘80s style bold blush?\u003c/p\u003e\n\u003c/div\u003e\u003c/article\u003e\u003ch2\u003eReader Interactions\u003c/h2\u003e\t\n\t\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-04T01:27:53Z",
  "modifiedTime": null
}
