{
  "id": "454f7c1b-a41b-4799-b126-f11e5ca1f7ef",
  "title": "90s platformer remaster Croc: Legend of the Gobbos delayed into next year",
  "link": "https://www.eurogamer.net/90s-platformer-remaster-croc-legend-of-the-gobbos-has-been-delayed-into-next-year",
  "description": "If you'd been hoping to round out your 2024 with a solid blast of 90s nostalgia, there's some bad news; Argonaut Games' Croc: Legend of the Gobbos remaster - previously scheduled to release this month - has been delayed into \"Q1\" next year. Read more",
  "author": "Matt Wales",
  "published": "Sat, 07 Dec 2024 00:03:47 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "PS5",
    "Xbox Series X/S",
    "Croc: Legend of the Gobbos",
    "Platformer",
    "Xbox One",
    "PC",
    "PS4",
    "Nintendo Switch"
  ],
  "byline": "Matt Wales",
  "length": 2597,
  "excerpt": "If you'd been hoping to round out your 2024 with a solid blast of 90s nostalgia, there's some bad news; Argonaut Games'…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/609ee396ed39924618f01d5c0c94ea2d/icon/apple-touch-icon-152x152.png",
  "text": "Image credit: Argonaut Games If you'd been hoping to round out your 2024 with a solid blast of 90s nostalgia, there's some bad news; Argonaut Games' Croc: Legend of the Gobbos remaster - previously scheduled to release this month - has been delayed into \"Q1\" next year. Croc: Legend of the Gobbos initially launched for PlayStation 1 some 27 years ago, taking players - in the role of the titular reptile - on a platforming adventure through Gobbo Valley in a bid to free their friends from the evil magician Baron Dante. Argonaut announced it was resurrecting its beloved 1997 3D platformer back in August - news that was doubly surprisingly given that Argonaut itself hadn't existed since it closed amid financial troubles in 2004. However, the studio has itself now risen from the ashes of the past as a \"boutique publisher\" under the watch of new co-CEOs Gary Sheinwald and Mike Arkin. Croc Legend of the Gobbos Physical Edition Trailer Croc Legend of the Gobbos trailer.Watch on YouTube The revived company's Croc: Legend of the Gobbos remaster was originally due to launch for PlayStation 5, PS4, Xbox Series X/S, Xbox One, Switch, and PC (via GOG) this month, but Argonaut has now pushed its release back into early 2025 in order to \"add the final touches to ensure the game meets the high standards that we aspire to and which you deserve.\" \"We understand that after 27 years of waiting, this news might be a little disappointing,\" it continued, \"especially with the festive season coming soon. However, our goal has always been to deliver a game with the quality and polish that will truly delight. We appreciate your patience and support as we work to bring Croc back in the best possible way.\" Argonaut's Croc: Legend of the Gobbos spruce-up promises enhanced high-definition graphics, updated modern control mechanics, and a \"nostalgic, fun, and authentic gameplay experience\". It'll also include the Crocipedia, a \"curated digital museum\" incorporating the likes of game design documents, concept art, animation tests, and team member interviews. When Croc: Legend of the Gobbos eventually shows up next year, its digital edition - available on all platforms - will cost $29.99 USD, while a PS5 and Switch physical edition is priced at $39.99. But if you're absolutely wild with nostalgia, a $129.99 Collector's Edition is also available, packing in the remaster, a full-colour manual, a four-disc soundtrack featuring over 100 tunes, a key chain, sticker sheet, poster, premium box, and eight-inch resin Croc statue.",
  "image": "https://assetsio.gnwcdn.com/Croc-Legend-of-the-Gobbos-crop.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/Croc-Legend-of-the-Gobbos-crop.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/Croc-Legend-of-the-Gobbos-crop.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Croc-Legend-of-the-Gobbos-crop.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Croc-Legend-of-the-Gobbos-crop.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A Croc: Legend of the Gobbos remaster screenshot showing the cartoon crocodile navigating rocky platforms surrounded by lava.\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eArgonaut Games\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nIf you\u0026#39;d been hoping to round out your 2024 with a solid blast of 90s nostalgia, there\u0026#39;s some bad news; Argonaut Games\u0026#39; Croc: Legend of the Gobbos remaster - previously scheduled to release this month - has been delayed into \u0026#34;Q1\u0026#34; next year.\n\u003c/p\u003e\n\u003cp\u003e\nCroc: Legend of the Gobbos initially launched for PlayStation 1 some 27 years ago, taking players - in the role of the titular reptile - on a platforming adventure through Gobbo Valley in a bid to free their friends from the evil magician Baron Dante.\n\u003c/p\u003e\n\u003cp\u003e\nArgonaut \u003ca href=\"https://www.eurogamer.net/90s-platformer-croc-legend-of-the-gobbos-is-being-remastered-by-resurrected-argonaut-games\"\u003eannounced it was resurrecting its beloved 1997 3D platformer back in August\u003c/a\u003e - news that was doubly surprisingly given that Argonaut itself hadn\u0026#39;t existed since it closed amid financial troubles in 2004. However, the studio has itself now risen from the ashes of the past as a \u0026#34;boutique publisher\u0026#34; under the watch of new co-CEOs Gary Sheinwald and Mike Arkin.\n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Croc Legend of the Gobbos Physical Edition Trailer\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/KW81v0PDA3w?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/KW81v0PDA3w/hqdefault.jpg\"/\u003e\u003cspan\u003eCroc Legend of the Gobbos Physical Edition Trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/KW81v0PDA3w?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/KW81v0PDA3w?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eCroc Legend of the Gobbos trailer.\u003ca href=\"https://www.youtube.com/watch?v=KW81v0PDA3w\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\nThe revived company\u0026#39;s Croc: Legend of the Gobbos remaster was originally due to launch for PlayStation 5, PS4, Xbox Series X/S, Xbox One, Switch, and PC (via GOG) this month, but Argonaut has now pushed its release back into early 2025 in order to \u0026#34;add the final touches to ensure the game meets the high standards that we aspire to and which you deserve.\u0026#34;\n\u003c/p\u003e\u003cp\u003e\n\u0026#34;We understand that after 27 years of waiting, this news might be a little disappointing,\u0026#34; it continued, \u0026#34;especially with the festive season coming soon. However, our goal has always been to deliver a game with the quality and polish that will truly delight. We appreciate your patience and support as we work to bring Croc back in the best possible way.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nArgonaut\u0026#39;s Croc: Legend of the Gobbos spruce-up promises enhanced high-definition graphics, updated modern control mechanics, and a \u0026#34;nostalgic, fun, and authentic gameplay experience\u0026#34;. It\u0026#39;ll also include the Crocipedia, a \u0026#34;curated digital museum\u0026#34; incorporating the likes of game design documents, concept art, animation tests, and team member interviews.\n\u003c/p\u003e\n\u003cp\u003e\nWhen Croc: Legend of the Gobbos eventually shows up next year, its digital edition - available on all platforms - will cost $29.99 USD, while a PS5 and Switch physical edition is priced at $39.99. But if you\u0026#39;re absolutely wild with nostalgia, a $129.99 Collector\u0026#39;s Edition is also available, packing in the remaster, a full-colour manual, a four-disc soundtrack featuring over 100 tunes, a key chain, sticker sheet, poster, premium box, and eight-inch resin Croc statue. \n \n\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-07T00:03:47.324764Z",
  "modifiedTime": null
}
