{
  "id": "471499dd-50a8-494d-a072-7e816a526a0c",
  "title": "What's on your bookshelf?: Dragon Age veteran Mark Darrah",
  "link": "https://www.rockpapershotgun.com/whats-on-your-bookshelf-dragon-age-veteran-mark-darrah",
  "description": "Hello reader who is also a reader, and welcome back to Booked For The Week - our regular Sunday chat with a selection of cool industry folks about books! Most of us know about the novel, the novella, and the rare novito, but did you know that Penguin briefly tried to market the ‘big nov’ - single sentences of much larger works, bizarrely serialised into hardbacks weighty enough to club the equally rare giga-seal? Some things are best left forgotten, but not Dragon Age! It’s Dragon Age month, and here’s Dragon Age veteran and good YouTuber, Mark Darrah! Cheers Mark! Mind if we have a nose at your bookshelf? Read more",
  "author": "Nic Reuben",
  "published": "Sun, 27 Oct 2024 16:00:00 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Booked For The Week",
    "Blockbuster"
  ],
  "byline": "Nic Reuben",
  "length": 2529,
  "excerpt": "Dragon Age's Mark Darrah tells us about the books they love, have loved, and are hoping to love in the future.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/90347b9b4695dd653aeafc639396a939/icon/apple-touch-icon.png",
  "text": "Image credit: oldbookillustrations.com Hello reader who is also a reader, and welcome back to Booked For The Week - our regular Sunday chat with a selection of cool industry folks about books! Most of us know about the novel, the novella, and the rare novito, but did you know that Penguin briefly tried to market the ‘big nov’ - single sentences of much larger works, bizarrely serialised into hardbacks weighty enough to club the equally rare giga-seal? Some things are best left forgotten, but not Dragon Age! It’s Dragon Age month, and here’s Dragon Age veteran and good YouTuber, Mark Darrah! Cheers Mark! Mind if we have a nose at your bookshelf? What are you currently reading? Currently I am reading the Power Broker by Robert A Caro. It's the story of Robert Moses the urban planner who defined much of New York (and arguably American) urban design. Also, he's the villain from the first season of Unsleeping City on Dimension 20. This is the best written book I've ever read and I'm a bit concerned it may become my entire personality. What did you last read? Power Broker is a slow read so I read the Avatar prequel The Reckoning of Roku between chapters. What are you eyeing up next? The new D\u0026D 5.24 Player’s Handbook is out so I'll read that next. Looking forward to the Dungeon Master’s Guide as well. I likely won't switch my campaign over right away but I see a lot of promising stuff in early reviews. What quote or scene from a book has stuck with you? I tend to synthesize and integrate from things that I read. As a result, I don't usually have a quote at hand. That said, they will sometimes come bubbling out uninvited. What book do you find yourself bothering friends to read? The Power Broker. It may become a problem... What book would you like to see someone adapt to a game? I'd love to see someone take a crack at something like Parable Of The Sower by Octavia E. Butler. Though its feeling a bit too real these days... Well, I suppose one technique to rage against the futility of naming every book ever written (the very secret goal of this column) is to use a single book for multiple answers. I admire Mark’s technique, even if I must - as with every guest thus far - decree him a terrible failure. I’m re-reading John Kennedy Toole’s A Confederacy of Dunces, a book I read in uni then forgot about, then found again after furiously googling ‘fat man legal pads lives with mother’. As always, let me know what words you’re staring at. Book for now!",
  "image": "https://assetsio.gnwcdn.com/librairie-romantique-1600.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/librairie-romantique-1600.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/librairie-romantique-1600.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/librairie-romantique-1600.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/librairie-romantique-1600.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A lady reads a book in Eugène Grasset\u0026#39;s Poster for the Librairie Romantique\" width=\"880\" height=\"495\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eoldbookillustrations.com\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv\u003e\n\n\n\n            \n\u003cp\u003eHello reader who is also a reader, and welcome back to Booked For The Week - our regular Sunday chat with a selection of cool industry folks about books! Most of us know about the novel, the novella, and the rare novito, but did you know that Penguin briefly tried to market the ‘big nov’ - single sentences of much larger works, bizarrely serialised into hardbacks weighty enough to club the equally rare giga-seal? Some things are best left forgotten, but not Dragon Age! It’s Dragon Age month, and here’s Dragon Age veteran and \u003ca href=\"https://www.youtube.com/@MarkDarrah\"\u003egood YouTuber\u003c/a\u003e, Mark Darrah! Cheers Mark! Mind if we have a nose at your bookshelf?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat are you currently reading?\u003c/strong\u003e\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eCurrently I am reading the Power Broker by Robert A Caro. It\u0026#39;s the story of Robert Moses the urban planner who defined much of New York (and arguably American) urban design. Also, he\u0026#39;s the villain from the first season of Unsleeping City on Dimension 20. This is the best written book I\u0026#39;ve ever read and I\u0026#39;m a bit concerned it may become my entire personality.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eWhat did you last read?\u003c/strong\u003e\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003ePower Broker is a slow read so I read the Avatar prequel The Reckoning of Roku between chapters.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eWhat are you eyeing up next?\u003c/strong\u003e\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eThe new D\u0026amp;D 5.24 Player’s Handbook is out so I\u0026#39;ll read that next. Looking forward to the Dungeon Master’s Guide as well. I likely won\u0026#39;t switch my campaign over right away but I see a lot of promising stuff in early reviews.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eWhat quote or scene from a book has stuck with you?\u003c/strong\u003e\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eI tend to synthesize and integrate from things that I read. As a result, I don\u0026#39;t usually have a quote at hand. That said, they will sometimes come bubbling out uninvited.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eWhat book do you find yourself bothering friends to read?\u003c/strong\u003e\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eThe Power Broker. It may become a problem...\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eWhat book would you like to see someone adapt to a game?\u003c/strong\u003e\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eI\u0026#39;d love to see someone take a crack at something like Parable Of The Sower by Octavia E. Butler. Though its feeling a bit too real these days...\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eWell, I suppose one technique to rage against the futility of naming every book ever written (the very secret goal of this column) is to use a single book for multiple answers. I admire Mark’s technique, even if I must - as with every guest thus far - decree him a terrible failure. I’m re-reading John Kennedy Toole’s A Confederacy of Dunces, a book I read in uni then forgot about, then found again after furiously googling ‘fat man legal pads lives with mother’. As always, let me know what words you’re staring at. Book for now!\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-27T16:00:00Z",
  "modifiedTime": null
}
