{
  "id": "49b4b1ac-4a24-43f8-be8a-60343659b1f2",
  "title": "Alan Wake 2 Lake House expansion trailer hints at Control 2 overlap, also features ghastly paint monsters",
  "link": "https://www.rockpapershotgun.com/alan-wake-2-lake-house-expansion-trailer-hints-at-control-2-overlap-also-features-ghastly-paint-monsters",
  "description": "Remedy have released the first proper in-game trailer for Alan Wake 2's second expansion, The Lake House. It's billed as even more of a horror experience than the base game, and takes place in a research facility run by the Lynchian ghostbuster organisation you may have encountered in Remedy's paranormal shooter Control. As such, the expansion forms a direct connection between the games, and may - read: definitely will - harbour a few clues about the story of the forthcoming Control 2. Read more",
  "author": "Edwin Evans-Thirlwell",
  "published": "Thu, 17 Oct 2024 18:22:01 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Alan Wake 2",
    "PS5",
    "Horror",
    "Action Adventure",
    "Remedy Entertainment",
    "Xbox Series X/S",
    "Shooter",
    "PC",
    "Third person",
    "Epic Games",
    "Single Player",
    "Mystery"
  ],
  "byline": "Edwin Evans-Thirlwell",
  "length": 3344,
  "excerpt": "Remedy have released the first proper in-game trailer for Alan Wake 2's second expansion, The Lake House. It's billed a…",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/8ceff7932098093b8137860c2a5f6d58/icon/apple-touch-icon.png",
  "text": "Nice to see Slender Man getting work Image credit: Remedy Remedy have released the first proper in-game trailer for Alan Wake 2's second expansion, The Lake House. It's billed as even more of a horror experience than the base game, and takes place in a research facility run by the Lynchian ghostbuster organisation you may have encountered in Remedy's paranormal shooter Control. As such, the expansion forms a direct connection between the games, and may - read: definitely will - harbour a few clues about the story of the forthcoming Control 2. Alan Wake 2: The Lake House DLC - Official Reveal Trailer | Xbox Partner Preview 2024 Watch on YouTube In The Lake House you play Federal Bureau Of Control agent Kiran Estevez, who appears briefly in the main game. She's travelled to the Lake House to make inquiries about Wake, but arrives to find the place smashed-up, flooded and full of gawky Slender Man-esque munsters, the Painted. You'll be able to access the expansion's missions directly from the main menu, if you've already completed Alan Wake 2. If you haven't, you'll find them woven into the base campaign. Where Alan Wake 2's first expansion was more of a compilation of weird vignettes, The Lake House is all about scares. \"When we originally came up with the concepts for [first expansion] Night Springs and The Lake House, we knew that they would be quite different tonally,\" Kyle Rowley explains in an Xbox Wire post. \"Night Springs episodes were all about these kind of crazy 'What If?' scenarios where we could explore some rather unique ideas that were sometimes quite a dramatic tonal shift from the main experience in Alan Wake 2. With The Lake House, we wanted to again lean into the horror side of things.\" The best comparison from Alan Wake 2's main storyline is the Valhalla Nursing Home section, apparently. As for the plot connections to Control, Remedy suggest that Control character Dylan Faden may be involved. The new Painted monsters have a knack for getting behind you. According to Rowley, they \"can move in and out of the supernatural paint on surfaces, hunting the player as they do so and have devastating melee attacks that deal significant amounts of damage.\" As for what Estevez brings to the party, she doesn't have the same abilities as Saga and Alan, but she does have \"a new FBC-specific weapon\" which is tailored towards spooks. Her base weapons also deal more damage than Saga's. Where the previous Night Springs was more broken-up, this will play more like a \"traditional survival horror game\", Rowley says. \"There is a large open structure for the player to explore, secrets to discover and dangerous enemies to try and survive against. Narrative obviously plays a large role in the expansion - as it did in the main game - so it is definitely worth exploring and trying to locate the many narrative objects scattered throughout the environment.\" So when's it out? 22nd October 2024 - oh hey, that's next week. I still haven't 100% finished Alan Wake 2. Time to get the lead out. As for Control 2, as of August it had \"progressed to the production readiness stage\", after the development team turned in \"a build of the game showcasing several important features in playable form\".",
  "image": "https://assetsio.gnwcdn.com/lake-house.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \n\n    \u003cdiv\u003e\n  \n\n        \u003cp\u003eNice to see Slender Man getting work\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/lake-house.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/lake-house.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/lake-house.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/lake-house.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A huge paint monster looming over a woman with a gun in Alan Wake 2\u0026#39;s Lake House DLC\" width=\"880\" height=\"500\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eRemedy\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv\u003e\n\n\n\n            \u003cp\u003e\nRemedy have released the first proper in-game trailer for \u003ca href=\"https://www.rockpapershotgun.com/games/alan-wake-2\"\u003eAlan Wake 2\u003c/a\u003e\u0026#39;s second expansion, The Lake House. It\u0026#39;s billed as even more of a horror experience than the base game, and takes place in a research facility run by the Lynchian ghostbuster organisation you may have encountered in Remedy\u0026#39;s paranormal shooter Control. As such, the expansion forms a direct connection between the games, and may - read: definitely will - harbour a few clues about the story of the forthcoming \u003ca href=\"https://www.rockpapershotgun.com/games/control-2\"\u003eControl 2\u003c/a\u003e.\n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Alan Wake 2: The Lake House DLC - Official Reveal Trailer | Xbox Partner Preview 2024\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/ry5-KASs5qY?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/ry5-KASs5qY/hqdefault.jpg\"/\u003e\u003cspan\u003eAlan Wake 2: The Lake House DLC - Official Reveal Trailer | Xbox Partner Preview 2024\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/ry5-KASs5qY?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/ry5-KASs5qY?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003ca href=\"https://www.youtube.com/watch?v=ry5-KASs5qY\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figure\u003e\n\u003cp\u003e\nIn The Lake House you play Federal Bureau Of Control agent Kiran Estevez, who appears briefly in the main game. She\u0026#39;s travelled to the Lake House to make inquiries about Wake, but arrives to find the place smashed-up, flooded and full of gawky Slender Man-esque munsters, the Painted. You\u0026#39;ll be able to access the expansion\u0026#39;s missions directly from the main menu, if you\u0026#39;ve already completed Alan Wake 2. If you haven\u0026#39;t, you\u0026#39;ll find them woven into the base campaign.\n\u003c/p\u003e\n\u003cp\u003e\nWhere Alan Wake 2\u0026#39;s first expansion was more of a compilation of weird vignettes, The Lake House is all about scares. \u0026#34;When we originally came up with the concepts for [first expansion] Night Springs and The Lake House, we knew that they would be quite different tonally,\u0026#34; Kyle Rowley explains in \u003ca href=\"https://news.xbox.com/en-us/2024/10/17/alan-wake-2-the-lake-house-expansion-xbox-partner-preview/\"\u003ean Xbox Wire post\u003c/a\u003e. \u0026#34;Night Springs episodes were all about these kind of crazy \u0026#39;What If?\u0026#39; scenarios where we could explore some rather unique ideas that were sometimes quite a dramatic tonal shift from the main experience in Alan Wake 2. With The Lake House, we wanted to again lean into the \u003ca href=\"https://www.rockpapershotgun.com/the-best-horror-games\"\u003ehorror\u003c/a\u003e side of things.\u0026#34; The best comparison from Alan Wake 2\u0026#39;s main storyline is the Valhalla Nursing Home section, apparently. As for the plot connections to Control, Remedy suggest that Control character Dylan Faden may be involved.\n\u003c/p\u003e\u003cp\u003e\nThe new Painted monsters have a knack for getting behind you. According to Rowley, they \u0026#34;can move in and out of the supernatural paint on surfaces, hunting the player as they do so and have devastating melee attacks that deal significant amounts of damage.\u0026#34; As for what Estevez brings to the party, she doesn\u0026#39;t have the same abilities as Saga and Alan, but she does have \u0026#34;a new FBC-specific weapon\u0026#34; which is tailored towards spooks. Her base weapons also deal more damage than Saga\u0026#39;s.\n\u003c/p\u003e\n\u003cp\u003e\nWhere the previous Night Springs was more broken-up, this will play more like a \u0026#34;traditional survival horror game\u0026#34;, Rowley says. \u0026#34;There is a large open structure for the player to explore, secrets to discover and dangerous enemies to try and survive against. Narrative obviously plays a large role in the expansion - as it did in the main game - so it is definitely worth exploring and trying to locate the many narrative objects scattered throughout the environment.\u0026#34; \n\u003c/p\u003e\n\u003cp\u003e\nSo when\u0026#39;s it out? 22nd October 2024 - oh hey, that\u0026#39;s next week. I still haven\u0026#39;t 100% finished Alan Wake 2. Time to get the lead out. As for Control 2, as of August it had \u003ca href=\"https://www.rockpapershotgun.com/control-2-condor-and-the-max-payne-remakes-are-shaping-up-just-fine-say-remedy\"\u003e\u0026#34;progressed to the production readiness stage\u0026#34;\u003c/a\u003e, after the development team turned in \u0026#34;a build of the game showcasing several important features in playable form\u0026#34;.\n\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-17T18:22:01.413649Z",
  "modifiedTime": null
}
