{
  "id": "5248ae3c-77e2-43cb-9d69-44bfc23da152",
  "title": "How to Complete the Defying Gravity Challenge in BitLife",
  "link": "https://www.escapistmagazine.com/how-to-complete-the-defying-gravity-challenge-in-bitlife/",
  "description": "",
  "author": "Melissa Sarnowski",
  "published": "Sun, 09 Mar 2025 00:52:52 +0000",
  "source": "https://www.escapistmagazine.com/v2/feed/",
  "categories": [
    "News",
    "Bitlife",
    "mobile game"
  ],
  "byline": "Melissa Sarnowski",
  "length": 3044,
  "excerpt": "We’re moving from the Serial Dater Challenge to one suitable for any fan of the hit broadway musical—and now movie—Wicked. It’s time to take to the skies and learn how to complete the Defying Gravity Challenge in BitLife.",
  "siteName": "The Escapist",
  "favicon": "",
  "text": "We’re moving from the Serial Dater Challenge to one suitable for any fan of the hit broadway musical—and now movie—Wicked. It’s time to take to the skies and learn how to complete the Defying Gravity Challenge in BitLife. Defying Gravity Challenge Walkthrough This week’s challenges are: Be born a female in Kansas. Become best friends with a popular girl in school. Study Physics in university. Work as a pilot. Fly an airplane that you own. Be Born a Female in Kansas Start off by creating a custom life. Pick female as your gender and the United States as your country. To be born in Kansas, pick Wichita or Kansas City. You want to keep your grades decent while aging up and avoid getting into criminal trouble. Aside from that, there’s not much to worry about at this stage. Become Best Friends with a Popular Girl in School When you start attending school, go to the school menu and look at your class list. Find a girl with her popularity stat maxed out or close to it and become friends with her. Raise your relationship with her by spending time together and giving her compliments, then go to the relationship ship tab, select her, and pick the option to become best friends. If she declines, then keep working on the relationship and try again. Study Physics in University After you graduate high school, pick the option to go to university and look for Physics as a major. It might not appear right away. In that case, you need to wait on going to university and grab a part-time job for money in the meantime. Age up and go into the university menu again to check for Physics. Repeat this process until you’re able to enroll in university with Physics as your major. Work as a Pilot Screenshot by The Escapist Pilots need a university degree, so you can’t start this task until you graduate. Then, go to the job listings and look for Pilot Trainee, which is the first position in this career. You’ll have the typical application question pop up, then you can get to work exploring the skies. Fly an Airplane that You Own If you want to fly your own plane, you need to get a Pilot License through Activities \u003e Licenses \u003e Pilot License. This also requires 40 hours of flight school, which you can find in the same menu as the licenses. Strangely enough, you don’t need this license to work as a Pilot. However, you might need to pray for money, because planes aren’t cheap. Go to Activities \u003e Shopping \u003e Aircraft Dealers and find a plane to purchase. The type of plane doesn’t matter, so you can go for a cheap option if you need to. Then, go to Assets \u003e Vehicles and pick your plane to fly it. With that, the Defying Gravity Challenge in BitLife is complete, and you can work on personal challenges until the next one is available, such as earning the Lustful Ribbon. The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
  "image": "https://www.escapistmagazine.com/wp-content/uploads/2025/03/BitLife-Defying-Gravity-Challenge-Logo.jpg?fit=1024%2C576",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp data-characters=\"237\" data-injectable=\"true\" data-video=\"true\"\u003eWe’re moving from the \u003ca href=\"https://www.escapistmagazine.com/how-to-complete-the-serial-dater-challenge-in-bitlife/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSerial Dater Challenge\u003c/a\u003e to one suitable for any fan of the hit broadway musical—and now movie—\u003cem\u003eWicked\u003c/em\u003e. It’s time to take to the skies and learn how to complete the Defying Gravity Challenge in \u003cem\u003e\u003ca href=\"https://www.escapistmagazine.com/tag/bitlife/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBitLife\u003c/a\u003e\u003c/em\u003e.\u003c/p\u003e\n\n\n    \u003ch2 id=\"h-defying-gravity-challenge-walkthrough\" data-injectable=\"false\"\u003eDefying Gravity Challenge Walkthrough\u003c/h2\u003e    \u003cp data-characters=\"33\" data-current-count=\"33\" data-injectable=\"false\"\u003eThis week’s challenges are:\u003c/p\u003e    \u003cul data-found-items=\"5\" data-current-count=\"233\" data-injectable=\"false\"\u003e \u003cli\u003eBe born a female in Kansas.\u003c/li\u003e    \u003cli\u003eBecome best friends with a popular girl in school.\u003c/li\u003e    \u003cli\u003eStudy Physics in university.\u003c/li\u003e    \u003cli\u003eWork as a pilot.\u003c/li\u003e    \u003cli\u003eFly an airplane that you own.\u003c/li\u003e \u003c/ul\u003e    \u003ch2 id=\"h-be-born-a-female-in-kansas\" data-injectable=\"false\"\u003eBe Born a Female in Kansas\u003c/h2\u003e    \u003cp data-characters=\"315\" data-current-count=\"548\" data-injectable=\"true\"\u003eStart off by creating a custom life. Pick female as your gender and the United States as your country. To be born in Kansas, pick Wichita or Kansas City. You want to keep your grades decent while aging up and avoid getting into criminal trouble. Aside from that, there’s not much to worry about at this stage.\u003c/p\u003e\n\n\n    \u003ch2 id=\"h-become-best-friends-with-a-popular-girl-in-school\" data-injectable=\"false\"\u003eBecome Best Friends with a Popular Girl in School\u003c/h2\u003e    \u003cp data-characters=\"425\" data-current-count=\"425\" data-injectable=\"true\"\u003eWhen you start attending school, go to the school menu and look at your class list. Find a girl with her popularity stat maxed out or close to it and \u003ca href=\"https://www.escapistmagazine.com/how-to-make-friends-in-bitlife/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ebecome friends with her\u003c/a\u003e. Raise your relationship with her by spending time together and giving her compliments, then go to the relationship ship tab, select her, and pick the option to become best friends. If she declines, then keep working on the relationship and try again.\u003c/p\u003e\n\n\n    \u003ch2 id=\"h-study-physics-in-university\" data-injectable=\"false\"\u003eStudy Physics in University\u003c/h2\u003e    \u003cp data-characters=\"401\" data-current-count=\"401\" data-injectable=\"true\"\u003eAfter you graduate high school, pick the option to go to university and look for Physics as a major. It might not appear right away. In that case, you need to wait on going to university and grab a part-time job for money in the meantime. Age up and go into the university menu again to check for Physics. Repeat this process until you’re able to enroll in university with Physics as your major.\u003c/p\u003e\n\n\n    \u003ch2 id=\"h-work-as-a-pilot\" data-injectable=\"false\"\u003eWork as a Pilot\u003c/h2\u003e    \u003cfigure data-current-count=\"300\" data-injectable=\"false\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" width=\"1200\" height=\"675\" src=\"https://www.escapistmagazine.com/wp-content/uploads/2025/03/BitLife-Pilot-Trainee-Job.jpg?resize=1200%2C675\" alt=\"BitLife Pilot Trainee Job\"/\u003e\u003cfigcaption\u003eScreenshot by The Escapist\u003c/figcaption\u003e\u003c/figure\u003e    \u003cp data-characters=\"293\" data-current-count=\"593\" data-injectable=\"true\"\u003ePilots need a university degree, so you can’t start this task until you graduate. Then, go to the job listings and look for Pilot Trainee, which is the first position in this career. You’ll have the typical application question pop up, then you can get to work exploring the skies.\u003c/p\u003e\n\n\n    \u003ch2 id=\"h-fly-an-airplane-that-you-own\" data-injectable=\"false\"\u003eFly an Airplane that You Own\u003c/h2\u003e    \u003cp data-characters=\"604\" data-current-count=\"604\" data-injectable=\"true\"\u003eIf you want to fly your own plane, you need to get a Pilot License through Activities \u0026gt; Licenses \u0026gt; Pilot License. This also requires 40 hours of flight school, which you can find in the same menu as the licenses. Strangely enough, you don’t need this license to work as a Pilot. However, you might need to \u003ca href=\"https://www.escapistmagazine.com/how-to-pray-in-bitlife/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003epray for money\u003c/a\u003e, because planes aren’t cheap. Go to Activities \u0026gt; Shopping \u0026gt; Aircraft Dealers and find a plane to purchase. The type of plane doesn’t matter, so you can go for a cheap option if you need to. Then, go to Assets \u0026gt; Vehicles and pick your plane to fly it.\u003c/p\u003e\n\n\n    \u003cp data-characters=\"173\" data-current-count=\"173\" data-injectable=\"false\"\u003eWith that, the Defying Gravity Challenge in \u003cem\u003eBitLife\u003c/em\u003e is complete, and you can work on personal challenges until the next one is available, such as \u003ca href=\"https://www.escapistmagazine.com/how-to-get-the-lustful-ribbon-in-bitlife/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eearning the Lustful Ribbon\u003c/a\u003e.\u003c/p\u003e\n\t\n\n\t\t\t\n\t\n\t\n\t\n\t\n\t\u003chr/\u003e\n\n\t\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003e The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. \u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://www.escapistmagazine.com/affiliate-policy/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://escapistmagazine.com/affiliate-policy\" data-sk=\"tooltip_parent\"\u003eLearn more about our Affiliate Policy\u003c/a\u003e\u003c/i\u003e\t\u003c/p\u003e\n\n\t\n\t\t\t\n\t\t\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-09T00:52:52Z",
  "modifiedTime": "2025-03-09T00:52:55Z"
}
