{
  "id": "5411ae79-bc9b-47f3-baca-e063ef1cf53c",
  "title": "Teen Titans Movie Confirmed to Be in ‘Early Stages’ At DC, Writer Attached",
  "link": "https://www.escapistmagazine.com/teen-titans-movie-confirmed-to-be-in-early-stages-at-dc-writer-attached/",
  "description": "",
  "author": "Jackson Hayes",
  "published": "Mon, 24 Feb 2025 18:02:28 +0000",
  "source": "https://www.escapistmagazine.com/v2/feed/",
  "categories": [
    "Movies \u0026 TV",
    "News",
    "Featured",
    "Teen Titans"
  ],
  "byline": "Jackson Hayes",
  "length": 2493,
  "excerpt": "James Gunn confirmed that a Teen Titans movie is in \"early stages\" at DC and a writer is attached to the project.",
  "siteName": "The Escapist",
  "favicon": "",
  "text": "For kids in the early 2000s, the Teen Titans were DC’s biggest team. The Cartoon Network show was a massive success, paving the way for other series. However, James Gunn and Co. want to take the young heroes to a bigger screen, starting development on a Teen Titans movie. The news comes out of an event Warner Bros. held for the press last week. Gunn and his creative partner, Peter Safran, answered all sorts of questions about their DC Universe and provided updates about long-gestating projects like The Authority and Season 2 of Max’s Peacemaker. The most interesting tidbit, though, may have been the confirmation of a report from last year about a Teen Titans movie being in the works at DC. Gunn revealed that Ana Noguiera has been working on the script for the movie “for a little while,” adding that the project is in “very early stages” (via io9). Noguiera also worked on another DCU project, Supergirl: Woman of Tomorrow, which is set to release in 2026, but she’s probably best known for playing Penny Ares on The Vampire Diaries. Related: Amazon Taking Full Creative Control of the James Bond Franchise With so little to go on, it’s hard to get a read on what kind of direction the powers that be at DC are taking the Teen Titans. However, it’ll probably be a point of emphasis to avoid going too dark, as that’s what Max’s Titans did for its four-season run. That series had a complicated life, being plagued by production issues and a jump from one streaming service to another. It did find its audience, though, and that likely had a lot to do with the nostalgia for the characters. Gunn clearly knows the value of Robin and his friends, as two projects are already in the works that involve the Boy Wonder. The first is The Brave and the Bold, which will feature the DCU’s version of Batman, not Robert Pattinson’s iteration, and the other is Dynamic Duo, an animated movie that will act as “a coming-of-age crowd pleaser” with Dick Grayson and Jason Todd at the forefront. Another animated project, one which will revolve around Starfire, points to the Tamaranean also joining the Teen Titans. Of course, it’s always possible the DCU has other plans for her and may opt for an entirely different lineup than fans of the superhero team are used to. The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
  "image": "https://www.escapistmagazine.com/wp-content/uploads/2025/02/teen-titans.jpg?fit=1024%2C512",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp data-characters=\"279\" data-injectable=\"true\" data-video=\"true\"\u003eFor kids in the early 2000s, the Teen Titans were DC’s biggest team. The Cartoon Network show was a massive success, paving the way for other series. However, James Gunn and Co. want to take the young heroes to a bigger screen, starting development on a Teen Titans movie. \u003c/p\u003e\n\n\n    \u003cp data-characters=\"432\" data-current-count=\"432\" data-injectable=\"true\"\u003eThe news comes out of an event Warner Bros. held for the press last week. Gunn and his creative partner, Peter Safran, answered all sorts of questions about their DC Universe and provided updates about long-gestating projects like\u003cem\u003e The Authority \u003c/em\u003eand Season 2 of Max’s\u003cem\u003e Peacemaker\u003c/em\u003e. The most interesting tidbit, though, may have been the confirmation of a report from last year about a \u003cem\u003eTeen Titans \u003c/em\u003emovie being in the works at DC. \u003c/p\u003e\n\n\n    \u003cp data-characters=\"375\" data-current-count=\"375\" data-injectable=\"false\"\u003eGunn revealed that Ana Noguiera has been working on the script for the movie “for a little while,” adding that the project is in “very early stages” (\u003ca href=\"https://gizmodo.com/dcu-movie-updates-james-gunn-batman-supergirl-peacemaker-2000567205\" target=\"_blank\"\u003evia io9\u003c/a\u003e). Noguiera also worked on another DCU project, \u003cem\u003eSupergirl: Woman of Tomorrow\u003c/em\u003e, which is set to release in 2026, but she’s probably best known for playing Penny Ares on \u003cem\u003eThe Vampire Diaries\u003c/em\u003e. \u003c/p\u003e    \u003cp data-characters=\"72\" data-current-count=\"447\" data-injectable=\"true\"\u003e\u003cstrong\u003eRelated: \u003ca href=\"https://www.escapistmagazine.com/amazon-taking-full-creative-control-of-the-james-bond-franchise/\"\u003eAmazon Taking Full Creative Control of the James Bond Franchise\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n    \u003cp data-characters=\"507\" data-current-count=\"507\" data-injectable=\"true\"\u003eWith so little to go on, it’s hard to get a read on what kind of direction the powers that be at DC are taking the Teen Titans. However, it’ll probably be a point of emphasis to avoid going too dark, as that’s what Max’s \u003cem\u003eTitans \u003c/em\u003edid for its four-season run. That series had a complicated life, being plagued by production issues and a jump from one streaming service to another. It did find its audience, though, and that likely had a lot to do with the nostalgia for the characters. \u003c/p\u003e\n\n\n    \u003cp data-characters=\"416\" data-current-count=\"416\" data-injectable=\"true\"\u003eGunn clearly knows the value of Robin and his friends, as two projects are already in the works that involve the Boy Wonder. The first is \u003cem\u003eThe Brave and the Bold\u003c/em\u003e, which will feature the DCU’s version of Batman, not Robert Pattinson’s iteration, and the other is \u003cem\u003eDynamic Duo\u003c/em\u003e, an animated movie that will act as “a coming-of-age crowd pleaser” with Dick Grayson and Jason Todd at the forefront. \u003c/p\u003e\n\n\n    \u003cp data-characters=\"281\" data-current-count=\"281\" data-injectable=\"false\"\u003eAnother animated project, one which will revolve around Starfire, points to the Tamaranean also joining the Teen Titans. Of course, it’s always possible the DCU has other plans for her and may opt for an entirely different lineup than fans of the superhero team are used to. \u003c/p\u003e\n\t\n\n\t\t\t\n\t\n\t\n\t\n\t\n\t\u003chr/\u003e\n\n\t\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003e The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. \u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://www.escapistmagazine.com/affiliate-policy/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://escapistmagazine.com/affiliate-policy\" data-sk=\"tooltip_parent\"\u003eLearn more about our Affiliate Policy\u003c/a\u003e\u003c/i\u003e\t\u003c/p\u003e\n\n\t\n\t\t\t\n\t\t\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-24T18:02:28Z",
  "modifiedTime": "2025-02-24T18:02:31Z"
}
