{
  "id": "5695ac60-f039-403b-bd34-18841e01cadd",
  "title": "The RPS Advent Calendar 2024, December 14th",
  "link": "https://www.rockpapershotgun.com/the-rps-advent-calendar-2024-december-14th",
  "description": "Squeezing through the advent calendar window into a sodden glade of flower and coral, you spy a curious organism on a ledge in the shadows. It’s a video game of some description, though it looks like a squirrel, with frantic white eyes. What’s it doing? Ah, whoops, you’ve startled it. Better follow it offscreen. Read more",
  "author": "RPS",
  "published": "Sat, 14 Dec 2024 12:00:00 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "PS5",
    "Metroidvania",
    "Bigmode",
    "Platformer",
    "Shared Memory",
    "The RPS Advent Calendar 2024",
    "Nintendo Switch",
    "Puzzle",
    "Animal Well",
    "Side view",
    "Indie",
    "PC",
    "Single Player"
  ],
  "byline": "RPS",
  "length": 3875,
  "excerpt": "Day 14 of the RPS Advent Calendar counting down our favourite games of 2024.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/eaa22572e085593b1ebd55b62f56acb2/icon/apple-touch-icon.png",
  "text": "Image credit: RPS Squeezing through the advent calendar window into a sodden glade of flower and coral, you spy a curious organism on a ledge in the shadows. It’s a video game of some description, though it looks like a squirrel, with frantic white eyes. What’s it doing? Ah, whoops, you’ve startled it. Better follow it offscreen. It's Animal Well! Edwin: Back before Animal Well’s launch, creator Billy Basso told me that he wanted his delightful, intuitive and mysterious 2D platformer to harbour secrets that would keep people scratching their heads for a decade. He’d even built the technology to maximise the odds of compatibility with much later generations of PC. Going by post-launch coverage, the game has already been emptied out, its guts rinsed of surprises by armies of needle-fingered wiki contributors. I guess it’s possible there are a few enigmas remaining, which Basso is keeping quiet about. It doesn’t matter, because to me, Animal Well will always be bottomless. That’s simply because Animal Well is driven by symbols - dial-up telephones, bunnies, firebowls, sausage dogs, rolling mice heads, watchful crows – and symbols are open-ended. Which is not to say it’s wholly abstract. The festering seacave setting has something approaching an “ecology” and hints of a mythological past, perhaps even a flourish of autobiography in the choice of props. But it’s not a “built world”. It’s the product of dream (sometimes nightmare) logic and free association. It’s one of the old-school video game fairytales, like Zelda before Zelda succumbed to the weight of sequels, and became something of an episodic canon. It’s also a brilliant metroidvania, partly because the base controls for movement are so simple and elegantly implemented, and partly because it avoids many of the usual metroidvania features. There are no unlock trees, no generic abilities like aerial dashes or extendable combos - no combat at all, in fact. Instead, you get cheerful toys like a frisbee, a slinky, or a bubble-wand. Like most toys, these ones have myriad uses, and it’s up to you to disclose them by paying attention and playing with the concept – is the yo-yo just a yo-yo? The other animals are both obstacles and allies, in this regard, their hostile or accommodating or unreadable behaviour helping you glean the possibilities. They feel like loosely animated archetypes rather than straight portrayals of creatureliness, filling out the world in a way that is vital yet also mechanical and deathly. They are forever whimsical and powerfully strange. Among Animal Well’s greatest discoveries is that reaching the credits isn’t game-over. There are items, tactics and… tendencies of the environment that threaten to break the rules and transform the game, if you carry on probing and delving. For all that, Animal Well remains graceful and easy to grasp. I’m very curious to see how future generations of player might respond to it. It might not harbour a decade’s worth of secrets, but it’ll definitely be worth returning to in 10 years time. Brendy: I didn't get too far in Animal Well. I gave up because of a difficult platforming bit, but up until that point I did appreciate the quiet sense of exploration and discovery that could be evoked with such a simple graphical style. Also, my cat kept chasing the little animal figures around the screen and that made me like the game even more. Graham: By contrast, I did not get on with Animal Well. I did not find its moment-to-moment platforming and puzzling fun enough to persevere past its habit of sending you back to a distant checkpoint upon failure. I do enjoy looking at it, mind, so it'll sit forever in a bucket alongside Rain World as an alien ecosystem I'd love to explore but lack the patience for. Head back to the advent calendar to open another door!",
  "image": "https://assetsio.gnwcdn.com/RPS24_Christmas_Calendar_Header_AW.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/RPS24_Christmas_Calendar_Header_AW.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/RPS24_Christmas_Calendar_Header_AW.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/RPS24_Christmas_Calendar_Header_AW.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/RPS24_Christmas_Calendar_Header_AW.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Horace the Endless Bear wraps himself around the top of a Christmas tree.\" width=\"880\" height=\"495\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eRPS\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \n\u003cp\u003eSqueezing through the advent calendar window into a sodden glade of flower and coral, you spy a curious organism on a ledge in the shadows. It’s a video game of some description, though it looks like a squirrel, with frantic white eyes. What’s it doing? Ah, whoops, you’ve startled it. Better follow it offscreen.\n\u003c/p\u003e\n\n\u003cp\u003eIt\u0026#39;s \u003ca href=\"https://www.rockpapershotgun.com/games/animal-well\"\u003eAnimal Well\u003c/a\u003e!\n\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEdwin:\u003c/strong\u003e Back before Animal Well’s launch, creator Billy Basso told me that he wanted his delightful, intuitive and mysterious 2D platformer to harbour secrets that would keep people scratching their heads for a decade. He’d even built the technology to maximise the odds of compatibility with much later generations of PC. Going by post-launch coverage, the game has already been emptied out, its guts rinsed of surprises by armies of needle-fingered wiki contributors. I guess it’s possible there are a few enigmas remaining, which Basso is keeping quiet about. It doesn’t matter, because to me, Animal Well will always be bottomless.\n\u003c/p\u003e\n\u003cp\u003eThat’s simply because Animal Well is driven by symbols - dial-up telephones, bunnies, firebowls, sausage dogs, rolling mice heads, watchful crows – and symbols are open-ended. Which is not to say it’s wholly abstract. The festering seacave setting has something approaching an “ecology” and hints of a mythological past, perhaps even a flourish of autobiography in the choice of props. But it’s not a “built world”. It’s the product of dream (sometimes nightmare) logic and free association. It’s one of the old-school video game fairytales, like Zelda before Zelda succumbed to the weight of sequels, and became something of an episodic canon.\n\u003c/p\u003e\u003cp\u003eIt’s also a brilliant metroidvania, partly because the base controls for movement are so simple and elegantly implemented, and partly because it avoids many of the usual metroidvania features. There are no unlock trees, no generic abilities like aerial dashes or extendable combos - no combat at all, in fact. Instead, you get cheerful toys like a frisbee, a slinky, or a bubble-wand.\n\u003c/p\u003e\n\u003cp\u003eLike most toys, these ones have myriad uses, and it’s up to you to disclose them by paying attention and playing with the concept – is the yo-yo just a yo-yo? The other animals are both obstacles and allies, in this regard, their hostile or accommodating or unreadable behaviour helping you glean the possibilities. They feel like loosely animated archetypes rather than straight portrayals of creatureliness, filling out the world in a way that is vital yet also mechanical and deathly. They are forever whimsical and powerfully strange.\n\u003c/p\u003e\n\u003cp\u003eAmong Animal Well’s greatest discoveries is that reaching the credits isn’t game-over. There are items, tactics and… tendencies of the environment that threaten to break the rules and transform the game, if you carry on probing and delving. For all that, Animal Well remains graceful and easy to grasp. I’m very curious to see how future generations of player might respond to it. It might not harbour a decade’s worth of secrets, but it’ll definitely be worth returning to in 10 years time.\n\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBrendy:\u003c/strong\u003e I didn\u0026#39;t get too far in Animal Well. I gave up because of a difficult platforming bit, but up until that point I did appreciate the quiet sense of exploration and discovery that could be evoked with such a simple graphical style. Also, my cat kept chasing the little animal figures around the screen and that made me like the game even more.  \n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eGraham:\u003c/strong\u003e By contrast, I did not get on with Animal Well. I did not find its moment-to-moment platforming and puzzling fun enough to persevere past its habit of sending you back to a distant checkpoint upon failure. I do enjoy looking at it, mind, so it\u0026#39;ll sit forever in a bucket alongside \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/rain-world\"\u003eRain World\u003c/a\u003e as an alien ecosystem I\u0026#39;d love to explore but lack the patience for.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHead \u003ca href=\"https://www.rockpapershotgun.com/the-dazzling-desirable-rps-advent-calendar-2024\"\u003eback to the advent calendar\u003c/a\u003e to open another door!\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-14T12:00:00Z",
  "modifiedTime": null
}
