{
  "id": "57a52ce9-307c-4996-9b52-d527abfd3120",
  "title": "Elon Musk Criticized for Calling for ‘Informative Content’ on X After a Year of Fake News and Disinformation Investigations: “You First”",
  "link": "https://www.escapistmagazine.com/elon-musk-criticized-for-calling-for-informative-content-on-x-after-a-year-of-fake-news-and-disinformation-investigations-you-first/",
  "description": "",
  "author": "Sarah Barrett",
  "published": "Mon, 30 Dec 2024 16:38:19 +0000",
  "source": "https://www.escapistmagazine.com/v2/feed/",
  "categories": [
    "News",
    "Elon Musk"
  ],
  "byline": "Sarah Barrett",
  "length": 3766,
  "excerpt": "Twitter, now X, is dead and Elon Musk killed it. Now, he's trampling all over its corpse looking for attention.",
  "siteName": "The Escapist",
  "favicon": "",
  "text": "Twitter, now X, is dead, and Elon Musk killed it. Now, he’s trampling all over its corpse looking for attention. The richest man in the world, and one of the most hated, posted yesterday, “Please post a bit more positive, beautiful or informative content on this platform.” This was met with laughter from those who had been paying attention. There’s no social media platform less positive, less beautiful, and less informative than X. Here’s some context as to why Musk posted such a thing to begin with. He’s been posting on X in favor of the H-1B visa, used to bring skilled professionals into the US. Far-righter Laura Loomer, a huge racist, objected to migrants coming in regardless of their skill. Musk responded to the disagreement by allegedly de-monetizing Loomer’s account. “Elon Musk has removed my blue check mark on X because I dared to question his support for H1B visas, the replacement of American tech workers by Indian immigrants, and I questioned his relationship with China,” Loomer posted on December 27. Yep, this all happened over the holiday period, when most people are spending time with their families. “Looks like Elon Musk is going to be silencing me for supporting original Trump immigration policies.” In the battle of Musk vs Loomer, most people would be team no-one, but Loomer is correct in that Musk shouldn’t be silencing anyone—he advertised himself as a free speech absolutist, and X as a place which valued freedom of speech above all. (Trans people, of course, knew this was a lie from the beginning, as they and their allies can no longer use the word “cisgender” on the platform.) The whole “debate” was a sickening, profane sight in which the ableist slur, “r*tard”, was used to describe American workers. It made it abundantly clear that neither Musk nor MAGA actually care about the average American person. And then, once it was over, Musk made the post about wanting to see more informative content on X. But let’s look at the track record of Musk’s X. Earlier this year, X was briefly banned in Brazil for spreading misinformation about the Brazilian presidential elections. Judge Alexandre de Moraes suspended X from the country until a $5m fine was paid. Musk claimed, of course, that this was a suppression of free speech. The EU is also seeking to control the rise of misinformation on X. Back in July there was an investigation by the EU’s Digital Services Act about whether the now paid-for blue ticks on the platform were being used to misled people. Musk once again denounced this as an attack on freedom of speech. It’s obvious at this point that Musk is only interested in freedom of speech insofar as he can use it as a weapon. He has made the platform formerly known as Twitter into a cesspit of racism, ableism, homophobia and transphobia. He himself frequently spreads misinformation on the site, such as when he promoted a conspiracy theory about Nancy Pelosi’s husband. The idea that he genuinely wants more “positive” content on X is ridiculous. “You first,” tweeted Mark Cuban in response to Musk’s post. “Bro, you’ve just endorsed the German neo-nazi party. Maybe you should sit this one out Elon,” wrote another person, referring to Musk’s endorsement of the far-right AfD Party. There was also snark on Bluesky, the platform that is currently the biggest rival to X. The consensus seems to be: Musk made this bed for himself and it’s only right he should lie in it. Hopefully, his downfall will come soon, and that day really will be positive and beautiful. The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
  "image": "https://www.escapistmagazine.com/wp-content/uploads/2024/12/elon-musk-armor.jpg?fit=1024%2C576",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp data-characters=\"118\" data-injectable=\"true\" data-video=\"true\"\u003eTwitter, now X, is dead, and Elon Musk killed it. Now, he’s trampling all over its corpse looking for attention.\u003c/p\u003e\n\n    \u003cp data-characters=\"341\" data-current-count=\"341\" data-injectable=\"false\"\u003eThe richest man in the world, and one of the most hated, posted yesterday, “Please post a bit more positive, beautiful or informative content on this platform.” This was met with laughter from those who had been paying attention. There’s no social media platform less positive, less beautiful, and less informative than X. \u003c/p\u003e    \u003cp data-characters=\"365\" data-current-count=\"706\" data-injectable=\"true\"\u003eHere’s some context as to why Musk posted such a thing to begin with. He’s been posting on X in favor of the H-1B visa, used to bring skilled professionals into the US. Far-righter Laura Loomer, a huge racist, objected to migrants coming in regardless of their skill. Musk responded to the disagreement by allegedly de-monetizing Loomer’s account.\u003c/p\u003e\n\n    \u003cp data-characters=\"882\" data-current-count=\"882\" data-injectable=\"true\"\u003e“Elon Musk has removed my blue check mark on X because I dared to question his support for H1B visas, the replacement of American tech workers by Indian immigrants, and I questioned his relationship with China,” Loomer posted on December 27. Yep, this all happened over the holiday period, when most people are spending time with their families. “Looks like Elon Musk is going to be silencing me for supporting original Trump immigration policies.” In the battle of Musk vs Loomer, most people would be team no-one, but Loomer is correct in that Musk shouldn’t be silencing anyone—he advertised himself as a free speech absolutist, and X as a place which valued freedom of speech above all. (Trans people, of course, knew this was a lie from the beginning, as they and their allies can no longer use the word “cisgender” on the platform.)\u003c/p\u003e\n\n    \u003cp data-characters=\"352\" data-current-count=\"352\" data-injectable=\"false\"\u003eThe whole “debate” was a sickening, profane sight in which the ableist slur, “r*tard”, was used to describe American workers. It made it abundantly clear that neither Musk nor MAGA actually care about the average American person. And then, once it was over, Musk made the post about wanting to see more informative content on X.\u003c/p\u003e    \u003cp data-characters=\"333\" data-current-count=\"685\" data-injectable=\"true\"\u003eBut let’s look at the track record of Musk’s X. Earlier this year, X was briefly banned in Brazil for spreading misinformation about the Brazilian presidential elections. Judge Alexandre de Moraes suspended X from the country until a $5m fine was paid. Musk claimed, of course, that this was a suppression of free speech.\u003c/p\u003e\n\n    \u003cp data-characters=\"303\" data-current-count=\"303\" data-injectable=\"false\"\u003eThe EU is also seeking to control the rise of misinformation on X. Back in July there was an investigation by the EU’s Digital Services Act about whether the now paid-for blue ticks on the platform were being used to misled people. Musk once again denounced this as an attack on freedom of speech.\u003c/p\u003e    \u003cp data-characters=\"373\" data-current-count=\"676\" data-injectable=\"true\"\u003eIt’s obvious at this point that Musk is only interested in freedom of speech insofar as he can use it as a weapon. He has made the platform formerly known as Twitter into a cesspit of racism, ableism, homophobia and transphobia. He himself frequently spreads misinformation on the site, such as when \u003ca href=\"https://www.independent.co.uk/news/world/americas/us-politics/elon-musk-pelosi-conspiracies-apology-b2271584.html\" target=\"_blank\"\u003ehe promoted a conspiracy theory about Nancy Pelosi’s husband\u003c/a\u003e.\u003c/p\u003e\n\n    \u003cp data-characters=\"368\" data-current-count=\"368\" data-injectable=\"false\"\u003eThe idea that he genuinely wants more “positive” content on X is ridiculous. “You first,” \u003ca href=\"https://x.com/mcuban/status/1873492526159802454\" target=\"_blank\"\u003etweeted Mark Cuban in response to Musk’s post\u003c/a\u003e. “Bro, you’ve just endorsed the German neo-nazi party. Maybe you should sit this one out Elon,” \u003ca href=\"https://x.com/Jurgen80048425/status/1873421637854576864\" target=\"_blank\"\u003ewrote another person\u003c/a\u003e, referring to Musk’s endorsement of the far-right AfD Party. \u003c/p\u003e    \u003cp data-characters=\"87\" data-current-count=\"455\" data-injectable=\"false\"\u003eThere was also snark on Bluesky, the platform that is currently the biggest rival to X.\u003c/p\u003e    \u003cfigure data-current-count=\"755\" data-injectable=\"true\"\u003e\u003c/figure\u003e\n\n    \u003cfigure data-current-count=\"300\" data-injectable=\"false\"\u003e\u003c/figure\u003e    \u003cp data-characters=\"196\" data-current-count=\"496\" data-injectable=\"false\"\u003eThe consensus seems to be: Musk made this bed for himself and it’s only right he should lie in it. Hopefully, his downfall will come soon, and that day really will be positive and beautiful.\u003c/p\u003e\n\t\n\n\t\t\t\n\t\n\t\n\t\n\t\n\t\u003chr/\u003e\n\n\t\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003e The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. \u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://www.escapistmagazine.com/affiliate-policy/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://escapistmagazine.com/affiliate-policy\" data-sk=\"tooltip_parent\"\u003eLearn more about our Affiliate Policy\u003c/a\u003e\u003c/i\u003e\t\u003c/p\u003e\n\n\t\n\t\t\t\n\t\t\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-30T16:38:19Z",
  "modifiedTime": "2024-12-30T16:38:23Z"
}
