{
  "id": "5cd3675f-74ea-4996-8b69-e9622a55b740",
  "title": "Oblivion Remastered’s modern makeover comes with modern performance snags",
  "link": "https://www.rockpapershotgun.com/oblivion-remastered-best-settings-pc-performance",
  "description": "The Elder Scrolls IV: Oblivion Remastered is one of those rare games I’ll grind out a performance and settings feature for before continuing to play it – yee gads, what a concept – for fun. It’s more or less exactly what I’d have asked from a modern take, with refreshed visuals and UX improvements bolted directly onto Oblivion’s original, famously bent chassis. This hybrid engine approach, similar to that of Ninja Gaiden 2 Black, hands off the graphical rendering gubbins to an Unreal Engine 5 layer while keeping all the game logic to a modified version of what is otherwise just the 2006 backend. Preserving, in the process, that janky daftness that accounts for much of Oblivion’s charm, with qualified support for the original’s mods on the side. Still, the performance impact of Oblivion Remastered’s new look is not to be trifled with. Even with DLSS/FSR upscaling support and frame generation, this is a tough one to run smoothly at its highest settings, especially if you deploy the ray tracing effects that (for once) really do enhance and enliven the scenery. Read more",
  "author": "James Archer",
  "published": "Fri, 25 Apr 2025 15:35:44 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "RPG",
    "Virtuos",
    "PC",
    "Hardware",
    "Xbox Series X/S",
    "PS5",
    "Third person",
    "Bethesda Game Studios",
    "Action Adventure",
    "Single Player",
    "The Elder Scrolls IV: Oblivion Remastered",
    "First person"
  ],
  "byline": "James Archer",
  "length": 9073,
  "excerpt": "The best settings for The Elder Scrolls IV: Oblivion Remastered, based on our testing. They won't fix its stuttering problem, but can soften the blow.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/785e7bd402cedcc33373d7ad922dd562/icon/apple-touch-icon.png",
  "text": "Settings and ray tracing tested Image credit: Rock Paper Shotgun/Bethesda Softworks The Elder Scrolls IV: Oblivion Remastered is one of those rare games I’ll grind out a performance and settings feature for before continuing to play it – yee gads, what a concept – for fun. It’s more or less exactly what I’d have asked from a modern take, with refreshed visuals and UX improvements bolted directly onto Oblivion’s original, famously bent chassis. This hybrid engine approach, similar to that of Ninja Gaiden 2 Black, hands off the graphical rendering gubbins to an Unreal Engine 5 layer while keeping all the game logic to a modified version of what is otherwise just the 2006 backend. Preserving, in the process, that janky daftness that accounts for much of Oblivion’s charm, with qualified support for the original’s mods on the side. Still, the performance impact of Oblivion Remastered’s new look is not to be trifled with. Even with DLSS/FSR upscaling support and frame generation, this is a tough one to run smoothly at its highest settings, especially if you deploy the ray tracing effects that (for once) really do enhance and enliven the scenery. 1 of 12 Caption Attribution Comparing the bump maps of every blade of glass isn't the point of this article, but it would be strange not to do any before-and-aftering at all, so: here ya go. Lower-end gear isn’t off the table – even the Steam Deck can manage reasonable framerates – though I will recommend some tactical quality reductions in the guide further down. First, and because its, uh, attempt at shadowdropping meant we skipped the usual pre-release infodumps, let’s get acquainted with Oblivion Remastered’s system requirements and how they measure up to performance reality. Image credit: Rock Paper Shotgun/Bethesda Softworks The Elder Scrolls IV: Oblivion Remastered system requirements and PC performance These aren’t the haughtiest requirements I’ve seen from a UE5 production, to be fair. Graphics cards like the RX 5700 and GTX 1070 Ti will probably seem like excessive minimums to anyone still playing OG Oblivs on their GeForce 7600 GT, but they’re old themselves by 2025 standards. I’m more concerned about the recommended list’s 32GB of RAM, which ain’t a little, and the bulging 125GB SSD requirement. That’s quite the pile of high-def chainmail textures. The Elder Scrolls IV: Oblivion Remastered minimum PC specs OS: Windows 10 version 21H1 (10.0.19043) CPU: AMD Ryzen 5 2600X / Intel Core i7-6800K RAM: 16GB GPU: AMD Radeon RX 5700 / Nvidia GeForce GTX 1070 Ti DirectX: Version 12 Storage: 125GB available space, SSD required The Elder Scrolls IV: Oblivion Remastered recommended PC specs OS: Windows 10/11 (with updates) CPU: AMD Ryzen 5 3600X / Intel Core i5-10600K RAM: 32GB GPU: AMD Radeon RX 6800XT / Nvidia GeForce RTX 2080 DirectX: Version 12 Storage: 125GB available space, SSD required There’s no getting around the remaster’s considerable girth, though evidence suggests that at least the GPU requirements err on the overly cautious. In the relatively demanding overworld section I used for benchmarking, the GTX 1070 – that’s the base, non-Ti version – averaged a more-than-adequate 43fps at 1080p, simply using the Low preset. The GTX 1070 Ti should, therefore, be plenty. Elsewhere in the cheaper neighbourhoods of PC hardware, the RTX 4060 could just about handle the Ultra preset at 1080p, scoring 33fps. High would be a better starting point, though, producing 53fps, while Medium pumped out a nifty 80fps. Steering clear of Ultra also worked out for the RTX 3070, which on the High preset ended up with 59fps at 1080p, as well as 55fps at 1440p after adding DLSS on Quality mode. Just to get in some premium representation, I also tried the RTX 5080 at 4K, where (on the Ultra preset with DLSS on Quality) it averaged 62fps before climbing to 105fps with frame generation. You’ll note that none of these results are especially horrid, and to be clear, these are averages taken from a more straining patch of Cyrodiil; castles, caves, and dungeons will run much faster, owing to their simpler and tighter interiors. Even so, that lack of consistency is a concern in itself, since you essentially need to tune Oblivion Remastered’s graphics settings for a kind of worst-case scenario. What’s more, all of those results use the default Lumen lighting effect setting of Low-quality, software-based ray tracing, which isn’t very demanding but lacks the depth and the detailing that hardware-based Lumen offers in exchange for its higher frame tax. 1 of 2 Caption Attribution Sadly, the biggest performance headache seems to flare up regardless of how mighty your hardware is: our old friend, stutter. This is a regular occurrence when free-roaming, with hitch-fits sometimes lasting for several seconds, and can even occur when performing such mundane tasks as exiting the waiting screen or opening the pause menu. Some patching work is definitely needed here, and in truth, some of the new visuals could do with touchups while Virtuos are at it. I’ve repeatedly seen glimmers of equipped weapons or nearby trees erroneously melded into screen space reflections, and whatever this lady is doing with her skirt, ma’am, it isn’t working. Image credit: Rock Paper Shotgun/Bethesda Softworks Weirdly, the remaster still feels like it improves the structural integrity of Oblivion as well as the graphical fidelity. Install the original game today without mods and you’ll find no shortage of unfixed technical bizarreries, from hideous blurring on high framerates to a deranged options menu that disables anti-aliasing on the Ultra preset because the game thinks AA and HDR lighting are mutually exclusive. Oblivion Remastered has bugs and stuttering, sure, but it’s not broken and/or mad in the same kinds of ways – you just need to make sure that when framerates fall, you’ve given yourself enough headroom to stay out of the red. Image credit: Rock Paper Shotgun/Bethesda Softworks The Elder Scrolls IV: Oblivion Remastered best settings Actually, correction: Oblivion Remastered can be a tiny bit mad. The relative performance of each quality preset is far, far more than the some of their parts – when I tested each setting individually, lowering them from Ultra to Medium to see which ate up the most frames, only shadows quality had a major impact. This would suggest that all the others could be left on Ultra with minimal performance drawback, except shadows alone couldn’t account for the vast differences between each preset. On the RTX 4060, remember, Ultra averaged 33fps at 1080p while Medium averaged 80fps, yet setting only shadow quality to Medium (and keeping everything else on Ultra) only produced 43fps. I’m therefore going to suggest High, rather than Ultra, as a starting point from which to make further tweaks. There’s evidently some manner of Voltron effect with most of the individual settings, where cutting them piecemeal achieves little compared to gathering a whole set of reductions together, and it’s not like High is ugly anyhow. 1 of 4 Caption Attribution Nevertheless, it’s worth dropping shadows another level down, and I did get a smaller framerate boost from snipping global illumination quality, so that makes the list as well. Here’s what I’ve landed on: Motion blur: Off Screen space reflections: On Shadow quality: Medium Global illumination quality: Medium Upscaling technique: DLSS/FSR 3 on Quality Lumen hardware RT: On Lumen hardware RT lighting mode: High Everything else: High Hardware-based RT can be skipped if you’re on an older GPU that isn’t up to it, but otherwise, this is the one luxury you should afford yourself if you can. It might not replicate the original game’s blinding bloom but it does deliver more of a sun-kissed look that suits the leafy Cyrodiil rather well. Lowering shadows and global illumination, while adding upscaling, also provides the framerate headroom to accommodate ray traced effects: on the RTX 4060 at 1080p, these settings scored 63fps, nearly double the speed of the Ultra preset just with software-based RT. By comparison, the same settings with software Lumen on Low quality produced 74fps, so the smoothness gap isn’t some yawning chasm. Also, I wouldn’t consider it important enough to include in a list of the air-quote \"best\" settings, but DLSS frame generation also works fairly well if you’re already pumping out at least 60fps or so without it; this healthy supply of traditionally rendered frames helps absorb the input lag increase from sprinkling in the generated frames. I wouldn’t bother with FSR frame gen, though. Even with a strong foundation of normal frames, it has less of a grasp on consistent frame timings, so the results are noticeably less smooth than DLSS when walking. And this is still a Bethesda RPG, so there's a fair bit of that.",
  "image": "https://assetsio.gnwcdn.com/Oblivion-Remastered-bandit-fight.png?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n  \n\n        \u003cp\u003eSettings and ray tracing tested\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/Oblivion-Remastered-bandit-fight.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/Oblivion-Remastered-bandit-fight.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Oblivion-Remastered-bandit-fight.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Oblivion-Remastered-bandit-fight.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Bowfighting a bandit at close range in The Elder Scrolls IV: Oblivion Remastered.\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eRock Paper Shotgun/Bethesda Softworks\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\u003ca href=\"https://www.rockpapershotgun.com/games/the-elder-scrolls-4-oblivion-remake\"\u003eThe Elder Scrolls IV: Oblivion Remastered\u003c/a\u003e is one of those rare games I’ll grind out a performance and settings feature for before continuing to play it – yee gads, what a concept – \u003cem\u003efor fun\u003c/em\u003e. It’s more or less exactly what I’d have asked from a modern take, with refreshed visuals and UX improvements bolted directly onto Oblivion’s original, famously bent chassis.\u003c/p\u003e\n\u003cp\u003eThis hybrid engine approach, similar to that of \u003ca href=\"https://www.rockpapershotgun.com/ninja-gaiden-2-black-remake-or-remaster\"\u003eNinja Gaiden 2 Black\u003c/a\u003e, hands off the graphical rendering gubbins to an Unreal Engine 5 layer while keeping all the game logic to a modified version of what is otherwise just the 2006 backend. Preserving, in the process, that \u003ca href=\"https://www.rockpapershotgun.com/rps-asks-please-tell-me-your-stupidest-oblivion-remastered-anecdotes-so-far\"\u003ejanky daftness\u003c/a\u003e that accounts for much of Oblivion’s charm, with \u003ca href=\"https://www.rockpapershotgun.com/some-old-mods-from-2008-still-work-in-oblivion-remastered\"\u003equalified support for the original’s mods\u003c/a\u003e on the side. Still, the performance impact of Oblivion Remastered’s new look is not to be trifled with. Even with DLSS/FSR upscaling support and \u003ca href=\"https://www.rockpapershotgun.com/dlss-3-how-it-works-how-it-performs-and-when-you-should-use-it\"\u003eframe generation\u003c/a\u003e, this is a tough one to run smoothly at its highest settings, especially if you deploy the ray tracing effects that (for once) really do enhance and enliven the scenery.\u003c/p\u003e\n\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" src=\"\"/\u003e\n\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003e1\u003c/span\u003e \u003cspan\u003eof\u003c/span\u003e \u003cspan\u003e12\u003c/span\u003e \u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003e\nCaption          \u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003e\nAttribution          \u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eComparing the bump maps of every blade of glass isn\u0026#39;t the point of this article, but it would be strange not to do any before-and-aftering at all, so: here ya go.\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eLower-end gear isn’t off the table – even the \u003ca href=\"https://www.rockpapershotgun.com/oblivion-remastered-steam-deck-settings-performance\"\u003eSteam Deck can manage reasonable framerates\u003c/a\u003e – though I will recommend some tactical quality reductions in the guide further down. First, and because its, \u003ca href=\"https://www.rockpapershotgun.com/an-official-elder-scrolls-oblivion-remake-will-release-as-soon-as-next-month-claims-report\"\u003euh\u003c/a\u003e, \u003ca href=\"https://www.rockpapershotgun.com/we-have-no-official-information-on-an-oblivion-remake-say-bethesda-which-isnt-a-denial-is-it\"\u003eattempt\u003c/a\u003e at shadowdropping meant we skipped the usual pre-release infodumps, let’s get acquainted with Oblivion Remastered’s system requirements and how they measure up to performance reality.\u003c/p\u003e\n\u003chr/\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/Oblivion-Remastered-Ungolim.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A terse conversation with Ungolim the Wood Elf in The Elder Scrolls IV: Oblivion Remastered.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Oblivion-Remastered-Ungolim.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Oblivion-Remastered-Ungolim.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Oblivion-Remastered-Ungolim.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRock Paper Shotgun/Bethesda Softworks\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003ch2\u003eThe Elder Scrolls IV: Oblivion Remastered system requirements and PC performance\u003c/h2\u003e\n\u003cp\u003eThese aren’t the haughtiest requirements I’ve seen from a UE5 production, to be fair. Graphics cards like the RX 5700 and GTX 1070 Ti will probably seem like excessive minimums to anyone still playing OG Oblivs on their GeForce 7600 GT, but they’re old themselves by 2025 standards. I’m more concerned about the recommended list’s 32GB of RAM, which ain’t a little, and the bulging 125GB \u003ca href=\"https://www.rockpapershotgun.com/best-ssd-for-gaming\"\u003eSSD\u003c/a\u003e requirement. That’s quite the pile of high-def chainmail textures.\u003c/p\u003e\n\u003ch3\u003eThe Elder Scrolls IV: Oblivion Remastered minimum PC specs\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eOS:\u003c/strong\u003e Windows 10 version 21H1 (10.0.19043)\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eCPU:\u003c/strong\u003e AMD Ryzen 5 2600X / Intel Core i7-6800K\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eRAM:\u003c/strong\u003e 16GB\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eGPU:\u003c/strong\u003e AMD Radeon RX 5700 / Nvidia GeForce GTX 1070 Ti\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eDirectX:\u003c/strong\u003e Version 12\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eStorage:\u003c/strong\u003e 125GB available space, SSD required\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eThe Elder Scrolls IV: Oblivion Remastered recommended PC specs\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eOS:\u003c/strong\u003e Windows 10/11 (with updates)\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eCPU:\u003c/strong\u003e AMD Ryzen 5 3600X / Intel Core i5-10600K\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eRAM:\u003c/strong\u003e 32GB\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eGPU:\u003c/strong\u003e AMD Radeon RX 6800XT / Nvidia GeForce RTX 2080\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eDirectX:\u003c/strong\u003e Version 12\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eStorage:\u003c/strong\u003e 125GB available space, SSD required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThere’s no getting around the remaster’s considerable girth, though evidence suggests that at least the GPU requirements err on the overly cautious. In the relatively demanding overworld section I used for benchmarking, the GTX 1070 – that’s the base, non-Ti version – averaged a more-than-adequate 43fps at 1080p, simply using the Low preset. The GTX 1070 Ti should, therefore, be plenty.\u003c/p\u003e\n\u003cp\u003eElsewhere in the cheaper neighbourhoods of PC hardware, the RTX 4060 could just about handle the Ultra preset at 1080p, scoring 33fps. High would be a better starting point, though, producing 53fps, while Medium pumped out a nifty 80fps. Steering clear of Ultra also worked out for the RTX 3070, which on the High preset ended up with 59fps at 1080p, as well as 55fps at 1440p after adding DLSS on Quality mode. Just to get in some premium representation, I also tried the RTX 5080 at 4K, where (on the Ultra preset with DLSS on Quality) it averaged 62fps before climbing to 105fps with frame generation.\u003c/p\u003e\n\u003cp\u003eYou’ll note that none of these results are especially horrid, and to be clear, these are averages taken from a more straining patch of Cyrodiil; castles, caves, and dungeons will run much faster, owing to their simpler and tighter interiors. Even so, that lack of consistency is a concern in itself, since you essentially need to tune Oblivion Remastered’s graphics settings for a kind of worst-case scenario. What’s more, all of those results use the default Lumen lighting effect setting of Low-quality, software-based ray tracing, which isn’t very demanding but lacks the depth and the detailing that hardware-based Lumen offers in exchange for its higher frame tax.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" src=\"\"/\u003e\n\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003e1\u003c/span\u003e \u003cspan\u003eof\u003c/span\u003e \u003cspan\u003e2\u003c/span\u003e \u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003e\nCaption          \u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003e\nAttribution          \u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/figure\u003e\n\u003cp\u003eSadly, the biggest performance headache seems to flare up regardless of how mighty your hardware is: our old friend, stutter. This is a regular occurrence when free-roaming, with hitch-fits sometimes lasting for several seconds, and can even occur when performing such mundane tasks as exiting the waiting screen or opening the pause menu. Some patching work is definitely needed here, and in truth, some of the new visuals could do with touchups while Virtuos are at it. I’ve repeatedly seen glimmers of equipped weapons or nearby trees erroneously melded into screen space reflections, and whatever this lady is doing with her skirt, ma’am, it isn’t working.\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/Oblivion-Remastered-texture-glitch.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A texture glitch in The Elder Scrolls IV: Oblivion Remastered.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Oblivion-Remastered-texture-glitch.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Oblivion-Remastered-texture-glitch.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Oblivion-Remastered-texture-glitch.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRock Paper Shotgun/Bethesda Softworks\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eWeirdly, the remaster still feels like it improves the structural integrity of Oblivion as well as the graphical fidelity. Install the original game today without mods and you’ll find no shortage of unfixed technical bizarreries, from hideous blurring on high framerates to a deranged options menu that disables anti-aliasing on the Ultra preset because the game thinks AA and HDR lighting are mutually exclusive. Oblivion Remastered has bugs and stuttering, sure, but it’s not broken and/or mad in the same kinds of ways – you just need to make sure that when framerates fall, you’ve given yourself enough headroom to stay out of the red.\u003c/p\u003e\n\u003chr/\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/Oblivion-Remastered-Stunted-Scamp.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"Fighting a daedric Stunted Scamp in The Elder Scrolls IV: Oblivion Remastered.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Oblivion-Remastered-Stunted-Scamp.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Oblivion-Remastered-Stunted-Scamp.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Oblivion-Remastered-Stunted-Scamp.png?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRock Paper Shotgun/Bethesda Softworks\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003ch2\u003eThe Elder Scrolls IV: Oblivion Remastered best settings\u003c/h2\u003e\n\u003cp\u003eActually, correction: Oblivion Remastered can be a tiny bit mad. The relative performance of each quality preset is far, far more than the some of their parts – when I tested each setting individually, lowering them from Ultra to Medium to see which ate up the most frames, only shadows quality had a major impact. This would suggest that all the others could be left on Ultra with minimal performance drawback, except shadows alone couldn’t account for the vast differences between each preset. On the RTX 4060, remember, Ultra averaged 33fps at 1080p while Medium averaged 80fps, yet setting only shadow quality to Medium (and keeping everything else on Ultra) only produced 43fps.\u003c/p\u003e\n\u003cp\u003eI’m therefore going to suggest High, rather than Ultra, as a starting point from which to make further tweaks. There’s evidently some manner of Voltron effect with most of the individual settings, where cutting them piecemeal achieves little compared to gathering a whole set of reductions together, and it’s not like High is ugly anyhow.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" src=\"\"/\u003e\n\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003e1\u003c/span\u003e \u003cspan\u003eof\u003c/span\u003e \u003cspan\u003e4\u003c/span\u003e \u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003e\nCaption          \u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003e\nAttribution          \u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/figure\u003e\n\u003cp\u003eNevertheless, it’s worth dropping shadows another level down, and I did get a smaller framerate boost from snipping global illumination quality, so that makes the list as well. Here’s what I’ve landed on:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eMotion blur:\u003c/strong\u003e Off\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eScreen space reflections:\u003c/strong\u003e On\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eShadow quality:\u003c/strong\u003e Medium\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eGlobal illumination quality:\u003c/strong\u003e Medium\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eUpscaling technique:\u003c/strong\u003e DLSS/FSR 3 on Quality\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eLumen hardware RT:\u003c/strong\u003e On\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eLumen hardware RT lighting mode:\u003c/strong\u003e High\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eEverything else:\u003c/strong\u003e High\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHardware-based RT can be skipped if you’re on an older GPU that isn’t up to it, but otherwise, this is the one luxury you should afford yourself if you can. It might not replicate the original game’s blinding bloom but it does deliver more of a sun-kissed look that suits the leafy Cyrodiil rather well. Lowering shadows and global illumination, while adding upscaling, also provides the framerate headroom to accommodate ray traced effects: on the RTX 4060 at 1080p, these settings scored 63fps, nearly double the speed of the Ultra preset just with software-based RT. By comparison, the same settings with software Lumen on Low quality produced 74fps, so the smoothness gap isn’t some yawning chasm.\u003c/p\u003e\n\u003cp\u003eAlso, I wouldn’t consider it important enough to include in a list of the air-quote \u0026#34;best\u0026#34; settings, but DLSS frame generation also works fairly well if you’re already pumping out at least 60fps or so without it; this healthy supply of traditionally rendered frames helps absorb the input lag increase from sprinkling in the generated frames. I wouldn’t bother with FSR frame gen, though. Even with a strong foundation of normal frames, it has less of a grasp on consistent frame \u003cem\u003etimings\u003c/em\u003e, so the results are noticeably less smooth than DLSS when walking. And this is still a Bethesda RPG, so there\u0026#39;s a fair bit of that.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-04-25T15:35:44.382646Z",
  "modifiedTime": null
}
