{
  "id": "64678c1b-19ec-4fa6-9344-68bdb51960b1",
  "title": "Undermine(d): How World of Warcraft’s New Update Added Driveable (and Driftable) Vehicles",
  "link": "https://news.xbox.com/en-us/2025/02/26/undermined-world-of-warcraft-update-vehicles/",
  "description": "The post Undermine(d): How World of Warcraft’s New Update Added Driveable (and Driftable) Vehicles appeared first on Xbox Wire.",
  "author": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "published": "Wed, 26 Feb 2025 19:00:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "PC Gaming",
    "11.1",
    "Battle.net",
    "Blizzard",
    "PC",
    "Undermine(d)",
    "Update",
    "World of Warcraft",
    "Xbox"
  ],
  "byline": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "length": 5053,
  "excerpt": "In World of Warcraft’s latest update, you don’t got friends – you got family. One of the lead developers for Undermine(d) joins us to talk about the new driveable vehicles, the zone’s design,, and bringing drifting to Azeroth.",
  "siteName": "Xbox Wire",
  "favicon": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "SummaryOne of the lead developers for Undermine(d) joins us to talk about the latest chapter for World of Warcraft.This new city is unlike any we’ve seen before in Azeroth, bustling with life, with streets made for speed!Find out more about how you’ll drive and drift around city streets in brand new hot rods. Imagine taking New York and smashing it into a steampunk vibe where safety doesn’t matter. That’s the feeling you get when you step into Undermine, the new zone that went live this week in World of Warcraft. I had the pleasure of leading this zone’s design alongside my super talented teammates on the WoW team – and I’d love to tell you more about this never-before-seen goblin city… and its wild, driveable vehicles. Deep Dive, Then D.R.I.V.E. Adding a dynamic twist to the World of Warcraft experience, this new update introduces the D.R.I.V.E. feature, also known as our Dynamic and Revolutionary Improvement to Vehicular Experiences (we took that acronym and manifested it into that mouthful, you’re welcome! It’s sick). This new feature allows players to travel on the ground with a mechanically intriguing G-99 Breakneck – otherwise known as WoW’s take on a hot rod. You will unlock this car pretty early while questing – complete “Eyes from Above” in the main campaign, then accept “No More Walkin’ Here” and progress through the Breakneck’s tutorial. The design philosophy behind these vehicles is rooted in the art style of World of Warcraft goblins, where everything looks cobbled together yet oddly ingenious. The G-99 Breakneck has exaggerated features—like massive flames shooting from the scoop—which fit perfectly within the chaotic streets of Undermine. One of the key aspects we wanted to bring to this feature was the ability to drift, which is a classic mechanic in older racing games. Bringing this to World of Warcraft was a challenge, but it ignited excitement across the team. Our goal was to capture that feeling of freedom and control, akin to the sensation of getting your first car and the newfound access it brings. The car isn’t just for getting around; it’s also a passenger mount, allowing friends to join in and explore the streets of Undermine together. Players can participate in races, testing their skills on both regular and reverse courses. For those who might get motion sick or find the speed too much, we’ve ensured that the experience is accessible, offering options to customize with a lower top-speed engine immediately after unlocking the car, or to use regular ground mounts instead—whichever you prefer. Take to the Streets But your new car would be nothing without somewhere interesting to drive it. In Undermine, you’ll see these cars racing around you, providing both a vibrant backdrop to your adventures and an invitation to join in the chaos. Tasks like delivering hot towels, or fighting a ghostly tiger that is rudely scaring children, allow you to become a true part of the fabric of the city. As you can probably tell, Undermine is full of life. As you drift your car around the streets (above sewers with fighting rings in them!), you will encounter pirates, mobsters, people who want to break your ankles, the best cooks you’ve ever met, and so much more. Beneath Undermine’s false sky is a city that bustles with energy, a hub of commerce and culture for goblins. This diverges from the usual city landscapes you’d see in World of Warcraft—this is a densely populated city that’s very much lived in, bustling with life as people go about their day-to-day business. The zone itself is a testament to the possibility of more. With features like Slam Central Station, which can take you anywhere your imagination permits, Undermine stands as a beacon of goblin ingenuity and ambition. The city is filled with cleverly named landmarks like the Incontinental Hotel and the Gallagio, reflecting a unique society driven by growth. The narrative of Undermine is all about bettering one’s circumstances. It ties into the main storyline of The War Within, with characters like Orweyna introducing players to the Ringing Deeps and the initial chapters of the story. You’ll meet (or be reintroduced to, if you’ve played in the past) characters like Renzik and Gazlowe, who provide a window into the lives of those who call Undermine home. While some characters, like Gazlowe, left to find something different, others see Undermine as their home—for some, there’s anywhere but home. For others, there’s no place like home. As the story unfolds, Gazlowe undergoes a change of heart, leading to a revolution where players can take down dictators and liberate the streets. This narrative of reclaiming the city highlights the power of the people over oppressive forces. Join us in Undermine, a city of fast wheels and dark deals. It doesn’t matter if you drift an inch or a yard, drifting’s drifting! The Undermine(d) update is live now in World of Warcraft, available on PC via Battle.net. To learn more, visit WorldOfWarcraft.com.",
  "image": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_3840x2160-2130be54d3dd3074de04.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cdiv\u003e\u003ch3\u003eSummary\u003c/h3\u003e\u003cul\u003e\u003cli\u003eOne of the lead developers for Undermine(d) joins us to talk about the latest chapter for \u003cem\u003eWorld of Warcraft\u003c/em\u003e.\u003c/li\u003e\u003cli\u003eThis new city is unlike any we’ve seen before in Azeroth, bustling with life, with streets made for speed!\u003c/li\u003e\u003cli\u003eFind out more about how you’ll drive and drift around city streets in brand new hot rods.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003eImagine taking New York and smashing it into a steampunk vibe where safety doesn’t matter. That’s the feeling you get when you step into Undermine, the new zone that went live this week in \u003cem\u003eWorld of Warcraft\u003c/em\u003e. I had the pleasure of leading this zone’s design alongside my super talented teammates on the \u003cem\u003eWoW\u003c/em\u003e team – and I’d love to tell you more about this never-before-seen goblin city… and its wild, driveable vehicles.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eDeep Dive, Then D.R.I.V.E.\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Mount-c762ac95d12027173dfa.jpg\" alt=\"WoW Undermine(d) Screenshot\" srcset=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Mount-c762ac95d12027173dfa.jpg 1920w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Mount-c762ac95d12027173dfa-768x432.jpg 768w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Mount-c762ac95d12027173dfa-1024x576.jpg 1024w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Mount-c762ac95d12027173dfa-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAdding a dynamic twist to the \u003cem\u003eWorld of Warcraft\u003c/em\u003e experience, this new update introduces the D.R.I.V.E. feature, also known as our Dynamic and Revolutionary Improvement to Vehicular Experiences (we took that acronym and manifested it into that mouthful, you’re welcome! It’s sick).\u003c/p\u003e\n\n\n\n\u003cp\u003eThis new feature allows players to travel on the ground with a mechanically intriguing G-99 Breakneck – otherwise known as \u003cem\u003eWoW\u003c/em\u003e’s take on a hot rod. You will unlock this car pretty early while questing – complete “Eyes from Above” in the main campaign, then accept “No More Walkin’ Here” and progress through the Breakneck’s tutorial. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe design philosophy behind these vehicles is rooted in the art style of World of Warcraft goblins, where everything looks cobbled together yet oddly ingenious. The G-99 Breakneck has exaggerated features—like massive flames shooting from the scoop—which fit perfectly within the chaotic streets of Undermine.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_7-e99c97eb0c356e1aff47.jpg\" alt=\"WoW Undermine(d) Screenshot\" srcset=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_7-e99c97eb0c356e1aff47.jpg 1920w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_7-e99c97eb0c356e1aff47-768x432.jpg 768w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_7-e99c97eb0c356e1aff47-1024x576.jpg 1024w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_7-e99c97eb0c356e1aff47-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eOne of the key aspects we wanted to bring to this feature was the ability to drift, which is a classic mechanic in older racing games. Bringing this to \u003cem\u003eWorld of Warcraft\u003c/em\u003e was a challenge, but it ignited excitement across the team. Our goal was to capture that feeling of freedom and control, akin to the sensation of getting your first car and the newfound access it brings.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe car isn’t just for getting around; it’s also a passenger mount, allowing friends to join in and explore the streets of Undermine together. Players can participate in races, testing their skills on both regular and reverse courses. For those who might get motion sick or find the speed too much, we’ve ensured that the experience is accessible, offering options to customize with a lower top-speed engine immediately after unlocking the car, or to use regular ground mounts instead—whichever you prefer.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eTake to the Streets\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_10-8379e3dc15eceba50d62.jpg\" alt=\"WoW Undermine(d) Screenshot\" srcset=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_10-8379e3dc15eceba50d62.jpg 1920w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_10-8379e3dc15eceba50d62-768x432.jpg 768w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_10-8379e3dc15eceba50d62-1024x576.jpg 1024w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_10-8379e3dc15eceba50d62-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eBut your new car would be nothing without somewhere interesting to drive it. In Undermine, you’ll see these cars racing around you, providing both a vibrant backdrop to your adventures and an invitation to join in the chaos. Tasks like delivering hot towels, or fighting a ghostly tiger that is rudely scaring children, allow you to become a true part of the fabric of the city.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs you can probably tell, Undermine is full of life. As you drift your car around the streets (above sewers with fighting rings in them!), you will encounter pirates, mobsters, people who want to break your ankles, the best cooks you’ve ever met, and so much more.\u003c/p\u003e\n\n\n\n\u003cp\u003eBeneath Undermine’s false sky is a city that bustles with energy, a hub of commerce and culture for goblins. This diverges from the usual city landscapes you’d see in \u003cem\u003eWorld of Warcraft\u003c/em\u003e—this is a densely populated city that’s very much lived in, bustling with life as people go about their day-to-day business.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe zone itself is a testament to the possibility of more. With features like Slam Central Station, which can take you anywhere your imagination permits, Undermine stands as a beacon of goblin ingenuity and ambition. The city is filled with cleverly named landmarks like the Incontinental Hotel and the Gallagio, reflecting a unique society driven by growth.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_6-ccb5507cb626d8396709.jpg\" alt=\"WoW Undermine(d) Screenshot\" srcset=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_6-ccb5507cb626d8396709.jpg 1920w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_6-ccb5507cb626d8396709-768x432.jpg 768w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_6-ccb5507cb626d8396709-1024x576.jpg 1024w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/02/WoW_The_War_Within_Undermined_Location_Screenshots_6-ccb5507cb626d8396709-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe narrative of Undermine is all about bettering one’s circumstances. It ties into the main storyline of \u003cem\u003eThe War Within\u003c/em\u003e, with characters like Orweyna introducing players to the Ringing Deeps and the initial chapters of the story. You’ll meet (or be reintroduced to, if you’ve played in the past) characters like Renzik and Gazlowe, who provide a window into the lives of those who call Undermine home. While some characters, like Gazlowe, left to find something different, others see Undermine as their home—for some, there’s anywhere but home. For others, there’s no place like home.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs the story unfolds, Gazlowe undergoes a change of heart, leading to a revolution where players can take down dictators and liberate the streets. This narrative of reclaiming the city highlights the power of the people over oppressive forces.\u003c/p\u003e\n\n\n\n\u003cp\u003eJoin us in Undermine, a city of fast wheels and dark deals. It doesn’t matter if you drift an inch or a yard, drifting’s drifting!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe Undermine(d) update is live now in World of Warcraft, available on PC via Battle.net. To learn more, visit \u003c/em\u003e\u003ca href=\"https://www.worldofwarcraft.com\"\u003e\u003cem\u003eWorldOfWarcraft.com\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-02-26T19:00:00Z",
  "modifiedTime": "2025-02-25T11:19:23Z"
}
