{
  "id": "69e90264-9ae1-4235-b552-2d38c5f94b52",
  "title": "Quote of the Day – Needless AI Puffery",
  "link": "https://tagn.wordpress.com/2024/12/01/quote-of-the-day-ai-puffery/",
  "description": "I am somewhat torn on this quote of the day, the text of which I will get to in a bit.  On the one hand, I am obviously fine highlighting dumb, hypocritical, or just outright wrong things that people say about video games.  (Occasionally QotD is a positive quote, but mostly it is dumb things […]",
  "author": "Wilhelm Arcturus",
  "published": "Sun, 01 Dec 2024 16:15:40 +0000",
  "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
  "categories": [
    "entertainment",
    "Quote of the Day",
    "AI",
    "Bond Villains",
    "Dumb Ideas",
    "Elon Musk"
  ],
  "byline": "by Wilhelm Arcturus",
  "length": 6872,
  "excerpt": "I am somewhat torn on this quote of the day, the text of which I will get to in a bit. On the one hand, I am obviously fine highlighting dumb, hypocritical, or just outright wrong things that peop…",
  "siteName": "The Ancient Gaming Noob",
  "favicon": "",
  "text": "I am somewhat torn on this quote of the day, the text of which I will get to in a bit.  On the one hand, I am obviously fine highlighting dumb, hypocritical, or just outright wrong things that people say about video games.  (Occasionally QotD is a positive quote, but mostly it is dumb things bad people said.) On the other hand, I want to be done with X.com and the destruction of Twitter, to leave all of that behind, and to not promote the right wing authoritarian fan club it has become under Elon who has jiggered the algorithm to promote the end of democracy and billionaire autocratic rule… and his own words most of all… in a seeming answer to the musical question, “What if we had free speech, but just for Nazi sympathizers?”  I don’t want to further that, even negatively, unless it is something very on topic for me. So Elon has to say something both relevant to my interests and so dumb and such a bad idea that I am willing to go there, to mark the moment down, to quote it for truth as we used to say back in the day. And just getting on the topic of video games isn’t enough for me.  Elon out there claiming he is a world-wide top 20 Diablo IV player…  as I said previously if being CEO of multiple companies leaves him enough free time to do that AND hang out with Trump for weeks AND shit post on X all day, then the position of CEO is clearly that of overpaid sinecure… is completely preposterous.  It is unworthy of anything besides mockery.  He is that guy in 2006 who paid a WoW leveling service to he could be a raider then had to bribe his guild to carry him and let him have the drop he wants so he could flaunt it in Stormwind… if he owns a competitive Diablo IV account at all. But then we got to this doozy, which I could not ignore because all sorts of online publications felt the need to report on and amplify this.  Elon saying he is going to create an AI driven game studio is the core… though there is so much more there to unpack. Elon says a lot of things… We’ll leave aside the provoking comment, which says game devs and journos have been “ideologically captured.”  I guess points for not saying “woke?”  But the quick parse gut reaction to that comment ought to be “Gamergate troll is back to trolling” which ought to warrant no more than a block, at least on a service that allowed that action.  They were probably trying for a Mark Kern reply and hit the jackpot. And then there is Elon, whose lack of self-awareness remains simply astonishing.  His self image is still a fantasy of being the hero fighting against the bullies who shoved him in a locker back in school… who somehow all went “woke” or something… I don’t know, was he bullied by the girls field hockey team or something… rather than him being the peak symbol of the inequities of capitalism and the control of everything by the billionaire class.  He is the bad guy here, the oppressor, the manifestation of the uncaring ruling class that takes all it can and leaves as little as possible for the rest of us. As somebody put it elsewhere… I’ve seen variations of this over the last year… he is very much a Bond villain, only one without panache, charisma, a sense of humor, or anything like a real plan besides just get richer.  Not that money isn’t a Bond villain motive, something I covered in a post a decade back.  He is like Auric Goldfinger without without wit and an implausible plan to increase his wealth via Doge Coin rather than gold. You know… that might make a decent script… except you would have to have a personable actor play the role and write some decent lines for them, because going with actual Elon would be a step below a Woody Allen parody of a Bond Villain, which would at least be mildly amusing. (See Casino Royale, 1967 version.)  I put forward Lucy Liu for the role.  She can be hard as nails and the choice would make Elon cry some more. Anyway, after getting past the idea that he is not the embodiment of massive corporations and their owners, there is actual plan, which is the point of the post I guess.  He wants to use his xAI venture to start a game studio.  Where to even begin? Off the top I would say this will never happen.  He’ll get AI to make Full Self Driving work before he gets to a video game studio, and he’ll never make FSD work because he is trying to cheap skate his way into making it work by leaning hard on software to keep the hardware price down.  Waymo, which has FSD mostly working up in SF, invested in more and better sensors. It is just another Elon promise to excite the market which the gullible media takes at face value and rushes to report on.  If you go Google “elon video game studio” you will get so many responses that you can see why I am not worried about somehow promoting his vision.  There is too much competition to carry his water already. And, while some get through to the point… that it seems unlikely to be a viable idea and that Elon fails to follow through on these sorts of things all the time… the impression left by the haystack of headlines is that this is somehow a real plan. Then there is the secondary effect of leaving people with the idea that AI could, you know, make a video game that would not only be playable, but that would make video gaming “great again” for whatever adolescent definition “great” he has in mind.  (I would guess it would be along the lines of “female characters all need big boobs and no dialog.”) The reaction of people in the actual video game industry has been telling.  Derek Smart was quoted in the PC Gamer article about it (which at least called bullshit on the idea after some dithering) quipping about “massive corporations” (after all, who but a massive corporation could afford the server farm to even attempt to make an AI video game) while the same cast of characters who dismissed the idea that NFTs would magically make items transferable between games rolled their eyes at the idea that AI would be able to make video games at all. Greg “Ghostcrawler” Street over on Blue Sky put up a stand alone comment about AI that seemed to be prompted by the whole Elon idea. Ghostcrawler on AI That gets at one of the largest objections to AI, that those behind the idea seem hell bent on AI doing all the fun and creative things, the things that often make jobs worth doing, and not focusing on the grunt work where AI’s help might actually be appreciated. Anyway, I am throwing this QotD post out there less as a marker about something I expect to come to pass and more of something I can reference as “remember that time Elon said he was going to make video games?” for years and years to come. Anyway, to sum up: He’s not going to start a video game studio, that is just more hot air If he did, it would not produce a video game worth playing with or without AI The media will mostly repeat whatever he says with little to no skepticism",
  "image": "https://tagn.wordpress.com/wp-content/uploads/2024/11/ghostcrawlerai.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\u003cp\u003eI am somewhat torn on this quote of the day, the text of which I will get to in a bit.  On the one hand, I am obviously fine highlighting dumb, hypocritical, or just outright wrong things that people say about video games.  (Occasionally QotD is a positive quote, but mostly it is dumb things bad people said.)\u003c/p\u003e\n\u003cp\u003eOn the other hand, I want to be done with X.com and the destruction of Twitter, to leave all of that behind, and to not promote the right wing authoritarian fan club it has become under Elon who has jiggered the algorithm to promote the end of democracy and billionaire autocratic rule… and his own words most of all… in a seeming answer to the musical question, “What if we had free speech, but just for Nazi sympathizers?”  I don’t want to further that, even negatively, unless it is something very on topic for me.\u003c/p\u003e\n\u003cp\u003eSo Elon has to say something both relevant to my interests and so dumb and such a bad idea that I am willing to go there, to mark the moment down, to quote it for truth as we used to say back in the day.\u003c/p\u003e\n\u003cp\u003eAnd just getting on the topic of video games isn’t enough for me.  Elon out there \u003ca href=\"https://www.theverge.com/2024/11/5/24288836/elon-musk-top-20-diablo-4-players-the-pit\"\u003eclaiming he is a world-wide top 20 \u003cem\u003eDiablo IV\u003c/em\u003e player\u003c/a\u003e…  as I said previously if being CEO of multiple companies leaves him enough free time to do that AND hang out with Trump for weeks AND shit post on X all day, then the position of CEO is clearly that of overpaid sinecure… is completely preposterous.  It is unworthy of anything besides mockery.  He is that guy in 2006 who paid a \u003cem\u003eWoW\u003c/em\u003e leveling service to he could be a raider then had to bribe his guild to carry him and let him have the drop he wants so he could flaunt it in Stormwind… if he owns a competitive \u003cem\u003eDiablo IV\u003c/em\u003e account at all.\u003c/p\u003e\n\u003cp\u003eBut then we got to this doozy, which I could not ignore because all sorts of online publications felt the need to report on and amplify this.  Elon saying he is going to create an AI driven game studio is the core… though there is so much more there to unpack.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_125327\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2024/11/elon_gamestudio_dumb.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-125327\" data-attachment-id=\"125327\" data-permalink=\"https://tagn.wordpress.com/2024/12/01/quote-of-the-day-ai-puffery/elon_gamestudio_dumb/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/11/elon_gamestudio_dumb.png\" data-orig-size=\"600,388\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"Elon_GameStudio_dumb\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Elon says a lot of things…\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/11/elon_gamestudio_dumb.png?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/11/elon_gamestudio_dumb.png?w=600\" src=\"https://tagn.wordpress.com/wp-content/uploads/2024/11/elon_gamestudio_dumb.png\" alt=\"\" width=\"600\" height=\"388\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2024/11/elon_gamestudio_dumb.png 600w, https://tagn.wordpress.com/wp-content/uploads/2024/11/elon_gamestudio_dumb.png?w=150\u0026amp;h=97 150w, https://tagn.wordpress.com/wp-content/uploads/2024/11/elon_gamestudio_dumb.png?w=500\u0026amp;h=323 500w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-125327\"\u003eElon says a lot of things…\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eWe’ll leave aside the provoking comment, which says game devs and journos have been “ideologically captured.”  I guess points for not saying “woke?”  But the quick parse gut reaction to that comment ought to be “Gamergate troll is back to trolling” which ought to warrant no more than a block, at least on a service that allowed that action.  They were probably trying for a Mark Kern reply and hit the jackpot.\u003c/p\u003e\n\u003cp\u003eAnd then there is Elon, whose lack of self-awareness remains simply astonishing.  His self image is still a fantasy of being the hero fighting against the bullies who shoved him in a locker back in school… who somehow all went “woke” or something… I don’t know, was he bullied by the girls field hockey team or something… rather than him being the peak symbol of the inequities of capitalism and the control of everything by the billionaire class.  He is the bad guy here, the oppressor, the manifestation of the uncaring ruling class that takes all it can and leaves as little as possible for the rest of us.\u003c/p\u003e\n\u003cp\u003eAs somebody put it elsewhere… I’ve seen variations of this over the last year… he is very much a Bond villain, only one without panache, charisma, a sense of humor, or anything like a real plan besides just get richer.  Not that money isn’t a Bond villain motive, something \u003ca href=\"https://tagn.wordpress.com/2013/02/23/the-problem-with-bond-villains/\"\u003eI covered in a post a decade back\u003c/a\u003e.  He is like Auric Goldfinger without without wit and an implausible plan to increase his wealth via Doge Coin rather than gold.\u003c/p\u003e\n\u003cp\u003eYou know… that might make a decent script… except you would have to have a personable actor play the role and write some decent lines for them, because going with actual Elon would be a step below a Woody Allen parody of a Bond Villain, which would at least be mildly amusing. (See \u003ca href=\"https://en.wikipedia.org/wiki/Casino_Royale_(1967_film)\"\u003e\u003cem\u003eCasino Royale\u003c/em\u003e, 1967 version\u003c/a\u003e.)  I put forward Lucy Liu for the role.  She can be hard as nails and the choice would make Elon cry some more.\u003c/p\u003e\n\u003cp\u003eAnyway, after getting past the idea that he is not the embodiment of massive corporations and their owners, there is actual plan, which is the point of the post I guess.  He wants to use his xAI venture to start a game studio.  Where to even begin?\u003c/p\u003e\n\u003cp\u003eOff the top I would say this will never happen.  He’ll get AI to make Full Self Driving work before he gets to a video game studio, and he’ll never make FSD work because he is trying to cheap skate his way into making it work by leaning hard on software to keep the hardware price down.  Waymo, which has FSD mostly working up in SF, invested in more and better sensors.\u003c/p\u003e\n\u003cp\u003eIt is just another Elon promise to excite the market which the gullible media takes at face value and rushes to report on.  If you go Google “elon video game studio” you will get so many responses that you can see why I am not worried about somehow promoting his vision.  There is too much competition to carry his water already.\u003c/p\u003e\n\u003cp\u003eAnd, while some get through to the point… that it seems unlikely to be a viable idea and that Elon fails to follow through on these sorts of things all the time… the impression left by the haystack of headlines is that this is somehow a real plan.\u003c/p\u003e\n\u003cp\u003eThen there is the secondary effect of leaving people with the idea that AI could, you know, make a video game that would not only be playable, but that would make video gaming “great again” for whatever adolescent definition “great” he has in mind.  (I would guess it would be along the lines of “female characters all need big boobs and no dialog.”)\u003c/p\u003e\n\u003cp\u003eThe reaction of people in the actual video game industry has been telling.  Derek Smart was quoted in the \u003ca href=\"https://www.pcgamer.com/gaming-industry/elon-musk-says-too-many-game-studios-are-owned-by-giant-corporations-so-his-giant-corporation-is-going-to-start-a-studio-to-make-games-great-again/\"\u003ePC Gamer article\u003c/a\u003e about it (which at least called bullshit on the idea after some dithering) quipping about “massive corporations” (after all, who but a massive corporation could afford the server farm to even attempt to make an AI video game) while the same cast of characters who dismissed the idea that NFTs would magically make items transferable between games rolled their eyes at the idea that AI would be able to make video games at all.\u003c/p\u003e\n\u003cp\u003eGreg “Ghostcrawler” Street over on Blue Sky put up a stand alone comment about AI that seemed to be prompted by the whole Elon idea.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_125330\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2024/11/ghostcrawlerai.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-125330\" data-attachment-id=\"125330\" data-permalink=\"https://tagn.wordpress.com/2024/12/01/quote-of-the-day-ai-puffery/ghostcrawlerai/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/11/ghostcrawlerai.png\" data-orig-size=\"600,248\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"GhostcrawlerAI\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Ghostcrawler on AI\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/11/ghostcrawlerai.png?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/11/ghostcrawlerai.png?w=600\" src=\"https://tagn.wordpress.com/wp-content/uploads/2024/11/ghostcrawlerai.png\" alt=\"\" width=\"600\" height=\"248\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2024/11/ghostcrawlerai.png 600w, https://tagn.wordpress.com/wp-content/uploads/2024/11/ghostcrawlerai.png?w=150\u0026amp;h=62 150w, https://tagn.wordpress.com/wp-content/uploads/2024/11/ghostcrawlerai.png?w=500\u0026amp;h=207 500w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-125330\"\u003eGhostcrawler on AI\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eThat gets at one of the largest objections to AI, that those behind the idea seem hell bent on AI doing all the fun and creative things, the things that often make jobs worth doing, and not focusing on the grunt work where AI’s help might actually be appreciated.\u003c/p\u003e\n\u003cp\u003eAnyway, I am throwing this QotD post out there less as a marker about something I expect to come to pass and more of something I can reference as “remember that time Elon said he was going to make video games?” for years and years to come.\u003c/p\u003e\n\u003cp\u003eAnyway, to sum up:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHe’s not going to start a video game studio, that is just more hot air\u003c/li\u003e\n\u003cli\u003eIf he did, it would not produce a video game worth playing with or without AI\u003c/li\u003e\n\u003cli\u003eThe media will mostly repeat whatever he says with little to no skepticism\u003c/li\u003e\n\u003c/ul\u003e\n\n\t\t\t\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-12-01T16:15:40Z",
  "modifiedTime": "2024-12-01T16:09:51Z"
}
