{
  "id": "7db3a90d-d0d5-4fe8-8f89-8ec9abb7b5c7",
  "title": "11-Month Battle Over AI Finally Ends As Striking Game Actors Reach Tentative Deal",
  "link": "https://kotaku.com/sag-aftra-strike-voice-actor-game-darth-vader-1851784189",
  "description": "A nearly year-long battle between SAG-AFTRA game actors and the major publishers over AI protections for performances is set to end, after both sides reached a tentative agreement this week. Details of the deal haven’t yet been released, but the union says it includes “necessary AI guardrails” as companies adopt tools…Read more...",
  "author": "Ethan Gach",
  "published": "Wed, 11 Jun 2025 20:54:10 GMT",
  "source": "https://kotaku.com/rss",
  "categories": [
    "blindlight llc",
    "formosa interactive llc",
    "blindlight",
    "spider man 2",
    "entertainment culture",
    "otto octavius",
    "zenless zone zero",
    "activision productions inc",
    "tim sweeney",
    "warner bros games",
    "shepard",
    "insomniac games inc",
    "william salyers",
    "duncan crabtree",
    "ashly burch",
    "darth vader",
    "take two interactive",
    "jennifer hale",
    "wb games inc",
    "epic games",
    "activision",
    "disney character voices inc",
    "electronic arts productions inc",
    "sag",
    "epic games inc",
    "sag aftra",
    "video game publishers",
    "ai",
    "voice acting",
    "sony",
    "electronic arts",
    "aloy",
    "2024present sag aftra video game strike"
  ],
  "byline": "Ethan Gach",
  "length": 4444,
  "excerpt": "Actors were replaced in Call of Duty and other games as the strike dragged on",
  "siteName": "Kotaku",
  "favicon": "https://i.kinja-img.com/image/upload/c_fill,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png",
  "text": "A nearly year-long battle between SAG-AFTRA game actors and the major publishers over AI protections for performances is set to end, after both sides reached a tentative agreement this week. Details of the deal haven’t yet been released, but the union says it includes “necessary AI guardrails” as companies adopt tools to copy, replicate, and alter the work of actors. Suggested ReadingWhy This Under-the-Radar AAA Title Is More Than Just A Far Cry CloneOffEnglishSuggested ReadingThe 10 companies involved in the agreement are Activision Productions Inc., Blindlight LLC, Disney Character Voices Inc., Electronic Arts Productions Inc., Epic Games Inc., Formosa Interactive LLC, Insomniac Games Inc., Take 2 Productions Inc., and WB Games Inc. SAG-AFTRA says more about the deal will be shared after members vote to ratify it in the coming weeks. The two sides are still hashing out the terms of the strike suspension agreement, however, so actors will remain on strike for a little longer. “Everyone at SAG-AFTRA is immensely grateful for the sacrifices made by video game performers and the dedication of the Interactive Media Agreement Negotiating Committee throughout these many months of the video game strike,” SAG-AFTRA chief negotiator Duncan Crabtree-Ireland said in a press release. “Patience and persistence has resulted in a deal that puts in place the necessary A.I. guardrails that defend performers’ livelihoods in the A.I. age, alongside other important gains.”The strike began last July, and while it involved demands for pay raises and better onsite working conditions, the biggest sticking point throughout negotiations was the role AI might play in voice recording and performance capture. While actors are currently paid on a session by session basis for specific performances, AI models would make it easy for companies to take that data and replicate an actor’s voice or movements, either altering their creative output or replacing it altogether. Back in March, Ashly Burch who plays Aloy in Horizon Zero Dawn shared her concerns about AI replacing actors after an internal tech demo at Sony showed an AI-controlled Aloy having a conversation with a player. SAG-AFTRA recently filed an unfair labor practice against Epic Games for using an AI-voiced Darth Vader in Fortnite while still in negotiations. Meanwhile, Epic CEO Tim Sweeney has said he foresees a possible future in which all NPCs are AI-controlled. As the strike continued throughout last fall and into 2025, actors in some games saw themselves replaced by other artists in projects like Call of Duty: Black Ops 6 and Zenless Zone Zero, as game companies sought to continue releasing updates. Games like Destiny 2, meanwhile, simply left some characters completely silent who would have otherwise voiced dialogue. Some SAG-AFTRA actors voiced their frustration with the duration of the strike in recent weeks. “I hope SAG-AFTRA is aware that, either intentionally or through negligence, an environment has been created around IMA negotiations whereby it is impossible to express a good-faith disagreement without being dismissed as anti-union, a management shill, or both,” voice actor William Salyers, who voiced Otto Octavius in Spider-Man 2, wrote on Threads last week. “The damage being done by this will persist long after the strike is settled.” Jennifer Hale, best known as Commander Shepard in Mass Effect, added, “Vilifying those differences only divides the community.”Update 6/11/2025 4:54 p.m. ET: The strike officially ended at 3:00 p.m. ET on June 11 as the national SAG-AFTRA board meets to review the tentative agreement and present to members for ratification. “We are pleased to have reached a tentative contract agreement that reflects the important contributions of SAG-AFTRA-represented performers in video games,” a spokesperson for the video game producers party to the Interactive Media Agreement wrote in a statement. “This agreement builds on three decades of successful partnership between the interactive entertainment industry and the union. It delivers historic wage increases of over 24% for performers, enhanced health and safety protections, and industry-leading AI provisions requiring transparency, consent and compensation for the use of digital replicas in games. We look forward to continuing to work with performers to create new and engaging entertainment experiences for billions of players throughout the world.”.",
  "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/ebe21c4208f161489a7be5c057f28243.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/sag-aftra-voice-actor-strike-gta-6-fortnite-delay-1851605783\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/sag-aftra-voice-actor-strike-gta-6-fortnite-delay-1851605783\"\u003eA nearly year-long battle\u003c/a\u003e\u003c/span\u003e between SAG-AFTRA game actors and the major publishers over AI protections for performances is set to end, after both sides reached a tentative agreement this week. Details of the deal haven’t yet been released, but the union says it \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/game-actor-strike-ai-sag-aftra-zenless-zone-zero-1851769447\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/game-actor-strike-ai-sag-aftra-zenless-zone-zero-1851769447\"\u003eincludes “necessary AI guardrails”\u003c/a\u003e\u003c/span\u003e as companies adopt tools to copy, replicate, and alter the work of actors. \u003cbr/\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cdiv data-video-id=\"196406\" data-monetizable=\"true\" data-position=\"sidebar\" data-video-title=\"Why This Under-the-Radar AAA Title Is More Than Just A Far Cry Clone\" data-video-blog-id=\"9\" data-video-network=\"kotaku\" data-video-duration=\"102\" data-playlist=\"196406,197583,197582\" data-current=\"196406\"\u003e\u003cdiv\u003e\u003cp\u003eWhy This Under-the-Radar AAA Title Is More Than Just A Far Cry Clone\u003c/p\u003e\u003c/div\u003e\u003cvideo disablepictureinpicture=\"\" muted=\"\" playsinline=\"\" width=\"100%\" height=\"100%\" crossorigin=\"anonymous\" preload=\"none\"\u003e\u003csource data-src=\"https://vid.kinja.com/prod/196406/196406_240p.mp4\" label=\"240p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/196406/196406_480p.mp4\" label=\"480p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/196406/196406_720p.mp4\" label=\"720p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/196406/196406_1080p.mp4\" label=\"1080p\" type=\"video/mp4\"/\u003e\u003ctrack kind=\"captions\" label=\"English\" src=\"https://kinja.com/api/videoupload/caption/21954.vtt\" srclang=\"en\"/\u003e\u003c/video\u003e\u003cdiv\u003e\u003cul\u003e\u003cli data-label=\"\"\u003eOff\u003c/li\u003e\u003cli data-label=\"English\"\u003eEnglish\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cp\u003eThe 10 companies involved in the agreement are Activision Productions Inc., Blindlight LLC, Disney Character Voices Inc., Electronic Arts Productions Inc., Epic Games Inc., Formosa Interactive LLC, Insomniac Games Inc., Take 2 Productions Inc., and WB Games Inc. SAG-AFTRA says more about the deal will be shared after members vote to ratify it in the coming weeks. The two sides are still hashing out the terms of the strike suspension agreement, however, so actors will remain on strike for a little longer. \u003cbr/\u003e\u003c/p\u003e\u003cp\u003e“Everyone at SAG-AFTRA is immensely grateful for the sacrifices made by video game performers and the dedication of the Interactive Media Agreement Negotiating Committee throughout these many months of the video game strike,” SAG-AFTRA chief negotiator Duncan Crabtree-Ireland said in a press release. “Patience and persistence has resulted in a deal that puts in place the necessary A.I. guardrails that defend performers’ livelihoods in the A.I. age, alongside other important gains.”\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/switch-2-splatoon-3-raiders-upgrade-price-maps-1851784179\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/switch-2-splatoon-3-raiders-upgrade-price-maps-1851784179\"\u003eThe strike began last July\u003c/a\u003e\u003c/span\u003e, and while it involved demands for pay raises and better onsite working conditions, the biggest sticking point throughout negotiations was the role AI might play in voice recording and performance capture. While actors are currently paid on a session by session basis for specific performances, AI models would make it easy for companies to take that data and replicate an actor’s voice or movements, either altering their creative output or replacing it altogether. \u003c/p\u003e\u003cp\u003eBack in March, Ashly Burch who plays Aloy in \u003cem\u003eHorizon Zero Dawn \u003c/em\u003e\u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/ashly-burch-ai-strike-aloy-horizon-zero-dawn-sony-1851770412\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/ashly-burch-ai-strike-aloy-horizon-zero-dawn-sony-1851770412\"\u003eshared her concerns\u003c/a\u003e\u003c/span\u003e about AI replacing actors after an internal tech demo at Sony showed an AI-controlled Aloy having a conversation with a player. SAG-AFTRA \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/fortnite-sagaftra-ai-darth-vader-ulp-voice-actor-strike-1851781401\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/fortnite-sagaftra-ai-darth-vader-ulp-voice-actor-strike-1851781401\"\u003erecently filed an unfair labor practice\u003c/a\u003e\u003c/span\u003e against Epic Games for using an AI-voiced Darth Vader in \u003cem\u003eFortnite\u003c/em\u003e while still in negotiations. Meanwhile, Epic CEO Tim Sweeney \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/fortnite-darth-vader-ai-npc-epic-disney-1851783545\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/fortnite-darth-vader-ai-npc-epic-disney-1851783545\"\u003ehas said he foresees a possible future\u003c/a\u003e\u003c/span\u003e in which all NPCs are AI-controlled. \u003c/p\u003e\u003cp\u003eAs the strike continued throughout last fall and into 2025, actors in some games saw themselves replaced by other artists in projects like\u003cem\u003e Call of Duty: Black Ops 6\u003c/em\u003e and \u003cem\u003eZenless Zone Zero\u003c/em\u003e, as game companies sought to continue releasing updates. Games like \u003cem\u003eDestiny 2\u003c/em\u003e, meanwhile, simply left some characters completely silent who would have otherwise voiced dialogue. Some SAG-AFTRA actors voiced their frustration with the duration of the strike in recent weeks. \u003c/p\u003e\u003cp\u003e“I hope SAG-AFTRA is aware that, either intentionally or through negligence, an environment has been created around IMA negotiations whereby it is impossible to express a good-faith disagreement without being dismissed as anti-union, a management shill, or both,” voice actor William Salyers, who voiced Otto Octavius in \u003cem\u003eSpider-Man 2\u003c/em\u003e, wrote on Threads last week. “The damage being done by this will persist long after the strike is settled.” Jennifer Hale, best known as Commander Shepard in \u003cem\u003eMass Effect\u003c/em\u003e, \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://x.com/jhaletweets/status/1930733720547545454\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://x.com/jhaletweets/status/1930733720547545454\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eadded\u003c/a\u003e\u003c/span\u003e, “Vilifying those differences only divides the community.”\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate 6/11/2025 4:54 p.m. ET: \u003c/strong\u003eThe strike officially ended at 3:00 p.m. ET on June 11 as the national SAG-AFTRA board meets to review the tentative agreement and present to members for ratification. \u003c/p\u003e\u003cp\u003e “We are pleased to have reached a tentative contract agreement that reflects the important contributions of SAG-AFTRA-represented performers in video games,”  a spokesperson for the video game producers party to the Interactive Media Agreement wrote in a statement. “This agreement builds on three decades of successful partnership between the interactive entertainment industry and the union. It delivers historic wage increases of over 24% for performers, enhanced health and safety protections, and industry-leading AI provisions requiring transparency, consent and compensation for the use of digital replicas in games. We look forward to continuing to work with performers to create new and engaging entertainment experiences for billions of players throughout the world.”\u003c/p\u003e\u003cp\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-10T10:10:00-04:00",
  "modifiedTime": "2025-06-11T20:54:10.802Z"
}
