{
  "id": "8001292d-b206-45d3-bade-a1f574c2474c",
  "title": "Metro 2033 Makes Killing Easy And Atrocity Quiet",
  "link": "https://www.gamespot.com/articles/metro-2033-makes-killing-easy-and-atrocity-quiet/1100-6530131/?ftag=CAD-01-10abi2f",
  "description": "Metro 2033 is celebrating its 15-year anniversary today, March 16, 2025. Below, we examine how its subtle morality system helped to illustrate its broader points about humanity and violence.In video games, evil tends to be gigantic. Think of the rivers of blood in Baldur's Gate 3's evil endings or an army of Sith bowing to the player in Knights of the Old Republic. These moments are not exactly comical, but they have a glee to them. They have the joy of a cackling cartoon villain. In some sense, Metro 2033 is no exception. In the wake of atomic devastation, the Moscow metro populates itself with cruel bandits, monstrous mutants, and authoritarian militants. It is grimmer than the prior examples to be sure, but there is still a note of the absurd in its endless cruel men. But the game's ultimate quest, to destroy a mutant army of \"Dark Ones\" with an atomic weapon, casts the shadow of real-world brutality. Metro 2033 concerns itself with the miniscule decisions and delusions that build up to atrocity, all under an atomic shadow. Unlike most other morality systems, Metro 2033 does not announce itself; instead it builds up the protagonist's character through tiny individual moments: beats of butterfly wings that become a hurricane.This works in a simple binary way. Completing certain tasks will net protagonist Artyom moral points. Get enough points and he'll have the opportunity for the good ending. In contrast to other games with morality systems, the player cannot see how many points Artyom has earned. There is only a sound and a flash of light (a more ominous sound plays when Artyom loses moral points). Fittingly, Artyom has humble origins. He is not a soldier. His station is distant from the comparatively sprawling central stations of the Metro and he has rarely left his home. He is as explicit a player-insert as a game like this can muster. More familiar with the world than the player to be sure, but also an outsider and newcomer to most of it. A sort of greatness awaits him. The game opens in media res: Artyom outfitted with military-grade gear and fighting a massive migration of mutants on the surface. But at the start, he is only arrogant because of his youth, not his power. He is incapable of atrocity; it takes an invitation for him to become a monster.Continue Reading at GameSpot",
  "author": "",
  "published": "Sun, 16 Mar 2025 07:00:00 -0700",
  "source": "https://www.gamespot.com/feeds/mashup/",
  "categories": [
    ""
  ],
  "byline": "Grace Benfell",
  "length": 8782,
  "excerpt": "Even 15 years on, Metro 2033’s morality system is one of the most haunting in video game history.",
  "siteName": "GameSpot",
  "favicon": "https://www.gamespot.com/a/bundles/gamespotsite/images/touch-icon-ipad-retina-precomposed.png",
  "text": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links. Metro 2033 is celebrating its 15-year anniversary today, March 16, 2025. Below, we examine how its subtle morality system helped to illustrate its broader points about humanity and violence.In video games, evil tends to be gigantic. Think of the rivers of blood in Baldur's Gate 3's evil endings or an army of Sith bowing to the player in Knights of the Old Republic. These moments are not exactly comical, but they have a glee to them. They have the joy of a cackling cartoon villain. In some sense, Metro 2033 is no exception. In the wake of atomic devastation, the Moscow metro populates itself with cruel bandits, monstrous mutants, and authoritarian militants. It is grimmer than the prior examples to be sure, but there is still a note of the absurd in its endless cruel men. But the game's ultimate quest, to destroy a mutant army of \"Dark Ones\" with an atomic weapon, casts the shadow of real-world brutality. Metro 2033 concerns itself with the miniscule decisions and delusions that build up to atrocity, all under an atomic shadow. Unlike most other morality systems, Metro 2033 does not announce itself; instead it builds up the protagonist's character through tiny individual moments: beats of butterfly wings that become a hurricane.This works in a simple binary way. Completing certain tasks will net protagonist Artyom moral points. Get enough points and he'll have the opportunity for the good ending. In contrast to other games with morality systems, the player cannot see how many points Artyom has earned. There is only a sound and a flash of light (a more ominous sound plays when Artyom loses moral points). Fittingly, Artyom has humble origins. He is not a soldier. His station is distant from the comparatively sprawling central stations of the Metro and he has rarely left his home. He is as explicit a player-insert as a game like this can muster. More familiar with the world than the player to be sure, but also an outsider and newcomer to most of it. A sort of greatness awaits him. The game opens in media res: Artyom outfitted with military-grade gear and fighting a massive migration of mutants on the surface. But at the start, he is only arrogant because of his youth, not his power. He is incapable of atrocity; it takes an invitation for him to become a monster.Metro 2033 opens with Artyom's older friend and mentor Hunter visiting his home station. Hunter is a ranger--a kind of special forces operative who acts as a de facto police officer in the metro. He warns of the Dark Ones, claiming they have destroyed other stations, intoning, \"My order has a motto: If it's hostile, you kill it.\" As he departs to find them, Hunter leaves Arytom with his dog tags, telling him to warn the Metro's central government at the \"polis\" station should he not return. Hunter trusts Arytom with this task, because of his liking for him--not because of any special ability or skill he has. Doing a favor for a friend is a long way from dropping a bomb.Metro 2033 and Last Light Redux Switch Gameplay Want us to remember this setting for all your devices? Sign up or Sign in now! Please use a html5 video capable browser to watch videos. This video has an invalid file format. Sorry, but you can't access this content!This only changes by degrees, not just in terms of the plot's step-by-step journey throughout the Metro or in Artyom's accumulation of allies and weaponry, but in the sense of emotional capacity for harm. There's a lot of downtime in Metro 2033. The gas-lamp markets and claustrophobic bedrooms of the stations act as spaces to breathe between the dark wasted corridors of the train lines and the barricaded, hostile settlements of bandits and fascists. Outside of the stations, Metro 2033 has a survival-horror quality: horrific monsters, limited ammo, and wasted environment. But the stations themselves act as tours for the mundane life of the Metro's citizens. Beggars plead for money, domestic disputes bleed through thin walls, and conversations wait to be overheard. Arytom does more than fight monsters. He can give to beggars or ignore them. He can chat up the station's inhabitants or blow right past them. In other words, Arytom can avoid atrocities by paying attention to other people. But generosity is only a part of it.The morality system also values this attention even when it isn't applied to human beings. The Metro's economy is based on military-grade bullets, which can be spent outright or used as powerful ammunition on their own. On the irradiated surface, Artyom must wear a gas mask, but its filters deplete quickly; he must scavenge or buy more to survive. These systems in combination encourage Arytom to search for materials to aid his journey. Finding caches left by dead rangers or even examining the corpses themselves will net Artyom more moral points. Levels are linear, but labyrinthian. The game rewards the player when they explore its margins or off the path set for them.In a sense, Metro 2033’s emphasis on the path less taken makes it an anti-military shooter. Even at their most expansive, Call of Duty campaigns are focused on objective markers and straightforward, set-piece level design. Metro 2033 takes cues from this, but often allows for multiple approaches. Its UI is absent of any path indicators. When it slips into a more military-shooter mode, it is when Arytom has a guide, someone else, often a soldier, to show him the way. But even in those moments, the morality system still tracks deviations from the path and rewards them.In other words, when Arytom obeys orders, he kills innocents. Hunter attributes violence to the Dark Ones, but Arytom never actually sees it occur. Instead, Arytom sees them looking at him and they scuttle off into shadows when he returns their gaze. Hearsay and rumor make them out to be an existential threat, but experience gives Artyom something else. The Dark Ones dot his journey with visions, mostly of Moscow before the bombs fell. It's a simple message: \"Don't do this again.\" The Atom Bomb rends the world, just not in literal terms, but psychically--spiritually. The Dark Ones are vessels of that loss: prophets that seek to prevent its second destruction.Mountains of individual decisions led to the atrocity of Hiroshima and Nagasaki, even though we tend to lay it at the feet of men like Truman and Oppenheimer. But even these men were composed of small choices. American Prometheus, the biography upon which Christopher Nolan's Oppenheimer is based, gives its subject curious virtues. They are the very traits that made Oppenheimer a charismatic and affable figure that enabled him to build the bomb: his powers of persuasion, his ability to comprehend and summarize complex information, and his consideration for the many people who worked under him. What does it mean to be a \"good\" person, even someone with strong moral convictions, when what you build is death? It would be easy to blame Oppenheimer's sins and deficiencies for the bomb, but there is often a stronger connection between the first atomic weapon and his virtues.This is a nuance that Metro 2033 cannot quite manage. If Arytom is caring, generous, and attentive, he will have the opportunity to prevent the Dark One's obliteration. If he is simple and bullish, he will kill them all. But atrocity is woven into mundanity in insidious ways. Even generosity can go hand in hand with violence. One only needs to take a look at the investment portfolios and political donations of philanthropists to bear that out. There is a simplicity to Metro's moral fable that undercuts its aspirations.But Metro 2033 still has power, not just for its sheer subversion of military shooters, but its apocalypse mood. Light is soft, scant, and diffuse. Darkness is dank and all-enveloping. What plant life appears is gnarled and dead, twisted like the metal of the Metro infrastructure. The shadows of ghosts stand in flashlight brightness, vanishing with the click of a switch. The world is haunted. Metro 2033's journey is Arytom deciding whether he will be haunted too. Grace Benfell on Google+ There are currently no available deals GameSpot may get a commission from retail offers. Got a news tip or want to contact us directly? Email news@gamespot.com",
  "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1585/15855271/4459480-3807271-metro2033.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n    \u003cspan data-nosnippet=\"\"\u003eGameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\u003c/span\u003e\n  \u003c/p\u003e\u003carticle itemscope=\"\" data-type-id=\"1100\" data-guid=\"1100-6530131\"\u003e\n\n            \n            \n  \n\n\n    \n\n\n        \n        \n              \u003csection\u003e\n\n                  \n          \u003cdiv data-content-element-selector=\"p, .js-buylink-item-container\" data-allowed-classes-selector=\"js-buylink-item-container\" data-in-content-placements=\"[{\u0026#34;adType\u0026#34;:\u0026#34;mobile-incontent-plus\u0026#34;,\u0026#34;placements\u0026#34;:[{\u0026#34;placeIndex\u0026#34;:1,\u0026#34;minElements\u0026#34;:2},{\u0026#34;placeIndex\u0026#34;:4,\u0026#34;minElements\u0026#34;:5}]},{\u0026#34;adType\u0026#34;:\u0026#34;mobile-banner-plus\u0026#34;,\u0026#34;placements\u0026#34;:[{\u0026#34;placeIndex\u0026#34;:7,\u0026#34;minElements\u0026#34;:8},{\u0026#34;placeIndex\u0026#34;:10,\u0026#34;minElements\u0026#34;:11},{\u0026#34;placeIndex\u0026#34;:13,\u0026#34;minElements\u0026#34;:14}]}]\"\u003e\n                \u003cp dir=\"ltr\"\u003e\u003cem\u003eMetro 2033 is celebrating its 15-year anniversary today, March 16, 2025. Below, we examine how its subtle morality system helped to illustrate its broader points about humanity and violence.\u003c/em\u003e\u003c/p\u003e\u003cp dir=\"ltr\"\u003eIn video games, evil tends to be gigantic. Think of the rivers of blood in Baldur\u0026#39;s Gate 3\u0026#39;s evil endings or an army of Sith bowing to the player in Knights of the Old Republic. These moments are not exactly comical, but they have a glee to them. They have the joy of a cackling cartoon villain. In some sense, Metro 2033 is no exception. In the wake of atomic devastation, the Moscow metro populates itself with cruel bandits, monstrous mutants, and authoritarian militants. It is grimmer than the prior examples to be sure, but there is still a note of the absurd in its endless cruel men. But the game\u0026#39;s ultimate quest, to destroy a mutant army of \u0026#34;Dark Ones\u0026#34; with an atomic weapon, casts the shadow of real-world brutality. Metro 2033 concerns itself with the miniscule decisions and delusions that build up to atrocity, all under an atomic shadow. Unlike most other morality systems, Metro 2033 does not announce itself; instead it builds up the protagonist\u0026#39;s character through tiny individual moments: beats of butterfly wings that become a hurricane.\u003c/p\u003e\u003cp dir=\"ltr\"\u003eThis works in a simple binary way. Completing certain tasks will net protagonist Artyom moral points. Get enough points and he\u0026#39;ll have the opportunity for the good ending. In contrast to other games with morality systems, the player cannot see how many points Artyom has earned. There is only a sound and a flash of light (a more ominous sound plays when Artyom loses moral points). Fittingly, Artyom has humble origins. He is not a soldier. His station is distant from the comparatively sprawling central stations of the Metro and he has rarely left his home. He is as explicit a player-insert as a game like this can muster. More familiar with the world than the player to be sure, but also an outsider and newcomer to most of it. A sort of greatness awaits him. The game opens in media res: Artyom outfitted with military-grade gear and fighting a massive migration of mutants on the surface. But at the start, he is only arrogant because of his youth, not his power. He is incapable of atrocity; it takes an invitation for him to become a monster.\u003c/p\u003e\u003cp dir=\"ltr\"\u003eMetro 2033 opens with Artyom\u0026#39;s older friend and mentor Hunter visiting his home station. Hunter is a ranger--a kind of special forces operative who acts as a de facto police officer in the metro. He warns of the Dark Ones, claiming they have destroyed other stations, intoning, \u0026#34;My order has a motto: If it\u0026#39;s hostile, you kill it.\u0026#34; As he departs to find them, Hunter leaves Arytom with his dog tags, telling him to warn the Metro\u0026#39;s central government at the \u0026#34;polis\u0026#34; station should he not return. Hunter trusts Arytom with this task, because of his liking for him--not because of any special ability or skill he has. Doing a favor for a friend is a long way from dropping a bomb.\u003c/p\u003e\u003cdiv tabindex=\"0\" data-id=\"1164650449\" data-promo-id=\"0\" data-user-has-ads=\"1\" data-video=\"{\u0026#34;id\u0026#34;:6452269,\u0026#34;title\u0026#34;:\u0026#34;Metro%202033%20and%20Last%20Light%20Redux%20Switch%20Gameplay\u0026#34;,\u0026#34;lengthSeconds\u0026#34;:1090,\u0026#34;startTime\u0026#34;:0,\u0026#34;autoplay\u0026#34;:false,\u0026#34;share\u0026#34;:{\u0026#34;linkUrl\u0026#34;:\u0026#34;https:\\/\\/www.gamespot.com\\/videos\\/metro-2033-and-last-light-redux-switch-gameplay\\/2300-6452269\\/\u0026#34;,\u0026#34;embedUrl\u0026#34;:\u0026#34;https:\\/\\/www.gamespot.com\\/videos\\/embed\\/6452269\\/\u0026#34;,\u0026#34;embedHtml\u0026#34;:{\u0026#34;640\u0026#34;:\u0026#34;\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\u0026lt;iframe src=\\\u0026#34;https:\\/\\/www.gamespot.com\\/videos\\/embed\\/6452269\\/\\\u0026#34; height=\\\u0026#34;360\\\u0026#34; width=\\\u0026#34;640\\\u0026#34; scrolling=\\\u0026#34;no\\\u0026#34; frameborder=\\\u0026#34;\\\u0026#34; webkitAllowFullScreen mozallowfullscreen allowFullScreen\u0026gt;\u0026lt;\\/iframe\u0026gt;\u0026#34;,\u0026#34;480\u0026#34;:\u0026#34;\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\u0026lt;iframe src=\\\u0026#34;https:\\/\\/www.gamespot.com\\/videos\\/embed\\/6452269\\/\\\u0026#34; height=\\\u0026#34;270\\\u0026#34; width=\\\u0026#34;480\\\u0026#34; scrolling=\\\u0026#34;no\\\u0026#34; frameborder=\\\u0026#34;\\\u0026#34; webkitAllowFullScreen mozallowfullscreen allowFullScreen\u0026gt;\u0026lt;\\/iframe\u0026gt;\u0026#34;}},\u0026#34;device\u0026#34;:\u0026#34;phone\u0026#34;,\u0026#34;isDevice\u0026#34;:true,\u0026#34;allowMutedAutoplay\u0026#34;:true,\u0026#34;isLiveStream\u0026#34;:false,\u0026#34;videoType\u0026#34;:\u0026#34;video-on-demand\u0026#34;,\u0026#34;countdownTime\u0026#34;:0,\u0026#34;guid\u0026#34;:\u0026#34;gs-2300-6452269\u0026#34;,\u0026#34;ageGateCookieName\u0026#34;:\u0026#34;videoAgeGateBirthday\u0026#34;,\u0026#34;watchedCookieName\u0026#34;:\u0026#34;watchedVideoIds\u0026#34;,\u0026#34;watchedCookieDays\u0026#34;:1,\u0026#34;postPlayMax\u0026#34;:100,\u0026#34;adCall\u0026#34;:{\u0026#34;host\u0026#34;:\u0026#34;http:\\/\\/pubads.g.doubleclick.net\\/gampad\\/ads?\u0026#34;,\u0026#34;params\u0026#34;:{\u0026#34;iu\u0026#34;:\u0026#34;\\/5441\\/vaw-gamespot\\/mobile_web\\/gamespot.com_mobile\u0026#34;,\u0026#34;impl\u0026#34;:\u0026#34;s\u0026#34;,\u0026#34;gdfp_req\u0026#34;:1,\u0026#34;env\u0026#34;:\u0026#34;vp\u0026#34;,\u0026#34;output\u0026#34;:\u0026#34;xml_vmap1\u0026#34;,\u0026#34;unviewed_position_start\u0026#34;:1,\u0026#34;url\u0026#34;:\u0026#34;[referrer_url]\u0026#34;,\u0026#34;correlator\u0026#34;:\u0026#34;[timestamp]\u0026#34;,\u0026#34;description_url\u0026#34;:\u0026#34;[description_url]\u0026#34;,\u0026#34;cmsid\u0026#34;:2566084,\u0026#34;vid\u0026#34;:6452269,\u0026#34;pp\u0026#34;:\u0026#34;ssai\u0026#34;},\u0026#34;custParams\u0026#34;:{\u0026#34;ptype\u0026#34;:\u0026#34;news_article\u0026#34;,\u0026#34;cid\u0026#34;:\u0026#34;gs-1100-6530131\u0026#34;,\u0026#34;game\u0026#34;:\u0026#34;metro-2033\u0026#34;,\u0026#34;genre\u0026#34;:\u0026#34;3d,action,first-person,shooter\u0026#34;,\u0026#34;con\u0026#34;:\u0026#34;pc,xbox-360,xbox-one,playstation-4,linux,nintendo-switch,stadia\u0026#34;,\u0026#34;publisher\u0026#34;:\u0026#34;thq,e-frontier,spike,deep-silver\u0026#34;,\u0026#34;franchise\u0026#34;:\u0026#34;metro-2033\u0026#34;,\u0026#34;category\u0026#34;:\u0026#34;games\u0026#34;,\u0026#34;franchiseRoot\u0026#34;:\u0026#34;metro-2033\u0026#34;,\u0026#34;partner\u0026#34;:\u0026#34;mobile_web\\/gamespot.com_mobile\u0026#34;,\u0026#34;vid\u0026#34;:6452269},\u0026#34;soundBasedSize\u0026#34;:{\u0026#34;normal\u0026#34;:\u0026#34;640x480\u0026#34;,\u0026#34;muted\u0026#34;:\u0026#34;640x483\u0026#34;,\u0026#34;none\u0026#34;:\u0026#34;640x480\u0026#34;},\u0026#34;daiSsbUrl\u0026#34;:\u0026#34;https:\\/\\/dai.google.com\\/ondemand\\/hls\\/content\\/2572465\\/vid\\/6452269\\/master.m3u8\u0026#34;,\u0026#34;daiMidRollHost\u0026#34;:2500176},\u0026#34;uvpHi5Ima\u0026#34;:\u0026#34;https:\\/\\/s0.2mdn.net\\/instream\\/html5\\/ima3.js\u0026#34;,\u0026#34;cuePoints\u0026#34;:null,\u0026#34;uvpc\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;partner\u0026#34;:\u0026#34;gamespot\u0026#34;,\u0026#34;adPartner\u0026#34;:\u0026#34;desktop\\/gamespot.com\u0026#34;,\u0026#34;desktopAdPartner\u0026#34;:\u0026#34;desktop%2Fgamespot.com\u0026#34;,\u0026#34;mobileAdPartner\u0026#34;:\u0026#34;mobile_web%2Fgamespot.com_mobile\u0026#34;,\u0026#34;mapp\u0026#34;:\u0026#34;gamespot\u0026#34;,\u0026#34;cms\u0026#34;:\u0026#34;pi\u0026#34;,\u0026#34;seekablePlaybacks\u0026#34;:[\u0026#34;html5\u0026#34;,\u0026#34;uvpjs\u0026#34;],\u0026#34;tracking\u0026#34;:[{\u0026#34;name\u0026#34;:\u0026#34;SiteCatalyst\u0026#34;,\u0026#34;category\u0026#34;:\u0026#34;qos\u0026#34;,\u0026#34;enabled\u0026#34;:true,\u0026#34;params\u0026#34;:[{\u0026#34;name\u0026#34;:\u0026#34;charSet\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;UTF-8\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;currencyCode\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;USD\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;siteType\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;responsive web\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;trackingServer\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;saa.gamespot.com\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;visitorNamespace\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;cbsinteractive\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;heartbeatTrackingServer\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;newimagitasinc.hb.omtrdc.net\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;heartbeatVisitorMarketingCloudOrgId\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;3C66570E5FE1A4AB0A495FFC@AdobeOrg\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;partnerID\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;gamespot\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;siteCode\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;gamespot\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;brand\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;gamespot\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;account\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;cbsigamespotsite\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;edition\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;us\u0026#34;}]},{\u0026#34;name\u0026#34;:\u0026#34;ComScore_ss\u0026#34;,\u0026#34;category\u0026#34;:\u0026#34;qos\u0026#34;,\u0026#34;enabled\u0026#34;:true,\u0026#34;params\u0026#34;:[{\u0026#34;name\u0026#34;:\u0026#34;c2\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;31824268\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;publishersSecret\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;2cb08ca4d095dd734a374dff8422c2e5\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;c3\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;partnerID\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;gamespot\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;c4\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;gamespot\u0026#34;}]},{\u0026#34;name\u0026#34;:\u0026#34;NielsenTracking\u0026#34;,\u0026#34;category\u0026#34;:\u0026#34;tracking\u0026#34;,\u0026#34;enabled\u0026#34;:true,\u0026#34;params\u0026#34;:[{\u0026#34;name\u0026#34;:\u0026#34;host\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;https:\\/\\/secure-us.imrworldwide.com\\/cgi-bin\\/m?\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;scCI\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;us-200330\u0026#34;},{\u0026#34;name\u0026#34;:\u0026#34;scC6\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;vc,c01\u0026#34;}]},{\u0026#34;name\u0026#34;:\u0026#34;MuxQOSPluginJS\u0026#34;,\u0026#34;category\u0026#34;:\u0026#34;qos\u0026#34;,\u0026#34;enabled\u0026#34;:true,\u0026#34;params\u0026#34;:[{\u0026#34;name\u0026#34;:\u0026#34;propertyKey\u0026#34;,\u0026#34;value\u0026#34;:\u0026#34;b7d6e48b7461a61cb6e863a62\u0026#34;}]}],\u0026#34;trackingAccount\u0026#34;:\u0026#34;cbsigamespotsite\u0026#34;,\u0026#34;trackingSiteCode\u0026#34;:\u0026#34;gs\u0026#34;,\u0026#34;trackingPrimaryId\u0026#34;:\u0026#34;cbsigamespotsite\u0026#34;,\u0026#34;videoAssetSource\u0026#34;:\u0026#34;GameSpot\u0026#34;,\u0026#34;uvpjsHostname\u0026#34;:\u0026#34;\\/\\/www.gamespot.com\u0026#34;,\u0026#34;siteType\u0026#34;:\u0026#34;responsive web\u0026#34;,\u0026#34;startMuted\u0026#34;:false,\u0026#34;screenMediumThumb\u0026#34;:\u0026#34;https:\\/\\/www.gamespot.com\\/a\\/uploads\\/screen_medium\\/1352\\/13527689\\/3639111-wallpaper_metro_redux_01_2560x1440.jpg\u0026#34;,\u0026#34;videoStreams\u0026#34;:{\u0026#34;adaptive_stream\u0026#34;:\u0026#34;https:\\/\\/mt-rv-v1.gamespot.com\\/vr\\/2020\\/02\\/25\\/fixed_Metro_switch_Gameplay_700,1000,1800,2500,3200,4000,master.m3u8\u0026#34;,\u0026#34;adaptive_dash\u0026#34;:\u0026#34;https:\\/\\/mt-rv-v1.gamespot.com\\/vr\\/2020\\/02\\/25\\/fixed_Metro_switch_Gameplay_700,1000,1800,2500,3200,4000,master.mpd\u0026#34;,\u0026#34;adaptive_hd\u0026#34;:\u0026#34;https:\\/\\/mt-rv-v1.gamespot.com\\/vr\\/2020\\/02\\/25\\/fixed_Metro_switch_Gameplay_4000,master.m3u8\u0026#34;,\u0026#34;adaptive_high\u0026#34;:\u0026#34;https:\\/\\/mt-rv-v1.gamespot.com\\/vr\\/2020\\/02\\/25\\/fixed_Metro_switch_Gameplay_2500,master.m3u8\u0026#34;,\u0026#34;adaptive_low\u0026#34;:\u0026#34;https:\\/\\/mt-rv-v1.gamespot.com\\/vr\\/2020\\/02\\/25\\/fixed_Metro_switch_Gameplay_700,master.m3u8\u0026#34;,\u0026#34;adaptive_restricted\u0026#34;:\u0026#34;https:\\/\\/mt-rv-v1.gamespot.com\\/vr\\/2020\\/02\\/25\\/fixed_Metro_switch_Gameplay_700,1000,1800,2500,master.m3u8\u0026#34;},\u0026#34;userId\u0026#34;:0,\u0026#34;premium\u0026#34;:false,\u0026#34;datePublished\u0026#34;:1582642800,\u0026#34;videoAdPartner\u0026#34;:\u0026#34;desktop%2Fgamespot.com\u0026#34;,\u0026#34;videoAdMobilePartner\u0026#34;:\u0026#34;mobile_web%2Fgamespot.com_mobile\u0026#34;}\" data-non-iframe-embed=\"1\" data-jw-context-name=\"gamespot\" data-jw-media-id=\"NdsUEQxv\" data-jw-player-url=\"https://cdn.jwplayer.com/libraries/VXc5h4Tf.js\" data-jw-video-token=\"\" data-has-youtube=\"\" data-youtube-icon-path=\"https://www.gamespot.com/a/bundles/phoenixsite/images/core/loose/icn-youtube-30x30.png\" id=\"video-rectangle\" data-embed-type=\"video\" data-ref-id=\"2300-6452269\" data-src=\"/videos/metro-2033-and-last-light-redux-switch-gameplay/2300-6452269/\" data-width=\"100%\" data-height=\"100%\" data-video-start=\"0\"\u003e\u003cdiv\u003e\u003cp\u003eMetro 2033 and Last Light Redux Switch Gameplay\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e         Want us to remember this setting for all your devices?       \u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.gamespot.com/signup/\"\u003eSign up\u003c/a\u003e or \u003ca href=\"https://www.gamespot.com/login/\"\u003eSign in\u003c/a\u003e now!       \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003e       Please use a html5 video capable browser to watch videos.     \u003c/p\u003e\u003cp\u003e       This video has an invalid file format.     \u003c/p\u003e\u003cp\u003eSorry, but you can\u0026#39;t access this content!\u003c/p\u003e\u003c/div\u003e\u003cp dir=\"ltr\"\u003eThis only changes by degrees, not just in terms of the plot\u0026#39;s step-by-step journey throughout the Metro or in Artyom\u0026#39;s accumulation of allies and weaponry, but in the sense of emotional capacity for harm. There\u0026#39;s a lot of downtime in Metro 2033. The gas-lamp markets and claustrophobic bedrooms of the stations act as spaces to breathe between the dark wasted corridors of the train lines and the barricaded, hostile settlements of bandits and fascists. Outside of the stations, Metro 2033 has a survival-horror quality: horrific monsters, limited ammo, and wasted environment. But the stations themselves act as tours for the mundane life of the Metro\u0026#39;s citizens. Beggars plead for money, domestic disputes bleed through thin walls, and conversations wait to be overheard. Arytom does more than fight monsters. He can give to beggars or ignore them. He can chat up the station\u0026#39;s inhabitants or blow right past them. In other words, Arytom can avoid atrocities by paying attention to other people. But generosity is only a part of it.\u003c/p\u003e\u003cp dir=\"ltr\"\u003eThe morality system also values this attention even when it isn\u0026#39;t applied to human beings. The Metro\u0026#39;s economy is based on military-grade bullets, which can be spent outright or used as powerful ammunition on their own. On the irradiated surface, Artyom must wear a gas mask, but its filters deplete quickly; he must scavenge or buy more to survive. These systems in combination encourage Arytom to search for materials to aid his journey. Finding caches left by dead rangers or even examining the corpses themselves will net Artyom more moral points. Levels are linear, but labyrinthian. The game rewards the player when they explore its margins or off the path set for them.\u003c/p\u003e\u003cp dir=\"ltr\"\u003eIn a sense, Metro 2033’s emphasis on the path less taken makes it an anti-military shooter. Even at their most expansive, Call of Duty campaigns are focused on objective markers and straightforward, set-piece level design. Metro 2033 takes cues from this, but often allows for multiple approaches. Its UI is absent of any path indicators. When it slips into a more military-shooter mode, it is when Arytom has a guide, someone else, often a soldier, to show him the way. But even in those moments, the morality system still tracks deviations from the path and rewards them.\u003c/p\u003e\u003cp dir=\"ltr\"\u003eIn other words, when Arytom obeys orders, he kills innocents. Hunter attributes violence to the Dark Ones, but Arytom never actually sees it occur. Instead, Arytom sees them looking at him and they scuttle off into shadows when he returns their gaze. Hearsay and rumor make them out to be an existential threat, but experience gives Artyom something else. The Dark Ones dot his journey with visions, mostly of Moscow before the bombs fell. It\u0026#39;s a simple message: \u0026#34;Don\u0026#39;t do this again.\u0026#34; The Atom Bomb rends the world, just not in literal terms, but psychically--spiritually. The Dark Ones are vessels of that loss: prophets that seek to prevent its second destruction.\u003c/p\u003e\u003cp dir=\"ltr\"\u003eMountains of individual decisions led to the atrocity of Hiroshima and Nagasaki, even though we tend to lay it at the feet of men like Truman and Oppenheimer. But even these men were composed of small choices. American Prometheus, the biography upon which Christopher Nolan\u0026#39;s Oppenheimer is based, gives its subject curious virtues. They are the very traits that made Oppenheimer a charismatic and affable figure that enabled him to build the bomb: his powers of persuasion, his ability to comprehend and summarize complex information, and his consideration for the many people who worked under him. What does it mean to be a \u0026#34;good\u0026#34; person, even someone with strong moral convictions, when what you build is death? It would be easy to blame Oppenheimer\u0026#39;s sins and deficiencies for the bomb, but there is often a stronger connection between the first atomic weapon and his virtues.\u003c/p\u003e\u003cp dir=\"ltr\"\u003eThis is a nuance that Metro 2033 cannot quite manage. If Arytom is caring, generous, and attentive, he will have the opportunity to prevent the Dark One\u0026#39;s obliteration. If he is simple and bullish, he will kill them all. But atrocity is woven into mundanity in insidious ways. Even generosity can go hand in hand with violence. One only needs to take a look at the investment portfolios and political donations of philanthropists to bear that out. There is a simplicity to Metro\u0026#39;s moral fable that undercuts its aspirations.\u003c/p\u003e\u003cp dir=\"ltr\"\u003eBut Metro 2033 still has power, not just for its sheer subversion of military shooters, but its apocalypse mood. Light is soft, scant, and diffuse. Darkness is dank and all-enveloping. What plant life appears is gnarled and dead, twisted like the metal of the Metro infrastructure. The shadows of ghosts stand in flashlight brightness, vanishing with the click of a switch. The world is haunted. Metro 2033\u0026#39;s journey is Arytom deciding whether he will be haunted too.\u003c/p\u003e\n  \n                        \n        \n    \n    \n                                  \u003c/div\u003e\n\n          \n        \n                        \n            \u003cspan\u003e\n        \u003ca itemprop=\"reviewer\" href=\"https://plus.google.com/103097971921006863809?rel=author\"\u003eGrace Benfell\u003c/a\u003e on Google+\n      \u003c/span\u003e\n      \n                    \n  \n        \u003cdiv data-merchant-service-api-link=\"https://www.gamespot.com/merchantapi/offer/?gameid=27984\"\u003e\u003cdiv\u003e\u003cp\u003e\n      There are currently no available deals\n    \u003c/p\u003e\u003c/div\u003e\u003cp\u003eGameSpot may get a commission from retail offers.\u003c/p\u003e\u003c/div\u003e  \n          \n            \n  \u003cdiv\u003e\n    \u003cp\u003e\u003ci\u003eGot a news tip or want to contact us directly? Email \u003ca href=\"mailto:news@gamespot.com?subject=Hi GameSpot! I have a news tip for you!\"\u003enews@gamespot.com\u003c/a\u003e\u003c/i\u003e\u003c/p\u003e\n\n    \n      \u003c/div\u003e\n        \n      \u003c/section\u003e\n    \n            \n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-03-16T07:00:00Z",
  "modifiedTime": null
}
