{
  "id": "889488ee-5987-4fd4-b004-78e390d49d36",
  "title": "What are we all playing this weekend?",
  "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-340",
  "description": "You wouldn't believe how close I was to forgetting to poll everyone today for Playing This Weekend. In fairness, no one reminded me or sent me their paragraphs. What, so it's my responsibility to remind everyone to remind me? F'gawdsake. Anyway, right on time as usual, here are the games we're clicking on this weekend! Read more",
  "author": "Ollie Toms",
  "published": "Sat, 12 Jul 2025 07:00:00 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Playing This Weekend",
    "PC"
  ],
  "byline": "Ollie Toms",
  "length": 2354,
  "excerpt": "Total War(hammer), FFXII, and Clair Obscur headline our weekend gaming plans - what are you playing?",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/cd401345152344adc70d530c08e7fdf3/icon/apple-touch-icon.png",
  "text": "Image credit: Rock Paper Shotgun/Cambridge, London: Macmillan and Co., 1865 You wouldn't believe how close I was to forgetting to poll everyone today for Playing This Weekend. In fairness, no one reminded me or sent me their paragraphs. What, so it's my responsibility to remind everyone to remind me? F'gawdsake. Anyway, right on time as usual, here are the games we're clicking on this weekend! BrendanBrendy's fired! EdwinOld Nic has tempted me to take up my Twarhammer once again with his latest diary feature. He's been experimenting with horseless Bretonnians. Perhaps I'll have a look at those Chaos Dwarves. GrahamGraham's fired too! JamesAll of you! FIRED! JeremyAs hinted last weekend, I started playing Final Fantasy XII: The Zodiac Age on my Steam Deck as my 'nighttime relaxation' game, and I'm having a grand time. Holy crap, as someone who had only previously touched the original PS2 version, the 2x and 4x speeds available in The Zodiac Age are fantastic. Also, arranging the perfect array of Gambits is a devilishly addictive sort of programming nerdery, and I wish all real-time-with-pause combat systems utilised a similar approach. Watch me speed through the Dalmasca Estersand, barely touching the buttons as the game plays itself! MarkAha! You'll never know all of what I'm playing this weekend, I've got a top secret press preview of something that looks like it could be pretty rad to dig into. Aside from that, I still like trucking and I like to truck. Plus, I quite fancy some super touring action in Raceroom. NicI am painting very tiny spacemen from the Hivestorm box I bought about a year ago. They are tiny and my hands are so big. I'm sure I've done this before and it was fine. It doesn't feel fine now. Otherwise, Hell Clock (very good), and probably a bit more Darktide (very dog). OllieI've been slacking somewhat with my Clair Obscur playthrough. I need to stay ahead of where I'm at with the playthrough stream I'm watching with my brother. It seems like the end is in sight but I'm 1000% sure that's a lie, and there's a lot still to go. Whoever heard of a two-act story? Also I've now pretty much conquered the arse-end of Scandinavia, but everyone has huddled up into confederations so progress on that front has slowed. But you, reader dear, what are you playing this weekend?...",
  "image": "https://assetsio.gnwcdn.com/old-vintage-illustration-of-ghosts.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n\u003cspan\u003e\u003c/span\u003e    \u003cimg src=\"https://assetsio.gnwcdn.com/old-vintage-illustration-of-ghosts.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/old-vintage-illustration-of-ghosts.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/old-vintage-illustration-of-ghosts.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"An old vintage black and white illustration of a woman riding on horseback in the moonlight, cowed by the company of ghosts following her with great agitation.\" data-src-full=\"https://assetsio.gnwcdn.com/old-vintage-illustration-of-ghosts.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eRock Paper Shotgun/Cambridge, London: Macmillan and Co., 1865\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eYou wouldn\u0026#39;t believe how close I was to forgetting to poll everyone today for Playing This Weekend. In fairness, no one reminded me or sent me their paragraphs. What, so it\u0026#39;s my responsibility to remind \u003cem\u003eeveryone\u003c/em\u003e to remind me? F\u0026#39;gawdsake.\u003c/p\u003e\n\u003cp\u003eAnyway, right on time as usual, here are the games we\u0026#39;re clicking on this weekend!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBrendan\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003eBrendy\u0026#39;s fired!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEdwin\u003c/strong\u003e\u003cbr/\u003eOld Nic has tempted me to take up my Twarhammer once again with his \u003ca href=\"https://www.rockpapershotgun.com/leading-total-war-warhammer-3s-peasants-to-victory-with-an-irresponsible-number-of-trebuchets-french-for-very-bucket\"\u003elatest diary feature\u003c/a\u003e. He\u0026#39;s been experimenting with horseless Bretonnians. Perhaps I\u0026#39;ll have a look at those Chaos Dwarves.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGraham\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003eGraham\u0026#39;s fired too!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJames\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003eAll of you! FIRED!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJeremy\u003c/strong\u003e\u003cbr/\u003eAs hinted last weekend, I started playing \u003ca href=\"https://www.rockpapershotgun.com/games/final-fantasy-xii\"\u003eFinal Fantasy XII\u003c/a\u003e: The Zodiac Age on my Steam Deck as my \u0026#39;nighttime relaxation\u0026#39; game, and I\u0026#39;m having a grand time. Holy crap, as someone who had only previously touched the original PS2 version, the 2x and 4x speeds available in The Zodiac Age are fantastic. Also, arranging the perfect array of Gambits is a devilishly addictive sort of programming nerdery, and I wish all real-time-with-pause combat systems utilised a similar approach. Watch me speed through the Dalmasca Estersand, barely touching the buttons as the game plays itself!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMark\u003c/strong\u003e\u003cbr/\u003eAha! You\u0026#39;ll never know all of what I\u0026#39;m playing this weekend, I\u0026#39;ve got a top secret press preview of something that looks like it could be pretty rad to dig into. Aside from that, I still like trucking and I like to truck. Plus, I quite fancy some super touring action in Raceroom.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNic\u003c/strong\u003e\u003cbr/\u003eI am painting very tiny spacemen from the Hivestorm box I bought about a year ago. They are tiny and my hands are so big. I\u0026#39;m sure I\u0026#39;ve done this before and it was fine. It doesn\u0026#39;t feel fine now. Otherwise, Hell Clock (very good), and probably a bit more Darktide (very dog).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOllie\u003c/strong\u003e\u003cbr/\u003eI\u0026#39;ve been slacking somewhat with my \u003ca href=\"https://www.rockpapershotgun.com/games/clair-obscur-expedition-33\"\u003eClair Obscur\u003c/a\u003e playthrough. I need to stay ahead of where I\u0026#39;m at with the playthrough stream I\u0026#39;m watching with my brother. It seems like the end is in sight but I\u0026#39;m 1000% sure that\u0026#39;s a lie, and there\u0026#39;s a lot still to go. Whoever heard of a two-act story?\u003c/p\u003e\n\u003cp\u003eAlso I\u0026#39;ve now pretty much conquered the arse-end of Scandinavia, but everyone has huddled up into confederations so progress on that front has slowed.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003cem\u003eBut you, reader dear, what are you playing this weekend?...\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-12T07:00:00Z",
  "modifiedTime": null
}
