{
  "id": "8d9aab83-0de1-4dee-938b-cbd4b08ffd95",
  "title": "Steam introduces vague new rules banning 'certain kinds of adult content' to appease credit card companies",
  "link": "https://www.eurogamer.net/steam-introduces-vague-new-rules-banning-certain-kinds-of-adult-content-to-appease-credit-card-companies",
  "description": "Valve has introduced new - and worryingly vague - guidelines aimed at the adult-only game development community, forbidding content that may \"violate the rules and standards\" set by credit card companies, internet network providers, and more. Read more",
  "author": "Matt Wales",
  "published": "Wed, 16 Jul 2025 19:42:21 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "PC"
  ],
  "byline": "Matt Wales",
  "length": 3073,
  "excerpt": "\"Corporate cowardice in action\".",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/e29c013272f95d659a3050376a31d34c/icon/apple-touch-icon-152x152.png",
  "text": "\"Corporate cowardice in action\". Image credit: Valve Valve has introduced new - and worryingly vague - guidelines aimed at the adult-only game development community, forbidding content that may \"violate the rules and standards\" set by credit card companies, internet network providers, and more. It's not precisely clear when Valve introduced this latest rule stipulating what developers \"shouldn't publish on Steam\", but it appears to have been added sometime in the last couple of months. So what's now banned from the platform? According to Valve, \"Content that may violate the rules and standards set forth by [its] payment processors and related card networks and banks, or internet network providers.\" There's some small nod toward additional clarity, but it's not much. Valve suggests developers should \"in particular, [avoid publishing] certain kinds of adult only content\", but provides no specifics beyond that. Banks have long been skittish about providing services to businesses where sex and adult entertainment may be a factor, but - as this 2021 article from The Guardian points out - their inconsistency has proven a challenge for business owners. Which might be where Valve's own decision to err on the side of vagueness was born. Valve, of course, has made headlines recently after a number of controversial sex games appeared on its store, so it's easy enough to imagine banks and similar financial services getting uncomfortable when a platform hits the news for publishing content featuring extreme sexual violence. And it seems Valve may have become skittish in return. As noted by SteamDB (thanks PC Gamer), it appears the company - which previously said it would \"allow everything\" on Steam unless illegal or \"straight up trolling\" - has been frantically pulling incest-themed games from its store in recent times. The vagueness of Valve's wording means confusion and concern among adult content developers is likely to intensify as they grapple with the reality that financial institutions may now be the ultimate arbiters of ever-changing acceptability on Steam. And some have expressed concern this new authority may start impacting the availability of LGBTQIA+ content as corporations buckle to appease the US government's continuing attack on queer rights. \"It's the quiet normalisation of financial censorship and it's going to hurt LGBTQ+ games and devs,\" YouTuber NoahFuel Gaming wrote on social media. \"Banks like Visa and Mastercard are now backdoor moral authorities... They already pressured Patreon, OnlyFans, and others to remove NSFW content. Now Steam is next. And guess who they'll target first? Queer, transgressive, or \"unusual\" games... Queer content gets flagged as 'explicit' even when it's PG... If banks raise a fuss, they'll nuke anything that could be controversial. And they'll say, 'It's out of our hands.' Corporate cowardice in action.\" Valve hasn't yet publicly addressed its new policy but we've reached out for more information.",
  "image": "https://assetsio.gnwcdn.com/steam_ROoZJs3_d5erV0U.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n        \n\n        \u003cp\u003e\u0026#34;Corporate cowardice in action\u0026#34;.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/steam_ROoZJs3_d5erV0U.jpg?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/steam_ROoZJs3_d5erV0U.jpg?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/steam_ROoZJs3_d5erV0U.jpg?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"The Steam logo overlaid on promotional cover art for various PC games.\" data-src-full=\"https://assetsio.gnwcdn.com/steam_ROoZJs3_d5erV0U.jpg?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"414\" height=\"233\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eValve\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nValve has introduced new - and worryingly vague - guidelines aimed at the adult-only game development community, forbidding content that may \u0026#34;violate the rules and standards\u0026#34; set by credit card companies, internet network providers, and more.\n\u003c/p\u003e\n\u003cp\u003e\nIt\u0026#39;s not precisely clear when Valve introduced this \u003ca href=\"https://partner.steamgames.com/doc/gettingstarted/onboarding\"\u003elatest rule\u003c/a\u003e stipulating what developers \u0026#34;shouldn\u0026#39;t publish on Steam\u0026#34;, but it appears to have been added sometime in the last couple of months. So what\u0026#39;s now banned from the platform? According to Valve, \u0026#34;Content that may violate the rules and standards set forth by [its] payment processors and related card networks and banks, or internet network providers.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nThere\u0026#39;s some small nod toward additional clarity, but it\u0026#39;s not much. Valve suggests developers should \u0026#34;in particular, [avoid publishing] certain kinds of adult only content\u0026#34;, but provides no specifics beyond that. Banks have long been skittish about providing services to businesses where sex and adult entertainment may be a factor, but - as this \u003ca href=\"https://www.theguardian.com/business/2021/oct/16/sex-discrimination-why-banks-shun-workers-in-adult-entertainment\"\u003e2021 article from The Guardian points out\u003c/a\u003e - their inconsistency has proven a challenge for business owners. Which might be where Valve\u0026#39;s own decision to err on the side of vagueness was born.\n\u003c/p\u003e\n\u003cp\u003e\nValve, of course, has made headlines recently after a number of controversial sex games appeared on its store, so it\u0026#39;s easy enough to imagine banks and similar financial services getting uncomfortable when a platform hits the news for \u003ca href=\"https://www.eurogamer.net/valve-quietly-removes-explicit-game-featuring-extreme-sexual-violence-from-steam-in-uk\"\u003epublishing content featuring extreme sexual violence\u003c/a\u003e. And it seems Valve may have become skittish in return. As \u003ca href=\"https://bsky.app/profile/steamdb.info/post/3lu32vdlsmg27\"\u003enoted by SteamDB\u003c/a\u003e (thanks \u003ca href=\"https://www.pcgamer.com/software/platforms/steam-introduces-new-rule-prohibiting-certain-kinds-of-adult-content-that-might-make-visa-or-mastercard-unhappy-financial-deplatforming-in-action/\"\u003ePC Gamer\u003c/a\u003e), it appears the company - which previously said it \u003ca href=\"https://www.eurogamer.net/valve-backs-away-from-content-policing-says-it-will-allow-everything-on-steam\"\u003ewould \u0026#34;allow everything\u0026#34; on Steam\u003c/a\u003e unless illegal or \u0026#34;straight up trolling\u0026#34; - has been frantically pulling incest-themed games from its store in recent times.\n\u003c/p\u003e\n\u003cp\u003e\nThe vagueness of Valve\u0026#39;s wording means confusion and concern among adult content developers is likely to intensify as they grapple with the reality that financial institutions may now be the ultimate arbiters of ever-changing acceptability on Steam. And some have expressed concern this new authority may start impacting the availability of LGBTQIA+ content as corporations buckle to appease the US government\u0026#39;s continuing attack on queer rights.\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;It\u0026#39;s the quiet normalisation of financial censorship and it\u0026#39;s going to hurt LGBTQ+ games and devs,\u0026#34; YouTuber NoahFuel Gaming \u003ca href=\"https://bsky.app/profile/noahfuelgaming.bsky.social/post/3lu2ngnm3hc26\"\u003ewrote on social media\u003c/a\u003e. \u0026#34;Banks like Visa and Mastercard are now backdoor moral authorities... They already pressured Patreon, OnlyFans, and others to remove NSFW content. Now Steam is next. And guess who they\u0026#39;ll target first? Queer, transgressive, or \u0026#34;unusual\u0026#34; games... Queer content gets flagged as \u0026#39;explicit\u0026#39; even when it\u0026#39;s PG... If banks raise a fuss, they\u0026#39;ll nuke anything that could be controversial. And they\u0026#39;ll say, \u0026#39;It\u0026#39;s out of our hands.\u0026#39; Corporate cowardice in action.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nValve hasn\u0026#39;t yet publicly addressed its new policy but we\u0026#39;ve reached out for more information.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-16T19:42:21.201732Z",
  "modifiedTime": null
}
