{
  "id": "a111d592-0310-4fa5-9950-39be90cec8ec",
  "title": "Final Destination: Bloodlines Ending Explained - Does It Set Up Final Destination 7?",
  "link": "https://www.ign.com/articles/final-destination-bloodlines-ending-explained-post-credits-scene-check-in",
  "description": "You want to know if there are any post- or mid-credits scenes in Final Destination: Bloodlines, and we've got the answer right here. Plus, how does the film set up Final Destination 7?",
  "author": "Scott Collura",
  "published": "Sat, 17 May 2025 00:12:00 +0000",
  "source": "http://feeds.ign.com/ign/all",
  "categories": null,
  "byline": "Eric Goldman",
  "length": 16706,
  "excerpt": "You want to know if there are any post- or mid-credits scenes in Final Destination: Bloodlines, and we've got the answer right here. Plus, how does the film set up Final Destination 7?",
  "siteName": "IGN",
  "favicon": "",
  "text": "Let's make this simple: You want to know if there are any post- or mid-credits scenes in Final Destination: Bloodlines. The answer is no. There weren't any credits scenes in the first five movies and there isn’t one in the sixth either!There is some imagery that runs along with the credits which is fun to check out though.Full spoilers for the movie (and the entire Final Destination series so far) follow!Final Destination: Bloodlines manages to have fun with the formula of the series, both sticking to the basic scenario fans expect – someone’s premonition of an impending terrible tragedy leads them to escape that tragedy alongside a group of others, only for Death itself to kill those who escaped it one by one in elaborate ways – while also introducing its own specifics that make it feel a bit different and fresh. Let’s break down the ending of the film and how it relates to the series as a whole…The Best Final Destination DeathsThe Set-UpIn Bloodlines, Iris (played by Gabrielle Rose in the present and Brec Bassinger in the past), the woman who had the premonition of the collapse of the high-rise Skyview Restaurant Tower, did so way way back in 1968. And unlike in the previous films, where many still died in the actual disaster except the few people who left thanks to the premonition, in this situation, Iris saved all of the hundreds of people packing the restaurant that night, who were evacuated thanks to her warning. Slowly but surely, Death did come after them for escaping its grasp, except there were extenuating circumstances, since so many of these people went on to have children and sometimes grandchildren. So Death, always so tidy and persistent, has spent the last 57 years killing not only each survivor off but the entire bloodline that has resulted from each person, since by Death’s rules, they shouldn’t have existed in the first place.. Now, Death’s work on Project: Skyview (our term, not Death’s) is nearly complete, and Iris’ family remains his big unfinished task – all of which starts to become clear to Iris’ granddaughter Stefani (Kaitlyn Santa Juana) when she begins having nightmares of Iris’ Skyview premonition, leading her to seek out the grandmother she’d never met, and who she was always told was crazy. Final Destination: Bloodlines Ending ExplainedA Reunion to Die ForStefani is initially skeptical of Iris’ story and the reason she now has spent years barricaded inside a house she’s attempted to death-proof to protect herself the best she can, even as she tells Stefani she now is dying from cancer and thus won’t be able to escape Death much longer. But when the still disbelieving Stefani goes outside to leave, Iris impulsively runs after her to ensure Stefani takes the book in which Iris has collected her findings on what happened to all those who survived Skyview and how to try to avoid literal Death traps - and decides to prove what she knows about Death’s plan by staying outside long enough for a weather vane to snap off and impale her in front of Stefani. Soon enough, with Iris dead, Death now goes after everyone else in the family, which includes Stefani’s brother and her estranged mother, plus her uncle and three cousins (anyone who married into the family, like Stefani’s father or her aunt are safe, since they would have existed regardless of Skyview). And after Uncle Howard (Alex Zahara) and his daughter Julia (Anna Lore) both go out in classic Final Destination scenarios involving a lawnmower and a garbage truck, the rest of the family is suddenly much more onboard with the claims of both Stefani and her mother Darlene (Rya Kihlstedt) - the latter of whom returns after years in self-exile because her own erratic behavior thanks to her mother’s “Death is everywhere” teachings had made her fear how she was raising her kids. Tony Todd’s Final Appearance: One Last Message From an IconMaking an emotional final appearance as his second most famous horror character after Candyman, the late, great Tony Todd – who passed away a few months after production wrapped on Bloodlines – returns as Final Destination regular William Bludworth, who Stefani and her family encounter at a hospital, learning he is the “JB” Iris referred to in her book. It turns out JB is a nickname his friends use, based off of his full name being William John Bludworth. It’s a fun way to suddenly add some personal touches to a character who was so enigmatic in his previous appearances that this is the first time since we met him 25 years ago that his name has been spoken out loud. Bludworth is only in the one scene, which was the norm for Todd’s role in this franchise, but it’s a big one for several reasons, effectively bidding a well-earned fond farewell to both the character and the man who played him. Beyond his middle name and a nickname we didn’t know before, Bludworth reveals much more, including that he was the little boy who Iris tried to help in her premonition in 1968, in which the two of them died last in the tower collapse, making him the other last target Death has been seeking among those who survived the Skyview. Now though, like Iris did, he has terminal cancer and his time is nearly up once Iris’ family are all gone. Todd himself was sadly in the final stages of stomach cancer when he shot Final Destination: Bloodlines and the filmmakers have noted all involved understood the situation and why it was important to properly say goodbye to the character while, most importantly, giving Todd his due. As Bloodlines co-director Zach Lipovsky explained to IGN, “We’re really grateful that we had the ability to, from the beginning, design that experience for the audience with Tony and with all the writers and everybody. We knew he was ill for quite a while and he was extremely excited to be in the movie. He was very grateful for the ability to participate in the film and he was so joyful on set when he was there and he was cracking jokes and really excited to just have his ability to be in the film and give his character a lot more backstory. We give a lot of answers to who Bludworth is in the film, which is something that during the franchise, people have been clamoring for for a really long time. But we also knew that this was also going to be a goodbye of the character. And that's something that we worked very closely with him, to figure out really the best way of doing that, because these films are about death and his mortality was very present as we were working with him.” Bludworth tells Stefani and the others there are two known methods to actually cheat Death, in a moment that is rather exciting for longtime Final Destination fans in terms of acknowledging previous lore. First, as established in Final Destination 5, you can take the life of someone else - basically using that other person as a sacrifice, with you now getting the “credit” for the time your victim naturally had left to live, or even potentially some extra credit if they had decades and decades more to go before they would have died. But perhaps more importantly, because it’s the only way Bludworth knows of to save everyone still alive involved in a situation like this, is the cheat introduced in Final Destination 2 where clinically dying but then being resuscitated breaks Death’s chain completely. Which means if one of the family can pull this off, they can all be saved. But Bludworth says only one person has ever done this successfully (more on that below). He had this sort of mischievous smile, even when he delivers that line and then says, ‘Good luck.’ -Co-director Zach Lipovsky on shooting Tony Todd's final sceneTodd’s scene ends with Bludworth revealing that he is going to retire and enjoy the time he has left and then his final words get notably poignant for a Final Destination film - something Lipovsky credits fully to Todd. “One of the unique opportunities that came up was that near the end of that scene, we asked him to actually throw away the script for a moment and just speak from the heart as to everything that he was thinking about as far as what the movie was about, what the franchise has been about, but also just what life's about and what is it all about in the end. And the take that's in the film where he says, ‘Life is precious. Cherish every second because you never know when…’ And the earnestness that he says that with all came in the moment from him. And I think you really feel that when you watch the movie that he's obviously speaking as a character who knows that their death is coming, but he's also speaking as an actor who's speaking to the audience as far as what's important in life. And that was a really powerful moment on set when we filmed that with him.” Not surprisingly, it was a highly emotional day on set when Todd shot his scene, but Lipovsky loves how Todd’s actual final words of “Good luck” to the other characters (and, essentially, to the audience) and how he delivers them let him also meld the actor and Bludworth together further.“He had this sort of mischievous smile, even when he delivers that line and then says, ‘Good luck’ in the way that he has – that sort of dark, mischievous way as he goes out the door – he knew exactly what he was doing and he relished [it].” Final Destination: Bloodline GalleryFarewell to the Family While still at the hospital, Stefani’s cousins Erik (Richard Harmon) and Bobby (Owen Patrick Joyner) are the next to go. Technically, Erik wasn’t on Death’s list because he doesn’t share Iris’ bloodline – he’s shocked to discover he was the result of an affair his mother Brenda (April Telek) had – but he gets taken out too when he attempts to break the chain by “killing” his brother using Bobby’s peanut allergy before rushing him to the ER to be revived. However, an errant, Death-controlled MRI machine acting like it’s Magneto on a rampage pulls the piercing-laden Erik towards it, who is then snapped in half when a wheelchair shoves him into the MRI machine in a very unrecommended manner - and then Bobby is stabbed by a projectile-powered spring from a vending machine, which drills into his head. With Uncle Howard’s side of the family all gone, it’s just Stefani and her brother Charlie (Tio Briones) and Darlene left. Given all Iris did to keep it safe for herself inside, they decide to go to Iris’ abandoned cabin, with Darlene intending to now live the isolated life her mother did - because if Death can’t get to her, it can’t move on to her kids. But when they arrive, Death does its best to keep them out, with the RV crashing and Stefani submerged in water as a result, while the house itself gets set on fire and explodes. Darlene is then killed when a post falls onto her but Charlie gets to his sister, who has seemingly drowned, and performs CPR on her. He is able to save her, and in the process, seems to have finally stopped Death from continuing to hunt them. The siblings laugh, thinking they’ve escaped - before one of the train cars suddenly pivots, sending huge logs flying which crush and kill Stefani and Charlie.Sometime later, Charlie is getting ready for prom night alongside his dad and sister and it’s mentioned to his date’s father, who’s a doctor, how Charlie brought Stefani back from the dead. However, the doctor then tells them that, considering how quickly Stefani was revived, she was unconscious but never actually clinically dead… which means Death was never truly thwarted.And that’s when a train passing by crashes and derails, skidding through the street and seemingly aiming right for Stefani and Charlie, who desperately try to outrun it. It comes to a stop and the siblings laugh, thinking they’ve escaped - before one of the train cars suddenly pivots on its side, sending huge logs it was carrying flying through the air, which crush and kill Stefani and Charlie, in a callback to one of the franchise’s most famous and most meme’d moments (from Final Destination 2). Does Final Destination Bloodlines Have a Mid- or Post-Credit Scene?Not really, but there are some visuals accompanying the closing credits that focus on articles Iris had collected in her book about various notable deaths through the years, intercut with quick footage from some of those tragedies - before we end on the newest article, reporting on Stefani and Charlie’s bizarre death. But Does Bloodlines Set Up Final Destination 7 in Any Way?The sixth Final Destination movie doesn’t really offer any set-up for a seventh installment… unless it does? This is a franchise that has never been about heavy serialization. Only the second movie was truly a direct sequel with explicit plot threads to the movie that preceded it, including a prominent returning character in the form of Ali Larter’s Clear Rivers. But following that film – and Clear dying in it – the series consisted of nearly entirely standalone stories that introduced a brand new group of characters each time, with the exception of a possible William Bludworth scene (he wasn’t in Final Destination 3 or 4, though Tony Todd made an audio cameo in FD3). And having new characters made sense, because Final Destination 3, 4 and 5, as with Bloodlines now, also made sure there were zero survivors among their crop of new Death targets. Along with Bludworth, the only real recurring element beyond the core concept was that the strange occurrences of the first film’s Flight 180 explosion and the ill-fated group who initially escaped that scenario were at least somewhat well known and would usually be brought up at some point, but even then, usually in a nebulous manner. (Though Final Destination 5 of course skipped a Flight 180 mention in order to mask its very fun Secret Prequel status, with that film’s ending looping back into the original movie in a thrilling manner.)To have Final Destination 2's Kimberly brought up makes it hard not to wonder if there might be plans for her going forward as someone with important information for those wishing to stop Death.All of which is to say that it really stands out in Final Destination: Bloodlines when Bludworth, while explaining how you can actually cheat Death – and talking about the only person who did it – says the name Kimberly Corman. Played by AJ Cook, Kimberly Corman was the main character in 2003’s Final Destination 2, and following multiple mentions in Bloodlines of the “survivor” Iris wrote about “JB” finding in her book, Bludworth specifically mentions Kimberly as the one and only person who’s ever fully cheated Death without it coming back around on her. In Final Destination 2’s conclusion, Kimberly purposely drove into a lake and drowned and was truly clinically dead briefly before a doctor resuscitated her. (It’s worth noting that Kimberly’s actions also saved her friend, Thomas Burke, who would have died after her, but we’ll just assume Bludworth didn’t want to complicate matters and stuck to discussing the person whose actual decision affected the outcome.)Longtime mega-fans of the series may recall that the Final Destination 3 DVD had a “Choose Their Fate” interactive special feature where you could see alternate scenarios from what occurred in the film. And in one of them, a headline did report on Kimberly and Burke’s eventual deaths. But that version of the story was never canon and now Bludworth’s information in Bloodlines confirms Kimberly’s method really and truly worked and she’s still alive. It’s been 22 years since we’ve seen Kimberly or Burke but to have Kimberly’s name suddenly brought up in this manner makes it hard not to wonder if there might be plans for her going forward as someone with important information for those wishing to stop Death in the future - especially given that, with Bludworth no longer an option, this series is probably in need of a new Person Who Knows Things for the newbies to go to, given sticking only to internet searches for your characters just isn’t cinematically exciting. And look, AJ Cook’s been plenty busy for the past couple of decades as a cast member on Criminal Minds, but maybe she can still take a break to go deal with Death once again. Of course, there’s also Iris’ book and all of the information she’s gathered as a notable remaining element, and it does stand out that Stefani’s father Marty (Tinpo Lee) and Aunt Brenda are both alive at the end of the film, thanks to not being part of Iris’ bloodline. Could either one of them or Iris’ book play a role in the future, at least as far as briefly appearing to pass on what they know? We’ll have to see what Death’s – and the Final Destination producers’ – design is.What did you think of Bloodlines? Let’s discuss in the comments!Note: This story was updated with full spoilers on May 16, 2025.",
  "image": "https://assets-prd.ignimgs.com/2025/05/14/final-destination-bloodlines-ending-thumb-1747257103751.jpg?width=1280",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection data-cy=\"article-subtitle\"\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cstrong\u003eLet\u0026#39;s make this simple: You want to know if there are any post- or mid-credits scenes in \u003c/strong\u003e\u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/movies/final-destination-bloodlines\"\u003e\u003cu\u003e\u003cstrong\u003eFinal Destination: Bloodlines\u003c/strong\u003e\u003c/u\u003e\u003c/a\u003e\u003cstrong\u003e. The answer is no. There weren\u0026#39;t any credits scenes in the first five movies and there isn’t one in the sixth either!\u003c/strong\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cstrong\u003eThere is some imagery that runs along with the credits which is fun to check out though.\u003c/strong\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cstrong\u003eFull spoilers for the movie (and the entire Final Destination series so far) follow!\u003c/strong\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e\u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/final-destination-bloodlines-review\"\u003e\u003cu\u003eFinal Destination: Bloodlines\u003c/u\u003e\u003c/a\u003e manages to have fun with the formula of the series, both sticking to the basic scenario fans expect – someone’s premonition of an impending terrible tragedy leads them to escape that tragedy alongside a group of others, only for Death itself to kill those who escaped it one by one in elaborate ways – while also introducing its own specifics that make it feel a bit different and fresh. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eLet’s break down the ending of the film and how it relates to the series as a whole…\u003c/p\u003e\u003coutput data-cy=\"article-slideshow\"\u003e\u003cdiv data-cy=\"slideshow-view-trigger\"\u003e\u003ch3 data-cy=\"slideshow-preview-title\"\u003eThe Best Final Destination Deaths\u003c/h3\u003e\u003c/div\u003e\u003c/output\u003e\u003ch2 data-cy=\"title2\"\u003eThe Set-Up\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eIn Bloodlines, Iris (played by Gabrielle Rose in the present and Brec Bassinger in the past), the woman who had the premonition of the collapse of the high-rise Skyview Restaurant Tower, did so way way back in 1968. And unlike in the previous films, where many still died in the actual disaster except the few people who left thanks to the premonition, in this situation, Iris saved \u003cem\u003eall\u003c/em\u003e of the hundreds of people packing the restaurant that night, who were evacuated thanks to her warning. Slowly but surely, Death did come after them for escaping its grasp, except there were extenuating circumstances, since so many of these people went on to have children and sometimes grandchildren. So Death, always so tidy and persistent, has spent the last 57 years killing not only each survivor off but the entire bloodline that has resulted from each person, since by Death’s rules, they shouldn’t have existed in the first place.. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eNow, Death’s work on Project: Skyview (our term, not Death’s) is nearly complete, and Iris’ family remains his big unfinished task – all of which starts to become clear to Iris’ granddaughter Stefani (Kaitlyn Santa Juana) when she begins having nightmares of Iris’ Skyview premonition, leading her to seek out the grandmother she’d never met, and who she was always told was crazy. \u003c/p\u003e\u003coutput data-cy=\"article-video\"\u003e\u003c/output\u003e\u003ch2 data-cy=\"title2\"\u003eFinal Destination: Bloodlines Ending Explained\u003c/h2\u003e\u003ch3 data-cy=\"title3\"\u003eA Reunion to Die For\u003c/h3\u003e\u003cp data-cy=\"paragraph\"\u003eStefani is initially skeptical of Iris’ story and the reason she now has spent years barricaded inside a house she’s attempted to death-proof to protect herself the best she can, even as she tells Stefani she now is dying from cancer and thus won’t be able to escape Death much longer. But when the still disbelieving Stefani goes outside to leave, Iris impulsively runs after her to ensure Stefani takes the book in which Iris has collected her findings on what happened to all those who survived Skyview and how to try to avoid literal Death traps - and decides to prove what she knows about Death’s plan by staying outside long enough for a weather vane to snap off and impale her in front of Stefani. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eSoon enough, with Iris dead, Death now goes after everyone else in the family, which includes Stefani’s brother and her estranged mother, plus her uncle and three cousins (anyone who married into the family, like Stefani’s father or her aunt are safe, since they would have existed regardless of Skyview). And after Uncle Howard (Alex Zahara) and his daughter Julia (Anna Lore) both go out in classic Final Destination scenarios involving a lawnmower and a garbage truck, the rest of the family is suddenly much more onboard with the claims of both Stefani and her mother Darlene (Rya Kihlstedt) - the latter of whom returns after years in self-exile because her own erratic behavior thanks to her mother’s “Death is everywhere” teachings had made her fear how she was raising her kids. \u003c/p\u003e\u003ch3 data-cy=\"title3\"\u003eTony Todd’s Final Appearance: One Last Message From an Icon\u003c/h3\u003e\u003cp data-cy=\"paragraph\"\u003eMaking an emotional final appearance as his second most famous horror character after Candyman,\u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/tony-todd-voice-of-spider-man-2s-venom-among-many-other-roles-dies-at-69\"\u003e\u003cu\u003e the late, great Tony Todd\u003c/u\u003e\u003c/a\u003e – who passed away a few months after production wrapped on Bloodlines – returns as Final Destination regular William Bludworth, who Stefani and her family encounter at a hospital, learning he is the “JB” Iris referred to in her book. It turns out JB is a nickname his friends use, based off of his full name being William John Bludworth. It’s a fun way to suddenly add some personal touches to a character who was so enigmatic in his previous appearances that this is the first time since we met him 25 years ago that his name has been spoken out loud. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eBludworth is only in the one scene, which was the norm for Todd’s role in this franchise, but it’s a big one for several reasons, effectively bidding a well-earned fond farewell to both the character and the man who played him. \u003c/p\u003e\u003coutput data-cy=\"article-video\"\u003e\u003c/output\u003e\u003cp data-cy=\"paragraph\"\u003eBeyond his middle name and a nickname we didn’t know before, Bludworth reveals much more, including that he was the little boy who Iris tried to help in her premonition in 1968, in which the two of them died last in the tower collapse, making him the other last target Death has been seeking among those who survived the Skyview. Now though, like Iris did, he has terminal cancer and his time is nearly up once Iris’ family are all gone. Todd himself was sadly in the final stages of stomach cancer when he shot Final Destination: Bloodlines and the filmmakers have noted all involved understood the situation and why it was important to properly say goodbye to the character while, most importantly, giving Todd his due. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eAs Bloodlines co-director Zach Lipovsky explained to IGN, “We’re really grateful that we had the ability to, from the beginning, design that experience for the audience with Tony and with all the writers and everybody. We knew he was ill for quite a while and he was extremely excited to be in the movie. He was very grateful for the ability to participate in the film and he was so joyful on set when he was there and he was cracking jokes and really excited to just have his ability to be in the film and give his character a lot more backstory. We give a lot of answers to who Bludworth is in the film, which is something that during the franchise, people have been clamoring for for a really long time. But we also knew that this was also going to be a goodbye of the character. And that\u0026#39;s something that we worked very closely with him, to figure out really the best way of doing that, because these films are about death and his mortality was very present as we were working with him.” \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eBludworth tells Stefani and the others there are two known methods to actually cheat Death, in a moment that is rather exciting for longtime Final Destination fans in terms of acknowledging previous lore. First, as established in \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/2011/08/11/final-destination-5-review\"\u003e\u003cu\u003eFinal Destination 5\u003c/u\u003e\u003c/a\u003e, you can take the life of someone else - basically using that other person as a sacrifice, with you now getting the “credit” for the time your victim naturally had left to live, or even potentially some extra credit if they had decades and decades more to go before they would have died. But perhaps more importantly, because it’s the only way Bludworth knows of to save everyone still alive involved in a situation like this, is the cheat introduced in \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/movies/final-destination-2\"\u003e\u003cu\u003eFinal Destination 2\u003c/u\u003e\u003c/a\u003e where clinically dying but then being resuscitated breaks Death’s chain completely. Which means if one of the family can pull this off, they can all be saved. But Bludworth says only one person has ever done this successfully (more on that below). \u003c/p\u003e\u003cdiv data-cy=\"quoteBox\"\u003e\u003cp\u003eHe had this sort of mischievous smile, even when he delivers that line and then says, ‘Good luck.’ -Co-director Zach Lipovsky on shooting Tony Todd\u0026#39;s final scene\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eTodd’s scene ends with Bludworth revealing that he is going to retire and enjoy the time he has left and then his final words get notably poignant for a Final Destination film - something Lipovsky credits fully to Todd. “One of the unique opportunities that came up was that near the end of that scene, we asked him to actually throw away the script for a moment and just speak from the heart as to everything that he was thinking about as far as what the movie was about, what the franchise has been about, but also just what life\u0026#39;s about and what is it all about in the end. And the take that\u0026#39;s in the film where he says, ‘Life is precious. Cherish every second because you never know when…’ And the earnestness that he says that with all came in the moment from him. And I think you really feel that when you watch the movie that he\u0026#39;s obviously speaking as a character who knows that their death is coming, but he\u0026#39;s also speaking as an actor who\u0026#39;s speaking to the audience as far as what\u0026#39;s important in life. And that was a really powerful moment on set when we filmed that with him.” \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eNot surprisingly, it was a highly emotional day on set when Todd shot his scene, but Lipovsky loves how Todd’s actual final words of “Good luck” to the other characters (and, essentially, to the audience) and how he delivers them let him also meld the actor and Bludworth together further.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e“He had this sort of mischievous smile, even when he delivers that line and then says, ‘Good luck’ in the way that he has – that sort of dark, mischievous way as he goes out the door – he knew exactly what he was doing and he relished [it].” \u003c/p\u003e\u003coutput data-cy=\"article-slideshow\"\u003e\u003cdiv data-cy=\"slideshow-view-trigger\"\u003e\u003ch3 data-cy=\"slideshow-preview-title\"\u003eFinal Destination: Bloodline Gallery\u003c/h3\u003e\u003c/div\u003e\u003c/output\u003e\u003ch3 data-cy=\"title3\"\u003eFarewell to the Family \u003c/h3\u003e\u003cp data-cy=\"paragraph\"\u003eWhile still at the hospital, Stefani’s cousins Erik (Richard Harmon) and Bobby (Owen Patrick Joyner) are the next to go. Technically, Erik wasn’t on Death’s list because he doesn’t share Iris’ bloodline – he’s shocked to discover he was the result of an affair his mother Brenda (April Telek) had – but he gets taken out too when he attempts to break the chain by “killing” his brother using Bobby’s peanut allergy before rushing him to the ER to be revived. However, an errant, Death-controlled MRI machine acting like it’s Magneto on a rampage pulls the piercing-laden Erik towards it, who is then snapped in half when a wheelchair shoves him into the MRI machine in a very unrecommended manner - and then Bobby is stabbed by a projectile-powered spring from a vending machine, which drills into his head. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eWith Uncle Howard’s side of the family all gone, it’s just Stefani and her brother Charlie (Tio Briones) and Darlene left. Given all Iris did to keep it safe for herself inside, they decide to go to Iris’ abandoned cabin, with Darlene intending to now live the isolated life her mother did - because if Death can’t get to her, it can’t move on to her kids. But when they arrive, Death does its best to keep them out, with the RV crashing and Stefani submerged in water as a result, while the house itself gets set on fire and explodes. Darlene is then killed when a post falls onto her but Charlie gets to his sister, who has seemingly drowned, and performs CPR on her. He is able to save her, and in the process, seems to have finally stopped Death from continuing to hunt them.  \u003c/p\u003e\u003cdiv data-cy=\"quoteBox\"\u003e\u003cp\u003eThe siblings laugh, thinking they’ve escaped - before one of the train cars suddenly pivots, sending huge logs flying which crush and kill Stefani and Charlie.\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eSometime later, Charlie is getting ready for prom night alongside his dad and sister and it’s mentioned to his date’s father, who’s a doctor, how Charlie brought Stefani back from the dead. However, the doctor then tells them that, considering how quickly Stefani was revived, she was unconscious but never actually clinically dead… which means Death was never truly thwarted.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eAnd that’s when a train passing by crashes and derails, skidding through the street and seemingly aiming right for Stefani and Charlie, who desperately try to outrun it. It comes to a stop and the siblings laugh, thinking they’ve escaped - before one of the train cars suddenly pivots on its side, sending huge logs it was carrying flying through the air, which crush and kill Stefani and Charlie, in a callback to one of the franchise’s most famous and most meme’d moments (from Final Destination 2). \u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003eDoes Final Destination Bloodlines Have a Mid- or Post-Credit Scene?\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eNot really, but there are some visuals accompanying the closing credits that focus on articles Iris had collected in her book about various notable deaths through the years, intercut with quick footage from some of those tragedies - before we end on the newest article, reporting on Stefani and Charlie’s bizarre death. \u003c/p\u003e\u003coutput data-cy=\"article-video\"\u003e\u003c/output\u003e\u003ch2 data-cy=\"title2\"\u003eBut Does Bloodlines Set Up Final Destination 7 in Any Way?\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eThe sixth Final Destination movie doesn’t really offer any set-up for a seventh installment… unless it does? \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThis is a franchise that has never been about heavy serialization. Only the second movie was truly a direct sequel with explicit plot threads to the movie that preceded it, including a prominent returning character in the form of Ali Larter’s Clear Rivers. But following that film – and Clear dying in it – the series consisted of nearly entirely standalone stories that introduced a brand new group of characters each time, with the exception of a possible William Bludworth scene (he wasn’t in \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/movies/final-destination-3\"\u003e\u003cu\u003eFinal Destination 3\u003c/u\u003e\u003c/a\u003e or 4, though Tony Todd made an audio cameo in FD3). And having new characters made sense, because Final Destination 3, 4 and 5, as with Bloodlines now, also made sure there were zero survivors among their crop of new Death targets. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eAlong with Bludworth, the only real recurring element beyond the core concept was that the strange occurrences of the first film’s Flight 180 explosion and the ill-fated group who initially escaped that scenario were at least somewhat well known and would usually be brought up at some point, but even then, usually in a nebulous manner. (Though Final Destination 5 of course skipped a Flight 180 mention in order to mask its very fun Secret Prequel status, with that film’s ending looping back into the original movie in a thrilling manner.)\u003c/p\u003e\u003cdiv data-cy=\"quoteBox\"\u003e\u003cp\u003eTo have Final Destination 2\u0026#39;s Kimberly brought up makes it hard not to wonder if there might be plans for her going forward as someone with important information for those wishing to stop Death.\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eAll of which is to say that it really stands out in Final Destination: Bloodlines when Bludworth, while explaining how you can actually cheat Death – and talking about the only person who did it – says the name Kimberly Corman. Played by AJ Cook, Kimberly Corman was the main character in 2003’s Final Destination 2, and following multiple mentions in Bloodlines of the “survivor” Iris wrote about “JB” finding in her book, Bludworth specifically mentions Kimberly as the one and only person who’s \u003cem\u003eever\u003c/em\u003e fully cheated Death without it coming back around on her. In Final Destination 2’s conclusion, Kimberly purposely drove into a lake and drowned and was truly clinically dead briefly before a doctor resuscitated her. (It’s worth noting that Kimberly’s actions also saved her friend, Thomas Burke, who would have died after her, but we’ll just assume Bludworth didn’t want to complicate matters and stuck to discussing the person whose actual decision affected the outcome.)\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eLongtime mega-fans of the series may recall that the Final Destination 3 DVD had a “Choose Their Fate” interactive special feature where you could see alternate scenarios from what occurred in the film. And in one of them, a headline did report on Kimberly and Burke’s eventual deaths. But that version of the story was never canon and now Bludworth’s information in Bloodlines confirms Kimberly’s method really and truly worked and she’s still alive. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eIt’s been 22 years since we’ve seen Kimberly or Burke but to have Kimberly’s name suddenly brought up in this manner makes it hard not to wonder if there might be plans for her going forward as someone with important information for those wishing to stop Death in the future - especially given that, with Bludworth no longer an option, this series is probably in need of a new Person Who Knows Things for the newbies to go to, given sticking only to internet searches for your characters just isn’t cinematically exciting. And look, AJ Cook’s been plenty busy for the past couple of decades as a cast member on Criminal Minds, but maybe she can still take a break to go deal with Death once again. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eOf course, there’s also Iris’ book and all of the information she’s gathered as a notable remaining element, and it does stand out that Stefani’s father Marty (Tinpo Lee) and Aunt Brenda are both alive at the end of the film, thanks to not being part of Iris’ bloodline. Could either one of them or Iris’ book play a role in the future, at least as far as briefly appearing to pass on what they know? We’ll have to see what Death’s – and the Final Destination producers’ – design is.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eWhat did you think of Bloodlines? Let’s discuss in the comments!\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cem\u003eNote: This story was updated with full spoilers on May 16, 2025.\u003c/em\u003e\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "18 min read",
  "publishedTime": "2025-05-17T00:12:00Z",
  "modifiedTime": "2025-05-17T00:13:21.45Z"
}
