{
  "id": "a445de04-79d4-4ba9-bfde-8f19e9d78a4d",
  "title": "Cyberpunk 2077's sequel will see you return to Night City, and head to a new city described as \"Chicago gone wrong\"",
  "link": "https://www.rockpapershotgun.com/cyberpunk-2077s-sequel-will-see-you-return-to-night-city-and-head-to-a-new-city-described-as-chicago-gone-wrong",
  "description": "CD Projekt Red's sequel to Cyberpunk 2077 is mostly a bit of a mystery, and it likely will be for a while yet given that they're currently full steam ahead on The Witcher 4. We know Anna Megill, who worked on Control and the upcoming Fable game, is attached as lead writer, and that the team wants to deal with some big topics, but there's been nothing like plot details shared so far. At the very least, Cyberpunk creator Mike Pondsmith shared some tidbits about it at Digital Dragons, namely to do with the game's map. Read more",
  "author": "Oisin Kuhnke",
  "published": "Tue, 20 May 2025 20:41:05 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "PC",
    "Story Rich",
    "CD Projekt RED",
    "CD Projekt",
    "RPG",
    "Science Fiction",
    "Cyberpunk 2077",
    "Open World",
    "Action Adventure",
    "Xbox One",
    "PS4",
    "PS5",
    "Third person",
    "Xbox Series X/S",
    "Single Player",
    "Shooter",
    "First person"
  ],
  "byline": "Oisin Kuhnke",
  "length": 2548,
  "excerpt": "Cyberpunk 2077's sequel is still mostly mysterious, but the series creator has at least shed a bit of light on where we'll be heading to in it.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/e4c309e9414223cead94a50c24cbecdf/icon/apple-touch-icon.png",
  "text": "So says Mike Pondsmith himself Image credit: CD Projekt RED / Rock Paper Shotgun CD Projekt Red's sequel to Cyberpunk 2077 is mostly a bit of a mystery, and it likely will be for a while yet given that they're currently full steam ahead on The Witcher 4. We know Anna Megill, who worked on Control and the upcoming Fable game, is attached as lead writer, and that the team wants to deal with some big topics, but there's been nothing like plot details shared so far. At the very least, Cyberpunk creator Mike Pondsmith shared some tidbits about it at Digital Dragons, namely to do with the game's map. Pondsmith explained that with the sequel, he's \"not as involved directly,\" but he does get to look at the scripts of the game. \"Last week I was wandering around talking to different departments, and seeing what they had, ‘Oh look, this is the new cyberware, what do you think?’ ‘Oh yeah, that’s pretty good, that works here.’\" Digital Dragons 2025, wtorek - oficjalna transmisja Watch on YouTube In terms of things he shared about the game itself, Pondsmith explained that he \"spent a lot of time talking to one of the environment guys, and he was explaining how the new place… because there’s another city that we visit, and I’m not telling you anymore than that, but there’s another city that we visit. Night City is still there.\" He went on to say, \"I remember looking at it and going, ‘I understand the feel that you’re going for, and this really does work, it doesn’t feel like Blade Runner, it feels more like Chicago gone wrong’. And I said, ‘yeah, I can see this working’.\" I'm going to assume that he probably isn't even meant to say as much as he's said here, but he's also the literal creator of the world of Cyberpunk, I think we can cut him some slack. Based on Pondsmith's comments, we'll be able to roam around Night City once more alongside this new, Chicago-like city. Smart thinking, honestly. I know people complained about how Zelda: Tears of the Kingdom just used the same map again, but if you ask me it expanded and changed it in some pretty interesting ways. The Yakuza series repeatedly used the same locations too, not only working well as asset flips, but as a narrative tool too. I don't even like Cyberpunk 2077 all that much, but I'd still be curious to see how Night City changes between games. I'm sure we'll get some idea of what the RPG will be like in, hmm, at least seven years? Yeah, that sounds about right.",
  "image": "https://assetsio.gnwcdn.com/cyberpunk-2077-phantom-liberty-songbird.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n  \n\n        \u003cp\u003eSo says Mike Pondsmith himself\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n    \u003cimg src=\"https://assetsio.gnwcdn.com/cyberpunk-2077-phantom-liberty-songbird.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/cyberpunk-2077-phantom-liberty-songbird.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/cyberpunk-2077-phantom-liberty-songbird.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Cyberpunk 2077 Phantom Liberty character Songbird.\" data-src-full=\"https://assetsio.gnwcdn.com/cyberpunk-2077-phantom-liberty-songbird.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eCD Projekt RED / Rock Paper Shotgun\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\n\u003ca href=\"https://www.rockpapershotgun.com/companies/cd-projekt-red\"\u003eCD Projekt Red\u0026#39;s\u003c/a\u003e sequel to \u003ca href=\"https://www.rockpapershotgun.com/games/cyberpunk-2077\"\u003eCyberpunk 2077\u003c/a\u003e is mostly a bit of a mystery, and it likely will be for a while yet given that they\u0026#39;re currently full steam ahead on \u003ca href=\"https://www.rockpapershotgun.com/games/the-witcher-4\"\u003eThe Witcher 4\u003c/a\u003e. We know Anna Megill, who worked on Control and the upcoming Fable game, is \u003ca href=\"https://www.rockpapershotgun.com/fable-and-control-writer-joins-cyberpunk-2077-sequel\"\u003eattached as lead writer\u003c/a\u003e, and that the \u003ca href=\"https://www.rockpapershotgun.com/cd-project-devs-want-to-call-out-big-problems-like-homelessness-and-the-wealth-gap-in-cyberpunk-2077-sequel\"\u003eteam wants to deal with some big topics\u003c/a\u003e, but there\u0026#39;s been nothing like plot details shared so far. At the very least, Cyberpunk creator Mike Pondsmith shared some tidbits about it at Digital Dragons, namely to do with the game\u0026#39;s map.\n\u003c/p\u003e\n\n\u003cp\u003e\nPondsmith explained that with the sequel, he\u0026#39;s \u0026#34;not as involved directly,\u0026#34; but he does get to look at the scripts of the game. \u0026#34;Last week I was wandering around talking to different departments, and seeing what they had, ‘Oh look, this is the new cyberware, what do you think?’ ‘Oh yeah, that’s pretty good, that works here.’\u0026#34; \n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Digital Dragons 2025, wtorek - oficjalna transmisja\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/64XD2DtKU64?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/64XD2DtKU64/hqdefault.jpg\"/\u003e\u003cspan\u003eDigital Dragons 2025, wtorek - oficjalna transmisja\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/64XD2DtKU64?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/64XD2DtKU64?autoplay=1\" title=\"Digital Dragons 2025, wtorek - oficjalna transmisja\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003ca href=\"https://www.youtube.com/watch?v=64XD2DtKU64\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figure\u003e\n\u003cp\u003e\nIn terms of things he shared about the game itself, Pondsmith explained that he \u0026#34;spent a lot of time talking to one of the environment guys, and he was explaining how the new place… because there’s another city that we visit, and I’m not telling you anymore than that, but there’s another city that we visit. Night City is still there.\u0026#34; He went on to say, \u0026#34;I remember looking at it and going, ‘I understand the feel that you’re going for, and this really does work, it doesn’t feel like \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/blade-runner\"\u003eBlade Runner\u003c/a\u003e, it feels more like Chicago gone wrong’. And I said, ‘yeah, I can see this working’.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nI\u0026#39;m going to assume that he probably isn\u0026#39;t even meant to say as much as he\u0026#39;s said here, but he\u0026#39;s also the literal creator of the world of Cyberpunk, I think we can cut him some slack.\n\u003c/p\u003e\n\u003cp\u003e\nBased on Pondsmith\u0026#39;s comments, we\u0026#39;ll be able to roam around Night City once more alongside this new, Chicago-like city. Smart thinking, honestly. I know people complained about how Zelda: Tears of the Kingdom just used the same map again, but if you ask me it expanded and changed it in some pretty interesting ways. \n\u003c/p\u003e\n\u003cp\u003e\nThe Yakuza series repeatedly used the same locations too, not only working well as asset flips, but as a narrative tool too. I don\u0026#39;t even like Cyberpunk 2077 all that much, but I\u0026#39;d still be curious to see how Night City changes between games. I\u0026#39;m sure we\u0026#39;ll get some idea of what the \u003ca href=\"https://www.rockpapershotgun.com/best-rpgs\"\u003eRPG\u003c/a\u003e will be like in, hmm, at least seven years? Yeah, that sounds about right.\n\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-20T20:41:05.706638Z",
  "modifiedTime": null
}
