{
  "id": "b0ab833e-89de-4463-a379-824fa0855382",
  "title": "Wuchang: Fallen Feathers' surprise PC performance problems call for emergency settings treatment",
  "link": "https://www.rockpapershotgun.com/wuchang-fallen-feathers-pc-performance-and-settings",
  "description": "I promise this isn’t a \"gAmErS aRe MaD\" story – there’s actual testing and advice and stuff here, honest – but it must begin that way, as I wouldn’t have guessed that birdlike soulslike Wuchang: Fallen Feathers would launch with PC performance issues without a cacophony of (currently 'Mostly Negative') Steam reviews saying so. Not after those easygoing system requirements, surely? Surely yes, it turns out, though maybe not to the extent that a page of 7,000 thumbs-down symbols might suggest. It’s not good. It runs slowly on max settings. There’s stuttering. DLSS 4 frame generation is either broken, or implemented in a uniquely vexing way. But you can smooth things out considerably with a few choice settings adjustments, including on lower-end graphics cards. Read more",
  "author": "James Archer",
  "published": "Thu, 24 Jul 2025 14:56:32 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Third person",
    "Hack \u0026 Slash",
    "RPG",
    "Single Player",
    "Hardware",
    "PS5",
    "Leenzee Games",
    "Action Adventure",
    "PC",
    "Wuchang: Fallen Feathers",
    "505 Games",
    "Xbox Series X/S"
  ],
  "byline": "James Archer",
  "length": 5335,
  "excerpt": "RPS investigates player reports of bad performance in Wuchang: Fallen Feathers, finding it a tough one to run well indeed - though the right settings can help.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/cbbb778434c74222c6ffe0369a44b87b/icon/apple-touch-icon.png",
  "text": "Image credit: Rock Paper Shotgun/505 Games I promise this isn’t a \"gAmErS aRe MaD\" story – there’s actual testing and advice and stuff here, honest – but it must begin that way, as I wouldn’t have guessed that birdlike soulslike Wuchang: Fallen Feathers would launch with PC performance issues without a cacophony of (currently 'Mostly Negative') Steam reviews saying so. Not after those easygoing system requirements, surely? Surely yes, it turns out, though maybe not to the extent that a page of 7,000 thumbs-down symbols might suggest. It’s not good. It runs slowly on max settings. There’s stuttering. DLSS 4 frame generation is either broken, or implemented in a uniquely vexing way. But you can smooth things out considerably with a few choice settings adjustments, including on lower-end graphics cards. On that note, the minimum system requirements still prove quite trustworthy. Even accounting for the RPS Test Rig’s top-end CPU and RAM, fitting it with 6GB GTX 1060 was enough to average a very playable 44fps on Wuchang’s Low preset at 1080p – albeit with a lot of help from TSR upscaling. From the recommended specs, meanwhile, Intel’s Arc A750 averaged 51fps on High, again with TSR. Although you’d typically want 60fps from a \"recommended\" GPU, it's encouraging that cheaper and older components don’t strictly need to slum it at 30fps. Still, FPS averages tell but half the story. Traversal stutter – the kind that occurs when physically moving into new, previously unloaded areas – is a regular occurrence, disrupting the sense of smoothness that might have otherwise enabled more pleasurable sword-swishing. TSR also simply looks worse here than it does in other Unreal Engine 5 games, with very noticeable ghosting and aliasing even on its higher quality settings. And, unless you have an RTX graphics card that will let you replace it with DLSS, it’s effectively required to keep performance up, including at 1080p. I also wouldn’t be surprised if many of those performance complaints arose from attempts to run Wuchang on its highest presets, Extreme and Ultra. Judging from the RTX 4060, one of the most-used GPUs among Steam players, there’s a honking great gap between how these run versus the lower quality presets: sticking to 1080p, with TSR on 67 (Quality mode, basically), Extreme averaged 52fps and Ultra 55fps, before rising sharply to 64fps on High, 72fps at Mid, and 124fps at Low. It’s not unheard of for a game’s potato settings to outpace the fanciest ones by this degree, though it does suggest that those of us who expected buttery framerates on newer gear by virtue of Wuchang’s low minimum specs may have indulged in wishful thinking. Image credit: Rock Paper Shotgun/505 Games The good news is that most of the Low preset’s performance advantage is concentrated into a minority of its individual settings, meaning you can keep most quality toggles at their best while claiming a big FPS bounty from a few reductions. I found that, by far, the most performance-intensive settings are Shadow quality, Vegetation quality – there are a lot of awfully big trees 'round these parts – and Global Illumination, so lowering these from their Extreme or Ultra levels should bear delicious framerate fruits. I’d also heartily recommend replacing TSR with DLSS, if your GPU allows it, and in spite of the fact that – undermining everything I’ve just said about gaining frames – Nvidia’s tech works out slower. About 8% slower on my RTX 4060, to be specific. Nonetheless, it looks much, much sharper and cleaner than TSR does, with more effective AA and fewer visual artifacts. That 8% might not make for a night-and-day difference, but DLSS’s overall quality does. Thus, I re-ran my benchmark with Shadow quality on Mid (Low exists but isn’t any faster), Vegetation on Low, Global Illumination disabled entirely, and DLSS set to 67, ultimately scored a tangibly faster 80fps. Did it fix the stuttering? No, but did at least partially soften its jittery blows, with general performance landing between the Mid and Low presets despite the bulk of individual settings sticking to their Extreme levels. Image credit: Rock Paper Shotgun/505 Games Getting well above 60fps also makes Wuchang more of a viable frame generation candidate, with both standard 2x FG available to RTX 40 GPUs and up to 4x MFG (Multi Frame Generation) for the RTX 50 series. There is, however, a truly bizarre quirk to how this game handles frame gen: it’s disabled by ambient dialogue. You might be pootling along through a bamboo forest, happily counting the 120fps-plus numbers in Steam’s performance monitor, but upon meeting an NPC with some soulslike-standard \"Ah, who’s this?\" chatter, frame gen will suddenly switch itself off. Then, once the dialogue is exhausted, it pops back on, announcing its return with yet another stutter. I’ve never seen anything like this before and, honestly, am at a bit of a loss to explain it – I wondered if it’s something to do with the frames-per-second of cinematic animations, but then most of these speaking characters hardly move from their spot. More likely, it’s just a random bug, but still, don’t rely on interpolation trickery to soothe Wuchang’s PC pains. Sacrifice some settings instead, and see if that helps get Fallen Feathers back skywards.",
  "image": "https://assetsio.gnwcdn.com/red-mercury.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n\u003cspan\u003e\u003c/span\u003e    \u003cimg src=\"https://assetsio.gnwcdn.com/red-mercury.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/red-mercury.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/red-mercury.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Wuchang\u0026#39;s arm is swathed in Red Mercury as she prepares to use a Shrine in Wuchang: Fallen Feathers.\" data-src-full=\"https://assetsio.gnwcdn.com/red-mercury.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eRock Paper Shotgun/505 Games\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eI promise this isn’t a \u0026#34;gAmErS aRe MaD\u0026#34; story – there’s actual testing and advice and stuff here, honest – but it must begin that way, as I wouldn’t have guessed that birdlike soulslike \u003ca href=\"https://www.rockpapershotgun.com/games/wuchang-fallen-feathers\"\u003eWuchang: Fallen Feathers\u003c/a\u003e would launch with PC performance issues without a cacophony of (currently \u0026#39;Mostly Negative\u0026#39;) \u003ca href=\"https://store.steampowered.com/app/2277560/WUCHANG_Fallen_Feathers/#app_reviews_hash\"\u003eSteam reviews\u003c/a\u003e saying so. Not after those easygoing \u003ca href=\"https://www.rockpapershotgun.com/bird-bashing-soulslike-wuchang-fallen-feathers-has-some-pc-system-specs-and-they-are-not-brutal\"\u003esystem requirements\u003c/a\u003e, surely?\u003c/p\u003e\n\u003cp\u003eSurely yes, it turns out, though maybe not to the extent that a page of 7,000 thumbs-down symbols might suggest. It’s not\u003cem\u003e good\u003c/em\u003e. It runs slowly on max settings. There’s stuttering. \u003ca href=\"https://www.rockpapershotgun.com/nvidia-dlss-4-explained\"\u003eDLSS 4 frame generation\u003c/a\u003e is either broken, or implemented in a uniquely vexing way. But you can smooth things out considerably with a few choice settings adjustments, including on lower-end \u003ca href=\"https://www.rockpapershotgun.com/best-graphics-card\"\u003egraphics cards\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eOn that note, the minimum system requirements still prove quite trustworthy. Even accounting for the RPS Test Rig’s top-end CPU and RAM, fitting it with 6GB GTX 1060 was enough to average a very playable 44fps on Wuchang’s Low preset at 1080p – albeit with a lot of help from TSR upscaling. From the recommended specs, meanwhile, Intel’s Arc A750 averaged 51fps on High, again with TSR. Although you’d typically want 60fps from a \u0026#34;recommended\u0026#34; GPU, it\u0026#39;s encouraging that cheaper and older components don’t strictly need to slum it at 30fps.\u003c/p\u003e\n\u003cp\u003eStill, FPS averages tell but half the story. Traversal stutter – the kind that occurs when physically moving into new, previously unloaded areas – is a regular occurrence, disrupting the sense of smoothness that might have otherwise enabled more pleasurable sword-swishing. TSR also simply looks worse here than it does in other Unreal Engine 5 games, with very noticeable ghosting and aliasing even on its higher quality settings. And, unless you have an RTX graphics card that will let you replace it with DLSS, it’s effectively required to keep performance up, including at 1080p.\u003c/p\u003e\n\u003cp\u003eI also wouldn’t be surprised if many of those performance complaints arose from attempts to run Wuchang on its highest presets, Extreme and Ultra. Judging from the \u003ca href=\"https://www.rockpapershotgun.com/nvidia-geforce-rtx-4060-review\"\u003eRTX 4060\u003c/a\u003e, one of the most-used GPUs among Steam players, there’s a honking great gap between how these run versus the lower quality presets: sticking to 1080p, with TSR on 67 (Quality mode, basically), Extreme averaged 52fps and Ultra 55fps, before rising sharply to 64fps on High, 72fps at Mid, and 124fps at Low. It’s not unheard of for a game’s potato settings to outpace the fanciest ones by this degree, though it does suggest that those of us who expected buttery framerates on newer gear by virtue of Wuchang’s low minimum specs may have indulged in wishful thinking.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cimg alt=\"Wuchang faces the bat-like Bai Kru demon in Wuchang: Fallen Feathers.\" data-src-full=\"https://assetsio.gnwcdn.com/bai-kru.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/bai-kru.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/bai-kru.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/bai-kru.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRock Paper Shotgun/505 Games\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eThe good news is that most of the Low preset’s performance advantage is concentrated into a minority of its individual settings, meaning you can keep most quality toggles at their best while claiming a big FPS bounty from a few reductions. I found that, by far, the most performance-intensive settings are Shadow quality, Vegetation quality – there are a lot of awfully big trees \u0026#39;round these parts – and Global Illumination, so lowering these from their Extreme or Ultra levels should bear delicious framerate fruits.\u003c/p\u003e\n\u003cp\u003eI’d also heartily recommend replacing TSR with DLSS, if your GPU allows it, and in spite of the fact that – undermining everything I’ve just said about gaining frames – Nvidia’s tech works out slower. About 8% slower on my RTX 4060, to be specific. Nonetheless, it looks much, much sharper and cleaner than TSR does, with more effective AA and fewer visual artifacts. That 8% might not make for a night-and-day difference, but DLSS’s overall quality does.\u003c/p\u003e\n\u003cp\u003eThus, I re-ran my benchmark with Shadow quality on Mid (Low exists but isn’t any faster), Vegetation on Low, Global Illumination disabled entirely, and DLSS set to 67, ultimately scored a tangibly faster 80fps. Did it fix the stuttering? No, but did at least partially soften its jittery blows, with general performance landing between the Mid and Low presets despite the bulk of individual settings sticking to their Extreme levels.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cimg alt=\"A big ol\u0026#39; chubby Panda hangs out in front of a fire in Wuchang Fallen Feathers, ready to accept Bamboo Shoots for rare items.\" data-src-full=\"https://assetsio.gnwcdn.com/panda_RKnI7hL.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/panda_RKnI7hL.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/panda_RKnI7hL.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/panda_RKnI7hL.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRock Paper Shotgun/505 Games\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eGetting well above 60fps also makes Wuchang more of a viable frame generation candidate, with both standard 2x FG available to RTX 40 GPUs and up to 4x MFG (Multi Frame Generation) for the RTX 50 series. There is, however, a truly bizarre quirk to how this game handles frame gen: it’s disabled by ambient dialogue. You might be pootling along through a bamboo forest, happily counting the 120fps-plus numbers in \u003ca href=\"https://www.rockpapershotgun.com/steams-updated-pc-performance-monitor-is-quietly-clever-and-not-just-because-it-digs-into-frame-generation\"\u003eSteam’s performance monitor\u003c/a\u003e, but upon meeting an NPC with some soulslike-standard \u0026#34;Ah, who’s this?\u0026#34; chatter, frame gen will suddenly switch itself off. Then, once the dialogue is exhausted, it pops back on, announcing its return with yet another stutter. I’ve never seen anything like this before and, honestly, am at a bit of a loss to explain it – I wondered if it’s something to do with the frames-per-second of cinematic animations, but then most of these speaking characters hardly move from their spot.\u003c/p\u003e\n\u003cp\u003eMore likely, it’s just a random bug, but still, don’t rely on interpolation trickery to soothe Wuchang’s PC pains. Sacrifice some settings instead, and see if that helps get Fallen Feathers back skywards.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-24T14:56:32.556137Z",
  "modifiedTime": null
}
