{
  "id": "b70c499c-1eb1-4340-8680-05df5d4aaf63",
  "title": "As if 14 jobs wasn't enough work, Fantasy Life i: The Girl Who Steals Time is getting an open world roguelike mode",
  "link": "https://www.rockpapershotgun.com/as-if-14-jobs-wasnt-enough-work-fantasy-life-i-the-girl-who-steals-time-is-getting-an-open-world-roguelike-mode",
  "description": "You would think that being able to take on 14 different jobs would be enough to keep most people busy in Fantasy Life i: The Girl Who Steals Time, but to Level-5 it seems like that won't be enough. Last month, the developer announced that because the RPG has done so well, they'll be releasing a free update/ bit of DLC called Update the World, and they've now offered a couple of details as to what that'll be. Read more",
  "author": "Oisin Kuhnke",
  "published": "Thu, 19 Jun 2025 21:57:35 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "RPG",
    "Simulation",
    "Xbox Series X/S",
    "Single Player",
    "Multiplayer Competitive",
    "PS5",
    "Nintendo Switch 2",
    "Multiplayer Cooperative",
    "PC",
    "PS4",
    "Fantasy Life i: The Girl Who Steals Time",
    "Action Adventure",
    "Nintendo Switch",
    "Third person"
  ],
  "byline": "Oisin Kuhnke",
  "length": 1769,
  "excerpt": "Fantasy Life i: The Girl Who Steals time will be getting a free open world roguelike mode at some point in the future.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/e38353f6a34f5b80cefc27cadb5d66bf/icon/apple-touch-icon.png",
  "text": "I suppose roguelikes are a bit like jobs themselves, aren't they Image credit: Level-5 You would think that being able to take on 14 different jobs would be enough to keep most people busy in Fantasy Life i: The Girl Who Steals Time, but to Level-5 it seems like that won't be enough. Last month, the developer announced that because the RPG has done so well, they'll be releasing a free update/ bit of DLC called Update the World, and they've now offered a couple of details as to what that'll be. Apparently, it'll be a \"roguelike open world\" mode, which mostly just sounds like a bit of an awkward translation, but the post detailing the mode did explain it a touch at least: \"The update will feature an evolved version of Ginormosia, including a system blending roguelike and open-world elements that offers engaging content for both experienced players and newcomers alike.\" So, kind of what it says on the tin honestly. No details were shared as to how the mode will work, but there will be some new gear, equipment, mounts, hairstyles, emotes, and \"unusual items\". A bit of character art featuring an evil, wizardy looking big dog creature with a mysterious set of cases attached to their back was also shown off. This new character will arrive with the update, and \"plays a pivotal role in the story and is set to leave a significant mark on the world.\" Kind of love Level-5 just dropping a PNG of some guy almost completely contextlessly. The team is apparently \"actively working\" on all this new stuff, but there's no release date in sight for it just yet. Considering how big that game is though, I'm sure you've got more than enough to be getting on with in the meantime.",
  "image": "https://assetsio.gnwcdn.com/fantasy-life-i-roguelike-mode.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n  \n\n        \u003cp\u003eI suppose roguelikes are a bit like jobs themselves, aren\u0026#39;t they\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n    \u003cimg src=\"https://assetsio.gnwcdn.com/fantasy-life-i-roguelike-mode.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/fantasy-life-i-roguelike-mode.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/fantasy-life-i-roguelike-mode.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Key art of Fantasy Life i showing different characters in different outfits overlooking a cliff at a big open world, with text superimposed over the top that reads: new mode \u0026#34;roguelike open world\u0026#34; confirmed.\" data-src-full=\"https://assetsio.gnwcdn.com/fantasy-life-i-roguelike-mode.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eLevel-5\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nYou would think that being able to take on 14 different jobs would be enough to keep most people busy in \u003ca href=\"https://www.rockpapershotgun.com/games/fantasy-life-i-the-girl-who-steals-time\"\u003eFantasy Life i: The Girl Who Steals Time\u003c/a\u003e, but to Level-5 it seems like that won\u0026#39;t be enough. Last month, the developer announced that because the \u003ca href=\"https://www.rockpapershotgun.com/best-rpgs\"\u003eRPG\u003c/a\u003e has done so well, they\u0026#39;ll be \u003ca href=\"https://www.rockpapershotgun.com/level-5-are-so-pleased-with-how-fantasy-life-i-the-girl-who-steals-time-is-doing-theyre-giving-away-a-free-bit-of-dlc\"\u003ereleasing a free update/ bit of DLC called Update the World\u003c/a\u003e, and they\u0026#39;ve now offered a couple of details as to what that\u0026#39;ll be.\n\u003c/p\u003e\n\n\u003cp\u003e\nApparently, it\u0026#39;ll be a \u0026#34;roguelike open world\u0026#34; mode, which mostly just sounds like a bit of an awkward translation, but the \u003ca href=\"https://www.fantasylife.jp/fli/en/topics/250619/\"\u003epost\u003c/a\u003e detailing the mode did explain it a touch at least: \u0026#34;The update will feature an evolved version of Ginormosia, including a system blending roguelike and open-world elements that offers engaging content for both experienced players and newcomers alike.\u0026#34; So, kind of what it says on the tin honestly. No details were shared as to how the mode will work, but there will be some new gear, equipment, mounts, hairstyles, emotes, and \u0026#34;unusual items\u0026#34;.\n\u003c/p\u003e\n\u003cp\u003e\nA bit of character art featuring an evil, wizardy looking big dog creature with a mysterious set of cases attached to their back was also shown off. This new character will arrive with the update, and \u0026#34;plays a pivotal role in the story and is set to leave a significant mark on the world.\u0026#34; Kind of love Level-5 just dropping a PNG of some guy almost completely contextlessly.\n\u003c/p\u003e\n\u003cp\u003e\nThe team is apparently \u0026#34;actively working\u0026#34; on all this new stuff, but there\u0026#39;s no release date in sight for it just yet. Considering how big that game is though, I\u0026#39;m sure you\u0026#39;ve got more than enough to be getting on with in the meantime.\n\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-19T21:57:35.476833Z",
  "modifiedTime": null
}
