{
  "id": "bd405a89-9341-4a1c-a005-798b38bfb2e2",
  "title": "Alien: Isolation mod messes with events so it technically ends before it begins",
  "link": "https://www.eurogamer.net/alien-isolation-mod-messes-with-events-so-it-technically-ends-before-it-begins",
  "description": "Were you one of those people who thought Alien: Isolation went on a bit too long? Would you have preferred it if the much-loved sci-fi horror wrapped things up after 46 seconds? If so, you're in luck: one enterprising modder has now released an \"impossible\" mod that slings a chronological spanner in the works so the game technically ends before it begins. Read more",
  "author": "Matt Wales",
  "published": "Fri, 01 Nov 2024 00:57:51 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "The Creative Assembly",
    "Single Player",
    "iOS",
    "Alien: Isolation",
    "Android",
    "PS3",
    "PC",
    "SEGA",
    "Xbox 360",
    "Nintendo Switch",
    "PS4",
    "Xbox One",
    "Creative Assembly",
    "Action Adventure",
    "First person"
  ],
  "byline": "Matt Wales",
  "length": 2693,
  "excerpt": "Were you one of those people who thought Alien: Isolation went on a bit too long? Would you have preferred it if the mu…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/57ed6311a6ad8dd1a3eee7789bbf9070/icon/apple-touch-icon-152x152.png",
  "text": "To please people who thought it was too long. Image credit: Creative Assembly Were you one of those people who thought Alien: Isolation went on a bit too long? Would you have preferred it if the much-loved sci-fi horror wrapped things up after 46 seconds? If so, you're in luck: one enterprising modder has now released an \"impossible\" mod that slings a chronological spanner in the works so the game technically ends before it begins. \"In an attempt to please IGN,\" modder Matt Filer wrote on YouTube (and if you don't know what that's about, all should become clear over here), \"this mod substantially shortens Alien: Isolation's playable length by introducing Xenomorphs to LV-426.\" And here comes the science bit. What you're seeing in Filer's 46-second video below is an ordinarily Xenomorph-free flashback sequence that usually takes place a good few hours into Alien: Isolation. It's a scene that sets the main story - in which Amanda Ripley searches for her mother - into motion, and one that would create a hell of a paradox if, say, someone shoved in a murderous Xenomorph, causing the flashback crew to perish. \"As a result of the inevitable fatalities,\" Filer continues, \"Marlow's team never discovers Ellen Ripley's flight recorder, and subsequently never arrive on Sevastopol to cause the Xenomorph outbreak.\" Alien: Isolation Impossible Campaign Mod Alien: Isolation Impossible Campaign Mod.Watch on YouTube However, the mod does a bit more than add a Xenomorph; it also shifts the flashback sequence to the very start of the game. That both prevents the paradoxical weirdness of having it pop up severeal hours after Amanda is already doing her thing, and means that - depending how ruthlessly efficient the Xenomorph is feeling - the entire story \"usually ends in under a minute\". Or in the case of Filer's illustrative video, 46 seconds. The mod, which can be downloaded on Nexus Mods, isn't just an amusing novelty; it also serves as an advert for Filer's OpenCAGE, an open source set of mod tools for Alien: Isolation capable of \"asset import/export, level script modification/creation, core configuration edits, NPC and behaviour tweaks, weapon mods, and more!\". And if you're curious what else they can achieve, Filer has helpfully released a Thomas the Tank Engine mod, as is now obligatory. Sega recently confirmed an Alien: Isolation sequel is in early development, with the original game's director onboard. Unfortunately for everyone, Filer's mod now makes that a temporal impossibility, so expect reality to start collapsing in on itself anytime soon.",
  "image": "https://assetsio.gnwcdn.com/Alien-Isolation-header_UbuabXE.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \n\n    \u003cdiv\u003e\n        \n\n        \u003cp\u003eTo please people who thought it was too long.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/Alien-Isolation-header_UbuabXE.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/Alien-Isolation-header_UbuabXE.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Alien-Isolation-header_UbuabXE.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Alien-Isolation-header_UbuabXE.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Alien Isolation\u0026#39;s alien enemy\" width=\"690\" height=\"390\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eCreative Assembly\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv\u003e\n\n\n\n            \u003cp\u003e\nWere you one of those people who thought \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/alien-isolation\"\u003eAlien: Isolation\u003c/a\u003e went on a bit too long? Would you have preferred it if the much-loved sci-fi horror wrapped things up after 46 seconds? If so, you\u0026#39;re in luck: one enterprising modder has now released an \u0026#34;impossible\u0026#34; mod that slings a chronological spanner in the works so the game technically ends before it begins.\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;In an attempt to please IGN,\u0026#34; modder Matt Filer wrote \u003ca href=\"https://www.youtube.com/watch?v=QlicicqW9mY\"\u003eon YouTube\u003c/a\u003e (and if you don\u0026#39;t know what that\u0026#39;s about, all should become clear \u003ca href=\"https://www.ign.com/articles/2014/10/03/alien-isolation-review\"\u003eover here\u003c/a\u003e), \u0026#34;this mod substantially shortens Alien: Isolation\u0026#39;s playable length by introducing Xenomorphs to LV-426.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nAnd here comes the science bit. What you\u0026#39;re seeing in Filer\u0026#39;s 46-second video below is an ordinarily Xenomorph-free flashback sequence that usually takes place a good few hours into Alien: Isolation. It\u0026#39;s a scene that sets the main story - in which Amanda Ripley searches for her mother - into motion, and one that would create a hell of a paradox if, say, someone shoved in a murderous Xenomorph, causing the flashback crew to perish. \u0026#34;As a result of the inevitable fatalities,\u0026#34; Filer continues, \u0026#34;Marlow\u0026#39;s team never discovers Ellen Ripley\u0026#39;s flight recorder, and subsequently never arrive on Sevastopol to cause the Xenomorph outbreak.\u0026#34;\n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Alien: Isolation Impossible Campaign Mod\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/QlicicqW9mY?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/QlicicqW9mY/hqdefault.jpg\"/\u003e\u003cspan\u003eAlien: Isolation Impossible Campaign Mod\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/QlicicqW9mY?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/QlicicqW9mY?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eAlien: Isolation Impossible Campaign Mod.\u003ca href=\"https://www.youtube.com/watch?v=QlicicqW9mY\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\n However, the mod does a bit more than add a Xenomorph; it also shifts the flashback sequence to the very start of the game. That both prevents the paradoxical weirdness of having it pop up severeal hours after Amanda is already doing her thing, and means that - depending how ruthlessly efficient the Xenomorph is feeling - the entire story \u0026#34;usually ends in under a minute\u0026#34;. Or in the case of Filer\u0026#39;s illustrative video, 46 seconds.\n\u003c/p\u003e\u003cp\u003e\nThe mod, which can be \u003ca href=\"https://next.nexusmods.com/profile/MattFiler/mods?gameId=1310\"\u003edownloaded on Nexus Mods\u003c/a\u003e, isn\u0026#39;t \u003cem\u003ejust\u003c/em\u003e an amusing novelty; it also serves as an advert for Filer\u0026#39;s \u003ca href=\"https://opencage.co.uk/docs/\"\u003eOpenCAGE\u003c/a\u003e, an open source set of mod tools for Alien: Isolation capable of \u0026#34;asset import/export, level script modification/creation, core configuration edits, NPC and behaviour tweaks, weapon mods, and more!\u0026#34;. And if you\u0026#39;re curious what else they can achieve, Filer has helpfully released a \u003ca href=\"https://www.nexusmods.com/alienisolation/mods/48\"\u003eThomas the Tank Engine mod\u003c/a\u003e, as is now obligatory.\n\u003c/p\u003e\n\u003cp\u003e\nSega recently confirmed an \u003ca href=\"https://www.eurogamer.net/alien-isolation-2-teased-by-creative-assembly-with-original-director-returning\"\u003eAlien: Isolation sequel is in early development\u003c/a\u003e, with the original game\u0026#39;s director onboard. Unfortunately for everyone, Filer\u0026#39;s mod now makes that a temporal impossibility, so expect reality to start collapsing in on itself anytime soon.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-01T00:57:51.11714Z",
  "modifiedTime": null
}
