{
  "id": "c64d58ba-2a70-4823-9ca6-483f376cf215",
  "title": "Silent Hill 2 remake studio Bloober are working on another Konami series and it's \"truly special\"",
  "link": "https://www.rockpapershotgun.com/silent-hill-2-remake-studio-bloober-are-working-on-another-konami-series-and-its-truly-special",
  "description": "Silent Hill 2 remake wranglers Bloober Team have emerged from the newly high-resolution, volumetric fog to threaten us with the prospect of another \"game based on Konami's IP\". Thank heavens, I was beginning to think we'd never get a new Frogger. Whatever the project is, we won't hear about it for a while. Read more",
  "author": "Edwin Evans-Thirlwell",
  "published": "Tue, 25 Feb 2025 16:58:44 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Konami",
    "Action Adventure",
    "Puzzle",
    "PC",
    "PS5",
    "Silent Hill 2 Remake",
    "Third person",
    "Bloober Team",
    "Single Player"
  ],
  "byline": "Edwin Evans-Thirlwell",
  "length": 2677,
  "excerpt": "The creators of Observer and The Medium are collaborating with the Metal Gear publisher on another old Konami IP, but which?",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/12ce386a6d7cb84515082c308d212866/icon/apple-touch-icon.png",
  "text": "\"Our collaboration with Konami has been incredibly fruitful,\" says Blooberboss Image credit: Rock Paper Shotgun/Konami Silent Hill 2 remake wranglers Bloober Team have emerged from the newly high-resolution, volumetric fog to threaten us with the prospect of another \"game based on Konami's IP\". Thank heavens, I was beginning to think we'd never get a new Frogger. Whatever the project is, we won't hear about it for a while. But of course I am not actually suggesting that Bloober are making a Frogger game, you sweet summer child! Look at you, all confused and alarmed and brandishing a chair over your head. Calm down, the frogs are all in your mind. The Silent Hill 2 remake has been a hit for Konami, and Bloober show no signs of wanting to move on from the horror genre. As such, it seems likely that Konami are handing them the keys to another Silent Hill project. \"Our collaboration with Konami has been incredibly fruitful, and the success of Silent Hill 2 speaks for itself,\" Piotr Babieno, CEO of Bloober Team, commented in a release. \"By sharing knowledge and experience, we have been able to create high-quality production together. Of course, we can't reveal too many details at this time, but we are confident that fans will be just as excited about our collaboration as we are. We can't wait to share something truly special with players when the time is right. \"The trust built upon the success of Silent Hill 2 laid the foundation for signing another agreement for a new project,\" he continued. \"The deal aligns with Bloober Team's strategic plan to expand its internal development division within a first-party framework.\" Assuming it's another Silent Hill outing, it's probably another remake. Perhaps it's the original Silent Hill, though Bloober pushed back on the idea of remaking Silent Hill 1 when I spoke to them in person, commenting that they feel a particular creative kinship for the first sequel. Of course, they did tell me that ultimately, it's Konami's call, and Konami are pretty fond of playing the hits right now. The new game could also be a brand new Hill, but Konami have a few of those in the works already, and may not be inclined to further spread their bets. Either way, it's quids in for Bloober, who get to bolster their fame and finances by working within the Konamiverse, while pushing ahead with their latest original game, the Dead Spacey time-traveller Cronos: The New Dawn. Good for them, I say. Perhaps if they keep wowing Konami, they'll end up making a Metal Gear Solid game. Haha, no, but seriously: please put the chair down.",
  "image": "https://assetsio.gnwcdn.com/Silent-Hill-2-remake-hole.png?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n  \n\n        \u003cp\u003e\u0026#34;Our collaboration with Konami has been incredibly fruitful,\u0026#34; says Blooberboss\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/Silent-Hill-2-remake-hole.png?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/Silent-Hill-2-remake-hole.png?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Silent-Hill-2-remake-hole.png?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Silent-Hill-2-remake-hole.png?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"James nervously prepares to stick his hand in a mysterious hole in the wall the Silent Hill 2 remake.\" width=\"382\" height=\"215\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eRock Paper Shotgun/Konami\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/silent-hill-2\"\u003eSilent Hill 2\u003c/a\u003e remake wranglers Bloober Team have emerged from the newly high-resolution, volumetric fog to threaten us with the prospect of another \u0026#34;game based on Konami\u0026#39;s IP\u0026#34;. Thank heavens, I was beginning to think we\u0026#39;d never get a new Frogger. Whatever the project is, we won\u0026#39;t hear about it for a while.\u003c/p\u003e\n\u003cp\u003eBut of course I am not actually suggesting that Bloober are making a Frogger game, you sweet summer child! Look at you, all confused and alarmed and brandishing a chair over your head. Calm down, the frogs are all in your mind. The Silent Hill 2 remake has been \u003ca href=\"https://www.rockpapershotgun.com/silent-hill-2-review\"\u003ea hit\u003c/a\u003e for Konami, and Bloober show no signs of wanting to move on from the horror genre. As such, it seems likely that Konami are handing them the keys to another Silent Hill project.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our collaboration with Konami has been incredibly fruitful, and the success of Silent Hill 2 speaks for itself,\u0026#34; Piotr Babieno, CEO of Bloober Team, commented in a release. \u0026#34;By sharing knowledge and experience, we have been able to create high-quality production together. Of course, we can\u0026#39;t reveal too many details at this time, but we are confident that fans will be just as excited about our collaboration as we are. We can\u0026#39;t wait to share something truly special with players when the time is right.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The trust built upon the success of Silent Hill 2 laid the foundation for signing another agreement for a new project,\u0026#34; he continued. \u0026#34;The deal aligns with Bloober Team\u0026#39;s strategic plan to expand its internal development division within a first-party framework.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAssuming it\u0026#39;s another Silent Hill outing, it\u0026#39;s probably another remake. Perhaps it\u0026#39;s the original Silent Hill, though Bloober \u003ca href=\"https://www.rockpapershotgun.com/why-didnt-silent-hill-2-remake-devs-bloober-start-by-remaking-silent-hill-1-the-devs-explain\"\u003epushed back on the idea of remaking Silent Hill 1\u003c/a\u003e when I spoke to them in person, commenting that they feel a particular creative kinship for the first sequel.\u003c/p\u003e\n\u003cp\u003eOf course, they did tell me that ultimately, it\u0026#39;s Konami\u0026#39;s call, and Konami are \u003ca href=\"https://www.rockpapershotgun.com/games/metal-gear-solid-delta-snake-eater\"\u003epretty fond of playing the hits\u003c/a\u003e right now. The new game could also be a brand new Hill, but Konami \u003ca href=\"https://www.rockpapershotgun.com/every-new-silent-hill-project-announced-including-the-silent-hill-2-remake\"\u003ehave a few of those in the works already\u003c/a\u003e, and may not be inclined to further spread their bets.\u003c/p\u003e\n\u003cp\u003eEither way, it\u0026#39;s quids in for Bloober, who get to bolster their fame and finances by working within the Konamiverse, while pushing ahead with \u003ca href=\"https://www.rockpapershotgun.com/the-silent-hill-2-remake-devs-new-horror-game-is-a-time-travelling-jaunt-through-apocalyptic-eastern-europe\"\u003etheir latest original game\u003c/a\u003e, the Dead Spacey time-traveller \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/cronos-the-new-dawn\"\u003eCronos: The New Dawn\u003c/a\u003e. Good for them, I say. Perhaps if they keep wowing Konami, they\u0026#39;ll end up making a \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/metal-gear-solid\"\u003eMetal Gear Solid\u003c/a\u003e game. Haha, no, but seriously: please put the chair down.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-25T16:58:44.615885Z",
  "modifiedTime": null
}
