{
  "id": "c91cba34-8ce7-4474-9281-53d137eb991e",
  "title": "Eternal Strands review",
  "link": "https://www.rockpapershotgun.com/eternal-strands-review",
  "description": "When I’ve had enough of fighting the dogs in a respectable, straightforward manner, I pick them up with my mind and - with a casualness that has to be extremely insulting if you’re a dog - drop them directly off a cliff. This ends the fight immediately. Sometimes I resort to this low move out of frustration, when a dull fight has dragged on for too long. Sometimes I resort to it out of panic, because I’ve accidentally set fire to every hard surface within ten feet, or frozen myself to a wall. Often it’s just for the pleasure of it. In Eternal Strands, Yellow Brick Games’ debut title, you play the leader of a \"weaver band\", a crew of freelance magicians, in a world where something extremely bad happened to magic. Some years ago, the Enclave, a city state acting as the isolationist heart of the world’s magic, exploded in a kind of power surge - one part tsunami, one part blown fuse - and just as quickly sealed itself off from the world outside. Somehow managing to breach the wall, your band finds themselves the first people to set foot inside the ruined capital since the calamity and sets about uncovering the mystery of what exactly went wrong. Read more",
  "author": "Sophie Glass",
  "published": "Wed, 05 Feb 2025 16:01:45 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Exploration",
    "PS5",
    "RPG: Action",
    "Eternal Strands",
    "Action Adventure",
    "Third person",
    "Single Player",
    "Fantasy",
    "Yellow Brick Games",
    "PC",
    "Xbox Series X/S"
  ],
  "byline": "Review by Sophie Glass Contributor",
  "length": 13610,
  "excerpt": "Despite some janky controls and bland characters, Eternal Strands is consistently surprising and enjoyable.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/e9768f183ced7f9ad405a3cb254df75c/icon/apple-touch-icon.png",
  "text": "When I’ve had enough of fighting the dogs in a respectable, straightforward manner, I pick them up with my mind and - with a casualness that has to be extremely insulting if you’re a dog - drop them directly off a cliff. This ends the fight immediately. Sometimes I resort to this low move out of frustration, when a dull fight has dragged on for too long. Sometimes I resort to it out of panic, because I’ve accidentally set fire to every hard surface within ten feet, or frozen myself to a wall. Often it’s just for the pleasure of it. In Eternal Strands, Yellow Brick Games’ debut title, you play the leader of a \"weaver band\", a crew of freelance magicians, in a world where something extremely bad happened to magic. Some years ago, the Enclave, a city state acting as the isolationist heart of the world’s magic, exploded in a kind of power surge - one part tsunami, one part blown fuse - and just as quickly sealed itself off from the world outside. Somehow managing to breach the wall, your band finds themselves the first people to set foot inside the ruined capital since the calamity and sets about uncovering the mystery of what exactly went wrong. It’s a compelling mystery! From the off, the world is sharply drawn and the stakes made clear. The lands outside the Enclave (a rogues gallery of various countries familiar to anybody who has spent time in Cyrodiil or Thedas) relied so heavily on the magical output and technology of the isolationist state that the surge’s effects spread widely and disastrously. This is told to you first in vague terms: things broke, magical constructs went wild, resources spread thin. Wars started all over. As the game continues, more and more specific consequences come bubbling up: everybody bought Enclave tools to control the weather, for example, and in their failure sickly storms started to roll across deserts and trade fleets were wrecked. Magicians, even those outside the Enclave’s walls, were blamed and reviled. All this happens in the background, of course. But it’s there, and it lends an electric feel to your first steps into the Enclave: you are touching a live wire that started a fire that burned down a continent. In practice, what you’re doing starts straightforwardly. You enter a series of large, open levels to perform simple \"setting up\" tasks. Get the Enclave’s teleportation system back online so you can travel deeper. Find materials to get your beleaguered band back on track. The Enclave was wildly famous - the center of the world - and so your party has some understanding of what to expect and what to prioritise, but the interplay between their expectations and the reality of the ruined place is a tension well exploited by the game in its first act. Arkons, titanic magical constructs, roam the outskirts. There’s a dragon in the bog. You’re equipped from the start with two spells that speak to the game’s systemic aspirations: a rapid freeze reminiscent of Prey’s gloo gun that lets you draw ice onto the environment and a classic telekinesis power for dropping dogs off cliffs. These are broadly unrestricted. Draw ice onto anything. Make a little bridge. Pick up an enemy right off the bat and throw them into a lake. Obviously heavier things are going to take an upgrade, but there’s a freedom on offer here that I appreciate. The ice ability, too, acts as a way into the game’s elemental magic system. This is a world full of plants that explode into ice, and dynamically propagating fire which spreads through underbrush. There’s the sensibility of an immersive sim bubbling away under here, not just in the way you’re encouraged to blend the utility of your powers, but in the cascading, sweaty disasters you’ll regularly turn encounters into. Past a certain point, I was setting myself on fire so regularly that I gave in and constructed a suit of armor that made me functionally fireproof. I found a spell that summoned a small fiery boy to follow me around, but warned me that if he took enough damage, he’d explode. Fair enough, I said. No skin off my nose. Freed from having to worry about flames, the fiery boy become a go-to problem solver. A heavy wooden door I couldn’t open? Pick up the lad with magic and fling him so hard at the obstacle that both exploded. Thank you for your service, my son. Image credit: RPS I wish this magic felt better to use. Oh, it’s plenty fun, it’s always fun to whirl around a level on that knife-edge between control and chaos, but under the hands the thing feels spongy and inarticulate. There’s an odd lack of acceleration on objects, or a piecemeal delay, and things feel splashy and weightless. Playing on a controller, there are no haptics associated with the spells, and the sound design never really underscores the weight and power and zip of the raw magic pouring from your hands. The melee combat feels even worse. Attack combos run long and directionlessly, the lock-on at once too sticky and too inexact. You’ll go wailing off at a shrub instead of the hissing suit of armor that’s targeting you, or thwack a greatsword down with all the power of what feels like a baked sweet potato. One enemy, a sort of invisible lizard-dog that hocked gobs of poison in my direction, could barely be locked on to at all, and the experience of fighting it was so teeth-clenchingly annoying that I darted away from any encounter it was involved in. This conjuring of magical or physical presence, the murky art of \"making action feel good in a game\", is an inexact science. Anybody who has tried to explain why one game’s jump feels great and another’s lacklustre learns this quickly, as words start to fail them and they hand the controller off, conceding: \"You try it. Doesn’t it feel better?\" In actuality, as with so many things, budget plays a major factor. It is arguably unfair to compare Eternal Strands’ telekinesis with Control’s apocalyptic rock throwing, or Half Life: Alyx’s razorwire tactility. This game is the work of a small team with a limited budget, and what they’ve managed to accomplish with their resources is admirable. It’s especially admirable when you see what they’ve chosen to prioritise. The Enclave’s ruined, labyrinthine environments are stunning, possessing a real character and sense of place. The colour-work throughout the game is really something: candy coloured and saturated, like a ring of gems in a crown. Dragons burn with teal fire. Blue-tarnished copper paints the roofs of golden sandstone buildings. The first two levels (a forest path, and a bog filled with those awful lizard dogs) are fine enough. A little underwhelming, given what you’ve been told about the Enclave’s byzantine, sparkling reputation. I thought to myself: \"What I really want to see is the ruined city itself, but surely we’re never going to go there,\" and then, to my delight, we did. Dynevron, the capital of the capital, opens up in the third level and is an absolute delight. Endless dog-legged streets patrolled by magical constructs. Whole pathways across rooftops. Secrets tucked away in half collapsed basements. And Dynevron continues to grow! The next levels take you up into its bureaucratic heart, or down into its market district. As the game continued, the anticipation of what awaited me beyond the next teleportation gate grew. Image credit: RPS The engine by which the core mystery (\"what happened to the Enclave?\") is unravelled is the game’s codex, rich in background detail and character and assembled piecemeal via the collection of fragments scattered throughout the large levels. Rather than an abstract \"fragment of knowledge\", each of these represents a concrete discovery: a scrawled work order, or a broken toy, or a sabotaged gate. These are added to your journal, filling checklists in categories like \"Guild of Crafters\", or \"Raw Magic\", or, more tantalisingly, obscure headings like \"Asylum\" or \"Runner’s Cipher\". When a full set is collected, you turn it over to Laen, the party’s loremaster, who collates it only then into the classic RPG codex entry. I really admire this manoeuvre. The gradual, incremental process sidesteps the dreadful, tiresome outpouring of codex entries, when the pace crawls to a halt as you read through 500 words about something like \"The Plague\", and then tab down to slog through another 500 words about \"Lunar Swordbearer\", and then lose your place, and then lose your patience. More interestingly, it speaks to the acquisition and synthesis of knowledge, the process by which a mystery is solved. These codex entries aren’t coming from nowhere; Laen is assembling them as a result of your actions. What do these disparate objects tell us about the history of this place? What conclusions can be drawn? Where are we making mistakes? Though the game’s worldbuilding and codex writing is nuanced and successful, its moment-to-moment dialogue is much less so. Your freelance band of magicians contains, to a person, exactly one of Every Single Type Of Narrative RPG Character. There’s the nervous quartermaster, stretching herself too thin, who needs to be told to take a break. There’s the flamboyant, pseudo-chivalric enchanter who the party finds as annoying as he is indispensable. One nervous scion of a disgraced family. One warm, slightly harassed forgemaster, and her assistant, the gruff, withdrawn forgemaster who nevertheless opens up. They are archetypes laser-guided by their individual, thin, character pitch and while they’re constantly gesturing at some sort of internal community (a book club, or the ongoing relationship between the enchanter and the forgemaster) it never coheres beyond the surface level. The narrative voice might be at the root of this problem. Everybody speaks in roughly the same way; sometimes a little wordier, sometimes a little more reticent, but always with a glib looseness that belies that depth of the mystery and excitement with which they’re involved. Brynn, the player character, is maybe the worst of all. A young magician freshly appointed to the tip of the spear, she should be crackling with energy and curiosity but all too often she’s left to deliver \"You’re right, I am kickass,\" bon mots or reduced to the vector by which other characters resolve their anxieties. Image credit: RPS It’s a shame, but it’s not the end of the world. Oria, the band’s senior member, is a bright spot: a brusque birdwoman with a long history, her patience, care and curiosity comes through clearly, delivered in a cut-glass accent. A wounded wing prevents her from taking on your role, and there’s a well-executed and sad tension throughout her dialogue. Possessed of a lifetime of experience, here she is on the doorstep of a vast ruined city and tantalising mystery, unable to make the step inside. After a few hours, the game hits its stride and everything starts rolling along organically and enjoyably. Discoveries in each level let you learn where resources can be collected, and a (frankly unnecessarily involved) crafting system starts making demands of you. You want that fireproof armour? You’ll need to go hunting for a certain component in a certain level that only appears at night. So off you go, and while you’re out, you stumble into one of the game’s gigantic dynamic bosses. These are a little like Monster Hunter’s beasties, or Shadow of the Colossus’ titanic foes, though less complicated than the former and less awe-inspiring than the latter. They rumble around the levels, often dropping in on you when you least expect it, and multi-stage fights with them (involving hacking off armour piece by piece, or destroying a wing to ground a dragon, or locating a weak spot) will reward you with the rarest and most useful components. More interestingly, each beast can be harvested for its \"strand\", the source of its magic, enabling that most satisfying feeling: getting absolutely wrecked by an enemy’s absurd attack but knowing that, with just a little more effort, you’ll be able to get the power for yourself. Image credit: RPS As with the magic and melee combat, the traversal of these beasts is often complicated by a weakness in the control scheme. You’ll try to cling to a terror’s arm and instead you’ll mantle uselessly onto a rock nearby, but these weaknesses are regularly offset by the lovely improvised chaos of physics systems bumping into each other. Every time I get flung directly into the sky, or a triceratops thing mistimes its own attack and slams a rock the size of a piano into its own face, I am filled with the wild joy of being alive. This is an ambitious, confident debut by a small team that is swinging for the fences. When a game like this arrives, bubbling up improbably from an industry that all too often rewards one million-dollar-sequel after another, it stands to be celebrated. I’d go out into the glittering ruins of Dynevron and rumble into a boss fight and then, somehow, lose the boss, and get sidetracked by some flowers I needed to find, and then go and unlock a teleport gate, and then organically find the boss again stomping obstinately past a fallen cupola, and I’d think \"this is a blast, I’m having a blast, this is great.\" And sure, I don’t tremendously care about any of these people, and it’s never been less physically satisfying to swing a sword at these dogs, but right about then I notice that there’s this beautiful cliff about ten feet away and I can pick things up with my mind and in a matter of seconds all my problems have been forgotten. This review was based upon a release copy of the game provided by the developer.",
  "image": "https://assetsio.gnwcdn.com/eternal-strands-header_Qtbja78.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \n\u003cp\u003eWhen I’ve had enough of fighting the dogs in a respectable, straightforward manner, I pick them up with my mind and - with a casualness that has to be extremely insulting if you’re a dog - drop them directly off a cliff. This ends the fight immediately. Sometimes I resort to this low move out of frustration, when a dull fight has dragged on for too long. Sometimes I resort to it out of panic, because I’ve accidentally set fire to every hard surface within ten feet, or frozen myself to a wall. Often it’s just for the pleasure of it. \n\u003c/p\u003e\n\u003cp\u003eIn \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/eternal-strands\"\u003eEternal Strands\u003c/a\u003e, Yellow Brick Games’ debut title, you play the leader of a \u0026#34;weaver band\u0026#34;, a crew of freelance magicians, in a world where something extremely bad happened to magic. Some years ago, the Enclave, a city state acting as the isolationist heart of the world’s magic, exploded in a kind of power surge - one part tsunami, one part blown fuse - and just as quickly sealed itself off from the world outside. Somehow managing to breach the wall, your band finds themselves the first people to set foot inside the ruined capital since the calamity and sets about uncovering the mystery of what exactly went wrong. \n\u003c/p\u003e\n\n\u003cp\u003eIt’s a compelling mystery! From the off, the world is sharply drawn and the stakes made clear. The lands outside the Enclave (a rogues gallery of various countries familiar to anybody who has spent time in Cyrodiil or Thedas) relied so heavily on the magical output and technology of the isolationist state that the surge’s effects spread widely and disastrously. This is told to you first in vague terms: things broke, magical constructs went wild, resources spread thin. Wars started all over. As the game continues, more and more specific consequences come bubbling up: everybody bought Enclave tools to control the weather, for example, and in their failure sickly storms started to roll across deserts and trade fleets were wrecked. Magicians, even those outside the Enclave’s walls, were blamed and reviled. All this happens in the background, of course. But it’s there, and it lends an electric feel to your first steps into the Enclave: you are touching a live wire that started a fire that burned down a continent. \n\u003c/p\u003e\n\u003cp\u003eIn practice, what you’re doing starts straightforwardly. You enter a series of large, open levels to perform simple \u0026#34;setting up\u0026#34; tasks. Get the Enclave’s teleportation system back online so you can travel deeper. Find materials to get your beleaguered band back on track. The Enclave was wildly famous - the center of the world - and so your party has some understanding of what to expect and what to prioritise, but the interplay between their expectations and the reality of the ruined place is a tension well exploited by the game in its first act. Arkons, titanic magical constructs, roam the outskirts. There’s a dragon in the bog. \n\u003c/p\u003e\u003cp\u003eYou’re equipped from the start with two spells that speak to the game’s systemic aspirations: a rapid freeze reminiscent of Prey’s gloo gun that lets you draw ice onto the environment and a classic telekinesis power for dropping dogs off cliffs. These are broadly unrestricted. Draw ice onto anything. Make a little bridge. Pick up an enemy right off the bat and throw them into a lake. Obviously heavier things are going to take an upgrade, but there’s a freedom on offer here that I appreciate. The ice ability, too, acts as a way into the game’s elemental magic system. This is a world full of plants that explode into ice, and dynamically propagating fire which spreads through underbrush. There’s the sensibility of an immersive sim bubbling away under here, not just in the way you’re encouraged to blend the utility of your powers, but in the cascading, sweaty disasters you’ll regularly turn encounters into. Past a certain point, I was setting myself on fire so regularly that I gave in and constructed a suit of armor that made me functionally fireproof. I found a spell that summoned a small fiery boy to follow me around, but warned me that if he took enough damage, he’d explode. Fair enough, I said. No skin off my nose. Freed from having to worry about flames, the fiery boy become a go-to problem solver. A heavy wooden door I couldn’t open? Pick up the lad with magic and fling him so hard at the obstacle that both exploded. Thank you for your service, my son. \n\u003c/p\u003e\n\u003cfigure data-count=\"4\" role=\"group\"\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/eternal-strands-6.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A wintery scene in Eternal Strands.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/eternal-strands-6.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/eternal-strands-6.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/eternal-strands-6.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/eternal-strands-3.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A grass patch covered by a dome in Eternal Strands.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/eternal-strands-3.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/eternal-strands-3.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/eternal-strands-3.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/eternal-strands-4.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"Some bucolic trees in Eternal Strands.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/eternal-strands-4.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/eternal-strands-4.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/eternal-strands-4.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/eternal-strands-2.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A misty forest in Eternal Strands.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/eternal-strands-2.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/eternal-strands-2.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/eternal-strands-2.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRPS\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eI wish this magic felt better to use. Oh, it’s plenty fun, it’s always fun to whirl around a level on that knife-edge between control and chaos, but under the hands the thing feels spongy and inarticulate. There’s an odd lack of acceleration on objects, or a piecemeal delay, and things feel splashy and weightless. Playing on a controller, there are no haptics associated with the spells, and the sound design never really underscores the weight and power and zip of the raw magic pouring from your hands. The melee combat feels even worse. Attack combos run long and directionlessly, the lock-on at once too sticky and too inexact. You’ll go wailing off at a shrub instead of the hissing suit of armor that’s targeting you, or thwack a greatsword down with all the power of what feels like a baked sweet potato. One enemy, a sort of invisible lizard-dog that hocked gobs of poison in my direction, could barely be locked on to at all, and the experience of fighting it was so teeth-clenchingly annoying that I darted away from any encounter it was involved in.\n\u003c/p\u003e\u003cp\u003eThis conjuring of magical or physical presence, the murky art of \u0026#34;making action feel good in a game\u0026#34;, is an inexact science. Anybody who has tried to explain why one game’s jump feels great and another’s lacklustre learns this quickly, as words start to fail them and they hand the controller off, conceding: \u0026#34;You try it. Doesn’t it feel better?\u0026#34; In actuality, as with so many things, budget plays a major factor. It is arguably unfair to compare Eternal Strands’ telekinesis with Control’s apocalyptic rock throwing, or Half Life: Alyx’s razorwire tactility. This game is the work of a small team with a limited budget, and what they’ve managed to accomplish with their resources is admirable. \n\u003c/p\u003e\n\u003cp\u003eIt’s especially admirable when you see what they’ve chosen to prioritise. The Enclave’s ruined, labyrinthine environments are stunning, possessing a real character and sense of place. The colour-work throughout the game is really something: candy coloured and saturated, like a ring of gems in a crown. Dragons burn with teal fire. Blue-tarnished copper paints the roofs of golden sandstone buildings. The first two levels (a forest path, and a bog filled with those awful lizard dogs) are fine enough. A little underwhelming, given what you’ve been told about the Enclave’s byzantine, sparkling reputation. I thought to myself: \u0026#34;What I \u003cem\u003ereally\u003c/em\u003e want to see is the ruined city itself, but surely we’re never going to go there,\u0026#34; and then, to my delight, we did. Dynevron, the capital of the capital, opens up in the third level and is an absolute delight. Endless dog-legged streets patrolled by magical constructs. Whole pathways across rooftops. Secrets tucked away in half collapsed basements. And Dynevron continues to grow! The next levels take you up into its bureaucratic heart, or down into its market district. As the game continued, the anticipation of what awaited me beyond the next teleportation gate grew. \n\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/eternal-strands-7.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A castle-like structure in Eternal Strands big world.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/eternal-strands-7.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/eternal-strands-7.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/eternal-strands-7.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRPS\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eThe engine by which the core mystery (\u0026#34;what happened to the Enclave?\u0026#34;) is unravelled is the game’s codex, rich in background detail and character and assembled piecemeal via the collection of fragments scattered throughout the large levels. Rather than an abstract \u0026#34;fragment of knowledge\u0026#34;, each of these represents a concrete discovery: a scrawled work order, or a broken toy, or a sabotaged gate. These are added to your journal, filling checklists in categories like \u0026#34;Guild of Crafters\u0026#34;, or \u0026#34;Raw Magic\u0026#34;, or, more tantalisingly, obscure headings like \u0026#34;Asylum\u0026#34; or \u0026#34;Runner’s Cipher\u0026#34;. When a full set is collected, you turn it over to Laen, the party’s loremaster, who collates it only then into the classic RPG codex entry. I really admire this manoeuvre. The gradual, incremental process sidesteps the dreadful, tiresome outpouring of codex entries, when the pace crawls to a halt as you read through 500 words about something like \u0026#34;The Plague\u0026#34;, and then tab down to slog through another 500 words about \u0026#34;Lunar Swordbearer\u0026#34;, and then lose your place, and then lose your patience. More interestingly, it speaks to the acquisition and synthesis of knowledge, the process by which a mystery is solved. These codex entries aren’t coming from nowhere; Laen is assembling them as a result of your actions. What do these disparate objects tell us about the history of this place? What conclusions can be drawn? Where are we making mistakes? \n\u003c/p\u003e\u003cp\u003eThough the game’s worldbuilding and codex writing is nuanced and successful, its moment-to-moment dialogue is much less so. Your freelance band of magicians contains, to a person, exactly one of Every Single Type Of Narrative RPG Character. There’s the nervous quartermaster, stretching herself too thin, who needs to be told to take a break. There’s the flamboyant, pseudo-chivalric enchanter who the party finds as annoying as he is indispensable. One nervous scion of a disgraced family. One warm, slightly harassed forgemaster, and her assistant, the gruff, withdrawn forgemaster who nevertheless opens up. They are archetypes laser-guided by their individual, thin, character pitch and while they’re constantly gesturing at some sort of internal community (a book club, or the ongoing relationship between the enchanter and the forgemaster) it never coheres beyond the surface level. The narrative voice might be at the root of this problem. Everybody speaks in roughly the same way; sometimes a little wordier, sometimes a little more reticent, but always with a glib looseness that belies that depth of the mystery and excitement with which they’re involved. Brynn, the player character, is maybe the worst of all. A young magician freshly appointed to the tip of the spear, she should be crackling with energy and curiosity but all too often she’s left to deliver \u0026#34;You’re right, I \u003cem\u003eam\u003c/em\u003e kickass,\u0026#34; bon mots or reduced to the vector by which other characters resolve their anxieties. \n\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/eternal-strands-1.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"Some glowing orange bushes in Eternal Strands. Maybe they\u0026#39;re glowing orange because they\u0026#39;re on fire.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/eternal-strands-1.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/eternal-strands-1.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/eternal-strands-1.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRPS\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eIt’s a shame, but it’s not the end of the world. Oria, the band’s senior member, is a bright spot: a brusque birdwoman with a long history, her patience, care and curiosity comes through clearly, delivered in a cut-glass accent. A wounded wing prevents her from taking on your role, and there’s a well-executed and sad tension throughout her dialogue. Possessed of a lifetime of experience, here she is on the doorstep of a vast ruined city and tantalising mystery, unable to make the step inside. \n\u003c/p\u003e\n\u003cp\u003eAfter a few hours, the game hits its stride and everything starts rolling along organically and enjoyably. Discoveries in each level let you learn where resources can be collected, and a (frankly unnecessarily involved) crafting system starts making demands of you. You want that fireproof armour? You’ll need to go hunting for a certain component in a certain level that only appears at night. So off you go, and while you’re out, you stumble into one of the game’s gigantic dynamic bosses. These are a little like Monster Hunter’s beasties, or \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/shadow-of-the-colossus\"\u003eShadow of the Colossus\u003c/a\u003e’ titanic foes, though less complicated than the former and less awe-inspiring than the latter. They rumble around the levels, often dropping in on you when you least expect it, and multi-stage fights with them (involving hacking off armour piece by piece, or destroying a wing to ground a dragon, or locating a weak spot) will reward you with the rarest and most useful components. More interestingly, each beast can be harvested for its \u0026#34;strand\u0026#34;, the source of its magic, enabling that most satisfying feeling: getting absolutely wrecked by an enemy’s absurd attack but knowing that, with just a little more effort, you’ll be able to get the power for yourself. \n\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/eternal-strands-5.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A sort of stony rhino-looking beast in Eternal Strands.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/eternal-strands-5.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/eternal-strands-5.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/eternal-strands-5.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRPS\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eAs with the magic and melee combat, the traversal of these beasts is often complicated by a weakness in the control scheme. You’ll try to cling to a terror’s arm and instead you’ll mantle uselessly onto a rock nearby, but these weaknesses are regularly offset by the lovely improvised chaos of physics systems bumping into each other. Every time I get flung directly into the sky, or a triceratops thing mistimes its own attack and slams a rock the size of a piano into its own face, I am filled with the wild joy of being alive. \n\u003c/p\u003e\u003cp\u003eThis is an ambitious, confident debut by a small team that is swinging for the fences. When a game like this arrives, bubbling up improbably from an industry that all too often rewards one million-dollar-sequel after another, it stands to be celebrated. I’d go out into the glittering ruins of Dynevron and rumble into a boss fight and then, somehow, \u003cem\u003elose\u003c/em\u003e the boss, and get sidetracked by some flowers I needed to find, and then go and unlock a teleport gate, and then organically find the boss again stomping obstinately past a fallen cupola, and I’d think \u0026#34;this is a blast, I’m having a blast, this is great.\u0026#34; And sure, I don’t tremendously care about any of these people, and it’s never been less physically satisfying to swing a sword at these dogs, but right about then I notice that there’s this beautiful cliff about ten feet away and I can pick things up with my mind and in a matter of seconds all my problems have been forgotten. \n\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis review was based upon a release copy of the game provided by the developer.\u003c/em\u003e\n\u003cspan data-fixed=\"true\" data-hashid=\"\" data-init=\"false\" data-poll-position=\"1\"\u003e\u003c/span\u003e\n\n\n\n        \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-02-05T16:01:45.286241Z",
  "modifiedTime": null
}
