{
  "id": "cee0b4bc-839a-415b-a51d-3ae438e009c3",
  "title": "Catly developer denies using generative AI or blockchain technology in its open-world cat game",
  "link": "https://www.eurogamer.net/catly-developer-denies-using-generative-ai-or-blockchain-technology-in-its-open-world-cat-game",
  "description": "The developer of Catly, an open-world cat game revealed at last week's The Game Awards, has denied using generative AI for the game's trailer, or the game itself. Read more",
  "author": "Ed Nightingale",
  "published": "Tue, 17 Dec 2024 16:10:54 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "PC",
    "Catly",
    "Nintendo Switch",
    "iOS"
  ],
  "byline": "Ed Nightingale",
  "length": 3297,
  "excerpt": "The developer of Catly, an open-world cat game revealed at last week's The Game Awards, has denied using generative AI …",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/192b8e2df2fe17fa1c2509bcf666765a/icon/apple-touch-icon-152x152.png",
  "text": "\"We are very surprised by such speculations.\" Image credit: SuperAuthenti The developer of Catly, an open-world cat game revealed at last week's The Game Awards, has denied using generative AI for the game's trailer, or the game itself. The game is set for release across Steam, Nintendo Switch, and Apple Watch and its trailer features a series of hyper-realistic cats that quickly raised eyebrows as viewers suspected generative AI was used. Since the reveal, reddit users noted various oddities and supposed indicators of AI art used on the game's website, some of which have reportedly been removed. Moreover, commenters suggested the developer has links to blockchain gaming and NFTs, which it has now denied. Catly - Official Reveal Trailer | The Game Awards 2024 Catly - Official Reveal Trailer | The Game Awards 2024Watch on YouTube A statement from a PR representative for Catly's developer SuperAuthenti, shared with IGN and Game Developer, said generative AI had not been used for the trailer or the game. \"In fact we are very surprised by such speculations,\" the statement reads. \"We do not think there are any existing AI tools that can produce a video like that. Industry experts have echoed this opinion.\" Both outlets were shown in-progress shots of the trailer from The Game Awards, which seemed to confirm the trailer was not AI-generated. A co-founder of SuperAuthenti is Kevin Yeung, who also co-founded TenthPlanet - a studio reportedly working on two blockchain games. One of these is Alien Mews, a digital cat life simulation built in Unreal Engine 5 that on the surface shares similarities with Catly. Reddit users have also pointed to a previous game published by SuperAuthenti called Plantly: Mindful Gardening that's since been scrubbed from the internet but appears to have used blockchain technology. Catly's Steam page also includes a testimonial quote from League of Legends and Arcane producer Thomas Vu, a known web3 investor. Another quote is from Ben Brode, game director of Hearthstone, who responded on BlueSky to say he'd seen 20 minutes of gameplay footage and \"thought it looked cool so they asked me for a quote\", adding \"it looks real enough to me, cats looked wild\". Catly on an Apple Watch | Image credit: SuperAuthenti As Game Developer reported, SuperAuthenti did not comment on any business connections, but stated \"Catly is not a blockchain game\" and \"there are no NFTs\". The statement continued: \"Our company/project has never issued any blockchain currency and any NFTs. Our company does not and has never owned any blockchain currency and NFTs.\" SuperAuthenti also confirmed to IGN Catly has been developed in Unreal Engine 5, with \"various software\" used to produce hyperrealistic hair and fur. What's certainly clear is the prevalence of AI in the games industry makes it hard to ascertain what's AI generated and what's hand-crafted. AI is changing video game development forever, as its use is becoming widespread across animation, scriptwriting, voice acting and more. Most recently, Google detailed its Genie 2 tool it claims can create playable 3D worlds from a single image prompt. It stressed the tool is for \"rapid prototyping\".",
  "image": "https://assetsio.gnwcdn.com/Catly_Screenshot-2-(1).png?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv\u003e\n        \n\n        \u003cp\u003e\u0026#34;We are very surprised by such speculations.\u0026#34;\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/Catly_Screenshot-2-(1).png?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/Catly_Screenshot-2-(1).png?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Catly_Screenshot-2-(1).png?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Catly_Screenshot-2-(1).png?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Catly screenshot showing extreme close up of furry cat with rainbow eyes\" width=\"414\" height=\"233\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eSuperAuthenti\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eThe developer of Catly, an open-world cat game revealed at \u003ca href=\"https://www.eurogamer.net/everything-announced-at-the-game-awards-2024\"\u003elast week\u0026#39;s The Game Awards\u003c/a\u003e, has denied using generative AI for the game\u0026#39;s trailer, or the game itself.\u003c/p\u003e\n\u003cp\u003eThe game is set for release across Steam, Nintendo Switch, and Apple Watch and its trailer features a series of hyper-realistic cats that quickly raised eyebrows as viewers suspected generative AI was used.\u003c/p\u003e\n\u003cp\u003eSince the reveal, \u003ca href=\"https://www.reddit.com/r/Games/comments/1hdo5rf/catly_has_direct_ties_to_ainftblockchain_gaming/?utm_source=share\u0026amp;utm_medium=web3x\u0026amp;utm_name=web3xcss\u0026amp;utm_term=1\u0026amp;utm_content=share_button\"\u003ereddit users\u003c/a\u003e noted various oddities and supposed indicators of AI art used on the game\u0026#39;s website, some of which have reportedly been removed. Moreover, commenters suggested the developer has links to blockchain gaming and \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/topics/nfts\"\u003eNFTs\u003c/a\u003e, which it has now denied.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Catly - Official Reveal Trailer | The Game Awards 2024\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/v5954_rF8tU?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/v5954_rF8tU/hqdefault.jpg\"/\u003e\u003cspan\u003eCatly - Official Reveal Trailer | The Game Awards 2024\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/v5954_rF8tU?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/v5954_rF8tU?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eCatly - Official Reveal Trailer | The Game Awards 2024\u003ca href=\"https://www.youtube.com/watch?v=v5954_rF8tU\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eA statement from a PR representative for Catly\u0026#39;s developer SuperAuthenti, shared with \u003ca href=\"https://www.ign.com/articles/catly-creator-says-game-has-no-generative-ai-no-blockchain-and-no-nfts\"\u003eIGN\u003c/a\u003e and \u003ca href=\"https://www.gamedeveloper.com/art/catly-developer-denies-it-s-using-generative-ai-or-blockchain-technology-in-its-cute-cat-game\"\u003eGame Developer\u003c/a\u003e, said generative AI had not been used for the trailer or the game. \u0026#34;In fact we are very surprised by such speculations,\u0026#34; the statement reads. \u0026#34;We do not think there are any existing AI tools that can produce a video like that. Industry experts have echoed this opinion.\u0026#34;\u003c/p\u003e\n\u003cp\u003eBoth outlets were shown in-progress shots of the trailer from The Game Awards, which seemed to confirm the trailer was not AI-generated.\u003c/p\u003e\n\u003cp\u003eA co-founder of SuperAuthenti is Kevin Yeung, who also co-founded TenthPlanet - a studio \u003ca href=\"https://venturebeat.com/games/tenthplanet-unveils-two-ambitious-blockchain-games/\"\u003ereportedly working on two blockchain games\u003c/a\u003e. One of these is Alien Mews, a digital cat life simulation built in Unreal Engine 5 that on the surface shares similarities with Catly. Reddit users have also pointed to a previous game published by SuperAuthenti called Plantly: Mindful Gardening that\u0026#39;s since been scrubbed from the internet but appears to have used blockchain technology.\u003c/p\u003e\n\u003cp\u003eCatly\u0026#39;s \u003ca href=\"https://store.steampowered.com/app/2987350/Catly/\"\u003eSteam page\u003c/a\u003e also includes a testimonial quote from \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/league-of-legends\"\u003eLeague of Legends\u003c/a\u003e and Arcane producer Thomas Vu, a \u003ca href=\"https://cryptorank.io/funds/thomas-vu\"\u003eknown web3 investor\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAnother quote is from Ben Brode, game director of \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/hearthstone\"\u003eHearthstone\u003c/a\u003e, who \u003ca href=\"https://bsky.app/profile/benbrode.bsky.social/post/3ldcw6m7voc2y\"\u003eresponded on BlueSky\u003c/a\u003e to say he\u0026#39;d seen 20 minutes of gameplay footage and \u0026#34;thought it looked cool so they asked me for a quote\u0026#34;, adding \u0026#34;it looks real enough to me, cats looked wild\u0026#34;.\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/Catly_iWatch-Poster-(1).png?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"Catly on an Apple Watch\" height=\"233\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Catly_iWatch-Poster-(1).png?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Catly_iWatch-Poster-(1).png?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Catly_iWatch-Poster-(1).png?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"414\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003eCatly on an Apple Watch | \u003cspan\u003eImage credit: \u003ccite\u003eSuperAuthenti\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eAs Game Developer reported, SuperAuthenti did not comment on any business connections, but stated \u0026#34;Catly is not a blockchain game\u0026#34; and \u0026#34;there are no NFTs\u0026#34;. The statement continued: \u0026#34;Our company/project has never issued any blockchain currency and any NFTs. Our company does not and has never owned any blockchain currency and NFTs.\u0026#34;\u003c/p\u003e\n\u003cp\u003eSuperAuthenti also confirmed to IGN Catly has been developed in Unreal Engine 5, with \u0026#34;various software\u0026#34; used to produce hyperrealistic hair and fur.\u003c/p\u003e\n\u003cp\u003eWhat\u0026#39;s certainly clear is the prevalence of AI in the games industry makes it hard to ascertain what\u0026#39;s AI generated and what\u0026#39;s hand-crafted.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.eurogamer.net/how-ai-is-changing-video-game-development-forever\"\u003eAI is changing video game development forever\u003c/a\u003e, as its use is becoming widespread across animation, scriptwriting, voice acting and more.\u003c/p\u003e\n\u003cp\u003eMost recently, \u003ca href=\"https://www.eurogamer.net/google-has-developed-an-ai-tool-that-generates-fully-playable-3d-worlds\"\u003eGoogle detailed its Genie 2 tool\u003c/a\u003e it claims can create playable 3D worlds from a single image prompt. It stressed the tool is for \u0026#34;rapid prototyping\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-17T16:10:54.293148Z",
  "modifiedTime": null
}
