{
  "id": "cff38002-8fab-4263-ac77-eb335f4987be",
  "title": "V Rising's first big post 1.0 update brings a bevy of additions, combat reworks, and Steam Deck support later this month",
  "link": "https://www.rockpapershotgun.com/v-risings-first-big-post-10-update-brings-a-bevy-of-additions-combat-reworks-and-steam-deck-support-later-this-month",
  "description": "It's coming up to a year since V Rising received its 1.0 release, and ahead of that anniversary developer Stunlock Studios shared a trailer earlier this week for the game's first big update, Invaders of Oakveil. The update itself will be free (nice!), and introduces a whole new area to explore, the titular Oakveil Woodlands, a woodsy area where \"corruption\" is spreading (not nice). Read more",
  "author": "Oisin Kuhnke",
  "published": "Sat, 12 Apr 2025 21:53:15 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Multiplayer Competitive",
    "Stunlock Studios",
    "Multiplayer Cooperative",
    "V Rising",
    "Action Adventure",
    "Single Player",
    "RPG",
    "Tencent Games",
    "Bird view / Isometric"
  ],
  "byline": "Oisin Kuhnke",
  "length": 2101,
  "excerpt": "V Rising is getting its first big update after launching into 1.0 last year, and it certainly seems like a beefy one.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/b6346e05d1633e5c39eb3dee99272ccc/icon/apple-touch-icon.png",
  "text": "And a stable for your horses! Image credit: Stunlock Studios It's coming up to a year since V Rising received its 1.0 release, and ahead of that anniversary developer Stunlock Studios shared a trailer earlier this week for the game's first big update, Invaders of Oakveil. The update itself will be free (nice!), and introduces a whole new area to explore, the titular Oakveil Woodlands, a woodsy area where \"corruption\" is spreading (not nice). The big baddie of this update is Megara the Serpent Queen, presumably the source of said corruption. She's got some minions called The Venomblades, which sounds like a great name for a goth rollerblading group. In terms of gameplay additions, there's a new arena-building feature to be found in your castle, alongside one-on-one duels that can be found out in the wild that are consequence free. Oh, there's three new weapon types to mess around with, claws, twinblades, and throwing daggers, as well as seven new spells to boot. V Rising - Invaders of Oakveil Gameplay Trailer | The Triple-i Initiative Watch on YouTube Combat is also getting a big refresh, with stats seeing a rework, gear receiving some balance changes, and the addition of \"new customization tools.\" Blood types have been reworked too, passive spells are apparently \"more impactful\", and unlocking spell points gives you some passive bonuses too. Lots of changes! Crafting will be a bit easier too now as you can take ingredients from your vault without having to actually go to your vault to get them. Horse girls will delight in the fact that there'll be stables to store your horses in as well, alongside the ability to fill your prisons with creatures to take blood from (that one's not so much for the horse girls). Alongside a few other changes that you can read about on the game's official website, there's also the fact that V Rising will also be officially supported on Steam Deck. All of this is coming April 28th, so you've only got a couple of weeks to wait.",
  "image": "https://assetsio.gnwcdn.com/v-rising_Nu0k74p.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n  \n\n        \u003cp\u003eAnd a stable for your horses!\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/v-rising_Nu0k74p.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/v-rising_Nu0k74p.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/v-rising_Nu0k74p.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/v-rising_Nu0k74p.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A serpentine woman glowing purple in some corrupt looking woods in key art for V Rising.\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eStunlock Studios\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nIt\u0026#39;s coming up to a year since \u003ca href=\"https://www.rockpapershotgun.com/games/v-rising\"\u003eV Rising\u003c/a\u003e received its 1.0 release, and ahead of that anniversary developer \u003ca href=\"https://www.rockpapershotgun.com/companies/stunlock-studios\"\u003eStunlock Studios\u003c/a\u003e shared a trailer earlier this week for the game\u0026#39;s first big update, Invaders of Oakveil. The update itself will be free (nice!), and introduces a whole new area to explore, the titular Oakveil Woodlands, a woodsy area where \u0026#34;corruption\u0026#34; is spreading (not nice).\n\u003c/p\u003e\n\n\u003cp\u003e\nThe big baddie of this update is Megara the Serpent Queen, presumably the source of said corruption. She\u0026#39;s got some minions called The Venomblades, which sounds like a great name for a goth rollerblading group. In terms of gameplay additions, there\u0026#39;s a new arena-building feature to be found in your castle, alongside one-on-one duels that can be found out in the wild that are consequence free. Oh, there\u0026#39;s three new weapon types to mess around with, claws, twinblades, and throwing daggers, as well as seven new spells to boot.\n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"V Rising - Invaders of Oakveil Gameplay Trailer | The Triple-i Initiative\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/H0RTos4Cr8Y?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/H0RTos4Cr8Y/hqdefault.jpg\"/\u003e\u003cspan\u003eV Rising - Invaders of Oakveil Gameplay Trailer | The Triple-i Initiative\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/H0RTos4Cr8Y?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/H0RTos4Cr8Y?autoplay=1\" title=\"V Rising - Invaders of Oakveil Gameplay Trailer | The Triple-i Initiative\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003ca href=\"https://www.youtube.com/watch?v=H0RTos4Cr8Y\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figure\u003e\n\u003cp\u003e\nCombat is also getting a big refresh, with stats seeing a rework, gear receiving some balance changes, and the addition of \u0026#34;new customization tools.\u0026#34; Blood types have been reworked too, passive spells are apparently \u0026#34;more impactful\u0026#34;, and unlocking spell points gives you some passive bonuses too. Lots of changes!\n\u003c/p\u003e\n\u003cp\u003e\nCrafting will be a bit easier too now as you can take ingredients from your vault without having to actually go to your vault to get them. Horse girls will delight in the fact that there\u0026#39;ll be stables to store your horses in as well, alongside the ability to fill your prisons with creatures to take blood from (that one\u0026#39;s not so much for the horse girls).\n\u003c/p\u003e\n\u003cp\u003e\nAlongside a few other changes that you can read about on the game\u0026#39;s \u003ca href=\"https://playvrising.com/oakveil\"\u003eofficial website\u003c/a\u003e, there\u0026#39;s also the fact that V Rising will also be officially supported on Steam Deck. All of this is coming April 28th, so you\u0026#39;ve only got a couple of weeks to wait.\n\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-12T21:53:15.870286Z",
  "modifiedTime": null
}
