{
  "id": "db7db41a-e4de-4e58-8bf8-60b733f84ce2",
  "title": "Bioshock was \"basically a corridor\", says Ken Levine - Judas won't be, and characters will have long memories",
  "link": "https://www.rockpapershotgun.com/bioshock-was-basically-a-corridor-says-ken-levine-judas-wont-be-and-characters-will-have-long-memories",
  "description": "I come and go with the work of Ken Levine, celebrated auteurman and reported burnout-inducing manager, but I'm interested to see more of Judas, his current project at Ghost Story Games. The concept for Judas is that you're trapped in a computer-run society housed aboard a colony ship, the Mayflower. The titular Judas has managed to break free of the AI-groomed status quo, and is out to start a revolution. \"Bioshock Infinite in space\", we called it, back in 2022, but Levine says it's more open-ended than either of his Bioshock endeavours, with a greater emphasis on other characters remembering and responding to your actions over time. Read more",
  "author": "Edwin Evans-Thirlwell",
  "published": "Thu, 02 Jan 2025 18:08:15 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "PS5",
    "First person",
    "Point and Click",
    "Single Player",
    "Meridian4",
    "Puzzle",
    "Xbox Series X/S",
    "Indie",
    "PC",
    "Judas",
    "Action Adventure"
  ],
  "byline": "Edwin Evans-Thirlwell",
  "length": 4510,
  "excerpt": "I come and go with the work of Ken Levine, celebrated auteurman and reported burnout-inducing manager, but I'm interest…",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/eaa22572e085593b1ebd55b62f56acb2/icon/apple-touch-icon.png",
  "text": "No \"random number generator\" quests, hopefully Image credit: Ghost Story Games I come and go with the work of Ken Levine, celebrated auteurman and reported burnout-inducing manager, but I'm interested to see more of Judas, his current project at Ghost Story Games. The concept for Judas is that you're trapped in a computer-run society housed aboard a colony ship, the Mayflower. The titular Judas has managed to break free of the AI-groomed status quo, and is out to start a revolution. \"Bioshock Infinite in space\", we called it, back in 2022, but Levine says it's more open-ended than either of his Bioshock endeavours, with a greater emphasis on other characters remembering and responding to your actions over time. That's from a new GamesIndustry.biz interview that also contains Levine's thoughts on generative AI (ambivalent) and whether today's triple-A budgets are healthy (no), plus some regurgitated rhapsodising about the power of choice and interactivity and the importance of players telling their own stories. The last part makes me feel like it's 2003 again and I'm writing my first reader review for Eurogamer dot net, transfixed by the idea that I might, some day, discover the Citizen Kane of Games. I don't doubt Levine's sincerity, but comments like \"there's no medium that's more user-involved than our medium\" now make me powerfully grumpy. They make me want to write an editorial about how most of the vaunted choices games offer are boring busywork or hollow gestures that weigh down the quieter, more graceful acts of interpretation that characterise the experience of non-interactive artworks like, say, those stupid films and books, which don't even let you push buttons to make characters talk. But I won't do that: you came here to read about Judas. The interview harbours a few more concrete details about the narrative design of the game, which Levine acknowledges is taking a fair long while. One of the reasons it's taking a while is that he basically wants every notable NPC to be capable of harbouring very meticulous grudges.\"The approach we're taking with Judas is heavily based upon recognition of player action and response to player action,\" Levine told the site. \"Even just characters' observing a long range of player action and commenting on it. 'Hey, you saw this and you did that and then you did this and that was interesting because that caused that' - we're doing that kinda stuff right now. \"And it's really just observing the players and then writing the types of lines that could react to various types of things. It's a huge amount of work because you have to think of all the things a player can do and then write in-character responses for different characters to those actions in a way that feels organic.\" Levine is keen to avoid \"random number generator\" moments, with characters handing you quests out of the blue. As he reiterates: \"once you start observing sequences of events - having characters observe 'You did this and then you did that and that caused this and I'm mad because it did that' - that's when it gets really interesting.\" The result, Levine promises, will be a game that supports many more routes to certain outcomes. \"There are beats and how you got there is going to be fairly different from one player to the next,\" he says. \"And places you'll get to are very different from one player to the next.\"It sounds like the Mayflower itself will be a more open-ended environment than Bioshock's Rapture or Infinite's Columbia. \"BioShock and BioShock Infinite, if you look at them from a development standpoint - and this may be a bit alienating to some readers - but they're basically a corridor,\" Levine concedes. \"A very, very long corridor with a bunch of trigger points that make story elements happen. Judas is made very, very differently and that makes it much more hopefully reflective of players agency, but also much, much harder to make.\" I like the idea of a version of Bioshock in which Rapture isn't a gauntlet run populated by raving thespians, but a persistent society with a memory. I wouldn't put it past Ghost Story to be setting us up for a fall, however - Bioshock's big twist is that many of your choices weren't choices at all. If you find that prospect exhausting, the good news is that Alice Bee (RPS in peace) has already skipped forward a decade to review the negative reviews of the positive reviews of the game.",
  "image": "https://assetsio.gnwcdn.com/judas-story-trailer-mannequin.png?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv\u003e\n  \n\n        \u003cp\u003eNo \u0026#34;random number generator\u0026#34; quests, hopefully\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/judas-story-trailer-mannequin.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/judas-story-trailer-mannequin.png?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/judas-story-trailer-mannequin.png?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/judas-story-trailer-mannequin.png?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A creepy mannequin caresses the cheek of a piano player in Judas\" width=\"880\" height=\"495\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eGhost Story Games\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eI come and go with the work of Ken Levine, celebrated auteurman and \u003ca href=\"https://kotaku.com/report-ken-levines-ghost-story-studio-is-nowhere-near-1848297126\"\u003ereported burnout-inducing manager\u003c/a\u003e, but I\u0026#39;m interested to see more of \u003ca href=\"https://www.rockpapershotgun.com/games/judas\"\u003eJudas\u003c/a\u003e, his current project at Ghost Story Games. The concept for Judas is that you\u0026#39;re trapped in a computer-run society housed aboard a colony ship, the Mayflower. The titular Judas has managed to break free of the AI-groomed status quo, and is out to start a revolution. \u003ca href=\"https://www.rockpapershotgun.com/ken-levines-new-game-judas-looks-a-lot-like-bioshock-infinite-in-space\"\u003e\u0026#34;Bioshock Infinite in space\u0026#34;\u003c/a\u003e, we called it, back in 2022, but Levine says it\u0026#39;s more open-ended than either of his Bioshock endeavours, with a greater emphasis on other characters remembering and responding to your actions over time.\u003c/p\u003e\n\u003cp\u003eThat\u0026#39;s from a new \u003ca href=\"https://www.gamesindustry.biz/the-future-of-storytelling-with-ken-levine\"\u003eGamesIndustry.biz\u003c/a\u003e interview that also contains Levine\u0026#39;s thoughts on generative AI (ambivalent) and whether today\u0026#39;s triple-A budgets are healthy (no), plus some regurgitated rhapsodising about the power of choice and interactivity and the importance of players telling their own stories. The last part makes me feel like it\u0026#39;s 2003 again and I\u0026#39;m writing my first reader review for Eurogamer dot net, transfixed by the idea that I might, some day, discover the Citizen Kane of Games. \u003c/p\u003e\n\u003cp\u003eI don\u0026#39;t doubt Levine\u0026#39;s sincerity, but comments like \u0026#34;there\u0026#39;s no medium that\u0026#39;s more user-involved than our medium\u0026#34; now make me powerfully grumpy. They make me want to write an editorial about how most of the vaunted choices games offer are boring busywork or hollow gestures that weigh down the quieter, more graceful acts of interpretation that characterise the experience of non-interactive artworks like, say, those stupid films and books, which don\u0026#39;t even let you push buttons to make characters talk.\u003c/p\u003e\n\u003cp\u003eBut I won\u0026#39;t do that: you came here to read about Judas. The interview harbours a few more concrete details about the narrative design of the game, which Levine acknowledges is \u003ca href=\"https://www.rockpapershotgun.com/ghost-story-games\"\u003etaking a fair long while\u003c/a\u003e. One of the reasons it\u0026#39;s taking a while is that he basically wants every notable NPC to be capable of harbouring very meticulous grudges.\u003c/p\u003e\u003cp\u003e\u0026#34;The approach we\u0026#39;re taking with Judas is heavily based upon recognition of player action and response to player action,\u0026#34; Levine told the site. \u0026#34;Even just characters\u0026#39; observing a long range of player action and commenting on it. \u0026#39;Hey, you saw this and you did that and then you did this and that was interesting because that caused that\u0026#39; - we\u0026#39;re doing that kinda stuff right now. \u003c/p\u003e\n\u003cp\u003e\u0026#34;And it\u0026#39;s really just observing the players and then writing the types of lines that could react to various types of things. It\u0026#39;s a huge amount of work because you have to think of all the things a player can do and then write in-character responses for different characters to those actions in a way that feels organic.\u0026#34;\u003c/p\u003e\n\u003cp\u003eLevine is keen to avoid \u0026#34;random number generator\u0026#34; moments, with characters handing you quests out of the blue. As he reiterates: \u0026#34;once you start observing sequences of events - having characters observe \u0026#39;You did this and then you did that and that caused this and I\u0026#39;m mad because it did that\u0026#39; - that\u0026#39;s when it gets really interesting.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe result, Levine promises, will be a game that supports many more routes to certain outcomes. \u0026#34;There are beats and how you got there is going to be fairly different from one player to the next,\u0026#34; he says. \u0026#34;And places you\u0026#39;ll get to are very different from one player to the next.\u0026#34;\u003c/p\u003e\u003cp\u003eIt sounds like the Mayflower itself will be a more open-ended environment than Bioshock\u0026#39;s Rapture or Infinite\u0026#39;s Columbia. \u0026#34;\u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/bioshock\"\u003eBioShock\u003c/a\u003e and \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/bioshock-infinite\"\u003eBioShock Infinite\u003c/a\u003e, if you look at them from a development standpoint - and this may be a bit alienating to some readers - but they\u0026#39;re basically a corridor,\u0026#34; Levine concedes. \u0026#34;A very, very long corridor with a bunch of trigger points that make story elements happen. Judas is made very, very differently and that makes it much more hopefully reflective of players agency, but also much, much harder to make.\u0026#34;\u003c/p\u003e\n\u003cp\u003eI like the idea of a version of Bioshock in which Rapture isn\u0026#39;t a gauntlet run populated by raving thespians, but a persistent society with a memory. I wouldn\u0026#39;t put it past Ghost Story to be setting us up for a fall, however - Bioshock\u0026#39;s big twist is that many of your choices weren\u0026#39;t choices at all. If you find that prospect exhausting, the good news is that Alice Bee (RPS in peace) has already skipped forward a decade to \u003ca href=\"https://www.rockpapershotgun.com/pre-emptive-backlash-to-backlash-to-positive-reviews-for-judas\"\u003ereview the negative reviews of the positive reviews of the game\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-02T18:08:15.72033Z",
  "modifiedTime": null
}
