{
  "id": "df2729e5-006c-4379-a031-176deed5226c",
  "title": "How to Ensure a Fun, Safe and Welcoming Gaming Experience for Your Kids on Xbox This Holiday Season",
  "link": "https://news.xbox.com/en-us/2024/11/15/xbox-family-settings-holiday/#new_tab",
  "description": "The post How to Ensure a Fun, Safe and Welcoming Gaming Experience for Your Kids on Xbox This Holiday Season appeared first on Xbox Wire.",
  "author": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "published": "Fri, 20 Dec 2024 17:00:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Holiday 2024",
    "Holiday"
  ],
  "byline": "Jeff Rubenstein",
  "length": 4352,
  "excerpt": "The holiday season is fast approaching, and Xbox makes it easy for adults to make the right choices for their families.",
  "siteName": "Xbox Wire",
  "favicon": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "The holiday season is fast approaching, and with it comes the excitement of finding the perfect gift for the kid(s) in your life. For some, this means considering an Xbox—an experience that can offer endless hours of fun, connection, creativity, and learning. But navigating the gaming world can seem daunting to some – especially those that are new to gaming. From questions around online gaming communities, to regulating screen time, content appropriateness, and how to maintain safety – it can feel overwhelming at times. Fortunately, Xbox makes it easy for adults to make the right choices for their families. The single most important thing you can do when setting up a new Xbox console is to select Yes when asked “Will this console be used by kids?” By spending just a few minutes setting up an Xbox Child Account (versus having them use your existing account), you’re building a safer, more tailored experience for them and one that’s right for your family (and that’s easy to adjust as your little one grows up). Don’t worry, you won’t have to buy your games again to allow your child to play on the same console*. You will, however, have control over which of these games they’re allowed to play, how long they can play, who they can communicate with, and more. Once you’ve set up your Xbox console, you can keep the experience safe by downloading the Xbox Family Settings app for your Android or iOS device. This powerful tool allows you to easily tailor your child’s gaming experience from anywhere, even if you’re nowhere near your Xbox. Here’s just some of what it can do: Screen Time Management: You can set time limits to manage how long your child can play each day. Parents (and grandparents, aunts and uncles!)  tell us one of their favorite features is the ability for kids to request extra playtime, which you can easily approve – or reject – right from the app. You can even pause game time temporarily from the app; the perfect way to say “dinner’s ready!” Content Filters: The app allows you to tailor the content your child can access, blocking games that are too mature and ensuring they only see age-appropriate content that you approve. Purchase Limits and Approvals: Prevent unexpected purchases by approving each purchase through the ask-to-buy feature. To reward good behavior, you can easily add funds to a child’s account for future purchases. Communication Controls: Decide who your child can communicate with during their gaming sessions through robust controls. You can manage your child’s friend list and review incoming requests, and can restrict communication to just friends, or block it entirely. Activity Reporting: Stay informed with weekly activity reports that give you an overview of what your child is playing, how long they’ve played, and any requests they’ve made for additional time or new games. Pretty cool! Additionally, the Xbox Series X|S offers numerous features designed to make gaming accessible for everyone. You can find the full range of accessibility settings on Xbox’s Accessibility site. Once you’ve curated the experience you’d like your children to have, the only question is, what should you play together? Xbox Game Pass offers great value with access to hundreds of games for one monthly price, including a diverse range of family-friendly games that everyone can enjoy. From action-packed adventures to educational games, there’s something for everyone; check out an updated list of titles here – just click the Family \u0026 Kids box underneath Genres on the left rail or in the Game Pass area on your Xbox console. Playing games can stimulate creativity, improve hand-eye coordination, and offer a sense of achievement. They can also be a fantastic way for children to unwind and connect with friends, or be the center of your family’s game night, especially in today’s digital age. With the robust features built into your Xbox console and managed by the Xbox Family Settings app, you can ensure that your child’s gaming experience is as safe and controlled as you need it to be. For more information about the Xbox Family Settings app, visit Xbox.com/family-app. *Entitlements are shared only if child accounts are using the same console set as the “Home console.” More details on designating a Home console can be found here.",
  "image": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2020/09/Hero_image_video-thumbnail.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eThe holiday season is fast approaching, and with it comes the excitement of finding the perfect gift for the kid(s) in your life. For some, this means considering an Xbox—an experience that can offer endless hours of fun, connection, creativity, and learning.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut navigating the gaming world can seem daunting to some – especially those that are new to gaming. From questions around online gaming communities, to regulating screen time, content appropriateness, and how to maintain safety – it can feel overwhelming at times. Fortunately, Xbox makes it easy for adults to make the right choices for their families.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"314\" height=\"578\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/Image-9ae3b21c2f8be3f12c10-314x578.jpeg\" alt=\"\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/Image-9ae3b21c2f8be3f12c10-314x578.jpeg 314w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/Image-9ae3b21c2f8be3f12c10-371x683.jpeg 371w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/Image-9ae3b21c2f8be3f12c10-768x1415.jpeg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/Image-9ae3b21c2f8be3f12c10-834x1536.jpeg 834w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/Image-9ae3b21c2f8be3f12c10-1112x2048.jpeg 1112w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/Image-9ae3b21c2f8be3f12c10.jpeg 1290w\" sizes=\"(max-width: 314px) 100vw, 314px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe single most important thing you can do when setting up a new Xbox console is to select \u003cstrong\u003eYes \u003c/strong\u003ewhen asked “Will this console be used by kids?”\u003c/p\u003e\n\n\n\n\u003cp\u003eBy spending just a few minutes setting up an \u003ca href=\"https://www.xbox.com/en-US/family-hub/child-account?msockid=2e2e43aa760b62b30b5d50be77b163e9\"\u003eXbox Child Account\u003c/a\u003e (versus having them use your existing account), you’re building a safer, more tailored experience for them and one that’s right for your family (and that’s easy to adjust as your little one grows up). Don’t worry, you won’t have to buy your games again to allow your child to play on the same console*. You will, however, have control over which of these games they’re allowed to play, how long they can play, who they can communicate with, and more.\u003c/p\u003e\n\n\n\n\u003cp\u003eOnce you’ve \u003ca href=\"https://www.xbox.com/en-US/consoles/getting-started?msockid=0cacc3e9fc0d61de3585d79dfdb86093\"\u003eset up your Xbox console\u003c/a\u003e, you can keep the experience safe by \u003ca href=\"https://www.xbox.com/en-US/apps/family-settings-app\"\u003edownloading the Xbox Family Settings app\u003c/a\u003e for your \u003ca href=\"https://play.google.com/store/apps/details?id=com.microsoft.xboxfamily\"\u003eAndroid\u003c/a\u003e or \u003ca href=\"https://apps.apple.com/app/xbox-family-settings/id1507406707\"\u003eiOS\u003c/a\u003e device. This powerful tool allows you to easily tailor your child’s gaming experience from anywhere, even if you’re nowhere near your Xbox.\u003c/p\u003e\n\n\n\n\u003cp\u003eHere’s just some of what it can do:\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eScreen Time Management:\u003c/strong\u003e You can set time limits to manage how long your child can play each day. Parents (and grandparents, aunts and uncles!)  tell us one of their favorite features is the ability for kids to request extra playtime, which you can easily approve – or reject – right from the app. You can even pause game time temporarily from the app; the perfect way to say “dinner’s ready!”\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1040\" height=\"867\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/00fe8142-2311-47b2-9ef9-109e6d554559-2f012bec014cf0aeba6b.jpg\" alt=\"\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/00fe8142-2311-47b2-9ef9-109e6d554559-2f012bec014cf0aeba6b.jpg 1040w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/00fe8142-2311-47b2-9ef9-109e6d554559-2f012bec014cf0aeba6b-693x578.jpg 693w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/00fe8142-2311-47b2-9ef9-109e6d554559-2f012bec014cf0aeba6b-819x683.jpg 819w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/11/00fe8142-2311-47b2-9ef9-109e6d554559-2f012bec014cf0aeba6b-768x640.jpg 768w\" sizes=\"(max-width: 1040px) 100vw, 1040px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eContent Filters\u003c/strong\u003e: The app allows you to tailor the content your child can access, blocking games that are too mature and ensuring they only see age-appropriate content that you approve.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003ePurchase Limits and Approvals:\u003c/strong\u003e Prevent unexpected purchases by approving each purchase through the ask-to-buy feature. To reward good behavior, you can easily add funds to a child’s account for future purchases.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eCommunication Controls:\u003c/strong\u003e Decide who your child can communicate with during their gaming sessions through robust controls. You can manage your child’s friend list and review incoming requests, and can restrict communication to just friends, or block it entirely.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eActivity Reporting:\u003c/strong\u003e Stay informed with weekly activity reports that give you an overview of what your child is playing, how long they’ve played, and any requests they’ve made for additional time or new games. Pretty cool!\u003c/p\u003e\n\n\n\n\u003cp\u003eAdditionally, the Xbox Series X|S offers numerous features designed to make gaming accessible for everyone. You can find the full range of accessibility settings \u003ca href=\"https://www.xbox.com/en-US/community/for-everyone/accessibility\"\u003eon Xbox’s Accessibility site\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eOnce you’ve curated the experience you’d like your children to have, the only question is, what should you play together? \u003ca href=\"https://www.xbox.com/en-US/xbox-game-pass/\"\u003eXbox Game Pass\u003c/a\u003e offers great value with access to hundreds of games for one monthly price, including a diverse range of family-friendly games that everyone can enjoy. From action-packed adventures to educational games, there’s something for everyone; check out an updated list of titles \u003ca href=\"https://www.xbox.com/en-US/xbox-game-pass/games?xr=shellnav\"\u003ehere\u003c/a\u003e – just click the Family \u0026amp; Kids box underneath Genres on the left rail or in the Game Pass area on your Xbox console.\u003c/p\u003e\n\n\n\n\u003cp\u003ePlaying games can stimulate creativity, improve hand-eye coordination, and offer a sense of achievement. They can also be a fantastic way for children to unwind and connect with friends, or be the center of your family’s game night, especially in today’s digital age.\u003c/p\u003e\n\n\n\n\u003cp\u003eWith the robust features built into your Xbox console and managed by the Xbox Family Settings app, you can ensure that your child’s gaming experience is as safe and controlled as you need it to be.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor more information about the Xbox Family Settings app, visit \u003ca href=\"https://www.xbox.com/en-US/apps/family-settings-app\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eXbox.com/family-app\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e*\u003cem\u003eEntitlements are shared only if child accounts are using the same console set as the “Home console.” More details on designating a Home console \u003c/em\u003e\u003ca href=\"https://support.xbox.com/en-US/help/hardware-network/console/my-home-xbox\"\u003e\u003cem\u003ecan be found here\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-15T20:00:00Z",
  "modifiedTime": "2024-11-15T15:52:26Z"
}
