{
  "id": "e3d14eca-24a3-43f0-a080-f850725bed41",
  "title": "A Destiny 2 Conspiracy Theory Gets To The Heart Of Its Biggest Loot Problem [Update: Bungie's Investigating]",
  "link": "https://kotaku.com/a-destiny-2-conspiracy-theory-gets-to-the-heart-of-its-1851680514",
  "description": "Destiny 2 players are convinced the game is secretly ripping them off. While on its face an epic space opera about humanity confronting cosmic evil in a post-apocalyptic future, Bungie’s sci-fi shooter is also a Pokémon-style collectathon where instead of cute magical creatures, players capture rare, ornate, and…Read more...",
  "author": "Ethan Gach",
  "published": "Thu, 24 Oct 2024 23:20:00 GMT",
  "source": "https://kotaku.com/rss",
  "categories": [
    "destiny",
    "bungie",
    "paul tassi",
    "rng",
    "experience point",
    "multiplayer video games",
    "role playing video games",
    "destiny 2 beyond light",
    "action role playing video games",
    "perk",
    "first person shooters"
  ],
  "byline": "Ethan Gach",
  "length": 9286,
  "excerpt": "A perk bug debate has opened some old wounds in the sci-fi loot shooter community",
  "siteName": "Kotaku",
  "favicon": "https://i.kinja-img.com/image/upload/c_fill,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png",
  "text": "Destiny 2 players are convinced the game is secretly ripping them off. While on its face an epic space opera about humanity confronting cosmic evil in a post-apocalyptic future, Bungie’s sci-fi shooter is also a Pokémon-style collectathon where instead of cute magical creatures, players capture rare, ornate, and powerful guns. The game’s latest “weightgate” controversy is a strangely compelling conspiracy theory proposing that certain ideal weapon variants are dropping at much lower rates than junk ones, and it’s reigniting old debates about Destiny 2's loot system and whether it’s actually fun or not.Suggested ReadingWhat Is Dragonsplague? Dragon’s Dogma 2’s Devastating Contagion ExplainedOffEnglishSuggested ReadingIf you’re a regular player you can probably guess that I’m talking about perk combinations and god rolls, but if you’re not, it’s important to know a thing or two about the fundamentals at the heart of Destiny 2's loot chase. Most weapons you can get in the game drop with two random perks which do everything from increase reload speed to more interesting stuff like add elemental explosions to precision hits. Some perk combinations are considered much, much better than others based on their synergy with the weapon’s underlying stats and the broader meta governing character builds at any given point in time. These combinations are called god rolls and they decide whether the Legendary drop you just found is worth keeping or junk that should be immediately destroyed. In theory, perk combinations should be completely random, providing an equal chance of getting a god roll as any other possible permutation. But a new conspiracy says that’s not actually how it works, and players think they have the math to prove it. At the heart of this scandal, which Destiny aficionado Paul Tassi at Forbes is calling potentially the biggest in the game’s history, is a new grenade launcher called VS Chill Inhibitor. It was just added to the game in Episode: Revenant, the second content update since The Final Shape expansion in June, as one of the legendary drops in the new Vesper’s Host dungeon. The god roll perks are Envious Arsenal and Bait and Switch, which reload the weapon from reserves and increase damage, respectively. Both are activated by doing damage with other weapons, making it an easy to use but highly effective threat. But players have been farming the first encounter in the Vesper’s Host dungeon ad nauseum and struggling to score this particular god roll more than seemingly any other in recent memory. Theories immediately emerged shortly after the dungeon went live that there must be some sort of bug on Bungie’s end that is unintentionally making the god roll for VS Chill Inhibitor shockingly rare. One player’s data testing this hypothesis blew up over the weekend, so much so that Bungie decided to respond directly. “Hey all, we had a conversation with our Sandbox folks this morning about this,” the Destiny team Twitter account wrote on October 21. “There is no perk weighting active for any legendary weapon perks in Destiny 2. We have added perk attunement for Exotic Class Items in a recent update, but that’s a different system.” It seemed like an open-and-shut case, with the denial leaving no wiggle room for alternate interpretations or theories. Days later, however, players have continued running the numbers and are finding Bungie’s refutation even harder to believe. Here’s the crux of the conspiracy as its taken shape this week, as articulated by T1Vendetta. It’s not that Bungie is intentionally making the most desirable god rolls for weapons harder to get than other perk combinations, but rather that its RNG code is randomly favoring some combinations over others. Specifically, there’s an idea that perks which are listed further away from one another in the tables for Bungie’s API for Destiny 2 are less likely to appear together, while those closer in proximity drop together much more frequently. So while these disparities are actually happening all the time, players only notice them when a weapon’s god roll happens to combine two perks that are unusually far away from one another in the table. An analysis by YouTuber Skarrow9 walks players through the theory in more detail and showcases anecdotal player data and crowdsourced research to back it up. There’s a growing suspicion in the community that this is actually due to a bug dating back to the release of The Final Shape, as evidenced by the unusual perk distribution drop rates for a grenade launcher reissued in that expansion called Truthteller. “At this point, it would seem there’s no malice being directed at or from Bungie in this, but the data is there,” wrote a player on the subreddit in one of the many popular threads discussing the issue. “Whether it’s a bug or issue with how perks are generated, we just want answers or further investigation.”There are already some players trying to sleuth out how a bug like this might sneak into the game without Bungie detecting it, with one guess being that it’s due to a hidden bias somewhere in however the RNG is programmed for perk drops at the moment. Bungie hasn’t weighed back in to clarify if the community is still tilting at windmills or there really is some deeper problem at work that’s keeping players from getting the god roll they want. Whatever the actual truth of the matter turns out to be, the entire ordeal has players grappling with a much larger question: was Destiny’s loot chase ever actually good?The game has always tried to walk a tightrope between giving players what they want when they want it and making them grind for it until they get lucky. Making loot easy and straightforward to attain would defeat the purpose of the game, but at some point too much busy work and RNG can make the whole thing feel more like operating a slot machine than actually having fun. These trade-offs, and how successfully Bungie is balancing them, have been at the forefront this month, especially because weapon crafting was semi-retired. That system used to work as a source of bad-luck protection that eventually let players forge the exact god roll they wanted whether it ever dropped or not. It was a double-edged sword, however, because it also made actual god rolls redundant when players did happen upon them. Instead of grinding to unlock crafting patterns to make their preferred gun, players are now just back to toiling away in the same activities over and over again waiting to get lucky. As someone who returned to the Destiny 2 loot mines this month, it definitely sucks. “The advantage of weapon crafting will always be superior to grinding weapons mindlessly,” reads one post that recently gained a lot of attention on the subreddit. User lordofabyss basically argues that managing multiple rolls across dozens of weapons because you don’t know which one might unexpectedly become part of the future meta is a pain and a mess. It’s also a drag for those who don’t, for whatever reason, ever actually get the god roll they were chasing. Another big thread points out that, regardless of crafting, the overall level of rewards for harder activities in Destiny 2 feel needlessly stingy. There’s nothing worse than running dungeon or raid encounters for an hour and getting nothing useful. One conversation on Twitter put these long-standing issues with Destiny 2 in the context of MMOs more generally, which Bungie’s game has slowly become over the years. “RNG is RNG,” tweeted CammyCakesYT. “Regardless of if there is an unknown underlying bug...Destiny 2 grind feels bad compared to other games bc it has always been missing: Player trading, Crafting system for complex modifications, Cosmetics to use spare currency on.” Without diving deep into the weeds of Destiny 2's loot chase compared to those in games like Final Fantasy XIV, Diablo IV, or Warframe, one thing it’s clearly suffering from at the moment is the fact that god rolls are essentially the only thing to chase right now. Maybe that will change with next year’s ambitious Codename: Frontier plans, which Bungie has said will borrow from metroidvanias and roguelikes to structure content in ways that potentially feels more fresh and satisfying. For now, bugged god rolls or not, the state of Destiny 2 is feeling a bit shallow. The new dungeon is excellent and the potion-based tonic system this Episode is a really cool idea, but the underlying grind holding it altogether is feeling weaker than it has in a long time. Update 10/24/2024 7:20 p.m. ET: Bungie has responded to the Destiny 2 community’s ongoing discussions around alleged perk weighting and confirms it will renewing it’s own investigation. It definitely sounds like there might be more than a kernel of truth in the “weightgate” conspiracy theory after all.“While we have confirmed that there is no intentional perk weighting on weapons within our content setup, we are now investigating a potential issue within our code for how RNG perks are generated,” the development team tweeted. “Many thanks to all players who have been contributing to data collection across the community. This data has been monumentally helpful with our investigation, and we are currently working on internal simulations to confirm your findings.”",
  "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/f2b3f2af68ea9d55c2768542dcab50cf.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eDestiny 2 \u003c/em\u003eplayers are convinced the game is secretly ripping them off. While on its face an epic space opera about humanity confronting cosmic evil in a post-apocalyptic future, Bungie’s sci-fi  shooter is also a \u003cem\u003ePokémon\u003c/em\u003e-style collectathon where instead of cute magical creatures, players capture rare, ornate, and powerful guns. The game’s latest “weightgate” controversy is a strangely compelling conspiracy theory proposing that certain ideal weapon variants are dropping at much lower rates than junk ones, and it’s reigniting old debates about \u003cem\u003eDestiny 2\u003c/em\u003e\u0026#39;s loot system and whether it’s actually fun or not.\u003cbr/\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cdiv data-video-id=\"196742\" data-monetizable=\"true\" data-position=\"sidebar\" data-video-title=\"What Is Dragonsplague? Dragon’s Dogma 2’s Devastating Contagion Explained\" data-video-blog-id=\"9\" data-video-network=\"kotaku\" data-video-duration=\"254\" data-playlist=\"196742,196452,196790\" data-current=\"196742\"\u003e\u003cdiv\u003e\u003cp\u003eWhat Is Dragonsplague? Dragon’s Dogma 2’s Devastating Contagion Explained\u003c/p\u003e\u003c/div\u003e\u003cvideo disablepictureinpicture=\"\" muted=\"\" playsinline=\"\" width=\"100%\" height=\"100%\" crossorigin=\"anonymous\" preload=\"none\"\u003e\u003csource data-src=\"https://vid.kinja.com/prod/196742/196742_240p.mp4\" label=\"240p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/196742/196742_480p.mp4\" label=\"480p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/196742/196742_720p.mp4\" label=\"720p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/196742/196742_1080p.mp4\" label=\"1080p\" type=\"video/mp4\"/\u003e\u003ctrack kind=\"captions\" label=\"English\" src=\"https://kinja.com/api/videoupload/caption/22297.vtt\" srclang=\"en\"/\u003e\u003c/video\u003e\u003cdiv\u003e\u003cul\u003e\u003cli data-label=\"\"\u003eOff\u003c/li\u003e\u003cli data-label=\"English\"\u003eEnglish\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cp\u003eIf you’re a regular player you can probably guess that I’m talking about perk combinations and god rolls, but if you’re not, it’s important to know a thing or two about the fundamentals \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/destiny-2-the-final-shape-impressions-1851521089\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/destiny-2-the-final-shape-impressions-1851521089\"\u003eat the heart of \u003cem\u003eDestiny 2\u003c/em\u003e\u0026#39;s loot chase\u003c/a\u003e\u003c/span\u003e. Most weapons you can get in the game drop with two random perks which do everything from increase reload speed to more interesting stuff like add elemental explosions to precision hits. \u003c/p\u003e\u003cp\u003eSome perk combinations are considered much, much better than others based on their synergy with the weapon’s underlying stats and the broader meta governing  character builds at any given point in time. These combinations are called god rolls and they decide whether the Legendary drop you just found is worth keeping or junk that should be immediately destroyed. In theory, perk combinations should be completely random, providing an equal chance of getting a god roll as any other possible permutation. But a new conspiracy says that’s not actually how it works, and players think they have the math to prove it. \u003c/p\u003e\u003cp\u003eAt the heart of this scandal, which \u003cem\u003eDestiny \u003c/em\u003eaficionado Paul Tassi at\u003cem\u003e Forbes \u003c/em\u003eis \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.forbes.com/sites/paultassi/2024/10/24/destiny-2-is-on-the-verge-of-its-biggest-scandal-in-history/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.forbes.com/sites/paultassi/2024/10/24/destiny-2-is-on-the-verge-of-its-biggest-scandal-in-history/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ecalling potentially the biggest in the game’s history\u003c/a\u003e\u003c/span\u003e, is a new grenade launcher called VS Chill Inhibitor. It was just added to the game in \u003cem\u003eEpisode: Revenant\u003c/em\u003e, the second content update since \u003cem\u003eThe Final Shape\u003c/em\u003e expansion in June, as one of the legendary drops in the new Vesper’s Host dungeon. The god roll perks are Envious Arsenal and Bait and Switch, which reload the weapon from reserves and increase damage, respectively. Both are activated by doing damage with other weapons, making it an easy to use but highly effective threat. \u003c/p\u003e\u003cp\u003eBut players have been farming the first encounter in the Vesper’s Host dungeon ad nauseum and struggling to score this particular god roll more than seemingly any other in recent memory. Theories immediately emerged shortly after the dungeon went live that there must be some sort of bug on Bungie’s end that is unintentionally making the god roll for VS Chill Inhibitor shockingly rare. One player’s data \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://x.com/SparkD2_/status/1848142767102317000\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://x.com/SparkD2_/status/1848142767102317000\" target=\"_blank\" rel=\"noopener noreferrer\"\u003etesting this hypothesis\u003c/a\u003e\u003c/span\u003e blew up over the weekend, so much so that Bungie decided to respond directly. \u003c/p\u003e\u003cp\u003e“Hey all, we had a conversation with our Sandbox folks this morning about this,” the \u003cem\u003eDestiny\u003c/em\u003e team Twitter account \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://x.com/Destiny2Team/status/1848473860905308232\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://x.com/Destiny2Team/status/1848473860905308232\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ewrote on October 21\u003c/a\u003e\u003c/span\u003e. “There is no perk weighting active for any legendary weapon perks in \u003cem\u003eDestiny 2\u003c/em\u003e.  We have added perk attunement for Exotic Class Items in a recent update, but that’s a different system.” It seemed like an open-and-shut case, with the denial leaving no wiggle room for alternate interpretations or theories. Days later, however, players have continued running the numbers and are finding Bungie’s refutation even harder to believe. \u003c/p\u003e\u003cp\u003eHere’s the crux of the conspiracy as its taken shape this week, \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://x.com/T1Vendetta/status/1849078033874833478\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://x.com/T1Vendetta/status/1849078033874833478\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eas articulated by T1Vendetta\u003c/a\u003e\u003c/span\u003e. It’s not that Bungie is intentionally making the most desirable god rolls for weapons harder to get than other perk combinations, but rather that its RNG code is randomly favoring some combinations over others. Specifically, there’s an idea that perks which are listed further away from one another in the tables for Bungie’s API for \u003cem\u003eDestiny 2\u003c/em\u003e are less likely to appear together, while those closer in proximity drop together much more frequently. So while these disparities are actually happening all the time, players only notice them when a weapon’s god roll happens to combine two perks that are unusually far away from one another in the table. \u003c/p\u003e\u003cp\u003eAn analysis by \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://youtu.be/7fzC-FmJVmY\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://youtu.be/7fzC-FmJVmY\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eYouTuber Skarrow9\u003c/a\u003e\u003c/span\u003e walks players through the theory in more detail and showcases anecdotal player data and crowdsourced research to back it up. \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.reddit.com/r/DestinyTheGame/comments/1gaprxd/its_not_just_chill_inhibitor_all_weapons_from/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.reddit.com/r/DestinyTheGame/comments/1gaprxd/its_not_just_chill_inhibitor_all_weapons_from/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eThere’s a growing suspicion in the community\u003c/a\u003e\u003c/span\u003e that this is actually due to a bug dating back to the release of \u003cem\u003eThe Final Shape\u003c/em\u003e, as evidenced by the unusual perk distribution drop rates for a grenade launcher reissued in that expansion \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://x.com/mossy_max/status/1849246476041605224\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://x.com/mossy_max/status/1849246476041605224\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ecalled Truthteller\u003c/a\u003e\u003c/span\u003e. “At this point, it would seem there’s no malice being directed at or from Bungie in this, but the data is there,” wrote a player on the subreddit \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.reddit.com/r/DestinyTheGame/comments/1gajidc/stop_farming_vs_chill_inhibitor_2_electric/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.reddit.com/r/DestinyTheGame/comments/1gajidc/stop_farming_vs_chill_inhibitor_2_electric/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ein one of the many popular threads\u003c/a\u003e\u003c/span\u003e discussing the issue. “Whether it’s a bug or issue with how perks are generated, we just want answers or further investigation.”\u003c/p\u003e\u003cp\u003eThere are already some players trying to sleuth out how a bug like this might sneak into the game without Bungie detecting it, with one guess being that it’s due to a hidden bias somewhere in however the RNG is programmed for perk drops at the moment. Bungie hasn’t weighed back in to clarify if the community is still tilting at windmills or there really is some deeper problem at work that’s keeping players from getting the god roll they want. Whatever the actual truth of the matter turns out to be, the entire ordeal has players grappling with a much larger question: was Destiny’s loot chase \u003cem\u003eever\u003c/em\u003e actually good?\u003c/p\u003e\u003cp\u003eThe game has always tried to walk a tightrope between giving players what they want when they want it and making them grind for it until they get lucky. Making loot easy and straightforward to attain would defeat the purpose of the game, but at some point too much busy work and RNG can make the whole thing feel more like operating a slot machine than actually having fun. These trade-offs, and how successfully Bungie is balancing them, have been at the forefront this month, especially because weapon crafting was semi-retired. \u003c/p\u003e\u003cp\u003eThat system used to work as a source of bad-luck protection that eventually let players forge the exact god roll they wanted whether it ever dropped or not. It was a double-edged sword, however, because it also made actual god rolls redundant when players did happen upon them. Instead of grinding to unlock crafting patterns to make their preferred gun, players are now just back to toiling away in the same activities over and over again waiting to get lucky. As someone who returned to the \u003cem\u003eDestiny 2 \u003c/em\u003eloot mines this month, it definitely sucks. \u003c/p\u003e\u003cp\u003e“The advantage of weapon crafting will always be superior to grinding weapons mindlessly,” \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.reddit.com/r/DestinyTheGame/comments/1gaunvv/the_advantage_of_weapon_crafting_will_always_be/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.reddit.com/r/DestinyTheGame/comments/1gaunvv/the_advantage_of_weapon_crafting_will_always_be/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ereads one post\u003c/a\u003e\u003c/span\u003e that recently gained a lot of attention on the subreddit. User lordofabyss basically argues that managing multiple rolls across dozens of weapons because you don’t know which one might unexpectedly become part of the future meta is a pain and a mess. It’s also a drag for those who don’t, for whatever reason, ever actually get the god roll they were chasing. \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.reddit.com/r/DestinyTheGame/comments/1gawuzl/as_someone_who_could_personally_take_or_leave/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.reddit.com/r/DestinyTheGame/comments/1gawuzl/as_someone_who_could_personally_take_or_leave/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eAnother big thread points out that\u003c/a\u003e\u003c/span\u003e, regardless of crafting, the overall level of rewards for harder activities in \u003cem\u003eDestiny 2\u003c/em\u003e feel needlessly stingy. There’s nothing worse than running dungeon or raid encounters for an hour and getting nothing useful. \u003c/p\u003e\u003cp\u003eOne conversation on Twitter put these long-standing issues with \u003cem\u003eDestiny 2 \u003c/em\u003ein the context of MMOs more generally, which Bungie’s game has slowly become over the years. “RNG is RNG,” \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://x.com/CammyCakesYT/status/1848780678608957651\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://x.com/CammyCakesYT/status/1848780678608957651\" target=\"_blank\" rel=\"noopener noreferrer\"\u003etweeted\u003c/a\u003e\u003c/span\u003e CammyCakesYT. “Regardless of if there is an unknown underlying bug...\u003cem\u003eDestiny 2\u003c/em\u003e grind feels bad compared to other games bc it has always been missing: Player trading, Crafting system for complex modifications, Cosmetics to use spare currency on.” Without diving deep into the weeds of \u003cem\u003eDestiny 2\u003c/em\u003e\u0026#39;s loot chase compared to those in games like\u003cem\u003e Final Fantasy XIV\u003c/em\u003e, \u003cem\u003eDiablo IV\u003c/em\u003e, or \u003cem\u003eWarframe\u003c/em\u003e, one thing it’s clearly suffering from at the moment is the fact that god rolls are essentially the\u003cem\u003e only\u003c/em\u003e thing to chase right now. \u003c/p\u003e\u003cp\u003eMaybe that will change with \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/destiny-2-codename-frontiers-loot-expansions-free-1851643541\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/destiny-2-codename-frontiers-loot-expansions-free-1851643541\"\u003enext year’s ambitious \u003cem\u003eCodename: Frontier\u003c/em\u003e plans\u003c/a\u003e\u003c/span\u003e, which Bungie has said will borrow from metroidvanias and roguelikes to structure content in ways that potentially feels more fresh and satisfying. For now, bugged god rolls or not, the state of \u003cem\u003eDestiny 2\u003c/em\u003e is feeling a bit shallow. The new dungeon is excellent and the potion-based tonic system this Episode is a really cool idea, but the underlying grind holding it altogether is feeling weaker than it has in a long time. \u003c/p\u003e\u003cp\u003e \u003cstrong\u003eUpdate 10/24/2024 7:20 p.m. ET: \u003c/strong\u003eBungie has responded to the\u003cem\u003e Destiny 2\u003c/em\u003e community’s ongoing discussions around alleged perk weighting and confirms it will renewing it’s own investigation. It definitely sounds like there might be more than a kernel of truth in the “weightgate” conspiracy theory after all.\u003cbr/\u003e\u003c/p\u003e\u003cp\u003e“While we have confirmed that there is no intentional perk weighting on weapons within our content setup, we are now investigating a potential issue within our code for how RNG perks are generated,” the development team \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://x.com/Destiny2Team/status/1849550490004283811\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://x.com/Destiny2Team/status/1849550490004283811\" target=\"_blank\" rel=\"noopener noreferrer\"\u003etweeted\u003c/a\u003e\u003c/span\u003e. “Many thanks to all players who have been contributing to data collection across the community. This data has been monumentally helpful with our investigation, and we are currently working on internal simulations to confirm your findings.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-10-24T13:35:00-04:00",
  "modifiedTime": "2024-10-24T23:20:00.506Z"
}
