{
  "id": "e7becea0-df44-4b71-849d-afbe24c486b4",
  "title": "Carry-On Review",
  "link": "https://www.ign.com/articles/carry-on-review-netflix-jason-bateman-taron-egerton",
  "description": "There’s a little Liam Neeson and a lot of John McClane in this fun thriller from Non-Stop director Jaume Collet-Serra.",
  "author": "Erik Adams",
  "published": "Fri, 13 Dec 2024 00:00:00 +0000",
  "source": "http://feeds.ign.com/ign/all",
  "categories": null,
  "byline": "A.A. Dowd",
  "length": 6435,
  "excerpt": "There’s a little Liam Neeson and a lot of John McClane in this fun thriller from Non-Stop director Jaume Collet-Serra.",
  "siteName": "IGN",
  "favicon": "",
  "text": "There’s a little Liam Neeson and a lot of John McClane in this fun Netflix thriller.Think your holiday season is stressful? Thank the Star of Bethlehem you’re not Ethan Kopek (Taron Egerton), put-upon hero of the enjoyably improbable new Netflix suspense thriller Carry-On. For starters, Ethan is a TSA agent, which means he endures abuse from impatient strangers for a living. It’s worse, of course, on one of the busiest travel days of the year at one of the busiest airports in the world, which is where Ethan finds himself at the beginning of Carry-On: December 24, at LAX. All that would be enough to turn even the merriest man into a certified Grinch, and it’s just the beginning of the yuletide nightmare that awaits Egerton’s beleaguered everydude once a mysterious terrorist begins whispering an ultimatum into his ear: Let one particular bag pass unflagged through security or his nearest and dearest aren’t making it home for Christmas.Chief among Ethan’s threatened loved ones is his newly pregnant wife, Nora (Sofia Carson), who also works at the airport – a job opportunity that dragged the couple across the country from New York to Los Angeles. If that particular plot detail doesn’t trigger a visit from the Ghost of Christmas Movies Past, then Egerton’s wide forehead and stocky build should do the trick. Yes, Carry-On has been made in the yippee ki yay spirit of Die Hard, another festive action picture about a fairly ordinary guy rising to meet very extraordinary circumstances. And while this new movie doesn’t quite reach the Nakatomi Plaza heights of that classic, it’s considerably more fun than Die Hard 2, which also happened to take place in a bustling airport on Christmas Eve.The film’s director, Spanish genre specialist Jaume Collet-Serra, carefully balances the chaos and control of his scenario. For a while, Carry-On sticks close to its millennial John McClane wannabe; under attentive surveillance by the bad guy, who issues instructions through an earpiece, Ethan tries to think his way through an impossible situation. Can he use his smartwatch to send a message to authorities? Maybe he can scrawl it on a ticket with a counterfeit-currency marker. Working from a clever script by T.J. Fixman, Collet-Serra builds the suspense around the specifics (and specific headaches) of TSA security. Ethan’s crucible is like a life-and-death perversion of any airport employee’s daily ordeal: He has to keep his cool even as testy travelers complain loudly about any delays and take out their frustrations on him.A sympathy for working Americans is one hallmark of this director’s ongoing collaboration with Liam Neeson. In some ways, Carry-On operates like a holiday cousin to those films – politically conscious suspense contraptions like Non-Stop and The Commuter that make good use of contained settings and cellular technology. (Few filmmakers have found a more appealing way to visualize text messages.) Collet-Serra warms us immediately to Ethan’s workplace, painting the personalities of his soon-to-be-endangered coworkers (like Breaking Bad’s Dean Norris as the no-nonsense supervisor) in quick brushstrokes. Little touches, like the way that Ethan and Nora have to park and take a shuttle to their respective terminals, speaks to an interest in getting the logistics of an airport right. And an entertaining early montage of various fliers throwing tantrums while being wanded or waiting in line betrays where Collet-Serra’s allegiances lie.Carry-On GalleryThe movie derives most of its tension from the cat-and-mouse game between Egerton – who’s much more likable and relatably frazzled here than he was in the Kingsman movies – and a cast-against-type Jason Bateman, who plays (and initially only voices) the villain on the line. As in another thriller, The Gift, the Arrested Development star leans into his talent for hostile sarcasm, in this case twisting the Gen X snarkiness of past characters into a calm, dry menace. It’s exactly how you’d imagine Hans Gruber if he were that jerk from Juno. Bateman is so good at going bad that it’s easy to forgive how transparently the script deploys him as a voice of negative reinforcement, helping nudge Ethan – floundering in a job he doesn’t want after failing to get into the police academy – towards his full potential. This believe-in-yourself arc is the corniest thing about Carry-On.The novelty of the movie rests on the particulars of Ethan’s predicament: how he has to stop a terrorist attack while chained to his grueling post at a CT scanner during a teeming holiday rush. Naturally, the tension flags a little once the action opens up to other areas of the airport and Ethan starts getting more in touch with his inner Bruce Willis. Even then, though, Collet-Serra tackles the material with a muscular enthusiasm uncommon to streaming distractions. There’s a feverish chase around a backroom of baggage carousels that brings Pixar to mind, and a goofily elaborate, digital long take in which the stock detective character (Danielle Deadwyler, recent star of The Piano Lesson, a very different Netflix movie) wrestles for a gun in a car while “Last Christmas” blares cheerfully on the radio.There’s a little Liam Neeson and a lot of John McClane in this fun Netflix thriller.With its escalating complications and simple but potent premise, Carry-On is the kind of lean, effective, unpretentious Hollywood crowd-pleaser that’s too rare in this day and age. It’s brain candy that won’t rot your brain. Consider it a Christmas present, too, for all the Die Hard fans in your life – even if that towering 1988 thrill ride remains the gift that keeps on giving.VerdictThere’s a little Liam Neeson and a lot of John McClane in this fun Netflix thriller from Non-Stop director Jaume Collet-Serra. Blessed with a reasonably clever premise, Carry-On builds its escalating suspense around a war of wills between an ordinary TSA agent and the mysterious terrorist who demands he clear a deadly package through airport security on Christmas Eve – or else! A good cast and Collet-Serra’s energetic staging elevate the kind of straight-down-the-middle entertainment Hollywood has mostly, sadly stopped bankrolling. It’s not quite Die Hard, but close enough.In This ArticleNot yet available for streaming.Carry-On ReviewgoodWhat do you get for the Die Hard fanatic in your life that has everything? Clever Netflix thriller Carry-On will do just fine.",
  "image": "https://assets-prd.ignimgs.com/2024/12/12/carry-on-blogroll-1734041883603.jpg?width=1280",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-cy=\"page-header\"\u003e\u003ch2 data-cy=\"article-sub-headline\"\u003eThere’s a little Liam Neeson and a lot of John McClane in this fun Netflix thriller.\u003c/h2\u003e\u003c/div\u003e\u003cdiv data-cy=\"article-content\"\u003e\u003csection data-cy=\"article-subtitle\"\u003e\u003cp data-cy=\"paragraph\"\u003eThink your holiday season is stressful? Thank the Star of Bethlehem you’re not Ethan Kopek (Taron Egerton), put-upon hero of the enjoyably improbable new Netflix suspense thriller Carry-On. For starters, Ethan is a TSA agent, which means he endures abuse from impatient strangers for a living. It’s worse, of course, on one of the busiest travel days of the year at one of the busiest airports in the world, which is where Ethan finds himself at the beginning of Carry-On: December 24, at LAX. All that would be enough to turn even the merriest man into a certified Grinch, and it’s just the beginning of the yuletide nightmare that awaits Egerton’s beleaguered everydude once a mysterious terrorist begins whispering an ultimatum into his ear: Let one particular bag pass unflagged through security or his nearest and dearest aren’t making it home for Christmas.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eChief among Ethan’s threatened loved ones is his newly pregnant wife, Nora (Sofia Carson), who also works at the airport – a job opportunity that dragged the couple across the country from New York to Los Angeles. If that particular plot detail doesn’t trigger a visit from the Ghost of Christmas Movies Past, then Egerton’s wide forehead and stocky build should do the trick. Yes, Carry-On has been made in the yippee ki yay spirit of \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/movies/die-hard\"\u003e\u003cu\u003eDie Hard\u003c/u\u003e\u003c/a\u003e, another festive action picture about a fairly ordinary guy rising to meet very extraordinary circumstances. And while this new movie doesn’t quite reach the Nakatomi Plaza heights of that classic, it’s considerably more fun than Die Hard 2, which also happened to take place in a bustling airport on Christmas Eve.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThe film’s director, Spanish genre specialist Jaume Collet-Serra, carefully balances the chaos and control of his scenario. For a while, Carry-On sticks close to its millennial John McClane wannabe; under attentive surveillance by the bad guy, who issues instructions through an earpiece, Ethan tries to think his way through an impossible situation. Can he use his smartwatch to send a message to authorities? Maybe he can scrawl it on a ticket with a counterfeit-currency marker. Working from a clever script by T.J. Fixman, Collet-Serra builds the suspense around the specifics (and specific headaches) of TSA security. Ethan’s crucible is like a life-and-death perversion of any airport employee’s daily ordeal: He has to keep his cool even as testy travelers complain loudly about any delays and take out their frustrations on him.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eA sympathy for working Americans is one hallmark of this director’s ongoing collaboration with Liam Neeson. In some ways, Carry-On operates like a holiday cousin to those films – politically conscious suspense contraptions like Non-Stop and The Commuter that make good use of contained settings and cellular technology. (Few filmmakers have found a more appealing way to visualize text messages.) Collet-Serra warms us immediately to Ethan’s workplace, painting the personalities of his soon-to-be-endangered coworkers (like \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/tv/breaking-bad\"\u003e\u003cu\u003eBreaking Bad\u003c/u\u003e\u003c/a\u003e’s Dean Norris as the no-nonsense supervisor) in quick brushstrokes. Little touches, like the way that Ethan and Nora have to park and take a shuttle to their respective terminals, speaks to an interest in getting the logistics of an airport right. And an entertaining early montage of various fliers throwing tantrums while being wanded or waiting in line betrays where Collet-Serra’s allegiances lie.\u003c/p\u003e\u003coutput data-cy=\"article-slideshow\"\u003e\u003cdiv data-cy=\"slideshow-view-trigger\"\u003e\u003ch3 data-cy=\"slideshow-preview-title\"\u003eCarry-On Gallery\u003c/h3\u003e\u003c/div\u003e\u003c/output\u003e\u003cp data-cy=\"paragraph\"\u003eThe movie derives most of its tension from the cat-and-mouse game between Egerton – who’s much more likable and relatably frazzled here than he was in the \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/movies/franchise/kingsman\"\u003e\u003cu\u003eKingsman\u003c/u\u003e\u003c/a\u003e movies – and a cast-against-type Jason Bateman, who plays (and initially only voices) the villain on the line. As in another thriller, \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/movies/the-gift-2015\"\u003e\u003cu\u003eThe Gift\u003c/u\u003e\u003c/a\u003e, the \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/tv/arrested-development\"\u003e\u003cu\u003eArrested Development\u003c/u\u003e\u003c/a\u003e star leans into his talent for hostile sarcasm, in this case twisting the Gen X snarkiness of past characters into a calm, dry menace. It’s exactly how you’d imagine Hans Gruber if he were that jerk from \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/movies/juno\"\u003e\u003cu\u003eJuno\u003c/u\u003e\u003c/a\u003e. Bateman is so good at going bad that it’s easy to forgive how transparently the script deploys him as a voice of negative reinforcement, helping nudge Ethan – floundering in a job he doesn’t want after failing to get into the police academy – towards his full potential. This believe-in-yourself arc is the corniest thing about Carry-On.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThe novelty of the movie rests on the particulars of Ethan’s predicament: how he has to stop a terrorist attack while chained to his grueling post at a CT scanner during a teeming holiday rush. Naturally, the tension flags a little once the action opens up to other areas of the airport and Ethan starts getting more in touch with his inner Bruce Willis. Even then, though, Collet-Serra tackles the material with a muscular enthusiasm uncommon to streaming distractions. There’s a feverish chase around a backroom of baggage carousels that brings Pixar to mind, and a goofily elaborate, digital long take in which the stock detective character (Danielle Deadwyler, recent star of The Piano Lesson, a very different Netflix movie) wrestles for a gun in a car while “Last Christmas” blares cheerfully on the radio.\u003c/p\u003e\u003cdiv data-cy=\"quoteBox\"\u003e\u003cp\u003eThere’s a little Liam Neeson and a lot of John McClane in this fun Netflix thriller.\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eWith its escalating complications and simple but potent premise, Carry-On is the kind of lean, effective, unpretentious Hollywood crowd-pleaser that’s too rare in this day and age. It’s brain candy that won’t rot your brain. Consider it a Christmas present, too, for all the Die Hard fans in your life – even if that towering 1988 thrill ride remains the gift that keeps on giving.\u003c/p\u003e\u003c/section\u003e\u003cdiv data-cy=\"verdict\"\u003e\u003ch3 data-cy=\"title3\"\u003eVerdict\u003c/h3\u003e\u003cp data-cy=\"article-verdict-paragraph\"\u003eThere’s a little Liam Neeson and a lot of John McClane in this fun Netflix thriller from Non-Stop director Jaume Collet-Serra. Blessed with a reasonably clever premise, Carry-On builds its escalating suspense around a war of wills between an ordinary TSA agent and the mysterious terrorist who demands he clear a deadly package through airport security on Christmas Eve – or else! A good cast and Collet-Serra’s energetic staging elevate the kind of straight-down-the-middle entertainment Hollywood has mostly, sadly stopped bankrolling. It’s not quite Die Hard, but close enough.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3 data-cy=\"object-summary-embed-title\"\u003eIn This Article\u003c/h3\u003e\u003cdiv data-cy=\"objectcard-view-trigger\"\u003e\u003cdiv data-cy=\"object-thumbnail\"\u003e\u003cfigure\u003e\u003cimg decoding=\"async\" alt=\"Carry-On\" src=\"https://assets-prd.ignimgs.com/2024/12/12/screenshot-2024-12-12-at-12-39-38-pm-1734028870916.png?width=114\u0026amp;auto=webp\" srcset=\"https://assets-prd.ignimgs.com/2024/12/12/screenshot-2024-12-12-at-12-39-38-pm-1734028870916.png?width=114\u0026amp;auto=webp 1x, https://assets-prd.ignimgs.com/2024/12/12/screenshot-2024-12-12-at-12-39-38-pm-1734028870916.png?width=114\u0026amp;auto=webp\u0026amp;dpr=2 2x\" data-cy=\"progressive-image\"/\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-cy=\"article-subtitle\"\u003eNot yet available for streaming.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3 data-cy=\"object-review-title\"\u003eCarry-On Review\u003c/h3\u003e\u003cdiv data-cy=\"review-content\"\u003e\u003cdiv\u003e\u003cp\u003egood\u003c/p\u003e\u003cp\u003eWhat do you get for the Die Hard fanatic in your life that has everything? Clever Netflix thriller Carry-On will do just fine.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cimg decoding=\"async\" alt=\"Official IGN Review\" src=\"https://assets-prd.ignimgs.com/2024/12/12/carry-on-blogroll-1734041883603.jpg?width=540\u0026amp;crop=16%3A9\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-13T00:00:00Z",
  "modifiedTime": "2024-12-13T00:05:54.768Z"
}
