{
  "id": "f08a5ff7-b18e-4a8b-afa3-be2bdf6e2809",
  "title": "GTA publisher sues \"lawless enterprise\" allegedly selling modified accounts and currency obtained through hacking",
  "link": "https://www.eurogamer.net/gta-publisher-sues-lawless-enterprise-selling-modified-accounts-and-currency-obtained-through-hacking",
  "description": "Grand Theft Auto and Borderlands publisher Take-Two Interactive is suing PlayerAuctions - an online marketplace already targeted in a complaint by Roblox - accusing it of selling \"heavily modified\" player accounts, items, and virtual currency obtained through hacks and cheats. Read more",
  "author": "Matt Wales",
  "published": "Wed, 12 Mar 2025 00:24:12 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "PS3",
    "PC",
    "Shooter",
    "Rockstar Games",
    "Xbox Series X/S",
    "PS4",
    "Arcade",
    "Modern Day",
    "RPG",
    "Platformer",
    "Grand Theft Auto V",
    "Roblox",
    "Single Player",
    "Grand Theft Auto 6",
    "Virtual Reality",
    "Xbox One",
    "Full product",
    "First person",
    "Multiplayer Cooperative",
    "Nintendo Switch",
    "Action Adventure",
    "Third person",
    "Multiplayer Competitive",
    "Rockstar North",
    "Xbox 360",
    "Simulation",
    "Take-Two Interactive",
    "Open World",
    "PS5",
    "Roblox Corporation",
    "Shooter: Third Person",
    "Racing"
  ],
  "byline": "Matt Wales",
  "length": 3000,
  "excerpt": "Grand Theft Auto and Borderlands publisher Take-Two Interactive is suing PlayerAuctions - an online marketplace already…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/b306cf01075fd55575a34b05e47ca693/icon/apple-touch-icon-152x152.png",
  "text": "Defendant also targeted by Roblox. Image credit: Eurogamer Grand Theft Auto and Borderlands publisher Take-Two Interactive is suing PlayerAuctions - an online marketplace already targeted in a complaint by Roblox - accusing it of selling \"heavily modified\" player accounts, items, and virtual currency obtained through hacks and cheats. Take-Two's lawsuit - filed in the US Central District Court of California last week and spotted by Polygon - targets PlayerAuctions' Chinese owner Paiao Network Technology. It accuses the company of running a \"lawless enterprise\", claiming it has \"full knowledge\" of the alleged \"rampant infringement and other unauthorised conduct\" happening on its site. \"[This] is not a regular online marketplace,\" reads the filing. \"Instead, [it] runs a sophisticated sales platform and actively recruits 'sellers' skilled at using hacking software and other exploits to create infringing digital goods and to provide illegal 'services' to players of GTA 5.\" More specifically, Take-Two claims PlayerAuctions contains \"thousands of listings for unauthorised, infringing GTA 5 content – including heavily modified player accounts, in-game assets, and virtual currency – all gained by using hacking software, cheats, and technical exploits.\" Take-Two claims PlayerAuctions sells accounts manipulated through hacking to provide \"exorbitantly high game level ranking and in-game currency amounts\", as well as content ordinarily only accessible through gameplay or purchases. \"At the scale of its website,\" continues the lawsuit, \"PlayerAuctions risks upending the GTA 5 player experience and interferes with the balance and fairness of the game.\" Take-Two claims it has \"repeatedly confronted PlayerAuctions with evidence of infringement and other tortious conduct\", but says its cease and desist orders have so far been ignored - all while Paiao Network Technology allegedly continues to reap \"millions in revenue\" from infringement. Take-Two says it's bringing its complaint to the court in order to \"shut down PlayerAuctions' rampant infringing online marketplace, end its corrupt business model, and protect the integrity of GTA 5 for its players.\" Take-Two is claiming relief for copyright and trademark infringement, and is requesting the court \"preliminarily and permanently\" prohibits PlayerAuctions from selling accounts, virtual goods, and virtual currency in GTA 5 or any of its other games. Additionally, Take-Two wants PlayerAuctions to be prohibited from \"aiding, abetting, contributing to, or otherwise assisting, benefiting or inducing\" hacking of its software or infringing its GTA trademarks. Take-Two's lawsuit follows a similar filing against PlayerAuctions by Roblox Corporation last month. The company is also seeking monetary damages, as well as requesting the court prevents PlayerAuctions from buying, selling, and trading Roblox-related products.",
  "image": "https://assetsio.gnwcdn.com/gta-objection.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n        \n\n        \u003cp\u003eDefendant also targeted by Roblox.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/gta-objection.jpg?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/gta-objection.jpg?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/gta-objection.jpg?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/gta-objection.jpg?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Composite image of Phoenix Wright pointing to the PlayerAuctions website and shouting \u0026#34;Objection!\u0026#34;. Artwork of GTA 5\u0026#39;s Michael, Franklin, and Trevor is visible in the background.\" width=\"414\" height=\"233\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eEurogamer\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nGrand Theft Auto and Borderlands publisher \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/companies/take-two-interactive\"\u003eTake-Two Interactive\u003c/a\u003e is suing PlayerAuctions - an online marketplace already targeted in a complaint by Roblox - accusing it of selling \u0026#34;heavily modified\u0026#34; player accounts, items, and virtual currency obtained through hacks and cheats.\n\u003c/p\u003e\n\u003cp\u003e\nTake-Two\u0026#39;s lawsuit - filed in the US Central District Court of California last week and \u003ca href=\"https://www.polygon.com/gaming/536315/take-two-gta-5-online-black-market-lawsuit\"\u003espotted by Polygon\u003c/a\u003e - targets PlayerAuctions\u0026#39; Chinese owner Paiao Network Technology. It accuses the company of running a \u0026#34;lawless enterprise\u0026#34;, claiming it has \u0026#34;full knowledge\u0026#34; of the alleged \u0026#34;rampant infringement and other unauthorised conduct\u0026#34; happening on its site.\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;[This] is not a regular online marketplace,\u0026#34; reads the \u003ca href=\"https://www.scribd.com/document/836607989/Take-Two-PlayerAuctions-lawsuit-via-Polygon\"\u003efiling\u003c/a\u003e. \u0026#34;Instead, [it] runs a sophisticated sales platform and actively recruits \u0026#39;sellers\u0026#39; skilled at using hacking software and other exploits to create infringing digital goods and to provide illegal \u0026#39;services\u0026#39; to players of \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/grand-theft-auto-v\"\u003eGTA 5\u003c/a\u003e.\u0026#34; More specifically, Take-Two claims PlayerAuctions contains \u0026#34;thousands of listings for unauthorised, infringing GTA 5 content – including heavily modified player accounts, in-game assets, and virtual currency – all gained by using hacking software, cheats, and technical exploits.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nTake-Two claims PlayerAuctions sells accounts manipulated through hacking to provide \u0026#34;exorbitantly high game level ranking and in-game currency amounts\u0026#34;, as well as content ordinarily only accessible through gameplay or purchases. \u0026#34;At the scale of its website,\u0026#34; continues the lawsuit, \u0026#34;PlayerAuctions risks upending the GTA 5 player experience and interferes with the balance and fairness of the game.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nTake-Two claims it has \u0026#34;repeatedly confronted PlayerAuctions with evidence of infringement and other tortious conduct\u0026#34;, but says its cease and desist orders have so far been ignored - all while Paiao Network Technology allegedly continues to reap \u0026#34;millions in revenue\u0026#34; from infringement. Take-Two says it\u0026#39;s bringing its complaint to the court in order to \u0026#34;shut down PlayerAuctions\u0026#39; rampant infringing online marketplace, end its corrupt business model, and protect the integrity of GTA 5 for its players.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nTake-Two is claiming relief for copyright and trademark infringement, and is requesting the court \u0026#34;preliminarily and permanently\u0026#34; prohibits PlayerAuctions from selling accounts, virtual goods, and virtual currency in GTA 5 or any of its other games. Additionally, Take-Two wants PlayerAuctions to be prohibited from \u0026#34;aiding, abetting, contributing to, or otherwise assisting, benefiting or inducing\u0026#34; hacking of its software or infringing its GTA trademarks.\n\u003c/p\u003e\n\u003cp\u003e\nTake-Two\u0026#39;s lawsuit follows a \u003ca href=\"https://www.scribd.com/document/824845348/Roblox-vs-PlayerAuctions-via-Polygon\"\u003esimilar filing against PlayerAuctions by Roblox Corporation last month\u003c/a\u003e. The company is also seeking monetary damages, as well as requesting the court prevents PlayerAuctions from buying, selling, and trading Roblox-related products.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-12T00:24:12.857516Z",
  "modifiedTime": null
}
