{
  "id": "f0932947-ddd3-4233-89ea-699c5cb9d477",
  "title": "New trailer for Mass Effect wannabe Exodus features space-capable flesh cathedral whisperingly described by Matthew McConaughey",
  "link": "https://www.rockpapershotgun.com/new-trailer-for-mass-effect-wannabe-exodus-features-space-capable-flesh-cathedral-whisperingly-described-by-matthew-mcconaughey",
  "description": "Archetype Entertainment and Blur Studio's space RPG Exodus was announced back in December, and was broadly notable for a couple of things: 1) Matthew McConaughey plays a character, and 2) the game's story is woven around time dilation during faster than light travel, with star-hopping adventurers prosecuting a fight against evil Celestials over hundreds, perhaps thousands of years. Now, it is notable for three things, the third thing being a cosmic blubber-spire of gurning faces who want to eat your ship and soul. Say hello to the Mara Yama, the ickiest Celestial faction so far. Here's a trailer, in which McConaughey does that thing where he lingers on the sibilants and makes you want to lean in and vigorously mess up his hair. Read more",
  "author": "Edwin Evans-Thirlwell",
  "published": "Wed, 16 Oct 2024 16:45:15 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Exodus",
    "Single Player",
    "RPG",
    "Action Adventure",
    "Indie"
  ],
  "byline": "Edwin Evans-Thirlwell",
  "length": 2243,
  "excerpt": "Archetype Entertainment and Blur Studio's space RPG Exodus was announced back in December, and was broadly notable for …",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/1596d464cacd6e8029beb74daf67b268/icon/apple-touch-icon.png",
  "text": "Every sci-fi RPG needs its body horror Borg equivalent Image credit: Archetype Entertainment Archetype Entertainment and Blur Studio's space RPG Exodus was announced back in December, and was broadly notable for a couple of things: 1) Matthew McConaughey plays a character, and 2) the game's story is woven around time dilation during faster than light travel, with star-hopping adventurers prosecuting a fight against evil Celestials over hundreds, perhaps thousands of years. Now, it is notable for three things, the third thing being a cosmic blubber-spire of gurning faces who want to eat your ship and soul. Say hello to the Mara Yama, the ickiest Celestial faction so far. Here's a trailer, in which McConaughey does that thing where he lingers on the sibilants and makes you want to lean in and vigorously mess up his hair. NEW EXODUS CINEMATIC — 'The Mara-Yama' Reveal Trailer Watch on YouTube And here's some blurb: The Mara-Yama, horrifying Celestials, twisted into monstrous forms, are unlike anything humanity has ever faced in the battle for survival. The Mara-Yama feed on fear, delight in cruelty, and revel in the agony of their prey. They aren't just hunters - they are sadistic predators who savor every moment of psychological torment they inflict. Stalking the deepest shadows of the Centauri Cluster, the Mara-Yama strike without warning, targeting the isolated and unsuspecting. But they're after more than cargo - they harvest minds, memories, and even emotions, leaving survivors forever haunted by the terror that hides between the stars. Few escape their grip, but those who do know the frightening truth that lurks out there in the void. We've yet to see any in-game footage of Exodus. While there's definitely room for a new sci-fi yarn in the Shepard vein at the minute, I hope it's not too much like Mass Effect, and is able to do something fiddly and fancy with time dilation in particular. Signing up McConaughey must have cost a pretty penny - it'd be a shame if the Interstellar connection turned out to be purely a question of cutscenes. You can read more about what time dilation in Exodus involves here.",
  "image": "https://assetsio.gnwcdn.com/marayama.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \n\n    \u003cdiv\u003e\n  \n\n        \u003cp\u003eEvery sci-fi RPG needs its body horror Borg equivalent\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/marayama.jpg?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/marayama.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/marayama.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/marayama.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A ship being eaten by a horrible space monster in Exodus\" width=\"382\" height=\"215\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eArchetype Entertainment\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv\u003e\n\n\n\n            \u003cp\u003eArchetype Entertainment and Blur Studio\u0026#39;s space \u003ca href=\"https://www.rockpapershotgun.com/best-rpgs\"\u003eRPG\u003c/a\u003e \u003ca href=\"https://www.rockpapershotgun.com/games/exodus\"\u003eExodus\u003c/a\u003e was \u003ca href=\"https://www.rockpapershotgun.com/ex-bioware-devs-reveal-exodus-a-sci-fi-rpg-shooter-about-time-dilation-featuring-matthew-mcconaughey\"\u003eannounced back in December\u003c/a\u003e, and was broadly notable for a couple of things: 1) Matthew McConaughey plays a character, and 2) the game\u0026#39;s story is woven around time dilation during faster than light travel, with star-hopping adventurers prosecuting a fight against evil Celestials over hundreds, perhaps thousands of years.\u003c/p\u003e\n\u003cp\u003eNow, it is notable for three things, the third thing being a cosmic blubber-spire of gurning faces who want to eat your ship and soul. Say hello to the Mara Yama, the ickiest Celestial faction so far. Here\u0026#39;s a trailer, in which McConaughey does that thing where he lingers on the sibilants and makes you want to lean in and vigorously mess up his hair.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"NEW EXODUS CINEMATIC — \u0026#39;The Mara-Yama\u0026#39; Reveal Trailer\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/ytz156surXg?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/ytz156surXg/hqdefault.jpg\"/\u003e\u003cspan\u003eNEW EXODUS CINEMATIC — \u0026#39;The Mara-Yama\u0026#39; Reveal Trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/ytz156surXg?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/ytz156surXg?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003ca href=\"https://www.youtube.com/watch?v=ytz156surXg\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figure\u003e\n\u003cp\u003eAnd here\u0026#39;s some blurb:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eThe Mara-Yama, horrifying Celestials, twisted into monstrous forms, are unlike anything humanity has ever faced in the battle for survival. The Mara-Yama feed on fear, delight in cruelty, and revel in the agony of their prey. They aren\u0026#39;t just hunters - they are sadistic predators who savor every moment of psychological torment they inflict.\u003c/p\u003e\n\u003cp\u003eStalking the deepest shadows of the Centauri Cluster, the Mara-Yama strike without warning, targeting the isolated and unsuspecting. But they\u0026#39;re after more than cargo - they harvest minds, memories, and even emotions, leaving survivors forever haunted by the terror that hides between the stars. Few escape their grip, but those who do know the frightening truth that lurks out there in the void.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eWe\u0026#39;ve yet to see any in-game footage of Exodus. While there\u0026#39;s definitely room for a new sci-fi yarn in the Shepard vein at the minute, I hope it\u0026#39;s not \u003cem\u003etoo\u003c/em\u003e much like Mass Effect, and is able to do something fiddly and fancy with time dilation in particular. Signing up McConaughey must have cost a pretty penny - it\u0026#39;d be a shame if the Interstellar connection turned out to be purely a question of cutscenes. You can read more about what time dilation in Exodus involves \u003ca href=\"https://www.rockpapershotgun.com/how-does-time-dilation-set-exodus-apart-from-mass-effect-it-supersizes-all-of-the-choices-that-you-make\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-16T16:45:15.214036Z",
  "modifiedTime": null
}
