{
  "id": "f83f0047-e571-469c-b7aa-88b0d6e87efe",
  "title": "Avowed Director Explains Why The Game Has No Romance Options",
  "link": "https://www.gamespot.com/articles/avowed-director-explains-why-the-game-has-no-romance-options/1100-6529634/?ftag=CAD-01-10abi2f",
  "description": "The option to romance NPC characters in RPGs has been around for a long time, and even recent titles like Kingdom Come: Deliverance 2 offer that feature to players. However, Avowed is bucking that trend by almost completely removing players' ability to court their companions. According to Avowed director Carrie Patel, she made the decision to downplay romance because she felt it takes away from the experience of playing the game.While appearing on IGN's Unlocked podcast, Patel revealed that she believes the romantic options in RPGs \"undermine that core experience\" and practically invite players to focus more on the romance than on the story or even the characters themselves. Instead, Patel favored a more natural form of bonding with the player's companions that doesn't end with two characters in bed.\"My hope with players and their companion relationships in Avowed is that they would feel natural, and players would get out of them exactly what they want and exactly as much as they put in,\" said Patel. She added that it was supposed to be like \"you're getting to know some new friends.\"Continue Reading at GameSpot",
  "author": "",
  "published": "Thu, 20 Feb 2025 16:57:00 -0800",
  "source": "https://www.gamespot.com/feeds/mashup/",
  "categories": [
    ""
  ],
  "byline": "Blair Marnell",
  "length": 2384,
  "excerpt": "Carrie Patel, the director of Avowed, reveals why the game doesn't offer the romantic entanglements found in other titles.",
  "siteName": "GameSpot",
  "favicon": "https://www.gamespot.com/a/bundles/gamespotsite/images/touch-icon-ipad-retina-precomposed.png",
  "text": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links. The option to romance NPC characters in RPGs has been around for a long time, and even recent titles like Kingdom Come: Deliverance 2 offer that feature to players. However, Avowed is bucking that trend by almost completely removing players' ability to court their companions. According to Avowed director Carrie Patel, she made the decision to downplay romance because she felt it takes away from the experience of playing the game.While appearing on IGN's Unlocked podcast, Patel revealed that she believes the romantic options in RPGs \"undermine that core experience\" and practically invite players to focus more on the romance than on the story or even the characters themselves. Instead, Patel favored a more natural form of bonding with the player's companions that doesn't end with two characters in bed.\"My hope with players and their companion relationships in Avowed is that they would feel natural, and players would get out of them exactly what they want and exactly as much as they put in,\" said Patel. She added that it was supposed to be like \"you're getting to know some new friends.\"That decision may make Avowed an outlier in the genre, especially since Baldur's Gate 3 had so many romantic options to choose from. Thus far, Xbox Game Studios and Obsidian Entertainment haven't announced how many copies Avowed has sold since its release on February 18. The game received a day-one patch earlier this week to address some of the issues found in it. The developers have previously explained why Avowed isn't an open-world game, but fortunately there is still a lot of territory that can be explored.Avowed is available on Game Pass Ultimate and PC Game Pass, and subscribers to those services have an option to upgrade to the premium version at a greatly reduced cost. There are currently no available deals GameSpot may get a commission from retail offers. Got a news tip or want to contact us directly? Email news@gamespot.com",
  "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1837/18375603/4447414-avowed.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n    \u003cspan data-nosnippet=\"\"\u003eGameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\u003c/span\u003e\n  \u003c/p\u003e\u003carticle itemscope=\"\" data-type-id=\"1100\" data-guid=\"1100-6529634\"\u003e\n\n            \n            \n  \n\n\n    \n\n\n        \n        \n              \u003csection\u003e\n\n                  \n          \u003cdiv data-content-element-selector=\"p, .js-buylink-item-container\" data-allowed-classes-selector=\"js-buylink-item-container\" data-in-content-placements=\"[{\u0026#34;adType\u0026#34;:\u0026#34;mobile-incontent-plus\u0026#34;,\u0026#34;placements\u0026#34;:[{\u0026#34;placeIndex\u0026#34;:1,\u0026#34;minElements\u0026#34;:2},{\u0026#34;placeIndex\u0026#34;:4,\u0026#34;minElements\u0026#34;:5}]},{\u0026#34;adType\u0026#34;:\u0026#34;mobile-banner-plus\u0026#34;,\u0026#34;placements\u0026#34;:[{\u0026#34;placeIndex\u0026#34;:7,\u0026#34;minElements\u0026#34;:8},{\u0026#34;placeIndex\u0026#34;:10,\u0026#34;minElements\u0026#34;:11},{\u0026#34;placeIndex\u0026#34;:13,\u0026#34;minElements\u0026#34;:14}]}]\"\u003e\n                \u003cp\u003eThe option to romance NPC characters in RPGs has been around for a long time, and even recent titles like \u003ca href=\"https://www.gamespot.com/reviews/kingdom-come-deliverance-2-review-whats-old-is-new-again/1900-6418333/\" data-ref-id=\"1900-6418333\"\u003eKingdom Come: Deliverance 2\u003c/a\u003e offer that feature to players. However, \u003ca href=\"https://www.gamespot.com/reviews/avowed-review-too-close-to-the-sun/1900-6418335/\" data-ref-id=\"1900-6418335\"\u003eAvowed\u003c/a\u003e is bucking that trend by almost completely removing players\u0026#39; ability to court their companions. According to Avowed director Carrie Patel, she made the decision to downplay romance because she felt it takes away from the experience of playing the game.\u003c/p\u003e\u003cp\u003eWhile appearing on IGN\u0026#39;s \u003ca href=\"https://www.youtube.com/watch?v=FB9qwiskL18\u0026amp;list=PL99PCYdTX-vcBZW5aQAHlTHZr08eO4Vnj\u0026amp;index=1\u0026amp;pp=iAQB\" data-target=\"true\" target=\"_blank\" rel=\"noopener\"\u003eUnlocked\u003c/a\u003e podcast, Patel revealed that she believes the romantic options in RPGs \u0026#34;undermine that core experience\u0026#34; and practically invite players to focus more on the romance than on the story or even the characters themselves. Instead, Patel favored a more natural form of bonding with the player\u0026#39;s companions that doesn\u0026#39;t end with two characters in bed.\u003c/p\u003e\u003cp\u003e\u0026#34;My hope with players and their companion relationships in Avowed is that they would feel natural, and players would get out of them exactly what they want and exactly as much as they put in,\u0026#34; said Patel. She added that it was supposed to be like \u0026#34;you\u0026#39;re getting to know some new friends.\u0026#34;\u003c/p\u003e\u003cp\u003eThat decision may make Avowed an outlier in the genre, especially since \u003ca href=\"https://www.gamespot.com/reviews/baldurs-gate-3-review-let-freedom-reign/1900-6418131/\" data-ref-id=\"1900-6418131\"\u003eBaldur\u0026#39;s Gate 3\u003c/a\u003e had so many romantic options to choose from. Thus far, Xbox Game Studios and Obsidian Entertainment haven\u0026#39;t announced how many copies Avowed has sold since its release on February 18. The game received \u003ca href=\"https://www.gamespot.com/articles/avowed-companions-wont-nag-you-as-much-about-getting-better-armor-after-day-one-patch/1100-6529570/\" data-ref-id=\"1100-6529570\"\u003ea day-one patch earlier this week\u003c/a\u003e to address some of the issues found in it. The developers have previously explained why Avowed \u003ca href=\"https://www.gamespot.com/articles/avowed-not-being-open-world-is-a-good-thing-devs-say/1100-6529022/\" data-ref-id=\"1100-6529022\"\u003eisn\u0026#39;t an open-world game\u003c/a\u003e, but fortunately there is still \u003ca href=\"https://www.gamespot.com/articles/avowed-is-full-of-discoveries-and-the-freedom-to-find-them-or-not/1100-6527918/\" data-ref-id=\"1100-6527918\"\u003ea lot of territory that can be explored\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAvowed is available on Game Pass Ultimate and PC Game Pass, and subscribers to those services \u003ca href=\"https://www.gamespot.com/articles/game-pass-members-can-upgrade-to-avoweds-90-premium-edition-for-a-fraction-of-the-price/1100-6529257/\" data-ref-id=\"1100-6529257\"\u003ehave an option to upgrade to the premium version\u003c/a\u003e at a greatly reduced cost.\u003c/p\u003e\n  \n                        \n        \n    \n    \n                                  \u003c/div\u003e\n\n          \n        \n  \n  \n                    \n  \n        \u003cdiv data-merchant-service-api-link=\"https://www.gamespot.com/merchantapi/offer/?gameid=516154\"\u003e\u003cdiv\u003e\u003cp\u003e\n      There are currently no available deals\n    \u003c/p\u003e\u003c/div\u003e\u003cp\u003eGameSpot may get a commission from retail offers.\u003c/p\u003e\u003c/div\u003e  \n          \n            \n  \u003cdiv\u003e\n    \u003cp\u003e\u003ci\u003eGot a news tip or want to contact us directly? Email \u003ca href=\"mailto:news@gamespot.com?subject=Hi GameSpot! I have a news tip for you!\"\u003enews@gamespot.com\u003c/a\u003e\u003c/i\u003e\u003c/p\u003e\n\n    \n      \u003c/div\u003e\n        \n      \u003c/section\u003e\n    \n            \n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-20T16:57:37Z",
  "modifiedTime": null
}
