{
  "id": "fdaaae11-21a9-466c-9a7b-eede88c34a4b",
  "title": "Nosferatu Is a Reminder That Hollywood Has Never Made a Great Version of Bram Stoker’s Book",
  "link": "https://www.ign.com/articles/nosferatu-is-a-reminder-that-hollywood-has-never-made-a-great-version-of-bram-stokers-book",
  "description": "Nosferatu is the latest reminder that Hollywood has never cracked the code on adapting Bram Stoker’s Dracula novel.",
  "author": "Scott Collura",
  "published": "Wed, 25 Dec 2024 16:00:00 +0000",
  "source": "http://feeds.ign.com/ign/all",
  "categories": null,
  "byline": "Carlos Morales",
  "length": 10096,
  "excerpt": "Nosferatu is the latest reminder that Hollywood has never cracked the code on adapting Bram Stoker’s Dracula novel.",
  "siteName": "IGN",
  "favicon": "",
  "text": "Why the classic novel still hasn’t been cracked on film.Warning: This piece contains spoilers for Nosferatu.Get your Gothic garb on and hold your crucifix close, because Nosferatu is now arriving in theaters. The Robert Eggers-directed remake of the classic 1922 film has been a long time coming, having first been announced all the way back in 2015. Clearly a passion project for the auteur filmmaker, it’s dropping into theaters nationwide on Christmas Day to largely stellar reviews, including a 9/10 rave from IGN.However, despite all the praise for the film’s performances, cinematography, and period set design, Nosferatu continues the tradition of adaptations and reworkings of the original Dracula novel messing up significant elements of the source material. This problem is so endemic that certain aspects of the book have been completely overwritten in the popular imagination by adaptational changes being echoed in version after version over the decades.So today, let’s take a look at what those changes are, and why the original novel still doesn’t have a definitive film adaptation.An Ancient EvilTo ensure everyone’s on the same page, let’s start with a brief refresher: Dracula, by Irish author Bram Stoker, is a Gothic horror novel published in 1897. The book is written in epistolary format, meaning that the text takes the form of notes, letters and documents written in-universe by characters in the story. There’s little argument among literary scholars that it’s not the most well-known and influential work of vampire fiction ever written, with Dracula himself becoming one of the most recognizable characters in popular culture. But despite that, much of the context around the novel’s actual plot and characters has been obscured in the popular consciousness because of how its adaptations have warped the common perceptions of them, and this began with the earliest film and stage productions.Much of the context around the novel’s actual plot/characters has been obscured in the popular consciousness because of how its adaptations have warped perceptions of them.The original Nosferatu, an unlicensed German film adaptation from director F. W. Murnau in 1922, condensed and reimagined much of the plot and characters. The film moved the action from England to Germany and renamed everyone in the cast, with the most famous example being turning Count Dracula into Count Orlok. This was mostly a failed attempt to avoid copyright infringement lawsuits. The 1924 Dracula play written by Hamilton Deane (and revised into its more well-known version in 1927 by John L. Balderston) likewise condensed the plot and cast, removing all the sections outside of England and merging Mina Harker and Lucy Westenra into one character named Lucy Seward in Balderston’s iteration. The play served as the basis for Universal’s 1931 film directed by Tod Browning, starring Bela Legosi as Dracula, a role he had previously played on stage.Some of the most prominent deviations from the source material that became the default started in these early adaptations. Vampires dying in sunlight? Not in the book. Dracula is merely weakened by sunlight, but he can walk around in it just fine. The 1922 movie introduced the idea of vampires being killed by the sun. Dracula being a suave aristocrat who charms his victims? First introduced in the 1924 play. In the book he starts off decrepit and repulsive, and later morphs into a less monstrous form but still isn’t considered handsome or charismatic. Van Helsing being a vampire expert? Not until the 1931 film. In the novel, Van Helsing is merely an eccentric professor who’s studied the occult, and he’s never encountered vampires before. But most versions now depict Van Helsing as Dracula’s nemesis and a seasoned warrior against the supernatural, when he’s really just guessing his way through it in the book.Hell, Dracula isn’t even staked in the book. He’s decapitated and stabbed in the heart with a knife. But those are details. If you want to see where Dracula adaptations have truly erred, it’s in the depiction of the book’s two primary female characters: Mina Harker and Lucy Westenra.Robert Eggers' Nosferatu Trailer Stills19th Century WomenAs a story, Dracula has always been more of an ensemble piece, but if there’s one character who deserves to be called the protagonist of the book, it’s Mina Harker. She doesn’t appear for the first few chapters, but once she enters the narrative she becomes the most pivotal figure in the war against Dracula because of her intelligence, composure, and loyalty to her friends and loved ones. She doesn’t physically fight Dracula, but she’s instrumental to his defeat by assembling the letters and documents making up the text of the book, providing the research material the heroes need to figure out Dracula’s weaknesses. She helps everyone with their personal crises as they struggle to psychologically endure the situation. And although she is attacked and mind-controlled by the Count, she turns their psychic connection against him through force of will and reveals his location to her comrades, an act that directly leads to Dracula’s demise.Sadly, this version of Mina simply does not exist in adaptations. She often either has her role reduced, is merged or swapped with her best friend Lucy, or is altered into a helpless (or worse, willing) victim. That last one is what happens in Francis Ford Coppola’s 1992 film, where Winona Ryder plays Mina. This version is a complete betrayal of the original character because instead of being defined by her intellect and moral fortitude, she’s a brainless damsel who falls in love with the Count because she’s apparently the reincarnation of his long lost wife. What makes this especially egregious is that in the book, Dracula forces Mina to drink his blood against her will in an unmistakable metaphor for sexual assault. This means the movie takes a character who is for all intents and purposes raped by Dracula and has her lovingly fawn over him. It’s utterly reprehensible and totally misses the point of who Mina is.Lucy Westenra receives similar treatment. In the book she’s defined by her innate goodness, a pure soul who is tragically destroyed by Dracula and turned into a vampire, forcing the three men who love her to help hunt her down and destroy her. In Coppola’s film, she’s reimagined as a shameless flirt who plays her suitors against each other and constantly talks in sexual innuendos. By portraying Lucy in this way, her sexuality becomes something she winds up being punished for, which she is by getting turned into a monster that must be put down. Like with Mina, it’s a complete misunderstanding of the character’s original context and what role they’re meant to play in the story’s thematic framework. It’s also just bizarre to see female characters from a book published in the 1890s be less regressive than their counterparts in film adaptations released a century later. Sadly, the new take on Nosferatu doesn’t do much to change this.Symphony of the LightThe new Nosferatu begins with our Mina analogue Ellen Hutter (Lily-Rose Depp) calling out into the night, only to be answered by Count Orlok (Bill Skarsgård). The thorny and unsettling connection between the two forms the backbone of the narrative, with the movie’s most interesting idea being that Ellen isn’t completely turned off by how monstrous and disgusting this version of the character can be. From there, the film follows much of the basic plot outline of the novel, albeit with the character names from the 1922 film used instead. However, like with Coppola’s film, Ellen/Mina’s character traits aren’t kept. She mostly screams and cries through the film rather than keeping her wits about her, and she clearly betrays her husband Thomas (Nicholas Hoult) through her desire for Orlok instead of being loyal like in the book.25 Best Vampire Movies of All TimeThe movie tries to get around this by having Ellen be the character who “defeats” Orlok, but the way it’s done saps the choice of its power. Ellen sacrifices herself by inviting Orlok into her room and allowing him to feed on her, keeping him in place long enough for the sun to rise and kill him. However, the movie never shows her (or anyone else, for that matter) learning that sunlight will kill Orlok; it’s something the movie assumes everyone knows because of how prominent that weakness is in popular culture. Nor does Ellen forcefully hold Orlok down when sunlight pours through the windows to ensure she finishes the job, she just gently caresses him. Orlok’s death happening this way also just makes him seem dumb. Did he not know the sun was rising? The questions about how this ending plays out prevent it from functioning as a meaningful subversion of previous Mina adaptations. It also results in Ellen’s death, meaning she, like Coppola’s Lucy before her, is being punished for her sexuality because she unwittingly unleashed Orlok on everyone by indulging her desires.To be fair to Eggers, it’s clear his interest was more in remaking Murnau’s film than adapting Stoker’s book, but that no other filmmaker over the years has done the latter well feels like a missed opportunity. We haven’t even touched on how Terence Fisher’s 1958 film starring Christopher Lee screws over Jonathan Harker, how John Badham’s 1979 film starring Frank Langella once again cuts all the scenes outside of England, or how last year’s The Last Voyage of the Demeter from director André Øvredal takes a great idea in adapting the boat chapter as a full film and ruins it by portraying Dracula as a generic slasher monster with almost no dialogue. It’s beyond absurd how many times this story has been adapted to stage and screen without any of the major works really getting the source material. Perhaps someday we’ll see a great version of Stoker’s text, but for now, that dream is as illusory as the mist Dracula can transform into.Carlos Morales writes novels, articles and Mass Effect essays. You can follow his fixations on Bluesky.In This ArticleNot yet available for streaming.",
  "image": "https://assets-prd.ignimgs.com/2024/12/20/nosferatu-thumb-1734722478690.jpg?width=1280",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-cy=\"page-header\"\u003e\u003ch2 data-cy=\"article-sub-headline\"\u003eWhy the classic novel still hasn’t been cracked on film.\u003c/h2\u003e\u003c/div\u003e\u003csection data-cy=\"article-content\"\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cstrong\u003eWarning: This piece contains spoilers for Nosferatu.\u003c/strong\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eGet your Gothic garb on and hold your crucifix close, because \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/movies/nosferatu\"\u003e\u003cu\u003eNosferatu\u003c/u\u003e\u003c/a\u003e is now arriving in theaters. The Robert Eggers-directed remake of the classic 1922 film has been a long time coming, having first been announced \u003ca href=\"https://deadline.com/2015/07/nosferatu-the-witch-robert-eggers-studio-8-1201486438/\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003eall the way back\u003c/u\u003e\u003c/a\u003e in 2015. Clearly a passion project for the auteur filmmaker, it’s dropping into theaters nationwide on Christmas Day to largely \u003ca href=\"https://www.rottentomatoes.com/m/nosferatu_2024\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003estellar reviews\u003c/u\u003e\u003c/a\u003e, including a \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/nosferatu-review\"\u003e\u003cu\u003e9/10 rave\u003c/u\u003e\u003c/a\u003e from IGN.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eHowever, despite all the praise for the film’s performances, cinematography, and period set design, Nosferatu continues the tradition of adaptations and reworkings of the original Dracula novel messing up significant elements of the source material. This problem is so endemic that certain aspects of the book have been completely overwritten in the popular imagination by adaptational changes being echoed in version after version over the decades.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eSo today, let’s take a look at what those changes are, and why the original novel still doesn’t have a definitive film adaptation.\u003c/p\u003e\u003coutput data-cy=\"article-video\"\u003e\u003c/output\u003e\u003ch2 data-cy=\"title2\"\u003e\u003cstrong\u003eAn Ancient Evil\u003c/strong\u003e\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eTo ensure everyone’s on the same page, let’s start with a brief refresher: Dracula, by Irish author Bram Stoker, is a Gothic horror novel published in 1897. The book is written in epistolary format, meaning that the text takes the form of notes, letters and documents written in-universe by characters in the story. There’s little argument among literary scholars that it’s not the most well-known and influential work of vampire fiction ever written, with Dracula himself becoming one of the most recognizable characters in popular culture. But despite that, much of the context around the novel’s actual plot and characters has been obscured in the popular consciousness because of how its adaptations have warped the common perceptions of them, and this began with the earliest film and stage productions.\u003c/p\u003e\u003cdiv data-cy=\"quoteBox\"\u003e\u003cp\u003eMuch of the context around the novel’s actual plot/characters has been obscured in the popular consciousness because of how its adaptations have warped perceptions of them.\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eThe original Nosferatu, an unlicensed German film adaptation from director F. W. Murnau in 1922, condensed and reimagined much of the plot and characters. The film moved the action from England to Germany and renamed everyone in the cast, with the most famous example being turning Count Dracula into Count Orlok. This was mostly a failed attempt to avoid copyright infringement lawsuits. The 1924 Dracula play written by Hamilton Deane (and revised into its more well-known version in 1927 by John L. Balderston) likewise condensed the plot and cast, removing all the sections outside of England and merging Mina Harker and Lucy Westenra into one character named Lucy Seward in Balderston’s iteration. The play served as the basis for Universal’s 1931 film directed by Tod Browning, starring Bela Legosi as Dracula, a role he had previously played on stage.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eSome of the most prominent deviations from the source material that became the default started in these early adaptations. Vampires dying in sunlight? Not in the book. Dracula is merely \u003cem\u003eweakened\u003c/em\u003e by sunlight, but he can walk around in it just fine. The 1922 movie introduced the idea of vampires being killed by the sun. Dracula being a suave aristocrat who charms his victims? First introduced in the 1924 play. In the book he starts off decrepit and repulsive, and later morphs into a less monstrous form but still isn’t considered handsome or charismatic. Van Helsing being a vampire expert? Not until the 1931 film. In the novel, Van Helsing is merely an eccentric professor who’s studied the occult, and he’s never encountered vampires before. But most versions now depict Van Helsing as Dracula’s nemesis and a seasoned warrior against the supernatural, when he’s really just guessing his way through it in the book.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eHell, Dracula isn’t even \u003cem\u003estaked \u003c/em\u003ein the book. He’s decapitated and stabbed in the heart with a knife. But those are details. If you want to see where Dracula adaptations have truly erred, it’s in the depiction of the book’s two primary female characters: Mina Harker and Lucy Westenra.\u003c/p\u003e\u003coutput data-cy=\"article-slideshow\"\u003e\u003cdiv data-cy=\"slideshow-view-trigger\"\u003e\u003ch3 data-cy=\"slideshow-preview-title\"\u003eRobert Eggers\u0026#39; Nosferatu Trailer Stills\u003c/h3\u003e\u003c/div\u003e\u003c/output\u003e\u003ch2 data-cy=\"title2\"\u003e\u003cstrong\u003e19th Century Women\u003c/strong\u003e\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eAs a story, Dracula has always been more of an ensemble piece, but if there’s one character who deserves to be called the protagonist of the book, it’s Mina Harker. She doesn’t appear for the first few chapters, but once she enters the narrative she becomes the most pivotal figure in the war against Dracula because of her intelligence, composure, and loyalty to her friends and loved ones. She doesn’t physically fight Dracula, but she’s instrumental to his defeat by assembling the letters and documents making up the text of the book, providing the research material the heroes need to figure out Dracula’s weaknesses. She helps everyone with their personal crises as they struggle to psychologically endure the situation. And although she is attacked and mind-controlled by the Count, she turns their psychic connection against him through force of will and reveals his location to her comrades, an act that directly leads to Dracula’s demise.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eSadly, this version of Mina simply does not exist in adaptations. She often either has her role reduced, is merged or swapped with her best friend Lucy, or is altered into a helpless (or worse, willing) victim. That last one is what happens in Francis Ford Coppola’s 1992 film, where Winona Ryder plays Mina. This version is a complete betrayal of the original character because instead of being defined by her intellect and moral fortitude, she’s a brainless damsel who falls in love with the Count because she’s apparently the reincarnation of his long lost wife. What makes this especially egregious is that in the book, Dracula forces Mina to drink his blood against her will in an unmistakable metaphor for sexual assault. This means the movie takes a character who is for all intents and purposes raped by Dracula and has her lovingly fawn over him. It’s utterly reprehensible and totally misses the point of who Mina is.\u003c/p\u003e\u003coutput data-cy=\"article-video\"\u003e\u003c/output\u003e\u003cp data-cy=\"paragraph\"\u003eLucy Westenra receives similar treatment. In the book she’s defined by her innate goodness, a pure soul who is tragically destroyed by Dracula and turned into a vampire, forcing the three men who love her to help hunt her down and destroy her. In Coppola’s film, she’s reimagined as a shameless flirt who plays her suitors against each other and constantly talks in sexual innuendos. By portraying Lucy in this way, her sexuality becomes something she winds up being punished for, which she is by getting turned into a monster that must be put down. Like with Mina, it’s a complete misunderstanding of the character’s original context and what role they’re meant to play in the story’s thematic framework. It’s also just bizarre to see female characters from a book published in the 1890s be less regressive than their counterparts in film adaptations released a century later. Sadly, the new take on Nosferatu doesn’t do much to change this.\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003e\u003cstrong\u003eSymphony of the Light\u003c/strong\u003e\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eThe new Nosferatu begins with our Mina analogue Ellen Hutter (Lily-Rose Depp) calling out into the night, only to be answered by Count Orlok (Bill Skarsgård). The thorny and unsettling connection between the two forms the backbone of the narrative, with the movie’s most interesting idea being that Ellen isn’t completely turned off by how monstrous and disgusting this version of the character can be. From there, the film follows much of the basic plot outline of the novel, albeit with the character names from the 1922 film used instead. However, like with Coppola’s film, Ellen/Mina’s character traits aren’t kept. She mostly screams and cries through the film rather than keeping her wits about her, and she clearly betrays her husband Thomas (Nicholas Hoult) through her desire for Orlok instead of being loyal like in the book.\u003c/p\u003e\u003coutput data-cy=\"article-slideshow\"\u003e\u003cdiv data-cy=\"slideshow-view-trigger\"\u003e\u003ch3 data-cy=\"slideshow-preview-title\"\u003e25 Best Vampire Movies of All Time\u003c/h3\u003e\u003c/div\u003e\u003c/output\u003e\u003cp data-cy=\"paragraph\"\u003eThe movie tries to get around this by having Ellen be the character who “defeats” Orlok, but the way it’s done saps the choice of its power. Ellen sacrifices herself by inviting Orlok into her room and allowing him to feed on her, keeping him in place long enough for the sun to rise and kill him. However, the movie never shows her (or anyone else, for that matter) learning that sunlight will kill Orlok; it’s something the movie assumes everyone knows because of how prominent that weakness is in popular culture. Nor does Ellen forcefully hold Orlok down when sunlight pours through the windows to ensure she finishes the job, she just gently caresses him. Orlok’s death happening this way also just makes him seem dumb. Did he not know the sun was rising? The questions about how this ending plays out prevent it from functioning as a meaningful subversion of previous Mina adaptations. It also results in Ellen’s death, meaning she, like Coppola’s Lucy before her, is being punished for her sexuality because she unwittingly unleashed Orlok on everyone by indulging her desires.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eTo be fair to Eggers, it’s clear his interest was more in remaking Murnau’s film than adapting Stoker’s book, but that no other filmmaker over the years has done the latter well feels like a missed opportunity. We haven’t even touched on how Terence Fisher’s 1958 film starring Christopher Lee screws over Jonathan Harker, how John Badham’s 1979 film starring Frank Langella once again cuts all the scenes outside of England, or how last year’s The Last Voyage of the Demeter from director André Øvredal takes a great idea in adapting the boat chapter as a full film and ruins it by portraying Dracula as a generic slasher monster with almost no dialogue. It’s beyond absurd how many times this story has been adapted to stage and screen without any of the major works really \u003cem\u003egetting \u003c/em\u003ethe source material. Perhaps someday we’ll see a great version of Stoker’s text, but for now, that dream is as illusory as the mist Dracula can transform into.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cem\u003eCarlos Morales writes novels, articles and Mass Effect essays. You can follow his fixations on \u003c/em\u003e\u003ca href=\"https://bsky.app/profile/carlosalonzom.bsky.social\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003e\u003cem\u003eBluesky\u003c/em\u003e\u003c/u\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\u003c/section\u003e\u003cdiv\u003e\u003ch3 data-cy=\"object-summary-embed-title\"\u003eIn This Article\u003c/h3\u003e\u003cdiv data-cy=\"objectcard-view-trigger\"\u003e\u003cdiv data-cy=\"object-thumbnail\"\u003e\u003cfigure\u003e\u003cimg decoding=\"async\" alt=\"Nosferatu\" src=\"https://assets-prd.ignimgs.com/2024/09/20/nosferatu-button-replacement-1726839937892.jpg?width=114\u0026amp;auto=webp\" srcset=\"https://assets-prd.ignimgs.com/2024/09/20/nosferatu-button-replacement-1726839937892.jpg?width=114\u0026amp;auto=webp 1x, https://assets-prd.ignimgs.com/2024/09/20/nosferatu-button-replacement-1726839937892.jpg?width=114\u0026amp;auto=webp\u0026amp;dpr=2 2x\" data-cy=\"progressive-image\"/\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-cy=\"article-subtitle\"\u003eNot yet available for streaming.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-12-25T16:00:00Z",
  "modifiedTime": "2024-12-20T19:24:06.635Z"
}
