{
  "id": "57bb13e4-b29e-405b-9ade-288ff9afca05",
  "title": "Hurzeler hoping to improve dressing room morale ahead of Villa test",
  "link": "https://www.soccernews.com/hurzeler-hoping-to-improve-dressing-room-morale-ahead-of-villa-test/380012/",
  "description": "Brighton boss Fabian Hurzeler said that there was a “disappointing” atmosphere in the dressing room following the Seagulls’ goalless draw against Brentford. Brighton were unable to make their chances count on Friday, registering an expected goals (xG) total of 1.31 from their 24 shots, though only seven of which were on target. The stalemate saw […] The post Hurzeler hoping to improve dressing room morale ahead of Villa test appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Sat, 28 Dec 2024 23:55:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 4645,
  "excerpt": "Brighton boss Fabian Hurzeler said that there was a “disappointing” atmosphere in the dressing room following the Seagulls’ goalless draw against Brentford. Brighton were unable to make their chances count on Friday, registering an expected goals (xG) total of 1.31 from their 24 shots, though only seven of which were on target. The stalemate saw […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Brighton boss Fabian Hurzeler said that there was a “disappointing” atmosphere in the dressing room following the Seagulls’ goalless draw against Brentford. Brighton were unable to make their chances count on Friday, registering an expected goals (xG) total of 1.31 from their 24 shots, though only seven of which were on target. The stalemate saw Brighton drop to 10th in the Premier League table, and they are now without a win in their last six top-flight games after a strong start to the campaign. A trip to Villa Park to face Aston Villa is up next for Hurzeler and his players, with the Seagulls head coach preaching positivity ahead of their visit to the West Midlands. “No, I don’t think [it’s a good point]. It’s a disappointing feeling. In the locker room it’s not a great atmosphere. ” But it’s our responsibility, we have to learn to win these games,” Hurzeler said. “It’s about sticking together and staying positive. There was a clean sheet today and we created chances. It’s about getting the game’s luck back, and the consistency was not perfect. “It’s very important that we focus on ourselves and try and win games like this. In the Premier League you need to push your limits and always be at the highest level. “Maybe we missed this one sprint in the box to finish the attack. But we’ve got to stay positive and keep the energy and positivity we had today, and then the results will come.” Villa, meanwhile, are still licking their wounds from their Boxing Day defeat to Newcastle United, a game that was decided by Jhon Duran’s 32nd minute red card. Albeit unintentional, his appeal against the decision was rejected by the Football Association, meaning Unai Emery will be without his top scorer for the next three games. But the Villans boss is calling on his squad’s impressive home form to end 2024 on a high, acknowledging certain areas his players must improve on moving forward. “Yes, now Villa Park. Villa Park is where we have to feel strong with our supporters as well, and comfortable, and keep being consistent there,” Emery said. “Of course, each match, three points are not coming back again, but we have to try to build the team, progressively get better and, of course, correct how we can be competitive anyway. “But at home, we must keep trying to be consistent, like in the last matches, with our supporters. The league, the table, is very tight, with a lot of teams with a few points [between each other]. “Of course, it is a more interesting league, more difficult, of course, but we have to be positive, trying to learn and to correct everything we are more or less doing.” PLAYERS TO WATCH Aston Villa – Ollie Watkins With Duran, who had started the last four Premier League fixtures, suspended after his red card against Newcastle, Emery has a dependable replacement in Watkins to fill that void. The England international has scored more Premier League goals against Brighton than he has against any other opponent (six), netting a hat-trick in this exact fixture in a 6-1 win last season. Brighton – Brajan Gruda Gruda was handed just his second start for Brighton against Brentford on Friday, but he showcased his class against the Bees. He created five chances from open play against Thomas Frank’s side, with the German being one of only two players aged under 21 to create as many in a Premier League game this season (also five by Manchester City’s Savinho against Southampton). MATCH PREDICTION: ASTON VILLA WIN Villa have lost just one of their last 14 Premier League home games (W7 D6) and are unbeaten in their last eight at Villa Park since a 2-0 loss to Arsenal in August (W5 D3). But the Villans are looking to win their final league game in consecutive calendar years for the first time since between 2007 and 2008, following a 3-2 win against Burnley in their last game of 2023. And they will be out for vengeance. They lost their last Premier League meeting with Brighton 1-0 in May, having won five in a row against the Seagulls before that. Brighton have lost their final game of the calendar year in just two of their seven seasons in the top-flight (W3 D2), with both defeats coming in home games against Arsenal (2020 and 2022). Coming into this round of matches, no team has scored the first goal in more different Premier League away games than Brighton this season (seven). However, the Seagulls have only gone on to win three of these games (D2 L2). Brighton have also won just one of their 14 away league games against Villa (D3 L10), losing the last three in a row, including a 6-1 loss last season. OPTA WIN PROBABILITY Aston Villa – 51.5% Draw – 24.7% Brighton – 23.8%",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eBrighton boss Fabian Hurzeler said that there was a “disappointing” atmosphere in the dressing room following the Seagulls’ goalless draw against Brentford.\u003c/p\u003e\n\u003cp\u003eBrighton were unable to make their chances count on Friday, registering an expected goals (xG) total of 1.31 from their 24 shots, though only seven of which were on target.\u003c/p\u003e\n\u003cp\u003eThe stalemate saw Brighton drop to 10th in the Premier League table, and they are now without a win in their last six top-flight games after a strong start to the campaign.\u003c/p\u003e\n\u003cp\u003eA trip to Villa Park to face Aston Villa is up next for Hurzeler and his players, with the Seagulls head coach preaching positivity ahead of their visit to the West Midlands.\u003c/p\u003e\n\u003cp\u003e“No, I don’t think [it’s a good point]. It’s a disappointing feeling. In the locker room it’s not a great atmosphere. ” But it’s our responsibility, we have to learn to win these games,” Hurzeler said.\u003c/p\u003e\n\u003cp\u003e“It’s about sticking together and staying positive. There was a clean sheet today and we created chances. It’s about getting the game’s luck back, and the consistency was not perfect.\u003c/p\u003e\n\u003cp\u003e“It’s very important that we focus on ourselves and try and win games like this. In the Premier League you need to push your limits and always be at the highest level.\u003c/p\u003e\n\u003cp\u003e“Maybe we missed this one sprint in the box to finish the attack. But we’ve got to stay positive and keep the energy and positivity we had today, and then the results will come.”\u003c/p\u003e\n\n\u003cp\u003eVilla, meanwhile, are still licking their wounds from their Boxing Day defeat to Newcastle United, a game that was decided by Jhon Duran’s 32nd minute red card.\u003c/p\u003e\n\u003cp\u003eAlbeit unintentional, his appeal against the decision was rejected by the Football Association, meaning Unai Emery will be without his top scorer for the next three games.\u003c/p\u003e\n\u003cp\u003eBut the Villans boss is calling on his squad’s impressive home form to end 2024 on a high, acknowledging certain areas his players must improve on moving forward.\u003c/p\u003e\n\u003cp\u003e“Yes, now Villa Park. Villa Park is where we have to feel strong with our supporters as well, and comfortable, and keep being consistent there,” Emery said.\u003c/p\u003e\n\u003cp\u003e“Of course, each match, three points are not coming back again, but we have to try to build the team, progressively get better and, of course, correct how we can be competitive anyway.\u003c/p\u003e\n\u003cp\u003e“But at home, we must keep trying to be consistent, like in the last matches, with our supporters. The league, the table, is very tight, with a lot of teams with a few points [between each other].\u003c/p\u003e\n\u003cp\u003e“Of course, it is a more interesting league, more difficult, of course, but we have to be positive, trying to learn and to correct everything we are more or less doing.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePLAYERS TO WATCH\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAston Villa – Ollie Watkins\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWith Duran, who had started the last four Premier League fixtures, suspended after his red card against Newcastle, Emery has a dependable replacement in Watkins to fill that void.\u003c/p\u003e\n\u003cp\u003eThe England international has scored more Premier League goals against Brighton than he has against any other opponent (six), netting a hat-trick in this exact fixture in a 6-1 win last season.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBrighton – Brajan Gruda\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGruda was handed just his second start for Brighton against Brentford on Friday, but he showcased his class against the Bees. \u003c/p\u003e\n\u003cp\u003eHe created five chances from open play against Thomas Frank’s side, with the German being one of only two players aged under 21 to create as many in a Premier League game this season (also five by Manchester City’s Savinho against Southampton).\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eMATCH PREDICTION: ASTON VILLA WIN\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eVilla have lost just one of their last 14 Premier League home games (W7 D6) and are unbeaten in their last eight at Villa Park since a 2-0 loss to Arsenal in August (W5 D3).\u003c/p\u003e\n\u003cp\u003eBut the Villans are looking to win their final league game in consecutive calendar years for the first time since between 2007 and 2008, following a 3-2 win against Burnley in their last game of 2023.\u003c/p\u003e\n\u003cp\u003eAnd they will be out for vengeance. They lost their last Premier League meeting with Brighton 1-0 in May, having won five in a row against the Seagulls before that.\u003c/p\u003e\n\u003cp\u003eBrighton have lost their final game of the calendar year in just two of their seven seasons in the top-flight (W3 D2), with both defeats coming in home games against Arsenal (2020 and 2022).\u003c/p\u003e\n\u003cp\u003eComing into this round of matches, no team has scored the first goal in more different Premier League away games than Brighton this season (seven). However, the Seagulls have only gone on to win three of these games (D2 L2).\u003c/p\u003e\n\u003cp\u003eBrighton have also won just one of their 14 away league games against Villa (D3 L10), losing the last three in a row, including a 6-1 loss last season.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOPTA WIN PROBABILITY\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAston Villa – 51.5%\u003c/p\u003e\n\u003cp\u003eDraw – 24.7%\u003c/p\u003e\n\u003cp\u003eBrighton – 23.8%\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-28T23:55:00Z",
  "modifiedTime": null
}
