{
  "id": "88fd4233-e71e-4e74-828e-4fb828028b43",
  "title": "Manchester United 2-0 PAOK: Brilliant Amad earns hosts first Europa League win",
  "link": "https://www.soccernews.com/manchester-united-2-0-paok-brilliant-amad-earns-hosts-first-europa-league-win/378104/",
  "description": "Amad Diallo scored twice as Manchester United finally earned a maiden victory in the Europa League this season with a 2-0 triumph over PAOK. The Red Devils drew their opening three matches of the league phase but the excellent Amad netted twice in the second half after a fine individual display at Old Trafford. The […] The post Manchester United 2-0 PAOK: Brilliant Amad earns hosts first Europa League win appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Thu, 07 Nov 2024 22:06:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 2140,
  "excerpt": "Amad Diallo scored twice as Manchester United finally earned a maiden victory in the Europa League this season with a 2-0 triumph over PAOK. The Red Devils drew their opening three matches of the league phase but the excellent Amad netted twice in the second half after a fine individual display at Old Trafford. The […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Amad Diallo scored twice as Manchester United finally earned a maiden victory in the Europa League this season with a 2-0 triumph over PAOK. The Red Devils drew their opening three matches of the league phase but the excellent Amad netted twice in the second half after a fine individual display at Old Trafford. The winger was unfortunate not to have a first-half penalty after a trip from Abdul Baba, while his deep cross for Rasmus Hojlund was headed straight at the goalkeeper from close range. Andre Onana then tipped Mady Camama’s dipping half-volley over shortly before the break but Amad broke the deadlock when he brilliantly looped his header over Dominik Kotarski from Bruno Fernandes’ delivery. Resilience followed by brilliance, as the winger bends the ball into the far corner #MUFC || #UEL https://t.co/pgEmhaawnK pic.twitter.com/m3ApjzjhAA — Manchester United (@ManUtd) November 7, 2024 Andrija Zivkovic almost responded immediately before Alejandro Garnacho had strong shouts for another spot-kick from Jonny Otto’s challenge waved away before Amad tested Kotarski one-on-one. United had a huge let off when Tarik Tissoudali was left unmarked in the area and woefully straight at Onana, but Amad settled any nerves with a brilliant bending 20-yard effort into the left-hand side of the goal with 13 minutes remaining. Data Debrief: No Greek tragedy as Amad ensures there’s no unlucky number seven Prior to their victory over the Greek side, United were winless in six consecutive European matches (D4, L2), matching their worst stretch since 1980 to 1983. It means they have still never gone seven without a win in European fixtures. Moreover, it maintains a formidable home record against Greek opposition for United, who have now won seven straight matches on their own turf against teams from Greece at an aggregate score of 22-1. Amad was, of course, influential in the victory and his opening goal marked his first in the Europa League since netting against Milan on March 11, 2021. It marked his first ever brace for United, while five of his goals across all competitions for the club have now come at Old Trafford.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eAmad Diallo scored twice as Manchester United finally earned a maiden victory in the Europa League this season with a 2-0 triumph over PAOK.\u003c/p\u003e\n\u003cp\u003eThe Red Devils drew their opening three matches of the league phase but the excellent Amad netted twice in the second half after a fine individual display at Old Trafford.\u003c/p\u003e\n\u003cp\u003eThe winger was unfortunate not to have a first-half penalty after a trip from Abdul Baba, while his deep cross for Rasmus Hojlund was headed straight at the goalkeeper from close range.\u003c/p\u003e\n\u003cp\u003eAndre Onana then tipped Mady Camama’s dipping half-volley over shortly before the break but Amad broke the deadlock when he brilliantly looped his header over Dominik Kotarski from Bruno Fernandes’ delivery.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eResilience followed by brilliance, as the winger bends the ball into the far corner \u003ca href=\"https://twitter.com/hashtag/MUFC?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#MUFC\u003c/a\u003e || \u003ca href=\"https://twitter.com/hashtag/UEL?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#UEL\u003c/a\u003e \u003ca href=\"https://t.co/pgEmhaawnK\"\u003ehttps://t.co/pgEmhaawnK\u003c/a\u003e \u003ca href=\"https://t.co/m3ApjzjhAA\"\u003epic.twitter.com/m3ApjzjhAA\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Manchester United (@ManUtd) \u003ca href=\"https://twitter.com/ManUtd/status/1854639850411917788?ref_src=twsrc%5Etfw\"\u003eNovember 7, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eAndrija Zivkovic almost responded immediately before Alejandro Garnacho had strong shouts for another spot-kick from Jonny Otto’s challenge waved away before Amad tested Kotarski one-on-one.\u003c/p\u003e\n\u003cp\u003eUnited had a huge let off when Tarik Tissoudali was left unmarked in the area and woefully straight at Onana, but Amad settled any nerves with a brilliant bending 20-yard effort into the left-hand side of the goal with 13 minutes remaining.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eData Debrief: No Greek tragedy as Amad ensures there’s no unlucky number seven\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePrior to their victory over the Greek side, United were winless in six consecutive European matches (D4, L2), matching their worst stretch since 1980 to 1983. It means they have still never gone seven without a win in European fixtures.\u003c/p\u003e\n\u003cp\u003eMoreover, it maintains a formidable home record against Greek opposition for United, who have now won seven straight matches on their own turf against teams from Greece at an aggregate score of 22-1.\u003c/p\u003e\n\u003cp\u003eAmad was, of course, influential in the victory and his opening goal marked his first in the Europa League since netting against Milan on March 11, 2021.\u003c/p\u003e\n\u003cp\u003eIt marked his first ever brace for United, while five of his goals across all competitions for the club have now come at Old Trafford.\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-07T22:06:00Z",
  "modifiedTime": null
}
