{
  "id": "bbe55596-e8b2-44c4-b55c-6a18be6adb04",
  "title": "Simeone always knew Alvarez shared Atletico Madrid´s DNA",
  "link": "https://www.soccernews.com/simeone-always-knew-alvarez-shared-atletico-madrid-s-dna/382243/",
  "description": "Diego Simeone heaped praise on Julian Alvarez after he scored twice in Atletico Madrid’s 3-0 win at Valencia, saying he always knew the Argentine shared the club’s DNA. Alvarez – who was a €75million acquisition from Manchester City ahead of this season – struck twice in the first half-hour before Angel Correa added a late […] The post Simeone always knew Alvarez shared Atletico Madrid´s DNA appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Sat, 22 Feb 2025 23:30:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 1445,
  "excerpt": "Diego Simeone heaped praise on Julian Alvarez after he scored twice in Atletico Madrid’s 3-0 win at Valencia, saying he always knew the Argentine shared the club’s DNA. Alvarez – who was a €75million acquisition from Manchester City ahead of this season – struck twice in the first half-hour before Angel Correa added a late […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Diego Simeone heaped praise on Julian Alvarez after he scored twice in Atletico Madrid’s 3-0 win at Valencia, saying he always knew the Argentine shared the club’s DNA. Alvarez – who was a €75million acquisition from Manchester City ahead of this season – struck twice in the first half-hour before Angel Correa added a late third. The victory briefly took Atleti top of LaLiga, though Barcelona replaced them at the summit with a 2-0 triumph at Las Palmas later on Saturday. Alvarez has played a key role in Los Colchoneros’ bid for a third title under Simeone, with Saturday’s brace taking him to nine league goals despite a slow start to his debut season. No Atleti player has bettered that tally, with Alexander Sorloth and Antoine Griezmann matching him on nine goals. Reflecting on Atleti’s decision to sign Alvarez, Simeone said: “Although he still couldn’t reflect with facts what we were looking for when we signed him, I said I was sure he had Atleti’s DNA. “That’s why we were so excited then and we still are now. Especially because of the way he does things. “He won everything by the age of 25 – the World Cup with Argentina, the Champions League and the Premier League with Manchester City, and he continues in the vein of humility that makes him different from everyone else.” Leaders Barcelona are one point clear of Atletico at the summit, with Real Madrid two points further back in third ahead of hosting Girona on Sunday.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eDiego Simeone heaped praise on Julian Alvarez after he scored twice in Atletico Madrid’s 3-0 win at Valencia, saying he always knew the Argentine shared the club’s DNA.\u003c/p\u003e\n\u003cp\u003eAlvarez – who was a €75million acquisition from Manchester City ahead of this season – struck twice in the first half-hour before Angel Correa added a late third.\u003c/p\u003e\n\u003cp\u003eThe victory briefly took Atleti top of LaLiga, though Barcelona replaced them at the summit with a 2-0 triumph at Las Palmas later on Saturday.\u003c/p\u003e\n\u003cp\u003eAlvarez has played a key role in Los Colchoneros’ bid for a third title under Simeone, with Saturday’s brace taking him to nine league goals despite a slow start to his debut season. \u003c/p\u003e\n\u003cp\u003eNo Atleti player has bettered that tally, with Alexander Sorloth and Antoine Griezmann matching him on nine goals.\u003c/p\u003e\n\u003cp\u003eReflecting on Atleti’s decision to sign Alvarez, Simeone said: “Although he still couldn’t reflect with facts what we were looking for when we signed him, I said I was sure he had Atleti’s DNA.\u003c/p\u003e\n\n\u003cp\u003e“That’s why we were so excited then and we still are now. Especially because of the way he does things. \u003c/p\u003e\n\u003cp\u003e“He won everything by the age of 25 – the World Cup with Argentina, the Champions League and the Premier League with Manchester City, and he continues in the vein of humility that makes him different from everyone else.”\u003c/p\u003e\n\u003cp\u003eLeaders Barcelona are one point clear of Atletico at the summit, with Real Madrid two points further back in third ahead of hosting Girona on Sunday.\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-02-22T23:30:00Z",
  "modifiedTime": null
}
