{
  "id": "daa05d5c-f989-4dfd-a39d-81a42dcbabb3",
  "title": "Conte: Napoli need to focus on improvement, not Serie A lead",
  "link": "https://www.soccernews.com/conte-napoli-need-to-focus-on-improvement-not-serie-a-lead/378703/",
  "description": "Napoli should pay little attention to their place at the top of Serie A, so says Antonio Conte, who has demanded improvement from his team. Romelu Lukaku’s second-half goal handed Napoli a 1-0 win over Roma on Sunday. That victory sent Napoli back to the summit of Serie A, with Conte’s side one point ahead […] The post Conte: Napoli need to focus on improvement, not Serie A lead appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Sun, 24 Nov 2024 21:46:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "Serie A"
  ],
  "byline": "SoccerNews",
  "length": 2437,
  "excerpt": "Napoli should pay little attention to their place at the top of Serie A, so says Antonio Conte, who has demanded improvement from his team. Romelu Lukaku’s second-half goal handed Napoli a 1-0 win over Roma on Sunday. That victory sent Napoli back to the summit of Serie A, with Conte’s side one point ahead […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Napoli should pay little attention to their place at the top of Serie A, so says Antonio Conte, who has demanded improvement from his team. Romelu Lukaku’s second-half goal handed Napoli a 1-0 win over Roma on Sunday. That victory sent Napoli back to the summit of Serie A, with Conte’s side one point ahead of Atalanta, Inter, Fiorentina and Lazio, while Juventus are only four points back in a six-team title race. Napoli needed to get back to winning ways after a draw against Inter and a 3-0 loss to Atalanta before the international break, and Conte insists his team must sharpen up. “Before the match, I told the lads not to look at the table, but to focus on ourselves and improving what we are working on,” Conte told Sky Sport Italia. “I maintain that now too because we need to take a series of steps to raise the level. “I was satisfied with the performance for a good 65 minutes today, we could’ve taken more of our chances and were up against a strong Roma who have great players. “Roma were also making their debut under a new coach and therefore were very eager to prove themselves, but we still should’ve dealt with the final 15-20 minutes better, as we sat too deep and made it complicated for ourselves.” Full time: #NapoliRoma 1-0 #ForzaNapoliSempre pic.twitter.com/1KKTSNX4mO — Official SSC Napoli (@en_sscnapoli) November 24, 2024 Roma, playing under new boss Claudio Ranieri, came close to equalising when Artem Dovbyk hit the woodwork with a header. Ranieri came out of retirement to take charge of Roma following Ivan Juric’s dismissal earlier in November, though the visitors had just six shots and accumulated only 0.6 expected goals (xG) at Stadio Diego Armando Maradona. “If we look back, we have some problems and that is why I was called. We were up against a team that is fighting to win the Scudetto,” Ranieri told Sky Sport Italia. “Having said all of that, I am happy with the performance from my players. We made some mistakes that we will talk about during the week, but the hunger, the determination to get back on track was there. “We have a lot of work to do, but I feel positive. “We know there is work to be done, we have to focus on reacting rather than sitting there feeling sorry for ourselves. “The [players] need the right character to help themselves and then others. Naturally, when I arrived, the team was a little closed up, but I think we started to open up a bit by the second half.”",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eNapoli should pay little attention to their place at the top of Serie A, so says Antonio Conte, who has demanded improvement from his team.\u003c/p\u003e\n\u003cp\u003eRomelu Lukaku’s second-half goal handed Napoli a 1-0 win over Roma on Sunday.\u003c/p\u003e\n\u003cp\u003eThat victory sent Napoli back to the summit of Serie A, with Conte’s side one point ahead of Atalanta, Inter, Fiorentina and Lazio, while Juventus are only four points back in a six-team title race.\u003c/p\u003e\n\u003cp\u003eNapoli needed to get back to winning ways after a draw against Inter and a 3-0 loss to Atalanta before the international break, and Conte insists his team must sharpen up.\u003c/p\u003e\n\u003cp\u003e“Before the match, I told the lads not to look at the table, but to focus on ourselves and improving what we are working on,” Conte told Sky Sport Italia.\u003c/p\u003e\n\u003cp\u003e“I maintain that now too because we need to take a series of steps to raise the level.\u003c/p\u003e\n\u003cp\u003e“I was satisfied with the performance for a good 65 minutes today, we could’ve taken more of our chances and were up against a strong Roma who have great players.\u003c/p\u003e\n\u003cp\u003e“Roma were also making their debut under a new coach and therefore were very eager to prove themselves, but we still should’ve dealt with the final 15-20 minutes better, as we sat too deep and made it complicated for ourselves.”\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eFull time: \u003ca href=\"https://twitter.com/hashtag/NapoliRoma?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#NapoliRoma\u003c/a\u003e 1-0\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://twitter.com/hashtag/ForzaNapoliSempre?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#ForzaNapoliSempre\u003c/a\u003e \u003ca href=\"https://t.co/1KKTSNX4mO\"\u003epic.twitter.com/1KKTSNX4mO\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Official SSC Napoli (@en_sscnapoli) \u003ca href=\"https://twitter.com/en_sscnapoli/status/1860759048997531667?ref_src=twsrc%5Etfw\"\u003eNovember 24, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eRoma, playing under new boss Claudio Ranieri, came close to equalising when Artem Dovbyk hit the woodwork with a header. \u003c/p\u003e\n\u003cp\u003eRanieri came out of retirement to take charge of Roma following Ivan Juric’s dismissal earlier in November, though the visitors had just six shots and accumulated only 0.6 expected goals (xG) at Stadio Diego Armando Maradona.\u003c/p\u003e\n\u003cp\u003e“If we look back, we have some problems and that is why I was called. We were up against a team that is fighting to win the Scudetto,” Ranieri told Sky Sport Italia.\u003c/p\u003e\n\u003cp\u003e“Having said all of that, I am happy with the performance from my players. We made some mistakes that we will talk about during the week, but the hunger, the determination to get back on track was there.\u003c/p\u003e\n\u003cp\u003e“We have a lot of work to do, but I feel positive.\u003c/p\u003e\n\u003cp\u003e“We know there is work to be done, we have to focus on reacting rather than sitting there feeling sorry for ourselves.\u003c/p\u003e\n\u003cp\u003e“The [players] need the right character to help themselves and then others. Naturally, when I arrived, the team was a little closed up, but I think we started to open up a bit by the second half.”\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-24T21:46:00Z",
  "modifiedTime": null
}
