{
  "id": "e65cdc7b-e591-45dc-849d-e5c369eccd26",
  "title": "O´Neil feels Wolves players still behind him despite West Ham loss",
  "link": "https://www.soccernews.com/o-neil-feels-wolves-players-still-behind-him-despite-west-ham-loss/379317/",
  "description": "Wolves boss Gary O’Neil insists he retains the support of his players but understands some supporters want change after they suffered another damaging defeat to West Ham. Jarrod Bowen struck the winner as Wolves were beaten 2-1 at the London Stadium on Monday, their third straight loss after going down 4-2 to Bournemouth and 4-0 […] The post O´Neil feels Wolves players still behind him despite West Ham loss appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Mon, 09 Dec 2024 23:26:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 3359,
  "excerpt": "Wolves boss Gary O’Neil insists he retains the support of his players but understands some supporters want change after they suffered another damaging defeat to West Ham. Jarrod Bowen struck the winner as Wolves were beaten 2-1 at the London Stadium on Monday, their third straight loss after going down 4-2 to Bournemouth and 4-0 […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Wolves boss Gary O’Neil insists he retains the support of his players but understands some supporters want change after they suffered another damaging defeat to West Ham. Jarrod Bowen struck the winner as Wolves were beaten 2-1 at the London Stadium on Monday, their third straight loss after going down 4-2 to Bournemouth and 4-0 at Everton. Wolves are now four points adrift of safety in 19th place, ahead of a huge meeting with Ipswich Town – with whom they are level on points – at Molineux on Saturday. Monday’s match had been billed as decisive for both O’Neil and West Ham boss Julen Lopetegui, with reports suggesting the Wolves hierarchy were considering a change regardless of the result. O’Neil feels Wolves’ move to a self-sustainable approach to recruitment should serve as a mitigating factor for their struggles, but he knows calls for change will only intensify without an upturn in results. “The people above me are supportive, but of course the supporters want their football club to be successful. I understand them pointing the finger at me,” O’Neil told Sky Sports. “When I arrived at this football club, they’d just collected 39 points in the Premier League. Since then, we’ve managed to make £200 million in player sales. “Now we’re trying to find young players who can maybe give us a bit now then help us in the future. The Premier League is a ruthless league. “I know we sit on nine points, but I’m proud of the players, they give us everything. A big game against Ipswich is coming and hopefully a few bits – and a few bits from the officials – will go our way. “We come out of here knowing the players are still ready to fight for us, as I already knew, and now we need a few more bits to go for us.” Wolves actually created a higher expected goals (xG) figure than West Ham, with their 19 shots totalling 1.63 xG to West Ham’s 1.01 xG from the same number of attempts. They also had grievances over both West Ham goals. Tomas Soucek’s opener came from a corner despite replays showing Aaron Wan-Bissaka had played the ball behind, while some fans felt Konstantinos Mavropanos fouled Santiago Bueno in the build-up to Bowen’s winner.” “We probably edged the game, we created some good opportunities and then let ourselves down by losing our man from a corner, which apparently wasn’t a corner – the ball came back off Wan-Bissaka last,” O’Neil added. “It’s crazy, because Santi Bueno was about to head the ball away and there’s no way it was a different phase. It’s a blatant foul, I don’t know how many seconds it was before the goal but it wasn’t many.” Wolves have now conceded 38 goals in just 15 Premier League games this season, with 15 of those coming from set-pieces. Only in their two previous relegation campaigns of 2003-04 (20) and 2011-12 (18) have they shipped more such goals in a single Premier League season. “We lose our man around the back post… we’d worked on Soucek being a big threat. A big discussion needs to be had, obviously,” O’Neil said of West Ham’s first goal. “We’ve had those discussions, and we need to have them again. It’s not a group that’s built to be strong at set-pieces, being competitive in those areas has been a struggle. “Like I said to the lads, for all our hard work, if we’re going to lose Soucek and give West Ham a leg up in a moment where the crowd had gone… it’s a big moment.”",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eWolves boss Gary O’Neil insists he retains the support of his players but understands some supporters want change after they suffered another damaging defeat to West Ham.\u003c/p\u003e\n\u003cp\u003eJarrod Bowen struck the winner as Wolves were beaten 2-1 at the London Stadium on Monday, their third straight loss after going down 4-2 to Bournemouth and 4-0 at Everton.\u003c/p\u003e\n\u003cp\u003eWolves are now four points adrift of safety in 19th place, ahead of a huge meeting with Ipswich Town – with whom they are level on points – at Molineux on Saturday.\u003c/p\u003e\n\u003cp\u003eMonday’s match had been billed as decisive for both O’Neil and West Ham boss Julen Lopetegui, with reports suggesting the Wolves hierarchy were considering a change regardless of the result.\u003c/p\u003e\n\u003cp\u003eO’Neil feels Wolves’ move to a self-sustainable approach to recruitment should serve as a mitigating factor for their struggles, but he knows calls for change will only intensify without an upturn in results.\u003c/p\u003e\n\u003cp\u003e“The people above me are supportive, but of course the supporters want their football club to be successful. I understand them pointing the finger at me,” O’Neil told Sky Sports.\u003c/p\u003e\n\u003cp\u003e“When I arrived at this football club, they’d just collected 39 points in the Premier League. Since then, we’ve managed to make £200 million in player sales.\u003c/p\u003e\n\u003cp\u003e“Now we’re trying to find young players who can maybe give us a bit now then help us in the future. The Premier League is a ruthless league. \u003c/p\u003e\n\u003cp\u003e“I know we sit on nine points, but I’m proud of the players, they give us everything. A big game against Ipswich is coming and hopefully a few bits – and a few bits from the officials – will go our way.\u003c/p\u003e\n\u003cp\u003e“We come out of here knowing the players are still ready to fight for us, as I already knew, and now we need a few more bits to go for us.”\u003c/p\u003e\n\n\u003cp\u003eWolves actually created a higher expected goals (xG) figure than West Ham, with their 19 shots totalling 1.63 xG to West Ham’s 1.01 xG from the same number of attempts.\u003c/p\u003e\n\u003cp\u003eThey also had grievances over both West Ham goals. Tomas Soucek’s opener came from a corner despite replays showing Aaron Wan-Bissaka had played the ball behind, while some fans felt Konstantinos Mavropanos fouled Santiago Bueno in the build-up to Bowen’s winner.”\u003c/p\u003e\n\u003cp\u003e“We probably edged the game, we created some good opportunities and then let ourselves down by losing our man from a corner, which apparently wasn’t a corner – the ball came back off Wan-Bissaka last,” O’Neil added.\u003c/p\u003e\n\u003cp\u003e“It’s crazy, because Santi Bueno was about to head the ball away and there’s no way it was a different phase. It’s a blatant foul, I don’t know how many seconds it was before the goal but it wasn’t many.”\u003c/p\u003e\n\u003cp\u003eWolves have now conceded 38 goals in just 15 Premier League games this season, with 15 of those coming from set-pieces. Only in their two previous relegation campaigns of 2003-04 (20) and 2011-12 (18) have they shipped more such goals in a single Premier League season.\u003c/p\u003e\n\n\u003cp\u003e“We lose our man around the back post… we’d worked on Soucek being a big threat. A big discussion needs to be had, obviously,” O’Neil said of West Ham’s first goal.\u003c/p\u003e\n\u003cp\u003e“We’ve had those discussions, and we need to have them again. It’s not a group that’s built to be strong at set-pieces, being competitive in those areas has been a struggle.\u003c/p\u003e\n\u003cp\u003e“Like I said to the lads, for all our hard work, if we’re going to lose Soucek and give West Ham a leg up in a moment where the crowd had gone… it’s a big moment.”\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-09T23:26:00Z",
  "modifiedTime": null
}
