{
  "id": "f2a7535d-2bf0-4ff9-8351-676704b6967a",
  "title": "Germany W 0-1 Spain W: What Were The Key Talking Points As La Roja Reach The EURO 25 Final?",
  "link": "https://www.soccernews.com/germany-w-0-1-spain-w-what-were-the-key-talking-points-as-la-roja-reach-the-euro-25-final/387941/",
  "description": "In what was a thrilling EURO 25 semi-final showdown on Wednesday night, Spain punched their spot in this summer’s final as they claimed a 1-0 victory against Germany in extra-time. With both of the European chances creating golden opportunities on either side of the half-time break, it appeared that Wednesday’s final four battle was destined […] The post Germany W 0-1 Spain W: What Were The Key Talking Points As La Roja Reach The EURO 25 Final? appeared first on Soccer News.",
  "author": "Tom Dunstan",
  "published": "Wed, 23 Jul 2025 22:22:57 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "Editorial",
    "European Championships"
  ],
  "byline": "Tom Dunstan",
  "length": 4635,
  "excerpt": "In what was a thrilling EURO 25 semi-final showdown on Wednesday night, Spain punched their spot in this summer’s final as they claimed a 1-0 victory against Germany in extra-time. With both of the European chances creating golden opportunities on either side of the half-time break, it appeared that Wednesday’s final four battle was destined […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "In what was a thrilling EURO 25 semi-final showdown on Wednesday night, Spain punched their spot in this summer’s final as they claimed a 1-0 victory against Germany in extra-time. With both of the European chances creating golden opportunities on either side of the half-time break, it appeared that Wednesday’s final four battle was destined for spot-kicks. However, while Germany might have put in what was a valiant display, it was Barcelona star Aitana Bonmati who proved to be Spain’s hero at the Stadion Letzigrund. In what will be remembered as one of the defining moments of this summer’s tournament, the two-time Ballon d’Or winner produced a sublime turn and saw her effort squeeze past Ann-Katrin Berger. Already securing consecutive international titles over the past two summers, La Roja and their superstar squad will now feature in their first European final. In what is a repeat of the 2023 World Cup final, Spain will meet England on Sunday night as all eyes fall on Basel for what could be a defining night in both camps history. On a night when Spain moved within 90 minutes of officially completing an iconic silverware sweep, we have taken a look at the main talking points. Spain 90 minutes away from shattering more records Failing to win any of their seven historic meeting against Germany prior to Wednesday’s semi-final battle in Zurich, Spain were more than aware that they had plenty of pressure on their shoulders. Eventually finding a way to edge past their historic rivals in the most dramatic of circumstances, Montserrat Tome’s side have only continued to shatter a string of records since claiming a maiden World Cup crown back in 2023. Only further underlining their status as the most feared international squad from across the globe, La Roja hold a fearsome reputation and are now 90 minutes away from writing real history. Knowing that they can complete a sensational silverware sweep on Sunday night, the former Barcelona midfielder posses a remarkably stacked squad that includes multiple Ballon d’Or winners. While Sunday’s trip to Basel might be their first ever time in a European final, Tome’s camp have gained a reputation for their ability to shine on the brightest of stages. The ultimate heartbreak for Germany While Spain might have opened Wednesday’s semi-final showdown pencilled in as a standout favourite, La Roja would have always been aware that they faced a monumental challenge in Zurich. Winning each of their final five Nations League appearances earlier in the year by an aggregate score of 24-2, Christian Wuck’s camp opened this summer’s tournament with some perfect momentum and they were widely regarded as a title dark horse. Booking their final four spot last weekend as they edged past France thanks to a nail-biting penalty shootout victory, Germany will know that they missed out on the chance to spring an iconic upset here. However, although Wuck’s heartbroken squad might have fallen to their knees at the full-time whistle, they should take plenty of positives away from what was an impressive summer campaign over in Switzerland. Although Germany might have failed to add what would have been a record-breaking ninth European crown this month, they pushed the reigning world champions to the limit. The Lionesses await in Basel Although Spain might have booked a maiden European Championship final spot on Wednesday night, they must quickly come down from their emotional high ahead of their date with destiny this weekend. Claiming their maiden World Cup crown back in the summer of 2023 thanks to a famous 1-0 victory against England, Spain will certainly open Sunday’s trip to Basel pencilled in as a standout contender. Likewise, landing a 2-1 victory when they last met the Lionesses for a Nations League showdown in Catalonia back on June 3rd, La Roja will also meet an England squad who have certainly rode their luck for large spells this summer. Although Sarina Wiegman’s camp might have mounted another remarkable last-gasp comeback on Tuesday night as they edged past Italy, the reigning European champions will know that they must find their best if they stand any chance of writing their own piece of history. Match Report Germany W: Berger, Wamser, Kleinherne, Knaak, Kett, Buhl, Brand, Senss, Minge, Dabritz, Hoffmann Subs: Dallmann, Cerci, Schuller, Lohmann Spain W: Coll, Batlle, Paredes, Mendez, Carmona, Bonmati, Guijarro, Putellas, Caldentey, Pina, Gonzalez Subs: Castillo, Paralluelo, Martin-Prieto Goals: Bonmati (113’) Yellow Cards: Germany W: Dabritz – Spain W: Guijarro, Gonzalez, Paralluelo Red Cards: N/A Referee: Edina Alves Batista",
  "image": "https://www.soccernews.com/wp-content/uploads/2025/07/Screenshot-2025-07-23-at-23.22.05.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eIn what was a thrilling EURO 25 semi-final showdown on Wednesday night, Spain punched their spot in this summer’s final as they claimed a 1-0 victory against Germany in extra-time.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWith both of the European chances creating golden opportunities on either side of the half-time break, it appeared that Wednesday’s final four battle was destined for spot-kicks.\u003c/p\u003e\n\u003cp\u003eHowever, while Germany might have put in what was a valiant display, it was Barcelona star Aitana Bonmati who proved to be Spain’s hero at the Stadion Letzigrund.\u003c/p\u003e\n\u003cp\u003eIn what will be remembered as one of the defining moments of this summer’s tournament, the two-time Ballon d’Or winner produced a sublime turn and saw her effort squeeze past Ann-Katrin Berger.\u003c/p\u003e\n\u003cp\u003eAlready securing consecutive international titles over the past two summers, La Roja and their superstar squad will now feature in their first European final.\u003c/p\u003e\n\u003cp\u003eIn what is a repeat of the 2023 World Cup final, Spain will meet England on Sunday night as all eyes fall on Basel for what could be a defining night in both camps history.\u003c/p\u003e\n\u003cp\u003eOn a night when Spain moved within 90 minutes of officially completing an iconic silverware sweep, we have taken a look at the main talking points.\u003c/p\u003e\n\u003ch3\u003eSpain 90 minutes away from shattering more records\u003c/h3\u003e\n\u003cp\u003eFailing to win any of their seven historic meeting against Germany prior to Wednesday’s semi-final battle in Zurich, Spain were more than aware that they had plenty of pressure on their shoulders.\u003c/p\u003e\n\u003cp\u003eEventually finding a way to edge past their historic rivals in the most dramatic of circumstances, Montserrat Tome’s side have only continued to shatter a string of records since claiming a maiden World Cup crown back in 2023.\u003c/p\u003e\n\u003cp\u003eOnly further underlining their status as the most feared international squad from across the globe, La Roja hold a fearsome reputation and are now 90 minutes away from writing real history.\u003c/p\u003e\n\u003cp\u003eKnowing that they can complete a sensational silverware sweep on Sunday night, the former Barcelona midfielder posses a remarkably stacked squad that includes multiple Ballon d’Or winners.\u003c/p\u003e\n\u003cp\u003eWhile Sunday’s trip to Basel might be their first ever time in a European final, Tome’s camp have gained a reputation for their ability to shine on the brightest of stages.\u003c/p\u003e\n\u003ch3\u003eThe ultimate heartbreak for Germany\u003c/h3\u003e\n\u003cp\u003eWhile Spain might have opened Wednesday’s semi-final showdown pencilled in as a standout favourite, La Roja would have always been aware that they faced a monumental challenge in Zurich.\u003c/p\u003e\n\u003cp\u003eWinning each of their final five Nations League appearances earlier in the year by an aggregate score of 24-2, Christian Wuck’s camp opened this summer’s tournament with some perfect momentum and they were widely regarded as a title dark horse.\u003c/p\u003e\n\u003cp\u003eBooking their final four spot last weekend as they edged past France thanks to a nail-biting penalty shootout victory, Germany will know that they missed out on the chance to spring an iconic upset here.\u003c/p\u003e\n\u003cp\u003eHowever, although Wuck’s heartbroken squad might have fallen to their knees at the full-time whistle, they should take plenty of positives away from what was an impressive summer campaign over in Switzerland.\u003c/p\u003e\n\u003cp\u003eAlthough Germany might have failed to add what would have been a record-breaking ninth European crown this month, they pushed the reigning world champions to the limit.\u003c/p\u003e\n\u003ch3\u003eThe Lionesses await in Basel\u003c/h3\u003e\n\u003cp\u003eAlthough Spain might have booked a maiden European Championship final spot on Wednesday night, they must quickly come down from their emotional high ahead of their date with destiny this weekend.\u003c/p\u003e\n\u003cp\u003eClaiming their maiden World Cup crown back in the summer of 2023 thanks to a famous 1-0 victory against England, Spain will certainly open Sunday’s trip to Basel pencilled in as a standout contender.\u003c/p\u003e\n\u003cp\u003eLikewise, landing a 2-1 victory when they last met the Lionesses for a Nations League showdown in Catalonia back on June 3rd, La Roja will also meet an England squad who have certainly rode their luck for large spells this summer.\u003c/p\u003e\n\u003cp\u003eAlthough Sarina Wiegman’s camp might have mounted another remarkable last-gasp comeback on Tuesday night as they edged past Italy, the reigning European champions will know that they must find their best if they stand any chance of writing their own piece of history.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMatch Report\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGermany W:\u003c/strong\u003e Berger, Wamser, Kleinherne, Knaak, Kett, Buhl, Brand, Senss, Minge, Dabritz, Hoffmann\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSubs:\u003c/strong\u003e Dallmann, Cerci, Schuller, Lohmann\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSpain W:\u003c/strong\u003e Coll, Batlle, Paredes, Mendez, Carmona, Bonmati, Guijarro, Putellas, Caldentey, Pina, Gonzalez\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSubs:\u003c/strong\u003e Castillo, Paralluelo, Martin-Prieto\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGoals:\u003c/strong\u003e Bonmati (113’)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYellow Cards:\u003c/strong\u003e Germany W: Dabritz – Spain W: Guijarro, Gonzalez, Paralluelo\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRed Cards:\u003c/strong\u003e N/A\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReferee:\u003c/strong\u003e Edina Alves Batista\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-23T22:22:57Z",
  "modifiedTime": null
}
