{
  "id": "4880efe8-e740-4d8f-90ca-60b71a2b2adc",
  "title": "10 Travel Resolutions From Atlas Obscura for 2025",
  "link": "https://www.atlasobscura.com/articles/2025-travel-resolutions",
  "description": "New Year’s resolutions can feel a little grim. This year, I’ll reduce my screen time. In 2025, I’ll walk 10,000 steps every day. Those are mine, and I’m already depressed thinking about them. So I’ve decided to add one more to the list: a travel resolution. I often think about an incident in 1994, when an earthquake knocked out power in the city of Los Angeles. Curious residents called up Griffith Observatory, asking about the silver cloud in the sky. It was the Milky Way. Hearing that anecdote made me realize that despite all my travels, I’ve never seen the Milky Way, or a truly dark sky filled with stars. So, in 2025, my plan is to see the night sky without any light pollution blocking my view of the stars. There’s a number of ways I can do that, but I’ll start with this map from DarkSky International, an organization that advocates for and certifies spots around the world that preserve the natural darkness. At the moment, I’m thinking about heading to the Grand Canyon, which has a fabulous dark-sky program celebrated with the fun slogan “Half the park is after dark.” I’ve also chased down some of my colleagues at Atlas Obscura and asked them about their travel resolutions. They range from road trips to ambitious journeys to changing up a daily walk. “In January, I'll be spending two weeks with my boyfriend and parents traveling around Australia, which is a bucket-list destination for all of us. Our itinerary is mostly nature-related, and we planned some early morning birding in the Blue Mountains in hopes of spotting my favorite native Australian bird, the superb lyrebird, which has spectacular tail feathers and the ability to mimic sounds. They’re apparently very shy, but there’s a chance!”—Andrew Coletti, Editorial Fellow “It might be a bit of a stretch of the term travel, but I want to switch up my daily walking routes. Every day, I take the same streets to the grocery store, the gym, the library, etc. I want to mix it up and see different things along my routes so I can stay observant and avoid clicking into autopilot!”—Johanna Mayer, Senior Producer, Audio “I've been thinking about this one for years now. On my birthday this year, I decided I wanted to finally do it: In 2025, I'd like to walk the Camino de Santiago in Spain, from the French–Spanish border to Santiago de Compostela! TBD if I'll actually get it together for this year, but that's the goal!”—Zak Martellucci, Account Manager, Brand Partnerships “I've already spent time in Sturgis and Spearfish, the motorcycle-friendly towns of South Dakota. But my 2025 travel resolution is to return, by Jeep, to the Black Hills with enough time to linger. I love a solo road trip—open roads, open mind—and I often have my next journey mapped out. This one should take me through the granite tunnels and hairpin turns of Iron Mountain, 'the road that couldn't be built'; to the Hotel Alex Johnson, where Hitchcock and Cary Grant stayed when filming North by Northwest; and to Mount Moriah Cemetery, the final resting place of Calamity Jane.”—Nick Jackson, Editor-in-Chief “Next year, I want to finally make it to South America. I haven’t picked the country yet, but I’m deciding between Colombia, Peru, and Chile. I have friends in Medellín, so that might win out, but ever since working on a dining guide to Santiago in 2024, I’ve been dying to try Mapuche cuisine and the incredible seafood that the Chilean coast has to offer.”—Sam O’Brien, Senior Editor “Next summer, I’ll be heading to Portugal to celebrate a friend’s wedding, and I already have a long list of things I’d like to see and do while I’m there. One of the things I’m most excited about on that list is getting my hands on some Ovos Moles de Aveiro, a delightful egg yolk-based sweet that I’ve tried once before, when senior editor Sam O’Brien brought some back from her own trip to Portugal. I’m also hoping to see the rhinoceros of Belém Tower, a stone carving that shares a connection with one of my favorite pieces of art, Albrecht Dürer’s illustration of a rhinoceros.”—Michelle Cassidy, Deputy Editor “Firstly, I want to actually explore the city I moved to. I made the move from New Jersey to Cincinnati back in June and have yet to really experience the city properly. My wife and I are ending the year with a visit to Krohn Conservatory, actually, so we're off to a pre-2025 start. Also, I've never been to the New Orleans area. I have a pal in Alabama and in Mississippi, so I'm trying to plan some sort of meetup/vacation for us in the French Quarter. I'm a musician, so I am excited to experience the jazz and big band culture there. I'm also a sucker for paranormal attractions, so you KNOW I'll be on every ghost tour I can find.”—Roux Bedrosian, Integrated Marketing Associate “This year, my travel goal is to explore South America, finding smaller towns and villages outside of the bigger cities that embrace music, dance, and community as part of everyday life. I want to experience the beauty of slow-paced, joyful cultures in places I haven't heard of before.”—Colleen Courtney, Supervising Producer, Brand Partnerships “This year was a whirlwind, and it’s hard to imagine what 2025 has in store. I’m excited to return to one of my favorite places to disconnect and reconnect—Colombia. This will be my third visit, and I’m looking forward to exploring new places, relaxing on the beach in Santa Marta with fresh jugo de maracuyá, and catching up with old friends in Bogotá, which, in my opinion, has one of the best food scenes in South America.”—Evan Bonham, Senior Manager, Integrated Marketing",
  "author": "Anne Ewbank",
  "published": "Wed, 01 Jan 2025 10:01:00 -0500",
  "source": "https://www.atlasobscura.com/feeds/latest",
  "categories": null,
  "byline": "by Anne Ewbank January 1, 2025",
  "length": 5925,
  "excerpt": "This year, we're planning adventures across the world and in our own neighborhoods.",
  "siteName": "Atlas Obscura",
  "favicon": "https://img.atlasobscura.com/9GticEl966ZTAOEQ-dcQskOD50V9_Gt6QboGVSgUHbI/q:81/sm:1/scp:1/aHR0cHM6Ly9zMy5h/bWF6b25hd3MuY29t/L2F0bGFzLWRldi9t/aXNjL2ljb25zL2Zh/dmljb24tMzJ4MzIu/cG5n",
  "text": "New Year’s resolutions can feel a little grim. This year, I’ll reduce my screen time. In 2025, I’ll walk 10,000 steps every day. Those are mine, and I’m already depressed thinking about them. So I’ve decided to add one more to the list: a travel resolution. I often think about an incident in 1994, when an earthquake knocked out power in the city of Los Angeles. Curious residents called up Griffith Observatory, asking about the silver cloud in the sky. It was the Milky Way. Hearing that anecdote made me realize that despite all my travels, I’ve never seen the Milky Way, or a truly dark sky filled with stars. So, in 2025, my plan is to see the night sky without any light pollution blocking my view of the stars. There’s a number of ways I can do that, but I’ll start with this map from DarkSky International, an organization that advocates for and certifies spots around the world that preserve the natural darkness. At the moment, I’m thinking about heading to the Grand Canyon, which has a fabulous dark-sky program celebrated with the fun slogan “Half the park is after dark.” I’ve also chased down some of my colleagues at Atlas Obscura and asked them about their travel resolutions. They range from road trips to ambitious journeys to changing up a daily walk. “In January, I’ll be spending two weeks with my boyfriend and parents traveling around Australia, which is a bucket-list destination for all of us. Our itinerary is mostly nature-related, and we planned some early morning birding in the Blue Mountains in hopes of spotting my favorite native Australian bird, the superb lyrebird, which has spectacular tail feathers and the ability to mimic sounds. They’re apparently very shy, but there’s a chance!”—Andrew Coletti, Editorial Fellow “It might be a bit of a stretch of the term travel, but I want to switch up my daily walking routes. Every day, I take the same streets to the grocery store, the gym, the library, etc. I want to mix it up and see different things along my routes so I can stay observant and avoid clicking into autopilot!”—Johanna Mayer, Senior Producer, Audio The lyrebird sports a luxurious tail. Dave Watts / Getty Images “I’ve been thinking about this one for years now. On my birthday this year, I decided I wanted to finally do it: In 2025, I’d like to walk the Camino de Santiago in Spain, from the French–Spanish border to Santiago de Compostela! TBD if I’ll actually get it together for this year, but that’s the goal!”—Zak Martellucci, Account Manager, Brand Partnerships “I’ve already spent time in Sturgis and Spearfish, the motorcycle-friendly towns of South Dakota. But my 2025 travel resolution is to return, by Jeep, to the Black Hills with enough time to linger. I love a solo road trip—open roads, open mind—and I often have my next journey mapped out. This one should take me through the granite tunnels and hairpin turns of Iron Mountain, ‘the road that couldn’t be built’; to the Hotel Alex Johnson, where Hitchcock and Cary Grant stayed when filming North by Northwest; and to Mount Moriah Cemetery, the final resting place of Calamity Jane.”—Nick Jackson, Editor-in-Chief This hotel in Rapid City, South Dakota, has a long history and a reputation for ghost sightings. Tony Webster / CC BY-SA 2.0 “Next year, I want to finally make it to South America. I haven’t picked the country yet, but I’m deciding between Colombia, Peru, and Chile. I have friends in Medellín, so that might win out, but ever since working on a dining guide to Santiago in 2024, I’ve been dying to try Mapuche cuisine and the incredible seafood that the Chilean coast has to offer.”—Sam O’Brien, Senior Editor “Next summer, I’ll be heading to Portugal to celebrate a friend’s wedding, and I already have a long list of things I’d like to see and do while I’m there. One of the things I’m most excited about on that list is getting my hands on some Ovos Moles de Aveiro, a delightful egg yolk-based sweet that I’ve tried once before, when senior editor Sam O’Brien brought some back from her own trip to Portugal. I’m also hoping to see the rhinoceros of Belém Tower, a stone carving that shares a connection with one of my favorite pieces of art, Albrecht Dürer’s illustration of a rhinoceros.”—Michelle Cassidy, Deputy Editor This carving commemorates a short-lived rhino that perished in a shipwreck. RimerMoshe / CC BY-SA 4.0 “Firstly, I want to actually explore the city I moved to. I made the move from New Jersey to Cincinnati back in June and have yet to really experience the city properly. My wife and I are ending the year with a visit to Krohn Conservatory, actually, so we’re off to a pre-2025 start. Also, I’ve never been to the New Orleans area. I have a pal in Alabama and in Mississippi, so I’m trying to plan some sort of meetup/vacation for us in the French Quarter. I’m a musician, so I am excited to experience the jazz and big band culture there. I’m also a sucker for paranormal attractions, so you KNOW I’ll be on every ghost tour I can find.”—Roux Bedrosian, Integrated Marketing Associate Colombia’s beaches are calling. Andrew Bain / Alamy “This year, my travel goal is to explore South America, finding smaller towns and villages outside of the bigger cities that embrace music, dance, and community as part of everyday life. I want to experience the beauty of slow-paced, joyful cultures in places I haven’t heard of before.”—Colleen Courtney, Supervising Producer, Brand Partnerships “This year was a whirlwind, and it’s hard to imagine what 2025 has in store. I’m excited to return to one of my favorite places to disconnect and reconnect—Colombia. This will be my third visit, and I’m looking forward to exploring new places, relaxing on the beach in Santa Marta with fresh jugo de maracuyá, and catching up with old friends in Bogotá, which, in my opinion, has one of the best food scenes in South America.”—Evan Bonham, Senior Manager, Integrated Marketing",
  "image": "https://img.atlasobscura.com/fhX0kOE7Qr_pFYqEu_WR_hJyMKhBLTSbVYTqdFDPSgE/rt:fit/w:600/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy9lY2QxNTEyMC0w/M2QwLTQ0YTEtOTU4/Ny05MmEwNTU3Zjhi/ODgyMjNmZGU0MTBh/ZmQ5OWU1NGJfc3Rh/cnMgZ3JhbmQgY2Fu/eW9uLmpwZw.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"article-body\"\u003e\n\n            \u003cp\u003e\u003cspan\u003eNew Year’s resolutions can feel \u003c/span\u003ea little grim. \u003cem\u003eThis year, I’ll reduce my screen time.\u003c/em\u003e \u003cem\u003eIn 2025, I’ll walk 10,000 steps every day. \u003c/em\u003eThose are mine, and I’m already depressed thinking about them.\u003c/p\u003e\n\u003cp\u003eSo I’ve decided to add one more to the list: a travel resolution.\u003c/p\u003e\n\u003cp\u003eI often think about an incident in 1994, when an earthquake knocked out power in the city of \u003ca href=\"https://www.atlasobscura.com/things-to-do/los-angeles-california\"\u003eLos Angeles\u003c/a\u003e. Curious residents called up \u003ca href=\"https://www.nps.gov/subjects/nightskies/connect.htm\"\u003eGriffith Observatory\u003c/a\u003e, asking about the silver cloud in the sky. It was the Milky Way. Hearing that anecdote made me realize that despite all my travels, I’ve never seen the Milky Way, or a truly dark sky filled with stars. So, in 2025, my plan is to see the night sky without any light pollution blocking my view of the stars.\u003c/p\u003e\n\u003cp\u003eThere’s a number of ways I can do that, but I’ll start with this map from \u003ca href=\"https://darksky.org/\"\u003eDarkSky International\u003c/a\u003e, an organization that advocates for and certifies spots around the world that preserve the natural darkness. At the moment, I’m thinking about heading to the Grand Canyon, which has a fabulous dark-sky program celebrated with the fun slogan “Half the park is after dark.”\u003c/p\u003e\n\u003cp\u003eI’ve also chased down some of my colleagues at Atlas Obscura and asked them about their travel resolutions. They range from road trips to ambitious journeys to changing up a daily walk.\u003c/p\u003e\n\u003cp\u003e“In January, I’ll be spending two weeks with my boyfriend and parents traveling around \u003ca href=\"https://www.atlasobscura.com/things-to-do/australia\"\u003eAustralia\u003c/a\u003e, which is a bucket-list destination for all of us. Our itinerary is mostly nature-related, and we planned some early morning birding in the Blue Mountains in hopes of spotting my favorite native Australian bird, the superb lyrebird, which has spectacular tail feathers and the ability to mimic sounds. They’re apparently very shy, but there’s a chance!”\u003cbr/\u003e\u003cem\u003e—Andrew Coletti, Editorial Fellow\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e“It might be a bit of a stretch of the term \u003cem\u003etravel\u003c/em\u003e, but I want to switch up my daily walking routes. Every day, I take the same streets to the grocery store, the gym, the library, etc. I want to mix it up and see different things along my routes so I can stay observant and avoid clicking into autopilot!”\u003cbr/\u003e\u003cem\u003e—Johanna Mayer, Senior Producer, Audio\u003c/em\u003e\u003c/p\u003e\n\u003cfigure\u003e\u003cimg src=\"https://img.atlasobscura.com/6Vp38FXhUQaeSKMUVaP6w16dRfzXaS0kQqePy5zfFG4/rs:fill:12000:12000/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy9lYTdiODEzMC1k/ZTMyLTRhNDctYjQz/Yy0xOWNlYjM3ZDcz/ZTM4ZmJiZWQ4YjIw/YmQxZjZjNzFfbHly/ZWJpcmQuanBn.jpg\" alt=\"The lyrebird sports a luxurious tail.\" width=\"auto\" data-kind=\"article-image\" id=\"article-image-104277\" loading=\"lazy\"/\u003e\u003cfigcaption\u003eThe lyrebird sports a luxurious tail. \u003cspan\u003eDave Watts / Getty Images\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e“I’ve been thinking about this one for years now. On my birthday this year, I decided I wanted to finally do it: In 2025, I’d like to walk the Camino de Santiago in \u003ca href=\"https://www.atlasobscura.com/things-to-do/spain\"\u003eSpain\u003c/a\u003e, from the French–Spanish border to Santiago de Compostela! TBD if I’ll actually get it together for this year, but that’s the goal!”\u003cbr/\u003e\u003cem\u003e—Zak Martellucci, Account Manager, Brand Partnerships\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e“I’ve already spent time in Sturgis and Spearfish, the motorcycle-friendly towns of \u003ca href=\"https://www.atlasobscura.com/things-to-do/south-dakota\"\u003eSouth Dakota\u003c/a\u003e. But my 2025 travel resolution is to return, by Jeep, to the Black Hills with enough time to linger. I love a solo road trip—open roads, open mind—and I often have my next journey mapped out. This one should take me through the granite tunnels and hairpin turns of Iron Mountain, ‘the road that couldn’t be built’; to the Hotel Alex Johnson, where Hitchcock and Cary Grant stayed when filming \u003cem\u003eNorth by Northwest\u003c/em\u003e; and to Mount Moriah Cemetery, the final resting place of Calamity Jane.”\u003cbr/\u003e\u003cem\u003e—Nick Jackson, Editor-in-Chief\u003c/em\u003e\u003c/p\u003e\n\u003cfigure\u003e\u003cimg src=\"https://img.atlasobscura.com/vs4tjRKTz8xw7fCccYMaQIyfy9Tcm_QQw2WxPkDDlzE/rs:fill:12000:12000/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy83MGYwNTU0ZS04/MTkxLTQ1ZmEtOWNi/My1kMjYwZmM5OGQ2/NGI4ZmJiZWQ4YjIw/YmQxZjZjNzFfaG90/ZWwgYWxleC5qcGc.jpg\" alt=\"This hotel in Rapid City, South Dakota, has a long history and a reputation for ghost sightings.\" width=\"auto\" data-kind=\"article-image\" id=\"article-image-104279\" loading=\"lazy\"/\u003e\u003cfigcaption\u003eThis hotel in Rapid City, South Dakota, has a long history and a reputation for ghost sightings. \u003cspan\u003eTony Webster / CC BY-SA 2.0\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e“Next year, I want to finally make it to South America. I haven’t picked the country yet, but I’m deciding between \u003ca href=\"https://www.atlasobscura.com/things-to-do/colombia\"\u003eColombia\u003c/a\u003e, \u003ca href=\"https://www.atlasobscura.com/things-to-do/peru\"\u003ePeru\u003c/a\u003e, and \u003ca href=\"https://www.atlasobscura.com/things-to-do/chile\"\u003eChile\u003c/a\u003e. I have friends in \u003ca href=\"https://www.atlasobscura.com/things-to-do/medellin-colombia\"\u003eMedellín\u003c/a\u003e, so that might win out, but ever since working on a \u003ca href=\"https://www.atlasobscura.com/articles/where-to-eat-santiago-chile\"\u003edining guide to Santiago\u003c/a\u003e in 2024, I’ve been dying to try Mapuche cuisine and the incredible seafood that the Chilean coast has to offer.”\u003cbr/\u003e—\u003cem\u003eSam O’Brien, Senior Editor\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e“Next summer, I’ll be heading to \u003ca href=\"https://www.atlasobscura.com/things-to-do/portugal\"\u003ePortugal\u003c/a\u003e to celebrate a friend’s wedding, and I already have a long list of things I’d like to see and do while I’m there. One of the things I’m most excited about on that list is getting my hands on some \u003ca href=\"https://www.atlasobscura.com/foods/ovos-moles-de-aveiro\"\u003eOvos Moles de Aveiro\u003c/a\u003e, a delightful egg yolk-based sweet that I’ve tried once before, when senior editor Sam O’Brien brought some back from her own trip to Portugal. I’m also hoping to see the \u003ca href=\"https://www.atlasobscura.com/places/belem-tower-rhinoceros-torre-de-belem\"\u003erhinoceros of Belém Tower\u003c/a\u003e, a stone carving that shares a connection with one of my favorite pieces of art, Albrecht Dürer’s illustration of a rhinoceros.”\u003cbr/\u003e—\u003cem\u003eMichelle Cassidy, Deputy Editor\u003c/em\u003e\u003c/p\u003e\n\u003cfigure\u003e\u003cimg src=\"https://img.atlasobscura.com/la0JJkHVYPwq9yXVEpL_5HT2GAPF5m4IqfZfU2Cnh6A/rs:fill:12000:12000/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy9hMzU1ZjA4Ni05/OWM2LTQ3YTUtYjVh/NC0yNDVjMjkwNjRi/NTU4ZmJiZWQ4YjIw/YmQxZjZjNzFfcmhp/bm8uanBn.jpg\" alt=\"This carving commemorates a short-lived rhino that perished in a shipwreck.\" width=\"auto\" data-kind=\"article-image\" id=\"article-image-104281\" loading=\"lazy\"/\u003e\u003cfigcaption\u003eThis carving commemorates a short-lived rhino that perished in a shipwreck. \u003cspan\u003eRimerMoshe / CC BY-SA 4.0\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e“Firstly, I want to actually explore the city I moved to. I made the move from \u003ca href=\"https://www.atlasobscura.com/things-to-do/new-jersey\"\u003eNew Jersey\u003c/a\u003e to \u003ca href=\"https://www.atlasobscura.com/things-to-do/cincinnati-ohio\"\u003eCincinnati\u003c/a\u003e back in June and have yet to really experience the city properly. My wife and I are ending the year with a visit to \u003ca href=\"https://www.cincinnati-oh.gov/cincyparks/visit-a-park/find-a-parkfacility/krohn-conservatory/\"\u003eKrohn Conservatory\u003c/a\u003e, actually, so we’re off to a pre-2025 start.\u003c/p\u003e\n\u003cp\u003eAlso, I’ve never been to the \u003ca href=\"https://www.atlasobscura.com/things-to-do/new-orleans-louisiana\"\u003eNew Orleans\u003c/a\u003e area. I have a pal in \u003ca href=\"https://www.atlasobscura.com/things-to-do/alabama\"\u003eAlabama\u003c/a\u003e and in \u003ca href=\"https://www.atlasobscura.com/things-to-do/mississippi\"\u003eMississippi\u003c/a\u003e, so I’m trying to plan some sort of meetup/vacation for us in the French Quarter. I’m a musician, so I am excited to experience the jazz and big band culture there. I’m also a sucker for paranormal attractions, so you KNOW I’ll be on every ghost tour I can find.”\u003cbr/\u003e\u003cem\u003e—Roux Bedrosian, Integrated Marketing Associate\u003c/em\u003e\u003c/p\u003e\n\u003cfigure\u003e\u003cimg src=\"https://img.atlasobscura.com/Um8RakxHbhl1IVA0gnKOPsBRsuqSalzyN0BUQ-DYEBA/rs:fill:12000:12000/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy9mNTNiNWVlMC1k/ZTIxLTQ3ZGUtOTkz/MC1hMDg2MWFjYzcz/ZTNmYzViM2U2MzRl/NmZhN2Y3NDhfc2Fu/dGEgbWFydGEuanBn.jpg\" alt=\"Colombia\u0026#39;s beaches are calling.\" width=\"auto\" data-kind=\"article-image\" id=\"article-image-104296\" loading=\"lazy\"/\u003e\u003cfigcaption\u003eColombia’s beaches are calling. \u003cspan\u003eAndrew Bain / Alamy\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e“This year, my travel goal is to explore South America, finding smaller towns and villages outside of the bigger cities that embrace music, dance, and community as part of everyday life. I want to experience the beauty of slow-paced, joyful cultures in places I haven’t heard of before.”\u003cbr/\u003e—\u003cem\u003eColleen Courtney, Supervising Producer, Brand Partnerships\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e“This year was a whirlwind, and it’s hard to imagine what 2025 has in store. I’m excited to return to one of my favorite places to disconnect and reconnect—Colombia. This will be my third visit, and I’m looking forward to exploring new places, relaxing on the beach in Santa Marta with fresh \u003cem\u003ejugo de maracuyá\u003c/em\u003e, and catching up with old friends in \u003ca href=\"https://www.atlasobscura.com/things-to-do/bogota-colombia\"\u003eBogotá\u003c/a\u003e, which, in my opinion, has one of the best food scenes in South America.”\u003cbr/\u003e\u003cem\u003e—Evan Bonham, Senior Manager, Integrated Marketing\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n          \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-01T10:01:00-05:00",
  "modifiedTime": "2024-12-31T19:06:37-05:00"
}
