{
  "id": "c4836476-93a8-4d74-b171-6c941748be45",
  "title": "Spitfire Visitor Centre in Blackpool, England",
  "link": "https://www.atlasobscura.com/places/spitfire-visitor-centre",
  "description": "Located in Hangar 42 at Blackpool Airport, which was built in 1939 for the Royal Air Force, the Spitfire Visitor Centre is a museum featuring, among other attractions, full-scale replicas of World War II-era Spitfire fighter aircraft. Reconstructed using original parts, the aircraft on display also include a Hawker Hurricane MKI and the Messerschmidt bf109e. Visitors can even sit inside the cockpit. The museum also contains recreations of some of the offices and meeting rooms used by the RFA, aircraft parts (including items salvaged from aircraft that crashed in the Blackpool area), and a flight simulator. In 2009, John Coombes, then-leader of the Lytham St. Annes Council, uncovered a photograph from World War II of a Spitfire fighter plane in the local council’s files.  Through some research, Coombes learned that the plane had been funded by the local community and had gone into operation in February 1942, but both the plane and its pilot were lost in the English Channel four months later. Moved by this story, Coombes organized a volunteer group named the Lytham St. Annes Spitfire Display Team to construct a full-scale replica of a Spitfire as a memorial to both the individual pilot as well as the other members of the Royal Air Force who served in the Blackpool area during World War II. That memorial, commonly called the Lytham St. Annes Spitfire, now stands on the shore of Fairhaven Lake between Lytham and St. Annes. The volunteers and staff at the museum continue to work on aircraft restoration, give talks, and even provide both aircraft and people for filming and re-enactments.  However, work is still ongoing to improve and expand the museum at the center to record and preserve the history of World War II in the Blackpool area.",
  "author": "",
  "published": "Thu, 26 Dec 2024 15:00:00 -0500",
  "source": "https://www.atlasobscura.com/feeds/latest",
  "categories": [
    "museums",
    "aircraft",
    "world war ii"
  ],
  "byline": "Added By Dark Nebula Deluxe",
  "length": 1761,
  "excerpt": "See reconstructed Spitfires and other World War II-era planes in a hangar originally used by the Royal Air Force.",
  "siteName": "Atlas Obscura",
  "favicon": "https://img.atlasobscura.com/2qkRVagVffc_mgSh6SEWeb318Fx0xvtyxjgUes0K6j8/sm:1/scp:1/aHR0cHM6Ly9zMy5h/bWF6b25hd3MuY29t/L2F0bGFzLWRldi9t/aXNjL2ljb25zL2Fw/cGxlLXRvdWNoLWlj/b24tMTQ0eDE0NC1w/cmVjb21wb3NlZC5w/bmc",
  "text": "Located in Hangar 42 at Blackpool Airport, which was built in 1939 for the Royal Air Force, the Spitfire Visitor Centre is a museum featuring, among other attractions, full-scale replicas of World War II-era Spitfire fighter aircraft. Reconstructed using original parts, the aircraft on display also include a Hawker Hurricane MKI and the Messerschmidt bf109e. Visitors can even sit inside the cockpit. The museum also contains recreations of some of the offices and meeting rooms used by the RFA, aircraft parts (including items salvaged from aircraft that crashed in the Blackpool area), and a flight simulator. In 2009, John Coombes, then-leader of the Lytham St. Annes Council, uncovered a photograph from World War II of a Spitfire fighter plane in the local council’s files.  Through some research, Coombes learned that the plane had been funded by the local community and had gone into operation in February 1942, but both the plane and its pilot were lost in the English Channel four months later. Moved by this story, Coombes organized a volunteer group named the Lytham St. Annes Spitfire Display Team to construct a full-scale replica of a Spitfire as a memorial to both the individual pilot as well as the other members of the Royal Air Force who served in the Blackpool area during World War II. That memorial, commonly called the Lytham St. Annes Spitfire, now stands on the shore of Fairhaven Lake between Lytham and St. Annes. The volunteers and staff at the museum continue to work on aircraft restoration, give talks, and even provide both aircraft and people for filming and re-enactments.  However, work is still ongoing to improve and expand the museum at the center to record and preserve the history of World War II in the Blackpool area.",
  "image": "https://img.atlasobscura.com/qc1uLoi16LLS75lm8nxrcRHmkgcNdXnqPuQpnKc3HrA/rt:fit/w:600/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy9mZWQx/ZmY5YS04ODlhLTQ0/MjAtYjFlYS0wOWMz/ZTE5ZTkyM2NiMmIy/OGQxYjFiMjFkOGZl/NDFfaGFuZ2FyMS5q/cGc.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \u003cp\u003eLocated in Hangar 42 at Blackpool Airport, which was built in 1939 for the Royal Air Force, the Spitfire Visitor Centre is a museum featuring, among other attractions, full-scale replicas of World War II-era Spitfire fighter aircraft.\u003c/p\u003e\n\u003cp\u003eReconstructed using original parts, the aircraft on display also include a Hawker Hurricane MKI and the Messerschmidt bf109e. Visitors can even sit inside the cockpit.\u003c/p\u003e\n\u003cp\u003eThe museum also contains recreations of some of the offices and meeting rooms used by the RFA, aircraft parts (including items salvaged from aircraft that crashed in the Blackpool area), and a flight simulator.\u003c/p\u003e\n\u003cp\u003eIn 2009, John Coombes, then-leader of the Lytham St. Annes Council, uncovered a photograph from World War II of a Spitfire fighter plane in the local council’s files.  Through some research, Coombes learned that the plane had been funded by the local community and had gone into operation in February 1942, but both the plane and its pilot were lost in the English Channel four months later. Moved by this story, Coombes organized a volunteer group named the Lytham St. Annes Spitfire Display Team to construct a full-scale replica of a Spitfire as a memorial to both the individual pilot as well as the other members of the Royal Air Force who served in the Blackpool area during World War II. That memorial, commonly called the \u003ca href=\"https://www.atlasobscura.com/places/lytham-st-annes-spitfire\"\u003eLytham St. Annes Spitfire\u003c/a\u003e, now stands on the shore of Fairhaven Lake between Lytham and St. Annes.\u003c/p\u003e\n\u003cp\u003eThe volunteers and staff at the museum continue to work on aircraft restoration, give talks, and even provide both aircraft and people for filming and re-enactments.  However, work is still ongoing to improve and expand the museum at the center to record and preserve the history of World War II in the Blackpool area.\u003c/p\u003e\n\n                \n            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-26T15:00:00-05:00",
  "modifiedTime": null
}
