[
  {
    "id": "cf92210e-5f83-4a43-9cd8-7947e5a9f933",
    "title": "Record number of illegal sewage spills in Windermere last year",
    "link": "https://www.bbc.com/news/articles/cvg19q7pjdeo",
    "description": "Campaigners identified 140 illegal spill days into the beauty spot in 2024",
    "author": "",
    "published": "Mon, 31 Mar 2025 05:02:29 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/news/science_and_environment/rss.xml",
    "categories": null
  },
  {
    "id": "7ac84dd4-7d44-4157-b913-23b03317f79f",
    "title": "The Swedish city fined for missing an environmental target",
    "link": "https://www.bbc.com/news/articles/c5yx1rl8dk2o",
    "description": "Gothenburg has to pay a financial penalty if it misses certain annual sustainability goals.",
    "author": "",
    "published": "Mon, 31 Mar 2025 01:39:10 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/news/science_and_environment/rss.xml",
    "categories": null
  },
  {
    "id": "f70fb601-5efd-43bb-9beb-833bafa07a3a",
    "title": "The Life Scientific - Anna Korre",
    "link": "http://www.bbc.co.uk/programmes/w3ct5rp5",
    "description": "As the famous frog once said, it's not easy being green. And when it comes to decarbonising industry, indeed, reducing emissions of all sorts, the task is a complex one.Fossil fuels are used to manufacture some of mankind’s most ubiquitous products, from plastics to cement to steel; and even in areas where we’re trying to improve our footprint, there are repercussions. Mining lithium for electric car batteries isn’t exactly without impact. Add to the mix stories of corporations prioritising profits, and governments focusing on short-term popular policies – and it would be easy to feel disheartened.Professor Anna Korre says her role is to be the champion of science in this debate: providing clear evidence to help reduce environmental impacts, while allowing vital production processes to continue.Anna is an environmental engineer at Imperial College London and Co-Director of the university’s Energy Futures Lab. Her work has led to a risk model that's now used in mining operations around the world – and her current research into underground CO2 storage could hold the key to decarbonising British industry. But as she tells Jim Al-Khalili, social and family expectations when she was growing up in her native Greece meant her successful career in engineering very nearly didn't happen...",
    "author": "BBC World Service",
    "published": "Tue, 25 Mar 2025 12:07:00 +0000",
    "image": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download-rss-low/proto/http/vpid/p0l07ncb.mp3",
    "source": "https://podcasts.files.bbci.co.uk/p002w557.rss",
    "categories": null
  },
  {
    "id": "4f3381aa-9193-449e-b90a-c57a375e735b",
    "title": "The Life Scientific - Rosalie David",
    "link": "http://www.bbc.co.uk/programmes/w3ct5rp4",
    "description": "Rosalie David is a pioneer in the study of ancient Egypt. In the early 1970s, she launched a unique project to study Egyptian mummified bodies using the techniques of modern medicine. Back then, the vast majority of Egyptologists regarded mummies as unimportant sources of information about life in ancient Egypt. Instead they focussed on interpreting hieroglyphic inscriptions, the written record in papyrus documents and archaeological remains and artefacts. Rosalie David proved that the traditionalists were quite wrong.Professor David’s mummy research started at the Manchester Museum when she began to collaborate with radiologists at in Manchester, taking the museum’s mummies for x-rays at the hospital. Her multi-disciplinary team later moved to a dedicated institute at the University of Manchester, the KNH Centre for Biomedical Egyptology. Over the decades, the team there has made remarkable discoveries about disease and medicine in ancient Egyptian society, providing a new perspective on the history of medicine and giving extraordinary insights into the lives of individuals all those years ago.Rosalie tells Jim Al-Khalili about her journey from classics and ancient history to biomedicine, including some of her adventures in Egypt in the 1960s. She talks about some of her most significant research projects, and the 21st Century forensic detective work on the mummy of a young woman which revealed a gruesome murder 3,000 years ago...",
    "author": "BBC World Service",
    "published": "Mon, 17 Mar 2025 21:00:00 +0000",
    "image": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download-rss-low/proto/http/vpid/p0kyrhx4.mp3",
    "source": "https://podcasts.files.bbci.co.uk/p002w557.rss",
    "categories": null
  },
  {
    "id": "473d451f-b522-406c-865a-4b4c338f42b8",
    "title": "Shark Sounds, Molecules on Mars and Continued Federal Cuts",
    "link": "",
    "description": "Long-chain alkanes discovered by NASA’s Curiosity rover point to the possibility that there may have been fatty acids on Mars—and that they could have come from past microbial life. Paleontologists have found a huge dinosaur claw that was probably made for foraging, not fighting. Researchers studying ocean life have recorded the sounds of sharks and the tricks of cuttlefish. Plus, cuts to jobs and funding for U.S. federal science and health agencies continued last week. Tens of thousands of federal workers are on the chopping block, as is funding for COVID testing, vaccinations and equity initiatives.  Recommended reading: Scientists Record First Known Shark Sounds https://www.scientificamerican.com/article/scientists-record-first-known-shark-sounds/  HHS’s Long COVID Office Is Closing. What Will This Mean for Future Research and Treatments? https://www.scientificamerican.com/article/hhss-long-covid-office-is-closing-what-will-this-mean-for-future-research/  E-mail us at sciencequickly@sciam.com if you have any questions, comments or ideas for stories we should cover! Discover something new every day: subscribe to Scientific American and sign up for Today in Science, our daily newsletter.  Science Quickly is produced by Rachel Feltman, Fonda Mwangi, Kelso Harper, Naeem Amarsy and Jeff DelViscio.This episode was hosted by Rachel Feltman. Our show is edited by Alex Sugiura with fact-checking by Shayna Posses and Aaron Shattuck. The theme music was composed by Dominic Smith. Learn more about your ad choices. Visit megaphone.fm/adchoices",
    "author": "Scientific American",
    "published": "Mon, 31 Mar 2025 09:50:00 -0000",
    "image": "https://traffic.megaphone.fm/SAM2343584560.mp3?updated=1743186429",
    "source": "http://rss.sciam.com/sciam/60secsciencepodcast",
    "categories": null
  },
  {
    "id": "9a974827-210b-4723-867c-152dba46101e",
    "title": "Go Inside M.I.T.'s 50,000 Square Foot Clean Room",
    "link": "",
    "description": "The cutting edge of research is very small—and very clean. In this episode, host Rachel Feltman joins Vladimir Bulović, director of MIT.nano, on a tour of this facility’s nanoscale capabilities. Its tightly controlled clean room hosts research across several fields, from microelectronics to medical nanotechnology. You can see Bulović’s tour of the lab at: https://youtu.be/ucGFcLjX30Q  E-mail us at sciencequickly@sciam.com if you have any questions, comments or ideas for stories we should cover! Discover something new every day: subscribe to Scientific American and sign up for Today in Science, our daily newsletter.  Science Quickly is produced by Rachel Feltman, Fonda Mwangi, Kelso Harper, Naeem Amarsy and Jeff DelViscio. This episode was hosted by Rachel Feltman. Our show is edited by Jeff DelViscio with fact-checking by Shayna Posses and Aaron Shattuck. The theme music was composed by Dominic Smith. Learn more about your ad choices. Visit megaphone.fm/adchoices",
    "author": "Scientific American",
    "published": "Fri, 28 Mar 2025 10:00:00 -0000",
    "image": "https://traffic.megaphone.fm/SAM9219843153.mp3?updated=1743123796",
    "source": "http://rss.sciam.com/sciam/60secsciencepodcast",
    "categories": null
  },
  {
    "id": "20782473-5a1d-4c6e-9d38-2559635eed01",
    "title": "Science of the loud sneeze, illustrated",
    "link": "https://flowingdata.com/2025/04/01/science-of-the-loud-sneeze-illustrated/",
    "description": "Some people sneeze very loudly. For the Washington Post, Teddy Amenabar, Álvaro Valiño,…Tags: sneeze, Washington Post",
    "author": "Nathan Yau",
    "published": "Tue, 01 Apr 2025 07:42:24 +0000",
    "image": "https://flowingdata.com/wp-content/uploads/2025/03/sneeze-science-750x507.png",
    "source": "https://flowingdata.com/feed",
    "categories": [
      "Infographics",
      "sneeze",
      "Washington Post"
    ]
  },
  {
    "id": "b831cd2e-0ad9-4111-a3b6-ca5612caca7d",
    "title": "When the baby will be born",
    "link": "https://flowingdata.com/2025/03/31/when-the-baby-will-be-born/",
    "description": "Maggie Appleton is at the point in her pregnancy when there’s a lot…Tags: birth, Maggie Appleton, probability",
    "author": "Nathan Yau",
    "published": "Mon, 31 Mar 2025 08:34:41 +0000",
    "image": "https://flowingdata.com/wp-content/uploads/2025/03/birth-estimate-750x676.png",
    "source": "https://flowingdata.com/feed",
    "categories": [
      "Statistical Visualization",
      "birth",
      "Maggie Appleton",
      "probability"
    ]
  },
  {
    "id": "94c5299d-dd31-4f71-bedc-e9543c6cd3cd",
    "title": "Scientists Agree That Everyone Hates Your Terrible Zoom Mic",
    "link": "https://gizmodo.com/scientists-agree-that-everyone-hates-your-terrible-zoom-mic-2000582080",
    "description": "A new study from Yale confirms what everyone already knew: we’re all judging you when your mic sounds cheap and bad on a conference call.",
    "author": "Matthew Gault",
    "published": "Fri, 28 Mar 2025 16:15:23 +0000",
    "image": "https://gizmodo.com/app/uploads/2025/03/ZoomMic.jpg",
    "source": "https://gizmodo.com/tag/science/rss",
    "categories": [
      "Culture",
      "Microphone",
      "Science",
      "yale",
      "zoom"
    ]
  },
  {
    "id": "852c3937-7fb0-4227-aa5f-7e895b37ecba",
    "title": "This $35,000 Computer Is Powered by Trapped Human Brain Cells",
    "link": "https://gizmodo.com/this-35000-computer-is-powered-by-trapped-human-brain-cells-2000573993",
    "description": "A company is selling what it calls the world’s first “code deployable biological computer.”",
    "author": "Matthew Gault",
    "published": "Mon, 10 Mar 2025 19:20:59 +0000",
    "image": "https://gizmodo.com/app/uploads/2025/03/CorticalLabs.jpg",
    "source": "https://gizmodo.com/tag/science/rss",
    "categories": [
      "Gadgets",
      "brains",
      "neural networks",
      "Science"
    ]
  },
  {
    "id": "474c42a9-0c6d-4ef8-99e2-7b2c895d5782",
    "title": "Alternate Realities from NPR's Embedded",
    "link": "https://www.npr.org/2026/01/01/1256998295/embedded-alternate-realities-bonus",
    "description": "New from NPR's Embedded: Reporter Zach Mack thinks his dad has gone all in on conspiracy theories, while his father thinks that Zach is the one being brainwashed. In 2024, after the latest round of circular arguments, they decided to try something new, an attempt to pull each other out of the spell each of them thinks the other is under. Can one family live in two realities?This is episode 1 of a three-part series. To hear the rest, head to NPR's Embedded podcast.Learn more about sponsor message choices: podcastchoices.com/adchoicesNPR Privacy Policy",
    "author": "",
    "published": "Mon, 24 Feb 2025 16:05:09 +0000",
    "image": "https://chrt.fm/track/138C95/prfx.byspotify.com/e/play.podtrac.com/npr-510307/traffic.megaphone.fm/NPR5502242039.mp3?d=1553\u0026size=24862390\u0026e=1256998295\u0026t=podcast\u0026p=510307",
    "source": "https://feeds.npr.org/510307/podcast.xml",
    "categories": null
  },
  {
    "id": "b091eeea-c541-4e78-a227-77e227cdff3b",
    "title": "Tested (Ep 2): Questions of a Physical Nature",
    "link": "https://www.npr.org/2026/01/01/1256998294/tested-questions-of-a-physical-nature",
    "description": "We go back almost 100 years, to the beginning of women's inclusion in elite sports. It turns out that men had an odd variety of concerns about women athletes. Some doubted these athletes were even women at all. And their skepticism resulted in the first policies requiring sex testing. Tested is a six-part series, you can binge all the episodes now in the Embedded podcast and the CBC feed.Learn more about sponsor message choices: podcastchoices.com/adchoicesNPR Privacy Policy",
    "author": "",
    "published": "Thu, 22 Aug 2024 16:21:04 +0000",
    "image": "https://chrt.fm/track/138C95/prfx.byspotify.com/e/play.podtrac.com/npr-510307/traffic.megaphone.fm/NPR2243610217.mp3?d=2066\u0026size=33056897\u0026e=1256998294\u0026t=podcast\u0026p=510307",
    "source": "https://feeds.npr.org/510307/podcast.xml",
    "categories": null
  },
  {
    "id": "099bed9f-b060-4f22-bc58-9c8a791fde54",
    "title": "Rocky Mountain snow is contaminated, study shows",
    "link": "https://www.sciencedaily.com/releases/2025/04/250401174907.htm",
    "description": "Mountain snowpacks accumulate snow throughout the winter, building up stores of water that will supply communities across the American West throughout the long dry season. Now, a new study shows that as storms carry snow to the Rocky Mountains, they are also bringing mercury and other contaminants from mines in the region. The research helps scientists understand how contaminants are spread by atmospheric circulation and has implications for snowpack preservation and illuminating the lasting environmental impact of mining activities.",
    "author": "",
    "published": "Tue, 01 Apr 2025 17:49:07 EDT",
    "image": "",
    "source": "https://www.sciencedaily.com/rss/all.xml",
    "categories": null
  },
  {
    "id": "c4b0028c-e857-4eec-9438-aa93a327b030",
    "title": "New insight into factors associated with a common disease among dogs and humans",
    "link": "https://www.sciencedaily.com/releases/2025/04/250401174900.htm",
    "description": "For dogs housed at Texas kennels, age and fecal score are important factors for screening for subclinical Giardia infections.",
    "author": "",
    "published": "Tue, 01 Apr 2025 17:49:00 EDT",
    "image": "",
    "source": "https://www.sciencedaily.com/rss/all.xml",
    "categories": null
  },
  {
    "id": "1f8e10df-da2b-45c6-a9ff-ccc389af1bee",
    "title": "Nutrition Advice Decoded: What Foods Are Actually Good For Us, What Should We Avoid, and Why Is It All SO Confusing?",
    "link": "",
    "description": "Are eggs going to give you high cholesterol, or are they the base of a great protein-rich meal? Will coffee give you cancer, or will it help you live longer?  If you're confused about what nutrition science has to say about which foods are healthy and which are not, you're not alone. But why is it so hard to figure out what's good for us, and why does the advice seem to change constantly? This week on Gastropod, we reveal the hidden history of how nutrition science got started, why its early successes saved millions of lives, and how those successes then led the field astray. From debunking the Blue Zones, to the discredited “French paradox” that had everyone washing their Brie down with glasses of red wine, to the most recent research on ultra-processed foods, we’re breaking down how nutrition research actually gets done—and what that means for what should be on your plate.  Learn more about your ad choices. Visit podcastchoices.com/adchoices",
    "author": "Cynthia Graber and Nicola Twilley",
    "published": "Tue, 25 Mar 2025 21:20:00 -0000",
    "image": "https://www.podtrac.com/pts/redirect.mp3/pdst.fm/e/chrt.fm/track/524GE/traffic.megaphone.fm/VMP3408860076.mp3?updated=1742937913",
    "source": "https://www.omnycontent.com/d/playlist/aaea4e69-af51-495e-afc9-a9760146922b/2a195077-f014-41d2-8313-ab190186b4c2/277bcd5c-0a05-4c14-8ba6-ab190186b4d5/podcast.rss",
    "categories": null
  },
  {
    "id": "aff41335-0cff-4a14-a53d-9c93dbcef550",
    "title": "The Rise and Fall of Quinoa: From Incan \"Superfood\" to Buddha Bowl Basic",
    "link": "",
    "description": "Quinoa is everywhere these days, the base for a million salads and grain bowls. But, until recently, barely anyone outside the nutritious seed's ancient's homeland—the Peruvian and Bolivian Andes—had ever heard of it. This week, we're telling the story of how a gorgeous spinach-like plant traditionally grown in a remote, high-altitude region of South America was transformed into one of the hottest foods on the shelves at Whole Foods. This is a tale that began with Coloradan hippies, the deliberate invention of a new Peruvian gastronomy, and beer, but truly took off when the United Nations declared that this so-called \"superfood\" was the secret to solving global hunger, adapting to climate change, and rescuing Andean farmers from poverty. So, did quinoa deliver? Listen in now for the story behind your next Buddha bowl. Learn more about your ad choices. Visit podcastchoices.com/adchoices",
    "author": "Cynthia Graber and Nicola Twilley",
    "published": "Tue, 11 Mar 2025 19:55:17 -0000",
    "image": "https://www.podtrac.com/pts/redirect.mp3/pdst.fm/e/chrt.fm/track/524GE/traffic.megaphone.fm/VMP6442027650.mp3?updated=1741723262",
    "source": "https://www.omnycontent.com/d/playlist/aaea4e69-af51-495e-afc9-a9760146922b/2a195077-f014-41d2-8313-ab190186b4c2/277bcd5c-0a05-4c14-8ba6-ab190186b4d5/podcast.rss",
    "categories": null
  },
  {
    "id": "074e9fff-1828-4f38-93dd-8c2781cb5767",
    "title": "Relationships 2.0: The Price of Disconnection",
    "link": "https://www.stitcher.com",
    "description": "All of us want to \"seen\" by the people around us. We want to be recognized as unique individuals. Yet the experience of being seen in this way can be dispiritingly rare. This week, we kick off our \"Relationships 2.0\" series by talking with researcher Allison Pugh about the psychological benefits of what she calls \"connective labor.\" She explains why this labor is often overlooked, and how to cultivate the superpower of making other people feel seen.  In this episode, you'll learn: *The definition of connective labor, and why this skill is like \"engine grease\" for our personal and professional relationships.*Why connective labor is vital to success in a surprisingly broad array of careers. *The gender stereotypes around connective labor, and why these stereotypes overlook the role that men play as connectors. *How connective labor affects our mental and physical health.*How connective labor by teachers may affect students' ability to learn. *How to slow down in interactions with other people and explore the emotional context behind their words. If you have a follow-up question for Allison Pugh after listening to this episode, and you’d be willing to share it with the Hidden Brain audience, please record a voice memo on your phone. Once you’ve done so, email it to us at ideas@hiddenbrain.org. Use the subject line “connection.” And thanks for listening!",
    "author": "Hidden Brain Media",
    "published": "Mon, 31 Mar 2025 17:50:00 +0000",
    "image": "https://dts.podtrac.com/redirect.mp3/tracking.swap.fm/track/0bDcdoop59bdTYSfajQW/stitcher.simplecastaudio.com/df179a36-a022-41e3-bf7c-b7a4efc6f51e/episodes/e74331bf-e2ae-4ed3-a55c-d80c6e283ebc/audio/128/default.mp3?aid=rss_feed\u0026awCollectionId=df179a36-a022-41e3-bf7c-b7a4efc6f51e\u0026awEpisodeId=e74331bf-e2ae-4ed3-a55c-d80c6e283ebc\u0026feed=kwWc0lhf",
    "source": "https://feeds.npr.org/510308/podcast.xml",
    "categories": null
  },
  {
    "id": "e29423ae-5bab-45a5-8eb8-58a44f1e76c2",
    "title": "The Moments that Change Us",
    "link": "https://www.stitcher.com",
    "description": "Often in life, we find ourselves wrestling with a decision. But in running these mental calculations, there's something we rarely consider about the future: we might not be the same person when we get there. This week, philosopher L.A. Paul explores how life-altering events reshape who we are.Want more of our work on understanding your future self? Give these Hidden Brain episodes a listen: https://hiddenbrain.org/podcast/you-2-0-how-to-see-yourself-clearly/https://hiddenbrain.org/podcast/you-2-0-decide-already/https://hiddenbrain.org/podcast/you-2-0-your-future-is-now/https://hiddenbrain.org/podcast/the-ventilator/And for the latest insights about human behavior, delivered straight to your inbox, sign up for the weekly Hidden Brain newsletter! Each issue brings you the latest research, along with a brain teaser and a moment of joy. You can read and subscribe here: https://news.hiddenbrain.org/",
    "author": "Hidden Brain Media",
    "published": "Mon, 24 Mar 2025 19:00:00 +0000",
    "image": "https://dts.podtrac.com/redirect.mp3/tracking.swap.fm/track/0bDcdoop59bdTYSfajQW/stitcher.simplecastaudio.com/df179a36-a022-41e3-bf7c-b7a4efc6f51e/episodes/1ea1df36-4e77-4932-8315-abf1a1d6545b/audio/128/default.mp3?aid=rss_feed\u0026awCollectionId=df179a36-a022-41e3-bf7c-b7a4efc6f51e\u0026awEpisodeId=1ea1df36-4e77-4932-8315-abf1a1d6545b\u0026feed=kwWc0lhf",
    "source": "https://feeds.npr.org/510308/podcast.xml",
    "categories": null
  },
  {
    "id": "9148dd79-9775-426e-8797-50f0978f00d1",
    "title": "This Tree Wants to Be Struck by Lightning",
    "link": "https://www.nytimes.com/2025/04/01/science/trees-lightning-rainforest.html",
    "description": "Before a discovery in a Panamanian rainforest, “it seemed impossible that lightning could be a good thing for the trees,” a scientist said.",
    "author": "Rebecca Dzombak",
    "published": "Tue, 01 Apr 2025 20:31:54 +0000",
    "image": "https://static01.nyt.com/images/2025/04/01/science/01HS-tb-lightning-tree/01HS-tb-lightning-tree-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Science.xml",
    "categories": [
      "Lightning",
      "Trees and Shrubs",
      "Forests and Forestry",
      "Research",
      "Panama",
      "your-feed-science"
    ]
  },
  {
    "id": "53a86e04-f66d-43ad-a382-2dca993f354c",
    "title": "How the Myanmar Earthquake Shook Skyscrapers in Bangkok",
    "link": "https://www.nytimes.com/2025/04/01/science/myanmar-earthquake-bangkok-skyscraper-collapse.html",
    "description": "Large quakes produce shaking at a variety of frequencies. Some waves can travel hundreds of miles, and are amplified by local geological conditions.",
    "author": "Thomas Fuller",
    "published": "Tue, 01 Apr 2025 16:22:59 +0000",
    "image": "https://static01.nyt.com/images/2025/04/01/multimedia/01INT-MYANMAR-QUAKE-EXPLAINER-promo-lkwq/01INT-MYANMAR-QUAKE-EXPLAINER-promo-lkwq-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/Science.xml",
    "categories": [
      "Myanmar Earthquake (March 28, 2025)",
      "Earthquakes",
      "Buildings (Structures)",
      "Geology",
      "Bangkok (Thailand)",
      "Mexico City (Mexico)"
    ]
  },
  {
    "id": "9631a8bd-c7b2-4f42-80f4-f20439390260",
    "title": "26 March, 2025 – Episode 1008 – Where is the Group Chat for Science?",
    "link": "https://www.twis.org/26-march-2025-episode-1008/",
    "description": "What is in the This Week in Science Podcast? This Week: Pig Livers, Planet Power, Meme Coin, Grabby Glucose, Genomic Bottleneck, Lithium Mining, Baby Brains, Shark Sounds, And Much More Science! Become a Patron! Check out the full unedited episode of our podcast on YouTube or Twitch. And, remember that you can find TWIS in […] The post 26 March, 2025 – Episode 1008 – Where is the Group Chat for Science? appeared first on This Week in Science - The Kickass Science Podcast.",
    "author": "Rachel Salin",
    "published": "Thu, 27 Mar 2025 21:23:11 +0000",
    "image": "https://traffic.libsyn.com/twis/TWIS_03_26_2025.mp3",
    "source": "http://www.twis.org/feed/",
    "categories": [
      "animals",
      "biology",
      "cognitive science",
      "computer science",
      "ecology",
      "end of the world",
      "energy",
      "mammals",
      "Medical technology",
      "medicine",
      "NASA",
      "physics",
      "science",
      "science and politics",
      "Science Education",
      "science history",
      "sexy scientists",
      "sharks",
      "space",
      "technology",
      "therapies",
      "Transplants",
      "z-Broadcasts",
      "Dr. Kiki",
      "Dr. Kiki Sanford",
      "Dr. Kirsten Sanford",
      "Justin Jackson",
      "Kirsten Sanford",
      "new media",
      "news",
      "Patreon",
      "podcast",
      "radio",
      "science news",
      "science podcast",
      "science policy",
      "science radio",
      "STEM",
      "talk",
      "This Week in Science",
      "TWIS"
    ]
  },
  {
    "id": "981f8279-2c9c-4aff-910a-f24d666bc742",
    "title": "19 March, 2025 – Episode 1007 – Can You Hear Us Now?",
    "link": "https://www.twis.org/19-march-2025-episode-1007-can-you-hear-us-now/",
    "description": "What is in the This Week in Science Podcast? This Week: Space Landings, Euclid, Sound Bending, CRISPR, Tsunamis, The Avocado Connection, Mouse Morticians, Mouse Chatter, Bird Chatter, And Much More Science to Hear! Become a Patron! Check out the full unedited episode of our podcast on YouTube or Twitch. And, remember that you can find […] The post 19 March, 2025 – Episode 1007 – Can You Hear Us Now? appeared first on This Week in Science - The Kickass Science Podcast.",
    "author": "Rachel Salin",
    "published": "Thu, 20 Mar 2025 20:54:16 +0000",
    "image": "https://traffic.libsyn.com/twis/TWIS_03_19_2025.mp3",
    "source": "http://www.twis.org/feed/",
    "categories": [
      "animals",
      "astronauts",
      "biology",
      "birds",
      "cell biology",
      "cognitive science",
      "computer science",
      "CRISPR",
      "end of the world",
      "genetics",
      "geography",
      "global warming",
      "ISS",
      "Language",
      "mammals",
      "medicine",
      "neuroscience",
      "pharmacology",
      "Pregnancy",
      "psychology",
      "science",
      "Science Education",
      "space",
      "space exploration",
      "spacecraft",
      "technology",
      "therapies",
      "z-Broadcasts",
      "Dr. Kiki",
      "Dr. Kiki Sanford",
      "Dr. Kirsten Sanford",
      "Justin Jackson",
      "Kirsten Sanford",
      "new media",
      "news",
      "Patreon",
      "podcast",
      "radio",
      "science news",
      "science podcast",
      "science policy",
      "science radio",
      "STEM",
      "talk",
      "This Week in Science",
      "TWIS"
    ]
  },
  {
    "id": "5b41a7be-38d7-4965-a58a-e4941e539b72",
    "title": "What if human blood were toxic to mosquitoes? A drug can make it so",
    "link": "https://www.nature.com/articles/d41586-025-00973-9",
    "description": "",
    "author": "",
    "published": "2025-04-02",
    "image": "",
    "source": "https://www.nature.com/nature.rss",
    "categories": null
  },
  {
    "id": "5aa3fed0-1897-44f9-91f2-cdb65bbaa72c",
    "title": "Author Correction: Controlled patterning of crystalline domains by frontal polymerization",
    "link": "https://www.nature.com/articles/s41586-025-08934-y",
    "description": "",
    "author": "Justine E. Paul",
    "published": "2025-04-01",
    "image": "",
    "source": "https://www.nature.com/nature.rss",
    "categories": null
  },
  {
    "id": "b7d63e45-45fb-4bd9-9120-758e67690a63",
    "title": "Episode 562 - Shawn Carlow",
    "link": "https://probablyscience.libsyn.com/episode-562-shawn-carlow",
    "description": "Writer/comedian Shawn Carlow (@shawncarlow) joins Jesse, Andy and Matt to talk about his new book People of the Titanic: 30 Tales of Extra-Doomed Souls Who Sailed on The Ship of Dreams, mouse-to-mouse resuscitation, what your poop schedule says about your health and physicists creating a supersolid out of light.",
    "author": "",
    "published": "Mon, 31 Mar 2025 22:30:00 +0000",
    "image": "https://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/secure/probablyscience/Episode_562_-_Shawn_Carlow.mp3?dest-id=88459",
    "source": "https://probablyscience.libsyn.com/rss",
    "categories": null
  },
  {
    "id": "0b110a86-9fea-4e1b-9ba6-4aaa712aa237",
    "title": "Episode 561 - Live from Perth with Ross Noble, Kirsty Webeck and Paul Savage",
    "link": "https://probablyscience.libsyn.com/episode-561-live-from-perth-with-paul-savage-kirsty-webeck-and-ross-noble",
    "description": "Live from Perth, Matt is joined by Ross Noble, Kirsty Webeck and Paul Savage to talk about if you can cook a chicken by throwing ice cubes at it, dolphins communicating with pee streams, dormant volcanoes that aren’t that dormant and astronauts’ eyesight.",
    "author": "",
    "published": "Tue, 18 Mar 2025 21:54:00 +0000",
    "image": "https://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/secure/probablyscience/Episode_561_-_Live_from_Perth_with_Ross_Noble_Kirsty_Webeck_and_Paul_Savage.mp3?dest-id=88459",
    "source": "https://probablyscience.libsyn.com/rss",
    "categories": null
  },
  {
    "id": "1c0d1aae-1e84-4589-93ab-1fd7944c6f41",
    "title": "Malthusian Swerve",
    "link": "https://www.wnycstudios.org/podcasts/radiolab/projects/podcasts",
    "description": "Earth can sustain life for another 100 million years, but can we?In this episode, we partnered with the team at Planet Money to take stock of the essential raw materials that enable us to live as we do here on Earth—everything from sand to copper to oil— and tally up how much we have left. Are we living with reckless abandon? And if so, is there even a way to stop? This week, we bring you a conversation that’s equal parts terrifying and fascinating, featuring bird poop, daredevil drivers, and some staggering back-of-the-envelope math.EPISODE CREDITS:Reported by - Jeff Guo and Latif NasserProduced by - Pat Walters and Soren Wheelerwith production help from - Sindhu Gnanasambandan and editing help from  - Alex Goldmark and Jess JiangFact-checking by - Natalie Middleton  Signup for our newsletter!! It includes short essays, recommendations, and details about other ways to interact with the show. Sign up (https://radiolab.org/newsletter)!Radiolab is supported by listeners like you. Support Radiolab by becoming a member of The Lab (https://members.radiolab.org/) today.Follow our show on Instagram, Twitter and Facebook @radiolab, and share your thoughts with us by emailing radiolab@wnyc.org.Leadership support for Radiolab’s science programming is provided by the Gordon and Betty Moore Foundation, Science Sandbox, a Simons Foundation Initiative, and the John Templeton Foundation. Foundational support for Radiolab was provided by the Alfred P. Sloan Foundation.",
    "author": "WNYC Studios",
    "published": "Fri, 28 Mar 2025 14:00:00 +0000",
    "image": "https://pscrb.fm/rss/p/mgln.ai/e/14/prfx.byspotify.com/e/dts.podtrac.com/pts/redirect.mp3/waaa.wnyc.org/758af4c0-a2c3-47ec-a2d8-05f41bfbde51/episodes/8bfa1535-f87e-469b-93f9-3288f9202b63/audio/128/default.mp3?aid=rss_feed\u0026awCollectionId=758af4c0-a2c3-47ec-a2d8-05f41bfbde51\u0026awEpisodeId=8bfa1535-f87e-469b-93f9-3288f9202b63\u0026feed=EmVW7VGp",
    "source": "http://feeds.wnyc.org/radiolab",
    "categories": [
      "storytelling. oil",
      " planet money",
      " economic growth",
      " copper",
      " life on earth",
      " scarce resources",
      " sand",
      " fossil fuels"
    ]
  },
  {
    "id": "317b7bb4-adb1-4711-a91f-8551ec9764cc",
    "title": "Everybody's Got One",
    "link": "https://www.wnycstudios.org/podcasts/radiolab/projects/podcasts",
    "description": "We all think we know the story of pregnancy. Sperm meets egg, followed by nine months of nurturing, nesting, and quiet incubation. this story isn’t the nursery rhyme we think it is. In a way, it’s a struggle, almost like a tiny war. And right on the front lines of that battle is another major player on the stage of pregnancy that not a single person on the planet would be here without. An entirely new organ: the placenta.In this episode, which we originally released in 2021, we take you on a journey through the 270-day life of this weird, squishy, gelatinous orb, and discover that it is so much more than an organ. It’s a foreign invader. A piece of meat. A friend and parent. And it’s perhaps the most essential piece in the survival of our kind.Special thanks to Diana Bianchi, Julia Katz, Sam Behjati, Celia Bardwell-Jones, Mathilde Cohen, Hannah Ingraham, Pip Lipkin, and Molly Fassler.EPISODE CREDITS: Reported by - Heather Radke and Becca Bresslerwith help from - Molly WebsterProduced by - Becca Bresslerwith help from - Pat Walters, Maria Paz GutierrezEPISODE CITATIONS:Articles:Check out Harvey’s latest paper published with Julia Katz.Sam Behjati's latest paper on the placenta as a \"genetic dumping ground\". Signup for our newsletter!! It includes short essays, recommendations, and details about other ways to interact with the show. Sign up (https://radiolab.org/newsletter)!Radiolab is supported by listeners like you. Support Radiolab by becoming a member of The Lab (https://members.radiolab.org/) today.Follow our show on Instagram, Twitter and Facebook @radiolab, and share your thoughts with us by emailing radiolab@wnyc.org.Leadership support for Radiolab’s science programming is provided by the Gordon and Betty Moore Foundation, Science Sandbox, a Simons Foundation Initiative, and the John Templeton Foundation. Foundational support for Radiolab was provided by the Alfred P. Sloan Foundation.",
    "author": "WNYC Studios",
    "published": "Fri, 21 Mar 2025 14:00:00 +0000",
    "image": "https://pscrb.fm/rss/p/mgln.ai/e/14/prfx.byspotify.com/e/dts.podtrac.com/pts/redirect.mp3/waaa.wnyc.org/758af4c0-a2c3-47ec-a2d8-05f41bfbde51/episodes/4aecfd07-a3bd-4078-9242-edefd2e314e5/audio/128/default.mp3?aid=rss_feed\u0026awCollectionId=758af4c0-a2c3-47ec-a2d8-05f41bfbde51\u0026awEpisodeId=4aecfd07-a3bd-4078-9242-edefd2e314e5\u0026feed=EmVW7VGp",
    "source": "http://feeds.wnyc.org/radiolab",
    "categories": [
      "melissa wilson",
      " harvey kliman",
      " sexual_reproduction",
      " in_utero",
      " tina delisle",
      " pregnancy",
      " storytelling",
      " motherhood",
      " mammals",
      " placenta"
    ]
  },
  {
    "id": "7863282f-4b45-4d14-b25c-6b1389335dbd",
    "title": "Doctor Behind Award-Winning Parkinson’s Research Among Scientists Purged From NIH",
    "link": "https://www.wired.com/story/doctor-breakthrough-parkinsons-research-nih-purge/",
    "description": "Leading scientists at the National Institutes of Health, the US’s leading medical research agency, were swept up Tuesday in the Trump administration’s latest firing blitz.",
    "author": "Dell Cameron, Emily Mullin",
    "published": "Wed, 02 Apr 2025 00:12:11 +0000",
    "image": "",
    "source": "https://www.wired.com/feed/category/science/latest/rss",
    "categories": [
      "Science",
      "Science / Health",
      "Public Health"
    ]
  },
  {
    "id": "d59607a4-8de4-481b-8b6c-724980db2cbf",
    "title": "Yuval Noah Harari: ‘How Do We Share the Planet With This New Superintelligence?’",
    "link": "https://www.wired.com/story/questions-answered-by-yuval-noah-harari-for-wired-ai-artificial-intelligence-singularity/",
    "description": "The academic and author discusses what to expect from the singularity, the need for AI self-correcting mechanisms, and what hope there is for superintelligence safeguarding democracy.",
    "author": "Michiaki Matsushima",
    "published": "Tue, 01 Apr 2025 09:00:00 +0000",
    "image": "",
    "source": "https://www.wired.com/feed/category/science/latest/rss",
    "categories": [
      "Science",
      "Business / Artificial Intelligence",
      "Singularity"
    ]
  },
  {
    "id": "d1ac0234-b9ae-48b2-bff0-f973bfbf477e",
    "title": "Sawbones: Why Don’t Edema and Enema Rhyme?",
    "link": "https://sawbones.simplecast.com/episodes/sawbones-why-dont-edema-and-enema-rhyme-VTS2uvCA",
    "description": "Justin has gathered all the strangest listeners (questions) to quiz Dr. Sydnee with all of your weird and fun medical questions! Is Gatorade actually salty and NOT sweet? Are people with cat allergies allergic to big cats? Can you fart and spread norovirus? Can a fetus taste? And the most important question of all: who are Justin and Dr. Sydnee's favorite fictional doctors?Music: \"Medicines\" by The Taxpayers https://taxpayers.bandcamp.com/National Immigration Project: https://nipnlg.org/about/who-we-are",
    "author": "Justin \u0026 Dr. Sydnee McElroy",
    "published": "Tue, 1 Apr 2025 16:00:00 +0000",
    "image": "https://afp-9384.calisto.simplecastaudio.com/a5445fde-0e70-4659-8f18-442f9aabbaac/episodes/931219a6-098a-45ec-8d28-2c6e0bb58612/audio/128/default.mp3?aid=rss_feed\u0026awCollectionId=a5445fde-0e70-4659-8f18-442f9aabbaac\u0026awEpisodeId=931219a6-098a-45ec-8d28-2c6e0bb58612\u0026feed=y1LF_sn2",
    "source": "https://feeds.simplecast.com/y1LF_sn2",
    "categories": null
  },
  {
    "id": "6ff4a698-4b77-4fe5-8067-40109fc521f2",
    "title": "Sawbones: Dr. Odyssey: Shark Week",
    "link": "https://sawbones.simplecast.com/episodes/sawbones-dr-odyssey-shark-week-26bRBxoQ",
    "description": "What medical drama does a doctor on a cruise ship get involved in? Dr. Sydnee and Justin talk about Dr. Odyssey: Shark Attack!, and the follow-up,  Dr. Odyssey: Shark Attack! Part 2: Orca. It's a wild ride, but some of the medical beats are surprisingly accurate.Music: \"Medicines\" by The Taxpayers https://taxpayers.bandcamp.com/Harmony House: https://harmonyhousewv.com/",
    "author": "Justin \u0026 Dr. Sydnee McElroy",
    "published": "Tue, 25 Mar 2025 16:00:00 +0000",
    "image": "https://afp-9384.calisto.simplecastaudio.com/a5445fde-0e70-4659-8f18-442f9aabbaac/episodes/3092ef58-e201-43fd-987b-79572065b406/audio/128/default.mp3?aid=rss_feed\u0026awCollectionId=a5445fde-0e70-4659-8f18-442f9aabbaac\u0026awEpisodeId=3092ef58-e201-43fd-987b-79572065b406\u0026feed=y1LF_sn2",
    "source": "https://feeds.simplecast.com/y1LF_sn2",
    "categories": null
  },
  {
    "id": "adb2cf81-eb4c-4124-a956-a9081be5d7a3",
    "title": "Mammals were adapting from life in the trees to living on the ground before dinosaur-killing asteroid, research reveals",
    "link": "https://phys.org/news/2025-04-mammals-life-trees-ground-dinosaur.html",
    "description": "More mammals were living on the ground several million years before the mass extinction event that wiped out the dinosaurs, new research led by the University of Bristol has revealed.",
    "author": "",
    "published": "Tue, 01 Apr 2025 20:00:01 EDT",
    "image": "",
    "source": "https://phys.org/rss-feed/",
    "categories": [
      "Evolution Paleontology \u0026 Fossils"
    ]
  },
  {
    "id": "61e48e30-8fcf-4636-a011-af1eb492449a",
    "title": "Illuminating single atoms for sustainable propylene production",
    "link": "https://phys.org/news/2025-04-illuminating-atoms-sustainable-propylene-production.html",
    "description": "More than 150 million metric tons of propylene are produced annually, making it one of the most widespread chemicals used in the chemical industry.",
    "author": "",
    "published": "Tue, 01 Apr 2025 17:42:04 EDT",
    "image": "",
    "source": "https://phys.org/rss-feed/",
    "categories": [
      "Polymers Analytical Chemistry"
    ]
  },
  {
    "id": "118598e9-fb56-469d-80af-5e2325aba45b",
    "title": "NIH Director Removes Four Main Scientists amid Massive Staff Purge",
    "link": "https://www.scientificamerican.com/article/nih-director-removes-four-main-scientists-amid-massive-staff-purge/",
    "description": "The Trump Administration has fired four leaders and thousands of employees at the National Institutes of Health in \"one of the darkest days\"",
    "author": "",
    "published": "Tue, 01 Apr 2025 22:15:00 +0000",
    "image": "",
    "source": "http://rss.sciam.com/ScientificAmerican-Global",
    "categories": null
  },
  {
    "id": "09290e6d-537d-408d-9a3e-13bf7b024940",
    "title": "SpaceX’s Fram2 Mission Sends Four Private Astronauts into Polar Orbit",
    "link": "https://www.scientificamerican.com/article/spacexs-fram2-mission-sends-four-private-astronauts-into-polar-orbit/",
    "description": "The privately funded Fram2 mission is the first ever to take astronauts into polar orbit—and the latest sign of a “new normal” for human spaceflight",
    "author": "",
    "published": "Tue, 01 Apr 2025 21:00:00 +0000",
    "image": "",
    "source": "http://rss.sciam.com/ScientificAmerican-Global",
    "categories": null
  },
  {
    "id": "c219f9b0-d2cc-44bf-a175-ff527530865f",
    "title": "The tragic termination of the Diabetes Prevention Program Outcomes Study",
    "link": "https://sciencebasedmedicine.org/the-tragic-termination-of-the-diabetes-prevention-program-outcomes-study/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-tragic-termination-of-the-diabetes-prevention-program-outcomes-study",
    "description": "An invaluable resource is being starved to death with no scientific or ethical justification The post The tragic termination of the Diabetes Prevention Program Outcomes Study first appeared on Science-Based Medicine.",
    "author": "David Weinberg",
    "published": "Tue, 01 Apr 2025 07:30:00 +0000",
    "image": "",
    "source": "https://sciencebasedmedicine.org/feed/",
    "categories": [
      "Clinical Trials",
      "Science and Medicine",
      "Columbia University",
      "diabetes",
      "DPPOS",
      "Grant defunding"
    ]
  },
  {
    "id": "f1346fa7-2176-40f8-8632-d030d138e676",
    "title": "“Make America Healthy Again”: The new Lysenkoism",
    "link": "https://sciencebasedmedicine.org/make-america-healthy-again-the-new-lysenkoism/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=make-america-healthy-again-the-new-lysenkoism",
    "description": "Trofim Lysenko was a Soviet scientist whose dogmatic science denialism led to mass famine when his ideas were applied to agriculture. Robert F. Kennedy Jr. is a lot like Lysenko in his science denial. Will his results be as disastrous? The post “Make America Healthy Again”: The new Lysenkoism first appeared on Science-Based Medicine.",
    "author": "David Gorski",
    "published": "Mon, 31 Mar 2025 13:40:00 +0000",
    "image": "",
    "source": "https://sciencebasedmedicine.org/feed/",
    "categories": [
      "Pharmaceuticals",
      "Politics and Regulation",
      "Public Health",
      "Vaccines",
      "antivaccine",
      "CDC",
      "COVID-19",
      "COVID-19 vaccine",
      "Donald Trump",
      "FDA",
      "Lysenkoism",
      "make America healthy again",
      "NIH",
      "Operation Warp Speed",
      "Peter Marks",
      "quackery",
      "Robert F. Kennedy Jr.",
      "Trofim Lysenko",
      "vaccines"
    ]
  },
  {
    "id": "fa380fdd-9192-403c-931a-bb784661a006",
    "title": "The brilliance of \"Bluey\" — and why parents love it, too | Sarina Petersen",
    "link": "https://www.ted.com/talks/sarina_petersen_the_brilliance_of_bluey_and_why_parents_love_it_too?rss",
    "description": "\"Bluey,\" the Australian children's show, is a global phenomenon. But how did a cartoon for kids become a smash hit with adults, too? Sarina Petersen, who studies social psychology, explains how \"Bluey\" keeps viewers of all ages hooked with a unique blend of humor, authenticity and nostalgia.",
    "author": "Sarina Petersen",
    "published": "Tue, 01 Apr 2025 15:01:05 +0000",
    "image": "https://download.ted.com/products/197020.mp4?apikey=TEDRSS",
    "source": "https://pa.tedcdn.com/feeds/talks.rss",
    "categories": [
      "Higher Education",
      "TED"
    ]
  },
  {
    "id": "0f1dd663-b447-4493-ac91-4377bd383a0d",
    "title": "Is parenting advice leading to more anxious kids? | Mathilde H. Ross",
    "link": "https://www.ted.com/talks/mathilde_h_ross_is_parenting_advice_leading_to_more_anxious_kids?rss",
    "description": "Today's experts often overwhelm parents and guardians with alarming warnings of treacherous roads ahead for their children, sometimes turning dedication into anxiety and obsessiveness. Instead of chasing trends, psychiatrist Mathilde H. Ross recommends trusting your instincts — and picking up a surprising source of simple, positive guidance on bonding and development. Her reassuring message? \"You are quite literally evolved for this.\"",
    "author": "Mathilde H. Ross",
    "published": "Mon, 31 Mar 2025 14:57:48 +0000",
    "image": "https://download.ted.com/products/195725.mp4?apikey=TEDRSS",
    "source": "https://pa.tedcdn.com/feeds/talks.rss",
    "categories": [
      "Higher Education",
      "TED"
    ]
  },
  {
    "id": "dcc5b040-b64d-4d13-b978-1027bee5cb28",
    "title": "Squirting: What's Really Happening?!",
    "link": "",
    "description": "To start off the new season we’re getting into the science of one of the most controversial and taboo sex topics around. Squirting! For some people, it’s a major sex goal — but for others, it’s a source of major embarrassment. And it turns out that people have been writing or talking about squirting and female ejaculation for CENTURIES. So in this episode, we’re going to find out: what IS squirting (like, what is this fluid??), how common is it, and if you want to start doing it … how can you? We’ll hear from Sex Educator and World Record Holder, Lola Jean. As well as Professor Caroline Pukall, Dr. Nan Wise, Professor Helen O’Connell, and Dr. Samuel Salama.  Find our transcript here: bit.ly/4iIVQcc In this episode, we cover: (00:00) Welcome to Cirque du Squirt (08:26) History of female ejaculation (13:18) Suspect 1: Vaginal lubrication (15:55) Suspect 2: Pee (24:41) Suspect 3: Chemical X? (29:47) Female prostate (36:00) Why does it feel like that? (39:26) What about penises? (42:03) Can you learn to squirt? Credits: This episode was produced by Ekedi Fausther-Keeys, with help from Blythe Terrell, Wendy Zukerman, Meryl Horn, Michelle Dang, and Rose Rimler. We’re edited by Blythe Terrell. Video editing, audio mix and graphics by Bobby Lord. Graphics help from Michelle Dang. Illustrations by Scarlette Baccini. Fact checking by Eva Dasher. Music by Bobby Lord, Peter Leonard, Bumi Hidaka, and So Wylie. Interpreting by Kana Hatakeyama, translation help from Ben Milam.  Thanks also to Dr. Devon Hensel, and Dr. Leslie Rickey. Recording and logistics help from Michelle Kitchen, Spencer Howard and Nick Johnson. Recording help from Abi McNeil. Special thanks to Roland Campos. Thanks to Cameron Silzle and Arsonhouse Entertainment. Thanks to Lola Jean and everyone who spoke to us at Cirque du Squirt. Science Vs is a Spotify Studios Original. Listen for free on Spotify or wherever you get your podcasts. Follow us and tap the bell for episode notifications. Learn more about your ad choices. Visit podcastchoices.com/adchoices",
    "author": "Spotify Studios",
    "published": "Thu, 27 Mar 2025 09:00:00 -0000",
    "image": "https://chrt.fm/track/15E3G4/traffic.megaphone.fm/GLT5417947998.mp3?updated=1743194945",
    "source": "http://feeds.gimletmedia.com/ScienceVs",
    "categories": null
  },
  {
    "id": "411e821a-2435-422d-bfce-e3396116b1b3",
    "title": "We're Back to Science Harder Than Ever",
    "link": "",
    "description": "Have you been missing your weekly dose of science?? Well, we've got good news: Science Vs is BACK next week, and we’ll be tackling ADHD, squirting, creatine, the carnivore diet, bird flu, fluoride, meth, memory and much more. New episodes start March 27. Fact ya soon! Learn more about your ad choices. Visit podcastchoices.com/adchoices",
    "author": "Spotify Studios",
    "published": "Thu, 20 Mar 2025 09:00:00 -0000",
    "image": "https://chrt.fm/track/15E3G4/traffic.megaphone.fm/GLT8135933965.mp3?updated=1742396315",
    "source": "http://feeds.gimletmedia.com/ScienceVs",
    "categories": null
  },
  {
    "id": "562ab7c9-c815-4cfa-9548-5125ae77f18b",
    "title": "Nature's Shapes - Dave Gorman, Sarah Hart and Thomas Woolley",
    "link": "http://www.bbc.co.uk/programmes/m0028d2q",
    "description": "Brian Cox and Robin Ince unpick the hidden codes behind the shapes we see in nature with mathematicians Sarah Hart \u0026 Thomas Woolley and comedian Dave Gorman.The panel marvel at how evolution so often beats mathematicians to finding the most elegant solutions, after all, it’s had millennia to experiment. How do trees achieve the optimal distribution of leaves and why are tortoise shells so geometrically exciting?Plus we learn why the cheetah got its spots, thanks to the work of Thomas Woolley’s mathematical hero, Alan Turing, how numbers can be more or less irrational, and why Dave Gorman has a vendetta against oblongs. Producer: Melanie Brown Exec Producer: Alexandra Feachem Assistant Producer: Olivia Jani",
    "author": "BBC Radio 4",
    "published": "Wed, 26 Mar 2025 07:00:00 +0000",
    "image": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download-rss/proto/http/vpid/p0kqbvkv.mp3",
    "source": "https://podcasts.files.bbci.co.uk/b00snr0w.rss",
    "categories": null
  },
  {
    "id": "e06b258e-7083-4bae-a2dc-862d9eafb81e",
    "title": "The Sound of Music - Brian Eno, Sam Bennett and Trevor Cox",
    "link": "http://www.bbc.co.uk/programmes/m0028d2h",
    "description": "Brian Cox and Robin Ince explore the history of music recording, joined by acoustics professor Trevor Cox, music professor Sam Bennett and musician and producer Brian Eno. Together they guide us through the evolution of sound recording, a space in which technology hasn’t stood still since its advent in the mid-1800s. We hear the very first recognisable recording of a voice made with a brush making marks in soot and put a spotlight on the Fairlight CMI, a revolutionary digital synthesizer of the '70s, used in Brian’s records (Cox \u0026 Eno’s!)Plus, we run an audio experiment with our live audience who turn themselves into our in-house digital orchestra, with the help of their mobile phones. Now that lots of people have several devices that can play sound, new technology is harnessing this to create a more immersive experience – which (kind of) worked in our experiment!Producer: Melanie Brown Exec Producer: Alexandra Feachem Assistant Producer: Olivia Jani",
    "author": "BBC Radio 4",
    "published": "Wed, 19 Mar 2025 07:00:00 +0000",
    "image": "http://open.live.bbc.co.uk/mediaselector/6/redir/version/2.0/mediaset/audio-nondrm-download-rss/proto/http/vpid/p0kqbvp4.mp3",
    "source": "https://podcasts.files.bbci.co.uk/b00snr0w.rss",
    "categories": null
  },
  {
    "id": "ab32f1df-ca5f-4369-9e94-70a735142456",
    "title": "Seaforesting Carbon with Sam Elsom (424)",
    "link": "https://shirtloadsofscience.libsyn.com/sos-423-se-seaforest-mix",
    "description": "Atmospheric Carbon is burning us up. CO₂ is the big culprit but what about methane? Industry calls it \"natural gas\" but sheep and cattle belch millions of tons. Australian scientists have a very cool answer with seaweed. drkarl.com seaforest.com.au",
    "author": "",
    "published": "Sun, 30 Mar 2025 01:00:00 +0000",
    "image": "https://traffic.libsyn.com/secure/shirtloadsofscience/Seaforesting_Carbon_with_Sam_Elson_424.mp3?dest-id=436327",
    "source": "https://shirtloadsofscience.libsyn.com/rss",
    "categories": [
      "science",
      "climate",
      "methane",
      "Sydney",
      "kruszelnicki",
      "drkarlcom",
      "shirtloadsseaforest"
    ]
  },
  {
    "id": "ba0d44fd-1293-444a-a57d-c1557a3551e0",
    "title": "Food Noise with Professor Clare Collins (423)",
    "link": "https://shirtloadsofscience.libsyn.com/food-noise-with-prof-collins-422",
    "description": "Weight loss medicines are never easy. What happens when your brain says you're full? Dr Karl and Professor Clare Collins explore the promises and pitfalls plus the ones that occasionally kill. drkarl.com",
    "author": "",
    "published": "Sun, 23 Mar 2025 01:00:00 +0000",
    "image": "https://traffic.libsyn.com/secure/shirtloadsofscience/SOS_422_CC_Noise_mix.mp3?dest-id=436327",
    "source": "https://shirtloadsofscience.libsyn.com/rss",
    "categories": [
      "science",
      "diet",
      "Sydney",
      "kruszelnicki",
      "drkarlcom",
      "shirtloadscollins"
    ]
  }
]
