{
  "id": "47355fab-fd10-40f8-9cde-e58642d8b0e6",
  "title": "North of North Renewed for Season 2 at Netflix",
  "link": "https://tvline.com/news/north-of-north-season-2-renewed-netflix-1235441331/",
  "description": "Netflix is heading up north, and staying there: The streamer has renewed the Arctic comedy North of North, starring Anna Lambe, for a second season, TVLine has learned. North of North (a co-production with Canada’s CBC) stars Lambe as Siaja, a young Inuk mother living in the fictional town of Ice Cove who “wants to […]",
  "author": "Dave Nemetz",
  "published": "Wed, 30 Apr 2025 00:00:00 +0000",
  "source": "https://tvline.com/feed/",
  "categories": [
    "News",
    "Netflix",
    "North of North",
    "renewals"
  ],
  "byline": "Dave Nemetz",
  "length": 1404,
  "excerpt": "Netflix has renewed the Arctic comedy 'North of North,' starring Anna Lambe, for Season 2 — get the details.",
  "siteName": "TVLine",
  "favicon": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=192",
  "text": "Netflix is heading up north, and staying there: The streamer has renewed the Arctic comedy North of North, starring Anna Lambe, for a second season, TVLine has learned. North of North (a co-production with Canada’s CBC) stars Lambe as Siaja, a young Inuk mother living in the fictional town of Ice Cove who “wants to build a new future for herself after a spontaneous — and extremely public — exit from her marriage,” per the official synopsis. “But it won’t be easy in a small Arctic town where everybody knows your business.” It debuted on Netflix earlier this month with an eight-episode freshman season. The supporting cast includes Maika Harper as Siaja’s mom Neevee, Jay Ryan as her estranged dad Alistair, Kelly William as her ex-husband Ting, Braeden Clarke as new love interest Kuuk, Keira Belle Cooper as Siaja’s daughter Bun and Mary Lynn Rajskub as town manager Helen. Stacey Aglok MacDonald and Alethea Arnaquq-Baril co-created the series and serve as executive producers. “When I got the call from Alethea, Stacey and [EP] Miranda [de Pencier] about North of North being renewed for a second season, my heart exploded in the best way possible!” Lambe said in a statement. “I’m so excited and overwhelmed with joy, I can’t wait to head back to Ice Cove!” Are you ready to bundle up for another season of North of North? Let us know what you thought of Season 1 in the comments.",
  "image": "https://tvline.com/wp-content/uploads/2025/04/north-of-north-renewed-netflix-season-2.jpg?w=350",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\" data-social=\"true\" data-component=\"gutenberg-content\" data-template=\"article\" data-inner-width=\"content\"\u003e\u003cp\u003e\u003ca href=\"https://tvline.com/t/netflix/\" id=\"auto-tag_netflix_1\" data-tag=\"netflix\"\u003eNetflix\u003c/a\u003e is heading up north, and staying there: The streamer has renewed the Arctic comedy \u003cem\u003e\u003ca href=\"https://tvline.com/t/north-of-north/\" id=\"auto-tag_north-of-north_1\" data-tag=\"north-of-north\"\u003eNorth of North\u003c/a\u003e\u003c/em\u003e, starring Anna Lambe, for a second season, TVLine has learned.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eNorth of North\u003c/em\u003e (a co-production with Canada’s CBC) stars Lambe as Siaja, a young Inuk mother living in the fictional town of Ice Cove who “wants to build a new future for herself after a spontaneous — and extremely public — exit from her marriage,” per the official synopsis. “But it won’t be easy in a small Arctic town where everybody knows your business.” It debuted on Netflix earlier this month with an eight-episode freshman season.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eThe supporting cast includes Maika Harper as Siaja’s mom Neevee, Jay Ryan as her estranged dad Alistair, Kelly William as her ex-husband Ting, Braeden Clarke as new love interest Kuuk, Keira Belle Cooper as Siaja’s daughter Bun and Mary Lynn Rajskub as town manager Helen. Stacey Aglok MacDonald and Alethea Arnaquq-Baril co-created the series and serve as executive producers.\u003c/p\u003e\n\n\n\n\u003cp\u003e“When I got the call from Alethea, Stacey and [EP] Miranda [de Pencier] about \u003cem\u003eNorth of North\u003c/em\u003e being renewed for a second season, my heart exploded in the best way possible!” Lambe said in a statement. “I’m so excited and overwhelmed with joy, I can’t wait to head back to Ice Cove!”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eAre you ready to bundle up for another season of \u003cem\u003eNorth of North\u003c/em\u003e? Let us know what you thought of Season 1 in the comments.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-30T00:00:00Z",
  "modifiedTime": "2025-04-29T22:46:33Z"
}
