{
  "id": "6813a22a-2c15-4f89-a48f-b0d803e98c97",
  "title": "Disney+’s Long-Delayed Tiana Animated Series Has Officially Been Scrapped",
  "link": "https://tvline.com/news/tiana-tv-series-disney-plus-joyce-sherri-writer-1235057745/",
  "description": "Tiana won’t have her moment in the spotlight after all: The long-awaited animated series has been shelved by Walt Disney Animation Studios, TVLine has confirmed. Plans for the show — which was originally announced in 2020 and then delayed to 2024 — have officially been cancelled, as the studio abandons creating original longform content for […]",
  "author": "",
  "published": "Mon, 03 Mar 2025 20:25:00 +0000",
  "source": "https://tvline.com/feed/",
  "categories": [
    "News",
    "Disney Plus",
    "Joyce Sherri",
    "Tiana"
  ],
  "byline": "Nick Caruso",
  "length": 1321,
  "excerpt": "Walt Disney Animation has cancelled its plans for a 'Tiana' TV series — get details.",
  "siteName": "TVLine",
  "favicon": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=192",
  "text": "Tiana won’t have her moment in the spotlight after all: The long-awaited animated series has been shelved by Walt Disney Animation Studios, TVLine has confirmed. Plans for the show — which was originally announced in 2020 and then delayed to 2024 — have officially been cancelled, as the studio abandons creating original longform content for streaming. In addition to the Tiana series, the studio is also cancelling plans for an unannounced feature-length project that was set to go straight to Disney+. However, according to a source at Disney, lead writer and director Joyce Sherri will continue with the project, which is now being morphed into a special inspired by The Princess and the Frog. Sherri was a staff writer on Mike Flanagan’s Netflix horror miniseries Midnight Mass, and has also written and directed short films such as Beauty, Forever, Down, Down, Baby and The Family Romance. Tiana is described as a musical comedy starring the original film’s beloved restaurateur. Anika Noni Rose (Power) will once again provide the voice of the series’ titular character as she “sets off for a grand new adventure as the newly crowned Princess of Maldonia.” THR was first to report the news. Were you looking forward to the return of Princess Tiana? Let us know by dropping some comments below.",
  "image": "https://tvline.com/wp-content/uploads/2023/10/tiana.jpg?w=620",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\" data-social=\"true\" data-component=\"gutenberg-content\" data-template=\"article\" data-inner-width=\"content\"\u003e\u003cp\u003e\u003cem\u003e\u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://tvline.com/t/tiana\"\u003eTiana \u003c/a\u003e\u003c/em\u003ewon’t have her moment in the spotlight after all: The long-awaited animated series has been shelved by Walt Disney Animation Studios, TVLine has confirmed. \u003c/p\u003e\n\n\n\n\u003cp\u003ePlans for the show — which was \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://tvline.com/news/moana-tv-series-disney-plus-tiana-1234618442/\"\u003eoriginally announced in 2020\u003c/a\u003e and then delayed to 2024 — have officially been cancelled, as the studio abandons creating original longform content for streaming. In addition to the \u003cem\u003e\u003ca href=\"https://tvline.com/t/tiana/\" id=\"auto-tag_tiana_1\" data-tag=\"tiana\"\u003eTiana\u003c/a\u003e\u003c/em\u003e series, the studio is also cancelling plans for an unannounced feature-length project that was set to go straight to Disney+. \u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, according to a source at Disney, lead writer and director \u003ca href=\"https://tvline.com/t/joyce-sherri/\" id=\"auto-tag_joyce-sherri_1\" data-tag=\"joyce-sherri\"\u003eJoyce Sherri\u003c/a\u003e will continue with the project, which is now being morphed into a special inspired by \u003cem\u003eThe Princess and the Frog\u003c/em\u003e. Sherri was a staff writer on Mike Flanagan’s Netflix horror miniseries \u003cem\u003eMidnight Mass\u003c/em\u003e, and has also written and directed short films such as \u003cem\u003eBeauty, Forever, Down, Down, Baby \u003c/em\u003eand \u003cem\u003eThe Family Romance\u003c/em\u003e. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eTiana\u003c/em\u003e is described as a musical comedy starring the original film’s beloved restaurateur. Anika Noni Rose (\u003cem\u003ePower\u003c/em\u003e) will once again provide the voice of the series’ titular character as she “sets off for a grand new adventure as the newly crowned Princess of Maldonia.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.hollywoodreporter.com/business/business-news/tiana-disney-series-shelved-1236153297/\" data-type=\"link\" data-id=\"https://www.hollywoodreporter.com/business/business-news/tiana-disney-series-shelved-1236153297/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eTHR\u003c/a\u003e was first to report the news.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWere you looking forward to the return of Princess Tiana? Let us know by dropping some comments below\u003c/strong\u003e.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-03T20:25:00Z",
  "modifiedTime": "2025-03-03T20:51:50Z"
}
