{
  "id": "6927d9a8-5c37-4c7b-b9bd-8db46f96c12a",
  "title": "Casting News: Chi McBride Joins Netflix’s Harlan Coben Series and More",
  "link": "https://tvline.com/casting-news/chi-mcbride-i-will-find-you-cast-harlan-coben-1235428944/",
  "description": "Chi McBride is making a promise: I Will Find You. The Hawaii Five-O vet will star opposite Sam Worthington in Netflix’s adaptation of Harlan Coben’s aforementioned novel, our sister site Variety reports. Additionally, Jonathan Tucker (Westworld, Kingdom) has joined the show’s cast, per Deadline. In the limited series, “an innocent father (Worthington) serving life for […]",
  "author": "Vlada Gelman",
  "published": "Fri, 04 Apr 2025 22:00:23 +0000",
  "source": "https://tvline.com/feed/",
  "categories": [
    "Casting News",
    "casting-news",
    "Chi McBride",
    "I Will Find You",
    "Jonathan Tucker"
  ],
  "byline": "Vlada Gelman",
  "length": 1308,
  "excerpt": "'Hawaii Five-O' vet Chi McBride joins Netflix's limited series 'I Will Find You,' based on Harlan Coben's novel — find out who else has been cast!",
  "siteName": "TVLine",
  "favicon": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=192",
  "text": "Chi McBride is making a promise: I Will Find You. The Hawaii Five-O vet will star opposite Sam Worthington in Netflix’s adaptation of Harlan Coben’s aforementioned novel, our sister site Variety reports. Additionally, Jonathan Tucker (Westworld, Kingdom) has joined the show’s cast, per Deadline. In the limited series, “an innocent father (Worthington) serving life for the murder of his own son receives evidence that his child may still be alive—and must break out of prison to find out the truth,” reads the official synopsis. McBride will play Max Williams, “a legend in the FBI’s Fugitive Task Force who will doggedly pursue the escaped con David Burrough (Worthington) no matter how much it rips his personal life apart.” Meanwhile, Tucker is Police Sergeant Adam Mackenzie, a close friend of David’s who will help his pal in any way he can. The ensemble also includes Britt Lower (Severance), Milo Ventimiglia (This Is Us), Logan Browning (Dear White People) and Erin Richards (Gotham). In other recent casting news… * Power creator Courtney A. Kemp’s Netflix crime drama Nemesis has added Jeff Pierre (Walker), Sophina Brown (Bosch: Legacy, Twenties) and Cedric Joe (Women of the Movement) to its cast, per Deadline. Hit the comments with your thoughts on the above castings!",
  "image": "https://tvline.com/wp-content/uploads/2025/04/chi-mcbride.jpg?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\" data-social=\"true\" data-component=\"gutenberg-content\" data-template=\"article\" data-inner-width=\"content\"\u003e\u003cp\u003e\u003ca href=\"https://tvline.com/t/chi-mcbride/\" id=\"auto-tag_chi-mcbride_1\" data-tag=\"chi-mcbride\"\u003eChi McBride\u003c/a\u003e is making a promise: \u003cem\u003e\u003ca href=\"https://tvline.com/t/i-will-find-you/\" id=\"auto-tag_i-will-find-you_1\" data-tag=\"i-will-find-you\"\u003eI Will Find You\u003c/a\u003e\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe \u003cem\u003eHawaii Five-O\u003c/em\u003e vet will star opposite Sam Worthington in Netflix’s adaptation of Harlan Coben’s aforementioned novel, our sister site \u003cem\u003e\u003ca href=\"https://variety.com/2025/tv/news/harlan-coben-netflix-series-i-will-find-you-chi-mcbride-1236359969/\" target=\"_blank\"\u003eVariety\u003c/a\u003e\u003c/em\u003e reports. \u003c/p\u003e\n\n\n\n\u003cp\u003eAdditionally, \u003ca href=\"https://tvline.com/t/jonathan-tucker/\" id=\"auto-tag_jonathan-tucker_1\" data-tag=\"jonathan-tucker\"\u003eJonathan Tucker\u003c/a\u003e (\u003cem\u003eWestworld, Kingdom\u003c/em\u003e) has joined the show’s cast, per \u003ca href=\"https://Police%20Sergeant%20Adam%20Mackenzie.%20The%20character%20is%20the%20closest%20friend\" rel=\"nofollow\" target=\"_blank\"\u003eDeadline\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn the limited series, “an innocent father (Worthington) serving life for the murder of his own son receives evidence that his child may still be alive—and must break out of prison to find out the truth,” reads the official synopsis. McBride will play Max Williams, “a legend in the FBI’s Fugitive Task Force who will doggedly pursue the escaped con David Burrough (Worthington) no matter how much it rips his personal life apart.” Meanwhile, Tucker is Police Sergeant Adam Mackenzie, a close friend of David’s who will help his pal in any way he can.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eThe ensemble also includes \u003ca href=\"https://tvline.com/casting-news/britt-lower-milo-ventimiglia-i-will-find-you-cast-harlan-coben-1235424018/\"\u003eBritt Lower\u003c/a\u003e (\u003cem\u003eSeverance\u003c/em\u003e), \u003ca href=\"https://tvline.com/casting-news/britt-lower-milo-ventimiglia-i-will-find-you-cast-harlan-coben-1235424018/\"\u003eMilo Ventimiglia\u003c/a\u003e (\u003cem\u003eThis Is Us\u003c/em\u003e), Logan Browning (\u003cem\u003eDear White People\u003c/em\u003e) and Erin Richards (\u003cem\u003eGotham\u003c/em\u003e).\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eIn other recent casting news…\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e* \u003cem\u003ePower\u003c/em\u003e creator Courtney A. Kemp’s Netflix crime drama \u003cem\u003eNemesis\u003c/em\u003e has added Jeff Pierre (\u003cem\u003eWalker\u003c/em\u003e), Sophina Brown (\u003cem\u003eBosch: Legacy\u003c/em\u003e, \u003cem\u003eTwenties)\u003c/em\u003e and Cedric Joe (\u003cem\u003eWomen of the Movement\u003c/em\u003e) to its cast, per \u003ca href=\"https://deadline.com/2025/04/sophina-brown-jeff-pierre-cedric-joe-nemesis-series-1236359700\" target=\"_blank\"\u003eDeadline\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eHit the comments with your thoughts on the above castings!\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-04T22:00:23Z",
  "modifiedTime": "2025-04-04T22:00:29Z"
}
