{
  "id": "8f7199a9-5614-4ba9-8e73-e3706ffc7e8a",
  "title": "NBC Swings the Axe Ahead of Upfronts: Found, The Irrational, and More Get the Boot",
  "link": "https://www.tvfanatic.com/nbc-swings-the-axe-ahead-of-upfronts-found-the-irrational-and-more-get-the-boot/",
  "description": "NBC cancels Night Court, Found, The Irrational, and more ahead of Upfronts. Is the NBA deal to blame? Here's what's out — and why. The post NBC Swings the Axe Ahead of Upfronts: Found, The Irrational, and More Get the Boot appeared first on TV Fanatic.",
  "author": "Carissa Pavlica",
  "published": "Fri, 09 May 2025 20:36:12 +0000",
  "source": "https://www.tvfanatic.com/rss.xml",
  "categories": [
    "News",
    "renew/cancel"
  ],
  "byline": "Carissa Pavlica",
  "length": 5968,
  "excerpt": "NBC cancels Night Court, Found, The Irrational, and more ahead of Upfronts. Is the NBA deal to blame? Here's what's out — and why.",
  "siteName": "TV Fanatic",
  "favicon": "https://cdn.tvfanatic.com/uploads/2024/05/favicon-1-300x300.png",
  "text": "NBC is cleaning house ahead of its 2025 Upfront presentation on Monday, and the casualties are already piling up. The network has canceled multiple series in one fell swoop, with Night Court, Lopez vs Lopez, The Irrational, Found, and Suits: LA all officially off the schedule. And with the day still young, there’s reason to believe more are coming. Let’s break down what’s been cut — and what that says about where NBC is headed next season. Night Court (Canceled After Three Seasons) (Nicole Weingart/NBC) The revival of the beloved 1980s sitcom came in hot back in 2023, debuting to strong numbers and plenty of nostalgic goodwill.  Melissa Rauch stepped into the lead role as Judge Abby Stone, with John Larroquette reprising his Emmy-winning role as Dan Fielding. But after three seasons, NBC has called it a day. According to reports, the series finale — aptly titled “A Decent Proposal” — will now serve as the show’s swan song. Warner Bros. is reportedly shopping the series elsewhere, which may give fans a glimmer of hope. But for now, the gavel has come down. Lopez vs Lopez (Canceled After Three Seasons) (Nicole Weingart/NBC) George and Mayan Lopez’s real-life father-daughter chemistry gave this series its spark, but it wasn’t enough to keep the show going. Lopez vs Lopez was a traditional multi-cam sitcom that carved out a small but loyal audience. Despite its authenticity and cultural commentary, NBC decided not to move forward with a fourth season.  It’s another reminder that broadcast comedies face an uphill climb in today’s TV landscape, especially as budgets tighten. The Irrational (Canceled After Two Seasons) (Sergei Bachlakov/NBC) NBC had high hopes for this behavioral-science procedural starring Jesse L. Martin.  The show gave off classic network vibes: a compelling lead, a case-of-the-week format, and a unique hook. But in the end, The Irrational couldn’t keep enough eyeballs to justify a third season. The Irrational Season 2 ended in April, and while fans had hoped for renewal, NBC clearly has other plans for its drama slate — especially with Law \u0026 Order, One Chicago, and St. Denis Medical locked in for next season. Found (Canceled After Two Seasons) (Matt Miller/NBC) This one hurts. Found was never your typical procedural. Anchored by a powerhouse performance from Shanola Hampton, the show carved out its own lane by focusing on the forgotten — the missing people the world stops looking for. It was gritty, emotional, and deeply human in a way few network dramas manage to be. The series also took risks, especially with its twisty dynamic between Gabi and her former kidnapper, played by Mark-Paul Gosselaar. That relationship alone was enough to spark watercooler talk — and it did, thanks to some stellar storytelling and tight pacing in Found Season 1. Unfortunately, risk doesn’t always equal reward in the ratings. NBC gave the show a shot with a second season, but even strong reviews and a fiercely loyal fanbase couldn’t save it from the chopping block. For viewers — and for those of us who followed this one closely — it’s a loss. Found had something to say, and it said it well. Not every show can claim that. Suits LA (Canceled After One Season) (Trae Patton/NBC) Of all NBC’s cancellations, this one might sting the most for the network because it should have worked. Suits: LA was designed to ride the wave of Suits’ massive streaming resurgence. Instead, it wiped out. On paper, the spinoff had potential: a new city, a new cast, and a fresh take on the world of high-powered legal maneuvering. But in execution, it felt like a knockoff that didn’t understand what made the original tick. The casting didn’t resonate. The characters lacked the charisma and spark that Harvey and Mike once brought to the table, and the storylines were a muddled mix of courtroom drama and Hollywood gloss.  It didn’t help that by the time Suits: LA hit the schedule, the viral Suits moment had passed —  NBC missed its shot. Guest appearances from original series favorites weren’t enough to cover the fact that this show just didn’t have the same energy. For fans hoping to revisit the sharp wit, tight character work, and addictive tension of the original, Suits: LA ended up feeling like a pale imitation. What’s Going On at NBC? (Peter Gordon/NBC) If it feels like NBC is blowing up half its schedule, you’re not imagining things. The network is making some big swings heading into the 2025–26 season, including cutting shows that might’ve survived another year in the past. But times have changed — and so has NBC’s game plan. In July 2024, NBCUniversal struck an 11-year deal with the NBA and WNBA to bring basketball back to the network starting next season. That’s a major investment, and it will take up a lot of real estate across NBC, Peacock, and USA Network. Between regular-season games, playoffs, and streaming exclusives, the network is about to be full-court press. What does that mean for scripted TV? Fewer time slots. More budget pressure. And shows with even a hint of softness in the ratings are suddenly expendable. (Ralph Bavaro/NBC) NBC isn’t alone in this pivot — every network is recalibrating in the wake of Peak TV’s collapse — but the volume of cuts suggests a clear message: if it’s not a sure thing, it’s not staying. Add in a slate of returning stalwarts like the Law \u0026 Order universe, One Chicago, and St. Denis Medical, and it’s clear that NBC is consolidating around what still works… and making room for tip-off. Keep this article bookmarked since we’re still awaiting word on favorites like Brilliant Minds and The Hunting Party. If the axe comes for them, we’ll add it here. We don’t have a PR machine or a million-dollar budget — we have you.If you’re reading, say hello in the comments or send this to a friend. Every little action helps.",
  "image": "https://cdn.tvfanatic.com/uploads/2025/03/NUP_206074_01724_lowRes-e1746819929240.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-846602\"\u003e\n\n        \n        \n                   \n            \u003cdiv\u003e\n        \n\n\u003cp\u003eNBC is cleaning house ahead of its 2025 Upfront presentation on Monday, and the casualties are already piling up.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe network has canceled multiple series in one fell swoop, with Night Court, Lopez vs Lopez, The Irrational, Found, and Suits: LA all officially off the schedule. And with the day still young, there’s reason to believe more are coming.\u003c/p\u003e\n\n\n\n\u003cp\u003eLet’s break down what’s been cut — and what that says about where \u003ca href=\"https://www.tvfanatic.com/networks/nbc/\"\u003eNBC\u003c/a\u003e is headed next season.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-night-court-canceled-after-three-seasons\"\u003e\u003cstrong\u003eNight Court (Canceled After Three Seasons)\u003c/strong\u003e\u003c/h2\u003e\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1000\" height=\"667\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/NUP_206022_00972.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/NUP_206022_00972.jpg 1000w, https://cdn.tvfanatic.com/uploads/2024/12/NUP_206022_00972-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2024/12/NUP_206022_00972-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/NUP_206022_00972-960x640.jpg 960w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/NUP_206022_00972.jpg\" loading=\"eager\" data-no-svg=\"1\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Nicole Weingart/NBC)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe revival of the beloved 1980s sitcom came in hot back in 2023, debuting to strong numbers and plenty of nostalgic goodwill. \u003c/p\u003e\n\n\n\n\u003cp\u003eMelissa Rauch stepped into the lead role as Judge Abby Stone, with John Larroquette reprising his Emmy-winning role as Dan Fielding. But after three seasons, NBC has called it a day.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eAccording to reports, the series finale — aptly titled “A Decent Proposal” — will now serve as the show’s swan song. Warner Bros. is reportedly shopping the series elsewhere, which may give fans a glimmer of hope. But for now, the gavel has come down.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-lopez-vs-lopez-canceled-after-three-seasons\"\u003e\u003cstrong\u003eLopez vs Lopez (Canceled After Three Seasons)\u003c/strong\u003e\u003c/h2\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"827\" height=\"900\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/NUP_205742_00720.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/NUP_205742_00720.jpg 827w, https://cdn.tvfanatic.com/uploads/2024/12/NUP_205742_00720-276x300.jpg 276w, https://cdn.tvfanatic.com/uploads/2024/12/NUP_205742_00720-768x836.jpg 768w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/NUP_205742_00720.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Nicole Weingart/NBC)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eGeorge and Mayan Lopez’s real-life father-daughter chemistry gave this series its spark, but it wasn’t enough to keep the show going.\u003c/p\u003e\n\n\n\n\u003cp\u003eLopez vs Lopez was a traditional multi-cam sitcom that carved out a small but loyal audience. Despite its authenticity and cultural commentary, NBC decided not to move forward with a fourth season. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s another reminder that broadcast comedies face an uphill climb in today’s TV landscape, especially as budgets tighten.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-irrational-canceled-after-two-seasons\"\u003e\u003cstrong\u003eThe Irrational (Canceled After Two Seasons)\u003c/strong\u003e\u003c/h2\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"665\" height=\"1000\" src=\"https://cdn.tvfanatic.com/uploads/2025/03/NUP_206074_00077_lowRes.jpg\" alt=\"Alec sitting in the airport smiling on The Irrational Season 2 Episode 18\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/03/NUP_206074_00077_lowRes.jpg 665w, https://cdn.tvfanatic.com/uploads/2025/03/NUP_206074_00077_lowRes-200x300.jpg 200w, https://cdn.tvfanatic.com/uploads/2025/03/NUP_206074_00077_lowRes-638x960.jpg 638w\" sizes=\"(max-width: 665px) 100vw, 665px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/03/NUP_206074_00077_lowRes.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Sergei Bachlakov/NBC)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eNBC had high hopes for this behavioral-science procedural starring Jesse L. Martin. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe show gave off classic network vibes: a compelling lead, a case-of-the-week format, and a unique hook. But in the end, The Irrational couldn’t keep enough eyeballs to justify a third season.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.tvfanatic.com/?show=the-irrational\u0026amp;season=season-1\"\u003eThe Irrational Season 2\u003c/a\u003e ended in April, and while fans had hoped for renewal, NBC clearly has other plans for its drama slate — especially with Law \u0026amp; Order, One Chicago, and St. Denis Medical locked in for next season.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-found-canceled-after-two-seasons\"\u003eFound (Canceled After Two Seasons)\u003c/h2\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"683\" src=\"https://cdn.tvfanatic.com/uploads/2025/04/NUP_205720_01117_lowRes.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/04/NUP_205720_01117_lowRes-1024x683.jpg 1024w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_205720_01117_lowRes-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_205720_01117_lowRes-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_205720_01117_lowRes-960x640.jpg 960w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_205720_01117_lowRes-1080x720.jpg 1080w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_205720_01117_lowRes.jpg 1200w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/04/NUP_205720_01117_lowRes.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Matt Miller/NBC)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThis one hurts. \u003ca href=\"https://www.tvfanatic.com/shows/found/\"\u003eFound\u003c/a\u003e was never your typical procedural. \u003c/p\u003e\n\n\n\n\u003cp\u003eAnchored by a powerhouse performance from Shanola Hampton, the show carved out its own lane by focusing on the forgotten — the missing people the world stops looking for. It was gritty, emotional, and deeply human in a way few network dramas manage to be.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe series also took risks, especially with its twisty dynamic between Gabi and her former kidnapper, played by Mark-Paul Gosselaar. That relationship alone was enough to spark watercooler talk — and it did, thanks to some stellar storytelling and tight pacing in \u003ca href=\"https://www.tvfanatic.com/?show=found\u0026amp;season=season-1\"\u003eFound Season 1\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eUnfortunately, risk doesn’t always equal reward in the ratings. NBC gave the show a shot with a second season, but even strong reviews and a fiercely loyal fanbase couldn’t save it from the chopping block.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor viewers — and for those of us who followed this one closely — it’s a loss. Found had something to say, and it said it well. Not every show can claim that.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-suits-la-canceled-after-one-season\"\u003e\u003cstrong\u003eSuits LA (Canceled After One Season)\u003c/strong\u003e\u003c/h2\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"865\" height=\"1000\" src=\"https://cdn.tvfanatic.com/uploads/2025/04/NUP_206931_01538.jpg\" alt=\"two men in suits\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/04/NUP_206931_01538.jpg 865w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_206931_01538-260x300.jpg 260w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_206931_01538-768x888.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_206931_01538-830x960.jpg 830w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/04/NUP_206931_01538.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Trae Patton/NBC)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eOf all NBC’s cancellations, this one might sting the most for the network because it \u003cem\u003eshould have worked\u003c/em\u003e. Suits: LA was designed to ride the wave of Suits’ massive streaming resurgence. Instead, it wiped out.\u003c/p\u003e\n\n\n\n\u003cp\u003eOn paper, the spinoff had potential: a new city, a new cast, and a fresh take on the world of high-powered legal maneuvering. But in execution, it felt like a knockoff that didn’t understand what made the original tick.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThe casting didn’t resonate. The characters lacked the charisma and spark that Harvey and Mike once brought to the table, and the storylines were a muddled mix of courtroom drama and Hollywood gloss. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt didn’t help that by the time Suits: LA hit the schedule, the viral Suits moment had passed —  NBC missed its shot.\u003c/p\u003e\n\n\n\n\u003cp\u003eGuest appearances from original series favorites weren’t enough to cover the fact that this show just didn’t have the same energy. For fans hoping to revisit the sharp wit, tight character work, and addictive tension of the original, Suits: LA ended up feeling like a pale imitation.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-what-s-going-on-at-nbc\"\u003e\u003cstrong\u003eWhat’s Going On at NBC?\u003c/strong\u003e\u003c/h2\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"894\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/04/NUP_207149_01239.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/04/NUP_207149_01239-894x1024.jpg 894w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_207149_01239-262x300.jpg 262w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_207149_01239-768x880.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_207149_01239-838x960.jpg 838w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_207149_01239-942x1080.jpg 942w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_207149_01239-1047x1200.jpg 1047w, https://cdn.tvfanatic.com/uploads/2025/04/NUP_207149_01239.jpg 1164w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/04/NUP_207149_01239.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Peter Gordon/NBC)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIf it feels like NBC is blowing up half its schedule, you’re not imagining things.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe network is making some big swings heading into the 2025–26 season, including cutting shows that might’ve survived another year in the past. But times have changed — and so has NBC’s game plan.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn July 2024, NBCUniversal struck an 11-year deal with the NBA and WNBA to bring basketball back to the network starting next season. \u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s a major investment, and it will take up a lot of real estate across NBC, \u003ca href=\"https://www.tvfanatic.com/networks/peacock/\"\u003ePeacock\u003c/a\u003e, and USA Network. Between regular-season games, playoffs, and streaming exclusives, the network is about to be full-court press.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhat does that mean for scripted TV? Fewer time slots. More budget pressure. And shows with even a hint of softness in the ratings are suddenly expendable.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1000\" height=\"667\" src=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_207386_01032_lowRes.jpg\" alt=\"Benson standing and looking determined on Law \u0026amp; Order: SVU Season 26 Episode 21\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_207386_01032_lowRes.jpg 1000w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_207386_01032_lowRes-300x200.jpg 300w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_207386_01032_lowRes-768x512.jpg 768w, https://cdn.tvfanatic.com/uploads/2025/05/NUP_207386_01032_lowRes-960x640.jpg 960w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/05/NUP_207386_01032_lowRes.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Ralph Bavaro/NBC)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eNBC isn’t alone in this pivot — every network is recalibrating in the wake of Peak TV’s collapse — but the volume of cuts suggests a clear message: if it’s not a sure thing, it’s not staying. \u003c/p\u003e\n\n\n\n\u003cp\u003eAdd in a slate of returning stalwarts like the Law \u0026amp; Order universe, \u003ca href=\"https://www.tvfanatic.com/categories/one-chicago/\"\u003eOne Chicago\u003c/a\u003e, and St. Denis Medical, and it’s clear that NBC is consolidating around what still works… and making room for tip-off.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eKeep this article bookmarked since we’re still awaiting word on favorites like Brilliant Minds and The Hunting Party. If the axe comes for them, we’ll add it here.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWe don’t have a PR machine or a million-dollar budget — we have you.\u003cbr/\u003e\u003c/strong\u003eIf you’re reading, say hello in the comments or send this to a friend. Every little action helps.\u003c/p\u003e\n\n\n\n\n\n            \u003c/div\u003e\n                    \n                \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-09T20:36:12Z",
  "modifiedTime": "2025-05-09T16:36:34Z"
}
