{
  "id": "b8e1b00f-b6b0-464e-9f86-47f6cfdcbcc3",
  "title": "From ER to On Call: Eriq La Salle Talks Storytelling and Breaking Boundaries",
  "link": "https://www.tvfanatic.com/from-er-to-on-call-eriq-la-salle-talks-storytelling-and-breaking-boundaries/",
  "description": "Eriq La Salle spoke with TV Fanatic about bringing his passion for storytelling to Prime Video's On Call behind and in front of the camera.",
  "author": "Carissa Pavlica",
  "published": "Wed, 08 Jan 2025 19:00:00 +0000",
  "source": "https://www.tvfanatic.com/rss.xml",
  "categories": [
    "Exclusives",
    "Interviews"
  ],
  "byline": "Carissa Pavlica",
  "length": 7693,
  "excerpt": "Eriq La Salle spoke with TV Fanatic about bringing his passion for storytelling to Prime Video's On Call behind and in front of the camera.",
  "siteName": "TV Fanatic",
  "favicon": "https://cdn.tvfanatic.com/uploads/2024/05/favicon-1-300x300.png",
  "text": "Few individuals in Hollywood wear as many hats as Eriq La Salle. Actor, director, executive producer, and author, La Salle’s career spans decades of storytelling across mediums.  His latest project, Prime Video’s On Call, exemplifies this multi-faceted talent, putting him in front of and behind the camera for a raw and captivating police drama. Although the cast is generous, the storytelling approach is lean, focusing on two series regulars with other characters as supporting players in their orbit.  (©2022 Crown Media United States LLC/Photographer: Allister Foster) It’s a unique approach and one that appeals to La Salle, who has been on every side of storytelling for the last three decades. La Salle’s journey into storytelling began early. “At 14,” he recalls,  “I think it’s what every person experiences when you find something that you feel good at, and you feel valued, and that things are natural to you … I felt good about myself. It helped my self-esteem, it helped my confidence, and it gave me purpose and direction. My grades greatly improved.” A transformative experience with his high school drama club and the mentorship of Clay Stevenson, who encouraged him to consider Juilliard, set the foundation for a remarkable career.  “I think we all want to do what we feel valued at, and what we feel we’re contributing something, and where we feel we have a talent. And not necessarily that you’re the best; you just feel good about being good at it. And that’s why I knew at that early age that this was for me.” (Virginia Sherwood/NBC) He also credits acting with helping him find direction during a challenging time in his life. “I was off to a bad start in high school,” he shares.  “I more than likely would have been kept behind,” he said of his life before discovering drama club. Stevenson’s mentorship helped him focus and take school seriously, allowing La Salle to accept he could feel and pursue something special. After years of memorable acting roles, including his iconic turn as Dr. Peter Benton on ER, La Salle shifted gears to directing. His directorial debut came with HBO’s Rebound, a project featuring an impressive cast that included Don Cheadle, James Earl Jones, and Forest Whitaker.  “Steven Spielberg and Mel Gibson, they advocated for me,” he shares. That opportunity launched his directing career, and its success led to pivotal roles behind the camera on series like Without a Trace and Law \u0026 Order: SVU, eventually culminating in an executive producer role for Chicago PD. Reflecting on his eclectic career, La Salle notes, “At the end of the day, you know, I was asking myself, how do I define myself? And I think that it really is that I’m a storyteller, and I love being a storyteller.  “Because before I was like, well, you’re an actor, you’re a director, you’re an author, you’re this, you’re that. They all have one thing in common, I’m a storyteller.” (Prime Video/Screenshot) And so having the opportunity to tell stories is what I think I was born for. That’s my greatest talent.  I’m not saying I’m the greatest in each discipline,” he said.  “There are many more actors, way better than me. Many more directors, way better than me. Many more authors, way better than me. Many more executive producers, way better than me. But you’re a little more hard-pressed to find someone who does all of that way better.”  That’s where he’s carved out a unique space. He’s not one of many, but one of the few to accomplish so much and do it all well. Drawing inspiration from creatives like Jason Bateman, who juggled acting, directing, and producing on Ozark, La Salle saw tackling On Call as an opportunity to push boundaries.  There just aren’t many people acting, directing, and producing in the same space. “There are even fewer African-Americans living in all of those spaces,” he says, making it an even smaller class. “Those are the things that inspire me,” he shares. (Courtesy of Prime Video) Stepping Up to On Call La Salle’s newest endeavor, On Call, is both a return to acting and a continuation of his commitment to meaningful storytelling. The series offers a gritty, unvarnished look at policing in 2025, eschewing agendas in favor of an immersive, character-driven narrative.  “Right now, we’re in a moment where everything feels so agenda-driven,” La Salle explains. “We’re not pro-cop or anti-cop. We’re telling the story of some people and making it as real as possible. It’s subjective art — you take away what you bring to it.” The series employs innovative filming techniques to create a visceral “ride-along” experience. “It’s just our job to say, ‘Hey, you want to ride along with cops?’ With our cops here, we want to put you in as close as possible,” La Salle says.  (Prime Video/Screenshot) He notes that it’s the audience’s perspective that shapes how they’ll see the story they’re telling with On Call — based on their trust, mistrust, or experience with law enforcement. For La Salle, On Call also represents a rare opportunity to originate a series rather than revamp an existing one. “When I came into Chicago PD, we revamped the show, we changed it, and they were blown away by it,” he says.  But with On Call, he had the opportunity to help create a show with a unique style, palette, and tone. It’s about having a say in how the story is told across the board, but also to “get back in front of the camera to show that you can do it all.’ (Elizabeth ‘Liz’ Morris) A New Standard for Streaming On Call also aims to reshape the streaming landscape with its concise, half-hour episodes. “You get a lot in a half hour,” La Salle emphasizes.  “It is totally bingeable in an addictive way,” he says of the format and how they crafted each episode’s end to urge viewers to watch more. “It’s only another half hour, and then you say, “OK, I’m just going to watch one more…” This format — short yet impactful — offers a compelling alternative to the bloated budgets and lengthy run times of many streaming dramas. “We’ve seen the overspending of streamers creating a non-sustainable model and platform,” La Salle observes.  In contrast, On Call is dirty and edgy, grass-roots, and we make it work. But it’s also showing that you can tell these compelling stories in an economically more responsible way,” he says. “” La Salle hopes the series’ success will challenge industry norms. “There’s a shift happening,” he says. “It feels good to be a part of a potential or at least partial solution.”  With this format, viewers don’t lose anything, but they actually gain — there’s no filler, no extraneous characters. “It’s good storytelling,” he says, a streaming TV version of independent film. Looking Ahead As La Salle reflects on the future of On Call, he’s optimistic about its potential to grow. “The good news is we have the scripts pretty much ready for the next season,” he reveals. “We just need the OK.”  In fact, La Salle hints that plans for future iterations of On Call are already in motion. “I had dinner with the showrunner, and we’ve talked about exactly that,” he shares. “We’ve already picked another city.” Ultimately, On Call is more than a show; it’s a testament to La Salle’s ability to innovate and adapt in an ever-changing industry.  His passion for storytelling, coupled with a desire to elevate the art form, makes him a standout talent. At its core, On Call invites audiences to see the world from a different perspective. As La Salle says, “That’s what art should do.” All eight episodes of On Call drop on Prime Video on Thursday, January 9.",
  "image": "https://cdn.tvfanatic.com/uploads/2025/01/New-Headshot-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-830190\"\u003e\n\n        \n        \n                   \n            \u003cdiv\u003e\n        \n\n\u003cp\u003eFew individuals in Hollywood wear as many hats as Eriq La Salle. Actor, director, executive producer, and author, La Salle’s career spans decades of storytelling across mediums. \u003c/p\u003e\n\n\n\n\u003cp\u003eHis latest project, Prime Video’s \u003ca href=\"https://www.tvfanatic.com/shows/on-call/\"\u003eOn Call\u003c/a\u003e, exemplifies this multi-faceted talent, putting him in front of and behind the camera for a raw and captivating police drama.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlthough the cast is generous, the storytelling approach is lean, focusing on two series regulars with other characters as supporting players in their orbit. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"683\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Eriq-La-Salle-683x1024.jpeg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Eriq-La-Salle-683x1024.jpeg 683w, https://cdn.tvfanatic.com/uploads/2025/01/Eriq-La-Salle-200x300.jpeg 200w, https://cdn.tvfanatic.com/uploads/2025/01/Eriq-La-Salle-768x1151.jpeg 768w, https://cdn.tvfanatic.com/uploads/2025/01/Eriq-La-Salle-1366x2048.jpeg 1366w, https://cdn.tvfanatic.com/uploads/2025/01/Eriq-La-Salle-640x960.jpeg 640w, https://cdn.tvfanatic.com/uploads/2025/01/Eriq-La-Salle-720x1080.jpeg 720w, https://cdn.tvfanatic.com/uploads/2025/01/Eriq-La-Salle-800x1200.jpeg 800w, https://cdn.tvfanatic.com/uploads/2025/01/Eriq-La-Salle-scaled.jpeg 1708w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Eriq-La-Salle-scaled.jpeg\" loading=\"eager\" data-no-svg=\"1\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (©2022 Crown Media United States LLC/Photographer: Allister Foster)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIt’s a unique approach and one that appeals to La Salle, who has been on every side of storytelling for the last three decades.\u003c/p\u003e\n\n\n\n\u003cp\u003eLa Salle’s journey into storytelling began early. “At 14,” he recalls, \u003c/p\u003e\n\n\n\n\u003cp\u003e“I think it’s what every person experiences when you find something that you feel good at, and you feel valued, and that things are natural to you … I felt good about myself. It helped my self-esteem, it helped my confidence, and it gave me purpose and direction. My grades greatly improved.”\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eA transformative experience with his high school drama club and the mentorship of Clay Stevenson, who encouraged him to consider Juilliard, set the foundation for a remarkable career. \u003c/p\u003e\n\n\n\n\u003cp\u003e“I think we all want to do what we feel valued at, and what we feel we’re contributing something, and where we feel we have a talent. And not necessarily that you’re the best; you just feel good about being good at it. And that’s why I knew at that early age that this was for me.”\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"558\" height=\"666\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/NUP_204203_01358.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/NUP_204203_01358.jpg 558w, https://cdn.tvfanatic.com/uploads/2025/01/NUP_204203_01358-251x300.jpg 251w\" sizes=\"(max-width: 558px) 100vw, 558px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/NUP_204203_01358.jpg\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Virginia Sherwood/NBC)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eHe also credits acting with helping him find direction during a challenging time in his life. “I was off to a bad start in high school,” he shares. \u003c/p\u003e\n\n\n\n\u003cp\u003e“I more than likely would have been kept behind,” he said of his life before discovering drama club. Stevenson’s mentorship helped him focus and take school seriously, allowing La Salle to accept he could feel and pursue something special.\u003c/p\u003e\n\n\n\n\u003cp\u003eAfter years of memorable acting roles, including his iconic turn as Dr. Peter Benton on ER, La Salle shifted gears to directing. His directorial debut came with \u003ca href=\"https://www.tvfanatic.com/networks/hbo/\"\u003eHBO\u003c/a\u003e’s Rebound, a project featuring an impressive cast that included Don Cheadle, James Earl Jones, and Forest Whitaker. \u003c/p\u003e\n\n\n\n\u003cp\u003e“Steven Spielberg and Mel Gibson, they advocated for me,” he shares. That opportunity launched his directing career, and its success led to pivotal roles behind the camera on series like Without a Trace and \u003ca href=\"https://www.tvfanatic.com/shows/law-and-order-svu/\"\u003eLaw \u0026amp; Order: SVU\u003c/a\u003e, eventually culminating in an executive producer role for Chicago PD\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eReflecting on his eclectic career, La Salle notes, “At the end of the day, you know, I was asking myself, how do I define myself? And I think that it really is that I’m a storyteller, and I love being a storyteller. \u003c/p\u003e\n\n\n\n\u003cp\u003e“Because before I was like, well, you’re an actor, you’re a director, you’re an author, you’re this, you’re that. They all have one thing in common, I’m a storyteller.”\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"897\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.54%E2%80%AFPM.png\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.54%E2%80%AFPM-897x1024.png 897w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.54%E2%80%AFPM-263x300.png 263w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.54%E2%80%AFPM-768x877.png 768w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.54%E2%80%AFPM-841x960.png 841w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.54%E2%80%AFPM-946x1080.png 946w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.54%E2%80%AFPM-1051x1200.png 1051w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.54%E2%80%AFPM.png 1513w\" sizes=\"(max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.54%E2%80%AFPM.png\" loading=\"lazy\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Prime Video/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAnd so having the opportunity to tell stories is what I think I was born for. That’s my greatest talent.  I’m not saying I’m the greatest in each discipline,” he said. \u003c/p\u003e\n\n\n\n\u003cp\u003e“There are many more actors, way better than me. Many more directors, way better than me. Many more authors, way better than me. Many more executive producers, way better than me. But you’re a little more hard-pressed to find someone who does all of that way better.” \u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThat’s where he’s carved out a unique space. He’s not one of many, but one of the few to accomplish so much and do it all well.\u003c/p\u003e\n\n\n\n\u003cp\u003eDrawing inspiration from creatives like Jason Bateman, who juggled acting, directing, and producing on \u003ca href=\"https://www.tvfanatic.com/shows/ozark/\"\u003eOzark\u003c/a\u003e, La Salle saw tackling On Call as an opportunity to push boundaries. \u003c/p\u003e\n\n\n\n\u003cp\u003eThere just aren’t many people acting, directing, and producing in the same space. “There are even fewer African-Americans living in all of those spaces,” he says, making it an even smaller class. “Those are the things that inspire me,” he shares.\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"683\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/ONCL_S1_Static2x3_Partners_2000x3000_PRE_PV_FINAL_en-US_KAPS_3716660-scaled.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/ONCL_S1_Static2x3_Partners_2000x3000_PRE_PV_FINAL_en-US_KAPS_3716660-683x1024.jpg 683w, https://cdn.tvfanatic.com/uploads/2024/12/ONCL_S1_Static2x3_Partners_2000x3000_PRE_PV_FINAL_en-US_KAPS_3716660-200x300.jpg 200w, https://cdn.tvfanatic.com/uploads/2024/12/ONCL_S1_Static2x3_Partners_2000x3000_PRE_PV_FINAL_en-US_KAPS_3716660-768x1152.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/ONCL_S1_Static2x3_Partners_2000x3000_PRE_PV_FINAL_en-US_KAPS_3716660-1365x2048.jpg 1365w, https://cdn.tvfanatic.com/uploads/2024/12/ONCL_S1_Static2x3_Partners_2000x3000_PRE_PV_FINAL_en-US_KAPS_3716660-640x960.jpg 640w, https://cdn.tvfanatic.com/uploads/2024/12/ONCL_S1_Static2x3_Partners_2000x3000_PRE_PV_FINAL_en-US_KAPS_3716660-720x1080.jpg 720w, https://cdn.tvfanatic.com/uploads/2024/12/ONCL_S1_Static2x3_Partners_2000x3000_PRE_PV_FINAL_en-US_KAPS_3716660-800x1200.jpg 800w, https://cdn.tvfanatic.com/uploads/2024/12/ONCL_S1_Static2x3_Partners_2000x3000_PRE_PV_FINAL_en-US_KAPS_3716660-scaled.jpg 1707w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/ONCL_S1_Static2x3_Partners_2000x3000_PRE_PV_FINAL_en-US_KAPS_3716660-scaled.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Courtesy of Prime Video)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eStepping Up to \u003c/strong\u003e\u003cstrong\u003e\u003cem\u003eOn Call\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eLa Salle’s newest endeavor, On Call, is both a return to acting and a continuation of his commitment to meaningful storytelling. The series offers a gritty, unvarnished look at policing in 2025, eschewing agendas in favor of an immersive, character-driven narrative. \u003c/p\u003e\n\n\n\n\u003cp\u003e“Right now, we’re in a moment where everything feels so agenda-driven,” La Salle explains. “We’re not pro-cop or anti-cop. We’re telling the story of some people and making it as real as possible. It’s subjective art — you take away what you bring to it.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe series employs innovative filming techniques to create a visceral “ride-along” experience. “It’s just our job to say, ‘Hey, you want to ride along with cops?’ With our cops here, we want to put you in as close as possible,” La Salle says. \u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"836\" src=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.00%E2%80%AFPM.png\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.00%E2%80%AFPM-1024x836.png 1024w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.00%E2%80%AFPM-300x245.png 300w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.00%E2%80%AFPM-768x627.png 768w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.00%E2%80%AFPM-2048x1672.png 2048w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.00%E2%80%AFPM-960x784.png 960w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.00%E2%80%AFPM-1080x882.png 1080w, https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.00%E2%80%AFPM-1200x980.png 1200w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2025/01/Screenshot-2025-01-06-at-8.50.00%E2%80%AFPM.png\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Prime Video/Screenshot)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eHe notes that it’s the audience’s perspective that shapes how they’ll see the story they’re telling with On Call — based on their trust, mistrust, or experience with law enforcement.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor La Salle, On Call also represents a rare opportunity to originate a series rather than revamp an existing one. \u003c/p\u003e\n\n\n\n\u003cp\u003e“When I came into \u003ca href=\"https://www.tvfanatic.com/shows/chicago-pd/\"\u003eChicago PD\u003c/a\u003e, we revamped the show, we changed it, and they were blown away by it,” he says. \u003c/p\u003e\n\n\n\n\u003cp\u003eBut with On Call, he had the opportunity to help create a show with a unique style, palette, and tone. It’s about having a say in how the story is told across the board, but also to “get back in front of the camera to show that you can do it all.’\u003c/p\u003e\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"830\" height=\"1024\" src=\"https://cdn.tvfanatic.com/uploads/2024/12/Eriq_La_Salle_as_Sergeant_Lasman_in_On_Call_Photo_Credit-Elizabeth_Liz_Morris-1_3000.jpg\" alt=\"\" srcset=\"https://cdn.tvfanatic.com/uploads/2024/12/Eriq_La_Salle_as_Sergeant_Lasman_in_On_Call_Photo_Credit-Elizabeth_Liz_Morris-1_3000-830x1024.jpg 830w, https://cdn.tvfanatic.com/uploads/2024/12/Eriq_La_Salle_as_Sergeant_Lasman_in_On_Call_Photo_Credit-Elizabeth_Liz_Morris-1_3000-243x300.jpg 243w, https://cdn.tvfanatic.com/uploads/2024/12/Eriq_La_Salle_as_Sergeant_Lasman_in_On_Call_Photo_Credit-Elizabeth_Liz_Morris-1_3000-768x948.jpg 768w, https://cdn.tvfanatic.com/uploads/2024/12/Eriq_La_Salle_as_Sergeant_Lasman_in_On_Call_Photo_Credit-Elizabeth_Liz_Morris-1_3000-778x960.jpg 778w, https://cdn.tvfanatic.com/uploads/2024/12/Eriq_La_Salle_as_Sergeant_Lasman_in_On_Call_Photo_Credit-Elizabeth_Liz_Morris-1_3000-875x1080.jpg 875w, https://cdn.tvfanatic.com/uploads/2024/12/Eriq_La_Salle_as_Sergeant_Lasman_in_On_Call_Photo_Credit-Elizabeth_Liz_Morris-1_3000-972x1200.jpg 972w, https://cdn.tvfanatic.com/uploads/2024/12/Eriq_La_Salle_as_Sergeant_Lasman_in_On_Call_Photo_Credit-Elizabeth_Liz_Morris-1_3000.jpg 1212w\" sizes=\"auto, (max-width: 760px) calc(100vw - 40px), 720px\" data-pin-media=\"https://cdn.tvfanatic.com/uploads/2024/12/Eriq_La_Salle_as_Sergeant_Lasman_in_On_Call_Photo_Credit-Elizabeth_Liz_Morris-1_3000.jpg\" data-trellis-processed=\"1\"/\u003e\u003cfigcaption\u003e\u003cspan\u003e (Elizabeth ‘Liz’ Morris)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eA New Standard for Streaming\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eOn Call also aims to reshape the streaming landscape with its concise, half-hour episodes. “You get a lot in a half hour,” La Salle emphasizes. \u003c/p\u003e\n\n\n\n\u003cp\u003e“It is totally bingeable in an addictive way,” he says of the format and how they crafted each episode’s end to urge viewers to watch more. “It’s only another half hour, and then you say, “OK, I’m just going to watch one more…”\u003c/p\u003e\n\n\n\n\u003cp\u003eThis format — short yet impactful — offers a compelling alternative to the bloated budgets and lengthy run times of many streaming dramas. “We’ve seen the overspending of streamers creating a non-sustainable model and platform,” La Salle observes. \u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eIn contrast, On Call is dirty and edgy, grass-roots, and we make it work. But it’s also showing that you can tell these compelling stories in an economically more responsible way,” he says. “”\u003c/p\u003e\n\n\n\n\u003cp\u003eLa Salle hopes the series’ success will challenge industry norms. “There’s a shift happening,” he says. “It feels good to be a part of a potential or at least partial solution.” \u003c/p\u003e\n\n\n\n\u003cp\u003eWith this format, viewers don’t lose anything, but they actually gain — there’s no filler, no extraneous characters. “It’s good storytelling,” he says, a streaming TV version of independent film.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"On Call - Official Trailer | Prime Video\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/6vuppLrUGoU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eLooking Ahead\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eAs La Salle reflects on the future of On Call, he’s optimistic about its potential to grow. “The good news is we have the scripts pretty much ready for the next season,” he reveals. “We just need the OK.” \u003c/p\u003e\n\n\n\n\u003cp\u003eIn fact, La Salle hints that plans for future iterations of On Call are already in motion. “I had dinner with the showrunner, and we’ve talked about exactly that,” he shares. “We’ve already picked another city.”\u003c/p\u003e\n\n\n\n\u003cp\u003eUltimately, On Call is more than a show; it’s a testament to La Salle’s ability to innovate and adapt in an ever-changing industry. \u003c/p\u003e\n\n\n\n\u003cp\u003eHis passion for storytelling, coupled with a desire to elevate the art form, makes him a standout talent. At its core, On Call invites audiences to see the world from a different perspective. As La Salle says, “That’s what art should do.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eAll eight episodes of On Call drop on Prime Video on Thursday, January 9.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n            \u003c/div\u003e\n                    \n                \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-08T19:00:00Z",
  "modifiedTime": "2025-01-08T16:05:36Z"
}
