{
  "id": "bef73518-c2f4-4a4c-9ebf-5bdbe1f4393a",
  "title": "Outer Banks Cast Answers Our Absolutely Most Pressing Pogues-Related Season 4 Question",
  "link": "https://tvline.com/features/outer-banks-season-4-cast-interview-netflix-pope-poguelandia-1235347895/",
  "description": "On Outer Banks, John B. and his friends — aka the Pogues — are brave. They’re fun. They’re loyal. But absolutely no one would describe them as “tidy.” So when Kiara, JJ, Pope, Cleo, Sarah and John B. move in together at the start of Season 4 (which dropped Thursday on Netflix), we couldn’t help but […]",
  "author": "Kimberly Roots",
  "published": "Sat, 12 Oct 2024 21:00:00 +0000",
  "source": "https://tvline.com/feed/",
  "categories": [
    "Features",
    "Carlacia Grant",
    "Chase Stokes",
    "Drew Starkey",
    "Jonathan Daviss",
    "Madelyn Cline",
    "Madison Bailey",
    "Netflix",
    "Outer Banks",
    "Rudy Pankow"
  ],
  "byline": "Kimberly Roots",
  "length": 1677,
  "excerpt": "'Outer Banks' Season 4: Cast members Chase Stokes, Jonathan Daviss and more discuss how Pogue does all the chores in Poguelandia. Watch interview!",
  "siteName": "TVLine",
  "favicon": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=192",
  "text": "On Outer Banks, John B. and his friends — aka the Pogues — are brave. They’re fun. They’re loyal. But absolutely no one would describe them as “tidy.” So when Kiara, JJ, Pope, Cleo, Sarah and John B. move in together at the start of Season 4 (which dropped Thursday on Netflix), we couldn’t help but wonder: Who’s stopping their new compound, dubbed Poguelandia 2, from falling into disarray and ruin? The only real answer? Jonathan Daviss‘ Pope, a truth acknowledged by Daviss and co-stars Chase Stokes, Madelyn Cline, Madison Bailey, Rudy Pankow, Carlacia Grant and Drew Starkey in a recent chat with TVLine. “Look at us!” Cline jokes in the video above. “I’m too cute to take out the trash.” The Season 4 premiere establishes that the Pogues use a chunk of their El Dorado gold to buy a house and to establish a business, a set-up that goes well until one of the teens makes a series of ill-advised financial decisions. (In the interest of spoilers, we won’t say whom. But, c’mon. You know who it is.) Even before things get tense, though, it becomes clear that Pope is the one making sure bills are paid and deadlines are met… which led us to wonder whether he was responsible for all of the adulting in Poguelandia 2. “My theory is, it started out with all of us having delegated tasks, and Pope is very Type-A and realized things weren’t getting done properly,” Stokes says in the video above. “And he just said, ‘I’m tired of asking people to do things that I’m going to have to fix anyway, therefore I’m just going to do it.” Press PLAY on the video at the top of the post to hear the cast’s thoughts on Pope as Pogue Dad, then hit the comments!",
  "image": "https://tvline.com/wp-content/uploads/2024/10/outer-banks-season-4-cast-interview-netflix.jpg?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\"\u003e\u003cp\u003eOn \u003cem\u003e\u003ca href=\"https://tvline.com/t/outer-banks/\" id=\"auto-tag_outer-banks_1\" data-tag=\"outer-banks\"\u003eOuter Banks\u003c/a\u003e\u003c/em\u003e, John B. and his friends — aka the Pogues — are brave. They’re fun. They’re loyal. But absolutely no one would describe them as “tidy.”\u003c/p\u003e\n\n\n\n\u003cp\u003eSo when Kiara, JJ, Pope, Cleo, Sarah and John B. move in together at the start of Season 4 (which dropped Thursday on \u003ca href=\"https://tvline.com/t/netflix/\" id=\"auto-tag_netflix_1\" data-tag=\"netflix\"\u003eNetflix\u003c/a\u003e), we couldn’t help but wonder: Who’s stopping their new compound, dubbed Poguelandia 2, from falling into disarray and ruin?\u003c/p\u003e\n\n\n\n\u003cp\u003eThe only real answer? \u003ca href=\"https://tvline.com/t/jonathan-daviss/\" id=\"auto-tag_jonathan-daviss_1\" data-tag=\"jonathan-daviss\"\u003eJonathan Daviss\u003c/a\u003e‘ Pope, a truth acknowledged by Daviss and co-stars \u003ca href=\"https://tvline.com/t/chase-stokes/\" id=\"auto-tag_chase-stokes_1\" data-tag=\"chase-stokes\"\u003eChase Stokes\u003c/a\u003e, \u003ca href=\"https://tvline.com/t/madelyn-cline/\" id=\"auto-tag_madelyn-cline_1\" data-tag=\"madelyn-cline\"\u003eMadelyn Cline\u003c/a\u003e, \u003ca href=\"https://tvline.com/t/madison-bailey/\" id=\"auto-tag_madison-bailey_1\" data-tag=\"madison-bailey\"\u003eMadison Bailey\u003c/a\u003e, \u003ca href=\"https://tvline.com/t/rudy-pankow/\" id=\"auto-tag_rudy-pankow_1\" data-tag=\"rudy-pankow\"\u003eRudy Pankow\u003c/a\u003e, \u003ca href=\"https://tvline.com/t/carlacia-grant/\" id=\"auto-tag_carlacia-grant_1\" data-tag=\"carlacia-grant\"\u003eCarlacia Grant\u003c/a\u003e and \u003ca href=\"https://tvline.com/t/drew-starkey/\" id=\"auto-tag_drew-starkey_1\" data-tag=\"drew-starkey\"\u003eDrew Starkey\u003c/a\u003e in a recent chat with TVLine. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e“Look at us!” Cline jokes in the video above. “I’m too cute to take out the trash.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Season 4 premiere establishes that the Pogues use a chunk of their El Dorado gold to buy a house and to establish a business, a set-up that goes well until one of the teens makes a series of ill-advised financial decisions. (In the interest of spoilers, we won’t say whom. But, c’mon. You \u003cem\u003eknow\u003c/em\u003e who it is.)\u003c/p\u003e\n\n\n\n\u003cp\u003eEven before things get tense, though, it becomes clear that Pope is the one making sure bills are paid and deadlines are met… which led us to wonder whether he was responsible for all of the adulting in Poguelandia 2.\u003c/p\u003e\n\n\n\n\u003cp\u003e“My theory is, it started out with all of us having delegated tasks, and Pope is very Type-A and realized things weren’t getting done properly,” Stokes says in the video above. “And he just said, ‘I’m tired of asking people to do things that I’m going to have to fix anyway, therefore I’m just going to do it.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003ePress PLAY on the video at the top of the post to hear the cast’s thoughts on Pope as Pogue Dad, then hit the comments!\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-10-12T21:00:00Z",
  "modifiedTime": "2024-10-10T01:32:27Z"
}
