{
  "id": "0fc8ca66-b955-4e8a-a01e-c02bcbdc39c9",
  "title": "Preserving astronomy history: The fight is on to save an iconic Royal Observatory Greenwich site",
  "link": "https://www.space.com/space-exploration/preserving-astronomy-history-the-fight-is-on-to-save-an-iconic-royal-observatory-greenwich-site",
  "description": "Nestled in the rolling green hills of the English countryside is an important site in global astronomical history. But now, with its future uncertain, this historic site is at risk.",
  "author": "",
  "published": "Sun, 23 Mar 2025 14:00:00 +0000",
  "source": "https://www.space.com/feeds/all",
  "categories": [
    "Space Exploration"
  ],
  "byline": "Ryan French",
  "length": 8422,
  "excerpt": "Nestled in the rolling green hills of the English countryside is an important site in global astronomical history. But now, with its future uncertain, this historic site is at risk.",
  "siteName": "Space",
  "favicon": "https://vanilla.futurecdn.net/space/1216717/apple-touch-icon.png",
  "text": "Aerial photograph of the Royal Greenwich Observatory at Herstmonceux in 2017. (Image credit: David Goddard/Getty Images) Near the small town of Herstmonceux in the English county of East Sussex sits the former home of the Royal Greenwich Observatory. The Royal Observatory Greenwich was first built in Greenwich, London, in 1675. At this original location, the observatory was set up with the goal of producing star charts and accurate time-keeping devices, to allow the British military and commercial fleets to more effectively navigate during their global travels. Over two centuries later, in 1884, the Royal Observatory Greenwich's extensive star charts made the site a prime choice for defining the world's line of 0˚ longitude, the original marker of which can still be visited at the Greenwich site today.But the original Royal Observatory Greenwich did not stay at its London location forever. By the 1930s, it was apparent to astronomers that London was no longer a feasible location to conduct astronomical research. Dark and clear skies are needed for these types of observation; and with an expanding London producing ever more smog, air pollution, and light pollution, Greenwich could no longer provide the necessary conditions for this work. Plans were eventually made to relocate the observatory operations, including some of the existing 19th century telescopes, to cleaner skies near the small village of Herstmonceux.However, this historic site is now at risk. In the summer of 2024, the Observatory Science Centre, the charity acting as custodians of the historic Royal Observatory Greenwich site since 1995, announced that they would be evicted by the landowners before the end of 2026.Delayed by World War II, the transfer of the Royal Observatory Greenwich took place from 1947 — 1958. Out of sixty candidate sites, an area in East Sussex was chosen in the south–east of England. At the time, the site was far from the light pollution of large towns and cities, and (believe it or not) even had decent weather (compared to the rest of the UK, at least). You may like World's largest telescope threatened by light pollution from renewable energy project Dark skies above world's best astronomy sites could be ruined by new energy project Following the move, the Royal Observatory Greenwich was renamed the Royal Greenwich Observatory, and scientific research continued. (Much of the original Royal Observatory Greenwich site in London still remains, and is now a part of the National Maritime Museum). Although the institution was founded to produce star charts, the Royal Observatory Greenwich had since moved onto astrophysical research, using telescopes to better understand the physics of the stars and planets above us.Rainbow over Herstmonceux in 1981. The observatory dome in the picture used to house Isaac Newton telescope, which is now situated at La Palma in the Canary Islands. (Image credit: Barry Shimmon/Wikimedia Commons/CC BY-SA 2.0)At the core of the new Herstmonceux site was a group of telescopes called the Equatorial Group. At its peak, 200 people worked on site, in support of the observatory's operations with these telescopes. The Equatorial Group is a group of six telescope domes, making up the primary observatory site. Whereas most telescope domes use a grey or white color, the Equatorial Group telescopes were built of copper, which eventually oxidized into a distinctive green color. This decision was deliberate, to allow the domes to 'camouflage' into the surrounding green hills.In 1967, the Royal Greenwich Observatory built a new tool — the Isaac Newton Telescope. The Isaac Newton Telescope was housed in its own new huge telescope dome (white this time), offset from the rest of the site. With a 98-inch mirror at its base, this new telescope was the third largest in the world at the time.Breaking space news, the latest updates on rocket launches, skywatching events and more!The 98 inch Isaac Newton Telescope, the largest in Europe at the time, under construction in 1965 at the works of Grubb Parsons in Newcastle-upon-Tyne. (Image credit: Hulton-Deutsch Collection/CORBIS/Corbis via Getty Images)However, as the Isaac Newton Telescope began scientific research, it soon became clear that this world-class scientific instrument was very much hindered by the location in which it was built. With the growth of nearby towns over the prior two decades, the site no longer had the level of dark skies it once did. Furthermore, although the south-east of England has some of the best weather in the United Kingdom, frequent cloud cover was still a significant problem — leaving the telescope unusable for much of the year.With international travel now more feasible, the decision was eventually made to relocate the Isaac Newton Telescope to darker and clearer skies in 1984. It was moved to an observatory site called 'Roque de los Muchachos Observatory', positioned on the top of a volcano on the island of La Palma, in the Canary Islands.Although it is now joined by a much larger telescope, the Isaac Newton Telescope, originally constructed at the Royal Observatory Greenwich in Herstmonceux, is still used in its new home for scientific research today. Shortly after the move of its main telescope, the rest of the Royal Greenwich Observatory site was abandoned in 1990, with the transition of its remaining staff to a new office in Cambridge.An satellite flare shines above the white dome of the Isaac Newton Telescope in this photo by astrophotographer Miguel Claro. (Image credit: Miguel Claro)Following the abandonment of the site in 1990, the site fell into a state of disrepair. The historic telescopes were left to rust in telescope domes forgotten by the outside world. If nobody had stepped in, it's likely the important astronomical heritage of this site would have been lost forever.Thankfully, this was not the case.In April 1995, a charity called Science Projects took out a lease of the site from the landowners. (The land was owned by the Canadian Queen's University, who bought the estate for the nearby Herstmonceux castle). Science Projects restored the site with backing from local district and county councils, restored the historic telescopes and Equatorial Group domes using National Heritage Lottery funds in 2004, and earned the site a nationally recognised Grade II* listed status.Aerial photograph of the Royal Greenwich Observatory at Herstmonceux in 2017. (Image credit: David Goddard/Getty Images)Since then, the former site of the Royal Greenwich Observatory has been home to the now-named Observatory Science Centre, featuring interactive science exhibits, astronomy open evenings, lectures and festivals for all to enjoy. The historic facility now receives over 60,000 visitors per year, ranging from local school students, the general public, and international visitors.The announcement that Observatory Science Centre at Herstmonceux would be closed has brought outrage to the local East Sussex community, with a public petition to save the observatory garnering over 12,000 signatures. I have my own special relationship with the site, and share the public's frustration at the risk of losing both a key piece of global astronomy heritage, and an asset to the local community.The landowners, the Canadian Queens University, have released little information publicly since the announcement of the charity's eviction from their land. Their plans for the observatory site, domes and historic telescopes are unclear, but in February 2025 Queen's University at least announced a commitment to uphold the observatory site's legacy. With an uncertain future, we'll have to wait and see what's next for this historic observatory. Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. Dr. Ryan French is a solar physicist, science communicator and author. He is pursuing the mysteries of the sun at the forefront of modern solar physics research, using cutting-edge telescopes on the ground and in space. Ryan also works to share the wonders of the sun and space with the public, through museums and observatories, television, and social media on Twitter and TikTok. Ryan's first book, \"The Sun: Beginner's guide to our local star\" was published in 2023. More about space exploration",
  "image": "https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-1200-80.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-widget-type=\"contentparsed\" id=\"content\"\u003e\n\n\u003csection\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cpicture data-new-v2-image=\"true\"\u003e\n\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-1920-80.jpg.webp 1920w, https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-1200-80.jpg.webp 1200w, https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-320-80.jpg.webp 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\"/\u003e\n\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-1200-80.jpg\" alt=\"a round, domed building stained green with patina is surrounded by lush green pastures\" srcset=\"https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-1920-80.jpg 1920w, https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-1200-80.jpg 1200w, https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF-320-80.jpg 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/tvaC6846rKYRwy5mBMKcNF.jpg\" data-pin-nopin=\"true\" fetchpriority=\"high\"/\u003e\n\u003c/picture\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003e\n\u003cspan\u003eAerial photograph of the Royal Greenwich Observatory at Herstmonceux in 2017.\u003c/span\u003e\n\u003cspan\u003e(Image credit: David Goddard/Getty Images)\u003c/span\u003e\n\u003c/figcaption\u003e\n\u003c/div\u003e\n\n\u003cdiv id=\"article-body\"\u003e\n\u003cp\u003eNear the small town of Herstmonceux in the English county of East Sussex sits the former home of the Royal Greenwich Observatory. The Royal Observatory Greenwich was first built in Greenwich, London, in 1675. At this original location, the observatory was set up with the goal of producing star charts and accurate time-keeping devices, to allow the British military and commercial fleets to more effectively navigate during their global travels. Over two centuries later, in 1884, the Royal Observatory Greenwich\u0026#39;s extensive star charts made the site a prime choice for defining the world\u0026#39;s line of 0˚ longitude, the original marker of which can still be visited at the Greenwich site today.\u003c/p\u003e\u003cp\u003eBut the original \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/royal-observatory-greenwich-astronomy-photographer-of-the-year-15-winners\" data-before-rewrite-localise=\"https://www.space.com/royal-observatory-greenwich-astronomy-photographer-of-the-year-15-winners\"\u003eRoyal Observatory Greenwich\u003c/a\u003e did not stay at its London location forever. By the 1930s, it was apparent to astronomers that London was no longer a feasible location to conduct astronomical research. Dark and clear skies are needed for these types of observation; and with an expanding London producing ever more smog, \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/nasa-new-sensor-improves-air-pollution-monitoring\" data-before-rewrite-localise=\"https://www.space.com/nasa-new-sensor-improves-air-pollution-monitoring\"\u003eair pollution\u003c/a\u003e, and light pollution, Greenwich could no longer provide the necessary conditions for this work. Plans were eventually made to relocate the observatory operations, including some of the existing 19th century \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/15693-telescopes-beginners-telescope-reviews-buying-guide.html\" data-before-rewrite-localise=\"https://www.space.com/15693-telescopes-beginners-telescope-reviews-buying-guide.html\"\u003etelescopes\u003c/a\u003e, to cleaner skies near the small village of Herstmonceux.\u003c/p\u003e\u003cp\u003eHowever, this historic site is now at risk. In the summer of 2024, the Observatory Science Centre, the charity acting as custodians of the historic Royal Observatory Greenwich site since 1995, \u003ca data-analytics-id=\"inline-link\" href=\"https://www.the-observatory.org/the-observatory-science-centre-seeks-new-premises\" target=\"_blank\" data-url=\"https://www.the-observatory.org/the-observatory-science-centre-seeks-new-premises\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003eannounced\u003c/a\u003e that they would be evicted by the landowners before the end of 2026.\u003c/p\u003e\u003cp\u003eDelayed by World War II, the transfer of the Royal Observatory Greenwich took place from 1947 — 1958. Out of sixty candidate sites, an area in East Sussex was chosen in the south–east of England. At the time, the site was far from the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/light-pollution-serious-threat-astronomy-skywatching\" data-before-rewrite-localise=\"https://www.space.com/light-pollution-serious-threat-astronomy-skywatching\"\u003elight pollution\u003c/a\u003e of large towns and cities, and (believe it or not) even had decent weather (compared to the rest of the UK, at least).\u003c/p\u003e\u003cdiv data-component-name=\"Recirculation:ArticleRiver\"\u003e\n\u003cp\u003e\u003cspan\u003e\nYou may like\n\u003c/span\u003e\u003c/p\u003e\u003cul data-analytics-id=\"more-about-inline\"\u003e\n\u003cli name=\"more-about-inline\" data-analytics-id=\"more-about-inline-0\"\u003e\n\u003ca href=\"https://www.space.com/space-exploration/worlds-largest-telescope-threatened-by-light-pollution-from-renewable-energy-project\" data-before-rewrite-localise=\"https://www.space.com/space-exploration/worlds-largest-telescope-threatened-by-light-pollution-from-renewable-energy-project\"\u003e\nWorld\u0026#39;s largest telescope threatened by light pollution from renewable energy project\n\u003c/a\u003e\n\u003c/li\u003e\n\u003cli name=\"more-about-inline\" data-analytics-id=\"more-about-inline-1\"\u003e\n\u003ca href=\"https://www.space.com/space-exploration/dark-skies-above-worlds-best-astronomy-sites-could-be-ruined-by-new-energy-project\" data-before-rewrite-localise=\"https://www.space.com/space-exploration/dark-skies-above-worlds-best-astronomy-sites-could-be-ruined-by-new-energy-project\"\u003e\nDark skies above world\u0026#39;s best astronomy sites could be ruined by new energy project\n\u003c/a\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\u003cp\u003eFollowing the move, the Royal Observatory Greenwich was renamed the Royal Greenwich Observatory, and scientific research continued. (Much of the original Royal Observatory Greenwich site in London still remains, and is now a part of the National Maritime Museum). Although the institution was founded to produce star charts, the Royal Observatory Greenwich had since moved onto astrophysical research, using telescopes to better understand the physics of the stars and planets above us.\u003c/p\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-320-80.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-1200-80.jpg.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-320-80.jpg\" alt=\"a rainbow stretches across the sky above a domed building in in a lush green countryside\" srcset=\"https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX-1200-80.jpg 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/Sn2sut6LetQbGL4TneGLmX.jpg\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan\u003eRainbow over Herstmonceux in 1981. The observatory dome in the picture used to house Isaac Newton telescope, which is now situated at La Palma in the Canary Islands. \u003c/span\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: Barry Shimmon/Wikimedia Commons/CC BY-SA 2.0)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eAt the core of the new Herstmonceux site was a group of telescopes called the Equatorial Group. At its peak, 200 people worked on site, in support of the observatory\u0026#39;s operations with these telescopes. The Equatorial Group is a group of six telescope domes, making up the primary observatory site. Whereas most telescope domes use a grey or white color, the Equatorial Group telescopes were built of copper, which eventually oxidized into a distinctive green color. This decision was deliberate, to allow the domes to \u0026#39;camouflage\u0026#39; into the surrounding green hills.\u003c/p\u003e\u003cp\u003eIn 1967, the Royal Greenwich Observatory built a new tool — the Isaac Newton Telescope. The Isaac Newton Telescope was housed in its own new huge telescope dome (white this time), offset from the rest of the site. With a 98-inch mirror at its base, this new telescope was the third largest in the world at the time.\u003c/p\u003e\u003cdiv data-hydrate=\"true\" id=\"slice-container-newsletterForm-articleInbodyContent-6ijGRYeCbAKDX39YrWavNJ\"\u003e\u003csection\u003e\u003cp\u003eBreaking space news, the latest updates on rocket launches, skywatching events and more!\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-320-80.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-1200-80.jpg.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-320-80.jpg\" alt=\"a scientist in a lab coat stands atop a massive telescope towering over him inside a hangar\" srcset=\"https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj-1200-80.jpg 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/U6fK8R3H5Dg73fxx7GkCSj.jpg\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan\u003eThe 98 inch Isaac Newton Telescope, the largest in Europe at the time, under construction in 1965 at the works of Grubb Parsons in Newcastle-upon-Tyne. \u003c/span\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: Hulton-Deutsch Collection/CORBIS/Corbis via Getty Images)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eHowever, as the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/38995-isaac-newton-telescope-iridium-flare-photo.html\" data-before-rewrite-localise=\"https://www.space.com/38995-isaac-newton-telescope-iridium-flare-photo.html\"\u003eIsaac Newton Telescope\u003c/a\u003e began scientific research, it soon became clear that this world-class scientific instrument was very much hindered by the location in which it was built. With the growth of nearby towns over the prior two decades, the site no longer had the level of dark skies it once did. Furthermore, although the south-east of England has some of the best weather in the United Kingdom, frequent cloud cover was still a significant problem — leaving the telescope unusable for much of the year.\u003c/p\u003e\u003cp\u003eWith international travel now more feasible, the decision was eventually made to relocate the Isaac Newton Telescope to darker and clearer skies in 1984. It was moved to an observatory site called \u0026#39;Roque de los Muchachos Observatory\u0026#39;, positioned on the top of a volcano on the island of La Palma, in the Canary Islands.\u003c/p\u003e\u003cp\u003eAlthough it is now joined by a much larger telescope, the Isaac Newton Telescope, originally constructed at the Royal Observatory Greenwich in Herstmonceux, is still used in its new home for scientific research today. Shortly after the move of its main telescope, the rest of the Royal Greenwich Observatory site was abandoned in 1990, with the transition of its remaining staff to a new office in Cambridge.\u003c/p\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-320-80.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-1200-80.jpg.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-320-80.jpg\" alt=\"An Iridium flare shines above the white dome of the Isaac Newton Telescope in this photo by astrophotographer Miguel Claro.\" srcset=\"https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf-1200-80.jpg 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/Qe62SArayCRbgfmEwF5Ukf.jpg\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan\u003eAn satellite flare shines above the white dome of the Isaac Newton Telescope in this photo by astrophotographer Miguel Claro. \u003c/span\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: \u003ca href=\"http://www.miguelclaro.com\" data-url=\"http://www.miguelclaro.com\" target=\"_blank\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003eMiguel Claro\u003c/a\u003e)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eFollowing the abandonment of the site in 1990, the site fell into a state of disrepair. The historic telescopes were left to rust in telescope domes forgotten by the outside world. If nobody had stepped in, it\u0026#39;s likely the important astronomical heritage of this site would have been lost forever.\u003c/p\u003e\u003cp\u003eThankfully, this was not the case.\u003c/p\u003e\u003cp\u003eIn April 1995, a charity called Science Projects took out a lease of the site from the landowners. (The land was owned by the Canadian Queen\u0026#39;s University, who bought the estate for the nearby Herstmonceux castle). Science Projects restored the site with backing from local district and county councils, restored the historic telescopes and Equatorial Group domes using National Heritage Lottery funds in 2004, and earned the site a nationally recognised Grade II* listed status.\u003c/p\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-320-80.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-1200-80.jpg.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-320-80.jpg\" alt=\"an aerial view of a complex of buildings that includes five domed structures surrounded by bright green pastures\" srcset=\"https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8-1200-80.jpg 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/wPjT353u8rfM9atq4z9Ko8.jpg\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan\u003eAerial photograph of the Royal Greenwich Observatory at Herstmonceux in 2017. \u003c/span\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: David Goddard/Getty Images)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eSince then, the former site of the Royal Greenwich Observatory has been home to the now-named Observatory Science Centre, featuring interactive science exhibits, astronomy open evenings, lectures and festivals for all to enjoy. The historic facility now receives over 60,000 visitors per year, ranging from local school students, the general public, and international visitors.\u003c/p\u003e\u003cp\u003eThe announcement that Observatory Science Centre at Herstmonceux would be closed has brought outrage to the local East Sussex community, with a \u003ca data-analytics-id=\"inline-link\" href=\"https://www.change.org/p/save-the-observatory-science-centre-herstmonceux?utm_medium=custom_url\u0026amp;utm_source=share_petition\u0026amp;recruited_by_id=17b97580-4dbd-11eb-8410-3ba281859d9a\" target=\"_blank\" data-url=\"https://www.change.org/p/save-the-observatory-science-centre-herstmonceux?utm_medium=custom_url\u0026amp;utm_source=share_petition\u0026amp;recruited_by_id=17b97580-4dbd-11eb-8410-3ba281859d9a\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003epublic petition\u003c/a\u003e to save the observatory garnering over 12,000 signatures. I have my own special relationship with the site, and share the public\u0026#39;s frustration at the risk of losing both a key piece of global astronomy heritage, and an asset to the local community.\u003c/p\u003e\u003cp\u003eThe landowners, the Canadian Queens University, have released little information publicly since the announcement of the charity\u0026#39;s eviction from their land. Their plans for the observatory site, domes and historic telescopes are unclear, but in February 2025 Queen\u0026#39;s University at least announced a commitment to \u003ca data-analytics-id=\"inline-link\" href=\"https://www.queensu.ca/badercollege/bader-college-queens-committed-upholding-observatory-sites-legacy\" target=\"_blank\" data-url=\"https://www.queensu.ca/badercollege/bader-college-queens-committed-upholding-observatory-sites-legacy\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003euphold the observatory site\u0026#39;s legacy\u003c/a\u003e. With an uncertain future, we\u0026#39;ll have to wait and see what\u0026#39;s next for this historic observatory.\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://forums.space.com/\"\u003eJoin our Space Forums\u003c/a\u003e to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: \u003ca href=\"mailto:community@space.com\"\u003ecommunity@space.com.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"slice-container-authorBio-6ijGRYeCbAKDX39YrWavNJ\"\u003e\u003cp\u003eDr. Ryan French is a solar physicist, science communicator and author. He is pursuing the mysteries of the sun at the forefront of modern solar physics research, using cutting-edge telescopes on the ground and in space. Ryan also works to share the wonders of the sun and space with the public, through museums and observatories, television, and social media on Twitter and TikTok. Ryan\u0026#39;s first book, \u0026#34;\u003ca href=\"https://www.amazon.com/Sun-Beginners-Guide-Local-Star/dp/0008580235/ref=tmm_pap_swatch_0?_encoding=UTF8\u0026amp;amp\u0026amp;qid=1682619306\u0026amp;amp\u0026amp;sr=8-1\u0026amp;_encoding=UTF8\u0026amp;tag=ryanjfrench-20\u0026amp;linkCode=ur2\u0026amp;linkId=82674ef71b8e45a74f28e6fbca209df6\u0026amp;camp=1789\u0026amp;creative=9325\" target=\"_blank\"\u003eThe Sun: Beginner\u0026#39;s guide to our local star\u003c/a\u003e\u0026#34; was published in 2023.\u003c/p\u003e\u003c/div\u003e\n\n\u003c/section\u003e\n\n\n\n\n\n\u003cdiv data-test-id=\"more-about\"\u003e\n\u003cp\u003eMore about space exploration\u003c/p\u003e\n\n\n\u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-03-23T14:00:00Z",
  "modifiedTime": "2025-03-23T14:00:00Z"
}
