{
  "id": "1c825b7a-8a00-454b-ab48-1222bf314557",
  "title": "Station Science Top News: Jan. 24, 2025",
  "link": "https://www.nasa.gov/general/station-science-top-news-jan-24-2025/",
  "description": "Reducing reliance on resupply missions Resupply of life support elements such as air, water, food, clothing, and hygiene items will be impractical on missions to the Moon and beyond. This research assessed current use and resupply of these elements on the International Space Station and outlines technologies needed for sustained human presence in space, such […]",
  "author": "Linda E. Grimm",
  "published": "Mon, 27 Jan 2025 20:13:58 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Johnson Space Center",
    "General",
    "International Space Station (ISS)"
  ],
  "byline": "Linda E. Grimm",
  "length": 2447,
  "excerpt": "Reducing reliance on resupply missions",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Melissa L. GaskillInternational Space Station Research Communications TeamJan 27, 2025 Reducing reliance on resupply missions Resupply of life support elements such as air, water, food, clothing, and hygiene items will be impractical on missions to the Moon and beyond. This research assessed current use and resupply of these elements on the International Space Station and outlines technologies needed for sustained human presence in space, such as 3D printing maintenance parts, systems for laundering clothes, and improved recovery and recycling of elements. Researchers analyzed the types and mass of elements supplied from Earth to the station and astronaut feedback from various studies and interviews. The paper also used data from ISS Internal Environments, a wide-ranging investigation that samples various aspects of the space station environment in support of many types of research. Verifying a technique for analyzing emulsions This paper presents a review of examining the behavior of emulsions (suspensions of particles in a liquid) in microgravity using a technique called diffusing wave spectroscopy. Results offer insights that could support development of technologies to improve living environments and foods for crew members on future missions. FSL Soft Matter Dynamics – PASTA studied the dynamics of droplets in emulsions. Accurate study and characterization of the effects of additives on emulsion stability is possible in microgravity. Emulsions have applications in foods, cosmetics, pharmaceuticals, fuels, paints and coatings, chemical processing, and materials. EEG measurements and predicting cognitive changes in spaceflight Researchers used an electroencephalogram (EEG) to measure brainwave activity during a relaxed, wakeful state in crew members and found no significant differences before, during, and after flight. These types of measurements could serve as biomarkers of brain health status, helping to predict changes in cognitive performance and the need for prevention and countermeasure strategies during future missions. Studies have shown that spaceflight can affect key cognitive and motor skills such as task management, attention, and movement speed and accuracy. Neurowellness in Space Ax-1 tested using a portable, easy to use EEG headset to measure ongoing and task-related brain activity in microgravity. The data could help predict and monitor neural changes on future space missions.",
  "image": "https://www.nasa.gov/wp-content/uploads/2025/01/iss067e253411.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-812612\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003eMelissa L. Gaskill\u003c/h3\u003e\u003ch4\u003eInternational Space Station Research Communications Team\u003c/h4\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eJan 27, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003e\u003cem\u003eReducing reliance on resupply missions\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eResupply of life support elements such as air, water, food, clothing, and hygiene items will be impractical on missions to the Moon and beyond. \u003ca href=\"https://www.frontiersin.org/journals/space-technologies/articles/10.3389/frspt.2024.1461389/full\" rel=\"noopener\"\u003eThis research\u003c/a\u003e assessed current use and resupply of these elements on the International Space Station and outlines technologies needed for sustained human presence in space, such as 3D printing maintenance parts, systems for laundering clothes, and improved recovery and recycling of elements.\u003c/p\u003e\n\u003cp\u003eResearchers analyzed the types and mass of elements supplied from Earth to the station and astronaut feedback from various studies and interviews. The paper also used data from \u003ca href=\"https://www.nasa.gov/mission/station/research-explorer/investigation/?#id=1018\"\u003eISS Internal Environments\u003c/a\u003e, a wide-ranging investigation that samples various aspects of the space station environment in support of many types of research.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eVerifying a technique for analyzing emulsions\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://www.sciencedirect.com/science/article/pii/S1359029424001109\" rel=\"noopener\"\u003eThis paper\u003c/a\u003e presents a review of examining the behavior of emulsions (suspensions of particles in a liquid) in microgravity using a technique called diffusing wave spectroscopy. Results offer insights that could support development of technologies to improve living environments and foods for crew members on future missions.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.nasa.gov/mission/station/research-explorer/investigation/?#id=7963\"\u003eFSL Soft Matter Dynamics – PASTA\u003c/a\u003e studied the dynamics of droplets in emulsions. Accurate study and characterization of the effects of additives on emulsion stability is possible in microgravity. Emulsions have applications in foods, cosmetics, pharmaceuticals, fuels, paints and coatings, chemical processing, and materials.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eEEG measurements and predicting cognitive changes in spaceflight\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eResearchers used an electroencephalogram (EEG) to measure brainwave activity during a relaxed, wakeful state in crew members and \u003ca href=\"https://www.mdpi.com/2076-3425/14/12/1194\" rel=\"noopener\"\u003efound no significant differences\u003c/a\u003e before, during, and after flight. These types of measurements could serve as biomarkers of brain health status, helping to predict changes in cognitive performance and the need for prevention and countermeasure strategies during future missions.\u003c/p\u003e\n\n\u003cp\u003eStudies have shown that spaceflight can affect key cognitive and motor skills such as task management, attention, and movement speed and accuracy. \u003ca href=\"https://www.nasa.gov/mission/station/research-explorer/investigation/?#id=8659\"\u003eNeurowellness in Space Ax-1\u003c/a\u003e tested using a portable, easy to use EEG headset to measure ongoing and task-related brain activity in microgravity. The data could help predict and monitor neural changes on future space missions.\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-27T15:13:58-05:00",
  "modifiedTime": "2025-01-27T15:13:59-05:00"
}
