{
  "id": "352cfdcd-e9cd-4a78-9d82-680466049f1a",
  "title": "An amateur astronomer used an old technique to study Jupiter — and found something strange",
  "link": "https://www.space.com/the-universe/jupiter/an-amateur-astronomer-used-an-old-technique-to-study-jupiter-and-found-something-strange",
  "description": "The long-held assumption that Jupiter's iconic swirling clouds are made of frozen ammonia could be upended.",
  "author": "",
  "published": "Thu, 09 Jan 2025 20:04:43 +0000",
  "source": "https://www.space.com/feeds/all",
  "categories": [
    "Jupiter",
    "The Universe",
    "Solar System"
  ],
  "byline": "Victoria Corless",
  "length": 7263,
  "excerpt": "\"Astronomers will always assume a simple model unless there is overwhelming evidence that this simple model is flawed.\"",
  "siteName": "Space",
  "favicon": "https://vanilla.futurecdn.net/space/1145718/apple-touch-icon.png",
  "text": "An image of Jupiter. (Image credit: NASA/ESA/Amy Simon (NASA-GSFC)) Scientists and amateur astronomers have teamed up to upend a long-held assumption that Jupiter's iconic swirling clouds are made of frozen ammonia — a pretty foundational revelation about the gas giant we thought we knew well.Using commercially available telescopes and spectral filters, an amateur astronomer named Steve Hill collected data to map the abundance of ammonia in Jupiter's atmosphere, but Hill ultimately found something that contradicted previous models of the gas giant's atmospheric composition to begin with.\"I was intrigued!\" Patrick Irwin from the University of Oxford told Space.com. \"At first, I was dubious that Steve's method could produce such detailed ammonia maps.\" But as the analysis unfolded, doubt gave way to excitement — it was clear that Hill was onto something.Jupiter's atmosphere is mostly composed of hydrogen and helium, with small amounts of ammonia, methane, water vapor and other gases. These latter components condense at different levels to form clouds, which reflect sunlight to create the planet's striking appearance. Because ammonia is known to be present in Jupiter's atmosphere and is predicted to condense (or form clouds) at the lowest pressure of all the known gases, scientists widely assumed that the planet's main observable upper clouds were made of ammonia ice.\"Astronomers will always assume a simple model unless there is overwhelming evidence that this simple model is flawed,\" Irwin said. \"Since we can see ammonia gas in Jupiter's atmosphere [...], it was just assumed that its main observable clouds were most likely composed of ammonia ice.\"Irwin first connected with Hill in 2023 through a mutual contact at the British Astronomical Society after Hill had presented his intriguing observations. \"[Steve] was interested in collaborating with a professional astronomer to analyze and validate his approach,\" said Irwin. \"[He applied] a technique first used in the 70s and 80s using visible absorption bands of ammonia and methane at red wavelengths. Although well known, this technique had not been used much since.\"The technique is called band-depth analysis and is used to estimate the concentration of a specific gas based on how much light is absorbed at wavelengths specific to that gas — in this case methane and ammonia.Breaking space news, the latest updates on rocket launches, skywatching events and more!Hill used the absorption bands of methane (619 nm) and ammonia (647 nm), both well-known features in Jupiter's visible spectrum, to calculate the abundance of these gases above Jupiter’s cloud tops. Methane's absorption at 619 nm serves as a reliable reference point because methane's abundance is well known and its absorption can be used to determine pressure levels. By comparing this to ammonia's absorption at 647 nm, Hill was able to calculate and map the distribution of ammonia across Jupiter’s clouds with surprisingly high accuracy.\"We know methane to be well mixed in the atmosphere and we have a good estimate of its abundance,\" elaborated Irwin. \"We can thus use the difference in reflection between [images] observed in these two absorption bands to determine both the cloud top pressure and the relative abundance of ammonia.\"What the team found was that the reflected light was coming from cloud layers where atmospheric pressure would be too high and temperatures too warm for ammonia to condense. \"[The observations] show very clearly that the main layer of reflection [...] is much deeper than the expected condensation level of ammonia at 0.7 bar, actually occurring much deeper at 2-3 bar,\" said Irwin.The only thing to do was conclude that ammonia ice could not be the main constituent of Jupiter's clouds. Instead, modelling predicts the clouds are most likely composed of ammonium hydrosulfide and possibly smog produced by photochemical reactions in the atmosphere, as the coloration of the clouds is not consistent with pure ices.\"However, we don't know it's this composition for sure,\" added Irwin. \"It has also been suggested that the clouds could be an exotic combination of water and ammonia.\"What it does show, he continued, is there is a lot of complex photochemistry going on in Jupiter's atmosphere. \"It seems that in most regions, ammonia is photolyzed and destroyed faster than it can be uplifted,\" Irwin said. \"So pure ammonia ice clouds are rather rare and limited to small regions of very rapid and vigorous convection.\"Hill's observations and theory were validated with Irwin's help through a comparison with more advanced techniques, analyzing data from the MUSE instrument on ESO's Very Large Telescope (VLT), the Very Large Array (VLA) and NASA's Juno Mission. This is significant because it not only confirms these exciting findings but also makes observations of Jupiter — and other similar planets, like Saturn — more accessible and easier to conduct.\"Where ammonia is and is not provides a powerful tracer of weather processes on Jupiter, making it important for understanding the planet and others like it,\" wrote Hill in his original paper published last year in the journal Earth and Space Science.Though an exciting breakthrough, the scientists acknowledge there are still limitations that need to be ironed out. For one, the current results are dependent on an assumed \"vertical\" profile of ammonia, which scientists often assume is constant.\"In reality, it's much more likely to be varying with height below the ammonia condensation level, but this is not easy to constrain with our observations,\" said Irwin. \"We need to intercompare more closely the VLT/MUSE, Juno, and VLA results. One solution should fit all observations, but we’ll need to iterate a bit on this to figure out what the vertical profile of ammonia is at different locations in Jupiter’s atmosphere.\"The astronomers have also applied their technique to observations of Saturn, similarly finding that reflection from the main cloud layer occurs deeper than previously expected — also well below the level that ammonia would condense into clouds. \"This suggests similar photochemical processes are also operating in Saturn’s atmosphere,\" added Irwin. \"We also determine the deep abundance of ammonia and find it to be consistent with recent James Webb Space Telescope observations.\"This work highlights how contributions from both professional and amateur astronomers push the boundaries of our understanding. Even seemingly \"simple\" observations can provide valuable insights and expand our knowledge of the cosmos. Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. A chemist turned science writer, Victoria Corless completed her Ph.D. in organic synthesis at the University of Toronto and, ever the cliché, realized lab work was not something she wanted to do for the rest of her days. After dabbling in science writing and a brief stint as a medical writer, Victoria joined Wiley’s Advanced Science News where she works as an editor and writer. On the side, she freelances for various outlets, including Research2Reality and Chemistry World. Most Popular",
  "image": "https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-1200-80.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-widget-type=\"contentparsed\" id=\"content\"\u003e\n\n\u003csection\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cpicture data-new-v2-image=\"true\"\u003e\n\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-1920-80.jpg.webp 1920w, https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-1200-80.jpg.webp 1200w, https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-320-80.jpg.webp 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\"/\u003e\n\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-320-80.jpg\" alt=\"A tan, gaseous Jupiter hangs in black space, layered like a cross section of geological survey, a swirling red storm at its lower left.\" srcset=\"https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-1920-80.jpg 1920w, https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-1200-80.jpg 1200w, https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh-320-80.jpg 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/mRALoaMgTXNyFeFhBdqkuh.jpg\" data-pin-nopin=\"true\" fetchpriority=\"high\" crossorigin=\"anonymous\"/\u003e\n\u003c/picture\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003e\n\u003cspan\u003eAn image of Jupiter.\u003c/span\u003e\n\u003cspan\u003e(Image credit: NASA/ESA/Amy Simon (NASA-GSFC))\u003c/span\u003e\n\u003c/figcaption\u003e\n\u003c/div\u003e\n\n\u003cdiv id=\"article-body\"\u003e\n\u003cp\u003eScientists and amateur astronomers have teamed up to upend a long-held assumption that Jupiter\u0026#39;s iconic swirling clouds are made of frozen ammonia — a pretty foundational revelation about the gas giant we thought we knew well.\u003c/p\u003e\u003cp\u003eUsing commercially available telescopes and spectral filters, an amateur astronomer named Steve Hill collected data to map the abundance of ammonia in \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/7-jupiter-largest-planet-solar-system.html\" data-before-rewrite-localise=\"https://www.space.com/7-jupiter-largest-planet-solar-system.html\"\u003eJupiter\u003c/a\u003e\u0026#39;s atmosphere, but Hill ultimately found something that contradicted previous models of the gas giant\u0026#39;s atmospheric composition to begin with.\u003c/p\u003e\u003cp\u003e\u0026#34;I was intrigued!\u0026#34; Patrick Irwin from the University of Oxford told Space.com. \u0026#34;At first, I was dubious that Steve\u0026#39;s method could produce such detailed ammonia maps.\u0026#34; But as the analysis unfolded, doubt gave way to excitement — it was clear that Hill was onto something.\u003c/p\u003e\u003cp\u003eJupiter\u0026#39;s atmosphere is mostly composed of hydrogen and helium, with small amounts of ammonia, methane, water vapor and other gases. These latter components condense at different levels to form clouds, which reflect sunlight to create the planet\u0026#39;s striking appearance. Because ammonia is known to be present in Jupiter\u0026#39;s atmosphere and is predicted to condense (or form clouds) at the lowest pressure of all the known gases, scientists widely assumed that the planet\u0026#39;s main observable upper clouds were made of ammonia ice.\u003c/p\u003e\u003cp\u003e\u0026#34;Astronomers will always assume a simple model unless there is overwhelming evidence that this simple model is flawed,\u0026#34; Irwin said. \u0026#34;Since we can see ammonia gas in Jupiter\u0026#39;s atmosphere [...], it was just assumed that its main observable clouds were most likely composed of ammonia ice.\u0026#34;\u003c/p\u003e\u003cp\u003eIrwin first connected with Hill in 2023 through a mutual contact at the British Astronomical Society after Hill had presented his intriguing observations. \u0026#34;[Steve] was interested in collaborating with a professional astronomer to analyze and validate his approach,\u0026#34; said Irwin. \u0026#34;[He applied] a technique first used in the 70s and 80s using visible absorption bands of ammonia and methane at red \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/electromagnetic-spectrum-use-in-astronomy\" data-before-rewrite-localise=\"https://www.space.com/electromagnetic-spectrum-use-in-astronomy\"\u003ewavelengths\u003c/a\u003e. Although well known, this technique had not been used much since.\u0026#34;\u003c/p\u003e\u003cp\u003eThe technique is called band-depth analysis and is used to estimate the concentration of a specific gas based on how much light is absorbed at wavelengths specific to that gas — in this case methane and ammonia.\u003c/p\u003e\u003cdiv data-hydrate=\"true\" id=\"slice-container-newsletterForm-articleInbodyContent-VMJ9a4ebd5umXndQfU6XDc\"\u003e\u003csection\u003e\u003cp\u003eBreaking space news, the latest updates on rocket launches, skywatching events and more!\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e\u003cp\u003eHill used the absorption bands of methane (619 nm) and ammonia (647 nm), both well-known features in Jupiter\u0026#39;s visible spectrum, to calculate the abundance of these gases above Jupiter’s cloud tops. Methane\u0026#39;s absorption at 619 nm serves as a reliable reference point because methane\u0026#39;s abundance is well known and its absorption can be used to determine pressure levels. By comparing this to ammonia\u0026#39;s absorption at 647 nm, Hill was able to calculate and map the distribution of ammonia across Jupiter’s clouds with surprisingly high accuracy.\u003c/p\u003e\u003cp\u003e\u0026#34;We know methane to be well mixed in the atmosphere and we have a good estimate of its abundance,\u0026#34; elaborated Irwin. \u0026#34;We can thus use the difference in reflection between [images] observed in these two absorption bands to determine both the cloud top pressure and the relative abundance of ammonia.\u0026#34;\u003c/p\u003e\u003cp\u003eWhat the team found was that the reflected light was coming from cloud layers where atmospheric pressure would be too high and temperatures too warm for ammonia to condense. \u0026#34;[The observations] show very clearly that the main layer of reflection [...] is much deeper than the expected condensation level of ammonia at 0.7 bar, actually occurring much deeper at 2-3 bar,\u0026#34; said Irwin.\u003c/p\u003e\u003cp\u003eThe only thing to do was conclude that ammonia ice could not be the main constituent of Jupiter\u0026#39;s clouds. Instead, modelling predicts the clouds are most likely composed of ammonium hydrosulfide and possibly smog produced by photochemical reactions in the atmosphere, as the coloration of the clouds is not consistent with pure ices.\u003c/p\u003e\u003cp\u003e\u0026#34;However, we don\u0026#39;t know it\u0026#39;s this composition for sure,\u0026#34; added Irwin. \u0026#34;It has also been suggested that the clouds could be an exotic combination of water and ammonia.\u0026#34;\u003c/p\u003e\u003cp\u003eWhat it does show, he continued, is there is a lot of complex photochemistry going on in Jupiter\u0026#39;s atmosphere. \u0026#34;It seems that in most regions, ammonia is photolyzed and destroyed faster than it can be uplifted,\u0026#34; Irwin said. \u0026#34;So pure ammonia ice clouds are rather rare and limited to small regions of very rapid and vigorous convection.\u0026#34;\u003c/p\u003e\u003cp\u003eHill\u0026#39;s observations and theory were validated with Irwin\u0026#39;s help through a comparison with more advanced techniques, analyzing data from the MUSE instrument on ESO\u0026#39;s Very Large Telescope (VLT), the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/very-large-array.html\" data-before-rewrite-localise=\"https://www.space.com/very-large-array.html\"\u003eVery Large Array\u003c/a\u003e (VLA) and NASA\u0026#39;s \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/32742-juno-spacecraft.html\" data-before-rewrite-localise=\"https://www.space.com/32742-juno-spacecraft.html\"\u003eJuno\u003c/a\u003e Mission. This is significant because it not only confirms these exciting findings but also makes observations of Jupiter — and other similar planets, like Saturn — more accessible and easier to conduct.\u003c/p\u003e\u003cp\u003e\u0026#34;Where ammonia is and is not provides a powerful tracer of weather processes on Jupiter, making it important for understanding the planet and others like it,\u0026#34; \u003ca data-analytics-id=\"inline-link\" href=\"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EA003562\" data-url=\"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EA003562\" target=\"_blank\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003e\u003cu\u003ewrote\u003c/u\u003e\u003c/a\u003e Hill in his original paper published last year in the journal Earth and Space Science.\u003c/p\u003e\u003cp\u003eThough an exciting breakthrough, the scientists acknowledge there are still limitations that need to be ironed out. For one, the current results are dependent on an assumed \u0026#34;vertical\u0026#34; profile of ammonia, which scientists often assume is constant.\u003c/p\u003e\u003cp\u003e\u0026#34;In reality, it\u0026#39;s much more likely to be varying with height below the ammonia condensation level, but this is not easy to constrain with our observations,\u0026#34; said Irwin. \u0026#34;We need to intercompare more closely the VLT/MUSE, Juno, and VLA results. One solution should fit all observations, but we’ll need to iterate a bit on this to figure out what the vertical profile of ammonia is at different locations in Jupiter’s atmosphere.\u0026#34;\u003c/p\u003e\u003cp\u003eThe astronomers have also applied their technique to observations of Saturn, similarly finding that reflection from the main cloud layer occurs deeper than previously expected — also well below the level that ammonia would condense into clouds. \u0026#34;This suggests similar photochemical processes are also operating in Saturn’s atmosphere,\u0026#34; added Irwin. \u0026#34;We also determine the deep abundance of ammonia and find it to be consistent with recent James Webb Space Telescope observations.\u0026#34;\u003c/p\u003e\u003cp\u003eThis work highlights how contributions from both professional and amateur astronomers push the boundaries of our understanding. Even seemingly \u0026#34;simple\u0026#34; observations can provide valuable insights and expand our knowledge of the cosmos.\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://forums.space.com/\"\u003eJoin our Space Forums\u003c/a\u003e to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: \u003ca href=\"mailto:community@space.com\"\u003ecommunity@space.com.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\u003cdiv id=\"slice-container-authorBio-VMJ9a4ebd5umXndQfU6XDc\"\u003e\u003cp\u003eA chemist turned science writer, Victoria Corless completed her Ph.D. in organic synthesis at the University of Toronto and, ever the cliché, realized lab work was not something she wanted to do for the rest of her days. After dabbling in science writing and a brief stint as a medical writer, Victoria joined Wiley’s Advanced Science News\u003cem\u003e \u003c/em\u003ewhere she works as an editor and writer. On the side, she freelances for various outlets, including Research2Reality and Chemistry World.\u003c/p\u003e\u003c/div\u003e\n\n\u003c/section\u003e\n\n\n\n\n\n\u003cdiv id=\"slice-container-relatedArticles\"\u003e\u003cp\u003e\u003ch5\u003eMost Popular\u003c/h5\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-09T20:04:43Z",
  "modifiedTime": "2025-01-09T20:04:43Z"
}
