{
  "id": "78eb2629-d250-486d-9715-6cef6e4b06e3",
  "title": "NASA Worm as Art",
  "link": "https://www.nasa.gov/general/museum-of-modern-art-exhibits-nasa-worm/",
  "description": "Museum of Modern Art Opens Exhibition Featuring NASA Worm The iconic NASA logotype, commonly known as the worm and designed by Bruce Blackburn and Richard Danne in 1976, made its premiere Tuesday, Jan. 23, 2025 at the Museum of Modern Art (MoMA) in New York as part of the museum’s new exhibition “Pirouette: Turning Points […]",
  "author": "Karen Northon",
  "published": "Thu, 23 Jan 2025 17:02:27 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "NASA Art Program",
    "General"
  ],
  "byline": "Karen Northon",
  "length": 800,
  "excerpt": "The iconic NASA logotype, commonly known as the worm and designed by Bruce Blackburn and Richard Danne in 1976, made its premiere Tuesday, Jan. 23, 2025 at",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Karen NorthonJan 23, 2025 The iconic NASA logotype, commonly known as the worm and designed by Bruce Blackburn and Richard Danne in 1976, made its premiere Tuesday, Jan. 23, 2025 at the Museum of Modern Art (MoMA) in New York as part of the museum’s new exhibition “Pirouette: Turning Points in Design,” which runs through Oct. 18. MoMA accessioned the logotype for its permanent collection, as well as the original NASA Graphics Standards Manual published in 1976, also gifted by NASA. The exhibit also includes a letterform sketch of the NASA worm gifted by the Bruce Blackburn Estate. The “Pirouette: Turning Points in Design” exhibition showcases widely recognized design icons and those known to more niche audiences, highlighting pivotal moments in design history. Credit: NASA/Bert Ulrich",
  "image": "https://www.nasa.gov/wp-content/uploads/2025/01/momapng.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-810032\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://secure.gravatar.com/avatar/7ec43dbe24f7cb236131a65c7ca28785?s=300\u0026amp;d=blank\u0026amp;r=g\" alt=\"The headshot image of Karen Northon\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch3\u003eKaren Northon\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eJan 23, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\n\n\u003cp\u003eThe iconic NASA logotype, commonly known as the worm and designed by Bruce Blackburn and Richard Danne in 1976, made its premiere Tuesday, Jan. 23, 2025 at the Museum of Modern Art (MoMA) in New York as part of the museum’s new exhibition “Pirouette: Turning Points in Design,” which runs through Oct. 18.\u003c/p\u003e\n\u003cp\u003eMoMA accessioned the logotype for its permanent collection, as well as the original NASA Graphics Standards Manual published in 1976, also gifted by NASA. The exhibit also includes a letterform sketch of the NASA worm gifted by the Bruce Blackburn Estate.\u003c/p\u003e\n\n\u003cp\u003eThe “Pirouette: Turning Points in Design” exhibition showcases widely recognized design icons and those known to more niche audiences, highlighting pivotal moments in design history.\u003c/p\u003e\n\n\u003cp\u003eCredit: NASA/Bert Ulrich\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2025-01-23T12:02:27-05:00",
  "modifiedTime": "2025-01-23T15:13:21-05:00"
}
