{
  "id": "84a330c5-10c9-4e22-a368-2550bfd7f568",
  "title": "The Next Full Moon is the Cold Moon",
  "link": "https://science.nasa.gov/solar-system/skywatching/the-next-full-moon-is-the-cold-moon-frost-moon-or-winter-moon/",
  "description": "The Next Full Moon is the Cold Moon, Frost Moon, or the Winter Moon; the Moon before Yule or the Oak Moon; the Long Night Moon; the Child Moon; the Datta or Dattatreya Jayanti Festival Moon; the Karthika Deepam Festival Moon; Unduvap Poya; and the Chang’e Moon. The next full Moon will be Sunday morning, […]",
  "author": "",
  "published": "Mon, 09 Dec 2024 22:05:49 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Skywatching",
    "Skywatching Tips"
  ],
  "byline": "Gordon Johnston",
  "length": 35523,
  "excerpt": "The Next Full Moon is the Cold Moon, Frost Moon, or the Winter Moon; the Moon before Yule or the Oak Moon; or the Long Night Moon.",
  "siteName": "",
  "favicon": "https://science.nasa.gov/apple-touch-icon.png",
  "text": "A full Moon rising over the Wasatch Mountains in Utah on March 15, 2014.Credits: NASA/Bill DunfordThe Next Full Moon is the Cold Moon, Frost Moon, or the Winter Moon; the Moon before Yule or the Oak Moon; the Long Night Moon; the Child Moon; the Datta or Dattatreya Jayanti Festival Moon; the Karthika Deepam Festival Moon; Unduvap Poya; and the Chang'e Moon.The next full Moon will be Sunday morning, Dec. 15, 2024, passing opposite the Sun at 4:02 a.m. EST. This will be Saturday evening from Alaska Time westwards to the International Date Line. The Moon will appear full for about three days around this time, from Friday evening through Monday morning, making this a full Moon weekend.The Maine Farmers' Almanac began publishing Native American names for full Moons in the 1930s. Over time these names have become widely known and used. According to this almanac, as the full Moon in December this is the Cold Moon, due to the long, cold nights. Other names are the Frost Moon (for the frosts as winter nears) or the Winter Moon.As the full Moon before the winter solstice, old European names for this Moon include the Moon before Yule and the Oak Moon. Yule was a three-day winter solstice festival in pre-Christian Europe. In the 10th century King Haakon I associated Yule with Christmas as part of the Christianization of Norway, and this association spread throughout Europe. Some believe that the Oak Moon name ties back to ancient druid traditions of harvesting mistletoe from oak trees, a practice first recorded by the Roman historian Pliny the Elder in the first century CE. The term \"druid\" may derive from the Proto-Indo-European roots for \"oak\" and \"to see,\" suggesting \"druid\" means \"oak knower\" or \"oak seer.\"As the full Moon closest to the winter solstice, this will be the Long Night Moon. The plane of the Moon's orbit around Earth nearly matches the plane of Earth's orbit around the Sun. When the path of the Sun appears lowest in the sky for the year, the path of the full Moon opposite the Sun appears near its highest. For the Washington, D.C. area, on Saturday evening into Sunday morning, December 14 to 15, the Moon will be in the sky for a total of 16 hours 1 minute and will reach a maximum altitude of 79.0 degrees (at 11:52 p.m. EST), with 14 hours 33 minutes of this when the Sun is down. The next night, Sunday evening into Monday morning, December 15 to 16, the full Moon will be in the sky slightly longer and will reach higher in the sky, but slightly less of this time will be when the Sun is down. The Moon will be in the sky for a total of 16 hours 3 minutes and will reach a maximum altitude of 79.2 degrees (at 1:54 a.m.), with 14 hours 29 minutes of this when the Sun is down.This also is the Child Moon. Five years ago, then 7-year-old Astrid Hattenbach was walking home from school with her father Henry Throop (a friend and former coworker at NASA Headquarters). When she saw the rising full Moon, she said: “You know what this Moon is called? It’s called a Child Moon. Because the Moon rises at a time that the children, they can see it, because they’re not in bed, and they might even be outside like we are right now.” Henry told me about this and I thought it a perfect name. This year (at least for Washington, D.C. and similar latitudes), the earliest evenings with a full Moon in the sky will be on December 13 through 15, with sunset at 4:44 p.m. EST and evening twilight ending at 5:50 p.m. (on the 13th) or 5:51 p.m. (on the 14th and 15th). For more on the wonder the Moon imbues in the hearts of children (and in all of us) look up Carl Sandburg's poem \"Child Moon.\"For Hindus, this full Moon corresponds with Datta Jayanti, also known as Dattatreya Jayanti, a festival commemorating the birth day of the Hindu god Dattatreya (Datta), celebrated on the full Moon day of the month of Margashira.Karthika Deepam is a festival observed by Hindus of Tamil Nadu, Sri Lanka, and Kerala when the nearly full Moon lines up with the Pleiades constellation (Krittikai or Karttikai). This year it will be on Friday, December 13. Some areas celebrate multi-day festivals that include this full Moon.For the Buddhists of Sri Lanka, this is Unduvap Poya. In the third century BCE, Sangamitta Theri, the daughter of Emperor Ashoka and founder of an order of Buddhist nuns in Sri Lanka, is believed to have brought a sapling of the sacred Bodhi Tree, or Bo Tree, to Sri Lanka. The sapling was planted in 288 BCE by King Devanampiya Tissa in the Mahamevnāwa Park in Anuradhapura where it still grows today, where it is believed by some to be the oldest living human-planted tree with a known planting date.We could also call this the Chang'e Moon, after the three Chinese lunar landers that launched and landed on the Moon this time of year. These missions get their name from the Chinese goddess of the Moon, Chang'e, who lived on the Moon with her pet rabbit, Yutu. The Chang'e 3 lander and its companion Yutu rover launched on Dec. 1, 2013, and landed on the Moon a few days later on December 14. The Chang'e 4 lander and Yutu-2 rover launched Dec. 7, 2018, and landed on the Moon on Jan. 3, 2019. The Chang'e 5 lunar sample return mission was launched in 2020 on November 23 (in UTC, November 24 in China's time zone), collected samples from the Moon, and returned them to Earth on Dec. 16, 2020, humanity's first lunar sample return since 1976. The Chang'e 6 lunar sample return mission ended the \"streak\" of December missions by launching on May 3, collecting samples from the Moon, and returning them to Earth on June 25, 2024, humanity's first lunar sample return from the far side of the Moon.In many traditional Moon-based calendars the full Moons fall on or near the middle of each month. This full Moon is near the middle of the eleventh month of the Chinese year of the Dragon and Jumādā ath-Thāniyah, also known as Jumādā al-ʾĀkhirah, the sixth month of the Islamic year. This full Moon is the middle of Kislev in the Hebrew calendar. Hanukkah begins on the 25th of Kislev (starting this year with sundown on December 25) and ends 8 days later (with sundown on January 2).As usual, the wearing of suitably celebratory celestial attire is encouraged in honor of the full Moon. Bundle up for the cold, then take advantage of these early nightfalls to admire the sky, Moon, planets, and stars!Here are other celestial events between now and the full Moon after next with specific times and angles based on the location of NASA Headquarters in Washington, D.C.:For the Northern Hemisphere, as autumn ends and winter begins, the daily periods of sunlight reach their shortest at the winter solstice and then begin to lengthen again. Our 24-hour clock is based on the average length of the solar day. The winter solstice has the longest night of the year. The winter solstice is sometimes called the \"shortest day of the year\" (because it has the shortest period of sunlight), but the solar days near the solstice are actually the longest. Because of this, the earliest sunset of the year occurs before the solstice (on December 6 and 7 for the Washington, D.C. area) and the latest sunrise of the year (ignoring Daylight Savings Time) occurs after the solstice on Jan. 4, 2025.On Sunday, December 15, (the day of the full Moon), morning twilight will begin at 6:16 a.m. EST, sunrise will be at 7:20 a.m., solar noon will be at 12:04 p.m. when the Sun will reach its maximum altitude of 27.8 degrees, sunset will be at 4:47 p.m., and evening twilight will end at 5:51 p.m.Saturday, December 21, will be the day of the Northern Hemisphere winter solstice, the astronomical end of fall and start of winter. The winter solstice is the day when the Sun at solar noon is lowest in the sky and the time from sunrise to sunset is shortest for the year. At NASA Headquarters, the time from sunrise to sunset will be 9 hours, 26 minutes, 13 seconds. Solar noon will be at 12:07 p.m. EST when the Sun will reach its lowest daily high, 27.7 degrees. The longest solar day (measured from noon to noon on a sundial) will be from solar noon on December 21 to solar noon on December 22, 29.8 seconds longer than 24 hours.By Monday, Jan. 13, 2025 (the day of the full Moon after next), morning twilight will begin at 6:24 a.m. EST, sunrise will be at 7:26 a.m., solar noon will be at 12:17 p.m. when the Sun will reach its maximum altitude of 29.8 degrees, sunset will be at 5:08 p.m., and evening twilight will end at 6:11 p.m.This will still be a good time for Jupiter and Saturn watching, especially with a backyard telescope. Saturn was at its closest and brightest on September 7 and Jupiter on December 7. With clear skies and a telescope, you should be able to see Jupiter's four bright moons, Ganymede, Callisto, Europa, and Io, noticeably shifting positions in the course of an evening. For Saturn, you should be able to see Saturn's rings and its bright moon Titan. The rings are appearing thinner and will be edge-on to Earth in March 2025. We won't get the \"classic\" view of Saturn showing off its rings until 2026. During this lunar cycle both of these planets will be shifting towards the west, making them easier to see earlier in the evening sky (and friendlier for backyard stargazing, especially if you have young ones with earlier bedtimes). During this lunar cycle, as twilight ends each evening, Saturn will be shifting from 43 degrees above the southern horizon to 33 degrees above the southwestern horizon while Jupiter will be shifting from 19 degrees above the east-northeastern horizon to 47 degrees above the eastern horizon.CometsSungrazing comet C/2024 G3 (ATLAS) was discovered in April 2024. It will be passing very near the Sun and might be bright enough to see in the daytime for a short time around its closest approach to the Sun on January 13. The Southern Hemisphere will have the best viewing before and after closest approach (probably requiring binoculars or a telescope), while the Northern Hemisphere will have the best viewing near closest approach. Most likely, this comet will break up and vanish from view as it approaches the Sun like comet C/2024 S1 (ATLAS) did in October. There is only a slight chance that it might survive long enough to be visible near its closest approach. In addition, its visual magnitude might not be bright enough to see in the glow of the nearby Sun.For the Washington, D.C. area, assuming this comet follows its current brightness curve and doesn't disintegrate, it should be at its brightest the evening of January 12 just before it sets on the southwestern horizon. It will be about 5 degrees to the upper right of the setting Sun. If the horizon is very clear, your best chance of seeing this comet might be after sunset at 5:07 p.m. EST, but before the comet sets about 10 minutes later.Meteor ShowersThree meteor showers, the Comae Berenicids (020 COM), the Ursids (015 URS), and the Quadrantids (010 QUA), are expected to peak during this lunar cycle. The Comae Berenicids are a weak but long-lasting shower that will be adding slightly to the background rate of meteors. Under ideal conditions near its peak on December 16 it can produce about 3 visible meteors per hour, but this year moonlight will interfere.The Ursids are expected to peak on the morning of December 22. The MeteorActive app predicts that under bright suburban conditions this shower will only add 1 or 2 meteors per hour to the background rate. On rare occasions this shower can produce major outbursts, as it did in 1945 and 1986 (other outbursts may have been missed due to weather). The International Meteor Organization reports this shower is poorly observed with a narrow peak that seems to fluctuate each year. The radiant for this shower (the point the meteors appear to radiate out from) is high in the northern sky, so this shower can be seen all night from most of the Northern Hemisphere but is not visible from the Southern Hemisphere. This year the Moon will be near its last quarter so the best time to look should be the evenings of December 21 and December 22, between when the sky is completely dark and moonrise. These meteors are caused by debris from the comet 8P/Tuttle entering Earth's atmosphere at 74,000 mph (33 kilometers per second).The Quadrantids will be active from Dec. 28, 2024 to Jan. 12, 2025. While this is one of the three major annual Northern Hemisphere showers, its narrow peak means it can be difficult to see. This shower radiates out from a point that passes directly over 49 degrees north. It is predicted to have a peak about 4 hours wide centered around 10 a.m. EST on January 3 (when we can't see them from the Washington, D.C. area). For the D.C. area the MeteorActive app predicts that at about 6 a.m. on the morning of January 3, under bright suburban sky conditions, the peak visible rate from the Quadrantids and all other background sources might reach 14 meteors per hour. Going to a nearby dark sky area (like Sky Meadows State Park in Virginia) might get these rates up to about 34 meteors per hour. Viewing should be better farther west (where the sky will be dark closer to the peak), with the peak viewing probably somewhere in the northern Pacific Ocean. These meteors are caused by debris entering Earth's atmosphere at 92,000 mph (41 kilometers per second). The source of the debris is uncertain but might be the minor planet 2003 EH1, which in turn may be related to the comet C/1490 Y1 observed by Chinese, Japanese, and Korean astronomers in 1490.If you do go out looking for these meteors, be sure to give your eyes plenty of time to adapt to the dark. Your color-sensing cone cells are concentrated near the center of your view with the more sensitive rod cells on the edge of your view. Since some meteors are faint, you will tend to see more meteors from the \"corner of your eye\" (which is why you need to view a large part of the sky). Your color vision (cone cells) will adapt to darkness in about 10 minutes, but your night vision rod cells will continue to improve for an hour or more (with most of the improvement in the first 35 to 45 minutes). The more sensitive your eyes are, the more chance you have of seeing meteors. Even a short exposure to light (from passing car headlights, etc.) will start the adaptation over again (so no turning on a light or your cell phone to check what time it is).Evening Sky HighlightsOn the evening of Saturday, December 14 (the start of the night of the full Moon), as twilight ends (at 5:50 p.m. EST), the rising Moon will be 19 degrees above the east-northeastern horizon with bright planet Jupiter 6 degrees to the right and the bright star Aldebaran father to the right. The brightest planet visible will be Venus at 21 degrees above the southwestern horizon. Next in brightness will be Jupiter. Saturn will be 43 degrees above the southern horizon. The bright star closest to overhead will be Deneb at 61 degrees above the west-northwestern horizon. Deneb (visual magnitude 1.3) is the 19th brightest star in our night sky and is the brightest star in the constellation Cygnus the swan. It is one of the three bright stars of the \"Summer Triangle\" (along with Vega and Altair). Deneb is about 20 times more massive than our Sun but has used up its hydrogen, becoming a blue-white supergiant about 200 times the diameter of the Sun. If Deneb were where our Sun is, it would extend to about the orbit of Earth. Deneb is about 2,600 light years from us.As this lunar cycle progresses, Jupiter, Saturn and the background of stars will appear to rotate westward around Polaris the pole star each evening (as Earth moves around the Sun). Bright Venus will shift to the left and higher in the sky along the southwestern horizon towards Saturn. January 4 will be the first evening Mars will be above the horizon as twilight ends. The waxing Moon will pass by Venus on January 3, Saturn on January 4, in front of the Pleiades star cluster on January 9, and Jupiter on January 10. On January 12 there is a very slight chance that the sungrazing comet, C/2024 G3 (ATLAS) (discovered in April 2024) might be visible 5 degrees to the upper right of the setting Sun.By the evening of Monday, Jan. 13, 2025 (the evening of the full Moon after next), as twilight ends (at 6:11 P.M. EST), the rising Moon will be 13 degrees above the east-northeastern horizon with the bright planet Mars (the third brightest planet) 2 degrees to the lower left and the bright star Pollux (the brighter of the twin stars in the constellation Gemini the twins) 3 degrees to the upper left of the Moon. The brightest planet visible will be Venus at 29 degrees above the southwestern horizon, with the planet Saturn (fourth brightest) 6 degrees to the upper left of Venus. The second brightest planet, Jupiter, will be 47 degrees above the eastern horizon. The bright star closest to overhead will be Capella at 50 degrees above the east-northeastern horizon. Capella is the 6th brightest star in our night sky and the brightest star in the constellation Auriga the charioteer. Although we see Capella as a single star it is actually four stars (two pairs of stars orbiting each other). Capella is about 43 light-years from us.Morning Sky HighlightsOn the morning of Sunday, December 15 (the morning of the full Moon), as twilight begins (at 6:16 AM EST), the setting full Moon will be 15 degrees above the west-northwestern horizon. The brightest planet in the sky will be Jupiter, appearing below the Moon at 5 degrees above the horizon. Second in brightness will be Mars at 46 degrees above the western horizon, then Mercury at 4 degrees above the east-southeastern horizon. The bright star appearing closest to overhead will be Regulus at 55 degrees above the southwestern horizon, with Arcturus a close second at 52 degrees above the east-southeastern horizon. Regulus is the 21st brightest star in our night sky and the brightest star in the constellation Leo the lion. The Arabic name for Regulus translates as \"the heart of the lion.\" Although we see Regulus as a single star, it is actually four stars (two pairs of stars orbiting each other). Regulus is about 79 light years from us. Arcturus is the brightest star in the constellation Boötes the herdsman or plowman and the 4th brightest star in our night sky. It is 36.7 light years from us. While it has about the same mass as our Sun, it is about 2.6 billion years older and has used up its core hydrogen, becoming a red giant 25 times the size and 170 times the brightness of our Sun. One way to identify Arcturus in the night sky is to start at the Big Dipper, then follow the arc of the dipper's handle as it \"arcs towards Arcturus.\"As this lunar cycle progresses, Jupiter, Mars, and the background of stars will appear to rotate westward around Polaris the pole star each morning. Mercury too will appear to shift in the same general direction until December 23, after which it will start shifting towards the horizon again. After December 20 Jupiter will no longer be above the horizon as twilight begins. The waning Moon will pass by Pollux on December 17, Mars on December 18, Regulus on December 20, Spica on December 24, and Antares on December 28. Around 6 a.m. on January 3 will likely be the best time to look for the Quadrantids meteor shower. Under suburban conditions it might produce 14 visible meteors per hour.By the morning of Monday, Jan. 13, 2025 (the morning of the full Moon after next), as twilight begins at 6:23 a.m. EST, the setting full Moon will be 11 degrees above the west-northwestern horizon. This will be the first morning the planet Mercury will rise after morning twilight begins (although it will be bright enough to see in the glow of dawn after it rises) leaving Mars at 18 degrees above the west-northwestern horizon the only planet in the sky. The bright star appearing closest to overhead will be Arcturus at 69 degrees above the south-southeastern horizon.Detailed Daily GuideHere is a day-by-day listing of celestial events between now and the full Moon on Jan. 13, 2025. The times and angles are based on the location of NASA Headquarters in Washington, D.C., and some of these details may differ for where you are (I use parentheses to indicate times specific to the D.C. area). If your latitude is significantly different than 39 degrees north (and especially for my Southern Hemisphere readers), I recommend using an astronomy app set for your location or a star-watching guide from a local observatory, news outlet, or astronomy club.Thursday morning, December 12 The first morning the planet Mercury will be above the east-southeastern horizon as morning twilight begins (at 6:14 a.m. EST). Also, on Thursday morning at 8:28 a.m., the Moon will be at perigee, its closest to Earth for this orbit.Friday evening into Saturday morning, December 13 to 14 The Pleiades star cluster will appear near the full Moon. This may best be viewed with binoculars, as the brightness of the full Moon may make it hard to see the stars in this star cluster. As evening twilight ends at 5:50 p.m. EST, the Pleiades will appear 4 degrees to the upper right of the full Moon. By the time the Moon reaches its highest for the night at 10:49 p.m., the Pleiades will be 6 degrees to the right. By about 2 a.m. the Pleiades will be 8 degrees to the lower right of the Moon, and it will continue to separate as the morning progresses.As mentioned last month, one of the three major meteor showers of the year, the Geminids (004 GEM), will peak Saturday morning, December 14. The light of the nearly full Moon will interfere. In a good year, this shower can produce 150 visible meteors per hour under ideal conditions, but this will not be a good year. For the Washington, D.C. area the MeteorActive app predicts that at about 2 a.m. EST, under bright suburban sky conditions, the peak rate from the Geminids and all other background sources might reach 20 meteors per hour. See the meteor summary above for suggestions for meteor viewing.Saturday morning, December 14 The full Moon, the bright planet Jupiter, and the bright star Aldebaran will form a triangle. As Aldebaran sets on the west-northwestern horizon at 6:10 a.m. EST it will be 9 degrees to the lower left of the Moon with Jupiter 7 degrees to the upper left. Morning twilight will begin 6 minutes later.Saturday evening, December 14 The full Moon will have shifted to the other side of Jupiter. Jupiter will be 6 degrees to the right of the Moon as evening twilight ends at 5:50 p.m EST and the pair will separate as the night progresses.Sunday morning, December 15, the next full Moon will be at 4:02 a.m. EST This will be Saturday evening from Alaska Time westwards to the International Date Line. The Moon will appear full for about three days around this time, from Friday evening through Monday morning, making this a full Moon weekend.Monday evening into Tuesday morning, December 16 to 17 The bright star Pollux will appear near the waning gibbous Moon. As Pollux rises above the northeastern horizon at 6:25 p.m. EST, it will be 7 degrees to the lower left of the Moon. By the time the Moon reaches its highest for the night at 1:55 a.m. Pollux will be 4 degrees to the upper left. As morning twilight begins at 6:18 a.m., Pollux will be 3 degrees to the upper right.Tuesday night into Wednesday morning, December 17 to 18 The bright planet Mars, about a month away from its brightest for the year, will appear near the waning gibbous Moon. As Mars rises on the east-northeastern horizon at 7:34 p.m. EST it will be 4 degrees to the lower left of the Moon. By the time the Moon reaches its highest for the night at 2:50 a.m., Mars will be 1 degree to the lower left. When Mars is closest to the Moon a little before 5:00 a.m., it will be a quarter of a degree from the center of the Moon or an eighth of a degree from the edge of the Moon. As morning twilight begins at 6:18 a.m., Mars will be a degree to the lower right of the Moon. The far north of North America and Asia will see the Moon pass in front of Mars. Note that for some areas this occultation will occur during the daytime.Thursday night into Friday morning, December 19 to 20 The bright star Regulus will appear near the waning gibbous Moon. As Regulus rises on the east-northeastern horizon at 9:39 p.m. EST it will be 3 degrees to the lower right of the Moon. As the Moon reaches its highest for the night at 4:26 a.m., Regulus will be 2 degrees to the lower right. Regulus will be 2.5 degrees to the lower right as morning twilight begins at 6:19 a.m.Thursday morning, December 20 This will be the last morning the bright planet Jupiter will be above the west-northwestern horizon as morning twilight begins.Saturday morning, December 21 at 4:20 a.m. EST This is the winter solstice for the Northern Hemisphere, the astronomical end of fall and start of winter. Europeans have used two main ways to divide the year into seasons and define winter. The old Celtic calendar used in much of pre-Christian Europe considered winter to be the quarter of the year with the shortest periods of daylight and the longest periods of night, so that winter started around Halloween and ended around Groundhog Day, hence the origin of these traditions. However, since it takes time for our planet to cool off, the quarter year with the coldest average temperatures starts later than the quarter year with the shortest days. In our modern calendar we approximate this by having winter start on the winter solstice and end on the spring equinox. The last time I checked NOAA data sources, for the Washington, D.C. area at least, the quarter year with the coldest average temperatures started the first week of December and ended the first week of March.Worldwide, many festivals are associated with the winter solstice, including Yule and the Chinese Dongzhi Festival.The solar day from solar noon on Saturday, December 21 to solar noon on Sunday, December 22 will be the longest solar day of the year, 29.8 seconds longer than 24 hours.Sunday morning, December 22 For the Washington, D.C. area, under bright suburban conditions, the MeteorActive app predicts that at about 5:30 a.m. EST the peak rate from the Ursids and all other background sources might reach 5 meteors per hour (with most of these background meteors).Sunday evening, December 22 The waning Moon will appear half-full as it reaches its last quarter at 5:18 p.m. EST.Monday morning, December 23 This will be when the planet Mercury will appear at its highest above the east-southeastern horizon (7 degrees) as morning twilight begins at 6:21 a.m. EST. The bright star about 7 degrees to the lower right of Mercury will be Antares.Early Tuesday morning, December 24, at 2:27 a.m. EST The Moon will be at apogee, its farthest from Earth for this orbit.Also on Tuesday morning, December 24 The bright star Spica will appear near the waning crescent Moon. As Spica rises on the east-southeastern horizon at 1:55 a.m. EST, it will be 6 degrees below the Moon. As morning twilight begins 3.5 hours later at 6:21 a.m., Spica will be 4 degrees to the lower left. For parts of Asia and the Pacific Ocean the Moon will pass in front of Spica.Tuesday night, December 24 This will be when the planet Mercury reaches its greatest angular separation from the Sun as seen from Earth for this apparition (called greatest elongation). Because the angle between the line from the Sun to Mercury and the line of the horizon changes with the seasons, the date when Mercury and the Sun appear farthest apart as seen from Earth is not always the same as when Mercury appears highest above the east-southeastern horizon as morning twilight begins, which will occur on December 23.Wednesday morning, December 25 The Moon will have shifted to the other side of Spica. As the Moon rises on the east-southeastern horizon at 2:23 a.m. EST, Spica will be 7 degrees to the upper right of the Moon, and the pair will separate as the morning progresses.Saturday morning, December 28 The bright star Antares will be 1.5 degrees to the lower left of the waning crescent Moon, with Mercury about 10 degrees to the left of the Moon. The Moon will rise first above the southeastern horizon at 5:32 a.m. EST, followed by Antares 8 minutes later and Mercury 5 minutes after that at 5:45 a.m. As morning twilight begins less than an hour later at 6:23 a.m., the Moon will be 7 degrees above the southeastern horizon. For an area in the mid-Pacific the Moon will block Antares while the sky is dark. Note that for most of the area in the Atlantic, South America, and the Pacific, this occultation will occur in the daytime and only be visible with binoculars or a telescope.Monday afternoon, December 30, at 5:27 p.m. EST This will be the new Moon, when the Moon passes between Earth and the Sun, and it will not be visible from PEarth. The day of, or the day after, the New Moon marks the start of the new month for most lunisolar calendars. The 12th month of the Chinese calendar starts on December 31. Sundown on Tuesday, December 31, will mark the start of Tevet and the start of the seventh day of Hanukkah in the Hebrew calendar.In the Islamic calendar, the months traditionally start with the first sighting of the waxing crescent Moon. Many Muslim communities now follow the Umm al-Qura Calendar of Saudi Arabia, which uses astronomical calculations to start months in a more predictable way. Using this calendar, sundown on Tuesday, December 31, will probably mark the beginning of Rajab, the seventh month of the Islamic calendar. Rajab is one of the four sacred months in which warfare and fighting are forbidden.Friday morning, Jan. 3, 2025 At about 6 a.m. EST for the Washington, D.C. area, under bright suburban sky conditions, the MeteorActive app predicts the peak rate from the Quadrantids and all other background sources might reach 14 meteors per hour. Going to a nearby dark sky area (like Sky Meadows State Park in Virginia) might get these rates up to about 34 meteors per hour.Friday evening, January 3 The bright planet Venus will appear near the waxing crescent Moon. As evening twilight ends at 6:02 p.m. EST the Moon will be 29 degrees above the southwestern horizon with Venus 3.5 degrees to the lower right. As Venus sets on the west southwestern horizon less than 3 hours later at 8:49 p.m., it will be 4.5 degrees to the lower right of the Moon.Saturday morning, January 4 Earth will be at perihelion, the closest we get to the Sun in our orbit. Between perihelion and 6 months later at aphelion there is about a 6.7% difference in the intensity of the sunlight reaching Earth, one of the reasons the seasons in the Southern hemisphere are more extreme than in the Northern Hemisphere. Perihelion is also when Earth is moving the fastest in its orbit around the Sun, so if you run east at local midnight, you will be moving about as fast as you can for your location (in Sun-centered coordinates).Saturday morning, January 4 Ignoring Daylight Saving Time, for the Washington, D.C. area and similar latitudes (I've not checked elsewhere), this will be the morning with the latest sunrise of the year at 7:26:56 a.m. EST.Saturday evening, January 4 This will be the first evening the planet Mars will be above the east-northeastern horizon as evening twilight ends, joining Venus, Jupiter, and Saturn in the sky. Mars is approaching its closest and brightest for the year, which will happen on January 15.Also on Saturday evening, January 4 The planet Saturn will appear near the waxing crescent Moon. As evening twilight ends at 6:03 p.m. EST, the Moon will be 40 degrees above the south-southwestern horizon with Saturn 3 degrees to the lower right. As Saturn sets on the western horizon less than 4 hours later at 9:53 p.m., it will be 5 degrees below the Moon.Monday evening, January 6 The Moon will appear half full as it reaches its first quarter at 6:56 p.m. EST (when it will be 56 degrees above the south-southwestern horizon).Tuesday evening, January 7 At 7:07 p.m. EST, the Moon will be at perigee, its closest to Earth for this orbit.Thursday evening, January 9 The waxing gibbous Moon will pass in front of the Pleiades star cluster. This may be viewed best with binoculars, as the brightness of the Moon will make it hard to see the stars in this star cluster. As evening twilight ends at 6:07 p.m. EST, the Pleiades will appear 1 degree to the lower left of the full Moon. Over the next few hours, including as the Moon reaches its highest for the night at 8:37 p.m., the Moon will pass in front of the Pleiades, blocking many of these stars from view. By about midnight the Pleiades will appear about 1 degree below the Moon, and the Moon and the Pleiades will separate as Friday morning progresses.Also on Thursday night, January 9 This will be when the planet Venus reaches its greatest angular separation from the Sun as seen from Earth for this apparition (called greatest elongation). Because the angle between the line from the Sun to Venus and the line of the horizon changes with the seasons, the date when Venus and the Sun appear farthest apart as seen from Earth is not always the same as when it appears highest above the west-southwestern horizon as evening twilight ends, which occurs on January 27.Friday evening, January 10 Jupiter will appear near the waxing gibbous Moon. As evening twilight ends at 6:08 p.m. EST, Jupiter will be 5 degrees to the lower right. As the Moon reaches its highest for the night at 9:37 p.m., Jupiter will be 6 degrees below the Moon. The pair will continue to separate until Jupiter sets Saturday morning at 4:45 a.m.Sunday evening, January 12 There is a very slight chance that the sungrazing comet, C/2024 G3 (ATLAS) (discovered in April 2024) will be visible 5 degrees to the upper right of the setting Sun. Most likely, this comet will not be bright enough to see in the daytime or will break up and vanish from view like comet C/2024 S1 (ATLAS) did in October. The odds are low, but if the horizon is very clear, your best chance of seeing this comet might be after sunset at 5:07 p.m. EST, but before the comet sets about 10 minutes later.The full Moon after next will be Monday evening, January 13, at 5:27 p.m. EST. This will be on Tuesday from the South Africa Time and Eastern European Time zones eastward across the rest of Africa, Europe, Asia, Australia, etc., to the International Date Line in the mid-Pacific. The Moon will appear full for about three days around this time, from Sunday evening (and possibly the last part of Sunday morning) into Wednesday morning. On Monday night the full Moon will appear near and pass in front of the bright planet Mars, with the bright star Pollux above the pair. As evening twilight ends at 6:11 p.m. EST, the three will form a triangle, with Mars 2 degrees to the lower left and Pollux 3 degrees to the upper left of the Moon. For most of the continental USA as well as parts of Africa, Canada, and Mexico, the Moon will pass in front of Mars. Times will vary for other locations, but for NASA Headquarters in Washington, D.C., Mars will vanish behind the bottom of the Moon at about 9:16 p.m. and reappear from behind the upper right of the Moon at about 10:31 p.m. By the time the Moon reaches its highest for the night early on Tuesday morning at 12:37 a.m., Mars will be 1 degree to the right of the Moon and Pollux 5 degrees to the upper right. As morning twilight begins at 6:23 a.m., Mars will be 4 degrees and Pollux 8 degrees to the lower right of the Moon.",
  "image": "https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=1280\u0026h=853\u0026fit=clip\u0026crop=faces%2Cfocalpoint",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"primary\"\u003e\u003carticle\u003e\u003csection\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" sizes=\"(max-width: 640px) 320px, (max-width: 768px) 640px, (max-width: 1024px) 768px, (max-width: 1280px) 1024px, (max-width: 1536px) 1280px, 2048px\" srcset=\"https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=320\u0026amp;format=webp\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 320w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=640\u0026amp;format=webp\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 640w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=768\u0026amp;format=webp\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 768w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=1024\u0026amp;format=webp\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 1024w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=1280\u0026amp;format=webp\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 1280w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=1536\u0026amp;format=webp\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 1536w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=2048\u0026amp;format=webp\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 2048w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=2560\u0026amp;format=webp\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 2560w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=3072\u0026amp;format=webp\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 3072w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=4096\u0026amp;format=webp\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 4096w\"/\u003e\u003cimg width=\"1280\" height=\"853\" alt=\"Full Moon over mountains.\" loading=\"eager\" decoding=\"async\" onerror=\"this.setAttribute(\u0026#39;data-error\u0026#39;, 1)\" data-nuxt-pic=\"\" src=\"https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=4096\u0026amp;format=jpeg\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint\" sizes=\"(max-width: 640px) 320px, (max-width: 768px) 640px, (max-width: 1024px) 768px, (max-width: 1280px) 1024px, (max-width: 1536px) 1280px, 2048px\" srcset=\"https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=320\u0026amp;format=jpeg\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 320w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=640\u0026amp;format=jpeg\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 640w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=768\u0026amp;format=jpeg\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 768w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=1024\u0026amp;format=jpeg\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 1024w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=1280\u0026amp;format=jpeg\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 1280w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=1536\u0026amp;format=jpeg\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 1536w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=2048\u0026amp;format=jpeg\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 2048w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=2560\u0026amp;format=jpeg\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 2560w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=3072\u0026amp;format=jpeg\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 3072w, https://assets.science.nasa.gov/dynamicimage/assets/science/psd/lunar-science/2023/08/76_fullmoon_purplemountain.jpg?w=4096\u0026amp;format=jpeg\u0026amp;fit=clip\u0026amp;crop=faces%2Cfocalpoint 4096w\"/\u003e\u003c/picture\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003e\u003cfigcaption\u003eA full Moon rising over the Wasatch Mountains in Utah on March 15, 2014.\u003c/figcaption\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eCredits: NASA/Bill Dunford\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eThe Next Full Moon is the Cold Moon, Frost Moon, or the Winter Moon; the Moon before Yule or the Oak Moon; the Long Night Moon; the Child Moon; the Datta or Dattatreya Jayanti Festival Moon; the Karthika Deepam Festival Moon; Unduvap Poya; and the Chang\u0026#39;e Moon.\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe next full Moon will be Sunday morning, Dec. 15, 2024, passing opposite the Sun at 4:02 a.m. EST. This will be Saturday evening from Alaska Time westwards to the International Date Line. The Moon will appear full for about three days around this time, from Friday evening through Monday morning, making this a full Moon weekend.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe Maine Farmers\u0026#39; Almanac began publishing Native American names for full Moons in the 1930s. Over time these names have become widely known and used. According to this almanac, as the full Moon in December this is the Cold Moon, due to the long, cold nights. Other names are the Frost Moon (for the frosts as winter nears) or the Winter Moon.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAs the full Moon before the winter solstice, old European names for this Moon include the Moon before Yule and the Oak Moon. Yule was a three-day winter solstice festival in pre-Christian Europe. In the 10th century King Haakon I associated Yule with Christmas as part of the Christianization of Norway, and this association spread throughout Europe. Some believe that the Oak Moon name ties back to ancient druid traditions of harvesting mistletoe from oak trees, a practice first recorded by the Roman historian Pliny the Elder in the first century CE. The term \u0026#34;druid\u0026#34; may derive from the Proto-Indo-European roots for \u0026#34;oak\u0026#34; and \u0026#34;to see,\u0026#34; suggesting \u0026#34;druid\u0026#34; means \u0026#34;oak knower\u0026#34; or \u0026#34;oak seer.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAs the full Moon closest to the winter solstice, this will be the Long Night Moon. The plane of the Moon\u0026#39;s orbit around Earth nearly matches the plane of Earth\u0026#39;s orbit around the Sun. When the path of the Sun appears lowest in the sky for the year, the path of the full Moon opposite the Sun appears near its highest. For the Washington, D.C. area, on Saturday evening into Sunday morning, December 14 to 15, the Moon will be in the sky for a total of 16 hours 1 minute and will reach a maximum altitude of 79.0 degrees (at 11:52 p.m. EST), with 14 hours 33 minutes of this when the Sun is down. The next night, Sunday evening into Monday morning, December 15 to 16, the full Moon will be in the sky slightly longer and will reach higher in the sky, but slightly less of this time will be when the Sun is down. The Moon will be in the sky for a total of 16 hours 3 minutes and will reach a maximum altitude of 79.2 degrees (at 1:54 a.m.), with 14 hours 29 minutes of this when the Sun is down.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThis also is the Child Moon. Five years ago, then 7-year-old Astrid Hattenbach was walking home from school with her father Henry Throop (a friend and former coworker at NASA Headquarters). When she saw the rising full Moon, she said: “You know what this Moon is called? It’s called a Child Moon. Because the Moon rises at a time that the children, they can see it, because they’re not in bed, and they might even be outside like we are right now.” Henry told me about this and I thought it a perfect name. This year (at least for Washington, D.C. and similar latitudes), the earliest evenings with a full Moon in the sky will be on December 13 through 15, with sunset at 4:44 p.m. EST and evening twilight ending at 5:50 p.m. (on the 13th) or 5:51 p.m. (on the 14th and 15th). For more on the wonder the Moon imbues in the hearts of children (and in all of us) look up Carl Sandburg\u0026#39;s poem \u0026#34;Child Moon.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFor Hindus, this full Moon corresponds with Datta Jayanti, also known as Dattatreya Jayanti, a festival commemorating the birth day of the Hindu god Dattatreya (Datta), celebrated on the full Moon day of the month of Margashira.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eKarthika Deepam is a festival observed by Hindus of Tamil Nadu, Sri Lanka, and Kerala when the nearly full Moon lines up with the Pleiades constellation (Krittikai or Karttikai). This year it will be on Friday, December 13. Some areas celebrate multi-day festivals that include this full Moon.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFor the Buddhists of Sri Lanka, this is Unduvap Poya. In the third century BCE, Sangamitta Theri, the daughter of Emperor Ashoka and founder of an order of Buddhist nuns in Sri Lanka, is believed to have brought a sapling of the sacred Bodhi Tree, or Bo Tree, to Sri Lanka. The sapling was planted in 288 BCE by King Devanampiya Tissa in the Mahamevnāwa Park in Anuradhapura where it still grows today, where it is believed by some to be the oldest living human-planted tree with a known planting date.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWe could also call this the Chang\u0026#39;e Moon, after the three Chinese lunar landers that launched and landed on the Moon this time of year. These missions get their name from the Chinese goddess of the Moon, Chang\u0026#39;e, who lived on the Moon with her pet rabbit, Yutu. The Chang\u0026#39;e 3 lander and its companion Yutu rover launched on Dec. 1, 2013, and landed on the Moon a few days later on December 14. The Chang\u0026#39;e 4 lander and Yutu-2 rover launched Dec. 7, 2018, and landed on the Moon on Jan. 3, 2019. The Chang\u0026#39;e 5 lunar sample return mission was launched in 2020 on November 23 (in UTC, November 24 in China\u0026#39;s time zone), collected samples from the Moon, and returned them to Earth on Dec. 16, 2020, humanity\u0026#39;s first lunar sample return since 1976. The Chang\u0026#39;e 6 lunar sample return mission ended the \u0026#34;streak\u0026#34; of December missions by launching on May 3, collecting samples from the Moon, and returning them to Earth on June 25, 2024, humanity\u0026#39;s first lunar sample return from the far side of the Moon.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIn many traditional Moon-based calendars the full Moons fall on or near the middle of each month. This full Moon is near the middle of the eleventh month of the Chinese year of the Dragon and Jumādā ath-Thāniyah, also known as Jumādā al-ʾĀkhirah, the sixth month of the Islamic year. This full Moon is the middle of Kislev in the Hebrew calendar. Hanukkah begins on the 25th of Kislev (starting this year with sundown on December 25) and ends 8 days later (with sundown on January 2).\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAs usual, the wearing of suitably celebratory celestial attire is encouraged in honor of the full Moon. Bundle up for the cold, then take advantage of these early nightfalls to admire the sky, Moon, planets, and stars!\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eHere are other celestial events between now and the full Moon after next with specific times and angles based on the location of NASA Headquarters in Washington, D.C.:\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFor the Northern Hemisphere, as autumn ends and winter begins, the daily periods of sunlight reach their shortest at the winter solstice and then begin to lengthen again. Our 24-hour clock is based on the average length of the solar day. The winter solstice has the longest night of the year. The winter solstice is sometimes called the \u0026#34;shortest day of the year\u0026#34; (because it has the shortest period of sunlight), but the solar days near the solstice are actually the longest. Because of this, the earliest sunset of the year occurs before the solstice (on December 6 and 7 for the Washington, D.C. area) and the latest sunrise of the year (ignoring Daylight Savings Time) occurs after the solstice on Jan. 4, 2025.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eOn Sunday, December 15, (the day of the full Moon), morning twilight will begin at 6:16 a.m. EST, sunrise will be at 7:20 a.m., solar noon will be at 12:04 p.m. when the Sun will reach its maximum altitude of 27.8 degrees, sunset will be at 4:47 p.m., and evening twilight will end at 5:51 p.m.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eSaturday, December 21, will be the day of the Northern Hemisphere winter solstice, the astronomical end of fall and start of winter. The winter solstice is the day when the Sun at solar noon is lowest in the sky and the time from sunrise to sunset is shortest for the year. At NASA Headquarters, the time from sunrise to sunset will be 9 hours, 26 minutes, 13 seconds. Solar noon will be at 12:07 p.m. EST when the Sun will reach its lowest daily high, 27.7 degrees. The longest solar day (measured from noon to noon on a sundial) will be from solar noon on December 21 to solar noon on December 22, 29.8 seconds longer than 24 hours.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBy Monday, Jan. 13, 2025 (the day of the full Moon after next), morning twilight will begin at 6:24 a.m. EST, sunrise will be at 7:26 a.m., solar noon will be at 12:17 p.m. when the Sun will reach its maximum altitude of 29.8 degrees, sunset will be at 5:08 p.m., and evening twilight will end at 6:11 p.m.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThis will still be a good time for Jupiter and Saturn watching, especially with a backyard telescope. Saturn was at its closest and brightest on September 7 and Jupiter on December 7. With clear skies and a telescope, you should be able to see Jupiter\u0026#39;s four bright moons, Ganymede, Callisto, Europa, and Io, noticeably shifting positions in the course of an evening. For Saturn, you should be able to see Saturn\u0026#39;s rings and its bright moon Titan. The rings are appearing thinner and will be edge-on to Earth in March 2025. We won\u0026#39;t get the \u0026#34;classic\u0026#34; view of Saturn showing off its rings until 2026. During this lunar cycle both of these planets will be shifting towards the west, making them easier to see earlier in the evening sky (and friendlier for backyard stargazing, especially if you have young ones with earlier bedtimes). During this lunar cycle, as twilight ends each evening, Saturn will be shifting from 43 degrees above the southern horizon to 33 degrees above the southwestern horizon while Jupiter will be shifting from 19 degrees above the east-northeastern horizon to 47 degrees above the eastern horizon.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"h-comets\"\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eComets\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eSungrazing comet C/2024 G3 (ATLAS) was discovered in April 2024. It will be passing very near the Sun and might be bright enough to see in the daytime for a short time around its closest approach to the Sun on January 13. The Southern Hemisphere will have the best viewing before and after closest approach (probably requiring binoculars or a telescope), while the Northern Hemisphere will have the best viewing near closest approach. Most likely, this comet will break up and vanish from view as it approaches the Sun like comet C/2024 S1 (ATLAS) did in October. There is only a slight chance that it might survive long enough to be visible near its closest approach. In addition, its visual magnitude might not be bright enough to see in the glow of the nearby Sun.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFor the Washington, D.C. area, assuming this comet follows its current brightness curve and doesn\u0026#39;t disintegrate, it should be at its brightest the evening of January 12 just before it sets on the southwestern horizon. It will be about 5 degrees to the upper right of the setting Sun. If the horizon is very clear, your best chance of seeing this comet might be after sunset at 5:07 p.m. EST, but before the comet sets about 10 minutes later.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"h-meteor-showers\"\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eMeteor Showers\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThree meteor showers, the Comae Berenicids (020 COM), the Ursids (015 URS), and the Quadrantids (010 QUA), are expected to peak during this lunar cycle. The Comae Berenicids are a weak but long-lasting shower that will be adding slightly to the background rate of meteors. Under ideal conditions near its peak on December 16 it can produce about 3 visible meteors per hour, but this year moonlight will interfere.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe Ursids are expected to peak on the morning of December 22. The MeteorActive app predicts that under bright suburban conditions this shower will only add 1 or 2 meteors per hour to the background rate. On rare occasions this shower can produce major outbursts, as it did in 1945 and 1986 (other outbursts may have been missed due to weather). The International Meteor Organization reports this shower is poorly observed with a narrow peak that seems to fluctuate each year. The radiant for this shower (the point the meteors appear to radiate out from) is high in the northern sky, so this shower can be seen all night from most of the Northern Hemisphere but is not visible from the Southern Hemisphere. This year the Moon will be near its last quarter so the best time to look should be the evenings of December 21 and December 22, between when the sky is completely dark and moonrise. These meteors are caused by debris from the comet 8P/Tuttle entering Earth\u0026#39;s atmosphere at 74,000 mph (33 kilometers per second).\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe Quadrantids will be active from Dec. 28, 2024 to Jan. 12, 2025. While this is one of the three major annual Northern Hemisphere showers, its narrow peak means it can be difficult to see. This shower radiates out from a point that passes directly over 49 degrees north. It is predicted to have a peak about 4 hours wide centered around 10 a.m. EST on January 3 (when we can\u0026#39;t see them from the Washington, D.C. area). For the D.C. area the MeteorActive app predicts that at about 6 a.m. on the morning of January 3, under bright suburban sky conditions, the peak visible rate from the Quadrantids and all other background sources might reach 14 meteors per hour. Going to a nearby dark sky area (like Sky Meadows State Park in Virginia) might get these rates up to about 34 meteors per hour. Viewing should be better farther west (where the sky will be dark closer to the peak), with the peak viewing probably somewhere in the northern Pacific Ocean. These meteors are caused by debris entering Earth\u0026#39;s atmosphere at 92,000 mph (41 kilometers per second). The source of the debris is uncertain but might be the minor planet 2003 EH1, which in turn may be related to the comet C/1490 Y1 observed by Chinese, Japanese, and Korean astronomers in 1490.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf you do go out looking for these meteors, be sure to give your eyes plenty of time to adapt to the dark. Your color-sensing cone cells are concentrated near the center of your view with the more sensitive rod cells on the edge of your view. Since some meteors are faint, you will tend to see more meteors from the \u0026#34;corner of your eye\u0026#34; (which is why you need to view a large part of the sky). Your color vision (cone cells) will adapt to darkness in about 10 minutes, but your night vision rod cells will continue to improve for an hour or more (with most of the improvement in the first 35 to 45 minutes). The more sensitive your eyes are, the more chance you have of seeing meteors. Even a short exposure to light (from passing car headlights, etc.) will start the adaptation over again (so no turning on a light or your cell phone to check what time it is).\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"h-evening-sky-highlights\"\u003e\u003cp\u003e\u003ch2\u003e\u003cspan\u003eEvening Sky Highlights\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eOn the evening of Saturday, December 14 (the start of the night of the full Moon), as twilight ends (at 5:50 p.m. EST), the rising Moon will be 19 degrees above the east-northeastern horizon with bright planet Jupiter 6 degrees to the right and the bright star Aldebaran father to the right. The brightest planet visible will be Venus at 21 degrees above the southwestern horizon. Next in brightness will be Jupiter. Saturn will be 43 degrees above the southern horizon. The bright star closest to overhead will be Deneb at 61 degrees above the west-northwestern horizon. Deneb (visual magnitude 1.3) is the 19th brightest star in our night sky and is the brightest star in the constellation Cygnus the swan. It is one of the three bright stars of the \u0026#34;Summer Triangle\u0026#34; (along with Vega and Altair). Deneb is about 20 times more massive than our Sun but has used up its hydrogen, becoming a blue-white supergiant about 200 times the diameter of the Sun. If Deneb were where our Sun is, it would extend to about the orbit of Earth. Deneb is about 2,600 light years from us.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAs this lunar cycle progresses, Jupiter, Saturn and the background of stars will appear to rotate westward around Polaris the pole star each evening (as Earth moves around the Sun). Bright Venus will shift to the left and higher in the sky along the southwestern horizon towards Saturn. January 4 will be the first evening Mars will be above the horizon as twilight ends. The waxing Moon will pass by Venus on January 3, Saturn on January 4, in front of the Pleiades star cluster on January 9, and Jupiter on January 10. On January 12 there is a very slight chance that the sungrazing comet, C/2024 G3 (ATLAS) (discovered in April 2024) might be visible 5 degrees to the upper right of the setting Sun.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBy the evening of Monday, Jan. 13, 2025 (the evening of the full Moon after next), as twilight ends (at 6:11 P.M. EST), the rising Moon will be 13 degrees above the east-northeastern horizon with the bright planet Mars (the third brightest planet) 2 degrees to the lower left and the bright star Pollux (the brighter of the twin stars in the constellation Gemini the twins) 3 degrees to the upper left of the Moon. The brightest planet visible will be Venus at 29 degrees above the southwestern horizon, with the planet Saturn (fourth brightest) 6 degrees to the upper left of Venus. The second brightest planet, Jupiter, will be 47 degrees above the eastern horizon. The bright star closest to overhead will be Capella at 50 degrees above the east-northeastern horizon. Capella is the 6th brightest star in our night sky and the brightest star in the constellation Auriga the charioteer. Although we see Capella as a single star it is actually four stars (two pairs of stars orbiting each other). Capella is about 43 light-years from us.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"h-morning-sky-highlights\"\u003e\u003cp\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eMorning Sky Highlights\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eOn the morning of Sunday, December 15 (the morning of the full Moon), as twilight begins (at 6:16 AM EST), the setting full Moon will be 15 degrees above the west-northwestern horizon. The brightest planet in the sky will be Jupiter, appearing below the Moon at 5 degrees above the horizon. Second in brightness will be Mars at 46 degrees above the western horizon, then Mercury at 4 degrees above the east-southeastern horizon. The bright star appearing closest to overhead will be Regulus at 55 degrees above the southwestern horizon, with Arcturus a close second at 52 degrees above the east-southeastern horizon. Regulus is the 21st brightest star in our night sky and the brightest star in the constellation Leo the lion. The Arabic name for Regulus translates as \u0026#34;the heart of the lion.\u0026#34; Although we see Regulus as a single star, it is actually four stars (two pairs of stars orbiting each other). Regulus is about 79 light years from us. Arcturus is the brightest star in the constellation Boötes the herdsman or plowman and the 4th brightest star in our night sky. It is 36.7 light years from us. While it has about the same mass as our Sun, it is about 2.6 billion years older and has used up its core hydrogen, becoming a red giant 25 times the size and 170 times the brightness of our Sun. One way to identify Arcturus in the night sky is to start at the Big Dipper, then follow the arc of the dipper\u0026#39;s handle as it \u0026#34;arcs towards Arcturus.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAs this lunar cycle progresses, Jupiter, Mars, and the background of stars will appear to rotate westward around Polaris the pole star each morning. Mercury too will appear to shift in the same general direction until December 23, after which it will start shifting towards the horizon again. After December 20 Jupiter will no longer be above the horizon as twilight begins. The waning Moon will pass by Pollux on December 17, Mars on December 18, Regulus on December 20, Spica on December 24, and Antares on December 28. Around 6 a.m. on January 3 will likely be the best time to look for the Quadrantids meteor shower. Under suburban conditions it might produce 14 visible meteors per hour.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBy the morning of Monday, Jan. 13, 2025 (the morning of the full Moon after next), as twilight begins at 6:23 a.m. EST, the setting full Moon will be 11 degrees above the west-northwestern horizon. This will be the first morning the planet Mercury will rise after morning twilight begins (although it will be bright enough to see in the glow of dawn after it rises) leaving Mars at 18 degrees above the west-northwestern horizon the only planet in the sky. The bright star appearing closest to overhead will be Arcturus at 69 degrees above the south-southeastern horizon.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"h-detailed-daily-guide\"\u003e\u003cp\u003e\u003ch2\u003e\u003cspan\u003e\u003cstrong\u003eDetailed Daily Guide\u003c/strong\u003e\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eHere is a day-by-day listing of celestial events between now and the full Moon on Jan. 13, 2025. The times and angles are based on the location of NASA Headquarters in Washington, D.C., and some of these details may differ for where you are (I use parentheses to indicate times specific to the D.C. area). If your latitude is significantly different than 39 degrees north (and especially for my Southern Hemisphere readers), I recommend using an astronomy app set for your location or a star-watching guide from a local observatory, news outlet, or astronomy club.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eThursday morning, December 12\u003c/strong\u003e The first morning the planet Mercury will be above the east-southeastern horizon as morning twilight begins (at 6:14 a.m. EST). Also, on Thursday morning at 8:28 a.m., the Moon will be at perigee, its closest to Earth for this orbit.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eFriday evening into Saturday morning, December 13 to 14\u003c/strong\u003e The Pleiades star cluster will appear near the full Moon. This may best be viewed with binoculars, as the brightness of the full Moon may make it hard to see the stars in this star cluster. As evening twilight ends at 5:50 p.m. EST, the Pleiades will appear 4 degrees to the upper right of the full Moon. By the time the Moon reaches its highest for the night at 10:49 p.m., the Pleiades will be 6 degrees to the right. By about 2 a.m. the Pleiades will be 8 degrees to the lower right of the Moon, and it will continue to separate as the morning progresses.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAs mentioned last month, one of the three major meteor showers of the year, the Geminids (004 GEM), will peak Saturday morning, December 14. The light of the nearly full Moon will interfere. In a good year, this shower can produce 150 visible meteors per hour under ideal conditions, but this will not be a good year. For the Washington, D.C. area the MeteorActive app predicts that at about 2 a.m. EST, under bright suburban sky conditions, the peak rate from the Geminids and all other background sources might reach 20 meteors per hour. See the meteor summary above for suggestions for meteor viewing.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eSaturday morning, December 14\u003c/strong\u003e The full Moon, the bright planet Jupiter, and the bright star Aldebaran will form a triangle. As Aldebaran sets on the west-northwestern horizon at 6:10 a.m. EST it will be 9 degrees to the lower left of the Moon with Jupiter 7 degrees to the upper left. Morning twilight will begin 6 minutes later.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eSaturday evening, December 14\u003c/strong\u003e The full Moon will have shifted to the other side of Jupiter. Jupiter will be 6 degrees to the right of the Moon as evening twilight ends at 5:50 p.m EST and the pair will separate as the night progresses.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eSunday morning, December 15, the next full Moon will be at 4:02 a.m. EST\u003c/strong\u003e This will be Saturday evening from Alaska Time westwards to the International Date Line. The Moon will appear full for about three days around this time, from Friday evening through Monday morning, making this a full Moon weekend.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMonday evening into Tuesday morning, December 16 to 17\u003c/strong\u003e The bright star Pollux will appear near the waning gibbous Moon. As Pollux rises above the northeastern horizon at 6:25 p.m. EST, it will be 7 degrees to the lower left of the Moon. By the time the Moon reaches its highest for the night at 1:55 a.m. Pollux will be 4 degrees to the upper left. As morning twilight begins at 6:18 a.m., Pollux will be 3 degrees to the upper right.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eTuesday night into Wednesday morning, December 17 to 18\u003c/strong\u003e The bright planet Mars, about a month away from its brightest for the year, will appear near the waning gibbous Moon. As Mars rises on the east-northeastern horizon at 7:34 p.m. EST it will be 4 degrees to the lower left of the Moon. By the time the Moon reaches its highest for the night at 2:50 a.m., Mars will be 1 degree to the lower left. When Mars is closest to the Moon a little before 5:00 a.m., it will be a quarter of a degree from the center of the Moon or an eighth of a degree from the edge of the Moon. As morning twilight begins at 6:18 a.m., Mars will be a degree to the lower right of the Moon. The far north of North America and Asia will see the Moon pass in front of Mars. Note that for some areas this occultation will occur during the daytime.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eThursday night into Friday morning, December 19 to 20 \u003c/strong\u003eThe bright star Regulus will appear near the waning gibbous Moon. As Regulus rises on the east-northeastern horizon at 9:39 p.m. EST it will be 3 degrees to the lower right of the Moon. As the Moon reaches its highest for the night at 4:26 a.m., Regulus will be 2 degrees to the lower right. Regulus will be 2.5 degrees to the lower right as morning twilight begins at 6:19 a.m.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eThursday morning, December 20\u003c/strong\u003e This will be the last morning the bright planet Jupiter will be above the west-northwestern horizon as morning twilight begins.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eSaturday morning, December 21 at 4:20 a.m. EST\u003c/strong\u003e This is the winter solstice for the Northern Hemisphere, the astronomical end of fall and start of winter. Europeans have used two main ways to divide the year into seasons and define winter. The old Celtic calendar used in much of pre-Christian Europe considered winter to be the quarter of the year with the shortest periods of daylight and the longest periods of night, so that winter started around Halloween and ended around Groundhog Day, hence the origin of these traditions. However, since it takes time for our planet to cool off, the quarter year with the coldest average temperatures starts later than the quarter year with the shortest days. In our modern calendar we approximate this by having winter start on the winter solstice and end on the spring equinox. The last time I checked NOAA data sources, for the Washington, D.C. area at least, the quarter year with the coldest average temperatures started the first week of December and ended the first week of March.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWorldwide, many festivals are associated with the winter solstice, including Yule and the Chinese Dongzhi Festival.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe solar day from solar noon on Saturday, December 21 to solar noon on Sunday, December 22 will be the longest solar day of the year, 29.8 seconds longer than 24 hours.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eSunday morning, December 22\u003c/strong\u003e For the Washington, D.C. area, under bright suburban conditions, the MeteorActive app predicts that at about 5:30 a.m. EST the peak rate from the Ursids and all other background sources might reach 5 meteors per hour (with most of these background meteors).\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eSunday evening, December 22\u003c/strong\u003e The waning Moon will appear half-full as it reaches its last quarter at 5:18 p.m. EST.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMonday morning, December 23\u003c/strong\u003e This will be when the planet Mercury will appear at its highest above the east-southeastern horizon (7 degrees) as morning twilight begins at 6:21 a.m. EST. The bright star about 7 degrees to the lower right of Mercury will be Antares.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eEarly Tuesday morning, December 24, at 2:27 a.m. EST\u003c/strong\u003e The Moon will be at apogee, its farthest from Earth for this orbit.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eAlso on Tuesday morning, December 24\u003c/strong\u003e The bright star Spica will appear near the waning crescent Moon. As Spica rises on the east-southeastern horizon at 1:55 a.m. EST, it will be 6 degrees below the Moon. As morning twilight begins 3.5 hours later at 6:21 a.m., Spica will be 4 degrees to the lower left. For parts of Asia and the Pacific Ocean the Moon will pass in front of Spica.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eTuesday night, December 24\u003c/strong\u003e This will be when the planet Mercury reaches its greatest angular separation from the Sun as seen from Earth for this apparition (called greatest elongation). Because the angle between the line from the Sun to Mercury and the line of the horizon changes with the seasons, the date when Mercury and the Sun appear farthest apart as seen from Earth is not always the same as when Mercury appears highest above the east-southeastern horizon as morning twilight begins, which will occur on December 23.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eWednesday morning, December 25\u003c/strong\u003e The Moon will have shifted to the other side of Spica. As the Moon rises on the east-southeastern horizon at 2:23 a.m. EST, Spica will be 7 degrees to the upper right of the Moon, and the pair will separate as the morning progresses.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eSaturday morning, December 28\u003c/strong\u003e The bright star Antares will be 1.5 degrees to the lower left of the waning crescent Moon, with Mercury about 10 degrees to the left of the Moon. The Moon will rise first above the southeastern horizon at 5:32 a.m. EST, followed by Antares 8 minutes later and Mercury 5 minutes after that at 5:45 a.m. As morning twilight begins less than an hour later at 6:23 a.m., the Moon will be 7 degrees above the southeastern horizon. For an area in the mid-Pacific the Moon will block Antares while the sky is dark. Note that for most of the area in the Atlantic, South America, and the Pacific, this occultation will occur in the daytime and only be visible with binoculars or a telescope.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMonday afternoon, December 30, at 5:27 p.m. EST\u003c/strong\u003e This will be the new Moon, when the Moon passes between Earth and the Sun, and it will not be visible from PEarth. The day of, or the day after, the New Moon marks the start of the new month for most lunisolar calendars. The 12th month of the Chinese calendar starts on December 31. Sundown on Tuesday, December 31, will mark the start of Tevet and the start of the seventh day of Hanukkah in the Hebrew calendar.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIn the Islamic calendar, the months traditionally start with the first sighting of the waxing crescent Moon. Many Muslim communities now follow the Umm al-Qura Calendar of Saudi Arabia, which uses astronomical calculations to start months in a more predictable way. Using this calendar, sundown on Tuesday, December 31, will probably mark the beginning of Rajab, the seventh month of the Islamic calendar. Rajab is one of the four sacred months in which warfare and fighting are forbidden.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eFriday morning, Jan. 3, 2025\u003c/strong\u003e At about 6 a.m. EST for the Washington, D.C. area, under bright suburban sky conditions, the MeteorActive app predicts the peak rate from the Quadrantids and all other background sources might reach 14 meteors per hour. Going to a nearby dark sky area (like Sky Meadows State Park in Virginia) might get these rates up to about 34 meteors per hour.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eFriday evening, January 3\u003c/strong\u003e The bright planet Venus will appear near the waxing crescent Moon. As evening twilight ends at 6:02 p.m. EST the Moon will be 29 degrees above the southwestern horizon with Venus 3.5 degrees to the lower right. As Venus sets on the west southwestern horizon less than 3 hours later at 8:49 p.m., it will be 4.5 degrees to the lower right of the Moon.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eSaturday morning, January 4\u003c/strong\u003e Earth will be at perihelion, the closest we get to the Sun in our orbit. Between perihelion and 6 months later at aphelion there is about a 6.7% difference in the intensity of the sunlight reaching Earth, one of the reasons the seasons in the Southern hemisphere are more extreme than in the Northern Hemisphere. Perihelion is also when Earth is moving the fastest in its orbit around the Sun, so if you run east at local midnight, you will be moving about as fast as you can for your location (in Sun-centered coordinates).\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eSaturday morning, January 4\u003c/strong\u003e Ignoring Daylight Saving Time, for the Washington, D.C. area and similar latitudes (I\u0026#39;ve not checked elsewhere), this will be the morning with the latest sunrise of the year at 7:26:56 a.m. EST.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eSaturday evening, January 4 \u003c/strong\u003eThis will be the first evening the planet Mars will be above the east-northeastern horizon as evening twilight ends, joining Venus, Jupiter, and Saturn in the sky. Mars is approaching its closest and brightest for the year, which will happen on January 15.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eAlso on Saturday evening, January 4\u003c/strong\u003e The planet Saturn will appear near the waxing crescent Moon. As evening twilight ends at 6:03 p.m. EST, the Moon will be 40 degrees above the south-southwestern horizon with Saturn 3 degrees to the lower right. As Saturn sets on the western horizon less than 4 hours later at 9:53 p.m., it will be 5 degrees below the Moon.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMonday evening, January 6\u003c/strong\u003e The Moon will appear half full as it reaches its first quarter at 6:56 p.m. EST (when it will be 56 degrees above the south-southwestern horizon).\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eTuesday evening, January 7\u003c/strong\u003e At 7:07 p.m. EST, the Moon will be at perigee, its closest to Earth for this orbit.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eThursday evening, January 9\u003c/strong\u003e The waxing gibbous Moon will pass in front of the Pleiades star cluster. This may be viewed best with binoculars, as the brightness of the Moon will make it hard to see the stars in this star cluster. As evening twilight ends at 6:07 p.m. EST, the Pleiades will appear 1 degree to the lower left of the full Moon. Over the next few hours, including as the Moon reaches its highest for the night at 8:37 p.m., the Moon will pass in front of the Pleiades, blocking many of these stars from view. By about midnight the Pleiades will appear about 1 degree below the Moon, and the Moon and the Pleiades will separate as Friday morning progresses.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eAlso on Thursday night, January 9\u003c/strong\u003e This will be when the planet Venus reaches its greatest angular separation from the Sun as seen from Earth for this apparition (called greatest elongation). Because the angle between the line from the Sun to Venus and the line of the horizon changes with the seasons, the date when Venus and the Sun appear farthest apart as seen from Earth is not always the same as when it appears highest above the west-southwestern horizon as evening twilight ends, which occurs on January 27.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eFriday evening, January 10\u003c/strong\u003e Jupiter will appear near the waxing gibbous Moon. As evening twilight ends at 6:08 p.m. EST, Jupiter will be 5 degrees to the lower right. As the Moon reaches its highest for the night at 9:37 p.m., Jupiter will be 6 degrees below the Moon. The pair will continue to separate until Jupiter sets Saturday morning at 4:45 a.m.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eSunday evening, January 12\u003c/strong\u003e There is a very slight chance that the sungrazing comet, C/2024 G3 (ATLAS) (discovered in April 2024) will be visible 5 degrees to the upper right of the setting Sun. Most likely, this comet will not be bright enough to see in the daytime or will break up and vanish from view like comet C/2024 S1 (ATLAS) did in October. The odds are low, but if the horizon is very clear, your best chance of seeing this comet might be after sunset at 5:07 p.m. EST, but before the comet sets about 10 minutes later.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eThe full Moon after next will be Monday evening, January 13, at 5:27 p.m. EST\u003c/strong\u003e. This will be on Tuesday from the South Africa Time and Eastern European Time zones eastward across the rest of Africa, Europe, Asia, Australia, etc., to the International Date Line in the mid-Pacific. The Moon will appear full for about three days around this time, from Sunday evening (and possibly the last part of Sunday morning) into Wednesday morning. On Monday night the full Moon will appear near and pass in front of the bright planet Mars, with the bright star Pollux above the pair. As evening twilight ends at 6:11 p.m. EST, the three will form a triangle, with Mars 2 degrees to the lower left and Pollux 3 degrees to the upper left of the Moon. For most of the continental USA as well as parts of Africa, Canada, and Mexico, the Moon will pass in front of Mars. Times will vary for other locations, but for NASA Headquarters in Washington, D.C., Mars will vanish behind the bottom of the Moon at about 9:16 p.m. and reappear from behind the upper right of the Moon at about 10:31 p.m. By the time the Moon reaches its highest for the night early on Tuesday morning at 12:37 a.m., Mars will be 1 degree to the right of the Moon and Pollux 5 degrees to the upper right. As morning twilight begins at 6:23 a.m., Mars will be 4 degrees and Pollux 8 degrees to the lower right of the Moon.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/section\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "37 min read",
  "publishedTime": null,
  "modifiedTime": null
}
