{
  "id": "87281134-0bed-462d-aee6-8e963af01da2",
  "title": "How US-Indian NISAR Satellite Will Offer Unique Window on Earth",
  "link": "https://www.nasa.gov/missions/nisar/how-us-indian-nisar-satellite-will-offer-unique-window-on-earth/",
  "description": "A Q\u0026A with the lead U.S. scientist of the mission, which will track changes in everything from wetlands to ice sheets to infrastructure damaged by natural disasters. The upcoming U.S.-India NISAR (NASA-ISRO Synthetic Aperture Radar) mission will observe Earth like no mission before, offering insights about our planet’s ever-changing surface. The NISAR mission is a […]",
  "author": "Anthony Greicius",
  "published": "Mon, 06 Jan 2025 21:53:05 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "NISAR (NASA-ISRO Synthetic Aperture Radar)",
    "Climate Change",
    "Earth",
    "Earth Science",
    "Earth Science Division",
    "Ice \u0026 Glaciers",
    "Jet Propulsion Laboratory",
    "Seasat",
    "Shuttle Radar Topography Mission (SRTM)",
    "SIR-C/X-SAR (Shuttle Imaging Radar-C / X-Band Synthetic Aperture Radar)"
  ],
  "byline": "Anthony Greicius",
  "length": 5240,
  "excerpt": "A Q\u0026A with the lead U.S. scientist of the mission, which will track changes in everything from wetlands to ice sheets to infrastructure damaged by natural",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "A Q\u0026A with the lead U.S. scientist of the mission, which will track changes in everything from wetlands to ice sheets to infrastructure damaged by natural disasters. The upcoming U.S.-India NISAR (NASA-ISRO Synthetic Aperture Radar) mission will observe Earth like no mission before, offering insights about our planet’s ever-changing surface. The NISAR mission is a first-of-a-kind dual-band radar satellite that will measure land deformation from earthquakes, landslides, and volcanoes, producing data for science and disaster response. It will track how much glaciers and ice sheets are advancing or retreating and it will monitor growth and loss of forests and wetlands for insights on the global carbon cycle. As diverse as NISAR’s impact will be, the mission’s winding path to launch — in a few months’ time — has also been remarkable. Paul Rosen, NISAR’s project scientist at NASA’s Jet Propulsion Laboratory in Southern California, has been there at every step. He recently discussed the mission and what sets it apart. The planet’s surfaces never stop changing — in some ways small and subtle, and in other ways monumental and sudden. With NISAR, we’ll measure that change roughly every week, with each pixel capturing an area about half the size of a tennis court. Taking imagery of nearly all Earth’s land and ice surfaces this frequently and at such a small scale — down to the centimeter — will help us put the pieces together into one coherent picture to create a story about the planet as a living system. NISAR will be the first Earth-observing satellite with two kinds of radar — an L-band system with a 10-inch (25-centimeter) wavelength and an S-band system with a 4-inch (10-centimeter) wavelength. Whether microwaves reflect or penetrate an object depends on their wavelength. Shorter wavelengths are more sensitive to smaller objects such as leaves and rough surfaces, whereas longer wavelengths are more reactive with larger structures like boulders and tree trunks. So NISAR’s two radar signals will react differently to some features on Earth’s surface. By taking advantage of what each signal is or isn’t sensitive to, researchers can study a broader range of features than they could with either radar on its own, observing the same features with different wavelengths. The concept of a spaceborne synthetic aperture radar, or SAR, studying Earth’s processes dates to the 1970s, when NASA launched Seasat. Though the mission lasted only a few months, it produced first-of-a-kind images that changed the remote-sensing landscape for decades to come. It also drew me to JPL in 1981 as a college student: I spent two summers analyzing data from the mission. Seasat led to NASA’s Shuttle Imaging Radar program and later to the Shuttle Radar Topography Mission. Our data products will fit the needs of users across the mission’s science focus areas — ecosystems, cryosphere, and solid Earth — plus have many uses beyond basic research like soil-moisture and water resources monitoring. We’ll make the data easily accessible. Given the volume of the data, NASA decided that it would be processed and stored in the cloud, where it’ll be free to access. We proposed DESDynI (Deformation, Ecosystem Structure, and Dynamics of Ice), an L-band satellite, following the 2007 Decadal Survey by the National Academy of Sciences. At the time, ISRO was exploring launching an S-band satellite. The two science teams proposed a dual-band mission, and in 2014 NASA and ISRO agreed to partner on NISAR. Since then, the agencies have been collaborating across more than 9,000 miles (14,500 kilometers) and 13 time zones. Hardware was built on different continents before being assembled in India to complete the satellite. It’s been a long journey — literally. The NISAR mission is an equal collaboration between NASA and ISRO and marks the first time the two agencies have cooperated on hardware development for an Earth-observing mission. Managed for the agency by Caltech, JPL leads the U.S. component of the project and is providing the mission’s L-band SAR. NASA is also providing the radar reflector antenna, the deployable boom, a high-rate communication subsystem for science data, GPS receivers, a solid-state recorder, and payload data subsystem. Space Applications Centre Ahmedabad, ISRO’s lead center for payload development, is providing the mission’s S-band SAR instrument and is responsible for its calibration, data processing, and development of science algorithms to address the scientific goals of the mission. U R Rao Satellite Centre in Bengaluru, which leads the ISRO components of the mission, is providing the spacecraft bus. The launch vehicle is from ISRO’s Vikram Sarabhai Space Centre, launch services are through ISRO’s Satish Dhawan Space Centre, and satellite mission operations are by ISRO Telemetry Tracking and Command Network. National Remote Sensing Centre in Hyderabad is primarily responsible for S-band data reception, operational products generation, and dissemination. To learn more about NISAR, visit: https://nisar.jpl.nasa.gov Andrew Wang / Jane J. LeeJet Propulsion Laboratory, Pasadena, Calif.626-379-6874 / 818-354-0307andrew.wang@jpl.nasa.gov / jane.j.lee@jpl.nasa.gov 2025-001",
  "image": "https://www.nasa.gov/wp-content/uploads/2025/01/1-pia26492-nisar-horizon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cp\u003e\u003cem\u003eA Q\u0026amp;A with the lead U.S. scientist of the mission, which will track changes in everything from wetlands to ice sheets to infrastructure damaged by natural disasters.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe upcoming U.S.-India NISAR (NASA-ISRO Synthetic Aperture Radar) mission will observe Earth like no mission before, offering insights about our planet’s ever-changing surface.\u003c/p\u003e\n\u003cp\u003eThe \u003ca href=\"https://nisar.jpl.nasa.gov/\" rel=\"noopener\"\u003eNISAR\u003c/a\u003e mission is a first-of-a-kind dual-band radar satellite that will measure \u003ca href=\"https://www.jpl.nasa.gov/news/powerful-new-us-indian-satellite-will-track-earths-changing-surface/\" rel=\"noopener\"\u003eland deformation\u003c/a\u003e from earthquakes, landslides, and volcanoes, producing data for science and disaster response. It will track how much \u003ca href=\"https://www.jpl.nasa.gov/news/this-us-indian-satellite-will-monitor-earths-changing-frozen-regions/\" rel=\"noopener\"\u003eglaciers and ice sheets\u003c/a\u003e are advancing or retreating and it will monitor growth and loss of \u003ca href=\"https://www.jpl.nasa.gov/news/nasa-isro-radar-mission-to-provide-dynamic-view-of-forests-wetlands/\" rel=\"noopener\"\u003eforests and wetlands\u003c/a\u003e for insights on the global carbon cycle.\u003c/p\u003e\n\u003cp\u003eAs diverse as NISAR’s impact will be, the mission’s winding path to launch — \u003ca href=\"https://nisar.jpl.nasa.gov/news/122/nasa-isro-aiming-to-launch-nisar-mission-in-march-2025/\" rel=\"noopener\"\u003ein a few months’ time\u003c/a\u003e — has also been remarkable. Paul Rosen, NISAR’s project scientist at NASA’s Jet Propulsion Laboratory in Southern California, has been there at every step. He recently discussed the mission and what sets it apart.\u003c/p\u003e\n\n\n\u003cp\u003eThe planet’s surfaces never stop changing — in some ways small and subtle, and in other ways monumental and sudden. With NISAR, we’ll measure that change roughly every week, with each pixel capturing an area about half the size of a tennis court. Taking imagery of nearly all Earth’s land and ice surfaces this frequently and at such a small scale — down to the centimeter — will help us put the pieces together into one coherent picture to create a story about the planet as a living system.\u003c/p\u003e\n\n\u003cp\u003eNISAR will be the first Earth-observing satellite with two kinds of radar — an L-band system with a 10-inch (25-centimeter) wavelength and an S-band system with a 4-inch (10-centimeter) wavelength.\u003c/p\u003e\n\u003cp\u003eWhether microwaves reflect or penetrate an object depends on their wavelength. Shorter wavelengths are more sensitive to smaller objects such as leaves and rough surfaces, whereas longer wavelengths are more reactive with larger structures like boulders and tree trunks.\u003c/p\u003e\n\u003cp\u003eSo NISAR’s two radar signals will react differently to some features on Earth’s surface. By taking advantage of what each signal is or isn’t sensitive to, researchers can study a broader range of features than they could with either radar on its own, observing the same features with different wavelengths.\u003c/p\u003e\n\n\u003cp\u003eThe concept of a spaceborne synthetic aperture radar, or SAR, studying Earth’s processes dates to the 1970s, when NASA launched \u003ca href=\"https://www.jpl.nasa.gov/missions/seasat/\" rel=\"noopener\"\u003eSeasat\u003c/a\u003e. Though the mission lasted only a few months, it produced first-of-a-kind images that changed the remote-sensing landscape for decades to come.\u003c/p\u003e\n\u003cp\u003eIt also drew me to JPL in 1981 as a college student: I spent two summers analyzing data from the mission. Seasat led to NASA’s \u003ca href=\"https://science.nasa.gov/mission/sir-c-x-sar/\" rel=\"noopener\"\u003eShuttle Imaging Radar program\u003c/a\u003e and later to the \u003ca href=\"https://eospso.nasa.gov/missions/shuttle-radar-topography-mission\" rel=\"noopener\"\u003eShuttle Radar Topography Mission\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eOur data products will fit the needs of users across the mission’s science focus areas — ecosystems, cryosphere, and solid Earth — plus have many uses beyond basic research like soil-moisture and water resources monitoring.\u003c/p\u003e\n\u003cp\u003eWe’ll make the data easily accessible. Given the volume of the data, NASA decided that it would be processed and stored in the cloud, where it’ll be free to access.\u003c/p\u003e\n\n\u003cp\u003eWe proposed \u003ca href=\"https://science.jpl.nasa.gov/projects/DESDynI/\" rel=\"noopener\"\u003eDESDynI\u003c/a\u003e (Deformation, Ecosystem Structure, and Dynamics of Ice), an L-band satellite, following the 2007 Decadal Survey by the National Academy of Sciences. At the time, ISRO was exploring launching an S-band satellite. The two science teams proposed a dual-band mission, and in 2014 NASA and ISRO agreed to partner on NISAR.\u003c/p\u003e\n\u003cp\u003eSince then, the agencies have been collaborating across more than 9,000 miles (14,500 kilometers) and 13 time zones. Hardware was built on different continents before being assembled in India to complete the satellite. It’s been a long journey — literally.\u003c/p\u003e\n\n\u003cp\u003eThe NISAR mission is an equal collaboration between NASA and ISRO and marks the first time the two agencies have cooperated on hardware development for an Earth-observing mission. Managed for the agency by Caltech, JPL leads the U.S. component of the project and is providing the mission’s L-band SAR. NASA is also providing the radar reflector antenna, the deployable boom, a high-rate communication subsystem for science data, GPS receivers, a solid-state recorder, and payload data subsystem.\u003c/p\u003e\n\u003cp\u003eSpace Applications Centre Ahmedabad, ISRO’s lead center for payload development, is providing the mission’s S-band SAR instrument and is responsible for its calibration, data processing, and development of science algorithms to address the scientific goals of the mission. U R Rao Satellite Centre in Bengaluru, which leads the ISRO components of the mission, is providing the spacecraft bus. The launch vehicle is from ISRO’s Vikram Sarabhai Space Centre, launch services are through ISRO’s Satish Dhawan Space Centre, and satellite mission operations are by ISRO Telemetry Tracking and Command Network. National Remote Sensing Centre in Hyderabad is primarily responsible for S-band data reception, operational products generation, and dissemination.\u003c/p\u003e\n\u003cp\u003eTo learn more about NISAR, visit:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://nisar.jpl.nasa.gov\" rel=\"noopener\"\u003ehttps://nisar.jpl.nasa.gov\u003c/a\u003e\u003c/p\u003e\n\n\u003cp\u003eAndrew Wang / Jane J. Lee\u003cbr/\u003eJet Propulsion Laboratory, Pasadena, Calif.\u003cbr/\u003e626-379-6874 / 818-354-0307\u003cbr/\u003e\u003ca href=\"mailto:andrew.wang@jpl.nasa.gov\"\u003eandrew.wang@jpl.nasa.gov\u003c/a\u003e / \u003ca href=\"mailto:jane.j.lee@jpl.nasa.gov\"\u003ejane.j.lee@jpl.nasa.gov\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e2025-001\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-06T16:53:05-05:00",
  "modifiedTime": "2025-01-06T17:02:47-05:00"
}
