{
  "id": "8c84ea59-3d5f-4b1d-b867-cba04b9fe74c",
  "title": "Eclipses, Auroras, and the Spark of Becoming: NASA Inspires Future Scientists",
  "link": "https://science.nasa.gov/learning-resources/science-activation/eclipses-auroras-and-the-spark-of-becoming-nasa-inspires-future-scientists/",
  "description": "In the heart of Alaska’s winter, where the night sky stretches endlessly and the aurora dances across the sky in a display of ethereal beauty, nine undergraduate students from across the United States were about to embark on a transformative journey. These students had been active ‘NASA Partner Eclipse Ambassadors’ in their home communities, nine […]",
  "author": "",
  "published": "Wed, 14 May 2025 21:33:58 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Auroras",
    "Eclipses",
    "Opportunities For Students to Get Involved",
    "Science Activation"
  ],
  "byline": "amdollar",
  "length": 4343,
  "excerpt": "In the heart of Alaska’s winter, where the night sky stretches endlessly and the aurora dances across the sky in a display of ethereal beauty, nine",
  "siteName": "NASA Science",
  "favicon": "https://science.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "NASA Science Editorial TeamMay 14, 2025 In the heart of Alaska’s winter, where the night sky stretches endlessly and the aurora dances across the sky in a display of ethereal beauty, nine undergraduate students from across the United States were about to embark on a transformative journey. These students had been active 'NASA Partner Eclipse Ambassadors' in their home communities, nine of more than 700 volunteers who shared the science and awe of the 2024 eclipse with hundreds of thousands of people across the country as part of the NASA Science Activation program's Eclipse Ambassadors project. Now, these nine were chosen to participate in a once-in a lifetime experience as a part of the \"Eclipses to Aurora\" Winter Field School at the University of Alaska Fairbanks. Organized by the Astronomical Society of the Pacific and NASA's Aurorasaurus Citizen Science project, supported by NASA, this program offered more than just lectures—it was an immersive experience into the wonders of heliophysics and the profound connections between the Sun and Earth. From January 4 to 11, 2025, the students explored the science behind the aurora through seminars on solar and space physics, hands-on experiments, and tours of cutting-edge research facilities like the Poker Flat Research Range. They also gained invaluable insight from Athabaskan elders, who shared local stories and star knowledge passed down through generations. As Feras recalled, \"We attended multiple panels on solar and space physics, spoke to local elders on their connection to the auroras, and visited the Poker Flat Research Range to observe the stunning northern lights.\" For many students, witnessing the aurora was not only a scientific milestone, but a deeply personal and emotional experience. One participant, Andrea, described it vividly: “I looked to the darkest horizon I could find to see my only constant dream fulfilled before my eyes, so slowly dancing and bending to cradle the stars. All I could do, with my hands frozen and tears falling, I began to dream again with my eyes wide open.” Another student, Kalid, reflected on the shared human moment: \"Standing there under the vast Alaskan sky… we were all just people, looking up, waiting for something magical. The auroras didn’t care about our majors or our knowledge—they brought us together under the same sky.\" These moments of wonder were mirrored by a deeper sense of purpose and transformation. “Over the course of the week, I had the incredible opportunity to explore auroras through lectures on solar physics, planetary auroras, and Indigenous star knowledge… and to reflect on these experiences through essays and presentations,” said Sophia. The Winter Field School was more than an academic endeavor—it was a celebration of science, culture, and shared human experience. It fostered not only understanding but unity and awe, reminding everyone involved of the profound interconnectedness of our universe. The impact of the program continues to resonate. For many students, that one aurora-lit week in Alaska became a turning point in the focus of their careers. Sophia has since been accepted into graduate school to pursue heliophysics. Vishvi, inspired by the intersection of science and society, will begin a program in medical physics at the University of Pennsylvania this fall. And Christy, moved by her time at the epicenter of aurora research, has applied to the Ph.D. program in Space Physics at the University of Alaska Fairbanks—the very institution that helped spark her journey. Their stories are powerful proof that the Winter Field School didn’t just teach—it awakened purpose, lit new paths, and left footprints on futures still unfolding. Eclipse Ambassadors is supported by NASA under cooperative agreement award number 80NSS22M0007 and is part of NASA’s Science Activation Portfolio. Learn more about how Science Activation connects NASA science experts, real content, and experiences with community leaders to do science in ways that activate minds and promote deeper understanding of our world and beyond: https://science.nasa.gov/learn/about-science-activation/ Share Details NASA Science Editorial Team Explore More Keep Exploring Discover More Topics From NASA",
  "image": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/learn/science-activation-stories/2025/AndyWitteman_WFS_2025_sm-Vivian_White.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-855458\"\u003e\u003csection\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://science.nasa.gov/wp-content/uploads/2023/04/NASA_logo.png?w=300\" alt=\"The headshot image of NASA Science Editorial Team\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch3\u003eNASA Science Editorial Team\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eMay 14, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\n\n\n\n\u003cp\u003eIn the heart of Alaska’s winter, where the night sky stretches endlessly and the aurora dances across the sky in a display of ethereal beauty, nine undergraduate students from across the United States were about to embark on a transformative journey. These students had been active \u0026#39;NASA Partner Eclipse Ambassadors\u0026#39; in their home communities, nine of more than 700 volunteers who shared the science and awe of the 2024 eclipse with hundreds of thousands of people across the country as part of the NASA Science Activation program\u0026#39;s \u003ca href=\"https://astrosociety.org/education-outreach/amateur-astronomers/eclipse-ambassadors/program.html\"\u003eEclipse Ambassadors project\u003c/a\u003e. Now, these nine were chosen to participate in a once-in a lifetime experience as a part of the \u0026#34;Eclipses to Aurora\u0026#34; \u003ca href=\"https://astrosociety.org/education-outreach/amateur-astronomers/eclipse-ambassadors/winter-field-school.html\"\u003eWinter Field School\u003c/a\u003e at the University of Alaska Fairbanks. Organized by the \u003ca href=\"https://astrosociety.org/\"\u003eAstronomical Society of the Pacific\u003c/a\u003e and NASA\u0026#39;s \u003ca href=\"https://aurorasaurus.org/\"\u003eAurorasaurus\u003c/a\u003e Citizen Science project, supported by NASA, this program offered more than just lectures—it was an immersive experience into the wonders of heliophysics and the profound connections between the Sun and Earth.\u003c/p\u003e\n\n\n\n\u003cp\u003eFrom January 4 to 11, 2025, the students explored the science behind the aurora through seminars on solar and space physics, hands-on experiments, and tours of cutting-edge research facilities like the Poker Flat Research Range. They also gained invaluable insight from Athabaskan elders, who shared local stories and star knowledge passed down through generations. As Feras recalled, \u0026#34;We attended multiple panels on solar and space physics, spoke to local elders on their connection to the auroras, and visited the Poker Flat Research Range to observe the stunning northern lights.\u0026#34;\u003c/p\u003e\n\n\n\n\u003cp\u003eFor many students, witnessing the aurora was not only a scientific milestone, but a deeply personal and emotional experience. One participant, Andrea, described it vividly: “I looked to the darkest horizon I could find to see my only constant dream fulfilled before my eyes, so slowly dancing and bending to cradle the stars. All I could do, with my hands frozen and tears falling, I began to dream again with my eyes wide open.” Another student, Kalid, reflected on the shared human moment: \u0026#34;Standing there under the vast Alaskan sky… we were all just people, looking up, waiting for something magical. The auroras didn’t care about our majors or our knowledge—they brought us together under the same sky.\u0026#34;\u003c/p\u003e\n\n\n\n\u003cp\u003eThese moments of wonder were mirrored by a deeper sense of purpose and transformation. “Over the course of the week, I had the incredible opportunity to explore auroras through lectures on solar physics, planetary auroras, and Indigenous star knowledge… and to reflect on these experiences through essays and presentations,” said Sophia. The Winter Field School was more than an academic endeavor—it was a celebration of science, culture, and shared human experience. It fostered not only understanding but unity and awe, reminding everyone involved of the profound interconnectedness of our universe.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe impact of the program continues to resonate. For many students, that one aurora-lit week in Alaska became a turning point in the focus of their careers. Sophia has since been accepted into graduate school to pursue heliophysics. Vishvi, inspired by the intersection of science and society, will begin a program in medical physics at the University of Pennsylvania this fall. And Christy, moved by her time at the epicenter of aurora research, has applied to the Ph.D. program in Space Physics at the University of Alaska Fairbanks—the very institution that helped spark her journey. Their stories are powerful proof that the Winter Field School didn’t just teach—it awakened purpose, lit new paths, and left footprints on futures still unfolding.\u003c/p\u003e\n\n\n\n\u003cp\u003eEclipse Ambassadors is supported by NASA under cooperative agreement award number 80NSS22M0007 and is part of NASA’s Science Activation Portfolio. Learn more about how Science Activation connects NASA science experts, real content, and experiences with community leaders to do science in ways that activate minds and promote deeper understanding of our world and beyond: \u003ca href=\"https://science.nasa.gov/learn/about-science-activation/\"\u003ehttps://science.nasa.gov/learn/about-science-activation/\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"\"\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eShare\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\u003c/div\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eDetails\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\u003cdiv\u003e\u003cp\u003eNASA Science Editorial Team\u003c/p\u003e\u003c/div\u003e\t\t\t\u003c/div\u003e\n\t\n\t\u003c/div\u003e\n\n\u003cdiv id=\"\"\u003e\n\t\t\t\t\u003cp\u003e\u003ch2\u003eExplore More\u003c/h2\u003e\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\u003cdiv id=\"\"\u003e\n\t\t\t\t\t\u003cp\u003eKeep Exploring\u003c/p\u003e\n\t\t\t\t\t\u003ch2\u003eDiscover More Topics From NASA\u003c/h2\u003e\n\t\t\t\t\u003c/div\u003e\u003c/section\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-14T17:33:58-04:00",
  "modifiedTime": "2025-05-14T17:34:05-04:00"
}
