{
  "id": "9c50c20e-add5-4051-abe2-bef8e9d0290b",
  "title": "S-MODE, ASIA-AQ, and the Role of ESPO in Complex Airborne Campaigns",
  "link": "https://www.nasa.gov/general/s-mode-asia-aq-and-the-role-of-espo-in-complex-airborne-campaigns/",
  "description": "ESPO solves problems before you know you have them. If you are missing a canister of liquid nitrogen, got locked out of your rental car, or need clearance for a South Korean military base, you want ESPO in your corner. What is ESPO? While the Earth Science Project Office (ESPO) does many things, one of […]",
  "author": "Milan Loiacono",
  "published": "Fri, 18 Oct 2024 20:05:07 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "General",
    "Earth Science",
    "Earth Science Division"
  ],
  "byline": "Milan Loiacono",
  "length": 7346,
  "excerpt": "ESPO solves problems before you know you have them. If you are missing a canister of liquid nitrogen, got locked out of your rental car, or need clearance for",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "ESPO solves problems before you know you have them. If you are missing a canister of liquid nitrogen, got locked out of your rental car, or need clearance for a South Korean military base, you want ESPO in your corner. While the Earth Science Project Office (ESPO) does many things, one of the team’s primary responsibilities is providing project management for many of the largest and most complex airborne campaigns across NASA’s Earth Science Division. Some of these missions are domestic, such as the Sub-Mesoscale Ocean Dynamics Experiment (S-MODE). S-MODE deployed three separate field campaigns from 2021-2023, using planes, drones, marine robotics, and research vessels to study ocean eddies and sub-surface dynamics. NASA Ames Research Center, located in Northern California, served as S-MODE’s control center and the base for two of the three deployed aircraft. ESPO also provides project management for many international missions, such as the Airborne and Satellite Investigation of Asian Air Quality (ASIA-AQ), which deployed in January, 2024 out of South Korea, Thailand, and the Philippines. The campaign used satellites, aircraft, and ground-based sensors to study air quality across Asia, as part of a global effort to better understand the factors that contribute to air quality. Despite the critical nature of ESPO’s work, they’ll be the first to tell you that their goal is to remain behind the scenes. “Our mission statement is essentially to let the scientists concentrate on science,” said Erin Czech, Assistant Branch Chief of ESPO. “Our team’s job is to stay in the background. We don’t really advertise all the things we do, the pieces we put together, the crises we solve, because we don’t want folks to have to be in the weeds with us. We’ll take care of it.” Project management for major airborne campaigns begins long before a deployment. The team begins by helping establish a mission framework, such as getting a budget in place, settling grants and funding with partner universities and agencies, and performing site visits. “We are not scientists,” Czech said, “it’s the job of the Principal Investigator to mission plan. Our job is to evaluate risk, set up contingency plans, and help make sure all the different groups are talking to each other. We work with world-class scientists, who are going to come up with an awesome plan; we just want to do whatever we need to in order to support them.” Erin Czech ESPO Assistant Branch Chief As the deployment date draws closer, the team nails down logistics: deciding how and where to ship equipment, reserving hotel blocks for researchers, acquiring diplomatic clearances, running planning meetings between agencies, and so much more. This process is particularly complicated for multi-site, international missions like ASIA-AQ, which required multiple visits to each country before the actual deployment. “We looked at many locations in each country on the first scouting trip, to help figure out deployment sites,” said Jhony Zavaleta, Deputy Director for ESPO and Project Manager for ASIA-AQ. “The second scouting trip was to evaluate modifications promised during the first trip, such as upgrades to infrastructure, and to figure out hotels, transit options, specific facilities for mission operations, that sort of thing.” According to Zavaleta, another purpose of these advance trips was to put pieces in place with partner organizations  – such as civilian aviation authorities, foreign science ministries, or military operations – so that when NASA officially requested diplomatic clearance to run the airborne campaigns, the groundwork had already been laid. Then it’s go time.  As the deployment gets underway, ESPO keeps the flurry of activity running as smoothly as possible. “During a deployment, you’re working all day every day,” said Czech, who is also the Project Manager for S-MODE. “But really that’s the whole mission team. When you’re on a NASA project, the whole team is incredibly dedicated and working like crazy, because everybody’s on the same page to make the most out of this investment, and take advantage of any kind of science opportunity that presents itself day to day.” For Zavaleta, day-to-day operations meant escorting personnel onto military bases, tracking down liquid nitrogen, coordinating media days with local news outlets, setting up satellite communications, arranging transportation between sites, and preparing the next location. “I was on the ESPO advance team, which would set up one location, overlap with the ESPO site management team for about a week, then head to the next,” Zavaleta recalled. “Our teams would leapfrog; we were always managing site logistics, but also always preparing and setting up for the next spot.” Beyond the day-to-day operations, ESPO also steps in when major issues arise. According to Czech, they can usually expect one or two big wrenches to come up for any major mission. For S-MODE, the first wrench came in the form of a global pandemic. “The original deployment was set for April, 2020,” Czech said. “Everything was shutting down, and we had just set everything up: ship, aircraft, everything. In fact, we set everything up two more times before we ultimately got to do our first deployment, in October of 2021.” The second major wrench happened when four months before the actual launch, the research vessel the mission was planned around backed out. From there, Czech said it was a mad scramble to find a suitable replacement vessel that was already on the West Coast, and to build out the on-board infrastructure to meet the mission requirements. “The key is just to always be on the lookout for issues, keep agile, and don’t get too frustrated if things don’t go your way,” Czech said. “It is what it is. Some major issue comes up on every big mission: you’ve just got to figure out how to deal with it, then move on.” After a field deployment is finished, there are still years of work to do – for the scientists and for ESPO. The final S-MODE field deployment concluded in Spring of 2023. While the science team has been processing data and analyzing results, ESPO’s role has been to organize annual science team meetings, track publications tied to the mission, and help compile a final report to be presented in Washington DC when the mission officially wraps in May of 2025. For ASIA-AQ, whose deployment wrapped up in March of 2024, ESPO’s first task was getting all equipment and personnel back to their respective home bases. Next up, Zavaleta and his team are coordinating a science team meeting in Malaysia in January of 2025, and supporting the scientists as they put together a preliminary research report for later that spring. While logistical skills and communication brokering are important pieces of ESPO’s role, knowledge may be the group’s most important asset. “In many ways, our value to NASA lies in the fact that we’ve been doing this a long time,” Czech said. “Our first mission was in 1987, and we’ve run over 60 campaigns since then; we have a lot of institutional knowledge that gets passed down, and a lot of experience between our team members. That expertise is a large part of our value to the agency.” To access the data from S-MODE, visit the Physical Oceanography Distributed Active Archive Center (PO.DAAC)",
  "image": "https://www.nasa.gov/wp-content/uploads/2024/10/image002.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eESPO solves problems before you know you have them. If you are missing a canister of liquid nitrogen, got locked out of your rental car, or need clearance for a South Korean military base, you want ESPO in your corner.\u003c/p\u003e\n\n\n\u003cp\u003eWhile the \u003ca href=\"https://espo.nasa.gov/\" rel=\"noopener\"\u003eEarth Science Project Office (ESPO)\u003c/a\u003e does many things, one of the team’s primary responsibilities is providing project management for many of the largest and most complex airborne campaigns across NASA’s Earth Science Division.\u003c/p\u003e\n\n\u003cp\u003eSome of these missions are domestic, such as the \u003ca href=\"https://espo.nasa.gov/s-mode/content/S-MODE\" rel=\"noopener\"\u003eSub-Mesoscale Ocean Dynamics Experiment (S-MODE)\u003c/a\u003e. S-MODE deployed three separate field campaigns from 2021-2023, using planes, drones, marine robotics, and research vessels to study ocean eddies and sub-surface dynamics. NASA Ames Research Center, located in Northern California, served as S-MODE’s control center and the base for two of the three deployed aircraft.\u003c/p\u003e\n\n\n\n\u003cp\u003eESPO also provides project management for many international missions, such as the \u003ca href=\"https://espo.nasa.gov/asia-aq/\" rel=\"noopener\"\u003eAirborne and Satellite Investigation of Asian Air Quality (ASIA-AQ)\u003c/a\u003e, which deployed in January, 2024 out of South Korea, Thailand, and the Philippines. The campaign used satellites, aircraft, and ground-based sensors to study air quality across Asia, as part of a global effort to better understand the factors that contribute to air quality.\u003c/p\u003e\n\n\u003cp\u003eDespite the critical nature of ESPO’s work, they’ll be the first to tell you that their goal is to remain behind the scenes. “Our mission statement is essentially to let the scientists concentrate on science,” said \u003ca href=\"https://www.nasa.gov/people/erin-czech-2/\"\u003eErin Czech\u003c/a\u003e, Assistant Branch Chief of ESPO. “Our team’s job is to stay in the background. We don’t really advertise all the things we do, the pieces we put together, the crises we solve, because we don’t want folks to have to be in the weeds with us. We’ll take care of it.”\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eProject management for major airborne campaigns begins long before a deployment. The team begins by helping establish a mission framework, such as getting a budget in place, settling grants and funding with partner universities and agencies, and performing site visits.\u003c/p\u003e\n\u003cp\u003e“We are not scientists,” Czech said, “it’s the job of the Principal Investigator to mission plan. Our job is to evaluate risk, set up contingency plans, and help make sure all the different groups are talking to each other. We work with world-class scientists, who are going to come up with an awesome plan; we just want to do whatever we need to in order to support them.”\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eErin Czech\u003c/p\u003e\n\u003cp\u003eESPO Assistant Branch Chief\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003eAs the deployment date draws closer, the team nails down logistics: deciding how and where to ship equipment, reserving hotel blocks for researchers, acquiring diplomatic clearances, running planning meetings between agencies, and so much more.\u003c/p\u003e\n\n\u003cp\u003eThis process is particularly complicated for multi-site, international missions like ASIA-AQ, which required multiple visits to each country before the actual deployment. “We looked at many locations in each country on the first scouting trip, to help figure out deployment sites,” said \u003ca href=\"https://www.nasa.gov/people/jhony-zavaleta-2/\"\u003eJhony Zavaleta\u003c/a\u003e, Deputy Director for ESPO and Project Manager for ASIA-AQ. “The second scouting trip was to evaluate modifications promised during the first trip, such as upgrades to infrastructure, and to figure out hotels, transit options, specific facilities for mission operations, that sort of thing.”\u003c/p\u003e\n\n\u003cp\u003eAccording to Zavaleta, another purpose of these advance trips was to put pieces in place with partner organizations  – such as civilian aviation authorities, foreign science ministries, or military operations – so that when NASA officially requested diplomatic clearance to run the airborne campaigns, the groundwork had already been laid.\u003c/p\u003e\n\n\u003cp\u003eThen it’s go time. \u003c/p\u003e\n\n\n\u003cp\u003eAs the deployment gets underway, ESPO keeps the flurry of activity running as smoothly as possible.\u003c/p\u003e\n\u003cp\u003e“During a deployment, you’re working all day every day,” said Czech, who is also the Project Manager for S-MODE. “But really that’s the whole mission team. When you’re on a NASA project, the whole team is incredibly dedicated and working like crazy, because everybody’s on the same page to make the most out of this investment, and take advantage of any kind of science opportunity that presents itself day to day.”\u003c/p\u003e\n\n\u003cp\u003eFor Zavaleta, day-to-day operations meant escorting personnel onto military bases, tracking down liquid nitrogen, coordinating media days with local news outlets, setting up satellite communications, arranging transportation between sites, and preparing the next location. “I was on the ESPO advance team, which would set up one location, overlap with the ESPO site management team for about a week, then head to the next,” Zavaleta recalled. “Our teams would leapfrog; we were always managing site logistics, but also always preparing and setting up for the next spot.”\u003c/p\u003e\n\n\n\n\u003cp\u003eBeyond the day-to-day operations, ESPO also steps in when major issues arise. According to Czech, they can usually expect one or two big wrenches to come up for any major mission.\u003c/p\u003e\n\n\u003cp\u003eFor S-MODE, the first wrench came in the form of a global pandemic. “The original deployment was set for April, 2020,” Czech said. “Everything was shutting down, and we had just set everything up: ship, aircraft, everything. In fact, we set everything up two more times before we ultimately got to do our first deployment, in October of 2021.”\u003c/p\u003e\n\n\u003cp\u003eThe second major wrench happened when four months before the actual launch, the research vessel the mission was planned around backed out. From there, Czech said it was a mad scramble to find a suitable replacement vessel that was already on the West Coast, and to build out the on-board infrastructure to meet the mission requirements.\u003c/p\u003e\n\n\n\u003cp\u003e“The key is just to always be on the lookout for issues, keep agile, and don’t get too frustrated if things don’t go your way,” Czech said. “It is what it is. Some major issue comes up on every big mission: you’ve just got to figure out how to deal with it, then move on.”\u003c/p\u003e\n\n\n\u003cp\u003eAfter a field deployment is finished, there are still years of work to do – for the scientists and for ESPO.\u003c/p\u003e\n\u003cp\u003eThe final S-MODE field deployment concluded in Spring of 2023. While the science team has been \u003ca href=\"https://podaac.jpl.nasa.gov/S-MODE\" rel=\"noopener\"\u003eprocessing data\u003c/a\u003e and analyzing results, ESPO’s role has been to organize annual science team meetings, track publications tied to the mission, and help compile a final report to be presented in Washington DC when the mission officially wraps in May of 2025.\u003c/p\u003e\n\n\n\u003cp\u003eFor ASIA-AQ, whose deployment wrapped up in March of 2024, ESPO’s first task was getting all equipment and personnel back to their respective home bases. Next up, Zavaleta and his team are coordinating a science team meeting in Malaysia in January of 2025, and supporting the scientists as they put together a preliminary research report for later that spring.\u003c/p\u003e\n\n\n\u003cp\u003eWhile logistical skills and communication brokering are important pieces of ESPO’s role, knowledge may be the group’s most important asset. “In many ways, our value to NASA lies in the fact that we’ve been doing this a long time,” Czech said. “Our first mission was in 1987, and we’ve run over 60 campaigns since then; we have a lot of institutional knowledge that gets passed down, and a lot of experience between our team members. That expertise is a large part of our value to the agency.”\u003c/p\u003e\n\n\u003cp\u003eTo access the data from S-MODE, visit the \u003ca href=\"https://podaac.jpl.nasa.gov/S-MODE\" rel=\"noopener\"\u003ePhysical Oceanography Distributed Active Archive Center (PO.DAAC)\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-10-18T16:05:07-04:00",
  "modifiedTime": "2024-10-18T16:07:34-04:00"
}
