{
  "id": "b5913b77-fc14-43d7-a38e-6413e067f39f",
  "title": "SARP East 2024 Ocean Remote Sensing Group",
  "link": "https://www.nasa.gov/general/sarp-east-2024-ocean-remote-sensing-group/",
  "description": "Faculty Advisors: Dr. Tom Bell, Woods Hole Oceanographic Institution Dr. Kelsey Bisson, NASA Headquarters Science Mission Directorate Graduate Mentor: Kelby Kramer, Massachusetts Institute of Technology Kelby Kramer, Graduate Mentor Lucas DiSilvestro Shallow Water Benthic Cover Type Classification using Hyperspectral Imagery in Kaneohe Bay, Oahu, Hawaii Lucas DiSilvestro, Dartmouth College Quantifying the changing structure and extent […]",
  "author": "Milan Loiacono",
  "published": "Fri, 22 Nov 2024 22:33:44 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "General"
  ],
  "byline": "Milan Loiacono",
  "length": 11332,
  "excerpt": "Faculty Advisors:",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Milan LoiaconoScience Communication SpecialistNov 22, 2024 Contents Kelby Kramer, Graduate Mentor Lucas DiSilvestro Shallow Water Benthic Cover Type Classification using Hyperspectral Imagery in Kaneohe Bay, Oahu, Hawaii Atticus Cummings Quantifying Uncertainty In Kelp Canopy Remote Sensing Using the Harmonized Landsat Sentinel-2 Dataset Jasmine Sirvent Kelp Us!: A Methods Analysis for Predicting Kelp Pigment Concentrations from Hyperspectral Reflectance Isabelle Cobb Correlations Between SSHa and Chl-a Concentrations in the Northern South China Sea Alyssa Tou Exploring Coastal Sea Surface Temperature Anomalies and their effect on Coastal Fog through analyzing Plant Phenology Faculty Advisors: Dr. Tom Bell, Woods Hole Oceanographic Institution Dr. Kelsey Bisson, NASA Headquarters Science Mission Directorate Graduate Mentor: Kelby Kramer, Massachusetts Institute of Technology Kelby Kramer, graduate mentor for the 2024 SARP Ocean Remote Sensing group, provides an introduction for each of the group members and shares behind-the scenes moments from the internship. Lucas DiSilvestro, Dartmouth College Quantifying the changing structure and extent of benthic coral communities is essential for informing restoration efforts and identifying stressed regions of coral. Accurate classification of shallow-water benthic coral communities requires high spectral and spatial resolution, currently not available on spaceborne sensors, to observe the seafloor through an optically complex seawater column. Here we create a shallow water benthic cover type map of Kaneohe Bay, Oahu, Hawaii using the Airborne Visible/Infrared Imaging Spectrometer (AVIRIS) without requiring in-situ data as inputs. We first run the AVIRIS data through a semi-analytical inversion model to derive color dissolved organic matter, chlorophyll concentration, bottom albedo, suspended sediment, and depth parameters for each pixel, which are then matched to a Hydrolight simulated water column. Pure reflectance for coral, algae, and sand are then projected through each water column to create spectral endmembers for each pixel. Multiple Endmember Spectral Mixture Analysis (MESMA) provides fractional cover of each benthic class on a per-pixel basis. We demonstrate the efficacy of using simulated water columns to create surface reflectance spectral endmembers as Hydrolight-derived in-situ endmember spectra strongly match AVIRIS surface reflectance for corresponding locations (average R = 0.96). This study highlights the capabilities of using medium-fine resolution hyperspectral imagery to identify fractional cover type of localized coral communities and lays the groundwork for future spaceborne hyperspectral monitoring of global coral communities. Atticus Cummings, University of Los Angeles, California California’s giant kelp forests serve as a major foundation for the region’s rich marine biodiversity and provide recreational and economic value to the State of California. With the rising frequency of marine heatwaves and extreme weather onset by climate change, it has become increasingly important to study these vital ecosystems. Kelp forests are highly dynamic, changing across several timescales; seasonally due to nutrient concentrations, waves, and predator populations, weekly with typical growth and decay, and hourly with the tides and currents. Previous remote sensing of kelp canopies has relied on Landsat imagery taken with a eight-day interval, limiting the ability to quantify more rapid changes. This project aims to address uncertainty in kelp canopy detection using the Harmonized Landsat and Sentinel-2 (HLS) dataset’s zero to five-day revisit period. A random forest classifier was used to identify pixels that contain kelp, on which Multiple Endmember Spectral Mixture Analysis (MESMA) was then run to quantify intrapixel kelp density. Processed multispectral satellite images taken within 3 days of one another were paired for comparison. The relationship between fluctuations in kelp canopy density with tides and currents was assessed using in situ data from an acoustic doppler current profiler (ADCP) at the Santa Barbara Long Term Ecological Research site (LTER) and a NOAA tidal buoy. Preliminary results show that current and tidal trends cannot be accurately correlated with canopy detection due to other sources of error. We found that under cloud-free conditions, canopy detection between paired images varied on average by 42%. Standardized image processing suggests that this uncertainty is not created within the image processing step, but likely arises due to exterior factors such as sensor signal noise, atmospheric conditions, and sea state. Ultimately, these errors could lead to misinterpretation of remotely sensed kelp ecosystems, highlighting the need for further research to identify and account for uncertainties in remote sensing of kelp canopies. Jasmine Sirvent, Fresno Pacific University Ocean color remote sensing enables researchers to assess the quantity and physiology of life in the ocean, which is imperative to understanding ecosystem health and formulating accurate predictions. However, without proper methods to analyze hyperspectral data, correlations between spectral reflectance and physiological traits cannot be accurately derived. In this study, I explored different methods—single variable regression, partial least squares regressions (PLSR), and derivatives—in analyzing in situ Macrocystis pyrifera (giant kelp) off the coast of Santa Barbara, California in order to predict pigment concentrations from AVIRIS hyperspectral reflectance. With derivatives as a spectral diagnostic tool, there is evidence suggesting high versus low pigment concentrations could be diagnosed; however, the fluctuations were within 10 nm of resolution, thus AVIRIS would be unable to reliably detect them. Exploring a different method, I plotted in situ pigment measurements — chlorophyll a, fucoxanthin, and the ratio of fucoxanthin to chlorophyll a—against hyperspectral reflectance that was resampled to AVIRIS bands. PLSR proved to be a more successful model because of its hyperdimensional analysis capabilities in accounting for multiple wavelength bands, reaching R2 values of 0.67. Using this information, I constructed a model that predicts kelp pigments from simulated AVIRIS reflectance using a spatial time series of laboratory spectral measurements and photosynthetic pigment concentrations. These results have implications, not only for kelp, but many other photosynthetic organisms detectable by hyperspectral airborne or satellite sensors. With these findings, airborne optical data could possibly predict a plethora of other biogeochemical traits. Potentially, this research would permit scientists to acquire data analogous to in situ measurements about floating matters that cannot financially and pragmatically be accessed by anything other than a remote sensor. Isabelle Cobb, California Polytechnic State University- San Luis Obispo Sea surface height anomalies (SSHa)–variations in sea surface height from climatological averages–occur on seasonal timescales due to coastal upwelling and El Niño-Southern Oscillation (ENSO) cycles. These anomalies are heightened when upwelling plumes bring cold, nutrient-rich water to the surface, and are particularly strong along continental shelves in the Northern South China Sea (NSCS). This linkage between SSHa and nutrient availability has interesting implications for changing chlorophyll-a (chl-a) concentrations, a prominent indicator of phytoplankton biomass that is essential to the health of marine ecosystems. Here, we evaluate the long-term (15 years) relationship between SSHa and chl-a, in both satellite remote sensing data and in situ measurements. Level 3 SSHa data from Jason 1/2/3 satellites and chl-a data from MODIS Aqua were acquired and binned to monthly resolution. We found a significant inverse correlation between SSHa and chl-a during upwelling months in both the remote sensing (Spearman’s R=-0.57) and in situ data, with higher resolution in situ data from ORAS4 (an assimilation of buoy observations from 2003-2017) showing stronger correlations (Spearman’s R=-0.75). In addition, the data reveal that the magnitude of SSH increases with time during instances of high correlation, possibly indicating a trend of increased SSH associated with reduced seasonal chl-a concentrations. Thus, this relationship may inform future work predicting nutrient availability and threats to marine ecosystems as climate change continues to affect coastal sea surface heights. Alyssa Tou, University of Washington Marine heat waves (MHW) have been increasing in frequency, duration and intensity, giving them substantial potential to influence ecosystems. Do these MHWs sufficiently enhance coastal precipitation such that plant growth is impacted? Recently, the Northeast Pacific experienced a long, intense MHW in 2014/2015, and another short, less intense MHW in 2019/2020. Here we investigate how the intensity and duration of MHWs influence the intensity and seasonal cycle of three different land cover types (‘grass’, ‘trees’, and a combination of both ‘combined’’) to analyze plant phenology trends in Big Sur, California. We hypothesize that longer intense MHWs decrease the ocean’s evaporative capacity, decreasing fog, thus lowering plant productivity, as measured by Normalized Difference Vegetation Index (NDVI). Sea surface temperature (SST) and NDVI data were collected from the NOAA Coral Reef Watch, and NASA MODIS/Terra Vegetation Indices 16-Day L3 Global 250m products respectively. Preliminary results show no correlation (R2=0.02) between SSTa and combined NDVI values and no correlation (R2=0.01) between SST and NDVI. This suggests that years with anomalously high SST do not significantly impact plant phenology. During the intense and long 2014/2015 MHW, peak NDVI values for ‘grass’ and ‘combined’ pixels were 2.0 and 1.7 standard deviations above the climatological average, while the shorter 2019/2020 MHW saw higher peaks of 3.2 and 2.4 standard deviations. However, the ‘grass’, ‘tree’ and ‘combined’ NDVI anomalies were statistically insignificant during both MHWs, showing that although NDVI appeared to increase during the shorter and less intense MHW, these values may be attributed to other factors. The data qualitatively suggest that MHW’s don’t impact the peak NDVI date, but more data at higher temporal resolution are necessary. Further research will involve analyzing fog indices and exploring confounding variables impacting NDVI, such as plant physiology, anthropogenic disturbance, and wildfires. In addition, it’s important to understand to what extent changes in NDVI are attributed to the driving factors of MHWs or the MHWs themselves. Ultimately, mechanistically understanding the impacts MHW intensity and duration have on terrestrial ecosystems will better inform coastal community resilience. Share Details Explore More",
  "image": "https://www.nasa.gov/wp-content/uploads/2024/11/kelby-kramer-2024-sarp-east-ocean-remote-sensing-introduction.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-756533\"\u003e\u003csection\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://www.nasa.gov/wp-content/uploads/2023/07/cropped-img-4375-300x300.jpg\" alt=\"The headshot image of Milan Loiacono\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch3\u003eMilan Loiacono\u003c/h3\u003e\u003ch4\u003eScience Communication Specialist\u003c/h4\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eNov 22, 2024\u003c/span\u003e\u003c/p\u003e\n\u003cdiv\u003e\n\t\t\u003cp\u003e\n\t\t\t\u003ch2\u003eContents\u003c/h2\u003e\n\t\t\u003c/p\u003e\n\t\t\u003cul\u003e\n\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\u003ca href=\"#hds-sidebar-nav-1\" data-section-id=\"hds-sidebar-nav-1\"\u003eKelby Kramer, Graduate Mentor\u003c/a\u003e\n\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\u003ca href=\"#hds-sidebar-nav-2\" data-section-id=\"hds-sidebar-nav-2\"\u003eLucas DiSilvestro\u003c/a\u003e\n\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\u003ca href=\"#hds-sidebar-nav-3\" data-section-id=\"hds-sidebar-nav-3\"\u003eShallow Water Benthic Cover Type Classification using Hyperspectral Imagery in Kaneohe Bay, Oahu, Hawaii\u003c/a\u003e\n\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\u003ca href=\"#hds-sidebar-nav-4\" data-section-id=\"hds-sidebar-nav-4\"\u003eAtticus Cummings\u003c/a\u003e\n\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\u003ca href=\"#hds-sidebar-nav-5\" data-section-id=\"hds-sidebar-nav-5\"\u003eQuantifying Uncertainty In Kelp Canopy Remote Sensing Using the Harmonized Landsat Sentinel-2 Dataset\u003c/a\u003e\n\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\u003ca href=\"#hds-sidebar-nav-6\" data-section-id=\"hds-sidebar-nav-6\"\u003eJasmine Sirvent\u003c/a\u003e\n\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\u003ca href=\"#hds-sidebar-nav-7\" data-section-id=\"hds-sidebar-nav-7\"\u003eKelp Us!: A Methods Analysis for Predicting Kelp Pigment Concentrations from Hyperspectral Reflectance\u003c/a\u003e\n\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\u003ca href=\"#hds-sidebar-nav-8\" data-section-id=\"hds-sidebar-nav-8\"\u003eIsabelle Cobb\u003c/a\u003e\n\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\u003ca href=\"#hds-sidebar-nav-9\" data-section-id=\"hds-sidebar-nav-9\"\u003eCorrelations Between SSHa and Chl-a Concentrations in the Northern South China Sea\u003c/a\u003e\n\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\u003ca href=\"#hds-sidebar-nav-10\" data-section-id=\"hds-sidebar-nav-10\"\u003eAlyssa Tou\u003c/a\u003e\n\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\u003ca href=\"#hds-sidebar-nav-11\" data-section-id=\"hds-sidebar-nav-11\"\u003eExploring Coastal Sea Surface Temperature Anomalies and their effect on Coastal Fog through analyzing Plant Phenology\u003c/a\u003e\n\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\u003c/ul\u003e\n\t\u003c/div\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cp\u003e\u003cstrong\u003eFaculty Advisors:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDr. Tom Bell, Woods Hole Oceanographic Institution\u003c/p\u003e\n\u003cp\u003eDr. Kelsey Bisson, NASA Headquarters Science Mission Directorate\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGraduate Mentor:\u003c/strong\u003e \u003c/p\u003e\n\u003cp\u003eKelby Kramer, Massachusetts Institute of Technology\u003c/p\u003e\n\n\n\u003cfigure\u003e\n\u003cp\u003e\n\u003ciframe title=\"Kelby Kramer: 2024 SARP East Ocean Remote Sensing Introduction\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/KQ9nxnkxB-w?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003cfigcaption\u003eKelby Kramer, graduate mentor for the 2024 SARP Ocean Remote Sensing group, provides an introduction for each of the group members and shares behind-the scenes moments from the internship.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\u003cfigure\u003e\n\u003cp\u003e\n\u003ciframe title=\"Lucas DiSilvestro: 2024 SARP East Ocean Remote Sensing Group\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Zey4VFEoYig?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\n\u003c/figure\u003e\n\n\u003cp\u003e\u003cstrong\u003eLucas DiSilvestro, Dartmouth College\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eQuantifying the changing structure and extent of benthic coral communities is essential for informing restoration efforts and identifying stressed regions of coral. Accurate classification of shallow-water benthic coral communities requires high spectral and spatial resolution, currently not available on spaceborne sensors, to observe the seafloor through an optically complex seawater column. Here we create a shallow water benthic cover type map of Kaneohe Bay, Oahu, Hawaii using the Airborne Visible/Infrared Imaging Spectrometer (AVIRIS) without requiring in-situ data as inputs. We first run the AVIRIS data through a semi-analytical inversion model to derive color dissolved organic matter, chlorophyll concentration, bottom albedo, suspended sediment, and depth parameters for each pixel, which are then matched to a Hydrolight simulated water column. Pure reflectance for coral, algae, and sand are then projected through each water column to create spectral endmembers for each pixel. Multiple Endmember Spectral Mixture Analysis (MESMA) provides fractional cover of each benthic class on a per-pixel basis. We demonstrate the efficacy of using simulated water columns to create surface reflectance spectral endmembers as Hydrolight-derived in-situ endmember spectra strongly match AVIRIS surface reflectance for corresponding locations (average R = 0.96). This study highlights the capabilities of using medium-fine resolution hyperspectral imagery to identify fractional cover type of localized coral communities and lays the groundwork for future spaceborne hyperspectral monitoring of global coral communities.\u003c/p\u003e\n\n\n\u003cfigure\u003e\n\u003cp\u003e\n\u003ciframe title=\"Atticus Cummings: 2024 SARP East Ocean Remote Sensing Group\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/ZWDp7MnCbdk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\n\u003c/figure\u003e\n\n\u003cp\u003e\u003cstrong\u003eAtticus Cummings, University of Los Angeles, California\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCalifornia’s giant kelp forests serve as a major foundation for the region’s rich marine biodiversity and provide recreational and economic value to the State of California. With the rising frequency of marine heatwaves and extreme weather onset by climate change, it has become increasingly important to study these vital ecosystems. Kelp forests are highly dynamic, changing across several timescales; seasonally due to nutrient concentrations, waves, and predator populations, weekly with typical growth and decay, and hourly with the tides and currents. Previous remote sensing of kelp canopies has relied on Landsat imagery taken with a eight-day interval, limiting the ability to quantify more rapid changes. This project aims to address uncertainty in kelp canopy detection using the Harmonized Landsat and Sentinel-2 (HLS) dataset’s zero to five-day revisit period. A random forest classifier was used to identify pixels that contain kelp, on which Multiple Endmember Spectral Mixture Analysis (MESMA) was then run to quantify intrapixel kelp density. Processed multispectral satellite images taken within 3 days of one another were paired for comparison. The relationship between fluctuations in kelp canopy density with tides and currents was assessed using in situ data from an acoustic doppler current profiler (ADCP) at the Santa Barbara Long Term Ecological Research site (LTER) and a NOAA tidal buoy. Preliminary results show that current and tidal trends cannot be accurately correlated with canopy detection due to other sources of error. We found that under cloud-free conditions, canopy detection between paired images varied on average by 42%. Standardized image processing suggests that this uncertainty is not created within the image processing step, but likely arises due to exterior factors such as sensor signal noise, atmospheric conditions, and sea state. Ultimately, these errors could lead to misinterpretation of remotely sensed kelp ecosystems, highlighting the need for further research to identify and account for uncertainties in remote sensing of kelp canopies.\u003c/p\u003e\n\n\n\u003cfigure\u003e\n\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Jasmine Sirvent: 2024 SARP East Ocean Remote Sensing Group\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/ytej6qa1gww?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\n\u003c/figure\u003e\n\n\u003cp\u003e\u003cstrong\u003eJasmine Sirvent, Fresno Pacific University\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOcean color remote sensing enables researchers to assess the quantity and physiology of life in the ocean, which is imperative to understanding ecosystem health and formulating accurate predictions. However, without proper methods to analyze hyperspectral data, correlations between spectral reflectance and physiological traits cannot be accurately derived. In this study, I explored different methods—single variable regression, partial least squares regressions (PLSR), and derivatives—in analyzing in situ Macrocystis pyrifera (giant kelp) off the coast of Santa Barbara, California in order to predict pigment concentrations from AVIRIS hyperspectral reflectance. With derivatives as a spectral diagnostic tool, there is evidence suggesting high versus low pigment concentrations could be diagnosed; however, the fluctuations were within 10 nm of resolution, thus AVIRIS would be unable to reliably detect them. Exploring a different method, I plotted in situ pigment measurements — chlorophyll a, fucoxanthin, and the ratio of fucoxanthin to chlorophyll a—against hyperspectral reflectance that was resampled to AVIRIS bands. PLSR proved to be a more successful model because of its hyperdimensional analysis capabilities in accounting for multiple wavelength bands, reaching R2 values of 0.67. Using this information, I constructed a model that predicts kelp pigments from simulated AVIRIS reflectance using a spatial time series of laboratory spectral measurements and photosynthetic pigment concentrations. These results have implications, not only for kelp, but many other photosynthetic organisms detectable by hyperspectral airborne or satellite sensors. With these findings, airborne optical data could possibly predict a plethora of other biogeochemical traits. Potentially, this research would permit scientists to acquire data analogous to in situ measurements about floating matters that cannot financially and pragmatically be accessed by anything other than a remote sensor.\u003c/p\u003e\n\n\n\u003cfigure\u003e\n\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Isabelle Cobb: 2024 SARP East Ocean Remote Sensing Group\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/rIP7xSQKq8o?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\n\u003c/figure\u003e\n\n\u003cp\u003e\u003cstrong\u003eIsabelle Cobb, California Polytechnic State University- San Luis Obispo\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSea surface height anomalies (SSHa)–variations in sea surface height from climatological averages–occur on seasonal timescales due to coastal upwelling and El Niño-Southern Oscillation (ENSO) cycles. These anomalies are heightened when upwelling plumes bring cold, nutrient-rich water to the surface, and are particularly strong along continental shelves in the Northern South China Sea (NSCS). This linkage between SSHa and nutrient availability has interesting implications for changing chlorophyll-a (chl-a) concentrations, a prominent indicator of phytoplankton biomass that is essential to the health of marine ecosystems. Here, we evaluate the long-term (15 years) relationship between SSHa and chl-a, in both satellite remote sensing data and in situ measurements. Level 3 SSHa data from Jason 1/2/3 satellites and chl-a data from MODIS Aqua were acquired and binned to monthly resolution. We found a significant inverse correlation between SSHa and chl-a during upwelling months in both the remote sensing (Spearman’s R=-0.57) and in situ data, with higher resolution in situ data from ORAS4 (an assimilation of buoy observations from 2003-2017) showing stronger correlations (Spearman’s R=-0.75). In addition, the data reveal that the magnitude of SSH increases with time during instances of high correlation, possibly indicating a trend of increased SSH associated with reduced seasonal chl-a concentrations. Thus, this relationship may inform future work predicting nutrient availability and threats to marine ecosystems as climate change continues to affect coastal sea surface heights.\u003c/p\u003e\n\n\n\u003cfigure\u003e\n\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Alyssa Tou: 2024 SARP East Ocean Remote Sensing Group\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/XKYpm0Wv3TM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\n\u003c/figure\u003e\n\n\u003cp\u003e\u003cstrong\u003eAlyssa Tou, University of Washington\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMarine heat waves (MHW) have been increasing in frequency, duration and intensity, giving them substantial potential to influence ecosystems. Do these MHWs sufficiently enhance coastal precipitation such that plant growth is impacted? Recently, the Northeast Pacific experienced a long, intense MHW in 2014/2015, and another short, less intense MHW in 2019/2020. Here we investigate how the intensity and duration of MHWs influence the intensity and seasonal cycle of three different land cover types (‘grass’, ‘trees’, and a combination of both ‘combined’’) to analyze plant phenology trends in Big Sur, California. We hypothesize that longer intense MHWs decrease the ocean’s evaporative capacity, decreasing fog, thus lowering plant productivity, as measured by Normalized Difference Vegetation Index (NDVI). Sea surface temperature (SST) and NDVI data were collected from the NOAA Coral Reef Watch, and NASA MODIS/Terra Vegetation Indices 16-Day L3 Global 250m products respectively. Preliminary results show no correlation (R2=0.02) between SSTa and combined NDVI values and no correlation (R2=0.01) between SST and NDVI. This suggests that years with anomalously high SST do not significantly impact plant phenology. During the intense and long 2014/2015 MHW, peak NDVI values for ‘grass’ and ‘combined’ pixels were 2.0 and 1.7 standard deviations above the climatological average, while the shorter 2019/2020 MHW saw higher peaks of 3.2 and 2.4 standard deviations. However, the ‘grass’, ‘tree’ and ‘combined’ NDVI anomalies were statistically insignificant during both MHWs, showing that although NDVI appeared to increase during the shorter and less intense MHW, these values may be attributed to other factors. The data qualitatively suggest that MHW’s don’t impact the peak NDVI date, but more data at higher temporal resolution are necessary. Further research will involve analyzing fog indices and exploring confounding variables impacting NDVI, such as plant physiology, anthropogenic disturbance, and wildfires. In addition, it’s important to understand to what extent changes in NDVI are attributed to the driving factors of MHWs or the MHWs themselves. Ultimately, mechanistically understanding the impacts MHW intensity and duration have on terrestrial ecosystems will better inform coastal community resilience.\u003c/p\u003e\n\n\n\n\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"\"\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eShare\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\u003c/div\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eDetails\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\t\t\u003c/div\u003e\n\t\n\t\u003c/div\u003e\u003cdiv id=\"\"\u003e\n\t\t\t\t\u003cp\u003e\u003ch2\u003eExplore More\u003c/h2\u003e\u003c/p\u003e\n\t\t\t\u003c/div\u003e\u003c/section\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2024-11-22T17:33:44-05:00",
  "modifiedTime": "2024-11-22T18:50:01-05:00"
}
