{
  "id": "c4d064be-2117-4c57-ac02-b40fa9ebd96d",
  "title": "NASA Awards Launch Services Contract for SpaceX Starship",
  "link": "https://www.nasa.gov/news-release/nasa-awards-launch-services-contract-for-spacex-starship/",
  "description": "NASA has awarded SpaceX of Starbase, Texas, a modification under the NASA Launch Services (NLS) II contract to add Starship to their existing Falcon 9 and Falcon Heavy launch service offerings. The NLS II contracts provide a broad range of commercial launch services for NASA’s planetary, Earth-observing, exploration, and scientific satellites. These high-priority, low and […]",
  "author": "Abbey A. Donaldson",
  "published": "Fri, 28 Mar 2025 21:26:15 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "NASA Directorates",
    "Space Operations Mission Directorate"
  ],
  "byline": "",
  "length": 1830,
  "excerpt": "NASA has awarded SpaceX of Starbase, Texas, a modification under the NASA Launch Services (NLS) II contract to add Starship to their existing Falcon 9 and",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Abbey A. DonaldsonMar 28, 2025 NASA has awarded SpaceX of Starbase, Texas, a modification under the NASA Launch Services (NLS) II contract to add Starship to their existing Falcon 9 and Falcon Heavy launch service offerings. The NLS II contracts provide a broad range of commercial launch services for NASA’s planetary, Earth-observing, exploration, and scientific satellites. These high-priority, low and medium risk tolerant missions have full NASA technical oversight and mission assurance, resulting in the highest probability of launch success. The NLS II contracts are multiple award, indefinite-delivery/indefinite-quantity, with an ordering period through June 2030 and an overall period of performance through December 2032. The contracts include an on-ramp provision that provides an opportunity annually for new launch service providers to add their launch service on an NLS II contract and compete for future missions and allows existing contractors to introduce launch services not currently on their NLS II contracts. The contracts support the goals and objectives of the agency’s Science Mission Directorate, Space Operations Mission Directorate, Explorations Systems Development Mission Directorate, and the Space Technology Mission Directorate. Under the contracts, NASA also can provide launch services to other federal government agencies. NASA’s Launch Services Program Office at the agency’s Kennedy Space Center in Florida manages the NLS II contracts. For more information about NASA and agency programs, visit: https://www.nasa.gov -end- Tiernan Doyle / Joshua FinchHeadquarters, Washington202-358-1600 / 202-358-1100tiernan.doyle@.nasa.gov / joshua.a.finch@nasa.gov Patti BiellingKennedy Space Center, Florida321-501-7575patricia.a.bielling@nasa.gov Share Details",
  "image": "https://www.nasa.gov/wp-content/uploads/2024/04/nasa_meatball_4.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-841993\"\u003e\u003csection\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://secure.gravatar.com/avatar/5ca6221e3fa9ca43b8136f54c0e1cce6?s=300\u0026amp;d=blank\u0026amp;r=g\" alt=\"The headshot image of Abbey A. Donaldson\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch3\u003eAbbey A. Donaldson\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eMar 28, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cp\u003eNASA has awarded SpaceX of Starbase, Texas, a modification under the NASA Launch Services (NLS) II contract to add Starship to their existing Falcon 9 and Falcon Heavy launch service offerings.\u003c/p\u003e\n\u003cp\u003eThe NLS II contracts provide a broad range of commercial launch services for NASA’s planetary, Earth-observing, exploration, and scientific satellites. These high-priority, low and medium risk tolerant missions have full NASA technical oversight and mission assurance, resulting in the highest probability of launch success.\u003c/p\u003e\n\u003cp\u003eThe NLS II contracts are multiple award, indefinite-delivery/indefinite-quantity, with an ordering period through June 2030 and an overall period of performance through December 2032. The contracts include an on-ramp provision that provides an opportunity annually for new launch service providers to add their launch service on an NLS II contract and compete for future missions and allows existing contractors to introduce launch services not currently on their NLS II contracts.\u003c/p\u003e\n\u003cp\u003eThe contracts support the goals and objectives of the agency’s \u003ca href=\"https://science.nasa.gov/\" rel=\"noopener\"\u003eScience Mission Directorate\u003c/a\u003e, \u003ca href=\"https://www.nasa.gov/directorates/space-operations/\"\u003eSpace Operations Mission Directorate\u003c/a\u003e, \u003ca href=\"https://www.nasa.gov/exploration-systems-development-mission-directorate/\"\u003eExplorations Systems Development Mission Directorate\u003c/a\u003e, and the \u003ca href=\"https://www.nasa.gov/directorates/spacetech/home/index.html\"\u003eSpace Technology Mission Directorate\u003c/a\u003e. Under the contracts, NASA also can provide launch services to other federal government agencies.\u003c/p\u003e\n\u003cp\u003eNASA’s Launch Services Program Office at the agency’s Kennedy Space Center in Florida manages the NLS II contracts. For more information about NASA and agency programs, visit:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.nasa.gov\"\u003e\u003cstrong\u003ehttps://www.nasa.gov\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e-end-\u003c/p\u003e\n\u003cp\u003eTiernan Doyle / Joshua Finch\u003cbr/\u003eHeadquarters, Washington\u003cbr/\u003e202-358-1600 / 202-358-1100\u003cbr/\u003e\u003ca href=\"mailto:tiernan.doyle@.nasa.gov\"\u003etiernan.doyle@.nasa.gov\u003c/a\u003e / \u003ca href=\"mailto:joshua.a.finch@nasa.gov\"\u003ejoshua.a.finch@nasa.gov\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePatti Bielling\u003cbr/\u003eKennedy Space Center, Florida\u003cbr/\u003e321-501-7575\u003cbr/\u003e\u003ca href=\"mailto:patricia.a.bielling@nasa.gov\"\u003epatricia.a.bielling@nasa.gov\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"\"\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eShare\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\u003c/div\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eDetails\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\t\t\u003c/div\u003e\n\t\n\t\u003c/div\u003e\u003c/section\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
