{
  "id": "ed6d4c28-ae4c-4ad4-b92d-350f6afe06de",
  "title": "2 Earth weather satellites accidentally spy on Venus",
  "link": "https://www.space.com/astronomy/venus/2-earth-weather-satellites-accidentally-spy-on-venus",
  "description": "Japan's Himawari-8 and Himawari-9 satellites, designed to study weather here on Earth, have also been quietly collecting valuable data on Venus for nearly a decade, scientists recently discovered.",
  "author": "Victoria Corless",
  "published": "Wed, 23 Jul 2025 21:00:00 +0000",
  "source": "https://www.space.com/feeds/all",
  "categories": [
    "Venus",
    "Astronomy",
    "Solar System"
  ],
  "byline": "Victoria Corless",
  "length": 6583,
  "excerpt": "\"We believe that continuing such activities will further expand our horizon in the field of planetary science.\"",
  "siteName": "Space",
  "favicon": "https://vanilla.futurecdn.net/space/1339987/apple-touch-icon.png",
  "text": "Japan's Akatsuki spacecraft captured this false-color image of Venus' dayside on March 30, 2018. (Image credit: JAXA/PLANET-C Project Team) In a serendipitous turn of events, scientists have discovered that Japan's Himawari-8 and Himawari-9 weather satellites, designed to monitor storms and climate patterns here on Earth, have also been quietly collecting valuable data on Venus for nearly a decade.Although meteorological satellites orbit Earth and scan the skies around it, their imaging range extends into space, allowing them to occasionally catch glimpses of other celestial neighbors, such as the moon, stars and other planets in our solar system.\"This started by chance,\" explained Gaku Nishiyama, a postdoctoral researcher at the German Aerospace Center (known by its German acronym, DLR) in Berlin in an interview with Space.com. \"One of my best friends, who has a Ph.D. in astronomy and is a certified weather forecaster in Japan, found lunar images in Himawari-8/9 datasets and asked me to look.\"At the time, Nishiyama was focused on lunar science, and he began using the Himawari-8 and Himawari-9 weather satellites — which launched in 2014 and 2016, respectively — in an unconventional way: as space telescopes. By analyzing the light the moon emitted in infrared wavelengths, he and his team were able to test the satellites' ability to capture temperature variations across the moon's surface as well as determine its physical properties.\"During this lunar work, we also found other solar-system bodies, namely Mercury, Venus, Mars, and Jupiter, in the datasets. We were interested in what phenomena were recorded there,\" Nishiyama explained.To spot Venus in the Himawari data, the team used the precise imaging schedule and position of the satellites. \"Because we know almost exactly when and where Himawari is looking,\" Nishiyama said, \"we can roughly predict where Venus will appear in each image. From there, we isolate the pixels corresponding to Venus.\"Nishiyama and his colleagues were analyzing subtle changes in the intensity of light Venus was emitting. Such data allows scientists to track how a celestial body's brightness varies over time, which in turn reveals details about it.Breaking space news, the latest updates on rocket launches, skywatching events and more!The Himawari satellites ended up capturing one of the longest multiband infrared records of Venus ever assembled. This unique dataset revealed subtle, year-to-year changes in the planet's cloud-top temperatures, as well as signs of phenomena called thermal tides and Rossby waves.\"Thermal tides are global-scale gravity waves excited by solar heating in the cloud layers of Venus,\" Nishiyama explained. \"When the atmosphere is stratified, like on Venus (i.e., a warm upper layer atop a cold lower layer), a restoring force acts upon heated air parcels, and the resulting vertical oscillations propagate as gravity waves. Rossby waves [also seen in Earth's oceans and atmosphere] are also a global-scale wave caused by variations in the Coriolis force with latitude.\"Both types of waves are crucial for transporting heat and momentum through Venus' atmosphere,\" he continued. \"Tracking how these waves change over time helps us better understand the planet's atmospheric dynamics, especially since other data, like wind speeds and cloud reflectivity, have shown variations that play out over several years.\"Specifically, we succeeded in detecting variations in temperature fields caused by Rossby waves at various altitudes for the first time, which is important to understanding the physics behind the years-scale variation of the Venus atmosphere,\" said Nishiyama.These new observations help fill a crucial gap in our understanding of Venus' dynamic upper atmosphere and open a new frontier in planetary monitoring from Earth orbit. The team's findings also challenge the calibration of key instruments on dedicated Venus spacecraft, like the LIR camera aboard Japan's Akatsuki Venus orbiter.\"To understand the atmospheric structure of Venus, determination of temperature at infrared wavelengths is crucial,\" said Nishiyama. \"LIR was expected to provide accurate temperature information; however, LIR has faced several issues in instrument calibration.\"Comparing images taken by LIR and Himawari satellites at the same time and under identical geometric conditions, the team found discrepancies and suspects that LIR may be underestimating Venus' radiance. \"Our comparison between Himawari and LIR sheds light on how to recalibrate the LIR data, leading to a more accurate understanding of Venus' atmosphere,\" Nishiyama said.The team is also hopeful that Himawari will complement data from missions such as Akatsuki and BepiColombo, a joint Japanese-European mission that's currently establishing itself in orbit around Mercury. Nishiyama explained that, compared to Akatsuki, Himawari covers a wider range of infrared wavelengths and provides information across various altitudes. In contrast to BepiColombo, which observed Venus only during a flyby, Himawari can monitor the planet over a much longer timescale.\"Earth-observing satellites [like Himawari] are generally calibrated so accurately that they can provide reference data for instrument calibrations in future planetary missions,\" he said. \"Unlike meteorological observation on the Earth, there are often time gaps between planetary missions. Since meteorological satellites continue observation from space for decadal timescales, these satellites can supplement data even when there are no planetary exploration spacecraft orbiting around planets.\"Nishiyama said that the team has already archived other solar-system bodies, which are now being analyzed. \"We believe that continuing such activities will further expand our horizon in the field of planetary science,\" he concluded.The team reported their findings last month in the journal Earth, Planets and Space. Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. A chemist turned science writer, Victoria Corless completed her Ph.D. in organic synthesis at the University of Toronto and, ever the cliché, realized lab work was not something she wanted to do for the rest of her days. After dabbling in science writing and a brief stint as a medical writer, Victoria joined Wiley’s Advanced Science News where she works as an editor and writer. On the side, she freelances for various outlets, including Research2Reality and Chemistry World.",
  "image": "https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-widget-type=\"contentparsed\" id=\"content\"\u003e\n\u003csection\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cpicture data-new-v2-image=\"true\"\u003e\n\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-1820-80.jpg.webp 1920w, https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-1200-80.jpg.webp 1200w, https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-320-80.jpg.webp 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\"/\u003e\n\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4.jpg\" alt=\"An image of Venus, with brown and gray swirling clouds on its surface\" srcset=\"https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-1820-80.jpg 1920w, https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-1200-80.jpg 1200w, https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4-320-80.jpg 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\" data-new-v2-image=\"true\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/otFCeKHpqqqgKdg9WhzUR4.jpg\" data-pin-nopin=\"true\" fetchpriority=\"high\"/\u003e\n\u003c/picture\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003e\n\u003cspan\u003eJapan\u0026#39;s Akatsuki spacecraft captured this false-color image of Venus\u0026#39; dayside on March 30, 2018.\u003c/span\u003e\n\u003cspan\u003e(Image credit: JAXA/PLANET-C Project Team)\u003c/span\u003e\n\u003c/figcaption\u003e\n\u003c/div\u003e\n\n\u003cdiv id=\"article-body\"\u003e\n\u003cp\u003eIn a serendipitous turn of events, scientists have discovered that Japan\u0026#39;s Himawari-8 and Himawari-9 weather satellites, designed to monitor storms and climate patterns here on Earth, have also been quietly collecting valuable data on Venus for nearly a decade.\u003c/p\u003e\u003cp\u003eAlthough meteorological satellites orbit \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/54-earth-history-composition-and-atmosphere.html\" data-before-rewrite-localise=\"https://www.space.com/54-earth-history-composition-and-atmosphere.html\"\u003eEarth\u003c/a\u003e and scan the skies around it, their imaging range extends into space, allowing them to occasionally catch glimpses of other celestial neighbors, such as \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/55-earths-moon-formation-composition-and-orbit.html\" data-before-rewrite-localise=\"https://www.space.com/55-earths-moon-formation-composition-and-orbit.html\"\u003ethe moon\u003c/a\u003e, stars and other planets in our \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/16080-solar-system-planets.html\" data-before-rewrite-localise=\"https://www.space.com/16080-solar-system-planets.html\"\u003esolar system\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u0026#34;This started by chance,\u0026#34; explained Gaku Nishiyama, a postdoctoral researcher at the German Aerospace Center (known by its German acronym, DLR) in Berlin in an interview with Space.com. \u0026#34;One of my best friends, who has a Ph.D. in astronomy and is a certified weather forecaster in Japan, found lunar images in Himawari-8/9 datasets and asked me to look.\u0026#34;\u003c/p\u003e\u003cp\u003eAt the time, Nishiyama was focused on lunar science, and he began using the Himawari-8 and Himawari-9 weather satellites — which launched in 2014 and 2016, respectively — in an unconventional way: \u003ca data-analytics-id=\"inline-link\" href=\"https://earth-planets-space.springeropen.com/articles/10.1186/s40623-022-01662-x\" target=\"_blank\" data-url=\"https://earth-planets-space.springeropen.com/articles/10.1186/s40623-022-01662-x\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003eas space telescopes\u003c/a\u003e. By analyzing the light the moon emitted in infrared wavelengths, he and his team were able to test the satellites\u0026#39; ability to capture temperature variations across the moon\u0026#39;s surface as well as determine its physical properties.\u003c/p\u003e\u003cp\u003e\u0026#34;During this lunar work, we also found other solar-system bodies, namely Mercury, \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/44-venus-second-planet-from-the-sun-brightest-planet-in-solar-system.html\" data-before-rewrite-localise=\"https://www.space.com/44-venus-second-planet-from-the-sun-brightest-planet-in-solar-system.html\"\u003eVenus\u003c/a\u003e, Mars, and \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/7-jupiter-largest-planet-solar-system.html\" data-before-rewrite-localise=\"https://www.space.com/7-jupiter-largest-planet-solar-system.html\"\u003eJupiter\u003c/a\u003e, in the datasets. We were interested in what phenomena were recorded there,\u0026#34; Nishiyama explained.\u003c/p\u003e\u003cp\u003eTo spot Venus in the Himawari data, the team used the precise imaging schedule and position of the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/24839-satellites.html\" data-before-rewrite-localise=\"https://www.space.com/24839-satellites.html\"\u003esatellites\u003c/a\u003e. \u0026#34;Because we know almost exactly when and where Himawari is looking,\u0026#34; Nishiyama said, \u0026#34;we can roughly predict where Venus will appear in each image. From there, we isolate the pixels corresponding to Venus.\u0026#34;\u003c/p\u003e\u003cp\u003eNishiyama and his colleagues were analyzing subtle changes in the intensity of light Venus was emitting. Such data allows scientists to track how a celestial body\u0026#39;s brightness varies over time, which in turn reveals details about it.\u003c/p\u003e\u003cdiv data-hydrate=\"true\" id=\"slice-container-newsletterForm-articleInbodyContent-NTkTw4zEWmyM3VPufcWbtf\"\u003e\u003csection\u003e\u003cp\u003eBreaking space news, the latest updates on rocket launches, skywatching events and more!\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e\u003cp\u003eThe Himawari satellites ended up capturing one of the longest multiband infrared records of Venus ever assembled. This unique dataset revealed subtle, year-to-year changes in the planet\u0026#39;s cloud-top temperatures, as well as signs of phenomena called thermal tides and Rossby waves.\u003c/p\u003e\u003cp\u003e\u0026#34;Thermal tides are global-scale \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/31879-gravitational-waves-vs-gravity-waves.html\" data-before-rewrite-localise=\"https://www.space.com/31879-gravitational-waves-vs-gravity-waves.html\"\u003egravity waves\u003c/a\u003e excited by solar heating in the cloud layers of Venus,\u0026#34; Nishiyama explained. \u0026#34;When the atmosphere is stratified, like on Venus (i.e., a warm upper layer atop a cold lower layer), a restoring force acts upon heated air parcels, and the resulting vertical oscillations propagate as gravity waves. Rossby waves [also seen in Earth\u0026#39;s oceans and atmosphere] are also a global-scale wave caused by variations in the Coriolis force with latitude.\u003c/p\u003e\u003cp\u003e\u0026#34;Both types of waves are crucial for transporting heat and momentum through \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/18527-venus-atmosphere.html\" data-before-rewrite-localise=\"https://www.space.com/18527-venus-atmosphere.html\"\u003eVenus\u0026#39; atmosphere\u003c/a\u003e,\u0026#34; he continued. \u0026#34;Tracking how these waves change over time helps us better understand the planet\u0026#39;s atmospheric dynamics, especially since other data, like wind speeds and cloud reflectivity, have shown variations that play out over several years.\u003c/p\u003e\u003cp\u003e\u0026#34;Specifically, we succeeded in detecting variations in temperature fields caused by Rossby waves at various altitudes for the first time, which is important to understanding the physics behind the years-scale variation of the Venus atmosphere,\u0026#34; said Nishiyama.\u003c/p\u003e\u003cp\u003eThese new observations help fill a crucial gap in our understanding of Venus\u0026#39; dynamic upper atmosphere and open a new frontier in planetary monitoring from Earth orbit. The team\u0026#39;s findings also challenge the calibration of key instruments on dedicated Venus spacecraft, like the LIR camera aboard Japan\u0026#39;s \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/jaxa-loses-contact-akatsuki-venus-probe\" data-before-rewrite-localise=\"https://www.space.com/jaxa-loses-contact-akatsuki-venus-probe\"\u003eAkatsuki\u003c/a\u003e Venus orbiter.\u003c/p\u003e\u003cp\u003e\u0026#34;To understand the atmospheric structure of Venus, determination of temperature at infrared wavelengths is crucial,\u0026#34; said Nishiyama. \u0026#34;LIR was expected to provide accurate temperature information; however, LIR has faced several issues in instrument calibration.\u0026#34;\u003c/p\u003e\u003cp\u003eComparing images taken by LIR and Himawari satellites at the same time and under identical geometric conditions, the team found discrepancies and suspects that LIR may be underestimating Venus\u0026#39; radiance. \u0026#34;Our comparison between Himawari and LIR sheds light on how to recalibrate the LIR data, leading to a more accurate understanding of Venus\u0026#39; atmosphere,\u0026#34; Nishiyama said.\u003c/p\u003e\u003cp\u003eThe team is also hopeful that Himawari will complement data from missions such as Akatsuki and \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/35671-bepicolombo-facts.html\" data-before-rewrite-localise=\"https://www.space.com/35671-bepicolombo-facts.html\"\u003eBepiColombo\u003c/a\u003e, a joint Japanese-European mission that\u0026#39;s currently establishing itself in orbit around Mercury. Nishiyama explained that, compared to Akatsuki, Himawari covers a wider range of infrared wavelengths and provides information across various altitudes. In contrast to BepiColombo, which observed Venus only during a flyby, Himawari can monitor the planet over a much longer timescale.\u003c/p\u003e\u003cp\u003e\u0026#34;Earth-observing satellites [like Himawari] are generally calibrated so accurately that they can provide reference data for instrument calibrations in future planetary missions,\u0026#34; he said. \u0026#34;Unlike meteorological observation on the Earth, there are often time gaps between planetary missions. Since meteorological satellites continue observation from space for decadal timescales, these satellites can supplement data even when there are no planetary exploration spacecraft orbiting around planets.\u0026#34;\u003c/p\u003e\u003cp\u003eNishiyama said that the team has already archived other solar-system bodies, which are now being analyzed. \u0026#34;We believe that continuing such activities will further expand our horizon in the field of planetary science,\u0026#34; he concluded.\u003c/p\u003e\u003cp\u003eThe team reported \u003ca data-analytics-id=\"inline-link\" href=\"https://earth-planets-space.springeropen.com/articles/10.1186/s40623-025-02223-8\" target=\"_blank\" data-url=\"https://earth-planets-space.springeropen.com/articles/10.1186/s40623-025-02223-8\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003etheir findings\u003c/a\u003e last month in the journal Earth, Planets and Space.\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://forums.space.com/\"\u003eJoin our Space Forums\u003c/a\u003e to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: \u003ca href=\"mailto:community@space.com\"\u003ecommunity@space.com.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"slice-container-authorBio-NTkTw4zEWmyM3VPufcWbtf\"\u003e\u003cp\u003eA chemist turned science writer, Victoria Corless completed her Ph.D. in organic synthesis at the University of Toronto and, ever the cliché, realized lab work was not something she wanted to do for the rest of her days. After dabbling in science writing and a brief stint as a medical writer, Victoria joined Wiley’s Advanced Science News\u003cem\u003e \u003c/em\u003ewhere she works as an editor and writer. On the side, she freelances for various outlets, including Research2Reality and Chemistry World.\u003c/p\u003e\u003c/div\u003e\n\n\u003c/section\u003e\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-07-23T21:00:00Z",
  "modifiedTime": null
}
