{
  "id": "fe836b4e-f9ed-430d-91fc-95bf7b90b184",
  "title": "NASA Awards Delivery Order for NOAA’s Space Weather Program",
  "link": "https://www.nasa.gov/news-release/nasa-awards-delivery-order-for-noaas-space-weather-program/",
  "description": "NASA, on behalf of the National Oceanic and Atmospheric Administration (NOAA), has awarded a delivery order to BAE Systems Space \u0026 Mission Systems Inc. of Boulder, Colorado, to build spacecraft for the Lagrange 1 Series project as a part of NOAA’s Space Weather Next program. The award made under the Rapid Spacecraft Acquisition IV contract, […]",
  "author": "Tiernan P. Doyle",
  "published": "Fri, 21 Feb 2025 21:32:33 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Space Weather",
    "Heliophysics",
    "Joint Agency Satellite Division",
    "NOAA (National Oceanic and Atmospheric Administration)",
    "Science \u0026 Research",
    "Science Mission Directorate"
  ],
  "byline": "",
  "length": 2677,
  "excerpt": "NASA, on behalf of the National Oceanic and Atmospheric Administration (NOAA), has awarded a delivery order to BAE Systems Space \u0026 Mission Systems Inc. of",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "NASA, on behalf of the National Oceanic and Atmospheric Administration (NOAA), has awarded a delivery order to BAE Systems Space \u0026 Mission Systems Inc. of Boulder, Colorado, to build spacecraft for the Lagrange 1 Series project as a part of NOAA’s Space Weather Next program. The award made under the Rapid Spacecraft Acquisition IV contract, has a total value of approximately $230.6 million with the period of performance running from February 2025 to February 2035. The work will take place at the awardee’s facility in Boulder. The firm-fixed-price delivery order covers all phases of the Lagrange 1 Series project operations including developing up to two spacecraft, instrument integration, satellite-level testing, training and support for the spacecraft flight operations team, and mission operations support. Rapid IV contracts serve as a fast and flexible means for the government to acquire spacecraft and related components, equipment, and services in support of NASA missions and other federal government agencies. The Space Weather Next program will maintain and extend space weather observations from various orbitally stable points such as Lagrange 1, which is about a million miles from Earth. The first Space Weather Next Lagrange 1 Series launch, planned in 2029, will be the first observatory under the program and will provide continuity of real-time coronal imagery and upstream solar wind measurements. Space Weather Next will provide uninterrupted data continuity when NOAA’s Space Weather Follow On Lagrange 1 mission comes to its end of operations. Observations of the Sun and the near-Earth space environment are important to protecting our technological infrastructure both on the ground and in space. The spacecraft will provide critical data to NOAA’s Space Weather Prediction Center which issues forecasts, warnings and alerts that help mitigate space weather impacts, including electric power outages and interruption to communications and navigation systems. NASA and NOAA oversee the development, launch, testing, and operation of all the satellites in the Lagrange 1 Series project. NOAA is the program owner providing the requirements and funding along with managing the program, operations, data products, and dissemination to users. NASA and its commercial partners develop and build the instruments, spacecraft, and provide launch services on behalf of NOAA. For information about NASA and agency programs, visit: https://www.nasa.gov -end- Karen Fox/Liz VlockHeadquarters, Washington202-358-1600karen.c.fox@nasa.gov / elizabeth.a.vlock@nasa.gov Jeremy EggersGoddard Space Flight Center, Greenbelt, Md.757-824-2958jeremy.l.eggers@nasa.gov",
  "image": "https://www.nasa.gov/wp-content/uploads/2024/08/meatball-w-black-background.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eNASA, on behalf of the National Oceanic and Atmospheric Administration (NOAA), has awarded a delivery order to BAE Systems Space \u0026amp; Mission Systems Inc. of Boulder, Colorado, to build spacecraft for the Lagrange 1 Series project as a part of \u003ca href=\"https://www.nesdis.noaa.gov/our-satellites/future-programs/space-weather-next\" rel=\"noopener\"\u003eNOAA’s Space Weather Next program\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe award made under the Rapid Spacecraft Acquisition IV contract, has a total value of approximately $230.6 million with the period of performance running from February 2025 to February 2035. The work will take place at the awardee’s facility in Boulder.\u003c/p\u003e\n\u003cp\u003eThe firm-fixed-price delivery order covers all phases of the Lagrange 1 Series project operations including developing up to two spacecraft, instrument integration, satellite-level testing, training and support for the spacecraft flight operations team, and mission operations support. Rapid IV contracts serve as a fast and flexible means for the government to acquire spacecraft and related components, equipment, and services in support of NASA missions and other federal government agencies.\u003c/p\u003e\n\u003cp\u003eThe Space Weather Next program will maintain and extend space weather observations from various orbitally stable points such as Lagrange 1, which is about a million miles from Earth. The first Space Weather Next Lagrange 1 Series launch, planned in 2029, will be the first observatory under the program and will provide continuity of real-time coronal imagery and upstream solar wind measurements. Space Weather Next will provide uninterrupted data continuity when NOAA’s Space Weather Follow On Lagrange 1 mission comes to its end of operations.\u003c/p\u003e\n\u003cp\u003eObservations of the Sun and the near-Earth space environment are important to protecting our technological infrastructure both on the ground and in space. The spacecraft will provide critical data to NOAA’s Space Weather Prediction Center which issues forecasts, warnings and alerts that help mitigate space weather impacts, including electric power outages and interruption to communications and navigation systems.\u003c/p\u003e\n\u003cp\u003eNASA and NOAA oversee the development, launch, testing, and operation of all the satellites in the Lagrange 1 Series project. NOAA is the program owner providing the requirements and funding along with managing the program, operations, data products, and dissemination to users. NASA and its commercial partners develop and build the instruments, spacecraft, and provide launch services on behalf of NOAA.\u003c/p\u003e\n\u003cp\u003eFor information about NASA and agency programs, visit:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.nasa.gov\"\u003e\u003cstrong\u003ehttps://www.nasa.gov\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e-end-\u003c/p\u003e\n\u003cp\u003eKaren Fox/Liz Vlock\u003cbr/\u003eHeadquarters, Washington\u003cbr/\u003e202-358-1600\u003cbr/\u003e\u003ca href=\"mailto:karen.c.fox@nasa.gov\" data-type=\"mailto\" data-id=\"mailto:karen.c.fox@nasa.gov\"\u003ekaren.c.fox@nasa.gov\u003c/a\u003e / \u003ca href=\"mailto:elizabeth.a.vlock@nasa.gov\"\u003eelizabeth.a.vlock@nasa.gov\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eJeremy Eggers\u003cbr/\u003eGoddard Space Flight Center, Greenbelt, Md.\u003cbr/\u003e757-824-2958\u003cbr/\u003e\u003ca href=\"mailto:jeremy.l.eggers@nasa.gov\"\u003ejeremy.l.eggers@nasa.gov\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
