{
  "id": "09c9f58e-809c-435c-a1e5-e6fb9cee2f19",
  "title": "Ferdinand: Rangnick was right about Man Utd open-heart surgery",
  "link": "https://www.soccernews.com/ferdinand-rangnick-was-right-about-man-utd-open-heart-surgery/380114/",
  "description": "Rio Ferdinand conceded that former Manchester United interim boss Ralf Rangnick was right about the club needing open-heart surgery as the Red Devils’ struggles continue. United were beaten 2-0 by Newcastle United on Monday, meaning they will end 2024 in 14th place, their lowest position at the turn of the year in the league since […] The post Ferdinand: Rangnick was right about Man Utd open-heart surgery appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Tue, 31 Dec 2024 21:30:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 3193,
  "excerpt": "Rio Ferdinand conceded that former Manchester United interim boss Ralf Rangnick was right about the club needing open-heart surgery as the Red Devils’ struggles continue. United were beaten 2-0 by Newcastle United on Monday, meaning they will end 2024 in 14th place, their lowest position at the turn of the year in the league since […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Rio Ferdinand conceded that former Manchester United interim boss Ralf Rangnick was right about the club needing open-heart surgery as the Red Devils’ struggles continue. United were beaten 2-0 by Newcastle United on Monday, meaning they will end 2024 in 14th place, their lowest position at the turn of the year in the league since 1989. Monday’s defeat also saw the Red Devils lose three consecutive home league games for the first time since 1979, leaving them just seven points clear of the bottom three. Ruben Amorim has also endured a difficult start to his United tenure, having overseen five defeats in his first eight league matches in charge, which is the worst record for a United manager in 103 years. As Ferdinand dissected the issues that remain at United, his mind was cast back to the tenure of Rangnick – who was interim manager for 29 games in 2021-22. The German coach suggested that the club needed a severe change in direction both on and off the pitch, with Ferdinand agreeing with Rangnick’s comments two years on. Speaking on Rio Ferdinand Presents, he said: “Ralf Rangnick said this needs open-heart surgery, not a quick fix. He wasn’t wrong! “How true are those words ringing now? He was vilified and ridiculed when he said those words. He was so right. “And I think Amorim would sit there behind closed doors and would be thinking the same thing.” Ferdinand also urged Amorim to make United’s stars “uncomfortable” and stick with his tactical approach despite their struggling form heading into the new year. Since Amorim’s first game in charge, only Southampton (seven) have lost more games in all competitions among Premier League clubs than the Red Devils (six). They have also shipped the joint-most goals (21, level with Tottenham), but Ferdinand has insisted that Amorim should stick with his guns to get them out of their current rut. “You look at him, and you go, ‘He still seems quite confident [in the] long-term. He’s not going to change his short-term ideas’. ” And I totally agree,” Ferdinand added. “If he changes and goes back to what they were doing before… it’s not like they were winning! So why would he go back to what the players are more comfortable with? “I think his whole thinking – and I’ve got to agree with him – is that, if this team were trained and understood the system, then I think they have a chance of being able to carry out what he wants. “I don’t think we can expect Amorim to go back to type, to what they were playing before, to try and steady the ship. Because it wasn’t a steady ship anyway. “I genuinely believe he has to keep doing what he’s doing. He said there’s going to be teething problems – maybe not as much as what we’re getting now – but I don’t think he understood what he was getting into. “The scars that a lot of the players have as individuals – and as a team – are so big and so deep, it’s going to take a lot of time to get back.” 14 – In Premier League history, four teams who were 14th at the turn of a year have then been relegated (Newcastle in 2008-09, Burnley in 2009-10, Norwich in 2013-14 and Leeds in 2022-23). Warning. pic.twitter.com/gwNqMLldR4 — OptaJoe (@OptaJoe) December 30, 2024",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eRio Ferdinand conceded that former Manchester United interim boss Ralf Rangnick was right about the club needing open-heart surgery as the Red Devils’ struggles continue. \u003c/p\u003e\n\u003cp\u003eUnited were beaten 2-0 by Newcastle United on Monday, meaning they will end 2024 in 14th place, their lowest position at the turn of the year in the league since 1989. \u003c/p\u003e\n\u003cp\u003eMonday’s defeat also saw the Red Devils lose three consecutive home league games for the first time since 1979, leaving them just seven points clear of the bottom three.\u003c/p\u003e\n\u003cp\u003eRuben Amorim has also endured a difficult start to his United tenure, having overseen five defeats in his first eight league matches in charge, which is the worst record for a United manager in 103 years.\u003c/p\u003e\n\u003cp\u003eAs Ferdinand dissected the issues that remain at United, his mind was cast back to the tenure of Rangnick – who was interim manager for 29 games in 2021-22.\u003c/p\u003e\n\u003cp\u003eThe German coach suggested that the club needed a severe change in direction both on and off the pitch, with Ferdinand agreeing with Rangnick’s comments two years on. \u003c/p\u003e\n\u003cp\u003eSpeaking on Rio Ferdinand Presents, he said: “Ralf Rangnick said this needs open-heart surgery, not a quick fix. He wasn’t wrong! \u003c/p\u003e\n\u003cp\u003e“How true are those words ringing now? He was vilified and ridiculed when he said those words. He was so right.\u003c/p\u003e\n\u003cp\u003e“And I think Amorim would sit there behind closed doors and would be thinking the same thing.”\u003c/p\u003e\n\n\u003cp\u003eFerdinand also urged Amorim to make United’s stars “uncomfortable” and stick with his tactical approach despite their struggling form heading into the new year. \u003c/p\u003e\n\u003cp\u003eSince Amorim’s first game in charge, only Southampton (seven) have lost more games in all competitions among Premier League clubs than the Red Devils (six). \u003c/p\u003e\n\u003cp\u003eThey have also shipped the joint-most goals (21, level with Tottenham), but Ferdinand has insisted that Amorim should stick with his guns to get them out of their current rut.\u003c/p\u003e\n\u003cp\u003e“You look at him, and you go, ‘He still seems quite confident [in the] long-term. He’s not going to change his short-term ideas’. ” And I totally agree,” Ferdinand added. \u003c/p\u003e\n\u003cp\u003e“If he changes and goes back to what they were doing before… it’s not like they were winning! So why would he go back to what the players are more comfortable with?\u003c/p\u003e\n\u003cp\u003e“I think his whole thinking – and I’ve got to agree with him – is that, if this team were trained and understood the system, then I think they have a chance of being able to carry out what he wants. \u003c/p\u003e\n\u003cp\u003e“I don’t think we can expect Amorim to go back to type, to what they were playing before, to try and steady the ship. Because it wasn’t a steady ship anyway.\u003c/p\u003e\n\u003cp\u003e“I genuinely believe he has to keep doing what he’s doing. He said there’s going to be teething problems – maybe not as much as what we’re getting now – but I don’t think he understood what he was getting into. \u003c/p\u003e\n\u003cp\u003e“The scars that a lot of the players have as individuals – and as a team – are so big and so deep, it’s going to take a lot of time to get back.”\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003e14 – In Premier League history, four teams who were 14th at the turn of a year have then been relegated (Newcastle in 2008-09, Burnley in 2009-10, Norwich in 2013-14 and Leeds in 2022-23). Warning. \u003ca href=\"https://t.co/gwNqMLldR4\"\u003epic.twitter.com/gwNqMLldR4\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— OptaJoe (@OptaJoe) \u003ca href=\"https://twitter.com/OptaJoe/status/1873851882290205128?ref_src=twsrc%5Etfw\"\u003eDecember 30, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-31T21:30:00Z",
  "modifiedTime": null
}
