{
  "id": "13ee77e5-768b-4b23-adaa-ebce1cad8893",
  "title": "´More depth would help Miami´, says Mascherano after Messi ruled out of Cincinnati clash",
  "link": "https://www.soccernews.com/more-depth-would-help-miami-says-mascherano-after-messi-ruled-out-of-cincinnati-clash/388028/",
  "description": "Inter Miami head coach Javier Mascherano believes his side could benefit from new additions to the squad. The Herons face FC Cincinnati in their next game, but will be without both Lionel Messi and Jordi Alba for this fixture after they received one-match bans for opting out of the MLS All-Star Game. He could prove […] The post ´More depth would help Miami´, says Mascherano after Messi ruled out of Cincinnati clash appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Fri, 25 Jul 2025 23:55:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 4276,
  "excerpt": "Inter Miami head coach Javier Mascherano believes his side could benefit from new additions to the squad. The Herons face FC Cincinnati in their next game, but will be without both Lionel Messi and Jordi Alba for this fixture after they received one-match bans for opting out of the MLS All-Star Game. He could prove […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Inter Miami head coach Javier Mascherano believes his side could benefit from new additions to the squad. The Herons face FC Cincinnati in their next game, but will be without both Lionel Messi and Jordi Alba for this fixture after they received one-match bans for opting out of the MLS All-Star Game. He could prove a big miss, as Miami lost 3-0 on the road to the Eastern Conference leaders on July 16, but it was their fourth match in 11 days following their return from the Club World Cup, with many players visibly tired in that defeat. Mascherano insisted he focused on the players in the squad, including 34-year-old Fafa Picault, but admitted new signings could certainly help. “Cincinnati were better than us. One of the reasons could be that we were tired, but they were much better than us,” said Mascherano. “I don’t know [if the squad depth is good enough]. If we can bring in some players, it will be better for the team, because we are going to be stronger and more competition in the squad will be good. “But in the end, we are thinking about the players that we have at the moment. Fafa is a player I want to go more minutes to. I can’t find the minutes to give him at the moment, [the minutes] that he deserves. “He is working well, he is a player that when you send on the pitch, he tries to do well. He gives us something different. He has pace, he is good one-v-one, and also has a lot of goals, so maybe from now until the end [of the season] he will deserve a few more minutes.” LUCHOOO Ready for Cincinnati this Saturday. Secure your tickets https://t.co/8jJisu20wk pic.twitter.com/GLnUvU7ftZ — Inter Miami CF (@InterMiamiCF) July 24, 2025 Miami bounced back from the Cincinnati defeat with a 5-1 victory over the New York Red Bulls, with Messi scoring twice in that victory. However, Mascherano believes his side can improve defensively after going a goal down to their opponents in the win. “Yes, I am worried about that [the defence]. We need to improve,” Mascherano added. “We need to be better in defence. I think the team are defending well, but sometimes we are conceding too many goals from set-pieces. We need to improve a lot in set-pieces. “But in the end, as a team, we do not concede too many chances. This is good for us, but we know that if you want to be competitive, not just in MLS but in all the tournaments, you need to be very good in defence.” Cincinnati, meanwhile, have a one-point lead over Nashville SC and the Philadelphia Union at the top of the West, and are seven points clear of Miami. They returned to the summit after a 1-0 win over Real Salt Lake last time out, and have lost just one of their last seven in MLS (W6). PLAYERS TO WATCH Inter Miami – Luis Suarez With Messi unavailable for this Eastern Conference clash, Luis Suarez will need to lead Miami’s attack. The veteran striker has only scored five goals this season but has registered nine assists, reaching the same total as his 2024 campaign in 12 fewer matches. FC Cincinnati – Evander Evander has provided 15 goals and eight assists for Cincinnati this season, including 10 direct goal contributions in his last seven matches. The Brazilian also scored twice in their 3-0 win over Miami at the TQL Stadium. MATCH PREDICTION – INTER MIAMI WIN Miami scored five goals in a match for the fifth time in the last two seasons, and second time in 2025, in their win over the NYRB. Prior to the 2024 season, Miami scored five goals in a match just once (October 24, 2021, vs. Cincinnati). Cincinnati’s 3-0 win over Miami earlier in the month marked the fifth time in the last eight meetings that they have scored three or more goals. Cincinnati have not done so on the road since 2022, which was the only time in five road meetings. At Chase Stadium this season, Miami have six wins, two draws, and two losses in 10 MLS contests. The Herons have a three-match MLS home winning streak dating to May 28 against Montreal. Miami have won just one of their last eight matches against Cincinnati in MLS (D2 L5), though it came in their last home match against them. They face a difficult task to turn that form around without Messi, even if the captain struggled in their previous meeting. OPTA WIN PROBABILITY Inter Miami – 51.5% Draw – 24.7% FC Cincinnati – 23.8%",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eInter Miami head coach Javier Mascherano believes his side could benefit from new additions to the squad.\u003c/p\u003e\n\u003cp\u003eThe Herons face FC Cincinnati in their next game, but will be without both Lionel Messi and Jordi Alba for this fixture after they received one-match bans for opting out of the MLS All-Star Game. \u003c/p\u003e\n\u003cp\u003eHe could prove a big miss, as Miami lost 3-0 on the road to the Eastern Conference leaders on July 16, but it was their fourth match in 11 days following their return from the Club World Cup, with many players visibly tired in that defeat.\u003c/p\u003e\n\u003cp\u003eMascherano insisted he focused on the players in the squad, including 34-year-old Fafa Picault, but admitted new signings could certainly help.\u003c/p\u003e\n\u003cp\u003e“Cincinnati were better than us. One of the reasons could be that we were tired, but they were much better than us,” said Mascherano.\u003c/p\u003e\n\u003cp\u003e“I don’t know [if the squad depth is good enough]. If we can bring in some players, it will be better for the team, because we are going to be stronger and more competition in the squad will be good.\u003c/p\u003e\n\u003cp\u003e“But in the end, we are thinking about the players that we have at the moment. Fafa is a player I want to go more minutes to. I can’t find the minutes to give him at the moment, [the minutes] that he deserves.\u003c/p\u003e\n\u003cp\u003e“He is working well, he is a player that when you send on the pitch, he tries to do well. He gives us something different. He has pace, he is good one-v-one, and also has a lot of goals, so maybe from now until the end [of the season] he will deserve a few more minutes.”\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eLUCHOOO  Ready for Cincinnati this Saturday. Secure your tickets  \u003ca href=\"https://t.co/8jJisu20wk\"\u003ehttps://t.co/8jJisu20wk\u003c/a\u003e \u003ca href=\"https://t.co/GLnUvU7ftZ\"\u003epic.twitter.com/GLnUvU7ftZ\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Inter Miami CF (@InterMiamiCF) \u003ca href=\"https://twitter.com/InterMiamiCF/status/1948400079104057474?ref_src=twsrc%5Etfw\"\u003eJuly 24, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eMiami bounced back from the Cincinnati defeat with a 5-1 victory over the New York Red Bulls, with Messi scoring twice in that victory.\u003c/p\u003e\n\u003cp\u003eHowever, Mascherano believes his side can improve defensively after going a goal down to their opponents in the win.\u003c/p\u003e\n\u003cp\u003e“Yes, I am worried about that [the defence]. We need to improve,” Mascherano added.\u003c/p\u003e\n\u003cp\u003e“We need to be better in defence. I think the team are defending well, but sometimes we are conceding too many goals from set-pieces. We need to improve a lot in set-pieces.\u003c/p\u003e\n\u003cp\u003e“But in the end, as a team, we do not concede too many chances. This is good for us, but we know that if you want to be competitive, not just in MLS but in all the tournaments, you need to be very good in defence.”\u003c/p\u003e\n\u003cp\u003eCincinnati, meanwhile, have a one-point lead over Nashville SC and the Philadelphia Union at the top of the West, and are seven points clear of Miami.\u003c/p\u003e\n\u003cp\u003eThey returned to the summit after a 1-0 win over Real Salt Lake last time out, and have lost just one of their last seven in MLS (W6).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePLAYERS TO WATCH\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInter Miami – Luis Suarez\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWith Messi unavailable for this Eastern Conference clash, Luis Suarez will need to lead Miami’s attack.\u003c/p\u003e\n\u003cp\u003eThe veteran striker has only scored five goals this season but has registered nine assists, reaching the same total as his 2024 campaign in 12 fewer matches. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFC Cincinnati – Evander\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEvander has provided 15 goals and eight assists for Cincinnati this season, including 10 direct goal contributions in his last seven matches.\u003c/p\u003e\n\u003cp\u003eThe Brazilian also scored twice in their 3-0 win over Miami at the TQL Stadium.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMATCH PREDICTION – INTER MIAMI WIN\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMiami scored five goals in a match for the fifth time in the last two seasons, and second time in 2025, in their win over the NYRB. Prior to the 2024 season, Miami scored five goals in a match just once (October 24, 2021, vs. Cincinnati).\u003c/p\u003e\n\u003cp\u003eCincinnati’s 3-0 win over Miami earlier in the month marked the fifth time in the last eight meetings that they have scored three or more goals. Cincinnati have not done so on the road since 2022, which was the only time in five road meetings.\u003c/p\u003e\n\u003cp\u003eAt Chase Stadium this season, Miami have six wins, two draws, and two losses in 10 MLS contests. The Herons have a three-match MLS home winning streak dating to May 28 against Montreal.\u003c/p\u003e\n\u003cp\u003eMiami have won just one of their last eight matches against Cincinnati in MLS (D2 L5), though it came in their last home match against them. They face a difficult task to turn that form around without Messi, even if the captain struggled in their previous meeting.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOPTA WIN PROBABILITY\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInter Miami – 51.5%\u003c/p\u003e\n\u003cp\u003eDraw – 24.7%\u003c/p\u003e\n\u003cp\u003eFC Cincinnati – 23.8%\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-07-25T23:55:00Z",
  "modifiedTime": null
}
