{
  "id": "235bfb61-c99a-4a59-927d-3d96fd2435be",
  "title": "Las Palmas 1-0 Atletico Madrid: Munoz sinks Simeone´s men late on",
  "link": "https://www.soccernews.com/las-palmas-1-0-atletico-madrid-munoz-sinks-simeone-s-men-late-on/384463/",
  "description": "Javi Munoz scored a stoppage-time winner to earn relegation-threatened Las Palmas a shock 1-0 victory over Atletico Madrid, whose slim LaLiga title hopes are now surely over. Diego Simeone’s side remain third in the standings with 63 points, three behind second-placed Real Madrid, who host Athletic Bilbao on Sunday. But they are some 10 points […] The post Las Palmas 1-0 Atletico Madrid: Munoz sinks Simeone´s men late on appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Sat, 19 Apr 2025 23:04:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 2375,
  "excerpt": "Javi Munoz scored a stoppage-time winner to earn relegation-threatened Las Palmas a shock 1-0 victory over Atletico Madrid, whose slim LaLiga title hopes are now surely over. Diego Simeone’s side remain third in the standings with 63 points, three behind second-placed Real Madrid, who host Athletic Bilbao on Sunday. But they are some 10 points […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Javi Munoz scored a stoppage-time winner to earn relegation-threatened Las Palmas a shock 1-0 victory over Atletico Madrid, whose slim LaLiga title hopes are now surely over. Diego Simeone’s side remain third in the standings with 63 points, three behind second-placed Real Madrid, who host Athletic Bilbao on Sunday. But they are some 10 points adrift of leaders Barcelona, who launched a stirring fightback to beat Celta Vigo 4-3 from 3-1 down on Saturday. The surprise victory allowed Las Palmas to climb to 17th place and, at least temporarily, escape the drop zone with 32 points, two ahead of Alaves, who play at Sevilla on Sunday. The match looked to be heading for a dour goalless draw, but three minutes into second-half stoppage time, Atletico failed to deal with a long free-kick from Las Palmas goalkeeper Dinko Horkas. With the ball bouncing awkwardly into the Atleti penalty area, Munoz volleyed into the ground and under goalkeeper Jan Oblak, sparking wild celebrations from the home players. The winner was initially ruled out for offside, but that decision was overturned after a VAR review, much to the relief of the home fans at the Estadio Gran Canaria. 1 – Atlético de Madrid have lost with a goal from Las Palmas in 92:36, the third latest for a rojiblanco’s defeat in the 21st century in @LaLigaEn at 0-0 after September 2005 (94:39, Capdevila with D. de La Coruña) and March 2012 (94:44, Apoño with Zaragoza). Sinker. pic.twitter.com/rkLKHlXyyw — OptaJose (@OptaJose) April 19, 2025 Data debrief: Atleti fall flat Atleti entered Saturday’s game having scored at least one goal in 11 straight matches in LaLiga, though they only won five of those (four draws, two defeats). That was their longest scoring streak in the competition since April 2023 (13 games – 10 wins, three draws), but it came to a miserable halt here. Between them, Las Palmas and Atleti only managed to create chances worth 1.46 expected goals (xG) – 0.66 for Las Palmas, 0.8 for Atleti, with just two shots on target apiece. Atleti were punished for their failure to create by a goal timed at 92 minutes and 36 seconds, the third latest they have conceded for a 1-0 defeat in LaLiga in the 21st century. The second-latest was timed 94:39 in September 2005, by Joan Capdevila for Deportivo de La Coruna, and the latest was timed at 94:44 in March 2012, by Apono with Real Zaragoza.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eJavi Munoz scored a stoppage-time winner to earn relegation-threatened Las Palmas a shock 1-0 victory over Atletico Madrid, whose slim LaLiga title hopes are now surely over.\u003c/p\u003e\n\u003cp\u003eDiego Simeone’s side remain third in the standings with 63 points, three behind second-placed Real Madrid, who host Athletic Bilbao on Sunday.\u003c/p\u003e\n\u003cp\u003eBut they are some 10 points adrift of leaders Barcelona, who launched a stirring fightback to beat Celta Vigo 4-3 from 3-1 down on Saturday.\u003c/p\u003e\n\u003cp\u003eThe surprise victory allowed Las Palmas to climb to 17th place and, at least temporarily, escape the drop zone with 32 points, two ahead of Alaves, who play at Sevilla on Sunday.\u003c/p\u003e\n\u003cp\u003eThe match looked to be heading for a dour goalless draw, but three minutes into second-half stoppage time, Atletico failed to deal with a long free-kick from Las Palmas goalkeeper Dinko Horkas.\u003c/p\u003e\n\u003cp\u003eWith the ball bouncing awkwardly into the Atleti penalty area, Munoz volleyed into the ground and under goalkeeper Jan Oblak, sparking wild celebrations from the home players.\u003c/p\u003e\n\u003cp\u003eThe winner was initially ruled out for offside, but that decision was overturned after a VAR review, much to the relief of the home fans at the Estadio Gran Canaria.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"ro\"\u003e1 – Atlético de Madrid have lost with a goal from Las Palmas in 92:36, the third latest for a rojiblanco’s defeat in the 21st century in \u003ca href=\"https://twitter.com/LaLigaEN?ref_src=twsrc%5Etfw\"\u003e@LaLigaEn\u003c/a\u003e at 0-0 after September 2005 (94:39, Capdevila with D. de La Coruña) and March 2012 (94:44, Apoño with Zaragoza). Sinker. \u003ca href=\"https://t.co/rkLKHlXyyw\"\u003epic.twitter.com/rkLKHlXyyw\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— OptaJose (@OptaJose) \u003ca href=\"https://twitter.com/OptaJose/status/1913701720938496323?ref_src=twsrc%5Etfw\"\u003eApril 19, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eData debrief: Atleti fall flat\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAtleti entered Saturday’s game having scored at least one goal in 11 straight matches in LaLiga, though they only won five of those (four draws, two defeats).\u003c/p\u003e\n\u003cp\u003eThat was their longest scoring streak in the competition since April 2023 (13 games – 10 wins, three draws), but it came to a miserable halt here.\u003c/p\u003e\n\u003cp\u003eBetween them, Las Palmas and Atleti only managed to create chances worth 1.46 expected goals (xG) – 0.66 for Las Palmas, 0.8 for Atleti, with just two shots on target apiece.\u003c/p\u003e\n\u003cp\u003eAtleti were punished for their failure to create by a goal timed at 92 minutes and 36 seconds, the third latest they have conceded for a 1-0 defeat in LaLiga in the 21st century.\u003c/p\u003e\n\u003cp\u003eThe second-latest was timed 94:39 in September 2005, by Joan Capdevila for Deportivo de La Coruna, and the latest was timed at 94:44 in March 2012, by Apono with Real Zaragoza.\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-19T23:04:00Z",
  "modifiedTime": null
}
