{
  "id": "31f4696c-3dd0-465e-8b92-5f6dbd659120",
  "title": "Wales will benefit from Iceland collapse in long term, says Bellamy",
  "link": "https://www.soccernews.com/wales-will-benefit-from-iceland-collapse-in-long-term-says-bellamy/377046/",
  "description": "Wales will benefit from the experience of Friday’s Nations League draw with Iceland despite squandering a 2-0 lead to draw 2-2, believes boss Craig Bellamy. Bellamy’s reign began with a positive return of four points from Nations League matches against Turkiye and Montenegro, but they suffered their first major setback under him on Friday. Brennan […] The post Wales will benefit from Iceland collapse in long term, says Bellamy appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Fri, 11 Oct 2024 23:14:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 1734,
  "excerpt": "Wales will benefit from the experience of Friday’s Nations League draw with Iceland despite squandering a 2-0 lead to draw 2-2, believes boss Craig Bellamy. Bellamy’s reign began with a positive return of four points from Nations League matches against Turkiye and Montenegro, but they suffered their first major setback under him on Friday. Brennan […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Wales will benefit from the experience of Friday’s Nations League draw with Iceland despite squandering a 2-0 lead to draw 2-2, believes boss Craig Bellamy. Bellamy’s reign began with a positive return of four points from Nations League matches against Turkiye and Montenegro, but they suffered their first major setback under him on Friday. Brennan Johnson and Harry Wilson scored to give Wales a 2-0 half-time lead at Laugardalsvollur, only for Logi Tomasson’s strike and Danny Ward’s own goal to earn Iceland a point. Despite Iceland registering the most shots they have ever recorded in a Nations League match (20), Bellamy was not too disheartened by the result. “It was good, I enjoyed it. It was what I expected to be honest, I said going out second half that this would be tough,” Bellamy told S4C. “We’ll benefit so much from that 45 minutes, it’s so good for us. In the long run this will be beneficial. DIOLCH Y WAL GOCH #NationsLeague | #TogetherStronger pic.twitter.com/GUJbBPaLYe — Wales (@Cymru) October 11, 2024 “Obviously to be 2-0 up and draw is disappointing, but it was a pleasing performance. It was about me learning about the players and them learning from us. “It’s never good to concede, I don’t like it, we’ll look at it again. I felt momentum played a big part. It’s about us understanding when to take the sting out the game, which will come. “Overall, I’m pleased with the performance, we’ve had two yellows which will mean a change on Monday, but it’s predictable due to different styles of refereeing. It is what it is.” Despite a frustrating second half, Bellamy is the first manager in Wales’ history to go unbeaten through his first three competitive games at the helm, with one win and two draws.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eWales will benefit from the experience of Friday’s Nations League draw with Iceland despite squandering a 2-0 lead to draw 2-2, believes boss Craig Bellamy.\u003c/p\u003e\n\u003cp\u003eBellamy’s reign began with a positive return of four points from Nations League matches against Turkiye and Montenegro, but they suffered their first major setback under him on Friday.\u003c/p\u003e\n\u003cp\u003eBrennan Johnson and Harry Wilson scored to give Wales a 2-0 half-time lead at Laugardalsvollur, only for Logi Tomasson’s strike and Danny Ward’s own goal to earn Iceland a point.\u003c/p\u003e\n\u003cp\u003eDespite Iceland registering the most shots they have ever recorded in a Nations League match (20), Bellamy was not too disheartened by the result.\u003c/p\u003e\n\u003cp\u003e“It was good, I enjoyed it. It was what I expected to be honest, I said going out second half that this would be tough,” Bellamy told S4C.\u003c/p\u003e\n\u003cp\u003e“We’ll benefit so much from that 45 minutes, it’s so good for us. In the long run this will be beneficial. \u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"cy\"\u003eDIOLCH Y WAL GOCH \u003ca href=\"https://twitter.com/hashtag/NationsLeague?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#NationsLeague\u003c/a\u003e | \u003ca href=\"https://twitter.com/hashtag/TogetherStronger?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#TogetherStronger\u003c/a\u003e \u003ca href=\"https://t.co/GUJbBPaLYe\"\u003epic.twitter.com/GUJbBPaLYe\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Wales  (@Cymru) \u003ca href=\"https://twitter.com/Cymru/status/1844845694655639596?ref_src=twsrc%5Etfw\"\u003eOctober 11, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e“Obviously to be 2-0 up and draw is disappointing, but it was a pleasing performance. It was about me learning about the players and them learning from us.\u003c/p\u003e\n\u003cp\u003e“It’s never good to concede, I don’t like it, we’ll look at it again. I felt momentum played a big part. It’s about us understanding when to take the sting out the game, which will come.\u003c/p\u003e\n\u003cp\u003e“Overall, I’m pleased with the performance, we’ve had two yellows which will mean a change on Monday, but it’s predictable due to different styles of refereeing. It is what it is.”\u003c/p\u003e\n\u003cp\u003eDespite a frustrating second half, Bellamy is the first manager in Wales’ history to go unbeaten through his first three competitive games at the helm, with one win and two draws.\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-10-11T23:14:00Z",
  "modifiedTime": null
}
