{
  "id": "46ce05bd-9db0-4bf2-b25a-42942416ae22",
  "title": "´Incredible´ Italy delivered ´biggest gift´ with Norway triumph, says Soncin",
  "link": "https://www.soccernews.com/incredible-italy-delivered-biggest-gift-with-norway-triumph-says-soncin/387712/",
  "description": "Andrea Soncin believes Italy delivered “the biggest gift” after reaching the semi-finals of Euro 2025 with a 2-1 win over Norway on Wednesday. Soncin watched on as Cristiana Girelli’s 90th-minute winner secured Italy’s place in the final four of a major competition for the first time since 1997. Italy had opened the scoring in the […] The post ´Incredible´ Italy delivered ´biggest gift´ with Norway triumph, says Soncin appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Wed, 16 Jul 2025 23:31:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 2607,
  "excerpt": "Andrea Soncin believes Italy delivered “the biggest gift” after reaching the semi-finals of Euro 2025 with a 2-1 win over Norway on Wednesday. Soncin watched on as Cristiana Girelli’s 90th-minute winner secured Italy’s place in the final four of a major competition for the first time since 1997. Italy had opened the scoring in the […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Andrea Soncin believes Italy delivered “the biggest gift” after reaching the semi-finals of Euro 2025 with a 2-1 win over Norway on Wednesday. Soncin watched on as Cristiana Girelli’s 90th-minute winner secured Italy’s place in the final four of a major competition for the first time since 1997. Italy had opened the scoring in the 50th minute through Girelli, before Ada Hegerberg, who had missed an earlier penalty, eventually restored parity 16 minutes later. And with the game seemingly heading for extra time, Italy captain Girelli headed home the winner, with her effort thundering off the underside of the crossbar on its way in. It saw Italy become only the second side ever to score a 90th-minute winning goal in a Women’s Euro knockout match, after Sweden against Belgium in the 2022 quarter-final. And at 35 years and 84 days old, Girelli became the oldest ever player to score more than once for a European nation in a single match at a major tournament. She has also now scored eight major tournament goals (World Cup/Euros), with only Carolina Morace (12) ever scoring more for Italy. Girelli’s winning goal sparked wild scenes inside Stade de Geneve, with Soncin running down the touchline to celebrate with his team. “It’s incredible, beautiful. In front of all these people, so many messages arrived from Italy the last few days,” Soncin said. “It’s something fantastic. I think this is the biggest gift we can give to all those who watch us, to all those little girls, those young women who live football with passion.” Italy will now face either England or Sweden for a place in the final, but for Norway, it was more heartbreak in the latter stages of a major tournament. Indeed, Norway have now lost each of their last three knockout stage games at major tournaments (World Cup/Euros), their joint-longest such run of defeats (excluding third-place play-offs), also losing three in a row across the 1999 Women’s World Cup, Women’s Euro 2001, and the 2003 Women’s World Cup. And it was also a disappointing outing for Norway captain Hegerberg, who became the first player on record (since 2013) to miss two penalties at the Euros. “It’s bitter, it’s really bitter,” Hegerberg said. “I must honestly say that I am proud of the group and how we have performed. “We are close to being in the top four in Europe, but it’s not enough.” Norway have now missed five of their six penalties (excluding shootouts) at the Women’s Euros on record (from 2013), making them responsible for exactly half of the spot-kick misses by all sides in the competition in that time (five out of 10).",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eAndrea Soncin believes Italy delivered “the biggest gift” after reaching the semi-finals of Euro 2025 with a 2-1 win over Norway on Wednesday. \u003c/p\u003e\n\u003cp\u003eSoncin watched on as Cristiana Girelli’s 90th-minute winner secured Italy’s place in the final four of a major competition for the first time since 1997. \u003c/p\u003e\n\u003cp\u003eItaly had opened the scoring in the 50th minute through Girelli, before Ada Hegerberg, who had missed an earlier penalty, eventually restored parity 16 minutes later. \u003c/p\u003e\n\u003cp\u003eAnd with the game seemingly heading for extra time, Italy captain Girelli headed home the winner, with her effort thundering off the underside of the crossbar on its way in. \u003c/p\u003e\n\u003cp\u003eIt saw Italy become only the second side ever to score a 90th-minute winning goal in a Women’s Euro knockout match, after Sweden against Belgium in the 2022 quarter-final.\u003c/p\u003e\n\u003cp\u003eAnd at 35 years and 84 days old, Girelli became the oldest ever player to score more than once for a European nation in a single match at a major tournament. \u003c/p\u003e\n\u003cp\u003eShe has also now scored eight major tournament goals (World Cup/Euros), with only Carolina Morace (12) ever scoring more for Italy.\u003c/p\u003e\n\u003cp\u003eGirelli’s winning goal sparked wild scenes inside Stade de Geneve, with Soncin running down the touchline to celebrate with his team. \u003c/p\u003e\n\u003cp\u003e“It’s incredible, beautiful. In front of all these people, so many messages arrived from Italy the last few days,” Soncin said.\u003c/p\u003e\n\u003cp\u003e“It’s something fantastic. I think this is the biggest gift we can give to all those who watch us, to all those little girls, those young women who live football with passion.”  \u003c/p\u003e\n\n\u003cp\u003eItaly will now face either England or Sweden for a place in the final, but for Norway, it was more heartbreak in the latter stages of a major tournament. \u003c/p\u003e\n\u003cp\u003eIndeed, Norway have now lost each of their last three knockout stage games at major tournaments (World Cup/Euros), their joint-longest such run of defeats (excluding third-place play-offs), also losing three in a row across the 1999 Women’s World Cup, Women’s Euro 2001, and the 2003 Women’s World Cup.\u003c/p\u003e\n\u003cp\u003eAnd it was also a disappointing outing for Norway captain Hegerberg, who became the first player on record (since 2013) to miss two penalties at the Euros. \u003c/p\u003e\n\u003cp\u003e“It’s bitter, it’s really bitter,” Hegerberg said. “I must honestly say that I am proud of the group and how we have performed.\u003c/p\u003e\n\u003cp\u003e“We are close to being in the top four in Europe, but it’s not enough.”\u003c/p\u003e\n\u003cp\u003eNorway have now missed five of their six penalties (excluding shootouts) at the Women’s Euros on record (from 2013), making them responsible for exactly half of the spot-kick misses by all sides in the competition in that time (five out of 10).\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-16T23:31:00Z",
  "modifiedTime": null
}
