{
  "id": "47e1faaf-d918-497f-98cf-919bd5c75d24",
  "title": "Carsley challenges England U21s to target third consecutive Euros title",
  "link": "https://www.soccernews.com/carsley-challenges-england-u21s-to-target-third-consecutive-euros-title/387107/",
  "description": "Lee Carsley hailed the England Under-21s for claiming their second consecutive Euros title, but has challenged them to do it again in two years’ time. England successfully defended their title on Saturday, earning a 3-2 victory over Germany Under-21s in extra time at Stadion Tehelne pole. Harvey Elliott and Omari Hutchinson put England into an […] The post Carsley challenges England U21s to target third consecutive Euros title appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Sun, 29 Jun 2025 00:18:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 3110,
  "excerpt": "Lee Carsley hailed the England Under-21s for claiming their second consecutive Euros title, but has challenged them to do it again in two years’ time. England successfully defended their title on Saturday, earning a 3-2 victory over Germany Under-21s in extra time at Stadion Tehelne pole. Harvey Elliott and Omari Hutchinson put England into an […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Lee Carsley hailed the England Under-21s for claiming their second consecutive Euros title, but has challenged them to do it again in two years’ time. England successfully defended their title on Saturday, earning a 3-2 victory over Germany Under-21s in extra time at Stadion Tehelne pole. Harvey Elliott and Omari Hutchinson put England into an early 2-0 lead, though Nelson Weiper and Paul Nebel pulled them back level. Nebel then struck the crossbar in second-half stoppage time before Jonathan Rowe made an instant impact off the bench in extra time, scoring 85 seconds after the restart to put England in front. Merlin Rohl struck the crossbar in the dying seconds, but England ultimately held on to claim back-to-back titles, doing so for the second time, having also done it in 1982 and 1984. Carsley, who recently extended his contract through to 2027, has led England to both titles and is already looking ahead to the next. “I’m really proud of the players,” he told Channel 4. “The commitment they’ve shown for the last 28 days, all the instruction we’ve tried to put into them so quickly, they’ve taken it on board and they’ve got so much belief. “I spoke about it when we were at St George’s Park, that this squad believe they can win, and that’s the kind of players we need. “I’m so happy for them; to be European champions for the second time is a great achievement, and the challenge now is to do it again in two years. “Any setback we’ve had, the players have just got together. I said at the start of the tournament, the longer we can stay in, the better we play. “I didn’t think we played great. I thought we probably sat a little bit too deep and didn’t have as much control as I would’ve wanted, but I probably won’t remember that in a couple of days. “I’m going to try and enjoy [the win]. It’s important. I love my job, I’m very proud of the job I do. I love working with the players. “I’ve had a chance with the senior team, and I love that, so the best thing I can do is help the pathway and try and help the senior team.” England had suffered a 2-1 defeat to Germany in their final group game earlier in the tournament, though Antonio Di Salvo had opted to name a much-changed line-up in that match. With both teams at full strength from the start on Saturday, it was a fairly even match throughout normal time, but in the end, it was a substitute that made the difference. Rowe appeared to score with his first touch after entering the pitch in extra time, scoring with his only attempt. “Everyone is exceptional. From the minute I came into the camp, I could just tell everyone had the same mindset; we all wanted to win,” Rowe told Channel 4. “We’ve done that now – the job’s finally finished, and we can all celebrate! “I came into the game with the mindset of doing anything I could to help the team. I wasn’t starting, but I knew, at some point, all of us on the bench would have to come on, make a difference and help the team to push it over the line. “I’m so happy we managed to do that in front of some important people [England head coach Thomas Tuchel was in the crowd].”",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eLee Carsley hailed the England Under-21s for claiming their second consecutive Euros title, but has challenged them to do it again in two years’ time.\u003c/p\u003e\n\u003cp\u003eEngland successfully defended their title on Saturday, earning a 3-2 victory over Germany Under-21s in extra time at Stadion Tehelne pole.\u003c/p\u003e\n\u003cp\u003eHarvey Elliott and Omari Hutchinson put England into an early 2-0 lead, though Nelson Weiper and Paul Nebel pulled them back level.\u003c/p\u003e\n\u003cp\u003eNebel then struck the crossbar in second-half stoppage time before Jonathan Rowe made an instant impact off the bench in extra time, scoring 85 seconds after the restart to put England in front.\u003c/p\u003e\n\u003cp\u003eMerlin Rohl struck the crossbar in the dying seconds, but England ultimately held on to claim back-to-back titles, doing so for the second time, having also done it in 1982 and 1984.\u003c/p\u003e\n\u003cp\u003eCarsley, who recently extended his contract through to 2027, has led England to both titles and is already looking ahead to the next.\u003c/p\u003e\n\u003cp\u003e“I’m really proud of the players,” he told Channel 4. “The commitment they’ve shown for the last 28 days, all the instruction we’ve tried to put into them so quickly, they’ve taken it on board and they’ve got so much belief.\u003c/p\u003e\n\u003cp\u003e“I spoke about it when we were at St George’s Park, that this squad believe they can win, and that’s the kind of players we need.\u003c/p\u003e\n\u003cp\u003e“I’m so happy for them; to be European champions for the second time is a great achievement, and the challenge now is to do it again in two years.\u003c/p\u003e\n\u003cp\u003e“Any setback we’ve had, the players have just got together. I said at the start of the tournament, the longer we can stay in, the better we play.\u003c/p\u003e\n\n\u003cp\u003e“I didn’t think we played great. I thought we probably sat a little bit too deep and didn’t have as much control as I would’ve wanted, but I probably won’t remember that in a couple of days.\u003c/p\u003e\n\u003cp\u003e“I’m going to try and enjoy [the win]. It’s important. I love my job, I’m very proud of the job I do. I love working with the players.\u003c/p\u003e\n\u003cp\u003e“I’ve had a chance with the senior team, and I love that, so the best thing I can do is help the pathway and try and help the senior team.”\u003c/p\u003e\n\u003cp\u003eEngland had suffered a 2-1 defeat to Germany in their final group game earlier in the tournament, though Antonio Di Salvo had opted to name a much-changed line-up in that match.\u003c/p\u003e\n\u003cp\u003eWith both teams at full strength from the start on Saturday, it was a fairly even match throughout normal time, but in the end, it was a substitute that made the difference.\u003c/p\u003e\n\u003cp\u003eRowe appeared to score with his first touch after entering the pitch in extra time, scoring with his only attempt.\u003c/p\u003e\n\u003cp\u003e“Everyone is exceptional. From the minute I came into the camp, I could just tell everyone had the same mindset; we all wanted to win,” Rowe told Channel 4.\u003c/p\u003e\n\u003cp\u003e“We’ve done that now – the job’s finally finished, and we can all celebrate!\u003c/p\u003e\n\u003cp\u003e“I came into the game with the mindset of doing anything I could to help the team. I wasn’t starting, but I knew, at some point, all of us on the bench would have to come on, make a difference and help the team to push it over the line.\u003c/p\u003e\n\u003cp\u003e“I’m so happy we managed to do that in front of some important people [England head coach Thomas Tuchel was in the crowd].”\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-29T00:18:00Z",
  "modifiedTime": null
}
