{
  "id": "52008925-2394-4e40-8117-1341e9c4029f",
  "title": "Bowen: Victory at Newcastle ´a really big turning point´ for West Ham",
  "link": "https://www.soccernews.com/bowen-victory-at-newcastle-a-really-big-turning-point-for-west-ham/378742/",
  "description": "Jarrod Bowen praised the manner of West Ham’s victory at Newcastle United and believes it will act as “a really big turning point” in his side’s campaign. West Ham won 2-0 at St James’ Park in Monday’s Premier League contest thanks to goals from Tomas Soucek and Aaron Wan-Bissaka. The victory is just the Hammers’ […] The post Bowen: Victory at Newcastle ´a really big turning point´ for West Ham appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Mon, 25 Nov 2024 23:14:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 2842,
  "excerpt": "Jarrod Bowen praised the manner of West Ham’s victory at Newcastle United and believes it will act as “a really big turning point” in his side’s campaign. West Ham won 2-0 at St James’ Park in Monday’s Premier League contest thanks to goals from Tomas Soucek and Aaron Wan-Bissaka. The victory is just the Hammers’ […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Jarrod Bowen praised the manner of West Ham’s victory at Newcastle United and believes it will act as “a really big turning point” in his side’s campaign. West Ham won 2-0 at St James’ Park in Monday’s Premier League contest thanks to goals from Tomas Soucek and Aaron Wan-Bissaka. The victory is just the Hammers’ fourth in 12 league matches under Julen Lopetegui, who has seen his job as head coach called into question early in his tenure. Bowen, who assisted Wan-Bissaka’s goal, believes things are now starting to turn for his side after a slow start to the campaign. Asked by Sky Sports if it could be a big win for Lopetegui, Bowen replied: “I think it is for everyone associated with the club. We’ve been disappointed with our start. “We have to take responsibility and do our work. We haven’t done that to a high enough ability this year. It was a real big moment and this is a really big turning point in our season. “[Lopetegui] has come in with different ideas and playing from the back but also mixing it up as well. “That’s up to us to adapt too, and he has come in with fresh good ideas, especially for us attacking players. We are getting there.” @WestHam secure a HUGE win away against Newcastle #NEWWHU pic.twitter.com/pIGSdLS6eW — Premier League (@premierleague) November 25, 2024 Bowen overtook Paolo Di Canio with his 79th Premier League goal involvement for West Ham and is now behind only Michail Antonio (101) and Mark Noble (82). Wan-Bissaka’s strike early in the second half added to Soucek’s 10th-minute opener, with that his fourth Premier League goal against Newcastle – against no team does he have a better record. West Ham remain 14th in the league but are now just three points off the top-half places, with a home match against Arsenal next up on Saturday. Lopetegui, who replaced David Moyes ahead of the 2024-25 campaign, was pleased with the win but believes there is more to come from his side. “We are happy. I think that we played well,” he told Sky Sports. “We played with one identity and we were able to overcome a very good team. “They started well and it is always good to have more confidence. They had two chances and I think in the second half we did well and deserved to win. “I am happy for the players, for the team and for the fans. They will have to drive a lot of miles so we are happy for them. We look forward to the next challenge. We are happy but we have a lot of work to do. “We have to build as a team if we are to work and know what we want to do. I think about their play. That is the thing that we try to do. “We have a lot of matches that we need to do and I believe in the future this team is going to be able to show the style as a team. “The players believe and they are able to put in the focus every day. Each match is one incredible challenge in the Premier League.”",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eJarrod Bowen praised the manner of West Ham’s victory at Newcastle United and believes it will act as “a really big turning point” in his side’s campaign.\u003c/p\u003e\n\u003cp\u003eWest Ham won 2-0 at St James’ Park in Monday’s Premier League contest thanks to goals from Tomas Soucek and Aaron Wan-Bissaka.\u003c/p\u003e\n\u003cp\u003eThe victory is just the Hammers’ fourth in 12 league matches under Julen Lopetegui, who has seen his job as head coach called into question early in his tenure.\u003c/p\u003e\n\u003cp\u003eBowen, who assisted Wan-Bissaka’s goal, believes things are now starting to turn for his side after a slow start to the campaign.\u003c/p\u003e\n\u003cp\u003eAsked by Sky Sports if it could be a big win for Lopetegui, Bowen replied: “I think it is for everyone associated with the club. We’ve been disappointed with our start. \u003c/p\u003e\n\u003cp\u003e“We have to take responsibility and do our work. We haven’t done that to a high enough ability this year. It was a real big moment and this is a really big turning point in our season.\u003c/p\u003e\n\u003cp\u003e“[Lopetegui] has come in with different ideas and playing from the back but also mixing it up as well.\u003c/p\u003e\n\u003cp\u003e“That’s up to us to adapt too, and he has come in with fresh good ideas, especially for us attacking players. We are getting there.”\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003e\u003ca href=\"https://twitter.com/WestHam?ref_src=twsrc%5Etfw\"\u003e@WestHam\u003c/a\u003e secure a HUGE win away against Newcastle \u003ca href=\"https://twitter.com/hashtag/NEWWHU?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#NEWWHU\u003c/a\u003e \u003ca href=\"https://t.co/pIGSdLS6eW\"\u003epic.twitter.com/pIGSdLS6eW\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Premier League (@premierleague) \u003ca href=\"https://twitter.com/premierleague/status/1861167528334033140?ref_src=twsrc%5Etfw\"\u003eNovember 25, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eBowen overtook Paolo Di Canio with his 79th Premier League goal involvement for West Ham and is now behind only Michail Antonio (101) and Mark Noble (82).\u003c/p\u003e\n\u003cp\u003eWan-Bissaka’s strike early in the second half added to Soucek’s 10th-minute opener, with that his fourth Premier League goal against Newcastle – against no team does he have a better record.\u003c/p\u003e\n\u003cp\u003eWest Ham remain 14th in the league but are now just three points off the top-half places, with a home match against Arsenal next up on Saturday.\u003c/p\u003e\n\u003cp\u003eLopetegui, who replaced David Moyes ahead of the 2024-25 campaign, was pleased with the win but believes there is more to come from his side.\u003c/p\u003e\n\u003cp\u003e“We are happy. I think that we played well,” he told Sky Sports. “We played with one identity and we were able to overcome a very good team. \u003c/p\u003e\n\u003cp\u003e“They started well and it is always good to have more confidence. They had two chances and I think in the second half we did well and deserved to win.\u003c/p\u003e\n\u003cp\u003e“I am happy for the players, for the team and for the fans. They will have to drive a lot of miles so we are happy for them. We look forward to the next challenge. We are happy but we have a lot of work to do.\u003c/p\u003e\n\u003cp\u003e“We have to build as a team if we are to work and know what we want to do. I think about their play. That is the thing that we try to do. \u003c/p\u003e\n\u003cp\u003e“We have a lot of matches that we need to do and I believe in the future this team is going to be able to show the style as a team. \u003c/p\u003e\n\u003cp\u003e“The players believe and they are able to put in the focus every day. Each match is one incredible challenge in the Premier League.”\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-25T23:14:00Z",
  "modifiedTime": null
}
