{
  "id": "6bc11024-df47-4b71-8bbb-a7846dcd1036",
  "title": "Minnesota United v Real Salt Lake: Ramsay still eyeing improvements despite positive start",
  "link": "https://www.soccernews.com/minnesota-united-v-real-salt-lake-ramsay-still-eyeing-improvements-despite-positive-start/383590/",
  "description": "Eric Ramsay has said that while he is upbeat about Minnesota United’s start to the MLS season, he knows his side can do better, with Real Salt Lake next up. Minnesota are on a four-match unbeaten streak since losing their MLS opener to Los Angeles FC, winning two and drawing two since then. They sit […] The post Minnesota United v Real Salt Lake: Ramsay still eyeing improvements despite positive start appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Fri, 28 Mar 2025 22:45:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 3696,
  "excerpt": "Eric Ramsay has said that while he is upbeat about Minnesota United’s start to the MLS season, he knows his side can do better, with Real Salt Lake next up. Minnesota are on a four-match unbeaten streak since losing their MLS opener to Los Angeles FC, winning two and drawing two since then. They sit […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Eric Ramsay has said that while he is upbeat about Minnesota United’s start to the MLS season, he knows his side can do better, with Real Salt Lake next up. Minnesota are on a four-match unbeaten streak since losing their MLS opener to Los Angeles FC, winning two and drawing two since then. They sit fifth in the Western Conference on eight points, with Ramsay noting they have missed chances to be higher up the table. He also pointed to their underperformance in expected goals (scored seven from 9.83 xG) but is confident their results will start mirroring their performances soon. “We think if we keep pushing over the course of the season, it will level itself out,” he said when asked about the expected goals. “We’re trying to strike the balance between the good performances, but there does need to be an element of being self-critical as we should be in a better position in the table. But generally, we’re positive. “We’ve started really well when it comes to performances, and I’m sure if you’re an opposition coach watching us, we’ve looked like a team that’s very strong defensively, but we’re adding to that by being a threat on set-pieces and general play.” Smiling because it’s 60° pic.twitter.com/jBU7kRErQ8 — Minnesota United FC (@MNUFC) March 27, 2025 Real Salt Lake, meanwhile, have struggled to find their rhythm this term, winning just two of their five league matches so far, leaving them 11th in the West. Salt Lake were knocked out in the MLS playoffs by Minnesota last year, losing both games in the first round on penalties, and head coach Pablo Mastroeni is expecting another tough test against the Loons. “It does [feel like the continuation of a story],” he said. “They’re a very direct team. They play for knockdowns and scraps in and around the box. Nothing changes. “I think for us, on the offensive side, it’s about finding numerical superiority in very dangerous positions. It’s up to us to create opportunities because it’s a numbers game. We need to be both safe in the counter but determined to score goals.” It’s about how we respond to adversity pic.twitter.com/zYudWJtrWI — Real Salt Lake (@realsaltlake) March 26, 2025 PLAYERS TO WATCH Minnesota United – Kelvin Yeboah With his brace on Saturday, Kelvin Yeboah has scored eight goals in his first six career home MLS matches. Yeboah is the seventh player in MLS history, and the first since Nemanja Nikolic for the Chicago Fire in 2017, to score eight goals in his first six career home MLS matches. Real Salt Lake – Rafael Cabral Lucho Acosta’s winning goal for FC Dallas against Real Salt Lake on Saturday was the fourth headed goal conceded by RSL already this season. It is the most conceded in MLS and one more than the three they allowed in 2024. Rafael Cabral has also kept just one clean sheet in the league this season. MATCH PREDICTION: MINNESOTA UNITED WIN Each of the last six meetings between Minnesota United and Real Salt Lake have ended in draws, including both meetings in last season’s playoffs (both won by Minnesota in penalty shoot-outs). No matchup in MLS history has been drawn in seven straight meetings (incl. playoffs). Minnesota are unbeaten in four straight matches (W2 D2) after a season-opening defeat. The Loons have lost only two of their 20 regular-season matches played in February and March dating back to 2020 (W11 D7), including going unbeaten at home (W3 D5). Meanwhile, Real Salt Lake have lost four of their first six matches in all competitions this season (W2) after ending 2024 unbeaten in their final nine matches (W3 D6, including playoffs and two penalty shoot-out losses). OPTA WIN PROBABILITY Minnesota United – 47.4% Draw – 26.2% Real Salt Lake – 26.4%",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eEric Ramsay has said that while he is upbeat about Minnesota United’s start to the MLS season, he knows his side can do better, with Real Salt Lake next up.\u003c/p\u003e\n\u003cp\u003eMinnesota are on a four-match unbeaten streak since losing their MLS opener to Los Angeles FC, winning two and drawing two since then.\u003c/p\u003e\n\u003cp\u003eThey sit fifth in the Western Conference on eight points, with Ramsay noting they have missed chances to be higher up the table.\u003c/p\u003e\n\u003cp\u003eHe also pointed to their underperformance in expected goals (scored seven from 9.83 xG) but is confident their results will start mirroring their performances soon.\u003c/p\u003e\n\u003cp\u003e“We think if we keep pushing over the course of the season, it will level itself out,” he said when asked about the expected goals.\u003c/p\u003e\n\u003cp\u003e“We’re trying to strike the balance between the good performances, but there does need to be an element of being self-critical as we should be in a better position in the table. But generally, we’re positive.\u003c/p\u003e\n\u003cp\u003e“We’ve started really well when it comes to performances, and I’m sure if you’re an opposition coach watching us, we’ve looked like a team that’s very strong defensively, but we’re adding to that by being a threat on set-pieces and general play.”\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eSmiling because it’s 60° \u003ca href=\"https://t.co/jBU7kRErQ8\"\u003epic.twitter.com/jBU7kRErQ8\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Minnesota United FC (@MNUFC) \u003ca href=\"https://twitter.com/MNUFC/status/1905363076766916698?ref_src=twsrc%5Etfw\"\u003eMarch 27, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eReal Salt Lake, meanwhile, have struggled to find their rhythm this term, winning just two of their five league matches so far, leaving them 11th in the West.\u003c/p\u003e\n\u003cp\u003eSalt Lake were knocked out in the MLS playoffs by Minnesota last year, losing both games in the first round on penalties, and head coach Pablo Mastroeni is expecting another tough test against the Loons.\u003c/p\u003e\n\u003cp\u003e“It does [feel like the continuation of a story],” he said.\u003c/p\u003e\n\u003cp\u003e“They’re a very direct team. They play for knockdowns and scraps in and around the box. Nothing changes.\u003c/p\u003e\n\u003cp\u003e“I think for us, on the offensive side, it’s about finding numerical superiority in very dangerous positions. It’s up to us to create opportunities because it’s a numbers game. We need to be both safe in the counter but determined to score goals.”\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eIt’s about how we respond to adversity \u003ca href=\"https://t.co/zYudWJtrWI\"\u003epic.twitter.com/zYudWJtrWI\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Real Salt Lake (@realsaltlake) \u003ca href=\"https://twitter.com/realsaltlake/status/1904922794095177984?ref_src=twsrc%5Etfw\"\u003eMarch 26, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003ePLAYERS TO WATCH\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMinnesota United – Kelvin Yeboah\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWith his brace on Saturday, Kelvin Yeboah has scored eight goals in his first six career home MLS matches.\u003c/p\u003e\n\u003cp\u003eYeboah is the seventh player in MLS history, and the first since Nemanja Nikolic for the Chicago Fire in 2017, to score eight goals in his first six career home MLS matches.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReal Salt Lake – Rafael Cabral\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLucho Acosta’s winning goal for FC Dallas against Real Salt Lake on Saturday was the fourth headed goal conceded by RSL already this season.\u003c/p\u003e\n\u003cp\u003eIt is the most conceded in MLS and one more than the three they allowed in 2024. Rafael Cabral has also kept just one clean sheet in the league this season.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMATCH PREDICTION: MINNESOTA UNITED WIN\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEach of the last six meetings between Minnesota United and Real Salt Lake have ended in draws, including both meetings in last season’s playoffs (both won by Minnesota in penalty shoot-outs). No matchup in MLS history has been drawn in seven straight meetings (incl. playoffs).\u003c/p\u003e\n\u003cp\u003eMinnesota are unbeaten in four straight matches (W2 D2) after a season-opening defeat. The Loons have lost only two of their 20 regular-season matches played in February and March dating back to 2020 (W11 D7), including going unbeaten at home (W3 D5).\u003c/p\u003e\n\u003cp\u003eMeanwhile, Real Salt Lake have lost four of their first six matches in all competitions this season (W2) after ending 2024 unbeaten in their final nine matches (W3 D6, including playoffs and two penalty shoot-out losses).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOPTA WIN PROBABILITY\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMinnesota United – 47.4%\u003c/p\u003e\n\u003cp\u003eDraw – 26.2%\u003c/p\u003e\n\u003cp\u003eReal Salt Lake – 26.4%\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-28T22:45:00Z",
  "modifiedTime": null
}
