{
  "id": "89a6437a-d102-4b63-abcd-87b9baab42d9",
  "title": "England 1-2 Greece: Pavlidis ends Carsley´s perfect start with stunning brace",
  "link": "https://www.soccernews.com/england-1-2-greece-pavlidis-ends-carsley-s-perfect-start-with-stunning-brace/377015/",
  "description": "Vangelis Pavlidis’ dramatic 94th-minute winner brought Lee Carsley’s perfect start to life as interim England coach crashing to a halt, as the Benfica forward netted twice in a stunning 2-1 win at Wembley. Pavlidis danced through the Three Lions’ static defence to give Greece a shock lead early in the second half, only for Jude […] The post England 1-2 Greece: Pavlidis ends Carsley´s perfect start with stunning brace appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Thu, 10 Oct 2024 22:09:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 2827,
  "excerpt": "Vangelis Pavlidis’ dramatic 94th-minute winner brought Lee Carsley’s perfect start to life as interim England coach crashing to a halt, as the Benfica forward netted twice in a stunning 2-1 win at Wembley. Pavlidis danced through the Three Lions’ static defence to give Greece a shock lead early in the second half, only for Jude […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Vangelis Pavlidis’ dramatic 94th-minute winner brought Lee Carsley’s perfect start to life as interim England coach crashing to a halt, as the Benfica forward netted twice in a stunning 2-1 win at Wembley. Pavlidis danced through the Three Lions’ static defence to give Greece a shock lead early in the second half, only for Jude Bellingham to fire home a leveller in the 87th minute. But England struggled to find their groove with captain Harry Kane out injured, and after Greece had three goals disallowed, they could have few complaints when Pavlidis took advantage of a defensive mix-up to score a famous winner deep into stoppage time. England’s willingness to throw men forward allowed Greece plenty of opportunities in the first half, and only a spectacular goal-line clearance from Levi Colwill prevented the visitors from going ahead when Anastasios Bakasetas lobbed Jordan Pickford. Pickford was then arguably fortunate to win a foul when his missed punch led to Konstantinos Mavropanos nodding the resulting corner in, before Cole Palmer fired off-target from a great position at the other end. Anthony Gordon headed Trent Alexander-Arnold’s cross over shortly before half-time, but Greece continued to threaten and got their reward four minutes after the restart. Receiving the ball with three white shirts surrounding him in a crowded penalty area, Pavlidis showed great feet to retain possession before slotting his finish beyond Pickford. #NationsLeague pic.twitter.com/TFkc9wUKtZ — UEFA EURO 2024 (@EURO2024) October 10, 2024 Pavlidis was denied a second goal by the offside flag seven minutes from time, and England drew level just four minutes later, with Bellingham’s side-footed finish packing too much power for Odysseas Vlachodimos in the Greece goal. There was to be one final twist, though, as England’s hapless defence missed multiple chances to clear their lines in the 94th minute, allowing Pavlidis to take possession and fire into the bottom-left corner to spark wild celebrations among the Greek fans. Defeat at Wembley Stadium. pic.twitter.com/5dMIYpY5ef — England (@England) October 10, 2024 Data Debrief: Wembley woes ancient history for Greece Prior to Thursday, Greece had never scored at Wembley and had failed to beat England in nine competitive meetings (two draws, seven losses), being shut out on seven occasions. But they showed no fear on a memorable night in London, beating a team ranked in the world’s top five by FIFA for the first time since overcoming France en route to their stunning success at Euro 2004. While Lee Carsley fell short of becoming the first England boss since Fabio Capello (in October 2008) to win his first three competitive matches in charge, Greece claimed a huge scalp on an emotional night, one day after the tragic death of full-back George Baldock.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eVangelis Pavlidis’ dramatic 94th-minute winner brought Lee Carsley’s perfect start to life as interim England coach crashing to a halt, as the Benfica forward netted twice in a stunning 2-1 win at Wembley. \u003c/p\u003e\n\u003cp\u003ePavlidis danced through the Three Lions’ static defence to give Greece a shock lead early in the second half, only for Jude Bellingham to fire home a leveller in the 87th minute.\u003c/p\u003e\n\u003cp\u003eBut England struggled to find their groove with captain Harry Kane out injured, and after Greece had three goals disallowed, they could have few complaints when Pavlidis took advantage of a defensive mix-up to score a famous winner deep into stoppage time.\u003c/p\u003e\n\u003cp\u003eEngland’s willingness to throw men forward allowed Greece plenty of opportunities in the first half, and only a spectacular goal-line clearance from Levi Colwill prevented the visitors from going ahead when Anastasios Bakasetas lobbed Jordan Pickford.\u003c/p\u003e\n\u003cp\u003ePickford was then arguably fortunate to win a foul when his missed punch led to Konstantinos Mavropanos nodding the resulting corner in, before Cole Palmer fired off-target from a great position at the other end.\u003c/p\u003e\n\u003cp\u003eAnthony Gordon headed Trent Alexander-Arnold’s cross over shortly before half-time, but Greece continued to threaten and got their reward four minutes after the restart.\u003c/p\u003e\n\u003cp\u003eReceiving the ball with three white shirts surrounding him in a crowded penalty area, Pavlidis showed great feet to retain possession before slotting his finish beyond Pickford.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"qme\"\u003e\u003ca href=\"https://twitter.com/hashtag/NationsLeague?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#NationsLeague\u003c/a\u003e \u003ca href=\"https://t.co/TFkc9wUKtZ\"\u003epic.twitter.com/TFkc9wUKtZ\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— UEFA EURO 2024 (@EURO2024) \u003ca href=\"https://twitter.com/EURO2024/status/1844471788430073981?ref_src=twsrc%5Etfw\"\u003eOctober 10, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003ePavlidis was denied a second goal by the offside flag seven minutes from time, and England drew level just four minutes later, with Bellingham’s side-footed finish packing too much power for Odysseas Vlachodimos in the Greece goal.\u003c/p\u003e\n\u003cp\u003eThere was to be one final twist, though, as England’s hapless defence missed multiple chances to clear their lines in the 94th minute, allowing Pavlidis to take possession and fire into the bottom-left corner to spark wild celebrations among the Greek fans. \u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eDefeat at Wembley Stadium. \u003ca href=\"https://t.co/5dMIYpY5ef\"\u003epic.twitter.com/5dMIYpY5ef\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— England (@England) \u003ca href=\"https://twitter.com/England/status/1844478503779287255?ref_src=twsrc%5Etfw\"\u003eOctober 10, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eData Debrief: Wembley woes ancient history for Greece\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePrior to Thursday, Greece had never scored at Wembley and had failed to beat England in nine competitive meetings (two draws, seven losses), being shut out on seven occasions.\u003c/p\u003e\n\u003cp\u003eBut they showed no fear on a memorable night in London, beating a team ranked in the world’s top five by FIFA for the first time since overcoming France en route to their stunning success at Euro 2004.\u003c/p\u003e\n\u003cp\u003eWhile Lee Carsley fell short of becoming the first England boss since Fabio Capello (in October 2008) to win his first three competitive matches in charge, Greece claimed a huge scalp on an emotional night, one day after the tragic death of full-back George Baldock. \u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-10T22:09:00Z",
  "modifiedTime": null
}
