{
  "id": "92fb8400-1def-4a6d-8905-cec2b17e3638",
  "title": "Venezuela 1-1 Argentina: Rondon equaliser thwarts world champions on Messi return",
  "link": "https://www.soccernews.com/venezuela-1-1-argentina-rondon-equaliser-thwarts-world-champions-on-messi-return/377017/",
  "description": "Argentina dropped points in a second successive CONMEBOL World Cup qualifier, as Venezuela held them to a 1-1 draw in Maturin. The spoils were shared at Estadio Monumental de Maturin, where Salomon Rondon’s second-half header cancelled out Nicolas Otamendi’s earlier effort. After heavy rain delayed kick-off, Argentina took the lead in the 13th minute. Venezuela […] The post Venezuela 1-1 Argentina: Rondon equaliser thwarts world champions on Messi return appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Fri, 11 Oct 2024 00:49:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 1720,
  "excerpt": "Argentina dropped points in a second successive CONMEBOL World Cup qualifier, as Venezuela held them to a 1-1 draw in Maturin. The spoils were shared at Estadio Monumental de Maturin, where Salomon Rondon’s second-half header cancelled out Nicolas Otamendi’s earlier effort. After heavy rain delayed kick-off, Argentina took the lead in the 13th minute. Venezuela […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Argentina dropped points in a second successive CONMEBOL World Cup qualifier, as Venezuela held them to a 1-1 draw in Maturin. The spoils were shared at Estadio Monumental de Maturin, where Salomon Rondon’s second-half header cancelled out Nicolas Otamendi’s earlier effort. After heavy rain delayed kick-off, Argentina took the lead in the 13th minute. Venezuela goalkeeper Rafael Romo failed to properly clear the returning Lionel Messi’s free-kick, and Otamendi reacted quickest to poke home from 12 yards out. The hosts went close to levelling either side of the break. German Pezzella cleared off the line from Rondon, while Geronimo Rulli – deputising for the suspended Emiliano Martinez – kept out Yangel Herrera’s powerful header. However, Venezuela did grab their equaliser in the 65th minute – and subsequently a point – when Rondon rose at the near post to power home from Yeferson Soteldo’s cross. We’re bringing a point back from Maturín! Venezuela 1 1 Argentina#ArgentinaNT pic.twitter.com/ptCWA0bK7y — Selección Argentina in English (@AFASeleccionEN) October 10, 2024 Messi returned to the international scene for the first time since limping off in tears during the Copa America final. But the eight-time Ballon d’Or winner could not help Argentina get back to winning ways, while he conceded possession the joint-most times (19) by any visiting player. The conditions certainly affected the flow of the game, and was more to the suiting of Venezuela. Although they had just 40.1% of possession, the hosts outshot their opponents 16-8. However, they have now failed to win their last five CONMEBOL World Cup qualifiers; their longest streak since going six without victory between June and October 2021.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eArgentina dropped points in a second successive CONMEBOL World Cup qualifier, as Venezuela held them to a 1-1 draw in Maturin.\u003c/p\u003e\n\u003cp\u003eThe spoils were shared at Estadio Monumental de Maturin, where Salomon Rondon’s second-half header cancelled out Nicolas Otamendi’s earlier effort.\u003c/p\u003e\n\u003cp\u003eAfter heavy rain delayed kick-off, Argentina took the lead in the 13th minute.\u003c/p\u003e\n\u003cp\u003eVenezuela goalkeeper Rafael Romo failed to properly clear the returning Lionel Messi’s free-kick, and Otamendi reacted quickest to poke home from 12 yards out.\u003c/p\u003e\n\u003cp\u003eThe hosts went close to levelling either side of the break. German Pezzella cleared off the line from Rondon, while Geronimo Rulli – deputising for the suspended Emiliano Martinez – kept out Yangel Herrera’s powerful header.\u003c/p\u003e\n\u003cp\u003eHowever, Venezuela did grab their equaliser in the 65th minute – and subsequently a point – when Rondon rose at the near post to power home from Yeferson Soteldo’s cross.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"ro\"\u003eWe’re bringing a point back from Maturín!\u003c/p\u003e\n\u003cp\u003eVenezuela 1 1 Argentina\u003ca href=\"https://twitter.com/hashtag/ArgentinaNT?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#ArgentinaNT\u003c/a\u003e \u003ca href=\"https://t.co/ptCWA0bK7y\"\u003epic.twitter.com/ptCWA0bK7y\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Selección Argentina in English (@AFASeleccionEN) \u003ca href=\"https://twitter.com/AFASeleccionEN/status/1844519658872857006?ref_src=twsrc%5Etfw\"\u003eOctober 10, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eMessi returned to the international scene for the first time since limping off in tears during the Copa America final.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBut the eight-time Ballon d’Or winner could not help Argentina get back to winning ways, while he conceded possession the joint-most times (19) by any visiting player.\u003c/p\u003e\n\u003cp\u003eThe conditions certainly affected the flow of the game, and was more to the suiting of Venezuela. Although they had just 40.1% of possession, the hosts outshot their opponents 16-8.\u003c/p\u003e\n\u003cp\u003eHowever, they have now failed to win their last five CONMEBOL World Cup qualifiers; their longest streak since going six without victory between June and October 2021.\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-10-11T00:49:00Z",
  "modifiedTime": null
}
