{
  "id": "ac475466-c7eb-4c66-a3c8-dcdb104de026",
  "title": "Girona 0-3 Real Madrid: Bellingham and Mbappe score as Blancos close on Barcelona",
  "link": "https://www.soccernews.com/girona-0-3-real-madrid-bellingham-and-mbappe-score-as-blancos-close-on-barcelona/379237/",
  "description": "Real Madrid closed the gap on LaLiga leaders Barcelona to two points with a commanding 3-0 win at Girona, with goals from Jude Bellingham, Arda Guler and Kylian Mbappe. Second-placed Madrid have 36 points with a game in hand on Barca, who drew 2-2 at Real Betis earlier on Saturday, after inflicting Girona’s sixth loss […] The post Girona 0-3 Real Madrid: Bellingham and Mbappe score as Blancos close on Barcelona appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Sat, 07 Dec 2024 22:54:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 1544,
  "excerpt": "Real Madrid closed the gap on LaLiga leaders Barcelona to two points with a commanding 3-0 win at Girona, with goals from Jude Bellingham, Arda Guler and Kylian Mbappe. Second-placed Madrid have 36 points with a game in hand on Barca, who drew 2-2 at Real Betis earlier on Saturday, after inflicting Girona’s sixth loss […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Real Madrid closed the gap on LaLiga leaders Barcelona to two points with a commanding 3-0 win at Girona, with goals from Jude Bellingham, Arda Guler and Kylian Mbappe. Second-placed Madrid have 36 points with a game in hand on Barca, who drew 2-2 at Real Betis earlier on Saturday, after inflicting Girona’s sixth loss of the campaign. Bellingham opened the scoring in the 36th minute by capitalising on a loose ball and firing home from the centre of the box, with the England international then turning provider for Madrid’s second goal. Ten minutes into the second half, his defence-splitting throughball teed up Guler to double Madrid’s lead, though Bellingham was withdrawn with an injury soon afterwards. Mbappe then added further gloss shortly after the hour mark, firing home from a tight angle for his ninth league goal of the season. 200 – @KMbappe has reached 200 goals scored in top five European leagues (261 appearances): 175 with PSG 16 with Monaco 9 with Real Madrid Milestone. pic.twitter.com/HHBI01lRut — OptaJose (@OptaJose) December 7, 2024 Data debrief: Mbappe brings up double century Mbappe’s ninth league goal for Madrid was also his 200th in his career across Europe’s top five leagues, on his 261st such appearance. He netted 16 times for Monaco and 175 times with Paris Saint-Germain. He was not the only Blancos star with something to celebrate, as Bellingham made it five straight games with a goal for the very first time in Europe’s top leagues, though his second-half exit will concern Carlo Ancelotti.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eReal Madrid closed the gap on LaLiga leaders Barcelona to two points with a commanding 3-0 win at Girona, with goals from Jude Bellingham, Arda Guler and Kylian Mbappe.\u003c/p\u003e\n\u003cp\u003eSecond-placed Madrid have 36 points with a game in hand on Barca, who drew 2-2 at Real Betis earlier on Saturday, after inflicting Girona’s sixth loss of the campaign.\u003c/p\u003e\n\u003cp\u003eBellingham opened the scoring in the 36th minute by capitalising on a loose ball and firing home from the centre of the box, with the England international then turning provider for Madrid’s second goal.\u003c/p\u003e\n\u003cp\u003eTen minutes into the second half, his defence-splitting throughball teed up Guler to double Madrid’s lead, though Bellingham was withdrawn with an injury soon afterwards. \u003c/p\u003e\n\u003cp\u003eMbappe then added further gloss shortly after the hour mark, firing home from a tight angle for his ninth league goal of the season. \u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003e200 – \u003ca href=\"https://twitter.com/KMbappe?ref_src=twsrc%5Etfw\"\u003e@KMbappe\u003c/a\u003e  has reached 200 goals scored in top five European leagues (261 appearances):\u003c/p\u003e\n\u003cp\u003e175 with PSG \u003cbr/\u003e\n16 with Monaco \u003cbr/\u003e\n9 with Real Madrid \u003c/p\u003e\n\u003cp\u003eMilestone.  \u003ca href=\"https://t.co/HHBI01lRut\"\u003epic.twitter.com/HHBI01lRut\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— OptaJose (@OptaJose) \u003ca href=\"https://twitter.com/OptaJose/status/1865518437168001176?ref_src=twsrc%5Etfw\"\u003eDecember 7, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eData debrief: Mbappe brings up double century\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMbappe’s ninth league goal for Madrid was also his 200th in his career across Europe’s top five leagues, on his 261st such appearance.\u003c/p\u003e\n\u003cp\u003eHe netted 16 times for Monaco and 175 times with Paris Saint-Germain. \u003c/p\u003e\n\u003cp\u003eHe was not the only Blancos star with something to celebrate, as Bellingham made it five straight games with a goal for the very first time in Europe’s top leagues, though his second-half exit will concern Carlo Ancelotti.\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-07T22:54:00Z",
  "modifiedTime": null
}
