{
  "id": "e53a9257-d5f8-48e1-b045-3fbcb1513095",
  "title": "Republic of Ireland not good enough in Luxembourg draw, admits Hallgrimsson",
  "link": "https://www.soccernews.com/republic-of-ireland-not-good-enough-in-luxembourg-draw-admits-hallgrimsson/386502/",
  "description": "Heimir Hallgrimsson said the Republic of Ireland failed to do all the good things they did against Senegal after being held to a drab 0-0 draw at Luxembourg. Ireland played out a creditable 1-1 draw against Senegal last time out but followed up with a dull stalemate at the Stade de Luxembourg on Tuesday. Nathan […] The post Republic of Ireland not good enough in Luxembourg draw, admits Hallgrimsson appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Tue, 10 Jun 2025 23:38:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 1333,
  "excerpt": "Heimir Hallgrimsson said the Republic of Ireland failed to do all the good things they did against Senegal after being held to a drab 0-0 draw at Luxembourg. Ireland played out a creditable 1-1 draw against Senegal last time out but followed up with a dull stalemate at the Stade de Luxembourg on Tuesday. Nathan […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Heimir Hallgrimsson said the Republic of Ireland failed to do all the good things they did against Senegal after being held to a drab 0-0 draw at Luxembourg. Ireland played out a creditable 1-1 draw against Senegal last time out but followed up with a dull stalemate at the Stade de Luxembourg on Tuesday. Nathan Collins hit the post in the first half and Troy Parrott had a goal ruled out after the break, with Jack Taylor later smashing the crossbar in a game where Max O’Leary made his debut in goal six years after his first call-up. But, ultimately, it was disappointment for Ireland who took until the 43rd minute to register a shot on goal (Collins’ effort that hit the post). Reflecting on the result with RTE, Ireland boss Hallgrimsson said: “Let’s be honest, we’re not happy with this performance. Ireland debut Clean sheet A solid introduction to international football for Max O’Leary pic.twitter.com/FSEDQ8MF2a — Ireland Football (@IrelandFootball) June 10, 2025 “It is good to keep a clean sheet, it’s the first one since I came in, but we all felt the first half we were sloppy and the game was boring in the first half. “All the good things we did against Senegal were missing, all the quick movements, the press and the ball speed. “We changed in the second half, more tempo and won more duals but not good enough.”",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eHeimir Hallgrimsson said the Republic of Ireland failed to do all the good things they did against Senegal after being held to a drab 0-0 draw at Luxembourg.\u003c/p\u003e\n\u003cp\u003eIreland played out a creditable 1-1 draw against Senegal last time out but followed up with a dull stalemate at the Stade de Luxembourg on Tuesday.\u003c/p\u003e\n\u003cp\u003eNathan Collins hit the post in the first half and Troy Parrott had a goal ruled out after the break, with Jack Taylor later smashing the crossbar in a game where Max O’Leary made his debut in goal six years after his first call-up.\u003c/p\u003e\n\u003cp\u003eBut, ultimately, it was disappointment for Ireland who took until the 43rd minute to register a shot on goal (Collins’ effort that hit the post).\u003c/p\u003e\n\u003cp\u003eReflecting on the result with RTE, Ireland boss Hallgrimsson said: “Let’s be honest, we’re not happy with this performance.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eIreland debut\u003cbr/\u003e\nClean sheet\u003c/p\u003e\n\u003cp\u003eA solid introduction to international football for Max O’Leary \u003ca href=\"https://t.co/FSEDQ8MF2a\"\u003epic.twitter.com/FSEDQ8MF2a\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Ireland Football (@IrelandFootball) \u003ca href=\"https://twitter.com/IrelandFootball/status/1932541735118442889?ref_src=twsrc%5Etfw\"\u003eJune 10, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e“It is good to keep a clean sheet, it’s the first one since I came in, but we all felt the first half we were sloppy and the game was boring in the first half.\u003c/p\u003e\n\u003cp\u003e“All the good things we did against Senegal were missing, all the quick movements, the press and the ball speed.\u003c/p\u003e\n\u003cp\u003e“We changed in the second half, more tempo and won more duals but not good enough.”\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-06-10T23:38:00Z",
  "modifiedTime": null
}
