{
  "id": "0325941c-1eb5-4d30-9a61-cbe848e7ae0e",
  "title": "Bliki: Say Your Writing",
  "link": "https://martinfowler.com/bliki/SayYourWriting.html",
  "description": "",
  "author": "",
  "published": "2025-05-28T09:50:00-04:00",
  "source": "https://martinfowler.com/feed.atom",
  "categories": [
    "bliki"
  ],
  "byline": "Martin Fowler",
  "length": 1832,
  "excerpt": "Read your writing out loud",
  "siteName": "martinfowler.com",
  "favicon": "",
  "text": "Here's one of the best tips I know for writers, which was told to me by Bruce Eckel. Once you've got a reasonable draft, read it out loud. By doing this you'll find bits that don't sound right, and need to fix. Interestingly, you don't actually have to vocalize (thus making a noise) but your lips have to move.1 1: I suspect what matters here is that you need to trigger the part of your brain that processes spoken word as opposed to written word - and that part is sensitive to blandness. This advice is for those who, like me, strive to get a conversational tone to their writings. A lot of people are taught to write in a different way than they speak, but I find prose much more engaging with this conversational tone. I imagine I'm sitting in pub, explaining the concepts to my companions. I've heard people say that when reading my work, they can hear me speaking it - which is exactly the effect I'm after. Too often I read prose that feels flabby. Two kinds of flab stand out: corporate prose and academic prose. I often tell people that if they read their prose and it sounds like it could have come from Accenture 2, then they are doing it wrong. And, of course, the passive voice is rarely preferred. Speaking makes this flab noticeable, so we can cut it out. 2: I pick on Accenture since they are a big consulting company, and thus do all the things needed to sound blandly corporate. The worst case I ran into was many years ago when some sparkling prose by a colleague of mine was turned by editors at Microsoft into a tasteless pudding. There is a perceptible corporate way of writing, often learned subconsciously, that is rife and ruinous. In my case I find I constantly (silently) speak the words as I'm writing.",
  "image": "https://martinfowler.com/logo-sq.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eHere\u0026#39;s one of the best tips I know for writers, which was told to me by\n  Bruce Eckel.\u003c/p\u003e\n\n\u003cp\u003eOnce you\u0026#39;ve got a reasonable draft, read it out loud. By doing this you\u0026#39;ll\n  find bits that don\u0026#39;t sound right, and need to fix. Interestingly, you don\u0026#39;t\n  actually have to vocalize (thus making a noise) but your lips have to\n  move.\u003cspan data-footnote=\"footnote-vocalize\"\u003e1\u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cspan\u003e1: \u003c/span\u003e\n      I suspect what matters here is that you need to trigger the part of your\n      brain that processes spoken word as opposed to written word - and that\n      part is sensitive to blandness. \n    \u003c/p\u003e\n\n\u003cp\u003eThis advice is for those who, like me, strive to get a conversational tone\n  to their writings. A lot of people are taught to write in a different way\n  than they speak, but I find prose much more engaging with this conversational\n  tone. I imagine I\u0026#39;m sitting in pub, explaining the concepts to my companions.\n  I\u0026#39;ve heard people say that when reading my work, they can hear me speaking it\n  - which is exactly the effect I\u0026#39;m after. \u003c/p\u003e\n\n\u003cp\u003eToo often I read prose that feels flabby. Two kinds of flab stand out:\n  corporate prose and academic prose. I often tell people that if they read\n  their prose and it sounds like it could have come from Accenture \u003cspan data-footnote=\"footnote-accenture\"\u003e2\u003c/span\u003e, then they are doing it wrong. And, of course, the passive\n  voice is rarely preferred. Speaking makes this flab noticeable, so we can cut\n  it out.\u003c/p\u003e\n\n\u003cp\u003e\u003cspan\u003e2: \u003c/span\u003e\n      I pick on Accenture since they are a big consulting company, and thus do\n      all the things needed to sound blandly corporate. The worst case I ran\n      into was many years ago when some sparkling prose by a colleague of mine\n      was turned by editors at Microsoft into a tasteless pudding. There is a\n      perceptible corporate way of writing, often learned subconsciously, that is rife\n      and ruinous.\n    \u003c/p\u003e\n\n\u003cp\u003eIn my case I find I constantly (silently) speak the words as I\u0026#39;m writing.\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": "2025-05-28T09:50:00-04:00"
}
