{
  "id": "17a71c48-4108-4195-9305-806f808fb7d4",
  "title": "Youth Challenge Returns in November!",
  "link": "https://blog.jetbrains.com/education/2024/10/22/youth-challenge-returns-in-november/",
  "description": "Prepare yourselves for the second season of the JetBrains Academy Youth Challenge, the competition for young coders and mathematicians. If you missed out last time or are ready to prove yourself again, this is your chance to win special prizes and compete with students worldwide. Choose your track The challenge continues with two tracks: math […]",
  "author": "Alena Gupaisova",
  "published": "Tue, 22 Oct 2024 13:04:07 +0000",
  "source": "https://blog.jetbrains.com/feed",
  "categories": [
    "jetbrains-academy",
    "offline-programs",
    "jetbrainsacademy",
    "jetbrains-academy-youth-challenge"
  ],
  "byline": "Alena Gupaisova",
  "length": 3113,
  "excerpt": "Prepare yourselves for the second season of the JetBrains Academy Youth Challenge, the competition for young coders and mathematicians. The challenge continues with two tracks: math and coding. Participate in both or focus on your specialty.",
  "siteName": "The JetBrains Blog",
  "favicon": "https://blog.jetbrains.com/wp-content/uploads/2024/01/cropped-mstile-310x310-1-180x180.png",
  "text": "The place for learning and teaching computer science your way JetBrains Academy Offline ProgramsYouth Challenge Returns in November! Prepare yourselves for the second season of the JetBrains Academy Youth Challenge, the competition for young coders and mathematicians. If you missed out last time or are ready to prove yourself again, this is your chance to win special prizes and compete with students worldwide. Choose your track The challenge continues with two tracks: math and coding. Participate in both or focus on your specialty. Rules recap: This challenge is for young and creative *human* minds. You must be between 13 and 18 years old. You must be currently enrolled in secondary education. Math track: United we solve Mode: Multiplayer (up to three team members). Remember, you can only be on one team at a time. All participants should register individually. Time limit: 4 hours. Challenge type: Automated problem checking and oral defense. Final round: November 17, 2024. Prize: Your mathematical prowess will be rewarded with an invitation to the second exclusive semester of the Youth Math Club. Registration is open until 10:00 am UTC on November 11. Coder track: Solo quest Mode: Single-player (individual participation). Time limit: 3 hours. Challenge type: A contest with ten algorithmic tasks. Final round: November 24, 2024. Prize: Winners will get the chance to earn a spot in our exclusive on-site programming camp in early 2025. Registration is open until 10:00 am UTC on November 18. Get prepared Start preparing for the competition with us! Join our free online Youth Clubs. They are designed for high schoolers but can also be interesting for younger students who have experience solving tasks outside the standard school curriculum. Registration is open until October 31. Sign up for our Math, AI, and Coding Clubs to gear up for the journey. Get set, code, and solve! Your JetBrains Academy team Subscribe to JetBrains Academy updates Discover more",
  "image": "https://blog.jetbrains.com/wp-content/uploads/2024/10/Blog_1280x720-3.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n    \u003cdiv\u003e\n                        \u003ca href=\"https://blog.jetbrains.com/education/\"\u003e\n                            \u003cimg src=\"https://blog.jetbrains.com/wp-content/uploads/2020/07/JetBrains-Academy-1.svg\" alt=\"Education logo\"/\u003e\n                                                                                                \n                                                                                    \u003c/a\u003e\n                                                    \u003cp\u003eThe place for learning and teaching computer science your way\u003c/p\u003e\n                                            \u003c/div\u003e\n                            \u003csection data-clarity-region=\"article\"\u003e\n                \u003cdiv\u003e\n                    \t\t\t\t\u003cp\u003e\u003ca href=\"https://blog.jetbrains.com/education/category/jetbrains-academy/\"\u003eJetBrains Academy\u003c/a\u003e\n\t\t\t\u003ca href=\"https://blog.jetbrains.com/education/category/offline-programs/\"\u003eOffline Programs\u003c/a\u003e\u003c/p\u003e\u003ch2 id=\"major-updates\"\u003eYouth Challenge Returns in November!\u003c/h2\u003e                    \n                    \n\u003cp\u003ePrepare yourselves for the second season of the JetBrains Academy Youth Challenge, the competition for young coders and mathematicians. If you missed out \u003ca href=\"https://lp.jetbrains.com/youth_challenge/hall_of_fame_2024/\" target=\"_blank\" rel=\"noopener\"\u003elast time\u003c/a\u003e or are ready to prove yourself again, this is your chance to win special prizes and compete with students worldwide.\u003c/p\u003e\n\n\n    \n\n\n\n\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" fetchpriority=\"high\" width=\"1280\" height=\"720\" src=\"https://blog.jetbrains.com/wp-content/uploads/2024/10/Blog_1280x720-3.png\" alt=\"\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003eChoose your track\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe challenge continues with two tracks: math and coding. Participate in both or focus on your specialty.\u003c/p\u003e\n\n\n\n\u003cp\u003eRules recap:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThis challenge is for young and creative *human* minds.\u003c/li\u003e\n\n\n\n\u003cli\u003eYou must be between 13 and 18 years old.\u003c/li\u003e\n\n\n\n\u003cli\u003eYou must be currently enrolled in secondary education.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\n\n\n\n\n\n\n\n\u003cp\u003e\u003cstrong\u003eMath track: United we solve\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eMode: Multiplayer (up to three team members). Remember, you can only be on one team at a time. All participants should register individually.\u003c/li\u003e\n\n\n\n\u003cli\u003eTime limit: 4 hours.\u003c/li\u003e\n\n\n\n\u003cli\u003eChallenge type: Automated problem checking and oral defense.\u003c/li\u003e\n\n\n\n\u003cli\u003eFinal round: November 17, 2024.\u003c/li\u003e\n\n\n\n\u003cli\u003ePrize: Your mathematical prowess will be rewarded with an invitation to the second exclusive semester of the \u003ca href=\"https://lp.jetbrains.com/youth-math-club/\" target=\"_blank\" rel=\"noopener\"\u003eYouth Math Club\u003c/a\u003e.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eRegistration is open until 10:00 am UTC on November 11.\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\n\n\n\n\n\n\n\n\u003cp\u003e\u003cstrong\u003eCoder track: Solo quest\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eMode: Single-player (individual participation).\u003c/li\u003e\n\n\n\n\u003cli\u003eTime limit: 3 hours.\u003c/li\u003e\n\n\n\n\u003cli\u003eChallenge type: A contest with ten algorithmic tasks.\u003c/li\u003e\n\n\n\n\u003cli\u003eFinal round: November 24, 2024.\u003c/li\u003e\n\n\n\n\u003cli\u003ePrize: Winners will get the chance to earn a spot in our exclusive \u003ca href=\"https://lp.jetbrains.com/acts_serbia/\" target=\"_blank\" rel=\"noopener\"\u003eon-site programming camp\u003c/a\u003e in early 2025.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eRegistration is open until 10:00 am UTC on November 18.\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\u003ch2\u003eGet prepared\u003c/h2\u003e\n\n\n\n\u003cp\u003eStart preparing for the competition with us! Join our free online Youth Clubs. They are designed for high schoolers but can also be interesting for younger students who have experience solving tasks outside the standard school curriculum. Registration is open until October 31.\u003c/p\u003e\n\n\n\n\u003cp\u003eSign up for our \u003ca href=\"https://jb.gg/d6gqc4\" target=\"_blank\" rel=\"noopener\"\u003eMath\u003c/a\u003e, \u003ca href=\"https://jb.gg/kfq5av\" target=\"_blank\" rel=\"noopener\"\u003eAI\u003c/a\u003e, and \u003ca href=\"https://jb.gg/b86vk9\" target=\"_blank\" rel=\"noopener\"\u003eCoding\u003c/a\u003e Clubs to gear up for the journey.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eGet set, code, and solve!\u003c/p\u003e\n\n\n\n\u003cp\u003eYour JetBrains Academy team\u003c/p\u003e\n\n\n\n\n                    \n                                                                                                                                                                                                                            \u003cdiv\u003e\n                                \u003cdiv\u003e\n                                                                            \u003ch4\u003eSubscribe to JetBrains Academy updates\u003c/h4\u003e\n                                                                                                            \n                                \u003c/div\u003e\n                                \n                                \u003cp\u003e\u003cimg src=\"https://blog.jetbrains.com/wp-content/themes/jetbrains/assets/img/img-form.svg\" alt=\"image description\"/\u003e\n                                                                    \u003c/p\u003e\n                            \u003c/div\u003e\n                                                            \u003c/div\u003e\n                \u003ca href=\"#\"\u003e\u003c/a\u003e\n                \n                \n            \u003c/section\u003e\n                    \u003cdiv\u003e\n                \u003cp\u003e\n                    \u003ch2\u003eDiscover more\u003c/h2\u003e\n                \u003c/p\u003e\n                \n            \u003c/div\u003e\n                \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
