{
  "id": "1f46e9d2-b654-47d2-87b3-ffe26cb749cb",
  "title": "Google’s Cybersecurity Model Sec-Gemini Enables SecOps Workflows for Root Cause and Threat Analysis",
  "link": "https://www.infoq.com/news/2025/04/sec-gemini-cybersecurity-ai/?utm_campaign=infoq_content\u0026utm_source=infoq\u0026utm_medium=feed\u0026utm_term=global",
  "description": "Google’s new cybersecurity model Sec-Gemini focuses on cybersecurity AI to enable SecOps workflows for root cause analysis (RCA) and threat analysis, and vulnerability impact understanding. By Srini Penchikala",
  "author": "Srini Penchikala",
  "published": "Tue, 15 Apr 2025 15:35:00 GMT",
  "source": "https://feed.infoq.com",
  "categories": [
    "Security",
    "DevSecOps",
    "Gemini",
    "Threat detection",
    "Google",
    "Artificial Intelligence",
    "AI, ML \u0026 Data Engineering",
    "news"
  ],
  "byline": "Srini Penchikala",
  "length": 3464,
  "excerpt": "Google’s new cybersecurity model Sec-Gemini focuses on cybersecurity AI to enable SecOps workflows for root cause analysis (RCA) and threat analysis, and vulnerability impact understanding.",
  "siteName": "InfoQ",
  "favicon": "https://cdn.infoq.com/statics_s1_20250413214448/apple-touch-icon.png",
  "text": "Google’s new cybersecurity model Sec-Gemini focuses on cybersecurity AI to enable SecOps workflows for root cause analysis (RCA) and threat analysis, and vulnerability impact understanding. Google Cybersecurity x AI research lead Elie Bursztein announced last week the release of Sec-Gemini v1. Security defender teams typically face the task of securing against all cyber threats, while attackers need to successfully find and exploit only a single vulnerability. This asymmetry has made securing systems difficult, time consuming and error prone. AI-powered cybersecurity workflows can help shift the balance back to the defenders by force multiplying cybersecurity professionals. They also help security analysts understand the risk and threat profile associated with specific vulnerabilities faster. Enabling SecOps workflows requires state-of-the-art reasoning capabilities and current cybersecurity knowledge. Sec-Gemini v1 achieves this by combining Google Gemini’s Large Language Model (LLM) capabilities with near real-time cybersecurity knowledge and tooling. This allows it to achieve a better performance when using it on cybersecurity workflows like incident root cause analysis, threat analysis, and vulnerability impact understanding. Sec-Gemini v1 leverages various data sources including Google Threat Intelligence (GTI), Open-Source Vulnerabilities database operated by Google (OSV) and Mandiant Threat intelligence data. An example shown on the website highlights Sec-Gemini v1’s answers in response to key cybersecurity questions where the framework, using up-to-date accurate threat actor information, is able to determine that Salt Typhoon is a threat actor and provides a description of that threat actor. The output includes not only vulnerability details (based on OSV data), but also the contextualization of vulnerabilities with respect to threat actors (using Mandiant data). The framework performs well on key cybersecurity benchmarks like Cyber Threat Intelligence Multiple Choice Questions (CTI-MCQ), a leading threat intelligence benchmark and the Cybersecurity Threat Intelligence-Root Cause Mapping (CTI-RCM) benchmark. Since last year Google has been integrating Gemini product into AI enabled security and compliance strategy programs, including AI-driven security with Google Cloud and Google Security Operations. Last year’s The State of AI and Security Survey Report published by Google Cloud and Cloud Security Alliance (CSA) highlights the AI’s potential to enhance security measures and improve threat detection and response capabilities. Several other organizations including NVIDIA and RedHat are increasingly leveraging AI technologies in cybersecurity use cases to quickly detect anomalies, threats, and vulnerabilities by processing large amounts of data in a short time. Some of these use cases include anomaly detection and AI-assisted code scanning. It’s important to note that Sec-Gemini v1 is still an experimental cybersecurity model. The team is making it freely available to select organizations, institutions, professionals, and NGOs for research purposes. Google team provided an early access request for their Trusted Tester recruitment program but the forum is currently closed due to the team receiving a lot of requests from the community. About the Author Srini Penchikala",
  "image": "https://res.infoq.com/news/2025/04/sec-gemini-cybersecurity-ai/en/headerimage/Googles-Cybersecurity-Model-Sec-Gemini-Enables-SecOps-Workflows-for-Root-Cause-and-Threat-Analysis-header-1744730391459.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003eGoogle’s new cybersecurity model \u003ca href=\"https://security.googleblog.com/2025/04/google-launches-sec-gemini-v1-new.html\"\u003eSec-Gemini\u003c/a\u003e focuses on cybersecurity AI to enable SecOps workflows for root cause analysis (RCA) and threat analysis, and vulnerability impact understanding. Google Cybersecurity x AI research lead Elie Bursztein \u003ca href=\"https://www.linkedin.com/posts/bursztein_very-excited-to-announce-sec-gemini-v1-our-activity-7314003739063791616-kFNy\"\u003eannounced last week\u003c/a\u003e the release of Sec-Gemini v1.\u003c/p\u003e\n\n\u003cp\u003eSecurity defender teams typically face the task of securing against all cyber threats, while attackers need to successfully find and exploit only a single vulnerability. This asymmetry has made securing systems difficult, time consuming and error prone. AI-powered cybersecurity workflows can help shift the balance back to the defenders by force multiplying cybersecurity professionals. They also help security analysts understand the risk and threat profile associated with specific vulnerabilities faster.\u003c/p\u003e\n\n\u003cp\u003eEnabling SecOps workflows requires state-of-the-art reasoning capabilities and current cybersecurity knowledge. Sec-Gemini v1 achieves this by combining \u003ca href=\"https://gemini.google.com/\"\u003eGoogle Gemini’s\u003c/a\u003e Large Language Model (LLM) capabilities with near real-time cybersecurity knowledge and tooling. This allows it to achieve a better performance when using it on cybersecurity workflows like incident root cause analysis, threat analysis, and vulnerability impact understanding.\u003c/p\u003e\n\n\u003cp\u003eSec-Gemini v1 leverages various data sources including Google Threat Intelligence (\u003ca href=\"https://cloud.google.com/security/threats\"\u003eGTI\u003c/a\u003e), Open-Source Vulnerabilities database operated by Google (\u003ca href=\"https://osv.dev/\"\u003eOSV\u003c/a\u003e) and \u003ca href=\"https://www.mandiant.com/\"\u003eMandiant\u003c/a\u003e Threat intelligence data. An example shown on the website highlights Sec-Gemini v1’s answers in response to key cybersecurity questions where the framework, using up-to-date accurate threat actor information, is able to determine that \u003ca href=\"https://en.m.wikipedia.org/wiki/Salt_Typhoon\"\u003eSalt Typhoon\u003c/a\u003e is a threat actor and provides a description of that threat actor. The output includes not only vulnerability details (based on OSV data), but also the contextualization of vulnerabilities with respect to threat actors (using Mandiant data). The framework performs well on key cybersecurity benchmarks like Cyber Threat Intelligence Multiple Choice Questions (CTI-MCQ), a leading threat intelligence benchmark and the Cybersecurity Threat Intelligence-Root Cause Mapping (CTI-RCM) benchmark.\u003c/p\u003e\n\n\u003cp\u003eSince last year Google has been integrating Gemini product into AI enabled security and compliance strategy programs, including \u003ca href=\"https://cloud.google.com/blog/products/identity-security/advancing-the-art-of-ai-driven-security-with-google-cloud-at-rsa\"\u003eAI-driven security with Google Cloud\u003c/a\u003e and \u003ca href=\"https://cloud.google.com/chronicle/docs/secops/gemini-chronicle\"\u003eGoogle Security Operations\u003c/a\u003e. Last year’s \u003ca href=\"https://cloudsecurityalliance.org/artifacts/the-state-of-ai-and-security-survey-report\"\u003eThe State of AI and Security Survey Report\u003c/a\u003e published by Google Cloud and Cloud Security Alliance (\u003ca href=\"https://cloudsecurityalliance.org/\"\u003eCSA\u003c/a\u003e) highlights the AI’s potential to enhance security measures and improve threat detection and response capabilities. Several other organizations including \u003ca href=\"https://developer.nvidia.com/topics/ai/cybersecurity-ai\"\u003eNVIDIA\u003c/a\u003e and \u003ca href=\"https://www.redhat.com/en/blog/4-use-cases-ai-cyber-security\"\u003eRedHat\u003c/a\u003e are increasingly leveraging AI technologies in cybersecurity use cases to quickly detect anomalies, threats, and vulnerabilities by processing large amounts of data in a short time. Some of these use cases include anomaly detection and AI-assisted code scanning.\u003c/p\u003e\n\n\u003cp\u003eIt’s important to note that Sec-Gemini v1 is still an experimental cybersecurity model. The team is making it freely available to select organizations, institutions, professionals, and NGOs for research purposes. Google team provided an \u003ca href=\"https://docs.google.com/forms/d/1MBVz-2Zf7u8fEiZlP2_Kw_ZIlu-NQ372dkodFhqcYaQ/\"\u003eearly access request\u003c/a\u003e for their Trusted Tester recruitment program but the forum is currently closed due to the team receiving a lot of requests from the community.\u003c/p\u003e\n\n\n\n\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n  \n    \u003cdiv\u003e \n        \u003ch2\u003eAbout the Author\u003c/h2\u003e \n\n        \n            \n                \n            \n            \u003cdiv data-id=\"author-Srini-Penchikala\"\u003e\n                    \u003ch4\u003e\u003cstrong\u003eSrini Penchikala\u003c/strong\u003e\u003c/h4\u003e\n                    \n                \u003c/div\u003e\n        \n    \u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-15T00:00:00Z",
  "modifiedTime": null
}
