{
  "id": "31817314-7ca0-4fef-9e92-de691c0a12c8",
  "title": "Technology in Language Learning (Maya Goodall)",
  "link": "https://thewomenintechshow.com/2021/03/02/s3e1-technology-in-language-learning-maya-goodall/",
  "description": "Technology impacts the way we learn new languages. Maya Goodall, Senior Director at Rosetta Stone, explained how different technologies are used in language learning. We talked about Lingual Learning, a company she co-founded to help students learn English. Maya explained the challenges students face and the importance of embracing heritage languages and diverse backgrounds. We also talked about her current work at Rosetta Stone, and how they’re using Artificial Intelligence in tools for language learning.",
  "author": "edaena",
  "published": "Tue, 02 Mar 2021 18:00:00 +0000",
  "source": "https://thewomenintechshow.com/category/podcast/feed/",
  "categories": [
    "podcast",
    "Artificial Intelligence",
    "Language Learning"
  ],
  "byline": "",
  "length": 26839,
  "excerpt": "Technology impacts the way we learn new languages. Maya Goodall, Senior Director at Rosetta Stone, explained how different technologies are used in language learning. We talked about Lingual Learni…",
  "siteName": "The Women in Tech Show",
  "favicon": "",
  "text": "Subscribe: Apple Podcasts | Spotify | Android Technology impacts the way we learn new languages. Maya Goodall, Senior Director at Rosetta Stone, explained how different technologies are used in language learning. We talked about Lingual Learning, a company she co-founded to help students learn English. Maya explained the challenges students face and the importance of embracing heritage languages and diverse backgrounds. We also talked about her current work at Rosetta Stone, and how they’re using Artificial Intelligence in tools for language learning. @techwomenshow Maya Goodall Transcript ES: I’m Edaena Salinas, software engineer and host of The Women in Tech Show, a podcast about what we work on, not what it feels like to be a woman in tech. For more information about the show, go to wit.fm Technology impacts the way we learn new languages. Maya Goodall, Senior Director at Rosetta Stone, explained how different technologies are used in language learning. We talked about Lingual Learning, a company she co-founded to help students learn English. Maya explained the challenges students face and the importance of embracing heritage languages and diverse backgrounds. We also talked about her current work at Rosetta Stone, and how they’re using Artificial Intelligence in tools for language learning. Maya, welcome to The Women in Tech Show MG:  Thank you so much for having me. I’m thrilled to be here.  ES:  I want to begin our conversation by talking about entrepreneurship. In 2012, you founded Lingual Learning along with Christy Shelley. This company was later acquired by Rosetta Stone, which is where you currently work.  What was the main idea behind lingual learning?  MG:  The main idea behind legal learning was to help learners at school who are non-native speakers of English achieved parity with their native speaking counterparts.  We built lingual learning ourselves because no one else was giving emergent bilinguals an opportunity to talk in class. We wanted to flip the traditional classroom model where the teacher does most of the talking and put the emergent bilinguals in the talking seat.  ES:  What’s usually the background of emerging bilinguals?  MG:  Traditionally, these students have been referred to as English learners, and we felt that was a deficit point of view, focusing on what the learner didn’t have rather than who they were becoming bilingual, we wanted our language to reflect our beliefs that heritage language has value and can be used to learn the second language.  ES:  Can you talk about some general statistics of emerging bilinguals? I want to get an idea of how big this project was.  MG:  Yes, well, about one in four students. By the year 2025 will be considered an emergent bilingual, and the interesting thing about that number is of those one in four, about 85% of those learners were actually born in the United States. Most people have this notion that emergent bilinguals are recent immigrants. Or they, you know, just arrived to the United States. But in fact, they’re usually American citizen, and they have had the benefit of growing up in a house where their parents are speaking another language to them, and they get to go to school and become bilingual there. It’s a large population and it’s going to continue to grow in the United States.  ES:  So you’re mentioning you’re starting Lingual Learning, particularly to tackle this this challenge. Back when you were starting it, what were the first signs that you saw to come up with an idea and to decide this is a viable company.  MG:  Yes, well, I came from the classroom. I was a classroom teacher and I taught in the United States Spanish actually, so ESL. So I taught in English and Spanish. And then I also taught English as a foreign language outside of the country. These two kind of definitions or points of view for second language acquisition really struck me. In California at the time, there was a law being passed called 227, which was the English only law because people were wondering whether or not students could learn how to read, write and speak in two languages at the same time.  When I left the country and taught English as a foreign language, those teachers knew the answer that of course someone can learn how to read, write, and speak two languages at the same time. There was no disconnect there.   They concerned themselves with how best to achieve that goal. So when I came back to the United States, I actually started working for a large traditional publisher, and it was there that I met Christy Shelly, my business partner. We were having conversations with educators across the nation about how to help their, then referred to as “English learners” because generally, there was something else going on and that was, the learners were expected to learn English, and also subject matter content like math, science, social studies at the same time. Most of the teachers were not trained for foreign language teaching or second language acquisition, so they were focusing exclusively on the subject matter, sort of skipping over the language teaching.  We saw this to be a problem over and over again as we visited and spoke with administrators in the United States. That’s how we knew that this was something that we wanted to tackle. Christy also is an educator, so we both had that mission always in mind, and through talking with so many people trying to help their learners do two things at once, learn content subject matter in English. We knew it’s something we wanted to dedicate ourselves to.  ES:  Earlier you mentioned that to approach this, you wanted to shift the focus away from more traditional approaches, like having the teacher constantly talking to the students.  Can you talk about key differences in the learning approach?  MG:  The traditional approaches follows this idea that if you do a lot of speaking or create input for the learner, they will naturally start to understand that input and then they will create their own output. They’ll start speaking and that traditional view is really based on native language learning. So if you think about a baby and its caregivers and if they are talking and singing and producing language, the baby will learn that language. In fact, our brains are wired for it.  So the idea was that for the second language we could follow the same course of action provide lots of input that the learner could understand and eventually they would create their own output. But what we know is that second language learning isn’t exactly the same as first language learning, and you actually have to give instruction for the second language, which is great, and it’s also viable to use the first language as in teaching, we call that background knowledge.  If the learner has any sense or understands the subject that you’re going to teach them, you sort of create a hook on to what they already know, and then a bridge to the new subject. So in this case, all the learners already know a language, so we can use that as a hook, create a bridge, and help them learn the second language.  ES:  Speaking in a little more detail about this, but I like the analogy that you mentioned of the bridge and the hook. Bringing this back to the company. Can you talk about some of the solutions that you were building at the company.   MG:  For Lingual Learning what we were doing was building opportunities for the students to actually practice speaking. We used particular types of scaffolding, which is breaking language down for the learner in English, so that they could, the teachers could hand over that language and have the learners create it for themselves.  What we were finding is that teachers were so used to doing all of the talking, that they didn’t actually give the learners time to practice speaking. When you’re learning a second language. You need a lot of time for repetition. You need a lot of think time. There’s a lot of mental processing going on, and traditionally the classroom is a very fast place. And teachers weren’t necessarily allowing the students all the time they need to digest new language information and then create it again in new utterances for themselves. So we really wanted to make that easy. We wanted to have a step by step flow that the teachers could follow that they could feel good about. One of the concerns we heard over and over again is: how will I know that my learners are actually talking about what they’re supposed to be talking about? So we really wanted to ease the teachers burden with that and create a step by step flow so that whenever the teacher stopped to listen to the learners, they could know exactly what to listen for if they heard that, then they could move on to the next group, let’s say. But we really wanted to build in that speaking practice time for the learners so that they could digest the new language.  ES:  Sounds like you were building a lot of activities and curriculum and guidance around this, right?  MG:  That’s right.  ES:  How big was the team at the time?  MG:  The team at the time was started with Christiane myself, so it was just the pair of us we actually designed All of the activities and curriculum and then we started working with other people on a contract basis.  We were very lucky people were really aligned with our mission and People gave us a lot of their time for free and helped us think through some of the activities and the curriculum and do some of the writing, but the majority of all of the work was done by Christy and I. We had the good fortune of being able to take our curriculum directly to the schools and work with hundreds of teachers, actually, we got a lot of feedback from the teachers. We learned a lot from them about implementation and because we were so small, we were able to take that research basically that they were giving us and apply it immediately to our curriculum. So we had a symbiotic relationship with the teachers and administrators, the campuses that we were working with. And we were able to take their information, apply it directly into what we were doing, and make sure that we had a positive outcome.  ES:  I really like this because it’s a clear example of you built a company in an area that you have already been working on, got exposure internationally and then. You are basically solving a problem that you are constantly seeing.   MG:  Yes, that’s right. That was our goal. We were trying to solve a problem that people were clamoring about actually. So in the United States there’s another term for emergent bilinguals, an that’s called long term English learners.  And when you have a student who starts kindergarten and is labeled or identified as an English learner and then gets to about the 5th grade and hasn’t progressed in their English language proficiency, they then get a new label of long-term English learner, and we knew that we wanted to help solve that problem. We know that it’s possible for learners to become bilingual. And we know that something was missing and that missing piece we saw over and over again was this opportunity for speaking practice.  ES:  In 2017, the company was sold to Rosetta Stone. How did this conversation start?  MG:  Well, Christy and I knew that we had a mission ourselves in terms of how many learners lives we wanted to affect. So we had a goal and we knew that in order to achieve that goal we were going to have to partner with a larger company or get funding. And that’s because we knew we had actually always had the idea to be an edtech company, and in fact had first started our platform online when we approached our first customer and they asked us for our curriculum, they told us they didn’t have the online infrastructure in their school district to support it that way, and they asked us to actually go back and print out the lessons for them. And so we did, and so that took us down a print road that we were not expecting. We had always kept in mind though that we wanted to be edtech.  And we wanted to be able to, you know, affect more students lives through technology. So 2017 was about five years after we founded, and we knew that it was time for us to broach that subject again. We attended incubators and some other places within the ecosystem to see who might be a good fit for us and the very first person we met was the President of Lexia. So Lexia Learning and Rosetta Stone are sister companies and at the time they were looking for away to reach into the emergent bilingual market. And so it was perfect timing.  We both have the same mission which is to help learners and change their lives through the power of literacy and language education. So it felt very serendipitous and like the right fit from the very beginning.  ES:  One thing I’m also curious about is, when these conversations are starting to happen and you’re both on the same page, and it seems like you are targeting the same goal. Then we have to move on to the next phase, which is how is that acquisition going to happen? What were some things that you and your partner were thinking about in terms of do we need to negotiate? Did you negotiate, or how did you prepare for this situation?  MG:  Yes, we did negotiate and the negotiation process took about a year, so it was not a quick turn around.  We had our legal representation help us with our negotiations. We also reached out to former colleagues who we knew had been through negotiations themselves, so just ask questions and help us think through what types of questions to ask and you know what types of things to look for.  So slowly, overtime, the negotiations took place an honestly every step of the way felt right. It felt good. There was no time where we felt unsettled or thought that maybe this wasn’t the right thing.  It was just a matter of getting the details right, but we really, because of the alignment and because basically of the technology assets that we knew we would have access to, we were really excited about the process.  ES:  Can you talk about some of the key learnings during this negotiation process? You’re mentioning you’re leveraging a lot your network, getting feedback from other people that have been in this situation, was there something that surprised you or that you were glad you were told?  MG:  Oh that’s great. Well, I think the most surprising thing is that negotiations don’t have to be difficult or scary. In fact, it’s you know like minded people trying to reach an agreement so that everybody, at least in our case, so that everybody could win and get what they wanted and for us, because we’re in education, the ultimate goal is to make sure that we have this opportunity to create, you know, curriculum that is going to help the learner. All of us have that same mission to serve the learner. So I think it made these negotiations possibly a little easier because we have kind of an altruistic goal along with the rest of the goals that we’ve got.  ES:  You’re currently senior director at Rosetta Stone. You started working here after that acquisition. They are mostly known for their language learning products. Me personally, I used them a lot growing up, so I have very fond memories of them.  Can you talk in more detail what Rosetta Stone is all about now?  MG:  Yes, so one of the reasons that we’re Christy and I are both with Rosetta Stone is because they wanted to purchase our intellectual property and they wanted to keep us on board to help build out the program.  So we, again just kind of illuminates, our relationship with the company was very good from the beginning. So Rosetta Stone, you know has been around since 1992 and their original mission. It was, you know, very much what our mission is and to help students or learners of any age really become bilingual, learn that second language. For us, at Lingual Learning and Christy and I, in particular that bilingualism helps promote the cause of peace in terms of just being able to communicate with more people, having better problem solving skills and really you know, just getting to know others and understanding others. We really feel that mission through bilingualism.  So one of the assets that we were really most excited about with Rosetta Stone was their speech recognition engine. They have been perfecting that for the last 25 years and using that as a means for emerging. Their emerging technology, where a person can speak right away with the engine and get feedback was what we were trying to do in terms of replicate our activities and all that speaking practice that we had on in our paper base curriculum. We knew we would be able to replicate in some way using that speech recognition technology.  ES:  That’s awesome because just to contrast, when I was using Rossetta Stone, it was basically a CD and you would hear the words and then you’re repeating, but nobody is giving you feedback. You don’t know how correctly you’re saying it, so the fact that now they’re leveraging speech recognition engines, it makes it more like having a teacher right there in person, giving you feedback or someone else that’s familiar with the language, right?  MG:  Yes, that’s exactly right, and that feedback, corrective feedback is really important to the learning process. Actually, to whatever subject you’re trying to learn, and especially so with language.  Being able to leverage that technology and give the learner corrective feedback immediately was so important to us and it’s one of the things that we’re very proud of. We can give corrective feedback and let the learner know exactly what they have said correctly and how well they’ve done it because that’s important to cognition and to keep motivation to learn. And then we can also give them feedback as to where they may have made a mistake, how to correct that mistake, practice the correction and then try again.  ES:  As part of your role at Rosetta Stone, you collaborate a lot more with people from different areas like UI designers, other content creators, engineers, can you talk about what that collaboration looks like when you’re all aiming to build solutions in the space of emerging learners?  MG:  Yes, one of the first things we did to bring all of the verticals together, because this project was new, many of the team members were also new to the company, or they were new to working on this particular project, and so one of the first things we did to bring the verticals together was a design sprint. And that design sprint really helped us understand the vision that we were trying to create, get everybody sort of in the same mindset as to what it was we were looking for and help everybody have a voice on this new project. So that design sprint was really important for us after the design Sprint, we went through another kind of thought process and that was to think about our unconscious bias and create guiding principles.  We knew that we were going to be working with UI, UX designers and engineers and the speech recognition, engineers and developers, and we knew that we would need guiding principles that we could all use on a daily basis to help us when we had questions.  We have four very straightforward guiding principles and they are: to design learning experiences from an asset based orientation. You heard me talk about the emergent bilingual with feel that that language represents our asset based orientation towards the learners. Our second guiding principle, is to design learning experiences in which multilingualism is valued and seen as a resource. We knew we were teaching English and we could do this from a monolingual mindset, meaning only English is going to be referred to or talked about or used in the UI UX. However, because we have this guiding principle,  we were able to make decisions that all of the characters that the learners work with are themselves bilingual.  They come from different parts of the world. Some were born in the United States. Some were not born in the United States, but the thing that they all have in common is that they are all becoming bilingual by learning English. Our guiding principle number three is to design learning experiences in which diverse cultures and identities are valued and seen as a resource. Again, referring to the characters that the learners interact with on line. And then finally our guiding principle for which is to design learning experiences that honor and strategically leverage the school family connection that the school family connection is well researched. And it was something that we wanted to also leverage within our product by providing the parents with knowledge about what the learners were doing and also for the characters themselves to refer to and talk about their own family experience.  There’s a story I like to tell with regard to the speech recognition engineers. We were discussing our artificial intelligence, so the speech recognition engine uses AI to understand the learner and to machine learning through the data to make our algorithms better overtime in terms of how we rate the learner and their speech. One of the questions that came up was: do we train the speech recognition engine to accept only what’s considered standard American English? Kind of a Midwestern accent from the United States, and it was easy to answer that question because we could look directly at our guiding principles, and our guiding principle number two, which says to design learning experiences in which multilingualism is valued and seen as a resource, gave us the answer.  We knew that our learners were coming to us with an accent and that they would pronounce words based on their first language pronunciation based on heritage, language or first language is also well documented. Phoneme blends or accents depending on the first language is well known. So the engineers were able to code the speech recognition engine for those well known phoneme blends and accept pronunciations outside of the standard form. This is in line with our thinking. It’s in line with our principle #3, which is to design learning experiences in which diverse cultures and identities are valued. So these guiding principles are really important to all the verticals and they are a living, breathing document. If you will that we refer to nearly on a daily basis.  ES:  From your experience and having work with students, can you talk about the impact of this key decision? It resonates a lot with me because sometimes people kpep training you to pronounce a certain way and then eventually a lot of people lose their accents with all this training. What is your opinion on this, The impact of deciding to accept words with an accent.   MG:  We wanted to send the message that We understand and know that English is a language that is spoken around the world and that the way that people speak English with their accents and pronunciation is 100% acceptable. We really feel that grammar and syntax is the basis for being understood, and that pronunciation or accents are part of language, and opening up to having acceptance for that was really important to us. In terms of what we’ve heard back from the teachers and the students, it is overwhelming positive responses.In fact, so far we haven’t really had any pushback or negative responses.  It’s been so well received, especially because we hear from teachers and the students themselves that they finally see themselves reflected on the screen. And again, with our design principles we wanted to create what are called windows and mirrors. So we wanted the learner to have a mirror reflection of themselves and we also wanted to create Windows so they could see who they might become.  ES:  Before we finish, I want to talk a little bit more about the senior director role. From what you were mentioning earlier, there’s a lot of guiding the team and then having this principles, coordinating design sprints. From your experience what have been other things that you get to work on as a senior director?  MG:  Yes, it’s been very exciting because I’ve been able to work on the content which drives you know the whole entire project and then all the different components that bring that content together. So understanding and leveraging the adaptive blended learning model that Lexia Learning brings to the table in terms of assessments without testing. So everything the learner does onscreen, everything they speak into the speech recognition engine, every click that they make when answering multiple choice questions is being recorded. And that’s done through our platform called My Lexia, which gives teachers immediate feedback. So that’s been exciting and actually very personal to me because in the education field I’ve been acutely aware of the fact that teachers usually don’t have data when it comes to language proficiency learning, how much the learner has accomplished and they don’t have data that can drive instruction in terms of what exact skill they would need to learn next to help them move to the next language proficiency level. So working on the My Lexia and assessment team has been very exciting learning more about the speech recognition engine and how that work.  We also used our own content management system, so just working with all of these different areas to bring this project to life has been a wonderful learning experience for me and also just personally, you know, the most important project that I’ve worked on in my career so far.  ES:  What are some important skills of somebody in a leadership?  MG:  I think first and foremost it’s listening with an open mind and really trying to understand what the other person is saying. There are different ways to listen, and one way to listen that will breakdown communication immediately is to listen to find holes, or listen to respond, and you know really learning how to listen to what another person is saying, and assume that what they’re saying in their experience is true, taking that in and then rsponding, I think, is one of the biggest things that I’ve learned in the last three years. I do spend time reading books.  I study mindfulness meditation and listen to a lot of motivational podcasts to help me continuously grow as an individual and also as a team member with other people.  ES:  Well, Maya thank you so much for coming on the show. It’s been really nice chatting with you.  MG: Thank you so much. It’s been wonderful chatting with you as well.  Sponsors",
  "image": "https://thewomenintechshow.com/wp-content/uploads/2021/03/maya-goodall.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-4850\" itemscope=\"itemscope\" itemtype=\"http://schema.org/BlogPosting\" itemprop=\"blogPost\"\u003e\n\n\t\n\n\t\n\n\t\u003cdiv itemprop=\"text\"\u003e\n\t\t\n\u003cfigure\u003e\u003caudio controls=\"\" src=\"https://media.blubrry.com/thewomenintechshow/wintshow.files.wordpress.com/2021/03/s3e1-maya-goodall.mp3\"\u003e\u003c/audio\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eSubscribe: \u003ca href=\"https://itunes.apple.com/us/podcast/the-women-in-tech-show/id1126670901?mt=2\"\u003eApple Podcasts\u003c/a\u003e | \u003ca href=\"https://open.spotify.com/show/773JX27XtayJckdUa2Iaqr\"\u003eSpotify\u003c/a\u003e | \u003ca href=\"http://subscribeonandroid.com/thewomenintechshow.com/category/podcast/feed/\"\u003eAndroid\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eTechnology impacts the way we learn new languages. Maya Goodall, Senior Director at Rosetta Stone, explained how different technologies are used in language learning. We talked about Lingual Learning, a company she co-founded to help students learn English. Maya explained the challenges students face and the importance of embracing heritage languages and diverse backgrounds. We also talked about her current work at Rosetta Stone, and how they’re using Artificial Intelligence in tools for language learning.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://twitter.com/techwomenshow\"\u003e@techwomenshow\u003c/a\u003e\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg data-attachment-id=\"4853\" data-permalink=\"https://thewomenintechshow.com/maya-goodall/\" data-orig-file=\"https://thewomenintechshow.com/wp-content/uploads/2021/03/maya-goodall.jpg\" data-orig-size=\"314,314\" data-comments-opened=\"0\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;1\u0026#34;}\" data-image-title=\"maya-goodall\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://thewomenintechshow.com/wp-content/uploads/2021/03/maya-goodall.jpg?w=300\" data-large-file=\"https://thewomenintechshow.com/wp-content/uploads/2021/03/maya-goodall.jpg?w=314\" tabindex=\"0\" role=\"button\" src=\"https://thewomenintechshow.com/wp-content/uploads/2021/03/maya-goodall.jpg?w=314\" alt=\"\" width=\"314\" height=\"314\" srcset=\"https://thewomenintechshow.com/wp-content/uploads/2021/03/maya-goodall.jpg 314w, https://thewomenintechshow.com/wp-content/uploads/2021/03/maya-goodall.jpg?w=150 150w, https://thewomenintechshow.com/wp-content/uploads/2021/03/maya-goodall.jpg?w=300 300w\" sizes=\"(max-width: 314px) 100vw, 314px\"/\u003e\u003cfigcaption\u003eMaya Goodall\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003e\u003cstrong\u003eTranscript\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eES:\u003c/p\u003e\n\n\n\n\u003cp\u003eI’m Edaena Salinas, software engineer and host of The Women in Tech Show, a podcast about what we work on, not what it feels like to be a woman in tech. For more information about the show, go to wit.fm\u003c/p\u003e\n\n\n\n\u003cp\u003eTechnology impacts the way we learn new languages. Maya Goodall, Senior Director at Rosetta Stone, explained how different technologies are used in language learning. We talked about Lingual Learning, a company she co-founded to help students learn English. Maya explained the challenges students face and the importance of embracing heritage languages and diverse backgrounds. We also talked about her current work at Rosetta Stone, and how they’re using Artificial Intelligence in tools for language learning.\u003c/p\u003e\n\n\n\n\u003cp\u003eMaya, welcome to The Women in Tech Show\u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eThank you so much for having me. I’m thrilled to be here. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eI want to begin our conversation by talking about entrepreneurship. In 2012, you founded Lingual Learning along with Christy Shelley. This company was later acquired by Rosetta Stone, which is where you currently work. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhat was the main idea behind lingual learning? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eThe main idea behind legal learning was to help learners at school who are non-native speakers of English achieved parity with their native speaking counterparts. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe built lingual learning ourselves because no one else was giving emergent bilinguals an opportunity to talk in class. We wanted to flip the traditional classroom model where the teacher does most of the talking and put the emergent bilinguals in the talking seat. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eWhat’s usually the background of emerging bilinguals? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eTraditionally, these students have been referred to as English learners, and we felt that was a deficit point of view, focusing on what the learner didn’t have rather than who they were becoming bilingual, we wanted our language to reflect our beliefs that heritage language has value and can be used to learn the second language. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eCan you talk about some general statistics of emerging bilinguals? I want to get an idea of how big this project was. \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eYes, well, about one in four students. By the year 2025 will be considered an emergent bilingual, and the interesting thing about that number is of those one in four, about 85% of those learners were actually born in the United States. Most people have this notion that emergent bilinguals are recent immigrants. Or they, you know, just arrived to the United States. But in fact, they’re usually American citizen, and they have had the benefit of growing up in a house where their parents are speaking another language to them, and they get to go to school and become bilingual there. It’s a large population and it’s going to continue to grow in the United States. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eSo you’re mentioning you’re starting Lingual Learning, particularly to tackle this this challenge. Back when you were starting it, what were the first signs that you saw to come up with an idea and to decide this is a viable company. \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eYes, well, I came from the classroom. I was a classroom teacher and I taught in the United States Spanish actually, so ESL. So I taught in English and Spanish. And then I also taught English as a foreign language outside of the country. These two kind of definitions or points of view for second language acquisition really struck me. In California at the time, there was a law being passed called 227, which was the English only law because people were wondering whether or not students could learn how to read, write and speak in two languages at the same time. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhen I left the country and taught English as a foreign language, those teachers knew the answer that of course someone can learn how to read, write, and speak two languages at the same time. There was no disconnect there. \u003c/p\u003e\n\n\n\n\u003cp\u003e They concerned themselves with how best to achieve that goal. So when I came back to the United States, I actually started working for a large traditional publisher, and it was there that I met Christy Shelly, my business partner. We were having conversations with educators across the nation about how to help their, then referred to as “English learners” because generally, there was something else going on and that was, the learners were expected to learn English, and also subject matter content like math, science, social studies at the same time. Most of the teachers were not trained for foreign language teaching or second language acquisition, so they were focusing exclusively on the subject matter, sort of skipping over the language teaching. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe saw this to be a problem over and over again as we visited and spoke with administrators in the United States. That’s how we knew that this was something that we wanted to tackle. Christy also is an educator, so we both had that mission always in mind, and through talking with so many people trying to help their learners do two things at once, learn content subject matter in English. We knew it’s something we wanted to dedicate ourselves to. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eEarlier you mentioned that to approach this, you wanted to shift the focus away from more traditional approaches, like having the teacher constantly talking to the students. \u003c/p\u003e\n\n\n\n\u003cp\u003eCan you talk about key differences in the learning approach? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eThe traditional approaches follows this idea that if you do a lot of speaking or create input for the learner, they will naturally start to understand that input and then they will create their own output. They’ll start speaking and that traditional view is really based on native language learning. So if you think about a baby and its caregivers and if they are talking and singing and producing language, the baby will learn that language. In fact, our brains are wired for it. \u003c/p\u003e\n\n\n\n\u003cp\u003eSo the idea was that for the second language we could follow the same course of action provide lots of input that the learner could understand and eventually they would create their own output. But what we know is that second language learning isn’t exactly the same as first language learning, and you actually have to give instruction for the second language, which is great, and it’s also viable to use the first language as in teaching, we call that background knowledge. \u003c/p\u003e\n\n\n\n\u003cp\u003eIf the learner has any sense or understands the subject that you’re going to teach them, you sort of create a hook on to what they already know, and then a bridge to the new subject. So in this case, all the learners already know a language, so we can use that as a hook, create a bridge, and help them learn the second language. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eSpeaking in a little more detail about this, but I like the analogy that you mentioned of the bridge and the hook. Bringing this back to the company. Can you talk about some of the solutions that you were building at the company.  \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eFor Lingual Learning what we were doing was building opportunities for the students to actually practice speaking. We used particular types of scaffolding, which is breaking language down for the learner in English, so that they could, the teachers could hand over that language and have the learners create it for themselves. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhat we were finding is that teachers were so used to doing all of the talking, that they didn’t actually give the learners time to practice speaking. When you’re learning a second language. You need a lot of time for repetition. You need a lot of think time. There’s a lot of mental processing going on, and traditionally the classroom is a very fast place. And teachers weren’t necessarily allowing the students all the time they need to digest new language information and then create it again in new utterances for themselves. So we really wanted to make that easy. We wanted to have a step by step flow that the teachers could follow that they could feel good about. One of the concerns we heard over and over again is: how will I know that my learners are actually talking about what they’re supposed to be talking about? So we really wanted to ease the teachers burden with that and create a step by step flow so that whenever the teacher stopped to listen to the learners, they could know exactly what to listen for if they heard that, then they could move on to the next group, let’s say. But we really wanted to build in that speaking practice time for the learners so that they could digest the new language. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eSounds like you were building a lot of activities and curriculum and guidance around this, right? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s right. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eHow big was the team at the time? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eThe team at the time was started with Christiane myself, so it was just the pair of us we actually designed All of the activities and curriculum and then we started working with other people on a contract basis. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe were very lucky people were really aligned with our mission and People gave us a lot of their time for free and helped us think through some of the activities and the curriculum and do some of the writing, but the majority of all of the work was done by Christy and I. We had the good fortune of being able to take our curriculum directly to the schools and work with hundreds of teachers, actually, we got a lot of feedback from the teachers. We learned a lot from them about implementation and because we were so small, we were able to take that research basically that they were giving us and apply it immediately to our curriculum. So we had a symbiotic relationship with the teachers and administrators, the campuses that we were working with. And we were able to take their information, apply it directly into what we were doing, and make sure that we had a positive outcome. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eI really like this because it’s a clear example of you built a company in an area that you have already been working on, got exposure internationally and then. You are basically solving a problem that you are constantly seeing. \u003c/p\u003e\n\n\n\n\u003cp\u003e MG: \u003c/p\u003e\n\n\n\n\u003cp\u003eYes, that’s right. That was our goal. We were trying to solve a problem that people were clamoring about actually. So in the United States there’s another term for emergent bilinguals, an that’s called long term English learners. \u003c/p\u003e\n\n\n\n\u003cp\u003eAnd when you have a student who starts kindergarten and is labeled or identified as an English learner and then gets to about the 5th grade and hasn’t progressed in their English language proficiency, they then get a new label of long-term English learner, and we knew that we wanted to help solve that problem. We know that it’s possible for learners to become bilingual. And we know that something was missing and that missing piece we saw over and over again was this opportunity for speaking practice. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eIn 2017, the company was sold to Rosetta Stone. How did this conversation start? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eWell, Christy and I knew that we had a mission ourselves in terms of how many learners lives we wanted to affect. So we had a goal and we knew that in order to achieve that goal we were going to have to partner with a larger company or get funding. And that’s because we knew we had actually always had the idea to be an edtech company, and in fact had first started our platform online when we approached our first customer and they asked us for our curriculum, they told us they didn’t have the online infrastructure in their school district to support it that way, and they asked us to actually go back and print out the lessons for them. And so we did, and so that took us down a print road that we were not expecting. We had always kept in mind though that we wanted to be edtech. \u003c/p\u003e\n\n\n\n\u003cp\u003eAnd we wanted to be able to, you know, affect more students lives through technology. So 2017 was about five years after we founded, and we knew that it was time for us to broach that subject again. We attended incubators and some other places within the ecosystem to see who might be a good fit for us and the very first person we met was the President of Lexia. So Lexia Learning and Rosetta Stone are sister companies and at the time they were looking for away to reach into the emergent bilingual market. And so it was perfect timing. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe both have the same mission which is to help learners and change their lives through the power of literacy and language education. So it felt very serendipitous and like the right fit from the very beginning. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eOne thing I’m also curious about is, when these conversations are starting to happen and you’re both on the same page, and it seems like you are targeting the same goal. Then we have to move on to the next phase, which is how is that acquisition going to happen? What were some things that you and your partner were thinking about in terms of do we need to negotiate? Did you negotiate, or how did you prepare for this situation? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eYes, we did negotiate and the negotiation process took about a year, so it was not a quick turn around. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe had our legal representation help us with our negotiations. We also reached out to former colleagues who we knew had been through negotiations themselves, so just ask questions and help us think through what types of questions to ask and you know what types of things to look for. \u003c/p\u003e\n\n\n\n\u003cp\u003eSo slowly, overtime, the negotiations took place an honestly every step of the way felt right. It felt good. There was no time where we felt unsettled or thought that maybe this wasn’t the right thing. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt was just a matter of getting the details right, but we really, because of the alignment and because basically of the technology assets that we knew we would have access to, we were really excited about the process. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eCan you talk about some of the key learnings during this negotiation process? You’re mentioning you’re leveraging a lot your network, getting feedback from other people that have been in this situation, was there something that surprised you or that you were glad you were told? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eOh that’s great. Well, I think the most surprising thing is that negotiations don’t have to be difficult or scary. In fact, it’s you know like minded people trying to reach an agreement so that everybody, at least in our case, so that everybody could win and get what they wanted and for us, because we’re in education, the ultimate goal is to make sure that we have this opportunity to create, you know, curriculum that is going to help the learner. All of us have that same mission to serve the learner. So I think it made these negotiations possibly a little easier because we have kind of an altruistic goal along with the rest of the goals that we’ve got. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eYou’re currently senior director at Rosetta Stone. You started working here after that acquisition. They are mostly known for their language learning products. Me personally, I used them a lot growing up, so I have very fond memories of them. \u003c/p\u003e\n\n\n\n\u003cp\u003eCan you talk in more detail what Rosetta Stone is all about now? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eYes, so one of the reasons that we’re Christy and I are both with Rosetta Stone is because they wanted to purchase our intellectual property and they wanted to keep us on board to help build out the program. \u003c/p\u003e\n\n\n\n\u003cp\u003eSo we, again just kind of illuminates, our relationship with the company was very good from the beginning. So Rosetta Stone, you know has been around since 1992 and their original mission. It was, you know, very much what our mission is and to help students or learners of any age really become bilingual, learn that second language. For us, at Lingual Learning and Christy and I, in particular that bilingualism helps promote the cause of peace in terms of just being able to communicate with more people, having better problem solving skills and really you know, just getting to know others and understanding others. We really feel that mission through bilingualism. \u003c/p\u003e\n\n\n\n\u003cp\u003eSo one of the assets that we were really most excited about with Rosetta Stone was their speech recognition engine. They have been perfecting that for the last 25 years and using that as a means for emerging. Their emerging technology, where a person can speak right away with the engine and get feedback was what we were trying to do in terms of replicate our activities and all that speaking practice that we had on in our paper base curriculum. We knew we would be able to replicate in some way using that speech recognition technology. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s awesome because just to contrast, when I was using Rossetta Stone, it was basically a CD and you would hear the words and then you’re repeating, but nobody is giving you feedback. You don’t know how correctly you’re saying it, so the fact that now they’re leveraging speech recognition engines, it makes it more like having a teacher right there in person, giving you feedback or someone else that’s familiar with the language, right? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eYes, that’s exactly right, and that feedback, corrective feedback is really important to the learning process. Actually, to whatever subject you’re trying to learn, and especially so with language. \u003c/p\u003e\n\n\n\n\u003cp\u003eBeing able to leverage that technology and give the learner corrective feedback immediately was so important to us and it’s one of the things that we’re very proud of. We can give corrective feedback and let the learner know exactly what they have said correctly and how well they’ve done it because that’s important to cognition and to keep motivation to learn. And then we can also give them feedback as to where they may have made a mistake, how to correct that mistake, practice the correction and then try again. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eAs part of your role at Rosetta Stone, you collaborate a lot more with people from different areas like UI designers, other content creators, engineers, can you talk about what that collaboration looks like when you’re all aiming to build solutions in the space of emerging learners? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eYes, one of the first things we did to bring all of the verticals together, because this project was new, many of the team members were also new to the company, or they were new to working on this particular project, and so one of the first things we did to bring the verticals together was a design sprint. And that design sprint really helped us understand the vision that we were trying to create, get everybody sort of in the same mindset as to what it was we were looking for and help everybody have a voice on this new project. So that design sprint was really important for us after the design Sprint, we went through another kind of thought process and that was to think about our unconscious bias and create guiding principles. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe knew that we were going to be working with UI, UX designers and engineers and the speech recognition, engineers and developers, and we knew that we would need guiding principles that we could all use on a daily basis to help us when we had questions. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe have four very straightforward guiding principles and they are: to design learning experiences from an asset based orientation. You heard me talk about the emergent bilingual with feel that that language represents our asset based orientation towards the learners. Our second guiding principle, is to design learning experiences in which multilingualism is valued and seen as a resource. We knew we were teaching English and we could do this from a monolingual mindset, meaning only English is going to be referred to or talked about or used in the UI UX. However, because we have this guiding principle, \u003c/p\u003e\n\n\n\n\u003cp\u003ewe were able to make decisions that all of the characters that the learners work with are themselves bilingual. \u003c/p\u003e\n\n\n\n\u003cp\u003eThey come from different parts of the world. Some were born in the United States. Some were not born in the United States, but the thing that they all have in common is that they are all becoming bilingual by learning English. Our guiding principle number three is to design learning experiences in which diverse cultures and identities are valued and seen as a resource. Again, referring to the characters that the learners interact with on line. And then finally our guiding principle for which is to design learning experiences that honor and strategically leverage the school family connection that the school family connection is well researched. And it was something that we wanted to also leverage within our product by providing the parents with knowledge about what the learners were doing and also for the characters themselves to refer to and talk about their own family experience. \u003c/p\u003e\n\n\n\n\u003cp\u003eThere’s a story I like to tell with regard to the speech recognition engineers. We were discussing our artificial intelligence, so the speech recognition engine uses AI to understand the learner and to machine learning through the data to make our algorithms better overtime in terms of how we rate the learner and their speech. One of the questions that came up was: do we train the speech recognition engine to accept only what’s considered standard American English? Kind of a Midwestern accent from the United States, and it was easy to answer that question because we could look directly at our guiding principles, and our guiding principle number two, which says to design learning experiences in which multilingualism is valued and seen as a resource, gave us the answer. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe knew that our learners were coming to us with an accent and that they would pronounce words based on their first language pronunciation based on heritage, language or first language is also well documented. Phoneme blends or accents depending on the first language is well known. So the engineers were able to code the speech recognition engine for those well known phoneme blends and accept pronunciations outside of the standard form. This is in line with our thinking. It’s in line with our principle #3, which is to design learning experiences in which diverse cultures and identities are valued. So these guiding principles are really important to all the verticals and they are a living, breathing document. If you will that we refer to nearly on a daily basis. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eFrom your experience and having work with students, can you talk about the impact of this key decision? It resonates a lot with me because sometimes people kpep training you to pronounce a certain way and then eventually a lot of people lose their accents with all this training. What is your opinion on this, The impact of deciding to accept words with an accent.  \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eWe wanted to send the message that We understand and know that English is a language that is spoken around the world and that the way that people speak English with their accents and pronunciation is 100% acceptable. We really feel that grammar and syntax is the basis for being understood, and that pronunciation or accents are part of language, and opening up to having acceptance for that was really important to us. In terms of what we’ve heard back from the teachers and the students, it is overwhelming positive responses.In fact, so far we haven’t really had any pushback or negative responses. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s been so well received, especially because we hear from teachers and the students themselves that they finally see themselves reflected on the screen. And again, with our design principles we wanted to create what are called windows and mirrors. So we wanted the learner to have a mirror reflection of themselves and we also wanted to create Windows so they could see who they might become. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eBefore we finish, I want to talk a little bit more about the senior director role. From what you were mentioning earlier, there’s a lot of guiding the team and then having this principles, coordinating design sprints. From your experience what have been other things that you get to work on as a senior director? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eYes, it’s been very exciting because I’ve been able to work on the content which drives you know the whole entire project and then all the different components that bring that content together. So understanding and leveraging the adaptive blended learning model that Lexia Learning brings to the table in terms of assessments without testing. So everything the learner does onscreen, everything they speak into the speech recognition engine, every click that they make when answering multiple choice questions is being recorded. And that’s done through our platform called My Lexia, which gives teachers immediate feedback. So that’s been exciting and actually very personal to me because in the education field I’ve been acutely aware of the fact that teachers usually don’t have data when it comes to language proficiency learning, how much the learner has accomplished and they don’t have data that can drive instruction in terms of what exact skill they would need to learn next to help them move to the next language proficiency level. So working on the My Lexia and assessment team has been very exciting learning more about the speech recognition engine and how that work. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe also used our own content management system, so just working with all of these different areas to bring this project to life has been a wonderful learning experience for me and also just personally, you know, the most important project that I’ve worked on in my career so far. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eWhat are some important skills of somebody in a leadership? \u003c/p\u003e\n\n\n\n\u003cp\u003eMG: \u003c/p\u003e\n\n\n\n\u003cp\u003eI think first and foremost it’s listening with an open mind and really trying to understand what the other person is saying. There are different ways to listen, and one way to listen that will breakdown communication immediately is to listen to find holes, or listen to respond, and you know really learning how to listen to what another person is saying, and assume that what they’re saying in their experience is true, taking that in and then rsponding, I think, is one of the biggest things that I’ve learned in the last three years. I do spend time reading books. \u003c/p\u003e\n\n\n\n\u003cp\u003eI study mindfulness meditation and listen to a lot of motivational podcasts to help me continuously grow as an individual and also as a team member with other people. \u003c/p\u003e\n\n\n\n\u003cp\u003eES: \u003c/p\u003e\n\n\n\n\u003cp\u003eWell, Maya thank you so much for coming on the show. It’s been really nice chatting with you. \u003c/p\u003e\n\n\n\n\u003cp\u003eMG:\u003c/p\u003e\n\n\n\n\u003cp\u003eThank you so much. It’s been wonderful chatting with you as well. \u003c/p\u003e\n\n\n\n\u003ch3\u003e\u003cstrong\u003eSponsors\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://mentors.fm\"\u003e\u003cimg data-attachment-id=\"4122\" data-permalink=\"https://thewomenintechshow.com/2019/07/15/virtual-reality-with-mar-gonzalez-franco/5mm-ad-image-small/\" data-orig-file=\"https://thewomenintechshow.com/wp-content/uploads/2019/07/5mm-ad-image-small.png\" data-orig-size=\"600,600\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"5mm-Ad-Image-SMALL\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://thewomenintechshow.com/wp-content/uploads/2019/07/5mm-ad-image-small.png?w=300\" data-large-file=\"https://thewomenintechshow.com/wp-content/uploads/2019/07/5mm-ad-image-small.png?w=600\" tabindex=\"0\" role=\"button\" src=\"https://thewomenintechshow.com/wp-content/uploads/2019/07/5mm-ad-image-small.png\" alt=\"5mm-Ad-Image-SMALL\" width=\"336\" height=\"336\" srcset=\"https://thewomenintechshow.com/wp-content/uploads/2019/07/5mm-ad-image-small.png?w=336\u0026amp;h=336 336w, https://thewomenintechshow.com/wp-content/uploads/2019/07/5mm-ad-image-small.png?w=150\u0026amp;h=150 150w, https://thewomenintechshow.com/wp-content/uploads/2019/07/5mm-ad-image-small.png?w=300\u0026amp;h=300 300w, https://thewomenintechshow.com/wp-content/uploads/2019/07/5mm-ad-image-small.png 600w\" sizes=\"(max-width: 336px) 100vw, 336px\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\t\t\t\u003c/div\u003e\n\n\t\n\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "28 min read",
  "publishedTime": "2021-03-02T18:00:00Z",
  "modifiedTime": "2022-10-20T20:05:31Z"
}
