{
  "id": "4480b403-6fb8-4bb8-a5ab-c122e61ae127",
  "title": "Announcing Stack Overflow for Teams",
  "link": "https://www.joelonsoftware.com/2018/05/03/announcing-stack-overflow-for-teams/",
  "description": "New product: Stack Overflow for Teams lets you direct questions to members of your own team, company, or organization. Read more \"Announcing Stack Overflow for Teams\"",
  "author": "Joel Spolsky",
  "published": "Thu, 03 May 2018 12:58:25 +0000",
  "source": "https://www.joelonsoftware.com/feed/",
  "categories": [
    "Stack Overflow",
    "News"
  ],
  "byline": "About the author.",
  "length": 4382,
  "excerpt": "New product: Stack Overflow for Teams lets you direct questions to members of your own team, company, or organization.",
  "siteName": "Joel on Software",
  "favicon": "",
  "text": "Hey, we have a new thing for you today! Today’s new thing is called Stack Overflow for Teams. It lets you set up a private place on Stack Overflow where you can ask questions that will only be visible to members of your team, company, or organization. It is a paid service, but it’s not expensive. I meet people who use Stack Overflow every single day, but a lot of them tell me they have never needed to post their own question. “All the questions are already answered!” they say. Mission accomplished, I guess! Still, when I think about what questions developers have every day, only the ones that have to do with public stuff can be asked on Stack Overflow. Maybe you don’t have a question about Python or Android… maybe you want to ask something about your team’s own code base! That’s the idea behind Stack Overflow Teams. Quick background: every development team since the beginning of time has been trying to figure out how to get institutional knowledge out of people’s heads and into written, searchable form where everyone can find it. Like new members of the team. And old members of the team working on new parts of the code. And people who forgot what they did three years ago and now have questions about their own code. For a while developers thought wikis might be the solution. Anyone who has used a wiki for this purpose has probably discovered that not very much knowledge actually makes it into the wiki, and what does is not particularly useful, doesn’t get updated, and honestly it just feels like a bunch of homework to write a bunch of wiki documentation about your code when you don’t know if it will ever help anyone. Another solution being sold today is the idea of having some kind of online IRC-style chat rooms, and hoping that by searching those chat archives, you can find “institutional knowledge.” Ha ha ha! Even if that works, all you really find is the history of some conversation people had. It might have clues but it’s not knowledge. But you know what does work? A Q\u0026A system. Like Stack Overflow. Why? Because unlike wikis, you don’t write documentation in the hopes that one day it might help someone. You answer questions that are going to help someone immediately. And you can stop answering the minute you get the green checkmark that shows that you solved their problem. And unlike chatrooms, searching actually works. It finds you a question and its answers, not a conversation-captured-in-amber. This is why Stack Overflow worked so much better on the public internet than the previous generation of discussion forums, and we think that it will work for all the same reasons with teams’ proprietary questions and answers. When you join a team, you’ll see your team’s private questions right on stackoverflow.com (although they actually live in a separate database for security). Your teams are listed in the left hand navbar. Everything else works pretty much … like you would expect. When you ask a question, you can direct it to your team or to the whole world. The UI makes it very clear whether you are posting publicly or privately. If you are asking a question of your team, there’s a Notify field so you can type the names of some people who might be able to answer the question, and they’ll hear about it right away. When you search, you can search everywhere, or just within your team. You can set up tags that are specific to your team, too. The pricing is designed to be “no-brainer” pricing, starting at just $10 per month for the first ten users. I think Stack Overflow for Teams is going to be almost as important to developers’ daily work as public Stack Overflow. It brings Stack Overflow’s uniquely powerful system to every developer question, not just the things that can be discussed in public. You can stop asking your teammates questions in email (where they help nobody else) or in chatrooms (where they are impossible to find) and start building your own private knowledge base to document your code and answer future teammates’ questions before they have them. In 2000 I co-founded Fog Creek Software, where we created lots of cool things like the FogBugz bug tracker, Trello, and Glitch. I also worked with Jeff Atwood to create Stack Overflow and served as CEO of Stack Overflow from 2010-2019. Today I serve as the chairman of the board for Stack Overflow, Glitch, and HASH.",
  "image": "https://149366100.v2.pressablecdn.com/wp-content/uploads/2018/04/Teams2.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n\t\t\u003cmain id=\"main\" role=\"main\"\u003e\n\n\t\t\n\t\t\t\n\u003carticle id=\"post-3411\"\u003e\n\t\n\t\n\t\n\n\t\n\n\n\t\u003cdiv\u003e\n\t\t\u003cp\u003eHey, we have a new thing for you today!\u003c/p\u003e\n\u003cp\u003eToday’s new thing is called \u003ca href=\"https://stackoverflow.com/teams\"\u003eStack Overflow for Teams\u003c/a\u003e. It lets you set up a private place on Stack Overflow where you can ask questions that will only be visible to members of your team, company, or organization. It is a paid service, but it’s not expensive.\u003c/p\u003e\n\u003cp\u003eI meet people who use Stack Overflow every single day, but a lot of them tell me they have never needed to post their own question. “All the questions are already answered!” they say. Mission accomplished, I guess!\u003c/p\u003e\n\u003cp\u003eStill, when I think about what questions developers have every day, only the ones that have to do with public stuff can be asked on Stack Overflow. Maybe you don’t have a question about Python or Android… maybe you want to ask something about your team’s own code base!\u003c/p\u003e\n\u003cp\u003eThat’s the idea behind Stack Overflow Teams.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/05/Helicopters.png?ssl=1\"\u003e\u003cimg data-recalc-dims=\"1\" fetchpriority=\"high\" decoding=\"async\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/05/Helicopters.png?resize=730%2C255\u0026amp;ssl=1\" alt=\"Helicopters\" width=\"730\" height=\"255\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/05/Helicopters.png?resize=1024%2C357\u0026amp;ssl=1 1024w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/05/Helicopters.png?resize=300%2C104\u0026amp;ssl=1 300w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/05/Helicopters.png?resize=768%2C267\u0026amp;ssl=1 768w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/05/Helicopters.png?resize=1200%2C418\u0026amp;ssl=1 1200w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/05/Helicopters.png?w=1460\u0026amp;ssl=1 1460w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/05/Helicopters.png?w=2190\u0026amp;ssl=1 2190w\" sizes=\"(max-width: 730px) 100vw, 730px\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eQuick background: every development team since the beginning of time has been trying to figure out how to get institutional knowledge out of people’s heads and into written, searchable form where everyone can find it. Like new members of the team. And old members of the team working on new parts of the code. And people who forgot what they did three years ago and now have questions about \u003cem\u003etheir own code\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eFor a while developers thought wikis might be the solution. Anyone who has used a wiki for this purpose has probably discovered that not very much knowledge actually makes it into the wiki, and what does is not particularly useful, doesn’t get updated, and honestly it just feels like a bunch of homework to write a bunch of wiki documentation about your code when you don’t know if it will ever help anyone.\u003c/p\u003e\n\u003cp\u003eAnother solution being sold today is the idea of having some kind of online IRC-style chat rooms, and hoping that by searching those chat archives, you can find “institutional knowledge.” Ha ha ha! Even if that works, all you really find is the history of some conversation people had. It might have clues but it’s not knowledge.\u003c/p\u003e\n\u003cp\u003eBut you know what does work? A Q\u0026amp;A system. Like Stack Overflow.\u003c/p\u003e\n\u003cp\u003eWhy? Because unlike wikis, you don’t write documentation in the hopes that one day it might help someone. You answer questions that are going to help someone \u003cem\u003eimmediately.\u003c/em\u003e And you can stop answering the minute you get the green checkmark that shows that you solved their problem.\u003c/p\u003e\n\u003cp\u003eAnd unlike chatrooms, searching actually works. It finds you a question and its answers, not a conversation-captured-in-amber.\u003c/p\u003e\n\u003cp\u003eThis is why Stack Overflow worked so much better on the public internet than the previous generation of discussion forums, and we think that it will work for all the same reasons with teams’ \u003cem\u003eproprietary\u003c/em\u003e questions and answers.\u003c/p\u003e\n\u003cp\u003eWhen you join a team, you’ll see your team’s private questions right on \u003ca href=\"https://stackoverflow.com/\"\u003estackoverflow.com\u003c/a\u003e (although they actually live in a separate database for security). Your teams are listed in the left hand navbar.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/Teams1.png?ssl=1\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/Teams1.png?resize=730%2C584\u0026amp;ssl=1\" alt=\"Screen Shot\" width=\"730\" height=\"584\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/Teams1.png?w=943\u0026amp;ssl=1 943w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/Teams1.png?resize=300%2C240\u0026amp;ssl=1 300w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/Teams1.png?resize=768%2C614\u0026amp;ssl=1 768w\" sizes=\"(max-width: 730px) 100vw, 730px\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eEverything else works pretty much … like you would expect. When you ask a question, you can direct it to your team or to the whole world. The UI makes it very clear whether you are posting publicly or privately. If you are asking a question of your team, there’s a \u003cem\u003eNotify\u003c/em\u003e field so you can type the names of some people who might be able to answer the question, and they’ll hear about it right away.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/Teams2.png?ssl=1\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/Teams2.png?resize=730%2C744\u0026amp;ssl=1\" alt=\"Screen shot\" width=\"730\" height=\"744\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/Teams2.png?w=859\u0026amp;ssl=1 859w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/Teams2.png?resize=294%2C300\u0026amp;ssl=1 294w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2018/04/Teams2.png?resize=768%2C783\u0026amp;ssl=1 768w\" sizes=\"(max-width: 730px) 100vw, 730px\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWhen you search, you can search everywhere, or just within your team. You can set up tags that are specific to your team, too.\u003c/p\u003e\n\u003cp\u003eThe pricing is designed to be “no-brainer” pricing, starting at just $10 per month for the first ten users.\u003c/p\u003e\n\u003cp\u003eI think \u003ca href=\"https://stackoverflow.com/teams\"\u003eStack Overflow for Teams\u003c/a\u003e is going to be almost as important to developers’ daily work as public Stack Overflow. It brings Stack Overflow’s uniquely powerful system to every developer question, not just the things that can be discussed in public. You can stop asking your teammates questions in email (where they help nobody else) or in chatrooms (where they are impossible to find) and start building your own private knowledge base to document your code and answer future teammates’ questions before they have them.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\u003c/article\u003e\n\n\n\n\t\n\n\u003cdiv\u003e\n\t\u003cp\u003e\u003cimg alt=\"\" src=\"https://secure.gravatar.com/avatar/e215aff4c20f1e1759f0b74a2703f04d?s=64\u0026amp;d=mm\u0026amp;r=pg\" srcset=\"https://secure.gravatar.com/avatar/e215aff4c20f1e1759f0b74a2703f04d?s=128\u0026amp;d=mm\u0026amp;r=pg 2x\" height=\"64\" width=\"64\" loading=\"lazy\" decoding=\"async\"/\u003e\t\u003c/p\u003e\n\n\t\u003cdiv\u003e\n\t\t\n\n\t\t\u003cp\u003e\n\t\t\tIn 2000 I co-founded Fog Creek Software, where we created lots of cool things like the FogBugz bug tracker, Trello, and Glitch. I also worked with Jeff Atwood to create Stack Overflow and served as CEO of Stack Overflow from 2010-2019.\n\nToday I serve as the chairman of the board for \u003ca href=\"https://stackoverflow.com/\"\u003eStack Overflow\u003c/a\u003e, \u003ca href=\"https://glitch.com/\"\u003eGlitch\u003c/a\u003e, and \u003ca href=\"https://hash.ai/\"\u003eHASH\u003c/a\u003e.\t\t\u003c/p\u003e\n\t\u003c/div\u003e\n\u003c/div\u003e\n\n\t\t\t\t\n\t\t\n\t\t\t\n\t\t\n\t\t\u003c/main\u003e\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2018-05-03T12:58:25Z",
  "modifiedTime": "2018-05-03T13:39:50Z"
}
