{
  "id": "4a13ed44-ded4-4cd0-b217-c2fa7dde7447",
  "title": "Tiny Experiments with Anne-Laure Le Cunff",
  "link": "https://www.hanselminutes.com",
  "description": "In this insightful episode of Hanselminutes, host Scott Hanselman sits down with Anne-Laure Le Cunff, the brilliant mind behind Tiny Experiments. Together, they explore the transformative power of small, manageable experiments in fostering creativity, personal growth, and meaningful change. Anne-Laure shares how her background in neuroscience and her journey as the founder of Ness Labs have shaped her approach to experimentation and self-improvement. Tune in as they dive into practical strategies for embracing curiosity, overcoming fear of failure, and unlocking potential through tiny, intentional steps—perfect for anyone looking to spark innovation and momentum in their own life.https://nesslabs.com/book",
  "author": "Scott Hanselman",
  "published": "Thu, 3 Apr 2025 21:00:00 +0000",
  "source": "https://feeds.simplecast.com/gvtxUiIf",
  "categories": null,
  "byline": "Scott Hanselman",
  "length": 270,
  "excerpt": "The Hanselminutes Technology Podcast by Scott Hanselman - Fresh Tech from Fresh Faces - Deep tech talk from an inclusive perspective",
  "siteName": "",
  "favicon": "https://www.hanselminutes.com/images/apple-touch-icon-x2.png",
  "text": "ABOUT SCOTTI'm a teacher. I speak all over to whoever will listen. I have written code that you've used. I've been blogging for over a decade and podcasting for about half that. I speak, code, write, empower, promote, braid, learn and listen - usually not in that order.",
  "image": "https://hanselminutes.com/images/itunes-cover2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003e\u003cimg src=\"https://www.hanselminutes.com/images/photo-scott.jpg\" alt=\"Scott Hanselman\"/\u003e\n\n            \u003cspan\u003e\u003cstrong\u003eABOUT SCOTT\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003eI\u0026#39;m a teacher. I speak all over to whoever will listen. I have written code that you\u0026#39;ve used. I\u0026#39;ve been blogging for over a decade and podcasting for about half that. I speak, code, write, empower, promote, braid, learn and listen - usually not in that order.  \u003c/p\u003e\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
