{
  "id": "58b7f5b5-8214-4f3b-905b-522841272495",
  "title": "",
  "link": "http://scripting.com/2025/01/01.html#a155912",
  "description": "I wrote a few blog posts in WordLand this morning because it was convenient. It's good the same way I like to use a twitter-like app to write first drafts, when all I have to type into is my iPad. I've also started using it on my desktop for short things, but I just wrote and edited a complete blog post, a response to something Krugman wrote, about how gambling is destroying sports. And what for? It's like what Marge said at the end of Fargo. \"There's more to life than a little money, you know.\" It feels like they're feeding the NBA into a wood chipper. What comes out the other side won't imho be recognizable as sport. And here you are, and it's a beautiful day.",
  "author": "",
  "published": "Wed, 01 Jan 2025 15:59:12 GMT",
  "source": "http://scripting.com/rss.xml",
  "categories": null,
  "byline": "",
  "length": 904,
  "excerpt": "Dave Winer, OG blogger, podcaster, developed first apps in many categories. Old enough to know better. It's even worse than it appears.",
  "siteName": "Scripting News",
  "favicon": "",
  "text": "It's even worse than it appears.. I wrote a few blog posts in WordLand this morning because it was convenient. It's good the same way I like to use a twitter-like app to write first drafts, when all I have to type into is my iPad. I've also started using it on my desktop for short things, but I just wrote and edited a complete blog post, a response to something Krugman wrote, about how gambling is destroying sports. And what for? It's like what Marge said at the end of Fargo. \"There's more to life than a little money, you know.\" It feels like they're feeding the NBA into a wood chipper. What comes out the other side won't imho be recognizable as sport. And here you are, and it's a beautiful day.# Welcome to a brand new year. The best one ever. 😄# I've archived December in the GitHub repo, in OPML, as usual.# I've got so much new stuff stacked up, on its way out. Hold onto your hats. #",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"idPageTopText\"\u003e\n\t\n\t\u003cp\u003eIt\u0026#39;s even worse than it appears..\u003c/p\u003e\n\t\u003c/div\u003e\u003cdiv id=\"idDayContainer\"\u003e\n\t\t\t\t\n\u003cp\u003e\u003ca name=\"a155912\"\u003e\u003c/a\u003e\u003cimg src=\"https://imgs.scripting.com/2024/09/10/kittyStamp.png\"/\u003eI wrote a few blog posts in \u003ca href=\"https://this.how/wordland/\"\u003eWordLand\u003c/a\u003e this morning because it was convenient. It\u0026#39;s good the same way I like to use a twitter-like app to write first drafts, when all I have to type into is my iPad. I\u0026#39;ve also started using it on my desktop for short things, but I just \u003ca href=\"https://imgs.scripting.com/2025/01/01/wordlandScreen.png\"\u003ewrote\u003c/a\u003e and edited a \u003ca href=\"https://daveverse.wordpress.com/2025/01/01/gambling-has-infested-sport-in-new-unacceptable-ways/\"\u003ecomplete blog post\u003c/a\u003e, a response to something \u003ca href=\"https://paulkrugman.substack.com/p/the-plot-to-poison-childrens-minds\"\u003eKrugman wrote\u003c/a\u003e, about how gambling is destroying sports. And what for? It\u0026#39;s like what \u003ca href=\"https://www.youtube.com/watch?v=FfI2iFvloso\"\u003eMarge said\u003c/a\u003e at the end of Fargo. \u0026#34;There\u0026#39;s more to life than a little money, you know.\u0026#34; It feels like they\u0026#39;re feeding the NBA into a \u003ca href=\"https://www.atlasobscura.com/places/fargo-wood-chipper\"\u003ewood chipper\u003c/a\u003e. What comes out the other side won\u0026#39;t imho be recognizable as sport. And here you are, and it\u0026#39;s a beautiful day.\u003cspan\u003e\u003ca href=\"http://scripting.com/2025/01/01.html#a155912\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca name=\"a155520\"\u003e\u003c/a\u003eWelcome to a brand new year. The best one ever. \u003cspan\u003e😄\u003c/span\u003e\u003cspan\u003e\u003ca href=\"http://scripting.com/2025/01/01.html#a155520\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca name=\"a155554\"\u003e\u003c/a\u003eI\u0026#39;ve archived December in the GitHub repo, \u003ca href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2024/12.opml\"\u003ein OPML\u003c/a\u003e, as usual.\u003cspan\u003e\u003ca href=\"http://scripting.com/2025/01/01.html#a155554\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca name=\"a155709\"\u003e\u003c/a\u003eI\u0026#39;ve got so much new stuff stacked up, on its way out. Hold onto your hats. \u003cspan\u003e\u003ca href=\"http://scripting.com/2025/01/01.html#a155709\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
