{
  "id": "5ee3a11e-d64b-4737-b9fa-0fa528cfabfc",
  "title": "Follow This Principle - Establish Your Baselines",
  "link": "http://www.developertea.com",
  "description": "This episode introduces a profound yet simple principle: knowing your baselines. This concept is crucial for effectively detecting and measuring change in your life and career.Uncover the fundamental idea that to recognise when something has changed, you must first understand what things were like before the change occurred. Often, people haven't been measuring their lives, making it challenging to spot shifts because their baselines are unknown.Learn to identify your personal baselines across various aspects of your life. This includes understanding typical daily habits, such as whether you tend to skip lunch, or how many hours you usually work (e.g., 6, 8, or 10 hours). While general data might suggest optimal working hours (e.g., 35-45 hours for most benefit, rarely more than 55 hours), your personal baseline is unique, and the goal is to empower you to make conscious decisions about your habits.Explore other crucial areas for baseline measurement, including simple health metrics like your typical body weight, baseline levels of activity with friends, expected energy levels, and even your baseline for positivity.Discover how establishing these 'operating norms' for your life can be a critical factor in recognising positive changes, identifying when you are unconsciously changing a behaviour, or even detecting signs of burnout. For instance, if your body weight trends upwards, it might signal decreased activity. Similarly, knowing your baseline learning rate can help you assess if you are learning at an acceptable pace.Understand the significant benefit of sharing your baseline measurements or expectations with others. What others observe about your life can provide a valuable starting point or confirm changes you might not perceive yourself. It's encouraged to get curious about what others are seeing, rather than dismissing their observations.Grasp why this principle is so important: it helps align your actions with your values and purpose. If you care about spending quality time with family or friends, understanding your baseline investment in these relationships allows you to recognise if you're moving away from your expected commitment. Knowing your baselines demonstrates that you're putting action behind your values, rather than just stating them.Consider starting by engaging a trusted person to help you be aware of your baselines, especially concerning the things that matter most to you. This provides external observation and support.📮 Ask a QuestionIf you enjoyed this episode and would like me to discuss a question that you have on the show, drop it over at: developertea.com.📮 Join the DiscordIf you want to be a part of a supportive community of engineers (non-engineers welcome!) working to improve their lives and careers, join us on the Developer Tea Discord community by visiting https://developertea.com/discord today!🧡 Leave a ReviewIf you're enjoying the show and want to support the content head over to iTunes and leave a review! It helps other developers discover the show and keep us focused on what matters to you.",
  "author": "Jonathan Cutrell",
  "published": "Thu, 5 Jun 2025 07:00:00 +0000",
  "source": "https://feeds.simplecast.com/dLRotFGk",
  "categories": null,
  "byline": "",
  "length": 1016,
  "excerpt": "This episode explores why maintenance tasks, despite their fundamental importance, are often neglected or deprioritised in our daily lives and professional work. It delves into the psychological biases that make consistent maintenance challenging, such as hyperbolic discounting, where immediate gratification is valued over future gains, and the construal level theory, which highlights how psychological distance makes preventative work less impactful. The concept of the \"maintenance paradox\" is introduced, explaining that when maintenance is done well, its benefits go unnoticed, diminishing the sense of reward. The episode encourages listeners to adopt a maintenance mindset, making these tasks a standard habit rather than relying on typical prioritisation structures, as they are crucial for enhancing the quality of overall experiences and preventing future, more urgent problems.",
  "siteName": "",
  "favicon": "",
  "text": "Why Maintenance Matters Now - Construal Level Theory, Marshmallows, and Hyperbolic DiscountingThis episode explores why maintenance tasks, despite their fundamental importance, are often neglected or deprioritised in our daily lives and professional work. It delves into the psychological biases that make consistent maintenance challenging, such as hyperbolic discounting, where immediate gratification is valued over future gains, and the construal level theory, which highlights how psychological distance makes preventative work less impactful. The concept of the \"maintenance paradox\" is introduced, explaining that when maintenance is done well, its benefits go unnoticed, diminishing the sense of reward. The episode encourages listeners to adopt a maintenance mindset, making these tasks a standard habit rather than relying on typical prioritisation structures, as they are crucial for enhancing the quality of overall experiences and preventing future, more urgent problems.Published: 6/13/2025Length: ~23m",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv href=\"/episodes/fd37e10d-cfd7-46dd-bc4e-73280dbf8ab1\"\u003e\u003cspan\u003eWhy Maintenance Matters Now - Construal Level Theory, Marshmallows, and Hyperbolic Discounting\u003c/span\u003e\u003cp\u003eThis episode explores why maintenance tasks, despite their fundamental importance, are often neglected or deprioritised in our daily lives and professional work. It delves into the psychological biases that make consistent maintenance challenging, such as hyperbolic discounting, where immediate gratification is valued over future gains, and the construal level theory, which highlights how psychological distance makes preventative work less impactful. The concept of the \u0026#34;maintenance paradox\u0026#34; is introduced, explaining that when maintenance is done well, its benefits go unnoticed, diminishing the sense of reward. The episode encourages listeners to adopt a maintenance mindset, making these tasks a standard habit rather than relying on typical prioritisation structures, as they are crucial for enhancing the quality of overall experiences and preventing future, more urgent problems.\u003c/p\u003e\u003cspan\u003ePublished: 6/13/2025\u003cbr/\u003eLength: ~23m\u003c/span\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
