{
  "id": "8478db1d-07a5-4412-92ab-138ae2000452",
  "title": "Kinda a big announcement",
  "link": "https://www.joelonsoftware.com/2021/06/02/kinda-a-big-announcement/",
  "description": "The other day I was talking to a young developer working on a code base with tons of COM code, and I told him that even before… Read more \"Kinda a big announcement\"",
  "author": "Joel Spolsky",
  "published": "Wed, 02 Jun 2021 16:36:19 +0000",
  "source": "https://www.joelonsoftware.com/feed/",
  "categories": [
    "News"
  ],
  "byline": "About the author.",
  "length": 6505,
  "excerpt": "The other day I was talking to a young developer working on a code base with tons of COM code, and I told him that even before he was born, everyone knew that COM was already so deeply obsolete tha…",
  "siteName": "Joel on Software",
  "favicon": "",
  "text": "The other day I was talking to a young developer working on a code base with tons of COM code, and I told him that even before he was born, everyone knew that COM was already so deeply obsolete that it was impossible to find anyone who knew enough to work on it. And yet they still have this old COM code base, and they still have one old programmer holding onto their job by being the only human left on the planet with a brain big enough to manually manage multithreaded objects. I remember that COM was like Gödels Theorem: it seemed important, and you could understand it all long enough to pass an exam, but ultimately it is mostly just a demonstration of how far human intelligence can be made to stretch under extreme duress. And, bubbeleh, if there is one thing we have learned, it’s that the things that make it easier on your brain are the things that matter. Programming changes slowly. Really slowly. Since I learned to code forty years ago, one thing that has mostly, mostly, changed about programming is that most developers no longer have to manage their own memory. Even getting that going took a long long time. I took a few stupid years trying to be the CEO of a growing company during which I didn’t have time to code, and when I came back to web programming, after a break of about 10 years, I found Node, React, and other goodies, which are, don’t get me wrong, amazing? Really really great? But I also found that it took approximately the same amount of work to make a CRUD web app as it always has, and that there were some things (like handing a file upload, or centering) that were, shockingly, still just as randomly difficult as they were in VBScript twenty years ago. Where are the flying cars? The biggest problem is that developers of programming tools love to add things and hate to take things away. So things get harder and harder and more and more complex because there are more and more ways to do the same thing, each has pros and cons, and you are likely to spend as much time just figuring out which “rich text editor” to use as you are to implement it. (Bill Gates, 1990: “How many f*cking programmers in this company are working on rich text editors?!”) So, in this world of slow, gradual change and alleged improvement, one thing did change literally overnight, or, to be precise, on September 15, 2008, which was when Stack Overflow launched. Six-to-eight weeks before that, Stack Overflow was only an idea. (*Actually Jeff started development in April). Six-to-eight weeks after that, it was a standard part of every developer’s toolkit: something they used every day. Something had changed about programming, and changed very fast: the way developers learned and got help and taught each other. For many years, I was able to coast by telling delightful little stories about our incredible growth numbers, about the pay web site we made obsolete, and even about that one time when a Major Computer Book Publisher threatened to BURY US and launched their own Q\u0026A platform, which turned out to be more of a Scoff Generator than a Q\u0026A platform, but actually now almost anyone I talk to is too young to imagine The Days Before Stack Overflow, when the bookstore had an entire wall of Java and the way you picked a Rich Text Editor was going to Barnes and Noble and browsing through printed books for an hour, in the Rich Text Editor Component shelf. Stack Overflow got to be pretty big as a business. The company grew faster than any individual’s skills at managing companies, especially mine, so a lot of the business team has changed over, and we now have a really world-class, experienced team that is doing much better than us founders. We’ve done incredible work building a recruiting platform for great developers, a “reach and relevance” platform for getting developers excited about your products, and, most importantly, Stack Overflow for Teams, which is growing so quickly that soon every developer in the world will be using the power of Stack Overflow to get help with their own code base, not just common languages and libraries. And yeah, the one thing I made sure of was that everyone that came into the company understood exactly why Stack Overflow works, and what is important to the developers that it is by and for. So while we haven’t always been perfect, we have kept true to our mission, and the current leadership is just as committed to the vision of Stack Overflow as the founders are. Today we’re pleased to announce that Stack Overflow is joining Prosus. Prosus is an investment and holding company, which means that the most important part of this announcement is that Stack Overflow will continue to operate independently, with the exact same team in place that has been operating it, according to the exact same plan and the exact same business practices. Don’t expect to see major changes or awkward “synergies”. The business of Stack Overflow will continue to focus on Reach and Relevance, and Stack Overflow for Teams. The entire company is staying in place: we just have different owners now. This is, in some ways, the best possible outcome. Stack Overflow stays independent. The company has plenty of cash on hand to expand and deliver more features and fix the old broken ones. Right now, the biggest gating factor to how fast we can do this is just how fast we can hire excellent people. I’ve been out of the day-to-day for a while now. Together with Dei Vilkinsons, I’m helping to build HASH. HASH makes it easy to build powerful simulations and make better decisions. As we worked on that, we discovered that too much of the data that you might need to run simulations needs to be fixed up before you can use it. That’s because data is often published on the web, using page description languages that are more concerned with formatting and consumption by humans. They lack the structure to make the data they contain readily accessed programatically, so step one is miserable screen scraping and data cleanup. That’s where a lot of people give up. We think we have an interesting way to fix this. If it works, we’ll change the web as quickly and completely as Stack Overflow changed programming. But it’s kind of ambitious and maybe a little too GRAND. If you are interested in joining that crazy journey, do reach out. The whole thing is going to be open source, so just hang on, and we’ll have something up on GitHub for you to play with. See you soon!",
  "image": "https://149366100.v2.pressablecdn.com/wp-content/uploads/2021/06/63890965609__42347879-1BEE-4AD0-B24F-289733D844C1-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\u003cp\u003eThe other day I was talking to a young developer working on a code base with tons of COM code, and I told him that even before he was born, everyone knew that COM was already so deeply obsolete that it was impossible to find anyone who knew enough to work on it. And yet they still have this old COM code base, and they still have one old programmer holding onto their job by being the only human left on the planet with a brain big enough to manually manage multithreaded objects. I remember that COM was like Gödels Theorem: it seemed important, and you could understand it all long enough to pass an exam, but ultimately it is mostly just a demonstration of how far human intelligence can be made to stretch under extreme duress.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd, \u003cem\u003ebubbeleh\u003c/em\u003e, if there is one thing we have learned, it’s that the things that make it \u003cem\u003eeasier\u003c/em\u003e on your brain are the things that matter.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg data-recalc-dims=\"1\" fetchpriority=\"high\" decoding=\"async\" width=\"730\" height=\"548\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/63890965609__42347879-1BEE-4AD0-B24F-289733D844C1.jpg?resize=730%2C548\u0026amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/63890965609__42347879-1BEE-4AD0-B24F-289733D844C1-scaled.jpg?resize=1024%2C768\u0026amp;ssl=1 1024w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/63890965609__42347879-1BEE-4AD0-B24F-289733D844C1-scaled.jpg?resize=300%2C225\u0026amp;ssl=1 300w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/63890965609__42347879-1BEE-4AD0-B24F-289733D844C1-scaled.jpg?resize=768%2C576\u0026amp;ssl=1 768w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/63890965609__42347879-1BEE-4AD0-B24F-289733D844C1-scaled.jpg?resize=1536%2C1152\u0026amp;ssl=1 1536w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/63890965609__42347879-1BEE-4AD0-B24F-289733D844C1-scaled.jpg?resize=2048%2C1536\u0026amp;ssl=1 2048w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/63890965609__42347879-1BEE-4AD0-B24F-289733D844C1-scaled.jpg?resize=1200%2C900\u0026amp;ssl=1 1200w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/63890965609__42347879-1BEE-4AD0-B24F-289733D844C1-scaled.jpg?w=1460\u0026amp;ssl=1 1460w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/63890965609__42347879-1BEE-4AD0-B24F-289733D844C1-scaled.jpg?w=2190\u0026amp;ssl=1 2190w\" sizes=\"(max-width: 730px) 100vw, 730px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eProgramming changes slowly. Really slowly.\u003c/p\u003e\n\n\n\n\u003cp\u003eSince I learned to code forty years ago, one thing that has mostly, \u003cem\u003emostly\u003c/em\u003e, changed about programming is that most developers no longer have to manage their own memory. Even getting that going took a long long time.\u003c/p\u003e\n\n\n\n\u003cp\u003eI took a few stupid years trying to be the CEO of a growing company during which I didn’t have time to code, and when I came back to web programming, after a break of about 10 years, I found Node, React, and other goodies, which are, don’t get me wrong, amazing? Really really great? But I also found that it took approximately the same amount of work to make a CRUD web app as it always has, and that there were some things (like handing a file upload, or centering) that were, shockingly, still just as randomly difficult as they were in VBScript twenty years ago. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhere are the flying cars?\u003c/p\u003e\n\n\n\n\u003cp\u003eThe biggest problem is that developers of programming tools love to add things and hate to take things away. So things get harder and harder and more and more complex because there are more and more ways to do the same thing, each has pros and cons, and you are likely to spend as much time just figuring out which “rich text editor” to use as you are to implement it.\u003c/p\u003e\n\n\n\n\u003cp\u003e(Bill Gates, 1990: “How many f*cking programmers in this company are working on rich text editors?!”)\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" width=\"730\" height=\"548\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/IMG_7992.jpg?resize=730%2C548\u0026amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/IMG_7992-scaled.jpg?resize=1024%2C768\u0026amp;ssl=1 1024w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/IMG_7992-scaled.jpg?resize=300%2C225\u0026amp;ssl=1 300w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/IMG_7992-scaled.jpg?resize=768%2C576\u0026amp;ssl=1 768w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/IMG_7992-scaled.jpg?resize=1536%2C1152\u0026amp;ssl=1 1536w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/IMG_7992-scaled.jpg?resize=2048%2C1536\u0026amp;ssl=1 2048w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/IMG_7992-scaled.jpg?resize=1200%2C900\u0026amp;ssl=1 1200w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/IMG_7992-scaled.jpg?w=1460\u0026amp;ssl=1 1460w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/IMG_7992-scaled.jpg?w=2190\u0026amp;ssl=1 2190w\" sizes=\"(max-width: 730px) 100vw, 730px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eSo, in this world of slow, gradual change and alleged improvement, one thing did change literally overnight, or, to be precise, on September 15, 2008, which was when \u003ca href=\"https://www.joelonsoftware.com/2008/09/15/stack-overflow-launches/\"\u003eStack Overflow launched\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eSix-to-eight weeks before that, Stack Overflow was only an idea. (*Actually Jeff started development in April). Six-to-eight weeks after that, it was a standard part of every developer’s toolkit: something they used every day. Something \u003cem\u003ehad\u003c/em\u003e changed about programming, and changed very fast: the way developers learned and got help and taught each other.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor many years, I was able to coast by telling delightful little stories about our incredible growth numbers, about the pay web site we made obsolete, and even about that one time when a Major Computer Book Publisher threatened to BURY US and launched their own Q\u0026amp;A platform, which turned out to be more of a Scoff Generator than a Q\u0026amp;A platform, but actually now almost anyone I talk to is too young to imagine The Days Before Stack Overflow, when the bookstore had an entire \u003cem\u003ewall\u003c/em\u003e of Java and the way you picked a Rich Text Editor was going to Barnes and Noble and browsing through printed books for an hour, in the Rich Text Editor Component shelf.\u003c/p\u003e\n\n\n\n\u003cp\u003eStack Overflow got to be pretty big as a business. The company grew faster than any individual’s skills at managing companies, especially mine, so a lot of the business team has changed over, and we now have a really world-class, experienced team that is doing much better than us founders. We’ve done incredible work building a recruiting platform for great developers, a “reach and relevance” platform for getting developers excited about your products, and, most importantly, \u003ca href=\"https://stackoverflow.com/teams\"\u003eStack Overflow for Teams\u003c/a\u003e, which is growing so quickly that soon every developer in the world will be using the power of Stack Overflow to get help with their own code base, not just common languages and libraries. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" width=\"730\" height=\"548\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/64308401762__1F48CB72-2FC2-4F18-9337-91AEB9E491C7.fullsizerender.jpg?resize=730%2C548\u0026amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/64308401762__1F48CB72-2FC2-4F18-9337-91AEB9E491C7.fullsizerender-scaled.jpg?resize=1024%2C768\u0026amp;ssl=1 1024w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/64308401762__1F48CB72-2FC2-4F18-9337-91AEB9E491C7.fullsizerender-scaled.jpg?resize=300%2C225\u0026amp;ssl=1 300w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/64308401762__1F48CB72-2FC2-4F18-9337-91AEB9E491C7.fullsizerender-scaled.jpg?resize=768%2C576\u0026amp;ssl=1 768w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/64308401762__1F48CB72-2FC2-4F18-9337-91AEB9E491C7.fullsizerender-scaled.jpg?resize=1536%2C1152\u0026amp;ssl=1 1536w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/64308401762__1F48CB72-2FC2-4F18-9337-91AEB9E491C7.fullsizerender-scaled.jpg?resize=2048%2C1536\u0026amp;ssl=1 2048w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/64308401762__1F48CB72-2FC2-4F18-9337-91AEB9E491C7.fullsizerender-scaled.jpg?resize=1200%2C900\u0026amp;ssl=1 1200w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/64308401762__1F48CB72-2FC2-4F18-9337-91AEB9E491C7.fullsizerender-scaled.jpg?w=1460\u0026amp;ssl=1 1460w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/64308401762__1F48CB72-2FC2-4F18-9337-91AEB9E491C7.fullsizerender-scaled.jpg?w=2190\u0026amp;ssl=1 2190w\" sizes=\"(max-width: 730px) 100vw, 730px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAnd yeah, the one thing I made sure of was that everyone that came into the company understood exactly why Stack Overflow works, and what is important to the developers that it is by and for. So while we haven’t always been perfect, we have kept true to our mission, and the current leadership is just as committed to the vision of Stack Overflow as the founders are.\u003c/p\u003e\n\n\n\n\u003cp\u003eToday we’re pleased to announce that Stack Overflow is joining \u003ca href=\"https://www.prosus.com\"\u003eProsus\u003c/a\u003e. Prosus is an investment and holding company, which means that the most important part of this announcement is that Stack Overflow will continue to operate independently, with the exact same team in place that has been operating it, according to the exact same plan and the exact same business practices. Don’t expect to see major changes or awkward “synergies”. The business of Stack Overflow will continue to focus on Reach and Relevance, and Stack Overflow for Teams. The entire company is staying in place: we just have different owners now.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis is, in some ways, the best possible outcome. Stack Overflow stays independent. The company has plenty of cash on hand to expand and deliver more features and fix the old broken ones. Right now, the biggest gating factor to how fast we can do this is just how fast we can \u003ca href=\"https://stackoverflow.com/company/work-here\"\u003ehire excellent people\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cvideo controls=\"\" src=\"https://www.joelonsoftware.com/wp-content/uploads/2021/06/63017985094__5783FDD0-E895-4A7F-BB5A-A1CD6B6C9DCF.mov\"\u003e\u003c/video\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eI’ve been out of the day-to-day for a while now. Together with Dei Vilkinsons, I’m helping to build \u003ca href=\"https://hash.ai\"\u003eHASH\u003c/a\u003e. HASH makes it easy to build powerful simulations and make better decisions. As we worked on that, we discovered that too much of the data that you might need to run simulations needs to be fixed up before you can use it. That’s because data is often published on the web, using page description languages that are more concerned with formatting and consumption by humans. They lack the structure to make the data they contain readily accessed programatically, so step one is miserable screen scraping and data cleanup. That’s where a lot of people give up.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"576\" height=\"1024\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/D88FF351-904A-4C36-94C7-0C27D9BEF864.jpg?resize=576%2C1024\u0026amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/D88FF351-904A-4C36-94C7-0C27D9BEF864-scaled.jpg?resize=576%2C1024\u0026amp;ssl=1 576w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/D88FF351-904A-4C36-94C7-0C27D9BEF864-scaled.jpg?resize=169%2C300\u0026amp;ssl=1 169w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/D88FF351-904A-4C36-94C7-0C27D9BEF864-scaled.jpg?resize=768%2C1365\u0026amp;ssl=1 768w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/D88FF351-904A-4C36-94C7-0C27D9BEF864-scaled.jpg?resize=864%2C1536\u0026amp;ssl=1 864w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/D88FF351-904A-4C36-94C7-0C27D9BEF864-scaled.jpg?resize=1152%2C2048\u0026amp;ssl=1 1152w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/D88FF351-904A-4C36-94C7-0C27D9BEF864-scaled.jpg?resize=1200%2C2133\u0026amp;ssl=1 1200w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2021/06/D88FF351-904A-4C36-94C7-0C27D9BEF864-scaled.jpg?w=1440\u0026amp;ssl=1 1440w\" sizes=\"(max-width: 576px) 100vw, 576px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eWe think we have an interesting way to fix this. If it works, we’ll change the web as quickly and completely as Stack Overflow changed programming. But it’s kind of ambitious and maybe a little too GRAND. If you are interested in joining that crazy journey, do reach out. The whole thing is going to be open source, so just hang on, and we’ll have something up on GitHub for you to play with.\u003c/p\u003e\n\n\n\n\u003cp\u003eSee you soon!\u003c/p\u003e\n\n\n\n\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2021-06-02T16:36:19Z",
  "modifiedTime": "2024-03-12T16:23:02Z"
}
