{
  "id": "d80c16ca-0e1a-41ef-b816-560b1a2de885",
  "title": "S25:E5 - Mastering Leadership (Brian Jenney)",
  "link": "https://www.codenewbie.org/podcast/mastering-leadership",
  "description": "In this episode, Saron sits down with Brian Jenney, Senior Software Engineering Manager at Clorox. Saron talks to Brian about his struggles with addiction, how he changed his life and turned a new leaf with coding and sobriety, and how his go-getter personality has served him well and continues to play a role in his current success. They also talk about what being a leader looks like and the ways in which you can become a leader regardless of the challenges life throws at you. Show Links Partner with Dev \u0026 CodeNewbie! (sponsor) GitHub YouTube LinkedIn X Instagram AngularJS C# JS Code Coach",
  "author": "CodeNewbie",
  "published": "Wed, 13 Sep 2023 03:00:00 -0400",
  "source": "http://feeds.codenewbie.org/cnpodcast.xml",
  "categories": [
    "Podcast"
  ],
  "byline": "",
  "length": 50039,
  "excerpt": "[00:00:05] SY: Welcome to the CodeNewbie Podcast where we talk to people on their coding journey in hopes of helping you on yours. I’m your host, Saron, and today we’re talking about how to be a leader with Brian Jenney, Senior Engineering Manager at The Clorox Company and owner of JS Code Coach.",
  "siteName": "",
  "favicon": "https://www.codenewbie.org/assets/favicon-180-b6d80e4d946988dd84ac70aca4f458997d945d020597dcd414e0a1f0c6133b74.png",
  "text": "[00:00:05] SY: Welcome to the CodeNewbie Podcast where we talk to people on their coding journey in hopes of helping you on yours. I’m your host, Saron, and today we’re talking about how to be a leader with Brian Jenney, Senior Engineering Manager at The Clorox Company and owner of JS Code Coach. [00:00:19] BJ: I took a chance. I spent the only $2,000 I had and I bet it all on the table for that career, best $2,000 I ever spent. I left a job where I was stable for a five-person startup. I knew that, like, “Okay, you’re going to have to take some chances if I wanted to get where I wanted to be.” And that’s really helped me out, I think, over the years. [00:00:36] SY: Brian opens up about his struggles with addiction, how he turned a new leaf with coding and sobriety, and the ways he still benefits from his hustler mentality even to this day after this. [MUSIC BREAK] [00:00:53] SY: Thank you so much for being here. [00:00:54] BJ: Thanks for having me. Really excited to speak with you. [00:00:56] SY: So let’s start all the way at the beginning. What was life like for you growing up? Was tech a big part of your childhood? [00:01:04] BJ: Absolutely not. [00:01:06] SY: Okay. [00:01:08] BJ: Not in the least bit. I didn’t grow up using computers, and I didn’t start writing code till about the age of 30 after making a pretty major life transition that maybe we’ll discuss. But yeah, didn’t grow up with computers or anything like that at all. [00:01:25] SY: What was your environment like growing up? What were you into at that point? [00:01:28] BJ: You know, I had an interesting life in childhood, I guess. I grew up in Oakland, California, was a pretty good kid for most of my life, but I got involved in the wrong stuff early on, around 12 or 13, I kind of, you know, fell a little bit into street type of activity, dabbled in a little bit of crime and doing drugs and things like that. And I still went to college. But afterwards, I still had this bad streak and addictions that I picked up. And I just kind of went off the rails like throughout my 20s. It was a really wild period. I just fell all the way off. I ended up getting really caught up in addiction and finally having an intervention like almost like you see on these TV shows. My mother came and read me an ultimatum. I just had a child. I wasn’t doing the right things. And then I got sober at that point and I found I had a lot of time on my hands. And I thought, “What do people do with all this time?” I was also driving Lyft at the time and Uber in the City of San Francisco. And I would meet people. I’m like, “Oh, what do you do?” Software engineer, software engineer, software engineer. I was like, “Oh, okay, cool. You know, what does that really mean?” I got a real job at this point in a community college. One of my jobs is updating like a website content management type site, like a WordPress type site. And one day I had to call in a woman that was the webmaster and she wrote some HTML or something code in there. I thought, “I got to know this. Everybody’s talking about this thing. She just wrote some code in front of me. This is nuts. This is how the internet works.” I forget who told me exactly about Codecademy. I went in there and just my addictive mindset was immediately triggered by the joy and the dopamine rush from figuring out coding problems. And that’s when I got introduced to coding. [00:03:19] SY: Wow! What an adventure. Oh my goodness! Okay, so let’s take it back. Let’s break this down a little bit more. So you were 12, 13, getting involved in the wrong crowds. If you don’t mind, tell me a little bit more about that. Were you into anything relating to the technology or video games at all or just a totally different world for you? Not even video games, totally different world. [00:03:42] BJ: Whole different world. [00:03:44] SY: Whole different world. [00:03:44] BJ: I didn’t grow up with a computer at that point. My parents are getting a divorce. I actually lived with my grandmother for a year between middle school and high school. She’s an old woman. And I didn’t have a computer even when I went to college. I borrowed a laptop or I went to the library to write everything. And I was one of the only people I think that didn’t have a computer at the school. It just was never on my mind. In fact, I just never saw the value in learning anything about computers. I just thought, “What do you use it for? Going to the internet?” [00:04:14] SY: “What’s the internet for? What’s that all about?” Yeah. [00:04:15] BJ: Yeah, just totally didn’t compute to me. I’m like, “I don’t care about that stuff.” I didn’t even know what I didn’t know. The first time I saw that woman write code, I was like, “Wait, how did you know that? How did you understand that that was…?” And I think I’m further behind most people my age in that regard. So I really was a late bloomer. [00:04:34] SY: Did you have any aspirations of what you wanted to be? I mean, you went to college, so clearly you were somewhat thinking about the future and kind of planning for your future. What careers did you consider? What did you study? [00:04:46] BJ: You know, I always liked English and writing, and I thought that maybe I could make a living writing. And that’s probably also what drew me to write a lot on LinkedIn currently or write articles. I’ve always enjoyed writing, even in my, like, darkest days. One thing that was kind of consistent was that I would write. I wouldn’t read much, but I’ve ramped up my reading since then a lot more. So yeah, I thought maybe I can make a career out of that. Something like kind of more artsy or maybe teaching even. I thought maybe I’ll teach people, maybe I’ll do something with writing and get paid to write and didn’t pan out. [00:05:16] SY: Usually you hear of kids having a rough time in high school, middle school, maybe falling in with some bad friends and then college. They’re an adult now. So they grew up a little bit. But it sounds like after college was when things kind of went down the wrong path for you. What do you think triggered that? [00:05:31] BJ: As a child, I felt like I always had that hustler mentality. At a young age, I was doing car washes in my neighborhood for money with my friends. I was selling mixtapes at school, in elementary. In high school, I learned how to paint houses and hung up signs to paint houses. I always was thrilled by the idea of, one, being kind of my own boss, two, making money, and the lure of fast money got me into a different life than I ever imagined. I saw a friend say, “Here’s how I’m doing this thing.” And I said, “Hey, I want to do that.” And there’s nothing quite like the thrill to me of making very fast money at that age. And when I saw it, I was hooked. I was like, “I want to do this.” And why would I waste time doing anything else? Terrible decision. One of the worst decisions I ever made in my life. [00:06:18] SY: What made you realize it was a bad decision? [00:06:23] BJ: It was so many things. I’m thinking now in retrospect. I think I knew when I was spending money to support my addictions faster than I could even make it. I mean, I was making what I considered a lot at that age, I was between 22 and like let’s say 27 doing this. And then I’d also, I mean, the reality is there’s robberies, the constant threat of arrest, the kind of people that you deal with that are cutthroat and want nothing more than to use you and that you can’t trust. Eventually, you play a character, like I wasn’t some hardcore guy, but I had to play a character essentially to fit in. And eventually, you start realizing that you’re not playing a character anymore that this is really who you’ve become. And that was a scary realization, because I remember I was on the phone trying to get a “real job”, and I’ll never forget this. My friend said the feedback from the woman was that she said, “Well, he sounds too street.” And I thought, “Wow! I can’t believe I’ve like gone so far in the opposite direction that I don’t even know who I am anymore.” And that was scary to me. [00:07:22] SY: Wow! Wow! I know that for some people it’s becoming a parent that changes them, that kind of helps them focus, prioritize, change the course of their life, but it sounds like even once you had kids you still continued this life. What effect did being a parent have on you? [00:07:40] BJ: It didn’t have quite the effect it should have, to be completely honest. That was interesting. I think a lot of people said, “Oh, it must have changed when you had a kid.” It did not. I didn’t change anything. I was barely present for the first year of my son’s life. I was just out all the time, hustling out throughout all hours of the night, sleeping during the day. I was awful. It was one of the most embarrassing moments probably of my life, which led to that intervention. That was really the catalyst. I know people use this cliché, I was either going to end up dead or in prison, but it was apparent. I mean, it was so obvious to me. I saw people going to prison around me. I saw people losing their life, getting killed, or killing themselves, and I could feel it. I’m like, “The end is coming near.” [00:08:20] SY: Tell me about that intervention. You mentioned that your mom initiated it. What did that look like? How did that go down? [00:08:28] BJ: It was Easter Sunday. I had been out all night. I was at a friend. We crashed a car. [00:08:33] SY: Whoa! [00:08:33] BJ: Yeah, and then I was walking back at 6 a. m. Still drinking. I walked into the house and then I basically passed out on the bed around 7 a. m. It was Easter Sunday. I hear a knock at the door later waking me up and my partner, she said, “Hey, your mom’s here.” And she came in. She had a letter, just like in the show. She took me out and she read me this letter saying how disappointed she was and how I didn’t deserve my kids and how I basically was going to lose everything. And then even she was in agreement that I was not fit to be in their lives and it hurt. I was mad. I was angry. I thought everybody’s against me and everybody’s ganging up on me. I was like, “Oh, poor me.” You know, typical kind of selfish outlook on it. And I made a promise though that day. I said, “I’m going to stop.” And I thought I have no clue how I’m going to stop. And I just said, it sounds kind of corny now, but I thought, “I just need to get to one more day. I’ll just quit today and then I’ll see what happens tomorrow.” I kept that going, and I just quit cold turkey. [00:09:31] SY: Wow! [00:09:31] BJ: And I haven’t. That was ten years ago. It feels like a whole other lifetime ago, which is why I feel more comfortable speaking about it now. But since then I haven’t taken a drink or done any kind of terrible drugs. So it worked. [00:09:44] SY: Was that the first time your mother had pulled you aside and tried to intervene? [00:09:48] BJ: Yes. No one had a clue how bad I had gotten except for people that were close to me. I was what you consider pretty functional. I barely slept. I did have a job. At this point, I was already transitioning a bit out of the street life. So I had a job, but I was still like one foot in, one foot out. I was hustling on the side. I was working a nine-to-five and I was just drinking like an animal, like nonstop. And yeah, it was hard to see, but people could see. I was starting to show signs. I couldn’t hide even at work. It was obvious that I was not all the way there. I was a mess. Yeah. [00:10:23] SY: When you stopped and quit cold turkey, what do you think it was that kept you going on a day-to-day basis? Because it’s almost like every day you had a new decision to make, right? Is this the day that I go back or is this the day that I stay clean? What do you think it was that made you continue to make the right decision every single day? [00:10:44] BJ: I’ll be completely honest with you, it’s still a decision. Every once in a while, I’ll have that terrible feeling like, “Oh, you could probably drink one day now. You could probably take a couple drinks.” It’s really hard to fight that. Some days it happens way less often than it ever has, but what kept me going, I think, was one part of it was a bit of like to show people like, I think I use that as a motivation, I think a lot of people say, “Oh, yeah, right?” I tell my friends like, “Oh, so when are you going to stop this thing?” And I said, “What do you mean?” I said, “Oh, well, you’re not really going to do this. Right?” And I thought, “Geez! This is what people think of me?” And I’m stubborn. I’m a pretty stubborn person. I saw the benefits. I’m like, “Man, I feel I’m more energized. I’m not feeling guilty.” I had incredible anxiety attacks for years, like non-stop. I came to think it was normal and they’ll stop too. So I’m like thinking my life has improved significantly within this first couple. And then when I picked up coding, something I never would have imagined, I was like that was the sign to me like, “Okay, there’s no way I’m going back drinking because like on one side is like death, anxiety, depression.” [00:11:47] SY: Lots of fun stuff. Yeah. [00:11:48] BJ: Yeah. Right. And on this side is like me feeling great. I’m getting up. I’m feeling like I got tons of time. I enjoy movies now. I’m writing code. I feel proud about myself. So the feeling of pride is what kept me going. I thought I need more of this. Like, “How far can I go?” [00:12:03] SY: That makes a lot of sense. Yeah. Tell me about how your relationships with the people around you change. Because I imagine it’s not just what you do. It’s who you do it with, who you spend your time with. It’s your son, your partner, your mother. I assume so much about your life had to have changed with that decision that you were making every day. What did that look like? [00:12:25] BJ: You know, one of the saddest things people talk the least about getting sober is that yeah, it’s kind of lonely, like I had a large circle of friends at this time. And I don’t talk to any of them anymore, barely any of them. I have very few friends that have kept from that time. And I’m thankful for the ones that have supported me and maintain their friendship with me. But the majority of them didn’t. My relationships though, the ones I did maintain, the quality improved tremendously. Also, I found like now I’ve made friends like through LinkedIn. I’ve made other people that either share a similar past or that kind of can help me currently where I am. So it’s been great meeting new people and making better friends, doing more positive things. [MUSIC BREAK] [00:13:22] SY: So let’s talk about ride share because that was kind of the first time you heard whispers of coding and what that world was about. How did you end up doing ride share? How’d you end up working for Lyft? [00:13:33] BJ: This was like back in the wild, wild west days of Lyft and Uber, and it fit into my story, kind of the whole hustler mentality, like I’ve kind of kept that mentality even now. And I was always looking like, “What can I do for more money?” I wasn’t doing illegal stuff. So I thought, “Well, I need some other thing to do.” And I was like, “I’ll do this.” I also had a new child. So kind of led me to be like, “Well, I need some more money.” And I would like after work, I would just do Lyft and Uber. Then when I started writing code and meeting software engineers, then it got even more interesting to me. It’s like, “Oh, this is kind of cool too. Now I’m like meeting.” [00:14:06] SY: You’re networking. [00:14:06] BJ: Yeah, right? I was like networking in the cars and understand, “Oh, so what do you do? Oh, how do you do that? What language do you use? Oh, how’d you learn? How would you get a job? How would I get a job?” You know, asking these people. So it was really cool. I got exposed to a lot of software engineers just doing Lyft and Uber. Yeah. [00:14:21] SY: And what did you learn? What did you pick up in those car rides? [00:14:25] BJ: Mostly that people were much nicer than I ever anticipated. That was the biggest one. I kind of thought people would write me off like, “Oh, you? Yeah, right.” You know, like, “Oh, what are you doing?” You’re like, “Oh, you’re an Uber driver, but you’re also a software engineer.” Like, “How does that work out?” And they were super friendly. I was shocked how people were so friendly. I think one guy wrote me like a detailed email about what I should study. [00:14:48] SY: Wow! [00:14:49] BJ: Yeah. People would like tell me where to go, like, “Oh, you should try this meetup,” Or, “Oh, have you heard about this event here or something?” I’m like, “Oh, I never thought about that.” So people were just incredibly gracious and nice, like beyond belief, like in retrospect, it’s pretty wild how nice people were. [00:15:05] SY: So what was the trigger that led you to actually look up your first coding resource? Was it those conversations or was it the webmaster that you mentioned? [00:15:13] BJ: I believe it was her that sparked my immediate interest. Like, “Okay, I have to know how she’s doing this.” And I believe it was somebody in Lyft or one of my rides that said, “You should try this site called Codecademy.com.” And that’s when I went on there and I was like, “Oh, this is like a free site. You can learn. This is crazy.” And then I just was like addicted. And I mean, that was kind of part of my superpower, this not so healthy addiction that I have, but it also really helped in the coding aspect where I could spend hours doing it and just be hooked. [00:15:46] SY: What was the first thing that you learned? Do you remember? [00:15:48] BJ: HTML and CSS. So you have to start. [00:15:52] SY: And how did it feel to go through those courses and go through those lessons? What was that like for you? [00:15:57] BJ: It was frustrating for sure. HTML and CSS were fairly straightforward. And then I added Bootstrap and I’m like, “Wait, what’s going on?” [00:16:05] SY: “What’s happening?” Yeah. [00:16:06] BJ: And then the other thing was, here’s the weird thing. I was like, “Okay, cool. This works in this IDE.” I didn’t even know it was called an IDE at the time. I was like, “Okay, this works in this site. I’m writing code and I see it, but how do real developers do that?” I didn’t understand. Like, “Wait, do you have to have…?” This is before VS Code. I didn’t know, right? And there was no real YouTube videos on this stuff either. So I went to a meetup and then somebody said, “Here’s how you do it in a text editor.” And they showed me Sublime, but doing those modules, I remember it was really fun. At the same time, as soon as I got to like JavaScript and Bootstrap, that’s when things became really difficult. And I thought, “I don’t think I can do this.” [00:16:46] SY: What did you do with that feeling? [00:16:47] BJ: I honestly thought, “You know what? I’ll just stick to what I know. I like HTML and CSS. I bet you I can get a job just doing that.” And I was like, “I’m going to go all in on HTML and CSS and I’ll just be a front-end developer, maybe an email developer.” I didn’t really care at the time. I didn’t even know what was out there really. So I said, “I need to know just enough JavaScript or jQuery,” at the time to be dangerous in order to like do some basic stuff on a site. But beyond that, I don’t want to be a JavaScript developer. Last thing I want. [00:17:15] SY: And did that work? Were you able to get that? [00:17:17] BJ: Oh, not at all. [00:17:20] SY: Okay. [00:17:21] BJ: Not one bit. [00:17:22] SY: Tell me, how did you figure out that that wasn’t going to work? What happened? [00:17:25] BJ: Oh, as soon as I started going for job interviews. I would go to these job interviews and then people were like, “I want to hire you as a NodeJS developer.” I’m like, “Wait, what is that?” [00:17:33] SY: “What is that?” [00:17:34] BJ: “What is that?” And then I’m like, “Okay, I got to learn this stuff.” So then I picked up a big book and I read the book and I’m like, “This book is going to teach me JavaScript.” And I read the whole book and I was like, “Okay, I still don’t know anything now.” [00:17:44] SY: Oh, no! [00:17:46] BJ: I sat down, like, tried some code. I’m like, “Oh, no, I know nothing.” Then I reached out to Facebook. I don’t even use Facebook, but I said, “Hey, who can help me become a software engineer?” A buddy that I hadn’t spoken to in 10 years who I was kind of an acquaintance with in high school, reached out and say, “Hey, I can help you.” He started teaching me stuff and like got me on some gigs and then I learned a lot through him, some practical ways of learning JavaScript. I was way too much into the conceptual stuff, like reading books about like, “Here’s the odd parts of JavaScript,” and like that… [00:18:15] SY: That’s not helpful. [00:18:17] BJ: Super helpful. And then my first job was like a full stack C# developer using AngularJS. I’m like, “Well, now here we go,” trial by fire. So here I am writing C# and having to learn that on the job. [00:18:27] SY: Wow! Wait. Did you know C#? [00:18:29] BJ: Not at all. [00:18:30] SY: Oh boy. Okay. And did you know Angular? [00:18:33] BJ: No. [00:18:34] SY: Okay. So how did you get that job? How did you manage that? [00:18:37] BJ: The company I came in when they were barely… they were using something like FileMaker, which is archaic now, to, like, compose these apps. And you had to write small amounts of JavaScript and SQL queries. And I thought, “Cool, I can do that.” And they hired me, even though I could barely do that, but they needed somebody that knew HTML and CSS as well. And I did, they had back-end developer, but he just didn’t do CSS. He didn’t really know like basic front-end stuff. So then they said, “We’re going to make a switch as an organization and use AngularJS, C#, .NET and SQL.” I’m like, “Okay.” And then I just basically through lots of trial and error and through very, very kind teammates, I learned enough throughout the two years I was there on the job to be pretty good. [00:19:18] SY: Wow! Okay, so really it was the company hired you for one thing, then they switched and you kind of had to keep up? [00:19:23] BJ: Oh, yeah. [00:19:24] SY: What was getting that first job like for you? Tell me about the interview process, how long it took. What was that like? [00:19:30] BJ: So at this point, I joined a bootcamp, even though I already knew a lot of stuff. I had written websites and I had done some freelance work, but I joined a bootcamp for like 2,000 bucks that I thought was going to help me learn more JavaScript. And what they really helped me with was my confidence because I didn’t feel like I was ready to apply for jobs. And they said, “Dude, you should be applying.” And so like four weeks or six weeks into the bootcamp, the owner like sat me down and said, “You’re going to start applying.” Like, “I’m going to force you to sit here and apply.” And I did. And I just did a ton of applications. He helped me with my resume. And this was also in the Wild West days. Things were, I’ll be honest, they were just easier than they are now. [00:20:03] SY: Yeah. That’s true. [00:20:03] BJ: So I was able to get interviews kind of shockingly with very little knowledge. And I must’ve done a dozen interviews where I failed all of them. And I finally got to one, they did a phone screen. It was a basic JavaScript question. I remember it was about how to manipulate a string to be formatted like a phone number. I’ll never forget that question. I somehow got it and I was shocked even at myself. I was like, “Oh, I can’t believe it. The JavaScript stuff is finally paying off.” And then it was an onsite, your typical onsite, meet the team, another small technical challenge using basic HTML and CSS and JavaScript, very little JavaScript. And then finally, an “output whiteboard”. You can’t see my fingers, but I’m doing quote signs. There’s a whiteboard challenge, which is essentially explaining how does like the interaction between a client and an API work. And I basically drew a picture like of me and a jQuery like code that would hit an API and an API returns from JSON and then I display it on the screen. And that was the extent of my interview. [00:21:01] SY: Very cool. Okay. So how long did it take to get that first job? How much time had passed? [00:21:07] BJ: Two months or less. [00:21:08] SY: Two months. Wow, that’s amazing. Especially in the market today, that’s record. That’s record time. [00:21:13] BJ: I’ll say this. I totally know that there was luck involved. There was a guy that I worked with as well. He was a CS degree, well-spoken, very intelligent, was crushing it on all the assignments we did, just very smart. It took him a full year to get a job. [00:21:27] SY: Wow! [00:21:28] BJ: Me on the other hand, I got like bumbled my way into a job. [00:21:34] SY: What do you think it was that made you successful beyond luck? Was there anything that you feel like play to your strengths you know about or is there anything that you feel kind of made you stand out as a candidate? [00:21:46] BJ: I think part of it was I had been through a lot in life at that time. Like I had been through some pretty crazy events. And I thought this, in comparison, I’m not trying to minimize it. It was still stressful, but I didn’t have that same fear I think a lot of people did of getting rejected. My lack of fear of rejection was helpful because I was like, “I’m going to go for a job. I know I have no business going to, but if I don’t get it, I’m not expecting to get it. I’m going to learn something in this interview.” And I would go to places and I always asked, “How could I have gotten hired? What would you suggest I do more of?” And these people would be open to talk to me. Plus, I came from a lifestyle where I was selling people all the time. And I was selling to dangerous people. So I knew how to talk to people to make them feel at ease, I think, make them feel comfortable. I knew how to establish rapport with people quickly, and these were all in person interviews because this is way pre pandemic 2013 or ’12 or whatever. So I was meeting people in person and shaking hands and rubbing elbows and stuff like that, making friends. [00:22:43] SY: So how long did that first job last? [00:22:45] BJ: Two years. And I loved it. I could have left earlier, but eventually I left because I thought, “I got to leave here because we’re using outdated technology.” And I knew that like part of my growth required for me to leave. And I was also working at a bootcamp on the side. Again, goes back to my having this hustler mentality. [00:23:01] SY: Got to hustle, yeah. [00:23:03] BJ: So I was working at this bootcamp on the side after work. And I was like, “Cool, I can learn more here and they’re paying me to learn.” Oh yeah. No brainer. So I’m here learning and then I’d meet the other developers. They’re like, “Oh, what are you working on?” And I’m like, “Oh, well, you guys are making that much?” Like, “You can make that much being a developer?” I had no clue. I was making peanuts at this time, and I was still super happy. I was like, “I’m happy. I’m having a great job. I feel proud about what I do.” And I’m like, “Wait, you’re making that much?” And I’m like, “Okay, I need to go explore.” [00:23:29] SY: Do you mind sharing numbers? What were you making? What did you hear? [00:23:31] BJ: I like to share numbers because when those guys did it, it really helped me understand what was possible. I was like, “Oh!” I was making 60, 000 at the time. This is in the San Francisco Bay Area. [00:23:40] SY: Right. Yeah. [00:23:42] BJ: I had two kids and a mortgage. I was still making things work. I was working in a bootcamp on the side too. And then the next job, I made a jump, I made 120, 000. [00:23:51] SY: Hey! There we go. Now we’re talking. [00:23:54] BJ: I was like, “Whoa!” Honestly, I had an anxiety attack. It was so weird. Everybody thought, “Oh, I can’t believe you made it.” I’m like, “Yeah, but what are they going to expect?” [00:24:03] SY: Yeah, absolutely. Big jump. Big jump. Good for you. And good for you for finding that information out because too often we just don’t know and we can’t advocate for ourselves. We can’t negotiate if we don’t know, what it could be, what it’s supposed to be. So that’s great. [00:24:16] BJ: Exactly. And then I kept making these jumps and that was really helpful having a few people that were open to tell me that. [00:24:21] SY: So you transitioned from being a developer to an engineering manager. You’re now a senior engineering manager. What was that transition like going from dev to the management track? [00:24:31] BJ: I’m still in the beginning of it. I feel like a junior engineering manager, I had the senior engineering manager by title and I made the transition about two years ago. That was difficult. I worked at a few companies. I’ve done a number of contract jobs. And at this company, I came in at Clorox where I currently am. I came in and I kind of naturally began influencing the technical decisions. I was helping things with project management. There was a large amount of junior developers at the time when I first came on, and I really enjoyed helping them and accelerating their JavaScript knowledge specifically and kind of helping them understand, “Okay, here’s how we can do things better. Here’s better processes.” When the manager conversation came up, I thought, “Yeah, I’ll do it.” And that transition has been tough because now a lot more of my time is spent figuring out processes. My output is not so clear. So it’s really difficult to look back and say, “Oh, I did this. I wrote this much code and I finished this feature and I feel really proud about the work I’ve done.” Now I sit back and I constantly wonder if I’d done enough. “Are the people happy here? Am I doing what I should be doing? Are the processes running the way they should be? Are people afraid to tell me if things aren’t going wrong?” So it’s a lot of doubt. It’s a lot less material out there that you can look to for management and saying, “Well, how do you be a good engineering manager? What does that entail?” [00:25:46] SY: Absolutely. Yeah. That makes a ton of sense. So tell me about what you imagined being an engineer was going to be like when you were driving people in those lists and you were hearing these stories and hearing about software engineers and then what it actually ended up being like for you. Did it end up being what you thought it would be? [00:26:04] BJ: Not at all. [00:26:05] SY: Really? [00:26:06] BJ: No, I really had this image, I guess I had this image that if you’re a real software engineer, oh, you were just cruising, writing code all day and no distractions. You’re like a code monkey. You’re sitting there, pumping out code, and figuring out really tough problems. And like, boom, at the end of the day, you slam your laptop shut and then the code is deployed. The reality was a lot more intense and stressful, but also more enjoyable. The first time I went to a stand up, which is, I’m sure you know, but when you go tell the team your status for the day, you say, “I worked on this ticket or this feature, number X, Y, Z, 1, 2, 3.” And I’m like, “Wait, what the hell is going on?” Like, “What is this all about?” The whole software development life cycle is something I was clueless about. So there was QA people to be involved with. There was a product manager. There was data people. There was so much more than just writing the code into an editor. And that’s the pieces I had no clue about. [00:27:04] SY: Was it as fun as you thought it would be? How was the fun and exciting factor? [00:27:10] BJ: I still love it. I mean, I’ve definitely had terrible days and rough days and days where I suck or days where I feel awesome. But I’ve always enjoyed it. I don’t enjoy, of course, tons of meetings as much, or when processes aren’t done well, that can be annoying. But in general, I liked it even then. It was all new. It was so new to me. And it was even more new that I hadn’t really had a professional job, honestly. So the whole thing was like this really crazy ride. And I still feel like I’m on it. I’m like, “Whoa!” Yeah, it’s like a big adventure. At every new stage, I’m like, “Oh, this is what’s behind that curtain.” [00:27:47] SY: Coming up next, Brian and I talk about his other passion, teaching others as they navigate their own coding journeys after this. [MUSIC BREAK] [00:28:09] SY: So always a hustler. You’re not just an engineering manager. You’re also a coach. So you have a coaching business called JS Code Coach. Tell me a little bit more about that. How did you get started with that? [00:28:20] BJ: Yeah. Well, I started helping people on my team at Clorox specifically with their JavaScript knowledge. I noticed that a lot of them were React developers. We were writing a JavaScript library at the time and I was getting help with it. And I noticed that some of the developers weren’t able to contribute much to it because they were really good at React, but not so good at JavaScript. And I thought, “This is going to hurt you down the line.” Right? Or they didn’t know how to write tests. And I thought, “These are things you can learn. These are learnable things, but if you don’t know, then you don’t know.” And so I would take time to do lunch and learns. I recorded a set of videos to help us with our test suite. We went from 0% coverage to like 40% coverage. And I thought, “I love doing this.” First of all, I love recording the videos, was a cool thing. I made all these videos and I shared them. And then people actually started using them and writing tests because in my thought, “This is really cool. I would love to do this like as a business or something too.” I’m sure a ton of developers could learn from this. And I remember how much I struggled with writing tests or learning things like design patterns or like closure, like all these things that come up in interviews and like beyond. It’s easy to not learn. So I thought there’s a business in here somewhere and I was always looking for this. I’ve gone to multiple bootcamps even after getting hired. I’ll continue to go to them even now. I’m looking for more engineering manager-focused programs. So I thought there’s a need here and I’d love to fill it. There’s not enough out there for people post bootcamp. [00:29:35] SY: That is such a good point. It really does feel like once bootcamp is over, you’re more or less on your own. I know that a lot of bootcamps, they do have career coaches. They have an opportunity to kind of get that support afterwards, but sometimes it’s a limited time or maybe even a year after you’ve started your job, you still need some support. So it’s great that you’re able to offer that. I’m curious, what kinds of problems do people have? Beyond learning, figuring out what to learn is always a question, figuring out what shiny tech toy to focus on is a question, but beyond that, what are people struggling with these days that you’ve seen? [00:30:10] BJ: The thing I see, I’ve spoken to over 400 developers in the last year and a half or so. [00:30:16] SY: Oh my goodness! [00:30:17] BJ: I know. I’ve done these like free 15-minute chats. Maybe I’m kind of crazy for doing them, but they’ve been really interesting and insightful. I see people struggling with, one, wanting to make progress overly quickly. You can’t cheat time. And I feel bad for people that, yeah, and I’m like, “I know how much you want to be senior or you want to be mid-level or you even want to just get hired.” But unfortunately, there’s no clear timeline for those goals. I think you should have some timeline, but trying to cheat the process or looking for a hack or like an ultimate shortcut is not going to help. Also, I’m really shocked at the number of people suffering from like severe imposter syndrome is a thing that is more rampant than I expected. I’ve talked to people that work at Amazon, Google, and I’m shocked to hear them say, they feel like they got there by luck or that they don’t know anything. They don’t know enough. I don’t know. I’m like, “Wow! This is wild, how rampant this is in this industry.” And then of course, like the fundamentals, I see a lot of people just need clarity and focus in what they’re learning. They want to learn everything and learning how to distinguish macro trends from micro trends and focus on the big macro trends in the industry and also narrowing focus. They see it as, “I want to be a LinkedIn influencer and I want to make a crazy side project as a side business and I want to get…” You need to limit your focus and double down on one thing and you’re probably going to do a lot better. [00:31:35] SY: That makes a lot of sense. I’m curious what advice you have for people looking for a role today, looking for their first role today, especially in light of all the layoffs that we keep hearing about. It feels like it is a great time to hire, a bad time to try to get hired. It doesn’t feel like a fun time to be a candidate. And so I’m curious what advice you have for folks who are looking for a job now or plan to look soon, especially as we get closer to the end of the year. It only gets harder, the closer we get to the holidays. So what advice do you have? What have you been telling your mentees, your clients? [00:32:14] BJ: I’ve done this for years now and I’ve worked at bootcamps or with people and I’ve just heard so many stories and I try to figure out what is the thing that people do that separates them and makes them the person that got hired versus a person that didn’t. And when I take away all the different factors and I try to like isolate one thing is consistency is the factor. Now of course, you have to have a foundation of technical skill. But the one thing I see between, I see, “Wow, this person’s really smart. They’re not getting hired.” This person doesn’t know so much. They’ve got… Why? I’ve seen it happen so often. And I think, “What is the difference?” And most of the time it is not only technical skill, but it’s how much can you take rejection. Now, that being said, I do think that some of the low-hanging fruit I see is people painting themselves as a junior developer, playing up the fact that they want to like be a charity case where I say I’m willing to learn a lot or I’m a career switcher. And I think that right now people are less willing to take a chance. They don’t need to take a chance. And so they’re looking for people that say, “Hey, I’m painting myself as… hey, I’m a software developer. Here’s what I can contribute. Here’s what I do.” I think that simple reframing of who you are and what you do is a big switch most people need to make right now instead of coming from the angle of like, “Hey, I’m a junior developer, learning how to code. Hire me.” [00:33:34] SY: Absolutely. There’s the mantra of is who you know, not what you know that matters. And we emphasize networking so much, especially in recent years. I feel like I’ve seen networking be just shouted to the rooftops in terms of strategies, finding that warm lead, reaching out on LinkedIn, making a connection, getting in people’s DMs. And I’m wondering, in light of everyone doing that, in light of everyone trying to play the networking card, in your opinion, how effective is that card and is there a way to still use it and still stand out when it feels like everyone is emailing the hiring manager? [00:34:11] BJ: My hot take, I hired earlier this year. [00:34:14] SY: for DevRel? [00:34:14] BJ: Yes, two, hired two junior developers. Excellent candidates. And most people actually I’d say are networking wrong, like 99%, because my LinkedIn is filled with people who I’ve never met that say, “Hey, I need a job. Look at my resume.” That is the quickest way for me to block you. Or I wouldn’t block you. Quickest way for me to be, “I’m just not going to respond. I don’t know you.” [00:34:36] SY: Yeah. [00:34:36] BJ: I do free calls and I’m more than happy to get on the phone and have a conversation with somebody. And that’s a fun thing to do. I enjoy it. But somebody just saying, I don’t know, “Give me a job.” That’s crazy. I’m like, “Is this really a way you think is going to work for you?” So that’s one. I’d say that also it just in my anecdotal experience, I’ve seen probably more people still get hired through mass supplying than referrals, but I’ve also seen a lot of people get hired through referrals and networking. So I think either way can work. I do think that the best way to network is, of course, be genuine. I’ve learned finally how to network on LinkedIn, and what it was, was literally me just commenting genuinely on people’s posts, who I found interesting. That was kind of it. And then it would lead to a DM naturally. I’d be like, “Oh! Hey, I noticed you do kind of the same thing. It’s really cool. How are you doing that?” Like, “How are you doing your side business in tech?” Or, “Hey, I see you help junior developers. What are some things you’ve noticed?” “Hey, I found a book I read that I think you might get a kick out of.” Offering something first, these are the ways I’ve talked to, I don’t know, more than a thousand people in the last year, 400 on the phone, right? And out of all the people I’ve talked to, I can count on one hand the number who have like sent me an article, offered me anything. I think these are really good ways to build trust and also just kind of like get that goodwill. It’s like, “Hey, here’s an article.” One young woman, she sent me like a thing about TikTok and it was such a weird thing. I’m like, “Oh, what a smart, nice thing to do.” I’m trying to try my hand out at TikTok. And she’s like, “Here, I found this article for you.” Now when it came time for me to do interviews, she was already hired at this point, I would have totally reached out to her. [00:36:08] SY: Right. Absolutely. Absolutely. Well, I think your story is absolutely inspiring. It is I feel like the ultimate turn your life around change direction, a story and saying that you’re so successful, you’re turning around you’re helping people with your coaching business is absolutely beautiful and inspiring. Thank you so much for sharing your story with me. I’m curious to hear, when you look back on your journey and you look at where you came from being that 12, 13-year old and finding that wrong crowd, doing those things that you really shouldn’t have been doing and kind of going for the next decade of your life, what would you say to yourself back then knowing where you are today? [00:36:49] BJ: I think about that a lot with my kids because I pray they don’t go down that same path. I’m seeing they’re not, luckily. One son is 17, another one that’s 10. When I think about why I did that, I think I was missing a lot of self-confidence and I wish I had built my self-confidence in a different way. I think I found it in drugs and alcohol and fake confidence. And the one thing I wish I could tell myself back then or my sons or any young man or young woman or person that’s listening is find your confidence in a positive way. Don’t go for the easy fix. And I’ll be honest, I think, here’s a weird one, working out was actually one of the biggest unlocks for me that I wish I had started early. If I could go back in time at ’13, I’d say, “Go to the gym. Stay in there and find your confidence doing something where you’re lifting weights or something active.” I think that, for me, at that age would have been a lifesaver. [00:37:48] SY: Interesting. Very interesting. The gym, how did you get to that? How did you figure that out? [00:37:53] BJ: I guess I never felt that confident as a kid. I got into fights, I get robbed. I get bullied. Then I started fighting and stuff. I’d been a little traumatized. I’d gone through some pretty rough times as a child as well, like violent crime, things like that. And I think that always made me scared of the world. And so I’ve walked through the world scared like, “Oh, what’s going to happen? I’m going to stores. This guy’s going to rob me. Is this person looking to be funny? Should I be afraid?” And I think alcohol gave me an outlet to be really confident. And when I went to the gym, I noticed some of the same feelings I got from alcohol or drug use, people call it runner’s high or whatever you want to call it. There was that feeling of endorphins and also that feeling of like the long-term benefit of going to the gym. You can go to the gym and you’re not going to see any result for a day or a month or even six months. You go for a year, you’ll see a difference. It taught me long-term kind of vision, thinking like, “I’m going to go here with the faith that this will make me feel better,” and just the actual physical feeling of feeling better when I walked out. So that was one of the weirdest things. I didn’t realize this till I stopped drinking. I started running and I was like, “Whoa! This is what I should have been doing my whole life.” [00:38:56] SY: You figured it out eventually. That’s all that matters. [00:38:58] BJ: Yeah. Yeah. [00:39:00] SY: So we talked a lot about how you were doing things that you weren’t supposed to do and you change your life for the better. But I am curious if there’s anything about your past that was a positive influence, is there anything that you learned or that you took from your times getting into trouble that actually has served you well in your current career? [00:39:22] BJ: I think a lot of it was respect. I dealt with a lot of people. I mean, if you saw me back then, or some of the people I associated with, you’d be shocked. But I think it also taught me to not discount other people because I felt bad when I was discounted. The sting that I felt when people would look at me and think or even when I was rejected for that job and then first thought, “Oh, you sound too street,” was the word and I think back then I think I never want to treat somebody like that. My whole thing is I don’t care who you are, what your title is, treat others with respect. That was a big one I learned from I think just generally that environment that I was in. [00:40:08] SY: Now at the end of every episode, we ask our guests to fill in the blanks of some very important questions. Brian, are you ready to fill in the blanks? [00:40:15] BJ: Let’s do it. [00:40:17] SY: Number one, worst advice I’ve ever received is? [00:40:21] BJ: If you just work hard, you’re going to succeed. [00:40:25] SY: Oh, interesting. Tell me more. [00:40:29] BJ: I know. I know. So sad. I used to think this. I think if you grow up, you have your parents say, “Just keep working hard. People will notice.” Kind of. [00:40:37] SY: It helps. [00:40:38] BJ: That helps. Being your own advocate is really what helped me out to get, I think, from junior to mid, to senior, to engineering manager. And now on to like, even on here, I mean, the reason I’m on here is also because I advocate for myself on LinkedIn and other places. If you can’t advocate for yourself, you’re going to have a very hard time or you’re going to meet the mercy of others above you to reward you when they feel like it. And if your goal is career trajectory, I think you’re going to have to figure out what’s high leverage, what’s high visibility, and play a little bit of politics in order to get ahead. [00:41:10] SY: Very true. Number two, best advice I’ve ever received is? [00:41:14] BJ: Chances make champions. [00:41:17] SY: Oh, interesting. I don’t think I’ve heard that one before. Tell me about that. [00:41:21] BJ: I think I heard it from some dude in my past. But it’s true. I think a lot of my life has been around high risk, high reward. Every time I did something, people thought, “That’s crazy,” like learning how to code at like 30 after being a complete wreck. People are like, “Wait, what? You? There’s no way.” I took a chance. I spent $2,000. That was the only $2,000 I had. I had zero money. That was all I had and I bet it all on the table for that career. Best $2, 000 ever spent. Again, I left a job where I was stable for a five-person startup. The most I ever learned there was incredibly stressful, but every time I look back at what I did, I did these high-risk activities, they were planned. It wasn’t just like, “Oh, I’m going to spin the wheel and see what happens.” I knew that, like, “Okay, you’re going to have to take some chances,” if I wanted to get where I wanted to be. And that’s really helped me out, I think, over the years. [00:42:10] SY: Absolutely. Number three, my first coding project was about? [00:42:14] BJ: It was a crime map about San Francisco. [00:42:17] SY: Okay. [00:42:18] BJ: It was, I think, open data, at the time had this government API where you could get crime statistics, and I use it with Google Maps to show a series of markers in the Mission District where violent crime had happened. It’s still on CodePen. If you can find it, it’s broken, but it’s on CodePen. [00:42:35] SY: It’s broken, but it’s there. [00:42:37] BJ: It’s there. It’s still there. [00:42:38] SY: I like that. Number four, one thing I wish I knew when I first started to code is? [00:42:43] BJ: That it’s just one tool in the developer belt. [00:42:48] SY: Such a good point. [00:42:49] BJ: Yeah. I thought it was the only thing. Communication, hugely important. And I think the more senior you get, the more these “soft skills”, which are actually hard skills, become important as you grow. [00:43:01] SY: Absolutely. Well, thank you again so much for joining us, Brian, and sharing your absolutely incredible inspiring story with us. Congrats on all of your success and thank you for your time. [00:43:09] BJ: Thank you so much. [00:43:13] SY: You can reach out to us on Twitter at CodeNewbies or send me an email, hello@codenewbie.org. For more info on the podcast, check out www.codenewbie.org/podcast. Thanks for listening. See you next week. [END]",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \u003cp\u003e[00:00:05] SY: Welcome to the CodeNewbie Podcast where we talk to people on their coding journey in hopes of helping you on yours. I’m your host, Saron, and today we’re talking about how to be a leader with Brian Jenney, Senior Engineering Manager at The Clorox Company and owner of JS Code Coach.\u003c/p\u003e\u003cp\u003e [00:00:19] BJ: I took a chance. I spent the only $2,000 I had and I bet it all on the table for that career, best $2,000 I ever spent. I left a job where I was stable for a five-person startup. I knew that, like, “Okay, you’re going to have to take some chances if I wanted to get where I wanted to be.” And that’s really helped me out, I think, over the years.\u003c/p\u003e\u003cp\u003e [00:00:36] SY: Brian opens up about his struggles with addiction, how he turned a new leaf with coding and sobriety, and the ways he still benefits from his hustler mentality even to this day after this.\u003c/p\u003e\u003cp\u003e [MUSIC BREAK]\u003c/p\u003e\u003cp\u003e [00:00:53] SY: Thank you so much for being here.\u003c/p\u003e\u003cp\u003e [00:00:54] BJ: Thanks for having me. Really excited to speak with you.\u003c/p\u003e\u003cp\u003e [00:00:56] SY: So let’s start all the way at the beginning. What was life like for you growing up? Was tech a big part of your childhood?\u003c/p\u003e\u003cp\u003e [00:01:04] BJ: Absolutely not.\u003c/p\u003e\u003cp\u003e [00:01:06] SY: Okay.\u003c/p\u003e\u003cp\u003e [00:01:08] BJ: Not in the least bit. I didn’t grow up using computers, and I didn’t start writing code till about the age of 30 after making a pretty major life transition that maybe we’ll discuss. But yeah, didn’t grow up with computers or anything like that at all.\u003c/p\u003e\u003cp\u003e [00:01:25] SY: What was your environment like growing up? What were you into at that point?\u003c/p\u003e\u003cp\u003e [00:01:28] BJ: You know, I had an interesting life in childhood, I guess. I grew up in Oakland, California, was a pretty good kid for most of my life, but I got involved in the wrong stuff early on, around 12 or 13, I kind of, you know, fell a little bit into street type of activity, dabbled in a little bit of crime and doing drugs and things like that. And I still went to college. But afterwards, I still had this bad streak and addictions that I picked up. And I just kind of went off the rails like throughout my 20s. It was a really wild period. I just fell all the way off. I ended up getting really caught up in addiction and finally having an intervention like almost like you see on these TV shows. My mother came and read me an ultimatum. I just had a child. I wasn’t doing the right things. And then I got sober at that point and I found I had a lot of time on my hands. And I thought, “What do people do with all this time?” I was also driving Lyft at the time and Uber in the City of San Francisco. And I would meet people. I’m like, “Oh, what do you do?” Software engineer, software engineer, software engineer. I was like, “Oh, okay, cool. You know, what does that really mean?” I got a real job at this point in a community college. One of my jobs is updating like a website content management type site, like a WordPress type site. And one day I had to call in a woman that was the webmaster and she wrote some HTML or something code in there. I thought, “I got to know this. Everybody’s talking about this thing. She just wrote some code in front of me. This is nuts. This is how the internet works.” I forget who told me exactly about Codecademy. I went in there and just my addictive mindset was immediately triggered by the joy and the dopamine rush from figuring out coding problems. And that’s when I got introduced to coding.\u003c/p\u003e\u003cp\u003e [00:03:19] SY: Wow! What an adventure. Oh my goodness! Okay, so let’s take it back. Let’s break this down a little bit more. So you were 12, 13, getting involved in the wrong crowds. If you don’t mind, tell me a little bit more about that. Were you into anything relating to the technology or video games at all or just a totally different world for you? Not even video games, totally different world.\u003c/p\u003e\u003cp\u003e [00:03:42] BJ: Whole different world.\u003c/p\u003e\u003cp\u003e [00:03:44] SY: Whole different world.\u003c/p\u003e\u003cp\u003e [00:03:44] BJ: I didn’t grow up with a computer at that point. My parents are getting a divorce. I actually lived with my grandmother for a year between middle school and high school. She’s an old woman. And I didn’t have a computer even when I went to college. I borrowed a laptop or I went to the library to write everything. And I was one of the only people I think that didn’t have a computer at the school. It just was never on my mind. In fact, I just never saw the value in learning anything about computers. I just thought, “What do you use it for? Going to the internet?” [00:04:14] SY: “What’s the internet for? What’s that all about?” Yeah.\u003c/p\u003e\u003cp\u003e [00:04:15] BJ: Yeah, just totally didn’t compute to me. I’m like, “I don’t care about that stuff.” I didn’t even know what I didn’t know. The first time I saw that woman write code, I was like, “Wait, how did you know that? How did you understand that that was…?” And I think I’m further behind most people my age in that regard. So I really was a late bloomer.\u003c/p\u003e\u003cp\u003e [00:04:34] SY: Did you have any aspirations of what you wanted to be? I mean, you went to college, so clearly you were somewhat thinking about the future and kind of planning for your future. What careers did you consider? What did you study?\u003c/p\u003e\u003cp\u003e [00:04:46] BJ: You know, I always liked English and writing, and I thought that maybe I could make a living writing. And that’s probably also what drew me to write a lot on LinkedIn currently or write articles. I’ve always enjoyed writing, even in my, like, darkest days. One thing that was kind of consistent was that I would write. I wouldn’t read much, but I’ve ramped up my reading since then a lot more. So yeah, I thought maybe I can make a career out of that. Something like kind of more artsy or maybe teaching even. I thought maybe I’ll teach people, maybe I’ll do something with writing and get paid to write and didn’t pan out.\u003c/p\u003e\u003cp\u003e [00:05:16] SY: Usually you hear of kids having a rough time in high school, middle school, maybe falling in with some bad friends and then college. They’re an adult now. So they grew up a little bit. But it sounds like after college was when things kind of went down the wrong path for you. What do you think triggered that?\u003c/p\u003e\u003cp\u003e [00:05:31] BJ: As a child, I felt like I always had that hustler mentality. At a young age, I was doing car washes in my neighborhood for money with my friends. I was selling mixtapes at school, in elementary. In high school, I learned how to paint houses and hung up signs to paint houses. I always was thrilled by the idea of, one, being kind of my own boss, two, making money, and the lure of fast money got me into a different life than I ever imagined. I saw a friend say, “Here’s how I’m doing this thing.” And I said, “Hey, I want to do that.” And there’s nothing quite like the thrill to me of making very fast money at that age. And when I saw it, I was hooked. I was like, “I want to do this.” And why would I waste time doing anything else? Terrible decision. One of the worst decisions I ever made in my life.\u003c/p\u003e\u003cp\u003e [00:06:18] SY: What made you realize it was a bad decision?\u003c/p\u003e\u003cp\u003e [00:06:23] BJ: It was so many things. I’m thinking now in retrospect. I think I knew when I was spending money to support my addictions faster than I could even make it. I mean, I was making what I considered a lot at that age, I was between 22 and like let’s say 27 doing this. And then I’d also, I mean, the reality is there’s robberies, the constant threat of arrest, the kind of people that you deal with that are cutthroat and want nothing more than to use you and that you can’t trust. Eventually, you play a character, like I wasn’t some hardcore guy, but I had to play a character essentially to fit in. And eventually, you start realizing that you’re not playing a character anymore that this is really who you’ve become. And that was a scary realization, because I remember I was on the phone trying to get a “real job”, and I’ll never forget this. My friend said the feedback from the woman was that she said, “Well, he sounds too street.” And I thought, “Wow! I can’t believe I’ve like gone so far in the opposite direction that I don’t even know who I am anymore.” And that was scary to me.\u003c/p\u003e\u003cp\u003e [00:07:22] SY: Wow! Wow! I know that for some people it’s becoming a parent that changes them, that kind of helps them focus, prioritize, change the course of their life, but it sounds like even once you had kids you still continued this life. What effect did being a parent have on you?\u003c/p\u003e\u003cp\u003e [00:07:40] BJ: It didn’t have quite the effect it should have, to be completely honest. That was interesting. I think a lot of people said, “Oh, it must have changed when you had a kid.” It did not. I didn’t change anything. I was barely present for the first year of my son’s life. I was just out all the time, hustling out throughout all hours of the night, sleeping during the day. I was awful. It was one of the most embarrassing moments probably of my life, which led to that intervention. That was really the catalyst. I know people use this cliché, I was either going to end up dead or in prison, but it was apparent. I mean, it was so obvious to me. I saw people going to prison around me. I saw people losing their life, getting killed, or killing themselves, and I could feel it. I’m like, “The end is coming near.” [00:08:20] SY: Tell me about that intervention. You mentioned that your mom initiated it. What did that look like? How did that go down?\u003c/p\u003e\u003cp\u003e [00:08:28] BJ: It was Easter Sunday. I had been out all night. I was at a friend. We crashed a car.\u003c/p\u003e\u003cp\u003e [00:08:33] SY: Whoa!\u003c/p\u003e\u003cp\u003e [00:08:33] BJ: Yeah, and then I was walking back at 6 a. m. Still drinking. I walked into the house and then I basically passed out on the bed around 7 a. m. It was Easter Sunday. I hear a knock at the door later waking me up and my partner, she said, “Hey, your mom’s here.” And she came in. She had a letter, just like in the show. She took me out and she read me this letter saying how disappointed she was and how I didn’t deserve my kids and how I basically was going to lose everything. And then even she was in agreement that I was not fit to be in their lives and it hurt. I was mad. I was angry. I thought everybody’s against me and everybody’s ganging up on me. I was like, “Oh, poor me.” You know, typical kind of selfish outlook on it. And I made a promise though that day. I said, “I’m going to stop.” And I thought I have no clue how I’m going to stop. And I just said, it sounds kind of corny now, but I thought, “I just need to get to one more day. I’ll just quit today and then I’ll see what happens tomorrow.” I kept that going, and I just quit cold turkey.\u003c/p\u003e\u003cp\u003e [00:09:31] SY: Wow!\u003c/p\u003e\u003cp\u003e [00:09:31] BJ: And I haven’t. That was ten years ago. It feels like a whole other lifetime ago, which is why I feel more comfortable speaking about it now. But since then I haven’t taken a drink or done any kind of terrible drugs. So it worked.\u003c/p\u003e\u003cp\u003e [00:09:44] SY: Was that the first time your mother had pulled you aside and tried to intervene?\u003c/p\u003e\u003cp\u003e [00:09:48] BJ: Yes. No one had a clue how bad I had gotten except for people that were close to me. I was what you consider pretty functional. I barely slept. I did have a job. At this point, I was already transitioning a bit out of the street life. So I had a job, but I was still like one foot in, one foot out. I was hustling on the side. I was working a nine-to-five and I was just drinking like an animal, like nonstop. And yeah, it was hard to see, but people could see. I was starting to show signs. I couldn’t hide even at work. It was obvious that I was not all the way there. I was a mess. Yeah.\u003c/p\u003e\u003cp\u003e [00:10:23] SY: When you stopped and quit cold turkey, what do you think it was that kept you going on a day-to-day basis? Because it’s almost like every day you had a new decision to make, right? Is this the day that I go back or is this the day that I stay clean? What do you think it was that made you continue to make the right decision every single day?\u003c/p\u003e\u003cp\u003e [00:10:44] BJ: I’ll be completely honest with you, it’s still a decision. Every once in a while, I’ll have that terrible feeling like, “Oh, you could probably drink one day now. You could probably take a couple drinks.” It’s really hard to fight that. Some days it happens way less often than it ever has, but what kept me going, I think, was one part of it was a bit of like to show people like, I think I use that as a motivation, I think a lot of people say, “Oh, yeah, right?” I tell my friends like, “Oh, so when are you going to stop this thing?” And I said, “What do you mean?” I said, “Oh, well, you’re not really going to do this. Right?” And I thought, “Geez! This is what people think of me?” And I’m stubborn. I’m a pretty stubborn person. I saw the benefits. I’m like, “Man, I feel I’m more energized. I’m not feeling guilty.” I had incredible anxiety attacks for years, like non-stop. I came to think it was normal and they’ll stop too. So I’m like thinking my life has improved significantly within this first couple. And then when I picked up coding, something I never would have imagined, I was like that was the sign to me like, “Okay, there’s no way I’m going back drinking because like on one side is like death, anxiety, depression.” [00:11:47] SY: Lots of fun stuff. Yeah.\u003c/p\u003e\u003cp\u003e [00:11:48] BJ: Yeah. Right. And on this side is like me feeling great. I’m getting up. I’m feeling like I got tons of time. I enjoy movies now. I’m writing code. I feel proud about myself. So the feeling of pride is what kept me going. I thought I need more of this. Like, “How far can I go?” [00:12:03] SY: That makes a lot of sense. Yeah. Tell me about how your relationships with the people around you change. Because I imagine it’s not just what you do. It’s who you do it with, who you spend your time with. It’s your son, your partner, your mother. I assume so much about your life had to have changed with that decision that you were making every day. What did that look like?\u003c/p\u003e\u003cp\u003e [00:12:25] BJ: You know, one of the saddest things people talk the least about getting sober is that yeah, it’s kind of lonely, like I had a large circle of friends at this time. And I don’t talk to any of them anymore, barely any of them. I have very few friends that have kept from that time. And I’m thankful for the ones that have supported me and maintain their friendship with me. But the majority of them didn’t. My relationships though, the ones I did maintain, the quality improved tremendously. Also, I found like now I’ve made friends like through LinkedIn. I’ve made other people that either share a similar past or that kind of can help me currently where I am. So it’s been great meeting new people and making better friends, doing more positive things.\u003c/p\u003e\u003cp\u003e [MUSIC BREAK]\u003c/p\u003e\u003cp\u003e [00:13:22] SY: So let’s talk about ride share because that was kind of the first time you heard whispers of coding and what that world was about. How did you end up doing ride share? How’d you end up working for Lyft?\u003c/p\u003e\u003cp\u003e [00:13:33] BJ: This was like back in the wild, wild west days of Lyft and Uber, and it fit into my story, kind of the whole hustler mentality, like I’ve kind of kept that mentality even now. And I was always looking like, “What can I do for more money?” I wasn’t doing illegal stuff. So I thought, “Well, I need some other thing to do.” And I was like, “I’ll do this.” I also had a new child. So kind of led me to be like, “Well, I need some more money.” And I would like after work, I would just do Lyft and Uber. Then when I started writing code and meeting software engineers, then it got even more interesting to me. It’s like, “Oh, this is kind of cool too. Now I’m like meeting.” [00:14:06] SY: You’re networking.\u003c/p\u003e\u003cp\u003e [00:14:06] BJ: Yeah, right? I was like networking in the cars and understand, “Oh, so what do you do? Oh, how do you do that? What language do you use? Oh, how’d you learn? How would you get a job? How would I get a job?” You know, asking these people. So it was really cool. I got exposed to a lot of software engineers just doing Lyft and Uber. Yeah.\u003c/p\u003e\u003cp\u003e [00:14:21] SY: And what did you learn? What did you pick up in those car rides?\u003c/p\u003e\u003cp\u003e [00:14:25] BJ: Mostly that people were much nicer than I ever anticipated. That was the biggest one. I kind of thought people would write me off like, “Oh, you? Yeah, right.” You know, like, “Oh, what are you doing?” You’re like, “Oh, you’re an Uber driver, but you’re also a software engineer.” Like, “How does that work out?” And they were super friendly. I was shocked how people were so friendly. I think one guy wrote me like a detailed email about what I should study.\u003c/p\u003e\u003cp\u003e [00:14:48] SY: Wow!\u003c/p\u003e\u003cp\u003e [00:14:49] BJ: Yeah. People would like tell me where to go, like, “Oh, you should try this meetup,” Or, “Oh, have you heard about this event here or something?” I’m like, “Oh, I never thought about that.” So people were just incredibly gracious and nice, like beyond belief, like in retrospect, it’s pretty wild how nice people were.\u003c/p\u003e\u003cp\u003e [00:15:05] SY: So what was the trigger that led you to actually look up your first coding resource? Was it those conversations or was it the webmaster that you mentioned?\u003c/p\u003e\u003cp\u003e [00:15:13] BJ: I believe it was her that sparked my immediate interest. Like, “Okay, I have to know how she’s doing this.” And I believe it was somebody in Lyft or one of my rides that said, “You should try this site called Codecademy.com.” And that’s when I went on there and I was like, “Oh, this is like a free site. You can learn. This is crazy.” And then I just was like addicted. And I mean, that was kind of part of my superpower, this not so healthy addiction that I have, but it also really helped in the coding aspect where I could spend hours doing it and just be hooked.\u003c/p\u003e\u003cp\u003e [00:15:46] SY: What was the first thing that you learned? Do you remember?\u003c/p\u003e\u003cp\u003e [00:15:48] BJ: HTML and CSS. So you have to start.\u003c/p\u003e\u003cp\u003e [00:15:52] SY: And how did it feel to go through those courses and go through those lessons? What was that like for you?\u003c/p\u003e\u003cp\u003e [00:15:57] BJ: It was frustrating for sure. HTML and CSS were fairly straightforward. And then I added Bootstrap and I’m like, “Wait, what’s going on?” [00:16:05] SY: “What’s happening?” Yeah.\u003c/p\u003e\u003cp\u003e [00:16:06] BJ: And then the other thing was, here’s the weird thing. I was like, “Okay, cool. This works in this IDE.” I didn’t even know it was called an IDE at the time. I was like, “Okay, this works in this site. I’m writing code and I see it, but how do real developers do that?” I didn’t understand. Like, “Wait, do you have to have…?” This is before VS Code. I didn’t know, right? And there was no real YouTube videos on this stuff either. So I went to a meetup and then somebody said, “Here’s how you do it in a text editor.” And they showed me Sublime, but doing those modules, I remember it was really fun. At the same time, as soon as I got to like JavaScript and Bootstrap, that’s when things became really difficult. And I thought, “I don’t think I can do this.” [00:16:46] SY: What did you do with that feeling?\u003c/p\u003e\u003cp\u003e [00:16:47] BJ: I honestly thought, “You know what? I’ll just stick to what I know. I like HTML and CSS. I bet you I can get a job just doing that.” And I was like, “I’m going to go all in on HTML and CSS and I’ll just be a front-end developer, maybe an email developer.” I didn’t really care at the time. I didn’t even know what was out there really. So I said, “I need to know just enough JavaScript or jQuery,” at the time to be dangerous in order to like do some basic stuff on a site. But beyond that, I don’t want to be a JavaScript developer. Last thing I want.\u003c/p\u003e\u003cp\u003e [00:17:15] SY: And did that work? Were you able to get that?\u003c/p\u003e\u003cp\u003e [00:17:17] BJ: Oh, not at all.\u003c/p\u003e\u003cp\u003e [00:17:20] SY: Okay.\u003c/p\u003e\u003cp\u003e [00:17:21] BJ: Not one bit.\u003c/p\u003e\u003cp\u003e [00:17:22] SY: Tell me, how did you figure out that that wasn’t going to work? What happened?\u003c/p\u003e\u003cp\u003e [00:17:25] BJ: Oh, as soon as I started going for job interviews. I would go to these job interviews and then people were like, “I want to hire you as a NodeJS developer.” I’m like, “Wait, what is that?” [00:17:33] SY: “What is that?”\u003c/p\u003e\u003cp\u003e [00:17:34] BJ: “What is that?” And then I’m like, “Okay, I got to learn this stuff.” So then I picked up a big book and I read the book and I’m like, “This book is going to teach me JavaScript.” And I read the whole book and I was like, “Okay, I still don’t know anything now.” [00:17:44] SY: Oh, no!\u003c/p\u003e\u003cp\u003e [00:17:46] BJ: I sat down, like, tried some code. I’m like, “Oh, no, I know nothing.” Then I reached out to Facebook. I don’t even use Facebook, but I said, “Hey, who can help me become a software engineer?” A buddy that I hadn’t spoken to in 10 years who I was kind of an acquaintance with in high school, reached out and say, “Hey, I can help you.” He started teaching me stuff and like got me on some gigs and then I learned a lot through him, some practical ways of learning JavaScript. I was way too much into the conceptual stuff, like reading books about like, “Here’s the odd parts of JavaScript,” and like that… [00:18:15] SY: That’s not helpful.\u003c/p\u003e\u003cp\u003e [00:18:17] BJ: Super helpful. And then my first job was like a full stack C# developer using AngularJS. I’m like, “Well, now here we go,” trial by fire. So here I am writing C# and having to learn that on the job.\u003c/p\u003e\u003cp\u003e [00:18:27] SY: Wow! Wait. Did you know C#?\u003c/p\u003e\u003cp\u003e [00:18:29] BJ: Not at all.\u003c/p\u003e\u003cp\u003e [00:18:30] SY: Oh boy. Okay. And did you know Angular?\u003c/p\u003e\u003cp\u003e [00:18:33] BJ: No.\u003c/p\u003e\u003cp\u003e [00:18:34] SY: Okay. So how did you get that job? How did you manage that?\u003c/p\u003e\u003cp\u003e [00:18:37] BJ: The company I came in when they were barely… they were using something like FileMaker, which is archaic now, to, like, compose these apps. And you had to write small amounts of JavaScript and SQL queries. And I thought, “Cool, I can do that.” And they hired me, even though I could barely do that, but they needed somebody that knew HTML and CSS as well. And I did, they had back-end developer, but he just didn’t do CSS. He didn’t really know like basic front-end stuff. So then they said, “We’re going to make a switch as an organization and use AngularJS, C#, .NET and SQL.” I’m like, “Okay.” And then I just basically through lots of trial and error and through very, very kind teammates, I learned enough throughout the two years I was there on the job to be pretty good.\u003c/p\u003e\u003cp\u003e [00:19:18] SY: Wow! Okay, so really it was the company hired you for one thing, then they switched and you kind of had to keep up?\u003c/p\u003e\u003cp\u003e [00:19:23] BJ: Oh, yeah.\u003c/p\u003e\u003cp\u003e [00:19:24] SY: What was getting that first job like for you? Tell me about the interview process, how long it took. What was that like?\u003c/p\u003e\u003cp\u003e [00:19:30] BJ: So at this point, I joined a bootcamp, even though I already knew a lot of stuff. I had written websites and I had done some freelance work, but I joined a bootcamp for like 2,000 bucks that I thought was going to help me learn more JavaScript. And what they really helped me with was my confidence because I didn’t feel like I was ready to apply for jobs. And they said, “Dude, you should be applying.” And so like four weeks or six weeks into the bootcamp, the owner like sat me down and said, “You’re going to start applying.” Like, “I’m going to force you to sit here and apply.” And I did. And I just did a ton of applications. He helped me with my resume. And this was also in the Wild West days. Things were, I’ll be honest, they were just easier than they are now.\u003c/p\u003e\u003cp\u003e [00:20:03] SY: Yeah. That’s true.\u003c/p\u003e\u003cp\u003e [00:20:03] BJ: So I was able to get interviews kind of shockingly with very little knowledge. And I must’ve done a dozen interviews where I failed all of them. And I finally got to one, they did a phone screen. It was a basic JavaScript question. I remember it was about how to manipulate a string to be formatted like a phone number. I’ll never forget that question. I somehow got it and I was shocked even at myself. I was like, “Oh, I can’t believe it. The JavaScript stuff is finally paying off.” And then it was an onsite, your typical onsite, meet the team, another small technical challenge using basic HTML and CSS and JavaScript, very little JavaScript. And then finally, an “output whiteboard”. You can’t see my fingers, but I’m doing quote signs. There’s a whiteboard challenge, which is essentially explaining how does like the interaction between a client and an API work. And I basically drew a picture like of me and a jQuery like code that would hit an API and an API returns from JSON and then I display it on the screen. And that was the extent of my interview.\u003c/p\u003e\u003cp\u003e [00:21:01] SY: Very cool. Okay. So how long did it take to get that first job? How much time had passed?\u003c/p\u003e\u003cp\u003e [00:21:07] BJ: Two months or less.\u003c/p\u003e\u003cp\u003e [00:21:08] SY: Two months. Wow, that’s amazing. Especially in the market today, that’s record. That’s record time.\u003c/p\u003e\u003cp\u003e [00:21:13] BJ: I’ll say this. I totally know that there was luck involved. There was a guy that I worked with as well. He was a CS degree, well-spoken, very intelligent, was crushing it on all the assignments we did, just very smart. It took him a full year to get a job.\u003c/p\u003e\u003cp\u003e [00:21:27] SY: Wow!\u003c/p\u003e\u003cp\u003e [00:21:28] BJ: Me on the other hand, I got like bumbled my way into a job.\u003c/p\u003e\u003cp\u003e [00:21:34] SY: What do you think it was that made you successful beyond luck? Was there anything that you feel like play to your strengths you know about or is there anything that you feel kind of made you stand out as a candidate?\u003c/p\u003e\u003cp\u003e [00:21:46] BJ: I think part of it was I had been through a lot in life at that time. Like I had been through some pretty crazy events. And I thought this, in comparison, I’m not trying to minimize it. It was still stressful, but I didn’t have that same fear I think a lot of people did of getting rejected. My lack of fear of rejection was helpful because I was like, “I’m going to go for a job. I know I have no business going to, but if I don’t get it, I’m not expecting to get it. I’m going to learn something in this interview.” And I would go to places and I always asked, “How could I have gotten hired? What would you suggest I do more of?” And these people would be open to talk to me. Plus, I came from a lifestyle where I was selling people all the time. And I was selling to dangerous people. So I knew how to talk to people to make them feel at ease, I think, make them feel comfortable. I knew how to establish rapport with people quickly, and these were all in person interviews because this is way pre pandemic 2013 or ’12 or whatever. So I was meeting people in person and shaking hands and rubbing elbows and stuff like that, making friends.\u003c/p\u003e\u003cp\u003e [00:22:43] SY: So how long did that first job last?\u003c/p\u003e\u003cp\u003e [00:22:45] BJ: Two years. And I loved it. I could have left earlier, but eventually I left because I thought, “I got to leave here because we’re using outdated technology.” And I knew that like part of my growth required for me to leave. And I was also working at a bootcamp on the side. Again, goes back to my having this hustler mentality.\u003c/p\u003e\u003cp\u003e [00:23:01] SY: Got to hustle, yeah.\u003c/p\u003e\u003cp\u003e [00:23:03] BJ: So I was working at this bootcamp on the side after work. And I was like, “Cool, I can learn more here and they’re paying me to learn.” Oh yeah. No brainer. So I’m here learning and then I’d meet the other developers. They’re like, “Oh, what are you working on?” And I’m like, “Oh, well, you guys are making that much?” Like, “You can make that much being a developer?” I had no clue. I was making peanuts at this time, and I was still super happy. I was like, “I’m happy. I’m having a great job. I feel proud about what I do.” And I’m like, “Wait, you’re making that much?” And I’m like, “Okay, I need to go explore.” [00:23:29] SY: Do you mind sharing numbers? What were you making? What did you hear?\u003c/p\u003e\u003cp\u003e [00:23:31] BJ: I like to share numbers because when those guys did it, it really helped me understand what was possible. I was like, “Oh!” I was making 60, 000 at the time. This is in the San Francisco Bay Area.\u003c/p\u003e\u003cp\u003e [00:23:40] SY: Right. Yeah.\u003c/p\u003e\u003cp\u003e [00:23:42] BJ: I had two kids and a mortgage. I was still making things work. I was working in a bootcamp on the side too. And then the next job, I made a jump, I made 120, 000.\u003c/p\u003e\u003cp\u003e [00:23:51] SY: Hey! There we go. Now we’re talking.\u003c/p\u003e\u003cp\u003e [00:23:54] BJ: I was like, “Whoa!” Honestly, I had an anxiety attack. It was so weird. Everybody thought, “Oh, I can’t believe you made it.” I’m like, “Yeah, but what are they going to expect?” [00:24:03] SY: Yeah, absolutely. Big jump. Big jump. Good for you. And good for you for finding that information out because too often we just don’t know and we can’t advocate for ourselves. We can’t negotiate if we don’t know, what it could be, what it’s supposed to be. So that’s great.\u003c/p\u003e\u003cp\u003e [00:24:16] BJ: Exactly. And then I kept making these jumps and that was really helpful having a few people that were open to tell me that.\u003c/p\u003e\u003cp\u003e [00:24:21] SY: So you transitioned from being a developer to an engineering manager. You’re now a senior engineering manager. What was that transition like going from dev to the management track?\u003c/p\u003e\u003cp\u003e [00:24:31] BJ: I’m still in the beginning of it. I feel like a junior engineering manager, I had the senior engineering manager by title and I made the transition about two years ago. That was difficult. I worked at a few companies. I’ve done a number of contract jobs. And at this company, I came in at Clorox where I currently am. I came in and I kind of naturally began influencing the technical decisions. I was helping things with project management. There was a large amount of junior developers at the time when I first came on, and I really enjoyed helping them and accelerating their JavaScript knowledge specifically and kind of helping them understand, “Okay, here’s how we can do things better. Here’s better processes.” When the manager conversation came up, I thought, “Yeah, I’ll do it.” And that transition has been tough because now a lot more of my time is spent figuring out processes. My output is not so clear. So it’s really difficult to look back and say, “Oh, I did this. I wrote this much code and I finished this feature and I feel really proud about the work I’ve done.” Now I sit back and I constantly wonder if I’d done enough. “Are the people happy here? Am I doing what I should be doing? Are the processes running the way they should be? Are people afraid to tell me if things aren’t going wrong?” So it’s a lot of doubt. It’s a lot less material out there that you can look to for management and saying, “Well, how do you be a good engineering manager? What does that entail?” [00:25:46] SY: Absolutely. Yeah. That makes a ton of sense. So tell me about what you imagined being an engineer was going to be like when you were driving people in those lists and you were hearing these stories and hearing about software engineers and then what it actually ended up being like for you. Did it end up being what you thought it would be?\u003c/p\u003e\u003cp\u003e [00:26:04] BJ: Not at all.\u003c/p\u003e\u003cp\u003e [00:26:05] SY: Really?\u003c/p\u003e\u003cp\u003e [00:26:06] BJ: No, I really had this image, I guess I had this image that if you’re a real software engineer, oh, you were just cruising, writing code all day and no distractions. You’re like a code monkey. You’re sitting there, pumping out code, and figuring out really tough problems. And like, boom, at the end of the day, you slam your laptop shut and then the code is deployed. The reality was a lot more intense and stressful, but also more enjoyable. The first time I went to a stand up, which is, I’m sure you know, but when you go tell the team your status for the day, you say, “I worked on this ticket or this feature, number X, Y, Z, 1, 2, 3.” And I’m like, “Wait, what the hell is going on?” Like, “What is this all about?” The whole software development life cycle is something I was clueless about. So there was QA people to be involved with. There was a product manager. There was data people. There was so much more than just writing the code into an editor. And that’s the pieces I had no clue about.\u003c/p\u003e\u003cp\u003e [00:27:04] SY: Was it as fun as you thought it would be? How was the fun and exciting factor?\u003c/p\u003e\u003cp\u003e [00:27:10] BJ: I still love it. I mean, I’ve definitely had terrible days and rough days and days where I suck or days where I feel awesome. But I’ve always enjoyed it. I don’t enjoy, of course, tons of meetings as much, or when processes aren’t done well, that can be annoying. But in general, I liked it even then. It was all new. It was so new to me. And it was even more new that I hadn’t really had a professional job, honestly. So the whole thing was like this really crazy ride. And I still feel like I’m on it. I’m like, “Whoa!” Yeah, it’s like a big adventure. At every new stage, I’m like, “Oh, this is what’s behind that curtain.” [00:27:47] SY: Coming up next, Brian and I talk about his other passion, teaching others as they navigate their own coding journeys after this.\u003c/p\u003e\u003cp\u003e [MUSIC BREAK]\u003c/p\u003e\u003cp\u003e [00:28:09] SY: So always a hustler. You’re not just an engineering manager. You’re also a coach. So you have a coaching business called JS Code Coach. Tell me a little bit more about that. How did you get started with that?\u003c/p\u003e\u003cp\u003e [00:28:20] BJ: Yeah. Well, I started helping people on my team at Clorox specifically with their JavaScript knowledge. I noticed that a lot of them were React developers. We were writing a JavaScript library at the time and I was getting help with it. And I noticed that some of the developers weren’t able to contribute much to it because they were really good at React, but not so good at JavaScript. And I thought, “This is going to hurt you down the line.” Right? Or they didn’t know how to write tests. And I thought, “These are things you can learn. These are learnable things, but if you don’t know, then you don’t know.” And so I would take time to do lunch and learns. I recorded a set of videos to help us with our test suite. We went from 0% coverage to like 40% coverage. And I thought, “I love doing this.” First of all, I love recording the videos, was a cool thing. I made all these videos and I shared them. And then people actually started using them and writing tests because in my thought, “This is really cool. I would love to do this like as a business or something too.” I’m sure a ton of developers could learn from this. And I remember how much I struggled with writing tests or learning things like design patterns or like closure, like all these things that come up in interviews and like beyond. It’s easy to not learn. So I thought there’s a business in here somewhere and I was always looking for this. I’ve gone to multiple bootcamps even after getting hired. I’ll continue to go to them even now. I’m looking for more engineering manager-focused programs. So I thought there’s a need here and I’d love to fill it. There’s not enough out there for people post bootcamp.\u003c/p\u003e\u003cp\u003e [00:29:35] SY: That is such a good point. It really does feel like once bootcamp is over, you’re more or less on your own. I know that a lot of bootcamps, they do have career coaches. They have an opportunity to kind of get that support afterwards, but sometimes it’s a limited time or maybe even a year after you’ve started your job, you still need some support. So it’s great that you’re able to offer that. I’m curious, what kinds of problems do people have? Beyond learning, figuring out what to learn is always a question, figuring out what shiny tech toy to focus on is a question, but beyond that, what are people struggling with these days that you’ve seen?\u003c/p\u003e\u003cp\u003e [00:30:10] BJ: The thing I see, I’ve spoken to over 400 developers in the last year and a half or so.\u003c/p\u003e\u003cp\u003e [00:30:16] SY: Oh my goodness!\u003c/p\u003e\u003cp\u003e [00:30:17] BJ: I know. I’ve done these like free 15-minute chats. Maybe I’m kind of crazy for doing them, but they’ve been really interesting and insightful. I see people struggling with, one, wanting to make progress overly quickly. You can’t cheat time. And I feel bad for people that, yeah, and I’m like, “I know how much you want to be senior or you want to be mid-level or you even want to just get hired.” But unfortunately, there’s no clear timeline for those goals. I think you should have some timeline, but trying to cheat the process or looking for a hack or like an ultimate shortcut is not going to help. Also, I’m really shocked at the number of people suffering from like severe imposter syndrome is a thing that is more rampant than I expected. I’ve talked to people that work at Amazon, Google, and I’m shocked to hear them say, they feel like they got there by luck or that they don’t know anything. They don’t know enough. I don’t know. I’m like, “Wow! This is wild, how rampant this is in this industry.” And then of course, like the fundamentals, I see a lot of people just need clarity and focus in what they’re learning. They want to learn everything and learning how to distinguish macro trends from micro trends and focus on the big macro trends in the industry and also narrowing focus. They see it as, “I want to be a LinkedIn influencer and I want to make a crazy side project as a side business and I want to get…” You need to limit your focus and double down on one thing and you’re probably going to do a lot better.\u003c/p\u003e\u003cp\u003e [00:31:35] SY: That makes a lot of sense. I’m curious what advice you have for people looking for a role today, looking for their first role today, especially in light of all the layoffs that we keep hearing about. It feels like it is a great time to hire, a bad time to try to get hired. It doesn’t feel like a fun time to be a candidate. And so I’m curious what advice you have for folks who are looking for a job now or plan to look soon, especially as we get closer to the end of the year. It only gets harder, the closer we get to the holidays. So what advice do you have? What have you been telling your mentees, your clients?\u003c/p\u003e\u003cp\u003e [00:32:14] BJ: I’ve done this for years now and I’ve worked at bootcamps or with people and I’ve just heard so many stories and I try to figure out what is the thing that people do that separates them and makes them the person that got hired versus a person that didn’t. And when I take away all the different factors and I try to like isolate one thing is consistency is the factor. Now of course, you have to have a foundation of technical skill. But the one thing I see between, I see, “Wow, this person’s really smart. They’re not getting hired.” This person doesn’t know so much. They’ve got… Why? I’ve seen it happen so often. And I think, “What is the difference?” And most of the time it is not only technical skill, but it’s how much can you take rejection. Now, that being said, I do think that some of the low-hanging fruit I see is people painting themselves as a junior developer, playing up the fact that they want to like be a charity case where I say I’m willing to learn a lot or I’m a career switcher. And I think that right now people are less willing to take a chance. They don’t need to take a chance. And so they’re looking for people that say, “Hey, I’m painting myself as… hey, I’m a software developer. Here’s what I can contribute. Here’s what I do.” I think that simple reframing of who you are and what you do is a big switch most people need to make right now instead of coming from the angle of like, “Hey, I’m a junior developer, learning how to code. Hire me.” [00:33:34] SY: Absolutely. There’s the mantra of is who you know, not what you know that matters. And we emphasize networking so much, especially in recent years. I feel like I’ve seen networking be just shouted to the rooftops in terms of strategies, finding that warm lead, reaching out on LinkedIn, making a connection, getting in people’s DMs. And I’m wondering, in light of everyone doing that, in light of everyone trying to play the networking card, in your opinion, how effective is that card and is there a way to still use it and still stand out when it feels like everyone is emailing the hiring manager?\u003c/p\u003e\u003cp\u003e [00:34:11] BJ: My hot take, I hired earlier this year.\u003c/p\u003e\u003cp\u003e [00:34:14] SY: for DevRel?\u003c/p\u003e\u003cp\u003e [00:34:14] BJ: Yes, two, hired two junior developers. Excellent candidates. And most people actually I’d say are networking wrong, like 99%, because my LinkedIn is filled with people who I’ve never met that say, “Hey, I need a job. Look at my resume.” That is the quickest way for me to block you. Or I wouldn’t block you. Quickest way for me to be, “I’m just not going to respond. I don’t know you.” [00:34:36] SY: Yeah.\u003c/p\u003e\u003cp\u003e [00:34:36] BJ: I do free calls and I’m more than happy to get on the phone and have a conversation with somebody. And that’s a fun thing to do. I enjoy it. But somebody just saying, I don’t know, “Give me a job.” That’s crazy. I’m like, “Is this really a way you think is going to work for you?” So that’s one. I’d say that also it just in my anecdotal experience, I’ve seen probably more people still get hired through mass supplying than referrals, but I’ve also seen a lot of people get hired through referrals and networking. So I think either way can work. I do think that the best way to network is, of course, be genuine. I’ve learned finally how to network on LinkedIn, and what it was, was literally me just commenting genuinely on people’s posts, who I found interesting. That was kind of it. And then it would lead to a DM naturally. I’d be like, “Oh! Hey, I noticed you do kind of the same thing. It’s really cool. How are you doing that?” Like, “How are you doing your side business in tech?” Or, “Hey, I see you help junior developers. What are some things you’ve noticed?” “Hey, I found a book I read that I think you might get a kick out of.” Offering something first, these are the ways I’ve talked to, I don’t know, more than a thousand people in the last year, 400 on the phone, right? And out of all the people I’ve talked to, I can count on one hand the number who have like sent me an article, offered me anything. I think these are really good ways to build trust and also just kind of like get that goodwill. It’s like, “Hey, here’s an article.” One young woman, she sent me like a thing about TikTok and it was such a weird thing. I’m like, “Oh, what a smart, nice thing to do.” I’m trying to try my hand out at TikTok. And she’s like, “Here, I found this article for you.” Now when it came time for me to do interviews, she was already hired at this point, I would have totally reached out to her.\u003c/p\u003e\u003cp\u003e [00:36:08] SY: Right. Absolutely. Absolutely. Well, I think your story is absolutely inspiring. It is I feel like the ultimate turn your life around change direction, a story and saying that you’re so successful, you’re turning around you’re helping people with your coaching business is absolutely beautiful and inspiring. Thank you so much for sharing your story with me. I’m curious to hear, when you look back on your journey and you look at where you came from being that 12, 13-year old and finding that wrong crowd, doing those things that you really shouldn’t have been doing and kind of going for the next decade of your life, what would you say to yourself back then knowing where you are today?\u003c/p\u003e\u003cp\u003e [00:36:49] BJ: I think about that a lot with my kids because I pray they don’t go down that same path. I’m seeing they’re not, luckily. One son is 17, another one that’s 10. When I think about why I did that, I think I was missing a lot of self-confidence and I wish I had built my self-confidence in a different way. I think I found it in drugs and alcohol and fake confidence. And the one thing I wish I could tell myself back then or my sons or any young man or young woman or person that’s listening is find your confidence in a positive way. Don’t go for the easy fix. And I’ll be honest, I think, here’s a weird one, working out was actually one of the biggest unlocks for me that I wish I had started early. If I could go back in time at ’13, I’d say, “Go to the gym. Stay in there and find your confidence doing something where you’re lifting weights or something active.” I think that, for me, at that age would have been a lifesaver.\u003c/p\u003e\u003cp\u003e [00:37:48] SY: Interesting. Very interesting. The gym, how did you get to that? How did you figure that out?\u003c/p\u003e\u003cp\u003e [00:37:53] BJ: I guess I never felt that confident as a kid. I got into fights, I get robbed. I get bullied. Then I started fighting and stuff. I’d been a little traumatized. I’d gone through some pretty rough times as a child as well, like violent crime, things like that. And I think that always made me scared of the world. And so I’ve walked through the world scared like, “Oh, what’s going to happen? I’m going to stores. This guy’s going to rob me. Is this person looking to be funny? Should I be afraid?” And I think alcohol gave me an outlet to be really confident. And when I went to the gym, I noticed some of the same feelings I got from alcohol or drug use, people call it runner’s high or whatever you want to call it. There was that feeling of endorphins and also that feeling of like the long-term benefit of going to the gym. You can go to the gym and you’re not going to see any result for a day or a month or even six months. You go for a year, you’ll see a difference. It taught me long-term kind of vision, thinking like, “I’m going to go here with the faith that this will make me feel better,” and just the actual physical feeling of feeling better when I walked out. So that was one of the weirdest things. I didn’t realize this till I stopped drinking. I started running and I was like, “Whoa! This is what I should have been doing my whole life.” [00:38:56] SY: You figured it out eventually. That’s all that matters.\u003c/p\u003e\u003cp\u003e [00:38:58] BJ: Yeah. Yeah.\u003c/p\u003e\u003cp\u003e [00:39:00] SY: So we talked a lot about how you were doing things that you weren’t supposed to do and you change your life for the better. But I am curious if there’s anything about your past that was a positive influence, is there anything that you learned or that you took from your times getting into trouble that actually has served you well in your current career?\u003c/p\u003e\u003cp\u003e [00:39:22] BJ: I think a lot of it was respect. I dealt with a lot of people. I mean, if you saw me back then, or some of the people I associated with, you’d be shocked. But I think it also taught me to not discount other people because I felt bad when I was discounted. The sting that I felt when people would look at me and think or even when I was rejected for that job and then first thought, “Oh, you sound too street,” was the word and I think back then I think I never want to treat somebody like that. My whole thing is I don’t care who you are, what your title is, treat others with respect. That was a big one I learned from I think just generally that environment that I was in.\u003c/p\u003e\u003cp\u003e [00:40:08] SY: Now at the end of every episode, we ask our guests to fill in the blanks of some very important questions. Brian, are you ready to fill in the blanks?\u003c/p\u003e\u003cp\u003e [00:40:15] BJ: Let’s do it.\u003c/p\u003e\u003cp\u003e [00:40:17] SY: Number one, worst advice I’ve ever received is?\u003c/p\u003e\u003cp\u003e [00:40:21] BJ: If you just work hard, you’re going to succeed.\u003c/p\u003e\u003cp\u003e [00:40:25] SY: Oh, interesting. Tell me more.\u003c/p\u003e\u003cp\u003e [00:40:29] BJ: I know. I know. So sad. I used to think this. I think if you grow up, you have your parents say, “Just keep working hard. People will notice.” Kind of.\u003c/p\u003e\u003cp\u003e [00:40:37] SY: It helps.\u003c/p\u003e\u003cp\u003e [00:40:38] BJ: That helps. Being your own advocate is really what helped me out to get, I think, from junior to mid, to senior, to engineering manager. And now on to like, even on here, I mean, the reason I’m on here is also because I advocate for myself on LinkedIn and other places. If you can’t advocate for yourself, you’re going to have a very hard time or you’re going to meet the mercy of others above you to reward you when they feel like it. And if your goal is career trajectory, I think you’re going to have to figure out what’s high leverage, what’s high visibility, and play a little bit of politics in order to get ahead.\u003c/p\u003e\u003cp\u003e [00:41:10] SY: Very true. Number two, best advice I’ve ever received is?\u003c/p\u003e\u003cp\u003e [00:41:14] BJ: Chances make champions.\u003c/p\u003e\u003cp\u003e [00:41:17] SY: Oh, interesting. I don’t think I’ve heard that one before. Tell me about that.\u003c/p\u003e\u003cp\u003e [00:41:21] BJ: I think I heard it from some dude in my past. But it’s true. I think a lot of my life has been around high risk, high reward. Every time I did something, people thought, “That’s crazy,” like learning how to code at like 30 after being a complete wreck. People are like, “Wait, what? You? There’s no way.” I took a chance. I spent $2,000. That was the only $2,000 I had. I had zero money. That was all I had and I bet it all on the table for that career. Best $2, 000 ever spent. Again, I left a job where I was stable for a five-person startup. The most I ever learned there was incredibly stressful, but every time I look back at what I did, I did these high-risk activities, they were planned. It wasn’t just like, “Oh, I’m going to spin the wheel and see what happens.” I knew that, like, “Okay, you’re going to have to take some chances,” if I wanted to get where I wanted to be. And that’s really helped me out, I think, over the years.\u003c/p\u003e\u003cp\u003e [00:42:10] SY: Absolutely. Number three, my first coding project was about?\u003c/p\u003e\u003cp\u003e [00:42:14] BJ: It was a crime map about San Francisco.\u003c/p\u003e\u003cp\u003e [00:42:17] SY: Okay.\u003c/p\u003e\u003cp\u003e [00:42:18] BJ: It was, I think, open data, at the time had this government API where you could get crime statistics, and I use it with Google Maps to show a series of markers in the Mission District where violent crime had happened. It’s still on CodePen. If you can find it, it’s broken, but it’s on CodePen.\u003c/p\u003e\u003cp\u003e [00:42:35] SY: It’s broken, but it’s there.\u003c/p\u003e\u003cp\u003e [00:42:37] BJ: It’s there. It’s still there.\u003c/p\u003e\u003cp\u003e [00:42:38] SY: I like that. Number four, one thing I wish I knew when I first started to code is?\u003c/p\u003e\u003cp\u003e [00:42:43] BJ: That it’s just one tool in the developer belt.\u003c/p\u003e\u003cp\u003e [00:42:48] SY: Such a good point.\u003c/p\u003e\u003cp\u003e [00:42:49] BJ: Yeah. I thought it was the only thing. Communication, hugely important. And I think the more senior you get, the more these “soft skills”, which are actually hard skills, become important as you grow.\u003c/p\u003e\u003cp\u003e [00:43:01] SY: Absolutely. Well, thank you again so much for joining us, Brian, and sharing your absolutely incredible inspiring story with us. Congrats on all of your success and thank you for your time.\u003c/p\u003e\u003cp\u003e [00:43:09] BJ: Thank you so much.\u003c/p\u003e\u003cp\u003e [00:43:13] SY: You can reach out to us on Twitter at CodeNewbies or send me an email, hello@codenewbie.org. For more info on the podcast, check out www.codenewbie.org/podcast. Thanks for listening. See you next week.\u003c/p\u003e\u003cp\u003e [END]\u003c/p\u003e\n            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "52 min read",
  "publishedTime": null,
  "modifiedTime": null
}
