{
  "id": "15285caa-bafd-41d7-8dfb-25cf53db6098",
  "title": "England begin bid for legacy-defining year",
  "link": "https://www.bbc.com/sport/rugby-union/articles/cn8rng8g8ppo",
  "description": "England start their Women's Six Nations title defence against Italy, with this summer's legacy-defining home Rugby World Cup coming into view.",
  "author": "",
  "published": "Sat, 22 Mar 2025 23:38:44 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Alastair Telfer",
  "length": 4412,
  "excerpt": "England start their Women's Six Nations title defence against Italy, with this summer's legacy-defining home Rugby World Cup coming into view.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Guinness Women's Six Nations: England v ItalyVenue: LNER Community Stadium, York Date: Sunday, 23 March Kick-off: 15:00 GMTCoverage: Live on BBC Two, BBC Radio 5 Sports Extra and BBC Sport website and appWinning is the only currency John Mitchell's England work with.The Red Roses bounce into the Women's Six Nations on a formidable 20-game winning run, eyeing a seventh title in a row.England have not lost since Mitchell took charge in autumn 2023 but that incredible stat will not matter if his side fail to deliver in the year of judgement.With a home Rugby World Cup starting in August, the countdown begins to the ultimate prize in 2025.A Six Nations Grand Slam is always expected and with it being the last competitive tournament before the showpiece event, it marks the last proper chance to develop an approach to banish any demons from England's most recent defeat - a World Cup final loss to New Zealand in 2022.Whether Mitchell or his players will admit it or not, this year is all about legacy-defining glory come September.The first part of successful preparation, in a year where planning needs to be exemplary, starts in York on Sunday against Italy in their Six Nations opener.\"With it being a home World Cup, we can't ignore that. We are excited by that but the Six Nations is really important to us, we've got a nice little goal within that to evolve our game,\" Mitchell told BBC Sport.\"We park that up [World Cup chat] and pay respect to work hard and evolve our game in this tournament so by the time we come round to World Cup preparation, we will probably be in a position where we can consolidate.\"From the win over Canada that secured England's WXV1 title success in October, Mitchell has made seven changes in personnel and some positional alterations to his starting XV to face Italy.Mitchell refused to use the word 'rotation' to describe his selections. Instead, his approach is \"one team operating as two\".Lock Zoe Aldcroft captains the side for the first time since Mitchell replaced Marlie Packer as skipper, with Packer taking up her new role as vice-captain from open-side flanker.Gloucester-Hartpury's Mia Venner is rewarded for her fine Premiership Women's Rugby form with a spot on the wing for a first cap in five years, while full-back Emma Sing will hope to show why a high-percentage goal-kicker needs to be in a World Cup squad.Exeter Chiefs' Claudia MacDonald, who has recovered from a second serious neck injury, will be keen to show a reminder of her skills that were integral in England's run to the World Cup final in 2022.Lock Lilli Ives Campion is another player making her first start for the Red Roses, while GB Sevens player Jade Shekells and Exeter scrum-half Flo Robinson could make their debuts off the bench.Helena Rowland has been tasked with driving the side from fly-half, despite playing the majority of her rugby for England in the midfield.\"We've got to use the competition for places to our advantage,\" the New Zealander added. \"2025 starts with the end [a World Cup final] in mind.\"It's important to realise we'll need two teams to operate this year to play 13 Test matches.\"Despite falling to a 48-0 defeat in last year's opening Six Nations game to England, Italy forced their opponents into multiple first-half errors and were behind by only 10 points at half-time.Italy picked up only one win in that campaign and following two victories from three games at WXV2, they made the bold decision to replace Giovanni Raineri as head coach with Fabio Roselli.The unknown nature of Roselli's side could throw up fresh questions for England and offer some important on-field problem solving.\"Researching him and his coaching group, they like attacking rugby so I think we'll see an Italian side that will want to express itself early,\" Mitchell added.\"They will have been influenced by his leadership and I'm sure they'll want to impress him.\"England: Sing; Venner, Scarratt, Aitchison, MacDonald; Rowland, L Packer; Clifford, Cokayne, Muir, Galligan, Ives Campion, Aldcroft (capt), M Packer, Feaunati.Replacements: Campbell, Botterman, Bern, Ward, Kabeya, Robinson, Shekells, Kildunne.Italy: Ostuni Minuzzi; Muzzo, D'Inca, Rigoni, Granzotto; Madia, Stefan (capt); Turani, Gurioli, Seye, Fedrighi, Duca, Veronese, Locatelli, Sgorbini.Replacements: Vecchini, Stecca, Maris, Tounesi, Franco, Bitonci, Stevanin, Capomaggi.Referee: Aurelie Groizeleau (Fra)",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/45bc/live/30b290f0-064e-11f0-88b7-5556e7b55c5e.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eGuinness Women\u0026#39;s Six Nations:\u003c/b\u003e\u003cb\u003e England v Italy\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eVenue:\u003c/b\u003e LNER Community Stadium, York \u003cb\u003eDate: \u003c/b\u003eSunday, 23 March \u003cb\u003eKick-off: \u003c/b\u003e15:00 GMT\u003c/p\u003e\u003cp\u003e\u003cb\u003eCoverage:\u003c/b\u003e Live on BBC Two, BBC Radio 5 Sports Extra and BBC Sport website and app\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eWinning is the only currency John Mitchell\u0026#39;s England work with.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe Red Roses bounce into the Women\u0026#39;s Six Nations on a formidable 20-game winning run, eyeing a seventh title in a row.\u003c/p\u003e\u003cp\u003eEngland have not lost since Mitchell took charge in autumn 2023 but that incredible stat will not matter if his side fail to deliver in the year of judgement.\u003c/p\u003e\u003cp\u003eWith a home Rugby World Cup starting in August, the countdown begins to the ultimate prize in 2025.\u003c/p\u003e\u003cp\u003eA Six Nations Grand Slam is always expected and with it being the last competitive tournament before the showpiece event, it marks the last proper chance to develop an approach to banish any demons from England\u0026#39;s most recent defeat - a World Cup final \u003ca href=\"https://www.bbc.com/sport/rugby-union/63605799\"\u003eloss to New Zealand in 2022\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eWhether Mitchell or his players will admit it or not, this year is all about legacy-defining glory come September.\u003c/p\u003e\u003cp\u003eThe first part of successful preparation, in a year where planning needs to be exemplary, starts in York on Sunday against Italy in their Six Nations opener.\u003c/p\u003e\u003cp\u003e\u0026#34;With it being a home World Cup, we can\u0026#39;t ignore that. We are excited by that but the Six Nations is really important to us, we\u0026#39;ve got a nice little goal within that to evolve our game,\u0026#34; Mitchell told BBC Sport.\u003c/p\u003e\u003cp\u003e\u0026#34;We park that up [World Cup chat] and pay respect to work hard and evolve our game in this tournament so by the time we come round to World Cup preparation, we will probably be in a position where we can consolidate.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eFrom the win over Canada that secured England\u0026#39;s \u003ca href=\"https://www.bbc.com/sport/rugby-union/articles/ce3zel504n3o\"\u003eWXV1 title success\u003c/a\u003e in October, Mitchell has made seven changes in personnel and some positional alterations to his starting XV to face Italy.\u003c/p\u003e\u003cp\u003eMitchell refused to use the word \u0026#39;rotation\u0026#39; to describe his selections. Instead, his approach is \u0026#34;one team operating as two\u0026#34;.\u003c/p\u003e\u003cp\u003eLock Zoe Aldcroft \u003ca href=\"https://www.bbc.com/sport/rugby-union/articles/cd65eq426g6o\"\u003ecaptains the side\u003c/a\u003e for the first time since Mitchell replaced Marlie Packer as skipper, with Packer taking up her new role as vice-captain from open-side flanker.\u003c/p\u003e\u003cp\u003eGloucester-Hartpury\u0026#39;s Mia Venner is rewarded for her fine Premiership Women\u0026#39;s Rugby form with a spot on the wing for a first cap in five years, while full-back Emma Sing will hope to show why a high-percentage goal-kicker needs to be in a World Cup squad.\u003c/p\u003e\u003cp\u003eExeter Chiefs\u0026#39; Claudia MacDonald, who has recovered from a second serious neck injury, will be keen to show a reminder of her skills that were integral in England\u0026#39;s run to the World Cup final in 2022.\u003c/p\u003e\u003cp\u003eLock Lilli Ives Campion is another player making her first start for the Red Roses, while GB Sevens player Jade Shekells and Exeter scrum-half Flo Robinson could make their debuts off the bench.\u003c/p\u003e\u003cp\u003eHelena Rowland has been tasked with driving the side from fly-half, despite playing the majority of her rugby for England in the midfield.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;ve got to use the competition for places to our advantage,\u0026#34; the New Zealander added. \u0026#34;2025 starts with the end [a World Cup final] in mind.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s important to realise we\u0026#39;ll need two teams to operate this year to play 13 Test matches.\u0026#34;\u003c/p\u003e\u003cp\u003eDespite falling to a \u003ca href=\"https://www.bbc.com/sport/rugby-union/68639619\"\u003e48-0 defeat\u003c/a\u003e in last year\u0026#39;s opening Six Nations game to England, Italy forced their opponents into multiple first-half errors and were behind by only 10 points at half-time.\u003c/p\u003e\u003cp\u003eItaly picked up only one win in that campaign and following two victories from three games at WXV2, they made the bold decision to replace Giovanni Raineri as head coach with Fabio Roselli.\u003c/p\u003e\u003cp\u003eThe unknown nature of Roselli\u0026#39;s side could throw up fresh questions for England and offer some important on-field problem solving.\u003c/p\u003e\u003cp\u003e\u0026#34;Researching him and his coaching group, they like attacking rugby so I think we\u0026#39;ll see an Italian side that will want to express itself early,\u0026#34; Mitchell added.\u003c/p\u003e\u003cp\u003e\u0026#34;They will have been influenced by his leadership and I\u0026#39;m sure they\u0026#39;ll want to impress him.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eEngland: \u003c/b\u003eSing; Venner, Scarratt, Aitchison, MacDonald; Rowland, L Packer; Clifford, Cokayne, Muir, Galligan, Ives Campion, Aldcroft (capt), M Packer, Feaunati.\u003c/p\u003e\u003cp\u003e\u003ci\u003eReplacements: \u003c/i\u003eCampbell, Botterman, Bern, Ward, Kabeya, Robinson, Shekells, Kildunne.\u003c/p\u003e\u003cp\u003e\u003cb\u003eItaly: \u003c/b\u003eOstuni Minuzzi; Muzzo, D\u0026#39;Inca, Rigoni, Granzotto; Madia, Stefan (capt); Turani, Gurioli, Seye, Fedrighi, Duca, Veronese, Locatelli, Sgorbini.\u003c/p\u003e\u003cp\u003e\u003ci\u003eReplacements:\u003c/i\u003e Vecchini, Stecca, Maris, Tounesi, Franco, Bitonci, Stevanin, Capomaggi.\u003c/p\u003e\u003cp\u003e\u003cb\u003eReferee: \u003c/b\u003eAurelie Groizeleau (Fra)\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-22T23:38:44.514Z",
  "modifiedTime": null
}
