{
  "id": "198d9a0a-ed75-45b7-ba92-e1e706f78b29",
  "title": "A's clear last big hurdles for $1.75B Vegas stadium",
  "link": "https://www.espn.com/mlb/story/_/id/42802400/a-clear-last-major-hurdles-175-billion-las-vegas-stadium",
  "description": "The Las Vegas Stadium Authority approved lease, non-relocation and development documents Thursday to clear the last major hurdles for the Athletics to construct a $1.75 billion stadium.",
  "author": "",
  "published": "Thu, 5 Dec 2024 20:04:01 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Jeff Passan",
  "length": 4060,
  "excerpt": "The Las Vegas Stadium Authority approved lease, non-relocation and development documents Thursday to clear the last major hurdles for the Athletics to construct a $1.75 billion stadium.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "ESPN News ServicesDec 5, 2024, 07:33 PM ETLAS VEGAS -- The Las Vegas Stadium Authority approved lease, non-relocation and development documents Thursday to clear the last major hurdles for the Athletics to construct a $1.75 billion stadium on the Strip and bring Major League Baseball to the expanding sports market.The lease and non-relocation agreements each cover 30 years.\"It's a really significant day in Las Vegas,\" Steve Hill, CEO and president of the Las Vegas Convention and Visitors Authority, said in his closing remarks. \"Today's a real milestone. I think we should recognize that and celebrate that.\"That drew applause from most of those in attendance.\"It's really an exciting day for the A's,\" team board member Sandy Dean said. \"We're grateful to everybody that helped us be here today.\"Other details remain to be worked out, such as a development agreement with Clark County, but groundbreaking probably will take place in the spring to allow a scheduled opening for the 2028 season.Dean said talks with the county were in the early stages.\"Clark County has been very receptive to our timeline,\" Dean said.The cost for the A's stadium has risen by $250 million because of inflation and added fan and player amenities, Dean said. They include an under-seat cooling system and a split lower bowl to bring the crowd closer to the action.He said it was possible costs could rise more based on factors such as interest rates.\"But we're also going to do our best to create a great ballpark and manage the costs the best we can,\" Dean said.Hill said the A's are \"committed to the premier world-class stadium that is outlined in the law. They know that is what Las Vegas needs.\"Nevada and Clark County are providing $380 million in public funds for a 30,000-seat domed stadium estimated to have a 33,000 capacity. Public financing doesn't begin until the A's have spent at least $100 million. Dean said the organization already has invested $40 million.Dean also said club owner John Fisher increased the previous pledge of his family's money to $1.1 billion. Dean said U.S. Bank and Goldman Sachs will offer a $300 million loan. Fisher still hopes to attract investors in Las Vegas and elsewhere who would purchase equity in the team, according to Dean.\"Any overages are the responsibility of the A's,\" Hill said during the board meeting. \"This may not be the last time the costs rise.\"Hill also said he had full confidence the Fisher had finances to meet obligations. The board also approved that the A's have the ability to pay for their share of the ballpark's construction.Four letters were included in documents to the Stadium Authority board meeting to show that the financing is in place even if Fisher doesn't attract investors. They include:A loan commitment from both banks.Statements saying Fisher and his family have the ability to meet their financial pledge.A U.S. Bank review of the owner's finances that backs up Fisher assertion he has money in place. Steve Vogel, who oversees the bank's sports investments, told the board based an analysis of Fisher's brokerage statements, filings with the Securities and Exchange Commission and other documents that Fisher has \"assets more than sufficient to fund the equity portion\" of the stadium's construction.Commitments to Athletics StadCo LLC, an entity created to handle the private capital investment.The A's will play at least the next three seasons at a minor league ballpark in West Sacramento, California. They recently played their last of 57 seasons in Oakland, California.The LVSA decision came hours after sources told ESPN's Jeff Passan that the A's had reached an agreement to sign free-agent pitcher Luis Severino to a $67 million, three-year contract, the richest deal in club history.The A's would add another professional team to a Las Vegas market that also includes the NFL's Raiders, NHL's Golden Knights and WNBA's Aces. The Golden Knights and Aces have combined to win three championships in recent seasons.Information from The Associated Press was used in this report.",
  "image": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2023%2F0526%2Fr1178630_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eESPN News Services\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan\u003eDec 5, 2024, 07:33 PM ET\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eLAS VEGAS -- The Las Vegas Stadium Authority approved lease, non-relocation and development documents Thursday to clear the last major hurdles for the \u003ca href=\"https://www.espn.com/mlb/team/_/name/oak/oakland-athletics\"\u003eAthletics\u003c/a\u003e to construct a $1.75 billion stadium on the Strip and bring Major League Baseball to the expanding sports market.\u003c/p\u003e\u003cp\u003eThe lease and non-relocation agreements each cover 30 years.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a really significant day in Las Vegas,\u0026#34; Steve Hill, CEO and president of the Las Vegas Convention and Visitors Authority, said in his closing remarks. \u0026#34;Today\u0026#39;s a real milestone. I think we should recognize that and celebrate that.\u0026#34;\u003c/p\u003e\u003cp\u003eThat drew applause from most of those in attendance.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s really an exciting day for the A\u0026#39;s,\u0026#34; team board member Sandy Dean said. \u0026#34;We\u0026#39;re grateful to everybody that helped us be here today.\u0026#34;\u003c/p\u003e\u003cp\u003eOther details remain to be worked out, such as a development agreement with Clark County, but groundbreaking probably will take place in the spring to allow a scheduled opening for the 2028 season.\u003c/p\u003e\u003cp\u003eDean said talks with the county were in the early stages.\u003c/p\u003e\u003cp\u003e\u0026#34;Clark County has been very receptive to our timeline,\u0026#34; Dean said.\u003c/p\u003e\u003cp\u003eThe cost for the A\u0026#39;s stadium \u003ca href=\"https://www.espn.com/mlb/story/_/id/42765623/athletics-las-vegas-stadium-cost-250m\"\u003ehas risen by $250 million\u003c/a\u003e because of inflation and added fan and player amenities, Dean said. They include an under-seat cooling system and a split lower bowl to bring the crowd closer to the action.\u003c/p\u003e\u003cp\u003eHe said it was possible costs could rise more based on factors such as interest rates.\u003c/p\u003e\u003cp\u003e\u0026#34;But we\u0026#39;re also going to do our best to create a great ballpark and manage the costs the best we can,\u0026#34; Dean said.\u003c/p\u003e\u003cp\u003eHill said the A\u0026#39;s are \u0026#34;committed to the premier world-class stadium that is outlined in the law. They know that is what Las Vegas needs.\u0026#34;\u003c/p\u003e\u003cp\u003eNevada and Clark County are providing $380 million in public funds for a 30,000-seat domed stadium estimated to have a 33,000 capacity. Public financing doesn\u0026#39;t begin until the A\u0026#39;s have spent at least $100 million. Dean said the organization already has invested $40 million.\u003c/p\u003e\u003cp\u003eDean also said club owner John Fisher increased the \u003ca href=\"https://apnews.com/article/athletics-as-stadium-vegas-fisher-0c8240d5e0d555d52f4505ea1e8ecea3?utm--source=copy\u0026amp;utm--medium=share\"\u003eprevious pledge\u003c/a\u003e of his family\u0026#39;s money to $1.1 billion. Dean said U.S. Bank and Goldman Sachs will offer a $300 million loan. Fisher still hopes to attract investors in Las Vegas and elsewhere who would purchase equity in the team, according to Dean.\u003c/p\u003e\u003cp\u003e\u0026#34;Any overages are the responsibility of the A\u0026#39;s,\u0026#34; Hill said during the board meeting. \u0026#34;This may not be the last time the costs rise.\u0026#34;\u003c/p\u003e\u003cp\u003eHill also said he had full confidence the Fisher had finances to meet obligations. The board also approved that the A\u0026#39;s have the ability to pay for their share of the ballpark\u0026#39;s construction.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.lvstadiumauthority.com/docs/2024/12/05/mlb/Item%205%20Attchmt%20-%20SA%20Finding-Section%20221c4.pdf\"\u003eFour letters\u003c/a\u003e were included in documents to the Stadium Authority board meeting to show that the financing is in place even if Fisher doesn\u0026#39;t attract investors. They include:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eA loan commitment from both banks.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eStatements saying Fisher and his family have the ability to meet their financial pledge.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eA U.S. Bank review of the owner\u0026#39;s finances that backs up Fisher assertion he has money in place. Steve Vogel, who oversees the bank\u0026#39;s sports investments, told the board based an analysis of Fisher\u0026#39;s brokerage statements, filings with the Securities and Exchange Commission and other documents that Fisher has \u0026#34;assets more than sufficient to fund the equity portion\u0026#34; of the stadium\u0026#39;s construction.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eCommitments to Athletics StadCo LLC, an entity created to handle the private capital investment.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe A\u0026#39;s will play at least the next three seasons at a minor league ballpark in West Sacramento, California. They recently played their \u003ca href=\"https://apnews.com/article/rangers-athletics-coliseum-farewell-c835255943091f9f544768a6939f8ac8\"\u003elast of 57 seasons\u003c/a\u003e in Oakland, California.\u003c/p\u003e\u003cp\u003eThe LVSA decision came hours after sources told ESPN\u0026#39;s Jeff Passan that the A\u0026#39;s had \u003ca href=\"https://apnews.com/article/luis-severino-athletics-721e6b5a4054bb0ce035258875392d91\"\u003ereached an agreement to sign free-agent pitcher \u003c/a\u003e\u003ca href=\"https://www.espn.com/mlb/player/_/id/33263/luis-severino\"\u003eLuis Severino\u003c/a\u003e to a $67 million, three-year contract, the richest deal in club history.\u003c/p\u003e\u003cp\u003eThe A\u0026#39;s would add another professional team to a Las Vegas market that also includes the NFL\u0026#39;s Raiders, NHL\u0026#39;s Golden Knights and WNBA\u0026#39;s Aces. The Golden Knights and Aces have combined to win three championships in recent seasons.\u003c/p\u003e\u003cp\u003e\u003cem\u003eInformation from The Associated Press was used in this report.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-06T00:33:00Z",
  "modifiedTime": null
}
