{
  "id": "1c2b4600-624a-4566-8de5-801a2c8ad7e4",
  "title": "Hodgkinson 'pretty close' to breaking 800m world record",
  "link": "https://www.bbc.com/sport/athletics/articles/cvg7vrre47no",
  "description": "Keely Hodgkinson says she has the 800m world record in her sights after the Olympic champion was named BBC Sports Personality of the Year.",
  "author": "",
  "published": "Wed, 18 Dec 2024 00:01:01 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Harry Poole",
  "length": 4029,
  "excerpt": "Keely Hodgkinson says she has the 800m world record in her sights after the Olympic champion was named BBC Sports Personality of the Year.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Keely Hodgkinson says she feels \"pretty close\" to breaking the 800m world record after the Olympic champion capped a memorable 2024 by being named BBC Sports Personality of the Year.Hodgkinson ended her wait for a global title at Paris 2024 to become Team GB's first Olympic champion on the track since Sir Mo Farah's 5,000m and 10,000m double at Rio 2016.The 22-year-old also retained her European title in Rome and improved her British women's record to one minute 54.61 seconds - a time bettered by only five athletes in history.Her coaches Trevor Painter and Jenny Meadows, who shared the Coach of the Year award, said they would target both world indoor and outdoor golds next year before chasing the sport's longest-standing record in 2026.It has been 41 years since Czech athlete Jarmila Kratochvilova ran 1:53.28 in 1983.\"I'm not afraid to put my goals out there,\" said Hodgkinson, who won the Sports Personality of the Year public vote ahead of darts star Luke Littler and cricketer Joe Root.\"I'm pretty close [to the world record], I would like to think. I have seen this year what my body is capable of and I'm excited to push on.\"That world record is something I will always have in the back of my head. But I have so many years to get stronger so I'm looking forward to seeing what happens.\"I trust in Trevor and Jenny a lot. I know what shape I'm in before I step on the start line. It all depends if it comes together and that can depend on many things in athletics.\"Hodgkinson had finished second at successive World Championships after claiming a stunning silver on her Olympic debut as a teenager in Tokyo three years ago.But, having vowed to never settle for second on such a stage again after losing out to Kenya's Mary Moraa in Budapest in 2023, in Paris she became only the 10th British woman to win athletics gold at a Games.Meadows, a world 800m bronze medallist and herself coached by husband Painter, said: \"Keely is an incredible athlete and I know that it's still the beginning for her.\"She has huge ambitions in the sport and she wont stop until she's at least won another one in LA and even beyond that.\"It's really exciting we now feel like we know how to get those records indoor and outdoor. \"For 2025,the big aim is to win the world indoors and world outdoors. Get the two global titles, that is the big aim. \"Then we think 2026 is the right time to go for the outdoor record. Physically we know she can run 1.53 something in 2025 and then we will push on from there.\"In another stellar season Hodgkinson went unbeaten over two laps and battled through illness to retain her European title, which in 2022 represented her first major outdoor title.Her improved British record at the London Diamond League in July was not only confirmation that she was ready to make the next step on the podium in Paris, but it has also brought Kratochvilova's as yet untouched record firmly within reach.Painter said: \"We are always going to push those boundaries and try to get the world records,whether indoor or out. \"Whether it happens in 2025 we will have to wait and see, but we will do our best to get it.\"After a minor hamstring injury ended her 2024 season before she could defend her Diamond League title, Hodgkinson returned to training in South Africa in recent weeks.But having admitted that she struggled mentally following the unfamiliar high of her breakout first Games at Tokyo, she is unwavering in her determination as she prepares to chase more history and - in her own words - become one of Britain's greatest ever athletes.The World Indoor Championships take place in Nanjing, China, in March before the outdoor gold is on the line in Tokyo in September.\"I think this year I have found a real joy in competing,\" said Hodgkinson.\"I just loved London [Diamond League] so much, I loved Prefontaine [Classic], I loved Paris.\"I have loved being in front of a crowd, putting on a performance, having people behind me and winning for them. \"So I am just looking forward to continuing in that way.\"",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a5f9/live/4a52e980-bccd-11ef-b11e-39975b50bb61.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eKeely Hodgkinson says she feels \u0026#34;pretty close\u0026#34; to breaking the 800m world record after the Olympic champion capped a memorable 2024 by being named BBC Sports Personality of the Year.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eHodgkinson ended her wait for a global title at Paris 2024 to become Team GB\u0026#39;s first Olympic champion on the track since Sir Mo Farah\u0026#39;s 5,000m and 10,000m double at Rio 2016.\u003c/p\u003e\u003cp\u003eThe 22-year-old also retained her European title in Rome and improved her British women\u0026#39;s record to one minute 54.61 seconds - a time bettered by only five athletes in history.\u003c/p\u003e\u003cp\u003eHer coaches Trevor Painter and Jenny Meadows, who shared the \u003ca href=\"https://www.bbc.com/sport/athletics/articles/czeny93yk22o\"\u003eCoach of the Year award\u003c/a\u003e, said they would target both world indoor and outdoor golds next year before chasing the sport\u0026#39;s longest-standing record in 2026.\u003c/p\u003e\u003cp\u003eIt has been 41 years since Czech athlete Jarmila Kratochvilova ran 1:53.28 in 1983.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m not afraid to put my goals out there,\u0026#34; said Hodgkinson, who \u003ca href=\"https://www.bbc.com/sport/articles/c4gldyp77e0o\"\u003ewon the Sports Personality of the Year public vote\u003c/a\u003e ahead of darts star Luke Littler and cricketer Joe Root.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m pretty close [to the world record], I would like to think. I have seen this year what my body is capable of and I\u0026#39;m excited to push on.\u003c/p\u003e\u003cp\u003e\u0026#34;That world record is something I will always have in the back of my head. But I have so many years to get stronger so I\u0026#39;m looking forward to seeing what happens.\u003c/p\u003e\u003cp\u003e\u0026#34;I trust in Trevor and Jenny a lot. I know what shape I\u0026#39;m in before I step on the start line. It all depends if it comes together and that can depend on many things in athletics.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eHodgkinson had finished second at successive World Championships after claiming a stunning silver on her Olympic debut as a teenager in Tokyo three years ago.\u003c/p\u003e\u003cp\u003eBut, having vowed to never settle for second on such a stage again after losing out to Kenya\u0026#39;s Mary Moraa in Budapest in 2023, in Paris she became only the 10th British woman to win athletics gold at a Games.\u003c/p\u003e\u003cp\u003eMeadows, a world 800m bronze medallist and herself coached by husband Painter, said: \u0026#34;Keely is an incredible athlete and I know that it\u0026#39;s still the beginning for her.\u003c/p\u003e\u003cp\u003e\u0026#34;She has huge ambitions in the sport and she wont stop until she\u0026#39;s at least won another one in LA and even beyond that.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s really exciting we now feel like we know how to get those records indoor and outdoor. \u003c/p\u003e\u003cp\u003e\u0026#34;For 2025,the big aim is to win the world indoors and world outdoors. Get the two global titles, that is the big aim. \u003c/p\u003e\u003cp\u003e\u0026#34;Then we think 2026 is the right time to go for the outdoor record. Physically we know she can run 1.53 something in 2025 and then we will push on from there.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIn another stellar season Hodgkinson went unbeaten over two laps and battled through illness to retain her European title, which in 2022 represented her first major outdoor title.\u003c/p\u003e\u003cp\u003eHer improved British record at the London Diamond League in July was not only confirmation that she was ready to make the next step on the podium in Paris, but it has also brought Kratochvilova\u0026#39;s as yet untouched record firmly within reach.\u003c/p\u003e\u003cp\u003ePainter said: \u0026#34;We are always going to push those boundaries and try to get the world records,whether indoor or out. \u003c/p\u003e\u003cp\u003e\u0026#34;Whether it happens in 2025 we will have to wait and see, but we will do our best to get it.\u0026#34;\u003c/p\u003e\u003cp\u003eAfter a minor hamstring injury ended her 2024 season before she could defend her Diamond League title, Hodgkinson returned to training in South Africa in recent weeks.\u003c/p\u003e\u003cp\u003eBut having admitted that she struggled mentally following the unfamiliar high of her breakout first Games at Tokyo, she is unwavering in her determination as she prepares to chase more history and - in her own words - become one of Britain\u0026#39;s greatest ever athletes.\u003c/p\u003e\u003cp\u003eThe World Indoor Championships take place in Nanjing, China, in March before the outdoor gold is on the line in Tokyo in September.\u003c/p\u003e\u003cp\u003e\u0026#34;I think this year I have found a real joy in competing,\u0026#34; said Hodgkinson.\u003c/p\u003e\u003cp\u003e\u0026#34;I just loved London [Diamond League] so much, I loved Prefontaine [Classic], I loved Paris.\u003c/p\u003e\u003cp\u003e\u0026#34;I have loved being in front of a crowd, putting on a performance, having people behind me and winning for them. \u003c/p\u003e\u003cp\u003e\u0026#34;So I am just looking forward to continuing in that way.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-18T00:01:01.336Z",
  "modifiedTime": null
}
