{
  "id": "1df4f858-e386-46d2-b529-c60e53b5281b",
  "title": "Chiefs WR Worthy won't be charged after arrest",
  "link": "https://www.espn.com/nfl/story/_/id/44169854/chiefs-xavier-worthy-charged-alleged-assault-case",
  "description": "The Williamson County district attorney's office has declined to press charges against Chiefs receiver Xavier Worthy following his arrest for an alleged assault.",
  "author": "",
  "published": "Sat, 8 Mar 2025 19:31:20 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Katherine Terrell",
  "length": 2047,
  "excerpt": "The Williamson County district attorney's office has declined to press charges against Chiefs receiver Xavier Worthy following his arrest for an alleged assault.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "ESPNMar 8, 2025, 07:29 PM ETKansas City Chiefs wide receiver Xavier Worthy will not be charged following his arrest Friday night for an alleged assault in Williamson County, Texas, the Williamson County district attorney told the Austin American-Statesman on Saturday.Worthy, 21, was booked into jail by the Williamson County Sheriff's Office for assault of a family or house member by impeding the breathing or circulation. Online records did not have any details of the arrest for Worthy, who had not posted bond as of Saturday evening.Williamson County District Attorney Shawn Dick told the Statesman that his office declined to charge Worthy after speaking with multiple witnesses, but said he will \"continue to evaluate the case.\"\"After further investigation by the Williamson County Sheriff's Office and further discussion with a third-party witness, Mr. Worthy and his attorneys, this case is being declined at this time pending completion of the investigation by the Williamson County Sheriff's Office,\" Dick told the Statesman. \"Mr. Worthy and his lawyers are fully cooperating with this investigation.\"The Chiefs said earlier Saturday that they were aware of Worthy's arrest and gathering information.According to attorneys for the player, Worthy and the complainant, a woman, were in a dispute after he asked her to leave his residence. They said the woman caused property damage and scratched Worthy's face, among other allegations, but that the wide receiver told police he did not want to press charges.\"We will continue to cooperate with Williamson County authorities as we have full faith their thorough investigation will support Mr. Worthy's innocence,\" added the attorneys in a statement.In Texas, impeding a family member's breathing or circulation is a third-degree felony and punishable by two to 10 years in prison and a $10,000 fine.Worthy was the Chiefs' first-round draft pick in 2024. He caught 59 passes for 638 yards and scored nine touchdowns as a rookie.Information from The Associated Press was used in this report.",
  "image": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0303%2Fr1459082_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eESPN\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan\u003eMar 8, 2025, 07:29 PM ET\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ca data-clubhouse-guid=\"f68f2343-8ceb-7a02-740d-af6338be21d2\" href=\"https://www.espn.com/nfl/team/_/name/kc/kansas-city-chiefs\"\u003eKansas City Chiefs\u003c/a\u003e wide receiver \u003ca data-player-guid=\"36240080-be64-3e8a-a33d-8defd9119656\" href=\"https://www.espn.com/nfl/player/_/id/4683062/xavier-worthy\"\u003eXavier Worthy\u003c/a\u003e will not be charged following his arrest Friday night for an alleged assault in Williamson County, Texas, the Williamson County district attorney told the Austin American-Statesman on Saturday.\u003c/p\u003e\u003cp\u003eWorthy, 21, was booked into jail by the Williamson County Sheriff\u0026#39;s Office for assault of a family or house member by impeding the breathing or circulation. Online records did not have any details of the arrest for Worthy, who had not posted bond as of Saturday evening.\u003c/p\u003e\u003cp\u003eWilliamson County District Attorney Shawn Dick told the Statesman that his office declined to charge Worthy after speaking with multiple witnesses, but said he will \u0026#34;continue to evaluate the case.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;After further investigation by the Williamson County Sheriff\u0026#39;s Office and further discussion with a third-party witness, Mr. Worthy and his attorneys, this case is being declined at this time pending completion of the investigation by the Williamson County Sheriff\u0026#39;s Office,\u0026#34; Dick told the Statesman. \u0026#34;Mr. Worthy and his lawyers are fully cooperating with this investigation.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Chiefs said earlier Saturday that they were aware of Worthy\u0026#39;s arrest and gathering information.\u003c/p\u003e\u003cp\u003eAccording to attorneys for the player, Worthy and the complainant, a woman, were in a dispute after he asked her to leave his residence. They said the woman caused property damage and scratched Worthy\u0026#39;s face, among other allegations, but that the wide receiver told police he did not want to press charges.\u003c/p\u003e\u003cp\u003e\u0026#34;We will continue to cooperate with Williamson County authorities as we have full faith their thorough investigation will support Mr. Worthy\u0026#39;s innocence,\u0026#34; added the attorneys in a statement.\u003c/p\u003e\u003cp\u003eIn Texas, impeding a family member\u0026#39;s breathing or circulation is a third-degree felony and punishable by two to 10 years in prison and a $10,000 fine.\u003c/p\u003e\u003cp\u003eWorthy was the Chiefs\u0026#39; first-round draft pick in 2024. He caught 59 passes for 638 yards and scored nine touchdowns as a rookie.\u003c/p\u003e\u003cp\u003e\u003cem\u003eInformation from The Associated Press was used in this report.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-09T00:29:00Z",
  "modifiedTime": null
}
