{
  "id": "200da01e-70b7-446f-9ba5-ad1be6ac6c31",
  "title": "Service Stream Ltd (ASX:SSM) Q1 2025 Earnings Call Highlights: Strong Revenue Growth and ...",
  "link": "https://ca.finance.yahoo.com/news/stream-ltd-asx-ssm-q1-010032204.html",
  "description": "Service Stream Ltd (ASX:SSM) reports a robust 7.9% revenue increase and strategic advancements amid market challenges.",
  "author": "GuruFocus.com",
  "published": "Wed, 26 Feb 2025 01:00:32 GMT",
  "source": "https://sports.yahoo.com/rss/",
  "categories": [
    "Business"
  ],
  "byline": "GuruFocus News",
  "length": 2767,
  "excerpt": "Service Stream Ltd (ASX:SSM) reports a robust 7.9% revenue increase and strategic advancements amid market challenges.",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "In This Article: Revenue: $1.27 billion, an increase of 7.9% on prior corresponding period (pcp). Underlying EBITDA: $73.6 million, up 16.4% on last year. EBITDA Margin: Improved by 40 basis points to 5.8%. Net Cash Position: $55.4 million, an improvement of $47.5 million since June. Operating Cash Flow Before Interest and Tax (OCFBIT): $90.6 million, with a conversion rate of 126%. Net Profit After Tax (NPAT): $33.1 million. Adjusted Earnings Per Share: $0.061 per share. Interim Dividend: $0.025 per share, a 25% increase on pcp. Telecommunications Revenue: $626 million, up 5% on last year. Utilities Revenue: $530 million, up 11.4% on pcp. Utilities EBITDA: $22.4 million, up 38% on pcp. Transport Revenue: $110.5 million, up 8.4% on pcp. Work in Hand: Increased by 17% to $5.9 billion. Warning! GuruFocus has detected 5 Warning Signs with ASX:SSM. Release Date: February 21, 2025 For the complete transcript of the earnings call, please refer to the full earnings call transcript. Service Stream Ltd (ASX:SSM) reported strong financial performance with a 7.9% increase in revenue to $1.27 billion for the half year. The company achieved a significant 16.5% increase in underlying EBITDA to $73.6 million, reflecting improved operational efficiency. Service Stream Ltd (ASX:SSM) generated strong operating cash flows, resulting in an improved net cash position of $55.4 million. The utility division showed a substantial improvement in margins, with EBITDA margins increasing by 80 basis points to 4.2%. The company secured $1.1 billion in new contracts, maintaining a high retention rate of 94% across existing contracts. The telecommunications segment may experience minor seasonality, potentially affecting revenue distribution between the first and second halves. Corporate costs are expected to remain elevated due to ongoing expenses related to defense tenders, which have been delayed by six months. The company faces potential budgetary constraints in government transport agencies, which could impact future procurement processes. Adverse weather conditions did not provide the expected boost to telecommunications revenue in the first half, potentially affecting future performance. The utilities segment experienced a major shutdown maintenance program in the first half, which may not be replicated in the second half, affecting revenue consistency. Q: Can you provide insights on the seasonality of the Telco segment and its impact on the second half? A: Leigh Mackender, CEO, mentioned that while there is generally not much seasonality, there could be a minor impact of 1-2 basis points. The first half exceeded expectations, but the effect is relatively minor, and they wanted to provide that insight.",
  "image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection\u003e  \u003carticle\u003e \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e\u003ch2\u003eIn This Article: \u003c/h2\u003e   \u003cdiv\u003e    \u003cul\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eRevenue:\u003c/strong\u003e $1.27 billion, an increase of 7.9% on prior corresponding period (pcp).\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eUnderlying EBITDA:\u003c/strong\u003e $73.6 million, up 16.4% on last year.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eEBITDA Margin:\u003c/strong\u003e Improved by 40 basis points to 5.8%.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eNet Cash Position:\u003c/strong\u003e $55.4 million, an improvement of $47.5 million since June.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eOperating Cash Flow Before Interest and Tax (OCFBIT):\u003c/strong\u003e $90.6 million, with a conversion rate of 126%.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eNet Profit After Tax (NPAT):\u003c/strong\u003e $33.1 million.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eAdjusted Earnings Per Share:\u003c/strong\u003e $0.061 per share.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eInterim Dividend:\u003c/strong\u003e $0.025 per share, a 25% increase on pcp.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eTelecommunications Revenue:\u003c/strong\u003e $626 million, up 5% on last year.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eUtilities Revenue:\u003c/strong\u003e $530 million, up 11.4% on pcp.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eUtilities EBITDA:\u003c/strong\u003e $22.4 million, up 38% on pcp.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eTransport Revenue:\u003c/strong\u003e $110.5 million, up 8.4% on pcp.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003cstrong\u003eWork in Hand:\u003c/strong\u003e Increased by 17% to $5.9 billion.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cul\u003e\u003cli\u003e \u003cp\u003e\u003ca href=\"https://www.gurufocus.com/term/gf-score/ASX%3ASSM\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Warning! GuruFocus has detected 5 Warning Signs with ASX:SSM.;elm:context_link;itc:0;sec:content-canvas\"\u003eWarning! GuruFocus has detected 5 Warning Signs with ASX:SSM.\u003c/a\u003e\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e \u003cp\u003eRelease Date: February 21, 2025\u003c/p\u003e \u003cp\u003eFor the complete transcript of the earnings call, please refer to the full earnings call transcript.\u003c/p\u003e  \u003cul\u003e\u003cli\u003e \u003cp\u003eService Stream Ltd (\u003ca href=\"https://finance.yahoo.com/quote/ASX:SSM\" data-ylk=\"slk:ASX:SSM;elm:context_link;itc:0;sec:content-canvas\"\u003eASX:SSM\u003c/a\u003e) reported strong financial performance with a 7.9% increase in revenue to $1.27 billion for the half year.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eThe company achieved a significant 16.5% increase in underlying EBITDA to $73.6 million, reflecting improved operational efficiency.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eService Stream Ltd (\u003ca href=\"https://finance.yahoo.com/quote/ASX:SSM\" data-ylk=\"slk:ASX:SSM;elm:context_link;itc:0;sec:content-canvas\"\u003eASX:SSM\u003c/a\u003e) generated strong operating cash flows, resulting in an improved net cash position of $55.4 million.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eThe utility division showed a substantial improvement in margins, with EBITDA margins increasing by 80 basis points to 4.2%.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eThe company secured $1.1 billion in new contracts, maintaining a high retention rate of 94% across existing contracts.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e  \u003cul\u003e\u003cli\u003e \u003cp\u003eThe telecommunications segment may experience minor seasonality, potentially affecting revenue distribution between the first and second halves.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eCorporate costs are expected to remain elevated due to ongoing expenses related to defense tenders, which have been delayed by six months.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eThe company faces potential budgetary constraints in government transport agencies, which could impact future procurement processes.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eAdverse weather conditions did not provide the expected boost to telecommunications revenue in the first half, potentially affecting future performance.\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eThe utilities segment experienced a major shutdown maintenance program in the first half, which may not be replicated in the second half, affecting revenue consistency.\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e  \u003cp\u003e\u003cstrong\u003eQ\u003c/strong\u003e: Can you provide insights on the seasonality of the Telco segment and its impact on the second half? \u003cstrong\u003eA\u003c/strong\u003e: Leigh Mackender, CEO, mentioned that while there is generally not much seasonality, there could be a minor impact of 1-2 basis points. The first half exceeded expectations, but the effect is relatively minor, and they wanted to provide that insight.\u003c/p\u003e       \u003c/div\u003e\u003c/div\u003e     \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-26T01:00:32Z",
  "modifiedTime": null
}
