{
  "id": "2f62e0ac-a5e2-4f3c-bf9b-eea355d8b09c",
  "title": "Nats seek 'fresh approach,' fire Martinez, Rizzo",
  "link": "https://www.espn.com/mlb/story/_/id/45685308/washington-nationals-fire-davey-martinez-mike-rizzo",
  "description": "Headed into an off day and stuck in last place in the NL East, the Washington Nationals fired manager Davey Martinez and general manager Mike Rizzo on Sunday night, hours after a 6-4 loss at home completed a sweep by the Boston Red Sox.",
  "author": "Jesse Rogers",
  "published": "Sun, 6 Jul 2025 20:52:13 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Jesse Rogers",
  "length": 3455,
  "excerpt": "Headed into an off day and stuck in last place in the NL East, the Washington Nationals fired manager Davey Martinez and general manager Mike Rizzo on Sunday night, hours after a 6-4 loss at home completed a sweep by the Boston Red Sox.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "Passan: Nats' struggles led to Martinez, Rizzo firings (1:26)Jeff Passan and Xavier Scruggs react to the Nationals firing GM Mike Rizzo and manager Dave Martinez. (1:26)Jesse RogersJul 6, 2025, 06:35 PM ETCloseJesse joined ESPN Chicago in September 2009 and covers MLB for ESPN.com.The last-place Washington Nationals fired president of baseball operations Mike Rizzo and manager Davey Martinez, the team announced Sunday.Rizzo, 64, and Martinez, 60, won a World Series with the Nationals in 2019, but the team has floundered in recent years. This season, the Nationals are 37-53 and stuck at the bottom of the National League East after getting swept by the Boston Red Sox this weekend at home. Washington hasn't finished higher than fourth in the division since winning the World Series.\"On behalf of our family and the Washington Nationals organization, I first and foremost want to thank Mike and Davey for their contributions to our franchise and our city,\" principal owner Mark Lerner said in a statement. \"Our family is eternally grateful for their years of dedication to the organization, including their roles in bringing a World Series trophy to Washington, D.C.\"While we are appreciative of their past successes, the on-field performance has not been where we or our fans expect it to be. This is a pivotal time for our club, and we believe a fresh approach and new energy is the best course of action for our team moving forward.\"Mike DeBartolo, the club's senior vice president and assistant general manager, was named interim GM on Sunday night. DeBartolo will oversee all aspects of baseball operations, including the MLB draft. An announcement will be made on the interim manager Monday, a day before the club begins a series against the St. Louis Cardinals.Rizzo has been the top decision-maker in Washington since 2013, and Martinez has been on board since 2018. Under Rizzo's leadership, the team made the postseason four times: in 2014, 2016, 2017 and 2019. The latter season was Martinez's lone playoff appearance.\"When our family assumed control of the team, nearly 20 years ago, Mike was the first hire we made,\" Lerner said. \"Over two decades, he was with us as we went from a fledging team in a new city to World Series champion. Mike helped make us who we are as an organization, and we're so thankful to him for his hard work and dedication -- not just on the field and in the front office, but in the community as well.\"The Nationals are in the midst of a rebuild that has moved slower than expected, though the team didn't augment its young core much during the winter. Led by All-Stars James Wood and MacKenzie Gore, Washington has the second-youngest group of hitters in MLB and the sixth-youngest pitching staff.The team lost 11 straight games in a forgettable stretch last month. And during a 2-10 run in June, Washington averaged just 2.5 runs. Since June 1, the Nationals have scored one run or been shut out seven times. In Sunday's 6-4 loss to Boston, they left 15 runners on base.There was industry speculation over the winter that the Nationals would spend money on free agents for the first time in several years, but that never materialized. Instead, the team made minor moves, signing free agents Josh Bell and Michael Soroka, trading for first baseman Nathaniel Lowe and re-signing closer Kyle Finnegan. Now, the hope is a new management team, both on and off the field, can help change the franchise's fortunes.",
  "image": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0706%2Fr1515740_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-video=\"watch,640,360,45685335\" data-cerebro-id=\"686afaea2c1a6662c31921fb\" data-title=\"Passan: Nats\u0026#39; struggles led to Martinez, Rizzo firings\" data-source=\"espn\"\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003ePassan: Nats\u0026#39; struggles led to Martinez, Rizzo firings (1:26)\u003c/span\u003e\u003c/p\u003e\u003cp\u003eJeff Passan and Xavier Scruggs react to the Nationals firing GM Mike Rizzo and manager Dave Martinez. (1:26)\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cimg src=\"https://a.espncdn.com/combiner/i?img=/i/columnists/full/rogers_jesse.png\u0026amp;h=80\u0026amp;w=80\u0026amp;scale=crop\" alt=\"\" width=\"40\" height=\"40\"/\u003e\u003c/p\u003e\u003cp\u003eJesse Rogers\u003cspan\u003eJul 6, 2025, 06:35 PM ET\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"#\"\u003eClose\u003c/a\u003e\u003c/p\u003e\u003cul\u003eJesse joined ESPN Chicago in September 2009 and covers MLB for ESPN.com.\u003c/ul\u003e\u003c/div\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eThe last-place \u003ca data-clubhouse-guid=\"a73e1046-e9aa-ef6b-4e0d-2a7c808cb284\" href=\"https://www.espn.com/mlb/team/_/name/wsh/washington-nationals\"\u003eWashington Nationals\u003c/a\u003e fired president of baseball operations Mike Rizzo and manager Davey Martinez, the team announced Sunday.\u003c/p\u003e\u003cp\u003eRizzo, 64, and Martinez, 60, won a World Series with the Nationals in 2019, but the team has floundered in recent years. This season, the Nationals are 37-53 and stuck at the bottom of the National League East after getting swept by the \u003ca data-clubhouse-guid=\"c6df06f6-785d-3900-4935-5fd13742e2ee\" href=\"https://www.espn.com/mlb/team/_/name/bos/boston-red-sox\"\u003eBoston Red Sox\u003c/a\u003e this weekend at home. Washington hasn\u0026#39;t finished higher than fourth in the division since winning the World Series.\u003c/p\u003e\u003cp\u003e\u0026#34;On behalf of our family and the Washington Nationals organization, I first and foremost want to thank Mike and Davey for their contributions to our franchise and our city,\u0026#34; principal owner Mark Lerner said in a statement. \u0026#34;Our family is eternally grateful for their years of dedication to the organization, including their roles in bringing a World Series trophy to Washington, D.C.\u003c/p\u003e\u003cp\u003e\u0026#34;While we are appreciative of their past successes, the on-field performance has not been where we or our fans expect it to be. This is a pivotal time for our club, and we believe a fresh approach and new energy is the best course of action for our team moving forward.\u0026#34;\u003c/p\u003e\u003cp\u003eMike DeBartolo, the club\u0026#39;s senior vice president and assistant general manager, was named interim GM on Sunday night. DeBartolo will oversee all aspects of baseball operations, including the MLB draft. An announcement will be made on the interim manager Monday, a day before the club begins a series against the \u003ca data-clubhouse-guid=\"c781e7c6-2c5b-beaf-55b8-999c76f76661\" href=\"https://www.espn.com/mlb/team/_/name/stl/st-louis-cardinals\"\u003eSt. Louis Cardinals\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eRizzo has been the top decision-maker in Washington since 2013, and Martinez has been on board since 2018. Under Rizzo\u0026#39;s leadership, the team made the postseason four times: in 2014, 2016, 2017 and 2019. The latter season was Martinez\u0026#39;s lone playoff appearance.\u003c/p\u003e\u003cp\u003e\u0026#34;When our family assumed control of the team, nearly 20 years ago, Mike was the first hire we made,\u0026#34; Lerner said. \u0026#34;Over two decades, he was with us as we went from a fledging team in a new city to World Series champion. Mike helped make us who we are as an organization, and we\u0026#39;re so thankful to him for his hard work and dedication -- not just on the field and in the front office, but in the community as well.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Nationals are in the midst of a rebuild that has moved slower than expected, though the team didn\u0026#39;t augment its young core much during the winter. Led by All-Stars \u003ca data-player-guid=\"05e514e4-4e08-31e8-a7bc-7aa82497d299\" href=\"https://www.espn.com/mlb/player/_/id/4918256/james-wood\"\u003eJames Wood\u003c/a\u003e and \u003ca data-player-guid=\"5f496806-d3fa-4226-e557-dc945eda4f3a\" href=\"https://www.espn.com/mlb/player/_/id/39636/mackenzie-gore\"\u003eMacKenzie Gore\u003c/a\u003e, Washington has the second-youngest group of hitters in MLB and the sixth-youngest pitching staff.\u003c/p\u003e\u003cp\u003eThe team lost 11 straight games in a forgettable stretch last month. And during a 2-10 run in June, Washington averaged just 2.5 runs. Since June 1, the Nationals have scored one run or been shut out seven times. In Sunday\u0026#39;s \u003ca href=\"https://www.espn.com/mlb/game/_/gameId/401696250/red-sox-nationals\"\u003e6-4 loss\u003c/a\u003e to Boston, they left 15 runners on base.\u003c/p\u003e\u003cp\u003eThere was industry speculation over the winter that the Nationals would spend money on free agents for the first time in several years, but that never materialized. Instead, the team made minor moves, signing free agents \u003ca data-player-guid=\"cb5b8d4b-470c-d5fb-280a-a60522468fb2\" href=\"https://www.espn.com/mlb/player/_/id/32517/josh-bell\"\u003eJosh Bell\u003c/a\u003e and \u003ca href=\"https://www.espn.com/mlb/player/_/id/34984/michael-soroka\"\u003eMichael Soroka\u003c/a\u003e, trading for first baseman \u003ca data-player-guid=\"b071e399-f605-01b5-912e-347b59d0da88\" href=\"https://www.espn.com/mlb/player/_/id/40538/nathaniel-lowe\"\u003eNathaniel Lowe\u003c/a\u003e and re-signing closer \u003ca data-player-guid=\"67d0d6bd-ce78-edfd-be8c-55bb92a28841\" href=\"https://www.espn.com/mlb/player/_/id/36543/kyle-finnegan\"\u003eKyle Finnegan\u003c/a\u003e. Now, the hope is a new management team, both on and off the field, can help change the franchise\u0026#39;s fortunes.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-06T22:35:00Z",
  "modifiedTime": null
}
