{
  "id": "566ad51b-2c27-41da-a55a-99e85af036ec",
  "title": "Our one-stop shop for the 2025 NBA draft: Mocks, order and big questions",
  "link": "https://www.espn.com/nba/story/_/id/45558140/2025-nba-draft-players-picks-predictions-intel-rankings-stats-mocks-cheat-sheet-questions-order",
  "description": "We have everything you need to know about the 2025 NBA draft.",
  "author": "ESPN staff",
  "published": "Mon, 23 Jun 2025 18:49:53 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "ESPN staff",
  "length": 17807,
  "excerpt": "Big questions, teams to watch, latest mock draft and the full order -- we have everything you need to know about the 2025 NBA draft.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "ESPN staffJun 23, 2025, 07:02 AM ETThe 2025 NBA draft begins Wednesday in New York at Barclays Center, with the Dallas Mavericks on the clock holding the No. 1 pick and the right to select Duke's Cooper Flagg, the consensus top prospect.There will be 59 selections over two rounds, with the draft being held across two nights for the second time ever.Two big questions heading into the draft: Where will Rutgers star Ace Bailey go if the Philadelphia 76ers pass on him at No. 3? How will teams such as the Brooklyn Nets, who have four first-rounders, use their multiple picks to build around their stars?With insights and analysis from ESPN draft experts Jonathan Givony and Jeremy Woo, we provide you with a one-stop shop for everything you need to know: times, locations, draft order, top prospects, rankings, mock drafts, stats and more. Read about the draft's best players and what to expect this week.Jump to a topic: Dates, times, green room invites Draft order | How good is this class? Questions on Bailey, 2026, more Top 100 rankings | Latest mock, intel Top players by skill | Comps | 5 things to knowWhere, when and how to watch the 2025 draftRound 1: Wednesday at 8 p.m. ET (ABC, ESPN and the ESPN app) Round 2: Thursday at 8 p.m. ET (ESPN and the ESPN app)Five additional players have received invitations to attend the draft in New York and sit in the green room, adding to the 19 top prospects already invited previously.Joan Beringer, Nique Clifford, Cedric Coward, Walter Clayton Jr. and Danny Wolf were the third and final batch of players invited by the NBA league office to take in the draft in New York City with their families. They join Cooper Flagg, Dylan Harper, Ace Bailey, VJ Edgecombe, Tre Johnson, Khaman Maluach, Jeremiah Fears, Kon Knueppel, Kasparas Jakucionis, Egor Demin, Carter Bryant, Derik Queen, Asa Newell, Noa Essengue, Collin Murray-Boyles, Thomas Sorber, Liam McNeeley, Nolan Traore and Will Riley.The green room is a staging area in front of the NBA draft podium where players, their families and agents await commissioner Adam Silver's announcement of players' names upon selection. Players are allowed to invite six people to sit at their tables.Receiving an invitation is considered a positive sign for a player's draft stock. However, there have been instances of prospects falling to the second round while sitting in the green room, including Johnny Furphy and Kyle Filipowski in 2024.play1:36Why there's a lot of uncertainty around Ace Bailey in the draftJonathan Givony and Brian Windhorst analyze the significance of Ace Bailey canceling his visit to the 76ers.What is the draft order?There will be 59 picks in this year's draft: 1-30 on the first night and the rest on the second. The Mavericks had just a 1.8% chance to win the lottery and jumped 10 spots to grab the top pick, the biggest move by any team in lottery history, according to ESPN Research.The Nets have the most picks with five, including four in the first round (Nos. 8, 19, 26, 27 and 36). Eight teams (Suns, Nets, Spurs, Wizards, Hawks, Thunder, Jazz and Pelicans) have multiple first-round picks. The Spurs are the only franchise with multiple lottery picks (No. 2 and No. 14).The New York Knicks' second-round pick was rescinded by the NBA after an investigation into Jalen Brunson's free agency signing in the summer of 2022.Top 14 (lottery picks): 1. Dallas Mavericks 2. San Antonio Spurs 3. Philadelphia 76ers 4. Charlotte Hornets 5. Utah Jazz 6. Washington Wizards 7. New Orleans Pelicans 8. Brooklyn Nets 9. Toronto Raptors 10. Phoenix Suns (from HOU) 11. Portland Trail Blazers 12. Chicago Bulls 13. Atlanta Hawks (via SAC) 14. San Antonio Spurs (via ATL)More: Draft assets for every team | Full draft orderHow good is the 2025 draft class?This class is strong, led by a clear franchise-caliber talent at the top, Cooper Flagg, followed by a potential All-Star, Dylan Harper, at No. 2.There is some uncertainty after that, with a group of six players -- VJ Edgecombe, Ace Bailey, Kon Knueppel, Tre Johnson, Jeremiah Fears and Khaman Maluach -- expected to follow.The first round is considered deep, particularly with wings and forwards likely to dominate much of the remainder, interspersed with a handful of big men and guards.Historically, the best players in the draft rarely go in any specific order at the top. NBA executives expect this trend to continue this year, providing an opportunity for teams with elite talent evaluators and intel gatherers to distinguish themselves from those that weren't paying close enough attention during the season and might easily become distracted in the predraft process.The second round of this year's class took a significant hit, as at least 15 draftable players chose not to enter by the deadline or withdrew from consideration at the NCAA and international deadlines. Though there is talent to be found in the first half of the second round, especially in the 30s, many teams believe the value of their second-round picks has been severely diminished, even compared with last year, which was not seen as a robust draft.Financial implications surrounding the salary cap and luxury tax apron rules, which will heavily impact this summer, are likely to cause numerous trades both days. -- GivonyMore about projected No. 1 pick Cooper FlaggFormer Duke star Cooper Flagg, a 6-foot-9 forward, has been considered the front-runner to be the top pick in the draft since August 2023, when he announced his decision to graduate high school a year early and enroll in college as a 17-year-old.Read ESPN's coverage of the 18-year-old from MaineThe biggest questions about this draft are...Which team will pick Bailey?With Flagg and Harper seemingly locked in at Nos. 1 and 2, the real intrigue starts at No. 3. The 76ers are coming off a challenging season going from championship contenders to one of the worst teams in the NBA (24-58), and they face important decisions in a pivotal offseason.Do the 76ers select Edgecombe or Bailey, or do they trade down a few spots and try to better position their salary books and pick up additional assets?Bailey canceled a visit to the 76ers, sources told ESPN. He was slated to fly to Philadelphia on Friday for dinner with the team's front office and a private workout, but elected to cancel Wednesday, according to the sources.Bailey's predraft strategy has perplexed NBA teams over the past month, as he is currently the only U.S.-based prospect yet to visit any clubs. He has declined invitations from multiple teams in his draft range, which is considered to be anywhere from No. 3 to No. 8. Sources say Bailey's camp has informed interested teams that they believe he is a top-three player in the draft, but also that he seeks a clear pathway to stardom, perhaps feeling comfortable that a franchise will trade up to get him at Nos. 3 or 4 should he drop.The Sixers have not ruled out selecting Bailey despite his refusal to visit, sources told ESPN.Teams such as Washington, New Orleans and Brooklyn, drafting 6-7-8, are surely monitoring the situation closely, as they have ample minutes and opportunities to offer, potentially making them attractive to Bailey's camp. -- Givony and Shams CharaniaHow is the projected talent-rich top of the 2026 draft affecting this year's, if it is at all?With 30 of the top 40 picks in the draft concentrated in the hands of just 12 teams, we're expecting significant movement on both nights of the draft as clubs look to position their books and maintain flexibility with roster spots, contract guarantees and salary and luxury tax considerations.Early on, teams are reporting the market for selections outside the top 10 has proved to be softer than anticipated, with more franchises open to moving picks and players than ones looking for them. The Indiana Pacers are swapping the No. 23 selection to reacquire next year's first-rounder, giving them added flexibility this summer to aggregate more picks in a bigger trade without violating the NBA's Stepien rule.Things can, and likely will, change on draft night once teams are on the clock and get to see who is on the board at different slots.Though the 2026 draft is loaded at the top -- with several potential franchise-caliber talents available in Darryn Peterson, A.J. Dybantsa, Cameron Boozer and Nate Ament -- teams still have a lot to learn about the rest of the lottery and first round, as this is not considered a particularly deep high school senior class currently enrolling in college, nor the most exciting (2007-born) group of international players about to become NBA draft eligible for the first time.With that said, a significant number of players elected to either not enter this year's draft or withdrew at the deadline, adding quite a bit of \"older\" depth in the college ranks that doesn't normally exist. Teams will have to weigh how to value future picks with that in mind, something that has become a joint venture between traditional scouts, strategy analysts and analytics departments. -- GivonyThe Nets have five picks inside the top 40. How will they approach this draft?Brooklyn has been one of the most active teams in the lead-up to the draft out of necessity. With the No. 8, No. 19, No. 26, No. 27 and No. 36 picks, the Nets have the levers and the incentive to optimize their return on draft night, considering it's unlikely they'll roster five rookies next season. They are also the only team with meaningful salary cap space, giving them optimal flexibility to not only make their own moves, but also to facilitate things for other teams.What exactly that means for the Nets is still playing out in real time behind the scenes. Can they combine their picks to move up from No. 8? Do they select at No. 8 and instead try to move from No. 19 into the late lottery? Do they use both, and then look to trade some of the later selections? The number of picks they have in different areas of the draft has allowed them to cast a wide net (no pun intended) and bring in the majority of prospects for meetings and workouts.No matter what it ultimately does, Brooklyn is viewed by player agents as a desirable landing spot, due to the developmental minutes it has available that not many other teams can concretely offer. The Nets are looking through a long-term lens and prioritizing talent over NBA readiness, with a strong 2026 lottery class on the horizon before they start angling to flip the switch toward competing for the postseason. -- WooHow do the prospects rank?For a full list of the top 100 prospects (including strengths and weaknesses), check out the complete rankings compiled by Givony and Woo.Any suspense as far as Flagg was concerned was put to rest on lottery night, with the Mavericks shockingly winning the right to select him.Expect Flagg to be up for the challenge, as he has held down the top spot on our draft board largely unchallenged, and continues to get better at an impressive rate. He'll be an impactful defender and versatile option for Dallas immediately, with room to grow and increase his comfort as a scorer and playmaker over time. At this point, the question is more about what heights he'll ultimately reach, with a promising future awaiting.ESPN's top 10 prospects: 1. Cooper Flagg, SF/PF, Duke 2. Dylan Harper, PG/SG, Rutgers 3. Ace Bailey, SG/SF, Rutgers 4. VJ Edgecombe, SG, Baylor 5. Tre Johnson, SG, Texas 6. Kon Knueppel, SG/SF, Duke 7. Khaman Maluach, C, Duke 8. Jeremiah Fears, PG, Oklahoma 9. Noa Essengue, PF, Ratiopharm Ulm (Germany) 10. Kasparas Jakucionis, PG, IllinoisMore: Kevin Pelton's top 30 prospectsLatest mock draft and intelGivony and Woo will be tracking news and team and player information until the Mavericks go on the clock Wednesday, with this version of the mock draft undergoing updates until draft time, based on our latest intel.Walter Clayton Jr.'s landing spot?: Clayton has showcased his dynamic shotmaking in workouts and worked his way up boards in a first round that has shaped up somewhat light on point guard options. Considering the Heat's need for a proper point guard and the way Clayton seems to fit their mold, this fit makes sense on paper.Suns' plans with their new pick at No. 10?: With the Suns desperately needing to upgrade their frontcourt -- especially after losing their starting power forward in Kevin Durant -- Collin Murray-Boyles is likely someone the team will consider heavily if they keep the pick.Who are the top prospects by skill?Woo shares his list of the top prospects based on skills and traits in 20 categories. Here are notable names who stand out:Best pull-up shooter: Ace Bailey, F, Rutgers No player in this draft class is more dangerous in a tight window than Bailey, whose ability to rise and fire over defenders at difficult angles and knock down tough shots off the bounce make him a tantalizing scoring prospect.Best intangibles: Khaman Maluach, C, Duke Maluach is expected to be the first center off the board because of his impact for Duke as one of college basketball's premier paint deterrents, but his appeal as an NBA prospect also has much to do with who he is as a person and what he'll bring to a locker room.Best rim protector: Joan Beringer, C, Cedevita Olimpija (Adriatic League) Beringer's draft stock skyrocketed this season as scouts gradually made the trip to see him in Europe, as his excellent defensive abilities and shot-blocking chops at 18 years old were on display.play1:11Joan Beringer's NBA draft profileCheck out some of the highlights that have made Joan Beringer a top NBA draft prospect.Pro player comps: Edgecombe, Johnson, moreThe goal here isn't to draw a perfect comparison for each of the 14 projected lottery picks -- we'd be guaranteed to be wrong. This exercise serves as a lens to think about a prospect's future role, examine his range of potential outcomes, and consider which areas of development are most critical to long-term success.Here are a couple of notable comps and excerpts from Woo's recent story:VJ Edgecombe, SG, Baylor High end: Victor Oladipo Low end: Jaden IveyThe elevator pitch with Edgecombe centers largely around the possibility that he develops into a capable on-ball creator, where his speed, strength and elite explosiveness could best create problems for defenses. Getting him the reps he needs to make that leap will be step one wherever he lands, but the downhill, hyperathletic slashing mold he fits makes Oladipo a valid point of comparison.Tre Johnson, SG, Texas High end: Michael Redd Low end: Cam Thomas, but tallerJohnson is a fairly simple prospect to understand. He's likely going to shoot it well; he's probably going to shoot a lot; and whatever else he ends up giving his future team will be gravy, not necessarily baked into their expectations. If Johnson can come close to the type of career Redd put together (although Redd's peak in the early 2000s was eventually hampered by serious knee injuries in 2009), that would be a pretty outstanding result, and there are some similar components here.More: Flagg's best NBA comps: Tatum, Pippen and KawhiESPN Research: Five things to know about this draft1. Assuming they make the pick, the Mavericks will become the fourth team in the modern draft era (since 1966) to make the No. 1 pick in the draft within a year of reaching the NBA Finals. The others: The Bulls won the NBA Finals in 1998 and drafted Elton Brand with the No. 1 pick in 1999. The Lakers won the NBA Finals in 1982 and drafted James Worthy with the No. 1 pick in 1982. The Trail Blazers won the NBA Finals in 1977 and drafted Mychal Thompson with the No. 1 pick in 1978.2. Flagg, who reclassified, will be 18 years and 186 days old on draft night, making him the second-youngest No. 1 pick in draft history, behind LeBron James (18 years, 178 days old) in 2003. Also, Flagg will give Duke its fifth player selected first in the draft, the most top selections of any school. The Blue Devils already had the most with four: Elton Brand (1999), Kyrie Irving (2011), Zion Williamson (2019), Paolo Banchero (2022).3. Based on ESPN's latest mock draft, the first eight picks are projected to be freshmen. If that happens, it will mark the most consecutive freshmen selected in a row at any point in a single draft. The previous most came in 2017, when the first seven picks were freshmen. In all, 12 of the 14 lottery picks are projected to be freshmen, which would set a record for most selected in the lottery era. It would mark the third time double-digit freshmen were picked in the lottery (11 in 2017 and 10 in 2018).4. Kentucky does not have a player projected to go in Round 1, which would snap a streak of 15 consecutive drafts with a first-round pick, the longest in the modern draft era (since 1966). The last time Kentucky didn't have a player selected in the first round was in 2009, John Calipari's final season at Memphis before taking over at Kentucky. Cooper Flagg had yet to turn 3 years old.5. Based on ESPN's latest mock draft, five Frenchmen are projected to be selected in the first round (Joan Beringer, Noa Essengue, Nolan Traoré, Noah Penda and Stanford's Maxime Raynaud). This comes one year after four players representing France were selected in the 2024 draft, which tied Canada (2019) for the most players from a non-U.S. country taken in the first round of a single draft. France has had at least one player selected in the first round in each of the past three NBA drafts, including the past two No. 1 picks.Jonathan Givony is an NBA draft expert and the founder and co-owner of DraftExpress.com, a private scouting and analytics service used by NBA, NCAA and international teams.Jeremy Woo is an NBA analyst specializing in prospect evaluation and the draft. He was previously a staff writer and draft insider at Sports Illustrated.",
  "image": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0108%2Fnba_mock%2Ddraft_16x9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cimg src=\"https://a.espncdn.com/combiner/i?img=/i/columnists/espn_generic_m.jpg\u0026amp;h=80\u0026amp;w=80\u0026amp;scale=crop\" alt=\"\" width=\"40\" height=\"40\"/\u003e\u003c/p\u003e\u003cp\u003eESPN staff\u003cspan\u003eJun 23, 2025, 07:02 AM ET\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eThe \u003ca href=\"https://www.espn.com/nba/draft/news\"\u003e2025 NBA draft\u003c/a\u003e begins Wednesday in New York at Barclays Center, with the \u003ca data-clubhouse-guid=\"f00d1f4e-4ce6-d581-466c-5b52531cf7ad\" href=\"https://www.espn.com/nba/team/_/name/dal/dallas-mavericks\"\u003eDallas Mavericks\u003c/a\u003e on the clock holding the \u003ca href=\"https://www.espn.com/nba/story/_/id/45041634/2025-nba-draft-complete-order-all-59-picks\"\u003eNo. 1 pick\u003c/a\u003e and the right to select Duke\u0026#39;s \u003ca data-player-guid=\"6cf6ea11-b3e4-35fd-bb91-f9f6caf6e2c8\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5041939/cooper-flagg\"\u003eCooper Flagg\u003c/a\u003e, the consensus \u003ca href=\"https://www.espn.com/nba/story/_/id/41662748/2025-nba-draft-big-board-rankings-top-100-prospects-players\"\u003etop prospect\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThere will be 59 selections over \u003ca href=\"https://www.espn.com/nba/story/_/id/45539096/how-watch-every-round-2025-nba-draft-espn\"\u003etwo rounds\u003c/a\u003e, with the draft being held across two nights for the second time ever.\u003c/p\u003e\u003cp\u003eTwo big questions heading into the draft: Where will Rutgers star \u003ca data-player-guid=\"51ddca1a-e632-38f9-a875-b8858a2884de\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/4873138/ace-bailey\"\u003eAce Bailey\u003c/a\u003e go if the \u003ca data-clubhouse-guid=\"ca1685ed-b799-53e4-7924-e58ea6eb8f3a\" href=\"https://www.espn.com/nba/team/_/name/phi/philadelphia-76ers\"\u003ePhiladelphia 76ers\u003c/a\u003e pass on him at No. 3? How will teams such as the \u003ca data-clubhouse-guid=\"926db769-d35e-e282-9d7e-a05001d774ab\" href=\"https://www.espn.com/nba/team/_/name/bkn/brooklyn-nets\"\u003eBrooklyn Nets\u003c/a\u003e, who have four first-rounders, use their multiple picks to build around their stars?\u003c/p\u003e\u003cp\u003eWith insights and analysis from ESPN draft experts Jonathan Givony and Jeremy Woo, we provide you with a one-stop shop for everything you need to know: times, locations, draft order, top prospects, rankings, mock drafts, stats and more. Read about the draft\u0026#39;s best players and what to expect this week.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eJump to a topic:\u003c/strong\u003e\u003cbr/\u003e\n\u003ca href=\"https://www.espn.com/nba/story/_/id/45558140/2025-nba-draft-players-picks-predictions-intel-rankings-stats-mocks-cheat-sheet-questions-order#dates\"\u003eDates, times, green room invites\u003c/a\u003e\u003cbr/\u003e\n\u003ca href=\"https://www.espn.com/nba/story/_/id/45558140/2025-nba-draft-players-picks-predictions-intel-rankings-stats-mocks-cheat-sheet-questions-order#order\"\u003eDraft order\u003c/a\u003e | \u003ca href=\"https://www.espn.com/nba/story/_/id/45558140/2025-nba-draft-players-picks-predictions-intel-rankings-stats-mocks-cheat-sheet-questions-order#2025\"\u003eHow good is this class?\u003c/a\u003e\u003cbr/\u003e\n\u003ca href=\"https://www.espn.com/nba/story/_/id/45558140/2025-nba-draft-players-picks-predictions-intel-rankings-stats-mocks-cheat-sheet-questions-order#questions\"\u003eQuestions on Bailey, 2026, more\u003c/a\u003e\u003cbr/\u003e\n\u003ca href=\"https://www.espn.com/nba/story/_/id/45558140/2025-nba-draft-players-picks-predictions-intel-rankings-stats-mocks-cheat-sheet-questions-order#rank\"\u003eTop 100 rankings\u003c/a\u003e | \u003ca href=\"https://www.espn.com/nba/story/_/id/45558140/2025-nba-draft-players-picks-predictions-intel-rankings-stats-mocks-cheat-sheet-questions-order#mock\"\u003eLatest mock, intel\u003c/a\u003e\u003cbr/\u003e\n\u003ca href=\"https://www.espn.com/nba/story/_/id/45558140/2025-nba-draft-players-picks-predictions-intel-rankings-stats-mocks-cheat-sheet-questions-order#skills\"\u003eTop players by skill\u003c/a\u003e | \u003ca href=\"https://www.espn.com/nba/story/_/id/45558140/2025-nba-draft-players-picks-predictions-intel-rankings-stats-mocks-cheat-sheet-questions-order#comp\"\u003eComps\u003c/a\u003e | \u003ca href=\"https://www.espn.com/nba/story/_/id/45558140/2025-nba-draft-players-picks-predictions-intel-rankings-stats-mocks-cheat-sheet-questions-order#five\"\u003e5 things to know\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cimg src=\"https://a.espncdn.com/i/infographics/20170710_nfl_fpr/charts/_end_rule.png\" width=\"100%\"/\u003e\u003c/p\u003e\u003ch2\u003e\u003ca href=\"https://www.espn.com/nba/story/_/id/45539096/how-watch-every-round-2025-nba-draft-espn\"\u003eWhere, when and how to watch the 2025 draft\u003c/a\u003e\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eRound 1:\u003c/strong\u003e Wednesday at 8 p.m. ET (ABC, ESPN and the ESPN app)\u003cbr/\u003e\n\u003cstrong\u003eRound 2:\u003c/strong\u003e Thursday at 8 p.m. ET (ESPN and the ESPN app)\u003c/p\u003e\u003cp\u003eFive additional players have received invitations to \u003ca href=\"https://www.espn.com/nba/story/_/id/45544790/5-more-players-get-nba-draft-green-room-invites\"\u003eattend the draft\u003c/a\u003e in New York and sit in the green room, adding to the 19 top prospects already invited previously.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.espn.com/nba/story/_/id/44853028/french-center-joan-beringer-enter-nba-draft\"\u003eJoan Beringer\u003c/a\u003e, \u003ca data-player-guid=\"3da4dcbe-ff57-3082-a02a-48ec86e1ba8b\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/4702384/nique-clifford\"\u003eNique Clifford\u003c/a\u003e, \u003ca data-player-guid=\"3c9c5de0-5d48-3e7f-9a01-36ab9af267dc\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/4903027/cedric-coward\"\u003eCedric Coward\u003c/a\u003e, \u003ca href=\"https://www.espn.com/mens-college-basketball/player/_/id/4896372/walter-clayton-jr\"\u003eWalter Clayton Jr\u003c/a\u003e. and \u003ca data-player-guid=\"ac3b948f-3ad6-335a-9ac2-8c7c166b0ba4\" href=\"http://www.espn.com/mens-college-basketball/player/_/id/5107173/danny-wolf\"\u003eDanny Wolf\u003c/a\u003e were the third and final batch of players invited by the NBA league office to take in the draft in New York City with their families. They join \u003ca data-player-guid=\"6cf6ea11-b3e4-35fd-bb91-f9f6caf6e2c8\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5041939/cooper-flagg\"\u003eCooper Flagg\u003c/a\u003e, \u003ca data-player-guid=\"d8fd1989-052d-3e45-91f2-6fda54fa5c8e\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5037871/dylan-harper\"\u003eDylan Harper\u003c/a\u003e, \u003ca data-player-guid=\"51ddca1a-e632-38f9-a875-b8858a2884de\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/4873138/ace-bailey\"\u003eAce Bailey\u003c/a\u003e, \u003ca data-player-guid=\"d5a0355a-95f4-38ed-b96d-ea0302ebbd0b\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5124612/vj-edgecombe\"\u003eVJ Edgecombe\u003c/a\u003e, \u003ca data-player-guid=\"432b4847-f726-3711-898d-9e507c8f5bf2\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5238230/tre-johnson\"\u003eTre Johnson\u003c/a\u003e, \u003ca data-player-guid=\"2cf33fe2-4a92-3188-9d87-78ac5aac53be\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5203685/khaman-maluach\"\u003eKhaman Maluach\u003c/a\u003e, \u003ca data-player-guid=\"a34d3e64-4f77-38de-8d04-34456599255d\" href=\"http://www.espn.com/mens-college-basketball/player/_/id/5144091/jeremiah-fears\"\u003eJeremiah Fears\u003c/a\u003e, \u003ca data-player-guid=\"d706a855-1bca-34f6-9dd7-6684dd22c3ee\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5061575/kon-knueppel\"\u003eKon Knueppel\u003c/a\u003e, \u003ca data-player-guid=\"e2102203-397a-3ec5-848f-93af00ece3a5\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5214640/kasparas-jakucionis\"\u003eKasparas Jakucionis\u003c/a\u003e, \u003ca data-player-guid=\"fb0aca8f-4878-3010-abe0-05b507191367\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5243213/egor-demin\"\u003eEgor Demin\u003c/a\u003e, \u003ca data-player-guid=\"bf077b0c-98d4-3009-bb34-a07e5a64f4d2\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5061568/carter-bryant\"\u003eCarter Bryant\u003c/a\u003e, \u003ca data-player-guid=\"0e7f21a8-df8c-3ace-8cf6-c7ff07c756fa\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/4869780/derik-queen\"\u003eDerik Queen\u003c/a\u003e, \u003ca data-player-guid=\"845890e6-99e5-3258-8430-8923e17e4a2d\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/4873201/asa-newell\"\u003eAsa Newell\u003c/a\u003e, \u003ca data-player-guid=\"13c2a19f-d803-32b5-a344-cf07dc594665\" href=\"https://www.espn.com/nba/player/_/id/5242496/noa-essengue\"\u003eNoa Essengue\u003c/a\u003e, \u003ca data-player-guid=\"8cca71b9-6ade-316f-9b13-a2486e0dbd46\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5093267/collin-murray-boyles\"\u003eCollin Murray-Boyles\u003c/a\u003e, \u003ca data-player-guid=\"662a5a94-8cf3-33c4-8d91-f950cae85e12\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5061603/thomas-sorber\"\u003eThomas Sorber\u003c/a\u003e, \u003ca data-player-guid=\"6d6b4455-4c69-3296-96e1-e20ed80ec16f\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5239590/liam-mcneeley\"\u003eLiam McNeeley\u003c/a\u003e, \u003ca href=\"https://www.espn.com/nba/story/_/id/44834615/france-nolan-traore-projected-top-20-pick-enter-nba-draft\"\u003eNolan Traore\u003c/a\u003e and \u003ca data-player-guid=\"dbc88312-f9a8-3d47-9bfa-dc54b447b95b\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/5144126/will-riley\"\u003eWill Riley\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe green room is a staging area in front of the NBA draft podium where players, their families and agents await commissioner Adam Silver\u0026#39;s announcement of players\u0026#39; names upon selection. Players are allowed to invite six people to sit at their tables.\u003c/p\u003e\u003cp\u003eReceiving an invitation is considered a positive sign for a player\u0026#39;s draft stock. However, there have been instances of prospects falling to the second round while sitting in the green room, including \u003ca href=\"https://www.espn.com/nba/player/_/id/5157066/johnny-furphy\"\u003eJohnny Furphy\u003c/a\u003e and \u003ca href=\"https://www.espn.com/nba/player/_/id/4684793/kyle-filipowski\"\u003eKyle Filipowski\u003c/a\u003e in 2024.\u003c/p\u003e\u003cdiv data-behavior=\"video_scroll\"\u003e\u003cfigure data-video=\"watch,640,360,45556105,whitelist-CU|UM|KN|NA|SC|ZM|PW|GD|PA|KE|ST|RE|CL|AM|AW|ER|VE|VI|AG|GT|SZ|BO|BS|PE|CF|MP|MZ|GQ|PR|AS|MQ|BF|GP|TG|BB|GF|MX|SR|LR|KY|CO|ZA|MF|GA|GU|SL|GM|BI|CM|VG|CI|CR|BW|BZ|ET|TC|MU|VC|UY|EC|ML|LS|BM|MG|NG|SV|CV|BR|UG|SS|PY|DO|GH|CG|NE|SX|JM|GN|TZ|AU|BJ|AI|MW|NZ|KM|LC|FJ|FM|AO|HT|RW|MH|MS|TT|GB|UK|SN|GY|CD|NI|HN|ZW|GW|US|BQ|,url-https://watch.auth.api.espn.com/video/auth/brightcove/9afb27d7-1121-430f-83ba-52523fd38562/asset?UMADPARAMreferer=https://www.espn.com/video/clip?id=45556105,poster-https://media.video-cdn.espn.com/motion/2025/0621/dm_250621_Ace/dm_250621_Ace.jpg\" data-cerebro-id=\"6856aecd9c6bbb6be1f6deaa\" data-title=\"Why there\u0026#39;s a lot of uncertainty around Ace Bailey in the draft\" data-source=\"espn\"\u003e\u003cpicture\u003e\u003csource data-srcset=\"https://a1.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0621%2Fdm_250621_Ace%2Fdm_250621_Ace.jpg\u0026amp;w=640\u0026amp;h=360\u0026amp;cquality=80\u0026amp;format=jpg\" media=\"(min-width: 376px)\"/\u003e\u003csource data-srcset=\"https://a1.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0621%2Fdm_250621_Ace%2Fdm_250621_Ace.jpg\u0026amp;w=335\u0026amp;cquality=80, https://a1.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0621%2Fdm_250621_Ace%2Fdm_250621_Ace.jpg\u0026amp;w=670\u0026amp;cquality=40\u0026amp;format=jpg 2x\" media=\"(max-width: 375px)\"/\u003e\u003c/picture\u003e\u003cspan data-id=\"45556105\"\u003eplay\u003c/span\u003e\u003cfigcaption\u003e\u003cp\u003e1:36\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003eWhy there\u0026#39;s a lot of uncertainty around Ace Bailey in the draft\u003c/p\u003e\u003cp\u003eJonathan Givony and Brian Windhorst analyze the significance of Ace Bailey canceling his visit to the 76ers.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003chr/\u003e\u003ch2\u003e\u003ca href=\"https://www.espn.com/nba/story/_/id/45041634/2025-nba-draft-complete-order-all-59-picks\"\u003eWhat is the draft order?\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eThere will be 59 picks in this year\u0026#39;s draft: 1-30 on the first night and the rest on the second. The Mavericks had just a 1.8% chance to \u003ca href=\"https://www.espn.com/nba/story/_/id/45117355/mavericks-win-nba-draft-lottery-18-odds\"\u003ewin the lottery\u003c/a\u003e and jumped 10 spots to grab the top pick, the biggest move by any team in lottery history, according to ESPN Research.\u003c/p\u003e\u003cp\u003eThe Nets have the most picks with five, including four in the first round (Nos. 8, 19, 26, 27 and 36). Eight teams (Suns, Nets, Spurs, Wizards, Hawks, Thunder, Jazz and Pelicans) have multiple first-round picks. The Spurs are the only franchise with multiple lottery picks (No. 2 and No. 14).\u003c/p\u003e\u003cp\u003eThe \u003ca data-clubhouse-guid=\"61719eb2-11c3-4e3d-90c3-0a1319fd850b\" href=\"https://www.espn.com/nba/team/_/name/ny/new-york-knicks\"\u003eNew York Knicks\u003c/a\u003e\u0026#39; second-round pick was rescinded by the NBA after an investigation into \u003ca data-player-guid=\"89519c75-cf8a-38e7-1151-b6247a2d4535\" href=\"https://www.espn.com/nba/player/_/id/3934672/jalen-brunson\"\u003eJalen Brunson\u003c/a\u003e\u0026#39;s free agency signing in the summer of 2022.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTop 14 (lottery picks):\u003c/strong\u003e\u003cbr/\u003e\n1. Dallas Mavericks\u003cbr/\u003e\n2. \u003ca data-clubhouse-guid=\"8aef8547-32f5-0943-a1de-e734567674cc\" href=\"https://www.espn.com/nba/team/_/name/sa/san-antonio-spurs\"\u003eSan Antonio Spurs\u003c/a\u003e\u003cbr/\u003e\n3. Philadelphia 76ers\u003cbr/\u003e\n4. \u003ca data-clubhouse-guid=\"377633c2-0dd1-91a1-83c0-9ed2d0c00ea1\" href=\"https://www.espn.com/nba/team/_/name/cha/charlotte-hornets\"\u003eCharlotte Hornets\u003c/a\u003e\u003cbr/\u003e\n5. \u003ca data-clubhouse-guid=\"77cea2fb-1388-b7c8-d171-2e72b3aecbfb\" href=\"https://www.espn.com/nba/team/_/name/utah/utah-jazz\"\u003eUtah Jazz\u003c/a\u003e\u003cbr/\u003e\n6. \u003ca data-clubhouse-guid=\"64d73af6-b8ec-e213-87e8-a4eab3a692e7\" href=\"https://www.espn.com/nba/team/_/name/wsh/washington-wizards\"\u003eWashington Wizards\u003c/a\u003e\u003cbr/\u003e\n7. \u003ca data-clubhouse-guid=\"9461f397-7882-94c0-c18c-e89bdc9e570e\" href=\"https://www.espn.com/nba/team/_/name/no/new-orleans-pelicans\"\u003eNew Orleans Pelicans\u003c/a\u003e\u003cbr/\u003e\n8. Brooklyn Nets\u003cbr/\u003e\n9. \u003ca data-clubhouse-guid=\"5a9c33b8-63fd-ff34-a833-925fe89320a6\" href=\"https://www.espn.com/nba/team/_/name/tor/toronto-raptors\"\u003eToronto Raptors\u003c/a\u003e\u003cbr/\u003e\n10. \u003ca href=\"https://www.espn.com/nba/team/_/name/phx/phoenix-suns\"\u003ePhoenix Suns\u003c/a\u003e (from HOU)\u003cbr/\u003e\n11. \u003ca data-clubhouse-guid=\"ed294c02-3c44-db14-9e06-1b4e8cff9558\" href=\"https://www.espn.com/nba/team/_/name/por/portland-trail-blazers\"\u003ePortland Trail Blazers\u003c/a\u003e\u003cbr/\u003e\n12. \u003ca data-clubhouse-guid=\"e588ccf1-ba03-ea43-c34c-9a9c8d1895ca\" href=\"https://www.espn.com/nba/team/_/name/chi/chicago-bulls\"\u003eChicago Bulls\u003c/a\u003e\u003cbr/\u003e\n13. \u003ca data-clubhouse-guid=\"15096a54-f015-c987-5ec8-55afedf6272f\" href=\"https://www.espn.com/nba/team/_/name/atl/atlanta-hawks\"\u003eAtlanta Hawks\u003c/a\u003e (via SAC)\u003cbr/\u003e\n14. \u003ca data-clubhouse-guid=\"8aef8547-32f5-0943-a1de-e734567674cc\" href=\"https://www.espn.com/nba/team/_/name/sa/san-antonio-spurs\"\u003eSan Antonio Spurs\u003c/a\u003e (via ATL)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMore:\u003c/strong\u003e \u003ca href=\"https://www.espn.com/nba/story/_/id/44938717/nba-draft-asset-rankings-stacking-all-30-teams-pick-collections\"\u003eDraft assets for every team\u003c/a\u003e | \u003ca href=\"https://www.espn.com/nba/story/_/id/45041634/2025-nba-draft-complete-order-all-59-picks\"\u003eFull draft order\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eHow good is the 2025 draft class?\u003c/h2\u003e\u003cp\u003eThis class is strong, led by a clear franchise-caliber talent at the top, Cooper Flagg, followed by a potential All-Star, Dylan Harper, at No. 2.\u003c/p\u003e\u003cp\u003eThere is some uncertainty after that, with a group of six players -- VJ Edgecombe, Ace Bailey, Kon Knueppel, Tre Johnson, Jeremiah Fears and Khaman Maluach -- expected to follow.\u003c/p\u003e\u003cp\u003eThe first round is considered deep, particularly with wings and forwards likely to dominate much of the remainder, interspersed with a handful of big men and guards.\u003c/p\u003e\u003cp\u003eHistorically, the best players in the draft rarely go in any specific order at the top. NBA executives expect this trend to continue this year, providing an opportunity for teams with elite talent evaluators and intel gatherers to distinguish themselves from those that weren\u0026#39;t paying close enough attention during the season and might easily become distracted in the predraft process.\u003c/p\u003e\u003cp\u003eThe second round of this year\u0026#39;s class took a significant hit, as at least 15 draftable players chose not to enter by the deadline or withdrew from consideration at the NCAA and international deadlines. Though there is talent to be found in the first half of the second round, especially in the 30s, many teams believe the value of their second-round picks has been severely diminished, even compared with last year, which was not seen as a robust draft.\u003c/p\u003e\u003cp\u003eFinancial implications surrounding the salary cap and luxury tax apron rules, which \u003ca href=\"https://www.espn.com/nba/story/_/id/45539214/nba-offseason-2025-five-biggest-storylines-12-players-fuel-wild-summer\"\u003ewill heavily impact this summer\u003c/a\u003e, are likely to cause numerous trades both days. \u003cem\u003e-- Givony\u003c/em\u003e\u003c/p\u003e\u003chr/\u003e\u003ch2\u003e\u003ca href=\"https://www.espn.com/nba/story/_/id/45493724/cooper-flagg-2025-nba-draft-scouting-report-rankings-stats-duke\"\u003eMore about projected No. 1 pick Cooper Flagg\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eFormer Duke star Cooper Flagg, a 6-foot-9 forward, has been considered the front-runner to be the top pick in the draft since August 2023, when he announced his decision to graduate high school a year early and enroll in college as a 17-year-old.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.espn.com/nba/story/_/id/45493724/cooper-flagg-2025-nba-draft-scouting-report-rankings-stats-duke\"\u003eRead ESPN\u0026#39;s coverage of the 18-year-old from Maine\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eThe biggest questions about this draft are...\u003c/h2\u003e\u003ch2\u003eWhich team will pick Bailey?\u003c/h2\u003e\u003cp\u003eWith Flagg and Harper seemingly locked in at Nos. 1 and 2, the real intrigue starts at No. 3. The 76ers are coming off a challenging season going from championship contenders to one of the worst teams in the NBA (24-58), and they face important decisions in a pivotal offseason.\u003c/p\u003e\u003cp\u003eDo the 76ers select Edgecombe or Bailey, or do they trade down a few spots and try to better position their salary books and pick up additional assets?\u003c/p\u003e\u003cp\u003eBailey \u003ca href=\"https://www.espn.com/nba/story/_/id/45541843/ace-bailey-cancels-76ers-visit-ahead-nba-draft\"\u003ecanceled a visit to the 76ers\u003c/a\u003e, sources told ESPN. He was slated to fly to Philadelphia on Friday for dinner with the team\u0026#39;s front office and a private workout, but elected to cancel Wednesday, according to the sources.\u003c/p\u003e\u003cp\u003eBailey\u0026#39;s predraft strategy has perplexed NBA teams over the past month, as he is currently the only U.S.-based prospect yet to visit any clubs. He has declined invitations from multiple teams in his draft range, which is considered to be anywhere from No. 3 to No. 8. Sources say Bailey\u0026#39;s camp has informed interested teams that they believe he is a top-three player in the draft, but also that he seeks a clear pathway to stardom, perhaps feeling comfortable that a franchise will trade up to get him at Nos. 3 or 4 should he drop.\u003c/p\u003e\u003cp\u003eThe Sixers have not ruled out selecting Bailey despite his refusal to visit, sources told ESPN.\u003c/p\u003e\u003cp\u003eTeams such as Washington, New Orleans and Brooklyn, drafting 6-7-8, are surely monitoring the situation closely, as they have ample minutes and opportunities to offer, potentially making them attractive to Bailey\u0026#39;s camp. \u003cem\u003e-- Givony and Shams Charania\u003c/em\u003e\u003c/p\u003e\u003ch2\u003eHow is the projected talent-rich top of the 2026 draft affecting this year\u0026#39;s, if it is at all?\u003c/h2\u003e\u003cp\u003eWith 30 of the top 40 picks in the draft concentrated in the hands of just 12 teams, we\u0026#39;re expecting significant movement on both nights of the draft as clubs look to position their books and maintain flexibility with roster spots, contract guarantees and salary and luxury tax considerations.\u003c/p\u003e\u003cp\u003eEarly on, teams are reporting the market for selections outside the top 10 has proved to be softer than anticipated, with more franchises open to moving picks and players than ones looking for them. The \u003ca data-clubhouse-guid=\"547fc042-3e02-4795-9637-9ab84322b625\" href=\"https://www.espn.com/nba/team/_/name/ind/indiana-pacers\"\u003eIndiana Pacers\u003c/a\u003e are swapping the No. 23 selection to reacquire next year\u0026#39;s first-rounder, giving them added flexibility this summer to aggregate more picks in a bigger trade without violating the NBA\u0026#39;s Stepien rule.\u003c/p\u003e\u003cp\u003eThings can, and likely will, change on draft night once teams are on the clock and get to see who is on the board at different slots.\u003c/p\u003e\u003cp\u003eThough the 2026 draft is loaded at the top -- with several potential franchise-caliber talents available in \u003ca href=\"https://www.espn.com/college-sports/basketball/recruiting/player/_/id/250592/darryn-peterson\"\u003eDarryn Peterson\u003c/a\u003e, \u003ca href=\"https://www.espn.com/college-sports/basketball/recruiting/player/_/id/254848/aj-dybantsa\"\u003eA.J. Dybantsa\u003c/a\u003e, \u003ca href=\"https://www.espn.com/college-sports/basketball/recruiting/player/_/id/250590/cameron-boozer\"\u003eCameron Boozer\u003c/a\u003e and \u003ca href=\"https://www.espn.com/college-sports/basketball/recruiting/player/_/id/256887/nate-ament\"\u003eNate Ament\u003c/a\u003e -- teams still have a lot to learn about the rest of the lottery and first round, as this is not considered a particularly deep high school senior class currently enrolling in college, nor the most exciting (2007-born) group of international players about to become NBA draft eligible for the first time.\u003c/p\u003e\u003cp\u003eWith that said, a significant number of players elected to either not enter this year\u0026#39;s draft or withdrew at the deadline, adding quite a bit of \u0026#34;older\u0026#34; depth in the college ranks that doesn\u0026#39;t normally exist. Teams will have to weigh how to value future picks with that in mind, something that has become a joint venture between traditional scouts, strategy analysts and analytics departments. \u003cem\u003e-- Givony\u003c/em\u003e\u003c/p\u003e\u003ch2\u003eThe Nets have five picks inside the top 40. How will they approach this draft?\u003c/h2\u003e\u003cp\u003e\u003cimg alt=\"\" src=\"https://a.espncdn.com/combiner/i?img=/i/teamlogos/nba/500/bkn.png\u0026amp;h=110\u0026amp;w=110\" width=\"31\"/\u003e\u003c/p\u003e\u003cp\u003eBrooklyn has been one of the most active teams in the lead-up to the draft out of necessity. With the No. 8, No. 19, No. 26, No. 27 and No. 36 picks, the Nets have the levers and the incentive to optimize their return on draft night, considering it\u0026#39;s unlikely they\u0026#39;ll roster five rookies next season. They are also the only team with meaningful salary cap space, giving them optimal flexibility to not only make their own moves, but also to facilitate things for other teams.\u003c/p\u003e\u003cp\u003eWhat exactly that means for the Nets is still playing out in real time behind the scenes. Can they combine their picks to move up from No. 8? Do they select at No. 8 and instead try to move from No. 19 into the late lottery? Do they use both, and then look to trade some of the later selections? The number of picks they have in different areas of the draft has allowed them to cast a wide net (no pun intended) and bring in the majority of prospects for meetings and workouts.\u003c/p\u003e\u003cp\u003eNo matter what it ultimately does, Brooklyn is viewed by player agents as a desirable landing spot, due to the developmental minutes it has available that not many other teams can concretely offer. The Nets are looking through a long-term lens and prioritizing talent over NBA readiness, with a strong 2026 lottery class on the horizon before they start angling to flip the switch toward competing for the postseason. \u003cem\u003e-- Woo\u003c/em\u003e\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eHow do the prospects rank?\u003c/h2\u003e\u003cp\u003eFor a full list of the top 100 prospects (including strengths and weaknesses), \u003ca href=\"https://www.espn.com/nba/story/_/id/41662748/2025-nba-draft-big-board-rankings-top-100-prospects-players\"\u003echeck out the complete rankings\u003c/a\u003e compiled by Givony and Woo.\u003c/p\u003e\u003cp\u003eAny suspense as far as Flagg was concerned was put to rest on lottery night, with the Mavericks shockingly winning the right to select him.\u003c/p\u003e\u003cp\u003eExpect Flagg to be up for the challenge, as he has held down the top spot on our draft board largely unchallenged, and continues to get better at an impressive rate. He\u0026#39;ll be an impactful defender and versatile option for Dallas immediately, with room to grow and increase his comfort as a scorer and playmaker over time. At this point, the question is more about what heights he\u0026#39;ll ultimately reach, with a promising future awaiting.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eESPN\u0026#39;s top 10 prospects:\u003c/strong\u003e\u003cbr/\u003e\n1. Cooper Flagg, SF/PF, Duke\u003cbr/\u003e\n2. Dylan Harper, PG/SG, Rutgers\u003cbr/\u003e\n3. Ace Bailey, SG/SF, Rutgers\u003cbr/\u003e\n4. VJ Edgecombe, SG, Baylor\u003cbr/\u003e\n5. Tre Johnson, SG, Texas\u003cbr/\u003e\n6. Kon Knueppel, SG/SF, Duke\u003cbr/\u003e\n7. Khaman Maluach, C, Duke\u003cbr/\u003e\n8. Jeremiah Fears, PG, Oklahoma\u003cbr/\u003e\n9. Noa Essengue, PF, Ratiopharm Ulm (Germany)\u003cbr/\u003e\n10. Kasparas Jakucionis, PG, Illinois\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMore:\u003c/strong\u003e \u003ca href=\"https://www.espn.com/nba/story/_/id/44888875/nba-draft-2025-projecting-30-best-prospects\"\u003eKevin Pelton\u0026#39;s top 30 prospects\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003ch2\u003e\u003ca href=\"https://www.espn.com/nba/story/_/id/45559441/2025-nba-mock-draft-latest-first-second-round-predictions-all-59-picks\"\u003eLatest mock draft and intel\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eGivony and Woo will be tracking news and team and player information until the Mavericks go on the clock Wednesday, with this \u003ca href=\"https://www.espn.com/nba/story/_/id/45559441/2025-nba-mock-draft-latest-first-second-round-predictions-all-59-picks\"\u003eversion of the mock draft\u003c/a\u003e undergoing updates until draft time, based on our latest intel.\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"\" src=\"https://a.espncdn.com/combiner/i?img=/i/teamlogos/nba/500/mia.png\u0026amp;h=110\u0026amp;w=110\" width=\"31\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.espn.com/mens-college-basketball/player/_/id/4896372/walter-clayton-jr\"\u003eWalter Clayton Jr.\u003c/a\u003e\u0026#39;s landing spot?:\u003c/strong\u003e Clayton has showcased his dynamic shotmaking in workouts and worked his way up boards in a first round that has shaped up somewhat light on point guard options. Considering the Heat\u0026#39;s need for a proper point guard and the way Clayton seems to fit their mold, this fit makes sense on paper.\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"\" src=\"https://a.espncdn.com/combiner/i?img=/i/teamlogos/nba/500/phx.png\u0026amp;h=110\u0026amp;w=110\" width=\"31\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSuns\u0026#39; plans with their new pick at No. 10?:\u003c/strong\u003e With the Suns desperately needing to upgrade their frontcourt -- especially after losing their starting power forward in Kevin Durant -- Collin Murray-Boyles is likely someone the team will consider heavily if they keep the pick.\u003c/p\u003e\u003chr/\u003e\u003ch2\u003e\u003ca href=\"https://www.espn.com/nba/story/_/id/45506725/2025-nba-draft-superlatives-skills-traits-best-players-shooting-defense-more\"\u003eWho are the top prospects by skill\u003c/a\u003e?\u003c/h2\u003e\u003cp\u003eWoo shares his list of the top prospects based on skills and traits in 20 categories. Here are notable names who stand out:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest pull-up shooter: Ace Bailey, F, Rutgers\u003c/strong\u003e\u003cbr/\u003e\nNo player in this draft class is more dangerous in a tight window than Bailey, whose ability to rise and fire over defenders at difficult angles and knock down tough shots off the bounce make him a tantalizing scoring prospect.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest intangibles: Khaman Maluach, C, Duke\u003c/strong\u003e\u003cbr/\u003e\nMaluach is expected to be the first center off the board because of his impact for Duke as one of college basketball\u0026#39;s premier paint deterrents, but his appeal as an NBA prospect also has much to do with who he is as a person and what he\u0026#39;ll bring to a locker room.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest rim protector: Joan Beringer, C, Cedevita Olimpija (Adriatic League)\u003c/strong\u003e\u003cbr/\u003e\nBeringer\u0026#39;s draft stock skyrocketed this season as scouts gradually made the trip to see him in Europe, as his excellent defensive abilities and shot-blocking chops at 18 years old were on display.\u003c/p\u003e\u003cdiv data-behavior=\"video_scroll\"\u003e\u003cfigure data-video=\"watch,640,360,45452519,url-https://watch.auth.api.espn.com/video/auth/brightcove/4ff6a5c7-4bbb-43bc-9b10-6f92ae8d5ec4/asset?UMADPARAMreferer=https://www.espn.com/video/clip?id=45452519,poster-https://media.video-cdn.espn.com/motion/2025/0604/dm_250604_Joan_Beringer_NBA_draft_profile/dm_250604_Joan_Beringer_NBA_draft_profile.jpg\" data-cerebro-id=\"6840c8197e8e6605ce42e35d\" data-title=\"Joan Beringer\u0026#39;s NBA draft profile\" data-source=\"espn\"\u003e\u003cpicture\u003e\u003csource data-srcset=\"https://a3.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0604%2Fdm_250604_Joan_Beringer_NBA_draft_profile%2Fdm_250604_Joan_Beringer_NBA_draft_profile.jpg\u0026amp;w=640\u0026amp;h=360\u0026amp;cquality=80\u0026amp;format=jpg\" media=\"(min-width: 376px)\"/\u003e\u003csource data-srcset=\"https://a3.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0604%2Fdm_250604_Joan_Beringer_NBA_draft_profile%2Fdm_250604_Joan_Beringer_NBA_draft_profile.jpg\u0026amp;w=335\u0026amp;cquality=80, https://a3.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0604%2Fdm_250604_Joan_Beringer_NBA_draft_profile%2Fdm_250604_Joan_Beringer_NBA_draft_profile.jpg\u0026amp;w=670\u0026amp;cquality=40\u0026amp;format=jpg 2x\" media=\"(max-width: 375px)\"/\u003e\u003c/picture\u003e\u003cspan data-id=\"45452519\"\u003eplay\u003c/span\u003e\u003cfigcaption\u003e\u003cp\u003e1:11\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003eJoan Beringer\u0026#39;s NBA draft profile\u003c/p\u003e\u003cp\u003eCheck out some of the highlights that have made Joan Beringer a top NBA draft prospect.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003chr/\u003e\u003ch2\u003e\u003ca href=\"https://www.espn.com/nba/story/_/id/45464827/2025-nba-draft-player-prospect-comps-14-projected-lottery-picks-cooper-flagg\"\u003ePro player comps: Edgecombe, Johnson, more\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eThe goal here isn\u0026#39;t to draw a perfect comparison for each of the 14 projected lottery picks -- we\u0026#39;d be guaranteed to be wrong. This exercise serves as a lens to think about a prospect\u0026#39;s future role, examine his range of potential outcomes, and consider which areas of development are most critical to long-term success.\u003c/p\u003e\u003cp\u003eHere are a couple of notable comps and excerpts from Woo\u0026#39;s recent story:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eVJ Edgecombe, SG, Baylor\u003c/strong\u003e\u003cbr/\u003e\n\u003cstrong\u003eHigh end:\u003c/strong\u003e Victor Oladipo\u003cbr/\u003e\n\u003cstrong\u003eLow end:\u003c/strong\u003e \u003ca data-player-guid=\"38031c4c-26bc-3695-bb1c-e61da33b57df\" href=\"https://www.espn.com/nba/player/_/id/4433218/jaden-ivey\"\u003eJaden Ivey\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe elevator pitch with Edgecombe centers largely around the possibility that he develops into a capable on-ball creator, where his speed, strength and elite explosiveness could best create problems for defenses. Getting him the reps he needs to make that leap will be step one wherever he lands, but the downhill, hyperathletic slashing mold he fits makes Oladipo a valid point of comparison.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTre Johnson, SG, Texas\u003c/strong\u003e\u003cbr/\u003e\n\u003cstrong\u003eHigh end:\u003c/strong\u003e Michael Redd\u003cbr/\u003e\n\u003cstrong\u003eLow end:\u003c/strong\u003e \u003ca data-player-guid=\"55617f6a-a1fb-326e-8c71-31211dcad955\" href=\"https://www.espn.com/nba/player/_/id/4432174/cam-thomas\"\u003eCam Thomas\u003c/a\u003e, but taller\u003c/p\u003e\u003cp\u003eJohnson is a fairly simple prospect to understand. He\u0026#39;s likely going to shoot it well; he\u0026#39;s probably going to shoot a lot; and whatever else he ends up giving his future team will be gravy, not necessarily baked into their expectations. If Johnson can come close to the type of career Redd put together (although Redd\u0026#39;s peak in the early 2000s was eventually hampered by serious knee injuries in 2009), that would be a pretty outstanding result, and there are some similar components here.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMore:\u003c/strong\u003e \u003ca href=\"https://www.espn.com/nba/story/_/id/44504404/jayson-tatum-scottie-pippen-kawhi-leonard-best-nba-comparisons-duke-cooper-flagg-draft-no-1-pick\"\u003eFlagg\u0026#39;s best NBA comps: Tatum, Pippen and Kawhi\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eESPN Research: Five things to know about this draft\u003c/h2\u003e\u003cp\u003e1. Assuming they make the pick, the Mavericks will become the fourth team in the modern draft era (since 1966) to make the No. 1 pick in the draft within a year of reaching the NBA Finals. The others: The Bulls won the NBA Finals in 1998 and drafted Elton Brand with the No. 1 pick in 1999. The Lakers won the NBA Finals in 1982 and drafted James Worthy with the No. 1 pick in 1982. The Trail Blazers won the NBA Finals in 1977 and drafted Mychal Thompson with the No. 1 pick in 1978.\u003c/p\u003e\u003cp\u003e2. Flagg, who reclassified, will be 18 years and 186 days old on draft night, making him the second-youngest No. 1 pick in draft history, behind \u003ca data-player-guid=\"1f6592b3-ff53-d321-8dc5-6038d48c1786\" href=\"https://www.espn.com/nba/player/_/id/1966/lebron-james\"\u003eLeBron James\u003c/a\u003e (18 years, 178 days old) in 2003. Also, Flagg will give Duke its fifth player selected first in the draft, the most top selections of any school. The Blue Devils already had the most with four: Elton Brand (1999), \u003ca data-player-guid=\"4fb2e3fc-ad79-d9bc-ddd9-bbb09f29ead3\" href=\"https://www.espn.com/nba/player/_/id/6442/kyrie-irving\"\u003eKyrie Irving\u003c/a\u003e (2011), \u003ca data-player-guid=\"34e5ec5d-10b3-ba59-2ba1-3a3be9a1be22\" href=\"https://www.espn.com/nba/player/_/id/4395628/zion-williamson\"\u003eZion Williamson\u003c/a\u003e (2019), \u003ca data-player-guid=\"b121848a-30d3-3fad-b6ab-74bf04005533\" href=\"https://www.espn.com/nba/player/_/id/4432573/paolo-banchero\"\u003ePaolo Banchero\u003c/a\u003e (2022).\u003c/p\u003e\u003cp\u003e3. Based on \u003ca href=\"https://www.espn.com/nba/story/_/id/45559441/2025-nba-mock-draft-latest-first-second-round-predictions-all-59-picks\"\u003eESPN\u0026#39;s latest mock draft\u003c/a\u003e, the first eight picks are projected to be freshmen. If that happens, it will mark the most consecutive freshmen selected in a row at any point in a single draft. The previous most came in 2017, when the first seven picks were freshmen. In all, 12 of the 14 lottery picks are projected to be freshmen, which would set a record for most selected in the lottery era. It would mark the third time double-digit freshmen were picked in the lottery (11 in 2017 and 10 in 2018).\u003c/p\u003e\u003cp\u003e4. Kentucky does not have a player projected to go in Round 1, which would snap a streak of 15 consecutive drafts with a first-round pick, the longest in the modern draft era (since 1966). The last time Kentucky didn\u0026#39;t have a player selected in the first round was in 2009, John Calipari\u0026#39;s final season at Memphis before taking over at Kentucky. Cooper Flagg had yet to turn 3 years old.\u003c/p\u003e\u003cp\u003e5. Based on \u003ca href=\"https://www.espn.com/nba/story/_/id/45559441/2025-nba-mock-draft-latest-first-second-round-predictions-all-59-picks\"\u003eESPN\u0026#39;s latest mock draft\u003c/a\u003e, five Frenchmen are projected to be selected in the first round (Joan Beringer, Noa Essengue, Nolan Traoré, Noah Penda and Stanford\u0026#39;s \u003ca data-player-guid=\"558c3f2b-6f02-3b7f-a7b1-136feecad980\" href=\"https://www.espn.com/mens-college-basketball/player/_/id/4898371/maxime-raynaud\"\u003eMaxime Raynaud\u003c/a\u003e). This comes one year after four players representing France were selected in the 2024 draft, which tied Canada (2019) for the most players from a non-U.S. country taken in the first round of a single draft. France has had at least one player selected in the first round in each of the past three NBA drafts, including the past two No. 1 picks.\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003cem\u003eJonathan Givony is an NBA draft expert and the founder and co-owner of DraftExpress.com, a private scouting and analytics service used by NBA, NCAA and international teams.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eJeremy Woo is an NBA analyst specializing in prospect evaluation and the draft. He was previously a staff writer and draft insider at Sports Illustrated.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "19 min read",
  "publishedTime": "2025-06-23T11:02:00Z",
  "modifiedTime": null
}
