{
  "id": "5eef2d9b-8a24-4aeb-adf4-c856666d9333",
  "title": "Four Verts: Here's to hoping the NFL on Christmas is a no-buffer zone",
  "link": "https://sports.yahoo.com/four-verts-netflix-needs-to-get-its-act-together-for-nfl-christmas-and-patriots-have-found-another-franchise-qb-193349339.html",
  "description": "We implore Netflix to not let Tyson-Paul's streaming issues happen with the NFL, laugh at the Jaguars and worry for the 49ers' season.",
  "author": "Yahoo Sports",
  "published": "Wed, 20 Nov 2024 19:33:49 GMT",
  "source": "https://sports.yahoo.com/rss/",
  "categories": [
    "Sports"
  ],
  "byline": "Charles McDonald",
  "length": 9641,
  "excerpt": "In this week's Four Verts, Charles McDonald implores Netflix to not let Tyson-Paul happen again with the NFL, laughs at how badly the Jaguars got beat by the...",
  "siteName": "Yahoo Sports",
  "favicon": "",
  "text": "It’s (kind of) getting cold outside, which means it’s time to get cozy and gear up for the holiday season. The NFL is going to hold us down for the next few weeks before the playoffs start, giving us a good chance to slow down and focus on the important things around us — like Netflix needing to nail Christmas Day after a terrible showing with the Jake Paul-Mike Tyson fight.Netflix better clean this up before the NFL shows up on ChristmasThis is a no-judging zone. I promise. As someone who held a watch party in their apartment for the “fight” between Jake Paul and Mike Tyson, I am in no place to judge how people decided to spend their precious electricity bill on Friday night.However, I will consider myself, and everyone else who sat through that wretched final card, an expert on streaming things from Netflix. We endured a disaster of near-biblical proportions while trying to feed on our gruel from the digital pig trough. The stream obviously couldn’t handle the load of people trying to come in and see the latest celebrity boxing match, which is a good time to shout from the rooftops: THE NFL IS COMING TO NETFLIX ON CHRISTMAS!Right now, this looks like a disaster waiting to happen. At times, it felt like Netflix was broadcasting this fight through the screen of a Game Boy Color. And that was on a Friday night, when there were still other things to watch and people were outside enjoying the start of their weekends. Netflix's next entry into the streaming wars will feature four of the league's marquee teams playing on its service.If the Jake Paul-Mike Tyson fight is any indication, Netflix has some issues to clean up before it streams NFL games on Christmas. (Amber Matsumoto/Yahoo Sports)The Chiefs will be traveling to Pittsburgh to take on the Steelers in a game that will help decide the top of the AFC’s playoff picture. The Ravens will be taking on the Texans in another game between two of the more popular and entertaining teams in the league right now. Oh, yeah, Beyoncé will be performing at halftime of Ravens-Texans, too. This is the perfect storm of intense viewership that will test Netflix and its capacity to hold together what will be the most-watched live entity it has ever had before.For all of us who will be dodging time from our families to hide and watch some intensely important NFL games, this stream is our lifeforce. And if it goes the way of the Tyson-Paul pillow fight, we’re all in for a world of mild small talk conversations that are never quite as bad as you imagine them to be in your head. The horror. The audacity. Get it right, Netflix. This is the only reason to log on to that streaming service anyways.New England looks to have a budding superstar at quarterbackThe Patriots might have done it again. Drake Maye has hit the ground running since he took over for Jacoby Brissett as the team’s starting quarterback this fall. Maye seems to be improving week by week, and his elite athleticism paired with his understanding of what’s being asked of him in the Patriots' offense has rejuvenated this franchise after bumbling around at quarterback in the years following Tom Brady’s departure to Tampa Bay.This is different from what Mac Jones accomplisedh as the Patriots' starter when he was a Pro Bowler as a rookie in 2021. This feels like something that has real sustaining power.There were people who were concerned about Maye’s ability to function behind a shaky offensive line, but he’s far better than Brissett was during his time as the starter. Maye’s expected points added per dropback (0.04) is dramatically improved from Brissett’s (-0.19). The Patriots' success rate on dropbacks is 7 percentage points higher with Maye and Maye is inviting less pressure and getting sacked at a lower rate. For all the hand-wringing regarding putting Maye into the lineup, he’s absolutely given the team a better chance to win than its prior quarterback situation.Even in the bleak atmosphere that is the Patriots’ offense, Maye has produced explosive plays and run the offense on time. He’s not scared to make tough throws under pressure and has the arm strength to make top 1% type throws that most quarterbacks can’t even dream of. This is high praise. Maye’s style feels somewhere between a cross between Josh Allen and Justin Herbert’s. He has the wherewithal to stick in the pocket and run plays as called, but the overwhelming athleticism and arm strength to make some unbelievable plays off-script.In a world where it seems like so many teams have dire quarterback situations, having a QB with legitimate MVP talent is a godsend. Allen and Tua Tagovailoa are in the division and now they have a quarterback who will be capable of leading elite offenses if the Patriots can continue to build out the supporting casts.Sorry to everyone who was sick of the Patriots for 20 years. It seems like they’ll be back sooner rather than later with another inevitable quarterback talent at the helm.Jaguars? Come onAlright. The Lions and the Jaguars are clearly in different universes when it comes to what they’re expecting out of their seasons, but damn, 52-6!? Even with Detroit being the best team in the league, it’s still hard to put up this many points while allowing so few points. Even with Mac Jones in the lineup and a bad defense on the other side, there’s no reason to get beat this badly.The Jags got beat so thoroughly that we’re going to run through some numbers from this game to get a glimpse at how horrifying it was at the end.The Lions averaged 5.78 points per drive. They scored a touchdown on their first seven drives of the game. It was 49-6 at the end of the third quarter. Stand up, Jaguars!Detroit averaged 13.6 net yards per attempt. For reference, the league leader in this category is the Baltimore Ravens, who are 8.6 net yards per attempt for the season. That’s a 58% increase on the league leader in a one-game sample size.The Lions earned 36 first downs on 76 plays without the help of penalties. They gained two first downs from penalties, giving them 38 first downs on 76 plays for the day. Fifty percent of the time they were on the field, they were gaining a first down. If you remove those penalty first downs and stick with just what they earned through their own merits, they converted a first down on 47.4% of their plays. The Ravens also lead that category for the season with 34.4% of their plays going for first downs.According to TruMedia, Jared Goff averaged 1.04 expected points added per dropback. That means basically every single time the Lions called a passing play, they gained a full point of value. For every seven Goff dropbacks, the Jaguars allowed one touchdown worth of value — which kind of tracks when you remember they gave up SEVEN STRAIGHT TOUCHDOWN DRIVES to start the game.44.2% of the Lions' rushing plays went for 5 or more yards. They physically displaced the Jaguars defensive line over and over again.That’s not NFL-quality play from the Jaguars. Yeah, their season is over and Doug Pederson is toast, but fight back next time.49ers do not look like themselvesAfter falling to 5-5 at the hands of the Seahawks, the 49ers' season looks like it might potentially be on life support. Due to a crowded NFC West this year, the 49ers find themselves at the bottom of the division, boasting the same record as the Rams and Seahawks while the Cardinals hold a tight one-game lead on the rest of the division with a 6-4 record. The Niners' season certainly is not over, but they might not have what it takes as currently constructed to get to the playoffs, let alone go on a run in the postseason.One thing that is working about this offense is Brock Purdy. In the midst of losing Brandon Aiyuk and not having Christian McCaffrey at the peak of his powers, Purdy has performed admirably. The 49ers still rank in the top five of success rate on dropbacks and expected points added per dropback as the effectiveness of their running game has dwindled. They ran the ball better against the Seahawks than they have in recent weeks even though they’re still missing the explosives on the ground that made them such a dangerous offense. Still, Purdy along with George Kittle, Deebo Samuel Sr. and Jauan Jennings have done enough in the passing game to keep them stable and moving forward in the right direction.The defense has also taken a step back from recent seasons where the group isn't the dominant unit that people had grown accustomed to. The Niners still have ace defenders in Fred Warner, Nick Bosa and Deommodore Lenoir on their roster, but they’re a gettable defense in certain circumstances. Overall, they’re just a middle-of-the-pack defense that has some high-end talent. Enough to win games, but not impenetrable anymore.Through attrition and perhaps some roster management strategies, the 49ers don’t have the big shield and sword that they normally do when they’re trying to stay on top of the NFC. Purdy and the passing game will keep them in these games, but their upcoming schedule will prove difficult as they try and fight to the end of the season to make the wild-card round. Getting a first-round bye is certainly off the table with the way that Detroit is performing.The 49ers will close the season with games against the Packers, Bills, Bears, Rams, Dolphins, Lions and Cardinals. W-H-E-W. That’s a tough run for any team, let alone a team that is fragmented and currently at the bottom of its division, however slim that deficit actually is. The 49ers might find themselves on the outside looking in at the playoffs — and not making at least the NFC championship game — for the first time since 2020.",
  "image": "https://s.yimg.com/ny/api/res/1.2/hl5.XobAKdHh.PzaocYzJg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02Nzk7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-11/996024e0-a772-11ef-bf57-ac5be0839c90",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-wf-sticky-boundary=\"caas-body-section\" data-wf-sticky-offset=\"165px   10px\" data-wf-sticky-target=\".caas-share-buttons\"\u003e\u003cp\u003eIt’s (kind of) getting cold outside, which means it’s time to get cozy and gear up for the holiday season. The NFL is going to hold us down for the next few weeks before the playoffs start, giving us a good chance to slow down and focus on the important things around us — like Netflix needing to nail Christmas Day after a terrible showing with the \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://sports.yahoo.com/with-jake-paul-vs-mike-tyson-all-65-million-viewers-got-what-we-deserved-130004915.html\" data-ylk=\"slk:Jake Paul-Mike Tyson fight;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003eJake Paul-Mike Tyson fight\u003c/a\u003e.\u003c/p\u003e\u003ch2 id=\"netflix-better-clean-this-up-before-the-nfl-shows-up-on-christmas\"\u003eNetflix better clean this up before the NFL shows up on Christmas\u003c/h2\u003e\u003cp\u003eThis is a no-judging zone. I promise. As someone who held a watch party in their apartment for the \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://sports.yahoo.com/jake-pauls-fight-with-mike-tyson-wasnt-all-bad--at-least-we-got-to-complain-171422389.html\" data-ylk=\"slk:“fight” between Jake Paul and Mike Tyson;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e“fight” between Jake Paul and Mike Tyson\u003c/a\u003e, I am in no place to judge how people decided to spend their precious electricity bill on Friday night.\u003c/p\u003e\u003cp\u003eHowever, I will consider myself, and everyone else who sat through that wretched final card, an expert on streaming things from Netflix. We endured a disaster of near-biblical proportions while trying to feed on our gruel from the digital pig trough. The stream obviously couldn’t handle the load of people trying to come in and see the latest celebrity boxing match, which is a good time to shout from the rooftops: THE \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://sports.yahoo.com/beyond-money-nfl-jumped-at-christmas-games-on-netflix-for-2-key-reasons-013346467.html\" data-ylk=\"slk:NFL IS COMING TO NETFLIX;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003eNFL IS COMING TO NETFLIX\u003c/a\u003e ON CHRISTMAS!\u003c/p\u003e\u003cp\u003eRight now, this looks like a disaster waiting to happen. At times, it felt like Netflix was broadcasting this fight through the screen of a \u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://en.wikipedia.org/wiki/Game_Boy_Color\" rel=\"sponsored\" target=\"_blank\" data-ylk=\"slk:Game Boy Color;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eGame Boy Color\u003c/a\u003e. And that was on a Friday night, when there were still other things to watch and people were outside enjoying the start of their weekends. Netflix\u0026#39;s next entry into the streaming wars will feature four of the league\u0026#39;s marquee teams playing on its service.\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"If the Jake Paul-Mike Tyson fight is any indication, Netflix has some issues to clean up before it streams NFL games on Christmas. (Amber Matsumoto/Yahoo Sports)\" src=\"https://s.yimg.com/ny/api/res/1.2/GHXaVaRL1iI9wSFxyaXRmw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MztjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2024-11/996024e0-a772-11ef-bf57-ac5be0839c90\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cfigcaption\u003eIf the Jake Paul-Mike Tyson fight is any indication, Netflix has some issues to clean up before it streams NFL games on Christmas. (Amber Matsumoto/Yahoo Sports)\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eThe Chiefs will be traveling to Pittsburgh to take on the Steelers in a game that will help decide the \u003ca data-i13n=\"cpos:5;pos:1\" href=\"https://sports.yahoo.com/nfl-power-rankings-entering-week-12-can-bills-or-steelers-take-no-1-seed-from-chiefs-043741176.html\" data-ylk=\"slk:top of the AFC’s playoff picture;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003etop of the AFC’s playoff picture\u003c/a\u003e. The Ravens will be taking on the Texans in another game between two of the more popular and entertaining teams in the league right now. Oh, yeah, \u003ca data-i13n=\"cpos:6;pos:1\" href=\"https://sports.yahoo.com/beyonce-to-perform-at-halftime-of-texans-ravens-on-christmas-day-on-netflix-053009544.html\" data-ylk=\"slk:Beyoncé will be performing at halftime of Ravens-Texans, too;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003eBeyoncé will be performing at halftime of Ravens-Texans, too\u003c/a\u003e. This is the perfect storm of intense viewership that will test Netflix and its capacity to hold together what will be the most-watched live entity it has ever had before.\u003c/p\u003e\u003cp\u003eFor all of us who will be dodging time from our families to hide and watch some intensely important NFL games, this stream is our lifeforce. And if it goes the way of the Tyson-Paul pillow fight, we’re all in for a world of mild small talk conversations that are never quite as bad as you imagine them to be in your head. The horror. The audacity. Get it right, Netflix. This is the only reason to log on to that streaming service anyways.\u003c/p\u003e\u003ch2 id=\"new-england-looks-to-have-a-budding-superstar-at-quarterback\"\u003eNew England looks to have a budding superstar at quarterback\u003c/h2\u003e\u003cp\u003eThe Patriots might have done it again. Drake Maye has hit the ground running since he took over for Jacoby Brissett as the team’s starting quarterback this fall. Maye seems to be improving week by week, and his elite athleticism paired with his understanding of what’s being asked of him in the Patriots\u0026#39; offense has rejuvenated this franchise after bumbling around at quarterback in the years following Tom Brady’s departure to Tampa Bay.\u003c/p\u003e\u003cp\u003eThis is different from what Mac Jones accomplisedh as the Patriots\u0026#39; starter when he was a Pro Bowler as a rookie in 2021. This feels like something that has real sustaining power.\u003c/p\u003e\u003cp\u003eThere were people who were concerned about Maye’s ability to function behind a shaky offensive line, but he’s far better than Brissett was during his time as the starter. Maye’s expected points added per dropback (0.04) is dramatically improved from Brissett’s (-0.19). The Patriots\u0026#39; success rate on dropbacks is 7 percentage points higher with Maye and Maye is inviting less pressure and getting sacked at a lower rate. For all the hand-wringing regarding putting Maye into the lineup, he’s absolutely given the team a better chance to win than its prior quarterback situation.\u003c/p\u003e\u003cp\u003eEven in the bleak atmosphere that is the Patriots’ offense, Maye has produced explosive plays and run the offense on time. He’s not scared to make tough throws under pressure and has the arm strength to make top 1% type throws that most quarterbacks can’t even dream of. This is high praise. Maye’s style feels somewhere between a cross between Josh Allen and Justin Herbert’s. He has the wherewithal to stick in the pocket and run plays as called, but the overwhelming athleticism and arm strength to make some unbelievable plays off-script.\u003c/p\u003e\u003cp\u003eIn a world where it seems like \u003cem\u003eso\u003c/em\u003e many teams have dire quarterback situations, having a QB with legitimate MVP talent is a godsend. Allen and Tua Tagovailoa are in the division and now they have a quarterback who will be capable of leading elite offenses if the Patriots can continue to build out the supporting casts.\u003c/p\u003e\u003cp\u003eSorry to everyone who was sick of the Patriots for 20 years. It seems like they’ll be back sooner rather than later with another inevitable quarterback talent at the helm.\u003c/p\u003e\u003ch2 id=\"jaguars-come-on\"\u003eJaguars? Come on\u003c/h2\u003e\u003cp\u003eAlright. The Lions and the Jaguars are clearly in different universes when it comes to what they’re expecting out of their seasons, but damn, 52-6!? Even with Detroit being the best team in the league, it’s still hard to put up this many points while allowing so few points. Even with Mac Jones in the lineup and a bad defense on the other side, there’s no reason to get beat this badly.\u003c/p\u003e\u003cp\u003eThe Jags got beat so thoroughly that we’re going to run through some numbers from this game to get a glimpse at how horrifying it was at the end.\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eThe Lions averaged 5.78 points per drive. They scored a touchdown on their first seven drives of the game. It was 49-6 at the end of the third quarter. Stand up, Jaguars!\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eDetroit averaged 13.6 net yards per attempt. For reference, the league leader in this category is the Baltimore Ravens, who are 8.6 net yards per attempt for the season. That’s a 58% increase on the \u003cem\u003eleague leader\u003c/em\u003e in a one-game sample size.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eThe Lions earned 36 first downs on 76 plays without the help of penalties. They gained two first downs from penalties, giving them 38 first downs on 76 plays for the day. Fifty percent of the time they were on the field, they were gaining a first down. If you remove those penalty first downs and stick with just what they earned through their own merits, they converted a first down on 47.4% of their plays. The Ravens also lead that category for the season with 34.4% of their plays going for first downs.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eAccording to TruMedia, Jared Goff averaged 1.04 expected points added per dropback. That means basically every single time the Lions called a passing play, they gained a full point of value. For every seven Goff dropbacks, the Jaguars allowed one touchdown worth of value — which kind of tracks when you remember they gave up SEVEN STRAIGHT TOUCHDOWN DRIVES to start the game.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e44.2% of the Lions\u0026#39; rushing plays went for 5 or more yards. They physically displaced the Jaguars defensive line over and over again.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThat’s not NFL-quality play from the Jaguars. Yeah, their season is over and \u003ca data-i13n=\"cpos:7;pos:1\" href=\"https://sports.yahoo.com/nfl-winners-and-losers-doug-pederson-was-once-a-coaching-star-what-happened-212137132.html\" data-ylk=\"slk:Doug Pederson is toast;cpos:7;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003eDoug Pederson is toast\u003c/a\u003e, but fight back next time.\u003c/p\u003e\u003ch2 id=\"49ers-do-not-look-like-themselves\"\u003e49ers do not look like themselves\u003c/h2\u003e\u003cp\u003eAfter falling to 5-5 at the hands of the Seahawks, the \u003ca data-i13n=\"cpos:8;pos:1\" href=\"https://sports.yahoo.com/a-stunning-loss-to-seahawks-pushes-49ers-and-kyle-shanahan-into-another-uncomfortable-coaching-crossroads-054403289.html\" data-ylk=\"slk:49ers\u0026#39; season looks like it might potentially be on life support;cpos:8;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e49ers\u0026#39; season looks like it might potentially be on life support\u003c/a\u003e. Due to a crowded NFC West this year, the 49ers find themselves at the bottom of the division, boasting the same record as the Rams and Seahawks while the Cardinals hold a tight one-game lead on the rest of the division with a 6-4 record. The Niners\u0026#39; season certainly is not over, but they might not have what it takes as currently constructed to get to the playoffs, let alone go on a run in the postseason.\u003c/p\u003e\u003cp\u003eOne thing that is working about this offense is Brock Purdy. In the midst of losing Brandon Aiyuk and \u003ca data-i13n=\"cpos:9;pos:1\" href=\"https://sports.yahoo.com/christian-mccaffreys-return-benefitted-49ers-in-less-obvious-way--but-their-issues-are-far-from-fixed-230832009.html\" data-ylk=\"slk:not having Christian McCaffrey;cpos:9;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003enot having Christian McCaffrey\u003c/a\u003e at the peak of his powers, Purdy has performed admirably. The 49ers still rank in the top five of success rate on dropbacks and expected points added per dropback as the effectiveness of their running game has dwindled. They ran the ball better against the Seahawks than they have in recent weeks even though they’re still missing the explosives on the ground that made them such a dangerous offense. Still, Purdy along with George Kittle, Deebo Samuel Sr. and Jauan Jennings have done enough in the passing game to keep them stable and moving forward in the right direction.\u003c/p\u003e\u003cp\u003eThe defense has also taken a step back from recent seasons where the group isn\u0026#39;t the dominant unit that people had grown accustomed to. The Niners still have ace defenders in Fred Warner, Nick Bosa and Deommodore Lenoir on their roster, but they’re a gettable defense in certain circumstances. Overall, they’re just a middle-of-the-pack defense that has some high-end talent. Enough to win games, but not impenetrable anymore.\u003c/p\u003e\u003cp\u003eThrough attrition and perhaps some roster management strategies, the 49ers don’t have the big shield and sword that they normally do when they’re trying to stay on top of the NFC. Purdy and the passing game will keep them in these games, but their upcoming schedule will prove difficult as they try and fight to the end of the season to make the wild-card round. Getting a first-round bye is certainly off the table with the way that Detroit is performing.\u003c/p\u003e\u003cp\u003eThe 49ers will close the season with games against the Packers, Bills, Bears, Rams, Dolphins, Lions and Cardinals. W-H-E-W. That’s a tough run for any team, let alone a team that is fragmented and currently at the bottom of its division, however slim that deficit actually is. The 49ers might find themselves on the outside looking in at the playoffs — and not making at least the NFC championship game — for the first time since 2020.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-11-20T20:20:37Z",
  "modifiedTime": null
}
