{
  "id": "7a77b278-0c15-4b06-a4bc-3aa14fc3a385",
  "title": "'Unfathomable': How this stunning Luka Doncic-Anthony Davis trade came together",
  "link": "https://www.espn.com/nba/story/_/id/43676830/how-stunning-luka-doncic-anthony-davis-trade-came-together-los-angeles-lakers-dallas-mavericks",
  "description": "The most shocking trade in NBA history began with a secret meeting in a coffee shop in Dallas -- and was fueled by a 20-year history with Kobe Bryant.",
  "author": "Ramona Shelburne and Tim MacMahon",
  "published": "Mon, 3 Feb 2025 15:29:54 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Ramona Shelburne, Tim MacMahon",
  "length": 20386,
  "excerpt": "The most shocking trade in NBA history began with a secret meeting in a coffee shop in Dallas -- and was fueled by a 20-year history with Kobe Bryant.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "Ramona ShelburneCloseRamona ShelburneESPN Senior WriterSenior writer for ESPN.comSpent seven years at the Los Angeles Daily NewsTim MacMahonCloseTim MacMahonESPN Staff WriterJoined ESPNDallas.com in September 2009Covers the Dallas Cowboys and Dallas MavericksAppears regularly on ESPN Dallas 103.3 FMFeb 3, 2025, 02:00 PM ETWALK INTO ONE of the seven Ascension Coffee shops in Dallas, and there are tall glass towers that baristas use to make the upscale cafe's signature Japanese iced drip coffee. It takes 12 hours for the water to filter through before a barista hits the coffee with a dose of nitrogen and pours it in a cup. On the morning of Jan. 7, Dallas Mavericks general manager Nico Harrison invited Lakers general manager Rob Pelinka to the Ascension Coffee in the lobby of the Hotel Crescent Court, just a half-mile from American Airlines Center, to begin a similarly arduous, delicate trade conversation that would jolt the rest of the NBA.Nearly a month later, the Lakers and Mavericks pulled off perhaps the most shocking trade in NBA history, trading 25-year-old perennial MVP contender, Luka Doncic, for All-NBA big man, Anthony Davis, without so much as a peep leaking out ahead of time.Fans in Dallas took to the streets to protest the move, creating a makeshift memorial outside the team's arena, at the foot of the statue for Mavericks legend Dirk Nowitzki, who had posted a sad-faced emoji in response to the trade of a player many expected to be immortalized next to him with a statue one day.Stars across the NBA were stunned -- including the players involved in the trade who'd been given no heads-up that discussions at this level were even taking place.Doncic sent a quick group text to his teammates but did not answer or return Harrison's call informing him of the trade. Davis was home in Los Angeles, texting congratulations to his teammates after they'd beaten the New York Knicks on Saturday night. LeBron James was out to dinner in New York when he got a call from Pelinka minutes before ESPN's Shams Charania broke news of the trade. Kyrie Irving learned of the trade on social media while he was undergoing treatment at the Mavericks hotel in Cleveland, where the team was set to play against the Cavaliers on Sunday afternoon.Executives from around the league were both furious and jealous that the glitzy, star-driven Lakers had been the only team given an opportunity to bid for Doncic's services.\"Unfathomable,\" one Western Conference executive told ESPN.\"I'm stunned,\" an Eastern Conference executive texted.But while this trade seemingly came out of nowhere, sources on both sides said it was a rather direct process between two men with a long history of trust, formed over two decades with the late Lakers icon, Kobe Bryant.Harrison decided early on, team sources said, that the best way to trade a player of Doncic's caliber was to pick the trade that he wanted, rather than open up the process, to avoid Doncic and his agent exerting their own leverage. It would also avoid the crippling fan backlash that might influence the deal.Pelinka and the Lakers understood. Nothing could leak. Not a breath of it. They'd learned the same lesson many times throughout their recent history with blockbuster trades: the infamous failed trade for Chris Paul in 2011, which was scuttled by then-NBA commissioner David Stern after heavy pressure from rival owners; the prolonged, circus-like trade for Davis in 2019 that ruined in the second half of the 2018-19 season and contributed to Magic Johnson's ignominious ending as Lakers president; and last year's mind-boggling owner-to-owner discussions about trading James to the Golden State Warriors, which were ultimately shut down by James' agent, Rich Paul.In all of those trades, outside forces undermined the trade process. For a trade of this magnitude to come to fruition, the circle had to be small. And the only person Harrison felt he could trust to execute this highly charged, intensely secretive process was Pelinka.Even the Utah Jazz, the third team that facilitated the transaction by collecting two second-round picks for absorbing Jalen Hood-Schifino, didn't know Doncic and Davis were a part of the deal until about an hour before it was completed, league sources said. Even Jazz president Danny Ainge, who hails from the Lakers' hated rival, the Boston Celtics, had about only 30 minutes notice, sources said, that Los Angeles was about to acquire Doncic to be the new face of its franchise.But by then it was too late to do much about it. NBA history was about to be altered.PELINKA AND HARRISON'S relationship dates to the summer of 2003, when both were ambitious young executives who had earned the trust of a then-25-year-old Kobe Bryant. Bryant had left his longtime agent Arn Tellem in March 2002 and convinced Pelinka, then a junior executive at Tellem's company SFX, to leave with him.He was also a sneaker free agent after his contract with Adidas had lapsed. Rather than re-sign with the company immediately, Bryant chose to open up the process. He'd wear Nikes one night, Reeboks another, all trying to froth the market after he'd helped the Lakers win their third championship in a row.Nike was focused on a high schooler named LeBron James at the time and put its A-team on the case.Harrison, then a junior executive in his mid-20s, was tasked with recruiting Bryant. He attended every home game that year, but Bryant mostly ignored him. Eventually his persistence paid off, and in the summer of 2003, Harrison and Pelinka closed a five-year, $40 million deal for Bryant to join Nike.Their relationship was soon put to the test when Bryant was accused of rape by a woman in Colorado that September. Prosecutors eventually dropped their case against Bryant, who settled a civil suit with a financial payment and an apology, without admitting fault.Over the next decade Pelinka and Harrison traveled the world together with Bryant on official Nike business and joint family vacations. They were members of Bryant's inner circle, and they leaned on each other when Bryant tragically died in a helicopter crash in 2020.All of which is prologue to why Harrison only felt comfortable discussing the biggest gamble of his professional career with Pelinka.\"I understand the magnitude of it,\" Harrison said Sunday. \"The easiest thing for me to do is nothing, and everyone would praise me for doing nothing. But we really believe in it. Time will tell if I'm right.\"IN THE NEARLY four years since former Mavericks owner Mark Cuban lured him away from Nike to come run the team, Harrison has studied Doncic closely.While he admired Doncic's talent, spirit and competitiveness, team sources said, Harrison had more doubts about Doncic than others in the organization -- such as Cuban or Nowitzki -- did.Doncic had everything one could want in a generational superstar. He'd been a first-team All-NBA selection in each of the past five seasons. His career 28.7 points average is third in NBA history, behind only Michael Jordan and Wilt Chamberlain. Last season he led the NBA in scoring with 33.9 points and nearly averaged a triple-double. But he wasn't a relentless worker like Bryant. He didn't treat his body like a temple like James.The Mavericks' frustrations with Doncic's habits on and off the court were well known in league circles. Head coach Jason Kidd frequently expressed concerns publicly and directly with Doncic about his conditioning, weight fluctuations and constant arguing with officials.Doncic had mostly taken the criticism without complaint, but it never resulted in a significant change in his habits.\"I mean, who gains weight during the season when you're playing 40 minutes a game?\" a team source vented to ESPN last year.Still, last season, he averaged a league-leading 33.9 points, 9.2 rebounds and 9.8 assists and came in third in MVP voting.If Doncic wasn't going to change his ways, the Mavericks figured they would prod him by making changes around him. In August 2023, the team fired former director of player health and performance Casey Smith, who has since been hired by Jalen Brunson's New York Knicks. After last season, the Mavs fired strength coach Jeremy Holsopple and manual therapist Casey Spangler. All three had been with the team since before Doncic was drafted and had strong relationships with him.\"They get rid of everybody I like,\" Doncic griped in recent months, one source said.The plan backfired.play2:27Stephen A.: Trade could be wake-up call for LukaStephen A. Smith breaks down how the Luka Doncic trade affects the Lakers moving forward.Before last season, Doncic hired a full-time \"body team\" -- Slovenian national team strength coach Anže Maček, as well as physiotherapist Javier Barrio Calvo and nutritionist Lucia Almendros from Real Madrid -- that he paid for out of his own pocket.The changes didn't result in a healthier or more available Doncic, and the internal frustration only increased as team sources complained about poor communication between Doncic's team and the Mavs' staff this season.Over the previous six seasons, Doncic had played an average of 67 games. This season, he has sat out 27 games, including the past six weeks since straining his left calf for the fourth time in three years. He gained weight while he was out, which frustrated team officials, sources said. The primary reasoning for an 11-day absence in late November, officially attributed to a right wrist sprain, was to provide Doncic time to shed weight after he had ballooned into the high 260s, sources said. He had a similar shutdown in December 2021, early in the first season of the Harrison-Kidd regime.Still, his production on the court was unmatched, and he turned in a series of sublime performances in the playoffs, when it mattered, to lead Dallas to the Finals.\"I don't care what he does,\" one All-Star told ESPN. \"He still goes out and gives you 33-9-9 every night.\"A rival NBA coach said: \"How do you say this now when you said every year how great he looked coming into camp?\"Doncic weighed 255 pounds when he underwent an MRI on his calf in late January, sources said, and he typically played in the 250-255 range. The Mavs considered his ideal weight to be 245, which would allow Doncic to maintain his advantage of being able to bully defenders with power while maximizing his quickness and minimizing injury risk.By far the biggest change in Dallas, though, was Cuban's December 2023 decision to sell his majority stake in the team to the Adelson family, who are casino magnates, and turn leadership of the franchise over to team governor Patrick Dumont.Cuban had developed a strong bond with Doncic since acquiring him in a draft-day trade with the Atlanta Hawks in 2018. He'd famously joked that if he had to \"choose between my wife and keeping Luka on the Mavs, catch me at my lawyer's office prepping for a divorce.\"But Cuban, though still a near-nightly presence at Mavericks games, is out of the franchise's decision-making tree now, and Dumont does not have the same relationship with Doncic or the inclination to assert himself in basketball decisions as Cuban.Dumont saw it as a business decision that would preserve the Mavericks' financial flexibility for the long term, team sources said, and he trusted Harrison's vision of how Davis would be a culture-setter and give the team a new defense-minded identity.Doncic was eligible to sign a five-year, $345 million extension -- the highest in league history -- this summer. He anticipated signing the deal, sources said, and never gave any indication that he intended to explore the possibility of leaving Dallas. He'd even begun searching for a new home in the city. Team sources say they were as afraid of Doncic signing the deal as they were of him not.\"I feel like we got out in front of what could have been a tumultuous summer,\" Harrison said Sunday. \"Other teams that were loading up that he was going to be able to decide, make his own decision at some point of whether he wants to be here or not. Whether we want to supermax him or not, or whether he wants to opt out. So, I think we had to take all that into consideration.\"Cuban declined to comment when reached by ESPN, saying it wasn't his team anymore.Others within the organization and those close to it weren't so reticent to give an opinion.This will go down as one of (Probably THE) worst trades in the history of Sports. You just traded away a top 3 player in the prime of his career and your return was a single first and a soon to be 32 year old Anthony Davis. The fact that you threw in a 2nd for good measure is...— Haralabos Voulgaris (@haralabob) February 2, 2025 \"No way Mark would ever trade Luka,\" a team source said. \"It wouldn't even be a conversation.\"CUBAN WAS IN the room the last time the Lakers pulled off a trade of this magnitude. He was one of the owners who in late 2011 objected to the three-way trade that would've sent Chris Paul from the New Orleans Hornets to the Lakers for a package headlined by Pau Gasol and Lamar Odom.It was a contentious five-hour meeting, with owners arguing over the fairness toward small-market teams and the consequences of star players being able to affect a franchise's value so dramatically with free agent decisions.Then-commissioner David Stern ran these meetings with an iron fist, insisting that each person in the room turn their phone off until the CBA, which was being negotiated, was ratified. Anyone who violated Stern's edict heard about it in the strongest possible way. That's one reason why Jeanie Buss -- filling in at the NBA board of governors meeting for her father, Dr. Jerry Buss, who was undergoing surgery for cancer -- had no idea that her brother Jim Buss and then-general manager Mitch Kupchak were negotiating the trade for Paul at the exact same time.If she had known, Buss would've insisted that the trade remain secret until the CBA was ratified and all the owners were out of earshot of Stern, who was acting as the de facto owner of the Hornets, giving him the ability to approve or deny the trade.Paul was 25 at the time, the same age as Doncic now. The Lakers believed he'd be the successor to Bryant as the face of their franchise, much like they believe Doncic will succeed James one day soon.Instead, Stern vetoed the deal, Paul went to the rival Clippers and the Lakers spent the final three years of Bryant's career and the first three years after it in the lottery trying to find the successor to Bryant, until James came to them as a free agent in 2018.That experience taught the Lakers the value -- and consequences -- of keeping trades quiet until they were all the way done.In 2019, they learned the hard way again, when negotiations with New Orleans for Davis turned into a drawn-out spectacle that torpedoed their relationships with many of the young players they'd drafted and developed, and hurt their leverage in negotiations for Davis.Then last season, another monster trade was scuttled when the Lakers asked James' agent Rich Paul whether James would welcome a trade to the Golden State Warriors. The Warriors had initiated the talks after receiving information that James might be open to such a deal. But Paul said no, and the talks died out.This time no one but Harrison, Dumont, Pelinka and Buss would have a say. Not Paul, who represents both Davis and James. Not Doncic or his agent. Not Kyrie Irving or his agent. Not even Kidd or Lakers coach JJ Redick, who formed a friendship with Doncic during their brief time as teammates at the end of the 2021 season.\"I thought I'd spend my career here and I wanted so badly to bring you a championship,\" Doncic wrote in a social media post directed to Mavericks fans Sunday. \"... In good times and bad, from injuries to the NBA Finals, your support never changed. Thank you not only for sharing my joy in our best moments, but also for lifting me up when I needed it most.\"His father, Sasa, wasn't as diplomatic.\"I think that exactly this secrecy, or should I say from some individuals, maybe even hypocrisy, this hurts me personally,\" Sasa Doncic said on the Slovenian broadcast of Sunday's Mavericks-Cavaliers game, translated by Arena Sport. \"I think that Luka absolutely doesn't deserve this. ... I feel like this is very unfair from some individuals because I know that Luka respected Dallas a lot. He respected the whole city, helped children. It was never a problem for him to go to hospitals and to orphanages and to all of these charity events. It wasn't even a problem last year since, I am saying again, one individual said he's not fit enough. That he played, I don't know, 100 games, practically 40 minutes with two or three players constantly on him. That he was beaten and you say such things about him. I feel that this is very unfair from certain individuals. You traded him, stand by your actions but don't look for excuses or alibis, that's it.\"Ultimately though, Doncic and his camp took solace in the fact Dallas traded him to a destination and franchise like the Lakers.\"Nobody likes being traded,\" a source close to Doncic said. \"But they sent him to the Lakers when they could've sent him anywhere.\"play1:01Can Luka join this list of Lakers legends?Take a look at the history of Lakers transactions that led to their dynasties.HARRISON WAS AWARE of the risks and ramifications of a trade like this from the first coffee he shared with Pelinka. Trades of this magnitude rarely happen in professional sports. They're too complicated. Too political. Too risky for all involved.But for the past month, as the trade got more and more realistic, the size of the circle of those wrestling with the implications remained.Then late last week, the deal picked up steam as the Lakers recruited Utah as a facilitator. The Jazz only knew they'd be receiving Hood-Schifino in exchange for two second-round picks, sources said. The Lakers had several backup plans if the Jazz option fell through.Utah just had to complete a trade with the Clippers earlier Saturday morning to free up roster spots to take in another player. The last part of that deal was completed Saturday around the same time the Lakers and Knicks were tipping off in New York.The Lakers had asked the Jazz to complete the trade involving Drew Eubanks and Patty Mills by the time they were finished against the Knicks because they didn't want Max Christie to have to fly back with the team on their Sunday morning flight back to Los Angeles and then learn he'd been traded.Shortly after the Jazz completed their business with Mills, they learned of the magnitude of the trade in which they were about to be involved. All that did was buy them an extra hour to digest the ramifications.Once the trade broke, at 12:15 a.m. ET Sunday -- sending Davis, Christie and a 2029 first-round pick to Dallas in exchange for Doncic and forwards Maxi Kleber and Markieff Morris -- questions immediately arose surrounding what it might mean for James, his no-trade clause and his stated preference to finish his career in Los Angeles.Initially, sources said that desire remains the same -- at least this season. But the Warriors could make another run at him, league sources with knowledge of the Warriors' thinking said. A reunion with Kevin Durant is also a possibility, if the Suns would ever consider it.James can also become a free agent again this summer by declining his $52.6 million player option. He was close to Davis, whom he worked to bring to Los Angeles, but he has also spoken openly for years about his love of Doncic's game.The trade also raised questions about the Lakers' place in the West for the remainder of the season. While James and the injured Doncic, who is expected to return this month, are both superstars, the Lakers now have a massive hole in the middle with just days left before the trade deadline to address it.But the biggest question of all will take years to answer.Will Doncic prove the Mavs wrong?\"I'm sorry [fans] are frustrated, but it's something that we believe in as an organization,\" Harrison said. \"It's going to make us better. We believe that it sets us up to win, not only now, but also in the future. And when we win, I believe the frustration will go away.\"The future to me is three, four years from now. The future 10 years from now, I don't know. They'll probably bury me and [Kidd] by then. Or we'll bury ourselves.\"",
  "image": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0203%2Fr1446972_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eRamona Shelburne\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"#\"\u003eClose\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" src=\"https://a.espncdn.com/combiner/i?img=/i/columnists/full/shelburne_ramona.png\u0026amp;h=80\u0026amp;w=80\u0026amp;scale=crop\"/\u003e\u003c/p\u003e\u003cp\u003eRamona Shelburne\u003c/p\u003e\u003cp\u003e\u003cspan\u003eESPN Senior Writer\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cul\u003e\u003cli\u003eSenior writer for ESPN.com\u003c/li\u003e\u003cli\u003eSpent seven years at the Los Angeles Daily News\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eTim MacMahon\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"#\"\u003eClose\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" src=\"https://a.espncdn.com/combiner/i?img=/i/columnists/full/macmahon_tim.png\u0026amp;h=80\u0026amp;w=80\u0026amp;scale=crop\"/\u003e\u003c/p\u003e\u003cp\u003eTim MacMahon\u003c/p\u003e\u003cp\u003e\u003cspan\u003eESPN Staff Writer\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cul\u003e\u003cli\u003eJoined ESPNDallas.com in September 2009\u003c/li\u003e\u003cli\u003eCovers the Dallas Cowboys and Dallas Mavericks\u003c/li\u003e\u003cli\u003eAppears regularly on ESPN Dallas 103.3 FM\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan\u003eFeb 3, 2025, 02:00 PM ET\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003eWALK INTO ONE\u003c/strong\u003e of the seven Ascension Coffee shops in Dallas, and there are tall glass towers that baristas use to make the upscale cafe\u0026#39;s signature Japanese iced drip coffee. It takes 12 hours for the water to filter through before a barista hits the coffee with a dose of nitrogen and pours it in a cup. On the morning of Jan. 7, \u003ca data-clubhouse-guid=\"f00d1f4e-4ce6-d581-466c-5b52531cf7ad\" href=\"https://www.espn.com/nba/team/_/name/dal/dallas-mavericks\"\u003eDallas Mavericks\u003c/a\u003e general manager Nico Harrison invited Lakers general manager Rob Pelinka to the Ascension Coffee in the lobby of the Hotel Crescent Court, just a half-mile from American Airlines Center, to begin a similarly arduous, delicate trade conversation that would jolt the rest of the NBA.\u003c/p\u003e\u003cp\u003eNearly a month later, the Lakers and Mavericks pulled off perhaps the most shocking trade in NBA history, trading 25-year-old perennial MVP contender, \u003ca data-player-guid=\"583794eb-0f38-9bbd-3e25-9dd33b7f83b8\" href=\"https://www.espn.com/nba/player/_/id/3945274/luka-doncic\"\u003eLuka Doncic\u003c/a\u003e, for All-NBA big man, \u003ca data-player-guid=\"dcf63163-4dbf-c59d-1920-3ecc2f8bd5fb\" href=\"https://www.espn.com/nba/player/_/id/6583/anthony-davis\"\u003eAnthony Davis\u003c/a\u003e, without so much as a peep leaking out ahead of time.\u003c/p\u003e\u003cp\u003eFans in Dallas took to the streets to protest the move, creating a makeshift memorial outside the team\u0026#39;s arena, at the foot of the statue for Mavericks legend Dirk Nowitzki, who had posted a sad-faced emoji in response to the trade of a player many expected to be immortalized next to him with a statue one day.\u003c/p\u003e\u003cp\u003eStars across the NBA were stunned -- including the players involved in the trade who\u0026#39;d been given no heads-up that discussions at this level were even taking place.\u003c/p\u003e\u003cp\u003eDoncic sent a quick group text to his teammates but did not answer or return Harrison\u0026#39;s call informing him of the trade. Davis was home in Los Angeles, texting congratulations to his teammates after they\u0026#39;d beaten the \u003ca data-clubhouse-guid=\"61719eb2-11c3-4e3d-90c3-0a1319fd850b\" href=\"https://www.espn.com/nba/team/_/name/ny/new-york-knicks\"\u003eNew York Knicks\u003c/a\u003e on Saturday night. \u003ca data-player-guid=\"1f6592b3-ff53-d321-8dc5-6038d48c1786\" href=\"https://www.espn.com/nba/player/_/id/1966/lebron-james\"\u003eLeBron James\u003c/a\u003e \u003ca href=\"https://x.com/mcten/status/1885929640071422236\"\u003ewas out to dinner\u003c/a\u003e in New York when he got a call from Pelinka minutes before ESPN\u0026#39;s Shams Charania broke news of the trade. \u003ca data-player-guid=\"4fb2e3fc-ad79-d9bc-ddd9-bbb09f29ead3\" href=\"https://www.espn.com/nba/player/_/id/6442/kyrie-irving\"\u003eKyrie Irving\u003c/a\u003e learned of the trade on social media while he was undergoing treatment at the Mavericks hotel in Cleveland, where the team was set to play against the Cavaliers on Sunday afternoon.\u003c/p\u003e\u003cp\u003eExecutives from around the league were both furious and jealous that the glitzy, star-driven Lakers had been the only team given an opportunity to bid for Doncic\u0026#39;s services.\u003c/p\u003e\u003cp\u003e\u0026#34;Unfathomable,\u0026#34; one Western Conference executive told ESPN.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m stunned,\u0026#34; an Eastern Conference executive texted.\u003c/p\u003e\u003cp\u003eBut while this trade seemingly came out of nowhere, sources on both sides said it was a rather direct process between two men with a long history of trust, formed over two decades with the late Lakers icon, Kobe Bryant.\u003c/p\u003e\u003cp\u003eHarrison decided early on, team sources said, that the best way to trade a player of Doncic\u0026#39;s caliber was to pick the trade that he wanted, rather than open up the process, to avoid Doncic and his agent exerting their own leverage. It would also avoid the \u003ca href=\"https://x.com/ArashMarkazi/status/1886398804028727646/photo/1\"\u003ecrippling fan backlash\u003c/a\u003e that might influence the deal.\u003c/p\u003e\u003cp\u003ePelinka and the Lakers understood. Nothing could leak. Not a breath of it. They\u0026#39;d learned the same lesson many times throughout their recent history with blockbuster trades: the infamous failed trade for \u003ca data-player-guid=\"63c7648a-60ba-c799-d355-f7f1d43f3a55\" href=\"https://www.espn.com/nba/player/_/id/2779/chris-paul\"\u003eChris Paul\u003c/a\u003e in 2011, which was scuttled by then-NBA commissioner David Stern after heavy pressure from rival owners; the prolonged, circus-like trade for Davis in 2019 that ruined in the second half of the 2018-19 season and contributed to Magic Johnson\u0026#39;s ignominious ending as Lakers president; and last year\u0026#39;s mind-boggling owner-to-owner discussions about trading James to the \u003ca data-clubhouse-guid=\"77a8546f-24bf-a333-8161-bf9f75396c49\" href=\"https://www.espn.com/nba/team/_/name/gs/golden-state-warriors\"\u003eGolden State Warriors\u003c/a\u003e, which were ultimately shut down by James\u0026#39; agent, Rich Paul.\u003c/p\u003e\u003cp\u003eIn all of those trades, outside forces undermined the trade process. For a trade of this magnitude to come to fruition, the circle had to be small. And the only person Harrison felt he could trust to execute this highly charged, intensely secretive process was Pelinka.\u003c/p\u003e\u003cp\u003eEven the \u003ca data-clubhouse-guid=\"77cea2fb-1388-b7c8-d171-2e72b3aecbfb\" href=\"https://www.espn.com/nba/team/_/name/utah/utah-jazz\"\u003eUtah Jazz\u003c/a\u003e, the third team that facilitated the transaction by collecting two second-round picks for absorbing \u003ca data-player-guid=\"13f136bb-6a2f-3648-8ecb-0e2a77c98500\" href=\"https://www.espn.com/nba/player/_/id/5105797/jalen-hood-schifino\"\u003eJalen Hood-Schifino\u003c/a\u003e, didn\u0026#39;t know Doncic and Davis were a part of the deal until about an hour before it was completed, league sources said. Even Jazz president Danny Ainge, who hails from the Lakers\u0026#39; hated rival, the \u003ca data-clubhouse-guid=\"2ca761df-5f60-b2e9-22ed-e099c46d889b\" href=\"https://www.espn.com/nba/team/_/name/bos/boston-celtics\"\u003eBoston Celtics\u003c/a\u003e, had about only 30 minutes notice, sources said, that Los Angeles was about to acquire Doncic to be the new face of its franchise.\u003c/p\u003e\u003cp\u003eBut by then it was too late to do much about it. NBA history was about to be altered.\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003cstrong\u003ePELINKA AND HARRISON\u0026#39;S\u003c/strong\u003e relationship dates to the summer of 2003, when both were ambitious young executives who had earned the trust of a then-25-year-old Kobe Bryant. Bryant had left his longtime agent Arn Tellem in March 2002 and convinced Pelinka, then a junior executive at Tellem\u0026#39;s company SFX, to leave with him.\u003c/p\u003e\u003cp\u003eHe was also a sneaker free agent after his contract with Adidas had lapsed. Rather than re-sign with the company immediately, Bryant chose to open up the process. He\u0026#39;d wear Nikes one night, Reeboks another, all trying to froth the market after he\u0026#39;d helped the Lakers win their third championship in a row.\u003c/p\u003e\u003cp\u003eNike was focused on a high schooler named LeBron James at the time and put its A-team on the case.\u003c/p\u003e\u003cp\u003eHarrison, then a junior executive in his mid-20s, was tasked with recruiting Bryant. He attended every home game that year, but Bryant mostly ignored him. Eventually his persistence paid off, and in the summer of 2003, Harrison and Pelinka closed a five-year, $40 million deal for Bryant to join Nike.\u003c/p\u003e\u003cp\u003eTheir relationship was soon put to the test when Bryant was accused of rape by a woman in Colorado that September. Prosecutors eventually dropped their case against Bryant, who settled a civil suit with a financial payment and an apology, without admitting fault.\u003c/p\u003e\u003cp\u003eOver the next decade Pelinka and Harrison traveled the world together with Bryant on official Nike business and joint family vacations. They were members of Bryant\u0026#39;s inner circle, and they leaned on each other when Bryant tragically died in a helicopter crash in 2020.\u003c/p\u003e\u003cp\u003eAll of which is prologue to why Harrison only felt comfortable discussing the biggest gamble of his professional career with Pelinka.\u003c/p\u003e\u003cp\u003e\u0026#34;I understand the magnitude of it,\u0026#34; Harrison said Sunday. \u0026#34;The easiest thing for me to do is nothing, and everyone would praise me for doing nothing. But we really believe in it. Time will tell if I\u0026#39;m right.\u0026#34;\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003cstrong\u003eIN THE NEARLY\u003c/strong\u003e four years since former Mavericks owner Mark Cuban lured him away from Nike to come run the team, Harrison has studied Doncic closely.\u003c/p\u003e\u003cp\u003eWhile he admired Doncic\u0026#39;s talent, spirit and competitiveness, team sources said, Harrison had more doubts about Doncic than others in the organization -- such as Cuban or Nowitzki -- did.\u003c/p\u003e\u003cp\u003eDoncic had everything one could want in a generational superstar. He\u0026#39;d been a first-team All-NBA selection in each of the past five seasons. His career 28.7 points average is third in NBA history, behind only Michael Jordan and \u003ca data-player-guid=\"ada3cdc4-8e3d-d94a-e117-30470c75464e\" href=\"https://www.espn.com/nba/player/_/id/4142/wilt-chamberlain\"\u003eWilt Chamberlain\u003c/a\u003e. Last season he led the NBA in scoring with 33.9 points and nearly averaged a triple-double. But he wasn\u0026#39;t a relentless worker like Bryant. He didn\u0026#39;t treat his body like a temple like James.\u003c/p\u003e\u003cp\u003eThe Mavericks\u0026#39; frustrations with Doncic\u0026#39;s habits on and off the court were well known in league circles. Head coach Jason Kidd frequently expressed concerns publicly and directly with Doncic about his conditioning, weight fluctuations and constant arguing with officials.\u003c/p\u003e\u003cp\u003eDoncic had mostly taken the criticism without complaint, but it never resulted in a significant change in his habits.\u003c/p\u003e\u003cp\u003e\u0026#34;I mean, who gains weight during the season when you\u0026#39;re playing 40 minutes a game?\u0026#34; a team source vented to ESPN last year.\u003c/p\u003e\u003cp\u003eStill, last season, he averaged a league-leading 33.9 points, 9.2 rebounds and 9.8 assists and came in third in MVP voting.\u003c/p\u003e\u003cp\u003eIf Doncic wasn\u0026#39;t going to change his ways, the Mavericks figured they would prod him by making changes around him. In August 2023, the team fired former director of player health and performance Casey Smith, who has since been hired by Jalen Brunson\u0026#39;s New York Knicks. After last season, the Mavs fired strength coach Jeremy Holsopple and manual therapist Casey Spangler. All three had been with the team since before Doncic was drafted and had strong relationships with him.\u003c/p\u003e\u003cp\u003e\u0026#34;They get rid of everybody I like,\u0026#34; Doncic griped in recent months, one source said.\u003c/p\u003e\u003cp\u003eThe plan backfired.\u003c/p\u003e\u003cdiv data-behavior=\"video_scroll\"\u003e\u003cfigure data-video=\"watch,640,360,43664232,whitelist-GB|UK|TZ|GH|AW|SN|BB|MG|ZW|SR|CI|LR|BI|GY|PY|SC|AI|ER|AO|BQ|UG|EC|PA|VC|NE|LS|ZA|SZ|BO|PW|KM|MW|AG|VG|BZ|SS|HN|ZM|CO|BS|KN|CM|GN|MZ|GF|CG|AS|GW|MU|JM|BJ|VE|GU|GA|BM|MX|FJ|TT|MP|NZ|PR|CD|NG|RW|FM|ET|UY|US|VI|UM|KE|GP|SL|GD|BR|RE|MQ|GM|MS|SV|GT|MF|AM|AU|CV|ST|MH|CL|BF|CF|TG|NI|KY|ML|CR|NA|GQ|DO|SX|PE|HT|BW|CU|TC|LC|\" data-cerebro-id=\"679f8e646ffa8c2a8d169e5d\" data-title=\"Stephen A.: Trade could be wake-up call for Luka\" data-source=\"espn\"\u003e\u003cpicture\u003e\u003csource data-srcset=\"https://a4.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0202%2Fdm_250202_SC_SAS_on_Luka%2Fdm_250202_SC_SAS_on_Luka.jpg\u0026amp;w=640\u0026amp;h=360\u0026amp;cquality=80\u0026amp;format=jpg\" media=\"(min-width: 376px)\"/\u003e\u003csource data-srcset=\"https://a4.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0202%2Fdm_250202_SC_SAS_on_Luka%2Fdm_250202_SC_SAS_on_Luka.jpg\u0026amp;w=335\u0026amp;cquality=80, https://a4.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0202%2Fdm_250202_SC_SAS_on_Luka%2Fdm_250202_SC_SAS_on_Luka.jpg\u0026amp;w=670\u0026amp;cquality=40\u0026amp;format=jpg 2x\" media=\"(max-width: 375px)\"/\u003e\u003c/picture\u003e\u003cspan data-id=\"43664232\"\u003eplay\u003c/span\u003e\u003cfigcaption\u003e\u003cp\u003e2:27\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003eStephen A.: Trade could be wake-up call for Luka\u003c/p\u003e\u003cp\u003eStephen A. Smith breaks down how the Luka Doncic trade affects the Lakers moving forward.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eBefore last season, Doncic hired a full-time \u0026#34;body team\u0026#34; -- Slovenian national team strength coach Anže Maček, as well as physiotherapist Javier Barrio Calvo and nutritionist Lucia Almendros from Real Madrid -- that he paid for out of his own pocket.\u003c/p\u003e\u003cp\u003eThe changes didn\u0026#39;t result in a healthier or more available Doncic, and the internal frustration only increased as team sources complained about poor communication between Doncic\u0026#39;s team and the Mavs\u0026#39; staff this season.\u003c/p\u003e\u003cp\u003eOver the previous six seasons, Doncic had played an average of 67 games. This season, he has sat out 27 games, including the past six weeks since straining his left calf for the fourth time in three years. He gained weight while he was out, which frustrated team officials, sources said. The primary reasoning for an 11-day absence in late November, officially attributed to a right wrist sprain, was to provide Doncic time to shed weight after he had ballooned into the high 260s, sources said. He had a similar shutdown in December 2021, early in the first season of the Harrison-Kidd regime.\u003c/p\u003e\u003cp\u003eStill, his production on the court was unmatched, and he turned in a series of sublime performances in the playoffs, when it mattered, to lead Dallas to the Finals.\u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t care what he does,\u0026#34; one All-Star told ESPN. \u0026#34;He still goes out and gives you 33-9-9 every night.\u0026#34;\u003c/p\u003e\u003cp\u003eA rival NBA coach said: \u0026#34;How do you say this now when you said every year how great he looked coming into camp?\u0026#34;\u003c/p\u003e\u003cp\u003eDoncic weighed 255 pounds when he underwent an MRI on his calf in late January, sources said, and he typically played in the 250-255 range. The Mavs considered his ideal weight to be 245, which would allow Doncic to maintain his advantage of being able to bully defenders with power while maximizing his quickness and minimizing injury risk.\u003c/p\u003e\u003cp\u003eBy far the biggest change in Dallas, though, was Cuban\u0026#39;s December 2023 decision to sell his majority stake in the team to the Adelson family, who are casino magnates, and turn leadership of the franchise over to team governor Patrick Dumont.\u003c/p\u003e\u003cp\u003eCuban had developed a strong bond with Doncic since acquiring him in a draft-day trade with the \u003ca data-clubhouse-guid=\"15096a54-f015-c987-5ec8-55afedf6272f\" href=\"https://www.espn.com/nba/team/_/name/atl/atlanta-hawks\"\u003eAtlanta Hawks\u003c/a\u003e in 2018. He\u0026#39;d famously joked that if he had to \u0026#34;choose between my wife and keeping Luka on the Mavs, catch me at my lawyer\u0026#39;s office prepping for a divorce.\u0026#34;\u003c/p\u003e\u003cp\u003eBut Cuban, though still a near-nightly presence at Mavericks games, is out of the franchise\u0026#39;s decision-making tree now, and Dumont does not have the same relationship with Doncic or the inclination to assert himself in basketball decisions as Cuban.\u003c/p\u003e\u003cp\u003eDumont saw it as a business decision that would preserve the Mavericks\u0026#39; financial flexibility for the long term, team sources said, and he trusted Harrison\u0026#39;s vision of how Davis would be a culture-setter and give the team a new defense-minded identity.\u003c/p\u003e\u003cp\u003eDoncic was eligible to sign a five-year, $345 million extension -- the highest in league history -- this summer. He anticipated signing the deal, sources said, and never gave any indication that he intended to explore the possibility of leaving Dallas. He\u0026#39;d even begun searching for a new home in the city. Team sources say they were as afraid of Doncic signing the deal as they were of him not.\u003c/p\u003e\u003cp\u003e\u0026#34;I feel like we got out in front of what could have been a tumultuous summer,\u0026#34; Harrison said Sunday. \u0026#34;Other teams that were loading up that he was going to be able to decide, make his own decision at some point of whether he wants to be here or not. Whether we want to supermax him or not, or whether he wants to opt out. So, I think we had to take all that into consideration.\u0026#34;\u003c/p\u003e\u003cp\u003eCuban declined to comment when reached by ESPN, saying it wasn\u0026#39;t his team anymore.\u003c/p\u003e\u003cp\u003eOthers within the organization and those close to it weren\u0026#39;t so reticent to give an opinion.\u003c/p\u003e\u003cblockquote\u003e\u003cp lang=\"en\" dir=\"ltr\"\u003eThis will go down as one of (Probably THE) worst trades in the history of Sports. You just traded away a top 3 player in the prime of his career and your return was a single first and a soon to be 32 year old Anthony Davis. The fact that you threw in a 2nd for good measure is...\u003c/p\u003e— Haralabos Voulgaris (@haralabob) \u003ca href=\"https://twitter.com/haralabob/status/1886194519718166730?ref_src=twsrc%5Etfw\"\u003eFebruary 2, 2025\u003c/a\u003e\u003c/blockquote\u003e \u003cp\u003e\u0026#34;No way Mark would ever trade Luka,\u0026#34; a team source said. \u0026#34;It wouldn\u0026#39;t even be a conversation.\u0026#34;\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003cstrong\u003eCUBAN WAS IN\u003c/strong\u003e the room the last time the Lakers pulled off a trade of this magnitude. He was one of the owners who in late 2011 objected to the three-way trade that would\u0026#39;ve sent Chris Paul from the New Orleans Hornets to the Lakers for a package headlined by Pau Gasol and Lamar Odom.\u003c/p\u003e\u003cp\u003eIt was a contentious five-hour meeting, with owners arguing over the fairness toward small-market teams and the consequences of star players being able to affect a franchise\u0026#39;s value so dramatically with free agent decisions.\u003c/p\u003e\u003cp\u003eThen-commissioner David Stern ran these meetings with an iron fist, insisting that each person in the room turn their phone off until the CBA, which was being negotiated, was ratified. Anyone who violated Stern\u0026#39;s edict heard about it in the strongest possible way. That\u0026#39;s one reason why Jeanie Buss -- filling in at the NBA board of governors meeting for her father, Dr. Jerry Buss, who was undergoing surgery for cancer -- had no idea that her brother Jim Buss and then-general manager Mitch Kupchak were negotiating the trade for Paul at the exact same time.\u003c/p\u003e\u003cp\u003eIf she had known, Buss would\u0026#39;ve insisted that the trade remain secret until the CBA was ratified and all the owners were out of earshot of Stern, who was acting as the de facto owner of the Hornets, giving him the ability to approve or deny the trade.\u003c/p\u003e\u003cp\u003ePaul was 25 at the time, the same age as Doncic now. The Lakers believed he\u0026#39;d be the successor to Bryant as the face of their franchise, much like they believe Doncic will succeed James one day soon.\u003c/p\u003e\u003cp\u003eInstead, Stern vetoed the deal, Paul went to the rival Clippers and the Lakers spent the final three years of Bryant\u0026#39;s career and the first three years after it in the lottery trying to find the successor to Bryant, until James came to them as a free agent in 2018.\u003c/p\u003e\u003cp\u003eThat experience taught the Lakers the value -- and consequences -- of keeping trades quiet until they were all the way done.\u003c/p\u003e\u003cp\u003eIn 2019, they learned the hard way again, when negotiations with New Orleans for Davis turned into a drawn-out spectacle that torpedoed their relationships with many of the young players they\u0026#39;d drafted and developed, and hurt their leverage in negotiations for Davis.\u003c/p\u003e\u003cp\u003eThen last season, another monster trade was scuttled when the Lakers asked James\u0026#39; agent Rich Paul whether James would welcome a trade to the Golden State Warriors. The Warriors had initiated the talks after receiving information that James might be open to such a deal. But Paul said no, and the talks died out.\u003c/p\u003e\u003cp\u003eThis time no one but Harrison, Dumont, Pelinka and Buss would have a say. Not Paul, who represents both Davis and James. Not Doncic or his agent. Not Kyrie Irving or his agent. Not even Kidd or Lakers coach JJ Redick, who formed a friendship with Doncic during their brief time as teammates at the end of the 2021 season.\u003c/p\u003e\u003cp\u003e\u0026#34;I thought I\u0026#39;d spend my career here and I wanted so badly to bring you a championship,\u0026#34; Doncic wrote in a social media post directed to Mavericks fans Sunday. \u0026#34;... In good times and bad, from injuries to the NBA Finals, your support never changed. Thank you not only for sharing my joy in our best moments, but also for lifting me up when I needed it most.\u0026#34;\u003c/p\u003e\u003cp\u003eHis father, Sasa, wasn\u0026#39;t as diplomatic.\u003c/p\u003e\u003cp\u003e\u0026#34;I think that exactly this secrecy, or should I say from some individuals, maybe even hypocrisy, this hurts me personally,\u0026#34; Sasa Doncic said on the Slovenian \u003ca href=\"https://www.espn.com/nba/story/_/id/43678217/luka-doncic-father-calls-mavericks-lakers-trade\"\u003ebroadcast of Sunday\u0026#39;s Mavericks-Cavaliers game\u003c/a\u003e, translated by Arena Sport. \u0026#34;I think that Luka absolutely doesn\u0026#39;t deserve this. ... I feel like this is very unfair from some individuals because I know that Luka respected Dallas a lot. He respected the whole city, helped children. It was never a problem for him to go to hospitals and to orphanages and to all of these charity events. It wasn\u0026#39;t even a problem last year since, I am saying again, one individual said he\u0026#39;s not fit enough. That he played, I don\u0026#39;t know, 100 games, practically 40 minutes with two or three players constantly on him. That he was beaten and you say such things about him. I feel that this is very unfair from certain individuals. You traded him, stand by your actions but don\u0026#39;t look for excuses or alibis, that\u0026#39;s it.\u0026#34;\u003c/p\u003e\u003cp\u003eUltimately though, Doncic and his camp took solace in the fact Dallas traded him to a destination and franchise like the Lakers.\u003c/p\u003e\u003cp\u003e\u0026#34;Nobody likes being traded,\u0026#34; a source close to Doncic said. \u0026#34;But they sent him to the Lakers when they could\u0026#39;ve sent him anywhere.\u0026#34;\u003c/p\u003e\u003cdiv data-behavior=\"video_scroll\"\u003e\u003cfigure data-video=\"watch,640,360,43668244,whitelist-ZM|CU|RW|HT|SR|EC|VG|UM|GD|CD|CI|ET|UG|PW|SN|TT|MQ|SV|NZ|KE|PA|GT|VE|MU|LR|NI|CO|TG|FM|AO|BO|GY|ZA|BR|BQ|SL|ML|KN|FJ|AM|GU|KM|MS|PY|AS|BS|SS|MG|SZ|GW|MH|NA|UY|MW|US|MP|PR|VI|CM|TZ|PE|NE|LC|ER|GB|UK|GP|CL|KY|CG|GA|CR|LS|BW|AG|BB|DO|MZ|AW|JM|BF|BJ|SX|ZW|GQ|AU|GN|CV|ST|GM|GH|BI|NG|CF|GF|AI|HN|BZ|TC|SC|MX|MF|RE|BM|VC|\" data-cerebro-id=\"679fe3d4682728501dd0c139\" data-title=\"Can Luka join this list of Lakers legends?\" data-source=\"espn\"\u003e\u003cpicture\u003e\u003csource data-srcset=\"https://a1.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0202%2Fdm_250202_lakers_luka_digital%2Fdm_250202_lakers_luka_digital.jpg\u0026amp;w=640\u0026amp;h=360\u0026amp;cquality=80\u0026amp;format=jpg\" media=\"(min-width: 376px)\"/\u003e\u003csource data-srcset=\"https://a1.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0202%2Fdm_250202_lakers_luka_digital%2Fdm_250202_lakers_luka_digital.jpg\u0026amp;w=335\u0026amp;cquality=80, https://a1.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2025%2F0202%2Fdm_250202_lakers_luka_digital%2Fdm_250202_lakers_luka_digital.jpg\u0026amp;w=670\u0026amp;cquality=40\u0026amp;format=jpg 2x\" media=\"(max-width: 375px)\"/\u003e\u003c/picture\u003e\u003cspan data-id=\"43668244\"\u003eplay\u003c/span\u003e\u003cfigcaption\u003e\u003cp\u003e1:01\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003eCan Luka join this list of Lakers legends?\u003c/p\u003e\u003cp\u003eTake a look at the history of Lakers transactions that led to their dynasties.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003eHARRISON WAS AWARE\u003c/strong\u003e of the risks and ramifications of a trade like this from the first coffee he shared with Pelinka. Trades of this magnitude rarely happen in professional sports. They\u0026#39;re too complicated. Too political. Too risky for all involved.\u003c/p\u003e\u003cp\u003eBut for the past month, as the trade got more and more realistic, the size of the circle of those wrestling with the implications remained.\u003c/p\u003e\u003cp\u003eThen late last week, the deal picked up steam as the Lakers recruited Utah as a facilitator. The Jazz only knew they\u0026#39;d be receiving Hood-Schifino in exchange for two second-round picks, sources said. The Lakers had several backup plans if the Jazz option fell through.\u003c/p\u003e\u003cp\u003eUtah just had to complete a trade with the Clippers earlier Saturday morning to free up roster spots to take in another player. The last part of that deal was completed Saturday around the same time the Lakers and Knicks were tipping off in New York.\u003c/p\u003e\u003cp\u003eThe Lakers had asked the Jazz to complete the trade involving \u003ca data-player-guid=\"8bde6690-61ad-5afc-76fa-469e5df59ec8\" href=\"https://www.espn.com/nba/player/_/id/3914285/drew-eubanks\"\u003eDrew Eubanks\u003c/a\u003e and \u003ca data-player-guid=\"493a55f7-fcba-acc2-ce8b-93994e57fade\" href=\"https://www.espn.com/nba/player/_/id/4004/patty-mills\"\u003ePatty Mills\u003c/a\u003e by the time they were finished against the Knicks because they didn\u0026#39;t want \u003ca data-player-guid=\"29a42e27-f5a8-3d6e-a950-2b76a81f1d20\" href=\"https://www.espn.com/nba/player/_/id/4432582/max-christie\"\u003eMax Christie\u003c/a\u003e to have to fly back with the team on their Sunday morning flight back to Los Angeles and then learn he\u0026#39;d been traded.\u003c/p\u003e\u003cp\u003eShortly after the Jazz completed their business with Mills, they learned of the magnitude of the trade in which they were about to be involved. All that did was buy them an extra hour to digest the ramifications.\u003c/p\u003e\u003cp\u003eOnce the trade broke, at 12:15 a.m. ET Sunday -- sending Davis, Christie and a 2029 first-round pick to Dallas in exchange for Doncic and forwards \u003ca data-player-guid=\"d06ad722-26ff-5865-1433-061e2e6fbb32\" href=\"https://www.espn.com/nba/player/_/id/2960236/maxi-kleber\"\u003eMaxi Kleber\u003c/a\u003e and \u003ca data-player-guid=\"bb14f494-3387-9cb5-bd8f-175ec15546a2\" href=\"https://www.espn.com/nba/player/_/id/6461/markieff-morris\"\u003eMarkieff Morris\u003c/a\u003e -- questions immediately arose surrounding what it might mean for James, his no-trade clause and his stated preference to finish his career in Los Angeles.\u003c/p\u003e\u003cp\u003eInitially, sources said that desire remains the same -- at least this season. But the Warriors could make another run at him, league sources with knowledge of the Warriors\u0026#39; thinking said. A reunion with \u003ca data-player-guid=\"dc324fde-eee8-98e2-09ac-d31d8ad9909e\" href=\"https://www.espn.com/nba/player/_/id/3202/kevin-durant\"\u003eKevin Durant\u003c/a\u003e is also a possibility, if the Suns would ever consider it.\u003c/p\u003e\u003cp\u003eJames can also become a free agent again this summer by declining his $52.6 million player option. He was close to Davis, whom he worked to bring to Los Angeles, but he has also spoken openly for years about his love of Doncic\u0026#39;s game.\u003c/p\u003e\u003cp\u003eThe trade also raised questions about the Lakers\u0026#39; place in the West for the remainder of the season. While James and the injured Doncic, who is expected to return this month, are both superstars, the Lakers now have a massive hole in the middle with just days left before the trade deadline to address it.\u003c/p\u003e\u003cp\u003eBut the biggest question of all will take years to answer.\u003c/p\u003e\u003cp\u003eWill Doncic prove the Mavs wrong?\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m sorry [fans] are frustrated, but it\u0026#39;s something that we believe in as an organization,\u0026#34; Harrison said. \u0026#34;It\u0026#39;s going to make us better. We believe that it sets us up to win, not only now, but also in the future. And when we win, I believe the frustration will go away.\u003c/p\u003e\u003cp\u003e\u0026#34;The future to me is three, four years from now. The future 10 years from now, I don\u0026#39;t know. They\u0026#39;ll probably bury me and [Kidd] by then. Or we\u0026#39;ll bury ourselves.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "22 min read",
  "publishedTime": "2025-02-03T19:00:00Z",
  "modifiedTime": null
}
