{
  "id": "9158627c-b093-4a30-92f5-3f0fc9fd995a",
  "title": "Sources: UCLA among schools eyeing Iamaleava",
  "link": "https://www.espn.com/college-football/story/_/id/44703683/ucla-talks-qb-nico-iamaleava-less-money",
  "description": "UCLA has had conversations with representatives of transfer quarterback Nico Iamaleava for less money than he was asking for from Tennessee, sources told ESPN on Wednesday.",
  "author": "Chris Low",
  "published": "Wed, 16 Apr 2025 20:24:00 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Chris Low",
  "length": 3564,
  "excerpt": "UCLA has had conversations with representatives of transfer quarterback Nico Iamaleava for less money than he was asking for from Tennessee, sources told ESPN on Wednesday.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "Nico Iamaleava's best TDs from last season (1:56)Check out some of Nico Iamaleava's best touchdowns from last season as he is in talks to transfer to UCLA. (1:56)Chris LowApr 16, 2025, 05:37 PM ETClose College football reporter Joined ESPN.com in 2007 Graduate of the University of TennesseeThe wait for where former Tennessee quarterback Nico Iamaleava plays next in his college career continued Wednesday as the spring transfer portal opened.UCLA is among the schools interested in Iamaleava, but not for nearly the money he was asking for from Tennessee, sources told ESPN. One source said UCLA was content to \"sit tight\" while Iamaleava considered his options.\"We'll see if it gets worked out. He's extremely talented with starting experience against elite competition. That's sort of where we are right now,\" the UCLA source told ESPN.Sources told ESPN that Iamaleava wanted at least $4 million from Tennessee and that what UCLA was prepared to offer him wasn't remotely close to that figure. Iamaleava was earning $2.4 million at Tennessee under the contract he signed with Spyre Sports Group, the Tennessee-based collective, when he was still in high school. It's a deal that would have paid him in the $10 million range had he stayed four years at Tennessee.Tennessee coach Josh Heupel announced Saturday after the Volunteers' spring game that the program was moving forward without Iamaleava after he missed practice and meetings Friday and didn't alert anybody on the team or return any calls or text messages afterward.Heupel thanked Iamaleava and called the situation unfortunate, but added, \"There's no one bigger than the Power T, and that includes me.\"Iamaleava, a rising redshirt sophomore, officially entered the transfer portal Wednesday with a do not contact tag.Sources told ESPN that Iamaleava's representatives asked to redo his deal just before the close of the winter portal in December after Tennessee's playoff loss to Ohio State, but his deal was unchanged and Iamaleava did not enter the winter portal. His father, Nic Iamaleava, also wanted Tennessee to surround his son with better receivers and a more effective offensive line in pass protection.Before the start of spring practice this year, Iamaleava's representatives reached out to Oregon to gauge its interest in the quarterback, but the school said it wasn't interested, sources told ESPN. Oregon then notified Tennessee that Iamaleava was being shopped to the Ducks.Iamaleava, a five-star prospect from Long Beach, California, was recruited by UCLA out of high school. His younger brother, Madden Iamaleava, committed to UCLA out of high school but changed his commitment at the last minute and signed with Arkansas.With Iamaleava a possibility at UCLA, sources told ESPN that representatives for the Bruins' current quarterback, Joey Aguilar, have been covering their bases and making calls to other schools to gauge their interest in Aguilar, who transferred from Appalachian State this offseason and exited spring practice as UCLA's likely starter.A Power 4 general manager told ESPN's Pete Thamel and Max Olson earlier this week that he thought Iamaleava has \"zero market,\" and added that it would be an \"interesting test of how smart and disciplined colleges are in looking at him.\"Iamaleava helped guide Tennessee to the College Football Playoff last season in his first year as a starter. He passed for 2,616 yards, 19 touchdowns and 5 interceptions, but in nine games against SEC opponents and Ohio State in the playoff, he passed for more than 200 yards only twice.",
  "image": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0905%2Fr1382403_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-video=\"watch,640,360,44703983\" data-cerebro-id=\"680029ca938ab973ae48e987\" data-title=\"Nico Iamaleava\u0026#39;s best TDs from last season\" data-source=\"espn\" data-contributing-partner=\"wsc\"\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eNico Iamaleava\u0026#39;s best TDs from last season (1:56)\u003c/span\u003e\u003c/p\u003e\u003cp\u003eCheck out some of Nico Iamaleava\u0026#39;s best touchdowns from last season as he is in talks to transfer to UCLA. (1:56)\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cimg src=\"https://a.espncdn.com/combiner/i?img=/i/columnists/full/low_chris.png\u0026amp;h=80\u0026amp;w=80\u0026amp;scale=crop\" alt=\"\" width=\"40\" height=\"40\"/\u003e\u003c/p\u003e\u003cp\u003eChris Low\u003cspan\u003eApr 16, 2025, 05:37 PM ET\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"#\"\u003eClose\u003c/a\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e College football reporter\n\u003c/li\u003e\u003cli\u003e Joined ESPN.com in 2007\n\u003c/li\u003e\u003cli\u003e Graduate of the University of Tennessee\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eThe wait for where former \u003ca href=\"https://www.espn.com/college-football/team/_/id/2633/tennessee-volunteers\"\u003eTennessee\u003c/a\u003e quarterback \u003ca data-player-guid=\"dc7aea56-5d87-3e32-83ba-4667642c1536\" href=\"https://www.espn.com/college-football/player/_/id/4870799/nico-iamaleava\"\u003eNico Iamaleava\u003c/a\u003e plays next in his college career continued Wednesday as the spring transfer portal opened.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.espn.com/college-football/team/_/id/26/ucla-bruins\"\u003eUCLA\u003c/a\u003e is among the schools interested in Iamaleava, but not for nearly the money he was asking for from Tennessee, sources told ESPN. One source said UCLA was content to \u0026#34;sit tight\u0026#34; while Iamaleava considered his options.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;ll see if it gets worked out. He\u0026#39;s extremely talented with starting experience against elite competition. That\u0026#39;s sort of where we are right now,\u0026#34; the UCLA source told ESPN.\u003c/p\u003e\u003cp\u003eSources told ESPN that Iamaleava wanted at least $4 million from Tennessee and that what UCLA was prepared to offer him wasn\u0026#39;t remotely close to that figure. Iamaleava was earning $2.4 million at Tennessee under the contract he signed with Spyre Sports Group, the Tennessee-based collective, when he was still in high school. It\u0026#39;s a deal that would have paid him in the $10 million range had he stayed four years at Tennessee.\u003c/p\u003e\u003cp\u003eTennessee coach Josh Heupel announced Saturday after the Volunteers\u0026#39; spring game that the program was moving forward without Iamaleava after he missed practice and meetings Friday and didn\u0026#39;t alert anybody on the team or return any calls or text messages afterward.\u003c/p\u003e\u003cp\u003eHeupel thanked Iamaleava and called the situation unfortunate, but added, \u0026#34;There\u0026#39;s no one bigger than the Power T, and that includes me.\u0026#34;\u003c/p\u003e\u003cp\u003eIamaleava, a rising redshirt sophomore, officially entered the transfer portal Wednesday with a do not contact tag.\u003c/p\u003e\u003cp\u003eSources told ESPN that Iamaleava\u0026#39;s representatives asked to redo his deal just before the close of the winter portal in December after Tennessee\u0026#39;s playoff loss to Ohio State, but his deal was unchanged and Iamaleava did not enter the winter portal. His father, Nic Iamaleava, also wanted Tennessee to surround his son with better receivers and a more effective offensive line in pass protection.\u003c/p\u003e\u003cp\u003eBefore the start of spring practice this year, Iamaleava\u0026#39;s representatives reached out to Oregon to gauge its interest in the quarterback, but the school said it wasn\u0026#39;t interested, sources told ESPN. Oregon then notified Tennessee that Iamaleava was being shopped to the Ducks.\u003c/p\u003e\u003cp\u003eIamaleava, a five-star prospect from Long Beach, California, was recruited by UCLA out of high school. His younger brother, \u003ca href=\"https://www.espn.com/college-sports/football/recruiting/player/_/id/254812/madden-iamaleava\"\u003eMadden Iamaleava\u003c/a\u003e, committed to UCLA out of high school but changed his commitment at the last minute and signed with Arkansas.\u003c/p\u003e\u003cp\u003eWith Iamaleava a possibility at UCLA, sources told ESPN that representatives for the Bruins\u0026#39; current quarterback, \u003ca data-player-guid=\"37a6e6d3-438d-3974-bbb7-aff727b0b00e\" href=\"https://www.espn.com/college-football/player/_/id/5151948/joey-aguilar\"\u003eJoey Aguilar\u003c/a\u003e, have been covering their bases and making calls to other schools to gauge their interest in Aguilar, who transferred from Appalachian State this offseason and exited spring practice as UCLA\u0026#39;s likely starter.\u003c/p\u003e\u003cp\u003eA Power 4 general manager told ESPN\u0026#39;s Pete Thamel and Max Olson earlier this week that he thought Iamaleava has \u0026#34;zero market,\u0026#34; and added that it would be an \u0026#34;interesting test of how smart and disciplined colleges are in looking at him.\u0026#34;\u003c/p\u003e\u003cp\u003eIamaleava helped guide Tennessee to the College Football Playoff last season in his first year as a starter. He passed for 2,616 yards, 19 touchdowns and 5 interceptions, but in nine games against SEC opponents and Ohio State in the playoff, he passed for more than 200 yards only twice.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-16T21:37:00Z",
  "modifiedTime": null
}
