{
  "id": "944a1054-f9b9-475d-9399-53cd582f0163",
  "title": "Mets' Cohen: Alonso negotiations 'exhausting'",
  "link": "https://www.espn.com/mlb/story/_/id/43559666/pete-alonso-negotiations-exhausting",
  "description": "The Mets held their first winter event for fans in five years at Citi Field, and Pete Alonso was a notable absence.",
  "author": "Jorge Castillo",
  "published": "Sat, 25 Jan 2025 19:16:45 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Jorge Castillo",
  "length": 5514,
  "excerpt": "The Mets held their first winter event for fans in five years at Citi Field, and Pete Alonso was a notable absence.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "Jorge CastilloJan 25, 2025, 11:58 AM ETCloseESPN baseball reporter. Covered the Washington Wizards from 2014 to 2016 and the Washington Nationals from 2016 to 2018 for The Washington Post before covering the Los Angeles Dodgers and MLB for the Los Angeles Times from 2018 to 2024.NEW YORK -- The New York Mets held their first winter event for fans in five years at Citi Field on Saturday, and there was one notable absence. Pete Alonso wasn't in attendance because, for the first time since the 2016 draft, he isn't a member of the Mets' organization.The homegrown star first baseman remains a free agent, and though a reunion remains possible, he might have played his last game as a Met.Owner Steve Cohen bluntly said as much Saturday after taking the stage for a fireside chat with fans to chants of \"We want Pete!\"\"Personally, this has been an exhausting conversation and negotiation,\" Cohen explained. \"I mean, [Juan Soto's negotiation] was tough. This is worse. A lot of it is, we've made a significant offer. I don't like the structures that are being presented back to us. I think it's highly asymmetric against us and I feel strongly about it.\"Alonso, along with third baseman Alex Bregman, is one of the two best position players left in free agency. The first baseman, who is represented by Scott Boras, originally sought a long-term deal, but he is open to returning to the Mets on a three-year contract and the Mets have been open to such a deal, according to a source. The obstacle has been money.\"I will never say no,\" Cohen said. \"There's always the possibility. But the reality is we're moving forward and we continue to bring in players. As we continue to bring in players, the reality is it becomes harder to fit Pete into what is a very expensive group of players that we already have and that's where we are.\"I'm being brutally honest. I don't like the negotiations. I don't like what's being presented to us. Maybe that changes. I'll always stay flexible. But if it stays this way, I think we're going to have to get used to the fact that we may have to go forward with the existing players that we have.\"Boras, meanwhile, responded to Cohen's comments later Saturday.\"Pete's free agent contract structure request are identical to the standards and practices of other clubs who have signed similarly situated qualifying offer / All Star level players,\" Boras said. \"Nothing different. Just established fairness standards.\"The Mets recently re-signed outfielder/designated hitter Jesse Winker to a one-year, $7.5 million contract and added left-handed reliever A.J. Minter on a two-year, $22 million deal. They've also signed Soto (15 years, $765 million), Sean Manaea (three years, $75 million), Clay Holmes (three years, $38 million), and Frankie Montas (two years, $34 million), among other moves, this winter.Preparing for life without Alonso, the Mets recently instructed third basemen Mark Vientos and Brett Baty to work out at first base. Vientos and Baty both confirmed the organization's request Saturday.\"We all love Pete, and we've said that many times,\" Mets president of baseball operations David Stearns said. \"And I think, as we've gone through this process, we've continued to express that. We also understand that this is a business and Pete, as a free agent, deserves the right and has the right and earned the privilege, really, to see what's out there. We also feel really good about the young players who are coming through our system who have the ability to play at the major-league level.\"Vientos, 25, enjoyed a breakout season as one of the best hitters in the National League after solidifying himself as the Mets' every-day third baseman in May and helping fuel the team's run to the NL Championship Series. Baty, a former top prospect, was the club's opening day third baseman last season. He struggled after a hot start before he was demoted to Triple-A and didn't return to the majors.Mets manager Carlos Mendoza also named veterans Jared Young and Joey Meneses, both of whom signed this winter, as other options at first base if Alonso doesn't return.\"Pete's been here since I've been here,\" said Mets shortstop Francisco Lindor, who has starred for the franchise since 2021. \"He was here before me. So, yeah, it would be different if he goes somewhere else. Yeah, it would be different. But I think he should take his time. I think he should make the best decision for himself and not feel that he's rushed.\"Alonso, 30, became a fan favorite while becoming a franchise cornerstone over his six seasons in Queens. He's hit 226 home runs since making his major league debut -- the second-highest total in baseball behind only Aaron Judge. His 53 home runs in 2019 set a rookie record. He's been a reliable everyday presence; he's never missed more than nine games in a season and played in all 178 games, postseason included, in 2024. He's made four All-Star teams and won the Home Run Derby twice.But he rates as a poor defender and baserunner whose offensive production has declined over the past three seasons, creating a free agent market that hasn't been as fruitful as projected when he declined a seven-year, $158 million contract extension in 2023.Outfielder Brandon Nimmo, the longest-tenured player on the roster after debuting in 2016, signed an eight-year, $162 million contract to remain with the Mets two offseasons ago. Like Alonso, Boras is his agent. Unlike Alonso, he reached a resolution in December, not with spring training around the corner.",
  "image": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0529%2Fr1339235_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cimg src=\"https://a.espncdn.com/combiner/i?img=/photo/2024/1022/r1404132_4_130x180_smallmug.png\u0026amp;h=80\u0026amp;w=80\u0026amp;scale=crop\" alt=\"\" width=\"40\" height=\"40\"/\u003e\u003c/p\u003e\u003cp\u003eJorge Castillo\u003cspan\u003eJan 25, 2025, 11:58 AM ET\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"#\"\u003eClose\u003c/a\u003e\u003c/p\u003e\u003cul\u003eESPN baseball reporter. Covered the Washington Wizards from 2014 to 2016 and the Washington Nationals from 2016 to 2018 for The Washington Post before covering the Los Angeles Dodgers and MLB for the Los Angeles Times from 2018 to 2024.\u003c/ul\u003e\u003c/div\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eNEW YORK -- The \u003ca data-clubhouse-guid=\"d08426cc-bf13-5d7b-5217-6d4662019bc6\" href=\"https://www.espn.com/mlb/team/_/name/nym/new-york-mets\"\u003eNew York Mets\u003c/a\u003e held their first winter event for fans in five years at Citi Field on Saturday, and there was one notable absence. \u003ca data-player-guid=\"33ba43fd-9a28-0e56-1012-5c9e5881a570\" href=\"https://www.espn.com/mlb/player/_/id/37498/pete-alonso\"\u003ePete Alonso\u003c/a\u003e wasn\u0026#39;t in attendance because, for the first time since the 2016 draft, he isn\u0026#39;t a member of the Mets\u0026#39; organization.\u003c/p\u003e\u003cp\u003eThe homegrown star first baseman remains a free agent, and though a reunion remains possible, he might have played his last game as a Met.\u003c/p\u003e\u003cp\u003eOwner Steve Cohen bluntly said as much Saturday after taking the stage for a fireside chat with fans to chants of \u0026#34;We want Pete!\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Personally, this has been an exhausting conversation and negotiation,\u0026#34; Cohen explained. \u0026#34;I mean, [Juan Soto\u0026#39;s negotiation] was tough. This is worse. A lot of it is, we\u0026#39;ve made a significant offer. I don\u0026#39;t like the structures that are being presented back to us. I think it\u0026#39;s highly asymmetric against us and I feel strongly about it.\u0026#34;\u003c/p\u003e\u003cp\u003eAlonso, along with third baseman \u003ca data-player-guid=\"b28542aa-30be-6851-75c4-501226976e1c\" href=\"https://www.espn.com/mlb/player/_/id/34886/alex-bregman\"\u003eAlex Bregman\u003c/a\u003e, is one of the two best position players left in free agency. The first baseman, who is represented by Scott Boras, originally sought a long-term deal, but he is open to returning to the Mets on a three-year contract and the Mets have been open to such a deal, according to a source. The obstacle has been money.\u003c/p\u003e\u003cp\u003e\u0026#34;I will never say no,\u0026#34; Cohen said. \u0026#34;There\u0026#39;s always the possibility. But the reality is we\u0026#39;re moving forward and we continue to bring in players. As we continue to bring in players, the reality is it becomes harder to fit Pete into what is a very expensive group of players that we already have and that\u0026#39;s where we are.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m being brutally honest. I don\u0026#39;t like the negotiations. I don\u0026#39;t like what\u0026#39;s being presented to us. Maybe that changes. I\u0026#39;ll always stay flexible. But if it stays this way, I think we\u0026#39;re going to have to get used to the fact that we may have to go forward with the existing players that we have.\u0026#34;\u003c/p\u003e\u003cp\u003eBoras, meanwhile, responded to Cohen\u0026#39;s comments later Saturday.\u003c/p\u003e\u003cp\u003e\u0026#34;Pete\u0026#39;s free agent contract structure request are identical to the standards and practices of other clubs who have signed similarly situated qualifying offer / All Star level players,\u0026#34; Boras said. \u0026#34;Nothing different. Just established fairness standards.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Mets recently re-signed outfielder/designated hitter \u003ca data-player-guid=\"548501a2-f7e9-9983-e69d-47f0dad827f5\" href=\"https://www.espn.com/mlb/player/_/id/32833/jesse-winker\"\u003eJesse Winker\u003c/a\u003e to a one-year, $7.5 million contract and added left-handed reliever \u003ca data-player-guid=\"9dd265e3-1dd6-c0cd-780d-2268e34eba38\" href=\"https://www.espn.com/mlb/player/_/id/36133/aj-minter\"\u003eA.J. Minter\u003c/a\u003e on a two-year, $22 million deal. They\u0026#39;ve also signed Soto (15 years, $765 million), \u003ca data-player-guid=\"635a697b-4c21-0ae7-897d-14dc811d4a3d\" href=\"https://www.espn.com/mlb/player/_/id/33244/sean-manaea\"\u003eSean Manaea\u003c/a\u003e (three years, $75 million), \u003ca data-player-guid=\"f34f5eef-291f-61a8-884d-5bfa0d140cad\" href=\"https://www.espn.com/mlb/player/_/id/32827/clay-holmes\"\u003eClay Holmes\u003c/a\u003e (three years, $38 million), and \u003ca data-player-guid=\"063bb420-0c80-9cc7-2869-d19ba2f1e084\" href=\"https://www.espn.com/mlb/player/_/id/33249/frankie-montas\"\u003eFrankie Montas\u003c/a\u003e (two years, $34 million), among other moves, this winter.\u003c/p\u003e\u003cp\u003ePreparing for life without Alonso, the Mets recently instructed third basemen \u003ca data-player-guid=\"37bb53c3-a727-ca9e-ca54-1dcacd82d522\" href=\"https://www.espn.com/mlb/player/_/id/41034/mark-vientos\"\u003eMark Vientos\u003c/a\u003e and \u003ca data-player-guid=\"332d860c-3305-32fc-86a4-6f86cc24954f\" href=\"https://www.espn.com/mlb/player/_/id/42414/brett-baty\"\u003eBrett Baty\u003c/a\u003e to work out at first base. Vientos and Baty both confirmed the organization\u0026#39;s request Saturday.\u003c/p\u003e\u003cp\u003e\u0026#34;We all love Pete, and we\u0026#39;ve said that many times,\u0026#34; Mets president of baseball operations David Stearns said. \u0026#34;And I think, as we\u0026#39;ve gone through this process, we\u0026#39;ve continued to express that. We also understand that this is a business and Pete, as a free agent, deserves the right and has the right and earned the privilege, really, to see what\u0026#39;s out there. We also feel really good about the young players who are coming through our system who have the ability to play at the major-league level.\u0026#34;\u003c/p\u003e\u003cp\u003eVientos, 25, enjoyed a breakout season as one of the best hitters in the National League after solidifying himself as the Mets\u0026#39; every-day third baseman in May and helping fuel the team\u0026#39;s run to the NL Championship Series. Baty, a former top prospect, was the club\u0026#39;s opening day third baseman last season. He struggled after a hot start before he was demoted to Triple-A and didn\u0026#39;t return to the majors.\u003c/p\u003e\u003cp\u003eMets manager Carlos Mendoza also named veterans \u003ca data-player-guid=\"56e71829-f63b-c597-5c36-9a966b261318\" href=\"https://www.espn.com/mlb/player/_/id/41575/jared-young\"\u003eJared Young\u003c/a\u003e and \u003ca data-player-guid=\"b4d4a061-7334-cfb1-87bd-d4afde2f3ab2\" href=\"https://www.espn.com/mlb/player/_/id/34534/joey-meneses\"\u003eJoey Meneses\u003c/a\u003e, both of whom signed this winter, as other options at first base if Alonso doesn\u0026#39;t return.\u003c/p\u003e\u003cp\u003e\u0026#34;Pete\u0026#39;s been here since I\u0026#39;ve been here,\u0026#34; said Mets shortstop \u003ca data-player-guid=\"94848feb-9141-9679-d2cd-ae79905d969c\" href=\"https://www.espn.com/mlb/player/_/id/32129/francisco-lindor\"\u003eFrancisco Lindor\u003c/a\u003e, who has starred for the franchise since 2021. \u0026#34;He was here before me. So, yeah, it would be different if he goes somewhere else. Yeah, it would be different. But I think he should take his time. I think he should make the best decision for himself and not feel that he\u0026#39;s rushed.\u0026#34;\u003c/p\u003e\u003cp\u003eAlonso, 30, became a fan favorite while becoming a franchise cornerstone over his six seasons in Queens. He\u0026#39;s hit 226 home runs since making his major league debut -- the second-highest total in baseball behind only \u003ca data-player-guid=\"e3e39e69-2861-f5b5-49be-b0880534c802\" href=\"https://www.espn.com/mlb/player/_/id/33192/aaron-judge\"\u003eAaron Judge\u003c/a\u003e. His 53 home runs in 2019 set a rookie record. He\u0026#39;s been a reliable everyday presence; he\u0026#39;s never missed more than nine games in a season and played in all 178 games, postseason included, in 2024. He\u0026#39;s made four All-Star teams and won the Home Run Derby twice.\u003c/p\u003e\u003cp\u003eBut he rates as a poor defender and baserunner whose offensive production has declined over the past three seasons, creating a free agent market that hasn\u0026#39;t been as fruitful as projected when he declined a seven-year, $158 million contract extension in 2023.\u003c/p\u003e\u003cp\u003eOutfielder \u003ca data-player-guid=\"2b690698-f589-368f-f216-6df6ffa1b5da\" href=\"https://www.espn.com/mlb/player/_/id/32159/brandon-nimmo\"\u003eBrandon Nimmo\u003c/a\u003e, the longest-tenured player on the roster after debuting in 2016, signed an eight-year, $162 million contract to remain with the Mets two offseasons ago. Like Alonso, Boras is his agent. Unlike Alonso, he reached a resolution in December, not with spring training around the corner.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-25T16:58:00Z",
  "modifiedTime": null
}
