{
  "id": "ad12f3b4-53c3-4f28-af3b-c0035ab098a2",
  "title": "'It hurt I had to leave' - Van Nistelrooy reveals Man Utd pain",
  "link": "https://www.bbc.com/sport/football/articles/c5y43rr516jo",
  "description": "New Leicester boss Ruud van Nistelrooy reveals his pain at leaving Manchester United but vows to stamp his authority on the Foxes.",
  "author": "",
  "published": "Mon, 02 Dec 2024 22:31:07 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Nick Mashiter",
  "length": 4778,
  "excerpt": "New Leicester boss Ruud van Nistelrooy reveals his pain at leaving Manchester United but vows to stamp his authority on the Foxes.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "New Leicester boss Ruud van Nistelrooy has revealed his pain at leaving Manchester United but vowed to stamp his authority on the Foxes.The former Red Devils striker replaced Steve Cooper at the King Power Stadium on Friday, signing a deal until 2027.It comes after a four-game spell as interim manager at Old Trafford, following the sacking of Erik ten Hag, before he left when Ruben Amorim was appointed last month. Van Nistelrooy, brought in by Ten Hag as an assistant manager in July, oversaw three wins and one draw during his four-game stint in charge at United and was initially upset over his exit.\"The moment I took over the interim job what I said was I'm here to help United and to stay to help United, and I meant it. So I was disappointed, very much so, and it hurt I had to leave,\" he said.\"In the end I got my head round it because I also understand the new manager. I'm in football long enough and I've managed myself. I understand.\"I spoke to Ruben about it, fair enough to him, the conversation was grateful, man to man, person to person, manager to manager. That helped [me] a lot to move on and straightaway get into talks with new possibilities which of course lifted my spirits.\"Van Nistelrooy inherits a squad who struggled to bond with Cooper and have come under fire following last week's Christmas party trip to Copenhagen, with the players told their behaviour was unacceptable.He says he checked on their characters before taking the role and believes the players must respect his authority.\"It's the only way you can work,\" the Dutchman said. \"It's mutual respect. I also mentioned to the players yesterday that I looked at the squad and started to make phone calls about players, because in football everyone knows everyone.\"With two or three phone calls you hear stories about 20 players and for me it was important that you hear there are good characters there. That's important, that there are good people there.\"I look at the players and how they play. I obviously don't know them but I got general information... that they are a good bunch of people.\"Van Nistelrooy also said he was \"astonished\" by the amount of interest in him after his brief spell as United boss. Leicester moved quickly to bring in the 48-year-old after sacking Cooper on 24 November and Van Nistelrooy said he had other options. \"I have to say there were offers there and possibilities. It's good to have them and look and be critical on where you're going to work,\" said the Dutchman.\"What happened after the games and the amount of interest, the options that all of a sudden were there for me and the options that came along, I was a little bit astonished.\"I went into conversations with Leicester because I thought, having spoken to other people, it was a great opportunity to get to know each other.\"It was a good feeling and in the end both parties felt it. That was a good reason to start working together.\"Van Nistelrooy watched Saturday's 4-1 defeat at Brentford from the stands and is already clear of the target this season.He said: \"The expectations are clear, they are not easy but they are clear. It is something we face, that challenge to maintain and play in the Premier League and that is the big target for everybody.\"Van Nistelrooy arrives with a long list of priorities at Leicester.Sitting one point above the relegation zone, the Foxes are in desperate need of momentum after five defeats in their past eight games.Fans turned on the players and director of football Jon Rudkin in the defeat at Brentford and that bond, so close and crucial during the Leicester's years of success, needs to be repaired quickly.Van Nistelrooy defended the squad at his news conference after their leadership was questioned, something which appeared to be lacking at Brentford, but has clearly done his homework. There was a veiled warning that his authority cannot be questioned, especially after predecessor Cooper failed to win over all of the players, despite support from some senior members. He has played under managerial greats Sir Alex Ferguson and Fabio Capello, while also working with Guus Hiddink with the Netherlands, and will have naturally absorbed some of the traits of the world's best managers. Yet there was also warmth and a little self-deprecation as he greeted the press while he also joked about Jamie Vardy breaking his Premier League record of scoring in consecutive games in 2015.Given what the Dutchman has done in his playing career, and he also won the Dutch Cup in 2023 during his one season in charge at PSV Eindhoven, he will command instant respect.He is a world-renowned name and that will shape the esteem he is held in but, like every other manager, he needs to get results and his name will count for little if they do not arrive.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/71db/live/95168a30-b0bb-11ef-842f-8fee5458b8e4.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eNew Leicester boss Ruud van Nistelrooy has revealed his pain at leaving Manchester United but vowed to stamp his authority on the Foxes.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe former Red Devils striker replaced Steve Cooper at the King Power Stadium on Friday, \u003ca href=\"https://www.bbc.com/sport/football/articles/cx2yev3n9yjo\"\u003esigning a deal until 2027\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eIt comes after a four-game spell as interim manager at Old Trafford, following the sacking of Erik ten Hag, before he left when \u003ca href=\"https://www.bbc.com/sport/football/articles/c079zvy3j3yo\"\u003eRuben Amorim was appointed last month\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eVan Nistelrooy, \u003ca href=\"https://www.bbc.com/sport/football/articles/c047djzzeezo\"\u003ebrought in by Ten Hag as an assistant manager in July\u003c/a\u003e, oversaw three wins and one draw during his four-game stint in charge at United and was initially upset over his exit.\u003c/p\u003e\u003cp\u003e\u0026#34;The moment I took over the interim job what I said was I\u0026#39;m here to help United and to stay to help United, and I meant it. So I was disappointed, very much so, and it hurt I had to leave,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;In the end I got my head round it because I also understand the new manager. I\u0026#39;m in football long enough and I\u0026#39;ve managed myself. I understand.\u003c/p\u003e\u003cp\u003e\u0026#34;I spoke to Ruben about it, fair enough to him, the conversation was grateful, man to man, person to person, manager to manager. That helped [me] a lot to move on and straightaway get into talks with new possibilities which of course lifted my spirits.\u0026#34;\u003c/p\u003e\u003cp\u003eVan Nistelrooy inherits a squad who struggled to bond with Cooper and have come under fire following last week\u0026#39;s Christmas party trip to Copenhagen, with the \u003ca href=\"https://www.bbc.com/sport/football/articles/cy9j7wwpzrdo\"\u003eplayers told their behaviour was unacceptable.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eHe says he checked on their characters before taking the role and believes the players must respect his authority.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s the only way you can work,\u0026#34; the Dutchman said. \u0026#34;It\u0026#39;s mutual respect. I also mentioned to the players yesterday that I looked at the squad and started to make phone calls about players, because in football everyone knows everyone.\u003c/p\u003e\u003cp\u003e\u0026#34;With two or three phone calls you hear stories about 20 players and for me it was important that you hear there are good characters there. That\u0026#39;s important, that there are good people there.\u003c/p\u003e\u003cp\u003e\u0026#34;I look at the players and how they play. I obviously don\u0026#39;t know them but I got general information... that they are a good bunch of people.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eVan Nistelrooy also said he was \u0026#34;astonished\u0026#34; by the amount of interest in him after his brief spell as United boss. \u003c/p\u003e\u003cp\u003eLeicester moved quickly to bring in the 48-year-old after sacking Cooper on 24 November and Van Nistelrooy said he had other options. \u003c/p\u003e\u003cp\u003e\u0026#34;I have to say there were offers there and possibilities. It\u0026#39;s good to have them and look and be critical on where you\u0026#39;re going to work,\u0026#34; said the Dutchman.\u003c/p\u003e\u003cp\u003e\u0026#34;What happened after the games and the amount of interest, the options that all of a sudden were there for me and the options that came along, I was a little bit astonished.\u003c/p\u003e\u003cp\u003e\u0026#34;I went into conversations with Leicester because I thought, having spoken to other people, it was a great opportunity to get to know each other.\u003c/p\u003e\u003cp\u003e\u0026#34;It was a good feeling and in the end both parties felt it. That was a good reason to start working together.\u0026#34;\u003c/p\u003e\u003cp\u003eVan Nistelrooy watched Saturday\u0026#39;s \u003ca href=\"https://www.bbc.com/sport/football/live/c2e79z9wem3t\"\u003e4-1 defeat at Brentford\u003c/a\u003e from the stands and is already clear of the target this season.\u003c/p\u003e\u003cp\u003eHe said: \u0026#34;The expectations are clear, they are not easy but they are clear. It is something we face, that challenge to maintain and play in the Premier League and that is the big target for everybody.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eVan Nistelrooy arrives with a long list of priorities at Leicester.\u003c/p\u003e\u003cp\u003eSitting one point above the relegation zone, the Foxes are in desperate need of momentum after five defeats in their past eight games.\u003c/p\u003e\u003cp\u003eFans turned on the players and director of football Jon Rudkin in the defeat at Brentford and that bond, so close and crucial during the Leicester\u0026#39;s years of success, needs to be repaired quickly.\u003c/p\u003e\u003cp\u003eVan Nistelrooy defended the squad at his news conference after their leadership was questioned, something which appeared to be lacking at Brentford, but has clearly done his homework. \u003c/p\u003e\u003cp\u003eThere was a veiled warning that his authority cannot be questioned, especially after predecessor Cooper failed to win over all of the players, despite support from some senior members. \u003c/p\u003e\u003cp\u003eHe has played under managerial greats Sir Alex Ferguson and Fabio Capello, while also working with Guus Hiddink with the Netherlands, and will have naturally absorbed some of the traits of the world\u0026#39;s best managers. \u003c/p\u003e\u003cp\u003eYet there was also warmth and a little self-deprecation as he greeted the press while he also joked about Jamie Vardy breaking his Premier League record of scoring in consecutive games in 2015.\u003c/p\u003e\u003cp\u003eGiven what the Dutchman has done in his playing career, and he also won the Dutch Cup in 2023 during his one season in charge at PSV Eindhoven, he will command instant respect.\u003c/p\u003e\u003cp\u003eHe is a world-renowned name and that will shape the esteem he is held in but, like every other manager, he needs to get results and his name will count for little if they do not arrive.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-02T15:11:21.72Z",
  "modifiedTime": null
}
