{
  "id": "e0a740e6-a1ad-495d-b201-5a5b670e5a85",
  "title": "Potter 'excitement' short lived - but West Ham find 'positives'",
  "link": "https://www.bbc.com/sport/football/articles/clyn8grrkxxo",
  "description": "Graham Potter says West Ham's display at Aston Villa gave him \"encouragement\" - even if his pre-match \"excitement\" was short lived.",
  "author": "",
  "published": "Fri, 10 Jan 2025 23:55:53 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Nick Mashiter",
  "length": 5107,
  "excerpt": "Graham Potter says West Ham's display at Aston Villa gave him \"encouragement\" - even if his pre-match \"excitement\" was short lived.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "A quirk of fate meant Graham Potter's last game in management was a 2-0 defeat to Aston Villa. It cost him his job at Chelsea in April 2023, as the Blues acted less than 24 hours later to end his brief Stamford Bridge reign. Almost two years later the 49-year-old returned to the dugout to suffer another loss to Villa, this time in the FA Cup, in his first game as West Ham boss. At his Thursday unveiling, he spoke about accepting both the successes and the setbacks, his spell at Chelsea a perfect example. Potter said the Hammers felt like the \"right one\" after previously coming close to the jobs at Ajax and Leicester. He also said he was now well rested - but, after Friday's game at a freezing Villa Park, there is likely to be a little frustration.Lucas Paqueta's goal, during the Hammers' bright start, had the new manager celebrating on the sidelines just nine minutes in. At full-time, however, he was locked in conversation with assistant manager Bruno Satler on the touchline after Villa's comeback had knocked out his new side.\"The emotions were excitement,\" said Potter when he was asked how he felt before the game at his post-match news conference. \"Friday night, Villa Park, full house, 6,500 West Ham fans who were amazing.\"Our performance gave me a lot of encouragement, the way the players tried to do what we asked them to do. We're just disappointed now because we're out and wanted to go through.\"We just try to get the team into a good shape. The talent is there but it's just about trying to get the team together as a collective. That's what we're trying to do.\"After the final whistle, he walked over to salute the travelling fans who will be hoping Potter will deliver the style and substance they are demanding It is something Julen Lopetegui was unable to do in his six months in charge and Potter becomes the club's fifth manager in nine and a half years, counting David Moyes' two spells.Given time, Potter has shown he is able to enact change in the long-term after his impressive spell at Ostersunds in Sweden, taking them to the Europa League and a 2-1 win over Arsenal, before improving Swansea City and then building a super team at Brighton. Lopetegui was handed significant funds but it is Potter who needs to find how to inspire an expensively assembled squad. In the summer, striker Niclas Fullkrug arrived for £27m but has scored just three goals during an injury-hit start - and now looks likely to be out again after coming off early at Villa Park with a hamstring injury, a problem Potter expects to be \"severe\". Max Kilman and Aaron Wan-Bissaka cost a combined £55m but the Hammers have the third worst defence in the Premier League, conceding nine to Liverpool and Manchester City before Friday's defeat in Birmingham. Crysencio Summerville - also injured in the first half - has also managed just one goal in 19 league appearances after his summer move for over £25m from Leeds and Brazilian winger Luis Guilherme has made minimal impact.There is clearly talent but none of it has been realised this season and Potter starts life at the Hammers without six-goal top scorer Jarrod Bowen, out for at least six weeks with a fractured foot. Their injury problems up front could force West Ham into the market but Potter cautioned about reacting too soon. He said: \"We have to see the extent to the injuries and see how long it will take for guys to come back. We don't know the extent. If they are out it's something we have to look at.\"I'm just reacting to a game which has just finished. We have to think with everyone connected and see what we can do, if we need to do anything.\"Friday did, at least, provide some shoots of recovery. The Hammers arrived at Villa Park with two wins in their past eight league games, against struggling Wolves and Southampton, but were bright and inventive soon after kick-off.Paqueta had already gone close inside two minutes before his opener had the visiting bench off their feet and Potter punching the air. The Hammers failed to maintain it as Villa slowly got a grip of the game, especially in the second half, as injuries to Fullkrug and Summerville robbed the visitors of important outlets and stunted their momentum.Amadou Onana's equalising goal came from a corner which was wrongly awarded by referee Tim Robinson but Potter was philosophical, choosing to focus on his players instead.\"The response I've had in our preparation time and what the boys tried to do was really encouraging and positive,\" said Potter.\"The application of the players has been really good. They've carried out everything we've asked them to do in a short space of time.\"Since losing the 2006 FA Cup final to Liverpool, the Hammers have only reached the quarter-finals twice, defeats to Bristol City, AFC Wimbledon and Wigan the lowlights of a sorry recent history in the competition. Of course, Moyes took them to the Europa Conference League title in 2023 but a domestic honour has eluded the Hammers since they lifted the FA Cup in 1980. The wait goes on after a second successive third round exit but with a new manager brings new hope.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/007d/live/8a105c60-cfab-11ef-94cb-5f844ceb9e30.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eA quirk of fate meant Graham Potter\u0026#39;s last game in management was a 2-0 defeat to Aston Villa. \u003c/b\u003e\u003c/p\u003e\u003cp\u003eIt cost him his job at Chelsea in April 2023, as the Blues acted less than 24 hours later to end his brief Stamford Bridge reign. \u003c/p\u003e\u003cp\u003eAlmost two years later the 49-year-old returned to the dugout to suffer\u003ca href=\"https://www.bbc.com/sport/football/live/clyx3p7xemkt\"\u003e another loss to Villa,\u003c/a\u003e this time in the FA Cup, in his first game as West Ham boss. \u003c/p\u003e\u003cp\u003eAt his Thursday unveiling, he spoke about accepting both the successes and the setbacks, \u003ca href=\"https://www.bbc.com/sport/football/64205562\"\u003ehis spell at Chelsea a perfect example\u003c/a\u003e. \u003c/p\u003e\u003cp\u003ePotter said the Hammers felt like the \u0026#34;right one\u0026#34; after previously coming close to the jobs at Ajax and Leicester. \u003c/p\u003e\u003cp\u003eHe also said he was now well rested - but, after Friday\u0026#39;s game at a freezing Villa Park, there is likely to be a little frustration.\u003c/p\u003e\u003cp\u003eLucas Paqueta\u0026#39;s goal, during the Hammers\u0026#39; bright start, had the new manager celebrating on the sidelines just nine minutes in. \u003c/p\u003e\u003cp\u003eAt full-time, however, he was locked in conversation with assistant manager Bruno Satler on the touchline after Villa\u0026#39;s comeback had knocked out his new side.\u003c/p\u003e\u003cp\u003e\u0026#34;The emotions were excitement,\u0026#34; said Potter when he was asked how he felt before the game at his post-match news conference. \u0026#34;Friday night, Villa Park, full house, 6,500 West Ham fans who were amazing.\u003c/p\u003e\u003cp\u003e\u0026#34;Our performance gave me a lot of encouragement, the way the players tried to do what we asked them to do. We\u0026#39;re just disappointed now because we\u0026#39;re out and wanted to go through.\u003c/p\u003e\u003cp\u003e\u0026#34;We just try to get the team into a good shape. The talent is there but it\u0026#39;s just about trying to get the team together as a collective. That\u0026#39;s what we\u0026#39;re trying to do.\u0026#34;\u003c/p\u003e\u003cp\u003eAfter the final whistle, he walked over to salute the travelling fans who will be hoping Potter will deliver the style and substance they are demanding \u003c/p\u003e\u003cp\u003eIt is something \u003ca href=\"https://www.bbc.com/sport/football/articles/cvg9g5d4ge3o\"\u003eJulen Lopetegui was unable to do in his six months in charge\u003c/a\u003e and Potter becomes the club\u0026#39;s fifth manager in nine and a half years, counting David Moyes\u0026#39; two spells.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eGiven time, Potter has shown he is able to enact change in the long-term after his impressive spell at Ostersunds in Sweden, taking them to the Europa League and a 2-1 win over Arsenal, before improving Swansea City and then building a super team at Brighton. \u003c/p\u003e\u003cp\u003eLopetegui was handed significant funds but it is Potter who needs to find how to inspire an expensively assembled squad. \u003c/p\u003e\u003cp\u003eIn the summer, striker \u003ca href=\"https://www.bbc.com/sport/football/articles/c77llr5y035o#:~:text=West%20Ham%20have%20signed%20Germany,a%20Champions%20League%20runner%2Dup.\"\u003eNiclas Fullkrug arrived for £27m\u003c/a\u003e but has scored just three goals during an injury-hit start - and now looks likely to be out again after coming off early at Villa Park with a hamstring injury, a problem Potter expects to be \u0026#34;severe\u0026#34;. \u003c/p\u003e\u003cp\u003eMax Kilman and Aaron Wan-Bissaka cost a combined £55m but the Hammers have the third worst defence in the Premier League, conceding nine to Liverpool and Manchester City before Friday\u0026#39;s defeat in Birmingham. \u003c/p\u003e\u003cp\u003eCrysencio Summerville - also injured in the first half - has also managed just one goal in 19 league appearances after his summer move for over £25m from Leeds and Brazilian winger Luis Guilherme has made minimal impact.\u003c/p\u003e\u003cp\u003eThere is clearly talent but none of it has been realised this season and Potter starts life at the Hammers without six-goal top scorer Jarrod Bowen, out for at least six weeks with a fractured foot. \u003c/p\u003e\u003cp\u003eTheir injury problems up front could force West Ham into the market but Potter cautioned about reacting too soon. \u003c/p\u003e\u003cp\u003eHe said: \u0026#34;We have to see the extent to the injuries and see how long it will take for guys to come back. We don\u0026#39;t know the extent. If they are out it\u0026#39;s something we have to look at.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m just reacting to a game which has just finished. We have to think with everyone connected and see what we can do, if we need to do anything.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eFriday did, at least, provide some shoots of recovery. \u003c/p\u003e\u003cp\u003eThe Hammers arrived at Villa Park with two wins in their past eight league games, against struggling Wolves and Southampton, but were bright and inventive soon after kick-off.\u003c/p\u003e\u003cp\u003ePaqueta had already gone close inside two minutes before his opener had the visiting bench off their feet and Potter punching the air. \u003c/p\u003e\u003cp\u003eThe Hammers failed to maintain it as Villa slowly got a grip of the game, especially in the second half, as injuries to Fullkrug and Summerville robbed the visitors of important outlets and stunted their momentum.\u003c/p\u003e\u003cp\u003eAmadou Onana\u0026#39;s equalising goal came from a corner which was wrongly awarded by referee Tim Robinson but Potter was philosophical, choosing to focus on his players instead.\u003c/p\u003e\u003cp\u003e\u0026#34;The response I\u0026#39;ve had in our preparation time and what the boys tried to do was really encouraging and positive,\u0026#34; said Potter.\u003c/p\u003e\u003cp\u003e\u0026#34;The application of the players has been really good. They\u0026#39;ve carried out everything we\u0026#39;ve asked them to do in a short space of time.\u0026#34;\u003c/p\u003e\u003cp\u003eSince losing the 2006 FA Cup final to Liverpool, the Hammers have only reached the quarter-finals twice, defeats to Bristol City, AFC Wimbledon and Wigan the lowlights of a sorry recent history in the competition. \u003c/p\u003e\u003cp\u003eOf course, Moyes took them to the Europa Conference League title in 2023 but a domestic honour has eluded the Hammers since they lifted the FA Cup in 1980. \u003c/p\u003e\u003cp\u003eThe wait goes on after a second successive third round exit but with a new manager brings new hope. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-10T23:55:53.805Z",
  "modifiedTime": null
}
