{
  "id": "f51e3f44-2749-4dbb-a327-ddd72a649c28",
  "title": "Shaw wants WSL leaders Man City to be 'unstoppable'",
  "link": "https://www.bbc.com/sport/football/articles/cpvz0wwv22mo",
  "description": "Striker Khadija Shaw says Manchester City want to be \"unstoppable\" after her hat-trick helps the Women's Super League leaders thrash Tottenham at Etihad Stadium.",
  "author": "",
  "published": "Fri, 08 Nov 2024 23:08:58 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Emma Sanders",
  "length": 3863,
  "excerpt": "Striker Khadija Shaw says Manchester City want to be \"unstoppable\" after her hat-trick helps the Women's Super League leaders thrash Tottenham at Etihad Stadium.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Khadija Shaw says Manchester City want to raise their level to be \"unstoppable\" after comfortably beating Tottenham at Etihad Stadium.The Jamaica forward scored a hat-trick - her third against Tottenham - as City cruised to a 4-0 win to extend their lead at the top of the Women's Super League (WSL) table.Shaw's first goal came after just 24 seconds when she pounced on an error by Tottenham defender Clare Hunt, and her hat-trick was complete in the 67th minute.\"I just pride myself in trying to work for the team, because I know with the players I have around me I'm going to get opportunities,\" Shaw told Sky Sports. \"I'm quite a confident player and I know what I can do on the pitch, and Tottenham is no different. I'm just scoring against them - what can I say?\"Once we go at every game on the front foot from the first whistle, we're really good. \"We have to keep going and see where we can raise the level even better, so when we get to that level, we're unstoppable.\"There was a hat-trick of assists for England international Lauren Hemp, who provided the crosses for Shaw's second and third goals - and the City forwards have built a strong bond on and off the pitch. \"We've got a great relationship. It helps. It shows with the connection we've got on the pitch. It definitely is like that off the pitch,\" said Hemp. \"She's a great laugh and I feel like we've got such a good connection. If I put a bad ball in, she will be the first to tell me. \"If she didn't finish one of my crosses, I will be the first to tell her, which is what you need in this squad. We've got a mutual respect.\"I always know she's going to be there. Sometimes I don't even need to look up and I know she's going to be there.\"Hemp and Shaw top the tables for most assists and goals respectively in the WSL this season and they do not look like slowing down.City captain Alex Greenwood says Shaw \"scores when she wants\" and that it is great to see her combining with Hemp so well.\"When I stand at the back and I watch them, it's obviously really enjoyable,\" she added.\"They speak a lot, they work on things, it's something they talk about quite a lot. They've got a great connection and it showed tonight.\"While it was an enjoyable evening for Manchester City, it was a night to forget for Tottenham as they were comfortably beaten.There was a catalogue of individual errors, and they were perhaps fortunate not to have conceded even more goals, particularly in the first half.Spurs boss Robert Vilahamn says the early goal by Shaw \"killed momentum\" and his side struggled to recover. \"Mentally it's really hard - you can see the self-confidence of the players is lost for a while before they come back into the game,\" he told Sky Sports.\"We just need to understand how good [City] are in the second half and that we don't give away any more [goals].\"It's a mixture of quality as well. The mistakes is something we need to develop - we need to do better actions in some of these situations. \"We need to find ways to not concede these goals so easily. Self-confidence is a mixture of performances, so it's a mix of things.\"Defender Molly Bartrip said the goal was the worst possible way to start against City and they were then facing an uphill battle. But she added it is on the players to \"question each other\" about why they are making so many errors, which she insisted is \"not good enough\".\"Our identity is going to be playing out from the back and it’s something we want to do. I don't think we will change our game in that way,\" she added.\"Of course, there’s a time and place for it. If we're not doing it well, then we have to start going longer and stretch the game.\"But we are conceding goals way too easily and it's something we need to address.\"We have to start analysing it and questioning each other on why these goals have gone it. It's obviously not good enough.\"",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/3bf6/live/3cb7d7e0-9e23-11ef-99c0-7bfcdd3c12ca.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eKhadija Shaw says Manchester City want to raise their level to be \u0026#34;unstoppable\u0026#34; after comfortably beating Tottenham at Etihad Stadium.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe Jamaica forward scored a hat-trick - her third against Tottenham - as City cruised to a \u003ca href=\"https://www.bbc.com/sport/football/live/cp8xy44gmd3t\"\u003e4-0 win\u003c/a\u003e to extend their lead at the top of the Women\u0026#39;s Super League (WSL) table.\u003c/p\u003e\u003cp\u003eShaw\u0026#39;s first goal came after just 24 seconds when she pounced on an error by Tottenham defender Clare Hunt, and her hat-trick was complete in the 67th minute.\u003c/p\u003e\u003cp\u003e\u0026#34;I just pride myself in trying to work for the team, because I know with the players I have around me I\u0026#39;m going to get opportunities,\u0026#34; Shaw told Sky Sports. \u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m quite a confident player and I know what I can do on the pitch, and Tottenham is no different. I\u0026#39;m just scoring against them - what can I say?\u003c/p\u003e\u003cp\u003e\u0026#34;Once we go at every game on the front foot from the first whistle, we\u0026#39;re really good. \u003c/p\u003e\u003cp\u003e\u0026#34;We have to keep going and see where we can raise the level even better, so when we get to that level, we\u0026#39;re unstoppable.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThere was a hat-trick of assists for England international Lauren Hemp, who provided the crosses for Shaw\u0026#39;s second and third goals - and the City forwards have built a strong bond on and off the pitch. \u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;ve got a great relationship. It helps. It shows with the connection we\u0026#39;ve got on the pitch. It definitely is like that off the pitch,\u0026#34; said Hemp. \u003c/p\u003e\u003cp\u003e\u0026#34;She\u0026#39;s a great laugh and I feel like we\u0026#39;ve got such a good connection. If I put a bad ball in, she will be the first to tell me. \u003c/p\u003e\u003cp\u003e\u0026#34;If she didn\u0026#39;t finish one of my crosses, I will be the first to tell her, which is what you need in this squad. We\u0026#39;ve got a mutual respect.\u003c/p\u003e\u003cp\u003e\u0026#34;I always know she\u0026#39;s going to be there. Sometimes I don\u0026#39;t even need to look up and I know she\u0026#39;s going to be there.\u0026#34;\u003c/p\u003e\u003cp\u003eHemp and Shaw top the tables for most assists and goals respectively in the WSL this season and they do not look like slowing down.\u003c/p\u003e\u003cp\u003eCity captain Alex Greenwood says Shaw \u0026#34;scores when she wants\u0026#34; and that it is great to see her combining with Hemp so well.\u003c/p\u003e\u003cp\u003e\u0026#34;When I stand at the back and I watch them, it\u0026#39;s obviously really enjoyable,\u0026#34; she added.\u003c/p\u003e\u003cp\u003e\u0026#34;They speak a lot, they work on things, it\u0026#39;s something they talk about quite a lot. They\u0026#39;ve got a great connection and it showed tonight.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eWhile it was an enjoyable evening for Manchester City, it was a night to forget for Tottenham as they were comfortably beaten.\u003c/p\u003e\u003cp\u003eThere was a catalogue of individual errors, and they were perhaps fortunate not to have conceded even more goals, particularly in the first half.\u003c/p\u003e\u003cp\u003eSpurs boss Robert Vilahamn says the early goal by Shaw \u0026#34;killed momentum\u0026#34; and his side struggled to recover. \u003c/p\u003e\u003cp\u003e\u0026#34;Mentally it\u0026#39;s really hard - you can see the self-confidence of the players is lost for a while before they come back into the game,\u0026#34; he told Sky Sports.\u003c/p\u003e\u003cp\u003e\u0026#34;We just need to understand how good [City] are in the second half and that we don\u0026#39;t give away any more [goals].\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a mixture of quality as well. The mistakes is something we need to develop - we need to do better actions in some of these situations. \u003c/p\u003e\u003cp\u003e\u0026#34;We need to find ways to not concede these goals so easily. Self-confidence is a mixture of performances, so it\u0026#39;s a mix of things.\u0026#34;\u003c/p\u003e\u003cp\u003eDefender Molly Bartrip said the goal was the worst possible way to start against City and they were then facing an uphill battle. \u003c/p\u003e\u003cp\u003eBut she added it is on the players to \u0026#34;question each other\u0026#34; about why they are making so many errors, which she insisted is \u0026#34;not good enough\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;Our identity is going to be playing out from the back and it’s something we want to do. I don\u0026#39;t think we will change our game in that way,\u0026#34; she added.\u003c/p\u003e\u003cp\u003e\u0026#34;Of course, there’s a time and place for it. If we\u0026#39;re not doing it well, then we have to start going longer and stretch the game.\u003c/p\u003e\u003cp\u003e\u0026#34;But we are conceding goals way too easily and it\u0026#39;s something we need to address.\u003c/p\u003e\u003cp\u003e\u0026#34;We have to start analysing it and questioning each other on why these goals have gone it. It\u0026#39;s obviously not good enough.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-08T23:08:58.462Z",
  "modifiedTime": null
}
