{
  "id": "6aa33e3b-dc6a-480a-afae-102d85e81f61",
  "title": "Free People Movement Is Your One-Stop Holiday Shop: 21 Gifts Under $100",
  "link": "https://www.refinery29.com/en-us/free-people-movement-under-100-gifts?utm_source=feed\u0026utm_medium=rss",
  "description": "It’s truly never too early to start holiday shopping, and Free People — more specifically, FP Movement — can be your one-stop shop for all the fitness buffs and cozy connoisseurs in your life. The Refinery29 reader-favorite retailer has a gift shop full of athleisure essentials, lounge styles, and activewear accessories, many of which are priced under $100. Whether it’s a $98 fleece sweatshirt, $50 slides, or a $20 ribbed beanie, we’re sure anyone on your list would be ecstatic to receive any of the Free People gifts this holiday season. (Also, a FP Movement gift card will always delight your giftee.)Ahead, peruse the best under-$100 gifts worth carting up at Free People this holiday season.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.For more can't-miss shopping stories delivered straight to your inbox, sign up for our Most Wanted newsletter.FP Movement Mountain High 1/2 Zip FleeceFree People knows a thing or two about ultra-cozy styles, and this editor-favorite fleece pullover is an excellent example. The relaxed half-zip can be worn on its own or layered up, and is great for outdoor winter activities and travel. Choosing this under-$100 gift is easy — picking a color will be a bit harder. (Good news: You can’t go wrong with any of them.)Shop Free PeopleFP Movement Mountain High 1/2 Zip Fleece, $, available at Free PeopleFP Movement Cool Down BeanieKeep your giftee cozy in the frigid winter with a chunky, ribbed beanie. This top-rated style has gained repeat customers who have noted that the fabric keeps their heads warm, without getting too hot.Shop Free PeopleFP Movement Movement Cool Down Beanie, $, available at Free PeopleFP Movement Hot Shot OnesieRather than a kitschy holiday onesie, opt for a more versatile pajama that your giftee will actually want to wear all the time. We propose this style from the fan-favorite Hot Shot collection, which has gained a 4.7-out-of-5 star rating from over 2.4K reviewers who generally say they own several of the 15 color options.Shop Free PeopleFP Movement Hot Shot Onesie, $, available at Free PeopleFP Movement All Clear Leopard CamiYou can shop the top-rated All Clear Solid Cami, or you could scoop up this new printed version, which is a tad more special for the holidays. Leopard print will likely remain strong in the new year, so this trendy top will no doubt be a crowd pleaser.  Shop Free PeopleFP Movement All Clear Leopard Cami, $, available at Free PeopleFP Movement Quilted Carryall BagThis oversized bag is one of FP Movement’s most popular products — and it’s beloved by Refinery29 editors, too. The versatile and spacious carry-all can be toted around everywhere from the gym to work, and comes in over 30 cheery colorways, so everyone on your list can have their own.Shop Free PeopleFP Movement Quilted Carryall Bag, $, available at Free PeopleFP Movement So Fly Henley LayerThis season, gift a chic and cozy ribbed henley top that’ll instantly become your giftee’s go-to winter wear. This pullover with snap-buttons, an oversized collar, and adorable sleeve pocket is great to layer over tanks and under jackets for cozy days in or active days out. Shop Free PeopleFP Movement So Fly Henley Layer, $, available at Free PeopleFP Movement Classic Ruffle SocksSocks are a tried-and-true holiday gift — and this ruffled pair is special enough to dress up your giftee’s sneakers or ballet flats, so it’s less likely to elicit an eye-roll. Pick up a few in festive colors to give as a set or to split up among several lucky friends. Shop Free PeopleFP Movement Movement Classic Ruffle Socks, $, available at Free PeopleFP Movement Hot Shot Crossover SetA lounge set? For under $100? Sign us up! This muscle tee and ankle pant set is perfect for the giftee who’s favorite pastime is lounging around the house or the hardcore gym-goer who needs a change of clothes on hand. Shop Free PeopleFP Movement Hot Shot Crossover Set, $, available at Free PeopleFP Movement x Yoga Design Lab Cork Yoga BlockWhether you know a proficient yogi or someone who’s just starting off their journey, this biodegradable natural cork yoga block is a thoughtful, useful, and unexpectedly beautiful gift. It’ll become their favorite addition to their at-home or in-studio practices. Shop Free PeopleFP Movement x Yoga Design Lab Cork Yoga Block, $, available at Free PeopleFP Movement Never Better Foldover PantsRather than a pair of leggings (which everyone has very particular preferences about), consider gifting a pair of more versatile pants. We’re loving these stretchy, buttery-soft ones with a foldover waistband that can be customized for your height. The red colorway feels especially festive. Shop Free PeopleFP Movement Never Better Foldover Pants, $, available at Free PeopleFP Movement Hit The Slopes BalaclavaThe snowboarder or skier in your life will no doubt appreciate this fleece balaclava, which will effectively keep them protected from the harsh winter elements and can also be styled with their favorite FP Movement fleece hoodie, jacket, or vest. Shop Free PeopleFP Movement Hit The Slopes Balaclava, $, available at Free PeopleFP Movement Final Call HoodieWe all need a wear-anywhere hoodie, and this versatile option will upgrade your giftee’s athleisure collection. The oversized, slouchy, and relaxed fit is effortless, and has already gained highly positive reviews, with one customer writing: “I have this hoodie in 4 colors. I just fell in love with them. Very soft and comfy.”Shop Free PeopleFP Movement Final Call Hoodie, $, available at Free PeopleFP Movement Quilted Duffle If your giftee already owns (and loves) the brand’s quilted carry-all, expand their puffy bag collection to include the duffle version, which could be the perfect carry-on or weekender bag for the stylish traveler in your life. Looking for even more bang for your buck? Consider bundling the quilted mini case and micro pouch for a $50 gift. Shop Free PeopleFP Movement Quilted Duffle, $, available at Free PeopleFP Movement Never Better Long TankThis workout tank is business in the front, party in the back for the fitness queen on your list. It’s designed with a sweat-wicking material and built-in shelf bra for low-to-medium impact workouts, like pilates and weight training. Shop Free PeopleFP Movement Never Better Long Tank, $, available at Free PeopleFP Movement 28\" Stirrup LegwarmersThe winter is leg warmer season, and FP Movement offers several — we’re eyeing this stirrup style, which ensures they won’t ride up and can be styled with your favorite boots for holiday festivities or on their own to dance class.  Shop Free PeopleFP Movement 28\" Stirrup Legwarmers, $, available at Free PeopleFP Movement Scout It Out Fleece VestThis bow-adorned, water-resistant fleece vest will quickly become your giftee’s favorite cold-weather layer, whether they wear it post-workout, to run errands, or for chilly camping trips.Shop Free PeopleFP Movement Scout It Out Fleece Vest, $, available at Free PeopleFP Movement Apres Ski Team Pom BeanieNo, your giftee doesn’t need to be an avid skier to appreciate this fashion-forward beanie. Overall, it’s a fun cold-weather accessory that’ll stand out from their other wintry hats. Shop Free PeopleFP Movement Apres Ski Team Pom Beanie, $, available at Free PeopleFP Movement Carpe Diem ShortsRun clubs seemed to only multiply in 2024, so, for the new (or avid) runner on your shopping list, box up a pair of running shorts that are as stylish as they are functional. This fluttery pair with water-resistant fabric, built-in briefs, interior pocket, and no-slip waistband comes in 14 colors to complement anyone’s personal style.Shop Free PeopleFP Movement Carpe Diem Shorts, $, available at Free PeopleFP Movement x Mayim Exclusive 24oz Collapsible Carabiner BottleThis collapsible silicone reusable bottle from Mayim is one of this editor’s favorite travel companions. Now, it’s available in a handful of new colorways exclusive to FP Movement. It’s great for the giftee who has long commutes or is a frequent flyer and wants to hook it onto their backpack or tote with the attached carabiner clip.Shop Free PeopleFP Movement x Mayim Exclusive 24oz Collapsible Carabiner Bottle, $, available at Free PeopleFP Movement Hot Shot Tee RomperAnother one-and-done cozy outfit that’s sure to please is this relaxed romper that can be worn for tennis practice, nature walks, or internet surfing, on its own or over your favorite FP Movement sports bra and bike shorts. Shop Free PeopleFP Movement Hot Shot Tee Romper, $, available at Free PeopleFP Movement Halftime SlidesDesigned for pre- and post-workout wear, these slip-on slides with super cushiony soles and strong traction are the gift that keeps on giving. The bright-colored style can serve as your giftee’s studio-to-street shoes or at-home slippers.Shop Free PeopleFP Movement Halftime Slides, $, available at Free PeopleLike what you see? How about some more R29 goodness, right here?23 Unique Advent Calendars We're Gifting This YearThe 24 Best Free People Sale Styles For Under $10025 Winter Wedding Guest Dresses, Jumpsuits \u0026 Pants",
  "author": "Victoria Montalti",
  "published": "Tue, 29 Oct 2024 16:16:19 +0000",
  "source": "https://www.refinery29.com/fashion/rss.xml",
  "categories": null,
  "byline": "Victoria Montalti",
  "length": 858,
  "excerpt": "If you’re looking to start your holiday shopping, check out FP Movement for cozy athleisure. We’ve curated the 21 best gifts under $100.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "Photo: Courtesy of Free People.It’s truly never too early to start holiday shopping, and Free People — more specifically, FP Movement — can be your one-stop shop for all the fitness buffs and cozy connoisseurs in your life. The Refinery29 reader-favorite retailer has a gift shop full of athleisure essentials, lounge styles, and activewear accessories, many of which are priced under $100. Whether it’s a $98 fleece sweatshirt, $50 slides, or a $20 ribbed beanie, we’re sure anyone on your list would be ecstatic to receive any of the Free People gifts this holiday season. (Also, a FP Movement gift card will always delight your giftee.)Ahead, peruse the best under-$100 gifts worth carting up at Free People this holiday season.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.",
  "image": "https://www.refinery29.com/images/11801054.jpg?crop=2000%2C1051%2Cx0%2Cy39",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"r29-container\"\u003e\u003carticle\u003e\u003cdiv id=\"article-main-content\"\u003e\u003cdiv\u003e\u003cfigure\u003e\u003ca href=\"https://www.refinery29.com/en-us/free-people-movement-under-100-gifts?utm_medium=rss\u0026amp;utm_source=feed#slide-1\"\u003e\u003c/a\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of Free People.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\u003cp\u003eIt’s truly never too early to start holiday shopping, and Free People — more specifically, \u003ca href=\"https://www.refinery29.com/en-us/free-people-fp-movement-pippa-packable-puffer-jacket-review\"\u003eFP Movement\u003c/a\u003e — can be your one-stop shop for all the fitness buffs \u003cem\u003eand\u003c/em\u003e cozy connoisseurs in your life. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe Refinery29 reader-favorite retailer has a \u003ca href=\"https://www.freepeople.com/fpmovement/fp-movement-activewear-gifts/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003egift shop\u003c/a\u003e full of athleisure essentials, \u003ca href=\"https://www.refinery29.com/en-us/best-matching-sweatsuits-womens\"\u003elounge styles\u003c/a\u003e, and activewear accessories, many of which are priced \u003ca href=\"https://www.refinery29.com/en-us/best-free-people-sale-deals\"\u003eunder $100\u003c/a\u003e. Whether it’s a $98 fleece sweatshirt, $50 slides, or a $20 ribbed beanie, we’re sure anyone on your list would be ecstatic to receive any of the Free People gifts this holiday season. (Also, a \u003ca href=\"https://www.freepeople.com/fpmovement/shop/fp-movement-gift-card/?color=000\u0026amp;type=REGULAR\u0026amp;quantity=1\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eFP Movement gift card\u003c/a\u003e will always delight your giftee.)\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAhead, peruse the best under-$100 gifts worth carting up at Free People this holiday season.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2024-10-29T16:16:19Z",
  "modifiedTime": null
}
