{
  "id": "b64a978c-64ae-49cf-9bc4-22c2dca0e1b1",
  "title": "Don’t Come for Erin Andrews’s Job",
  "link": "https://www.elle.com/fashion/shopping/a63575069/erin-andrews-career-interview-2025/",
  "description": "Ahead of the Super Bowl, the Fox Sports broadcaster talks Taylor Swift, succeeding in a male-dominated field, and launching a viral clothing brand.",
  "author": "",
  "published": "Mon, 03 Feb 2025 22:03:00 +0000",
  "source": "https://www.elle.com/rss/fashion.xml/",
  "categories": null,
  "byline": "",
  "length": 7426,
  "excerpt": "Ahead of the Super Bowl, the Fox Sports broadcaster talks Taylor Swift, succeeding in a male-dominated field, and launching a viral clothing brand.",
  "siteName": "ELLE",
  "favicon": "https://www.elle.com/_assets/design-tokens/elle/static/images/apple-touch-icon.0dd915e.png",
  "text": "In ELLE.com’s series Office Hours, we ask people in powerful positions to take us through their first jobs, worst jobs, and everything in between. This month, we spoke to Erin Andrews, one of the most prolific women in sports media. She got her start as a College GameDay reporter for ESPN more than 20 years ago and has been working the sidelines ever since. In 2012, Andrews joined Fox Sports and remains one of the network leads as an NFL reporter. Andrews has always been a fan favorite, in part because of her vulnerability and resilience: Throughout her years in the spotlight, she’s openly faced a public court battle, a cancer battle, and struggles with infertility. For her contribution to the field, Andrews received Vince Lombardi’s Award of Excellence in 2022; she also became the first woman to be honored with the Pat Summerall Award. These days, Andrews co-hosts a podcast, Calm Down, with Fox Sports colleague Charissa Thompson and runs WEAR by Erin Andrews, an apparel and accessory line for sports fans. Ahead of the Super Bowl, where she’ll be reporting live, Andrews talks work-life balance, sexism, and all things Taylor Swift. My first jobMy first job was at American Eagle. (I really wanted to go to Abercrombie, because that’s where some of my guy friends worked.) From there, our manager moved to Banana Republic, so we all moved up, too. Khakis for everyone.My worst job I was a ride operator at Adventure Island in Tampa, Florida. This is before I was worried about wrinkles, pigmentation, and skin cancer; I just really wanted to crush the old tan situation. Tampa is the lightning capital, and when you’re stuck on the highest ride, and you see a storm start rolling in, you’re like, “Is this the way I’m going to go out? At Adventure Island by a lightning strike?” I remember we were getting everybody off the ride, and it was a tube slide, so I had to ride down last. It was like a scene from Twister. Courtesy of Erin Andrews + Design by Leah RomeroThe best career advice I’ve received Hustle like you’re broke. I’ve never worked harder than I do now. The other one is: If you’re going to do this for a living, you better have thick skin. When I first started—and this is going to age me so much—I used to read the message boards, and it would ruin my day. People talked about how big my nose was, how my voice was like nails on a chalkboard. I don’t have a “Delilah After Dark” voice, I get that. But I have worked really hard, and that’s why I’m in this industry. The biggest lesson I’ve learned When I was young, I was so excited about being involved in sports broadcasting. Nothing really phased me. And then I dealt with adversity. I dealt with a stalker; I dealt with a public court case, and that taught me a lot. I didn’t think I was ever going to work again [due to the nature of the case]. I thought I’d never be taken seriously again. That really tested my inner strength to see if I wanted to show my face—and for me, showing my face means being in front of crowds of 80,000 people. Then I got diagnosed with cancer, and that was like, holy shit. The biggest thing it taught me was how strong I am. I’ve been tested in a lot of different ways, and I’m still kicking. Why I launched WEARI love dressing up and cheering for my team, but as I got older, and my style changed, it was like, Where am I going to find clothes that represent the kind of fan I am? Then I met my husband, and his hockey team went to the playoffs and won the Stanley Cup, and I was like, What am I wearing for the parade? When you go into pro shops, there’s a huge selection for men and maybe a few options for women. I wasn’t into what I was being offered as a fan. So, we put our nose to the grindstone. Finally, we partnered with Fanatics, and we created everything that I hoped to and more.And look, [working multiple jobs] is hard. I miss a lot of stuff. I miss holidays. But beside being with my son and husband, there’s no place I’d rather be than here [doing my job]. This is my happy place, and I know for me to be a better mom and a better person, I have to be doing this. I’m a better version of myself when I have a lot going on. The dream job I haven’t done yet I want to be on Jenna \u0026 Friends. I really enjoyed my time on the Today Show, so I’m manifesting that. I want to be on Sesame Street, because my kid is obsessed with Elmo. Saturday Night Live is a big one. I would love to do that. I would love to do more fashion and podcast collabs, too. We have a collaboration with Rebecca Minkoff that we’re super excited about and one for the Super Bowl. Rebecca Minkoff x Wear Super Bowl LIX Tabitha Oversized Moto JacketOn women’s sports getting long overdue recognitionIt’s nothing new for me to be the only female that travels with 30 guys. I’m very comfortable in that role. It’s cool that they are having a moment—we are having a moment—and it’s only going to get bigger and better. But that’s because of the foundation that was laid by women who didn’t take “no” for an answer, who looked to find ways to prove people wrong, to find ways to get the job done. So, it’s a really fun moment, but I don’t think any of us should be satisfied. I think we should keep pushing. How I envision the future of women in sports I see an unlimited future. I really do. But it’s only going to come if people continue to push and demand to be in certain positions and roles. Something that was said to me when I got into the industry was, “You can get your foot in the door, because you’re a woman, but if you’re going to stay, you have to work that much harder.” That’s the chip on my shoulder. I have no idea why Taylor Swift put the line, “Don’t come for my job,” at the end of “I Can Do It With a Broken Heart,” but I fucking love that line. There are so many times I’ve felt that way. Don’t come for my job. I have worked so hard for this. My proudest career momentWe launched WEAR in 2019, so COVID was our second year. Then, in 2021, I remember walking out on the field for my first game of the season—it was Vikings vs. Packers in Minnesota—and everybody was excited to be back. So many women were in the front row wearing WEAR, and our security guard looked up and goes, “E.A., I think this shit’s about to be big.” That was a really cool moment, to come back from the pandemic and see that we were still able to grow and that people were so excited to wear it. And then to see Taylor Swift show up not once but three times in our gear, I was just so thankful that she recognized our small female-owned, female-run business. When she first walked into that Thursday night game in our windbreaker, I was screaming and crying. And then when she walked into the 2024 AFC Championship in WEAR, I was like, Come on, enough is enough. I wasn’t even thinking of it for the 2024 Super Bowl, so when I saw what she was wearing, I just started crying on the plane, and the flight attendant was like, “You good?” I was like, “No, I’ll have a double tequila and water. Thank you.” It was amazing. It was one of our biggest moments.My mantra “What would Taylor do?” The song “The Man” is my anthem. My girlfriend Charissa Thompson, who does my Calm Down podcast with me, we deal with assholes, and we’re always like “OK. What would Taylor do?” You never see her be nasty. You never see her be catty. She always handles things so professionally.This interview has been edited and condensed for clarity.",
  "image": "https://hips.hearstapps.com/hmg-prod/images/office-hours-index-679bdd7f97bc6.jpg?crop=1.00xw:1.00xh;0,0\u0026resize=1200:*",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-journey-body=\"standard-article\"\u003e\u003cp data-journey-content=\"true\" data-node-id=\"0\"\u003e\u003cem\u003eIn ELLE.com’s series Office Hours, we ask people in powerful positions to take us through their first jobs, worst jobs, and everything in between. This month, we spoke to Erin Andrews, one of the most prolific women in sports media. She got her start as a \u003c/em\u003eCollege GameDay\u003cem\u003e reporter for ESPN more than 20 years ago and has been working the sidelines ever since. In 2012, Andrews joined Fox Sports and remains one of the network leads as an NFL reporter. \u003c/em\u003e\u003cem\u003eAndrews has always been a fan favorite, in part because of her vulnerability and resilience:\u003c/em\u003e\u003cem\u003e \u003c/em\u003e\u003cem\u003e\u003c/em\u003e\u003cem\u003eThroughout her years in the spotlight, she’s openly \u003cstrong\u003e\u003c/strong\u003efaced a \u003cstrong\u003e\u003c/strong\u003e\u003ca href=\"https://www.reuters.com/article/lifestyle/tv-personality-erin-andrews-settles-video-stalker-case-reports-idUSKCN0XM25W/\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.reuters.com/article/lifestyle/tv-personality-erin-andrews-settles-video-stalker-case-reports-idUSKCN0XM25W/\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"public court battle\"\u003epublic court battle\u003c/a\u003e, a cancer battle, and struggles with infertility. \u003c/em\u003e\u003cem\u003e\u003cem\u003eFor her contribution to the field, Andrews received \u003c/em\u003e\u003cem\u003eVince Lombardi’s Award of Excellence in 2022; she also became the first woman to be honored with the Pat Summerall Award. \u003c/em\u003eThese days, Andrews co-hosts a podcast, \u003c/em\u003e\u003ca href=\"https://go.redirectingat.com?id=74968X1525074\u0026amp;url=https%3A%2F%2Fpodcasts.apple.com%2Fus%2Fpodcast%2Fcalm-down-with-erin-and-charissa%2Fid1548527210\" target=\"_blank\" data-vars-ga-outbound-link=\"https://podcasts.apple.com/us/podcast/calm-down-with-erin-and-charissa/id1548527210\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"Calm Down\" data-vars-ga-product-id=\"a619d158-2434-498d-9b12-fccb5bf1ec79\" rel=\"nofollow\" data-href=\"https://podcasts.apple.com/us/podcast/calm-down-with-erin-and-charissa/id1548527210\" data-product-url=\"https://podcasts.apple.com/us/podcast/calm-down-with-erin-and-charissa/id1548527210\" data-affiliate=\"true\" data-affiliate-url=\"https://go.redirectingat.com?id=74968X1525074\u0026amp;url=https%3A%2F%2Fpodcasts.apple.com%2Fus%2Fpodcast%2Fcalm-down-with-erin-and-charissa%2Fid1548527210\" data-affiliate-network=\"{\u0026#34;site_id\u0026#34;:\u0026#34;530bacd4-96b2-4cfe-a9a6-1fbd7c749e22\u0026#34;,\u0026#34;metadata\u0026#34;:null,\u0026#34;network\u0026#34;:{\u0026#34;name\u0026#34;:\u0026#34;Skimlinks\u0026#34;},\u0026#34;product_metadata\u0026#34;:null,\u0026#34;afflink_redirect\u0026#34;:\u0026#34;/_p/afflink/rMH8/apple-calm-down-with-erin-and\u0026#34;}\" data-vars-ga-product-price=\"$0.00\" data-vars-ga-product-retailer-id=\"29bc53bb-6352-4e52-8459-14a7963d6bf6\" data-vars-ga-link-treatment=\"(not set) | (not set)\"\u003eCalm Down\u003c/a\u003e\u003cem\u003e, with Fox Sports colleague Charissa Thompson and runs \u003ca href=\"https://go.redirectingat.com?id=74968X1525074\u0026amp;url=https%3A%2F%2Fwww.fanatics.com%2Fwear-by-erin-andrews%2Fx-215339%2Bz-8305808-2048560893\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.fanatics.com/wear-by-erin-andrews/x-215339+z-8305808-2048560893\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"WEAR by Erin Andrews\" data-vars-ga-product-id=\"0c770d71-8468-46b3-9995-472a2480cfcc\" rel=\"nofollow\" data-href=\"https://www.fanatics.com/wear-by-erin-andrews/x-215339+z-8305808-2048560893\" data-product-url=\"https://www.fanatics.com/wear-by-erin-andrews/x-215339+z-8305808-2048560893\" data-affiliate=\"true\" data-affiliate-url=\"https://go.redirectingat.com?id=74968X1525074\u0026amp;url=https%3A%2F%2Fwww.fanatics.com%2Fwear-by-erin-andrews%2Fx-215339%2Bz-8305808-2048560893\" data-affiliate-network=\"{\u0026#34;afflink_redirect\u0026#34;:\u0026#34;/_p/afflink/rMH5/www-fanatics-com-product-not-found-403-https-www-fanatics-com-wear-by-erin-andrews-x-215339-z-8305808-2048560893\u0026#34;,\u0026#34;site_id\u0026#34;:\u0026#34;530bacd4-96b2-4cfe-a9a6-1fbd7c749e22\u0026#34;,\u0026#34;network\u0026#34;:{\u0026#34;name\u0026#34;:\u0026#34;Skimlinks\u0026#34;}}\" data-vars-ga-product-price=\"$0.00\" data-vars-ga-product-retailer-id=\"7e01e51a-aa4d-42eb-b103-e7c4a141c661\" data-vars-ga-link-treatment=\"(not set) | (not set)\"\u003eWEAR by Erin Andrews\u003c/a\u003e, an apparel and accessory line for sports fans. Ahead of the Super Bowl, where she’ll be reporting live, Andrews talks work-life balance, sexism, and all things Taylor Swift. \u003c/em\u003e\u003c/p\u003e\u003chr data-node-id=\"1\"/\u003e\u003cp data-journey-content=\"true\" data-node-id=\"2\"\u003eMy first job\u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"3\"\u003eMy first job was at American Eagle. (I really wanted to go to Abercrombie, because that’s where some of my guy friends worked.) From there, our manager moved to Banana Republic, so we all moved up, too. Khakis for everyone.\u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"5\"\u003eMy worst job \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"7\"\u003eI was a ride operator at Adventure Island in Tampa, Florida. This is before I was worried about wrinkles, pigmentation, and skin cancer; I just really wanted to crush the old tan situation. Tampa is the lightning capital, and when you’re stuck on the highest ride, and you see a storm start rolling in, you’re like, “Is this the way I’m going to go out? At Adventure Island by a lightning strike?” I remember we were getting everybody off the ride, and it was a tube slide, so I had to ride down last. It was like a scene from \u003cem\u003eTwister\u003c/em\u003e.   \u003c/p\u003e\u003cdiv size=\"medium\" data-embed=\"body-image\" data-lazy-id=\"P0-11\" data-node-id=\"8\"\u003e\u003cp\u003e\u003cimg alt=\"a personal note from erin andrews sharing her preferences and routines\" title=\"a personal note from erin andrews sharing her preferences and routines\" loading=\"lazy\" width=\"1080\" height=\"3986\" decoding=\"async\" data-nimg=\"1\" sizes=\"100vw\" srcset=\"https://hips.hearstapps.com/hmg-prod/images/office-hours-image-1-1-67a145c20942c.jpg?resize=320:* 640w, https://hips.hearstapps.com/hmg-prod/images/office-hours-image-1-1-67a145c20942c.jpg?resize=480:* 980w, https://hips.hearstapps.com/hmg-prod/images/office-hours-image-1-1-67a145c20942c.jpg?resize=640:* 1120w\" src=\"https://hips.hearstapps.com/hmg-prod/images/office-hours-image-1-1-67a145c20942c.jpg?resize=640:*\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cfigcaption data-theme-key=\"photo-credit-figcaption\"\u003e\u003cspan data-theme-key=\"photo-credit-creditor\"\u003eCourtesy of Erin Andrews + Design by Leah Romero\u003c/span\u003e\u003c/figcaption\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-journey-content=\"true\" data-node-id=\"9\"\u003eThe best career advice I’ve received  \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"10\"\u003eHustle like you’re broke. I’ve never worked harder than I do now. The other one is: If you’re going to do this for a living, you better have thick skin. When I first started—and this is going to age me so much—I used to read the message boards, and it would ruin my day. People talked about how big my nose was, how my voice was like nails on a chalkboard. I don’t have a “Delilah After Dark” voice, I get that. But I have worked really hard, and that’s why I’m in this industry. \u003cbr/\u003e\u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"11\"\u003eThe biggest lesson I’ve learned \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"12\"\u003eWhen I was young, I was so excited about being involved in sports broadcasting. Nothing really phased me. And then I dealt with adversity. I dealt with a stalker; I dealt with a \u003ca href=\"https://www.reuters.com/article/lifestyle/tv-personality-erin-andrews-settles-video-stalker-case-reports-idUSKCN0XM25W/\" target=\"_blank\" rel=\"nofollow\" data-vars-ga-outbound-link=\"https://www.reuters.com/article/lifestyle/tv-personality-erin-andrews-settles-video-stalker-case-reports-idUSKCN0XM25W/\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"public court case\"\u003epublic court case\u003c/a\u003e, and that taught me a lot. I didn’t think I was ever going to work again [due to the nature of the case]. I thought I’d never be taken seriously again. That really tested my inner strength to see if I wanted to show my face—and for me, showing my face means being in front of crowds of 80,000 people. Then I got diagnosed with cancer, and that was like, \u003cem\u003eholy shit\u003c/em\u003e. The biggest thing it taught me was how strong I am. I’ve been tested in a lot of different ways, and I’m still kicking.  \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"13\"\u003eWhy I launched WEAR\u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"14\"\u003eI love dressing up and cheering for my team, but as I got older, and my style changed, it was like, \u003cem\u003eWhere am I going to find clothes that represent the kind of fan I am?\u003c/em\u003e Then I met my husband, and his hockey team went to the playoffs and won the Stanley Cup, and I was like, \u003cem\u003eWhat am I wearing for the parade?\u003c/em\u003e When you go into pro shops, there’s a huge selection for men and maybe a few options for women. I wasn’t into what I was being offered as a fan. So, we put our nose to the grindstone. Finally, we partnered with Fanatics, and we created everything that I hoped to and more.\u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"15\"\u003eAnd look, \u003cstrong\u003e\u003c/strong\u003e[working multiple jobs] is hard. I miss a lot of stuff. I miss holidays. But beside being with my son and husband, there’s no place I’d rather be than here [doing my job]. This is my happy place, and I know for me to be a better mom and a better person, I have to be doing this. I’m a better version of myself when I have a lot going on.   \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"16\"\u003eThe dream job I haven’t done yet \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"17\"\u003eI want to be on \u003cem\u003eJenna \u0026amp; Friends\u003c/em\u003e. I really enjoyed my time on the \u003cem\u003eToday Show\u003c/em\u003e, so I’m manifesting that. I want to be on \u003cem\u003eSesame Street\u003c/em\u003e,\u003cem\u003e\u003c/em\u003e because my kid is obsessed with Elmo. \u003cem\u003eSaturday Night Live\u003c/em\u003e is a big one. I would love to do that. I would love to do more fashion and podcast collabs, too. We have a collaboration  with Rebecca Minkoff that we’re super excited about and one for the Super Bowl.  \u003c/p\u003e\u003cdiv size=\"large\" data-ad-exclude=\"(min-width: 90rem)\" data-embed=\"embed-product\" data-node-id=\"18\"\u003e\u003cp\u003e\u003ch2\u003eRebecca Minkoff x Wear Super Bowl LIX Tabitha Oversized Moto Jacket\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003ca target=\"_blank\" rel=\"nofollow noopener\" data-theme-key=\"base-link\" href=\"https://go.redirectingat.com?id=74968X1525074\u0026amp;url=https%3A%2F%2Fwww.rebeccaminkoff.com%2Fproducts%2Fsuper-bowl-lix-tabitha-oversized-moto-jacket-ea1f55jk639g-black\" aria-label=\"$1,000 at rebeccaminkoff.com for Super Bowl LIX Tabitha Oversized Moto Jacket\" data-href=\"https://www.rebeccaminkoff.com/products/super-bowl-lix-tabitha-oversized-moto-jacket-ea1f55jk639g-black\" data-product-url=\"https://www.rebeccaminkoff.com/products/super-bowl-lix-tabitha-oversized-moto-jacket-ea1f55jk639g-black\" data-affiliate=\"true\" data-affiliate-url=\"https://go.redirectingat.com?id=74968X1525074\u0026amp;url=https%3A%2F%2Fwww.rebeccaminkoff.com%2Fproducts%2Fsuper-bowl-lix-tabitha-oversized-moto-jacket-ea1f55jk639g-black\" data-affiliate-network=\"{\u0026#34;afflink_redirect\u0026#34;:\u0026#34;/_p/afflink/rFJG/rebeccaminkoff-super-bowl-lix-tabitha-oversized\u0026#34;,\u0026#34;site_id\u0026#34;:\u0026#34;530bacd4-96b2-4cfe-a9a6-1fbd7c749e22\u0026#34;,\u0026#34;network\u0026#34;:{\u0026#34;name\u0026#34;:\u0026#34;Skimlinks\u0026#34;}}\" data-vars-ga-call-to-action=\"$1,000 at rebeccaminkoff.com\" data-vars-ga-media-role=\"\" data-vars-ga-media-type=\"Single Product Embed\" data-vars-ga-outbound-link=\"https://www.rebeccaminkoff.com/products/super-bowl-lix-tabitha-oversized-moto-jacket-ea1f55jk639g-black\" data-vars-ga-product-brand=\"Rebecca Minkoff x Wear\" data-vars-ga-product-id=\"3f7c8d56-6746-4057-9c80-1c0d08ef263e\" data-vars-ga-product-price=\"$1,000.00\" data-vars-ga-product-retailer-id=\"9373f9ee-f477-4d99-a8a4-ae8d4cdf81a3\" data-vars-ga-link-treatment=\"(not set) | (not set)\" data-vars-ga-sku=\"rebeccaminkoff_super-bowl-lix-tabitha-oversized-moto-jacket-ea1f55jk639g-black\" data-vars-ga-magento-tracking=\"1\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg srcset=\"https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1738269893-11_19_2024_BWMODELSHOOT0870_SBcopy_grande.jpg?crop=1xw:1xh;center,top\u0026amp;resize=640:* 640w, https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1738269893-11_19_2024_BWMODELSHOOT0870_SBcopy_grande.jpg?crop=1xw:1xh;center,top\u0026amp;resize=980:* 980w\" alt=\"Super Bowl LIX Tabitha Oversized Moto Jacket\" title=\"Super Bowl LIX Tabitha Oversized Moto Jacket\" src=\"https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1738269893-11_19_2024_BWMODELSHOOT0870_SBcopy_grande.jpg?crop=1xw:1xh;center,top\u0026amp;resize=980:*\" width=\"400\" height=\"600\" decoding=\"async\" loading=\"lazy\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003cp data-journey-content=\"true\" data-node-id=\"19\"\u003eOn women’s sports getting long overdue recognition\u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"20\"\u003eIt’s nothing new for me to be the only female that travels with 30 guys. I’m very comfortable in that role. It’s cool that they are having a moment—\u003cem\u003ewe\u003c/em\u003e are having a moment—and it’s only going to get bigger and better. But that’s because of the foundation that was laid by women who didn’t take “no” for an answer, who looked to find ways to prove people wrong, to find ways to get the job done. So, it’s a really fun moment, but I don’t think any of us should be satisfied. I think we should keep pushing. \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"21\"\u003eHow I envision the future of women in sports \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"22\"\u003eI see an unlimited future. I really do. But it’s only going to come if people continue to push and demand to be in certain positions and roles. Something that was said to me when I got into the industry was, “You can get your foot in the door, because you’re a woman, but if you’re going to stay, you have to work that much harder.” That’s the chip on my shoulder. I have no idea why Taylor Swift put the line, “Don’t come for my job,” at the end of “I Can Do It With a Broken Heart,” but I fucking love that line. There are so many times I’ve felt that way. Don’t come for my job. I have worked so hard for this. \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"23\"\u003eMy proudest career moment\u003cbr/\u003e\u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"24\"\u003eWe launched WEAR in 2019, so COVID was our second year. Then, in 2021, I remember walking out on the field for my first game of the season—it was Vikings vs. Packers in Minnesota—and everybody was excited to be back. So many women were in the front row wearing WEAR, and our security guard looked up and goes, “E.A., I think this shit’s about to be big.” That was a really cool moment, to come back from the pandemic and see that we were still able to grow and that people were so excited to wear it.  \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"25\"\u003eAnd then to see Taylor Swift show up not once but three times in our gear, \u003cem\u003e\u003c/em\u003eI was just so thankful that she recognized our small female-owned, female-run business. When she first walked into that Thursday night game in our \u003ca href=\"https://go.redirectingat.com?id=74968X1525074\u0026amp;url=https%3A%2F%2Fwww.fanatics.com%2Fnfl%2Fkansas-city-chiefs%2Fkansas-city-chiefs-wear-by-erin-andrews-womens-color-block-full-zip-windbreaker-jacket-red%2Fo-3550%2Bt-47156914%2Bp-5744234992190%2Bz-9-1766926062\" data-vars-ga-outbound-link=\"https://www.fanatics.com/nfl/kansas-city-chiefs/kansas-city-chiefs-wear-by-erin-andrews-womens-color-block-full-zip-windbreaker-jacket-red/o-3550+t-47156914+p-5744234992190+z-9-1766926062\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"windbreaker\" data-vars-ga-product-id=\"81946fcc-7cc6-4761-a390-b3f86e38c5b7\" rel=\"nofollow\" data-href=\"https://www.fanatics.com/nfl/kansas-city-chiefs/kansas-city-chiefs-wear-by-erin-andrews-womens-color-block-full-zip-windbreaker-jacket-red/o-3550+t-47156914+p-5744234992190+z-9-1766926062\" data-product-url=\"https://www.fanatics.com/nfl/kansas-city-chiefs/kansas-city-chiefs-wear-by-erin-andrews-womens-color-block-full-zip-windbreaker-jacket-red/o-3550+t-47156914+p-5744234992190+z-9-1766926062\" data-affiliate=\"true\" data-affiliate-url=\"https://go.redirectingat.com?id=74968X1525074\u0026amp;url=https%3A%2F%2Fwww.fanatics.com%2Fnfl%2Fkansas-city-chiefs%2Fkansas-city-chiefs-wear-by-erin-andrews-womens-color-block-full-zip-windbreaker-jacket-red%2Fo-3550%2Bt-47156914%2Bp-5744234992190%2Bz-9-1766926062\" data-affiliate-network=\"{\u0026#34;afflink_redirect\u0026#34;:\u0026#34;/_p/afflink/rB66/www-fanatics-com-product-not-found-403-https-www-fanatics-com-nfl-kansas-city-chiefs-kansas-city-chiefs-wear-by-erin-andrews-womens-color-block-full-zip-windbreaker-jacket-red-o-3550-t-47156914-p-5744234992190-z-9-1766926062\u0026#34;,\u0026#34;site_id\u0026#34;:\u0026#34;530bacd4-96b2-4cfe-a9a6-1fbd7c749e22\u0026#34;,\u0026#34;network\u0026#34;:{\u0026#34;name\u0026#34;:\u0026#34;Skimlinks\u0026#34;}}\" data-vars-ga-product-price=\"$0.00\" data-vars-ga-product-retailer-id=\"c63f0bc8-22ff-4097-9820-314e9af89ae7\" data-vars-ga-link-treatment=\"(not set) | (not set)\"\u003e\u003cu\u003ewindbreaker\u003c/u\u003e\u003c/a\u003e, I was screaming and crying. And then when she walked into the 2024 AFC Championship in WEAR, I was like, \u003cem\u003eC\u003c/em\u003e\u003cem\u003eome on, enough is enough\u003c/em\u003e. I wasn’t even thinking of it for the 2024 Super Bowl, so when I saw \u003ca href=\"https://www.elle.com/culture/celebrities/a46696831/taylor-swift-super-bowl-outfit-travis-kelce-easter-eggs/\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.elle.com/culture/celebrities/a46696831/taylor-swift-super-bowl-outfit-travis-kelce-easter-eggs/\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"what she was wearing\"\u003ewhat she was wearing\u003c/a\u003e, I just started crying on the plane, and the flight attendant was like, “You good?” I was like, “No, I’ll have a double tequila and water. Thank you.” It was amazing. It was one of our biggest moments.\u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"27\"\u003eMy mantra \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"28\"\u003e“What would Taylor do?” The song “The Man” is my anthem. My girlfriend Charissa Thompson, who does my \u003cem\u003eCalm Down\u003c/em\u003e podcast with me, we deal with assholes, and we’re always like “OK. What would Taylor do?” You never see her be nasty. You never see her be catty. She always handles things so professionally.\u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"29\"\u003e\u003cem\u003eThis interview has been edited and condensed for clarity.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-02-03T22:03:00Z",
  "modifiedTime": "2025-02-03T22:03:00Z"
}
