{
  "id": "1c2876db-9f36-4f31-b790-45afd9b82cb1",
  "title": "Prices on Nikon Products Increasing Due to Tariffs in the USA",
  "link": "https://www.lightstalking.com/prices-on-nikon-products-increasing-due-to-tariffs-in-the-usa/",
  "description": "You might recall a story we did on Leica sometime ago about how prices were going to be impacted by the tariffs levied in the United States. That was an accessory that was already pricey which ballooned into something completely out of the reach of most people. Now, Nikon is joining other companies and predicting […] The post Prices on Nikon Products Increasing Due to Tariffs in the USA appeared first on Light Stalking.",
  "author": "Kehl Bayern",
  "published": "Sun, 25 May 2025 16:46:00 +0000",
  "source": "https://www.lightstalking.com/feed/",
  "categories": [
    "Photography News"
  ],
  "byline": "Kehl Bayern",
  "length": 1957,
  "excerpt": "You might recall a story we did on Leica sometime ago about how prices were going to be impacted by the tariffs levied in the United States. Black and silver nikon dslr camera. Photo by Tusik Only That was an accessory that was already pricey which ballooned into something completely out of the reach of most people. Now, Nikon is joining other companies and predicting increased prices within the next month in the USA in response to tariffs. This comes on the heels of a rising trend in the industry towards more and more expensive products anyway that are making",
  "siteName": "Light Stalking",
  "favicon": "",
  "text": "You might recall a story we did on Leica sometime ago about how prices were going to be impacted by the tariffs levied in the United States. Black and silver nikon dslr camera. Photo by Tusik Only That was an accessory that was already pricey which ballooned into something completely out of the reach of most people. Now, Nikon is joining other companies and predicting increased prices within the next month in the USA in response to tariffs. This comes on the heels of a rising trend in the industry towards more and more expensive products anyway that are making things that much more difficult for the average photographer when it comes to sourcing and maintaining gear.  And it looks like things are only going to get more expensive from here unless something changes. Heck, even Apple is reportedly on the tariff block so smartphone photography might not even be a viable entry point for people wedded to Apple products.  But really none of this is anything new. If anything, it’s an accelerated trend we’ve covered here for years. As low-end products increasingly get phased out and the margins from high-end products bolster company bottom lines, it is only natural that the latter continues its march towards dominance while the former, even without tariffs, continues to face challenges. So how much of a price increase are we looking at in total? PetaPixel reports that a similar phenomenon happened with Sony products, raising prices anywhere from 10% to 35% depending on what you’re looking at in terms of product. In other words, it’s either going to be mild or very noticeable.   Any thoughts on the rising cost of being a photographer are welcome in the comments. We have some other news you can read at this link. Kehl is our staff photography news writer since 2017 and has over a decade of experience in online media and publishing and you can get to know him better here and follow him on Insta.",
  "image": "https://www.lightstalking.com/wp-content/uploads/3vzjbdit4y4.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"site-content\" role=\"main\"\u003e\n\t\n\u003carticle id=\"post-520009\"\u003e\n\t\n\t\u003cdiv\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\n\u003cp\u003eYou might recall a story we did on Leica sometime ago about how prices were going to be impacted by the tariffs levied in the United States.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/3vzjbdit4y4.jpg.webp 900w, https://www.lightstalking.com/wp-content/uploads/3vzjbdit4y4-225x300.jpg.webp 225w, https://www.lightstalking.com/wp-content/uploads/3vzjbdit4y4-768x1024.jpg.webp 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"900\" height=\"1200\" src=\"https://www.lightstalking.com/wp-content/uploads/3vzjbdit4y4.jpg\" alt=\"black and silver nikon dslr camera\" srcset=\"https://www.lightstalking.com/wp-content/uploads/3vzjbdit4y4.jpg 900w, https://www.lightstalking.com/wp-content/uploads/3vzjbdit4y4-225x300.jpg 225w, https://www.lightstalking.com/wp-content/uploads/3vzjbdit4y4-768x1024.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eBlack and silver nikon dslr camera. Photo by Tusik Only\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThat was an accessory that was already pricey which ballooned into something completely out of the reach of most people.\u003c/p\u003e\n\n\n\n\u003cp\u003eNow, Nikon is joining other companies and predicting increased prices within the next month in the USA in response to tariffs. This comes on the heels of a rising trend in the industry towards more and more expensive products anyway that are making things that much more difficult for the average photographer when it comes to sourcing and maintaining gear. \u003c/p\u003e\n\n\n\n\u003cp\u003eAnd it looks like things are only going to get more expensive from here unless something changes. Heck, even Apple is reportedly on the tariff block so smartphone photography might not even be a viable entry point for people wedded to Apple products. \u003c/p\u003e\n\n\n\n\u003cp\u003eBut really none of this is anything new. If anything, it’s an accelerated trend we’ve covered here for years. As low-end products increasingly get phased out and the margins from high-end products bolster company bottom lines, it is only natural that the latter continues its march towards dominance while the former, even without tariffs, continues to face challenges.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo how much of a price increase are we looking at in total? PetaPixel \u003ca href=\"https://petapixel.com/2025/05/23/nikon-will-raise-prices-in-the-us-in-one-month-because-of-tariffs/\"\u003ereports\u003c/a\u003e that a similar phenomenon happened with Sony products, raising prices anywhere from 10% to 35% depending on what you’re looking at in terms of product. In other words, it’s either going to be mild or very noticeable.  \u003c/p\u003e\n\n\n\n\u003cp\u003eAny thoughts on the rising cost of being a photographer are welcome in the comments.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe have some other news you can read \u003ca href=\"https://www.lightstalking.com/category/news/\"\u003eat this link\u003c/a\u003e.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\u003cp\u003e\u003cimg alt=\"\" src=\"https://secure.gravatar.com/avatar/105c790fa869c42d4960f657a087d59c?s=120\u0026amp;r=g\" srcset=\"https://secure.gravatar.com/avatar/105c790fa869c42d4960f657a087d59c?s=240\u0026amp;r=g 2x\" height=\"120\" width=\"120\" decoding=\"async\"/\u003e\t\t\t\u003c/p\u003e\n\t\t\t\u003cp\u003eKehl is our staff photography news writer since 2017 and has over a decade of experience in online media and publishing and you can get to \u003ca href=\"https://www.lightstalking.com/about/\"\u003eknow him better here\u003c/a\u003e and follow him on \u003ca href=\"https://www.instagram.com/kehlbayern/\"\u003eInsta\u003c/a\u003e.\u003c/p\u003e\n\t\t\u003c/div\u003e\t\t\n\t\t\t\u003c/div\u003e\n\u003c/article\u003e\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-25T16:46:00Z",
  "modifiedTime": "2025-05-26T04:49:11Z"
}
