{
  "id": "526e6e32-bc4c-42c3-8cef-8e4f186dd0cb",
  "title": "NYU Hospital System Could Purchase Canon USA’s New York Headquarters",
  "link": "https://petapixel.com/2025/03/24/nyu-hospital-system-could-purchase-canon-usas-new-york-headquarters/",
  "description": "NYU Langone's ambitious plans to build a $3 billion state-of-the-art medical center on Long Island have pivoted. The university is reportedly considering purchasing Canon's Melville, New York headquarters instead. [Read More]",
  "author": "Jeremy Gray",
  "published": "Mon, 24 Mar 2025 17:39:33 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Industry",
    "News",
    "business",
    "Canon",
    "canonusa",
    "industry",
    "longisland",
    "newyork"
  ],
  "byline": "Jeremy Gray",
  "length": 3301,
  "excerpt": "Canon's Melville headquarters are perhaps too big for the company's current workforce.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "NYU Langone’s ambitious plans to build a $3 billion state-of-the-art medical center on Long Island have pivoted. The university is reportedly considering purchasing Canon’s Melville, New York headquarters instead. According to Long Island Business News, the NYU Langone hospital system, a massive integrated academic health system and one of the largest healthcare systems in the Northeastern United States, has put its original construction plans on hold “as a result of external factors.” In May 2023, Nassau County Executive Bruce Blakeman announced the planned $3 billion hospital facility at an NYU Langone graduation ceremony. At that time, Blakeman said the new 40-acre facility would be a “state of the art, number one hospital in America.” Last week, a Blakeman spokesperson said that the county and Manhattan-based NYU Langone “mutually agreed” to pause ongoing negotiations “as a result of external factors that have presented issues that may prove to be too burdensome to overcome.” Ken Langone, co-founder of Home Depot and chairman of the NYU Langone board, said last week that it was “too complicated” to build a medical center on the proposed campus location, per Newsday. “We considered all the things that had to be done and they’re certainly manageable but there’s a lot of moving parts. We just made a decision, ‘we’re going to cool it,'” Langone said. NYU Langone spokesperson Steve Ritea explained that NYU Langone remains committed to increasing its presence on Long Island. “We are actively exploring multiple alternative sites for a new medical center to serve Long Island. We remain dedicated to the project as originally envisioned: one that would include a teaching hospital, medical education, and a research facility,” Ritea said. Among these alternative possibilities is purchasing Canon’s headquarters and converting it into a major hospital. As part of these plans, NYU Langone could build a new 20-story building to go along with renovated medical offices in the existing Canon building. Long Island Business News reports that the NYU Langone hospital system “recently ordered an appraisal” of Canon’s 700,000 square-foot property on its 52-acre lot. Canon has been downsizing its Melville workforce, and Long Island Business News writes, “… much of [Canon’s] Melville campus is empty, with many employees working remotely three days a week, so brokers say the company doesn’t need as much office space.” While Canon has not commented on any potential negotiations or sales explorations, the company would face a complicated financial situation should it pursue a sale. Canon bought the land its Melville headquarters is on for $103 million in 2006 and presumably spent considerable money on its campus construction. Although Canon’s employee count in the United States has decreased, the company remains a major employer on Long Island and would need to find a new home for its operations. Canon opened its first American office way back in 1955 in Manhattan with just five employees and has since grown to employ thousands of people in the region. Image credits: Canon USA PetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.",
  "image": "https://petapixel.com/assets/uploads/2025/03/canon-melville-headquarters.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\u003carticle data-post-id=\"786171\"\u003e\n\n    \u003cheader\u003e\n          \n    \n\n        \n  \u003c/header\u003e\n      \n  \n\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/03/canon-melville-headquarters-800x420.jpg\" alt=\"A modern, four-story office building with reflective glass windows. Two flagpoles display an American flag and another flag. Trees and a landscaped median line the road leading to the entrance under a partly cloudy sky.\" width=\"800\" height=\"420\" srcset=\"https://petapixel.com/assets/uploads/2025/03/canon-melville-headquarters-800x420.jpg 800w, https://petapixel.com/assets/uploads/2025/03/canon-melville-headquarters-320x168.jpg 320w, https://petapixel.com/assets/uploads/2025/03/canon-melville-headquarters-1536x806.jpg 1536w, https://petapixel.com/assets/uploads/2025/03/canon-melville-headquarters-150x79.jpg 150w, https://petapixel.com/assets/uploads/2025/03/canon-melville-headquarters-300x157.jpg 300w, https://petapixel.com/assets/uploads/2025/03/canon-melville-headquarters-400x209.jpg 400w, https://petapixel.com/assets/uploads/2025/03/canon-melville-headquarters-550x288.jpg 550w, https://petapixel.com/assets/uploads/2025/03/canon-melville-headquarters.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003eNYU Langone’s ambitious plans to build a $3 billion state-of-the-art medical center on Long Island have pivoted. The university is reportedly considering purchasing Canon’s Melville, New York headquarters instead. \u003c/p\u003e  \u003cp\u003e\u003ca href=\"https://libn.com/2025/03/21/hospital-system-eyeing-purchase-of-canons-melville-headquarters/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eAccording to \u003cem\u003eLong Island Business News\u003c/em\u003e\u003c/a\u003e, the NYU Langone hospital system, a massive integrated academic health system and one of the largest healthcare systems in the Northeastern United States, has put its original construction plans on hold “as a result of external factors.” \u003c/p\u003e \u003cp\u003eIn May 2023, Nassau County Executive Bruce Blakeman announced the planned $3 billion hospital facility at an NYU Langone graduation ceremony. At that time, Blakeman said the new 40-acre facility would be a “state of the art, number one hospital in America.” \u003c/p\u003e \u003cp\u003eLast week, a Blakeman spokesperson said that the county and Manhattan-based NYU Langone “mutually agreed” to pause ongoing negotiations “as a result of external factors that have presented issues that may prove to be too burdensome to overcome.” \u003c/p\u003e \u003cp\u003eKen Langone, co-founder of Home Depot and chairman of the NYU Langone board, said last week that it was “too complicated” to build a medical center on the proposed campus location, \u003ca href=\"https://www.newsday.com/long-island/politics/nyu-nassau-blakeman-bsssjzv5\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eper \u003cem\u003eNewsday\u003c/em\u003e\u003c/a\u003e. \u003c/p\u003e \u003cp\u003e“We considered all the things that had to be done and they’re certainly manageable but there’s a lot of moving parts. We just made a decision, ‘we’re going to cool it,\u0026#39;” Langone said. \u003c/p\u003e\n \u003cp\u003eNYU Langone spokesperson Steve Ritea explained that NYU Langone remains committed to increasing its presence on Long Island. \u003c/p\u003e \u003cp\u003e“We are actively exploring multiple alternative sites for a new medical center to serve Long Island. We remain dedicated to the project as originally envisioned: one that would include a teaching hospital, medical education, and a research facility,” Ritea said. \u003c/p\u003e \u003cp\u003eAmong these alternative possibilities is purchasing Canon’s headquarters and converting it into a major hospital. As part of these plans, NYU Langone could build a new 20-story building to go along with renovated medical offices in the existing Canon building. \u003c/p\u003e \u003cp\u003e\u003cem\u003eLong Island Business News\u003c/em\u003e reports that the NYU Langone hospital system “recently ordered an appraisal” of Canon’s 700,000 square-foot property on its 52-acre lot. \u003c/p\u003e \u003cp\u003e\u003ca href=\"https://petapixel.com/2024/08/07/despite-reports-canon-not-likely-to-incur-7m-tax-penalty-for-its-layoffs/\" data-wpel-link=\"internal\"\u003eCanon has been downsizing its Melville workforce\u003c/a\u003e, and \u003cem\u003eLong Island Business News\u003c/em\u003e writes, “… much of [Canon’s] Melville campus is empty, with many employees working remotely three days a week, so brokers say the company doesn’t need as much office space.” \u003c/p\u003e \u003cp\u003eWhile Canon has not commented on any potential negotiations or sales explorations, the company would face a complicated financial situation should it pursue a sale. Canon bought the land its Melville headquarters is on for $103 million in 2006 and presumably spent considerable money on its campus construction. \u003c/p\u003e \u003cp\u003eAlthough Canon’s employee count in the United States has decreased, the company remains a major employer on Long Island and would need to find a new home for its operations. Canon opened its first American office way back in 1955 in Manhattan with just five employees and has since grown to employ thousands of people in the region. \u003c/p\u003e\n \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e Canon USA \u003c/em\u003e \u003c/p\u003e      \u003c/div\u003e\n\n          \n      \n\n              \u003cdiv\u003e\n          \u003cp\u003ePetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.\u003c/p\u003e\n        \u003c/div\u003e\n      \n    \n\n    \n    \n\n\n\n\n    \n    \n    \n          \n      \u003c/div\u003e\n\u003c/article\u003e\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-24T17:39:33Z",
  "modifiedTime": null
}
