{
  "id": "977741a3-9f86-4f45-8250-6f44489b5e01",
  "title": "8 Tips for Beautiful On-Camera Flash Photography",
  "link": "https://digital-photography-school.com/8-on-camera-flash-tips-how-to-get-better-lighting-from-your-on-camera-flash/",
  "description": "The post 8 Tips for Beautiful On-Camera Flash Photography appeared first on Digital Photography School. It was authored by Guest Contributor. On-camera flashes are surprisingly capable tools. Sure, many photographers prefer to work with natural light or an off-camera strobe, but natural light is unpredictable, while off-camera strobes are clunky and inconvenient. You can carry an on-camera flash in your bag at all times, and in my experience, you can capture pro-level, refined photos using a […] The post 8 Tips for Beautiful On-Camera Flash Photography appeared first on Digital Photography School. It was authored by Guest Contributor.",
  "author": "Guest Contributor",
  "published": "Fri, 10 Jan 2025 09:00:00 +0000",
  "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
  "categories": [
    "Cameras and Equipment",
    "beginner",
    "lighting"
  ],
  "byline": "Guest Contributor",
  "length": 11527,
  "excerpt": "Discover how to level up your images with the power of flash. We share eight tips and tricks for outstanding on-camera flash photography.",
  "siteName": "Digital Photography School",
  "favicon": "https://digital-photography-school.com/android-chrome-192x192.png",
  "text": "On-camera flashes are surprisingly capable tools. Sure, many photographers prefer to work with natural light or an off-camera strobe, but natural light is unpredictable, while off-camera strobes are clunky and inconvenient. You can carry an on-camera flash in your bag at all times, and in my experience, you can capture pro-level, refined photos using a flash mounted to the top of your camera – if you know the right techniques. Because here’s the thing: When you flash a subject directly, the result is almost always harsh. It’s your job to soften the light with modifiers and clever angles, and while this is doable, it does take a bit of extra knowledge. In this article, I offer eight tips to improve your on-camera flash photography. None of them require any additional gear, so as long as you have a speedlight that mounts on top of your camera, you’re good to go. Ready to dramatically enhance your flash shots? Then let’s dive right in, starting with my first tip: 1. Bounce the flash When it comes to on-camera flash techniques, bouncing should be your number-one secret weapon. If you’re shooting indoors, a typical room with light-colored walls and ceilings will provide you with all the surfaces you need to make beautiful pictures. You just have to angle your flash so it hits the surfaces before it impacts your subject: Using a bounce technique, you can achieve gorgeous softbox-style lighting without carrying around a softbox or a strobe. You see, although flash units are relatively small, when you point one at a wall or ceiling, it will reflect off like a much larger light source. The larger the light source, the softer the light, and the more flattering (generally speaking) the result. To create a portrait with the bounce technique, I generally tilt my flash unit to hit the ceiling and wall, though the positioning depends on the effect I’m trying to achieve. The technique is very versatile as it can give you everything from very dramatic split lighting to soft, even illumination; before you fire your camera, make sure that you carefully select a flash angle, and pay attention to the angle of reflection off the bounce surface. If you’re struggling to capture a nice directional light effect, you can always angle your flash up and behind you to fill a small to normal-sized room with beautiful light. 2. Flag the light Most people don’t realize this, but the light comes out of your flash in a wide pattern, not a straight beam. So while most of the light is focused forward, there is also a good amount spilling out perpendicular to the flash head. Therefore, if you’re trying to bounce your flash off a wall or ceiling, direct light can still hit your subject – even if your flash is pointed off to the side. This isn’t always a bad thing, but it can result in unpleasant shadows, especially if there is a wall or other flat surface just behind your subject. To eliminate this effect, simply place a small piece of opaque material or black foam on the relevant side of your flash. It should be just long enough to block the “edge” light from hitting your subject. You can hold it in place with one hand, or you can lock it in position using a rubber band (see the image above). This adjustment involves very little effort, but it’s one change that can make a huge difference to the overall look of your shot. 3. Make your flash bigger As I mentioned above, naked flashes produce harsh light because they’re small, while softboxes help produce flattering light because they’re much larger. Basically, larger light sources create smoother transitions between light and shadow (i.e., softer light), so the larger you can make your flash, the better. One way to boost your flash size is to bounce the light off the walls and ceilings. But what if you don’t have a wall or other surface to use? Or if the wall is painted a dark color and doesn’t offer much bounce potential? Fortunately, there’s another easy way to make the light bigger: add a simple bounce card, which is basically a piece of white card that reflects light around the scene. Because the bounce card will be at least twice as large as the flash head, you’ll get far more coverage. And as long as you’re not too far away from your subject, it’ll result in far more pleasing illumination. Simply grab a piece of white cardboard or crafting foam, and attach it to the flash head using a rubber band: Of course, you can orient the flash in different directions to achieve different effects. One item to bear in mind: Indoors, a bounce card will have the added benefit of throwing light onto your subject from two directions (forward and bounced off the ceiling), so even if you do have the option to bounce the light off the walls, there’s no need to put away that card! 4. Use TTL mode Most modern flash units offer a variety of shooting modes. When I’m working with off-camera flash in the studio, I often use my flash units in manual mode, which allows me to maintain consistent manual control over the flash’s output power in relatively static shooting situations (e.g., traditional portraiture). TTL (through-the-lens) mode, on the other hand, gives control of the flash unit’s output to the camera and flash. Your equipment essentially works to decide how much light the flash should emit to properly expose the subject, and most modern TTL systems are really great at what they do. In fact, TTL mode can be used in just about every shooting situation – even if you’re using your camera’s Manual mode, you’re working outdoors, or you’re using bounce techniques. And since TTL can make life a whole lot easier for you, especially when you’re faced with fast-paced shooting scenarios, there’s no reason not to use it extensively for on-camera flash work. So set your flash to its TTL mode. Then, when you’re ready, consider learning to apply more advanced techniques, such as flash exposure compensation, in conjunction with TTL flash. They’ll allow you to make easy adjustments to your overall exposure while still letting the TTL system do most of the thinking for you. 5. Use high-speed sync If your flash unit has a high-speed sync setting, turn it on. You see, most normal sync speeds for your flash will be limited to about 1/250s. That’s fine for situations where you’re in a dimly lit environment, but when you’re shooting outdoors or under bright light, you’ll often want to push the shutter speed higher than 1/250s to freeze the action or prevent overexposure. And if your exposure does require a higher shutter speed, you’ll find yourself limited by the 1/250s sync speed, which is where high-speed sync comes in handy. You see, high-speed sync will allow you to shoot at virtually any shutter speed, generally up to 1/8000s, so you can capture action and/or stop your highlights from blowing out completely. It’s especially helpful when you’re capturing outdoor portraits, where the ambient background light is rather bright and you’d like a little fill flash on your subject. High-speed sync to the rescue! One note: Leaving your high-speed sync mode on all the time doesn’t mean it’s always in use. It’ll only activate if you’re shooting beyond the normal flash sync speed. Otherwise, the flash will behave normally. 6. Try some gels DSLRs and mirrorless cameras allow you to control the overall color cast by adjusting the white balance – and if you’re shooting in RAW, you can always tweak the white balance after the fact using almost any standard post-processing program. But there are times when it’s good to make sure the light coming off your flash is close to the same color as the ambient light. It’ll ensure that most of the light in your images looks similar, and it’ll result in greater harmony throughout the scene. You’ll still want to make adjustments during post-processing, but it’ll give your shots a more consistent color overall. To bring your flash into the tungsten range of color in most ambient situations, you can add a Color Temperature Orange (CTO) filter over the flash head. Then set your camera’s WB to tungsten and fine-tune the white balance when editing as necessary. Note that you can also use flash gels to produce interesting creative effects. For instance, you can create interesting blue, green, or purple effects – just by applying a handy little gel. 7. Use the ambient light What’s a sign of a misused on-camera flash? The dark tunnel effect. This happens when you expose for the flash-illuminated subject but fail to record light on the environment, resulting in a bright subject on a black background. In my view, allowing the ambient light and the surroundings to appear in your images will give your shots valuable context and give each scene a sense of atmosphere. What’s important here is that you deliberately drop your shutter speed and dial back your flash’s power; that way, your camera captures some of the ambient light, and the final image includes plenty of background detail: One tip: If you’re comfortable with it, switch your camera over to Manual mode, then play with different shutter speed settings. That way, you can manually determine the perfect shutter speed for achieving the exact amount of ambient light you want in the shot. I find that shutter speeds of 1/15-1/40s work great in most environments, including outdoors at night. Your flash’s TTL mode should still be employed to achieve a good exposure, but the critical difference is that you’ll be able to control the ambient light by raising and lowering the shutter speed. 8. Turn your flash off No, it’s not exactly an on-camera flash photography tip. Sometimes, however, the best thing you can do with your on-camera flash is nothing at all. As you become more proficient with flash, you might be tempted to use it all the time. But you don’t want to become dependent on it. After all, most situations do have plenty of good light available, and there is a real difference between a flashed and an unflashed image. There’s nothing wrong with using flash, but in scenarios where you’re after a different look, it’s important that you know how to take a step back and turn that flash off. Of course, make sure you don’t get rid of the flash completely; when you do need a bit of extra light here and there, it’s nice to know you can always slap on that flash and get great shots on demand. On-camera flash photography: final words On-camera flash is a great way to light your subjects, whether you’re shooting indoors and need to add a lot of light, or you’re working outdoors and just want a bit of fill. So bring out that on-camera flash and start by practicing the techniques I shared above. Learn to bounce the flash well, learn to adjust your shutter speed to account for ambient light, and see what you can create! Now over to you: How do you plan to use on-camera flash? Do you have any tips that I missed? Share your thoughts in the comments below! Read more from our Cameras \u0026 Equipment category Guest Contributor This post was written by a guest contributor to dPS. Please see their details in the post above. Become a Contributor: Check out Write for DPS page for details about how YOU can share your photography tips with the DPS community. I need help with...",
  "image": "https://digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-3.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\n\t\t\n\t\t\n\n\t\t\u003csection\u003e\n\t\t\t\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1200\" height=\"1254\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1005.jpg?resize=1200%2C1254\u0026amp;ssl=1\" alt=\"Tips for beautiful on-camera flash photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1005.jpg?w=1200\u0026amp;ssl=1 1200w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1005.jpg?resize=287%2C300\u0026amp;ssl=1 287w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1005.jpg?resize=574%2C600\u0026amp;ssl=1 574w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1005.jpg?resize=768%2C803\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1005.jpg?resize=717%2C749\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eOn-camera flashes are surprisingly capable tools. Sure, many photographers prefer to work with \u003ca aria-label=\"natural light (opens in a new tab)\" href=\"https://digital-photography-school.com/12-tips-indoor-natural-light-photography/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003enatural light\u003c/a\u003e or an \u003ca aria-label=\"off-camera strobe (opens in a new tab)\" href=\"https://digital-photography-school.com/a-beginners-guide-to-working-with-flash-off-camera/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eoff-camera strobe\u003c/a\u003e, but natural light is unpredictable, while off-camera strobes are clunky and inconvenient. You can carry an on-camera flash in your bag at all times, and in my experience, you can capture pro-level, refined photos using a flash mounted to the top of your camera – \u003cem\u003eif \u003c/em\u003eyou know the right techniques.\u003c/p\u003e\n\n\n\n\u003cp\u003eBecause here’s the thing: When you flash a subject directly, the result is almost always harsh. It’s your job to soften the light with modifiers and clever angles, and while this is doable, it does take a bit of extra knowledge.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn this article, I offer eight tips to improve your on-camera flash photography. None of them require any additional gear, so as long as you have a speedlight that mounts on top of your camera, you’re good to go.\u003c/p\u003e\n\n\n\n\u003cp\u003eReady to dramatically enhance your flash shots? Then let’s dive right in, starting with my first tip:\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"bounce-the-flash\"\u003e1. Bounce the flash \u003c/h2\u003e\n\n\n\n\u003cp\u003eWhen it comes to on-camera flash techniques, \u003cem\u003e\u003ca href=\"https://digital-photography-school.com/bounce-flash-secrets-bouncing-way-better-photography/\" target=\"_blank\" aria-label=\" (opens in a new tab)\" rel=\"noreferrer noopener\"\u003ebouncing\u003c/a\u003e \u003c/em\u003eshould be your number-one secret weapon. If you’re shooting indoors, a typical room with light-colored walls and ceilings will provide you with all the surfaces you need to make beautiful pictures. You just have to angle your flash so it hits the surfaces before it impacts your subject:\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003ca href=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2010/07/bounce-diagram-11.jpg?ssl=1\" rel=\"attachment wp-att-16828\"\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"300\" height=\"190\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2010/07/bounce-diagram-11.jpg?resize=300%2C190\u0026amp;ssl=1\" alt=\"On-camera flash photography\"/\u003e\u003c/span\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eUsing a bounce technique, you can achieve gorgeous \u003ca aria-label=\"softbox-style lighting (opens in a new tab)\" href=\"https://digital-photography-school.com/softbox/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003esoftbox-style lighting\u003c/a\u003e without carrying around a softbox or a strobe. You see, although flash units are relatively small, when you point one at a wall or ceiling, it will reflect off like a much larger light source. The larger the light source, the softer the light, and the more flattering (generally speaking) the result.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1000\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-2.jpg?resize=1500%2C1000\u0026amp;ssl=1\" alt=\"On-camera flash photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-2.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-2.jpg?resize=300%2C200\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-2.jpg?resize=600%2C400\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-2.jpg?resize=768%2C512\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-2.jpg?resize=90%2C60\u0026amp;ssl=1 90w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-2.jpg?resize=717%2C478\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eTo create a portrait with the bounce technique, I generally tilt my flash unit to hit the ceiling and wall, though the positioning depends on the effect I’m trying to achieve. The technique is very versatile as it can give you everything from very dramatic split lighting to soft, even illumination; before you fire your camera, make sure that you carefully select a flash angle, and pay attention to the angle of reflection off the bounce surface.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you’re struggling to capture a nice directional light effect, you can always angle your flash up and behind you to fill a small to normal-sized room with beautiful light.\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"flag-the-light\"\u003e2. Flag the light\u003c/h2\u003e\n\n\n\n\u003cp\u003eMost people don’t realize this, but the light comes out of your flash in a wide pattern, \u003cem\u003enot \u003c/em\u003ea straight beam. So while most of the light is focused forward, there is also a good amount spilling out perpendicular to the flash head.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"550\" height=\"183\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2010/07/flash-flag.jpg?resize=550%2C183\u0026amp;ssl=1\" alt=\"On-camera flash photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2010/07/flash-flag.jpg?w=550\u0026amp;ssl=1 550w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2010/07/flash-flag.jpg?resize=300%2C100\u0026amp;ssl=1 300w\" sizes=\"auto, (max-width: 550px) 100vw, 550px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eTherefore, if you’re trying to bounce your flash off a wall or ceiling, direct light can still hit your subject – even if your flash is pointed off to the side. This isn’t always a bad thing, but it can result in unpleasant shadows, especially if there is a wall or other flat surface just behind your subject.\u003c/p\u003e\n\n\n\n\u003cp\u003eTo eliminate this effect, simply place a small piece of opaque material or black foam on the relevant side of your flash. It should be just long enough to block the “edge” light from hitting your subject. You can hold it in place with one hand, or you can lock it in position using a rubber band (see the image above). This adjustment involves very little effort, but it’s one change that can make a huge difference to the overall look of your shot.\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"make-your-flash-bigger\"\u003e3. Make your flash bigger\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs I mentioned above, naked flashes produce harsh light because they’re small, while softboxes help produce flattering light because they’re much larger. Basically, larger light sources create smoother transitions between light and shadow (i.e., softer light), so the larger you can make your flash, the better.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"396\" height=\"600\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1.jpg?resize=396%2C600\u0026amp;ssl=1\" alt=\"On-camera flash photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1.jpg?resize=396%2C600\u0026amp;ssl=1 396w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1.jpg?resize=198%2C300\u0026amp;ssl=1 198w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1.jpg?resize=768%2C1162\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1.jpg?resize=717%2C1085\u0026amp;ssl=1 717w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-1.jpg?w=991\u0026amp;ssl=1 991w\" sizes=\"auto, (max-width: 396px) 100vw, 396px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eOne way to boost your flash size is to bounce the light off the walls and ceilings. But what if you don’t have a wall or other surface to use? Or if the wall is painted a dark color and doesn’t offer much bounce potential?\u003c/p\u003e\n\n\n\n\u003cp\u003eFortunately, there’s another easy way to make the light bigger: add a simple bounce card, which is basically a piece of white card that reflects light around the scene. Because the bounce card will be at least twice as large as the flash head, you’ll get far more coverage. And as long as you’re not too far away from your subject, it’ll result in far more pleasing illumination.\u003c/p\u003e\n\n\n\n\u003cp\u003eSimply grab a piece of white cardboard or crafting foam, and attach it to the flash head using a rubber band:\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003ca href=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2010/07/flash-bounce-card.jpg?ssl=1\" rel=\"attachment wp-att-16831\"\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"275\" height=\"413\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2010/07/flash-bounce-card.jpg?resize=275%2C413\u0026amp;ssl=1\" alt=\"On-camera flash photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2010/07/flash-bounce-card.jpg?w=275\u0026amp;ssl=1 275w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2010/07/flash-bounce-card.jpg?resize=200%2C300\u0026amp;ssl=1 200w\" sizes=\"auto, (max-width: 275px) 100vw, 275px\"/\u003e\u003c/span\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eOf course, you can orient the flash in different directions to achieve different effects. \u003c/p\u003e\n\n\n\n\u003cp\u003eOne item to bear in mind: Indoors, a bounce card will have the added benefit of throwing light onto your subject from two directions (forward and bounced off the ceiling), so even if you do have the option to bounce the light off the walls, there’s no need to put away that card!\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"use-ttl-mode\"\u003e4. Use TTL mode\u003c/h2\u003e\n\n\n\n\u003cp\u003eMost modern flash units offer a variety of shooting modes. When I’m working with off-camera flash in the studio, I often use my flash units in manual mode, which allows me to maintain consistent manual control over the flash’s output power in relatively static shooting situations (e.g., traditional portraiture).\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://digital-photography-school.com/understand-flash-settings-ttl-manual/\" target=\"_blank\" aria-label=\"TTL (through-the-lens) mode (opens in a new tab)\" rel=\"noreferrer noopener\"\u003eTTL (through-the-lens) mode\u003c/a\u003e, on the other hand, gives control of the flash unit’s output to the camera and flash. Your equipment essentially works to decide how much light the flash should emit to properly expose the subject, and most modern TTL systems are really great at what they do.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1000\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-3.jpg?resize=1500%2C1000\u0026amp;ssl=1\" alt=\"On-camera flash photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-3.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-3.jpg?resize=300%2C200\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-3.jpg?resize=600%2C400\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-3.jpg?resize=768%2C512\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-3.jpg?resize=90%2C60\u0026amp;ssl=1 90w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-3.jpg?resize=717%2C478\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eIn fact, TTL mode can be used in just about every shooting situation – even if you’re using your \u003cem\u003ecamera’s \u003c/em\u003e\u003ca href=\"https://digital-photography-school.com/shoot-manual-mode-cheat-sheet-beginners/\" target=\"_blank\" aria-label=\" (opens in a new tab)\" rel=\"noreferrer noopener\"\u003eManual mode\u003c/a\u003e, you’re working outdoors, or you’re using bounce techniques. And since TTL can make life a whole lot easier for you, especially when you’re faced with fast-paced shooting scenarios, there’s no reason not to use it extensively for on-camera flash work.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo set your flash to its TTL mode. Then, when you’re ready, consider learning to apply more advanced techniques, such as flash exposure compensation, in conjunction with TTL flash. They’ll allow you to make easy adjustments to your overall exposure while still letting the TTL system do most of the thinking for you.\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"use-high-speed-sync\"\u003e5. Use high-speed sync\u003c/h2\u003e\n\n\n\n\u003cp\u003eIf your flash unit has a \u003ca href=\"https://digital-photography-school.com/portraits-using-flash-high-speed-sync/\" target=\"_blank\" aria-label=\"high-speed sync setting (opens in a new tab)\" rel=\"noreferrer noopener\"\u003ehigh-speed sync setting\u003c/a\u003e, turn it on. \u003c/p\u003e\n\n\n\n\u003cp\u003eYou see, most normal sync speeds for your flash will be limited to about 1/250s. That’s fine for situations where you’re in a dimly lit environment, but when you’re shooting outdoors or under bright light, you’ll often want to push the \u003ca href=\"https://digital-photography-school.com/shutter-speed/\" target=\"_blank\" aria-label=\"shutter speed (opens in a new tab)\" rel=\"noreferrer noopener\"\u003eshutter speed\u003c/a\u003e higher than 1/250s to freeze the action or prevent overexposure.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd if your exposure \u003cem\u003edoes \u003c/em\u003erequire a higher shutter speed, you’ll find yourself limited by the 1/250s sync speed, which is where high-speed sync comes in handy. You see, high-speed sync will allow you to shoot at virtually any shutter speed, generally up to 1/8000s, so you can capture action and/or stop your highlights from blowing out completely. It’s especially helpful when you’re capturing outdoor portraits, where the ambient background light is rather bright and you’d like a little fill flash on your subject. High-speed sync to the rescue!\u003c/p\u003e\n\n\n\n\u003cp\u003eOne note: Leaving your high-speed sync mode on all the time doesn’t mean it’s always in use. It’ll only activate if you’re shooting beyond the normal flash sync speed. Otherwise, the flash will behave normally.\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"try-some-gels\"\u003e6. Try some gels\u003c/h2\u003e\n\n\n\n\u003cp\u003eDSLRs and mirrorless cameras allow you to control the overall color cast by adjusting the \u003ca aria-label=\"white balance (opens in a new tab)\" href=\"https://digital-photography-school.com/introduction-to-white-balance/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ewhite balance\u003c/a\u003e – and if you’re shooting in RAW, you can always tweak the white balance after the fact using almost any standard post-processing program.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut there are times when it’s good to make sure the light coming off your flash is close to the same color as the ambient light. It’ll ensure that most of the light in your images looks similar, and it’ll result in greater harmony throughout the scene. You’ll still want to make adjustments during post-processing, but it’ll give your shots a more consistent color overall.\u003c/p\u003e\n\n\n\n\u003cp\u003eTo bring your flash into the tungsten range of color in most ambient situations, you can add a Color Temperature Orange (CTO) filter over the flash head. Then set your camera’s WB to tungsten and fine-tune the white balance when editing as necessary.\u003c/p\u003e\n\n\n\n\u003cp\u003eNote that you can also \u003ca href=\"https://digital-photography-school.com/colored-gels-creative-off-camera-flash-photography/\" target=\"_blank\" aria-label=\"use flash gels to produce interesting creative effects (opens in a new tab)\" rel=\"noreferrer noopener\"\u003euse flash gels to produce interesting creative effects\u003c/a\u003e. For instance, you can create interesting blue, green, or purple effects – just by applying a handy little gel.\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"use-the-ambient-light\"\u003e7. Use the ambient light\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhat’s a sign of a misused on-camera flash? The dark tunnel effect. This happens when you expose for the flash-illuminated subject but fail to record light on the environment, resulting in a bright subject on a black background.  \u003c/p\u003e\n\n\n\n\u003cp\u003eIn my view, allowing the ambient light and the surroundings to appear in your images will give your shots valuable context and give each scene a sense of atmosphere. What’s important here is that you deliberately drop your shutter speed and dial back your flash’s power; that way, your camera captures some of the ambient light, and the final image includes plenty of background detail:\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"972\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-5.jpg?resize=1500%2C972\u0026amp;ssl=1\" alt=\"On-camera flash photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-5.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-5.jpg?resize=300%2C194\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-5.jpg?resize=600%2C389\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-5.jpg?resize=768%2C498\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-5.jpg?resize=115%2C75\u0026amp;ssl=1 115w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/on-camera-flash-photography-5.jpg?resize=717%2C465\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eOne tip: If you’re comfortable with it, switch your camera over to Manual mode, then play with different shutter speed settings. That way, you can manually determine the perfect shutter speed for achieving the exact amount of ambient light you want in the shot.\u003c/p\u003e\n\n\n\n\u003cp\u003eI find that shutter speeds of 1/15-1/40s work great in most environments, including outdoors at night. Your flash’s TTL mode should still be employed to achieve a good exposure, but the critical difference is that you’ll be able to control the ambient light by raising and lowering the shutter speed.\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"turn-your-flash-off\"\u003e8. Turn your flash off\u003c/h2\u003e\n\n\n\n\u003cp\u003eNo, it’s not exactly an on-camera flash photography tip. Sometimes, however, the best thing you can do with your on-camera flash is nothing at all. \u003c/p\u003e\n\n\n\n\u003cp\u003eAs you become more proficient with flash, you might be tempted to use it all the time. But you don’t want to become dependent on it. After all, most situations do have plenty of good light available, and there is a real difference between a flashed and an unflashed image. There’s nothing wrong with using flash, but in scenarios where you’re after a different look, it’s important that you know how to take a step back and turn that flash off. \u003c/p\u003e\n\n\n\n\u003cp\u003eOf course, make sure you don’t get rid of the flash completely; when you do need a bit of extra light here and there, it’s nice to know you can always slap on that flash and get great shots on demand. \u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"on-camera-flash-photography-final-words\"\u003eOn-camera flash photography: final words\u003c/h2\u003e\n\n\n\n\u003cp\u003eOn-camera flash is a great way to light your subjects, whether you’re shooting indoors and need to add a lot of light, or you’re working outdoors and just want a bit of fill. \u003c/p\u003e\n\n\n\n\u003cp\u003eSo bring out that on-camera flash and start by practicing the techniques I shared above. Learn to bounce the flash well, learn to adjust your shutter speed to account for ambient light, and see what you can create!\u003c/p\u003e\n\n\n\n\u003cp\u003eNow over to you:\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eHow do you plan to use on-camera flash? Do you have any tips that I missed? Share your thoughts in the comments below!\u003c/em\u003e\u003c/p\u003e\n\n\t  \n      \n    \u003c/section\u003e\n\n\t\t\n\n\t\t\u003csection\u003e\n\t\t\t\u003ch3\u003eRead more from our \u003ca href=\"https://digital-photography-school.com/cameras/\"\u003eCameras \u0026amp; Equipment\u003c/a\u003e category\u003c/h3\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003ca href=\"https://digital-photography-school.com/author/dpsguest/\" title=\"Guest Contributor\"\u003e\u003cimg src=\"https://digital-photography-school.com/wp-content/themes/sassy-dps/build/blog/dps-orange.png\" width=\"80\" alt=\"Guest Editor\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://digital-photography-school.com/author/dpsguest/\" title=\"Guest Contributor\"\u003eGuest Contributor\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e\n              This post was written by a guest contributor to dPS.\n              \u003cbr/\u003e\n              Please see their details in the post above.\n            \u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003eBecome a Contributor: Check out \u003ca href=\"https://digital-photography-school.com/write-for-digital-photography-school\"\u003eWrite for DPS\u003c/a\u003e page\n\t\t\t\t\t\tfor details about how YOU can share your photography tips with the DPS community.\u003c/p\u003e\n\t\t\t\t\t\u003c/section\u003e\n\n\t\t\t\u003csection\u003e\n\t\t\u003cspan\u003eI need help with...\u003c/span\u003e\n\t\t\n\t\u003c/section\u003e\n\t\n\t\t\n\t\t\t\t\n\t\t\n\t\t\t\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-01-10T09:00:00Z",
  "modifiedTime": "2025-01-11T16:00:47Z"
}
