{
  "id": "989806e7-90ea-45c3-a5c1-b652f9c76b63",
  "title": "How to Capture Fantastic Fireworks Photos With Your Smartphone",
  "link": "https://petapixel.com/2025/07/04/how-to-capture-fantastic-fireworks-photos-with-your-smartphone/",
  "description": "While many photographers will venture out to their local Fourth of July fireworks shows armed with a dedicated camera kit, what if you only have your smartphone on hand? It's still possible to get great shots as Google Senior Product Manager Alex King and Pixel Camera Senior Product Manager Michael Specht explain. [Read More]",
  "author": "Jeremy Gray",
  "published": "Fri, 04 Jul 2025 11:30:40 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Interviews",
    "Mobile",
    "Tips",
    "education",
    "fireworks",
    "googlepixel",
    "mobile",
    "phone",
    "pixel",
    "smartphone"
  ],
  "byline": "Jeremy Gray",
  "length": 6189,
  "excerpt": "Your phone can definitely capture awesome fireworks photos.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "While many photographers will venture out to their local Fourth of July fireworks shows armed with a dedicated camera kit, what if you only have your smartphone on hand? It’s still possible to get great shots as Google Senior Product Manager Alex King and Pixel Camera Senior Product Manager Michael Specht explain. “Ultimately [your smartphone] is a camera,” Specht says, so the process of shooting fireworks is similar to any other camera. However, a smartphone like the Google Pixel has some built-in modes that can help photographers not only capture fantastic fireworks shots easily, but with something like Pro Controls on the latest Pixel models, mobile photographers can take advantage of the same creative exposure controls available on dedicated cameras, like long-exposure shooting. https://petapixel.com/assets/uploads/2025/07/pixel-pro-controls.mp4 Of course, just like with a full-blown interchangeable lens camera, Specht advises smartphone users to ensure they understand how to use their phone’s camera system and are familiar with all the settings they may need. Plus, a tripod is never a bad idea, although Specht and King, who shot the images seen in this article on a Pixel 8 Pro without a tripod, note that it’s not hard to find a place to prop up your phone — and certainly easier to do so with a smartphone than a large camera. Preparation is key when it comes to getting good photos in other ways, too. “I’ve used Google Images to search for fireworks shows at whatever place I’m going to see possible vantage points,” King explains. “That’s been a helpful trick.” Both recommend arriving on location well before showtime to ensure you secure a good vantage point and scout out potential compositions before it gets dark. Once you’re set up and have your settings dialed in, users shouldn’t be afraid to experiment and try different things, especially if they’re removing the guardrails in most smartphone camera apps and opting for full manual mode. “I used the manual Pro Controls and specifically the control I was using the most was shutter speed,” King says of his fireworks photos shot on Pixel. “So if you set a longer shutter speed, that’s where you’ll really start to see the trails from the fireworks. And if you’re using a shorter one, the trails will be shorter and maybe even more dot-like.” “And the other thing I think is important is that there is a little bit of trial and error,” King adds, encouraging photographers to try different settings and have fun. While a fireworks show is not extremely long, it is often long enough for photographers to try other styles before the grand finale. Many modern smartphones, such as the Pixel series, also feature dedicated night photography modes, which can be helpful for those without a tripod handy. These modes combine multiple photos in a series to replicate the look of a longer exposure. “It’s a good one to play around with,” Specht says of Pixel’s Night Sight mode. With manual controls, photographers can achieve a wide range of looks, whether they’re aiming for a dreamy, fireworks-style photo with significant motion blur in the sky or something sharper and darker that highlights the detail in the explosions. Another advantage that a smartphone can have over a regular camera, aside from being easy to slip into a pocket, is that many smartphones, like the Pixel, have robust HDR support. The Pixel series now features Ultra HDR, which can make fireworks photos pop on compatible displays. The gain map for Ultra HDR is included in the Pixel’s JPEG XL files, so photographers don’t need to take any special action to take advantage of it. Of course, the SDR version is also available. King and Specht also highlight that Pixel smartphones can capture RAW images, allowing photographers to experiment with post-processing. While not every mode works alongside RAW image capture — RAW images have a lot of data that doesn’t always work for certain computational photography modes — many do and provide additional latitude when editing. King’s photos in this story were all shot in JPEG format and haven’t been edited. As for what mobile photographers should do when photographing fireworks, each King and Specht has different advice to offer. “For me, it’s about trying quite a few different modes,” Specht, a very accomplished photographer, says. “I personally really love Pro Controls. It mimics exactly what I get out of my standalone cameras that I like to use. Being able to have that control of ‘I actually want these trails to be really short or I want to see really long trails from long exposures’ [is great]. That’s the mode I gravitate towards due to my personal background and skillset.” While giving his answer, Specht references a wall of cameras behind him. “As you can see, I collect a bunch of cameras.” For King, the answer is a little different. “I’d recommend the long exposure photo mode for someone who just wants to take pictures and doesn’t want to futz around with dialing in the specific settings. You can get some really amazing photos using that mode,” he says. But for those who, like Specht, want more control, Pro Controls is a lot of fun. “I’m a bit of a nerd, I guess, but it’s fun to try adjusting all those settings and seeing the different types of images you get and fine-tune the image.” Both Specht and King agree that one of the most important things is having fun, whether that’s achieved by simply getting fireworks photos as easily as possible or by experimenting with manual controls. Mobile photographers should ensure they enjoy the experience and have a good time. The experience leads to one final tip. Specht says that photographers should be flexible and not stay laser-focused on the subject they intended to capture. “Usually for fireworks shows, you’re on a big lawn with a bunch of people around you, and actually the most interesting photo can be turning around and photographing the people watching the fireworks, using the fireworks as your light source,” Specht adds. “Don’t always think that the obvious subject is the one you should photograph.” Image credits: Photos provided by Google’s Alex King",
  "image": "https://petapixel.com/assets/uploads/2025/07/fireworks-tips-pixel-featured.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/07/fireworks-tips-pixel-featured-800x420.jpg\" alt=\"Colorful fireworks burst over a harbor at night, illuminating boats on the water and buildings along the shore. The sky is filled with pink and purple lights reflecting on the calm surface below.\" width=\"800\" height=\"420\" srcset=\"https://petapixel.com/assets/uploads/2025/07/fireworks-tips-pixel-featured-800x420.jpg 800w, https://petapixel.com/assets/uploads/2025/07/fireworks-tips-pixel-featured-320x168.jpg 320w, https://petapixel.com/assets/uploads/2025/07/fireworks-tips-pixel-featured-1536x806.jpg 1536w, https://petapixel.com/assets/uploads/2025/07/fireworks-tips-pixel-featured-150x79.jpg 150w, https://petapixel.com/assets/uploads/2025/07/fireworks-tips-pixel-featured-300x157.jpg 300w, https://petapixel.com/assets/uploads/2025/07/fireworks-tips-pixel-featured-400x209.jpg 400w, https://petapixel.com/assets/uploads/2025/07/fireworks-tips-pixel-featured-550x288.jpg 550w, https://petapixel.com/assets/uploads/2025/07/fireworks-tips-pixel-featured.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003eWhile many photographers will venture out to their local Fourth of July fireworks shows armed with a dedicated camera kit, what if you only have your smartphone on hand? It’s still possible to get great shots as Google Senior Product Manager Alex King and Pixel Camera Senior Product Manager Michael Specht explain. \u003c/p\u003e  \u003cp\u003e“Ultimately [your smartphone] is a camera,” Specht says, so the process of \u003ca href=\"https://petapixel.com/how-to-photograph-fireworks-like-a-pro/\" data-wpel-link=\"internal\"\u003eshooting fireworks\u003c/a\u003e is similar to any other camera. \u003c/p\u003e \u003cp\u003eHowever, a smartphone like the Google Pixel has some built-in modes that can help photographers not only capture fantastic fireworks shots easily, but with something like \u003ca href=\"https://blog.google/products/pixel/how-to-use-pixel-8-camera-pro-controls/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003ePro Controls\u003c/a\u003e on the latest Pixel models, mobile photographers can take advantage of the same creative exposure controls available on dedicated cameras, like long-exposure shooting. \u003c/p\u003e \u003cp\u003e \u003cvideo id=\"video-803160-1\" width=\"2096\" height=\"1182\" preload=\"metadata\" controls=\"controls\"\u003e\u003csource type=\"video/mp4\" src=\"https://petapixel.com/assets/uploads/2025/07/pixel-pro-controls.mp4?_=1\"/\u003e\u003ca href=\"https://petapixel.com/assets/uploads/2025/07/pixel-pro-controls.mp4\" data-wpel-link=\"internal\"\u003ehttps://petapixel.com/assets/uploads/2025/07/pixel-pro-controls.mp4\u003c/a\u003e\u003c/video\u003e\u003c/p\u003e \u003cp\u003eOf course, just like with a full-blown interchangeable lens camera, Specht advises smartphone users to ensure they understand how to use their phone’s camera system and are familiar with all the settings they may need. Plus, a tripod is never a bad idea, although Specht and King, who shot the images seen in this article on a Pixel 8 Pro without a tripod, note that it’s not hard to find a place to prop up your phone — and certainly easier to do so with a smartphone than a large camera. \u003c/p\u003e \u003cdiv\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/_yVUtn1Tuoo?si=82cZKXpHhwrZGdL7\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e\n \u003cp\u003ePreparation is key when it comes to getting good photos in other ways, too. \u003c/p\u003e \u003cp\u003e“I’ve used Google Images to search for fireworks shows at whatever place I’m going to see possible vantage points,” King explains. “That’s been a helpful trick.” \u003c/p\u003e \u003cp\u003eBoth recommend arriving on location well before showtime to ensure you secure a good vantage point and scout out potential compositions before it gets dark. \u003c/p\u003e \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/07/PXL_20230705_052402567-603x800.jpg\" alt=\"Colorful fireworks explode in the night sky over a marina filled with boats, reflecting on the water. Crowds gather near waterfront buildings to watch the celebration. City lights illuminate the background.\" width=\"603\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2025/07/PXL_20230705_052402567-603x800.jpg 603w, https://petapixel.com/assets/uploads/2025/07/PXL_20230705_052402567-241x320.jpg 241w, https://petapixel.com/assets/uploads/2025/07/PXL_20230705_052402567-1157x1536.jpg 1157w, https://petapixel.com/assets/uploads/2025/07/PXL_20230705_052402567.jpg 1205w\" sizes=\"(max-width: 603px) 100vw, 603px\"/\u003e\u003c/p\u003e \u003cp\u003eOnce you’re set up and have your settings dialed in, users shouldn’t be afraid to experiment and try different things, especially if they’re removing the guardrails in most smartphone camera apps and opting for full manual mode. \u003c/p\u003e \u003cp\u003e“I used the manual Pro Controls and specifically the control I was using the most was shutter speed,” King says of his fireworks photos shot on Pixel. “So if you set a longer shutter speed, that’s where you’ll really start to see the trails from the fireworks. And if you’re using a shorter one, the trails will be shorter and maybe even more dot-like.” \u003c/p\u003e \u003cp\u003e“And the other thing I think is important is that there is a little bit of trial and error,” King adds, encouraging photographers to try different settings and have fun. While a fireworks show is not extremely long, it is often long enough for photographers to try other styles before the grand finale. \u003c/p\u003e\n \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053702426.MP_-603x800.jpg\" alt=\"Fireworks burst in the night sky above a marina filled with boats, their lights reflecting on the water. People are gathered near a building at the waterfront, watching the celebration.\" width=\"603\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053702426.MP_-603x800.jpg 603w, https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053702426.MP_-241x320.jpg 241w, https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053702426.MP_-1157x1536.jpg 1157w, https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053702426.MP_.jpg 1205w\" sizes=\"(max-width: 603px) 100vw, 603px\"/\u003e\u003c/p\u003e \u003cp\u003eMany modern smartphones, such as the Pixel series, also feature dedicated night photography modes, which can be helpful for those without a tripod handy. These modes combine multiple photos in a series to replicate the look of a longer exposure. \u003c/p\u003e \u003cp\u003e“It’s a good one to play around with,” Specht says of Pixel’s Night Sight mode. \u003c/p\u003e \u003cp\u003eWith manual controls, photographers can achieve a wide range of looks, whether they’re aiming for a dreamy, fireworks-style photo with significant motion blur in the sky or something sharper and darker that highlights the detail in the explosions. \u003c/p\u003e \u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053759628-603x800.jpg\" alt=\"A vibrant display of colorful fireworks lights up the night sky over a harbor filled with boats, their reflections shimmering on the water. City lights and a waterfront building are visible in the foreground.\" width=\"603\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053759628-603x800.jpg 603w, https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053759628-241x320.jpg 241w, https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053759628-1157x1536.jpg 1157w, https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053759628.jpg 1205w\" sizes=\"(max-width: 603px) 100vw, 603px\"/\u003e\u003c/p\u003e \u003cp\u003eAnother advantage that a smartphone can have over a regular camera, aside from being easy to slip into a pocket, is that many smartphones, like the Pixel, have robust HDR support. The Pixel series now features Ultra HDR, which can make fireworks photos pop on compatible displays. The gain map for \u003ca href=\"https://petapixel.com/2025/04/23/google-photos-can-convert-normal-photos-to-ultra-hdr/\" data-wpel-link=\"internal\"\u003eUltra HDR\u003c/a\u003e is included in the Pixel’s \u003ca href=\"https://petapixel.com/2024/10/02/jpeg-xl-what-it-is-and-why-you-should-care/\" data-wpel-link=\"internal\"\u003eJPEG XL\u003c/a\u003e files, so photographers don’t need to take any special action to take advantage of it. Of course, the SDR version is also available. \u003c/p\u003e \u003cp\u003eKing and Specht also highlight that Pixel smartphones can capture RAW images, allowing photographers to experiment with post-processing. While not every mode works alongside RAW image capture — RAW images have a lot of data that doesn’t always work for certain computational photography modes — many do and provide additional latitude when editing. King’s photos in this story were all shot in JPEG format and haven’t been edited. \u003c/p\u003e\n \u003cp\u003eAs for what mobile photographers should do when photographing fireworks, each King and Specht has different advice to offer. \u003c/p\u003e \u003cp\u003e“For me, it’s about trying quite a few different modes,” Specht, a \u003ca href=\"https://www.instagram.com/michael_specht_photo\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003every accomplished photographer\u003c/a\u003e, says. “I personally really love Pro Controls. It mimics exactly what I get out of my standalone cameras that I like to use. Being able to have that control of ‘I actually want these trails to be really short or I want to see really long trails from long exposures’ [is great]. That’s the mode I gravitate towards due to my personal background and skillset.” \u003c/p\u003e \u003cp\u003eWhile giving his answer, Specht references a wall of cameras behind him. “As you can see, I collect a bunch of cameras.” \u003c/p\u003e \u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053800558-603x800.jpg\" alt=\"A nighttime scene of a harbor with boats on the water, illuminated by vibrant fireworks in the sky and their reflections. Crowds gather near buildings along the waterfront, watching the colorful display.\" width=\"603\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053800558-603x800.jpg 603w, https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053800558-241x320.jpg 241w, https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053800558-1157x1536.jpg 1157w, https://petapixel.com/assets/uploads/2025/07/PXL_20230705_053800558.jpg 1205w\" sizes=\"(max-width: 603px) 100vw, 603px\"/\u003e\u003c/p\u003e \u003cp\u003eFor King, the answer is a little different. \u003c/p\u003e \u003cp\u003e“I’d recommend the long exposure photo mode for someone who just wants to take pictures and doesn’t want to futz around with dialing in the specific settings. You can get some really amazing photos using that mode,” he says. \u003c/p\u003e \u003cp\u003eBut for those who, like Specht, want more control, Pro Controls is a lot of fun. \u003c/p\u003e\n \u003cp\u003e“I’m a bit of a nerd, I guess, but it’s fun to try adjusting all those settings and seeing the different types of images you get and fine-tune the image.” \u003c/p\u003e \u003cp\u003eBoth Specht and King agree that one of the most important things is having fun, whether that’s achieved by simply getting fireworks photos as easily as possible or by experimenting with manual controls. Mobile photographers should ensure they enjoy the experience and have a good time.\u003c/p\u003e \u003cp\u003eThe experience leads to one final tip. Specht says that photographers should be flexible and not stay laser-focused on the subject they intended to capture.\u003c/p\u003e \u003cp\u003e“Usually for fireworks shows, you’re on a big lawn with a bunch of people around you, and actually the most interesting photo can be turning around and photographing the people watching the fireworks, using the fireworks as your light source,” Specht adds. “Don’t always think that the obvious subject is the one you should photograph.” \u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e Photos provided by Google’s Alex King \u003c/em\u003e \u003c/p\u003e      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-07-04T11:30:40Z",
  "modifiedTime": null
}
