{
  "id": "a5bb9d1b-b445-4e26-8ff7-4530ad9fe900",
  "title": "Malaysian Couple Tricked by AI Video Travel Hours to Fake Tourist Attraction",
  "link": "https://petapixel.com/2025/07/14/malaysian-couple-tricked-by-ai-video-travel-hours-to-fake-tourist-attraction/",
  "description": "An elderly Malaysian couple drove over 230 miles (370 kilometers) from Kuala Lumpur to Perak last month after watching an AI video promoting a scenic cable car ride in the town of Kuak Hulu -- only to discover upon arrival that the attraction does not exist. [Read More]",
  "author": "Matt Growcoot",
  "published": "Mon, 14 Jul 2025 17:17:58 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "News",
    "Technology",
    "aigenerated",
    "aivideo",
    "fake",
    "malaysia"
  ],
  "byline": "Matt Growcoot",
  "length": 2363,
  "excerpt": "The video has been removed after the controversy.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "An elderly Malaysian couple drove over 230 miles (370 kilometers) from Kuala Lumpur to Perak last month after watching an AI video promoting a scenic cable car ride in the town of Kuak Hulu — only to discover upon arrival that the attraction does not exist. According to reports in the Metro and South China Morning Post, the couple checked into a hotel in Perak’s Pengkalan Hulu area on June 30 and inquired about the so-called “Kuak Skyride,” a cable car service they had seen in a video featuring a television host. The hotel employee, who uses the name @dyaaaaaaa._ on social media, said she was initially confused by the request. “I was so shocked… I explained to the auntie that the video was made by AI and not real,” the staff member writes on Threads. The video in question featured a realistic AI-generated reporter from a fictional channel called “TV Rakyat.” The segment depicted the host boarding a cable car ride through mountainous forest scenery, interviewing tourists, and enjoying a high-end meal overlooking the landscape. The video concluded with a visit to a deer petting zoo. The video appears to have been made with Google Veo 3. When told the video was entirely fabricated, the elderly woman reportedly became upset and expressed her intent to sue the journalist seen in the footage. The hotel worker explained that the people in the video, including the reporter, were generated by artificial intelligence. The woman reportedly responded, “Why would anyone want to lie? There was even a reporter (in the video).” The video featured a realistic AI-generated reporter interviewing “tourists” about the cable car. The Metro reports that another person online said their parents also believed the video and spent RM 9,000 ($2,120) to rent a van to visit the non-existent attraction. Local media reports indicate the AI-generated video was widely circulated on social media before being removed amid mounting controversy. As AI video continues to iterate, bizarre incidents such as this will continue to happen. Last month, the popular YouTuber known as Cr1TiKaL demonstrated the power of AI video by fooling regular viewers with an AI-generated video of himself. PetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.",
  "image": "https://petapixel.com/assets/uploads/2025/07/Fake-Malysian-AI-Video.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\u003carticle data-post-id=\"804575\"\u003e\n\n    \u003cheader\u003e\n          \n    \n\n        \n  \u003c/header\u003e\n      \n  \n\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cdiv\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/dwa-eKTJFL0?si=WFOpRYLUtlFDzYW4\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e \u003cp\u003eAn elderly Malaysian couple drove over 230 miles (370 kilometers) from Kuala Lumpur to Perak last month after watching an AI video promoting a scenic cable car ride in the town of Kuak Hulu — only to discover upon arrival that the attraction does not exist.\u003c/p\u003e  \u003cp\u003eAccording to reports in the \u003ca href=\"https://metro.co.uk/2025/07/12/elderly-couple-travel-three-hours-attraction-doesnt-exist-23646650/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003e\u003cem\u003eMetro\u003c/em\u003e\u003c/a\u003e and \u003ca href=\"https://www.scmp.com/news/people-culture/article/3317337/malaysia-couple-travel-hours-tour-site-after-watching-ai-created-video-unaware-its-unreal?\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003e\u003cem\u003eSouth China Morning Post\u003c/em\u003e\u003c/a\u003e, the couple checked into a hotel in Perak’s Pengkalan Hulu area on June 30 and inquired about the so-called “Kuak Skyride,” a cable car service they had seen in a video featuring a television host. The hotel employee, who uses the name \u003ca href=\"https://www.threads.com/@dyaaaaaaa._\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003e@dyaaaaaaa._\u003c/a\u003e on social media, said she was initially confused by the request.\u003c/p\u003e \u003cp\u003e“I was so shocked… I explained to the auntie that the video was made by AI and not real,” the staff member writes on Threads. \u003c/p\u003e \u003cp\u003eThe video in question featured a realistic AI-generated reporter from a fictional channel called “TV Rakyat.” The segment depicted the host boarding a cable car ride through mountainous forest scenery, interviewing tourists, and enjoying a high-end meal overlooking the landscape. The video concluded with a visit to a deer petting zoo. The video appears to have been made with \u003ca href=\"https://petapixel.com/2025/05/20/googles-veo-3-and-imagen-4-generative-ai-models-crank-the-realism-dial-to-11/\" data-wpel-link=\"internal\"\u003eGoogle Veo 3.\u003c/a\u003e \u003c/p\u003e \u003cp\u003eWhen told the video was entirely fabricated, the elderly woman reportedly became upset and expressed her intent to sue the journalist seen in the footage. The hotel worker explained that the people in the video, including the reporter, were generated by artificial intelligence. The woman reportedly responded, “Why would anyone want to lie? There was even a reporter (in the video).”\u003c/p\u003e \u003cfigure id=\"attachment_804584\" aria-describedby=\"caption-attachment-804584\"\u003e\u003ca href=\"https://petapixel.com/2025/07/14/malaysian-couple-tricked-by-ai-video-travel-hours-to-fake-tourist-attraction/ai-interviewer/\" rel=\"attachment wp-att-804584\" data-wpel-link=\"internal\"\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/07/AI-Interviewer-800x444.jpeg\" alt=\"A woman holding a red microphone interviews a smiling man in a floral shirt and hat, joined by three other people standing outdoors in a crowded area.\" width=\"800\" height=\"444\" srcset=\"https://petapixel.com/assets/uploads/2025/07/AI-Interviewer-800x444.jpeg 800w, https://petapixel.com/assets/uploads/2025/07/AI-Interviewer-320x178.jpeg 320w, https://petapixel.com/assets/uploads/2025/07/AI-Interviewer.jpeg 1280w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-804584\"\u003eThe video featured a realistic AI-generated reporter interviewing “tourists” about the cable car.\u003c/figcaption\u003e\u003c/figure\u003e\n \u003cp\u003eThe \u003cem\u003eMetro\u003c/em\u003e reports that another person online said their parents also believed the video and spent RM 9,000 ($2,120) to rent a van to visit the non-existent attraction. Local media reports indicate the AI-generated video was widely circulated on social media before being removed amid mounting controversy. \u003c/p\u003e \u003cp\u003eAs AI video continues to iterate, bizarre incidents such as this will continue to happen. Last month, the \u003ca href=\"https://petapixel.com/2025/06/18/youtuber-cr1tikal-fools-viewers-to-show-how-good-ai-video-has-become/\" data-wpel-link=\"internal\"\u003epopular YouTuber known as Cr1TiKaL\u003c/a\u003e demonstrated the power of AI video by fooling regular viewers with an AI-generated video of himself. \u003c/p\u003e      \u003c/div\u003e\n\n          \n      \n\n              \u003cdiv\u003e\n          \u003cp\u003ePetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.\u003c/p\u003e\n        \u003c/div\u003e\n      \n    \n\n    \n          \n      \n\n\n\n\n    \n    \n    \n          \n      \u003c/div\u003e\n\u003c/article\u003e\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-14T17:17:58Z",
  "modifiedTime": "2025-07-14T17:18:00Z"
}
