{
  "id": "a879d462-740d-47be-8b45-3e1a8dd39539",
  "title": "How Wild Horses Helped a Photographer Rediscover Her Voice",
  "link": "https://petapixel.com/2025/03/04/how-wild-horses-helped-a-photographer-rediscover-her-voice/",
  "description": "Equine photographer Katja Jensen describes how she lost her artistic voice and found it again through photographing horses. [Read More]",
  "author": "Kate Garibaldi",
  "published": "Tue, 04 Mar 2025 21:30:51 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Inspiration",
    "Spotlight",
    "burnout",
    "canonr5",
    "equine",
    "highlands",
    "horse",
    "horses",
    "katjajensen",
    "portugal",
    "scotland",
    "scottishhighlands",
    "wildhorse",
    "wildlife"
  ],
  "byline": "Kate Garibaldi",
  "length": 5611,
  "excerpt": "Equine photographer Katja Jensen shares how she lost her artistic voice, but found it again through the photography of horses.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "Equine photographer Katja Jensen describes how she lost her artistic voice and found it again through photographing horses. Katja Jensen’s lifetime of work began at just eight years old with her mom’s DSLR camera. She started by photographing the animals around her home: cows, cats, dogs, and, of course, horses. It was the horses that really opened her heart. Jensen described how she grew up quiet and reserved. With animals, she finally felt like herself, without judgment or expectation. “I got so intrigued by the way I could freeze a moment in time, and I loved nothing more than to have animals as my subject. I was a quiet child. With them I didn’t need to use words, and I could be myself without the fear of being too much or not enough,” Jensen explains. “To this day I still find myself most comfortable in the presence of animals. I’ve shared many moments with different horses all over the world, and the words I exchange with humans will never be a match for my silent conversations with them.” With photography as her voice, Jensen built her portfolio over decades, featuring the most stunning breeds of horses. Walking the line between fairy tale and cinematic, her style is undeniable. The way that she captures light displays a painterly eye for the forms of shadows on her subjects. She prefers to photograph in blue or golden hour for the color of light. Often warm, earthy, or muted in tone, the images look vibrant without being overly saturated. With the horses as her muse, Jensen finds that the best way to create is by letting the horses be horses. She gives them space so that she can work with them rather than against them. Jensen believes that’s when the real connection happens, she’s able to capture their personality and behaviors on their terms. By allowing the horses to do what they want, she is able to witness them interact with each other or the environment rather than perform. Her photo shoots combine planning and intuition, a rhythm crafted from years of experience. It starts with the first inspiration for a project: a unique horse breed she has seen, a place that would make a perfect background, then once on location, the way the light hits scenery, or a story that she can’t get out of her head. She keeps the concept fluid and responds to both the animals and the landscape. To create her photographs, Jensen desires the highest quality work and files. Her primary kit is a Canon EOS R5 with 70-200mm f/2.8 lens. Occasionally, she also uses a 100-500mm lens for extra range when working in wide open spaces. Her selection process of which images make it through culling is where her key values align. She looks for light, movement, and, most of all, emotion. In post-processing, she prefers subtle but intentional adjustments to the tones, enhancing the depth and bringing the image more in line with the mood and feeling from that day. Her goal is to create a photograph that doesn’t just show a horse but displays real emotion and makes the viewer feel something. The horse as subject is the vessel. It’s that search for emotion that drives Jensen and her vision. From realizing in her youth that her connection to animals allowed her to be herself, she’s also reflected on how, even as an adult, people-pleasing can affect your work. It’s when it’s just her and the horses that she makes her finest artwork. This intuitive approach and self-awareness allow her to create her emotive work. Driven by feelings, she is drawn to the magic of light to document the personality of horses. Her latest published passion project, “Spirits of the Highlands,” documents the resilient, hardy Highland ponies that make the Scottish Highlands their home. It was also an important project for her to reconnect with her voice. She explains that she artistically felt lost for a time, as many photographers do when working on spec. The grind can be overwhelming, and burnout is difficult to overcome. Jensen says that being back in the wilds, just her and the horses brought her out of her shell. She describes how this reawakening of her photography roots helped her create some of her best work yet: “I didn’t realize what direction my heart pulled me in until I stopped doing paid and model shoots. In those settings, there were always people around who interfered and had an opinion. My turning point was visiting a group of Highland ponies in Scotland years back and sitting with them quietly on the mountainside. “Just like when I was little, there was no one forcing me to speak. To be something or someone that perhaps I wasn’t. The ponies quietly grazed away, leaving me to sit with my emotions and finally being able to hear my heart for the first time in a long time. These ponies helped me find my voice again. They held space for me as I searched for the meaning of my photography, and they helped me create some of my most emotional photos to this day. I’ve visited them more than once since the first time, and it always feels like coming home.” Katja Jensen’s journey highlights the importance of finding time to reconnect with what made you a photographer in the first place. To honor your core values and voice, and create with your whole heart, that is when photography feels like home. Katja Jensen’s next project documents her recent trip to Portugal in November of 2024. Reinvigorated from her work in Scotland with the Highland ponies, she photographed the proud Lusitano and native, wild Garrano ponies of the beautiful Iberian Peninsula. The collection will soon be on her website. Image credits: All photographs by Katja Jensen.",
  "image": "https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-Spotlight-PetaPixel-BG-v2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-CA1-800x534.jpg\" alt=\"Two horses stand closely together on a grassy plain under a vast sky. In the background, a range of distant mountains is visible beneath a cloudy sky with hints of sunset colors.\" width=\"800\" height=\"534\" srcset=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-CA1-800x534.jpg 800w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-CA1-320x214.jpg 320w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-CA1-1536x1025.jpg 1536w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-CA1-450x300.jpg 450w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-CA1-300x200.jpg 300w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-CA1-120x80.jpg 120w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-CA1.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003eEquine photographer \u003ca href=\"https://katjajensen.com/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eKatja Jensen\u003c/a\u003e describes how she lost her artistic voice and found it again through photographing horses.\u003c/p\u003e  \u003cp\u003eKatja Jensen’s lifetime of work began at just eight years old with her mom’s DSLR camera. She started by photographing the animals around her home: cows, cats, dogs, and, of course, horses. It was the horses that really opened her heart. \u003c/p\u003e \u003cp\u003eJensen described how she grew up quiet and reserved. With animals, she finally felt like herself, without judgment or expectation.\u003c/p\u003e \u003cp\u003e“I got so intrigued by the way I could freeze a moment in time, and I loved nothing more than to have animals as my subject. I was a quiet child. With them I didn’t need to use words, and I could be myself without the fear of being too much or not enough,” Jensen explains.\u003c/p\u003e \u003cp\u003e“To this day I still find myself most comfortable in the presence of animals. I’ve shared many moments with different horses all over the world, and the words I exchange with humans will never be a match for my silent conversations with them.”\u003c/p\u003e \u003cp\u003eWith photography as her voice, Jensen built her portfolio over decades, featuring the most stunning breeds of horses. \u003c/p\u003e\n \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8551-webfil-800x534.jpg\" alt=\"A powerful brown horse with a black mane and tail leaps gracefully against a dark, earthy background. Its front legs are raised, showcasing its strength and agility, with minimalist branding on its flank.\" width=\"800\" height=\"534\" srcset=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8551-webfil-800x534.jpg 800w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8551-webfil-320x213.jpg 320w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8551-webfil-1536x1024.jpg 1536w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8551-webfil-450x300.jpg 450w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8551-webfil-300x200.jpg 300w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8551-webfil-120x80.jpg 120w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8551-webfil.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7455-webfil-800x534.jpg\" alt=\"A lone tan horse with a white mane stands on a foggy beach, gazing at the gently lapping waves. The mist creates a serene and tranquil atmosphere along the sandy shore.\" width=\"800\" height=\"534\" srcset=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7455-webfil-800x534.jpg 800w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7455-webfil-320x213.jpg 320w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7455-webfil-1536x1024.jpg 1536w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7455-webfil-450x300.jpg 450w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7455-webfil-300x200.jpg 300w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7455-webfil-120x80.jpg 120w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7455-webfil.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003eWalking the line between fairy tale and cinematic, her style is undeniable. The way that she captures light displays a painterly eye for the forms of shadows on her subjects. She prefers to photograph in blue or golden hour for the color of light. Often warm, earthy, or muted in tone, the images look vibrant without being overly saturated.\u003c/p\u003e \u003cp\u003eWith the horses as her muse, Jensen finds that the best way to create is by letting the horses be horses. She gives them space so that she can work with them rather than against them. Jensen believes that’s when the real connection happens, she’s able to capture their personality and behaviors on their terms. By allowing the horses to do what they want, she is able to witness them interact with each other or the environment rather than perform.\u003c/p\u003e \u003cp\u003eHer photo shoots combine planning and intuition, a rhythm crafted from years of experience. It starts with the first inspiration for a project: a unique horse breed she has seen, a place that would make a perfect background, then once on location, the way the light hits scenery, or a story that she can’t get out of her head. She keeps the concept fluid and responds to both the animals and the landscape.\u003c/p\u003e \u003cp\u003eTo create her photographs, Jensen desires the highest quality work and files. Her primary kit is a \u003ca href=\"https://petapixel.com/2021/05/03/the-canon-eos-r5-produces-better-color-than-medium-format-cameras/\" data-wpel-link=\"internal\"\u003eCanon EOS R5\u003c/a\u003e with \u003ca href=\"https://petapixel.com/2019/11/06/testing-the-canon-rf-70-200mm-f-2-8-lens-for-10-days-in-california/\" data-wpel-link=\"internal\"\u003e70-200mm f/2.8 lens.\u003c/a\u003e Occasionally, she also uses a 100-500mm lens for extra range when working in wide open spaces.\u003c/p\u003e \u003cp\u003eHer selection process of which images make it through culling is where her key values align. She looks for light, movement, and, most of all, emotion. In post-processing, she prefers subtle but intentional adjustments to the tones, enhancing the depth and bringing the image more in line with the mood and feeling from that day. Her goal is to create a photograph that doesn’t just show a horse but displays real emotion and makes the viewer feel something. The horse as subject is the vessel.\u003c/p\u003e\n \u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC4-640x800.jpg\" alt=\"Close-up of a horse with a dark mane in a natural setting. A single green fern leaf is caught in its mane. The background is softly blurred, highlighting the horse\u0026#39;s profile and the striking contrast of the fern.\" width=\"640\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC4-640x800.jpg 640w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC4-256x320.jpg 256w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC4-1229x1536.jpg 1229w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC4.jpg 1280w\" sizes=\"(max-width: 640px) 100vw, 640px\"/\u003e\u003c/p\u003e \u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-6341-webfil-800x534.jpg\" alt=\"Close-up of a brown horse with a white blaze on its forehead, looking toward the camera. The background is a soft, blurry green, suggesting a natural outdoor setting.\" width=\"800\" height=\"534\" srcset=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-6341-webfil-800x534.jpg 800w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-6341-webfil-320x213.jpg 320w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-6341-webfil-1536x1024.jpg 1536w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-6341-webfil-450x300.jpg 450w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-6341-webfil-300x200.jpg 300w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-6341-webfil-120x80.jpg 120w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-6341-webfil.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7704-webfil-800x534.jpg\" alt=\"A white horse with a dark mane stands in profile, looking back towards a softly glowing streetlamp. The background is a dark, blurred natural setting, adding a dramatic contrast to the scene.\" width=\"800\" height=\"534\" srcset=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7704-webfil-800x534.jpg 800w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7704-webfil-320x213.jpg 320w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7704-webfil-1536x1024.jpg 1536w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7704-webfil-450x300.jpg 450w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7704-webfil-300x200.jpg 300w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7704-webfil-120x80.jpg 120w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-7704-webfil.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8017-webfil-534x800.jpg\" alt=\"A brown horse with a black mane stands beside a weathered stone railing in a lush, green forest setting, looking back over its shoulder. The background is rich with foliage, creating a serene and natural atmosphere.\" width=\"534\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8017-webfil-534x800.jpg 534w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8017-webfil-213x320.jpg 213w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8017-webfil-1024x1536.jpg 1024w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8017-webfil-1366x2048.jpg 1366w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-8017-webfil.jpg 1600w\" sizes=\"(max-width: 534px) 100vw, 534px\"/\u003e\u003c/p\u003e \u003cp\u003eIt’s that search for emotion that drives Jensen and her vision. From realizing in her youth that her connection to animals allowed her to be herself, she’s also reflected on how, even as an adult, people-pleasing can affect your work. It’s when it’s just her and the horses that she makes her finest artwork. This intuitive approach and self-awareness allow her to create her emotive work. Driven by feelings, she is drawn to the magic of light to document the personality of horses.\u003c/p\u003e \u003cp\u003eHer latest published passion project, “Spirits of the Highlands,” documents the resilient, hardy Highland ponies that make the Scottish Highlands their home. It was also an important project for her to reconnect with her voice. She explains that she artistically felt lost for a time, as many photographers do when working on spec. The grind can be overwhelming, and burnout is difficult to overcome. \u003c/p\u003e \u003cp\u003eJensen says that being back in the wilds, just her and the horses brought her out of her shell. She describes how this reawakening of her photography roots helped her create some of her best work yet:\u003c/p\u003e\n \u003cp\u003e“I didn’t realize what direction my heart pulled me in until I stopped doing paid and model shoots. In those settings, there were always people around who interfered and had an opinion. My turning point was visiting a group of Highland ponies in Scotland years back and sitting with them quietly on the mountainside.\u003c/p\u003e \u003cp\u003e“Just like when I was little, there was no one forcing me to speak. To be something or someone that perhaps I wasn’t. The ponies quietly grazed away, leaving me to sit with my emotions and finally being able to hear my heart for the first time in a long time.\u003c/p\u003e \u003cp\u003eThese ponies helped me find my voice again. They held space for me as I searched for the meaning of my photography, and they helped me create some of my most emotional photos to this day. I’ve visited them more than once since the first time, and it always feels like coming home.”\u003c/p\u003e \u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC1-copy-534x800.jpg\" alt=\"A white horse grazes on a misty hillside with rugged, fog-covered mountains in the background. The scene is in grayscale, creating a serene and atmospheric mood.\" width=\"534\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC1-copy-534x800.jpg 534w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC1-copy-214x320.jpg 214w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC1-copy-1025x1536.jpg 1025w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC1-copy.jpg 1068w\" sizes=\"(max-width: 534px) 100vw, 534px\"/\u003e\u003c/p\u003e \u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-NZ1-2000px-800x800.jpg\" alt=\"Two horses face each other, gently touching noses, in a grassy field. A third horse grazes in the blurred background. The image is in black and white, highlighting the horses\u0026#39; contrasting coat textures.\" width=\"800\" height=\"800\" srcset=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-NZ1-2000px-800x800.jpg 800w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-NZ1-2000px-320x320.jpg 320w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-NZ1-2000px-100x100.jpg 100w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-NZ1-2000px-1536x1536.jpg 1536w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-NZ1-2000px.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC2-800x534.jpg\" alt=\"A white horse stands on a grassy hill, looking back toward the camera. Dark, dramatic clouds hover over a rocky mountain in the background, creating a moody atmosphere. The scene is lush and picturesque.\" width=\"800\" height=\"534\" srcset=\"https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC2-800x534.jpg 800w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC2-320x214.jpg 320w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC2-1536x1025.jpg 1536w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC2-450x300.jpg 450w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC2-300x200.jpg 300w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC2-120x80.jpg 120w, https://petapixel.com/assets/uploads/2025/03/Katja-Jensen-PetaPixel-Spotlight-SC2.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003eKatja Jensen’s journey highlights the importance of finding time to reconnect with what made you a photographer in the first place. To honor your core values and voice, and create with your whole heart, that is when photography feels like home.\u003c/p\u003e\n \u003cp\u003eKatja Jensen’s next project documents her recent trip to Portugal in November of 2024. Reinvigorated from her work in Scotland with the Highland ponies, she photographed the proud Lusitano and native, wild Garrano ponies of the beautiful Iberian Peninsula. The collection will soon be on \u003ca href=\"https://katjajensen.com/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eher website\u003c/a\u003e. \u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e All photographs by Katja Jensen.\u003c/em\u003e\u003c/p\u003e      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-03-04T21:30:51Z",
  "modifiedTime": "2025-03-04T22:21:50Z"
}
