{
  "id": "d6e0a6eb-10d1-45a3-8151-af28e74d657c",
  "title": "6 Ideas for Stunning City Photography (+ Examples)",
  "link": "https://digital-photography-school.com/photographing-better-city-scenes/",
  "description": "The post 6 Ideas for Stunning City Photography (+ Examples) appeared first on Digital Photography School. It was authored by Christina N Dickson. Towns and cities may be noisy, busy, stressful, and congested – yet they provide amazing opportunities for photos. You can capture gorgeous skyline shots, amazing snaps featuring architectural landmarks, images of passersby dwarfed by giant skyscrapers, and so much more. However, if you’re new to the city or you’re an urban photo veteran in a […] The post 6 Ideas for Stunning City Photography (+ Examples) appeared first on Digital Photography School. It was authored by Christina N Dickson.",
  "author": "Christina N Dickson",
  "published": "Thu, 12 Dec 2024 09:00:00 +0000",
  "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
  "categories": [
    "Photography Tips and Tutorials",
    "beginner",
    "urban photography"
  ],
  "byline": "Christina N Dickson",
  "length": 8037,
  "excerpt": "Need some city photography inspiration? We share an array of ideas that practically guarantee amazing results.",
  "siteName": "Digital Photography School",
  "favicon": "https://digital-photography-school.com/android-chrome-192x192.png",
  "text": "Towns and cities may be noisy, busy, stressful, and congested – yet they provide amazing opportunities for photos. You can capture gorgeous skyline shots, amazing snaps featuring architectural landmarks, images of passersby dwarfed by giant skyscrapers, and so much more. However, if you’re new to the city or you’re an urban photo veteran in a creative rut, you might be looking for a few helpful ideas; that’s where this article comes into play. Below, I share six easy ideas for city photography. Whether you live in a bustling metropolis or a sleepy seaside town, you’re bound to find something on this list. So without further ado, let’s dive right in, starting with: While not every city offers skyscrapers, if you’re lucky enough to live in a busy area, you’re bound to have access to a tall building or two – and these can make for amazing city photo subjects. You have all sorts of options. For instance, you can travel to the base of a skyscraper and shoot upward. If the city features a handful of skyscrapers across a small area, try getting into position beneath several of the buildings, then shoot a beautiful multi-skyscraper composition. (Even better: Wait until the weather is foggy, then capture your favorite skyscrapers receding into the clouds.) Another approach is to find a vantage point off in the distance and shoot toward the skyscraper using a wide-angle (or even a telephoto) lens. If the city includes a lookout deck, you might try getting into position just before sunset to capture the buildings from above. Another solid alternative is to find a parking garage with public access; these often afford great views of skyscrapers! Of course, you can also try to find a place outside the main business district to shoot from: Pay careful attention to the lighting. Sunrise and sunset can provide dramatic front light, backlighting, and side lighting, though you might also come during the middle of the day when the sun casts harsh shadows and turns skyscrapers into abstract geometric elements. Don’t be afraid to experiment, either. Some of your shots may not work out, but the ones that do will make it all worth it! 2. The nocturnal cityscape Cities look amazing at sunrise, sunset, and even during the day – but have you considered shooting your favorite cityscape locations at night? Thanks to the bright lights of the city skyline, it’s possible to create all sorts of gorgeous images after dark, including stunning long-exposure shots that combine artificial lighting with dark alleys, eerie parks, and even moving water. You can shoot from smack-dab in the middle of the city or from afar; the key is to bring a tripod and a remote release so you can use lengthy shutter speeds without issue. It can also help to bracket your images and blend the files together using HDR techniques during post-processing. A great time to shoot nocturnal cityscapes is just after dark. The light from the sky won’t have completely faded, giving you a bit more illumination (and color) to work with, and the building lights will generally provide a gorgeous golden glow. Also, be sure you think carefully about safety. Don’t linger too long in any one place, make sure you’re always aware of your surroundings, and whatever you do, don’t leave your equipment unattended. Pro tip: Even if your goal is to shoot after the sun sets, set yourself up a half-hour or so in advance. That way, you have plenty of time to find a composition before the conditions are right (and you can even experiment with the changing light as it shifts from light to dark). 3. City reflections If you live in a touristy city, certain buildings and city landmarks may feel so over-photographed that you’re reluctant to point your camera in their direction. One way to capture more original images of these locations is to change up your angle or perspective – in particular, I recommend finding some water, then shooting with a wide-angle lens so as to include the buildings, any interesting landmarks, and their reflections. Not all cities sit along bays, lakes, or rivers, of course, but that’s no reason to give up on reflection shots. You can use puddles or fountains to capture interesting water reflections, or you can use shiny glass or metal to get the result you’re looking for. For the best results, use a tripod and narrow your aperture until the entire scene is in focus. That way, the city and its reflection will turn out crisp and beautiful. 4. Street scenes at night One of my city photography ideas (suggested above) is to photograph cityscapes at night, but I’d also encourage you to capture street scenes after dark – in other words, look for opportunities to combine buildings and people for amazing results. You can take a few approaches here. One option is to use a tripod and tackle the street scenes like a cityscape shooter. Set up a composition, wait for the right person to walk through, and when the moment is right, press that shutter button. (You’ll want to keep an eye on your shutter speed, but even if the person is slightly blurry, that’s okay; it’s really more about the feeling of the entire scene.) You might also consider shooting in busier areas with an ultra-long shutter speed; a 10-second exposure will capture the flow of traffic or people as they move across the scene and make for a breathtaking photo. Alternatively, you can crank up your camera’s ISO, make sure you have a reasonably fast shutter speed, and work handheld. That way, you can react more quickly to events on the street, and while the higher ISO will degrade image quality, the noise can actually give your shots an interesting grungy look. 5. The city from above Aerial images give viewers a completely new perspective, even if the shots depict buildings and city landmarks they’ve seen hundreds or even thousands of times. That’s why, if you have the opportunity, I really encourage you to grab a wide-angle lens, get up high, and see what you can create. Many aerial shots are taken using drones, but if you don’t already own one and don’t wish to fork over hundreds (or thousands) of dollars, you do have other options. Observation decks are great, and you can find a few in most major cities. If you want to shoot at sunset or after dark, call in advance to determine any rules about tripods, as not all decks allow them. You can also look for rooftop restaurants and bars that allow public access, and depending on the size of the buildings, you may even manage to capture aerial-type shots from certain parking garages. Of course, make sure you do your high-elevation shots safely. Never lean over railings, and if you do plan to hold your camera out over a ledge, secure your camera strap around your hand or neck to keep it safe. 6. The city and its environment Most city photographers capture images that focus on the buildings and their features, but if you’re after truly unique images, why not find a distant vantage point and see if you can contextualize the city? By including the surrounding forests, plains, lakes, or suburbs, you can give viewers a sense of the city and its environment. You generally will need to find a vantage point of some sort – here, a drone can be helpful, though you can also shoot from a distant hill or structure. A wide-angle lens generally gives great results, though I’d encourage you to work with a variety of focal lengths to achieve different effects! City photography ideas: final words Well, there you have it: Six easy ideas for amazing shots of cities. Hopefully, you’re now feeling inspired – and you’re ready to head out with your camera and capture some gorgeous photos! Now over to you: What city do you plan to photograph? Do you have any specific shots in mind? Share your thoughts in the comments below! Read more from our Tips \u0026 Tutorials category I need help with...",
  "image": "https://digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes06.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\t\t\t\n\t\t\n\t\t\n\t\t\n\n\t\t\u003csection\u003e\n\t\t\t\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1242\" height=\"1265\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/01/city-photography-ideas-1005.jpg?resize=1242%2C1265\u0026amp;ssl=1\" alt=\"Ideas for gorgeous city photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/01/city-photography-ideas-1005.jpg?w=1242\u0026amp;ssl=1 1242w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/01/city-photography-ideas-1005.jpg?resize=295%2C300\u0026amp;ssl=1 295w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/01/city-photography-ideas-1005.jpg?resize=589%2C600\u0026amp;ssl=1 589w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/01/city-photography-ideas-1005.jpg?resize=768%2C782\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/01/city-photography-ideas-1005.jpg?resize=717%2C730\u0026amp;ssl=1 717w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/01/city-photography-ideas-1005.jpg?resize=50%2C50\u0026amp;ssl=1 50w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eTowns and cities may be noisy, busy, stressful, and congested – yet they provide amazing opportunities for photos. You can capture gorgeous skyline shots, amazing snaps featuring architectural landmarks, images of passersby dwarfed by giant skyscrapers, and so much more.\u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, if you’re new to the city \u003cem\u003eor \u003c/em\u003eyou’re an urban photo veteran in a creative rut, you might be looking for a few helpful ideas; that’s where this article comes into play.\u003c/p\u003e\n\n\n\n\u003cp\u003eBelow, I share six easy ideas for city photography. Whether you live in a bustling metropolis or a sleepy seaside town, you’re bound to find \u003cem\u003esomething \u003c/em\u003eon this list. So without further ado, let’s dive right in, starting with:\u003c/p\u003e\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1060\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes01.jpg?resize=1500%2C1060\u0026amp;ssl=1\" alt=\"City photography ideas\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes01.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes01.jpg?resize=300%2C212\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes01.jpg?resize=768%2C543\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes01.jpg?resize=600%2C424\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes01.jpg?resize=717%2C507\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eWhile not every city offers skyscrapers, if you’re lucky enough to live in a busy area, you’re bound to have access to a tall building or two – and these can make for amazing city photo subjects.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou have all sorts of options. For instance, you can travel to the base of a skyscraper and shoot upward. If the city features a handful of skyscrapers across a small area, try getting into position beneath several of the buildings, then shoot a beautiful multi-skyscraper composition. (Even better: Wait until the weather is foggy, then capture your favorite skyscrapers receding into the clouds.)\u003c/p\u003e\n\n\n\n\u003cp\u003eAnother approach is to find a vantage point off in the distance and shoot toward the skyscraper using a wide-angle (or even a telephoto) lens. If the city includes a lookout deck, you might try getting into position just before sunset to capture the buildings from above. Another solid alternative is to find a parking garage with public access; these often afford great views of skyscrapers! Of course, you can also try to find a place outside the main business district to shoot from:\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1000\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes02.jpg?resize=1500%2C1000\u0026amp;ssl=1\" alt=\"City photography ideas\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes02.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes02.jpg?resize=300%2C200\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes02.jpg?resize=768%2C512\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes02.jpg?resize=600%2C400\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes02.jpg?resize=90%2C60\u0026amp;ssl=1 90w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes02.jpg?resize=717%2C478\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePay careful attention to the lighting. Sunrise and sunset can provide dramatic \u003ca aria-label=\"front light (opens in a new tab)\" href=\"https://digital-photography-school.com/front-light-photography/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003efront light\u003c/a\u003e, \u003ca aria-label=\"backlighting (opens in a new tab)\" href=\"https://digital-photography-school.com/backlighting-in-photography/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ebacklighting\u003c/a\u003e, and \u003ca aria-label=\"side lighting (opens in a new tab)\" href=\"https://digital-photography-school.com/side-lighting-photography/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eside lighting\u003c/a\u003e, though you might also come during the middle of the day when the sun casts harsh shadows and turns skyscrapers into abstract geometric elements. Don’t be afraid to experiment, either. Some of your shots may not work out, but the ones that do will make it all worth it!\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"the-nocturnal-cityscape\"\u003e2. The nocturnal cityscape\u003c/h2\u003e\n\n\n\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1000\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes06.jpg?resize=1500%2C1000\u0026amp;ssl=1\" alt=\"City photography ideas\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes06.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes06.jpg?resize=300%2C200\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes06.jpg?resize=768%2C512\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes06.jpg?resize=600%2C400\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes06.jpg?resize=90%2C60\u0026amp;ssl=1 90w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes06.jpg?resize=717%2C478\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eCities look amazing at sunrise, sunset, and even during the day – but have you considered shooting your favorite cityscape locations at night? \u003c/p\u003e\n\n\n\n\u003cp\u003eThanks to the bright lights of the city skyline, it’s possible to create all sorts of gorgeous images after dark, including stunning \u003ca href=\"https://digital-photography-school.com/step-by-step-guide-to-long-exposure-photography/\" target=\"_blank\" aria-label=\"long-exposure shots (opens in a new tab)\" rel=\"noreferrer noopener\"\u003elong-exposure shots\u003c/a\u003e that combine artificial lighting with dark alleys, eerie parks, and even moving water.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can shoot from smack-dab in the middle of the city \u003cem\u003eor \u003c/em\u003efrom afar; the key is to bring a tripod and a \u003ca href=\"https://digital-photography-school.com/8-benefits-using-wireless-remote-photography/\" target=\"_blank\" aria-label=\"remote release (opens in a new tab)\" rel=\"noreferrer noopener\"\u003eremote release\u003c/a\u003e so you can use lengthy \u003ca href=\"https://digital-photography-school.com/shutter-speed/\" target=\"_blank\" aria-label=\"shutter speeds (opens in a new tab)\" rel=\"noreferrer noopener\"\u003eshutter speeds\u003c/a\u003e without issue. It can also help to bracket your images and blend the files together using \u003ca href=\"https://digital-photography-school.com/getting-real-hdr/\" target=\"_blank\" aria-label=\"HDR techniques (opens in a new tab)\" rel=\"noreferrer noopener\"\u003eHDR techniques\u003c/a\u003e during post-processing.\u003c/p\u003e\n\n\n\n\u003cp\u003eA great time to shoot nocturnal cityscapes is just after dark. The light from the sky won’t have completely faded, giving you a bit more illumination (and color) to work with, and the building lights will generally provide a gorgeous golden glow.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1000\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes03.jpg?resize=1500%2C1000\u0026amp;ssl=1\" alt=\"City photography ideas\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes03.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes03.jpg?resize=300%2C200\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes03.jpg?resize=768%2C512\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes03.jpg?resize=600%2C400\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes03.jpg?resize=90%2C60\u0026amp;ssl=1 90w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes03.jpg?resize=717%2C478\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAlso, be sure you think carefully about safety. Don’t linger too long in any one place, make sure you’re always aware of your surroundings, and whatever you do, \u003cem\u003edon’t \u003c/em\u003eleave your equipment unattended.\u003c/p\u003e\n\n\n\n\u003cp\u003ePro tip: Even if your goal is to shoot after the sun sets, set yourself up a half-hour or so in advance. That way, you have plenty of time to find a composition before the conditions are right (and you can even experiment with the changing light as it shifts from light to dark).\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"city-reflections\"\u003e3. City reflections\u003c/h2\u003e\n\n\n\n\u003cp\u003eIf you live in a touristy city, certain buildings and city landmarks may feel so over-photographed that you’re reluctant to point your camera in their direction.\u003c/p\u003e\n\n\n\n\u003cp\u003eOne way to capture more original images of these locations is to change up your angle or perspective – in particular, I recommend finding some water, then shooting with a wide-angle lens so as to include the buildings, any interesting landmarks, \u003cem\u003eand \u003c/em\u003etheir reflections.\u003c/p\u003e\n\n\n\n\u003cp\u003eNot all cities sit along bays, lakes, or rivers, of course, but that’s no reason to give up on reflection shots. You can use puddles or fountains to capture interesting water reflections, or you can use shiny glass or metal to get the result you’re looking for.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"538\" height=\"600\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes04.jpg?resize=538%2C600\u0026amp;ssl=1\" alt=\"City photography ideas\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes04.jpg?resize=538%2C600\u0026amp;ssl=1 538w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes04.jpg?resize=269%2C300\u0026amp;ssl=1 269w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes04.jpg?resize=768%2C856\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes04.jpg?resize=717%2C799\u0026amp;ssl=1 717w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes04.jpg?w=1346\u0026amp;ssl=1 1346w\" sizes=\"auto, (max-width: 538px) 100vw, 538px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eFor the best results, use a tripod and narrow your aperture until the entire scene is in focus. That way, the city \u003cem\u003eand \u003c/em\u003eits reflection will turn out crisp and beautiful.\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"street-scenes-at-night\"\u003e4. Street scenes at night\u003c/h2\u003e\n\n\n\n\u003cp\u003eOne of my city photography ideas (suggested above) is to \u003ca href=\"https://digital-photography-school.com/nightscapes-photographing-the-city-at-night/\" target=\"_blank\" aria-label=\"photograph cityscapes at night (opens in a new tab)\" rel=\"noreferrer noopener\"\u003ephotograph cityscapes at night\u003c/a\u003e, but I’d also encourage you to capture \u003ca href=\"https://digital-photography-school.com/in-the-dark-10-tips-for-street-night-photography/\" target=\"_blank\" aria-label=\"street scenes after dark (opens in a new tab)\" rel=\"noreferrer noopener\"\u003estreet scenes after dark\u003c/a\u003e – in other words, look for opportunities to combine buildings \u003cem\u003eand \u003c/em\u003epeople for amazing results. \u003c/p\u003e\n\n\n\n\u003cp\u003eYou can take a few approaches here. One option is to use a tripod and tackle the street scenes like a \u003ca href=\"https://digital-photography-school.com/10-tips-better-cityscape-photography/\" target=\"_blank\" aria-label=\"cityscape shooter (opens in a new tab)\" rel=\"noreferrer noopener\"\u003ecityscape shooter\u003c/a\u003e. Set up a composition, wait for the right person to walk through, and when the moment is right, press that shutter button. (You’ll want to keep an eye on your shutter speed, but even if the person is slightly blurry, that’s okay; it’s really more about the feeling of the entire scene.) \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1000\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes05.jpg?resize=1500%2C1000\u0026amp;ssl=1\" alt=\"City photography ideas\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes05.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes05.jpg?resize=300%2C200\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes05.jpg?resize=768%2C512\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes05.jpg?resize=600%2C400\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes05.jpg?resize=90%2C60\u0026amp;ssl=1 90w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes05.jpg?resize=717%2C478\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eYou might also consider shooting in busier areas with an ultra-long shutter speed; a 10-second exposure will capture the flow of traffic or people as they move across the scene and make for a breathtaking photo.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlternatively, you can crank up your camera’s \u003ca href=\"https://digital-photography-school.com/iso-settings/\" target=\"_blank\" aria-label=\"ISO (opens in a new tab)\" rel=\"noreferrer noopener\"\u003eISO\u003c/a\u003e, make sure you have a reasonably fast shutter speed, and work handheld. That way, you can react more quickly to events on the street, and while the higher ISO will degrade image quality, the \u003ca href=\"https://digital-photography-school.com/how-to-avoid-and-reduce-noise-in-your-images/\" target=\"_blank\" aria-label=\"noise (opens in a new tab)\" rel=\"noreferrer noopener\"\u003enoise\u003c/a\u003e can actually give your shots an interesting grungy look.\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"the-city-from-above\"\u003e5. The city from above\u003c/h2\u003e\n\n\n\n\u003cp\u003eAerial images give viewers a completely new perspective, even if the shots depict buildings and city landmarks they’ve seen hundreds or even thousands of times. \u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s why, if you have the opportunity, I really encourage you to grab a wide-angle lens, get up high, and see what you can create.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1000\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes07.jpg?resize=1500%2C1000\u0026amp;ssl=1\" alt=\"City photography ideas\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes07.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes07.jpg?resize=300%2C200\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes07.jpg?resize=768%2C512\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes07.jpg?resize=600%2C400\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes07.jpg?resize=90%2C60\u0026amp;ssl=1 90w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes07.jpg?resize=717%2C478\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eMany aerial shots are taken using drones, but if you don’t already own one and don’t wish to fork over hundreds (or thousands) of dollars, you do have other options. Observation decks are great, and you can find a few in most major cities. If you want to shoot at sunset or after dark, call in advance to determine any rules about tripods, as not all decks allow them. \u003c/p\u003e\n\n\n\n\u003cp\u003eYou can also look for rooftop restaurants and bars that allow public access, and depending on the size of the buildings, you may even manage to capture aerial-type shots from certain parking garages.\u003c/p\u003e\n\n\n\n\u003cp\u003eOf course, make sure you do your high-elevation shots \u003cem\u003esafely\u003c/em\u003e. Never lean over railings, and if you do plan to hold your camera out over a ledge, secure your camera strap around your hand or neck to keep it safe.\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"the-city-and-its-environment\"\u003e6. The city and its environment\u003c/h2\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1000\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes08.jpg?resize=1500%2C1000\u0026amp;ssl=1\" alt=\"City photography ideas\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes08.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes08.jpg?resize=300%2C200\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes08.jpg?resize=768%2C512\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes08.jpg?resize=600%2C400\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes08.jpg?resize=90%2C60\u0026amp;ssl=1 90w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2018/11/Cityscenes08.jpg?resize=717%2C478\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eMost city photographers capture images that focus on the buildings and their features, but if you’re after truly unique images, why not find a distant vantage point and see if you can contextualize the city? \u003c/p\u003e\n\n\n\n\u003cp\u003eBy including the surrounding forests, plains, lakes, or suburbs, you can give viewers a sense of the city and its environment. You generally will need to find a vantage point of some sort – here, a drone can be helpful, though you can also shoot from a distant hill or structure.\u003c/p\u003e\n\n\n\n\u003cp\u003eA wide-angle lens generally gives great results, though I’d encourage you to work with a variety of focal lengths to achieve different effects! \u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"city-photography-ideas-final-words\"\u003eCity photography ideas: final words\u003c/h2\u003e\n\n\n\n\u003cp\u003eWell, there you have it:\u003c/p\u003e\n\n\n\n\u003cp\u003eSix easy ideas for amazing shots of cities. Hopefully, you’re now feeling inspired – and you’re ready to head out with your camera and capture some gorgeous photos!\u003c/p\u003e\n\n\n\n\u003cp\u003eNow over to you:\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eWhat city do you plan to photograph? Do you have any specific shots in mind? Share your thoughts in the comments below!\u003c/em\u003e\u003c/p\u003e\n\n\t  \n      \n    \u003c/section\u003e\n\n\t\t\n\n\t\t\u003csection\u003e\n\t\t\t\u003ch3\u003eRead more from our \u003ca href=\"https://digital-photography-school.com/tips/\"\u003eTips \u0026amp; Tutorials\u003c/a\u003e category\u003c/h3\u003e\n\t\t\t\n\n\t\t\t\t\t\u003c/section\u003e\n\n\t\t\t\u003csection\u003e\n\t\t\u003cspan\u003eI need help with...\u003c/span\u003e\n\t\t\n\t\u003c/section\u003e\n\t\n\t\t\n\t\t\t\t\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-12-12T09:00:00Z",
  "modifiedTime": "2024-12-12T22:52:54Z"
}
