[
  {
    "id": "edaaa57c-3ce4-4801-8e22-a70f31f6b23e",
    "title": "Magnifier on Mac | Apple",
    "link": "https://www.youtube.com/watch?v=R3rBlZGEssw",
    "description": "",
    "author": "Apple",
    "published": "2025-05-15T16:02:04+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "72fcd297-85d1-44fa-9da1-c554383429ba",
    "title": "Mac | Mirrored | Apple",
    "link": "https://www.youtube.com/watch?v=pmyBHUIrQic",
    "description": "",
    "author": "Apple",
    "published": "2025-05-12T16:30:25+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=Apple",
    "categories": null
  },
  {
    "id": "18d31fef-bffc-4fca-80d3-6eeb9c9a6389",
    "title": "App Store in the U.S. facilitated $406B in developer billings and sales in 2024",
    "link": "https://www.apple.com/newsroom/2025/05/app-store-in-the-us-facilitated-406-billion-usd-in-developer-billings-and-sales-in-2024/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2025-05-29T14:59:20.386Z",
    "image": "https://www.apple.com/newsroom/images/2025/05/app-store-in-the-us-facilitated-406-billion-usd-in-developer-billings-and-sales-in-2024/tile/Apple-App-Store-ecosystem-in-US-illustration-01-lp.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "UPDATE"
    ]
  },
  {
    "id": "ce152033-6740-458e-bf8e-1cff9029e569",
    "title": "Logic Pro amplifies beat making on Mac and iPad with advanced new capabilities",
    "link": "https://www.apple.com/newsroom/2025/05/logic-pro-amplifies-beat-making-on-mac-and-ipad-with-advanced-new-capabilities/",
    "description": "",
    "author": "Apple Newsroom",
    "published": "2025-05-28T13:00:15.887Z",
    "image": "https://www.apple.com/newsroom/images/2025/05/logic-pro-amplifies-beat-making-on-mac-and-ipad-with-advanced-new-capabilities/tile/Apple-Logic-Pro-hero-lp.jpg.og.jpg",
    "source": "https://www.apple.com/newsroom/rss-feed.rss",
    "categories": [
      "UPDATE"
    ]
  },
  {
    "id": "c7f41a63-6801-4f8c-a935-d238ee3f0e63",
    "title": "The Talk Show Live From WWDC 2025: Tuesday June 10",
    "link": "https://ti.to/daringfireball/the-talk-show-live-from-wwdc-2025",
    "description": "",
    "author": "John Gruber",
    "published": "2025-05-30T02:50:00Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "ce8e7eff-e13d-4840-af35-1ec13098e637",
    "title": "The Talk Show: ‘Sewing Machine Repair Shop’",
    "link": "https://daringfireball.net/thetalkshow/2025/05/29/ep-423",
    "description": "",
    "author": "John Gruber",
    "published": "2025-05-30T02:49:47Z",
    "image": "",
    "source": "https://daringfireball.net/feeds/main",
    "categories": null
  },
  {
    "id": "e5f84f96-4a9a-4d25-aac3-8bf6a0d10c39",
    "title": "Instagram for iPad is reportedly coming soon; here’s when to expect it",
    "link": "https://9to5mac.com/2025/06/01/instagram-for-ipad-coming-in-2025/",
    "description": "A few days ago and fifteen years too late, Meta released an official iPad app for WhatsApp. And while many celebrated the end of one of the most inexplicable software holdouts in App Store history, others asked the most obvious follow-up question: “Thanks! Can we have Instagram next?” Yes, as it turns out. more…",
    "author": "Marcus Mendes",
    "published": "Sun, 01 Jun 2025 21:34:35 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2025/06/instagram-ipad.jpg?quality=82\u0026strip=all\u0026w=1500",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "0691af7d-dc11-4835-8175-03258d638875",
    "title": "Here’s how an iPhone AI agent could change how we complete tasks",
    "link": "https://9to5mac.com/2025/06/01/heres-how-an-iphone-ai-agent-could-change-how-we-complete-tasks/",
    "description": "While AI can help us do stuff, AI agents are tools that actually do stuff for us. A new open-source project shows how an ChatGPT-powered agent could complete tasks for us using our iPhones. more…",
    "author": "Zac Hall",
    "published": "Sun, 01 Jun 2025 20:37:26 +0000",
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2025/01/iPhone-16-ban-could-end-in-1-2-weeks-says-Indonesia-without-explanation.jpg?quality=82\u0026strip=all\u0026w=1600",
    "source": "https://9to5mac.com/feed",
    "categories": [
      "News"
    ]
  },
  {
    "id": "f211cded-6e89-41c7-a030-8d8345d3b486",
    "title": "iOS 19 is Now iOS 26?? - HUGE Changes Coming at WWDC 2025!",
    "link": "https://www.youtube.com/watch?v=VL_UcDYm5Gk",
    "description": "",
    "author": "MacRumors",
    "published": "2025-05-30T14:37:24+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "36e4d198-5ba9-4d29-b700-e0e3a0fc501a",
    "title": "No iOS 19: Apple Going Straight to iOS 26",
    "link": "https://www.youtube.com/watch?v=U-HRDgKmcXw",
    "description": "",
    "author": "MacRumors",
    "published": "2025-05-28T19:41:20+00:00",
    "image": "",
    "source": "https://www.youtube.com/feeds/videos.xml?user=macrumors",
    "categories": null
  },
  {
    "id": "f23467a7-f296-4edd-a4df-99e0a95ff4ce",
    "title": "macOS 26 rumored to be called 'Tahoe'",
    "link": "https://appleinsider.com/articles/25/06/01/macos-26-rumored-to-be-called-tahoe?utm_medium=rss",
    "description": "Like its previous OS versions that denoted significant changes, Apple is rumored to give the upcoming macOS 26 the name of a particularly notable California location.The next macOS is rumored to be called 'Tahoe'Apple is reportedly overhauling the look of its various OSes with its next set of releases, expected to arrive in the fall of this year. Adopting the nomenclature of vehicle models, the company is set to jump from version numbers to reflecting the year ahead of release.According to a new report from Bloomberg, macOS 26 will adopt the name Tahoe, after California's Lake Tahoe resort area. Rumor Score: 🤔 Possible Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "Charles Martin",
    "published": "Sun, 01 Jun 2025 12:54:12 +0000",
    "image": "https://photos5.appleinsider.com/gallery/63812-132762-macOS-26-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "404afe72-1a08-4a08-a1ad-08337033e489",
    "title": "Siri Chatbot prototype nears ChatGPT quality, but hallucinates more than Apple wants",
    "link": "https://appleinsider.com/articles/25/06/01/siri-chatbot-prototype-nears-chatgpt-quality-but-hallucinates-more-than-apple-wants?utm_medium=rss",
    "description": "A new report claims that internally, Apple has already been testing Large Language Models for Siri that are vastly more powerful than the shipping Apple Intelligence, but executives disagree about when to release it.Internally, Siri us close to ChatGPT level accuracy.Backing up AppleInsider's position that Apple is not behind on AI, the company has regularly been publishing research showing its progress moving the field forward. Now according to Bloomberg, Apple has already been working with AI systems considerably more power than the on-device Apple Intelligence it has shipped so far.Specifically, the report says that internally, Apple is using multiple different models with ever greater complexity. Apple is said to be testing models with 3 billion, 7 billion, 33 billion, and 150 billion parameters. Rumor Score: 🤯 Likely Continue Reading on AppleInsider | Discuss on our Forums",
    "author": "William Gallagher",
    "published": "Sun, 01 Jun 2025 12:37:43 +0000",
    "image": "https://photos5.appleinsider.com/gallery/63669-132429-58703-119640-SiriGPT-xl-xl.jpg",
    "source": "https://appleinsider.com/rss/news/",
    "categories": null
  },
  {
    "id": "ab991fb2-1284-41cd-8431-3cd463179ba8",
    "title": "macOS 16 (macOS 26): Everything we know so far about the next Mac update",
    "link": "https://www.macworld.com/article/2644146/macos-16-release-beta-features-compatibility.html",
    "description": "Macworld Apple’s Worldwide Developers Conference (WWDC) is coming soon, and that’s when we will learn all about macOS 16, the next version of the Mac operating system (as well as iOS 19 the new iPhone OS and iPadOS 19). This version could include some big changes for the Mac, including a new look interface. Apple hasn’t made any formal announcements about macOS 16 so far, but rumors are starting to leak. This article keeps track of the reports, so you can get an idea of what to look forward to when macOS 16 is revealed in June and arrives on Mac later in the year. Update June 1: The next version of the Mac operating system may be called macOS Tahoe. macOS 16: Release date We’ll get a first look at the next version of macOS at WWDC in June, but Apple’s official release of macOS 16 (possibly called macOS 26) will be in the fall, as is usually the case. The release of macOS 16 is likely to coincide with the release of iOS 19, which will probably happen a few days after the iPhone event in September 2025. We anticipate the September iPhone event will take place on September 9, so the software could be out around September 15 or 16. However, Apple has previously scheduled the update to macOS after iOS, sometimes as short as a week, sometimes as long as a month, so there could be a longer wait. Here is the recent shipping history for macOS. macOS 15 Sequoia: September 16, 2024 macOS 14 Sonoma: September 26, 2023 macOS 13 Ventura: October 24, 2022 macOS 12 Monterey: October 25, 2021 macOS 11 Big Sur: November 12, 2020 macOS 10.15 Catalina: October 7, 2019 macOS 10.14 Mojave: September 24, 2018 macOS 16: Developer and Public Betas However, you won’t have to wait until the full release to try the new software out. Apple will run a developer beta as well as a public beta, so if you want to try out the new features before they are released to the general public you will be able to do so. Both betas are free, though the developer beta requires a free registration as a developer. The first developer macOS Beta is usually shipped at the beginning of WWDC. In 2025 the WWDC keynote will take place on June 9. The public beta is released about a month later, usually after the developer beta moves to a second stage (beta 2). In 2024 the pubic beta arrived on July 15. Between WWDC and the official release in the fall, Apple will release beta updates to developers and the public. Anyone using the beta is encouraged to file bug reports using the included Apple’s Feedback Assistant app so that the company can address them. Learn more about participating in Apple’s beta software program so you can sign up and test the new software as soon as the beta arrives. macOS 16: What will macOS 16 be called? Unlike its other operating systems, Apple attaches a name to macOS. The current name is macOS Sequoia, but as it is version 15 of the software it’s also known as macOS 15. So, it follows that the next version of macOS will be macOS 16, except that there is a report from Mark Gurman of Bloomberg claiming that Apple will call the next version of its Mac operating system macOS 26. This will be in line with all its operating systems, so we can expect: iOS 26, iPadOS 26, macOS 26, tvOS 26 and WatchOS 26. If this happens, it will certainly be less confusing for everyone! But macOS also has another name that isn’t tied to the number. Since OS X 10.9 in 2013, Apple has used names that are associated with California. Rumors of the new name will swirl before the official release. Some reportedly trademarked names that have circulated in recent years include California, Condor, Diablo, Farallon, Grizzly, Mammoth, Miramar, Pacific, Redwood, Redtail, Rincon, Skyline, and Shasta. These names have been registered by a company that is believed to be a shell for Apple. Internally at the company, macOS 16 is codenamed Cheer, but that won’t be its final name (see all the code names for macOS versions in our complete list of every macOS and Mac OS X release.) On June 1, Gurman reported that the name will be macOS Tahoe, after Lake Tahoe in northern California. Lake Tahoe is renowned for its deep blue water, which Gurman cites as an allusion to the user interface overhaul expected in the new macOS. Will Apple continue with the California-based names? Count on it.Apple Here is a list of the recent macOS names based on places in California: OS X Mavericks (version 10.9) OS X Yosemite (version 10.10) OS X El Capitan (version 10.11) macOS Sierra (version 10.12) macOS High Sierra (version 10.13) macOS Mojave (version 10.14) macOS Catalina (version 10.15) macOS Big Sur (version 11) macOS Monterey (version 12) macOS Ventura (version 13) macOS Sonoma (version 14) macOS Sequoia (version 15) macOS 16: Compatibility Because macOS 16 may feature major interface changes, Apple may decide to make this the first version of macOS that does not run on Intel-based Macs. The signs of this started appearing a couple of years ago and with Sequoia only supporting recent Intel Macs (see: Intel Macs that can run macOS Sequoia for more information). Apple wants to move any users of these Macs over to M-Series Macs and could use this version of macOS as a cutoff point. It’s unknown if the UI changes depend on hardware found only on M-series Macs. With that in mind, you can check the specifications of your Mac, then take a look at what we expect macOS 16 to be compatible with: MacBook Air (M1 or later) MacBook Pro (M1 or later) iMac (M1 or later) Mac mini (M1 or later) Mac Studio (M1 Max or later) Mac Pro (M2 Ultra or later) There is still a chance that macOS 16 will support a selection of Intel Macs. If it does the following Intel Macs are most likely to be covered: 2019 MacBook Pro 2020 iMac 2019 Mac Pro That means no Intel MacBook Air models and no Intel Mac mini models and only the most recent Intel models of the MacBook Pro, iMac and Mac Pro. Learn more about which Macs are supported by Apple in our guide to how long Macs and MacBooks last and macOS compatibility: The latest version of macOS your Mac can run. This could be the year Apple decides to make future versions of macOS for M-series Macs only.Foundry macOS 16: New features Here are some of the new features expected in macOS 16. This list will be updated as more features are reported. Major UI change According to a report by Bloomberg’s Mark Gurman, macOS 16 (along with iOS 19 and iPadOS 19) will have a redesigned user interface that is based “loosely” on visionOS, Apple’s operating system for its Vision Pro headset. Apple wants to make its operating systems more consistent across platforms, and visionOS will be the inspiration for it. Details on how Apple will implement this new design aren’t available yet, but Apple won’t simply just port over the visionOS UI to the Mac and be done with it. It will combine the best of both worlds and possibly allow Mac users to do more (and without a cursor). Because of the visionOS’s touch implementation, it’s easy to conclude that Apple is working on a touchscreen Mac. Hardware rumors are more prevalent than software ones, and touchscreen capability has not been mentioned about future MacBooks or Apple displays. Are round icons coming to macOS?Apple Apple Intelligence and Siri Apple Intelligence made its debut with macOS 15 Sequoia and Apple is on a continuous development path with these features. However, the Apple Intelligence features promised for Siri in iOS 18/macOS 15 have been delayed and aren’t expected until later in 2025, maybe 2026. Apple usually introduces Siri updates first on iOS, so this delay means that Siri updates in macOS have been pushed back even further. Will Apple reveal other Apple Intelligence inspired features? Or reliance on another tool to complement ChatGPT integration? Bloomberg’s Mark Gurman wrote in a late May 2025 report that Apple won’t deliver “any AI breakthroughs” at WWDC. Home app upgrades A lot of what is planned for the iOS 19 update will make its way into macOS 16. While specifics about the Home app have not been reported, several reports of new smart home hardware have been made, so it would follow that Apple will update the Home app. However, the Home app is more often used on the iPad and iPhone, so Apple could release the Mac version of the Home app at a later date. Gaming app MacOS 16 will reportedly include a dedicated gaming app, according to a report from Mark Gurman of Bloomberg. The App will also be available for iPhone, iPad and Apple TV, it is claimed. The Mac app will tap into both the App Store’s games section and Apple Arcade, and “games downloaded outside of the App Store,” according to Gurman. It will also offer editorial content about new games and centralize everything currently found in Game Center. Magnifier app and other accessibility features The accessibility feature that first appeared on the iPhone is said to be coming to the Mac in macOS 16, and it’s Apple that says so. In May 2025 Apple revealed some new Accessibility features coming to macOS later this year. Among them are a Magnifier app which will work with Continuity Camera (which lets you use your iPhone as a webcam). With the Magnifier app, a Mac can use their iPhone camera (or any other USB camera) to view their surroundings and zoom in. Apple also provided details of a new Accessibility Reader coming to Macs later in 2025. This system-wide feature will make text easier to read, by changing colour, font, and spacing. Other new accessibility features include: Braille Access, Background Sounds, and Personal Voice. Read about the accessibility features coming in the next major macOS in our guide.",
    "author": "",
    "published": "Sun, 01 Jun 2025 23:38:00 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2025/06/macos-16-concept-logo-1.jpg?quality=50\u0026strip=all",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "Mac, MacOS"
    ]
  },
  {
    "id": "c7927334-7363-48d2-a71b-67809f149e98",
    "title": "You’ve seen enough sitcoms—here are 4,000+ docs to watch instead",
    "link": "https://www.macworld.com/article/2793254/youve-seen-enough-sitcoms-here-are-4000-docs-to-watch-instead.html",
    "description": "Macworld Why does the ever-flowing content stream make us feel like we live in a desert? If you’ve watched everything on Max, Hulu, or whatever new streaming service popped up last week, MagellanTV is an established alternative to mindless binge-watching. And for a limited time, a lifetime subscription is just $149.97 (reg. $999). Not your average streaming service This award-winning documentary streamer offers thousands of hours of ad-free content across history, science, crime, nature, and more. Whether you’re looking for something more profound or need something interesting playing in the background, MagellanTV has you covered. Unlike traditional streaming services, MagellanTV offers a rich library of growing content that keeps you hooked. Explore shows like Diving with Sharks, The Last Secrets of the Titanic, and JFK: Making of a President. Or, dive into exclusive playlists like Wild Weather, The Stay-at-Home Travel Guide, and Mysteries of the Universe. Whether exploring ancient civilizations, unsolved crimes, or the wonders of the natural world, you’ll always find something new and fascinating. MagellanTV isn’t just for solo watching — stream across up to five devices and share your subscription with family and friends with no additional fees. Get your lifetime access to MagellanTV for just $149.97 (reg. $999) and save. MagellanTV Documentary Streaming Service: Lifetime SubscriptionSee Deal StackSocial prices subject to change.",
    "author": "",
    "published": "Sun, 01 Jun 2025 08:00:00 +0000",
    "image": "https://www.macworld.com/wp-content/uploads/2025/06/image-214-980x653-1-1.png",
    "source": "https://www.macworld.com/index.rss",
    "categories": [
      "Personal Software"
    ]
  },
  {
    "id": "d7c2b629-dd76-4f9b-bd25-dc5f897604c8",
    "title": "Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)",
    "link": "https://www.macrumors.com/2021/09/21/deals-apple-pencil-macbook-air/",
    "description": "Today we're tracking a pair of deals, one on the Apple Pencil 2 and one on the 2020 M1 MacBook Air. These sales include the current best price online for the Apple Pencil 2, and an all-time low price on the MacBook Air. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. Apple Pencil 2 Firstly, Woot has the Apple Pencil 2 for $109.99, down from $129.00. This sale isn't the lowest price we've ever tracked on this accessory, as it's been down to $99.00 in previous sales earlier this year, but it's still a solid second-best deal if you're looking to purchase an Apple Pencil 2 this week. $19 OFFApple Pencil 2 for $109.99 The Apple Pencil 2 is compatible with the new iPad mini 6, but not the new 10.2-inch iPad. For that tablet, only the original Apple Pencil is supported. MacBook Air Amazon today has the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Space Gray and Silver. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. While the Gold option won't be available until around October 1, you can still purchase a Gold MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Tue, 21 Sep 2021 10:51:07 PDT",
    "image": "https://images.macrumors.com/article-new/2021/09/sept-21-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "e0331d64-7d48-4cee-96f0-dc4c87cd23d9",
    "title": "Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB",
    "link": "https://www.macrumors.com/2021/09/13/deals-amazon-macbook-air-2/",
    "description": "Amazon today is offering the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Gold and Silver. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. Only the Gold color is available to ship today, while the Silver option won't be available until around September 21. You can still purchase a Silver MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Amazon Takes $149 Off 2020 MacBook Air Models, Starting at $849.99 for 256GB\" first appeared on MacRumors.comDiscuss this article in our forums",
    "author": "Mitchel Broussard",
    "published": "Mon, 13 Sep 2021 06:36:38 PDT",
    "image": "https://images.macrumors.com/article-new/2021/04/macbook-air-deals.jpg",
    "source": "http://feeds.macrumors.com/MacRumors-Mac",
    "categories": [
      "Deals"
    ]
  },
  {
    "id": "84d690a3-4622-46ed-8c90-642b877fce4f",
    "title": "Today in Apple history: Apple II gets its first disk drive",
    "link": "https://www.cultofmac.com/apple-history/apple-disk-ii-launch",
    "description": "On June 1, 1978, Apple launched the Disk II floppy drive. The groundbreaking peripheral solved the Apple II's biggest problem. (via Cult of Mac - A 24/7 website publishing the latest Apple news, rumors, reviews, how-tos and deals.)",
    "author": "Luke Dormehl",
    "published": "Sun, 01 Jun 2025 15:11:47 +0000",
    "image": "https://cdn.cultofmac.com/wp-content/uploads/2017/06/Disk_II.png",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "Apple history",
      "Apple II",
      "Mike Markkula",
      "Steve Wozniak",
      "TIAH: 1970s",
      "Today in Apple history"
    ]
  },
  {
    "id": "292c1269-24a5-4ea7-a7e1-6533d0dd81c1",
    "title": "A headband and a light walk into your bedroom — and fix your insomnia",
    "link": "https://www.cultofmac.com/deals/hoomband-dodow-sleep-aid-devices",
    "description": "Forget sleeping pills. The sleep aids in this bundle, a HoomBand Bluetooth headband and Dodow meditation light, will ease you to sleep. (via Cult of Mac - A 24/7 website publishing the latest Apple news, rumors, reviews, how-tos and deals.)",
    "author": "Cult of Mac Deals",
    "published": "Sun, 01 Jun 2025 13:30:15 +0000",
    "image": "https://cdn.cultofmac.com/wp-content/uploads/2025/05/HoomBand.png",
    "source": "https://www.cultofmac.com/feed",
    "categories": [
      "Deals",
      "Cult of Mac Deals",
      "sleep"
    ]
  },
  {
    "id": "c0b5061a-c68c-4a17-84a2-fbec6e99bad1",
    "title": "Stories of Surrender: Elevated Immersion",
    "link": "https://www.macstories.net/news/stories-of-surrender-elevated-immersion/",
    "description": "Apple has released its highly anticipated feature film documentary event Bono: Stories of Surrender, the company’s first dual-format feature film release, available both in a traditional 2D presentation and Apple Immersive Video for Apple Vision Pro on Apple TV+. Warmly received earlier this month following its traditional format world premiere at The Festival de Cannes, the […]",
    "author": "Sigmund Judge",
    "published": "Fri, 30 May 2025 21:13:20 +0000",
    "image": "https://cdn.macstories.net/bono_cvr_press_16x9_wbranding-1748637455385.png",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "news",
      "Apple TV Plus",
      "Immersive Video"
    ]
  },
  {
    "id": "8154a639-f2b3-438a-a994-d4105e334a49",
    "title": "Podcast Rewind: Replacing Dropbox, Little Touches in Media Trackers, and an Immersive Film from Bono",
    "link": "https://www.macstories.net/news/podcast-rewind-replacing-dropbox-little-touches-in-media-trackers-and-an-immersive-film-from-bono/",
    "description": "Enjoy the latest episodes from MacStories’ family of podcasts: Comfort Zone The gang goes old school with media apps, Chris and Matt recall tales from their youth, and Niléane reminds everyone how young and hip she is in comparison. MacStories Unwind This week, John quits Dropbox, Federico wraps up Friends, and John recommends a pair […]",
    "author": "Devon Dundee",
    "published": "Fri, 30 May 2025 20:05:25 +0000",
    "image": "https://cdn.macstories.net/untitled-1738434411572.png",
    "source": "https://www.macstories.net/feed",
    "categories": [
      "news",
      "Comfort Zone",
      "Magic Rays of Light",
      "podcast",
      "unwind"
    ]
  },
  {
    "id": "4519c4d4-1104-4969-8c78-2d24d07e4fec",
    "title": "How to Play Fortnite on Mac with FnMacAssistant \u0026 Sideloadly",
    "link": "https://osxdaily.com/2025/05/31/how-to-play-fortnite-on-mac-with-fnmacassistant-sideloadly/",
    "description": "Gamers everywhere are happy that Fortnite is back for iPhone and iPad users, but there’s no Mac client in sight (yet anyway). That doesn’t mean you can’t play Fortnite on the Mac though, because if you have an Apple Silicon Mac, and you’re comfortable running some mods and tweaks, you can get the iOS/iPadOS version ... Read More",
    "author": "Paul Horowitz",
    "published": "Sat, 31 May 2025 20:34:02 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "Games",
      "Mac OS",
      "Tips \u0026 Tricks",
      "Fortnite",
      "gaming",
      "Mac",
      "macOS",
      "tips",
      "tricks"
    ]
  },
  {
    "id": "1e496bf5-c8af-4e07-bf42-d50c79af47d3",
    "title": "How to Disable Backtrack on Apple Watch Turning On Automatically",
    "link": "https://osxdaily.com/2025/05/30/how-to-disable-backtrack-on-apple-watch-turning-on-automatically/",
    "description": "One of the more curious features of Apple Watch is how the Compass Backtrack feature automatically activates and takes over the Apple Watch screen during workouts, seemingly at random, or even every time a “Hiking” workout or sometimes any outdoor workout of any sort is selected or initiated. Given that the vast majority of hikers, ... Read More",
    "author": "Paul Horowitz",
    "published": "Fri, 30 May 2025 21:15:05 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/osxdaily",
    "categories": [
      "Apple Watch",
      "Tips \u0026 Tricks",
      "tips",
      "tricks",
      "watchOS",
      "workout",
      "workouts"
    ]
  },
  {
    "id": "26a44184-2f0c-484d-97d7-97e2fdde624d",
    "title": "∞ The Dalrymple Report: Jony Ive and OpenAI, Epic Games",
    "link": "https://www.loopinsight.com/2025/05/23/the-dalrymple-report-jony-ive-and-openai-epic-games/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-jony-ive-and-openai-epic-games",
    "description": "The biggest news this week was the purchase of Jony Ive's company, io, by OpenAI for $6.5 billion dollars. According to the reports, I've's company is a device startup. Sam Altman said he is “excited to try to create a new generation of AI-powered computers.” Epic Games and Apple are continuing to spare, although it seems like the battle is coming to an end. Follow this podcast LinkedIn Jobs: LinkedIn Jobs helps you find the candidates you want to talk to, faster. Did you know every week, nearly 40 million job seekers visit LinkedIn? Post your job for free at LinkedIn.com/DALRYMPLE. Terms and conditions apply. Insta360 X5 Camera: Insta360 X5 Camera. To bag a free invisible selfie stick worth US$24.99 with your purchase, head to store.insta360.com and use the promo code \"dalrymple\", available for the first 30 standard package purchases only. Show Notes: Epic Games v. Apple: the fight for the future of the App Store Jony Ive to lead OpenAI’s design work following $6.5B acquisition of his company Check out the video of OpenAI's Sam Altman and Jony Ive What would you do if Steve Jobs quoted something you wrote? Shows and movies we're watching Better, Hulu Netflix saves Sesame Street",
    "author": "Jim Dalrymple",
    "published": "Fri, 23 May 2025 16:35:11 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "6b0cf040-7af0-45c9-adc3-453ada5ca942",
    "title": "∞ The Dalrymple Report: Apple Maps, Apple Music, and The Pope",
    "link": "https://www.loopinsight.com/2025/05/16/the-dalrymple-report-apple-maps-apple-music-and-the-pope/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-apple-maps-apple-music-and-the-pope",
    "description": "Apple has introduced some new features in Apple Maps including a Detailed City Experience for the Formula 1 Grand Prix de Monaco. Maps also now has insights, ratings, and reviews from expert sources, most notably the Michelin Guide. Did you know Pope Leo has his own trading card? Not only that, it set a new sales record, topping LeBron James. Follow this podcast Show Notes: Pete Rose reinstated Pope Leo XIV trading card sets Topps Now sales record, exceeds LeBron and Wemby milestone cards Apple Maps brings a custom Detailed City Experience to the Formula 1 Grand Prix de Monaco Apple brings insights, ratings, and reviews from expert sources to Apple Maps CarPlay Ultra, the next generation of CarPlay, begins rolling out Universal Music Group and Apple Music announce Sound Therapy Shows and movies we're watching Bad Sisters, Apple TV+ It’s not TV. It’s HBO. Max. Conan O’Brien the Kennedy Center, Mark Twain prize for American humor, Netflix",
    "author": "Jim Dalrymple",
    "published": "Fri, 16 May 2025 12:30:51 +0000",
    "image": "",
    "source": "https://www.loopinsight.com/feed",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "432c4c37-2327-4c11-8531-7eeb78745741",
    "title": "Retreating to Safety",
    "link": "https://marco.org/2025/05/30/retreat",
    "description": "Ten years ago, Apple’s Phil Schiller surprised Apple enthusiasts and developers by walking out on stage at John Gruber’s The Talk Show Live WWDC event and giving an open, human, honest interview to a somewhat jaded community. I wrote this in response: Both Apple and Phil Schiller himself took a huge risk in doing this. That they agreed at all is a noteworthy gift to this community of long-time enthusiasts, many of whom have felt under-appreciated as the company has grown. […] Phil’s appearance on the show was warm, genuine, informative, and entertaining. It was human. And humanizing the company and its decisions, especially to developers — remember, developer relations is all under Phil — might be worth the PR risk. This started a ten-year run of interviews by Apple executives on The Talk Show every year at WWDC that proved to be great, surprisingly safe PR for Apple. No executive ever said something they shouldn’t have (they’re pros), no sensational or negative news stories ever resulted from them, and Apple’s enthusiastic fans and developers felt seen, heard, and appreciated. *     *     * For unspecified reasons, Apple has declined to participate this year, ending what had become a beloved tradition in our community — and I can’t help but suspect that it won’t come back. (A lot has changed in the meantime.) Maybe Apple has good reasons. Maybe not. We’ll see what their WWDC PR strategy looks like in a couple of weeks. In the absence of any other information, it’s easy to assume that Apple no longer wants its executives to be interviewed in a human, unscripted, unedited context that may contain hard questions, and that Apple no longer feels it necessary to show their appreciation to our community and developers in this way. I hope that’s either not the case, or it doesn’t stay the case for long. This will be the first WWDC I’m not attending since 2009 (excluding the remote 2020 one, of course). Given my realizations about my relationship with Apple and how they view developers, I’ve decided that it’s best for me to take a break this year, gain some perspective, and decide what my future relationship should look like. Maybe Apple’s leaders are doing that, too.",
    "author": "",
    "published": "Fri, 30 May 2025 11:33:22 EDT",
    "image": "https://marco.org/media/2015/06/tts2015-schiller6.jpg",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "644a1176-bc60-44fa-b16d-a635c23b4d3a",
    "title": "Ten years of Overcast: A new foundation",
    "link": "https://marco.org/2024/07/16/overcast-rewrite",
    "description": "Today, on the tenth anniversary of Overcast 1.0, I’m happy to launch a complete rewrite and redesign of most of the iOS app, built to carry Overcast into the next decade — and hopefully beyond. Like podcasts better than blog posts? Listen to ATP #596 for more! What’s new Much faster, more responsive, more reliable, and more accessible. Modern design, optimized for easily-reached controls on today’s phone sizes. Improvements throughout, such as undoing large seeks, new playlist-priority options, easier navigation, and more. What’s not Most features. Overcast is still Overcast! The audio engine. It’s the best part of Overcast, and still leads the industry in sound quality, silence skipping, and volume normalization. (More soon!) The business. I’m still a one-person operation, with no funding or external ownership, serving only my customers. My principles. I always want to make the best podcast app, and I’ll never disrespect your time, attention, or privacy. What’s gone Streaming. Most big podcasts now use dynamic ad insertion, which causes bugs and problems for streaming playback.1 Downloading episodes completely before they begin playback is much more reliable. Tapping a non-downloaded episode will now open the playback screen, download it, then start playback. It works similarly to the way streaming did before, but playback begins after the download completes, not after a portion of it is buffered. On today’s fast networks, this usually only takes a few extra seconds. And in the near future, I’ll be adding smarter options and more control over selective downloading of episodes to further improve the experience for people who don’t automatically download every episode. What’s next The last few missing features from the old app, such as Shortcuts support, storage management, and OPML. These are absent now, but will return soon. More options for downloading and deleting episodes. Upgrading the Apple Watch app to the new, faster sync engine. (The Watch app is currently unchanged from the previous one.) And, of course, more features, including some of your most-requested features over the last decade. Getting this rewrite out the door was a monumental task. Thank you for your patience as I work through this list! Why? Most of Overcast’s core code was 10 years old, which made it cumbersome or impossible to easily move with the times, adopt new iOS functionality, or add new features, especially as one person. That’s why there haven’t been many new features or changes in years. You saw it, and I saw it. I wasn’t able to serve my customers as well as I wanted. For Overcast to have a future, it needed a modern foundation for its second decade. I’ve spent the past 18 months rebuilding most of the app with Swift, SwiftUI, Blackbird, and modern Swift concurrency. Now, development is rapidly accelerating. I’m more responsive, iterating more quickly, and ultimately making the app much better. Thank you all so much for the first decade of Overcast. Here’s to the next one. Dynamic ad insertion (DAI) splices ads into each download, and no two downloads are guaranteed to have the same number or duration of ads. So, for example, if the first half of an episode downloads, then the download fails, and it downloads the second half with another request, the combined audio may jump forward or back at the halfway mark, losing or repeating content. ↩︎",
    "author": "",
    "published": "Tue, 16 Jul 2024 08:57:40 EDT",
    "image": "https://marco.org/media/2024/overcast-rewrite-list.png",
    "source": "https://marco.org/rss",
    "categories": null
  },
  {
    "id": "6585d2c5-ca03-4f96-93ee-140b6c78f357",
    "title": "One more thing… Goodbye from iMore",
    "link": "https://www.imore.com/apple/one-more-thing-goodbye-from-imore",
    "description": "Time to power down for good.",
    "author": "",
    "published": "Wed, 25 Sep 2024 23:00:00 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/8kts3gvMKEK9MsJtLxS83Q.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Apple"
    ]
  },
  {
    "id": "30532060-ff04-485b-ae56-73406085ed84",
    "title": "iFi GO bar Kensei review: Stunning sound, fabulous features, premium price",
    "link": "https://www.imore.com/music-movies-tv/ifi-go-bar-kensei-review",
    "description": "One of the best mobile DACs I've reviewed, the iFi GO bar Kensei is a masterclass in build quality, and quality features, with audiophile-grade pricing",
    "author": "",
    "published": "Wed, 25 Sep 2024 21:54:54 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/rthVJM84X2nLRNNyoksasV.jpg",
    "source": "http://feeds.feedburner.com/TheiPhoneBlog",
    "categories": [
      "Music, Movies and TV"
    ]
  }
]
