{
  "id": "06428c73-7525-4965-8803-36f4146cd442",
  "title": "The Biggest Book News of the Week",
  "link": "https://bookriot.com/the-biggest-book-news-of-the-week-17/",
  "description": "Here is the news that mattered most this week.",
  "author": "Jeff O'Neal",
  "published": "Sat, 26 Jul 2025 12:30:00 +0000",
  "source": "https://bookriot.com/feed/",
  "categories": [
    "Today in Books"
  ],
  "byline": "Jeff O'Neal",
  "length": 4998,
  "excerpt": "Here is the news that mattered most this week.",
  "siteName": "BOOK RIOT",
  "favicon": "https://s2982.pcdn.co/wp-content/themes/bookriot/assets/images/favicons/BookRiot_Logo_192.png.webp",
  "text": "Welcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more. Here is the news that mattered most this week. The Top 50 Most Read Books on Goodreads This Week Are by White Authors I usually don’t link to Book Riot things here on TIB in the first couple of spots, but am making an exception today. Our editor Danika Ellis does a weekly look at what books are most popular on Goodreads, and this week she noticed that all 50 of the top books were by white authors. Now, Danika notes that it usually is only very, very white not exclusively white. To say this is dispiriting is an understatement. George Saunders Is Publishing a New Novel Early Next Year I don’t need to know what it is about. Just that it is coming. And it is coming January 27, 2026. Vigil is what it is called, and like with most George Saunders joints, reading the pitch is both telling and not. I will say that I am especially appreciative of how Saunders is interested in exploration and positing, rather than moralizing or proclaiming:The novel, he hopes, approaches a political topic without restricting itself to an expression of opinion. “It’s like Chekhov said — art doesn’t have to solve a problem, it just has to formulate it correctly,” Saunders says. “So instead of saying, ‘Here, world, here’s my fully formed opinion,’ you end up taking yourself on a little trip in the direction of more complexity, more ambiguity, a deeper understanding. In this sense, the product is even more political, because it’s charged, not only with opinion (possibly anger), but also with some sympathy.” Today In Books Sign up to Today In Books to receive daily news and miscellany from the world of books. Hachette Reportedly Acquires Joe Biden’s Memoir for $10 Million Yes, this is a lot less than Obama and Clinton (both two termers who went out much, much more popular than Biden). And I still think it will struggle to earn out the advance in the short term, but I have much less sense of how these memoirs that are de facto historical documents do over the coming decades. I don’t know anyone champing at the bit for this, but you might have said the same for Jimmy Carter in 1981. Things can change. For More Than a 100 Years, More Fiction Was Written by Men Than Women We haven’t linked to much (any?) of it here, but there has been another bout of “what about the fellas?” when it comes to books. This has come and going quite a bit in the last 5-10 years. This deep historical surveywas passed around recently to show just how female-heavy novel writing was, and then wasn’t, over the novel’s lifespan. This paper ends in 2018, where men were still writing more fiction than women.  But my sense is that the upward slope has continued in the last seven years, and wouldn’t be surprised if it was meaningfully over 50% now. And that is A-OK. How is AI Changing Publishing? We hear rumors. And whispers. And more than a few accusations and admissions. But how is AI really being used in the publishing industry? My sense is more than you might think, but not in ways that many of us fear. The Book Industry Study Group is launching a cleverly anonymous survey for book professionals to spill about what their houses and imprints are up to. VERY interested in the results, which will be released in September. Spotify Expanding Audiobooks Plans in Most Confusing Way Possible Look, getting 15 hours of audiobook listening as part of a regular Spotify subscription has been great. I use it every month, mostly to experiment with stuff that I then go borrow or buy elsewhere. It’s not quite as simple as “1 audiobook” per month, but manageable. How Spotify is expanding beyond this base offering is a little bananas, though. In some countries (not the US for now), Spotify is adding a couple of tiers Audiobooks+ and Audiobooks+ for Plan Members. Here is how they explain what these plans are: Audiobooks+: Available to Premium Individual subscribers as well as Family and Duo plan managers, this add-on unlocks an additional 15 hours of listening each month for the existing base plan—a great option for booklovers seeking more audiobook time, including fans of longer titles. Audiobooks+ for Plan Members: For the first time, additional members on Premium Family and Duo can access 15 hours of monthly audiobook listening through this recurring add-on. Plan members just need to request audiobook access from their plan manager, who can purchase the add-on on their behalf. They can also purchase a one-time 10-hour top-up if they run out of hours before their monthly billing cycle refreshes.  First one makes sense. 15 more hours for some (unstated amount of money).  The second one? I think if you have the phrase “Plan members just need to request audiobook access from their plan manager, who can purchase the add-on on their behalf” in your product description. You can’t just say “just.” It actually has to be the thing.",
  "image": "https://s2982.pcdn.co/wp-content/uploads/2025/04/newspapers-in-loose-stack.jpg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-area\"\u003e\n\n\t\t\n\t\t\t\t\t\n\n\t\t\u003carticle\u003e\n\n\t\t\t\u003cdiv itemprop=\"mainEntityOfPage\"\u003e\n\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"620\" height=\"332\" src=\"https://s2982.pcdn.co/wp-content/uploads/2025/04/newspapers-in-loose-stack.jpg.webp\" alt=\"newspapers in loose stack\" fetchpriority=\"high\" loading=\"eager\" decoding=\"async\" srcset=\"https://s2982.pcdn.co/wp-content/uploads/2025/04/newspapers-in-loose-stack.jpg.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2025/04/newspapers-in-loose-stack-300x161.jpg.webp 300w\" sizes=\"(max-width: 620px) 100vw, 620px\"/\u003e\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\n\t\t\t\t\u003cdiv itemprop=\"articleBody\" class=\"post-601624 post type-post status-publish format-standard has-post-thumbnail hentry category-today-in-books pmpro-has-access\"\u003e\n\n\t\t\t\t\t\n\t\t\n\t\t\u003cdiv\u003e\n\u003cp\u003e\u003cem\u003eWelcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more. Here is the news that mattered most this week. \u003c/em\u003e\u003c/p\u003e\n\n\u003ch2\u003eThe Top 50 Most Read Books on Goodreads This Week Are by White Authors\u003c/h2\u003e\n\n\u003cp\u003eI usually don’t link to Book Riot things here on TIB in the first couple of spots, but am making an exception today. Our editor Danika Ellis does a weekly look at what books are most popular on Goodreads, and this week she noticed \u003ca href=\"https://www.goodreads.com/book/most_read?category=all\u0026amp;country=all\u0026amp;duration=w\"\u003ethat all 50 of the top books were by white authors\u003c/a\u003e. Now, Danika notes that it usually is only very, very white not exclusively white. To say this is dispiriting is an understatement.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003ch2\u003eGeorge Saunders Is Publishing a New Novel Early Next Year\u003c/h2\u003e\n\n\u003cdiv\u003e\u003cp\u003eI don’t need to know what it is about. Just that it is coming. And it is coming January 27, 2026. \u003ca href=\"https://www.vulture.com/article/george-saunders-announces-new-book-vigil.html\"\u003e\u003cem\u003eVigil\u003c/em\u003e is what it is called\u003c/a\u003e, and like with most George Saunders joints, reading the pitch is both telling and not. I will say that I am especially appreciative of how Saunders is interested in exploration and positing, rather than moralizing or proclaiming:\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe novel, he hopes, approaches a political topic without restricting itself to an expression of opinion. “It’s like Chekhov said — art doesn’t have to solve a problem, it just has to formulate it correctly,” Saunders says. “So instead of saying, ‘Here, world, here’s my fully formed opinion,’ you end up taking yourself on a little trip in the direction of more complexity, more ambiguity, a deeper understanding. In this sense, the product is even more political, because it’s charged, not only with opinion (possibly anger), but also with some sympathy.”\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\n\t\t\t\t\u003cp\u003eToday In Books\u003c/p\u003e\n\t\t\t\t\u003cp\u003eSign up to Today In Books to receive daily news and miscellany from the world of books.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\u003ch2\u003eHachette Reportedly Acquires Joe Biden’s Memoir for $10 Million\u003c/h2\u003e\n\n\u003cp\u003eYes, \u003ca href=\"https://nypost.com/2025/07/24/business/biden-sells-memoir-for-measly-10m-less-than-obamas-bill-clinton/\"\u003ethis is a lot less than Obama and Clinton\u003c/a\u003e (both two termers who went out much, much more popular than Biden). And I still think it will struggle to earn out the advance in the short term, but I have much less sense of how these memoirs that are de facto historical documents do over the coming decades. I don’t know anyone champing at the bit for this, but you might have said the same for Jimmy Carter in 1981. Things can change.\u003c/p\u003e\n\n\n\n\n\n\n\t\n\n\u003ch2\u003eFor More Than a 100 Years, More Fiction Was Written by Men Than Women\u003c/h2\u003e\n\n\u003cp\u003eWe haven’t linked to much (any?) of it here, but there has been another bout of “what about the fellas?” when it comes to books. This has come and going quite a bit in the last 5-10 years. \u003ca href=\"https://culturalanalytics.org/article/11035-the-transformation-of-gender-in-english-language-fiction\"\u003eThis deep historical survey\u003c/a\u003ewas passed around recently to show just how female-heavy novel writing was, and then wasn’t, over the novel’s lifespan. This paper ends in 2018, where men were still writing more fiction than women. \u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg decoding=\"async\" src=\"https://s2982.pcdn.co/wp-content/uploads/2025/07/Screenshot-2025-07-22-at-10.14.26%E2%80%AFAM.jpg.optimal.jpg\" alt=\"\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2025/07/Screenshot-2025-07-22-at-10.14.26%E2%80%AFAM.jpg.optimal.jpg\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\u003cp\u003eBut my sense is that the upward slope has continued in the last seven years, and wouldn’t be surprised if it was meaningfully over 50% now. And that is A-OK.\u003c/p\u003e\n\n\u003ch2\u003eHow is AI Changing Publishing?\u003c/h2\u003e\n\n\u003cp\u003eWe hear rumors. And whispers. And more than a few accusations and admissions. But how is AI really being used in the publishing industry? My sense is more than you might think, but not in ways that many of us fear. \u003ca href=\"https://www.bisg.org/news/help-shape-the-future-of-ai-in-the-book-industry\"\u003eThe Book Industry Study Group is launching a cleverly anonymous survey for book professionals\u003c/a\u003e to spill about what their houses and imprints are up to. VERY interested in the results, which will be released in September.\u003c/p\u003e\n\n\u003ch2\u003eSpotify Expanding Audiobooks Plans in Most Confusing Way Possible\u003c/h2\u003e\n\n\u003cp\u003eLook, getting 15 hours of audiobook listening as part of a regular Spotify subscription has been great. I use it every month, mostly to experiment with stuff that I then go borrow or buy elsewhere. It’s not quite as simple as “1 audiobook” per month, but manageable. How \u003ca href=\"https://newsroom.spotify.com/2025-07-16/audiobooks-brings-more-choice-and-flexibility-to-spotify-premium-subscribers/\"\u003eSpotify is expanding beyond this base offering\u003c/a\u003e is a little bananas, though. In some countries (not the US for now), Spotify is adding a couple of tiers Audiobooks+ and Audiobooks+ for Plan Members. Here is how they explain what these plans are:\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eAudiobooks+:\u003c/strong\u003e Available to Premium Individual subscribers as well as Family and Duo plan managers, this add-on unlocks an additional 15 hours of listening each month for the existing base plan—a great option for booklovers seeking more audiobook time, including fans of longer titles.\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eAudiobooks+ for Plan Members: \u003c/strong\u003eFor the first time, additional members on Premium Family and Duo can access 15 hours of monthly audiobook listening through this recurring add-on. Plan members just need to request audiobook access from their plan manager, who can purchase the add-on on their behalf. They can also purchase a one-time 10-hour top-up if they run out of hours before their monthly billing cycle refreshes. \u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003eFirst one makes sense. 15 more hours for some (unstated amount of money). \u003c/p\u003e\n\n\u003cp\u003eThe second one? I think if you have the phrase “\u003cem\u003ePlan members just need to request audiobook access from their plan manager, who can purchase the add-on on their behalf\u003c/em\u003e” in your product description. You can’t just say “just.” It actually has to be the thing.\u003c/p\u003e\n\u003c/div\u003e\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-26T12:30:00Z",
  "modifiedTime": null
}
