{
  "id": "16a8f476-0be1-4380-beb3-0cac1ad083b9",
  "title": "KARMA NEVER SLEEPS",
  "link": "https://www.kirkusreviews.com/book-reviews/r-john-dingle/karma-never-sleeps/",
  "description": "In his debut novel, the author introduces readers to his bass-playing FBI agent, Gus Wheeler, who’s in the prime of his career, working as a field agent in Boston and pursuing his musical interests in a touring band. His newest case involves two longtime friends, murdered in quick succession in (fictional) Kendalton, Massachusetts. Gus and his partner, Vanessa Lambert, head up there just in time to examine the second crime scene, where they discover a surprising signature from the killer—an old photo of a girl, Rebecca Munroe, who died by suicide as a teenager some years ago. When Gus and Vanessa ask the victims’ friend group about Rebecca, they’re met with clear deception, as the women claim they barely knew her. Gus, a small-town native himself, knows this can’t possibly be true in a place the size of Kendalton. The narrative shifts, then, to spend time with each of the women in the group, and readers come to learn about their unique history as childhood friends. They also find out that Rebecca was no stranger to these girls, and that her death is not as straightforward as it initially seemed. As Gus and Vanessa scramble to find the killer and uncover secrets, the murderer’s rampage goes on. Although conventions of the genre abound in Dingle’s novel—the requisite will-they, won’t-they between FBI agents, the one evil friend who pushes the others into complicity—the action is well paced enough to keep readers turning the pages. The prose is occasionally striking, such as when it addresses the very act of writing itself: “And it was with this feeling of apprehension, of loss, that she stared at the blank page that would, at some point, contain the words that, woven together, would become the eulogy.” Fans of classic mysteries and FBI thrillers in particular will be happy to race this one to the finish line.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "by Kathy Reichs",
  "length": 3818,
  "excerpt": "In Dingle’s whodunit, a serial killer targets a small group of friends in suburban New England.",
  "siteName": "Kirkus Reviews",
  "favicon": "https://d1fd687oe6a92y.cloudfront.net/img/kir_images/header/apple-icon.png",
  "text": "HOW TO SOLVE YOUR OWN MURDER by Kristen Perrin ‧ RELEASE DATE: March 26, 2024 Breezy, entertaining characters and a cheeky premise fall prey to too much explanation and an unlikely climax. An aspiring mystery writer sets out to solve her great-aunt’s murder and inherit an estate. Twenty-five-year-old Annie Adams has never met her great-aunt Frances, who prefers her small village to busy London. But when a mysterious letter arrives instructing Annie to come to Castle Knoll in Dorset to meet Frances and discuss her role as sole beneficiary of her great-aunt’s estate, Annie can’t resist. Unfortunately, she arrives to find Frances’ worst fears have come true: The elderly woman—who’s been haunted for decades by a fortuneteller’s prediction that this will happen—has been murdered, and her will dictates that she will leave her entire estate to Annie, but only if Annie solves her killing. It’s a cheeky if not exactly believable premise, especially since the local police don’t seem terribly opposed to it. Annie herself is an engaging presence, if a little too blind to the fact that she could be on the killer’s to-do list. Her roll call of suspects is pleasingly long, including but not limited to the local vicar, a one-time paramour of her great-aunt’s; a gardener who grows a lot more than flowers; shady developers and suspicious friends from Frances’ past; and Saxon, Annie’s crafty rival, who inherits the estate himself if he manages to solve the case first. Annie pieces together clues through readings of Frances’ journal, but the story eventually runs aground on the twin rocks of too much explanation and a flimsy climax. Cute dialogue gives way to lengthy exposition, and by the time Frances’ killer is revealed you may well be ready to leave Annie, Dorset, and Castle Knoll behind for the firmer ground of reality. Fans of cozy mysteries are likely to be more forgiving, but if you cast a skeptical eye toward amateur sleuths, this novel won’t change your mind about them. Breezy, entertaining characters and a cheeky premise fall prey to too much explanation and an unlikely climax. Pub Date: March 26, 2024 ISBN: 9780593474013 Page Count: 368 Publisher: Dutton Review Posted Online: Feb. 3, 2024 Kirkus Reviews Issue: March 1, 2024",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/52744a6b36044a12bfc1a54a91c06b11/3c3885d4d0c245da97d506a81978abfe.jpeg.300x0_q85_autocrop.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eHOW TO SOLVE YOUR OWN MURDER\u003c/h2\u003e\n                                \n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/kristen-perrin/\"\u003e\n                            Kristen Perrin\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: March 26, 2024\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    Breezy, entertaining characters and a cheeky premise fall prey to too much explanation and an unlikely climax.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eAn aspiring mystery writer sets out to solve her great-aunt’s murder and inherit an estate.\u003c/p\u003e\n                                        \u003cp\u003eTwenty-five-year-old Annie Adams has never met her great-aunt Frances, who prefers her small village to busy London. But when a mysterious letter arrives instructing Annie to come to Castle Knoll in Dorset to meet Frances and discuss her role as sole beneficiary of her great-aunt’s estate, Annie can’t resist. Unfortunately, she arrives to find Frances’ worst fears have come true: The elderly woman—who’s been haunted for decades by a fortuneteller’s prediction that this will happen—has been murdered, and her will dictates that she will leave her entire estate to Annie, but only if Annie solves her killing. It’s a cheeky if not exactly believable premise, especially since the local police don’t seem terribly opposed to it. Annie herself is an engaging presence, if a little too blind to the fact that she could be on the killer’s to-do list. Her roll call of suspects is pleasingly long, including but not limited to the local vicar, a one-time paramour of her great-aunt’s; a gardener who grows a lot more than flowers; shady developers and suspicious friends from Frances’ past; and Saxon, Annie’s crafty rival, who inherits the estate himself if he manages to solve the case first. Annie pieces together clues through readings of Frances’ journal, but the story eventually runs aground on the twin rocks of too much explanation and a flimsy climax. Cute dialogue gives way to lengthy exposition, and by the time Frances’ killer is revealed you may well be ready to leave Annie, Dorset, and Castle Knoll behind for the firmer ground of reality. Fans of cozy mysteries are likely to be more forgiving, but if you cast a skeptical eye toward amateur sleuths, this novel won’t change your mind about them.\u003c/p\u003e\u003cp\u003e\n                                        Breezy, entertaining characters and a cheeky premise fall prey to too much explanation and an unlikely climax.\n                                        \n                                        \n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e March 26, 2024\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 9780593474013\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 368\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Dutton\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e Feb. 3, 2024\u003c/p\u003e\n                                         \u003cp\u003e\u003cb\u003eKirkus Reviews Issue:\u003c/b\u003e March 1, 2024\u003c/p\u003e\n                                    \u003c/div\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
