{
  "id": "1727faf8-31b0-445a-9332-a3f4f526ae50",
  "title": "A History of the Book Ladder",
  "link": "https://bookriot.com/a-history-of-the-book-ladder/",
  "description": "A history of the book ladder, Ali Hazelwood's latest, and Bezos being Bezos.",
  "author": "Jeff O'Neal",
  "published": "Wed, 26 Feb 2025 17:57:00 +0000",
  "source": "https://bookriot.com/feed/",
  "categories": [
    "Today in Books"
  ],
  "byline": "Jeff O'Neal",
  "length": 3785,
  "excerpt": "A history of the book ladder, Ali Hazelwood's latest, and Bezos being Bezos.",
  "siteName": "BOOK RIOT",
  "favicon": "https://s2982.pcdn.co/wp-content/themes/bookriot/assets/images/favicons/BookRiot_Logo_196.png.webp",
  "text": "This content contains affiliate links. When you buy through these links, we may earn an affiliate commission. Welcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more.Welcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more.The Ascendance of the Book Ladder This piece isn’t really a history of book ladders, because there isn’t much of one. Ladders, yes. Books, absolutely. But what Chason Gordon identifies is the dream represented by the book ladder: The fantasy usually goes like this. A friend of mine comes over, and we wander into my shimmering Babylonian spire of a library, with shelves of books ascending into the atmosphere. The only way to access them is by using the star of the show: the book ladder. No matter what we’re discussing, I ceremoniously take it as an opportunity to say, “You know, that reminds me of a passage from … ,” and then I roll the ladder to my desired location, climb up into the heavens, open a book, and nod knowingly. “Yes, this is what I was thinking of.” Muttering a line of Donne or Chaucer or Plath, I then descend the ladder, reading in a professorial tone, and eventually hand the book to my friend, as if he asked for it. The part missing, though, is that this fantasy is no longer restricted to having someone come into your house. Social video hungers for aspirational-short videos of someone rolling across their bookcase, smile on their face, hardcovers galore. I think there is the case to be made that we are living in the most superficial time in the history of reading, and the book ladder-video is possibly the ultimate expression of it. That and sprayed edges on everything. Ali Hazelwood Announces New BookAli Hazelwood is one of the top few authors to have been minted in the social video era. Her just announced next book, Mate, is a “companion” novel to what was her first book in a new romance sub-genre for her, monster stuff. She made her name, both in the wider world and in my own house, writing STEM-themed romances featuring smart, successful, women in the sciences. I don’t think it would have occurred to me to make the connection, but the jump from sci to sci-fi/fantasy is more of a baby step than a enormous leap. Today In Books Newsletter Sign up to Today In Books to receive daily news and miscellany from the world of books. Thank you for signing up! Keep an eye on your inbox. Enjoying what you’re reading? Support the work we do as an independent media resource by becoming an All Access member, and unlock our entire library of articles and a growing catalog of community features. Sign up now for only $6/month! Jeff Bezos Commands The Washington Post’s Opinion Section to Do Things He Wants Them To DoAs far as I have heard, Bezos has left the news division at the WaPo well enough alone. And that appears to be the case even today, after Jeff Bezos sent a memo announcing that the opinion section would now be dedicated to “free markets and personal liberties,” with writing every day in support of…that. There is nothing I or you can do to change Bezos’s mind about anything. That’s not what me writing about this here is about. What I am writing about here is that individuals owning enormous media companies has turned out to be a pretty bad idea. If you have directable subscription dollars, I would urge you to send them to news organizations now owned by a single individual. Publicly trader companies are WAY better. Non-profits are better still. ProPublica rules. Wikipedia could use your bucks. If you are reading a newsletter like this, you are among the relatively few that care about this stuff. Go forth and subscribe.",
  "image": "https://s2982.pcdn.co/wp-content/uploads/2020/12/image-of-old-library-books-and-ladder-e1740591742214.jpg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-area\"\u003e\n\n\t\t\n\t\t\t\t\t\n\n\t\t\u003carticle\u003e\n\n\t\t\t\u003cdiv itemprop=\"mainEntityOfPage\"\u003e\n\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"620\" height=\"319\" src=\"https://s2982.pcdn.co/wp-content/uploads/2020/12/image-of-old-library-books-and-ladder-e1740591742214.jpg.webp\" alt=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://s2982.pcdn.co/wp-content/uploads/2020/12/image-of-old-library-books-and-ladder-e1740591742214.jpg.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2020/12/image-of-old-library-books-and-ladder-e1740591742214-300x154.jpg.webp 300w\" sizes=\"(max-width: 620px) 100vw, 620px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20620%20319\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://s2982.pcdn.co/wp-content/uploads/2020/12/image-of-old-library-books-and-ladder-e1740591742214.jpg.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2020/12/image-of-old-library-books-and-ladder-e1740591742214-300x154.jpg.webp 300w\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2020/12/image-of-old-library-books-and-ladder-e1740591742214.jpg.webp\"/\u003e\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\u003cp\u003eThis content contains affiliate links. When you buy through these links, we may earn an affiliate commission.\u003c/p\u003e\n\t\t\t\t\u003cdiv itemprop=\"articleBody\" class=\"post-591369 post type-post status-publish format-standard has-post-thumbnail hentry category-today-in-books pmpro-has-access\"\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\n\t\t\u003cdiv\u003e\u003cp\u003e\u003cem\u003eWelcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more.\u003c/em\u003e\u003cem\u003eWelcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more.\u003c/em\u003e\u003c/p\u003e\u003ch2\u003eThe Ascendance of the Book Ladder\u003c/h2\u003e\u003cdiv\u003e\n\u003cp\u003eThis piece isn’t really a history of book ladders, because there isn’t much of one. Ladders, yes. Books, absolutely. But what\u003ca href=\"https://slate.com/culture/2025/02/books-library-ladder-brutalist-bookshelves-cases-history.html\"\u003e Chason Gordon identifies is the dream represented by the book ladder\u003c/a\u003e:\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe fantasy usually goes like this. A friend of mine comes over, and we wander into my shimmering Babylonian spire of a library, with shelves of books ascending into the atmosphere. The only way to access them is by using the star of the show: the book ladder.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eNo matter what we’re discussing, I ceremoniously take it as an opportunity to say, “You know, that reminds me of a passage from … ,” and then I roll the ladder to my desired location, climb up into the heavens, open a book, and nod knowingly. “Yes, this is what I was thinking of.” Muttering a line of Donne or Chaucer or Plath, I then descend the ladder, reading in a professorial tone, and eventually hand the book to my friend, as if he asked for it.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe part missing, though, is that this fantasy is no longer restricted to having someone come into your house. Social video hungers for aspirational-short videos of someone rolling across their bookcase, smile on their face, hardcovers galore. I think there is the case to be made that we are living in the most superficial time in the history of reading, and the book ladder-video is possibly the ultimate expression of it. That and sprayed edges on everything. \u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003eAli Hazelwood Announces New Book\u003c/h2\u003e\u003cp\u003eAli Hazelwood is one of the top few authors to have been minted in the social video era. Her just announced next book, \u003ca title=\"Buy from Thriftbooks\" product-id=\"0593952588\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fcheck--mate_ali-hazelwood%2F38261555%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Mate\" data-publisher=\"Berkley\" data-releasedate=\"2025-10-07\" data-author=\"Hazelwood, Ali\" data-ean=\"9780593952580\" data-asin=\"0593952588\" rel=\"noopener\"\u003eMate\u003c/a\u003e, is a “companion” novel to what was her first book in a new romance sub-genre for her, monster stuff. She made her name, both in the wider world and in my own house, writing STEM-themed romances featuring smart, successful, women in the sciences. I don’t think it would have occurred to me to make the connection, but the jump from sci to sci-fi/fantasy is more of a baby step than a enormous leap. \u003c/p\u003e\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003eToday In Books Newsletter\u003c/p\u003e\n\u003cp\u003eSign up to Today In Books to receive daily news and miscellany from the world of books.\u003c/p\u003e\n\u003c/div\u003e\n\n\n\u003cp\u003eThank you for signing up! Keep an eye on your inbox.\u003c/p\u003e\n\n\u003c/div\u003e\u003cdiv\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003cem\u003eEnjoying what you’re reading? Support the work we do as an independent media resource by becoming an All Access member, and unlock our entire library of articles and a growing catalog of community features. \u003cstrong\u003e\u003ca href=\"https://bookriot.com/membership-account/membership-checkout/\"\u003eSign up now for only $6/month!\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\u003chr/\u003e\n\u003c/div\u003e\u003ch2\u003eJeff Bezos Commands The Washington Post’s Opinion Section to Do Things He Wants Them To Do\u003c/h2\u003e\u003cp\u003eAs far as I have heard, Bezos has left the news division at the WaPo well enough alone. And that appears to be the case even today, after\u003ca href=\"https://www.thedailybeast.com/ex-wapo-editor-marty-baron-sad-and-disgusted-at-bezos-opinions-overhaul/\"\u003e Jeff Bezos sent a memo announcing that the opinion section would now be dedicated to “free markets and personal liberties,”\u003c/a\u003e with writing every day in support of…that. There is nothing I or you can do to change Bezos’s mind about anything. That’s not what me writing about this here is about. What I am writing about here is that individuals owning enormous media companies has turned out to be a pretty bad idea. If you have directable subscription dollars, I would urge you to send them to news organizations now owned by a single individual. Publicly trader companies are WAY better. Non-profits are better still. ProPublica rules. Wikipedia could use your bucks.  If you are reading a newsletter like this, you are among the relatively few that care about this stuff. Go forth and subscribe.\u003c/p\u003e\u003c/div\u003e\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-26T17:57:00Z",
  "modifiedTime": "2025-02-26T18:07:41Z"
}
