{
  "id": "2818ce29-76a1-4f08-874b-0d5c4e90ac94",
  "title": "Book of the month: Hubert Mingarelli",
  "link": "https://ayearofreadingtheworld.com/2024/03/30/book-of-the-month-hubert-mingarelli/",
  "description": "It’s nearly ten years since I started my Book of the month slot on this blog, after having been blown away by an Italian writer who has since taken the English-speaking world by storm. In another six years, I will have featured more Books of the month than the 197 titles that comprised my original […]",
  "author": "Ann Morgan",
  "published": "Sat, 30 Mar 2024 14:31:37 +0000",
  "source": "https://ayearofreadingtheworld.com/feed/",
  "categories": [
    "Book of the month",
    "Europe",
    "The stories",
    "book review",
    "books",
    "culture",
    "fiction",
    "French",
    "holocaust",
    "Hubert Mingerelli",
    "reading",
    "second world war",
    "translation"
  ],
  "byline": "By Ann Morgan",
  "length": 5809,
  "excerpt": "It’s nearly ten years since I started my Book of the month slot on this blog, after having been blown away by an Italian writer who has since taken the English-speaking world by storm. In ano…",
  "siteName": "A year of reading the world",
  "favicon": "https://s0.wp.com/i/webclip.png",
  "text": "It’s nearly ten years since I started my Book of the month slot on this blog, after having been blown away by an Italian writer who has since taken the English-speaking world by storm. In another six years, I will have featured more Books of the month than the 197 titles that comprised my original year of the world. Making book reviewing on this platform a long-term commitment has had a profound impact on how I read. Finding a title worthy of featuring each month has been a good way of holding myself accountable to stay connected to what is happening in international publishing, and it has enabled me to channel and share some of the many recommendations I am still fortunate to receive from readers all over the planet. Because I only feature one book a month, I rarely take recommendations from book PRs, and because I am keen to support the industry and to keep this blog free of commercial influence, I buy nearly every title I feature, rather than accepting free copies. I try to maintain the spirit of my original quest: a personal, independent and entirely unscientific record of diverse reading experiences that I aim to approach with openness, respect and curiosity. Some months, the choice of what to feature is easy. Other months, particularly when I am in the thick of research for my own writing projects, it is a struggle to find something that fits (I don’t always have to love the books I feature unreservedly, but I have to feel that they are interesting and deserving of wider notice). Most of the time, however, I am torn between several titles and forced to neglect books that I would really like to tell you about. As I always try to review something in the month I read it, this means many brilliant reads get left behind. This year of reading nothing new, however, I am relaxing my month rule slightly and taking the opportunity to return to a few of the stories that have stayed in my mind over the years. The first of these is A Meal in Winter by Hubert Mingarelli, translated from the French by Sam Taylor. This title was recommended to me a few years back by my friend, author Caroline Brothers. I was looking for something that would absorb me and this short novel was Caroline’s answer. Set during the second world war, the narrative follows three German soldiers sent out into the winter-bound Polish countryside to find a Jew to bring back for execution. Having caught one hiding in the woods, they hole up at an abandoned cottage to share a meal before returning with their captive. Over the hours that follow, the implications of their actions force themselves to the surface and the toll their murderous work takes on all present becomes clear. Knowing that a novel is set during the second world war is often a turn-off for me. There are so many brilliant (and not so brilliant) stories set during this period that it seems to me that a book has to work doubly hard to make something powerful out of subject matter that has been handled by so many writers. A Meal in Winter delivers. A masterclass in subtlety, it unravels the psychology of the aggressor, revealing how violence rebounds on its perpetrators, shattering and unmaking those who enact it every bit as much as its victims. Even at the sentence level, through the lens of Taylor’s translation, we see how thinking glitches and recoils in the face of inhumanity. The interior monologue of the narrating soldier abounds with jagged rhythms and defensive repetitions, rearing and bucking in the face of horrors he cannot own. There is one section in particular that echoes in my mind, years after I read it, when the narrator reveals why seeing little individual touches on his victims’ clothing irks him so profoundly: Because if you want to know what it is that tormented me, and that torments me to this day, it’s seeing that kind of thing on the clothes of the Jews we’re going to kill: a piece of embroidery, coloured buttons, a ribbon in the hair. I was always pierced by those thoughtful maternal displays of tenderness. Afterwards I forgot about them, but in that moment they pierced me and I suffered for the mothers who had, once, gone to so much effort. And then, because of this suffering they caused me, I hated them too. And the more I suffered for them, the more I hated them. And if you want to know more, my hatred knew no bounds when they were not there to hug their darlings tightly to their breasts while I killed them. Once, they had embroidered a snowflake on their hat or tied a ribbon in their hair, but where were they when I was killing them? The brilliance of this – the way the traumatised mind contorts its owner’s atrocities so as to apportion blame to his victims – is staggering. This is how we work, Mingarelli shows us. This is what we do. Even when we have committed monstrous acts, we share human feelings and we still need to find a story that makes our actions acceptable, that allows us to live with ourselves. It is relatively easy to write about victims, at least in my experience. It is hard to write about perpetrators. And it is fiendishly difficult to do so in a way that makes readers feel for their plight and recognise the victim in them, even as we abhor their deeds. That Mingarelli achieves this is the source of A Meal in Winter’s power and hope. The story is bleak. But the fact that the author presents it with such humanity and insight is deeply moving and inspiring. Even as we destroy one another, human beings possess an extraordinary capacity for empathy and compassion. We truly are marvellous wretches. In fewer than 150 pages, Mingarelli shows us the full range of his and our capabilities. Unforgettable. A Meal in Winter by Hubert Mingarelli, translated from the French by Sam Taylor (Granta, 2013)",
  "image": "https://ayearofreadingtheworld.com/wp-content/uploads/2024/03/image.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\u003cfigure\u003e\u003ca href=\"https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/03/image.png?ssl=1\"\u003e\u003cimg data-recalc-dims=\"1\" fetchpriority=\"high\" decoding=\"async\" width=\"418\" height=\"470\" data-attachment-id=\"7512\" data-permalink=\"https://ayearofreadingtheworld.com/2024/03/30/book-of-the-month-hubert-mingarelli/image-6/\" data-orig-file=\"https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/03/image.png?fit=418%2C470\u0026amp;ssl=1\" data-orig-size=\"418,470\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"image\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/03/image.png?fit=267%2C300\u0026amp;ssl=1\" data-large-file=\"https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/03/image.png?fit=418%2C470\u0026amp;ssl=1\" tabindex=\"0\" role=\"button\" src=\"https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/03/image.png?resize=418%2C470\u0026amp;ssl=1\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIt’s nearly ten years since I started my Book of the month slot on this blog, after having been blown away by an \u003ca href=\"https://ayearofreadingtheworld.com/2014/05/27/new-book-of-the-month-elena-ferrante/\"\u003eItalian writer who has since taken the English-speaking world by storm\u003c/a\u003e. In another six years, I will have featured more Books of the month than the 197 titles that comprised my original year of the world.\u003c/p\u003e\n\n\n\n\u003cp\u003eMaking book reviewing on this platform a long-term commitment has had a profound impact on how I read. Finding a title worthy of featuring each month has been a good way of holding myself accountable to stay connected to what is happening in international publishing, and it has enabled me to channel and share some of the many recommendations I am still fortunate to receive from readers all over the planet. Because I only feature one book a month, I rarely take recommendations from book PRs, and because I am keen to support the industry and to keep this blog free of commercial influence, I buy nearly every title I feature, rather than accepting free copies. I try to maintain the spirit of my original quest: a personal, independent and entirely unscientific record of diverse reading experiences that I aim to approach with openness, respect and curiosity.\u003c/p\u003e\n\n\n\n\u003cp\u003eSome months, the choice of what to feature is easy. Other months, particularly when I am in the thick of research for my own writing projects, it is a struggle to find something that fits (I don’t always have to love the books I feature unreservedly, but I have to feel that they are interesting and deserving of wider notice). Most of the time, however, I am torn between several titles and forced to neglect books that I would really like to tell you about. As I always try to review something in the month I read it, this means many brilliant reads get left behind.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis \u003ca href=\"https://ayearofreadingtheworld.com/2024/01/20/2024-my-year-of-reading-nothing-new/\"\u003eyear of reading nothing new\u003c/a\u003e, however, I am relaxing my month rule slightly and taking the opportunity to return to a few of the stories that have stayed in my mind over the years. The first of these is \u003cem\u003e\u003ca href=\"https://granta.com/products/a-meal-in-winter/\"\u003eA Meal in Winter\u003c/a\u003e\u003c/em\u003e by Hubert Mingarelli, translated from the French by Sam Taylor.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis title was recommended to me a few years back by my friend, author \u003ca href=\"https://www.carolinebrothers.com/\"\u003eCaroline Brothers\u003c/a\u003e. I was looking for something that would absorb me and this short novel was Caroline’s answer.\u003c/p\u003e\n\n\n\n\u003cp\u003eSet during the second world war, the narrative follows three German soldiers sent out into the winter-bound Polish countryside to find a Jew to bring back for execution. Having caught one hiding in the woods, they hole up at an abandoned cottage to share a meal before returning with their captive. Over the hours that follow, the implications of their actions force themselves to the surface and the toll their murderous work takes on all present becomes clear.\u003c/p\u003e\n\n\n\n\u003cp\u003eKnowing that a novel is set during the second world war is often a turn-off for me. There are so many brilliant (and not so brilliant) stories set during this period that it seems to me that a book has to work doubly hard to make something powerful out of subject matter that has been handled by so many writers.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eA Meal in Winter\u003c/em\u003e delivers. A masterclass in subtlety, it unravels the psychology of the aggressor, revealing how violence rebounds on its perpetrators, shattering and unmaking those who enact it every bit as much as its victims. Even at the sentence level, through the lens of Taylor’s translation, we see how thinking glitches and recoils in the face of inhumanity. The interior monologue of the narrating soldier abounds with jagged rhythms and defensive repetitions, rearing and bucking in the face of horrors he cannot own. \u003c/p\u003e\n\n\n\n\u003cp\u003eThere is one section in particular that echoes in my mind, years after I read it, when the narrator reveals why seeing little individual touches on his victims’ clothing irks him so profoundly:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eBecause if you want to know what it is that tormented me, and that torments me to this day, it’s seeing that kind of thing on the clothes of the Jews we’re going to kill: a piece of embroidery, coloured buttons, a ribbon in the hair. I was always pierced by those thoughtful maternal displays of tenderness. Afterwards I forgot about them, but in that moment they pierced me and I suffered for the mothers who had, once, gone to so much effort. And then, because of this suffering they caused me, I hated them too. And the more I suffered for them, the more I hated them. \u003c/p\u003e\n\n\n\n\u003cp\u003eAnd if you want to know more, my hatred knew no bounds when they were not there to hug their darlings tightly to their breasts while I killed them. Once, they had embroidered a snowflake on their hat or tied a ribbon in their hair, but where were they when I was killing them?\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eThe brilliance of this – the way the traumatised mind contorts its owner’s atrocities so as to apportion blame to his victims – is staggering. This is how we work, Mingarelli shows us. This is what we do. Even when we have committed monstrous acts, we share human feelings and we still need to find a story that makes our actions acceptable, that allows us to live with ourselves.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt is relatively easy to write about victims, at least in my experience. It is hard to write about perpetrators. And it is fiendishly difficult to do so in a way that makes readers feel for their plight and recognise the victim in them, even as we abhor their deeds.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat Mingarelli achieves this is the source of \u003cem\u003eA Meal in Winter’\u003c/em\u003es power and hope. The story is bleak. But the fact that the author presents it with such humanity and insight is deeply moving and inspiring. Even as we destroy one another, human beings possess an extraordinary capacity for empathy and compassion. We truly are marvellous wretches. In fewer than 150 pages, Mingarelli shows us the full range of his and our capabilities. Unforgettable.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eA Meal in Winter\u003c/em\u003e by Hubert Mingarelli, translated from the French by Sam Taylor (Granta, 2013)\u003c/p\u003e\n\n\n\n\n\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-03-30T14:31:37Z",
  "modifiedTime": "2024-03-30T14:33:03Z"
}
