{
  "id": "8eca2a66-86fd-40eb-a5ad-0ccefde273f4",
  "title": "New York City’s Most Popular Library Checkouts of 2024",
  "link": "https://bookriot.com/new-york-citys-most-popular-library-checkouts-of-2024/",
  "description": "What was the best book you checked out from the library this year?",
  "author": "Community",
  "published": "Wed, 18 Dec 2024 20:29:04 +0000",
  "source": "https://bookriot.com/feed/",
  "categories": [
    "News",
    "breaking in books"
  ],
  "byline": "Community",
  "length": 1280,
  "excerpt": "The most popular library books of 2024 across New York City's three library systems include fantasy, romance, and even a little manga.",
  "siteName": "BOOK RIOT",
  "favicon": "https://s2982.pcdn.co/wp-content/themes/bookriot/assets/images/favicons/BookRiot_Logo_196.png.webp",
  "text": "New York City’s three public library systems—the New York Public Library, the Brooklyn Public Library, and the Queens Public Library—have crunched some numbers and announced the most checked out books of 2024. To give you an idea of the scope of these libraries, the New York Public Library alone has over 90 locations throughout the Bronx, Manhattan, and Staten Island and services around 16 million visitors a year; the Brooklyn Public Library, one of the country’s biggest library systems, provides books and services for a community of 2.6 million people; and the Queens Public Library has more than 5 million books and 80,000 educational, cultural, and civic programs annually. Suffice to say, NYC’s libraries get active, and below is a quick look at their most popular books this year (which includes ebooks, audiobooks, and physical books). Looking at the lists, we noticed that the most popular adult titles across all three library systems are fairly diverse, with 40% of books having been written by non-white authors. We can’t really say the same for the YA lists, though, which seem to be dominated by the usual (TikTok) suspects. As always, though, we do love a good book list, and it’s lovely seeing the checkout patterns for such a large group of library systems.",
  "image": "https://s2982.pcdn.co/wp-content/uploads/2024/12/nyc-checkouts-2024.jpg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eNew York City’s three public library systems—the New York Public Library, the Brooklyn Public Library, and the Queens Public Library—have crunched some numbers and announced the most checked out books of 2024.\u003c/p\u003e\n\u003cp\u003eTo give you an idea of the scope of these libraries, the New York Public Library alone has over 90 locations throughout the Bronx, Manhattan, and Staten Island and services around 16 million visitors a year; the Brooklyn Public Library, one of the country’s biggest library systems, provides books and services for a community of 2.6 million people; and the Queens Public Library has more than 5 million books and 80,000 educational, cultural, and civic programs annually. \u003c/p\u003e\n\u003cp\u003eSuffice to say, NYC’s libraries get \u003cem\u003eactive\u003c/em\u003e, and below is a quick look at their most popular books this year (which includes ebooks, audiobooks, and physical books). Looking at the lists, we noticed that the most popular adult titles across all three library systems are fairly diverse, with 40% of books having been written by non-white authors. We can’t really say the same for the YA lists, though, which seem to be dominated by the usual (TikTok) suspects. \u003c/p\u003e\n\u003cp\u003eAs always, though, we do love a good book list, and it’s lovely seeing the checkout patterns for such a large group of library systems.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-18T20:29:04Z",
  "modifiedTime": "2024-12-18T20:29:06Z"
}
