{
  "id": "902c49c0-8373-44fb-8e67-4bd2383f0fba",
  "title": "VOICE FOR THE VOICELESS",
  "link": "https://www.kirkusreviews.com/book-reviews/dalai-lama/voice-for-the-voiceless/",
  "description": "“The responsibility for the nation and people of Tibet was placed upon me the moment I was recognized as the Dalai Lama at the age of two.” When he became Tibet’s leader at 16, the year Chinese soldiers swarmed into the formerly independent nation, he entered into numerous discussions with Mao Zedong (“truly unlike anyone I had met”), Zhou Enlai (“clever and smooth-talking”), and other Communist leaders, one of whom warned him that should he flee because Tibet would meet the same fate as Hungary, freshly crushed by the Soviets. When it became apparent that Mao intended to absorb Tibet as a strategic buffer and as part of the symbolic restoration of “territories that had once been part of the Manchu Qing empire,” the Dalai Lama went into exile and, as he notes, has never since been able to return to his native land. “Mao probably realized that with me gone out of Tibet,” he writes, “China would struggle with the question of legitimacy both of their authority and their presence in Tibet. He was right.” Today, he adds, the regime of Xi Jinping is bent on assimilating Tibet, suppressing religious practices, and removing children to Mandarin-speaking boarding schools. Nevertheless, the Dalai Lama still finds hope for Tibet in the roiling undercurrents of Chinese society—the Tiananmen Square uprising of 1989, for example, which, he holds, by no means “marks the end of the Chinese people’s quest for greater freedom, dignity, and democracy.” A surprising discovery is that the Dalai Lama has long been willing to leave Tibet within the People’s Republic of China, but with control over its own internal affairs and a democratic government.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "by Dalai Lama",
  "length": 3916,
  "excerpt": "A subtly reasoned argument for a free Tibet after 75 years of Chinese occupation.",
  "siteName": "Kirkus Reviews",
  "favicon": "https://d1fd687oe6a92y.cloudfront.net/img/kir_images/header/apple-icon.png",
  "text": "ON FREEDOM by Timothy Snyder ‧ RELEASE DATE: Sept. 17, 2024 An incisive, urgently relevant analysis of—and call to action on—America’s foundational ideal. An examination of how the U.S. can revitalize its commitment to freedom. In this ambitious study, Snyder, author of On Tyranny, The Road to Unfreedom, and other books, explores how American freedom might be reconceived not simply in negative terms—as freedom from coercion, especially by the state—but positive ones: the freedom to develop our human potential within sustaining communal structures. The author blends extensive personal reflections on his own evolving understanding of liberty with definitions of the concept by a range of philosophers, historians, politicians, and social activists. Americans, he explains, often wrongly assume that freedom simply means the removal of some barrier: “An individual is free, we think, when the government is out of the way. Negative freedom is our common sense.” In his careful and impassioned description of the profound implications of this conceptual limitation, Snyder provides a compelling account of the circumstances necessary for the realization of positive freedom, along with a set of detailed recommendations for specific sociopolitical reforms and policy initiatives. “We have to see freedom as positive, as beginning from virtues, as shared among people, and as built into institutions,” he writes. The author argues that it’s absurd to think of government as the enemy of freedom; instead, we ought to reimagine how a strong government might focus on creating the appropriate conditions for human flourishing and genuine liberty. Another essential and overlooked element of freedom is the fostering of a culture of solidarity, in which an awareness of and concern for the disadvantaged becomes a guiding virtue. Particularly striking and persuasive are the sections devoted to eviscerating the false promises of libertarianism, exposing the brutal injustices of the nation’s penitentiaries, and documenting the wide-ranging pathologies that flow from a tax system favoring the ultrawealthy. An incisive, urgently relevant analysis of—and call to action on—America’s foundational ideal. Pub Date: Sept. 17, 2024 ISBN: 9780593728727 Page Count: 368 Publisher: Crown Review Posted Online: June 25, 2024 Kirkus Reviews Issue: Aug. 1, 2024",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/4fcdb8f232ff4bdb8b82ead143ea76cd/5b37e68681034f15a0320dad37264963.jpg.300x0_q85_autocrop.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eON FREEDOM\u003c/h2\u003e\n                                \n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/timothy-snyder/\"\u003e\n                            Timothy Snyder\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: Sept. 17, 2024\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    An incisive, urgently relevant analysis of—and call to action on—America’s foundational ideal.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eAn examination of how the U.S. can revitalize its commitment to freedom.\u003c/p\u003e\n                                        \u003cp\u003eIn this ambitious study, Snyder, author of \u003ci\u003eOn Tyranny\u003c/i\u003e, \u003ci\u003eThe Road to Unfreedom\u003c/i\u003e, and other books, explores how American freedom might be reconceived not simply in negative terms—as freedom from coercion, especially by the state—but positive ones: the freedom to develop our human potential within sustaining communal structures. The author blends extensive personal reflections on his own evolving understanding of liberty with definitions of the concept by a range of philosophers, historians, politicians, and social activists. Americans, he explains, often wrongly assume that freedom simply means the removal of some barrier: “An individual is free, we think, when the government is out of the way. Negative freedom is our common sense.” In his careful and impassioned description of the profound implications of this conceptual limitation, Snyder provides a compelling account of the circumstances necessary for the realization of positive freedom, along with a set of detailed recommendations for specific sociopolitical reforms and policy initiatives. “We have to see freedom as positive, as beginning from virtues, as shared among people, and as built into institutions,” he writes. The author argues that it’s absurd to think of government as the enemy of freedom; instead, we ought to reimagine how a strong government might focus on creating the appropriate conditions for human flourishing and genuine liberty. Another essential and overlooked element of freedom is the fostering of a culture of solidarity, in which an awareness of and concern for the disadvantaged becomes a guiding virtue. Particularly striking and persuasive are the sections devoted to eviscerating the false promises of libertarianism, exposing the brutal injustices of the nation’s penitentiaries, and documenting the wide-ranging pathologies that flow from a tax system favoring the ultrawealthy.\u003c/p\u003e\u003cp\u003e\n                                        An incisive, urgently relevant analysis of—and call to action on—America’s foundational ideal.\n                                        \n                                        \n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e Sept. 17, 2024\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 9780593728727\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 368\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Crown\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e June 25, 2024\u003c/p\u003e\n                                         \u003cp\u003e\u003cb\u003eKirkus Reviews Issue:\u003c/b\u003e Aug. 1, 2024\u003c/p\u003e\n                                    \u003c/div\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
