{
  "id": "914ea74a-8f6a-4927-aabf-c36df1c0313c",
  "title": "Queer Witchy YA Stories for the Season",
  "link": "https://bookriot.com/queer-witchy-ya-stories-for-the-season/",
  "description": "These queer YA witch stories are perfect for the season of the witch.",
  "author": "Kelly Jensen",
  "published": "Thu, 24 Oct 2024 18:15:27 +0000",
  "source": "https://bookriot.com/feed/",
  "categories": [
    "What's Up in YA"
  ],
  "byline": "Kelly Jensen",
  "length": 7228,
  "excerpt": "Hop aboard your favorite broomstick with these queer YA witch stories.",
  "siteName": "BOOK RIOT",
  "favicon": "https://s2982.pcdn.co/wp-content/themes/bookriot/assets/images/favicons/BookRiot_Logo_196.png.webp",
  "text": "This content contains affiliate links. When you buy through these links, we may earn an affiliate commission. Kelly is a former librarian and a long-time blogger at STACKED. She's the editor/author of (DON'T) CALL ME CRAZY: 33 VOICES START THE CONVERSATION ABOUT MENTAL HEALTH and the editor/author of HERE WE ARE: FEMINISM FOR THE REAL WORLD. Her next book, BODY TALK, will publish in Fall 2020. Follow her on Instagram @heykellyjensen. View All posts by Kelly Jensen Is there anything queerer than a witch? There might be plenty right up there in such a fake ranking, but witches are among some of the queerest beings imaginable. Witches wear what they want, they believe in magic, they cast spells, and they can fall anywhere on the spectrum of Glenda the Good to the darkest and most evil of spirits imaginable. That’s what makes witchy stores so dang good. There has been such a welcome uptick in queer horror in YA over the last several years. While not all witch stories are horror, you could make a compelling case that they are. The witch elicits a fear or disgust or slight sweaty feeling for many readers, even in the most mundane situations. Let’s take a look at a handful of the most outstanding queer YA witch stories. These are perfect to read as we enter into Halloween season, as much as they’re delightful to read at any other time.Psst: if you think to yourself “I’ve read this list before,” that might be because it originally ran in the Our Queerest Shelves newsletter in mid-September. It’s too good not to also share here. Spells to Forget Us by Aislinn Brophy Luna is a powerful, talented witch, set to take over as as head of the Boston Witch Council. Except she does not want that role. Aoife is not at all magical or powerful. She’s also extremely well known, as her influencer family used her for content since she was born. She wants nothing but a quiet, private life. When the two girls’ paths cross, they fall for each other hard. Magic law decrees that when Luna dates, she must cast a spell that will erase the memories of that relationship from the person she dated in the event they break up. But when the romance between Aoife and Luna ends, it’s not just Aoife who loses the memory of the relationship. Luna does, too. The girls meet again. Date again. Then they both recover the memories from that prior relationship. And so it goes, again and again. A time loop story with a witch and non-witch? This sounds so fun. What’s Up in YA? Newsletter Sign up for What’s Up In YA? to receive all things young adult literature. Thank you for signing up! Keep an eye on your inbox. So Witches We Became by Jill Baguchinsky Nell and her friends have rented a vacation house in Florida for spring break to get away from their lives for a bit. But Nell’s secrets didn’t stay at home. They came with, and they’ve decided to team up with the island’s own history of tragedy. Now, the friends are all trapped, with nowhere to go, since the water surrounding their not-so-sweet vacation rental is infested with dangerous beasts and a toxic mist. It’ll be work to get out. Part of that work—or maybe a whole lot of that work—will involve confronting the secrets and memories that Nell, as well as her friends, wish they didn’t need to. For Nell, it’s reckoning with an assault she experienced a year ago and a shadow that’s followed her throughout her entire life.  But Nell’s friends all brought their own secrets and together, they’ll need to not only divulge them, they’ll need to use their combined powers to get out of this mess. What results is an angry, powerful, witchy confrontation with monsters, human and otherwise. Over My Dead Body by Sweeney Boo Set at Younwity’s Institute of Magic during the days leading up to Samhain, when the veil between the living world and the dead is thinnest, Abby wakes up and discovers her best friend Noreen has disappeared. What’s weirdest is most of Abby’s classmates seem not to care about it. They’re too busy preparing for the festivities and believe that the school’s Coven will find Noreen safe and sound. No one seems concerned about the forbidden woods seeming just a little more foreboding than usual, either. Abby’s not settling for that and begins to search out answers herself, with the help of a couple of friends. What she unravels is a thread of secrets throughout the institution and a governing Coven who may be anything but the kind of leadership the institution deserves. And Noreen’s disappearance has a lot of similarities to the disappearance of a student years before. This vibrant, full-colored graphic novel features a wide range of queer witches and witches of color, and it is a visual delight through and through. Cemetery Boys by Aiden Thomas Set over Halloween and into Día De Los Muertos, Thomas’s debut novel follows Yadriel, who is determined to prove himself a powerful brujo despite the gendered expectations of his traditional Latine family. He employs the help of two friends to perform a ritual that will help him find the ghost of his murdered cousin and set him free. This was a lot of fun while also being packed with so much interesting stuff about gender, about Brujería and how gendered it is, about family, and a sweet, humorous romance.  The Witchery by S. Isabelle Badass witches and dark magic set in a witch academy? Yes, please! Logan is a new witch struggling with her powers and is taken under the tutelage of a death witch, a green witch, and a witch who is thirsty for more power. It won’t be long before Wolves rise up to attack humans and witches alike, but there isn’t a good alliance between humans and witches. All four of the student witches are going to have to band together to not only secure that alliance but to take down the Wolves who are hungry for blood. Brooms by Jasmine Walls, illustrated by Teo DuVall This one is pitched as The Fast and the Furious but with broomsticks, and it follows a group of 6 diverse teens who participate in a forbidden broom race, which allows them to embrace their magic as witches. It’s set in 1930s Mississippi, giving the story of magic and witchcraft a historical spin. Not Good for Maidens by Tori Bovalino Lou’s disbelief in magic is shattered once she has to journey to the goblin market to rescue her teenage aunt. The market, which Lou had only read about up until now, is full of every kind of sweet, delectable thing that could tempt humans. She has to learn spells and tricks if she’s to save her aunt and make it out alive. She’s only got three days, though, and then the market disappears– and her aunt along with it. Want more? Then you’re in luck. Dive into these witchy queer YA titles, too: All Our Hidden Gifts by Caroline O’Donoghue Improbable Magic for Cynical Witches by Kate Scelsa Labyrinth Lost by Zoraida Córdova The Lost Coast by A.R. Capetta The Mermaid, The Witch, and The Sea by Maggie Tokuda-Hall The Mirror Season by Anna-Marie McLemore Mooncakes by Suzanne Walker and Wendy Xu Practical Rules for Cursed Witches by Kayla Cottingham These Witches Don’t Burn by Isabel Sterling When We Were Magic by Sarah Gailey The Witch King by H.E. Edgmon Witchlight by Jessi Zabarsky",
  "image": "https://s2982.pcdn.co/wp-content/uploads/2024/09/queer-witch-ya-books.jpg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-area\"\u003e\n\n\t\t\n\t\t\t\t\t\n\n\t\t\u003carticle\u003e\n\n\t\t\t\u003cdiv itemprop=\"mainEntityOfPage\"\u003e\n\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"620\" height=\"332\" src=\"https://s2982.pcdn.co/wp-content/uploads/2024/09/queer-witch-ya-books.jpg.webp\" alt=\"queer witchy ya books cover collage\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://s2982.pcdn.co/wp-content/uploads/2024/09/queer-witch-ya-books.jpg.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2024/09/queer-witch-ya-books-300x161.jpg.webp 300w\" sizes=\"(max-width: 620px) 100vw, 620px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20620%20332\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://s2982.pcdn.co/wp-content/uploads/2024/09/queer-witch-ya-books.jpg.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2024/09/queer-witch-ya-books-300x161.jpg.webp 300w\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2024/09/queer-witch-ya-books.jpg.webp\"/\u003e\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\u003cp\u003eThis content contains affiliate links. When you buy through these links, we may earn an affiliate commission.\u003c/p\u003e\n\t\t\t\t\u003cdiv itemprop=\"articleBody\" class=\"post-578657 post type-post status-publish format-standard has-post-thumbnail hentry category-whatsupinya pmpro-has-access\"\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\u003cp\u003e\u003cspan\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eKelly is a former librarian and a long-time blogger at STACKED. She\u0026#39;s the editor/author of (DON\u0026#39;T) CALL ME CRAZY: 33 VOICES START THE CONVERSATION ABOUT MENTAL HEALTH and the editor/author of HERE WE ARE: FEMINISM FOR THE REAL WORLD. Her next book, BODY TALK, will publish in Fall 2020. Follow her on Instagram \u003ca href=\"http://instagram.com/heykellyjensen\"\u003e@heykellyjensen\u003c/a\u003e.\u003c/p\u003e\n\t\t\t\t\u003cp\u003e\u003ca href=\"https://bookriot.com/author/kellyjensen/\"\u003eView All posts by Kelly Jensen\u003c/a\u003e\u003c/p\u003e\n\t\t\t\u003c/span\u003e\n\t\t\u003c/p\u003e\n\t\t\u003cdiv\u003e\u003cp\u003eIs there anything queerer than a witch? There might be plenty right up there in such a fake ranking, but witches are among some of the queerest beings imaginable. Witches wear what they want, they believe in magic, they cast spells, and they can fall anywhere on the spectrum of Glenda the Good to the darkest and most evil of spirits imaginable. That’s what makes witchy stores so dang good. \u003c/p\u003e\u003cp\u003eThere has been such a welcome uptick in queer horror in YA over the last several years. While not all witch stories are horror, you could make a compelling case that they are. The witch \u003ca href=\"https://bookriot.com/mood-literary-device/\"\u003eelicits a fear or disgust or slight sweaty feeling\u003c/a\u003e for many readers, even in the most mundane situations. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eLet’s take a look at a handful of the most outstanding queer YA witch stories. These are perfect to read as we enter into Halloween season, as much as they’re delightful to read at any other time.\u003c/p\u003e\u003cp\u003ePsst: if you think to yourself “I’ve read this list before,” that might be because it originally ran in the \u003ca href=\"https://bookriot.com/newsletter/our-queerest-shelves/\"\u003eOur Queerest Shelves\u003c/a\u003e newsletter in mid-September. It’s too good not to also share here. \u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fspells-to-forget-us_aislinn-brophy%2F51864715%2F\" data-ean=\"9780593354551\" data-asin=\"0593354559\" data-title=\"Spells to Forget Us\" data-author=\"Brophy, Aislinn\" title=\"Buy from Thriftbooks\"\u003e\u003cimg decoding=\"async\" src=\"https://s2982.pcdn.co/wp-content/uploads/2024/09/Spells-to-Forget-Us-by-Aislinn-Brophy.jpg.webp\" alt=\"Spells to Forget Us by Aislinn Brophy book cover\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2024/09/Spells-to-Forget-Us-by-Aislinn-Brophy.jpg.webp\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"0593354559\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fspells-to-forget-us_aislinn-brophy%2F51864715%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Spells to Forget Us\" data-publisher=\"G.P. Putnam\u0026#39;s Sons Books for Young Readers\" data-releasedate=\"2024-09-17\" data-author=\"Brophy, Aislinn\" data-ean=\"9780593354551\" data-asin=\"0593354559\"\u003eSpells to Forget Us\u003c/a\u003e by Aislinn Brophy\u003c/h3\u003e\n\u003cdiv\u003e\n\u003cp\u003eLuna is a powerful, talented witch, set to take over as as head of the Boston Witch Council. Except she does not want that role.\u003c/p\u003e\n\u003cp\u003eAoife is not at all magical or powerful. She’s also extremely well known, as her influencer family used her for content since she was born. She wants nothing but a quiet, private life.\u003c/p\u003e\n\u003cp\u003eWhen the two girls’ paths cross, they fall for each other hard. Magic law decrees that when Luna dates, she must cast a spell that will erase the memories of that relationship from the person she dated in the event they break up. But when the romance between Aoife and Luna ends, it’s not just Aoife who loses the memory of the relationship. Luna does, too.\u003c/p\u003e\n\u003cp\u003eThe girls meet again. Date again. Then they both recover the memories from that prior relationship.\u003c/p\u003e\n\u003cp\u003eAnd so it goes, again and again.\u003c/p\u003e\n\u003cp\u003eA time loop story with a witch and non-witch? This sounds so fun.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003eWhat’s Up in YA? Newsletter\u003c/p\u003e\n\u003cp\u003eSign up for What’s Up In YA? to receive all things young adult literature.\u003c/p\u003e\n\u003c/div\u003e\n\n\n\u003cp\u003eThank you for signing up! Keep an eye on your inbox.\u003c/p\u003e\n\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fso-witches-we-became%2F51921502%2F\" data-ean=\"9780316568807\" data-asin=\"0316568805\" data-title=\"So Witches We Became\" data-author=\"Baguchinsky, Jill\" title=\"Buy from Thriftbooks\"\u003e\u003cimg decoding=\"async\" src=\"https://s2982.pcdn.co/wp-content/uploads/2024/09/so-witches-we-became-book-cover.jpg.webp\" alt=\"So Witches We Became by Jill Baguchinsky book cover\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2024/09/so-witches-we-became-book-cover.jpg.webp\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"0316568805\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fso-witches-we-became%2F51921502%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"So Witches We Became\" data-publisher=\"Little, Brown Books for Young Readers\" data-releasedate=\"2024-07-23\" data-author=\"Baguchinsky, Jill\" data-ean=\"9780316568807\" data-asin=\"0316568805\"\u003eSo Witches We Became\u003c/a\u003e by Jill Baguchinsky\u003c/h3\u003e\n\u003cdiv\u003e\n\u003cp\u003eNell and her friends have rented a vacation house in Florida for spring break to get away from their lives for a bit. But Nell’s secrets didn’t stay at home. They came with, and they’ve decided to team up with the island’s own history of tragedy. Now, the friends are all trapped, with nowhere to go, since the water surrounding their not-so-sweet vacation rental is infested with dangerous beasts and a toxic mist.\u003c/p\u003e\n\u003cp\u003eIt’ll be work to get out. Part of that work—or maybe a whole lot of that work—will involve confronting the secrets and memories that Nell, as well as her friends, wish they didn’t need to. For Nell, it’s reckoning with an assault she experienced a year ago and a shadow that’s followed her throughout her entire life. \u003c/p\u003e\n\u003cp\u003eBut Nell’s friends all brought their own secrets and together, they’ll need to not only divulge them, they’ll need to use their combined powers to get out of this mess. What results is an angry, powerful, witchy confrontation with monsters, human and otherwise.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fover-my-dead-body_sweeney-boo%2F34485477%2F\" data-ean=\"9780063056305\" data-asin=\"0063056305\" data-title=\"Over My Dead Body: A Witchy Graphic Novel\" data-author=\"Boo, Sweeney\" title=\"Buy from Thriftbooks\"\u003e\u003cimg decoding=\"async\" src=\"https://s2982.pcdn.co/wp-content/uploads/2023/03/over-my-dead-body-book-cover-1.jpeg.webp\" alt=\"cover of Over My Dead Body by Sweeney Boo\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2023/03/over-my-dead-body-book-cover-1.jpeg.webp\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"0063056305\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fover-my-dead-body_sweeney-boo%2F34485477%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Over My Dead Body: A Witchy Graphic Novel\" data-publisher=\"HarperAlley\" data-releasedate=\"2022-08-30\" data-author=\"Boo, Sweeney\" data-ean=\"9780063056305\" data-asin=\"0063056305\"\u003eOver My Dead Body\u003c/a\u003e by Sweeney Boo\u003c/h3\u003e\n\u003cdiv\u003e\n\u003cp\u003eSet at Younwity’s Institute of Magic during the days leading up to Samhain, when the veil between the living world and the dead is thinnest, Abby wakes up and discovers her best friend Noreen has disappeared. What’s weirdest is most of Abby’s classmates seem not to care about it. They’re too busy preparing for the festivities and believe that the school’s Coven will find Noreen safe and sound. No one seems concerned about the forbidden woods seeming just a little more foreboding than usual, either.\u003c/p\u003e\n\u003cp\u003eAbby’s not settling for that and begins to search out answers herself, with the help of a couple of friends. What she unravels is a thread of secrets throughout the institution and a governing Coven who may be anything but the kind of leadership the institution deserves. And Noreen’s disappearance has a lot of similarities to the disappearance of a student years before.\u003c/p\u003e\n\u003cp\u003eThis vibrant, full-colored graphic novel features a wide range of queer witches and witches of color, and it is a visual delight through and through.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fcemetery-boys_aiden-thomas%2F23564526%2F\" data-ean=\"9781250250469\" data-asin=\"1250250463\" data-title=\"Cemetery Boys (Cemetery Boys, 1)\" data-author=\"Thomas, Aiden\" title=\"Buy from Thriftbooks\"\u003e\u003cimg decoding=\"async\" src=\"https://s2982.pcdn.co/wp-content/uploads/2024/07/1-cemetery-boys-book-cover.jpg.webp\" alt=\"cemetery boys book cover\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2024/07/1-cemetery-boys-book-cover.jpg.webp\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1250250463\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fcemetery-boys_aiden-thomas%2F23564526%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Cemetery Boys (Cemetery Boys, 1)\" data-publisher=\"Swoon Reads\" data-releasedate=\"2020-09-01\" data-author=\"Thomas, Aiden\" data-ean=\"9781250250469\" data-asin=\"1250250463\"\u003eCemetery Boys\u003c/a\u003e by Aiden Thomas\u003c/h3\u003e\n\u003cdiv\u003e\n\u003cp\u003eSet over Halloween and into Día De Los Muertos, Thomas’s debut novel follows Yadriel, who is determined to prove himself a powerful brujo despite the gendered expectations of his traditional Latine family. He employs the help of two friends to perform a ritual that will help him find the ghost of his murdered cousin and set him free.\u003c/p\u003e\n\u003cp\u003eThis was a lot of fun while also being packed with so much interesting stuff about gender, about Brujería and how gendered it is, about family, and a sweet, humorous romance. \u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-witchery_s-isabelle%2F28936590%2F\" data-ean=\"9781338758962\" data-asin=\"1338758969\" data-title=\"The Witchery (The Witchery, Book 1)\" data-author=\"Isabelle, S.\" title=\"Buy from Thriftbooks\"\u003e\u003cimg decoding=\"async\" src=\"https://s2982.pcdn.co/wp-content/uploads/2024/09/the-witchery-book-cover.jpg.webp\" alt=\"the witchery book cover\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2024/09/the-witchery-book-cover.jpg.webp\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1338758969\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-witchery_s-isabelle%2F28936590%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"The Witchery (The Witchery, Book 1)\" data-publisher=\"Scholastic Press\" data-releasedate=\"2022-07-26\" data-author=\"Isabelle, S.\" data-ean=\"9781338758962\" data-asin=\"1338758969\"\u003eThe Witchery\u003c/a\u003e by S. Isabelle\u003c/h3\u003e\n\u003cdiv\u003e\n\u003cp\u003eBadass witches and dark magic set in a witch academy? Yes, please!\u003c/p\u003e\n\u003cp\u003eLogan is a new witch struggling with her powers and is taken under the tutelage of a death witch, a green witch, and a witch who is thirsty for more power. It won’t be long before Wolves rise up to attack humans and witches alike, but there isn’t a good alliance between humans and witches.\u003c/p\u003e\n\u003cp\u003eAll four of the student witches are going to have to band together to not only secure that alliance but to take down the Wolves who are hungry for blood.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fbrooms_jasmine-walls%2F38276476%2F\" data-ean=\"9781646142682\" data-asin=\"1646142683\" data-title=\"Brooms\" data-author=\"Walls, Jasmine\" title=\"Buy from Thriftbooks\"\u003e\u003cimg decoding=\"async\" src=\"https://s2982.pcdn.co/wp-content/uploads/2023/09/Brooms.jpeg.webp\" alt=\"book cover of Brooms by Jasmine Walls\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2023/09/Brooms.jpeg.webp\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1646142683\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fbrooms_jasmine-walls%2F38276476%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Brooms\" data-publisher=\"Levine Querido\" data-releasedate=\"2023-10-10\" data-author=\"Walls, Jasmine\" data-ean=\"9781646142682\" data-asin=\"1646142683\"\u003eBrooms\u003c/a\u003e by Jasmine Walls, illustrated by Teo DuVall\u003c/h3\u003e\n\u003cp\u003eThis one is pitched as \u003cem\u003eThe Fast and the Furious \u003c/em\u003ebut with broomsticks, and it follows a group of 6 diverse teens who participate in a forbidden broom race, which allows them to embrace their magic as witches. It’s set in 1930s Mississippi, giving the story of magic and witchcraft a historical spin.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fnot-good-for-maidens_tori-bovalino%2F28865718%2F\" data-ean=\"9781645674665\" data-asin=\"1645674665\" data-title=\"Not Good for Maidens\" data-author=\"Bovalino, Tori\" title=\"Buy from Thriftbooks\"\u003e\u003cimg decoding=\"async\" src=\"https://s2982.pcdn.co/wp-content/uploads/2022/08/not-good-for-maidens-book-cover.jpeg.webp\" alt=\"not good for maidens book cover\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%200%200\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2022/08/not-good-for-maidens-book-cover.jpeg.webp\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1645674665\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fnot-good-for-maidens_tori-bovalino%2F28865718%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Not Good for Maidens\" data-publisher=\"Page Street YA\" data-releasedate=\"2022-06-21\" data-author=\"Bovalino, Tori\" data-ean=\"9781645674665\" data-asin=\"1645674665\"\u003eNot Good for Maidens\u003c/a\u003e by Tori Bovalino\u003c/h3\u003e\n\u003cp\u003eLou’s disbelief in magic is shattered once she has to journey to the goblin market to rescue her teenage aunt. The market, which Lou had only read about up until now, is full of every kind of sweet, delectable thing that could tempt humans. She has to learn spells and tricks if she’s to save her aunt and make it out alive. She’s only got three days, though, and then the market disappears– and her aunt along with it.\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003eWant more? Then you’re in luck. Dive into these witchy queer YA titles, too:\u003c/p\u003e\u003cul\u003e\n\u003cli\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1536225266\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fall-our-hidden-gifts_caroline-odonoghue%2F26853958%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"All Our Hidden Gifts (The Gifts)\" data-publisher=\"Walker Books US\" data-releasedate=\"2022-05-03\" data-author=\"O\u0026#39;Donoghue, Caroline\" data-ean=\"9781536225266\" data-asin=\"1536225266\"\u003eAll Our Hidden Gifts\u003c/a\u003e by Caroline O’Donoghue\u003c/li\u003e\n\u003cli\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"006246504X\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fimprobable-magic-of-cynical-witches_kate-scelsa%2F27382576%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Improbable Magic for Cynical Witches\" data-publisher=\"Balzer + Bray\" data-releasedate=\"2023-05-30\" data-author=\"Scelsa, Kate\" data-ean=\"9780062465047\" data-asin=\"006246504X\"\u003eImprobable Magic for Cynical Witches\u003c/a\u003e by Kate Scelsa\u003c/li\u003e\n\u003cli\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1492623164\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Flabyrinth-lost_zoraida-crdova%2F11435725%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Labyrinth Lost (Brooklyn Brujas, 1)\" data-publisher=\"Sourcebooks Fire\" data-releasedate=\"2017-08-01\" data-author=\"Córdova, Zoraida\" data-ean=\"9781492623168\" data-asin=\"1492623164\"\u003eLabyrinth Lost\u003c/a\u003e by Zoraida Córdova\u003c/li\u003e\n\u003cli\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"B07L15C1RW\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-lost-coast%2F20121841%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"The Lost Coast\" data-publisher=\"Candlewick Press\" data-releasedate=\"2019-05-14\" data-author=\"Capetta, A. R.\" data-ean=\"\" data-asin=\"B07L15C1RW\"\u003eThe Lost Coast\u003c/a\u003e by A.R. Capetta\u003c/li\u003e\n\u003cli\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1536215899\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-mermaid-the-witch-and-the-sea_maggie-tokuda-hall%2F23241912%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"The Mermaid, the Witch, and the Sea\" data-publisher=\"Candlewick\" data-releasedate=\"2022-05-10\" data-author=\"Tokuda-Hall, Maggie\" data-ean=\"9781536215892\" data-asin=\"1536215899\"\u003eThe Mermaid, The Witch, and The Sea\u003c/a\u003e by Maggie Tokuda-Hall\u003c/li\u003e\n\u003cli\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1250821177\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-mirror-season_anna-marie-mclemore%2F26377244%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Mirror Season\" data-publisher=\"Square Fish\" data-releasedate=\"2022-03-08\" data-author=\"Mclemore, Anna-Marie\" data-ean=\"9781250821171\" data-asin=\"1250821177\"\u003eThe Mirror Season\u003c/a\u003e by Anna-Marie McLemore\u003c/li\u003e\n\u003cli\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"154930304X\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fmooncakes_suzanne--walker%2F26671550%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Mooncakes\" data-publisher=\"Oni Press\" data-releasedate=\"2019-10-15\" data-author=\"Walker, Suzanne\" data-ean=\"9781549303043\" data-asin=\"154930304X\"\u003eMooncakes\u003c/a\u003e by Suzanne Walker and Wendy Xu\u003c/li\u003e\n\u003cli\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"0593813979\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fpractical-rules-for-cursed-witches%2F52050714%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Practical Rules for Cursed Witches\" data-publisher=\"Delacorte Press\" data-releasedate=\"2024-08-27\" data-author=\"Cottingham, Kayla\" data-ean=\"9780593813973\" data-asin=\"0593813979\"\u003ePractical Rules for Cursed Witches\u003c/a\u003e by Kayla Cottingham\u003c/li\u003e\n\u003cli\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"0451480341\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthese-witches-dont-burn_isabel-sterling%2F19682328%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"These Witches Don\u0026#39;t Burn\" data-publisher=\"Razorbill\" data-releasedate=\"2020-04-28\" data-author=\"Sterling, Isabel\" data-ean=\"9780451480347\" data-asin=\"0451480341\"\u003eThese Witches Don’t Burn\u003c/a\u003e by Isabel Sterling\u003c/li\u003e\n\u003cli\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1534432884\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fwhen-we-were-magic_sarah-gailey%2F22361613%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"When We Were Magic (Bestselling Teen Fiction)\" data-publisher=\"Simon \u0026amp; Schuster Books for Young Readers\" data-releasedate=\"2021-06-01\" data-author=\"Gailey, Sarah\" data-ean=\"9781534432888\" data-asin=\"1534432884\"\u003eWhen We Were Magic\u003c/a\u003e by Sarah Gailey\u003c/li\u003e\n\u003cli\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1335425845\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-witch-king_he-edgmon%2F26823431%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"The Witch King (The Witch King Duology, 1)\" data-publisher=\"Inkyard Press\" data-releasedate=\"2022-04-19\" data-author=\"Edgmon, H.E.\" data-ean=\"9781335425843\" data-asin=\"1335425845\"\u003eThe Witch King\u003c/a\u003e by H.E. Edgmon\u003c/li\u003e\n\u003cli\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"0593119991\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fwitchlight_jessi-zabarsky%2F20320831%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Witchlight: (A Graphic Novel)\" data-publisher=\"Random House Graphic\" data-releasedate=\"2020-04-14\" data-author=\"Zabarsky, Jessi\" data-ean=\"9780593119990\" data-asin=\"0593119991\"\u003eWitchlight\u003c/a\u003e by Jessi Zabarsky\u003c/li\u003e\n\u003c/ul\u003e\u003chr/\u003e\n\u003c/div\u003e\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-10-24T18:15:27Z",
  "modifiedTime": "2024-10-24T18:15:36Z"
}
