{
  "id": "9e4e7a50-5ac3-4b48-905d-a1c9ef0d47a7",
  "title": "Interview with Amy van Rijthoven, Author of Shadows and Black in the Light",
  "link": "https://www.newinbooks.com/interview-with-amy-van-rijthoven-author-of-shadows-and-black-in-the-light/",
  "description": "Sign up for our email and we’ll send you the best new books in your favorite genres weekly. The post Interview with Amy van Rijthoven, Author of Shadows and Black in the Light appeared first on NewInBooks.",
  "author": "zaida",
  "published": "Wed, 25 Jun 2025 14:23:25 +0000",
  "source": "https://www.newinbooks.com/feed/",
  "categories": [
    "Author Interviews",
    "eBook",
    "Fantasy \u0026 Science Fiction",
    "News"
  ],
  "byline": "zaida",
  "length": 3001,
  "excerpt": "Sign up for our email and we’ll send you the best new books in your favorite genres weekly. Share this:Click to email this to a friend (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on Pinterest... Read More",
  "siteName": "NewInBooks",
  "favicon": "",
  "text": "What’s the story behind the story? What inspired you to write Shadows and Black in the Light? Similar to Millie, I’m a bit of a daydreamer. Like little movie scenes playing in my head, ideas would come to me that I had to piece together. Sometimes I would just get the title of a chapter and then have to work around that. The first snippet came to me many years ago when I was 19 or 20. It was Millie in the car with a stranger on the way to his place with rows of flowers in the distance that I knew were to be used for drugs. I wrote it all down and thought nothing of it. Then, many years later, I picked it up again and just couldn’t stop writing until I had completed a whole book. If you had to pick theme songs for the main characters of Shadows and Black in the Light, what would they be? Here is a personal playlist of mine with songs that I feel relate in some way to my book, including the four already mentioned within it. Cemetery-Coin, Searching for the Light-VHS Collection, Ordinary Human-One Republic, I’m in Love with Everybody- Laureline, Parallell Universe-Transviolet, Dare You to Move-Switchfoot, Wate of Emotion-ELIO, In My Head-Aaron Taos Carter Ace, Ok-The Runaway Club, Jump Into the Fog-The Wombats, Power and Passion-Midnight Oil, Ride This Feeling-Kate Miller-Heideke, The Nosebleed Section-Hilltop Hoods. What’s your favorite genre to read? Is it the same as your favorite genre to write? My favourite genre is anything supernatural or paranormal. Though even as a 35-year-old adult, I’ve only really read young adult fantasies. Anything with angels or mystical beings also really intrigues me. What books are on your TBR pile right now? Mostly new age and self-help books. We need your art. Words that hurt, words that heal, and Think Like a Monk by Jay Shetty are amongst them. What scene in your book was your favorite to write? Smoke in mirrors. My dad helped me a little with this one. He gave me his ideas on how to perform a high-speed car chase that I mixed with my own. Then he said something about watching the smoke in the rear-view mirror, and I said, “Dad, you’re a genius.” After that, it all came out so quickly, and I realise there are pacing issues with my book, but I just had to get it out. Do you have any quirky writing habits? (lucky mugs, cats on laps, etc.) I like to sit in my egg chair upstairs by the window. I feel like there’s a great channel of energy there above me, to write. Do you have a motto, quote, or philosophy you live by? I like ” never regret anything because at the time it was exactly what you wanted. If you could choose one thing for readers to remember after reading your book, what would it be? I feel like I can have two because I had two narratives going on. One is that through questioning the reality of the story, readers also stop to question the reality we exist in. The other is live for the moment. Don’t think, just do. Sign up for our email and we’ll send you the best new books in your favorite genres weekly.",
  "image": "https://www.newinbooks.com/wp-content/uploads/sites/9/2025/06/taty-1.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s the story behind the story? What inspired you to write \u003ca href=\"https://www.amazon.com/dp/B0FB3L88ZY?tag=newinbooks-20\"\u003eShadows and Black in the Light\u003c/a\u003e\u003cstrong\u003e?\u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSimilar to Millie, I’m a bit of a daydreamer. Like little movie scenes playing in my head, ideas would come to me that I had to piece together. Sometimes I would just get the title of a chapter and then have to work around that. The first snippet came to me many years ago when I was 19 or 20. It was Millie in the car with a stranger on the way to his place with rows of flowers in the distance that I knew were to be used for drugs. I wrote it all down and thought nothing of it. Then, many years later, I picked it up again and just couldn’t stop writing until I had completed a whole book.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIf you had to pick theme songs for the main characters of \u003ca href=\"https://www.amazon.com/dp/B0FB3L88ZY?tag=newinbooks-20\"\u003eShadows and Black in the Light\u003c/a\u003e,\u003cstrong\u003e what would they be?\u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHere is a personal playlist of mine with songs that I feel relate in some way to my book, including the four already mentioned within it. Cemetery-Coin, Searching for the Light-VHS Collection, Ordinary Human-One Republic, I’m in Love with Everybody- Laureline, Parallell Universe-Transviolet, Dare You to Move-Switchfoot, Wate of Emotion-ELIO, In My Head-Aaron Taos Carter Ace, Ok-The Runaway Club, Jump Into the Fog-The Wombats, Power and Passion-Midnight Oil, Ride This Feeling-Kate Miller-Heideke, The Nosebleed Section-Hilltop Hoods.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s your favorite genre to read? Is it the same as your favorite genre to write?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMy favourite genre is anything supernatural or paranormal. Though even as a 35-year-old adult, I’ve only really read young adult fantasies. Anything with angels or mystical beings also really intrigues me.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat books are on your TBR pile right now?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMostly new age and self-help books. We need your art. Words that hurt, words that heal, and Think Like a Monk by Jay Shetty are amongst them.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat scene in your book was your favorite to write?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSmoke in mirrors. My dad helped me a little with this one. He gave me his ideas on how to perform a high-speed car chase that I mixed with my own. Then he said something about watching the smoke in the rear-view mirror, and I said, “Dad, you’re a genius.” After that, it all came out so quickly, and I realise there are pacing issues with my book, but I just had to get it out.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDo you have any quirky writing habits? (lucky mugs, cats on laps, etc.)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI like to sit in my egg chair upstairs by the window. I feel like there’s a great channel of energy there above me, to write.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDo you have a motto, quote, or philosophy you live by?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI like ” never regret anything because at the time it was exactly what you wanted.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIf you could choose one thing for readers to remember after reading your book, what would it be?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI feel like I can have two because I had two narratives going on. One is that through questioning the reality of the story, readers also stop to question the reality we exist in. The other is live for the moment. Don’t think, just do.\u003c/p\u003e\n\n\u003c/div\u003e\u003cp\u003e\u003ca href=\"https://www.newinbooks.com/email-signup-2/\"\u003e\u003ci\u003e\u003cspan\u003eSign up for our email\u003c/span\u003e\u003c/i\u003e\u003c/a\u003e\u003ci\u003e\u003cspan\u003e and we’ll send you the best new books in your favorite genres weekly.\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-25T10:23:25-04:00",
  "modifiedTime": "2025-06-25T14:23:25Z"
}
