{
  "id": "afefaf60-52ed-429d-a3a9-6dac9394f3a2",
  "title": "THE OUTCAST",
  "link": "https://www.kirkusreviews.com/book-reviews/dl-whipple/the-outcast-3/",
  "description": "In 1963, Danny Prescott is an ordinary 16-year-old boy in Banning, Iowa, who is unaccustomed to being noticed by the likes of Brent Arrington, a star high school football player and the “closest thing Banning had to a celebrity.” So Danny, who is also on the football team, is surprised when Brent asks him for a ride to the home of Loretta Tinsley, a 13-year-old girl in junior high. While there, Brent and Loretta disappear into a hay loft, where Brent rapes her and casually emerges unperturbed by her anguished cries, grotesquely satisfied by his conquest. Danny does nothing to help her and even gives Brent a ride back to town. Danny quickly becomes emotionally overwhelmed by his cowardly inaction, which finally leaves him “shimmering with shame and humiliation,” an ignominy sensitively depicted by Whipple. Loretta presses charges, and Brent is arrested for rape while Danny is considered an accessory to the assault. Danny desperately wants to atone for his part in Loretta’s agony, especially after she attempts suicide, and tells the truth about what he saw. He even pines to testify against Brent. But Danny becomes the town pariah—some hate him because he won’t defend Brent, who makes a state football championship possible, and others because they see him as the star athlete’s accomplice. The school’s principal, Mr. Larson, tries to expel Danny, and local mothers take up a petition to remove him from school. Coach Esker discourages Danny from continuing to play football, and many of his teammates, Brent’s “loyalists,” shun him. Even worse, Brent assaults him brutally and threatens to kill him if he doesn’t keep his mouth shut. Whipple’s moral drama is layered with complexity—the Prescotts have a long and fraught relationship with the Arringtons. This is especially impressive given the ordinariness of this town—Danny calls it a “grease spot on an Iowa map”—which serves as a perfect stage for the story, a small place that gives birth to big sins. At the heart of the novel is a delicately portrayed maturation of Danny—this unassuming virgin who longs to escape the aching provinciality of his life is compelled to grow up fast and ask himself hard questions about what it means to be a man. Whipple’s writing is generally poetically unembellished, but its plainness is the source of its gathering power, and it brings into sharp relief the averageness of those who participate in this moral contest. Here, Loretta’s father, Evert, confronts Danny regarding his responsibility for her rape: “Why didn’t you help my little girl? They say you’re a good kid. Why didn’t you help her when she cried out?…Why would someone she considered a friend…bring a monster to our farm?” This is an absorbing look into the ways even the most ordinary human beings can suddenly become key players in a terrible drama.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "by Kristin Hannah",
  "length": 3545,
  "excerpt": "In this novel, a teenage boy fails to stop a rape committed by a high school football star and becomes locked within the legal and moral drama that ensues.",
  "siteName": "Kirkus Reviews",
  "favicon": "https://d1fd687oe6a92y.cloudfront.net/img/kir_images/header/apple-icon.png",
  "text": "THE WEDDING PEOPLE by Alison Espach ‧ RELEASE DATE: July 30, 2024 Uneven but fitfully amusing. Betrayed by her husband, a severely depressed young woman gets drawn into the over-the-top festivities at a lavish wedding. Phoebe Stone, who teaches English literature at a St. Louis college, is plotting her own demise. Her husband, Matt, has left her for another woman, and Phoebe is taking it hard. Indeed, she's determined just where and how she will end it all: at an oceanfront hotel in Newport, where she will lie on a king-sized canopy bed and take a bottle of her cat’s painkillers. At the hotel, Phoebe meets bride-to-be Lila, a headstrong rich girl presiding over her own extravagant six-day wedding celebration. Lila thought she had booked every room in the hotel, and learning of Phoebe's suicidal intentions, she forbids this stray guest from disrupting the nuptials: “No. You definitely can’t kill yourself. This is my wedding week.” After the punchy opening, a grim flashback to the meltdown of Phoebe's marriage temporarily darkens the mood, but things pick up when spoiled Lila interrupts Phoebe's preparations and sweeps her up in the wedding juggernaut. The slide from earnest drama to broad farce is somewhat jarring, but from this point on, Espach crafts an enjoyable—if overstuffed—comedy of manners. When the original maid of honor drops out, Phoebe is persuaded, against her better judgment, to take her place. There’s some fun to be had here: The wedding party—including groom-to-be Gary, a widower, and his 11-year-old daughter—takes surfing lessons; the women in the group have a session with a Sex Woman. But it all goes on too long, and the humor can seem forced, reaching a low point when someone has sex with the vintage wedding car (you don’t want to know the details). Later, when two characters have a meet-cute in a hot tub, readers will guess exactly how the marriage plot resolves. Uneven but fitfully amusing. Pub Date: July 30, 2024 ISBN: 9781250899576 Page Count: 384 Publisher: Henry Holt Review Posted Online: Sept. 13, 2024",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/c83e7b4fa5c946aebba45fc8856b1892/7a0848405e344b099130f635d64a3a64.jpeg.300x0_q85_autocrop.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eTHE WEDDING PEOPLE\u003c/h2\u003e\n                                \n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/alison-espach/\"\u003e\n                            Alison Espach\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: July 30, 2024\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    Uneven but fitfully amusing.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eBetrayed by her husband, a severely depressed young woman gets drawn into the over-the-top festivities at a lavish wedding. \u003c/p\u003e\n                                        \u003cp\u003ePhoebe Stone, who teaches English literature at a St. Louis college, is plotting her own demise. Her husband, Matt, has left her for another woman, and Phoebe is taking it hard. Indeed, she\u0026#39;s determined just where and how she will end it all: at an oceanfront hotel in Newport, where she will lie on a king-sized canopy bed and take a bottle of her cat’s painkillers. At the hotel, Phoebe meets bride-to-be Lila, a headstrong rich girl presiding over her own extravagant six-day wedding celebration. Lila thought she had booked every room in the hotel, and learning of Phoebe\u0026#39;s suicidal intentions, she forbids this stray guest from disrupting the nuptials: “No. You definitely can’t kill yourself. This is my \u003ci\u003ewedding \u003c/i\u003eweek.” After the punchy opening, a grim flashback to the meltdown of Phoebe\u0026#39;s marriage temporarily darkens the mood, but things pick up when spoiled Lila interrupts Phoebe\u0026#39;s preparations and sweeps her up in the wedding juggernaut. The slide from earnest drama to broad farce is somewhat jarring, but from this point on, Espach crafts an enjoyable—if overstuffed—comedy of manners. When the original maid of honor drops out, Phoebe is persuaded, against her better judgment, to take her place. There’s some fun to be had here: The wedding party—including groom-to-be Gary, a widower, and his 11-year-old daughter—takes surfing lessons; the women in the group have a session with a Sex Woman. But it all goes on too long, and the humor can seem forced, reaching a low point when someone has sex with the vintage wedding car (you don’t want to know the details). Later, when two characters have a meet-cute in a hot tub, readers will guess exactly how the marriage plot resolves.\u003c/p\u003e\u003cp\u003e\n                                        Uneven but fitfully amusing.\n                                        \n                                        \n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e July 30, 2024\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 9781250899576\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 384\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Henry Holt\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e Sept. 13, 2024\u003c/p\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
