{
  "id": "d5c7d0dc-5d02-4eba-b840-2cb33d2b89cb",
  "title": "THE LITTLE LOST LIBRARY",
  "link": "https://www.kirkusreviews.com/book-reviews/ellery-adams/the-little-lost-library/",
  "description": "As the owner of Miracle Books, Nora Pennington occasionally offers shop-at-home services to her customers. In Lucille Wynter’s case, she takes it a step further, bringing books to the reclusive woman and sitting with her in her sparsely furnished “boot room,” where they share tea and Lorna Doones. When Lucille fails to appear one day, a worried Nora calls her, only to hear a faint “Help me. Please!” from Lucille’s landline. Following the instructions her boyfriend, Sheriff Grant McCabe, once gave her for kicking a door in, Nora breaks in, only to find Lucille dead and Wynter House filled floor to ceiling with rotting food, trash, and books, books, books. Lucille has left Nora a letter thanking her for her visits and entrusting her with a special book written by Lucille’s father, Hugo Wynter. The volume contains a woodblock engraving of a set of bookshelves and a poem about a little lost library. Each verse contains cryptic clues that Nora hopes will help her figure out how Lucille could have lost a library and perhaps even help Nora find it. Lucille’s children, Harper, Beck, and Clem, commission Nora’s friend Bea, an antique dealer, to help clear out their mother’s house, and Nora uses the time while Bea is decluttering to follow the clues in the poem. In the meantime, McCabe tells her that Lucille wasn’t killed in a fall but was strangled. Nora's search for the lost library and her quest to find Lucille’s killer intersect, but chance plays as great a role as sleuthing in their solution. The grim ending reveals a sad history that strips all the joy from Nora’s efforts.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "by Ellery Adams",
  "length": 3923,
  "excerpt": "A bookseller searches for a hidden treasure trove of books",
  "siteName": "Kirkus Reviews",
  "favicon": "https://d1fd687oe6a92y.cloudfront.net/img/kir_images/header/apple-icon.png",
  "text": "A CONSPIRACY OF BONES by Kathy Reichs ‧ RELEASE DATE: March 17, 2020 Forget about solving all these crimes; the signal triumph here is (spoiler) the heroine’s survival. Another sweltering month in Charlotte, another boatload of mysteries past and present for overworked, overstressed forensic anthropologist Temperance Brennan. A week after the night she chases but fails to catch a mysterious trespasser outside her town house, some unknown party texts Tempe four images of a corpse that looks as if it’s been chewed by wild hogs, because it has been. Showboat Medical Examiner Margot Heavner makes it clear that, breaking with her department’s earlier practice (The Bone Collection, 2016, etc.), she has no intention of calling in Tempe as a consultant and promptly identifies the faceless body herself as that of a young Asian man. Nettled by several errors in Heavner’s analysis, and even more by her willingness to share the gory details at a press conference, Tempe launches her own investigation, which is not so much off the books as against the books. Heavner isn’t exactly mollified when Tempe, aided by retired police detective Skinny Slidell and a host of experts, puts a name to the dead man. But the hints of other crimes Tempe’s identification uncovers, particularly crimes against children, spur her on to redouble her efforts despite the new M.E.’s splenetic outbursts. Before he died, it seems, Felix Vodyanov was linked to a passenger ferry that sank in 1994, an even earlier U.S. government project to research biological agents that could control human behavior, the hinky spiritual retreat Sparkling Waters, the dark web site DeepUnder, and the disappearances of at least four schoolchildren, two of whom have also turned up dead. And why on earth was Vodyanov carrying Tempe’s own contact information? The mounting evidence of ever more and ever worse skulduggery will pull Tempe deeper and deeper down what even she sees as a rabbit hole before she confronts a ringleader implicated in “Drugs. Fraud. Breaking and entering. Arson. Kidnapping. How does attempted murder sound?” Forget about solving all these crimes; the signal triumph here is (spoiler) the heroine’s survival. Pub Date: March 17, 2020 ISBN: 978-1-9821-3888-2 Page Count: 352 Publisher: Scribner Review Posted Online: Dec. 22, 2019 Kirkus Reviews Issue: Jan. 15, 2020",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/620377a10ef141e4a897770b7bf1bbca/dd1a4098e89240c8900bd93811299fed.jpg.300x0_q85_autocrop.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eA CONSPIRACY OF BONES\u003c/h2\u003e\n                                \n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/kathy-reichs/\"\u003e\n                            Kathy Reichs\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: March 17, 2020\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    Forget about solving all these crimes; the signal triumph here is (spoiler) the heroine’s survival.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eAnother sweltering month in Charlotte, another boatload of mysteries past and present for overworked, overstressed forensic anthropologist Temperance Brennan. \u003c/p\u003e\n                                        \u003cp\u003eA week after the night she chases but fails to catch a mysterious trespasser outside her town house, some unknown party texts Tempe four images of a corpse that looks as if it’s been chewed by wild hogs, because it has been. Showboat Medical Examiner Margot Heavner makes it clear that, breaking with her department’s earlier practice (\u003ci\u003eThe Bone Collection\u003c/i\u003e, 2016, etc.), she has no intention of calling in Tempe as a consultant and promptly identifies the faceless body herself as that of a young Asian man. Nettled by several errors in Heavner’s analysis, and even more by her willingness to share the gory details at a press conference, Tempe launches her own investigation, which is not so much off the books as against the books. Heavner isn’t exactly mollified when Tempe, aided by retired police detective Skinny Slidell and a host of experts, puts a name to the dead man. But the hints of other crimes Tempe’s identification uncovers, particularly crimes against children, spur her on to redouble her efforts despite the new M.E.’s splenetic outbursts. Before he died, it seems, Felix Vodyanov was linked to a passenger ferry that sank in 1994, an even earlier U.S. government project to research biological agents that could control human behavior, the hinky spiritual retreat Sparkling Waters, the dark web site DeepUnder, and the disappearances of at least four schoolchildren, two of whom have also turned up dead. And why on earth was Vodyanov carrying Tempe’s own contact information? The mounting evidence of ever more and ever worse skulduggery will pull Tempe deeper and deeper down what even she sees as a rabbit hole before she confronts a ringleader implicated in “Drugs. Fraud. Breaking and entering. Arson. Kidnapping. How does attempted murder sound?” \u003c/p\u003e\u003cp\u003e\n                                        Forget about solving all these crimes; the signal triumph here is (spoiler) the heroine’s survival.\n                                        \n                                        \n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e March 17, 2020\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 978-1-9821-3888-2\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 352\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Scribner\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e Dec. 22, 2019\u003c/p\u003e\n                                         \u003cp\u003e\u003cb\u003eKirkus Reviews Issue:\u003c/b\u003e Jan. 15, 2020\u003c/p\u003e\n                                    \u003c/div\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
