{
  "id": "e67f9b72-4b1d-405c-a39d-62e2926bc16c",
  "title": "THE HIGH SEAS SAVE",
  "link": "https://www.kirkusreviews.com/book-reviews/jon-upton/the-high-seas-save-beast-savers-vol-1/",
  "description": "Wren Goldsmith is a 12-year-old Beast Saver whose mission is to protect Beasts in need with the help of a Companion Beast named Tolstoy—a doglike creature who can change size at will and has fur that functions as armor. Wren is confident, skilled, quick-thinking, and eager to prove his abilities as a new Saver. The plot revolves around Wren and Tolstoy’s mission to the Pomm Islands, where formerly peaceful Beasts are going on rampages. The cause of the unrest seems to be parasites infecting the creatures, which drive them to violence. Wren must subdue a massive Beast called a coral cow, which is ordinarily a caretaker of the coral reefs. Later, the tween encounters twins Maxie and Vega, who are part of a mysterious group known as the Scavengers; they work for a larger, unknown entity that’s likely involved in illegal activity. Wren, Tolstoy, and their ally, Lieutenant Tang, investigate as they aim to restore order to the islands; however, the mystery behind who’s responsible for the chaos remains unsolved, hinting at future adventures. Overall, Upton’s story is marked by energetic pacing and action-driven plot development, and it feels well-suited for its target audience of young readers. The characterization leans heavily on familiar archetypes, with Wren as the brave hero, Tolstoy as the loyal sidekick, and the bickering twin antagonists, who embody their roles with lines such as “It’s so unfair. Just because you were born two minutes early—” The characters’ relationships are central to the narrative, and the author highlights trust and teamwork throughout. Upton’s prose style is simple yet vivid, with imaginative descriptions of Beasts and dynamic action scenes, and the dialogue snappily propels the plot forward.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "",
  "length": 4039,
  "excerpt": "Upton’s middle-grade series-starter takes place in a complex world of powerful, mysterious creatures.",
  "siteName": "Kirkus Reviews",
  "favicon": "https://d1fd687oe6a92y.cloudfront.net/img/kir_images/header/apple-icon.png",
  "text": "CAPTAIN UNDERPANTS AND THE TERRIFYING RETURN OF TIPPY TINKLETROUSERS From the Captain Underpants series , Vol. 9 by Dav Pilkey \u0026 illustrated by Dav Pilkey ‧ RELEASE DATE: Aug. 28, 2012 Is this the end? Well, no…the series will stagger on through at least one more scheduled sequel. Sure signs that the creative wells are running dry at last, the Captain’s ninth, overstuffed outing both recycles a villain (see Book 4) and offers trendy anti-bullying wish fulfillment. Not that there aren’t pranks and envelope-pushing quips aplenty. To start, in an alternate ending to the previous episode, Principal Krupp ends up in prison (“…a lot like being a student at Jerome Horwitz Elementary School, except that the prison had better funding”). There, he witnesses fellow inmate Tippy Tinkletrousers (aka Professor Poopypants) escape in a giant Robo-Suit (later reduced to time-traveling trousers). The villain sets off after George and Harold, who are in juvie (“not much different from our old school…except that they have library books here.”). Cut to five years previous, in a prequel to the whole series. George and Harold link up in kindergarten to reduce a quartet of vicious bullies to giggling insanity with a relentless series of pranks involving shaving cream, spiders, effeminate spoof text messages and friendship bracelets. Pilkey tucks both topical jokes and bathroom humor into the cartoon art, and ups the narrative’s lexical ante with terms like “pharmaceuticals” and “theatrical flair.” Unfortunately, the bullies’ sad fates force Krupp to resign, so he’s not around to save the Earth from being destroyed later on by Talking Toilets and other invaders… Is this the end? Well, no…the series will stagger on through at least one more scheduled sequel. (Fantasy. 10-12) Pub Date: Aug. 28, 2012 ISBN: 978-0-545-17534-0 Page Count: 304 Publisher: Scholastic Review Posted Online: June 19, 2012 Kirkus Reviews Issue: July 15, 2012",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/e1d43d252bae41f2893f65baeb550192/8134cda5f66043b4a2f27588c5aff392.jpeg.300x0_q85_autocrop.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eCAPTAIN UNDERPANTS AND THE TERRIFYING RETURN OF TIPPY TINKLETROUSERS\u003c/h2\u003e\n                                \n                                \n                                    \u003ca href=\"https://www.kirkusreviews.com/book-series/captain-underpants/\"\u003e\n                                        \u003ch2\u003e\n                                            From the Captain Underpants series\n                                            \n                                                , Vol. 9\n                                            \n                                        \u003c/h2\u003e\n                                    \u003c/a\u003e\n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/dav-pilkey/\"\u003e\n                            Dav Pilkey\n                        \u003c/a\u003e\n                \n            \n                \n                     \u0026amp; \n                    illustrated by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/dav-pilkey/\"\u003e\n                            Dav Pilkey\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: Aug. 28, 2012\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    Is this the end? Well, no…the series will stagger on through at least one more scheduled sequel.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eSure signs that the creative wells are running dry at last, the Captain’s ninth, overstuffed outing both recycles a villain (see Book 4) and offers trendy anti-bullying wish fulfillment.\u003c/p\u003e\n                                        \u003cp\u003eNot that there aren’t pranks and envelope-pushing quips aplenty. To start, in an alternate ending to the previous episode, Principal Krupp ends up in prison (“…a lot like being a student at Jerome Horwitz Elementary School, except that the prison had better funding”). There, he witnesses fellow inmate Tippy Tinkletrousers (aka Professor Poopypants) escape in a giant Robo-Suit (later reduced to time-traveling trousers). The villain sets off after George and Harold, who are in juvie (“not much different from our old school…except that they have library books here.”). Cut to five years previous, in a prequel to the whole series. George and Harold link up in kindergarten to reduce a quartet of vicious bullies to giggling insanity with a relentless series of pranks involving shaving cream, spiders, effeminate spoof text messages and friendship bracelets. Pilkey tucks both topical jokes and bathroom humor into the cartoon art, and ups the narrative’s lexical ante with terms like “pharmaceuticals” and “theatrical flair.” Unfortunately, the bullies’ sad fates force Krupp to resign, so he’s not around to save the Earth from being destroyed later on by Talking Toilets and other invaders…\u003c/p\u003e\u003cp\u003e\n                                        Is this the end? Well, no…the series will stagger on through at least one more scheduled sequel. \n                                        \n                                        \u003cem\u003e(Fantasy. 10-12)\u003c/em\u003e\n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e Aug. 28, 2012\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 978-0-545-17534-0\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 304\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Scholastic\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e June 19, 2012\u003c/p\u003e\n                                         \u003cp\u003e\u003cb\u003eKirkus Reviews Issue:\u003c/b\u003e July 15, 2012\u003c/p\u003e\n                                    \u003c/div\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
