{
  "id": "f4328c69-28db-4abd-8a8c-e9414b2e3323",
  "title": "Book of the month: Saud Alsanousi",
  "link": "https://ayearofreadingtheworld.com/2024/04/30/book-of-the-month-saud-alsanousi/",
  "description": "Back in 2012, when I tried to source and read a book from every country in the world, Kuwait was one of the trickier entries on my list. There were very few traditionally published titles available in English translation. I ended up reading a self-published novel by the hit blogger Danderma, which proved an education […]",
  "author": "Ann Morgan",
  "published": "Tue, 30 Apr 2024 11:19:05 +0000",
  "source": "https://ayearofreadingtheworld.com/feed/",
  "categories": [
    "Book of the month",
    "Middle East",
    "The stories",
    "Arabic",
    "book review",
    "books",
    "culture",
    "italicisation",
    "Kuwait",
    "Saud Alsanousi",
    "translation"
  ],
  "byline": "By Ann Morgan",
  "length": 5186,
  "excerpt": "Back in 2012, when I tried to source and read a book from every country in the world, Kuwait was one of the trickier entries on my list. There were very few traditionally published titles available…",
  "siteName": "A year of reading the world",
  "favicon": "https://s0.wp.com/i/webclip.png",
  "text": "Back in 2012, when I tried to source and read a book from every country in the world, Kuwait was one of the trickier entries on my list. There were very few traditionally published titles available in English translation. I ended up reading a self-published novel by the hit blogger Danderma, which proved an education in Arabish (Arabic words written informally in the Latin alphabet, usually on computers or mobile phones that do not support Arabic script) and the craze for frozen yoghurt sweeping the country at the time. Indeed, Danderma was very helpful to me and shared some fascinating insights into the challenges facing writers in Kuwait, some of which I related in my first book, Reading the World. Knowing that there had to be many other interesting Kuwaiti writers whose work hadn’t yet made it into the world’s most published language, I resolved to revisit the country’s stories. Twelve years later, I’m back, thanks to a tip-off from translator Sawad Hussain, who responded to my call for books published pre-2020 that deserved a second look, as part of my year of reading nothing new. Hussain’s translation of Saud Alsanousi’s Mama Hissa’s Mice follows the (mis)fortunes of Katkout, Fahd and Sadiq, three friends growing up in Surra, central Kuwait, during the late-twentieth and early-twenty-first century. Coming from different sects and ethnic backgrounds, the young men share little but their fury and frustration at the divisions that compound the destruction wrought in the wake of the Iraqi invasion. In an attempt to overcome this, they form a group, Fuada’s Kids, which aims to bind Kuwaitis together by appealing to their nostalgia, but in so doing risks costing them everything. Disorientation is at the heart of this novel. The narrative, like the central characters’ world, is fractured and splintered, reflecting the feeling that ‘it’s as if an enormous fist has plowed into Kuwait, leaving it in ruins’. The present-day, adult reality is intercut with flashbacks and with chapters from an autobiographical novel, some of the of which have been removed to placate the government censors. Indeed, censorship is another key theme. Growing up, the boys learn that questions can be dangerous. Seemingly innocuous issues such as how someone pronounces a word or the spelling of certain names can crack open rifts and even invite physical violence. Small wonder, then, that self-censorship and sanitization flow through many of the conversations, because, as Fahd’s grandmother Mama Hissa is fond of observing, ‘all cowards stay safe.’ For English-language readers, there is an extra level of challenge. The unease and self-questioning that the story prompts with its challenging structure and courting of the unsayable is compounded with cultural disorientation. It is often unclear how certain statements should be read. We can’t know the significance of certain jokes – or whether some phrases are meant as jokes at all. The childhood memory of the boys pretending to be Palestinians throwing stones at Jews, for example. Is this said ironically, or bitterly? Would this be shocking in this society or unquestioned? And how ought we to respond? There are also a large number of unfamiliar cultural terms in the text. Hussain does an elegant job of elucidating key elements but refuses to patronise or pamper readers by over-explaining. The terms are left Roman rather than italicised – a reminder that it is we, rather than the world of the story, who are foreign. (For more on the politics of italicisation, check out Daniel José Older’s YouTube video ‘Why We Don’t Italicize Spanish’ below.) But there are also moments of powerful connection. From Alsanousi’s skilful marshalling of the child’s-eye view to reveal the strangeness of behaviours adults take for granted, to his intense, visceral presentation of moments of fear and suffering, and from the way he builds nostalgia to his layering of action so that we grow to remember events as the central characters’ do, this novel reaches out and grasps us. It also showed me my own world through new eyes. A Londoner born and bred, I had long been in the habit of looking askance at the overseas investors who own empty properties in many of the capital’s most desirable postcodes. Reading Mama Hissa’s Mice made me consider the question from another angle: when you live with the threat of invasion and societal collapse, ‘foreign houses are assets for when something happens’. Wouldn’t many of us make similar choices if we had experienced such things? This was a difficult read. But as a result it was also surprising one. An enriching one. A challenging one. It required me to sit with not-knowing in the same way that Shalash the Iraqi did – accepting my limitations and recognising that this is not a story that can or should centre my knowledge or perspective as so many of the books produced by the anglophone publishing industry do. I’m very glad to have had the chance to experience it. Mama Hissa’s Mice by Saud Alsanousi, translated from the Arabic by Sawad Hussain (Amazon Crossing, 2019) Picture: NASA Astronauts, Public domain, via Wikimedia Commons",
  "image": "https://ayearofreadingtheworld.com/wp-content/uploads/2024/04/image.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\u003cfigure\u003e\u003ca href=\"https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/04/image.png?ssl=1\"\u003e\u003cimg data-recalc-dims=\"1\" fetchpriority=\"high\" decoding=\"async\" width=\"550\" height=\"376\" data-attachment-id=\"7565\" data-permalink=\"https://ayearofreadingtheworld.com/2024/04/30/book-of-the-month-saud-alsanousi/image-7/\" data-orig-file=\"https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/04/image.png?fit=640%2C438\u0026amp;ssl=1\" data-orig-size=\"640,438\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"image\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/04/image.png?fit=300%2C205\u0026amp;ssl=1\" data-large-file=\"https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/04/image.png?fit=550%2C376\u0026amp;ssl=1\" tabindex=\"0\" role=\"button\" src=\"https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/04/image.png?resize=550%2C376\u0026amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/04/image.png?w=640\u0026amp;ssl=1 640w, https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/04/image.png?resize=300%2C205\u0026amp;ssl=1 300w\" sizes=\"(max-width: 550px) 100vw, 550px\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eBack in 2012, when I tried to source and read a book from every country in the world, Kuwait was one of the trickier entries on my list. There were very few traditionally published titles available in English translation. I ended up reading a \u003ca href=\"https://ayearofreadingtheworld.com/2012/12/19/kuwait-the-icing-on-the-cake/\"\u003eself-published novel\u003c/a\u003e by the hit blogger Danderma, which proved an education in Arabish (Arabic words written informally in the Latin alphabet, usually on computers or mobile phones that do not support Arabic script) and the craze for frozen yoghurt sweeping the country at the time. Indeed, Danderma was very helpful to me and shared some fascinating insights into the challenges facing writers in Kuwait, some of which I related in my first book, \u003cem\u003eReading the World\u003c/em\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003eKnowing that there had to be many other interesting Kuwaiti writers whose work hadn’t yet made it into the world’s most published language, I resolved to revisit the country’s stories. Twelve years later, I’m back, thanks to a tip-off from translator Sawad Hussain, who responded to my call for books published pre-2020 that deserved a second look, as part of my \u003ca href=\"https://ayearofreadingtheworld.com/2024/01/20/2024-my-year-of-reading-nothing-new/\"\u003eyear of reading nothing new\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eHussain’s translation of Saud Alsanousi’s \u003cem\u003e\u003ca href=\"https://www.amazon.com/Mama-Hissas-Mice-Saud-Alsanousi/dp/154204216X\"\u003eMama Hissa’s Mice\u003c/a\u003e\u003c/em\u003e follows the (mis)fortunes of Katkout, Fahd and Sadiq, three friends growing up in Surra, central Kuwait, during the late-twentieth and early-twenty-first century. Coming from different sects and ethnic backgrounds, the young men share little but their fury and frustration at the divisions that compound the destruction wrought in the wake of the Iraqi invasion. In an attempt to overcome this, they form a group, Fuada’s Kids, which aims to bind Kuwaitis together by appealing to their nostalgia, but in so doing risks costing them everything.\u003c/p\u003e\n\n\n\n\u003cp\u003eDisorientation is at the heart of this novel. The narrative, like the central characters’ world, is fractured and splintered, reflecting the feeling that ‘it’s as if an enormous fist has plowed into Kuwait, leaving it in ruins’. The present-day, adult reality is intercut with flashbacks and with chapters from an autobiographical novel, some of the of which have been removed to placate the government censors.\u003c/p\u003e\n\n\n\n\u003cp\u003eIndeed, censorship is another key theme. Growing up, the boys learn that questions can be dangerous. Seemingly innocuous issues such as how someone pronounces a word or the spelling of certain names can crack open rifts and even invite physical violence. Small wonder, then, that self-censorship and sanitization flow through many of the conversations, because, as Fahd’s grandmother Mama Hissa is fond of observing, ‘all cowards stay safe.’ \u003c/p\u003e\n\n\n\n\u003cp\u003eFor English-language readers, there is an extra level of challenge. The unease and self-questioning that the story prompts with its challenging structure and courting of the unsayable is compounded with cultural disorientation. It is often unclear how certain statements should be read. We can’t know the significance of certain jokes – or whether some phrases are meant as jokes at all. The childhood memory of the boys pretending to be Palestinians throwing stones at Jews, for example. Is this said ironically, or bitterly? Would this be shocking in this society or unquestioned? And how ought we to respond? \u003c/p\u003e\n\n\n\n\u003cp\u003eThere are also a large number of unfamiliar cultural terms in the text. Hussain does an elegant job of elucidating key elements but refuses to patronise or pamper readers by over-explaining. The terms are left Roman rather than italicised – a reminder that it is we, rather than the world of the story, who are foreign. (For more on the politics of italicisation, check out Daniel José Older’s YouTube video ‘Why We Don’t Italicize Spanish’ below.)\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eBut there are also moments of powerful connection. From Alsanousi’s skilful marshalling of the child’s-eye view to reveal the strangeness of behaviours adults take for granted, to his intense, visceral presentation of moments of fear and suffering, and from the way he builds nostalgia to his layering of action so that we grow to remember events as the central characters’ do, this novel reaches out and grasps us. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt also showed me my own world through new eyes. A Londoner born and bred, I had long been in the habit of looking askance at the overseas investors who own empty properties in many of the capital’s most desirable postcodes. Reading \u003cem\u003eMama Hissa’s Mice\u003c/em\u003e made me consider the question from another angle: when you live with the threat of invasion and societal collapse, ‘foreign houses are assets for when something happens’. Wouldn’t many of us make similar choices if we had experienced such things?\u003c/p\u003e\n\n\n\n\u003cp\u003eThis was a difficult read. But as a result it was also surprising one. An enriching one. A challenging one. It required me to sit with not-knowing in the same way that \u003cem\u003e\u003ca href=\"https://ayearofreadingtheworld.com/2023/05/31/book-of-the-month-shalash-the-iraqi/\"\u003eShalash the Iraqi\u003c/a\u003e\u003c/em\u003e did – accepting my limitations and recognising that this is not a story that can or should centre my knowledge or perspective as so many of the books produced by the anglophone publishing industry do. I’m very glad to have had the chance to experience it.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eMama Hissa’s Mice\u003c/em\u003e by Saud Alsanousi, translated from the Arabic by Sawad Hussain (Amazon Crossing, 2019)\u003c/p\u003e\n\n\n\n\u003cp\u003ePicture: NASA Astronauts, Public domain, via \u003ca href=\"https://commons.wikimedia.org/wiki/File:Kuwait_City,_Kuwait.JPG\"\u003eWikimedia Commons\u003c/a\u003e\u003c/p\u003e\n\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-04-30T11:19:05Z",
  "modifiedTime": "2024-04-30T11:19:05Z"
}
