[
  {
    "id": "df28b54d-e9dd-4fd6-b13e-c90356ec7514",
    "title": "Earn 3% on Online Shopping With This Card",
    "link": "https://www.wisebread.com/node/2571965",
    "description": "Link for teaser title:  https://www.wisebread.com/compare/pxd-2024-aug-bofa-customized-cash-rewards-revi... This card with no annual fee with a $200 welcome offer also lets you earn 3% cash back when you choose online shopping.",
    "author": "webmaster",
    "published": "Thu, 04 Jul 2024 16:14:53 +0000",
    "image": "https://www.wisebread.com/files/fruganomics/imagecache/128x112/blog-images/man_glasses_laptop_881009178_0.jpg",
    "source": "http://feeds.killeraces.com/wisebread",
    "categories": null
  },
  {
    "id": "6633f7de-3ab0-4f93-83a0-1be7b38bdde7",
    "title": "Why Online Shoppers Will Love This Credit Card",
    "link": "https://www.wisebread.com/node/2569723",
    "description": "Link for teaser title:  https://www.wisebread.com/compare/pxd-2024-aug-bofa-customized-cash-rewards-revi... This card offers 3% cash back on online shopping, including cable, streaming services, internet, and phone plan purchases.",
    "author": "webmaster",
    "published": "Thu, 04 Jul 2024 16:12:04 +0000",
    "image": "https://www.wisebread.com/files/fruganomics/imagecache/128x112/blog-images/woman-with-cell-164x144.png",
    "source": "http://feeds.killeraces.com/wisebread",
    "categories": null
  },
  {
    "id": "0bc01cb5-98e0-438e-8771-d0e6fbea7564",
    "title": "#568: Q\u0026A: Why Smart Investors Are Questioning VTSAX and Chill",
    "link": "https://affordanything.com/qa-why-smart-investors-are-questioning-vtsax-and-chill/",
    "description": "Jason is confused by the recent discussions about the efficient frontier and Paul Merriman’s four-sector strategy. It seems a lot like another form of stock-picking. What’s the difference? Michelle straddles the Roth income threshold and is frustrated that she never knows if she’ll qualify for a Roth contribution until tax season. Is her current savings plan too complicated? Evan has $100 to spend on personal finance books for his high school’s library. What books would Paula and Joe put on this limited shelf space? Former financial planner Joe Saul-Sehy and I tackle these three questions in today’s episode. Enjoy!",
    "author": "Paula Pant",
    "published": "Fri, 20 Dec 2024 17:39:58 +0000",
    "image": "https://www.podtrac.com/pts/redirect.mp3/pdst.fm/e/pscrb.fm/rss/p/chrt.fm/track/8G441/traffic.megaphone.fm/WWO5786633519.mp3?updated=1734714190",
    "source": "https://affordanything.com/feed/",
    "categories": [
      "Episodes",
      "FIRE"
    ]
  },
  {
    "id": "04c75e0b-76d3-4813-abb3-96e3c02ac76e",
    "title": "#567: Lessons from High-Stakes Decisions, with Polina Marinova Pompliano",
    "link": "https://affordanything.com/567-lessons-from-high-stakes-decisions-with-polina-marinova-pompliano/",
    "description": "What happens when an astronaut goes blind during a spacewalk? For Chris Hadfield, this wasn't a hypothetical scenario. While working outside the International Space Station, cleaning solution from his helmet visor spread into both eyes, leaving him completely blind in the vacuum of space. His response? Stay calm and methodically evaluate options. He could call Houston. He could have a crew member rescue him. He could try to cry to flush out his eyes - though that's tricky in zero gravity. This story opens our conversation with Polina Marinova Pompliano, former Fortune Magazine reporter and author of the new book \"Hidden Genius.\" Through her interviews with high-performers across fields — from astronauts to investors to extreme athletes — she uncovers patterns in how people handle uncertainty and build resilience. Take trust, for example. Reid Hoffman's formula is simple: Trust = Consistency + Time. It's not enough to show up sporadically when it's convenient. Trust builds through meeting deadlines, following through on commitments, and maintaining clear communication — even during challenges. Reliable consistency compounds over time, much like interest in an investment account. Or consider Charlie Munger's approach to beliefs. Rather than defending positions \"to the death,\" he argues you should only claim to believe something if you can argue the opposition's viewpoint better than they can. This forces you to genuinely understand different perspectives rather than just reflexively disagreeing. The conversation explores how people navigate major setbacks, from Conrad Anker surviving an avalanche that killed his climbing partners to Polina's own experience of quitting Fortune magazine right before COVID hit. A key theme emerges: resilience isn't about avoiding difficulty, but about training yourself to handle it through small daily practices. Former Navy SEAL David Goggins calls this \"callusing the mind.\" By deliberately doing one uncomfortable thing each day - whether that's running in the rain or having a difficult conversation - you build your capacity to handle larger challenges. The goal isn't to become superhuman, but to expand your comfort zone step by step.",
    "author": "Paula Pant",
    "published": "Tue, 17 Dec 2024 21:48:37 +0000",
    "image": "https://www.podtrac.com/pts/redirect.mp3/pdst.fm/e/pscrb.fm/rss/p/chrt.fm/track/8G441/traffic.megaphone.fm/WWO3513548748.mp3?updated=1734467591",
    "source": "https://affordanything.com/feed/",
    "categories": [
      "Episodes",
      "FIRE"
    ]
  },
  {
    "id": "ba66e0a3-7792-4e3a-b313-1222968d0d38",
    "title": "Want one of these domain names?!",
    "link": "https://budgetsaresexy.com/want-any-of-these-web-domains/",
    "description": "Morning! So in an attempt to become more minimalist over here – AND – raise a little money for my cold and hungry homeless friends,... Read More [This post, Want one of these domain names?!, was first published by J. Money on Budgets Are Sexy]",
    "author": "J. Money",
    "published": "Tue, 10 Dec 2024 10:04:02 +0000",
    "image": "https://budgetsaresexy.com/images/laptop-lights.png",
    "source": "https://feeds2.feedburner.com/budgetsaresexy",
    "categories": [
      "Blogging",
      "Charity",
      "Entrepreneurship"
    ]
  },
  {
    "id": "adec7448-8b2b-4751-8040-c6c585d4cd2d",
    "title": "Wealth = Have ÷ Want",
    "link": "https://budgetsaresexy.com/wealth-is-have-divided-by-want/",
    "description": "[A good reminder this week from Derek Sivers :) Happy Thanksgiving!] ****** Not a new idea, but just another visualization and reminder. Wealth, feeling like... Read More [This post, Wealth = Have ÷ Want, was first published by J. Money on Budgets Are Sexy]",
    "author": "J. Money",
    "published": "Tue, 26 Nov 2024 10:22:42 +0000",
    "image": "https://budgetsaresexy.com/images/meditation-clouds.png",
    "source": "https://feeds2.feedburner.com/budgetsaresexy",
    "categories": [
      "Life"
    ]
  },
  {
    "id": "79f550f7-60eb-4107-8c71-afeb87d440b9",
    "title": "The Biggest Flex By Men Is Not What You Think",
    "link": "https://www.financialsamurai.com/biggest-flex-by-men/",
    "description": "“Flexing” is a slang term that means showing off or boasting about one's accomplishments, possessions, or skills, often with the intention of impressing others. For example, someone might “flex” on social media by posting pictures of their new Porsche or sharing stories about their achievements. Personally, I'm not a fan of flexing—what’s the point? It […] The post The Biggest Flex By Men Is Not What You Think appeared first on Financial Samurai.",
    "author": "Financial Samurai",
    "published": "Fri, 20 Dec 2024 12:18:00 +0000",
    "image": "https://www.financialsamurai.com/wp-content/uploads/2024/12/v12044gd0000ctfms07og65vmh1kfok0.mp4",
    "source": "https://www.financialsamurai.com/feed/",
    "categories": [
      "Family Finances"
    ]
  },
  {
    "id": "b283424a-864d-4442-9b4d-b22e8f906060",
    "title": "Cheap, Fun, And Practical Buys With Your Stock Market Returns",
    "link": "https://www.financialsamurai.com/cheap-fun-and-practical-buys-with-your-stock-market-returns/",
    "description": "With another strong year in the stock market, it’s time for investors to celebrate! While marveling at the growth of your portfolio is satisfying, a more rewarding way to celebrate is to actually spend some of those phenomenal returns on things that bring joy and fulfillment. Stocks, by themselves, provide no utility. We invest in […] The post Cheap, Fun, And Practical Buys With Your Stock Market Returns appeared first on Financial Samurai.",
    "author": "Financial Samurai",
    "published": "Wed, 18 Dec 2024 12:18:00 +0000",
    "image": "",
    "source": "https://www.financialsamurai.com/feed/",
    "categories": [
      "Retirement"
    ]
  },
  {
    "id": "3f28473a-88fb-4809-b751-d78fe8c85d8c",
    "title": "I’m Still Alive; also, join the 7th Annual Uber Frugal Month Group Challenge!",
    "link": "https://frugalwoods.com/2023/12/13/im-still-alive-also-join-the-7th-annual-uber-frugal-month-group-challenge/",
    "description": "I’m still here! I took an unplanned (and therefore unannounced) break from writing the blog, which was intended to be for a week, but expanded to a month and then two months… WHOOPS. I confess I needed some time off from ye olde Frugalwoods after consistently posting for 9.5 years. That’s the longest I’ve ever done any one job and I realized during this impromptu hiatus that I–gasp–MISSED writing and MISSED all of you. Sometimes one must have some absence in order for one to realize what one misses. So, I’m checking in to let you know that I haven’t died or abandoned Frugalwoods, but that I am trying to discern how often I’ll write going forward. The days of thrice weekly posts are definitively over, but on the other extreme, I don’t particularly want to take full months off again either. Thank you for your patience as I–once again–figure out what I want to do with my life. Continue reading I’m Still Alive; also, join the 7th Annual Uber Frugal Month Group Challenge! at Frugalwoods.",
    "author": "Liz Frugalwoods",
    "published": "Wed, 13 Dec 2023 09:00:00 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/Frugalwoods",
    "categories": [
      "Frugalwoods Philosophy",
      "Uber Frugal Month"
    ]
  },
  {
    "id": "0845c2c7-c2ac-4369-b1df-d2c0d77dd712",
    "title": "Reader Case Study: Yearning For a Debt-Free Future",
    "link": "https://frugalwoods.com/2023/09/29/reader-case-study-yearning-for-a-debt-free-future/",
    "description": "Brian and Michael, both 34, live with their two cats in central Connecticut. Michael works as a project coordinator for a state behavioral health agency serving young people and has a side job as an advocate and disability leadership coordinator. Brian is a quality assurance manager for a state-run hospital. The couple’s been together since 2013 and looks forward to celebrating their 10-year anniversary in November. While Brian and Michael have achieved a lot, they feel as though their debt and lack of home ownership is holding them back. They’d like our advice on how to unlock this next level of adulting and, crucially, how to be permanently debt-free. What’s a Reader Case Study? Case Studies address financial and life dilemmas that readers of Frugalwoods send in requesting advice. Then, we (that’d be me and YOU, dear reader) read through their situation and provide advice, encouragement, insight and feedback in the comments section. Continue reading Reader Case Study: Yearning For a Debt-Free Future at Frugalwoods.",
    "author": "Liz Frugalwoods",
    "published": "Fri, 29 Sep 2023 08:00:00 +0000",
    "image": "https://frugalwoods.com/wp-content/uploads/2023/09/rcs-150x150.jpg",
    "source": "https://feeds.feedburner.com/Frugalwoods",
    "categories": [
      "Reader Case Studies",
      "featured"
    ]
  },
  {
    "id": "97898f11-32ba-413b-91cb-9809c0ff7cad",
    "title": "Financial Peace University vs. True Financial Freedom vs. Crown Financial MoneyLife",
    "link": "https://www.goodfinancialcents.com/financial-peace-university-vs-true-financial-freedom-vs-crown-financial-moneylife/",
    "description": "I recently completed three of the top Christian financial education programs for churches: SeedTime’s True Financial Freedom, Dave Ramsey’s Financial Peace University, and Crown Financial’s MoneyLife. These popular programs all claim to help you get control of your finances from a biblical perspective. However, they go about it in different ways with varying teaching styles […] The post Financial Peace University vs. True Financial Freedom vs. Crown Financial MoneyLife appeared first on Good Financial Cents®.",
    "author": "Dylan Drake",
    "published": "Thu, 13 Jun 2024 20:29:12 +0000",
    "image": "https://www.goodfinancialcents.com/wp-content/uploads/2024/06/Screenshot-2024-06-13-at-3.14.12 PM-1024x450.png",
    "source": "https://www.goodfinancialcents.com/feed/",
    "categories": [
      "Debt"
    ]
  },
  {
    "id": "7395eaec-e50a-4828-ab7b-27ed066b91ff",
    "title": "6 Ways to Help Your Child Build Credit During College",
    "link": "https://www.goodfinancialcents.com/6-ways-to-help-your-child-build-credit-during-college/",
    "description": "College students have a lot on their plate already, including the need to study to get good grades, participating in any number of on-campus activities and potentially working part-time to have some spending money. That said, college students should also focus on their financial future, including steps they can take to build credit before they […] The post 6 Ways to Help Your Child Build Credit During College appeared first on Good Financial Cents®.",
    "author": "Jeff Rose, CFP®",
    "published": "Mon, 12 Feb 2024 17:55:46 +0000",
    "image": "https://www.goodfinancialcents.com/wp-content/uploads/2024/02/College-Ave-Ambition-Card-1024x549.png",
    "source": "https://www.goodfinancialcents.com/feed/",
    "categories": [
      "Credit",
      "Unclassified"
    ]
  },
  {
    "id": "3304dad4-4d77-4eeb-97d6-d2844fddb9da",
    "title": "Portfolio Rebalancing: What It Really Means \u0026 How to Do It",
    "link": "https://www.iwillteachyoutoberich.com/portfolio-rebalancing/",
    "description": "Portfolio rebalancing is a powerful yet often overlooked tool for managing risk and optimizing returns, which involves realigning your investments with your intended target mix. When your investments drift off course, you could expose yourself to more risk than you intended or miss key opportunities. This post will show you exactly how to rebalance your […] Source",
    "author": "Ramit Sethi",
    "published": "Sat, 23 Nov 2024 10:49:00 +0000",
    "image": "",
    "source": "https://www.iwillteachyoutoberich.com/feed/",
    "categories": [
      "Personal Finance",
      "Investing"
    ]
  },
  {
    "id": "1e1f2e87-c2d8-4f18-9c57-9d163eabd336",
    "title": "How to Write a Winning Business Plan Executive Summary (+ template included)",
    "link": "https://www.iwillteachyoutoberich.com/business-plan-executive-summary/",
    "description": "Most business plan executive summaries fail because they focus on irrelevant details and lose investors’ attention in the opening lines. In this post, we’ll break down how to craft an executive summary that gets results, covering all the essential components, sharing real-world examples, and providing a ready-to-use template for you to start right away. Core […] Source",
    "author": "Ramit Sethi",
    "published": "Fri, 22 Nov 2024 06:57:32 +0000",
    "image": "",
    "source": "https://www.iwillteachyoutoberich.com/feed/",
    "categories": [
      "Start a Business"
    ]
  },
  {
    "id": "786af999-7d2a-4ffd-999c-2b46abcc1c21",
    "title": "Here’s My Daily Trading Routine That I’ve Used For 10+ Years",
    "link": "https://www.learntotradethemarket.com/forex-trading-strategies/daily-trading-routine-nial-fuller",
    "description": "Here’s what you need to know about trading routines: Trading routines, are the real key to success in the market. There’s no magic indicator or algorithmic trading robot that is going to easily make you a profitable trader. Just like Bill Gates routine each and everyday, over the course of years, led him to insane financial success, so will your trading routine. The post Here’s My Daily Trading Routine That I’ve Used For 10+ Years first appeared on Learn To Trade The Market.",
    "author": "Nial Fuller",
    "published": "Sun, 20 Jun 2021 22:00:31 +0000",
    "image": "",
    "source": "https://www.learntotradethemarket.com/feed",
    "categories": [
      "Forex Trading Strategies By Nial Fuller"
    ]
  },
  {
    "id": "9cb0dea6-2c20-4742-a4df-12ce2f913f56",
    "title": "Beware Of Scammers Impersonating Nial Fuller On Social Media",
    "link": "https://www.learntotradethemarket.com/nial-fullers-blog/nial-fuller-scam-warning",
    "description": "There are scammers impersonating Nial Fuller (pretending to be me) on social media sites and other websites across the internet. These impersonators are actively contacting our members and followers on social media chat apps and platforms. The fake scam accounts will initially appear as me (Nial Fuller), with similar profile pictures and text to my real profiles. The impersonators will try to talk with you for some time before eventually offering you a 'trade for you service' or a 'managed account service' or something similar to this. The post Beware Of Scammers Impersonating Nial Fuller On Social Media first appeared on Learn To Trade The Market.",
    "author": "Nial Fuller",
    "published": "Tue, 18 May 2021 09:03:19 +0000",
    "image": "",
    "source": "https://www.learntotradethemarket.com/feed",
    "categories": [
      "Nial Fullers’ Blog"
    ]
  },
  {
    "id": "54d89daa-4ae0-4652-b870-911d240b2c05",
    "title": "10 Ways to Get $10 Free PayPal Money Instantly",
    "link": "https://millennialmoney.com/free-10-dollars-paypal-instantly/",
    "description": "The post 10 Ways to Get $10 Free PayPal Money Instantly appeared first on Millennial Money. While some sites offer $10 free PayPal money instantly, some of these methods actually require time, effort, and patience. The post 10 Ways to Get $10 Free PayPal Money Instantly appeared first on Millennial Money.",
    "author": "Grant Sabatier",
    "published": "Sat, 29 Jun 2024 15:13:06 +0000",
    "image": "https://millennialmoney.com/wp-content/uploads/2022/07/branded-surveys-logo-square.svg",
    "source": "https://millennialmoney.com/feed/",
    "categories": [
      "Fast Cash"
    ]
  },
  {
    "id": "483a5c09-baf0-40d6-a296-7c7961c74432",
    "title": "How To Make Money Without a Car in 2024",
    "link": "https://millennialmoney.com/make-money-without-a-car/",
    "description": "The post How To Make Money Without a Car in 2024 appeared first on Millennial Money. Whether you want to make some extra spending money or are looking for a full-time career opportunity, there are many ways to make make money without a car! The post How To Make Money Without a Car in 2024 appeared first on Millennial Money.",
    "author": "Grant Sabatier",
    "published": "Thu, 20 Jun 2024 15:04:12 +0000",
    "image": "https://millennialmoney.com/wp-content/uploads/2019/10/mypoints.jpg",
    "source": "https://millennialmoney.com/feed/",
    "categories": [
      "Fast Cash"
    ]
  },
  {
    "id": "bbb3fd50-c9a9-497b-9d81-dc355b07e941",
    "title": "13 Best Jobs for 11 Year Olds To Make Money",
    "link": "https://www.makingsenseofcents.com/2024/12/jobs-for-11-year-olds.html",
    "description": "Are you wondering what the best jobs for 11-year-olds are? Many kids want to earn money, but finding jobs can be tough at 11 years old. Jobs for 11-year-olds can teach them about money and hard work. They can learn new skills and gain experience for the future. I still remember the thrill of earning... The post 13 Best Jobs for 11 Year Olds To Make Money appeared first on Making Sense Of Cents.",
    "author": "Michelle Schroeder-Gardner",
    "published": "Fri, 20 Dec 2024 11:57:00 +0000",
    "image": "https://www.makingsenseofcents.com/wp-content/uploads/2024/11/best-jobs-for-11-year-olds-1024x632.jpg",
    "source": "https://www.makingsenseofcents.com/feed",
    "categories": [
      "Extra Income",
      "Jobs"
    ]
  },
  {
    "id": "126be377-bb6a-405b-967a-0e2fd067482b",
    "title": "Bubble Buzz Review – Is Bubble Buzz Legit?",
    "link": "https://www.makingsenseofcents.com/2024/12/bubble-buzz-review.html",
    "description": "The following Bubble Buzz Review is a sponsored partnership with Aviagames. Bubble Buzz is not just another bubble-popping game—it’s a fun way to challenge your skills, have fun, and even earn real money.  With dynamic gameplay, colorful graphics, and cash tournaments, Bubble Buzz transforms the classic bubble shooter into a rewarding experience. Whether you’re playing... The post Bubble Buzz Review – Is Bubble Buzz Legit? appeared first on Making Sense Of Cents.",
    "author": "Michelle Schroeder-Gardner",
    "published": "Thu, 19 Dec 2024 19:14:37 +0000",
    "image": "https://www.makingsenseofcents.com/wp-content/uploads/2024/12/Bubble-Buzz-Review-image-1024x472.png",
    "source": "https://www.makingsenseofcents.com/feed",
    "categories": [
      "Extra Income",
      "Money Making Apps"
    ]
  },
  {
    "id": "4388e4da-a5c0-4286-8ad7-773896d85972",
    "title": "3 Ways to Stop Wasting Money on Children’s Toys",
    "link": "https://moneyning.com/kids-and-money/3-ways-to-stop-wasting-money-on-children-toys/",
    "description": "Here are a few suggestions to help you spend your toy dollars wisely. The post 3 Ways to Stop Wasting Money on Children's Toys first appeared on MoneyNing.",
    "author": "Tracy",
    "published": "Mon, 16 Dec 2024 16:56:33 +0000",
    "image": "https://moneyning.com/wp-content/uploads/2011/10/photo-1516564927920-18dc97b117b4.jpeg",
    "source": "http://feeds.feedburner.com/MoneyNing",
    "categories": [
      "Kids and Money"
    ]
  },
  {
    "id": "e01df0d9-644b-431d-b412-16f7bcad9602",
    "title": "4 Tips for Planning for Financial Emergencies",
    "link": "https://moneyning.com/budgeting/4-tips-for-planning-for-financial-emergencies/",
    "description": "We don’t always know when the unexpected will happen. That doesn’t mean we can’t plan for it though. In fact, one of the best things you can do for your finances is to look ahead and prepare for the inevitable emergency. Here are four tips you can use for your plan: 1. Start with Your […] The post 4 Tips for Planning for Financial Emergencies first appeared on MoneyNing.",
    "author": "Miranda Marquit",
    "published": "Mon, 09 Dec 2024 17:30:12 +0000",
    "image": "https://moneyning.com/wp-content/uploads/2017/04/ambulance.jpg",
    "source": "http://feeds.feedburner.com/MoneyNing",
    "categories": [
      "Budgeting",
      "Emergency Fund",
      "Money Tips"
    ]
  },
  {
    "id": "ea11456c-604a-4909-bee4-599fc27e4d67",
    "title": "How to Make a Wedding Budget – 6 Essential Steps for Planning Costs",
    "link": "https://www.moneycrashers.com/make-wedding-budget/",
    "description": "It’s easy to get caught up in the excitement of wedding planning. Things like the venue, decor, food, and wedding attire can make it a truly magical time — until the bill arrives. Talking about your wedding budget probably isn’t a conversation you’re looking forward to. But it’s a necessary one. Before viewing locations or The post How to Make a Wedding Budget – 6 Essential Steps for Planning Costs appeared first on Money Crashers.",
    "author": "Amy Freeman",
    "published": "Tue, 10 Dec 2024 04:59:03 +0000",
    "image": "",
    "source": "https://www.moneycrashers.com/feed/",
    "categories": [
      "Save Money"
    ]
  },
  {
    "id": "59ee152d-3150-46b6-89a1-e8715ddc3cd3",
    "title": "21 Best Bank Promotions \u0026 Bonus Offers for December 2024",
    "link": "https://www.moneycrashers.com/best-new-bank-account-promotions-offers/",
    "description": "Sorting through the best bank account offers can take forever. And by the time you find them all, decide which one, and leap, the offer's already gone. But this running list will give you the edge you need to pounce when the time is right. The post 21 Best Bank Promotions \u0026 Bonus Offers for December 2024 appeared first on Money Crashers.",
    "author": "Brian Martucci",
    "published": "Sun, 01 Dec 2024 02:00:00 +0000",
    "image": "",
    "source": "https://www.moneycrashers.com/feed/",
    "categories": [
      "Manage Money",
      "Banking"
    ]
  },
  {
    "id": "76f9a54b-fb4a-498e-9434-2238b329f4c5",
    "title": "Weekend Reading For Financial Planners (December 21–22)",
    "link": "https://feeds.feedblitz.com/~/909743405/0/kitcesnerdseyeview~Weekend-Reading-For-Financial-Planners-December-%e2%80%93/",
    "description": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" - this week's edition kicks off with the news that the CFP Board announced a series of proposed changes to its certification requirements, including an increase in required Continuing Education (CE) hours for current certificants to 40 hours every two years (up from the currentRead More... The post Weekend Reading For Financial Planners (December 21–22) first appeared on Kitces.com.",
    "author": "Adam Van Deusen",
    "published": "Fri, 20 Dec 2024 19:25:17 +0000",
    "image": "https://feeds.feedblitz.com/~/i/909743405/0/kitcesnerdseyeview",
    "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
    "categories": [
      "Weekend Reading",
      "OPTIN: Value Of Advice (BAR)",
      "OPTIN: Value Of Advice (SLIDE IN)"
    ]
  },
  {
    "id": "2c209f59-f191-4a3d-a648-44fff4e35a6b",
    "title": "A Recordkeeping Checklist For Financial Planning Services: Proactive Documentation Of Service Delivery To Reduce Regulatory Scrutiny",
    "link": "https://feeds.feedblitz.com/~/909606746/0/kitcesnerdseyeview~A-Recordkeeping-Checklist-For-Financial-Planning-Services-Proactive-Documentation-Of-Service-Delivery-To-Reduce-Regulatory-Scrutiny/",
    "description": "Maintaining adequate books and records is a cornerstone of compliance for all investment advisers. While state and Federal regulations clearly outline recordkeeping requirements for areas like financials, advertisements, and trading records, there is a notable gap when it comes to documenting the delivery of services – especially financial planning services – necessary to justify theRead More... The post A Recordkeeping Checklist For Financial Planning Services: Proactive Documentation Of Service Delivery To Reduce Regulatory Scrutiny first appeared on Kitces.com.",
    "author": "Travis Johnson",
    "published": "Wed, 18 Dec 2024 12:01:42 +0000",
    "image": "https://feeds.feedblitz.com/~/i/909606746/0/kitcesnerdseyeview",
    "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
    "categories": [
      "Regulation \u0026 Compliance",
      "OPTIN: One Page Business Plan (BAR)",
      "OPTIN: One Page Business Plan (SLIDE IN)"
    ]
  },
  {
    "id": "909b50b4-95b9-49b3-95f3-8514a0d0bee1",
    "title": "Current Credit Card Transfer Bonuses: December 2024",
    "link": "https://www.nerdwallet.com/article/travel/credit-card-transfer-bonuses",
    "description": "Here's a list of current and past transfer bonuses offered by American Express Membership Rewards, Chase Ultimate Rewards, Bilt Rewards, Citi ThankYou and Capital One.",
    "author": "Craig Joseph",
    "published": "Sat, 21 Dec 2024 00:53:29 +0000",
    "image": "https://www.nerdwallet.com/blog/content/themes/nerdwallet/assets/tracking/nw-pixel-v1.gif?post_id=1678137",
    "source": "https://www.nerdwallet.com/blog/feed/",
    "categories": [
      "Reward Optimization",
      "Travel",
      "Travel Credit Cards"
    ]
  },
  {
    "id": "8bee74ae-45d3-4378-9c07-edb588a48703",
    "title": "Happy New Year: 5 States Will Pump Up Gas Taxes on Jan. 1",
    "link": "https://www.nerdwallet.com/article/finance/gas-tax-hikes-january-2025",
    "description": "Gas taxes are rising in Florida, Georgia, Minnesota, New Jersey and Utah on Jan. 1.",
    "author": "Taryn Phaneuf",
    "published": "Fri, 20 Dec 2024 22:49:06 +0000",
    "image": "https://www.nerdwallet.com/blog/content/themes/nerdwallet/assets/tracking/nw-pixel-v1.gif?post_id=1679549",
    "source": "https://www.nerdwallet.com/blog/feed/",
    "categories": [
      "Personal Finance"
    ]
  },
  {
    "id": "54414d49-38d2-4bae-b46b-541cc0585a82",
    "title": "Roth Conversion Deep Dive — Addressing “Left Out” Topics",
    "link": "https://obliviousinvestor.com/roth-conversion-deep-dive-addressing-left-out-topics/",
    "description": "Administrative note: there will be no article next week (12/23), as I’ll be taking time off for the holidays. Last week I linked to my “Roth Conversions Deep Dive” presentation from the recent Bogleheads Conference. And many people wrote in to ask about things that were not included in the presentation. One of the biggest […]",
    "author": "Mike",
    "published": "Mon, 16 Dec 2024 13:30:08 +0000",
    "image": "https://www.obliviousinvestor.com/wp-content/uploads/2014/04/NewBook8CoverTiltedScaled2.png",
    "source": "https://obliviousinvestor.com/feed/",
    "categories": [
      "Retirement Planning"
    ]
  },
  {
    "id": "cdf2eab0-58fa-423e-b486-52edec80ddbd",
    "title": "Investing Blog Roundup: 2024 Bogleheads Conference Videos",
    "link": "https://obliviousinvestor.com/investing-blog-roundup-2024-bogleheads-conference-videos/",
    "description": "The videos from the 2024 Bogleheads Conference are now available. You can find them at the links below. Note that “Bogleheads University” is the first day of the conference, which is split up into “101” and “501” tracks to provide more entry-level information for those who need it, while still having a separate advanced track […]",
    "author": "Mike",
    "published": "Mon, 09 Dec 2024 13:00:34 +0000",
    "image": "https://www.obliviousinvestor.com/wp-content/uploads/2014/04/NewBook8CoverTiltedScaled2.png",
    "source": "https://obliviousinvestor.com/feed/",
    "categories": [
      "Roundup"
    ]
  },
  {
    "id": "721740a8-61f8-45dd-a467-d28a614ef51d",
    "title": "20 Easy Christmas Dessert Ideas!",
    "link": "https://moneysavingmom.com/easy-best-christmas-desserts/",
    "description": "Looking for easy Christmas dessert ideas? Don’t miss these 20 best Christmas dessert ideas that are SO simple to make and will wow just about any crowd!! 20 Best Christmas Desserts The holidays are here, and what better way to celebrate than with dessert!? Whether you’re looking for a new recipe to bring to yourRead More",
    "author": "Crystal Paine",
    "published": "Sat, 21 Dec 2024 18:00:00 +0000",
    "image": "https://moneysavingmom.com/wp-content/uploads/2024/12/20-Easy-Christmas-Desserts-Round-Up-630x945.jpg",
    "source": "https://moneysavingmom.com/feed/",
    "categories": [
      "Easy Desserts",
      "Easy Recipes",
      "LITE Feed (non-deal) Posts"
    ]
  },
  {
    "id": "6de5c6b8-a596-42df-9666-7b613e3fa454",
    "title": "8 Popular Deals From This Past Week You Don’t Want To Miss!",
    "link": "https://moneysavingmom.com/top-deals-this-week/",
    "description": "Worried you missed some of the best deals this week? Here are some of the most popular deals from this past week that are still available! (And be sure to sign up for our Hot Deals newsletter to be alerted to the hottest deals each day before they sell out!) BeFrugal.com — an online cash backRead More",
    "author": "Meagan",
    "published": "Sat, 21 Dec 2024 17:00:00 +0000",
    "image": "https://moneysavingmom.com/wp-content/uploads/2024/11/Screenshot-2024-12-18-at-1.19.30-PM-630x368.png",
    "source": "https://moneysavingmom.com/feed/",
    "categories": [
      "Deals",
      "Hot Deals",
      "Online Deals"
    ]
  },
  {
    "id": "9c52a7c1-769e-4379-b8ee-4cba92fa793b",
    "title": "FlexJobs Review: Is FlexJobs Legit? Read Before Signing Up…",
    "link": "https://www.sidehustlenation.com/flexjobs-review/",
    "description": "FlexJobs promises to connect remote job seekers with verified, scam-free job listings. But is it worth paying for?",
    "author": "Nick Loper",
    "published": "Thu, 16 May 2024 19:13:58 +0000",
    "image": "https://getlasso.co/wp-content/uploads/flexjobs-logo.png",
    "source": "https://www.sidehustlenation.com/feed",
    "categories": [
      "Reviews"
    ]
  },
  {
    "id": "210789f1-9433-4455-a8c2-ea72a28a64bf",
    "title": "How to Start a Billboard Business: $30k a Month Part-Time",
    "link": "https://www.sidehustlenation.com/how-to-start-a-billboard-business/",
    "description": "Even with the rise of digital technology, billboards remain a profitable business. In fact, Chris Brown built his billboard side hustle to $30,000 a month (part-time!). Chris now owns approximately 30 billboards around Bentonville, Arkansas, and retired early at the age of 42.",
    "author": "Nick Loper",
    "published": "Thu, 16 May 2024 09:00:44 +0000",
    "image": "https://traffic.megaphone.fm/YAP8304129779.mp3",
    "source": "https://www.sidehustlenation.com/feed",
    "categories": [
      "Hustle 101"
    ]
  },
  {
    "id": "3201b41d-6a66-4bc1-b6eb-c8444659fa57",
    "title": "How To Fill Out Your W-4 and Change Your Withholdings",
    "link": "https://thecollegeinvestor.com/24580/form-w-4-withholdings/",
    "description": "Whether you have a new job or simply need to change your Form W-4 withholdings, find the information you need here to know what to do. The post How To Fill Out Your W-4 and Change Your Withholdings appeared first on The College Investor.",
    "author": "Robert Farrington",
    "published": "Sun, 22 Dec 2024 23:03:04 +0000",
    "image": "https://thecollegeinvestor.com/wp-content/uploads/2019/06/WP_W4.jpg",
    "source": "https://thecollegeinvestor.com/feed/",
    "categories": [
      "Taxes"
    ]
  },
  {
    "id": "407af352-8c43-4347-99d2-c8e9861113b5",
    "title": "How To Qualify For Public Service Loan Forgiveness [Guide]",
    "link": "https://thecollegeinvestor.com/22857/public-service-loan-forgiveness/",
    "description": "Have a question about the Public Service Loan Forgiveness (PSLF) Program? Start here with the ultimate guide! Find out which loans qualify. The post How To Qualify For Public Service Loan Forgiveness [Guide] appeared first on The College Investor.",
    "author": "Robert Farrington",
    "published": "Sun, 22 Dec 2024 12:15:00 +0000",
    "image": "https://thecollegeinvestor.com/wp-content/uploads/2024/04/PSLF_Buyback_Program_1280x720.png",
    "source": "https://thecollegeinvestor.com/feed/",
    "categories": [
      "Loan Forgiveness"
    ]
  },
  {
    "id": "3323a036-9b10-4a65-b25d-c5619a95edd7",
    "title": "50 Uses for Old Socks",
    "link": "https://www.savingadvice.com/articles/2024/12/22/1037969_50-uses-for-old-socks.html",
    "description": "Socks are always getting lost in the laundry. What can you do with the single socks left? Here are 50 uses for old socks: 1....",
    "author": "James Hendrickson",
    "published": "Sun, 22 Dec 2024 12:00:37 +0000",
    "image": "//www.savingadvice.com/wp-content/uploads/2015/09/stuffed-animal-574644_640-550x366.jpg",
    "source": "https://www.savingadvice.com/feed/",
    "categories": [
      "Environment",
      "Frugal",
      "repurpose",
      "reuse"
    ]
  },
  {
    "id": "738d92f7-ad62-4395-ac20-90b96072d6ca",
    "title": "365 Day Money Challenge, For New Years Or Anytime",
    "link": "https://www.savingadvice.com/articles/2024/12/21/1019727_365-day-money-challenge.html",
    "description": "The 52-week savings challenge has gained quite a lot of popularity as a way to save money during the year, but it’s not the only...",
    "author": "Jeffrey Strain",
    "published": "Sun, 22 Dec 2024 01:47:50 +0000",
    "image": "https://www.savingadvice.com/wp-content/uploads/2014/01/365-day-money-challenge-550x324.jpg",
    "source": "https://www.savingadvice.com/feed/",
    "categories": [
      "Editor's Pick",
      "Personal Finance",
      "Saving Money",
      "365 day challenge",
      "daily habit",
      "emergency fund",
      "money challenge",
      "pay yourself first",
      "penny challenge",
      "small amounts"
    ]
  },
  {
    "id": "c9b978ef-0dd5-441c-b194-d1022dfffe3b",
    "title": "Where to Get Christmas Dinner To Go This Year",
    "link": "https://wellkeptwallet.com/where-to-get-christmas-dinner-to-go-this-year/",
    "description": "Updated December 2024 Holidays are best celebrated at the table, enjoying delicious foods with those you love. Some people love the hustle and bustle of the kitchen, along with the adventure of getting everything to the table at just the right time. However, that certainly is not the only way to do it. If you... The post Where to Get Christmas Dinner To Go This Year appeared first on Well Kept Wallet.",
    "author": "Sophia Inza",
    "published": "Wed, 18 Dec 2024 21:50:00 +0000",
    "image": "",
    "source": "https://wellkeptwallet.com/feed/",
    "categories": [
      "Save Money"
    ]
  },
  {
    "id": "88e26ca4-be31-4c53-a44e-96355435c7a4",
    "title": "25 Ways to Make Extra Cash for Christmas",
    "link": "https://wellkeptwallet.com/ways-to-make-money-for-christmas/",
    "description": "The Christmas season is often synonymous with spending money. Unfortunately, knowing you might receive a credit card bill in January that you can’t pay in full can put a damper on your holiday festivities. Luckily, there are several ways to make money for Christmas so that you don’t ruin your budget.  If you need to... The post 25 Ways to Make Extra Cash for Christmas appeared first on Well Kept Wallet.",
    "author": "Laurie Blank",
    "published": "Wed, 04 Dec 2024 22:18:00 +0000",
    "image": "",
    "source": "https://wellkeptwallet.com/feed/",
    "categories": [
      "Make Money"
    ]
  },
  {
    "id": "aa399eeb-3734-4568-8dbe-ea486080409b",
    "title": "568: Amazon’s Dirty Tactics Are Costing You 61% More On Every Purchase",
    "link": "https://mywifequitherjob.com/episode568/",
    "description": "In this episode, I break down exactly what’s going on with Amazon right now and show you real-world examples of how Amazon is causing price inflation on everyday items. What You’ll Learn Amazon’s Last Income Report The Recent Amazon Prime Membership Changes Amazon’s Ever Increasing Fees Sponsors SellersSummit.com – The Sellers Summit is the ecommerce conference that I’ve run for the past 8 years. It’s small and intimate and you’ll learn a ton! Click Here To Grab The Recordings. The Family First Entrepreneur – Purchase my Wall Street Journal Bestselling book and receive $690 in free bonuses! Click here to […] The post 568: Amazon’s Dirty Tactics Are Costing You 61% More On Every Purchase appeared first on MyWifeQuitHerJob.com.",
    "author": "Steve Chou",
    "published": "Tue, 17 Dec 2024 18:32:40 +0000",
    "image": "https://traffic.libsyn.com/mywifequitherjob/MWQHJ568SteveChou.mp3",
    "source": "https://mywifequitherjob.com/feed/",
    "categories": [
      "Ecommerce",
      "The My Wife Quit Her Job Podcast With Steve Chou"
    ]
  },
  {
    "id": "b4f0786d-8cde-45ca-8e7b-f6e425dbf729",
    "title": "567: Why Everyone Needs a Side Hustle in 2025 – And the Best Ones to Start Today",
    "link": "https://mywifequitherjob.com/episode567/",
    "description": "These days, relying on just one source of income is like putting all your eggs in one basket—it’s risky. A side hustle isn’t just about making extra cash; it’s about taking control of your financial future. Whether it’s paying off debt, saving for a dream, or creating a safety net, a side hustle gives you options. And the best part? You can start small, work on something you actually enjoy, and watch it grow. In this episode, Toni and I talk about how having that extra stream of income can completely change your life—and it’s a lot easier to get […] The post 567: Why Everyone Needs a Side Hustle in 2025 – And the Best Ones to Start Today appeared first on MyWifeQuitHerJob.com.",
    "author": "Steve Chou",
    "published": "Tue, 10 Dec 2024 16:48:39 +0000",
    "image": "https://traffic.libsyn.com/mywifequitherjob/MWQHJ567SteveToni_1.mp3",
    "source": "https://mywifequitherjob.com/feed/",
    "categories": [
      "Ecommerce",
      "The My Wife Quit Her Job Podcast With Steve Chou"
    ]
  }
]
