[
  {
    "id": "66c1b489-3982-4b4c-80d9-c3195075efc5",
    "title": "Earn 3% on Online Shopping With This Card",
    "link": "https://www.wisebread.com/node/2571965",
    "description": "Link for teaser title:  https://www.wisebread.com/compare/pxd-2024-aug-bofa-customized-cash-rewards-revi... This card with no annual fee with a $200 welcome offer also lets you earn 3% cash back when you choose online shopping.",
    "author": "webmaster",
    "published": "Thu, 04 Jul 2024 16:14:53 +0000",
    "image": "https://www.wisebread.com/files/fruganomics/imagecache/128x112/blog-images/man_glasses_laptop_881009178_0.jpg",
    "source": "http://feeds.killeraces.com/wisebread",
    "categories": null
  },
  {
    "id": "1112e465-c984-467d-973c-82d46f112163",
    "title": "Why Online Shoppers Will Love This Credit Card",
    "link": "https://www.wisebread.com/node/2569723",
    "description": "Link for teaser title:  https://www.wisebread.com/compare/pxd-2024-aug-bofa-customized-cash-rewards-revi... This card offers 3% cash back on online shopping, including cable, streaming services, internet, and phone plan purchases.",
    "author": "webmaster",
    "published": "Thu, 04 Jul 2024 16:12:04 +0000",
    "image": "https://www.wisebread.com/files/fruganomics/imagecache/128x112/blog-images/woman-with-cell-164x144.png",
    "source": "http://feeds.killeraces.com/wisebread",
    "categories": null
  },
  {
    "id": "f850eaf5-2b4b-40af-ae8f-b6726dd0b835",
    "title": "Wealth = Have ÷ Want",
    "link": "https://budgetsaresexy.com/wealth-is-have-divided-by-want/",
    "description": "[A good reminder this week from Derek Sivers :) Happy Thanksgiving!] ****** Not a new idea, but just another visualization and reminder. Wealth, feeling like... Read More [This post, Wealth = Have ÷ Want, was first published by J. Money on Budgets Are Sexy]",
    "author": "J. Money",
    "published": "Tue, 26 Nov 2024 10:22:42 +0000",
    "image": "https://budgetsaresexy.com/images/meditation-clouds.png",
    "source": "https://feeds2.feedburner.com/budgetsaresexy",
    "categories": [
      "Life"
    ]
  },
  {
    "id": "1f51775f-478a-422a-840d-56d459668f8b",
    "title": "The 10-2 Challenge",
    "link": "https://budgetsaresexy.com/the-10-2-challenge/",
    "description": "Got this note from a reader and been obsessing about it lately: “I just wrapped up a 10 – 2 challenge. Here’s how it works... Read More [This post, The 10-2 Challenge, was first published by J. Money on Budgets Are Sexy]",
    "author": "J. Money",
    "published": "Tue, 12 Nov 2024 10:24:20 +0000",
    "image": "https://budgetsaresexy.com/images/10-2-challenge.jpg",
    "source": "https://feeds2.feedburner.com/budgetsaresexy",
    "categories": [
      "Charity",
      "Get Motivated",
      "Hacks",
      "Life"
    ]
  },
  {
    "id": "1e215bc1-fd00-42b2-83ab-640b5ba34115",
    "title": "#562: The Secret Psychology of Successful Negotiators, with Matt Schultz",
    "link": "https://affordanything.com/562-the-secret-psychology-of-successful-negotiators-with-matt-schultz/",
    "description": "More than 90 percent of people who ask to get their credit card annual fee reduced are successful. Yet most people never ask. Why? They assume the answer will be no. Matt Schultz, the author of “Ask Questions, Save Money, Make More,” joins us to explain the psychology and tactics behind successful negotiation. The key insight: companies want to keep your business. Banks, employers, and service providers invest in long-term relationships because it's more profitable than constantly finding new customers. This gives you more leverage than you might think. For credit cards, Schultz points out that calling the retention department directly (rather than general customer service) often leads to better results. He shares his own experience of getting his $600 annual fee cut in half just by making a yearly call. With mortgage negotiations, Schultz suggests getting quotes from 3-5 lenders on the same day, since rates change frequently. A quarter-point rate reduction on a $360,000 mortgage saves $20,000 over the life of the loan. The fees themselves can differ by $5,000 between lenders. When it comes to workplace negotiations, Schultz recommends keeping a weekly log of your accomplishments. Note both your regular duties and times you went above and beyond. This creates a strong foundation for salary discussions. The most effective negotiations frame requests as win-win scenarios. Instead of just asking for tuition reimbursement, explain how additional education will help you contribute more to the company. Rather than demanding a lower rent, offer to sign a longer lease that reduces the landlord's vacancy risk. Schultz emphasizes building relationships during negotiations. The person at the call center has likely dealt with angry customers all day. Being pleasant and making a human connection can lead to better outcomes. The interview also covers negotiating with family members about money, choosing when to negotiate versus pay full price (like at charity shops or with small businesses), and how to time requests effectively. The common thread: success comes from understanding the other party's interests and finding ways to align them with your own. This episode will show you how to save hundreds — or thousands — in your regular spending, simply by asking.",
    "author": "Paula Pant",
    "published": "Mon, 02 Dec 2024 18:59:33 +0000",
    "image": "https://www.podtrac.com/pts/redirect.mp3/pdst.fm/e/pscrb.fm/rss/p/chrt.fm/track/8G441/traffic.megaphone.fm/WWO1673178248.mp3?updated=1732904518",
    "source": "https://affordanything.com/feed/",
    "categories": [
      "Episodes",
      "Personal Finance 101",
      "Save More",
      "Self-Improvement, Psychology and Mindset"
    ]
  },
  {
    "id": "2af8eda4-aec0-4ed4-8326-b73fbb2544fb",
    "title": "#561: Q\u0026A: Why Your Retirement Math Isn’t Adding Up",
    "link": "https://affordanything.com/561-qa-why-your-retirement-math-isnt-adding-up/",
    "description": "Joanne is confident that her short and long-term financial plans are set, but she’s not certain about the medium-term. What’s the proper way to allocate money for different time horizons? Jessie is intrigued by Paul Merriman’s simple portfolio recommendations but wonders about his lean away from growth stocks. Are value funds generally better for everyday investors? Nancy is worried she’ll miscalculate her financial independence number because her net worth includes pre and post-tax money, plus liquid and illiquid investments. What’s the right approach?  Former financial planner Joe Saul-Sehy and I tackle these three questions in today’s episode. Enjoy! P.S. Got a question? Leave it here.",
    "author": "Paula Pant",
    "published": "Tue, 26 Nov 2024 14:10:31 +0000",
    "image": "https://www.podtrac.com/pts/redirect.mp3/pdst.fm/e/pscrb.fm/rss/p/chrt.fm/track/8G441/traffic.megaphone.fm/WWO3617848417.mp3?updated=1732572484",
    "source": "https://affordanything.com/feed/",
    "categories": [
      "Episodes",
      "FIRE",
      "Personal Finance 101",
      "ask paula",
      "extra savings",
      "financial freedom",
      "financial independence",
      "financial independence strategies",
      "joe saul-sehy",
      "value funds"
    ]
  },
  {
    "id": "e7f99c7d-1470-42b8-b747-325a63743183",
    "title": "I’m Still Alive; also, join the 7th Annual Uber Frugal Month Group Challenge!",
    "link": "https://frugalwoods.com/2023/12/13/im-still-alive-also-join-the-7th-annual-uber-frugal-month-group-challenge/",
    "description": "I’m still here! I took an unplanned (and therefore unannounced) break from writing the blog, which was intended to be for a week, but expanded to a month and then two months… WHOOPS. I confess I needed some time off from ye olde Frugalwoods after consistently posting for 9.5 years. That’s the longest I’ve ever done any one job and I realized during this impromptu hiatus that I–gasp–MISSED writing and MISSED all of you. Sometimes one must have some absence in order for one to realize what one misses. So, I’m checking in to let you know that I haven’t died or abandoned Frugalwoods, but that I am trying to discern how often I’ll write going forward. The days of thrice weekly posts are definitively over, but on the other extreme, I don’t particularly want to take full months off again either. Thank you for your patience as I–once again–figure out what I want to do with my life. Continue reading I’m Still Alive; also, join the 7th Annual Uber Frugal Month Group Challenge! at Frugalwoods.",
    "author": "Liz Frugalwoods",
    "published": "Wed, 13 Dec 2023 09:00:00 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/Frugalwoods",
    "categories": [
      "Frugalwoods Philosophy",
      "Uber Frugal Month"
    ]
  },
  {
    "id": "c7a23022-a0cc-4da7-96ca-c861a7a81c5a",
    "title": "Reader Case Study: Yearning For a Debt-Free Future",
    "link": "https://frugalwoods.com/2023/09/29/reader-case-study-yearning-for-a-debt-free-future/",
    "description": "Brian and Michael, both 34, live with their two cats in central Connecticut. Michael works as a project coordinator for a state behavioral health agency serving young people and has a side job as an advocate and disability leadership coordinator. Brian is a quality assurance manager for a state-run hospital. The couple’s been together since 2013 and looks forward to celebrating their 10-year anniversary in November. While Brian and Michael have achieved a lot, they feel as though their debt and lack of home ownership is holding them back. They’d like our advice on how to unlock this next level of adulting and, crucially, how to be permanently debt-free. What’s a Reader Case Study? Case Studies address financial and life dilemmas that readers of Frugalwoods send in requesting advice. Then, we (that’d be me and YOU, dear reader) read through their situation and provide advice, encouragement, insight and feedback in the comments section. Continue reading Reader Case Study: Yearning For a Debt-Free Future at Frugalwoods.",
    "author": "Liz Frugalwoods",
    "published": "Fri, 29 Sep 2023 08:00:00 +0000",
    "image": "https://frugalwoods.com/wp-content/uploads/2023/09/rcs-150x150.jpg",
    "source": "https://feeds.feedburner.com/Frugalwoods",
    "categories": [
      "Reader Case Studies",
      "featured"
    ]
  },
  {
    "id": "5a9e757b-18e5-4621-ba6f-e08d0b8dacbe",
    "title": "Financial Peace University vs. True Financial Freedom vs. Crown Financial MoneyLife",
    "link": "https://www.goodfinancialcents.com/financial-peace-university-vs-true-financial-freedom-vs-crown-financial-moneylife/",
    "description": "I recently completed three of the top Christian financial education programs for churches: SeedTime’s True Financial Freedom, Dave Ramsey’s Financial Peace University, and Crown Financial’s MoneyLife. These popular programs all claim to help you get control of your finances from a biblical perspective. However, they go about it in different ways with varying teaching styles […] The post Financial Peace University vs. True Financial Freedom vs. Crown Financial MoneyLife appeared first on Good Financial Cents®.",
    "author": "Dylan Drake",
    "published": "Thu, 13 Jun 2024 20:29:12 +0000",
    "image": "https://www.goodfinancialcents.com/wp-content/uploads/2024/06/Screenshot-2024-06-13-at-3.14.12 PM-1024x450.png",
    "source": "https://www.goodfinancialcents.com/feed/",
    "categories": [
      "Debt"
    ]
  },
  {
    "id": "88d65709-8f25-40cc-b2d5-b81f755115ad",
    "title": "6 Ways to Help Your Child Build Credit During College",
    "link": "https://www.goodfinancialcents.com/6-ways-to-help-your-child-build-credit-during-college/",
    "description": "College students have a lot on their plate already, including the need to study to get good grades, participating in any number of on-campus activities and potentially working part-time to have some spending money. That said, college students should also focus on their financial future, including steps they can take to build credit before they […] The post 6 Ways to Help Your Child Build Credit During College appeared first on Good Financial Cents®.",
    "author": "Jeff Rose, CFP®",
    "published": "Mon, 12 Feb 2024 17:55:46 +0000",
    "image": "https://www.goodfinancialcents.com/wp-content/uploads/2024/02/College-Ave-Ambition-Card-1024x549.png",
    "source": "https://www.goodfinancialcents.com/feed/",
    "categories": [
      "Credit",
      "Unclassified"
    ]
  },
  {
    "id": "4d805468-e7b9-4056-afc7-08208c3d11a1",
    "title": "2025 Wall Street S\u0026P 500 Forecasts Are All Bullish – Uh Oh!",
    "link": "https://www.financialsamurai.com/2025-wall-street-sp-500-forecasts/",
    "description": "The 2025 Wall Street S\u0026P 500 forecasts are rolling in, and so far, the outlook is all bullish. I haven't found a single bearish forecast, which is somewhat worrisome. Most firms project the S\u0026P 500 will close 2025 around 6,500—a solid 8.3% gain from the current ~6,000 level. If 2024 ends as expected, with the […] The post 2025 Wall Street S\u0026P 500 Forecasts Are All Bullish – Uh Oh! appeared first on Financial Samurai.",
    "author": "Financial Samurai",
    "published": "Mon, 02 Dec 2024 11:48:00 +0000",
    "image": "",
    "source": "https://www.financialsamurai.com/feed/",
    "categories": [
      "Investments"
    ]
  },
  {
    "id": "a63e6edd-9895-483a-96fc-5ded48f5c3a6",
    "title": "How One Lucky Financial Break Can Change Everything For Good",
    "link": "https://www.financialsamurai.com/lucky-financial-break/",
    "description": "I firmly believe that above-average wealth is largely a result of luck – around 60% – 70%. If we fail to recognize our lucky financial breaks, we risk confusing our abilities with good economic times. This overconfidence can lead to poor decisions and increase the likelihood of financial ruin. Since starting Financial Samurai in 2009, I’ve witnessed […] The post How One Lucky Financial Break Can Change Everything For Good appeared first on Financial Samurai.",
    "author": "Financial Samurai",
    "published": "Fri, 29 Nov 2024 12:28:00 +0000",
    "image": "https://www.financialsamurai.com/wp-content/uploads/2018/09/Personal-lessons-learned-since-the-2008-financial-crisis.m4a",
    "source": "https://www.financialsamurai.com/feed/",
    "categories": [
      "Retirement"
    ]
  },
  {
    "id": "b35b3623-4cad-44a8-8e92-8ed9f02f0552",
    "title": "The Richest Man in Babylon (7 lessons for financial success)",
    "link": "https://www.iwillteachyoutoberich.com/richest-man-in-babylon/",
    "description": "The financial principles from The Richest Man in Babylon, by George Samuel Clason, might be nearly 100 years old, but they’ve stood the test of time. These lessons on consistent saving, smart investing, and building wealth still hold up in today’s complex financial market. In this article, I’ll break down these timeless principles and show […] Source",
    "author": "Ramit Sethi",
    "published": "Wed, 23 Oct 2024 06:28:28 +0000",
    "image": "",
    "source": "https://www.iwillteachyoutoberich.com/feed/",
    "categories": [
      "Personal Finance",
      "Recommended Books"
    ]
  },
  {
    "id": "4830736c-b2a2-4173-b630-e3229466b5b9",
    "title": "How to Win Any Competition You Enter (against all odds)",
    "link": "https://www.iwillteachyoutoberich.com/how-to-win-any-competition-you-enter/",
    "description": "Most people spot an opportunity and eliminate themselves before trying. They assume they won’t win and give up before the competition starts. In this article, you’ll learn how to win any competition you enter by breaking through mental barriers and using strategies that set you apart. Step 1: Don’t Let The Fear of Rejection Stop […] Source",
    "author": "Ramit Sethi",
    "published": "Tue, 22 Oct 2024 21:58:59 +0000",
    "image": "",
    "source": "https://www.iwillteachyoutoberich.com/feed/",
    "categories": [
      "Personal Development \u0026 Productivity",
      "Mindset"
    ]
  },
  {
    "id": "6ff10283-e900-40bc-988a-fee7ba06889b",
    "title": "Here’s My Daily Trading Routine That I’ve Used For 10+ Years",
    "link": "https://www.learntotradethemarket.com/forex-trading-strategies/daily-trading-routine-nial-fuller",
    "description": "Here’s what you need to know about trading routines: Trading routines, are the real key to success in the market. There’s no magic indicator or algorithmic trading robot that is going to easily make you a profitable trader. Just like Bill Gates routine each and everyday, over the course of years, led him to insane financial success, so will your trading routine. The post Here’s My Daily Trading Routine That I’ve Used For 10+ Years first appeared on Learn To Trade The Market.",
    "author": "Nial Fuller",
    "published": "Sun, 20 Jun 2021 22:00:31 +0000",
    "image": "",
    "source": "https://www.learntotradethemarket.com/feed",
    "categories": [
      "Forex Trading Strategies By Nial Fuller"
    ]
  },
  {
    "id": "d86fca41-ecea-4eff-b730-88bb0ce3f28b",
    "title": "Beware Of Scammers Impersonating Nial Fuller On Social Media",
    "link": "https://www.learntotradethemarket.com/nial-fullers-blog/nial-fuller-scam-warning",
    "description": "There are scammers impersonating Nial Fuller (pretending to be me) on social media sites and other websites across the internet. These impersonators are actively contacting our members and followers on social media chat apps and platforms. The fake scam accounts will initially appear as me (Nial Fuller), with similar profile pictures and text to my real profiles. The impersonators will try to talk with you for some time before eventually offering you a 'trade for you service' or a 'managed account service' or something similar to this. The post Beware Of Scammers Impersonating Nial Fuller On Social Media first appeared on Learn To Trade The Market.",
    "author": "Nial Fuller",
    "published": "Tue, 18 May 2021 09:03:19 +0000",
    "image": "",
    "source": "https://www.learntotradethemarket.com/feed",
    "categories": [
      "Nial Fullers’ Blog"
    ]
  },
  {
    "id": "2d161e91-4d57-4159-aea9-99ba515daad0",
    "title": "10 Ways to Get $10 Free PayPal Money Instantly",
    "link": "https://millennialmoney.com/free-10-dollars-paypal-instantly/",
    "description": "The post 10 Ways to Get $10 Free PayPal Money Instantly appeared first on Millennial Money. While some sites offer $10 free PayPal money instantly, some of these methods actually require time, effort, and patience. The post 10 Ways to Get $10 Free PayPal Money Instantly appeared first on Millennial Money.",
    "author": "Grant Sabatier",
    "published": "Sat, 29 Jun 2024 15:13:06 +0000",
    "image": "https://millennialmoney.com/wp-content/uploads/2022/07/branded-surveys-logo-square.svg",
    "source": "https://millennialmoney.com/feed/",
    "categories": [
      "Fast Cash"
    ]
  },
  {
    "id": "24c9542e-3fed-42fa-b861-5bfcc8299aef",
    "title": "How To Make Money Without a Car in 2024",
    "link": "https://millennialmoney.com/make-money-without-a-car/",
    "description": "The post How To Make Money Without a Car in 2024 appeared first on Millennial Money. Whether you want to make some extra spending money or are looking for a full-time career opportunity, there are many ways to make make money without a car! The post How To Make Money Without a Car in 2024 appeared first on Millennial Money.",
    "author": "Grant Sabatier",
    "published": "Thu, 20 Jun 2024 15:04:12 +0000",
    "image": "https://millennialmoney.com/wp-content/uploads/2019/10/mypoints.jpg",
    "source": "https://millennialmoney.com/feed/",
    "categories": [
      "Fast Cash"
    ]
  },
  {
    "id": "43b75db0-67c9-4237-88a7-d60fd200d623",
    "title": "4 Purposes for a Proactive Financial Calendar",
    "link": "https://moneyning.com/money-management/4-purposes-for-a-proactive-financial-calendar/",
    "description": "I’m obsessed with organization. You know — one of those people who writes something down just so they can cross it off. While I’m overly organized in most areas of life, one area I could stand to improve in is financial planning, and one practical way I could do this is to create a proactive […] The post 4 Purposes for a Proactive Financial Calendar first appeared on MoneyNing.",
    "author": "Jessica Sommerfield",
    "published": "Mon, 02 Dec 2024 16:33:18 +0000",
    "image": "https://moneyning.com/wp-content/uploads/2016/07/neatness.jpg",
    "source": "http://feeds.feedburner.com/MoneyNing",
    "categories": [
      "Money Management",
      "Better Yourself",
      "Budgeting",
      "Planning"
    ]
  },
  {
    "id": "e2abe523-ff8d-4ba6-b68a-f88dd99fdd97",
    "title": "Are You TOO Cheap? 4 Ways Cheaping Out Could Cost You in the Long Run",
    "link": "https://moneyning.com/life-style/are-you-too-cheap-4-ways-cheaping-out-could-cost-you-in-the-long-run/",
    "description": "Many people tend to focus too much on upfront costs, and not enough on the long term costs sometimes. Cheaping out right now could actually end up costing you quite a bit. Sure, you want to save money and look for the best value for your dollar. But if you are too cheap, you could […] The post Are You TOO Cheap? 4 Ways Cheaping Out Could Cost You in the Long Run first appeared on MoneyNing.",
    "author": "Miranda Marquit",
    "published": "Tue, 26 Nov 2024 18:17:08 +0000",
    "image": "https://moneyning.com/wp-content/uploads/2018/12/penny-jar.jpg",
    "source": "http://feeds.feedburner.com/MoneyNing",
    "categories": [
      "Lifestyle",
      "Frugal Living"
    ]
  },
  {
    "id": "bbeb4b10-1bbd-42f7-8ef4-d2e917509fab",
    "title": "How to Save Money This Holiday Shopping Season",
    "link": "https://www.makingsenseofcents.com/2024/12/how-to-save-money-this-holiday-shopping-season.html",
    "description": "The following is a sponsored collaboration with Rakuten, my favorite cash back app. You can sign up for Rakuten by clicking here and you can get a $40 sign up bonus when you make a qualifying purchase. The holiday season is one of the most happy times of the year, but it can also be... The post How to Save Money This Holiday Shopping Season appeared first on Making Sense Of Cents.",
    "author": "Michelle Schroeder-Gardner",
    "published": "Mon, 02 Dec 2024 12:19:00 +0000",
    "image": "",
    "source": "https://www.makingsenseofcents.com/feed",
    "categories": [
      "Money Management",
      "Save Money"
    ]
  },
  {
    "id": "beb008ca-f545-4739-8d04-a2ec0d61eee7",
    "title": "My Favorite Black Friday Weekend Deals",
    "link": "https://www.makingsenseofcents.com/2024/11/my-favorite-black-friday-weekend-deals.html",
    "description": "Hello! The deals have started. Today, I have created a Black Friday and Cyber Monday roundup of the best deals I have found. The deals below will help you grow your website, make money blogging, add legal templates to your blog, work from home, and more. The resources included here are all my favorites! Note:... The post My Favorite Black Friday Weekend Deals appeared first on Making Sense Of Cents.",
    "author": "Michelle Schroeder-Gardner",
    "published": "Wed, 27 Nov 2024 12:39:00 +0000",
    "image": "",
    "source": "https://www.makingsenseofcents.com/feed",
    "categories": [
      "Extra Income"
    ]
  },
  {
    "id": "f2cfbfc7-8b93-4ed0-aa6b-5ce6d81b98f8",
    "title": "21 Best Bank Promotions \u0026 Bonus Offers for December 2024",
    "link": "https://www.moneycrashers.com/best-new-bank-account-promotions-offers/",
    "description": "Sorting through the best bank account offers can take forever. And by the time you find them all, decide which one, and leap, the offer's already gone. But this running list will give you the edge you need to pounce when the time is right. The post 21 Best Bank Promotions \u0026 Bonus Offers for December 2024 appeared first on Money Crashers.",
    "author": "Brian Martucci",
    "published": "Sun, 01 Dec 2024 02:00:00 +0000",
    "image": "",
    "source": "https://www.moneycrashers.com/feed/",
    "categories": [
      "Manage Money",
      "Banking"
    ]
  },
  {
    "id": "b7853b24-657d-42dc-b7f7-4629a1bda086",
    "title": "10 Best New Brokerage Account Promotions \u0026 Bonus Offers of December 2024",
    "link": "https://www.moneycrashers.com/best-brokerage-account-promotions-bonus-offers/",
    "description": "Did you know America’s top investment platforms also offer impressive new-account bonuses? Top-tier brokerage account promotions dwarf the leading bank and credit card promotions, promising thousands to new customers. That makes now the right time to consider a new brokerage firm. The post 10 Best New Brokerage Account Promotions \u0026 Bonus Offers of December 2024 appeared first on Money Crashers.",
    "author": "Brian Martucci",
    "published": "Sun, 01 Dec 2024 00:00:00 +0000",
    "image": "",
    "source": "https://www.moneycrashers.com/feed/",
    "categories": [
      "Invest Money"
    ]
  },
  {
    "id": "3d277117-c5c4-4d22-90c9-08836d6aa9c0",
    "title": "Robinhood Acquires TradePMR To Refer Next-Gen HNW Clients To On-Platform RIAs (And More Of The Latest In Financial #AdvisorTech – December 2024)",
    "link": "https://feeds.feedblitz.com/~/908733485/0/kitcesnerdseyeview~Robinhood-Acquires-TradePMR-To-Refer-NextGen-HNW-Clients-To-OnPlatform-RIAs-And-More-Of-The-Latest-In-Financial-AdvisorTech-%e2%80%93-December/",
    "description": "Welcome to the December 2024 issue of the Latest News in Financial #AdvisorTech – where we look at the big news, announcements, and underlying trends and developments that are emerging in the world of technology solutions for financial advisors! This month's edition kicks off with the news that the retail brokerage platform Robinhood is acquiringRead More... The post Robinhood Acquires TradePMR To Refer Next-Gen HNW Clients To On-Platform RIAs (And More Of The Latest In Financial #AdvisorTech – December 2024) first appeared on Kitces.com.",
    "author": "Ben Henry-Moreland",
    "published": "Mon, 02 Dec 2024 12:01:27 +0000",
    "image": "https://feeds.feedblitz.com/~/i/908733485/0/kitcesnerdseyeview",
    "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
    "categories": [
      "Technology \u0026 Advisor FinTech",
      "OPTIN: One Page Business Plan (BAR)",
      "OPTIN: One Page Business Plan (SLIDE IN)"
    ]
  },
  {
    "id": "8f736046-704f-4c5b-adbc-2c0f0b9c75d6",
    "title": "Weekend Reading For Financial Planners (November 30–December 1)",
    "link": "https://feeds.feedblitz.com/~/908621774/0/kitcesnerdseyeview~Weekend-Reading-For-Financial-Planners-November-%e2%80%93December/",
    "description": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that a recent study from Cerulli Associates shows that consumer trust in financial services companies has increased significantly over the past decade, with firms that provide a more personalized approach to providing financial advice seeing the bestRead More... The post Weekend Reading For Financial Planners (November 30–December 1) first appeared on Kitces.com.",
    "author": "Adam Van Deusen",
    "published": "Fri, 29 Nov 2024 19:00:22 +0000",
    "image": "https://feeds.feedblitz.com/~/i/908621774/0/kitcesnerdseyeview",
    "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
    "categories": [
      "Weekend Reading",
      "OPTIN: Value Of Advice (BAR)",
      "OPTIN: Value Of Advice (SLIDE IN)"
    ]
  },
  {
    "id": "8f5b72fd-f1c3-4d00-98d8-7c348282cc8a",
    "title": "Why December is the Best Time to Get the AmEx Platinum",
    "link": "https://www.nerdwallet.com/article/travel/amex-platinum-december",
    "description": "is one of the top premium travel cards available. It comes with travel credits, hotel elite status, access to an impressive lounge collection, travel protections and other luxury perks. Terms…",
    "author": "Sally French",
    "published": "Tue, 03 Dec 2024 00:21:59 +0000",
    "image": "https://www.nerdwallet.com/blog/content/themes/nerdwallet/assets/tracking/nw-pixel-v1.gif?post_id=1669076",
    "source": "https://www.nerdwallet.com/blog/feed/",
    "categories": [
      "Reward Optimization",
      "Travel",
      "Travel Credit Cards"
    ]
  },
  {
    "id": "a0fd96b8-ad85-490f-934d-d9b3effa9d6c",
    "title": "Smart Money Podcast — Travel Smart, Give Smart: Southwest Companion Pass and Charitable Giving Strategies",
    "link": "https://www.nerdwallet.com/article/finance/smart-money-podcast-travel-smart-give-smart-southwest-companion-pass-and-charitable-giving-strategies",
    "description": "Learn how to maximize Southwest Companion Pass benefits and how to plan effective charitable giving to make your donations count.",
    "author": "Sean Pyles",
    "published": "Mon, 02 Dec 2024 17:00:02 +0000",
    "image": "https://www.nerdwallet.com/blog/content/themes/nerdwallet/assets/tracking/nw-pixel-v1.gif?post_id=1668253",
    "source": "https://www.nerdwallet.com/blog/feed/",
    "categories": [
      "Personal Finance"
    ]
  },
  {
    "id": "9dce9d7f-9ce1-4771-a703-4028a3b81b4f",
    "title": "Qualified Charitable Distributions (QCDs): Concerns from First-Timers",
    "link": "https://obliviousinvestor.com/qualified-charitable-distributions-qcds-concerns-from-first-timers/",
    "description": "Sometimes I receive questions from people who are doing a qualified charitable distribution (QCD) for the first time and something doesn’t go the way they expected. Most often: “The brokerage firm didn’t report the distribution as a QCD. I just got a regular Form 1099-R which included the distribution.” “The receipt from the charity did […]",
    "author": "Mike",
    "published": "Mon, 02 Dec 2024 13:00:54 +0000",
    "image": "https://www.obliviousinvestor.com/wp-content/uploads/2014/04/NewBook8CoverTiltedScaled2.png",
    "source": "https://obliviousinvestor.com/feed/",
    "categories": [
      "More Than Enough"
    ]
  },
  {
    "id": "265b1aee-d818-47d3-be10-c350c4455155",
    "title": "Investing Blog Roundup: John Rekenthaler Bids Farewell",
    "link": "https://obliviousinvestor.com/__trashed-2/",
    "description": "I don’t think there’s anybody whom I can definitively say has taught me more about investing through their writing than John Rekenthaler. I feel like I’ve been reading his Morningstar column forever. Rekenthaler just recently announced his retirement. And his parting article is exactly in keeping with his others: thoughtful, with practical applications. Farewell, For […]",
    "author": "Mike",
    "published": "Mon, 25 Nov 2024 13:00:31 +0000",
    "image": "https://www.obliviousinvestor.com/wp-content/uploads/2014/04/NewBook8CoverTiltedScaled2.png",
    "source": "https://obliviousinvestor.com/feed/",
    "categories": [
      "Roundup"
    ]
  },
  {
    "id": "4fad889b-1fb1-465f-9c21-000322d7a75f",
    "title": "We want to buy your groceries! (Instacart Gift Card Giveaway — 2 Winners!)",
    "link": "https://moneysavingmom.com/12-days-of-christmas-giveaway-instacart-250-gift-card-2-winners/",
    "description": "Christmas will be here before we know it, and to celebrate, we want to show our appreciation for all of you who show up here and follow along regularly! To celebrate the holiday season and to say THANK YOU for being here, we’re doing a FUN 12 Days of Christmas Giveaway! For the next few weeksRead More",
    "author": "Meagan",
    "published": "Mon, 02 Dec 2024 22:01:19 +0000",
    "image": "https://moneysavingmom.com/wp-content/uploads/2024/12/250-1.png",
    "source": "https://moneysavingmom.com/feed/",
    "categories": [
      "Giveaways",
      "LITE Feed (non-deal) Posts"
    ]
  },
  {
    "id": "076b83b5-a3e3-4f8f-8859-b9422879ac55",
    "title": "All The Best Cyber Monday 2024 Deals Still Available!",
    "link": "https://moneysavingmom.com/all-the-best-cyber-monday-2024-deals-still-available/",
    "description": "Cyber Monday had so many HOT deals this year! The deals were flying FAST today and our team all agreed it has been some of the BEST deals we’ve seen in years! Worried you missed one? Here’s a round-up of all the best deals that are still available from the last few days. Hottest Deals StreamingRead More",
    "author": "Gretchen",
    "published": "Mon, 02 Dec 2024 22:00:00 +0000",
    "image": "https://moneysavingmom.com/wp-content/uploads/2024/11/unnamed-2.jpg",
    "source": "https://moneysavingmom.com/feed/",
    "categories": [
      "Black Friday Deals",
      "Cyber Monday Deals",
      "Deals",
      "Hot Deals",
      "Online Deals",
      "Black Friday Deals 2024",
      "Cyber Monday Deals 2024"
    ]
  },
  {
    "id": "9b5e9559-56b5-4e92-ae9e-765dbff67df1",
    "title": "565: Why Your Social Media Strategy Isn’t Working—and How to Fix It",
    "link": "https://mywifequitherjob.com/episode565/",
    "description": "Today, we’re continuing on with our multi part series on how to create content to promote your business.   In this episode, you’ll learn how to use social media to grow your brand. What You’ll Learn The right and wrong way to use social media The best social media platform for promotion What it takes to be successful Sponsors SellersSummit.com – The Sellers Summit is the ecommerce conference that I’ve run for the past 8 years. It’s small and intimate and you’ll learn a ton! Click Here To Grab The Recordings. The Family First Entrepreneur – Purchase my Wall Street […] The post 565: Why Your Social Media Strategy Isn’t Working—and How to Fix It appeared first on MyWifeQuitHerJob.com.",
    "author": "Steve Chou",
    "published": "Thu, 28 Nov 2024 18:53:18 +0000",
    "image": "https://traffic.libsyn.com/mywifequitherjob/MWQHJ565SteveToni.mp3",
    "source": "https://mywifequitherjob.com/feed/",
    "categories": [
      "Social Media",
      "The My Wife Quit Her Job Podcast With Steve Chou"
    ]
  },
  {
    "id": "1a97b67f-59fe-45ac-b70c-ef8d222075f5",
    "title": "564: Blogging Is Dead…Or Is It? What’s Actually Happening With Google",
    "link": "https://mywifequitherjob.com/episode564/",
    "description": "Is blogging still worth it in 2024? With Google favoring AI answers, quick snippets, and big-name sites, it’s getting tougher for blogs to stand out. In this episode, we break down what’s going on and whether blogging still has a shot in today’s online world. What You’ll Learn Google’s Answer To AI Spam Is Blogging Still A Viable Option Today When Does Blogging Still Work? Sponsors SellersSummit.com – The Sellers Summit is the ecommerce conference that I’ve run for the past 8 years. It’s small and intimate and you’ll learn a ton! Click Here To Grab The Recordings. The Family […] The post 564: Blogging Is Dead…Or Is It? What’s Actually Happening With Google appeared first on MyWifeQuitHerJob.com.",
    "author": "Steve Chou",
    "published": "Wed, 20 Nov 2024 15:41:45 +0000",
    "image": "https://traffic.libsyn.com/mywifequitherjob/MWQHJ564SteveToni.mp3",
    "source": "https://mywifequitherjob.com/feed/",
    "categories": [
      "Blogging",
      "The My Wife Quit Her Job Podcast With Steve Chou"
    ]
  },
  {
    "id": "c9ece8c5-54f6-4a5f-beb4-0215427331d9",
    "title": "A Good Credit Score is a Tool for Your Personal Finances",
    "link": "https://www.savingadvice.com/articles/2024/12/02/10149341_a-good-credit-score-is-a-tool-for-your-personal-finances.html",
    "description": "Have you ever had to take out a loan? Rent an apartment? Get a rental car? Interview for a job? Your credit score can impact...",
    "author": "Allen Francis",
    "published": "Mon, 02 Dec 2024 18:17:16 +0000",
    "image": "https://www.savingadvice.com/wp-content/uploads/2024/11/good-credit-score1.jpg",
    "source": "https://www.savingadvice.com/feed/",
    "categories": [
      "credit",
      "Credit",
      "credit history",
      "credit score",
      "financial planning",
      "Personal Finance"
    ]
  },
  {
    "id": "66a67315-b51a-4dd1-8f13-f7747fa2c2d5",
    "title": "Want to Master Money? Here Are 8 Financial Literacy Books for Teens on Amazon",
    "link": "https://www.savingadvice.com/articles/2024/11/29/10149852_want-to-master-money-here-are-8-financial-literacy-books-for-teens-on-amazon.html",
    "description": "123rf Teaching teens about money management is one of the best investments you can make in their future. Financial literacy for teens lays the foundation...",
    "author": "Latrice Perez",
    "published": "Fri, 29 Nov 2024 12:00:58 +0000",
    "image": "https://www.savingadvice.com/wp-content/uploads/2024/11/Financial-Literacy-Books-PIC-scaled-1.jpg",
    "source": "https://www.savingadvice.com/feed/",
    "categories": [
      "Amazon financial literacy books",
      "best financial books for teenagers",
      "books for teens about money",
      "budgeting for teens",
      "financial literacy for teens",
      "kids and money",
      "money management for teens",
      "Personal Finance",
      "teaching teens about finances"
    ]
  },
  {
    "id": "413d3366-dad3-4371-b017-c1c92b329ec2",
    "title": "What Colleges Secretly Look For In Students",
    "link": "https://thecollegeinvestor.com/46957/what-colleges-want-in-students/",
    "description": "When applying for college, academics and extracurricular involvement are essential, but not the only factors. Here's what colleges secretly look for in students. The post What Colleges Secretly Look For In Students appeared first on The College Investor.",
    "author": "Allison Daniel",
    "published": "Mon, 02 Dec 2024 12:15:00 +0000",
    "image": "https://thecollegeinvestor.com/wp-content/uploads/2024/06/The_Secret_To_What_Colleges_Want_In_Students_1200x628.png",
    "source": "https://thecollegeinvestor.com/feed/",
    "categories": [
      "Admissions"
    ]
  },
  {
    "id": "03ca3e80-b7fe-4f17-b00e-a3557c810b09",
    "title": "How To Cash A Tax Refund Check Without A Bank Account?",
    "link": "https://thecollegeinvestor.com/23883/tax-refund-bank-account/",
    "description": "There are various ways to cash a tax refund check when you don't have a bank account. One is to cash a tax refund check using an app. Learn more here! The post How To Cash A Tax Refund Check Without A Bank Account? appeared first on The College Investor.",
    "author": "Hannah Rounds",
    "published": "Mon, 02 Dec 2024 08:15:00 +0000",
    "image": "https://thecollegeinvestor.com/wp-content/uploads/2017/11/WP_REFUND.jpg",
    "source": "https://thecollegeinvestor.com/feed/",
    "categories": [
      "Taxes"
    ]
  },
  {
    "id": "e6481aeb-cc7d-4a96-b1b0-59e2e5c50a95",
    "title": "FlexJobs Review: Is FlexJobs Legit? Read Before Signing Up…",
    "link": "https://www.sidehustlenation.com/flexjobs-review/",
    "description": "FlexJobs promises to connect remote job seekers with verified, scam-free job listings. But is it worth paying for?",
    "author": "Nick Loper",
    "published": "Thu, 16 May 2024 19:13:58 +0000",
    "image": "https://getlasso.co/wp-content/uploads/flexjobs-logo.png",
    "source": "https://www.sidehustlenation.com/feed",
    "categories": [
      "Reviews"
    ]
  },
  {
    "id": "a0729c46-63df-4f21-aeaa-590f9f368d22",
    "title": "How to Start a Billboard Business: $30k a Month Part-Time",
    "link": "https://www.sidehustlenation.com/how-to-start-a-billboard-business/",
    "description": "Even with the rise of digital technology, billboards remain a profitable business. In fact, Chris Brown built his billboard side hustle to $30,000 a month (part-time!). Chris now owns approximately 30 billboards around Bentonville, Arkansas, and retired early at the age of 42.",
    "author": "Nick Loper",
    "published": "Thu, 16 May 2024 09:00:44 +0000",
    "image": "https://traffic.megaphone.fm/YAP8304129779.mp3",
    "source": "https://www.sidehustlenation.com/feed",
    "categories": [
      "Hustle 101"
    ]
  },
  {
    "id": "c69540dd-c250-4876-9110-b69b8e1550d5",
    "title": "Best Turkey Prices For 2024",
    "link": "https://wellkeptwallet.com/best-turkey-prices-at-grocery-stores/",
    "description": "When it comes to finding the best price on your Thanksgiving Turkey, we have you covered. Once again this year, we’re rounding up the best turkey prices at grocery stores across the nation! NOTE: Check back frequently as stores are marking prices daily. Those with updated 2024 means we have posted the current price. Best... The post Best Turkey Prices For 2024 appeared first on Well Kept Wallet.",
    "author": "Laura Wales",
    "published": "Tue, 05 Nov 2024 09:30:00 +0000",
    "image": "",
    "source": "https://wellkeptwallet.com/feed/",
    "categories": [
      "Save Money"
    ]
  },
  {
    "id": "cd5af8f1-1f88-463a-8a12-96004647063c",
    "title": "Motley Fool vs. Action Alerts PLUS",
    "link": "https://wellkeptwallet.com/motley-fool-vs-action-alerts-plus/",
    "description": "Motley Fool Stock Advisor and TheStreet’s Action Alerts PLUS are two popular stock-picking services. They can help you find individual stocks that will outperform the broad stock market. However, each service caters to a different investment strategy, has varying recommendation frequencies and provides different platform features.  This Motley Fool Stock Advisor vs. TheStreet’s Action Alerts... The post Motley Fool vs. Action Alerts PLUS appeared first on Well Kept Wallet.",
    "author": "Josh Patoka",
    "published": "Mon, 21 Oct 2024 14:29:36 +0000",
    "image": "",
    "source": "https://wellkeptwallet.com/feed/",
    "categories": [
      "Investing"
    ]
  }
]
