{
  "id": "14e5ef57-1ad2-4850-b991-0c30b8cd77bb",
  "title": "This Unbelievably Good Soup Tastes Exactly Like a Loaded Baked Potato",
  "link": "https://www.thekitchn.com/best-loaded-baked-potato-soup-recipe-23709594?utm_source=RSS\u0026utm_medium=feed\u0026utm_campaign=Category%2FChannel%3A+main",
  "description": "It’s all about the toppings. READ MORE...",
  "author": "Christine Gallary",
  "published": "Sun, 16 Feb 2025 14:00:00 -0500",
  "source": "https://www.thekitchn.com/main.rss",
  "categories": [
    "Recipes",
    "Recipe",
    "SEO February 2025",
    "Soups \u0026amp; Stews",
    "Potatoes",
    "Vegetables",
    "Root Vegetables",
    "Appetizers \u0026amp; Snacks",
    "appetizer",
    "Make Ahead",
    "soup",
    "stovetop",
    "One-Dish Meal",
    "Keeps Well",
    "Lunch"
  ],
  "byline": "Christine Gallary",
  "length": 5677,
  "excerpt": "It’s all about the toppings.",
  "siteName": "Kitchn",
  "favicon": "https://www.thekitchn.com/static/icons/favicon-32x32.png",
  "text": "RecipesSoups \u0026 StewsChristine GallarySenior Recipe EditorAfter graduating from Le Cordon Bleu in Paris, I worked at Cook's Illustrated and CHOW's test kitchens. I've edited and tested recipes for more than 15 years, including developing recipes for the James Beard-award winning Mister Jiu's in Chinatown cookbook. My favorite taste testers are my husband, Hayden, and daughter, Sophie.published about 4 hours agoCredit: Photo: Alex Lepe; Food Stylist: Rachel PerlmutterEach spoonful is packed full of flavor.Serves4 to 6MakesMakes 8 cupsPrep15 minutes to 20 minutesCook30 minutes to 40 minutesWe independently select these products—if you buy from one of our links, we may earn a commission. All prices were accurate at the time of publishing.Credit: Photo: Alex Lepe; Food Stylist: Rachel PerlmutterMy favorite thing to order at a steakhouse has never been a big, juicy steak. All I want are the side dishes, which has to include a giant baked potato loaded up with all the toppings. This decadent combo of fluffy potato, butter, cheese, sour cream, and bacon is a classic that I never stray from because I love it so much. Here, I channeled all this deliciousness into a loaded baked potato soup, which delivers all the same flavors without turning on the oven and waiting for a potato to bake. In just about 30 minutes of cooking time, you get a creamy, hearty potato soup that you can garnish with all the toppings to your heart’s content. It’s a hug in a bowl that will make even the coldest nights a bit more tolerable.Why You’ll Love It It tastes just like a fully loaded baked potato. Creamy potato, smoky bacon, cheese, and the tang of sour cream are in every single spoonful, just like the classic steakhouse side dish. The texture is up to you! You can opt for a chunky soup, or blend it into a velvety-smooth texture — the choice is yours. Credit: Photo: Alex Lepe; Food Stylist: Rachel PerlmutterKey Ingredients in Loaded Baked Potato Soup Russet potatoes: A fluffy baked potato starts with russet potatoes, and this soup uses the same potatoes because they become tender and break down easily. Bacon: The fat from smoky bacon infuses the soup with flavor, and the crispy crumbles become the garnish. Milk: You’ll need a quart of whole milk for this soup, which adds enough richness without making the soup too heavy. Cheddar cheese: Stir sharp cheddar cheese into the soup and use it as a topping. Sour cream: A small amount adds richness and a very mild tang to the soup. How to Make Loaded Baked Potato Soup Cook the bacon and onion. Cook a few strips of bacon until browned and crisp, then cook the diced onion in the bacon fat. Add the liquids. Pour in the chicken broth, then milk, and bring to a boil. Cook the potatoes. Add the diced potatoes and simmer until tender. Choose the texture. You can just mash some of the potatoes a bit for a chunky soup, or blend the soup until smooth. Finish the soup. Stir in sour cream and cheddar cheese. Serve garnished with crumbled bacon, more cheese, and chives or scallions. Helpful Swaps You can substitute low-sodium vegetable broth for the chicken broth. To make this soup vegetarian, skip the bacon and cook the onion in 2 tablespoons of olive oil. Storage and Make-Ahead Tips  The soup can be made up to 2 days ahead and refrigerated in an airtight container. Reheat over medium heat. Leftovers can be refrigerated in an airtight container for up to 4 days. Do not freeze, as the soup will separate. What to Serve with Loaded Baked Potato SoupCommentsEach spoonful is packed full of flavor.Nutritional InfoIngredients4 slices bacon (not thick-cut), halved crosswise1 medium yellow onion, finely chopped (about 1 1/2 cups)1 cup low-sodium chicken broth4 cups (1 quart) whole milk1 3/4 teaspoons kosher salt, plus more as needed1/4 teaspoon freshly ground black pepper, plus more as needed2 pounds large russet potatoes, peeled and cut into 3/4-inch pieces (about 5 cups)4 ounces shredded sharp cheddar cheese (about 1 cup), plus more for serving1/4 cup sour creamFinely chopped fresh chives or thinly sliced scallions, for servingCook 4 halved bacon slices in a single layer in a Dutch oven or large pot over medium heat, flipping halfway through, until browned and crisp, 8 to 10 minutes total. Using tongs, transfer to a paper towel-lined plate.Add 1 finely chopped medium yellow onion to the bacon fat. Cook, stirring occasionally, until softened, about 5 minutes. Increase the heat to high, add 1 cup low-sodium chicken broth, and scrape up any browned bits from the bottom of the pot. Stir in 4 cups whole milk, 1 3/4 teaspoons kosher salt, and 1/4 teaspoon black pepper. Bring to a boil.Stir in 2 pounds peeled and chopped russet potatoes and bring to a simmer. Simmer, stirring occasionally, until the potatoes are tender, 8 to 10 minutes. Meanwhile, crumble the bacon with your hands into small pieces.Turn off the heat. For a smooth soup, purée the soup in batches in a stand blender until smooth, then return to the pot (or blend directly in the pot with an immersion blender). For a chunky smooth, only blend half the soup or smash the potatoes with a potato masher until the soup is the desired consistency.Return the soup to low heat. Stir in 4 ounces shredded sharp cheddar cheese until melted. Turn off the heat. Stir in 1/4 cup sour cream. Taste and season with more kosher salt and black pepper as needed. Serve garnished with the crumbled bacon, finely chopped fresh chives, and more shredded sharp cheddar cheese as desired.Recipe NotesStorage: Leftovers can be refrigerated in an airtight container for up to 4 days. Do not freeze, as the soup will separate.",
  "image": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FPhoto%2FRecipes%2F2025-02-loaded-baked-potato-soup%2Floaded-baked-potato-soup-186",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ContentBundle\" data-gtm-page-title=\"Loaded Baked Potato Soup\" data-gtm-page-canonical-url=\"https://www.thekitchn.com/best-loaded-baked-potato-soup-recipe-23709594\" data-gtm-page-path=\"/best-loaded-baked-potato-soup-recipe-23709594\" data-gtm-page-type=\"post\" data-gtm-page-post-id=\"23709594\" data-gtm-page-breadcrumb-root=\"Recipes\" data-gtm-page-breadcrumb-path=\"Recipes \u0026gt; Soups \u0026amp; Stews\" data-gtm-page-date-published=\"2025-02-16\" data-gtm-page-date-modified=\"2025-02-14\" data-gtm-page-author=\"Christine Gallary\" data-gtm-page-category=\"Recipes\" data-gtm-page-categories=\"Recipes\" data-gtm-page-tags=\"Recipe, SEO February 2025, Soups \u0026amp;amp; Stews, Potatoes, Vegetables, Root Vegetables, Appetizers \u0026amp;amp; Snacks, appetizer, Make Ahead, soup, stovetop, One-Dish Meal, Keeps Well, Lunch\" data-gtm-page-post-bundle-item-types=\"{\u0026#34;Cloudinary Image\u0026#34;:2,\u0026#34;Recipes\u0026#34;:1}\" data-gtm-page-post-content-class=\"Recipe\" data-page-path=\"/best-loaded-baked-potato-soup-recipe-23709594\"\u003e\u003carticle data-gtm-post-id=\"23709594\"\u003e\u003cdiv\u003e\u003cul data-testid=\"BreadcrumbTrail__breadcrumb\"\u003e\u003cli\u003e\u003ca data-gtm-trigger=\"click\" data-gtm-event-name=\"click\" data-gtm-event-category=\"site_navigation\" data-gtm-ui-component=\"breadcrumb_trail\" data-gtm-list-item-position=\"1\" data-gtm-list-item-total=\"2\" href=\"https://www.thekitchn.com/recipes\"\u003eRecipes\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca data-gtm-trigger=\"click\" data-gtm-event-name=\"click\" data-gtm-event-category=\"site_navigation\" data-gtm-ui-component=\"breadcrumb_trail\" data-gtm-list-item-position=\"2\" data-gtm-list-item-total=\"2\" href=\"https://www.thekitchn.com/collection/soups-stews\"\u003eSoups \u0026amp; Stews\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdialog data-testid=\"PostBylineAuthor__tooltip\"\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.thekitchn.com/authors/christine-gallary\"\u003eChristine Gallary\u003c/a\u003e\u003cspan\u003eSenior Recipe Editor\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAfter graduating from Le Cordon Bleu in Paris, I worked at Cook\u0026#39;s Illustrated and CHOW\u0026#39;s test kitchens. I\u0026#39;ve edited and tested recipes for more than 15 years, including developing recipes for the James Beard-award winning Mister Jiu\u0026#39;s in Chinatown cookbook. My favorite taste testers are my husband, Hayden, and daughter, Sophie.\u003c/p\u003e\u003c/div\u003e\u003c/dialog\u003e\u003c/div\u003e\u003cp\u003e\u003cspan data-testid=\"published-label\"\u003epublished\u003c/span\u003e \u003cspan data-testid=\"published-date\"\u003eabout 4 hours ago\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cfigure data-testid=\"Figure\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" srcset=\"https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1456,h_1092/k%2FPhoto%2FRecipes%2F2025-02-loaded-baked-potato-soup%2Floaded-baked-potato-soup-186 1456w,https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_728,h_546/k%2FPhoto%2FRecipes%2F2025-02-loaded-baked-potato-soup%2Floaded-baked-potato-soup-186 728w,https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1220,h_915/k%2FPhoto%2FRecipes%2F2025-02-loaded-baked-potato-soup%2Floaded-baked-potato-soup-186 1220w,https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_610,h_458/k%2FPhoto%2FRecipes%2F2025-02-loaded-baked-potato-soup%2Floaded-baked-potato-soup-186 610w,https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_750,h_563/k%2FPhoto%2FRecipes%2F2025-02-loaded-baked-potato-soup%2Floaded-baked-potato-soup-186 750w,https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_375,h_282/k%2FPhoto%2FRecipes%2F2025-02-loaded-baked-potato-soup%2Floaded-baked-potato-soup-186 375w\" sizes=\"(min-width: 77rem) 728px,(min-width: 48rem) 610px,(min-width: 0px) 375px\" alt=\"A spoonful of loaded potato soup hovering above the bowl\" fetchpriority=\"auto\" data-gtm-cta-text=\"[image]\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eCredit: Photo: Alex Lepe; Food Stylist: Rachel Perlmutter\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eEach spoonful is packed full of flavor.\u003c/p\u003e\u003ca placement=\"recipe-intro\" href=\"#post-recipe-719720974\"\u003e\u003cp\u003e\u003cspan\u003eServes\u003c/span\u003e\u003cspan\u003e4 to 6\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMakes\u003c/span\u003e\u003cspan\u003eMakes 8 cups\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003ePrep\u003c/span\u003e\u003cspan\u003e15 minutes to 20 minutes\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCook\u003c/span\u003e\u003cspan\u003e30 minutes to 40 minutes\u003c/span\u003e\u003c/p\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWe \u003ca href=\"https://www.thekitchn.com/about/the-kitchn-commerce-guidelines\" target=\"_blank\"\u003eindependently\u003c/a\u003e select these products—if you buy from one of our links, we may earn a commission. All prices were accurate at the time of publishing.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cfigure data-testid=\"Figure\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"A spoonful of loaded potato soup hovering above the bowl\" src=\"https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_730,h_548/k%2FPhoto%2FRecipes%2F2025-02-loaded-baked-potato-soup%2Floaded-baked-potato-soup-186\" data-gtm-cta-text=\"[image]\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eCredit: Photo: Alex Lepe; Food Stylist: Rachel Perlmutter\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp\u003eMy favorite thing to order at a steakhouse has never been a \u003ca href=\"https://www.thekitchn.com/how-to-cook-steak-on-the-stovetop-240330\"\u003ebig, juicy steak\u003c/a\u003e. All I want are the side dishes, which has to include a giant \u003ca href=\"https://www.thekitchn.com/loaded-baked-potato-recipe-23198227\"\u003ebaked potato loaded up with all the toppings\u003c/a\u003e. This decadent combo of fluffy potato, butter, cheese, sour cream, and bacon is a classic that I never stray from because I love it so much. Here, I channeled all this deliciousness into a loaded baked potato soup, which delivers all the same flavors without turning on the oven and waiting for \u003ca href=\"https://www.thekitchn.com/how-to-bake-a-potato-in-the-oven-165615\"\u003ea potato to bake\u003c/a\u003e. In just about 30 minutes of cooking time, you get a creamy, hearty potato soup that you can garnish with all the toppings to your heart’s content. It’s a hug in a bowl that will make even the coldest nights a bit more tolerable.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp data-testid=\"base-html\"\u003e\u003ch2\u003eWhy You’ll Love It\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eIt tastes just like a fully loaded baked potato. \u003c/strong\u003eCreamy potato, smoky bacon, cheese, and the tang of sour cream are in every single spoonful, just like the classic steakhouse side dish.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eThe texture is up to you!\u003c/strong\u003e You can opt for a chunky soup, or blend it into a velvety-smooth texture — the choice is yours.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cfigure data-testid=\"Figure\"\u003e\u003cdiv\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eCredit: Photo: Alex Lepe; Food Stylist: Rachel Perlmutter\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp data-testid=\"base-html\"\u003e\u003ch2\u003eKey Ingredients in Loaded Baked Potato Soup\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eRusset potatoes:\u003c/strong\u003e A fluffy baked potato starts with russet potatoes, and this soup uses the same potatoes because they become tender and break down easily.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eBacon: \u003c/strong\u003eThe fat from smoky bacon infuses the soup with flavor, and the crispy crumbles become the garnish.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eMilk: \u003c/strong\u003eYou’ll need a quart of whole milk for this soup, which adds enough richness without making the soup too heavy.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eCheddar cheese: \u003c/strong\u003eStir sharp cheddar cheese into the soup and use it as a topping.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eSour cream:\u003c/strong\u003e A small amount adds richness and a very mild tang to the soup.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp data-testid=\"base-html\"\u003e\u003ch2\u003eHow to Make Loaded Baked Potato Soup\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003col\u003e\n\u003cli\u003e\u003cstrong\u003eCook the bacon and onion.\u003c/strong\u003e Cook a few strips of bacon until browned and crisp, then cook the diced onion in the bacon fat.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eAdd the liquids.\u003c/strong\u003e Pour in the chicken broth, then milk, and bring to a boil.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eCook the potatoes.\u003c/strong\u003e Add the diced potatoes and simmer until tender.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eChoose the texture. \u003c/strong\u003eYou can just mash some of the potatoes a bit for a chunky soup, or blend the soup until smooth.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eFinish the soup. \u003c/strong\u003eStir in sour cream and cheddar cheese. Serve garnished with crumbled bacon, more cheese, and chives or scallions.\u003c/li\u003e\n\u003c/ol\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp data-testid=\"base-html\"\u003e\u003ch2\u003eHelpful Swaps\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cul\u003e\n\u003cli\u003eYou can substitute low-sodium vegetable broth for the chicken broth.\u003c/li\u003e\n\n\n\n\u003cli\u003eTo make this soup vegetarian, skip the bacon and cook the onion in 2 tablespoons of olive oil.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp data-testid=\"base-html\"\u003e\u003ch2\u003eStorage and Make-Ahead Tips \u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cul\u003e\n\u003cli\u003eThe soup can be made up to 2 days ahead and refrigerated in an airtight container. Reheat over medium heat.\u003c/li\u003e\n\n\n\n\u003cli\u003eLeftovers can be refrigerated in an airtight container for up to 4 days. Do not freeze, as the soup will separate.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp data-testid=\"base-html\"\u003e\u003ch2\u003eWhat to Serve with Loaded Baked Potato Soup\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-porkchop-id=\"719720974\" data-testid=\"Post__item\" id=\"post-recipe-719720974\"\u003e\u003cp\u003e\u003ca href=\"#comments-23709594\" data-gtm-placement=\"recipe\" data-gtm-social-network=\"community\"\u003eComments\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eEach spoonful is packed full of flavor.\u003c/p\u003e\u003cdiv data-testid=\"RecipeNutritionalGuide\"\u003e\u003ch4\u003eNutritional Info\u003c/h4\u003e\u003c/div\u003e\u003csection\u003e\u003ch3\u003eIngredients\u003c/h3\u003e\u003cdiv\u003e\u003cul\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e4 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003eslices bacon (not thick-cut), halved crosswise\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003emedium yellow onion, finely chopped (about 1 1/2 cups)\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003ecup \u003c/span\u003e\u003cspan\u003e\u003cp\u003elow-sodium chicken broth\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e4 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003ecups \u003c/span\u003e\u003cspan\u003e\u003cp\u003e(1 quart) whole milk\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1 3/4 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eteaspoons \u003c/span\u003e\u003cspan\u003e\u003cp\u003ekosher salt, plus more as needed\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1/4 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eteaspoon \u003c/span\u003e\u003cspan\u003e\u003cp\u003efreshly ground black pepper, plus more as needed\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e2 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003epounds \u003c/span\u003e\u003cspan\u003e\u003cp\u003elarge russet potatoes, peeled and cut into 3/4-inch pieces (about 5 cups)\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e4 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eounces \u003c/span\u003e\u003cspan\u003e\u003cp\u003eshredded sharp cheddar cheese (about 1 cup), plus more for serving\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1/4 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003ecup \u003c/span\u003e\u003cspan\u003e\u003cp\u003esour cream\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003eFinely chopped fresh chives or thinly sliced scallions, for serving\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/section\u003e\u003cdiv data-testid=\"Recipe__instructionsGroup\" id=\"instructions-719720974-instructiongroup-1\"\u003e\u003col\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eCook 4 halved bacon slices in a single layer in a Dutch oven or large pot over medium heat, flipping halfway through, until browned and crisp, 8 to 10 minutes total. Using tongs, transfer to a paper towel-lined plate.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eAdd 1 finely chopped medium yellow onion to the bacon fat. Cook, stirring occasionally, until softened, about 5 minutes. Increase the heat to high, add 1 cup low-sodium chicken broth, and scrape up any browned bits from the bottom of the pot. Stir in 4 cups whole milk, 1 3/4 teaspoons kosher salt, and 1/4 teaspoon black pepper. Bring to a boil.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eStir in 2 pounds peeled and chopped russet potatoes and bring to a simmer. Simmer, stirring occasionally, until the potatoes are tender, 8 to 10 minutes. Meanwhile, crumble the bacon with your hands into small pieces.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eTurn off the heat. For a smooth soup, purée the soup in batches in a stand blender until smooth, then return to the pot (or blend directly in the pot with an immersion blender). For a chunky smooth, only blend half the soup or smash the potatoes with a potato masher until the soup is the desired consistency.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eReturn the soup to low heat. Stir in 4 ounces shredded sharp cheddar cheese until melted. Turn off the heat. Stir in 1/4 cup sour cream. Taste and season with more kosher salt and black pepper as needed. Serve garnished with the crumbled bacon, finely chopped fresh chives, and more shredded sharp cheddar cheese as desired.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ol\u003e\u003c/div\u003e\u003csection\u003e\u003ch3\u003eRecipe Notes\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003eStorage: \u003c/strong\u003eLeftovers can be refrigerated in an airtight container for up to 4 days. Do not freeze, as the soup will separate.\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
