{
  "id": "1d25cea9-c124-48ff-b459-c4025274f6aa",
  "title": "January Favorites.",
  "link": "https://www.howsweeteats.com/2025/01/january-favorites-4/",
  "description": "A peek at everything I loved in January 2025! FOOD Trader Joe’s Aglio Olio seasoning. I can’t believe how much I love this. It is delicious on everything. NYT chicken and red lentil soup. I’ve made this twice now and it’s incredible. I add a little more spice/heat but wow – so nourishing. Patagonia Provisions […] The post January Favorites. appeared first on How Sweet Eats.",
  "author": "Jessica",
  "published": "Thu, 30 Jan 2025 18:32:31 +0000",
  "source": "https://www.howsweeteats.com/feed/",
  "categories": [
    "Crumbs",
    "Favorites"
  ],
  "byline": "Jessica",
  "length": 3532,
  "excerpt": "A peek at everything I loved in January 2025! FOOD Trader Joe’s Aglio Olio seasoning. I can’t believe how much I love this. It is delicious on everything. NYT chicken and red lentil soup. I’ve made this twice now and it’s incredible. I add a little more spice/heat but wow – so nourishing. Patagonia Provisions […]",
  "siteName": "How Sweet Eats",
  "favicon": "https://www.howsweeteats.com/wp-content/themes/howsweeteats2020/favicon/apple-touch-icon.png",
  "text": "A peek at everything I loved in January 2025! FOOD Trader Joe’s Aglio Olio seasoning. I can’t believe how much I love this. It is delicious on everything. NYT chicken and red lentil soup. I’ve made this twice now and it’s incredible. I add a little more spice/heat but wow – so nourishing. Patagonia Provisions sourdough crackers. New-to-me crackers that I LOVE. And I am not a huge cracker person. My blueberry muffin baked oatmeal. We have been making this on REPEAT. I love it so so much. Great to prep ahead of time. HOME Souper Cubes. These are not new but I use them every week! I make so many soups and this is perfect to freeze portions. I love it. It’s very easy to pop out one portion or more. White post-in notes. Sounds ridiculous, but these white post-its are so nice compared to the neon ones all over my kitchen. I also love the black ones! Moccamaster coffee maker. I got one in December after not having a pot for coffee… basically, well, ever. I need a pot for entertaining/holidays/having guests over though and this was the recommendation. It’s FABULOUS. I don’t use it everyday, but when I do use it, it’s so sleek, easy and lovely to look at. Also delish! This and the breville espresso live in my pantry. BEAUTY Haus Labs concealer. I’ve been using the same concealer (too faced born this way) now for at least 5 years. Well, I started using this one and WOW – the shade is great and it is so hydrating. I love it! Doesn’t crease when set and is so creamy. The Maker Dream Perfume. New favorite scent alert! Can’t get enough of this goodness. Definitely a warm, cozy scent. XeraCalm Eczema Calming Relief Balm. My skin has been dry my entire life. This is SUCH a good cream!! I will use it after the shower then layer body oil on top. Great for the winter months too. Butter Brush dry brush. I dry brush before every shower, then follow up with cream + oil after. This is by far the best dry brush I have ever used. It’s so soft and buttery, but still exfoliates wonderfully.  FASHION Varley Zip sweat shirt. Adore this – the way it feels is amazing – super soft, high quality, but light at the same time. It’s almost silky. Varley is such excellent quality and lays so nicely. And looks super cute too. Water resistant insulated jacket. I love this jacket. It’s not a puffer but it’s loose and light while being warm at the same time. Fleece lined leggings. When our temps were -10 below zero for days on end, these were a LIFE SAVER. They are so stretchy but so warm. I probably couldn’t wear them when it’s higher than 20 degrees because I’m always hot. But they are so so comfortable and great for cold weather. MEDIA The Favorites. This was the most incredible book I’ve read in a long time! It’s fabulous. I’m still thinking of it 10 days later. The Pitt on Max. Noah Wyle is back!! And here in Pittsburgh!! KID All In Motion girls airy pullover. These are unreal. They feel JUST LIKE spanx air essentials loungewear, but for girls. I got Emilia a few varieties and everything is so soft, comfortable and cute. Mondo Llama valentine’s string art. We love doing micro holiday crafts and both Max and Emilia loved this. Jordan needed some extra help with it but he liked it too! These are super fun. Clay bead spinner for bracelets. We’re also in full bracelet mode over here. This bead spinner was life changing!! The kids also flipped over these different fun ones to add. [none of this is sponsored, i just love to tell you what i love every month! there are a few general affiliate links above! xo]",
  "image": "https://www.howsweeteats.com/wp-content/uploads/2025/01/blueberry-muffin-baked-oatmeal-16-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n\n\u003carticle\u003e\n\n\t\n \t\n \t\n\n \t\n\n \t\n\t\t\n\t\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://www.howsweeteats.com/wp-content/uploads/2025/01/blueberry-muffin-baked-oatmeal-16-scaled.jpg\" alt=\"january favorites\" width=\"2040\" height=\"2200\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.howsweeteats.com/2025/01/january-favorites-4/\" data-jpibfi-post-title=\"January Favorites.\" data-jpibfi-src=\"https://www.howsweeteats.com/wp-content/uploads/2025/01/blueberry-muffin-baked-oatmeal-16-scaled.jpg\" srcset=\"https://www.howsweeteats.com/wp-content/uploads/2025/01/blueberry-muffin-baked-oatmeal-16-scaled.jpg 2040w, https://www.howsweeteats.com/wp-content/uploads/2025/01/blueberry-muffin-baked-oatmeal-16-728x785.jpg 728w, https://www.howsweeteats.com/wp-content/uploads/2025/01/blueberry-muffin-baked-oatmeal-16-768x828.jpg 768w, https://www.howsweeteats.com/wp-content/uploads/2025/01/blueberry-muffin-baked-oatmeal-16-1425x1536.jpg 1425w, https://www.howsweeteats.com/wp-content/uploads/2025/01/blueberry-muffin-baked-oatmeal-16-1899x2048.jpg 1899w, https://www.howsweeteats.com/wp-content/uploads/2025/01/blueberry-muffin-baked-oatmeal-16-150x162.jpg 150w\" sizes=\"(max-width: 2040px) 100vw, 2040px\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eA peek at everything I loved in January 2025!\u003c/em\u003e\u003c/p\u003e\n\u003ch3\u003eFOOD\u003c/h3\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/4hgYK73\" target=\"_blank\" rel=\"noopener\"\u003eTrader Joe’s Aglio Olio seasoning\u003c/a\u003e. I can’t believe how much I love this. It is delicious on everything.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://cooking.nytimes.com/recipes/1026473-chicken-and-red-lentil-soup-with-lemony-yogurt?campaign_id=58\u0026amp;emc=edit_ck_20250116\u0026amp;instance_id=144824\u0026amp;nl=cooking\u0026amp;regi_id=82142294\u0026amp;segment_id=188412\u0026amp;user_id=9bd14f7b26e786e14cab4c5b92acc42a\" target=\"_blank\" rel=\"noopener\"\u003eNYT chicken and red lentil soup\u003c/a\u003e. I’ve made this twice now and it’s incredible. I add a little more spice/heat but wow – so nourishing.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/4aCtEnS\" target=\"_blank\" rel=\"noopener\"\u003ePatagonia Provisions sourdough crackers\u003c/a\u003e. New-to-me crackers that I LOVE. And I am not a huge cracker person.\u003c/p\u003e\n\u003cp\u003eMy \u003ca href=\"https://www.howsweeteats.com/2025/01/blueberry-muffin-baked-oatmeal/\" target=\"_blank\" rel=\"noopener\"\u003eblueberry muffin baked oatmeal\u003c/a\u003e. We have been making this on REPEAT. I love it so so much. Great to prep ahead of time.\u003c/p\u003e\n\u003ch3\u003eHOME\u003c/h3\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/40APwLJ\" target=\"_blank\" rel=\"noopener\"\u003eSouper Cubes\u003c/a\u003e. These are not new but I use them every week! I make so many soups and this is perfect to freeze portions. I love it. It’s very easy to pop out one portion or more.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/4aGMWJ2\" target=\"_blank\" rel=\"noopener\"\u003eWhite post-in notes\u003c/a\u003e. Sounds ridiculous, but these white post-its are so nice compared to the neon ones all over my kitchen. I also love the black ones!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/3CxSCs3\" target=\"_blank\" rel=\"noopener\"\u003eMoccamaster coffee maker\u003c/a\u003e. I got one in December after not having a pot for coffee… basically, well, ever. I need a pot for entertaining/holidays/having guests over though and this was the recommendation. It’s FABULOUS. I don’t use it everyday, but when I do use it, it’s so sleek, easy and lovely to look at. Also delish! This and the \u003ca href=\"https://amzn.to/4gm68Np\" target=\"_blank\" rel=\"noopener\"\u003ebreville espresso\u003c/a\u003e live in my pantry.\u003c/p\u003e\n\u003ch3\u003eBEAUTY\u003c/h3\u003e\n\u003cp\u003e\u003ca href=\"https://bit.ly/4heb3Rr\" target=\"_blank\" rel=\"noopener\"\u003eHaus Labs concealer\u003c/a\u003e. I’ve been using the same concealer (too faced born this way) now for at least 5 years. Well, I started using this one and WOW – the shade is great and it is so hydrating. I love it! Doesn’t crease when set and is so creamy.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://bit.ly/3EhHwb5\" target=\"_blank\" rel=\"noopener\"\u003eThe Maker Dream Perfum\u003c/a\u003ee. New favorite scent alert! Can’t get enough of this goodness. Definitely a warm, cozy scent.\u003c/p\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cspan data-ui-id=\"page-title-wrapper\"\u003e\u003ca href=\"https://bit.ly/40ITVN0\" target=\"_blank\" rel=\"noopener\"\u003eXeraCalm Eczema Calming Relief Balm\u003c/a\u003e. My skin has been dry my entire life. This is SUCH a good cream!! I will use it after the shower then layer body oil on top. Great for the winter months too. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan data-ui-id=\"page-title-wrapper\"\u003e\u003ca href=\"https://amzn.to/3EdX9jZ\" target=\"_blank\" rel=\"noopener\"\u003eButter Brush dry brush\u003c/a\u003e. I dry brush before every shower, then follow up with cream + oil after. This is by far the best dry brush I have ever used. It’s so soft and buttery, but still exfoliates wonderfully. \u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003ch3\u003eFASHION\u003c/h3\u003e\n\u003cp\u003e\u003ca href=\"https://bit.ly/3CrT5Mq\" target=\"_blank\" rel=\"noopener\"\u003eVarley Zip sweat shir\u003c/a\u003et. Adore this – the way it feels is amazing – super soft, high quality, but light at the same time. It’s almost silky. Varley is such excellent quality and lays so nicely. And looks super cute too.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://bit.ly/4gmeFjl\" target=\"_blank\" rel=\"noopener\"\u003eWater resistant insulated jacket\u003c/a\u003e. I love this jacket. It’s not a puffer but it’s loose and light while being warm at the same time.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/3WHtbex\" target=\"_blank\" rel=\"noopener\"\u003eFleece lined leggings\u003c/a\u003e. When our temps were -10 below zero for days on end, these were a LIFE SAVER. They are so stretchy but so warm. I probably couldn’t wear them when it’s higher than 20 degrees because I’m always hot. But they are so so comfortable and great for cold weather.\u003c/p\u003e\n\u003ch3\u003eMEDIA\u003c/h3\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/3WG0M8q\" target=\"_blank\" rel=\"noopener\"\u003eThe Favorites\u003c/a\u003e. This was the most incredible book I’ve read in a long time! It’s fabulous. I’m still thinking of it 10 days later.\u003c/p\u003e\n\u003cp\u003eThe Pitt on Max. Noah Wyle is back!! And here in Pittsburgh!!\u003c/p\u003e\n\u003ch3\u003eKID\u003c/h3\u003e\n\u003cp\u003e\u003ca href=\"https://bit.ly/3EiFaZy\" target=\"_blank\" rel=\"noopener\"\u003eAll In Motion girls airy pullover\u003c/a\u003e. These are unreal. They feel JUST LIKE spanx air essentials loungewear, but for girls. I got Emilia a few varieties and everything is so soft, comfortable and cute.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://bit.ly/42DYfiX\" target=\"_blank\" rel=\"noopener\"\u003eMondo Llama valentine’s string art\u003c/a\u003e. We love doing micro holiday crafts and both Max and Emilia loved this. Jordan needed some extra help with it but he liked it too! These are super fun.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/4jFT0Ft\" target=\"_blank\" rel=\"noopener\"\u003eClay bead spinner for bracelets\u003c/a\u003e. We’re also in full bracelet mode over here. This bead spinner was life changing!! The kids also flipped \u003ca href=\"https://amzn.to/4hgc0ca\" target=\"_blank\" rel=\"noopener\"\u003eover these different fun ones\u003c/a\u003e to add.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e[none of this is sponsored, i just love to tell you what i love every month! there are a few general affiliate links above! xo]\u003c/em\u003e\u003c/p\u003e\n\t\u003c/div\u003e\n\n\t\n\t\t\n\u003c/article\u003e \n\n\t\n\n\n\n\n\n\n\t\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-30T18:32:31Z",
  "modifiedTime": null
}
