{
  "id": "20463f50-157e-4750-8c6e-d0c445687796",
  "title": "Dutch Baby Pancake",
  "link": "https://www.101cookbooks.com/dutch-baby-pancake/",
  "description": "Everyone loves a dutch baby pancake for the simplicity and the drama. This is a great classic approach. You get huge rise, and you can tweak the recipe with endless variations - sweet and savory. Continue reading Dutch Baby Pancake on 101 Cookbooks",
  "author": "Heidi Swanson",
  "published": "Wed, 22 Jan 2025 19:12:31 +0000",
  "source": "https://www.101cookbooks.com/feed",
  "categories": [
    "100+ Vegetarian Recipes",
    "Baking Recipes",
    "Breakfast Recipes",
    "High Protein Recipes",
    "Quick Recipes"
  ],
  "byline": "Heidi Swanson",
  "length": 5685,
  "excerpt": "Everyone loves a dutch baby pancake for the simplicity and the drama. This is a great classic approach. You get huge rise, and you can tweak the recipe with endless variations - sweet and savory.",
  "siteName": "101 Cookbooks",
  "favicon": "https://www.101cookbooks.com/wp-content/uploads/2018/05/cropped-101fav-1-192x192.png",
  "text": "When you do a survey of dutch baby pancake recipes you’ll notice the main players are always eggs, flour, and milk. The goal is to create a one pan showstopper with dramatic rise, the kind you experience with gougères or popovers. Some recipes use a ratio that is heavier on the eggs, others lean on the structure of flour a bit more, but they’re usually in a similar ballpark. You bake a dutch baby hot, which facilitates air expansion, ensuring a reliable, signature rise. Dutch Baby Technique The two main considerations here are mixing the batter and oven temperature. Here are my thoughts on both. By hand or by blender: Typically, you can mix dutch baby batter by whisk or by blender. I switched up my technique after reading a Donna Hay approach where she uses a blender to blend the eggs for a good amount of time before incorporating the rest of the ingredients. It works a lot of air into the batter resulting in big rise. Pouring the batter from the blender into a hot pan is convenient as well. Oven temperature: Nearly every dutch baby recipe will have you bake at a temperature between 400°F and 475°F. I like to lean towards the hot end of that spectrum, and use a pre-heated, hot pan to boost as well. This really gets that boost going. The temperature is then dialed back a bit after things get going to finish and set the dutch baby. Dutch Baby Variations Once you get the hang of making the basic dutch baby recipe down below, you can experiment with all sorts of tweaks and variations, both sweet and savory! Some ideas: Cinnamon Sugar Dutch Baby: Like cinnamon toast in pancake form, sprinkle your dutch baby with cinnamon sugar immediately as it comes out of the oven. I like to add a few crushed dried rose petals on this one as well. Dutch Baby with Apples: Cut an apple into a 1/4-inch dice. Saute the apples in a couple tablespoons of butter over medium heat for a few minutes, until they soften up a bit. Pour the batter into the hot pan, and quickly get it into the oven. Bonus points for finishing with some cinnamon sugar as well. You can also use this approach with pears. Dutch Baby with Citrus Furikake: Skip the sugar, stir some chopped, deeply caramelized onions into your batter, and finish the dutch baby generously with furikake when it comes out of the oven. This approach is also really great using za’atar - but I put za’atar in the batter and also on top after baking. Dutch Baby with Pesto: Another savory idea. Stir a couple tablespoons of pesto into your dutch baby batter and skip the sugar. Serve topped with a dusting of freshly grated Parmesan and tangle of arugula. Gingerbread Dutch Baby: One last idea! Make yourself a gingerbread spice blend by combining 4 teaspoons ground ginger, 1 teaspoon ground cloves, 1 tablespoon ground cinnamon, 1/2 teaspoon freshly grated nutmeg (optional), 1/2 teaspoon finely ground black pepper. Use this to season your batter before baking, then add more along with some sugar, after baking. Smells so good! More Pancake Recipes Fluffy Pancakes Lemon Ricotta Pancakes Blueberry Beet Pancakes (vegan) Cottage Cheese Pancakes Adventure Pancakes (Recipes For The Road PDF) More breakfast recipes 101 Cookbooks Membership Premium Ad-Free membership includes: -Ad-free content -Print-friendly recipes -Spice / Herb / Flower / Zest recipe collection PDF -Weeknight Express recipe collection PDF -Surprise bonuses throughout the year If you remember to start with room-temperature ingredients here, great! But, if not, don’t let that slow you down. Also, you can mix the batter with a whisk instead of a blender but I find the blender makes quick work of the process and gets a good amount of air into the batter. 5 eggs 1 1/3 cups / 165g unbleached all-purpose flour 2 tablespoons sugar (optional) 1 1/4 cup / 300 ml milk 1/2 teaspoon fine grain sea salt 2 tablespoons butter 3 tablespoons powdered sugar lemon wedges Preheat oven to 450°F with a rack in the center. Use a blender to blend eggs for 1 minute, until pale and frothy. Add the flour, sugar, milk, and salt, and blend for another 30 seconds. Place the butter in a 12-inch oven-proof skillet. Heat in the oven for 3-5 minutes, just until the butter starts to brown and become fragrant. Carefully remove the pan from the oven and pour batter into the hot pan. Bake for 10 minutes and then dial back the heat to 400°F. Bake for another 10 minutes or so, until the pancake has puffed completely and become beautifully golden. Remove from oven, dust generously with powdered sugar with a generous squeeze of lemon juice. Serve immediately.",
  "image": "https://images.101cookbooks.com/dutch-baby-pancakes-v.jpg?w=620\u0026auto=format",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"primaryrow\"\u003e\n \n    \u003cmain id=\"main\" role=\"main\"\u003e\n\n    \n\u003carticle id=\"post-18879\"\u003e\n\n\t\t\t\t\n\t\n\t\u003cdiv data-swiftype-name=\"body\" data-swiftype-type=\"text\"\u003e\n\u003cp\u003eWhen you do a survey of dutch baby pancake recipes you’ll notice the main players are always eggs, flour, and milk. The goal is to create a one pan showstopper with dramatic rise, the kind you experience with \u003ca href=\"https://www.101cookbooks.com/gougeres/\"\u003egougères\u003c/a\u003e or \u003ca href=\"https://www.101cookbooks.com/archives/seeded-popovers-recipe.html\"\u003epopovers\u003c/a\u003e. Some recipes use a ratio that is heavier on the eggs, others lean on the structure of flour a bit more, but they’re usually in a similar ballpark. You bake a dutch baby \u003cem\u003ehot\u003c/em\u003e, which facilitates air expansion, ensuring a reliable, signature rise.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cimg src=\"https://images.101cookbooks.com/dutch-baby-pancakes-v.jpg?w=620\u0026amp;auto=format\" alt=\"dutch baby pancake dusted with powdered sugar\" width=\"620\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003eDutch Baby Technique\u003c/h2\u003e\n\u003cp\u003eThe two main considerations here are mixing the batter and oven temperature. Here are my thoughts on both.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eBy hand or by blender:\u003c/strong\u003e Typically, you can mix dutch baby batter by whisk or by blender. I switched up my technique after reading a Donna Hay approach where she uses a blender to blend the eggs for a good amount of time before incorporating the rest of the ingredients. It works a lot of air into the batter resulting in big rise. Pouring the batter from the blender into a hot pan is convenient as well.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eOven temperature:\u003c/strong\u003e Nearly every dutch baby recipe will have you bake at a temperature between 400\u003cb\u003e°\u003c/b\u003eF and 475\u003cb\u003e°\u003c/b\u003eF. I like to lean towards the hot end of that spectrum, and use a pre-heated, hot pan to boost as well. This really gets that boost going. The temperature is then dialed back a bit after things get going to finish and set the dutch baby.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cspan\u003e\u003cimg src=\"https://images.101cookbooks.com/dutch-baby-pancakes-2.jpg?w=620\u0026amp;auto=format\" alt=\"dutch baby pancake puffing up while baking in an oven\" width=\"620\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003eDutch Baby Variations\u003c/h2\u003e\n\u003cp\u003eOnce you get the hang of making the basic dutch baby recipe down below, you can experiment with all sorts of tweaks and variations, both sweet and savory! Some ideas:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eCinnamon Sugar Dutch Baby\u003c/strong\u003e: Like cinnamon toast in pancake form, sprinkle your dutch baby with cinnamon sugar immediately as it comes out of the oven. I like to add a few crushed dried rose petals on this one as well.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eDutch Baby with Apples\u003c/strong\u003e: Cut an apple into a 1/4-inch dice. Saute the apples in a couple tablespoons of butter over medium heat for a few minutes, until they soften up a bit. Pour the batter into the hot pan, and quickly get it into the oven. Bonus points for finishing with some cinnamon sugar as well. You can also use this approach with pears.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eDutch Baby with Citrus Furikake\u003c/strong\u003e: Skip the sugar, stir some chopped, deeply caramelized onions into your batter, and finish the dutch baby generously with furikake when it comes out of the oven. This approach is also really great using za’atar - but I put \u003ca href=\"https://www.101cookbooks.com/zaatar-recipe/\"\u003eza’atar\u003c/a\u003e in the batter and also on top after baking.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eDutch Baby with Pesto:\u003c/strong\u003e Another savory idea. Stir a couple tablespoons of \u003ca href=\"https://www.101cookbooks.com/pesto-recipe/\"\u003epesto\u003c/a\u003e into your dutch baby batter and skip the sugar. Serve topped with a dusting of freshly grated Parmesan and tangle of arugula.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eGingerbread Dutch Baby\u003c/strong\u003e: One last idea! Make yourself a gingerbread spice blend by combining \u003cspan\u003e4 teaspoons ground ginger\u003c/span\u003e\u003cspan\u003e, \u003c/span\u003e\u003cspan\u003e1 teaspoon ground cloves\u003c/span\u003e\u003cspan\u003e, \u003c/span\u003e\u003cspan\u003e1 tablespoon ground cinnamon\u003c/span\u003e\u003cspan\u003e, \u003c/span\u003e\u003cspan\u003e1/2 teaspoon freshly grated nutmeg (optional)\u003c/span\u003e\u003cspan\u003e, \u003c/span\u003e\u003cspan\u003e1/2 teaspoon finely ground black pepper. Use this to season your batter before baking, then add more along with some sugar, after baking. Smells so good!\u003c/span\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cspan\u003e\u003cspan\u003e\u003cimg src=\"https://images.101cookbooks.com/dutch-baby-pancakes-1.jpg?w=620\u0026amp;auto=format\" alt=\"dutch baby pancake in a skillet after baking\" width=\"620\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/span\u003e\u003cbr/\u003eMore Pancake Recipes\u003c/span\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cspan\u003e\u003ca href=\"https://www.101cookbooks.com/pancake-recipe/\"\u003e\u003cspan\u003eFluffy Pancakes\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e\u003ca href=\"https://www.101cookbooks.com/lemon-ricotta-pancakes/\"\u003e\u003cspan\u003eLemon Ricotta Pancakes\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e\u003ca href=\"https://www.101cookbooks.com/archives/blueberry-beet-pancakes-vegan-recipe.html\"\u003e\u003cspan\u003eBlueberry Beet Pancakes\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e\u003cspan\u003e (vegan)\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.101cookbooks.com/cottage-cheese-pancakes/\"\u003eCottage Cheese Pancakes\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003eAdventure Pancakes (\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1\"\u003e\u003cspan\u003eRecipes For The Road\u003c/span\u003e\u003c/a\u003e PDF)\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003eMore \u003ca href=\"https://www.101cookbooks.com/breakfast_brunch\"\u003e\u003cspan\u003ebreakfast recipes\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n               \n         \u003cdiv\u003e\n           \n        \u003cdiv\u003e\n                  \u003cp\u003e101 Cookbooks Membership\u003c/p\u003e\n        \n                  \u003cdiv\u003e\n                      \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/SPICE-HERB-COVER-100.png\" alt=\"spice herb flower zest\" nopin=\"nopin\" width=\"100\" height=\"141\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e \u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1\"\u003e \u003cimg src=\"https://images.101cookbooks.com/WEEKNIGHT-EXPRESS-V2.100.png\" alt=\"weeknight express\" nopin=\"nopin\" width=\"100\" height=\"141\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\n                          \n                          \u003c/p\u003e\n        \n                      \u003cp\u003ePremium Ad-Free membership includes: \u003cbr/\u003e\n                          -Ad-free content \u003cbr/\u003e\n                          -Print-friendly recipes \u003cbr/\u003e\n                          -\u003ci\u003eSpice / Herb / Flower / Zest \u003c/i\u003e recipe collection PDF\u003cbr/\u003e\n                          -\u003ci\u003eWeeknight Express\u003c/i\u003e recipe collection PDF  \u003cbr/\u003e\n                          -Surprise bonuses throughout the year \u003cbr/\u003e\n                              \u003c/p\u003e\n                  \u003c/div\u003e\n              \u003c/div\u003e\n\n        \u003cdiv\u003e  \n             \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/SPICE-HERB-COVER-100.png\" alt=\"spice herb flower zest\" nopin=\"nopin\" width=\"100\" height=\"141\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\u003c/p\u003e\n             \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/WEEKNIGHT-EXPRESS-V2.100.png\" alt=\"weeknight express\" nopin=\"nopin\" width=\"100\" height=\"141\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\u003c/p\u003e\n        \u003c/div\u003e\n                \u003c/div\u003e\n                \t\u003c/div\u003e\n\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\u003cdiv id=\"recipe\" data-recipe-id=\"18882\" data-servings=\"4\"\u003e\n\t\n\t\n\n\u003cp\u003eIf you remember to start with room-temperature ingredients here, great! But, if not, don’t let that slow you down. Also, you can mix the batter with a whisk instead of a blender but I find the blender makes quick work of the process and gets a good amount of air into the batter.\u003c/p\u003e\n\t\t\n\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cul\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e5\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003eeggs\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e1 1/3\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003ecups\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e/ 165g unbleached all-purpose flour\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e2\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003etablespoons\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003esugar (optional)\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e1 1/4\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003ecup\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e/ 300 ml milk\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e1/2\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003eteaspoon\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003efine grain sea salt\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e2\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003etablespoons\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003ebutter\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e3\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003etablespoons\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003epowdered sugar\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003elemon wedges\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003c/ul\u003e\n\t\t\u003c/div\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003col\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003ePreheat oven to 450°F with a rack in the center.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003eUse a blender to blend eggs for 1 minute, until pale and frothy. Add the flour, sugar, milk, and salt, and blend for another 30 seconds.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003ePlace the butter in a 12-inch oven-proof skillet. Heat in the oven for 3-5 minutes, just until the butter starts to brown and become fragrant. Carefully remove the pan from the oven and pour batter into the hot pan.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003eBake for 10 minutes and then dial back the heat to 400°F. Bake for another 10 minutes or so, until the pancake has puffed completely and become beautifully golden.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003eRemove from oven, dust generously with powdered sugar with a generous squeeze of lemon juice. Serve immediately.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003c/ol\u003e\n\t\t\u003c/div\u003e\n\t\n\t\t\n\t\t\n\t\n\t\n\u003c/div\u003e\u003c/article\u003e\n\n\n\u003c/main\u003e\n  \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-22T19:12:31Z",
  "modifiedTime": "2025-01-22T19:12:43Z"
}
