{
  "id": "3646ebb7-c98d-4d79-87a4-8303318b0d00",
  "title": "FOOD FOR NEW PARENTS : CRUNCHY LUNCHY LENTILS",
  "link": "https://www.sproutedkitchen.com/home/2020/9/9/crunchy-lunchy-lentils",
  "description": "For my sister (and maybe my 6-years-ago self, too…)I know you guys are so ready for this. You’ve been ready, the road to get here has been a little twisty and I CANNOT wait to be moms together. Just giddy about it. Let’s start there. We were a few days home from the hospital with Curran, and it had set in that maybe this was going to be harder than I thought. A big transition. My body torn up and my nipples chapped and the gut-wrenching worry that this teensy thing may just stop breathing or any number of tragic things that now feel like cold possibilities. A thoughtful friend mailed a note and I’ll never forget the perfect timing from an experienced mother. I still keep it in Curran’s keepsake journal. The note reminded me that I was capable - that I was made to be this child’s mother amidst the overwhelming exhaustion and newness of it all. Motherhood is such a wild cocktail of elation and… grief maybe? I don’t intend to be dramatic, but your life is never the same. You think about and prepare for this transition for months, sometimes years, and there is no accurate description that will touch on how you feel the second you look at that baby. You rebirth yourself in that moment as well. You’ve known great love, but nothing like this. It fills a corner of your heart you didn’t even know was there. That smell! His skin! Those itsy bitsy toes! Seeing your husband hold his tiny body to his chest. It’s out of body, really. So out of body, that sometimes you feel untethered. The emotions, the physical healing, being responsible for that small life, getting through the day… it’s a lot! You feel so many things in the course of a day. In the course of a moment. It is both the best, most tender job AND so effing hard. All day. Every day. You will second guess your own intuition and also find how to truly trust yourself outside of google and other opinions. There is a lot of chatter about diapers and organic sheets and the best baby wash but there is a quieter murmur about the metamorphosis that occurs as a woman becomes a mother. That metamorphosis seems to be life- long, far as I can tell, as the caring for these little people grows and changes. My experience may be nothing like yours. What worked for me or what I struggled with or when my babies slept or what bottle they liked may not matter at all come your turn. I find that all that unknowing and problem solving and figuring and filtering through noise, is what builds your own confidence as a parent. Pilfering through the shoulds and suggestions, to make choices that work for you and your family. You are his mom and the best person for the job. Believe that this very moment! You have support all around you.I want to pass on to you, just like that well timed note did for me, the affirmation that this role is yours, and you are absolutely capable. You are everything he needs. This mom business is immeasurably valuable work.Let people help. Drink lots of water. Find your pockets of relief. Your body will heal. It will pass. Tomorrow is a new day. Sleep does return. And it’s just like every old lady tells you at the market on your most frustrating of days… it goes so fast. xoLove you so dearly, my sister. Happy to be on this wild ride with you. xo—I heard from many of you looking for a list of recipes to stock up on, or gift, to those in the new baby season. Here are the condensed, top suggestions, in order of most repeated via my instagram question. I will start a series here “Food for New Parents,” per request, so these sorts of recipes are easy to find on the site. I’ll post more recipes in the next few weeks, but visit the bundle page on SKCC for recipes that are easy to reheat or freeze! This is the deliver-friendly bundle. burritos (include frozen ones for easy reheat)fresh cut fruitfresh cut vegetables and dipshealthy muffins (see the ones i just posted on ig reels! or these )fritatta/ frittata muffins (fresh or frozen - notes here or my fave is from our first SK cookbook)lactation cookies (these from How Sweet Eats were mentioned)granola bars (Robyn’s!)date/ energy balls casseroles (Ashley’s Baked Risotto! so good)salad kits and fixings for quick salads and bowls (greens, dressings, grilled/chopped chicken, quinoa, toasted nuts)healthy, light things - “pizza and take out are easy”soups and stews (this lentil soup, this tomato soup or Anna’s Dhal)vegetable enchiladas (duh these goat cheese guys)chili - veg or turkey (this veggie chili, or this beef one)pasta sauces (this bolognese is perfection and I’m intrigued by this cauli version)legume/grain/lunch type salads (the Marakkesh carrots from Bowl + Spoon! Online here)cookies/cookie dough (always Tara’s! add oats and down to 9 minute bake time for a little goo)wine/coconut water CRUNCHY LUNCHY LENTILSServes 4This is a salad that can hold its integrity for a few days. I keep it stored in the fridge, and spoon it on top of lettuce with a little more vinaigrette when ready to eat. I’ve also packed it in a tortilla or stirred in some cooked brown rice to make it more filling. It will dry as it sits, so add a drizzle of oil and vinegar if it needs a refresh. Ingredients¾ cup French/De Puy Lentils2 Persian cucumbers, seeded1 apple1 medium fennel bulb, fronds reserved1 large shallot1 small bundle of mint1 small bundle fresh basil½ cup walnut piecesFor the vinaigrette1 large clove garlic, gratedJuice of one lemon2 Tbsp. apple cider vinegar1 Tbsp. maple syrup4 Tbsp. extra virgin olive oil½ tsp. dried dill½ tsp. corianderFlaky saltFresh ground pepperGoat, parmesan or feta cheese, for garnish, optionalDirectionsRinse your lentils. Put them in a pot with 1 ½ cups of salted water or broth. Bring the liquid up to a simmer, put the cover on ajar and cook for 20 minutes until tender. Fluff the lentils, and set them aside to cool completely. While the lentils cook, get chopping! We want a fine dice on the cucumbers. Core and finely dice both the apple and fennel and mince the shallot. Super small bits! Chop the herbs. In the bottom of your mixing bowl, combine all of the vinaigrette ingredients and stir to mix. Add the cooled lentils, all your chopped vegetables, walnuts and herbs. Toss to coat. Chill in the fridge for an hour if possible for flavors to marry. Not imperative if you don’t have the time. Serve the lentils over some tender greens with a sprinkle of goat, parm or feta cheese.  Sara Forte 2020-09-14 Crunchy Lunchy Lentils 4 A crunchy and fresh, make-ahead vegetarian lunch. ¾ cup French/De Puy Lentils2 Persian cucumbers, seeded1 apple1 medium fennel bulb, fronds reserved1 large shallot1 small bundle of mint1 small bundle fresh basil½ cup walnut pieces1 large clove garlic, gratedJuice of one lemon2 Tbsp. apple cider vinegar1 Tbsp. maple syrup4 Tbsp. extra virgin olive oil½ tsp. dried dill½ tsp. corianderFlaky saltFresh ground pepper   Rinse your lentils. Put them in a pot with 1 ½ cups of salted water or broth. Bring the liquid up to a simmer, put the cover on ajar and cook for 20 minutes until tender. Fluff the lentils, and set them aside to cool completely.While the lentils cook, get chopping! We want a fine dice on the cucumbers. Core and finely dice both the apple and fennel and mince the shallot. Chop the herbs.In the bottom of your mixing bowl, combine all of the vinaigrette ingredients and stir to mix. Add the cooled lentils, all your chopped vegetables, walnuts and herbs. Toss to coat. Chill in the fridge for an hour if possible for flavors to marry. Not imperative if you don’t have the time.Serve the lentils over some tender greens with a sprinkle of goat, parm or feta cheese. PT20M PT20M PT25M mediterranean Entrée vegetarian, make ahead, quick, salad",
  "author": "Sara Forte",
  "published": "Mon, 14 Sep 2020 16:22:30 +0000",
  "source": "https://www.sproutedkitchen.com/home?format=rss",
  "categories": [
    "Entrée",
    "Feeding Babies",
    "Gluten Free",
    "Salad",
    "Side"
  ],
  "byline": "Sara Forte · September 14, 2020",
  "length": 6393,
  "excerpt": "For my sister (and maybe my 6-years-ago self, too…) I know you guys are so ready for this. You’ve been ready, the road to get here has been a little twisty and I CANNOT wait to be moms together. Just giddy about it. Let’s start there. We were a few days home from the hospital with Curran, and it",
  "siteName": "Sprouted Kitchen",
  "favicon": "",
  "text": "For my sister (and maybe my 6-years-ago self, too…)I know you guys are so ready for this. You’ve been ready, the road to get here has been a little twisty and I CANNOT wait to be moms together. Just giddy about it. Let’s start there. We were a few days home from the hospital with Curran, and it had set in that maybe this was going to be harder than I thought. A big transition. My body torn up and my nipples chapped and the gut-wrenching worry that this teensy thing may just stop breathing or any number of tragic things that now feel like cold possibilities. A thoughtful friend mailed a note and I’ll never forget the perfect timing from an experienced mother. I still keep it in Curran’s keepsake journal. The note reminded me that I was capable - that I was made to be this child’s mother amidst the overwhelming exhaustion and newness of it all. Motherhood is such a wild cocktail of elation and… grief maybe? I don’t intend to be dramatic, but your life is never the same. You think about and prepare for this transition for months, sometimes years, and there is no accurate description that will touch on how you feel the second you look at that baby. You rebirth yourself in that moment as well. You’ve known great love, but nothing like this. It fills a corner of your heart you didn’t even know was there. That smell! His skin! Those itsy bitsy toes! Seeing your husband hold his tiny body to his chest. It’s out of body, really. So out of body, that sometimes you feel untethered. The emotions, the physical healing, being responsible for that small life, getting through the day… it’s a lot! You feel so many things in the course of a day. In the course of a moment. It is both the best, most tender job AND so effing hard. All day. Every day. You will second guess your own intuition and also find how to truly trust yourself outside of google and other opinions. There is a lot of chatter about diapers and organic sheets and the best baby wash but there is a quieter murmur about the metamorphosis that occurs as a woman becomes a mother. That metamorphosis seems to be life- long, far as I can tell, as the caring for these little people grows and changes. My experience may be nothing like yours. What worked for me or what I struggled with or when my babies slept or what bottle they liked may not matter at all come your turn. I find that all that unknowing and problem solving and figuring and filtering through noise, is what builds your own confidence as a parent. Pilfering through the shoulds and suggestions, to make choices that work for you and your family. You are his mom and the best person for the job. Believe that this very moment! You have support all around you.I want to pass on to you, just like that well timed note did for me, the affirmation that this role is yours, and you are absolutely capable. You are everything he needs. This mom business is immeasurably valuable work.Let people help. Drink lots of water. Find your pockets of relief. Your body will heal. It will pass. Tomorrow is a new day. Sleep does return. And it’s just like every old lady tells you at the market on your most frustrating of days… it goes so fast. xoLove you so dearly, my sister. Happy to be on this wild ride with you. xo—I heard from many of you looking for a list of recipes to stock up on, or gift, to those in the new baby season. Here are the condensed, top suggestions, in order of most repeated via my instagram question. I will start a series here “Food for New Parents,” per request, so these sorts of recipes are easy to find on the site. I’ll post more recipes in the next few weeks, but visit the bundle page on SKCC for recipes that are easy to reheat or freeze! This is the deliver-friendly bundle. burritos (include frozen ones for easy reheat)fresh cut fruitfresh cut vegetables and dipshealthy muffins (see the ones i just posted on ig reels! or these )fritatta/ frittata muffins (fresh or frozen - notes here or my fave is from our first SK cookbook)lactation cookies (these from How Sweet Eats were mentioned)granola bars (Robyn’s!)date/ energy balls casseroles (Ashley’s Baked Risotto! so good)salad kits and fixings for quick salads and bowls (greens, dressings, grilled/chopped chicken, quinoa, toasted nuts)healthy, light things - “pizza and take out are easy”soups and stews (this lentil soup, this tomato soup or Anna’s Dhal)vegetable enchiladas (duh these goat cheese guys)chili - veg or turkey (this veggie chili, or this beef one)pasta sauces (this bolognese is perfection and I’m intrigued by this cauli version)legume/grain/lunch type salads (the Marakkesh carrots from Bowl + Spoon! Online here)cookies/cookie dough (always Tara’s! add oats and down to 9 minute bake time for a little goo)wine/coconut water CRUNCHY LUNCHY LENTILSServes 4This is a salad that can hold its integrity for a few days. I keep it stored in the fridge, and spoon it on top of lettuce with a little more vinaigrette when ready to eat. I’ve also packed it in a tortilla or stirred in some cooked brown rice to make it more filling. It will dry as it sits, so add a drizzle of oil and vinegar if it needs a refresh. Ingredients¾ cup French/De Puy Lentils2 Persian cucumbers, seeded1 apple1 medium fennel bulb, fronds reserved1 large shallot1 small bundle of mint1 small bundle fresh basil½ cup walnut piecesFor the vinaigrette1 large clove garlic, gratedJuice of one lemon2 Tbsp. apple cider vinegar1 Tbsp. maple syrup4 Tbsp. extra virgin olive oil½ tsp. dried dill½ tsp. corianderFlaky saltFresh ground pepperGoat, parmesan or feta cheese, for garnish, optionalDirectionsRinse your lentils. Put them in a pot with 1 ½ cups of salted water or broth. Bring the liquid up to a simmer, put the cover on ajar and cook for 20 minutes until tender. Fluff the lentils, and set them aside to cool completely. While the lentils cook, get chopping! We want a fine dice on the cucumbers. Core and finely dice both the apple and fennel and mince the shallot. Super small bits! Chop the herbs. In the bottom of your mixing bowl, combine all of the vinaigrette ingredients and stir to mix. Add the cooled lentils, all your chopped vegetables, walnuts and herbs. Toss to coat. Chill in the fridge for an hour if possible for flavors to marry. Not imperative if you don’t have the time. Serve the lentils over some tender greens with a sprinkle of goat, parm or feta cheese.",
  "image": "http://static1.squarespace.com/static/55470460e4b0b5d7d7c67dad/t/5f5f9038a86890209fd34b41/1600098373431/HFA08777.jpg?format=1500w",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-block-type=\"2\" id=\"block-459ef66e6606f72a94a4\"\u003e\n  \u003cp\u003eFor my sister (and maybe my 6-years-ago self, too…)\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eI know you guys are so ready for this. You’ve been ready, the road to get here has been a little twisty and I CANNOT wait to be moms together. Just giddy about it. Let’s start there. \u003c/p\u003e\u003cp\u003eWe were a few days home from the hospital with Curran, and it had set in that maybe this was going to be harder than I thought. A big transition. My body torn up and my nipples chapped and the gut-wrenching worry that this teensy thing may just stop breathing or any number of tragic things that now feel like cold possibilities. \u003c/p\u003e\u003c/div\u003e\u003cp\u003eA thoughtful friend mailed a note and I’ll never forget the perfect timing from an experienced mother. I still keep it in Curran’s keepsake journal. The note reminded me that I was capable - that I was made to be this child’s mother amidst the overwhelming exhaustion and newness of it all. \u003c/p\u003e\u003cp\u003eMotherhood is such a wild cocktail of elation and… grief maybe? I don’t intend to be dramatic, but your life is never the same. You think about and prepare for this transition for months, sometimes years, and there is no accurate description that will touch on how you feel the second you look at that baby. You rebirth yourself in that moment as well. You’ve known great love, but nothing like this. It fills a corner of your heart you didn’t even know was there. That smell! His skin! Those itsy bitsy toes! Seeing your husband hold his tiny body to his chest. It’s out of body, really. So out of body, that sometimes you feel untethered. The emotions, the physical healing, being responsible for that small life, getting through the day… it’s a lot! You feel so many things in the course of a day. In the course of a moment. It is both the best, most tender job AND so effing hard. All day. Every day. You will second guess your own intuition and also find how to truly trust yourself outside of google and other opinions.\u003c/p\u003e\u003cp\u003e There is a lot of chatter about diapers and organic sheets and the best baby wash but there is a quieter murmur about the metamorphosis that occurs as a woman becomes a mother. That metamorphosis seems to be life- long, far as I can tell, as the caring for these little people grows and changes. My experience may be nothing like yours. What worked for me or what I struggled with or when my babies slept or what bottle they liked may not matter at all come your turn. I find that all that unknowing and problem solving and figuring and filtering through noise, is what builds your own confidence as a parent. Pilfering through the shoulds and suggestions, to make choices that work for you and your family. You are his mom and the best person for the job. Believe that this very moment! You have support all around you.\u003c/p\u003e\u003cp\u003eI want to pass on to you, just like that well timed note did for me, the affirmation that this role is yours, and you are absolutely capable. You are everything he needs. This mom business is immeasurably valuable work.\u003c/p\u003e\u003cp\u003eLet people help. Drink lots of water. Find your pockets of relief. Your body will heal. It will pass. Tomorrow is a new day. Sleep does return. And it’s just like every old lady tells you at the market on your most frustrating of days… it goes so fast. xo\u003c/p\u003e\u003cp\u003eLove you so dearly, my sister. Happy to be on this wild ride with you. xo\u003c/p\u003e\u003cp\u003e—\u003c/p\u003e\u003cp\u003eI heard from many of you looking for a list of recipes to stock up on, or gift, to those in the new baby season. Here are the condensed, top suggestions, in order of most repeated via my instagram question. I will start a series here “Food for New Parents,” per request, so these sorts of recipes are easy to find on the site. I’ll post more recipes in the next few weeks, but visit the \u003ca href=\"https://sproutedkitchen.cc/recipes?filter=bundles\"\u003ebundle page\u003c/a\u003e on SKCC for recipes that are easy to reheat or freeze! \u003ca href=\"https://sproutedkitchen.cc/publish-groups/92\"\u003eThis is the deliver-friendly bundle\u003c/a\u003e. \u003c/p\u003e\u003cul data-rte-list=\"default\"\u003e\u003cli\u003e\u003cp\u003eburritos (include frozen ones for easy reheat)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003efresh cut fruit\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003efresh cut vegetables and dips\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003ehealthy muffins (see the ones i just posted on ig reels! or \u003ca href=\"https://www.sproutedkitchen.com/home/2018/9/5/gluten-free-zucchini-muffins\"\u003ethese\u003c/a\u003e )\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003efritatta/ frittata muffins (fresh or frozen - notes \u003ca href=\"https://www.sproutedkitchen.com/home/2018/9/25/a-study-on-frittatas\"\u003ehere\u003c/a\u003e or my fave is from our first \u003ca href=\"https://amzn.to/3k2LLrA\"\u003eSK cookbook\u003c/a\u003e)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003elactation cookies (\u003ca href=\"https://www.howsweeteats.com/2015/02/lactation-cookies/\"\u003ethese\u003c/a\u003e from How Sweet Eats were mentioned)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003egranola bars (\u003ca href=\"https://sweetish.co/easy-granola-bars/\"\u003eRobyn’s!\u003c/a\u003e)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003edate/ energy balls \u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003ecasseroles (\u003ca href=\"https://sproutedkitchen.cc/recipes/oven-baked-risotta-w--butternut-squash---rosemary-candied-walnuts\"\u003eAshley’s Baked Risotto\u003c/a\u003e! so good)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003esalad kits and fixings for quick salads and bowls (greens, dressings, grilled/chopped chicken, quinoa, toasted nuts)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003ehealthy, light things - “pizza and take out are easy”\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003esoups and stews \u003ca href=\"https://www.sproutedkitchen.com/home/2016/11/22/everyday-lentil-soup\"\u003e(this lentil soup\u003c/a\u003e, this tomato soup or \u003ca href=\"http://annajones.co.uk/recipe/harrods-dhal-crispy-sweet-potato-quick-coconut-chutney\"\u003eAnna’s Dhal\u003c/a\u003e)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003evegetable enchiladas (duh \u003ca href=\"https://www.sproutedkitchen.com/home/2012/7/10/roasted-zucchini-black-bean-goat-cheese-enchiladas.html\"\u003ethese\u003c/a\u003e goat cheese guys)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003echili - veg or turkey (this \u003ca href=\"https://sproutedkitchen.cc/recipes/veggie-chili\"\u003eveggie chili\u003c/a\u003e, or \u003ca href=\"https://pinchofyum.com/sunday-chili\"\u003ethis\u003c/a\u003e beef one)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003epasta sauces (\u003ca href=\"https://sproutedkitchen.cc/recipes/essential-bolognese\"\u003ethis\u003c/a\u003e bolognese is perfection and I’m intrigued by \u003ca href=\"https://www.twopeasandtheirpod.com/cauliflower-bolognese/\"\u003ethis\u003c/a\u003e cauli version)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003elegume/grain/lunch type salads (the Marakkesh carrots from \u003ca href=\"https://amzn.to/2ZwrS4x\"\u003eBowl + Spoon!\u003c/a\u003e Online \u003ca href=\"https://joythebaker.com/2015/05/marrakesh-carrots/\"\u003ehere\u003c/a\u003e)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003ecookies/cookie dough (always \u003ca href=\"https://www.taraobrady.com/recipes-in-full/2019/5/1/tara-obradys-basic-great-chocolate-chip-cookies\"\u003eTara’s!\u003c/a\u003e add oats and down to 9 minute bake time for a little goo)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003ewine/coconut water\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\n\u003c/div\u003e\u003cdiv data-block-type=\"2\" id=\"block-yui_3_17_2_1_1600098040612_6144\"\u003e\n  \u003ch2\u003eCRUNCHY LUNCHY LENTILS\u003c/h2\u003e\u003cp\u003e\u003cem\u003eServes 4\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThis is a salad that can hold its integrity for a few days. I keep it stored in the fridge, and spoon it on top of lettuce with a little more vinaigrette when ready to eat. I’ve also packed it in a tortilla or stirred in some cooked brown rice to make it more filling. It will dry as it sits, so add a drizzle of oil and vinegar if it needs a refresh. \u003c/em\u003e\u003c/p\u003e\u003ch3\u003eIngredients\u003c/h3\u003e\u003cp\u003e¾ cup French/De Puy Lentils\u003cbr/\u003e2 Persian cucumbers, seeded\u003cbr/\u003e1 apple\u003cbr/\u003e1 medium fennel bulb, fronds reserved\u003cbr/\u003e1 large shallot\u003cbr/\u003e1 small bundle of mint\u003cbr/\u003e1 small bundle fresh basil\u003cbr/\u003e½ cup walnut pieces\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFor the vinaigrette\u003cbr/\u003e\u003c/strong\u003e1 large clove garlic, grated\u003cbr/\u003eJuice of one lemon\u003cbr/\u003e2 Tbsp. apple cider vinegar\u003cbr/\u003e1 Tbsp. maple syrup\u003cbr/\u003e4 Tbsp. extra virgin olive oil\u003cbr/\u003e½ tsp. dried dill\u003cbr/\u003e½ tsp. coriander\u003cbr/\u003eFlaky salt\u003cbr/\u003eFresh ground pepper\u003c/p\u003e\u003cp\u003eGoat, parmesan or feta cheese, for garnish, optional\u003c/p\u003e\u003ch3\u003eDirections\u003c/h3\u003e\u003cp\u003eRinse your lentils. Put them in a pot with 1 ½ cups of salted water or broth. Bring the liquid up to a simmer, put the cover on ajar and cook for 20 minutes until tender. Fluff the lentils, and set them aside to cool completely. \u003c/p\u003e\u003cp\u003eWhile the lentils cook, get chopping! We want a fine dice on the cucumbers. Core and finely dice both the apple and fennel and mince the shallot. Super small bits! Chop the herbs. \u003c/p\u003e\u003cp\u003eIn the bottom of your mixing bowl, combine all of the vinaigrette ingredients and stir to mix. Add the cooled lentils, all your chopped vegetables, walnuts and herbs. Toss to coat. Chill in the fridge for an hour if possible for flavors to marry. Not imperative if you don’t have the time. \u003c/p\u003e\u003cp\u003eServe the lentils over some tender greens with a sprinkle of goat, parm or feta cheese. \u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2020-09-14T09:22:30-07:00",
  "modifiedTime": null
}
