{
  "id": "57c1dfd3-f079-4283-bedd-e504faf98767",
  "title": "Spaghetti allo Scoglio (Spaghetti With Mixed Seafood)",
  "link": "https://www.seriouseats.com/recipes/2021/03/spaghetti-allo-scoglio-mixed-seafood-spaghetti.html",
  "description": "This pasta bursting with clams, mussels, shrimp, squid, and fresh tomato is a coastal Italian classic.",
  "author": "Katie Leaird",
  "published": "2021-03-11T07:45:56Z",
  "source": "http://feeds.feedburner.com/seriouseats/recipes",
  "categories": [
    "Italian",
    "Mains",
    "Pasta",
    "Quick Dinners",
    "Seafood",
    "Stovetop"
  ],
  "byline": "Katie Leaird",
  "length": 8739,
  "excerpt": "A classic Italian seafood pasta, with clams, mussels, shrimp, squid, and fresh tomato.",
  "siteName": "Serious Eats",
  "favicon": "https://www.seriouseats.com/apple-touch-icon-180x180.png",
  "text": "Why It Works Cooking the seafood in stages ensures that all of the components are at their textural best in the final dish.Cooking the pasta risotto-style, a technique known as spaghetti risottati, means the spaghetti absorbs the flavor from the shellfish broth.Bottled clam juice intensifies the natural flavor of the steamed shellfish. Spaghetti allo scoglio is found all over coastal Italy, and it's prized for its mix of fresh seafood, which can include clams, mussels, shrimp, and cuttlefish or squid. Like spaghetti alle vongole, scoglio isn't saucy; instead it consists of long strands of al dente pasta with a silky coating packed with briny seafood flavor, thanks to the combination of fresh shellfish liquor, acidic white wine, a touch of fresh tomato, and peppery olive oil. I live on Martha's Vineyard, so the seafood available to me is categorically different than the delicate, iridescent frutti di mare of the rocky Adriatic coast. The clams are larger and their shells thicker, the shrimp are shipped frozen from Florida, and the squid isn't nearly as tender as the seppia (cuttlefish) found in Puglia, where I first tasted pasta allo scoglio. The key to the dish is getting the spaghetti to absorb the flavorful broth released by the shellfish. Sure, you can achieve this by boiling the pasta first and then finishing it in the skillet with the seafood. But my friend Daniela, chef and co-owner of Le Macàre, showed me a better way when I visited her in the Salento, Puglia’s southern sub-peninsula, a few years back. She made the dish with spaghetti risottati, or spaghetti prepared risotto-syle, the dry pasta cooking directly in the skillet with the shellfish, so that it absorbs the liquor from the clams and mussels as they steam open. The results were stunning, with each strand of pasta infused with sapore di mare (the flavor of the sea). To successfully adapt my friend Daniela's scoglio method for this recipe, I knew I had to cook the various seafood in stages to ensure that everything was just cooked through at the time of serving. Different types of seafood cook at different rates, so I start off by steaming the clams and mussels with aromatics and white wine, just until they open up and release their flavorful liquor. I take the shellfish out of the pan, and I supplement the briny broth left behind with bottled clam juice and a little water, which I then use as the cooking liquid for the pasta. Once the mixture comes to a boil, I add the spaghetti. While I wait for the spaghetti to cook, I shuck the meat from half of the clams and mussels. While Daniel correctly observed in his spaghetti alle vongole recipe that digging through a pile of shells isn't the best dining experience, for this dish you have to keep some of the shells for presentation, otherwise it just isn't scoglio. (\"Scoglio\" translates to \"reef.\") Once the pasta is cooked \"al chiodo\" (to the nail)—a few minutes shy of al dente, just beginning to soften on the exterior, but uncooked at the center—I add quick-cooking shrimp, squid, and cherry tomatoes to the mix, tossing and stirring until the shrimp are opaque and the squid pieces are just cooked through. The halved cherry tomatoes will release some of their sweet juices into the sauce, but they'll still hold their shape (we're not looking for burst tomatoes in this dish). I add the mussels and clams back to the skillet and toss everything together until all the seafood is heated through and the pasta is al dente, and then serve it immediately. March 2021 This recipe was cross-tested in 2022 and lightly updated to guarantee best results. To help the tomatoes hold their shape better, we now incorporate them into the pasta mixture further along in the cooking process. Spaghetti allo Scoglio (Spaghetti With Mixed Seafood) Recipe Kosher salt 1 pound (453g) fresh small clams, such as littlenecks, Manilas, or cockles, scrubbed 1/4 cup (60ml) extra-virgin olive oil, divided, plus extra for drizzling 3 medium shallots, thinly sliced (about 4 1/4 ounces; 120g) 4 medium garlic cloves (20g), minced (about 2 teaspoons) 1/2 teaspoon red pepper flakes 1 cup (240ml) dry white wine 1 pound (453g) mussels, scrubbed and debearded (see notes) One 8-ounce (240ml) bottle clam juice 12 ounces (340g) dried spaghetti, spaghettoni, or linguine 8 ounces (225g) large shrimp, peeled, deveined, and halved crosswise 8 ounce (225g) cleaned squid, bodies sliced into 1/2-inch-thick rings, small tentacles left whole, larger ones halved (see notes) 8 ounces (225g) cherry tomatoes, halved 1/2 cup (30g) chopped fresh parsley leaves and tender stems 2 tablespoons (30ml) fresh lemon juice from 1/2 lemon Fill a large bowl with cold water and stir in enough salt to make it salty like the sea (a 3% salt solution, by weight, is a good ratio). Add clams and let stand for 30 minutes. Lift clams from bowl and discard sandy water. Rinse out bowl and repeat this purging process until clams no longer release sand into the water (usually 2 to 3 purging cycles). Discard any clams that are gaping open and refuse to close when tapped. Set clean clams aside. Heat 3 tablespoons (45ml) oil in a deep 12-inch skillet over medium-high heat until shimmering. Add shallots, season lightly with salt, and cook, stirring occasionally, until shallots start to soften, about 5 minutes. Add garlic and red pepper flakes and cook, stirring constantly, until fragrant, about 30 seconds. Add wine and clams, increase heat to high, cover, and cook, shaking pan frequently, for 4 minutes. Uncover and, using tongs, transfer any clams that have opened to a medium bowl; cover bowl with foil to keep warm. Add mussels to skillet, cover, and continue to cook, shaking pan frequently and uncovering to stir and check shellfish every 45 seconds, until clams and mussels have all opened, 3 to 4 minutes longer. Using tongs, quickly transfer shellfish to bowl, and cover; leave aromatics and liquid in pan. Discard any clams or mussels that do not open. Add clam juice and 2 cups (475ml) water to skillet and bring mixture to a boil over high heat. Add spaghetti and cook, stirring constantly for the first 30 seconds to prevent noodles from sticking and then stirring occasionally, until pasta begins to have some flexibility and is softened on the exterior, but well shy of al dente and still uncooked in the center, about 3 minutes less than the package directions. Add water in 1/4 cup (60ml) increments as needed to ensure pasta cooks evenly and doesn't stick to the bottom of the pan. Meanwhile, pull meat from about half of the clam shells and half of the mussel shells; discard empty shells and return shucked clams and mussels to bowl with remaining shell-on shellfish. Cover to keep warm. When pasta is just softened on the exterior, add shrimp and squid to skillet. Continue to cook over high, stirring and tossing, until shrimp and squid are just cooked through, 2 to 4 minutes. Add tomatoes and all of the mussels and clams, along with any accumulated juices, and continue to cook over high, stirring and tossing constantly, until all of the seafood is heated through, pasta is al dente, and sauce is creamy and coats the pasta, about 1 minute; add more water, 2 tablespoons (30ml) at a time, if sauce over-reduces and becomes dry or greasy. Remove from heat, add parsley and lemon juice, and toss rapidly to incorporate. Season with salt to taste. Transfer to a large serving bowl or divide between individual serving bowls, arranging shell-on mussels and clams on top of pasta. Drizzle with remaining 1 tablespoon (15ml) oil, and serve. Special Equipment 12-inch skillet with lid Notes Small clams, such as littlenecks, Manilas, and cockles work best for this dish. Larger clams, such as cherrystones ,will take longer to cook and their meat will have to be chopped before being added to the spaghetti. Examine mussels before using. Discard cracked mussels or open mussels that don't close when tapped with another mussel. Farm-raised mussels are generally quite clean when sold, but they can still have grit and beards that need to be removed. Remove grit by scrubbing mussels well under cold running water, and remove beards (they look like wisps of hair coming out from between their shells) by grabbing them and pulling toward the hinge-end of the mussels; discard the beards once removed. For more information, view our detailed guide to cleaning and debearding mussels. For the squid, this recipe can be made with just bodies (tubes), or a combination of bodies and tentacles. Make-Ahead and Storage This dish is best enjoyed immediately.",
  "image": "https://www.seriouseats.com/thmb/UnQ-J1oxaULCVLVdyV5nVSZnwR0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__03__20210301-Spaghetti-Allo-Scoglio-Tim-Chin-20-639123ce316c4dbc8c3f30984295d5fa.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article__header--project_1-0\" data-sc-sticky-offset=\"200\" data-sc-ad-label-height=\"11\" data-sc-ad-track-spacing=\"100\" data-sc-min-track-height=\"250\" data-sc-max-track-height=\"600\" data-sc-breakpoint=\"50em\" data-sc-load-immediate=\"1\" data-sc-content-positions=\"[1, 1, 1, 1, 1, 1, 1]\" data-bind-scroll-on-start=\"true\"\u003e\u003cdiv id=\"mntl-sc-block_1-0\" data-tracking-id=\"mntl-sc-block-callout\" data-tracking-container=\"true\"\u003e\u003ch3 id=\"mntl-sc-block-callout-heading_1-0\"\u003eWhy It Works\u003c/h3\u003e\n\u003cdiv id=\"mntl-sc-block-callout-body_1-0\"\u003e\u003cul\u003e\u003cli\u003eCooking the seafood in stages ensures that all of the components are at their textural best in the final dish.\u003c/li\u003e\u003cli\u003eCooking the pasta risotto-style, a technique known as spaghetti risottati, means the spaghetti absorbs the flavor from the shellfish broth.\u003c/li\u003e\u003cli\u003eBottled clam juice intensifies the natural flavor of the steamed shellfish.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\n\u003cp id=\"mntl-sc-block_2-0\"\u003e Spaghetti allo scoglio is found all over coastal Italy, and it\u0026#39;s prized for its mix of fresh seafood, which can include clams, mussels, shrimp, and cuttlefish or squid. Like spaghetti alle vongole, scoglio isn\u0026#39;t saucy; instead it consists of long strands of al dente pasta with a silky coating packed with briny seafood flavor, thanks to the combination of fresh shellfish liquor, acidic white wine, a touch of fresh tomato, and peppery olive oil.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_4-0\"\u003e I live on Martha\u0026#39;s Vineyard, so the seafood available to me is categorically different than the delicate, iridescent frutti di mare of the rocky Adriatic coast. The clams are larger and their shells thicker, the shrimp are shipped frozen from Florida, and the squid isn\u0026#39;t nearly as tender as the seppia (cuttlefish) found in Puglia, where I first tasted pasta allo scoglio.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_6-0\"\u003e The key to the dish is getting the spaghetti to absorb the flavorful broth released by the shellfish. Sure, you can achieve this by boiling the pasta first and then finishing it in the skillet with the seafood. But my friend Daniela, chef and co-owner of \u003ca href=\"https://www.lemacare.it/\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"externalLink\" data-ordinal=\"1\" rel=\"nofollow\"\u003eLe Macàre\u003c/a\u003e, showed me a better way when I visited her in the Salento, Puglia’s southern sub-peninsula, a few years back.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_8-0\"\u003e She made the dish with spaghetti risottati, or spaghetti prepared risotto-syle, the dry pasta cooking directly in the skillet with the shellfish, so that it absorbs the liquor from the clams and mussels as they steam open.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_10-0\"\u003e The results were stunning, with each strand of pasta infused with sapore di mare (the flavor of the sea). To successfully adapt my friend Daniela\u0026#39;s scoglio method for this recipe, I knew I had to cook the various seafood in stages to ensure that everything was just cooked through at the time of serving. Different types of seafood cook at different rates, so I start off by steaming the clams and mussels with aromatics and white wine, just until they open up and release their flavorful liquor. I take the shellfish out of the pan, and I supplement the briny broth left behind with bottled clam juice and a little water, which I then use as the cooking liquid for the pasta. Once the mixture comes to a boil, I add the spaghetti.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_12-0\"\u003e While I wait for the spaghetti to cook, I shuck the meat from half of the clams and mussels. While Daniel correctly observed in his \u003ca href=\"https://www.seriouseats.com/spaghetti-pasta-alle-vongole-clams-recipe\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"1\"\u003espaghetti alle vongole recipe\u003c/a\u003e that digging through a pile of shells isn\u0026#39;t the best dining experience, for this dish you \u003cem\u003ehave to\u003c/em\u003e keep some of the shells for presentation, otherwise it just isn\u0026#39;t scoglio. (\u0026#34;Scoglio\u0026#34; translates to \u0026#34;reef.\u0026#34;)\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_14-0\"\u003e Once the pasta is cooked \u0026#34;al chiodo\u0026#34; (to the nail)—a few minutes shy of al dente, just beginning to soften on the exterior, but uncooked at the center—I add quick-cooking shrimp, squid, and cherry tomatoes to the mix, tossing and stirring until the shrimp are opaque and the squid pieces are just cooked through. The halved cherry tomatoes will release some of their sweet juices into the sauce, but they\u0026#39;ll still hold their shape (we\u0026#39;re not looking for burst tomatoes in this dish). I add the mussels and clams back to the skillet and toss everything together until all the seafood is heated through and the pasta is al dente, and then serve it immediately.\n\u003c/p\u003e\n\n\u003cdiv id=\"mntl-sc-block_16-0\" data-tracking-id=\"mntl-sc-block-callout\" data-tracking-container=\"true\"\u003e\u003ch3 id=\"mntl-sc-block-callout-heading_2-0\"\u003eMarch 2021\u003c/h3\u003e\n\u003cp\u003eThis recipe was cross-tested in 2022 and lightly updated to guarantee best results. To help the tomatoes hold their shape better, we now incorporate them into the pasta mixture further along in the cooking process.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"structured-project-content_1-0\"\u003e\u003cdiv id=\"recipe-decision-block_1-0\"\u003e \n\u003ch2\u003eSpaghetti allo Scoglio (Spaghetti With Mixed Seafood) Recipe\u003c/h2\u003e\n\n\n\u003c/div\u003e\n\u003cdiv id=\"section--ingredients_1-0\"\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cspan data-ingredient-name=\"true\"\u003eKosher salt\u003c/span\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e1 pound (\u003cspan data-ingredient-quantity=\"true\"\u003e453\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e) fresh small \u003cspan data-ingredient-name=\"true\"\u003eclams\u003c/span\u003e, such as littlenecks, Manilas, or cockles, scrubbed\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e1/4 cup (\u003cspan data-ingredient-quantity=\"true\"\u003e60\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eml\u003c/span\u003e) \u003cspan data-ingredient-name=\"true\"\u003eextra-virgin olive oil\u003c/span\u003e, divided, plus extra for drizzling\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e3 medium \u003cspan data-ingredient-name=\"true\"\u003eshallots\u003c/span\u003e, thinly sliced (about 4 1/4 ounces; \u003cspan data-ingredient-quantity=\"true\"\u003e120\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e4 medium \u003cspan data-ingredient-name=\"true\"\u003egarlic cloves\u003c/span\u003e (\u003cspan data-ingredient-quantity=\"true\"\u003e20\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e), minced (about 2 teaspoons)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cspan data-ingredient-quantity=\"true\"\u003e1/2\u003c/span\u003e \u003cspan data-ingredient-unit=\"true\"\u003eteaspoon\u003c/span\u003e \u003cspan data-ingredient-name=\"true\"\u003ered pepper flakes\u003c/span\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cspan data-ingredient-quantity=\"true\"\u003e1\u003c/span\u003e \u003cspan data-ingredient-unit=\"true\"\u003ecup\u003c/span\u003e (240ml) dry \u003cspan data-ingredient-name=\"true\"\u003ewhite wine\u003c/span\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e1 pound (\u003cspan data-ingredient-quantity=\"true\"\u003e453\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e) \u003cspan data-ingredient-name=\"true\"\u003emussels\u003c/span\u003e, \u003ca href=\"https://www.seriouseats.com/how-to-clean-debeard-mussels\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"1\"\u003escrubbed and debearded\u003c/a\u003e (see notes)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eOne 8-ounce (\u003cspan data-ingredient-quantity=\"true\"\u003e240\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eml\u003c/span\u003e) bottle \u003cspan data-ingredient-name=\"true\"\u003eclam juice\u003c/span\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e12 ounces (\u003cspan data-ingredient-quantity=\"true\"\u003e340\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e) dried \u003cspan data-ingredient-name=\"true\"\u003espaghetti\u003c/span\u003e, spaghettoni, or linguine\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e8 ounces (\u003cspan data-ingredient-quantity=\"true\"\u003e225\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e) large \u003cspan data-ingredient-name=\"true\"\u003eshrimp\u003c/span\u003e, peeled, deveined, and halved crosswise\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e8 ounce (\u003cspan data-ingredient-quantity=\"true\"\u003e225\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e) cleaned \u003cspan data-ingredient-name=\"true\"\u003esquid\u003c/span\u003e, bodies sliced into 1/2-inch-thick rings, small tentacles left whole, larger ones halved (see notes)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e8 ounces (\u003cspan data-ingredient-quantity=\"true\"\u003e225\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e) \u003cspan data-ingredient-name=\"true\"\u003echerry tomatoes\u003c/span\u003e, halved\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e1/2 cup (\u003cspan data-ingredient-quantity=\"true\"\u003e30\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e) chopped \u003cspan data-ingredient-name=\"true\"\u003efresh parsley \u003c/span\u003eleaves and tender stems\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cspan data-ingredient-quantity=\"true\"\u003e2\u003c/span\u003e \u003cspan data-ingredient-unit=\"true\"\u003etablespoons\u003c/span\u003e (30ml) fresh \u003cspan data-ingredient-name=\"true\"\u003elemon juice\u003c/span\u003e from 1/2 lemon\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\u003cdiv id=\"section--instructions_1-0\" data-sc-sticky-offset=\"60\" data-sc-ad-label-height=\"24\" data-sc-ad-track-spacing=\"100\" data-sc-min-track-height=\"250\" data-sc-max-track-height=\"600\" data-sc-breakpoint=\"50em\" data-sc-load-immediate=\"1\" data-sc-content-positions=\"[300,600,900,1200,1500,1800,2100]\" data-bind-scroll-on-start=\"true\"\u003e\u003col id=\"mntl-sc-block_17-0\"\u003e\n\u003cli id=\"mntl-sc-block_18-0\"\u003e\n\u003cp id=\"mntl-sc-block_19-0\"\u003e Fill a large bowl with cold water and stir in enough salt to make it salty like the sea (a 3% salt solution, by weight, is a good ratio). Add clams and let stand for 30 minutes. Lift clams from bowl and discard sandy water. Rinse out bowl and repeat this purging process until clams no longer release sand into the water (usually 2 to 3 purging cycles). Discard any clams that are gaping open and refuse to close when tapped. Set clean clams aside.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_20-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_23-0\"\u003e\n\u003cp id=\"mntl-sc-block_24-0\"\u003e Heat 3 tablespoons (45ml) oil in a deep 12-inch skillet over medium-high heat until shimmering. Add shallots, season lightly with salt, and cook, stirring occasionally, until shallots start to soften, about 5 minutes. Add garlic and red pepper flakes and cook, stirring constantly, until fragrant, about 30 seconds.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_25-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_28-0\"\u003e\n\u003cp id=\"mntl-sc-block_29-0\"\u003e Add wine and clams, increase heat to high, cover, and cook, shaking pan frequently, for 4 minutes. Uncover and, using tongs, transfer any clams that have opened to a medium bowl; cover bowl with foil to keep warm. Add mussels to skillet, cover, and continue to cook, shaking pan frequently and uncovering to stir and check shellfish every 45 seconds, until clams and mussels have all opened, 3 to 4 minutes longer. Using tongs, quickly transfer shellfish to bowl, and cover; leave aromatics and liquid in pan. Discard any clams or mussels that do not open.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_30-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_33-0\"\u003e\n\u003cp id=\"mntl-sc-block_34-0\"\u003e Add clam juice and 2 cups (475ml) water to skillet and bring mixture to a boil over high heat. Add spaghetti and cook, stirring constantly for the first 30 seconds to prevent noodles from sticking and then stirring occasionally, until pasta begins to have some flexibility and is softened on the exterior, but well shy of al dente and still uncooked in the center, about 3 minutes less than the package directions. Add water in 1/4 cup (60ml) increments as needed to ensure pasta cooks evenly and doesn\u0026#39;t stick to the bottom of the pan.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_35-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_38-0\"\u003e\n\u003cp id=\"mntl-sc-block_39-0\"\u003e Meanwhile, pull meat from about half of the clam shells and half of the mussel shells; discard empty shells and return shucked clams and mussels to bowl with remaining shell-on shellfish. Cover to keep warm.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_40-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_43-0\"\u003e\n\u003cp id=\"mntl-sc-block_44-0\"\u003e When pasta is just softened on the exterior, add shrimp and squid to skillet. Continue to cook over high, stirring and tossing, until shrimp and squid are just cooked through, 2 to 4 minutes.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_45-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_48-0\"\u003e\n\u003cp id=\"mntl-sc-block_49-0\"\u003e Add tomatoes and all of the mussels and clams, along with any accumulated juices, and continue to cook over high, stirring and tossing constantly, until all of the seafood is heated through, pasta is al dente, and sauce is creamy and coats the pasta, about 1 minute; add more water, 2 tablespoons (30ml) at a time, if sauce over-reduces and becomes dry or greasy. Remove from heat, add parsley and lemon juice, and toss rapidly to incorporate. Season with salt to taste.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_50-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_53-0\"\u003e\n\u003cp id=\"mntl-sc-block_54-0\"\u003e Transfer to a large serving bowl or divide between individual serving bowls, arranging shell-on mussels and clams on top of pasta. Drizzle with remaining 1 tablespoon (15ml) oil, and serve.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_55-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch2 id=\"mntl-sc-block_59-0\"\u003e \u003cspan\u003e Special Equipment \u003c/span\u003e \u003c/h2\u003e\n\u003cp id=\"mntl-sc-block_60-0\"\u003e 12-inch skillet with lid\n\u003c/p\u003e\n\n\u003ch2 id=\"mntl-sc-block_62-0\"\u003e \u003cspan\u003e Notes \u003c/span\u003e \u003c/h2\u003e\n\u003cp id=\"mntl-sc-block_63-0\"\u003e Small clams, such as littlenecks, Manilas, and cockles work best for this dish. Larger clams, such as cherrystones ,will take longer to cook and their meat will have to be chopped before being added to the spaghetti.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_65-0\"\u003e Examine mussels before using. Discard cracked mussels or open mussels that don\u0026#39;t close when tapped with another mussel. Farm-raised mussels are generally quite clean when sold, but they can still have grit and beards that need to be removed. Remove grit by scrubbing mussels well under cold running water, and remove beards (they look like wisps of hair coming out from between their shells) by grabbing them and pulling toward the hinge-end of the mussels; discard the beards once removed. For more information, view our \u003ca href=\"https://www.seriouseats.com/how-to-clean-debeard-mussels\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"1\"\u003edetailed guide to cleaning and debearding mussels\u003c/a\u003e.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_67-0\"\u003e For the squid, this recipe can be made with just bodies (tubes), or a combination of bodies and tentacles.\n\u003c/p\u003e\n\n\u003ch2 id=\"mntl-sc-block_69-0\"\u003e \u003cspan\u003e Make-Ahead and Storage \u003c/span\u003e \u003c/h2\u003e\n\u003cp id=\"mntl-sc-block_70-0\"\u003e This dish is best enjoyed immediately.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": null,
  "modifiedTime": null
}
