{
  "id": "5edb4411-51db-42e9-bebe-78d1c7271aaa",
  "title": "Whole-Grain Vegan Carrot Cake Loaf with Lemon Glaze",
  "link": "https://ohsheglows.com/whole-grain-vegan-carrot-cake-loaf-with-lemon-glaze/",
  "description": "A carrot cake loaf that’s wholesome enough to enjoy for breakfast?! Yes please! Spiced with cinnamon, vanilla, and ginger, this beauty will fill your house with a delicious scent as it bakes. The loaf is naturally sweetened with maple syrup, and a lemon-cashew-coconut glaze gives the whole thing a fresh, zingy kick. Growing up, I... Read More The post Whole-Grain Vegan Carrot Cake Loaf with Lemon Glaze appeared first on Oh She Glows.",
  "author": "",
  "published": "Thu, 28 Mar 2024 02:30:06 +0000",
  "source": "https://ohsheglows.com/feed/",
  "categories": [
    "Bread",
    "Breakfast",
    "Cakes/Cupcakes",
    "Desserts",
    "Easter",
    "Muffins/Squares/Quick Breads",
    "Soy Free",
    "easter dessert",
    "vegan",
    "vegan cake",
    "Vegan Carrot Cake Loaf",
    "vegan carrot loaf ricki",
    "vegan dessert",
    "vegan easter dessert",
    "vegan loaf",
    "vegan snack cake",
    "veganc arrot cake"
  ],
  "byline": "Angela Liddon (Oh She Glows)",
  "length": 7883,
  "excerpt": "Spiced with cinnamon, vanilla, and ginger, this simple Carrot Cake will fill your home with a delicious scent as it bakes.",
  "siteName": "Oh She Glows",
  "favicon": "https://ohsheglows.com/apple-touch-icon.png?v=LbxzkpPyzz",
  "text": "A carrot cake loaf that’s wholesome enough to enjoy for breakfast?! Yes please! Spiced with cinnamon, vanilla, and ginger, this beauty will fill your house with a delicious scent as it bakes. The loaf is naturally sweetened with maple syrup, and a lemon-cashew-coconut glaze gives the whole thing a fresh, zingy kick. Growing up, I was always taking pictures. Of everything. My love affair started with a classic pink Polaroid camera and I would save up my allowance to buy new film. Once I got my first point and shoot digital camera, I rarely left home without it. My family would always teasingly call me, ‘the little tourist’ because I took pictures of EVERYTHING…every moment…everyone…nothing could escape my wrath! I never expected that my love for photography would blossom into a real hobby in my adult life. Eric bought a Canon DSLR back in 2007 and I was so intimidated by it, I didn’t start using it for my blog photos for over two years! Over time, he was able to convince me (and show me) the difference a professional camera (and lens) could make in a photo with the right knowledge. So why all this camera talk? Well, after my carrot loaf shoot yesterday it really hit me how much I love food photography. Nothing is better than looking on the camera screen and getting excited by the shots. Ok, ok, it also helped that I took a nibble of this loaf and it tasted great! I kept telling myself, do not eat the slice, do not eat the slice…and then I was like ‘forget that’ and I took a bite! I think it gives the picture more character anyways. ;) If your hesitant about cake for breakfast, maybe try my Heavenly Carrot Cake Baked Oatmeal or my Oh Mega Carrot Cake Breakfast Cookies — they won’t disappoint! Vegan, refined sugar-free, soy-free ★★★★★4.8 from 9 reviews Yield10 slices, plus 1/2 cup + 2 tbsp (155 mL) glaze Prep time20 minutes Cook time45 minutes Total time1 hour, 5 minutes A carrot cake loaf that’s wholesome enough to enjoy for breakfast?! Yes please! Spiced with cinnamon, vanilla, and ginger, this beauty will fill your house with a delicious scent as it bakes. The loaf is naturally sweetened with maple syrup, and a lemon-cashew-coconut glaze gives the whole thing a fresh, zingy kick. This recipe is a revamp of my 2011 carrot cake loaf, which was originally adapted from Sweet Freedom. Ingredients For the loaf: 1 1/2 cups (185 g) finely grated peeled carrot*1 tablespoon (7 g) ground flax seed1/2 cup plus 1 tablespoon (140 mL) pure maple syrup3/4 cup (185 mL) almond milk or other plant milk1/3 cup (80 mL) grapeseed oil or melted coconut oil**1 1/2 teaspoons pure vanilla extract1 teaspoon apple cider vinegar2 teaspoons ground cinnamon1 teaspoon ground ginger2 teaspoons baking powder1/2 teaspoon baking soda1/2 teaspoon fine sea salt1 1/2 cups (230 g) whole-grain spelt flour***1 cup (100 g) walnuts, choppedFor the glaze:1/4 cup (60 mL) raw cashew butter1/4 cup (60 mL) full-fat coconut cream, at room temperature****2 tablespoons (30 mL) pure maple syrup, at room temperature1 tablespoon (15 mL) fresh lemon zest, or to tasteDash fine sea salt Directions Preheat the oven to 350°F (180°C) and line a lightly oiled 8x4-inch loaf pan with parchment paper. In a large bowl, mix the grated carrot, ground flax, maple syrup, almond milk, oil, vanilla, and vinegar until thoroughly combined. In that same bowl, one-by-one, stir in the dry ingredients: cinnamon, ginger, baking powder, baking soda, salt, flour, and half of the chopped walnuts. Mix until just combined. Pour the batter into the prepared loaf pan and smooth evenly with a spoon. Sprinkle the remaining walnuts on top of the loaf and press them gently into the surface. Bake for 40 to 50 minutes (I bake for 45 minutes) until the loaf springs back slowly when touched and a toothpick inserted into the middle comes out clean. Meanwhile, prepare the glaze. Combine the cashew butter, coconut cream, maple syrup, lemon zest, and salt in a blender or food processor. Blend or process until smooth. If it's too thick you can thin it with a bit of almond milk. After baking, place the loaf on a rack to finish cooling. The loaf is delicate so I don't suggest slicing until completely cooled. Once cool, slice the loaf, drizzling the lemon glaze on individual portions just before serving. Tip:* Please use the finest grate hole on the grater box. ** You can use any light-tasting oil you prefer. I’ve used light olive oil with success as well. If you use melted coconut oil, be sure that the rest of your wet ingredients are at room temperature to avoid seizing the oil. *** I expect all-purpose spelt flour will work just fine here too. Whole wheat pastry flour or sifted whole wheat flour should also work fine, but they may require extra baking time. **** Please use the thick, full-fat white cream found at the top of the can. Make it nut-free: Omit the walnuts to make this loaf nut-free. For a super-fast, nut-free lemon glaze you can whisk 1/2 cup powdered icing sugar with 1 tablespoon fresh lemon juice (or more to taste). Nutrition Information (click to expand) The original recipe is below: Whole-Grain Vegan Carrot Cake Loaf with Lemon Glaze Lightly adapted from Sweet Freedom. Glaze from Blissfully Vegan. Yield: 1 small loaf, eight 1-inch slices Ingredients: 1.5 cups finely grated carrot, unpacked 1 tbsp ground flax seed 1/2 cup pure maple syrup 3/4 cup almond milk (or other non-dairy milk) 1/3 cup light extra virgin olive oil (or oil of choice) 1.5 tsp pure vanilla extract 1/2 tsp apple cider vinegar 2 tsp freshly grated lemon zest 1.5 cups whole grain spelt flour 2 tsp ground cinnamon 1/2 tsp ground ginger 2 tsp baking powder 1/2 tsp baking soda 1/4 tsp kosher salt 1/2 cup raisins, soaked for 10 minutes \u0026 drained 1/4 cup walnuts, chopped Lemon glaze: 1/2 cup icing sugar whisked with 1 tbsp fresh lemon juice (or to taste) Directions: Preheat oven to 350F and line a small loaf pan (20cm x11cm x 6cm) with parchment. Lightly grease the parchment and sides of pan with oil and set aside. Note that the original recipe used an 8”x8” square pan so that would also work. In a medium bowl, mix together the grated carrot, ground flax, pure maple syrup, almond milk, oil, vanilla, vinegar, and lemon zest. Set aside for at least two minutes while you gather the dry ingredients. In another large sized bowl, whisk together the spelt flour, cinnamon, ginger, baking powder \u0026 soda, and salt. Pour the wet ingredients over the dry ingredients and stir until just combined (a few dry spots may remain). Fold in the raisins and chopped walnuts. Be careful not to overmix as spelt is a very delicate flour. Pour into prepared pan and bake at 350F for 45 minutes or until a toothpick comes out clean. Cool for 10 minutes in the pan, and then transfer the loaf to a wire rack to cool completely. Drizzle on lemon glaze just before serving. Serves eight 1” slices. May be frozen. I made this loaf for our family Easter get together this weekend. I froze the loaf (just until the glaze froze), and then wrapped it tightly two times with plastic wrap and  placed it into an air-tight container. It should keep nice and fresh for Saturday! I was also amazed at how much impact something as simple as a glaze could make in a photo. The glaze just makes the loaf look so much more interesting, doesn’t it? I also love how it drips through the rack onto the parchment. This is quite a dense loaf because spelt doesn’t rise much, but the nutty flavour really makes up for its short stature. Once I drizzled the glaze over this loaf, the lemon really stole the show and I found myself almost forgetting that I was eating a carrot loaf! If you are not a lemon fan, I’m sure you can sub almond milk (or any milk) for the lemon juice and create a traditional glaze. I’m sure the glaze would also be very good with a pinch of cinnamon in it too!",
  "image": "https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4746.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"genesis-content\"\u003e\u003carticle aria-label=\"Whole-Grain Vegan Carrot Cake Loaf with Lemon Glaze\"\u003e\u003cdiv\u003e\n\u003cp\u003eA carrot cake loaf that’s wholesome enough to enjoy for breakfast?! Yes please! Spiced with cinnamon, vanilla, and ginger, this beauty will fill your house with a delicious scent as it bakes. The loaf is naturally sweetened with maple syrup, and a lemon-cashew-coconut glaze gives the whole thing a fresh, zingy kick.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"550\" height=\"550\" src=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4746.jpg\" alt=\"Whole-Grain Vegan Carrot Cake Loaf with Lemon Glaze\" title=\"IMG_4746\" srcset=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4746.jpg 550w, https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4746-360x360.jpg 360w\" sizes=\"(max-width: 550px) 100vw, 550px\"/\u003e\u003c/figure\u003e\n\u003cp\u003eGrowing up, I was \u003cu\u003ealways\u003c/u\u003e taking pictures. Of everything. My love affair started with a classic pink Polaroid camera and I would save up my allowance to buy new film.\u003c/p\u003e\n\u003cp\u003eOnce I got my first point and shoot digital camera, I rarely left home without it. My family would always teasingly call me, ‘the little tourist’ because I took pictures of EVERYTHING…every moment…everyone…nothing could escape my wrath!\u003c/p\u003e\n\u003cp\u003eI never expected that my love for photography would blossom into a real hobby in my adult life. Eric bought a Canon DSLR back in 2007 and I was so intimidated by it, I didn’t start using it for my blog photos for over two years! Over time, he was able to convince me (and show me) the difference a professional camera (and lens) could make in a photo with the right knowledge.\u003c/p\u003e\n\u003cp\u003eSo why all this camera talk? Well, after my carrot loaf shoot yesterday it really hit me how much I love food photography. Nothing is better than looking on the camera screen and getting excited by the shots.\u003c/p\u003e\n\u003cp\u003eOk, ok, it also helped that I took a nibble of this loaf and it tasted great!\u003c/p\u003e\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"550\" height=\"328\" src=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4748-2.jpg\" alt=\"\" title=\"IMG_4748-2\" srcset=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4748-2.jpg 550w, https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4748-2-360x215.jpg 360w\" sizes=\"(max-width: 550px) 100vw, 550px\"/\u003e\u003c/figure\u003e\n\u003cp\u003eI kept telling myself, \u003cem\u003edo not eat the slice, do not eat the slice\u003c/em\u003e…and then I was like\u003cem\u003e ‘forget that’\u003c/em\u003e and I took a bite! I think it gives the picture more character anyways. ;)\u003c/p\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"728\" height=\"486\" src=\"https://ohsheglows.com/wp-content/uploads/2011/04/vegancarrotcakeloaf-728x486.jpg\" alt=\"\" srcset=\"https://ohsheglows.com/wp-content/uploads/2011/04/vegancarrotcakeloaf-728x486.jpg 728w, https://ohsheglows.com/wp-content/uploads/2011/04/vegancarrotcakeloaf-360x240.jpg 360w\" sizes=\"(max-width: 728px) 100vw, 728px\"/\u003e\u003c/figure\u003e\n\u003cp\u003eIf your hesitant about cake for breakfast, maybe try my \u003ca href=\"https://ohsheglows.com/heavenly-carrot-cake-baked-oatmeal/\"\u003eHeavenly Carrot Cake Baked Oatmeal\u003c/a\u003e or my \u003ca href=\"https://ohsheglows.com/oh-mega-carrot-cake-breakfast-cookies-superfood-green-monster/\"\u003eOh Mega Carrot Cake Breakfast Cookies\u003c/a\u003e — they won’t disappoint!\u003c/p\u003e\n\u003carticle id=\"recipe_3892\" itemid=\"#recipe_3892\"\u003e\n \u003cp\u003e\u003cimg decoding=\"async\" title=\"Whole-Grain Carrot Cake Loaf with Lemon Glaze\" alt=\"\" src=\"https://ohsheglows.com/gs_images/2018/01/Carrot-Cake-Loaf-00502-1-768x768.jpg\"/\u003e \u003c/p\u003e\n\u003cheader\u003e\n\n\u003cp\u003e\u003cspan\u003eVegan, refined sugar-free, soy-free\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e★\u003c/span\u003e\u003cspan\u003e★\u003c/span\u003e\u003cspan\u003e★\u003c/span\u003e\u003cspan\u003e★\u003c/span\u003e\u003cspan\u003e★\u003c/span\u003e\u003cbr/\u003e4.8 from 9 reviews\u003c/p\u003e\n\u003cimg decoding=\"async\" src=\"https://ohsheglows.com/wp-content/plugins/osg-recipes/images/ornament_long_artichoke.png\" alt=\"\"/\u003e\n\u003cp\u003e\n\u003ch6 class=\"first\"\u003eYield\u003cbr/\u003e\u003cspan\u003e10 slices, plus 1/2 cup + 2 tbsp (155 mL) glaze\u003c/span\u003e\u003c/h6\u003e\n\u003ch6\u003ePrep time\u003cbr/\u003e\u003ctime datetime=\"PT20M\"\u003e20 minutes\u003c/time\u003e\u003c/h6\u003e\n\u003ch6\u003eCook time\u003cbr/\u003e\u003ctime datetime=\"PT45M\"\u003e45 minutes\u003c/time\u003e\u003c/h6\u003e\n\u003ch6\u003eTotal time\u003cbr/\u003e\u003ctime datetime=\"PT1H5M\"\u003e1 hour, 5 minutes\u003c/time\u003e\u003c/h6\u003e\n\u003c/p\u003e\n\u003c/header\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003eA carrot cake loaf that’s wholesome enough to enjoy for breakfast?! Yes please! Spiced with cinnamon, vanilla, and ginger, this beauty will fill your house with a delicious scent as it bakes. The loaf is naturally sweetened with maple syrup, and a lemon-cashew-coconut glaze gives the whole thing a fresh, zingy kick. This recipe is a revamp of my 2011 carrot cake loaf, which was originally adapted from Sweet Freedom.\u003c/p\u003e\u003c/div\u003e\n\u003ch4\u003eIngredients\u003c/h4\u003e\n\u003ch5\u003eFor the loaf: \u003c/h5\u003e\u003cul\u003e\u003cli\u003e1 1/2 cups (185 g) finely grated peeled carrot\u003cspan\u003e*\u003c/span\u003e\u003c/li\u003e\u003cli\u003e1 tablespoon (7 g) ground flax seed\u003c/li\u003e\u003cli\u003e1/2 cup plus 1 tablespoon (140 mL) pure maple syrup\u003c/li\u003e\u003cli\u003e3/4 cup (185 mL) almond milk or other plant milk\u003c/li\u003e\u003cli\u003e1/3 cup (80 mL) grapeseed oil or melted coconut oil\u003cspan\u003e*\u003c/span\u003e\u003cspan\u003e*\u003c/span\u003e\u003c/li\u003e\u003cli\u003e1 1/2 teaspoons pure vanilla extract\u003c/li\u003e\u003cli\u003e1 teaspoon apple cider vinegar\u003c/li\u003e\u003cli\u003e2 teaspoons ground cinnamon\u003c/li\u003e\u003cli\u003e1 teaspoon ground ginger\u003c/li\u003e\u003cli\u003e2 teaspoons baking powder\u003c/li\u003e\u003cli\u003e1/2 teaspoon baking soda\u003c/li\u003e\u003cli\u003e1/2 teaspoon fine sea salt\u003c/li\u003e\u003cli\u003e1 1/2 cups (230 g) whole-grain spelt flour\u003cspan\u003e*\u003c/span\u003e\u003cspan\u003e*\u003c/span\u003e\u003cspan\u003e*\u003c/span\u003e\u003c/li\u003e\u003cli\u003e1 cup (100 g) walnuts, chopped\u003c/li\u003e\u003c/ul\u003e\u003ch5\u003eFor the glaze:\u003c/h5\u003e\u003cul\u003e\u003cli\u003e1/4 cup (60 mL) raw cashew butter\u003c/li\u003e\u003cli\u003e1/4 cup (60 mL) full-fat coconut cream, at room temperature\u003cspan\u003e*\u003c/span\u003e\u003cspan\u003e*\u003c/span\u003e\u003cspan\u003e*\u003c/span\u003e\u003cspan\u003e*\u003c/span\u003e\u003c/li\u003e\u003cli\u003e2 tablespoons (30 mL) pure maple syrup, at room temperature\u003c/li\u003e\u003cli\u003e1 tablespoon (15 mL) fresh lemon zest, or to taste\u003c/li\u003e\u003cli\u003eDash fine sea salt\u003c/li\u003e\u003c/ul\u003e\n\u003ch4\u003eDirections\u003c/h4\u003e\n\u003cdiv\u003e\u003col\u003e \u003cli\u003e Preheat the oven to 350°F (180°C) and line a lightly oiled 8x4-inch loaf pan with parchment paper. \u003c/li\u003e \u003cli\u003e In a large bowl, mix the grated carrot, ground flax, maple syrup, almond milk, oil, vanilla, and vinegar until thoroughly combined. \u003c/li\u003e \u003cli\u003e In that same bowl, one-by-one, stir in the dry ingredients: cinnamon, ginger, baking powder, baking soda, salt, flour, and half of the chopped walnuts. Mix until just combined.\u003c/li\u003e \u003cli\u003e Pour the batter into the prepared loaf pan and smooth evenly with a spoon. Sprinkle the remaining walnuts on top of the loaf and press them gently into the surface. \u003c/li\u003e \u003cli\u003e Bake for 40 to 50 minutes (I bake for 45 minutes) until the loaf springs back slowly when touched and a toothpick inserted into the middle comes out clean. \u003c/li\u003e \u003cli\u003e Meanwhile, prepare the glaze. Combine the cashew butter, coconut cream, maple syrup, lemon zest, and salt in a blender or food processor. Blend or process until smooth. If it\u0026#39;s too thick you can thin it with a bit of almond milk.\u003c/li\u003e \u003cli\u003e After baking, place the loaf on a rack to finish cooling. The loaf is delicate so I don\u0026#39;t suggest slicing until completely cooled.\u003c/li\u003e \u003cli\u003e Once cool, slice the loaf, drizzling the lemon glaze on individual portions just before serving. \u003c/li\u003e\u003c/ol\u003e\u003c/div\u003e\n\u003ch4\u003eTip:\u003c/h4\u003e\u003cp\u003e\u003cspan\u003e*\u003c/span\u003e Please use the finest grate hole on the grater box.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e*\u003c/span\u003e\u003cspan\u003e*\u003c/span\u003e You can use any light-tasting oil you prefer. I’ve used light olive oil with success as well. If you use melted coconut oil, be sure that the rest of your wet ingredients are at room temperature to avoid seizing the oil.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e*\u003c/span\u003e\u003cspan\u003e*\u003c/span\u003e\u003cspan\u003e*\u003c/span\u003e I expect all-purpose spelt flour will work just fine here too. Whole wheat pastry flour or sifted whole wheat flour should also work fine, but they may require extra baking time.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e*\u003c/span\u003e\u003cspan\u003e*\u003c/span\u003e\u003cspan\u003e*\u003c/span\u003e\u003cspan\u003e*\u003c/span\u003e Please use the thick, full-fat white cream found at the top of the can.\u003c/p\u003e\n\u003cp\u003eMake it nut-free: Omit the walnuts to make this loaf nut-free. For a super-fast, nut-free lemon glaze you can whisk 1/2 cup powdered icing sugar with 1 tablespoon fresh lemon juice (or more to taste).\u003c/p\u003e\n\u003cdiv id=\"nutrition_info\"\u003e\n\u003ch4\u003eNutrition Information\u003c/h4\u003e\n\u003cp\u003e\u003cspan\u003e(click to expand)\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\n\u003c/article\u003e\n\u003cp\u003eThe original recipe is below:\u003c/p\u003e\n\u003ch3\u003e\u003cu\u003eWhole-Grain Vegan Carrot Cake Loaf with Lemon Glaze\u003c/u\u003e\u003c/h3\u003e\n\u003cp\u003eLightly adapted from Sweet Freedom. Glaze from \u003ca href=\"http://blissfullyvegan.wordpress.com/2010/09/03/road-trip-carrot-loaf/\"\u003eBlissfully Vegan\u003c/a\u003e. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYield:\u003c/strong\u003e 1 small loaf, eight 1-inch slices\u003c/p\u003e\n\u003cp\u003e\u003cu\u003e\u003cstrong\u003eIngredients:\u003c/strong\u003e\u003c/u\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e1.5 cups finely grated carrot, unpacked\u003c/li\u003e\n\u003cli\u003e1 tbsp ground flax seed\u003c/li\u003e\n\u003cli\u003e1/2 cup pure maple syrup\u003c/li\u003e\n\u003cli\u003e3/4 cup almond milk (or other non-dairy milk)\u003c/li\u003e\n\u003cli\u003e1/3 cup light extra virgin olive oil (or oil of choice)\u003c/li\u003e\n\u003cli\u003e1.5 tsp pure vanilla extract\u003c/li\u003e\n\u003cli\u003e1/2 tsp apple cider vinegar\u003c/li\u003e\n\u003cli\u003e2 tsp freshly grated lemon zest\u003c/li\u003e\n\u003cli\u003e1.5 cups whole grain spelt flour\u003c/li\u003e\n\u003cli\u003e2 tsp ground cinnamon\u003c/li\u003e\n\u003cli\u003e1/2 tsp ground ginger\u003c/li\u003e\n\u003cli\u003e2 tsp baking powder\u003c/li\u003e\n\u003cli\u003e1/2 tsp baking soda\u003c/li\u003e\n\u003cli\u003e1/4 tsp kosher salt\u003c/li\u003e\n\u003cli\u003e1/2 cup raisins, soaked for 10 minutes \u0026amp; drained\u003c/li\u003e\n\u003cli\u003e1/4 cup walnuts, chopped\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cu\u003eLemon glaze\u003c/u\u003e: 1/2 cup icing sugar whisked with 1 tbsp fresh lemon juice (or to taste)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDirections:\u003c/strong\u003e \u003c/p\u003e\n\u003col\u003e\n\u003cli\u003ePreheat oven to 350F and line a \u003cu\u003e\u003cstrong\u003esmall\u003c/strong\u003e\u003c/u\u003e loaf pan (20cm x11cm x 6cm) with parchment. Lightly grease the parchment and sides of pan with oil and set aside. Note that the original recipe used an 8”x8” square pan so that would also work.\u003c/li\u003e\n\u003cli\u003eIn a medium bowl, mix together the grated carrot, ground flax, pure maple syrup, almond milk, oil, vanilla, vinegar, and lemon zest. Set aside for at least two minutes while you gather the dry ingredients.\u003c/li\u003e\n\u003cli\u003eIn another large sized bowl, whisk together the spelt flour, cinnamon, ginger, baking powder \u0026amp; soda, and salt. Pour the wet ingredients over the dry ingredients and stir until just combined (a few dry spots may remain). Fold in the raisins and chopped walnuts. Be careful not to overmix as spelt is a very delicate flour.\u003c/li\u003e\n\u003cli\u003ePour into prepared pan and bake at 350F for 45 minutes or until a toothpick comes out clean. Cool for 10 minutes in the pan, and then transfer the loaf to a wire rack to cool completely. Drizzle on lemon glaze just before serving. Serves eight 1” slices. May be frozen. \u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eI made this loaf for our family \u003cstrong\u003eEaster get together\u003c/strong\u003e this weekend. I froze the loaf (just until the glaze froze), and then wrapped it tightly two times with plastic wrap and  placed it into an air-tight container. It should keep nice and fresh for Saturday!\u003c/p\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"550\" height=\"354\" src=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4720.jpg\" alt=\"IMG_4720\" title=\"IMG_4720\" srcset=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4720.jpg 550w, https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4720-360x232.jpg 360w\" sizes=\"(max-width: 550px) 100vw, 550px\"/\u003e\u003c/figure\u003e\n\u003cp\u003eI was also amazed at how much impact something as simple as a glaze could make in a photo.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"550\" height=\"357\" src=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4726.jpg\" alt=\"IMG_4726\" title=\"IMG_4726\" srcset=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4726.jpg 550w, https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4726-360x234.jpg 360w\" sizes=\"(max-width: 550px) 100vw, 550px\"/\u003e\u003c/figure\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"550\" height=\"550\" src=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4743-2.jpg\" alt=\"\" title=\"IMG_4743-2\" srcset=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4743-2.jpg 550w, https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4743-2-360x360.jpg 360w\" sizes=\"(max-width: 550px) 100vw, 550px\"/\u003e\u003c/figure\u003e\n\u003cp\u003eThe glaze just makes the loaf look so much more interesting, doesn’t it? I also love how it drips through the rack onto the parchment.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"550\" height=\"550\" src=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_47461.jpg\" alt=\"\" title=\"IMG_4746\" srcset=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_47461.jpg 550w, https://ohsheglows.com/wp-content/uploads/2011/04/IMG_47461-360x360.jpg 360w\" sizes=\"(max-width: 550px) 100vw, 550px\"/\u003e\u003c/figure\u003e\n\u003cp\u003eThis is quite a dense loaf because spelt doesn’t rise much, but the nutty flavour really makes up for its short stature.\u003c/p\u003e\n\u003cp\u003eOnce I drizzled the glaze over this loaf, the lemon really stole the show and I found myself almost forgetting that I was eating a carrot loaf! If you are not a lemon fan, I’m sure you can sub almond milk (or any milk) for the lemon juice and create a traditional glaze. I’m sure the glaze would also be very good with a pinch of \u003cstrong\u003ecinnamon\u003c/strong\u003e in it too!\u003c/p\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"550\" height=\"367\" src=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4748.jpg\" alt=\"\" title=\"IMG_4748\" srcset=\"https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4748.jpg 550w, https://ohsheglows.com/wp-content/uploads/2011/04/IMG_4748-360x240.jpg 360w\" sizes=\"(max-width: 550px) 100vw, 550px\"/\u003e\u003c/figure\u003e\n\u003c/div\u003e\u003c/article\u003e \n\n\n\n\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-03-28T02:30:06Z",
  "modifiedTime": "2024-03-28T04:53:02Z"
}
