{
  "id": "9179bdd1-cae6-49f3-b4d4-f93dded18a31",
  "title": "Gnocchi Alla Bava (Potato Gnocchi With Fontina Cheese Sauce)",
  "link": "https://www.seriouseats.com/recipes/2021/03/gnocchi-alla-bava-gnocchi-fontina-cheese-sauce.html",
  "description": "Gnocchi alla bava is true mountain food. Hailing from the Italian Alps, it features tender and lightly sweet potato gnocchi in a rich and creamy Fontina cheese sauce, flavored with little else aside from a touch of black pepper and nutmeg.",
  "author": "Daniel Gritzer",
  "published": "2021-03-04T13:00:24Z",
  "source": "http://feeds.feedburner.com/seriouseats/recipes",
  "categories": [
    "Cheese",
    "Italian",
    "Mains",
    "Potato",
    "Stovetop",
    "Vegetarian"
  ],
  "byline": "Daniel Gritzer",
  "length": 8880,
  "excerpt": "Gnocchi alla bava features tender and lightly sweet potato gnocchi in a rich and creamy Fontina cheese sauce, flavored with a touch of black pepper and nutmeg.",
  "siteName": "Serious Eats",
  "favicon": "https://www.seriouseats.com/apple-touch-icon-180x180.png",
  "text": "Why It Works Homemade gnocchi that prioritize structure over ethereal lightness deliver great potato flavor while holding their shape.The melting properties of Fontina cheese means it can be incorporated into a creamy, smooth sauce without the need for a roux. In the Italian Northwestern Alpine region of Valle D'Aosta, there are no olive orchards, no soft rolling hills lined with spindly cypress, no warm Mediterranean waters. Instead, road signs are written in Italian and French, vineyards are precariously etched into rocky cliffsides, and dramatic ridges rise steeply from green valleys below up to blue-grey snowy peaks, all of it presided over by Monte Bianco—Mont Blanc, if you're on the Swiss or French sides of the border—the tallest mountain in Western Europe. Climb the region's winding roads higher and higher and your ears will eventually pick up a strange and marvelous music coming from nearby pastures—hundreds of bells tolling together to make a sound that's both discordant and arrhythmic yet somehow also soothing. The unwitting musicians are the local cows, each with an oversize bell slung around its neck from a heavy leather strap, the dings and dongs sounding with each step and bite of grass. Those cows are responsible for Fontina cheese, arguably the greatest cheese to come out of Valle D'Aosta. A member of the Alpine cheese family, which includes classics like Gruyère, Comté, and Emmentaler, Fontina is earthy, nutty, and buttery, with pleasant mushroom notes. It's also a superb melting cheese. That's the secret to the region's \"bava\" sauce, so named for the drool that it either elicits from diners or resembles in its melted state (or both, maybe). Fontina melts so beautifully that there's no need for any extra techniques to help it form a smooth and stable emulsion—no butter-and-flour roux used to build cheese sauces like Mornay, no tartaric acids (whether from wine or cream of tartar) required for a successful fondue. Simply whisk cubed Fontina over moderate heat into heavy cream with some butter, black pepper, and nutmeg, and the sauce will form. Folded with tender potato gnocchi, the result is true mountain food, rich and hearty, guaranteed to warm bellies and provide extra calories to combat that cold mountain air. At least, the cheese will melt if you use real Fontina, the DOP version from Valle D'Aosta. This is one of those cheeses with a serious imposter problem, plagued by legal fakes coming out of everywhere from Denmark to Argentina and the United States. Could those work too? Perhaps, but I didn't bother testing them. I've made the mistake of eating those facsimiles before and, if you know the flavor of real Fontina, they just won't do. Verified Fontina tastes best, and it works, so as far as I'm concerned there's no need to dig into it beyond that. This may sound like snobbish dismissal of more affordable options, but I'm standing by it. Unlike a multi-cheese sauce like quattro formaggi, alla bava stars Fontina, and only Fontina. Its flavor is the sauce. Served on tender and mildly sweet potato gnocchi, there's little for a subpar sauce to hide behind. Speaking of those gnocchi, while some recipes for gnocchi alla bava call for using little buckwheat-flour dumplings, many others call for potato dumplings, and if you're going to make the best version of potato gnocchi alla bava, the gnocchi must be homemade. Store-bought gnocchi (with very few exceptions) are heavy, dense, and lack what should be their signature potato flavor. The sauce itself comes together so easily that making the gnocchi really is the only real work, and it's work that's worthwhile. With just a little practice, it's hardly much of a project: Bake the potatoes, scoop out the flesh and rice it, knead gently with flour and egg, form, and cook. Gnocchi Alla Bava (Potato Gnocchi With Fontina Cheese Sauce) Recipe For the Gnocchi (see note): 3 pounds (1.4kg) russet potatoes, scrubbed and pierced all over with a fork 3 large egg yolks, lightly beaten 1 cup all purpose flour (4 1/2 ounces; 128g), divided, plus more as needed and for dusting 1 1/2 teaspoons (6g) Diamond Crystal kosher salt; for table salt use half as much by volume or the same weight For the Sauce and to Serve: Kosher salt and freshly ground black pepper 1 cup (235ml) heavy cream 8 ounces (225g) rind-free Fontina Valle D'Aosta DOP, cut into 1/2-inch pieces (about 1 1/4 cups) 2 tablespoons (30g) unsalted butter Generous pinch freshly grated nutmeg, plus extra for serving For the Gnocchi: Adjust oven rack to middle position, and preheat oven to 450°F (232°C). Set potatoes either on a wire rack set over a baking sheet, on a baking sheet lined with a layer of salt, or directly on the oven's racks. Bake until completely tender throughout when pierced with a fork, about 45 minutes. Transfer potatoes to a work surface. Using tongs to hold hot potatoes, slice each in half lengthwise. Using a spoon, scoop potato flesh into a ricer or food mill fitted with the finest disk. Press potato flesh onto a clean work surface, spreading it into an even layer, and allow steam to escape for a few minutes. Drizzle egg yolks all over. Sprinkle with 1 1/2 teaspoons salt. Scoop 3/4 cup (100g) flour into a fine-mesh strainer and tap to dust flour all over potatoes. Using pastry blender or bench scraper, chop down repeatedly all over to cut flour and egg into potato. Using a bench scraper, gather up shaggy potato mass and pat into a loose ball. Press ball flat with hands, then fold in half using bench scraper and press down again. Scoop remaining 1/4 cup (30g) flour into sieve and dust all over potato dough. Continue to gently fold and press, just until a uniform dough comes together; make sure to simply fold and press down and avoid the smearing motion more commonly used when kneading bread. Add additional flour as necessary to achieve a dough that's tender and moist yet can hold its shape, but not wet and sticky (whether you need more flour, and how much you might need, will depend on natural moisture content of the potatoes you use, which is highly variable, but a dough that's too wet and pasty is prone to falling apart when boiled). Dust potato dough all over with flour and gently form into a log. Clean work area well and dust with fresh flour. Using bench scraper, slice off a roughly 2-inch-thick portion of dough and roll into a snake about 1/2 inch thick; use a light touch as you roll, trying to use your palms more than your fingers, and dusting as necessary with flour to prevent sticking. Using bench scraper, cut snake into 1-inch portions, trimming off uneven ends as necessary. If desired, gently roll each gnocco on the tines of a fork to give it a ridged exterior. Transfer gnocchi to a well-floured area or baking sheet and repeat with remaining dough. If not cooking recipe start-to-finish, baking sheet of gnocchi can be transferred to the freezer at this point (see make-ahead and storage section for full freezing instructions). For the Sauce and to Serve: Bring a large pot of salted water to a simmer over medium-high heat. Meanwhile, in a 3-quart saucier or 12-inch stainless-steel skillet, combine cream, Fontina, butter, a pinch of black pepper, and nutmeg. Set over medium heat and cook, whisking constantly, until butter and cheese are fully melted and a smooth, silky sauce has formed, about 4 minutes. Season with salt, but only if necessary. Keep warm, stirring frequently to prevent a skin from forming. Working in batches to prevent crowding the pot, add gnocchi to simmering water and cook, gently shaking the pot as needed to keep them from sticking, until they float to the surface. Using a spider skimmer, lift floating gnocchi from the water and let drain, then transfer to cheese sauce. Toss very gently with a large spoon to coat, being careful not to break gnocchi. Repeat with remaining gnocchi and toss gently once more to coat. Remove from heat. Divide gnocchi and sauce between warmed serving bowls, top each portion with grated nutmeg, and serve. Special Equipment Potato ricer or food mill; fine-mesh strainer; bench scraper; 3-quart saucier or 12-inch skillet; spider skimmer Notes We strongly recommend making your own gnocchi, since almost all store-bought products have bad texture and flavor. However, if you have a source for good store-bought gnocchi, you'll need about 2 pounds (900g). Make-Ahead and Storage The formed, uncooked gnocchi can be frozen on the sheet tray. Once frozen, use a thin metal spatula to free from sheet tray, transfer to a zipper-lock bag, press out excess air, and seal. Return to freezer until ready to use. To cook, add frozen gnocchi directly to gently simmering water.",
  "image": "https://www.seriouseats.com/thmb/KxUeYzrfir0UuvFgghJgcDxPGVE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2021__02__20210201-gnocchi-alla-bava-fontina-cheese-sauce-daniel-gritzer-5-b4272214bc2d4a2798f138a8f362e053.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article__header--project_1-0\" data-sc-sticky-offset=\"200\" data-sc-ad-label-height=\"11\" data-sc-ad-track-spacing=\"100\" data-sc-min-track-height=\"250\" data-sc-max-track-height=\"600\" data-sc-breakpoint=\"50em\" data-sc-load-immediate=\"1\" data-sc-content-positions=\"[1, 1, 1, 1, 1, 1, 1]\" data-bind-scroll-on-start=\"true\"\u003e\u003cdiv id=\"mntl-sc-block_1-0\" data-tracking-id=\"mntl-sc-block-callout\" data-tracking-container=\"true\"\u003e\u003ch3 id=\"mntl-sc-block-callout-heading_1-0\"\u003eWhy It Works\u003c/h3\u003e\n\u003cdiv id=\"mntl-sc-block-callout-body_1-0\"\u003e\u003cul\u003e\u003cli\u003eHomemade gnocchi that prioritize structure over ethereal lightness deliver great potato flavor while holding their shape.\u003c/li\u003e\u003cli\u003eThe melting properties of Fontina cheese means it can be incorporated into a creamy, smooth sauce without the need for a roux.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\n\u003cp id=\"mntl-sc-block_2-0\"\u003e In the Italian Northwestern Alpine region of Valle D\u0026#39;Aosta, there are no olive orchards, no soft rolling hills lined with spindly cypress, no warm Mediterranean waters. Instead, road signs are written in Italian and French, vineyards are precariously etched into rocky cliffsides, and dramatic ridges rise steeply from green valleys below up to blue-grey snowy peaks, all of it presided over by Monte Bianco—Mont Blanc, if you\u0026#39;re on the Swiss or French sides of the border—the tallest mountain in Western Europe.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_4-0\"\u003e Climb the region\u0026#39;s winding roads higher and higher and your ears will eventually pick up a strange and marvelous music coming from nearby pastures—hundreds of bells tolling together to make a sound that\u0026#39;s both discordant and arrhythmic yet somehow also soothing. The unwitting musicians are the local cows, each with an oversize bell slung around its neck from a heavy leather strap, the dings and dongs sounding with each step and bite of grass.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_6-0\"\u003e Those cows are responsible for Fontina cheese, arguably the greatest cheese to come out of Valle D\u0026#39;Aosta. A member of the Alpine cheese family, which includes classics like Gruyère, Comté, and Emmentaler, Fontina is earthy, nutty, and buttery, with pleasant mushroom notes. It\u0026#39;s also a superb melting cheese.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_8-0\"\u003e That\u0026#39;s the secret to the region\u0026#39;s \u0026#34;bava\u0026#34; sauce, so named for the drool that it either elicits from diners or resembles in its melted state (or both, maybe). Fontina melts so beautifully that there\u0026#39;s no need for any extra techniques to help it form a smooth and stable emulsion—no butter-and-flour roux used to build cheese sauces like \u003ca href=\"https://www.seriouseats.com/mornay-sauce-recipe\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"1\"\u003eMornay\u003c/a\u003e, no tartaric acids (whether from wine or cream of tartar) required for a successful \u003ca href=\"https://www.seriouseats.com/cheese-fondue-emmentaler-gruyere-recipe\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"2\"\u003efondue\u003c/a\u003e.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_10-0\"\u003e Simply whisk cubed Fontina over moderate heat into heavy cream with some butter, black pepper, and nutmeg, and the sauce will form. Folded with tender potato gnocchi, the result is true mountain food, rich and hearty, guaranteed to warm bellies and provide extra calories to combat that cold mountain air.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_12-0\"\u003e At least, the cheese will melt if you use real Fontina, the DOP version from Valle D\u0026#39;Aosta. This is one of those cheeses with a serious imposter problem, plagued by legal fakes coming out of everywhere from Denmark to Argentina and the United States. Could those work too? Perhaps, but I didn\u0026#39;t bother testing them. I\u0026#39;ve made the mistake of eating those facsimiles before and, if you know the flavor of real Fontina, they just won\u0026#39;t do. Verified Fontina tastes best, and it works, so as far as I\u0026#39;m concerned there\u0026#39;s no need to dig into it beyond that.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_14-0\"\u003e This may sound like snobbish dismissal of more affordable options, but I\u0026#39;m standing by it. Unlike a multi-cheese sauce like \u003ca href=\"https://www.seriouseats.com/pasta-ai-quattro-formaggi\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"1\"\u003equattro formaggi\u003c/a\u003e, alla bava stars Fontina, and only Fontina. Its flavor \u003cem\u003eis\u003c/em\u003e the sauce. Served on tender and mildly sweet potato gnocchi, there\u0026#39;s little for a subpar sauce to hide behind.\n\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_16-0\"\u003e Speaking of those gnocchi, while some recipes for gnocchi alla bava call for using little buckwheat-flour dumplings, many others call for potato dumplings, and if you\u0026#39;re going to make the best version of potato gnocchi alla bava, the gnocchi must be homemade. Store-bought gnocchi (with very few exceptions) are heavy, dense, and lack what should be their signature potato flavor. The sauce itself comes together so easily that making the gnocchi really is the only real work, and it\u0026#39;s work that\u0026#39;s worthwhile. With just a little practice, it\u0026#39;s hardly much of a project: Bake the potatoes, scoop out the flesh and rice it, knead gently with flour and egg, form, and cook.\n\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"structured-project-content_1-0\"\u003e\u003cdiv id=\"recipe-decision-block_1-0\"\u003e \n\u003ch2\u003eGnocchi Alla Bava (Potato Gnocchi With Fontina Cheese Sauce) Recipe\u003c/h2\u003e\n\n\n\u003c/div\u003e\n\u003cdiv id=\"section--ingredients_1-0\"\u003e \u003cp\u003eFor the Gnocchi (see note):\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cspan data-ingredient-quantity=\"true\"\u003e3\u003c/span\u003e \u003cspan data-ingredient-unit=\"true\"\u003epounds\u003c/span\u003e (1.4kg) \u003cspan data-ingredient-name=\"true\"\u003erusset potatoes\u003c/span\u003e, scrubbed and pierced all over with a fork\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cspan data-ingredient-quantity=\"true\"\u003e3\u003c/span\u003e \u003cspan data-ingredient-unit=\"true\"\u003elarge\u003c/span\u003e \u003cspan data-ingredient-name=\"true\"\u003eegg yolks\u003c/span\u003e, lightly beaten\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e1 cup \u003cspan data-ingredient-name=\"true\"\u003eall purpose flour\u003c/span\u003e (4 1/2 ounces; \u003cspan data-ingredient-quantity=\"true\"\u003e128\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e), divided, plus more as needed and for dusting\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e1 1/2 teaspoons (\u003cspan data-ingredient-quantity=\"true\"\u003e6\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e) Diamond Crystal \u003cspan data-ingredient-name=\"true\"\u003ekosher salt\u003c/span\u003e; for table salt use half as much by volume or the same weight\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFor the Sauce and to Serve:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cspan data-ingredient-name=\"true\"\u003eKosher salt\u003c/span\u003e and freshly ground black pepper\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e1 cup (\u003cspan data-ingredient-quantity=\"true\"\u003e235\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eml\u003c/span\u003e) \u003cspan data-ingredient-name=\"true\"\u003eheavy cream\u003c/span\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e8 ounces (\u003cspan data-ingredient-quantity=\"true\"\u003e225\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e) rind-free \u003cspan data-ingredient-name=\"true\"\u003eFontina Valle D\u0026#39;Aosta DOP\u003c/span\u003e, cut into 1/2-inch pieces (about 1 1/4 cups)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e2 tablespoons (\u003cspan data-ingredient-quantity=\"true\"\u003e30\u003c/span\u003e\u003cspan data-ingredient-unit=\"true\"\u003eg\u003c/span\u003e) \u003cspan data-ingredient-name=\"true\"\u003eunsalted butter\u003c/span\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cspan data-ingredient-quantity=\"true\"\u003eGenerous pinch\u003c/span\u003e \u003cspan data-ingredient-name=\"true\"\u003efreshly grated nutmeg\u003c/span\u003e, plus extra for serving\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\u003cdiv id=\"section--instructions_1-0\" data-sc-sticky-offset=\"60\" data-sc-ad-label-height=\"24\" data-sc-ad-track-spacing=\"100\" data-sc-min-track-height=\"250\" data-sc-max-track-height=\"600\" data-sc-breakpoint=\"50em\" data-sc-load-immediate=\"1\" data-sc-content-positions=\"[300,600,900,1200,1500,1800,2100]\" data-bind-scroll-on-start=\"true\"\u003e\u003col id=\"mntl-sc-block_17-0\"\u003e\n\u003cli id=\"mntl-sc-block_18-0\"\u003e\n\u003cp id=\"mntl-sc-block_19-0\"\u003e \u003cstrong\u003eFor the Gnocchi:\u003c/strong\u003e Adjust oven rack to middle position, and preheat oven to 450°F (232°C). Set potatoes either on a wire rack set over a baking sheet, on a baking sheet lined with a layer of salt, or directly on the oven\u0026#39;s racks. Bake until completely tender throughout when pierced with a fork, about 45 minutes. Transfer potatoes to a work surface. Using tongs to hold hot potatoes, slice each in half lengthwise.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_20-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_23-0\"\u003e\n\u003cp id=\"mntl-sc-block_24-0\"\u003e Using a spoon, scoop potato flesh into a ricer or food mill fitted with the finest disk. Press potato flesh onto a clean work surface, spreading it into an even layer, and allow steam to escape for a few minutes.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_25-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_28-0\"\u003e\n\u003cp id=\"mntl-sc-block_29-0\"\u003e Drizzle egg yolks all over. Sprinkle with 1 1/2 teaspoons salt.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_30-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_33-0\"\u003e\n\u003cp id=\"mntl-sc-block_34-0\"\u003e Scoop 3/4 cup (100g) flour into a fine-mesh strainer and tap to dust flour all over potatoes.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_35-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_38-0\"\u003e\n\u003cp id=\"mntl-sc-block_39-0\"\u003e Using pastry blender or bench scraper, chop down repeatedly all over to cut flour and egg into potato.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_40-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_43-0\"\u003e\n\u003cp id=\"mntl-sc-block_44-0\"\u003e Using a bench scraper, gather up shaggy potato mass and pat into a loose ball. Press ball flat with hands, then fold in half using bench scraper and press down again.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_45-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_48-0\"\u003e\n\u003cp id=\"mntl-sc-block_49-0\"\u003e Scoop remaining 1/4 cup (30g) flour into sieve and dust all over potato dough. Continue to gently fold and press, just until a uniform dough comes together; make sure to simply fold and press down and avoid the smearing motion more commonly used when kneading bread. Add additional flour as necessary to achieve a dough that\u0026#39;s tender and moist yet can hold its shape, but not wet and sticky (whether you need more flour, and how much you might need, will depend on natural moisture content of the potatoes you use, which is highly variable, but a dough that\u0026#39;s too wet and pasty is prone to falling apart when boiled).\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_50-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_53-0\"\u003e\n\u003cp id=\"mntl-sc-block_54-0\"\u003e Dust potato dough all over with flour and gently form into a log.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_55-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_58-0\"\u003e\n\u003cp id=\"mntl-sc-block_59-0\"\u003e Clean work area well and dust with fresh flour. Using bench scraper, slice off a roughly 2-inch-thick portion of dough and roll into a snake about 1/2 inch thick; use a light touch as you roll, trying to use your palms more than your fingers, and dusting as necessary with flour to prevent sticking.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_60-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_63-0\"\u003e\n\u003cp id=\"mntl-sc-block_64-0\"\u003e Using bench scraper, cut snake into 1-inch portions, trimming off uneven ends as necessary. If desired, gently roll each gnocco on the tines of a fork to give it a ridged exterior. Transfer gnocchi to a well-floured area or baking sheet and repeat with remaining dough. If not cooking recipe start-to-finish, baking sheet of gnocchi can be transferred to the freezer at this point (see make-ahead and storage section for full freezing instructions).\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_65-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_68-0\"\u003e\n\u003cp id=\"mntl-sc-block_69-0\"\u003e \u003cstrong\u003eFor the Sauce and to Serve:\u003c/strong\u003e Bring a large pot of salted water to a simmer over medium-high heat. Meanwhile, in a 3-quart saucier or 12-inch stainless-steel skillet, combine cream, Fontina, butter, a pinch of black pepper, and nutmeg.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_70-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_73-0\"\u003e\n\u003cp id=\"mntl-sc-block_74-0\"\u003e Set over medium heat and cook, whisking constantly, until butter and cheese are fully melted and a smooth, silky sauce has formed, about 4 minutes. Season with salt, but only if necessary. Keep warm, stirring frequently to prevent a skin from forming.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_75-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_78-0\"\u003e\n\u003cp id=\"mntl-sc-block_79-0\"\u003e Working in batches to prevent crowding the pot, add gnocchi to simmering water and cook, gently shaking the pot as needed to keep them from sticking, until they float to the surface. Using a spider skimmer, lift floating gnocchi from the water and let drain, then transfer to cheese sauce. Toss very gently with a large spoon to coat, being careful not to break gnocchi. Repeat with remaining gnocchi and toss gently once more to coat.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_80-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003cli id=\"mntl-sc-block_83-0\"\u003e\n\u003cp id=\"mntl-sc-block_84-0\"\u003e Remove from heat. Divide gnocchi and sauce between warmed serving bowls, top each portion with grated nutmeg, and serve.\n\u003c/p\u003e\n\u003cfigure id=\"mntl-sc-block_85-0\"\u003e \n\u003c/figure\u003e\n\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch2 id=\"mntl-sc-block_89-0\"\u003e \u003cspan\u003e Special Equipment \u003c/span\u003e \u003c/h2\u003e\n\u003cp id=\"mntl-sc-block_90-0\"\u003e \u003ca href=\"https://www.seriouseats.com/should-you-buy-a-food-mill-or-a-ricer-it-depends\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"1\"\u003ePotato ricer\u003c/a\u003e or \u003ca href=\"https://www.seriouseats.com/should-you-buy-a-food-mill-or-a-ricer-it-depends\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"2\"\u003efood mill\u003c/a\u003e; \u003ca href=\"https://www.seriouseats.com/guide-to-essential-baking-tools\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"3\"\u003efine-mesh strainer\u003c/a\u003e; \u003ca href=\"https://www.seriouseats.com/basic-starter-kitchen-equipment\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"4\"\u003ebench scraper\u003c/a\u003e; \u003ca href=\"https://www.seriouseats.com/gift-guide-essential-pots-and-pans-presents-for-home-cooks\" data-component=\"link\" data-source=\"inlineLink\" data-type=\"internalLink\" data-ordinal=\"5\"\u003e3-quart saucier\u003c/a\u003e or 12-inch skillet; spider skimmer\n\u003c/p\u003e\n\n\u003ch2 id=\"mntl-sc-block_92-0\"\u003e \u003cspan\u003e Notes \u003c/span\u003e \u003c/h2\u003e\n\u003cp id=\"mntl-sc-block_93-0\"\u003e We strongly recommend making your own gnocchi, since almost all store-bought products have bad texture and flavor. However, if you have a source for good store-bought gnocchi, you\u0026#39;ll need about 2 pounds (900g).\n\u003c/p\u003e\n\n\u003ch2 id=\"mntl-sc-block_95-0\"\u003e \u003cspan\u003e Make-Ahead and Storage \u003c/span\u003e \u003c/h2\u003e\n\u003cp id=\"mntl-sc-block_96-0\"\u003e The formed, uncooked gnocchi can be frozen on the sheet tray. Once frozen, use a thin metal spatula to free from sheet tray, transfer to a zipper-lock bag, press out excess air, and seal. Return to freezer until ready to use. To cook, add frozen gnocchi directly to gently simmering water.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": null,
  "modifiedTime": null
}
