{
  "id": "f5bce355-af0e-4196-b713-7f389fc83000",
  "title": "Grissini (Italian Breadsticks)",
  "link": "https://www.101cookbooks.com/grissini/",
  "description": "Everything I know about making grissini. These beloved, pencil-thin Italian breadsticks are made with just five ingredients. No mixer is needed and you don’t need to proof your yeast. Continue reading Grissini (Italian Breadsticks) on 101 Cookbooks",
  "author": "Heidi Swanson",
  "published": "Thu, 24 Oct 2024 22:47:54 +0000",
  "source": "https://www.101cookbooks.com/feed",
  "categories": [
    "100+ Vegetarian Recipes",
    "Appetizers",
    "Baking Recipes"
  ],
  "byline": "Heidi Swanson",
  "length": 7841,
  "excerpt": "Everything I know about making grissini. These beloved, pencil-thin Italian breadsticks are made with just five ingredients. No mixer is needed and you don’t need to proof your yeast.",
  "siteName": "101 Cookbooks",
  "favicon": "https://www.101cookbooks.com/wp-content/uploads/2018/05/cropped-101fav-1-192x192.png",
  "text": "101 Cookbooks logo Welcome! I'm Heidi – This site celebrates cooking, and aspires to help you integrate the power of lots of vegetables and whole foods into your everyday meals. The recipes you 'll find here are vegetarian, often vegan, written with the home cook in mind. This site has been my online “home base” for nearly twenty years. It was initially built on the premise that when you own over 100 cookbooks (raises hand!), it is time to stop buying, and start cooking. This site chronicles a cookbook collection, one (vegetarian) recipe at a time. But there’s a bit more to the story now that we’re a couple decades in, here’s some backstory on both me \u0026 the site... I'm Heidi – This site celebrates cooking, and aspires to help you integrate the power of lots of vegetables and whole foods into your everyday meals. The recipes you'll find here are vegetarian, often vegan, written with the home cook in mind. Read more about me \u0026 the site Membership Premium Ad-Free membership includes: Ad-free content Print-friendly recipes Spice / Herb / Flower / Zest recipe collection PDF Weeknight Express recipe collection PDF Surprise bonuses throughout the year Sign up here! My Books Grissini bring charm and drama wherever they appear. The beloved thin and crispy Italian breadsticks are great alongside a cheese board, welcome crumbled over soup, and are forever kid-friendly. At their best, they maintain snap and crunch, radiate imperfect handmade charm, and can (arguably) rival flowers when arranged in \"bouquets\" running the length of a table. They're simple to make, and turning the task into an all-hands group activity makes quick work of the shaping. Grissini: The Inspiration I started baking grissini at home many years ago inspired by a nearby restaurant. We would regularly walk from our house to Pizzeria Delfina in San Francisco’s Mission District. The first thing that would be placed on your table, after being seated, was a tall glass filled with pencil-thin grissini (breadsticks). Next would come a tiny plate with a trio of chile flakes, Parmesan, and dried oregano for topping your pizza. We’d snack on grissini, sip on good wine, and chat while waiting on the main event. I loved having them at the start of a meal. They’re a labor of love to make, and I delight in the way each one is slightly different and reflects the hands (and whims!) of the baker. How To Make Grissini If you can make pizza dough, you can make grissini. I use much of the same technique to make the dough here as I do with my go-to pizza dough recipe. You'll mix the dough by hand, use instant yeast (so there's no need to worry about proofing). After mixing, wait for a bit of a rise, chill, shape and then bake. I’m willing to bet you have most of the ingredients on hand.Above you see the butter melting in warm milk. And below, the dough ready to be refrigerated for a bit. A Few Tips I mention this below, but these are the keys to great grissini. Grissini Variations The recipe below is what I consider a base recipe. You can add any number of herbs, spices, or creative ingredients to it if you like. Vegan Grissini: Follow the recipe as written, opting for water as the liquid and olive oil as the fat. Spicy Mustard Grissini: Katy, owner of Monsieur Marcel in Los Angeles recently turned me on to a beautiful spicy mustard seed oil. I swapped out some of the olive oil in the recipe below and replaced it with this (about half) for a mustard-kissed version. Herbed Grissini: For herbed grissini, use dried herbs. Start with a tablespoon or two of chopped rosemary. You can also use blends like “Italian seasoning” or Herbes de Provence. Sesame Grissini: After arranging breadsticks on the baking sheet, spray with a bit of olive oil and sprinkle generously with sesame seeds. You can leave them as is, or give a bit of a twist. Everything Bagel Grissini: Similar to the sesame version above, but use everything bagel seasoning. Parmesan Grissini: Add 1/2 cup of freshly grated Parmesan to your dry ingredients before mixing. Experiment with other dried cheeses. More Italian Recipes Gnocchi Bruschetta Fregola Sarda Pesto Pici Polenta Homemade Pasta 101 Cookbooks Membership Premium Ad-Free membership includes: -Ad-free content -Print-friendly recipes -Spice / Herb / Flower / Zest recipe collection PDF -Weeknight Express recipe collection PDF -Surprise bonuses throughout the year The key to success here is making thin grissini. If your breadsticks are too thick they won’t crisp up. Also, be sure you don’t under bake. You’re looking for golden toasted tones across each breadstick. Dough pieces that weigh 7 grams (about 3/4-inch square of dough) roll out nicely to foot-long grissini, and this recipe will yield you about 7 dozen breadsticks. You can make them long and more dramatic if you have longer baking sheets. 2 1/2 cups / 310 g bread flour 1/2 cup / 65 g whole wheat flour 1 1/2 teaspoons / 10 g fine grain salt one packet / 7g instant yeast 1/3 cup / 60g extra-virgin olive oil OR 1/4 cup / 60g unsalted butter, cut into small cubes 3/4 cup / 180 ml / 180g milk OR water In a medium bowl whisk together the flours, salt, and instant yeast. Combine the olive oil and water In a small saucepan and heat to lukewarm or 115°F. Stir into the flour mixture and when it comes together, turn out onto a counter and knead for three minutes. Cover and allow to rest for 15 minutes. Knead for another 3 minutes, shape into a ball, rub with a bit of olive oil and return to a bowl. Cover with a piece of plastic wrap, and allow to rest in a warm place for 30 minutes. Move to refrigerator for an hour or until cold. Preheat oven to 350°F and place racks in top and bottom third. Shape the grissini: Start by cutting a few small pieces of dough - 7g each, about 3/4-inch. Cover remaining dough while you’re working so it doesn’t dry out. Roll the small pieces of dough into pencil-thin strips, 1/8-inch thick. If the dough is being stubborn, set that piece of dough aside while you work on others. It will relax after a few minutes. Arrange directly on baking sheets. You don’t ned much space between each piece of dough. Bake: Bake, rotating once, for 13-15 minutes, or until golden and crispy. I like to gently shake the pan a bit when rotating the pans, to get color on tops and bottoms of the grissini. Repeat until all the dough is used up. More Recipes Join my newsletter! Weekly recipes and inspirations. Popular Ingredients",
  "image": "https://images.101cookbooks.com/grissini-recipe-v.jpg?w=620\u0026auto=format",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\u003cnav\u003e\n  \n\n  \u003cp id=\"logo\"\u003e\u003ca href=\"https://www.101cookbooks.com/\" rel=\"home\" title=\"101 Cookbooks\"\u003e\u003csvg viewBox=\"68.5 85.8 383 45.7\" xmlns=\"https://www.w3.org/2000/svg\"\u003e\u003ctitle\u003e101 Cookbooks logo\u003c/title\u003e\u003cpath d=\"M76.4 100.3c0-2.4 0-5.3-.1-8.6l5.2-1.3c-.2 7.9-.3 14.8-.3 20.7 0 4.4 0 9 .3 13.9h-5.4c.2-5.3.3-13.6.3-24.7zM90.1 110.2c0-7 2.4-11.7 8-16.2 2.9-2.4 5.8-3.6 8.9-3.6 3.2 0 6.1 1.1 8.3 2.9 3.7 3.2 5.9 8 5.9 13.5 0 5.3-2.1 10-5.8 13.4-3.8 3.6-7.2 5.7-11.1 5.7-8.2 0-14.2-6.2-14.2-15.7zm24.3 9c1.3-2.3 2.1-5.3 2.1-8.7 0-9.6-5.2-15.6-12.9-15.6-3.4 0-6 1.1-6.7 2.3-1.4 2.1-2.5 5.9-2.5 9.8 0 8.5 5.9 14.6 13.4 14.6 3.3 0 5.8-1.2 6.6-2.4zM130 100.3c0-2.4 0-5.3-.1-8.6l5.2-1.3c-.2 7.9-.3 14.8-.3 20.7 0 4.4 0 9 .3 13.9h-5.4c.2-5.3.3-13.6.3-24.7zM188.7 120.1c-4.8 3.4-7.5 5.9-11.3 5.9-9.4 0-15.3-6.3-15.3-16 0-6.5 2.8-11.9 8.1-15.6 3.5-2.5 6.4-3.9 10-3.9 2.7 0 5.3.8 7.6 2.3l-3.4 4.1c-2.4-1.5-4.8-2.2-7.8-2.2-3.2 0-5.6.8-6.4 1.4-2.4 2-4.1 6-4.1 10.7 0 8.6 5.9 14.7 14.5 14.7 2.8 0 5.2-.8 7.3-2.3l.8.9zM193 110.2c0-7 2.4-11.7 8-16.2 2.9-2.4 5.8-3.6 8.9-3.6 3.2 0 6.1 1.1 8.3 2.9 3.7 3.2 5.9 8 5.9 13.5 0 5.3-2.1 10-5.8 13.4-3.8 3.6-7.2 5.7-11.1 5.7-8.2 0-14.2-6.2-14.2-15.7zm24.3 9c1.3-2.3 2.1-5.3 2.1-8.7 0-9.6-5.2-15.6-12.9-15.6-3.4 0-6 1.1-6.7 2.3-1.4 2.1-2.5 5.9-2.5 9.8 0 8.5 5.9 14.6 13.4 14.6 3.3 0 5.8-1.2 6.6-2.4zM230 110.2c0-7 2.4-11.7 8-16.2 2.9-2.4 5.8-3.6 8.9-3.6 3.2 0 6.1 1.1 8.3 2.9 3.7 3.2 5.9 8 5.9 13.5 0 5.3-2.1 10-5.8 13.4-3.8 3.6-7.2 5.7-11.1 5.7-8.2 0-14.2-6.2-14.2-15.7zm24.3 9c1.3-2.3 2.1-5.3 2.1-8.7 0-9.6-5.2-15.6-12.9-15.6-3.4 0-6 1.1-6.7 2.3-1.4 2.1-2.5 5.9-2.5 9.8 0 8.5 5.9 14.6 13.4 14.6 3.4 0 5.9-1.2 6.6-2.4zM268.8 108.2c0-6 0-11.7-.3-17l5.8-.2c-.2 5.3-.3 11.1-.3 17.3l9-12c1.4-1.9 2.7-3.6 3.6-5l4-.2-12.5 15.9 13.2 16.4-5.1 2.6c-3-4.2-5.1-7.1-6.3-8.6l-5.8-7.2h-.2c0 4.3.1 9.3.3 14.9l-5.8.2c.4-5.4.4-11.1.4-17.1zM298 108.2c0-6-.1-11.7-.3-17 5.3-.1 8.4-.2 9.1-.2 3.7 0 6.2.3 7.8 1.2 2.3 1.4 3.5 3.6 3.5 6 0 3.7-2.3 6.8-6.9 8.9 5 1.2 7.6 4.2 7.6 8.1 0 5.7-5 9.9-13.1 9.9-.6 0-3.3-.2-8-.2.2-5.1.3-10.7.3-16.7zm7.9-1.8c1.1 0 2.3.1 3.6.4 2.4-1.6 3.7-3.8 3.7-6.4 0-4.1-2.8-6.5-7.9-6.5-.8 0-1.6 0-2.4.1v14.8l3-2.4zm2.6 16.9c.4 0 .8 0 1.3-.1 2.4-1.6 3.6-3.9 3.6-6.7 0-4.3-3.6-7.1-10-7.1h-.6v12.8c2.6.7 4.5 1.1 5.7 1.1zM325.1 110.2c0-7 2.4-11.7 8-16.2 2.9-2.4 5.8-3.6 8.9-3.6 3.2 0 6.1 1.1 8.3 2.9 3.7 3.2 5.9 8 5.9 13.5 0 5.3-2.1 10-5.8 13.4-3.8 3.6-7.2 5.7-11.1 5.7-8.2 0-14.2-6.2-14.2-15.7zm24.2 9c1.3-2.3 2.1-5.3 2.1-8.7 0-9.6-5.2-15.6-12.9-15.6-3.4 0-6 1.1-6.7 2.3-1.4 2.1-2.5 5.9-2.5 9.8 0 8.5 5.9 14.6 13.4 14.6 3.4 0 5.9-1.2 6.6-2.4zM362.1 110.2c0-7 2.4-11.7 8-16.2 2.9-2.4 5.8-3.6 8.9-3.6 3.2 0 6.1 1.1 8.3 2.9 3.7 3.2 5.9 8 5.9 13.5 0 5.3-2.1 10-5.8 13.4-3.8 3.6-7.2 5.7-11.1 5.7-8.2 0-14.2-6.2-14.2-15.7zm24.2 9c1.3-2.3 2.1-5.3 2.1-8.7 0-9.6-5.2-15.6-12.9-15.6-3.4 0-6 1.1-6.7 2.3-1.4 2.1-2.5 5.9-2.5 9.8 0 8.5 5.9 14.6 13.4 14.6 3.4 0 5.9-1.2 6.6-2.4zM400.9 108.2c0-6 0-11.7-.3-17l5.8-.2c-.2 5.3-.3 11.1-.3 17.3l9-12c1.4-1.9 2.7-3.6 3.6-5l4-.2-12.5 15.9 13.2 16.4-5.1 2.6c-3-4.2-5.1-7.1-6.3-8.6l-5.8-7.2h-.2c0 4.3.1 9.3.3 14.9l-5.8.2c.3-5.4.4-11.1.4-17.1zM433 118c1.7 2.9 3.6 4.2 6.5 4.2.5 0 1 0 1.4-.1.8-1.3 1.2-2.9 1.2-4.8 0-3.6-1.8-4.8-5.5-6.6-1.8-.8-3.7-1.5-5.4-3.2-1.5-1.5-2.2-3.5-2.2-5.8 0-3.5 1.5-6.5 4.7-9.2 1.5-1.2 3.9-2.2 6.1-2.2 2.5 0 4.8 1.4 6.4 4.2l-4.2 2.9c-1.7-2.4-3.6-3.6-6-3.6-.6 0-1.3.1-2.2.3-.9 1-1.3 2.4-1.3 4.2 0 2.4 1.6 4.7 4.5 6.2 2.5 1.3 4.7 2.1 6 3.2 1.9 1.6 2.9 3.7 2.9 6.2 0 3.6-1.4 6.7-4.2 9.1-2 1.8-4.6 2.8-6.7 2.8-2.8 0-5.2-1.7-6.7-5l4.7-2.8z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/a\u003e\u003c/p\u003e\n  \n  \u003cdiv id=\"navbarcollapse\"\u003e\n\n\n\n   \n\n\n\n\n\n \u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://images.101cookbooks.com/heidi-swanson-kitchen-polly.jpg?w=580\u0026amp;auto=compress\u0026amp;auto=format\" alt=\"Heidi Swanson in the kitchen\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\n    \u003c/p\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003eWelcome!\u003c/h4\u003e\n      \u003cp\u003eI\u0026#39;m Heidi – This site celebrates cooking, and aspires to help you integrate the power of lots of vegetables and\n        whole foods into your everyday meals. The recipes you\t\u0026#39;ll find here are vegetarian, often vegan, written with\n        the home cook in mind. This site has been my online “home base” for nearly twenty years. It was initially built on the premise that when you own over 100 cookbooks (raises hand!), it is time to stop buying, and start cooking. This site chronicles a cookbook collection, one (vegetarian) recipe at a time. But there’s a bit more to the story now that we’re a couple decades in, \u003ca href=\"https://www.101cookbooks.com/about/\"\u003ehere’s some backstory on both me \u0026amp; the site...\u003c/a\u003e\n      \u003c/p\u003e\n      \u003cp\u003eI\u0026#39;m Heidi – This site celebrates cooking, and aspires to help you integrate the power of lots of vegetables and\n        whole foods into your everyday meals. The recipes you\u0026#39;ll find here are vegetarian, often vegan, written with\n        the home cook in mind. \u003cspan\u003e \u003ca href=\"https://www.101cookbooks.com/about/\"\u003eRead more about me \u0026amp; the site\u003c/a\u003e\u003c/span\u003e\n      \u003c/p\u003e\n    \u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n \u003cdiv\u003e\n\n\u003cdiv\u003e\n  \u003ch4\u003eMembership\u003c/h4\u003e\n  \u003cp\u003ePremium Ad-Free membership includes:\u003c/p\u003e\n  \u003cul\u003e\n    \u003cli\u003eAd-free content\u003c/li\u003e\n    \u003cli\u003e Print-friendly recipes\u003c/li\u003e\n    \u003cli\u003e Spice / Herb / Flower / Zest recipe collection PDF\u003c/li\u003e\n    \u003cli\u003e Weeknight Express recipe collection PDF\u003c/li\u003e\n    \u003cli\u003e Surprise bonuses throughout the year\u003c/li\u003e\n  \u003c/ul\u003e\n  \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003eSign up here!\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\n\n\u003cdiv aria-label=\"membership book covers\"\u003e\n\n  \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/spice-herb-flower-cover-lg.png?w=220\u0026amp;auto=format\" alt=\"Spice PDF cover\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/weeknight-express-cover-lg.png?w=220\u0026amp;auto=format\" alt=\"Weeknight Express PDF book cover\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\u003c/div\u003e\n\n\n \u003cdiv\u003e\n   \u003ch4\u003eMy Books\u003c/h4\u003e\n   \n \u003c/div\u003e\n\n\n  \u003c/div\u003e\n  \n  \u003c/nav\u003e\n  \u003csection id=\"primaryrow\"\u003e\n \n    \u003cmain id=\"main\" role=\"main\"\u003e\n\n    \n\u003carticle id=\"post-18447\"\u003e\n\n\t\t\t\t\n\t\n\t\u003cdiv data-swiftype-name=\"body\" data-swiftype-type=\"text\"\u003e\n\u003cp\u003eGrissini bring charm and drama wherever they appear. The beloved thin and crispy Italian breadsticks are great alongside a cheese board, welcome crumbled over \u003ca href=\"https://www.101cookbooks.com/soup-recipes/\"\u003esoup\u003c/a\u003e, and are forever kid-friendly. At their best, they maintain snap and crunch, radiate imperfect handmade charm, and can (arguably) rival flowers when arranged in \u0026#34;bouquets\u0026#34; running the length of a table. They\u0026#39;re simple to make, and turning the task into an all-hands group activity makes quick work of the shaping.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://images.101cookbooks.com/grissini-recipe-v.jpg?w=620\u0026amp;auto=format\" alt=\"Grissini Italian Breadsticks after baking\" width=\"620\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/p\u003e\n\u003ch2\u003eGrissini: The Inspiration\u003c/h2\u003e\n\u003cp\u003eI started baking grissini at home many years ago inspired by a nearby restaurant. We would regularly walk from our house to \u003ca href=\"https://www.pizzeriadelfina.com/\"\u003ePizzeria Delfina\u003c/a\u003e in San Francisco’s Mission District. The first thing that would be placed on your table, after being seated, was a tall glass filled with pencil-thin grissini (breadsticks). Next would come a tiny plate with a trio of chile flakes, Parmesan, and dried oregano for topping your pizza. We’d snack on grissini, sip on good wine, and chat while waiting on the main event. I loved having them at the start of a meal. They’re a labor of love to make, and I delight in the way each one is slightly different and reflects the hands (and whims!) of the baker.\u003cbr/\u003e\u003cspan\u003e\u003cspan\u003e\u003cimg src=\"https://images.101cookbooks.com/grissini-recipe-1.jpg?w=620\u0026amp;auto=format\" alt=\"Grissini Standing up dramatically in a glass set on a table\" width=\"620\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003eHow To Make Grissini\u003c/h2\u003e\n\u003cp\u003eIf you can make pizza dough, you can make grissini. I use much of the same technique to make the dough here as I do with my go-to pizza dough recipe. You\u0026#39;ll mix the dough by hand, use instant yeast (so there\u0026#39;s no need to worry about proofing). After mixing, wait for a bit of a rise, chill, shape and then bake. I’m willing to bet you have most of the ingredients on hand.\u003cbr/\u003e\u003cspan\u003e\u003cspan\u003e\u003cimg src=\"https://images.101cookbooks.com/grissini-recipe-2.jpg?w=620\u0026amp;auto=format\" alt=\"Butter and Milk to make grissini in a small saucepan\" width=\"620\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003cbr/\u003eAbove you see the butter melting in warm milk. And below, the dough ready to be refrigerated for a bit.\u003cbr/\u003e\u003cimg src=\"https://images.101cookbooks.com/grissini-recipe-3.jpg?w=620\u0026amp;auto=format\" alt=\"Grissini dough rising in a bowl\" width=\"620\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003eA Few Tips\u003c/h2\u003e\n\u003cp\u003eI mention this below, but these are the keys to great grissini.\u003c/p\u003e\n\n\u003ch2\u003eGrissini Variations\u003c/h2\u003e\n\u003cp\u003eThe recipe below is what I consider a base recipe. You can add any number of herbs, spices, or creative ingredients to it if you like.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eVegan Grissini\u003c/strong\u003e: Follow the recipe as written, opting for water as the liquid and olive oil as the fat.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eSpicy Mustard Grissini\u003c/strong\u003e: Katy, owner of \u003ca href=\"https://www.mrmarcel.com/\"\u003eMonsieur Marcel\u003c/a\u003e in Los Angeles recently turned me on to a beautiful \u003ca href=\"https://www.mrmarcel.com/products/yandilla-spicy-mustard-seed-oil\"\u003espicy mustard seed oil\u003c/a\u003e. I swapped out some of the olive oil in the recipe below and replaced it with this (about half) for a mustard-kissed version.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eHerbed Grissini\u003c/strong\u003e: For herbed grissini, use dried herbs. Start with a tablespoon or two of chopped rosemary. You can also use blends like “Italian seasoning” or Herbes de Provence.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eSesame Grissini\u003c/strong\u003e: After arranging breadsticks on the baking sheet, spray with a bit of olive oil and sprinkle generously with sesame seeds. You can leave them as is, or give a bit of a twist.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eEverything Bagel Grissini\u003c/strong\u003e: Similar to the sesame version above, but use everything bagel seasoning.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eParmesan Grissini\u003c/strong\u003e: Add 1/2 cup of freshly grated Parmesan to your dry ingredients before mixing. Experiment with other dried cheeses.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cspan\u003e\u003cspan\u003e\u003cimg src=\"https://images.101cookbooks.com/grissini-recipe-6.jpg?w=620\u0026amp;auto=format\" alt=\"Grissini Italian Breadsticks after baking\" width=\"620\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003cbr/\u003eMore Italian Recipes\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cspan\u003e\u003ca href=\"https://www.101cookbooks.com/gnocchi-recipe/\"\u003e\u003cspan\u003eGnocchi\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e\u003ca href=\"https://www.101cookbooks.com/simple-bruschetta/\"\u003e\u003cspan\u003eBruschetta\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e\u003ca href=\"https://www.101cookbooks.com/fregola-sarda/\"\u003e\u003cspan\u003eFregola Sarda\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e\u003ca href=\"https://www.101cookbooks.com/pesto-recipe/\"\u003e\u003cspan\u003ePesto\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e\u003ca href=\"https://www.101cookbooks.com/pici-pasta/\"\u003e\u003cspan\u003ePici\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.101cookbooks.com/creamy-polenta/\"\u003ePolenta\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.101cookbooks.com/homemade-pasta/\"\u003eHomemade Pasta\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n               \n         \u003cdiv\u003e\n           \n        \u003cdiv\u003e\n                  \u003cp\u003e101 Cookbooks Membership\u003c/p\u003e\n        \n                  \u003cdiv\u003e\n                      \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/SPICE-HERB-COVER-100.png\" alt=\"spice herb flower zest\" nopin=\"nopin\" width=\"100\" height=\"141\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e \u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1\"\u003e \u003cimg src=\"https://images.101cookbooks.com/WEEKNIGHT-EXPRESS-V2.100.png\" alt=\"weeknight express\" nopin=\"nopin\" width=\"100\" height=\"141\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\n                          \n                          \u003c/p\u003e\n        \n                      \u003cp\u003ePremium Ad-Free membership includes: \u003cbr/\u003e\n                          -Ad-free content \u003cbr/\u003e\n                          -Print-friendly recipes \u003cbr/\u003e\n                          -\u003ci\u003eSpice / Herb / Flower / Zest \u003c/i\u003e recipe collection PDF\u003cbr/\u003e\n                          -\u003ci\u003eWeeknight Express\u003c/i\u003e recipe collection PDF  \u003cbr/\u003e\n                          -Surprise bonuses throughout the year \u003cbr/\u003e\n                              \u003c/p\u003e\n                  \u003c/div\u003e\n              \u003c/div\u003e\n\n        \u003cdiv\u003e  \n             \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/SPICE-HERB-COVER-100.png\" alt=\"spice herb flower zest\" nopin=\"nopin\" width=\"100\" height=\"141\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\u003c/p\u003e\n             \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/WEEKNIGHT-EXPRESS-V2.100.png\" alt=\"weeknight express\" nopin=\"nopin\" width=\"100\" height=\"141\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\u003c/p\u003e\n        \u003c/div\u003e\n                \u003c/div\u003e\n                \t\u003c/div\u003e\n\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\u003cdiv id=\"recipe\" data-recipe-id=\"18454\" data-servings=\"28\"\u003e\n\t\n\t\n\n\u003cp\u003eThe key to success here is making thin grissini. If your breadsticks are too thick they won’t crisp up. Also, be sure you don’t under bake. You’re looking for golden toasted tones across each breadstick. Dough pieces that weigh 7 grams (about 3/4-inch square of dough) roll out nicely to foot-long grissini, and this recipe will yield you about 7 dozen breadsticks. You can make them long and more dramatic if you have longer baking sheets.\u003c/p\u003e\n\t\t\n\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cul\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e2 1/2\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003ecups\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e/ 310 g bread flour\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e1/2\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003ecup\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e/ 65 g whole wheat flour\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e1 1/2\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003eteaspoons\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e/ 10 g fine grain salt\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003eone packet / 7g instant yeast\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e1/3\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003ecup\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e/ 60g extra-virgin olive oil OR 1/4 cup / 60g unsalted butter, cut into small cubes\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e3/4\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003ecup\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e/ 180 ml / 180g milk OR water\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003c/ul\u003e\n\t\t\u003c/div\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003col\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003eIn a medium bowl whisk together the flours, salt, and instant yeast.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003eCombine the olive oil and water In a small saucepan and heat to lukewarm or 115°F.  Stir into the flour mixture and when it comes together, turn out onto a counter and knead for three minutes. Cover and allow to rest for 15 minutes.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003eKnead for another 3 minutes, shape into a ball, rub with a bit of olive oil and return to a bowl. Cover with a piece of plastic wrap, and allow to rest in a warm place for 30 minutes. Move to refrigerator for an hour or until cold.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003ePreheat oven to 350°F and place racks in top and bottom third.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003c/ol\u003e\n\t\t\u003c/div\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003eShape the grissini:\u003c/p\u003e\n\t\t\t\t\t\t\u003col\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003eStart by cutting a few small pieces of dough - 7g each, about 3/4-inch. Cover remaining dough while you’re working so it doesn’t dry out. Roll the small pieces of dough into pencil-thin strips, 1/8-inch thick. If the dough is being stubborn, set that piece of dough aside while you work on others. It will relax after a few minutes. Arrange directly on baking sheets. You don’t ned much space between each piece of dough.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003c/ol\u003e\n\t\t\u003c/div\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003eBake:\u003c/p\u003e\n\t\t\t\t\t\t\u003col\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003eBake, rotating once, for 13-15 minutes, or until golden and crispy. I like to gently shake the pan a bit when rotating the pans, to get color on tops and bottoms of the grissini. Repeat until all the dough is used up.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003c/ol\u003e\n\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\n\t\t\n\t\t\n\t\n\t\n\u003c/div\u003e\u003c/article\u003e\n\n\n\n\n    \u003ch4\u003eMore Recipes\u003c/h4\u003e   \u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.instagram.com/heidijswanson/\"\u003e\u003cimg src=\"https://images.101cookbooks.com/heidi-ico.jpg?auto=format\" alt=\"101cookbooks social icon\" nopin=\"nopin\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eJoin my newsletter!\u003cbr/\u003e\n      Weekly recipes and inspirations.\u003c/p\u003e\n    \u003c/div\u003e    \u003ch4\u003ePopular Ingredients\u003c/h4\u003e      \n       \n\n\t\n\n    \u003c/main\u003e\n  \u003c/section\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-10-24T22:47:54Z",
  "modifiedTime": "2024-10-24T22:48:11Z"
}
