{
  "id": "15602eab-c67c-41b6-9bfb-09fba22772b2",
  "title": "Co-dev studio Blind Squirrel reveals in-house original IP Cosmorons",
  "link": "https://venturebeat.com/games/co-dev-studio-blind-squirrel-reveals-in-house-original-ip-cosmorons/",
  "description": "Blind Squirrel Gamesm, previously best known for its co-development work, has revealed its new Cosmorons, an original IP.",
  "author": "Rachel Kaser",
  "published": "Thu, 21 Nov 2024 23:08:55 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "GamesBeat",
    "Latest Games \u0026 Reviews",
    "Blind Squirrel Games",
    "Blind Squirrel Studios",
    "Console Games",
    "PC Games"
  ],
  "byline": "Rachel Kaser",
  "length": 2174,
  "excerpt": "Blind Squirrel Gamesm, previously best known for its co-development work, has revealed its new Cosmorons, an original IP.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "November 21, 2024 3:08 PM Image Credit: Blind Squirrel Games Blind Squirrel Games, which is best-known for its co-development and porting work, today announced its new original game: Cosmorons, a survival shooter in a sci-fi setting reminiscent of arcade shooters. The studio has a projected release date of 2025 and plans to launch the game on PC, Xbox Series X, PlayStation 5, Xbox One and Switch. It’s primarily developing Cosmorons at its Auckland, New Zealand office and is currently looking for a publishing partner. According to Blind Squirrel, Cosmorons stars robots called Drudges who attempt to survive on alien planets with tricky gravity. The game supports single-player and multiplayer gameplay, where players try to conquer galaxies planet-by-planet, facing hostile aliens in pursuit of “Ultimate Glory.” Every planet offers different challenges, with gravitational fields complicating aerial and ground combat. The game also features minigames such as time trials. Brad Hendricks, Blind Squirrel CEO, said in a statement, “Beyond our co-development work, Blind Squirrel Games has been exploring how we can create compelling IP that best reflects our expertise and playful spirit. Cosmorons began as a passion project for our team, which over time has become an addictive game, paying homage to the arcade shooters we all know and love. We are currently pursuing the right publishing partner to help us bring this to market—in the meantime, we look forward to providing players an opportunity to experience a fun preview of Cosmorons soon.” The studio has served as a co-developer on multiple major game projects, including Mass Effect Legendary Edition and Bioshock The Collection. Last year, Blind Squirrel rebranded itself to help establish its new identity as a standalone developer, and also released its first original game, Drifters Loot the Galaxy, in early access. GB Daily Stay in the know! Get the latest news in your inbox daily By subscribing, you agree to VentureBeat's Terms of Service. Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2024/11/Titled_hero_art.png?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2024-11-21T23:08:55+00:00\" datetime=\"2024-11-21T23:08:55+00:00\"\u003eNovember 21, 2024 3:08 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"422\" src=\"https://venturebeat.com/wp-content/uploads/2024/11/Titled_hero_art.png?w=750\" alt=\"\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eImage Credit: Blind Squirrel Games\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003ca href=\"https://venturebeat.com/business/how-blind-squirrel-games-is-entertaining-its-game-developers-during-quarantine/\"\u003eBlind Squirrel Games\u003c/a\u003e, which is best-known for its co-development and porting work, today announced its new original game: Cosmorons, a survival shooter in a sci-fi setting reminiscent of arcade shooters. The studio has a projected release date of 2025 and plans to launch the game on PC, Xbox Series X, PlayStation 5, Xbox One and Switch. It’s primarily developing Cosmorons at its Auckland, New Zealand office and is currently looking for a publishing partner.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to Blind Squirrel, Cosmorons stars robots called Drudges who attempt to survive on alien planets with tricky gravity. The game supports single-player and multiplayer gameplay, where players try to conquer galaxies planet-by-planet, facing hostile aliens in pursuit of “Ultimate Glory.” Every planet offers different challenges, with gravitational fields complicating aerial and ground combat. The game also features minigames such as time trials.\u003c/p\u003e\n\n\n\n\u003cp\u003eBrad Hendricks, Blind Squirrel CEO, said in a statement, “Beyond our co-development work, Blind Squirrel Games has been exploring how we can create compelling IP that best reflects our expertise and playful spirit. Cosmorons began as a passion project for our team, which over time has become an addictive game, paying homage to the arcade shooters we all know and love. We are currently pursuing the right publishing partner to help us bring this to market—in the meantime, we look forward to providing players an opportunity to experience a fun preview of Cosmorons soon.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe studio has served as a co-developer on multiple major game projects, including Mass Effect Legendary Edition and Bioshock The Collection. Last year, \u003ca href=\"https://venturebeat.com/games/blind-squirrel-games-rebrands-to-mark-its-growth-in-gaming/\"\u003eBlind Squirrel rebranded itself\u003c/a\u003e to help establish its new identity as a standalone developer, and also released its first original game, Drifters Loot the Galaxy, in early access.\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2663995\"\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eGB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eStay in the know! Get the latest news in your inbox daily\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eBy subscribing, you agree to VentureBeat\u0026#39;s \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003eTerms of Service.\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-21T23:08:55Z",
  "modifiedTime": "2024-11-21T23:09:04Z"
}
