{
  "id": "1e4340b2-ba85-4631-935f-9f55b60886f5",
  "title": "'We Can Do It Better': A Reddit Rival Just Relaunched — With Alexis Ohanian on Its Board",
  "link": "https://www.entrepreneur.com/business-news/reddit-rival-digg-is-making-a-comeback-using-ai-to-moderate/487985",
  "description": "Reddit cofounder Alexis Ohanian says he's \"all in on this chapter\" helping to revive Digg, and more than 175,000 people have signed up for early access.",
  "author": "Sherin Shibu",
  "published": "Wed, 05 Mar 2025 19:27:46 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Sherin Shibu",
  "length": 3765,
  "excerpt": "Digg, the social news site that died out in 2012, is relaunching with the help of Reddit co-founder and former rival Alexis Ohanian. Read more about Digg, here.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "Reddit co-founder Alexis Ohanian, 41, has joined forces with former rival Kevin Rose, 48, to revive Digg, a social and link-sharing website Rose founded in 2004 — it was divided up and sold for parts to Betaworks, LinkedIn, and The Washington Post in 2012. The two intend to infuse the new Digg with AI content moderators, a move not yet implemented by Reddit.The Digg of 2004 allowed users to share links that others could \"digg\" and upvote or \"bury\" and downvote, creating a place for trending news. Users could comment on links too, with the most popular content ending up on the homepage.In its heyday, Digg attracted 40 million monthly unique users, but after a 2010 update removed the \"bury\" button, users revolted and left the site in droves, leading to its demise. Ohanian and Rose announced on Wednesday that they are relaunching Digg as a mobile-first platform, with invites to the new Digg rolling out to users in the coming weeks. The webpage for Digg's reboot shows that over 175,000 people have signed up to get early access to it at the time of writing.Related: You'll Never Achieve Work-Life Balance — and You Shouldn't, Reddit Co-Founder Alexis Ohanian Says According to Bloomberg, Justin Mezzell, a product designer who previously worked at Code School and RevenueCat, will be Digg's new CEO. Ohanian and Rose will serve on the board of directors.The team bought Digg's domain and assets from Money Group for an undisclosed sum, and have received investments from Ohanian-founded venture capital (VC) firm Seven Seven Six, as well as True Ventures, a VC firm where Rose is a partner. They declined to disclose how much they had raised, per Bloomberg.Alexis Ohanian. Photo by Patrick Smith/Athlos/Getty Images for AthlosPlans to revive Digg started when Rose reached out to Ohanian last year with the idea of a new Digg that could use AI to help fight spam and moderate content. According to The New York Times, Rose determined where AI could help Digg by spending thousands of dollars on targeted ads on Reddit, a comparable platform, to ask moderators about their biggest challenges. \"These moderators are pouring their lives into this,\" he told The Times. \"We think we can do it better.\"Rose told The Verge that he envisions Digg using AI for \"everything from an AI agent that converts your entire sub-community into Klingon,\" a fictional language in the Star Trek universe, \"to another one where you don't allow a certain type of profanity and that's automatically auto-moderated.\"Related: Here's Why Reddit Turned Down an Acquisition Offer From Google in Its Early Days, According to Cofounder Alexis OhanianOhanian, who served on Reddit's board until 2020, stated in a press release that AI will take on the background \"grunt work\" of fighting spam and filtering through content on Digg while human moderators focus on \"building real connections.\" \"I'm all in on this chapter,\" Ohanian stated.Digg is a direct competitor to Reddit, a $30 billion company with 101.7 million daily active unique users as of its February earnings report. Reddit has made AI a priority, signing a $60 million deal with Google in February 2024 that allowed the tech giant to train its AI on Reddit content and following up with a similar deal with OpenAI in May 2024.Reddit has a built-in moderation system called AutoModerator that automatically goes through posts to check to see if they violate community policies. Though the platform introduced an AI-powered safety feature in March 2024 to detect online harassment, it does not yet have AI agents working as moderators and has not stated if it is working on implementing them, per Business Insider.Related: 'Faster, Smarter, and More Relevant': Reddit Tests AI That Combs the Site For You",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1741199627-Alexis-Ohanian-GettyImages-2174727984.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003eReddit co-founder Alexis Ohanian, 41, has joined forces with former rival Kevin Rose, 48, to revive Digg, a social and link-sharing website Rose founded in 2004 — it was divided up and \u003ca href=\"https://techcrunch.com/2012/07/12/digg-sold-to-linkedin-and-the-washington-post-and-betaworks/\" rel=\"follow\" target=\"_self\"\u003esold for parts\u003c/a\u003e to Betaworks, LinkedIn, and The Washington Post in 2012. The two intend to infuse the new Digg with AI content moderators, a move not yet implemented by Reddit.\u003c/p\u003e\u003cp\u003eThe Digg of 2004 allowed users to share links that others could \u0026#34;digg\u0026#34; and upvote or \u0026#34;bury\u0026#34; and downvote, creating a place for trending news. Users could comment on links too, with the most popular content ending up on the homepage.\u003c/p\u003e\u003cp\u003eIn its heyday, Digg attracted 40 million monthly unique users, but after a 2010 update removed the \u0026#34;bury\u0026#34; button, users \u003ca href=\"https://www.theguardian.com/technology/pda/2010/aug/31/digg-redesign-revolt\" rel=\"follow\" target=\"_self\"\u003erevolted\u003c/a\u003e and left the site in droves, leading to its demise.\u003c/p\u003e\n  \n  \n  \n\n  \u003cp\u003eOhanian and Rose \u003ca href=\"https://x.com/digg/status/1897240679501209704\" rel=\"follow\" target=\"_self\"\u003eannounced\u003c/a\u003e on Wednesday that they are relaunching Digg as a mobile-first platform, with invites to the new Digg rolling out to users in the coming weeks. The webpage for \u003ca href=\"https://reboot.digg.com/\" rel=\"follow\" target=\"_self\"\u003eDigg\u0026#39;s reboot\u003c/a\u003e shows that over 175,000 people have signed up to get early access to it at the time of writing.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated:\u003c/b\u003e \u003ca href=\"https://www.entrepreneur.com/living/reddit-co-founder-alexis-ohanian-challenges-work-life/455583\" rel=\"follow\" target=\"_self\"\u003eYou\u0026#39;ll Never Achieve Work-Life Balance — and You Shouldn\u0026#39;t, Reddit Co-Founder Alexis Ohanian Says\u003c/a\u003e\u003c/p\u003e\n\n  \u003cp\u003eAccording to \u003ca href=\"https://www.bloomberg.com/news/articles/2025-03-05/reddit-digg-co-founders-are-teaming-up-to-revive-digg-using-ai\" rel=\"follow\" target=\"_self\"\u003e\u003ci\u003eBloomberg\u003c/i\u003e\u003c/a\u003e, Justin Mezzell, a product designer who previously worked at Code School and RevenueCat, will be Digg\u0026#39;s new CEO. Ohanian and Rose will serve on the board of directors.\u003c/p\u003e\u003cp\u003eThe team bought Digg\u0026#39;s domain and assets from Money Group for an undisclosed sum, and have received investments from Ohanian-founded venture capital (VC) firm Seven Seven Six, as well as True Ventures, a VC firm where \u003ca href=\"https://trueventures.com/team/kevin-rose/\" rel=\"follow\" target=\"_self\"\u003eRose is a partner\u003c/a\u003e. They declined to disclose how much they had raised, per \u003ci\u003eBloomberg\u003c/i\u003e.\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" role=\"presentation\" src=\"https://assets.entrepreneur.com/images/misc/1741199587_Alexis-Ohanian-GettyImages-2174727984.jpg?width=1000\" width=\"1000\" height=\"659\"/\u003e\u003ci\u003e\u003csup\u003eAlexis Ohanian. Photo by Patrick Smith/Athlos/Getty Images for Athlos\u003c/sup\u003e\u003c/i\u003e\u003c/p\u003e\u003cp\u003ePlans to revive Digg started when Rose reached out to Ohanian last year with the idea of a new Digg that could use AI to help fight spam and moderate content. According to \u003ca href=\"https://www.nytimes.com/2025/03/05/technology/digg-alexis-ohanian-kevin-rose.html\" rel=\"follow\" target=\"_self\"\u003e\u003ci\u003eThe New York Times\u003c/i\u003e\u003c/a\u003e, Rose determined where AI could help Digg by spending thousands of dollars on targeted ads on Reddit, a comparable platform, to ask moderators about their biggest challenges.\u003c/p\u003e\n\n  \u003cp\u003e\u0026#34;These moderators are pouring their lives into this,\u0026#34; he told \u003ci\u003eThe Times\u003c/i\u003e. \u0026#34;We think we can do it better.\u0026#34;\u003c/p\u003e\u003cp\u003eRose told \u003ca href=\"https://www.theverge.com/social/624073/digg-relaunch-2025\" rel=\"follow\" target=\"_self\"\u003e\u003ci\u003eThe Verge\u003c/i\u003e\u003c/a\u003e that he envisions Digg using AI for \u0026#34;everything from an AI agent that converts your entire sub-community into Klingon,\u0026#34; a fictional language in the Star Trek universe, \u0026#34;to another one where you don\u0026#39;t allow a certain type of profanity and that\u0026#39;s automatically auto-moderated.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated:\u003c/b\u003e \u003ca href=\"https://www.entrepreneur.com/business-news/alexis-ohanian-reddit-turned-down-googles-offer-to-buy-it/473399\" rel=\"follow\" target=\"_self\"\u003eHere\u0026#39;s Why Reddit Turned Down an Acquisition Offer From Google in Its Early Days, According to Cofounder Alexis Ohanian\u003c/a\u003e\u003c/p\u003e\u003cp\u003eOhanian, who served on Reddit\u0026#39;s board \u003ca href=\"https://simonsinek.com/podcast/episodes/alexis-ohanian-why-i-left-reddit-and-why-greed-can-inspire-good/\" rel=\"follow\" target=\"_self\"\u003euntil 2020\u003c/a\u003e, stated \u003ca href=\"http://www.prnewswire.com/news-releases/alexis-ohanian--kevin-rose-buy-back-social-platform-digg-302392419.html\" rel=\"follow\" target=\"_self\"\u003ein a press release\u003c/a\u003e that AI will take on the background \u0026#34;grunt work\u0026#34; of fighting spam and filtering through content on Digg while human moderators focus on \u0026#34;building real connections.\u0026#34;\u003c/p\u003e\n\n  \u003cp\u003e\u0026#34;I\u0026#39;m all in on this chapter,\u0026#34; Ohanian stated.\u003c/p\u003e\u003cp\u003eDigg is a direct competitor to Reddit, a \u003ca href=\"https://finance.yahoo.com/quote/RDDT/\" rel=\"follow\" target=\"_self\"\u003e$30 billion\u003c/a\u003e company with \u003ca href=\"https://investor.redditinc.com/news-events/news-releases/news-details/2025/Reddit-Announces-Fourth-Quarter-and-Full-Year-2024-Results/\" rel=\"follow\" target=\"_self\"\u003e101.7 million\u003c/a\u003e daily active unique users as of its February earnings report. Reddit has made AI a priority, signing a \u003ca href=\"https://www.cbsnews.com/news/google-reddit-60-million-deal-ai-training/\" rel=\"follow\" target=\"_self\"\u003e$60 million\u003c/a\u003e deal with Google in February 2024 that allowed the tech giant to train its AI on Reddit content and following up with a similar \u003ca href=\"https://www.reuters.com/markets/deals/openai-strikes-deal-bring-reddit-content-chatgpt-2024-05-16/\" rel=\"follow\" target=\"_self\"\u003edeal with OpenAI\u003c/a\u003e in May 2024.\u003c/p\u003e\u003cp\u003eReddit has a built-in moderation system called \u003ca href=\"https://www.reddit.com/r/reddit.com/wiki/automoderator/\" rel=\"follow\" target=\"_self\"\u003eAutoModerator\u003c/a\u003e that automatically goes through posts to check to see if they violate community policies. Though the platform introduced an \u003ca href=\"https://mashable.com/article/reddit-ai-harassment-filter\" rel=\"follow\" target=\"_self\"\u003eAI-powered safety feature\u003c/a\u003e in March 2024 to detect online harassment, it does not yet have AI agents working as moderators and has not stated if it is working on implementing them, per \u003ca href=\"https://www.businessinsider.com/reddit-cofounder-alexis-ohanian-ai-moderate-social-media-meta-x-2025-3\" rel=\"follow\" target=\"_self\"\u003e\u003ci\u003eBusiness Insider\u003c/i\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/business-news/reddit-becomes-more-like-google-chatgpt-with-reddit-answers/484042\" rel=\"follow\" target=\"_self\"\u003e\u0026#39;Faster, Smarter, and More Relevant\u0026#39;: Reddit Tests AI That Combs the Site For You\u003c/a\u003e\n  \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-05T19:27:46Z",
  "modifiedTime": "2025-03-05T19:27:46Z"
}
