{
  "id": "222d1b49-6fc1-4dbe-acaa-25c73654c9b8",
  "title": "Tariffs and SBA Rule Changes Slow Small Business Sales in Q2",
  "link": "https://smallbiztrends.com/tariffs-and-sba-rule-changes-slow-small-business-sales-in-q2/",
  "description": "Small business sales slowed in Q2 2025 as new SBA lending rules and tariffs raised buyer caution, reduced deal values, and increased complexity in closing transactions.",
  "author": "Leland McFarland",
  "published": "Thu, 24 Jul 2025 23:00:21 +0000",
  "source": "https://feeds2.feedburner.com/SmallBusinessTrends",
  "categories": [
    "Small Business News"
  ],
  "byline": "Leland McFarland",
  "length": 7776,
  "excerpt": "Small business sales slowed in Q2 2025 as new SBA lending rules and tariffs raised buyer caution, reduced deal values, and increased complexity in closing transactions.",
  "siteName": "Small Business Trends",
  "favicon": "",
  "text": "Small business owners looking to buy or sell in 2025 are navigating a shifting landscape marked by increased uncertainty, tighter lending rules, and changing buyer behavior. According to the latest Q2 2025 Insight Report from BizBuySell, business-for-sale transactions dipped 4% year-over-year, with total deal value and median sale prices falling as buyers reassess risk in the face of tariffs and changes to Small Business Administration (SBA) loan requirements. The market saw 2,342 businesses change hands in the second quarter, down slightly from Q1 and more significantly from a multi-year high in Q2 2024. This drop follows strong early-year momentum that faded after the Trump administration announced sweeping new tariffs. These trade policies, targeting imported goods, have injected fresh uncertainty into acquisition decisions—especially for businesses reliant on global supply chains. “The uncertainty around how tariffs will impact businesses that rely on imported products and how that affects the financial performance is causing buyers to hesitate,” said Dustin Zeher of Horizon Business Brokers, LLC. Sellers and operators are already feeling the squeeze. Nearly half (46%) report higher input costs due to tariffs, and 55% say inflation remains elevated. To manage rising costs, two-thirds of business owners have raised their prices—but customer reactions vary, as consumers grow more cautious with spending. “Some customers understand market pressures. Others struggle with the higher prices compared to what they paid in the past,” explained Drew Vennemeyer, owner of Dwell Construction in Ohio. This pressure is filtering into the deal market. The median sale price dropped 6% year-over-year to $352,000, while median cash flow declined 2.6%. At the same time, buyers are gravitating toward smaller, less risky deals, contributing to a 4% year-over-year decrease in total enterprise value. The buying environment has shifted as well, driven in part by regulatory changes to SBA loan programs. Effective June 1, SBA rules now restrict seller notes to covering only 50% of the buyer’s equity injection—typically 10% of a project’s cost—and place them on full standby. That means sellers cannot receive any repayment until the SBA loan is fully paid, often over a decade. These notes essentially become interest-free, unsecured loans. “SBA lending has become a real challenge with new federal regulations regarding seller notes to be on full standby,” said Mark Kincannon of Resolution Equity Partners. Further complicating matters, any seller retaining equity must personally guarantee the full SBA loan for two years. Additionally, all partial ownership transfers must be structured as stock sales, not asset sales—adding potential tax and legal hurdles for sellers. As a result, buyer and seller expectations are diverging. Only 23% of owners are open to offering seller financing, while 62% of buyers expect it as part of the deal. This disconnect, along with regulatory headwinds, is slowing down deal closures. Business brokers report a 12-day increase in average time on market, and 41% say new SBA rules are directly causing delays. Yet there are workarounds. Experts recommend structuring seller notes as supplemental to the buyer’s equity contribution rather than as part of it. This allows repayment to proceed and demonstrates seller confidence. Buyers are also advised to secure prequalification and show financial readiness from the outset. “There is tremendous demand for good businesses… Don’t let the first words out of your mouth to the business broker be ‘will the seller finance the purchase,’ because the answer is ‘no,’” said Jeff Miller of Transworld Business Advisors of Southern Ohio. “Get your financing in order… include proof that you have cash on hand to close, and a letter from an SBA lender.” Despite the headwinds, buyer interest remains strong—especially for recession-resistant sectors. Seventy-three percent of buyers are targeting stable, essential businesses, particularly in services. These include home services, healthcare, logistics, and delivery operations. “Buyers are competing for the best businesses, and they sell pretty quickly for premium prices now,” said Lee Sheaffer, CBI of BizReady, Inc. “However, there are still plenty of mediocre businesses priced unrealistically that buyers will take a pass on.” The buyer pool itself is evolving. As job security weakens, more professionals are leaving corporate roles in search of entrepreneurial independence. These “corporate refugees” now make up 45% of the buyer base—up from 36% last year—while the share of unemployed buyers also ticked up. “In the lower middle market, I have come across more corporate professionals who are becoming serious about buying a business,” said John Pastoor of Calder Capital. “Many have put in 20-30 years and see a business acquisition as a great way to make a career change… and an adventure their current career can’t provide.” Sector performance reflects this shift. Retail saw a 2% year-over-year uptick in transactions, with a 13% increase in median sale price and 14% boost in median cash flow. Buyers are paying a premium for businesses that proved resilient through the pandemic—like grocery stores and pharmacies. The service sector also performed well. Transactions rose 7% year-over-year, though sale prices dipped slightly. Businesses in auto repair, health, and logistics remain in high demand. “Buyer demand remains strong, especially for profitable, recession-resilient businesses,” said Matt Baas of Calder Capital. “However, inventory remains low.” Meanwhile, sectors exposed to tariffs are feeling the impact. Manufacturing transactions fell 28% year-over-year, with sharp declines in revenue and cash flow. Tariff-sensitive goods, unpredictable supply costs, and trade tension are making these businesses harder to value and finance. “Tariffs are quietly but significantly influencing the business-for-sale market,” said Vipin Singh of Murphy Business Sales – Edison Office. “The effect of tariffs depends greatly on the industry.” Restaurants also struggled. While sale prices rose 3% year-over-year, profitability declined as food costs and inflation outpaced revenue growth. Dining out remains popular, but margins continue to shrink. Looking ahead, the market is expected to grow moderately, though unevenly. Businesses with strong financials and stable demand will likely continue to draw interest. While 70% of buyers say tariffs won’t delay their timeline, tighter SBA lending standards may limit who qualifies—potentially lengthening sales cycles. Small business owners considering a sale should work to improve operations, tighten financials, and develop realistic expectations. Buyers, in turn, should show up prepared—with capital, financing lined up, and a strong case for why they are the right fit. “Buyers need to assess and present themselves competitively,” said Sheaffer. “Their industry knowledge, preparation, experience, aptitudes, financial strength, and focus are key.” As Buddy Carp of Squizzero, Carp \u0026 Associates puts it: “Have your lenders lined up and be ready to go… Provide as much information as you can about your qualifications and your financial ability to consummate the sale.” Sellers also need to be ready to negotiate. That may mean accepting a fair valuation and offering seller financing to attract serious buyers. As Pat Adams of Acquisition Finders noted, “Understand that the market value of your business is almost never going to feel equal to all the blood, sweat, and tears you’ve poured into it.” For a detailed breakdown of the Q2 2025 data and more insights, visit the original BizBuySell report: https://www.bizbuysell.com/insight-report/",
  "image": "https://media.smallbiztrends.com/2025/07/Closed-Small-Business-Transactions-Q2-2025.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\u003cp data-start=\"0\" data-end=\"464\"\u003eSmall business owners looking to buy or sell in 2025 are navigating a shifting landscape marked by increased uncertainty, tighter lending rules, and changing buyer behavior. According to the latest Q2 2025 \u003ca href=\"https://www.bizbuysell.com/insight-report/\" target=\"_blank\" rel=\"noopener\"\u003eInsight Report from BizBuySell\u003c/a\u003e, business-for-sale transactions dipped 4% year-over-year, with total deal value and median sale prices falling as buyers reassess risk in the face of tariffs and changes to Small Business Administration (SBA) loan requirements.\u003c/p\u003e\n\u003cp data-start=\"466\" data-end=\"898\"\u003e\u003cimg srcset=\"https://media.smallbiztrends.com/2025/07/Closed-Small-Business-Transactions-Q2-2025-150x84.jpg 150w, https://media.smallbiztrends.com/2025/07/Closed-Small-Business-Transactions-Q2-2025-300x169.jpg 300w, https://media.smallbiztrends.com/2025/07/Closed-Small-Business-Transactions-Q2-2025-620x349.jpg 620w, https://media.smallbiztrends.com/2025/07/Closed-Small-Business-Transactions-Q2-2025-660x371.jpg 660w, https://media.smallbiztrends.com/2025/07/Closed-Small-Business-Transactions-Q2-2025-768x432.jpg 768w, https://media.smallbiztrends.com/2025/07/Closed-Small-Business-Transactions-Q2-2025-850x478.jpg 850w, https://media.smallbiztrends.com/2025/07/Closed-Small-Business-Transactions-Q2-2025-1024x576.jpg 1024w, https://media.smallbiztrends.com/2025/07/Closed-Small-Business-Transactions-Q2-2025.jpg 1280w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" fetchpriority=\"high\" decoding=\"async\" width=\"1280\" height=\"720\" src=\"https://media.smallbiztrends.com/2025/07/Closed-Small-Business-Transactions-Q2-2025.jpg\" alt=\"\"/\u003e\u003c/p\u003e\n\u003cp data-start=\"466\" data-end=\"898\"\u003eThe market saw 2,342 businesses change hands in the second quarter, down slightly from Q1 and more significantly from a multi-year high in Q2 2024. This drop follows strong early-year momentum that faded after the Trump administration announced sweeping new tariffs. These trade policies, targeting imported goods, have injected fresh uncertainty into acquisition decisions—especially for businesses reliant on global supply chains.\u003c/p\u003e\n\n\n\n\u003cp data-start=\"900\" data-end=\"1120\"\u003e“The uncertainty around how tariffs will impact businesses that rely on imported products and how that affects the financial performance is causing buyers to hesitate,” said Dustin Zeher of Horizon Business Brokers, LLC.\u003c/p\u003e\n\u003cp data-start=\"1122\" data-end=\"1431\"\u003eSellers and operators are already feeling the squeeze. Nearly half (46%) report higher input costs due to tariffs, and 55% say inflation remains elevated. To manage rising costs, two-thirds of business owners have raised their prices—but customer reactions vary, as consumers grow more cautious with spending.\u003c/p\u003e\n\u003cp data-start=\"1433\" data-end=\"1621\"\u003e“Some customers understand market pressures. Others struggle with the higher prices compared to what they paid in the past,” explained Drew Vennemeyer, owner of Dwell Construction in Ohio.\u003c/p\u003e\n\u003cp data-start=\"1623\" data-end=\"1917\"\u003e\u003cimg srcset=\"https://media.smallbiztrends.com/2025/07/Median-Sale-Price-vs-Asking-Price-Q2-2025-150x84.jpg 150w, https://media.smallbiztrends.com/2025/07/Median-Sale-Price-vs-Asking-Price-Q2-2025-300x169.jpg 300w, https://media.smallbiztrends.com/2025/07/Median-Sale-Price-vs-Asking-Price-Q2-2025-620x349.jpg 620w, https://media.smallbiztrends.com/2025/07/Median-Sale-Price-vs-Asking-Price-Q2-2025-660x371.jpg 660w, https://media.smallbiztrends.com/2025/07/Median-Sale-Price-vs-Asking-Price-Q2-2025-768x432.jpg 768w, https://media.smallbiztrends.com/2025/07/Median-Sale-Price-vs-Asking-Price-Q2-2025-850x478.jpg 850w, https://media.smallbiztrends.com/2025/07/Median-Sale-Price-vs-Asking-Price-Q2-2025-1024x576.jpg 1024w, https://media.smallbiztrends.com/2025/07/Median-Sale-Price-vs-Asking-Price-Q2-2025.jpg 1280w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" decoding=\"async\" width=\"1280\" height=\"720\" src=\"https://media.smallbiztrends.com/2025/07/Median-Sale-Price-vs-Asking-Price-Q2-2025.jpg\" alt=\"\"/\u003e\u003c/p\u003e\n\u003cp data-start=\"1623\" data-end=\"1917\"\u003eThis pressure is filtering into the deal market. The median sale price dropped 6% year-over-year to $352,000, while median cash flow declined 2.6%. At the same time, buyers are gravitating toward smaller, less risky deals, contributing to a 4% year-over-year decrease in total enterprise value.\u003c/p\u003e\n\u003cp data-start=\"1919\" data-end=\"2360\"\u003eThe buying environment has shifted as well, driven in part by regulatory changes to SBA loan programs. Effective June 1, SBA rules now restrict seller notes to covering only 50% of the buyer’s equity injection—typically 10% of a project’s cost—and place them on full standby. That means sellers cannot receive any repayment until the SBA loan is fully paid, often over a decade. These notes essentially become interest-free, unsecured loans.\u003c/p\u003e\n\u003cp data-start=\"2362\" data-end=\"2529\"\u003e“SBA lending has become a real challenge with new federal regulations regarding seller notes to be on full standby,” said Mark Kincannon of Resolution Equity Partners.\u003c/p\u003e\n\u003cp data-start=\"2531\" data-end=\"2796\"\u003eFurther complicating matters, any seller retaining equity must personally guarantee the full SBA loan for two years. Additionally, all partial ownership transfers must be structured as stock sales, not asset sales—adding potential tax and legal hurdles for sellers.\u003c/p\u003e\n\u003cp data-start=\"2798\" data-end=\"3169\"\u003eAs a result, buyer and seller expectations are diverging. Only 23% of owners are open to offering seller financing, while 62% of buyers expect it as part of the deal. This disconnect, along with regulatory headwinds, is slowing down deal closures. Business brokers report a 12-day increase in average time on market, and 41% say new SBA rules are directly causing delays.\u003c/p\u003e\n\u003cp data-start=\"3171\" data-end=\"3484\"\u003eYet there are workarounds. Experts recommend structuring seller notes as supplemental to the buyer’s equity contribution rather than as part of it. This allows repayment to proceed and demonstrates seller confidence. Buyers are also advised to secure prequalification and show financial readiness from the outset.\u003c/p\u003e\n\n\n\n\u003cp data-start=\"3486\" data-end=\"3859\"\u003e“There is tremendous demand for good businesses… Don’t let the first words out of your mouth to the business broker be ‘will the seller finance the purchase,’ because the answer is ‘no,’” said Jeff Miller of Transworld Business Advisors of Southern Ohio. “Get your financing in order… include proof that you have cash on hand to close, and a letter from an SBA lender.”\u003c/p\u003e\n\u003cp data-start=\"3861\" data-end=\"4136\"\u003eDespite the headwinds, buyer interest remains strong—especially for recession-resistant sectors. Seventy-three percent of buyers are targeting stable, essential businesses, particularly in services. These include home services, healthcare, logistics, and delivery operations.\u003c/p\u003e\n\u003cp data-start=\"4138\" data-end=\"4392\"\u003e“Buyers are competing for the best businesses, and they sell pretty quickly for premium prices now,” said Lee Sheaffer, CBI of BizReady, Inc. “However, there are still plenty of mediocre businesses priced unrealistically that buyers will take a pass on.”\u003c/p\u003e\n\u003cp data-start=\"4394\" data-end=\"4679\"\u003eThe buyer pool itself is evolving. As job security weakens, more professionals are leaving corporate roles in search of entrepreneurial independence. These “corporate refugees” now make up 45% of the buyer base—up from 36% last year—while the share of unemployed buyers also ticked up.\u003c/p\u003e\n\u003cp data-start=\"4681\" data-end=\"5002\"\u003e“In the lower middle market, I have come across more corporate professionals who are becoming serious about buying a business,” said John Pastoor of Calder Capital. “Many have put in 20-30 years and see a business acquisition as a great way to make a career change… and an adventure their current career can’t provide.”\u003c/p\u003e\n\n\n\n\u003cp data-start=\"5004\" data-end=\"5296\"\u003eSector performance reflects this shift. Retail saw a 2% year-over-year uptick in transactions, with a 13% increase in median sale price and 14% boost in median cash flow. Buyers are paying a premium for businesses that proved resilient through the pandemic—like grocery stores and pharmacies.\u003c/p\u003e\n\u003cp data-start=\"5298\" data-end=\"5482\"\u003eThe service sector also performed well. Transactions rose 7% year-over-year, though sale prices dipped slightly. Businesses in auto repair, health, and logistics remain in high demand.\u003c/p\u003e\n\u003cp data-start=\"5484\" data-end=\"5641\"\u003e“Buyer demand remains strong, especially for profitable, recession-resilient businesses,” said Matt Baas of Calder Capital. “However, inventory remains low.”\u003c/p\u003e\n\u003cp data-start=\"5643\" data-end=\"5929\"\u003eMeanwhile, sectors exposed to tariffs are feeling the impact. Manufacturing transactions fell 28% year-over-year, with sharp declines in revenue and cash flow. Tariff-sensitive goods, unpredictable supply costs, and trade tension are making these businesses harder to value and finance.\u003c/p\u003e\n\u003cp data-start=\"5931\" data-end=\"6128\"\u003e“Tariffs are quietly but significantly influencing the business-for-sale market,” said Vipin Singh of Murphy Business Sales – Edison Office. “The effect of tariffs depends greatly on the industry.”\u003c/p\u003e\n\n\n\n\u003cp data-start=\"6130\" data-end=\"6335\"\u003eRestaurants also struggled. While sale prices rose 3% year-over-year, profitability declined as food costs and inflation outpaced revenue growth. Dining out remains popular, but margins continue to shrink.\u003c/p\u003e\n\u003cp data-start=\"6337\" data-end=\"6654\"\u003eLooking ahead, the market is expected to grow moderately, though unevenly. Businesses with strong financials and stable demand will likely continue to draw interest. While 70% of buyers say tariffs won’t delay their timeline, tighter SBA lending standards may limit who qualifies—potentially lengthening sales cycles.\u003c/p\u003e\n\u003cp data-start=\"6656\" data-end=\"6912\"\u003eSmall business owners considering a sale should work to improve operations, tighten financials, and develop realistic expectations. Buyers, in turn, should show up prepared—with capital, financing lined up, and a strong case for why they are the right fit.\u003c/p\u003e\n\u003cp data-start=\"6914\" data-end=\"7093\"\u003e“Buyers need to assess and present themselves competitively,” said Sheaffer. “Their industry knowledge, preparation, experience, aptitudes, financial strength, and focus are key.”\u003c/p\u003e\n\u003cp data-start=\"7095\" data-end=\"7316\"\u003eAs Buddy Carp of Squizzero, Carp \u0026amp; Associates puts it: “Have your lenders lined up and be ready to go… Provide as much information as you can about your qualifications and your financial ability to consummate the sale.”\u003c/p\u003e\n\n\n\n\u003cp data-start=\"7318\" data-end=\"7648\"\u003eSellers also need to be ready to negotiate. That may mean accepting a fair valuation and offering seller financing to attract serious buyers. As Pat Adams of Acquisition Finders noted, “Understand that the market value of your business is almost never going to feel equal to all the blood, sweat, and tears you’ve poured into it.”\u003c/p\u003e\n\u003cp data-start=\"7650\" data-end=\"7840\" data-is-last-node=\"\" data-is-only-node=\"\"\u003eFor a detailed breakdown of the Q2 2025 data and more insights, visit the original BizBuySell report: \u003ca href=\"https://www.bizbuysell.com/insight-report/\" target=\"_new\" rel=\"noopener\" data-start=\"7752\" data-end=\"7840\" data-is-last-node=\"\"\u003ehttps://www.bizbuysell.com/insight-report/\u003c/a\u003e\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\u003c/p\u003e\u003chr/\u003e\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-07-24T23:00:21Z",
  "modifiedTime": "2025-07-24T22:56:43Z"
}
