{
  "id": "2431cb41-19ec-4dc8-b4a8-20438344ee42",
  "title": "How to Flip the Script, Beat China and Russia – And Fix the Broken Department of Defense",
  "link": "https://steveblank.com/2024/12/03/how-to-flip-the-script-and-beat-china-and-russia-and-fix-the-broken-department-of-defense/",
  "description": "A version of this post previously appeared in War on the Rocks. This version has been updated with suggestions from leaders across the Department of Defense and Venture Capital community. BLUF: In WW II, the U.S. outsourced advanced weapons systems development to civilians. The weapons they developed won the war. It’s time to do that […]",
  "author": "steve blank",
  "published": "Tue, 03 Dec 2024 14:00:55 +0000",
  "source": "https://steveblank.com/feed/",
  "categories": [
    "National Security"
  ],
  "byline": "",
  "length": 11269,
  "excerpt": "A version of this post previously appeared in War on the Rocks. This version has been updated with suggestions from leaders across the Department of Defense and Venture Capital community. BLUF: In …",
  "siteName": "Steve Blank",
  "favicon": "https://s0.wp.com/i/webclip.png",
  "text": "A version of this post previously appeared in War on the Rocks. This version has been updated with suggestions from leaders across the Department of Defense and Venture Capital community. BLUF: In WW II, the U.S. outsourced advanced weapons systems development to civilians. The weapons they developed won the war. It’s time to do that again. This new administration can make it happen. “The coming war is going to be a technology war. The country’s top innovators feel that there is a huge disconnect between what the U.S. military ecosystem can produce and what’s possible if we engaged civilians to develop weapon systems for critical technologies. The U.S. military has little idea of what civilians could provide in the event of war, and civilians are wholly in the dark as to what the military needs. As a result, we believe the U.S. is woefully unprepared and ill-equipped for a war driven by advanced technology. The only solution is to outsource advanced weapons systems development outside of the traditional services and government ecosystem and hand the development to civilians.” Vannevar Bush to President Roosevelt in 1940 Insane? President Roosevelt agreed, making a series of decisions that, without which, the Allies may have lost World War II. The U.S. outsourced advanced weapons systems development and acquisition in 1941. Within three years this gave the U.S a stream of advanced weapons – radar, electronic warfare, proximity fuses, rockets, anti-submarine warfare, and nuclear weapons – all instrumental in our victory in World War II. We need to do it again. The incoming Trump administration has a historic, once-in-a-century opportunity to do something similar today and give the United States a stream of advanced capabilities and weapons that will allow the United States to deter Russia and China or — failing that — defeat them in a war. Here’s how. Why Radical Change is Needed Now It’s abundantly clear that the U.S. defense ecosystem is being challenged by the proliferation of commercial technology, hobbled by its legacy systems and prime contractors, and sabotaged by its own Acquisition system, rendering it unable to keep pace with threats to the nation. Simultaneously, the rise of defense-oriented startups and venture capital firms have proven that a commercial ecosystem is more than capable of rapid delivery of most of the advanced weapons needed to deter or win a war. Companies like SpaceX, Anduril, Palantir, Saronic, Vannevar Labs, et al have proven they can deliver at speeds unmatched by existing contractors. Defense and dual-use venture capital firms like Shield Capital, General Catalyst, a16z, DCVC, 8VC, et al, have stepped up to fund this ecosystem, collectively investing tens of billions in new defense technologies. But the Department of Defense is organized for a world it wishes it still had but no longer exists. Unfortunately our adversaries no longer allow us that freedom. While there have been innovative DoD experiments in innovation (Defense Innovation Unit and its Replicator initiative, Collaborative Combat Aircraft, and the Office of Strategic Capital, etc.), these new structures and initiatives do not yet have the scale required to meet the level of change required. Meanwhile, the overall glacial pace of acquisition and the capture of the status quo by the few prime contractors threatens our nation. In a perfect world, a bipartisan Congress would reorganize the Defense Department to integrate with this new wave of private companies and capital. But that isn’t politically feasible in the time America has left to prepare for the possibility of major war, which may be as little as a few years. That’s where Vannevar Bush’s insights are critical for the present day. We are out of time. The U.S. needs to relearn the lessons that worked to win a World War and outsource advanced weapons systems development to private industry in areas that startups and scale-ups already lead or could move faster in: AI, drones, space, biotech, networking, cyber … The Trump administration should create the Office of Rapid Development and Deployment (ORDD) modeled after the WW II’s Office of Science, Research and Development (OSRD.) This could build on the existing Defense Innovation Unit which is already taking many of the right steps, albeit with dramatically greater scale and autonomy as described below. This new office would be responsible for things that are attritable, software, and have lifecycles of 3-10 years. It would outsource these to private industry focused on specific problems with speed and innovation. This office would have authority to define and issue “prototype” requirements on behalf of the Combatant Commands The Combatant Commands could buy directly from this office. The office would anticipate Combatant Commands needs via embeds, to observe, investigate and prioritize their critical problems. It would also be empowered to select solutions – not on lowest cost but best and fastest solution to deployment The office would have an independent and reliable budget for large scale Acquisition ~15% of the DoD RDT\u0026E budget The office would be staffed with civilian and military talent commensurate with that budget, and with the ability to circumvent bureaucratic barriers to hiring Winning solutions would be supported with guaranteed production contracts to ensure swift delivery The office would take responsibility for integration and overall system strategy, managing how these systems are deployed, fielded, and supported Major defense contractors would be incentivized to partner with them – as providers of exquisite subsystems/kinetics, integrators or even as acquirers (Tax incentives could be offered to encourage the deployment and fielding of these solutions) For example, a collaboration between a traditional defense prime contractor like Lockheed Martin and a newer technology company like Anduril could generate significant synergies. The services would still be responsible for long term acquisition programs requiring a formal budgeting processes, extended supply chains, and decades of support. Primes would remain the main suppliers here – building exquisite systems that require complex integration and decades of support. We’d be ruthless in going through the portfolios of our military research labs and federally funded research centers, eliminating projects that the private sector can already handle effectively These institutions would then be free to concentrate on tasks the private sector cannot address, such as fundamental research, advanced weapon systems, and programs requiring timelines of 10 years or more Goals of an Office of Rapid Development and Deployment (ORDD) The success of the “Office of Rapid Development and Deployment (ORDD)” will depend on a combination of clear goals, unprecedented collaboration, resource commitment, and the effective integration of the commercial ecosystem to rapidly solve practical military challenges with speed and precision. Clear Goals: The immediate threats posed by China, Russia, Iran and North Korea provide a unifying goal: to rapidly develop and deliver cutting-edge technologies, advanced weapons systems, and innovative operating concepts to deter aggression or win a war. Rapid Deployment of solutions: focus on finding and solving specific, actionable problems (e.g., rapid development and deployment of autonomous vehicles (and defense against them), creating AI-enabled systems, and leveraging commercial access to space.) These solutions must be deployable in the near term. Interdisciplinary Teams: Bring together founders, private capital, scientists, engineers, and military innovators from diverse fields, such as AI, autonomy, quantum, cyber, physics and engineering, to address complex challenges. Finance, contracting and acquisition experts will also contribute, ensuring coordination with Congress and the Department of Defense Office of Acquisiton and Sustainment, Research and Engineering, Joint Staff and its J8 directorate and the Services Rapid Prototyping and Testing: Working closely with the Combatant Commands to deeply understand operational problems, the office will iterate designs based on field performance and immediate needs. Agile Development will be used to accelerate the design, testing, and refinement process, ensuring solutions can be delivered promptly to areas of responsibility. Integrate Startups, Venture Capital, Private Equity and Industry: Startups and venture capital will be mobilized to support this effort. Major defense contractors, including Lockheed, RTX, Northrop Grumman, and Huntington Ingalls, et al will work alongside them. Leverage and provide dramatically greater scale to existing Department of Defense innovation efforts (Defense Innovation Unit, Replicator, Collaborative Combat Aircraft, …) build on these foundations of processes and people with embeds to anticipate emerging Combatant Command needs Who Should Lead this Office? Appoint a head of this office who is – or could become –  a trusted advisor of President Trump, deeply understands technology, can look across VC portfolios and select the best domain experts, has a problem-solving mindset and is a charismatic leader. Trusted Advisor: Their relationship with the President will influence policy and ensure that startups and private capital play a central role in the effort. Visionary Leadership: Articulate a clear vision for how startups and private capital can be mobilized to support catching up to our adversaries. Inspire confidence and respect among startup founders, venture capitalists, military leaders and policymakers. Gain Congressional Support: for significant federal funding for this office. This requires a combination of strategic insight and political acumen to demonstrate the importance of the office’s mission and gain bipartisan backing. Focus on Practical Outcomes: emphasize solutions that could be rapidly deployed to the COCOMs. Ensure that projects with the greatest potential impact receive top priority in funding and resources. Who fits this description? Not many. The only candidates I can think of are Elon Musk, Trae Stephens, Stephen Feinberg, Raj Shah, Mike Brown and Doug Beck. A Once-in-a-Century Opportunity The stakes have never been higher, and the path ahead demands the audacity of visionaries who can break free from the inertia of the status quo. Just as Vannevar Bush once harnessed the ingenuity of America’s best minds to outpace the enemies of his time, we now face a moment of similar urgency and promise. If the United States can empower its boldest innovators to lead, not as bureaucrats but as pioneers of rapid technological dominance, we can secure not just victory in the wars of tomorrow but the preservation of the values that make our nation worth defending. The future hinges on our ability to act decisively, to embrace radical change, and to once again make history — not by clinging to the comforts of tradition but by seizing the opportunities of transformation. This is not merely a call to action; it is a rallying cry for a nation that must once again trust its greatest minds to deliver when it matters most. Filed under: National Security |",
  "image": "https://steveblank.com/wp-content/uploads/2024/12/OSRD-text.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\t\t\t\t\t\u003cp\u003e\u003ca href=\"https://warontherocks.com/2024/11/how-to-fix-a-broken-defense-department-to-beat-china-and-russia/\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" data-attachment-id=\"31823\" data-permalink=\"https://steveblank.com/2024/12/03/how-to-flip-the-script-and-beat-china-and-russia-and-fix-the-broken-department-of-defense/screenshot-18/\" data-orig-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/wotr-logo.jpg?fit=428%2C94\u0026amp;ssl=1\" data-orig-size=\"428,94\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;Screenshot\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;Screenshot\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;1\u0026#34;}\" data-image-title=\"Screenshot\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Screenshot\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/wotr-logo.jpg?fit=300%2C66\u0026amp;ssl=1\" data-large-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/wotr-logo.jpg?fit=428%2C94\u0026amp;ssl=1\" src=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/wotr-logo.jpg?resize=150%2C33\u0026amp;ssl=1\" alt=\"\" width=\"150\" height=\"33\" srcset=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/wotr-logo.jpg?resize=150%2C33\u0026amp;ssl=1 150w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/wotr-logo.jpg?resize=300%2C66\u0026amp;ssl=1 300w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/wotr-logo.jpg?w=428\u0026amp;ssl=1 428w\" sizes=\"(max-width: 150px) 100vw, 150px\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eA version of this post previously appeared in \u003ca href=\"https://warontherocks.com/2024/11/how-to-fix-a-broken-defense-department-to-beat-china-and-russia/\" target=\"_blank\" rel=\"noopener\"\u003eWar on the \u003cstrong\u003e\u003cspan\u003eRocks. \u003c/span\u003e\u003c/strong\u003e\u003c/a\u003eThis version has been updated with suggestions from leaders across the Department of Defense and Venture Capital community.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003e\u003cstrong\u003eBLUF\u003c/strong\u003e: \u003c/span\u003e\u003c/strong\u003eIn WW II, the U.S. outsourced advanced weapons systems development to civilians. The weapons they developed won the war. It’s time to do that again. This new administration can make it happen.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e“\u003cem\u003eThe coming war is going to be a technology war. The country’s top innovators feel that there is a huge disconnect between what the U.S. military ecosystem can produce and what’s possible if we engaged civilians to develop weapon systems for critical technologies. The U.S. military has little idea of what civilians could provide in the event of war, and civilians are wholly in the dark as to what the military needs. As a result, we believe the U.S. is woefully unprepared and ill-equipped for a war driven by advanced technology.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe only solution is to outsource advanced weapons systems development outside of the traditional services and government ecosystem and hand the development to civilians\u003c/em\u003e.”\u003cbr/\u003e\n\u003cstrong\u003eVannevar Bush to President Roosevelt in 1940\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInsane?\u003c/p\u003e\n\u003cp\u003ePresident Roosevelt agreed, making a series of decisions that, without which, the Allies may have lost World War II.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://steveblank.com/2013/01/14/the-endless-frontier-u-s-science-and-national-industrial-policy-part-1/\" target=\"_blank\" rel=\"noopener\"\u003eThe U.S. outsourced advanced weapons systems development and acquisition\u003c/a\u003e in 1941. Within three years this gave the U.S a stream of advanced weapons – radar, electronic warfare, proximity fuses, rockets, anti-submarine warfare, and \u003ca href=\"https://steveblank.com/2023/08/29/before-there-was-oppenheimer-there-was-vannevar-bush/\" target=\"_blank\" rel=\"noopener\"\u003enuclear weapons\u003c/a\u003e – all instrumental in our victory in World War II.\u003c/p\u003e\n\u003cp\u003eWe need to do it again. The incoming Trump administration has a historic, once-in-a-century opportunity to do something similar today and give the United States a stream of advanced capabilities and weapons that will allow the United States to deter Russia and China or — failing that — defeat them in a war.\u003c/p\u003e\n\u003cp\u003eHere’s how.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/OSRD-text.jpg?ssl=1\"\u003e\u003cimg data-recalc-dims=\"1\" fetchpriority=\"high\" decoding=\"async\" data-attachment-id=\"31865\" data-permalink=\"https://steveblank.com/2024/12/03/how-to-flip-the-script-and-beat-china-and-russia-and-fix-the-broken-department-of-defense/osrd-text/\" data-orig-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/OSRD-text.jpg?fit=1029%2C1363\u0026amp;ssl=1\" data-orig-size=\"1029,1363\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"OSRD text\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/OSRD-text.jpg?fit=226%2C300\u0026amp;ssl=1\" data-large-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/OSRD-text.jpg?fit=468%2C620\u0026amp;ssl=1\" src=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/OSRD-text.jpg?resize=468%2C620\u0026amp;ssl=1\" alt=\"\" width=\"468\" height=\"620\" srcset=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/OSRD-text.jpg?w=1029\u0026amp;ssl=1 1029w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/OSRD-text.jpg?resize=226%2C300\u0026amp;ssl=1 226w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/OSRD-text.jpg?resize=773%2C1024\u0026amp;ssl=1 773w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/OSRD-text.jpg?resize=113%2C150\u0026amp;ssl=1 113w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/OSRD-text.jpg?resize=768%2C1017\u0026amp;ssl=1 768w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/OSRD-text.jpg?w=936\u0026amp;ssl=1 936w\" sizes=\"(max-width: 468px) 100vw, 468px\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy Radical Change is Needed Now\u003cbr/\u003e\n\u003c/strong\u003eIt’s abundantly clear that the U.S. defense ecosystem is being challenged by the proliferation of commercial technology, hobbled by its legacy systems and prime contractors, and sabotaged by its own Acquisition system, rendering it unable to keep pace with threats to the nation.\u003c/p\u003e\n\u003cp\u003eSimultaneously, the rise of defense-oriented startups and venture capital firms have proven that a commercial ecosystem is more than capable of rapid delivery of most of the advanced weapons needed to deter or win a war. Companies like \u003ca href=\"https://www.spacex.com\" target=\"_blank\" rel=\"noopener\"\u003eSpaceX\u003c/a\u003e, \u003ca href=\"https://www.anduril.com\" target=\"_blank\" rel=\"noopener\"\u003eAnduril\u003c/a\u003e, \u003ca href=\"https://www.palantir.com\" target=\"_blank\" rel=\"noopener\"\u003ePalantir\u003c/a\u003e, \u003ca href=\"https://www.saronic.com\" target=\"_blank\" rel=\"noopener\"\u003eSaronic\u003c/a\u003e, \u003ca href=\"https://www.vannevarlabs.com\" target=\"_blank\" rel=\"noopener\"\u003eVannevar Labs\u003c/a\u003e, et al have proven they can deliver at speeds unmatched by existing contractors. Defense and dual-use venture capital firms like \u003ca href=\"https://shieldcap.com\" target=\"_blank\" rel=\"noopener\"\u003eShield Capital\u003c/a\u003e, \u003ca href=\"https://www.generalcatalyst.com\" target=\"_blank\" rel=\"noopener\"\u003eGeneral Catalyst\u003c/a\u003e, \u003ca href=\"https://a16z.com\" target=\"_blank\" rel=\"noopener\"\u003ea16z\u003c/a\u003e, \u003ca href=\"https://www.dcvc.com\" target=\"_blank\" rel=\"noopener\"\u003eDCVC\u003c/a\u003e, \u003ca href=\"https://www.8vc.com\" target=\"_blank\" rel=\"noopener\"\u003e8VC\u003c/a\u003e, et al, have stepped up to fund this ecosystem, collectively investing tens of billions in new defense technologies.\u003c/p\u003e\n\u003cp\u003eBut the Department of Defense is organized for a world it wishes it still had but no longer exists. Unfortunately our adversaries no longer allow us that freedom. While there have been innovative DoD experiments in innovation (\u003ca href=\"https://www.diu.mil\" target=\"_blank\" rel=\"noopener\"\u003eDefense Innovation Unit\u003c/a\u003e and its \u003ca href=\"https://www.diu.mil/replicator\" target=\"_blank\" rel=\"noopener\"\u003eReplicator\u003c/a\u003e initiative, \u003ca href=\"https://www.af.mil/News/Article-Display/Article/3754980/air-force-exercises-two-collaborative-combat-aircraft-option-awards/\" target=\"_blank\" rel=\"noopener\"\u003eCollaborative Combat Aircraft\u003c/a\u003e, and the \u003ca href=\"https://www.cto.mil/osc/\" target=\"_blank\" rel=\"noopener\"\u003eOffice of Strategic Capital\u003c/a\u003e, etc.), these new structures and initiatives do not yet have the scale required to meet the level of change required. Meanwhile, the overall glacial pace of acquisition and the capture of the status quo by the few prime contractors threatens our nation. \u003cem\u003eIn a perfect world, a bipartisan Congress would reorganize the Defense Department to integrate with this new wave of private companies and capital\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eBut that isn’t politically feasible in the time America has left to prepare for the possibility of major war, which may be as little as a few years. That’s where Vannevar Bush’s insights are critical for the present day.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWe are out of time\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eThe U.S. needs to relearn the lessons that worked to win a World War and \u003cstrong\u003eoutsource advanced weapons systems development to private industry\u003c/strong\u003e in areas that startups and scale-ups already lead or could move faster in: AI, drones, space, biotech, networking, cyber …\u003c/p\u003e\n\u003cp\u003eThe Trump administration should \u003cstrong\u003ecreate the Office of Rapid Development and Deployment (ORDD) modeled after the WW II’s Office of Science, Research and Development (OSRD.) \u003c/strong\u003eThis could build on the existing \u003ca href=\"https://www.diu.mil\" target=\"_blank\" rel=\"noopener\"\u003eDefense Innovation Unit\u003c/a\u003e which is already taking many of the right steps, albeit with dramatically greater scale and autonomy as described below.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThis new office would be responsible for things that are attritable, software, and have lifecycles of 3-10 years.\u003c/li\u003e\n\u003cli\u003eIt would outsource these to private industry focused on specific problems with speed and innovation.\u003c/li\u003e\n\u003cli\u003eThis office would have authority to define and issue “prototype” requirements on behalf of the Combatant Commands\u003c/li\u003e\n\u003cli\u003eThe Combatant Commands could buy directly from this office.\u003c/li\u003e\n\u003cli\u003eThe office would anticipate Combatant Commands needs via embeds, to observe, investigate and prioritize their critical problems.\u003c/li\u003e\n\u003cli\u003eIt would also be empowered to select solutions – not on lowest cost but best and fastest solution to deployment\u003c/li\u003e\n\u003cli\u003eThe office would have an independent and reliable budget for large scale Acquisition ~15% of the DoD \u003ca href=\"https://comptroller.defense.gov/Portals/45/Documents/defbudget/FY2025/FY2025_Weapons.pdfhttps://comptroller.defense.gov/Portals/45/Documents/defbudget/FY2025/FY2025_Weapons.pdf\" target=\"_blank\" rel=\"noopener\"\u003eRDT\u0026amp;E budget\u003c/a\u003e\n\u003cul\u003e\n\u003cli\u003eThe office would be staffed with civilian and military talent commensurate with that budget, and with the ability to circumvent bureaucratic barriers to hiring\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eWinning solutions would be supported with guaranteed production contracts to ensure swift delivery\u003c/li\u003e\n\u003cli\u003eThe office would take responsibility for integration and overall system strategy, managing how these systems are deployed, fielded, and supported\u003c/li\u003e\n\u003cli\u003eMajor defense contractors would be incentivized to partner with them – as providers of exquisite subsystems/kinetics, integrators or even as acquirers (Tax incentives could be offered to encourage the deployment and fielding of these solutions)\n\u003cul\u003e\n\u003cli\u003eFor example, a collaboration between a traditional defense prime contractor like \u003ca href=\"https://www.lockheedmartin.com/en-us/index.html\" target=\"_blank\" rel=\"noopener\"\u003eLockheed Martin\u003c/a\u003e and a newer technology company like \u003ca href=\"https://www.anduril.com\" target=\"_blank\" rel=\"noopener\"\u003eAnduril\u003c/a\u003e could generate significant synergies.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eThe services would still be responsible for long term acquisition programs requiring a formal budgeting processes, extended supply chains, and decades of support.\n\u003cul\u003e\n\u003cli\u003ePrimes would remain the main suppliers here – building exquisite systems that require complex integration and decades of support.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eWe’d be ruthless in going through the portfolios of our military research labs and federally funded research centers, eliminating projects that the private sector can already handle effectively\n\u003cul\u003e\n\u003cli\u003eThese institutions would then be free to concentrate on tasks the private sector cannot address, such as fundamental research, advanced weapon systems, and programs requiring timelines of 10 years or more\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/ORDD-2025.jpg?ssl=1\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" data-attachment-id=\"31812\" data-permalink=\"https://steveblank.com/2024/12/03/how-to-flip-the-script-and-beat-china-and-russia-and-fix-the-broken-department-of-defense/ordd-2025/\" data-orig-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/ORDD-2025.jpg?fit=1166%2C808\u0026amp;ssl=1\" data-orig-size=\"1166,808\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"ORDD 2025\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/ORDD-2025.jpg?fit=300%2C208\u0026amp;ssl=1\" data-large-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/ORDD-2025.jpg?fit=468%2C324\u0026amp;ssl=1\" src=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/ORDD-2025.jpg?resize=468%2C324\u0026amp;ssl=1\" alt=\"\" width=\"468\" height=\"324\" srcset=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/ORDD-2025.jpg?resize=1024%2C710\u0026amp;ssl=1 1024w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/ORDD-2025.jpg?resize=300%2C208\u0026amp;ssl=1 300w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/ORDD-2025.jpg?resize=150%2C104\u0026amp;ssl=1 150w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/ORDD-2025.jpg?resize=768%2C532\u0026amp;ssl=1 768w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/ORDD-2025.jpg?w=1166\u0026amp;ssl=1 1166w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/12/ORDD-2025.jpg?w=936\u0026amp;ssl=1 936w\" sizes=\"(max-width: 468px) 100vw, 468px\"/\u003e\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGoals of an Office of Rapid Development and Deployment (ORDD)\u003cbr/\u003e\n\u003c/strong\u003eThe success of the “Office of Rapid Development and Deployment (ORDD)” will depend on a combination of clear goals, unprecedented collaboration, resource commitment, and the effective integration of the commercial ecosystem to rapidly solve practical military challenges with speed and precision.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cem\u003eClear Goals\u003c/em\u003e: The immediate threats posed by China, Russia, Iran and North Korea provide a unifying goal: to rapidly develop and deliver cutting-edge technologies, advanced weapons systems, and innovative operating concepts to deter aggression or win a war.\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eRapid Deployment of solutions\u003c/em\u003e: focus on finding and solving specific, actionable problems (e.g., rapid development and deployment of autonomous vehicles (and defense against them), creating AI-enabled systems, and leveraging commercial access to space.) These solutions must be deployable in the near term.\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eInterdisciplinary Teams\u003c/em\u003e: Bring together founders, private capital, scientists, engineers, and military innovators from diverse fields, such as AI, autonomy, quantum, cyber, physics and engineering, to address complex challenges.\n\u003cul\u003e\n\u003cli\u003eFinance, contracting and acquisition experts will also contribute, ensuring coordination with Congress and the Department of Defense \u003ca href=\"https://www.acq.osd.mil\" target=\"_blank\" rel=\"noopener\"\u003eOffice of Acquisiton and Sustainment\u003c/a\u003e, \u003ca href=\"https://www.cto.mil\" target=\"_blank\" rel=\"noopener\"\u003eResearch and Engineering\u003c/a\u003e, \u003ca href=\"https://www.jcs.mil\" target=\"_blank\" rel=\"noopener\"\u003eJoint Staff\u003c/a\u003e and its \u003ca href=\"https://www.jcs.mil/directorates/j8-force-structure-resources-assessment/\" target=\"_blank\" rel=\"noopener\"\u003eJ8 directorate\u003c/a\u003e and the Services\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eRapid Prototyping and Testing\u003c/em\u003e: Working closely with the Combatant Commands to deeply understand operational problems, the office will iterate designs based on field performance and immediate needs. Agile Development will be used to accelerate the design, testing, and refinement process, ensuring solutions can be delivered promptly to areas of responsibility.\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eIntegrate Startups, Venture Capital, Private Equity and Industry\u003c/em\u003e: Startups and venture capital will be mobilized to support this effort. Major defense contractors, including Lockheed, \u003ca href=\"https://www.rtx.com\"\u003eRTX\u003c/a\u003e, \u003ca href=\"https://www.northropgrumman.com\" target=\"_blank\" rel=\"noopener\"\u003eNorthrop Grumman\u003c/a\u003e, and \u003ca href=\"https://hii.com\" target=\"_blank\" rel=\"noopener\"\u003eHuntington Ingalls\u003c/a\u003e, et al will work alongside them.\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eLeverage \u003ci\u003eand provide dramatically greater scale to \u003c/i\u003e\u003c/em\u003e\u003cem\u003eexisting Department of Defense innovation efforts\u003c/em\u003e (\u003ca href=\"https://www.diu.mil\" target=\"_blank\" rel=\"noopener\"\u003eDefense Innovation Unit\u003c/a\u003e, Replicator, \u003ca href=\"https://www.af.mil/News/Article-Display/Article/3754980/air-force-exercises-two-collaborative-combat-aircraft-option-awards/\" target=\"_blank\" rel=\"noopener\"\u003eCollaborative Combat Aircraft\u003c/a\u003e, …) build on these foundations of processes and people with embeds to anticipate emerging Combatant Command needs\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWho Should Lead this Office?\u003cbr/\u003e\n\u003c/strong\u003eAppoint a head of this office who is – or could become –  a trusted advisor of President Trump, deeply understands technology, can look across VC portfolios and select the best domain experts, has a problem-solving mindset and is a charismatic leader.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cem\u003eTrusted Advisor\u003c/em\u003e: Their relationship with the President will influence policy and ensure that startups and private capital play a central role in the effort.\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eVisionary Leadership\u003c/em\u003e: Articulate a clear vision for how startups and private capital can be mobilized to support catching up to our adversaries. Inspire confidence and respect among startup founders, venture capitalists, military leaders and policymakers.\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eGain Congressional Support\u003c/em\u003e: for significant federal funding for this office. This requires a combination of strategic insight and political acumen to demonstrate the importance of the office’s mission and gain bipartisan backing.\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eFocus on Practical Outcomes: \u003c/em\u003eemphasize solutions that could be rapidly deployed to the COCOMs. Ensure that projects with the greatest potential impact receive top priority in funding and resources.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWho fits this description? Not many. The only candidates I can think of are Elon Musk, \u003ca href=\"https://foundersfund.com/team/trae-stephens/\"\u003eTrae Stephens\u003c/a\u003e, \u003ca href=\"https://www.cerberus.com/our-firm/leadership/stephen-a-feinberg/\"\u003eStephen Feinberg\u003c/a\u003e, \u003ca href=\"https://shieldcap.com/team/raj-shah\"\u003eRaj Shah\u003c/a\u003e, \u003ca href=\"https://shieldcap.com/team/michael-brown\"\u003eMike Brown\u003c/a\u003e and \u003ca href=\"https://www.diu.mil/team/doug-beck\" target=\"_blank\" rel=\"noopener\"\u003eDoug Beck\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eA Once-in-a-Century Opportunity\u003cbr/\u003e\n\u003c/strong\u003eThe stakes have never been higher, and the path ahead demands the audacity of visionaries who can break free from the inertia of the status quo. Just as Vannevar Bush once harnessed the ingenuity of America’s best minds to outpace the enemies of his time, we now face a moment of similar urgency and promise. If the United States can empower its boldest innovators to lead, not as bureaucrats but as pioneers of rapid technological dominance, we can secure not just victory in the wars of tomorrow but the preservation of the values that make our nation worth defending.\u003c/p\u003e\n\u003cp\u003eThe future hinges on our ability to act decisively, to embrace radical change, and to once again make history — not by clinging to the comforts of tradition but by seizing the opportunities of transformation. This is not merely a call to action; it is a rallying cry for a nation that must once again trust its greatest minds to deliver when it matters most.\u003c/p\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\tFiled under: \u003ca href=\"https://steveblank.com/category/national-security/\" rel=\"category tag\"\u003eNational Security\u003c/a\u003e |\t\t\t\t\t\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-12-03T14:00:55Z",
  "modifiedTime": "2024-12-11T03:05:05Z"
}
