{
  "id": "253d0baa-29db-44d5-b92c-40983a1f24ac",
  "title": "EA’s December quarter was weak as Dragon Age and soccer missed forecasts",
  "link": "https://venturebeat.com/games/eas-december-quarter-was-weak-as-dragon-age-and-soccer-missed-forecasts/",
  "description": "Electronic Arts reported weak earnings today for the holiday quarter, with results in line with the poor quarter that EA preannounced.",
  "author": "Dean Takahashi",
  "published": "Tue, 04 Feb 2025 21:46:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "Business",
    "GamesBeat",
    "Gaming Business",
    "category-/Finance/Investing",
    "category-/Games/Computer \u0026 Video Games",
    "Electronic Arts"
  ],
  "byline": "Dean Takahashi",
  "length": 11661,
  "excerpt": "Electronic Arts reported weak earnings today for the holiday quarter, with results in line with the poor quarter that EA preannounced.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "February 4, 2025 1:46 PM Image Credit: Electronic Arts As the big video game publisher warned, Electronic Arts reported weak earnings today for the holiday quarter, with results hurt by muted sales of its Dragon Age: The Veilguard and global football (soccer) games. EA’s stock was up 1.44% to $123 a share in after-hours trading. Net bookings for the quarter were $2.215 billion, down 6% from $2.366 billion a year earlier. Net revenue was $1.883 billion, down from $1.945 billion a year earlier. Net cash from operating activities was $1.176 billion for the quarter. EA plans for an accelerated stock repurchase program of $1 billion, which is expected to bring total stockholder return to $2.5 billion within the first year of the $5 billion authorization. EA is using Battlefield Labs to test its games with fans. EA preannounced weak earnings for the third-fiscal quarter ended December 31, and it also warned that fiscal year 2025 anticipated mid-single-digit growth in live services net bookings. However, the company reported a mid-single-digit decline, with Global Football accounting for the majority of the change. Separately, Dragon Age: The Veilguard only engaged 1.5 million players during the quarter, down nearly 50% from EA’s expectations. Our own Rachel Kaser loved it. “The record success of our EA Sports FC 25 Team of the Year event demonstrates our creative teams’ ability to adapt, innovate, and execute at scale,” said Andrew Wilson, CEO of Electronic Arts, in a statement. “As we build on this momentum across EA, we are confident in a return to growth in FY26 and beyond as we bring our next wave of iconic entertainment to players and fans worldwide.” Global Football had experienced two consecutive fiscal years of double-digit net bookings growth. However, the franchise experienced a slowdown as early momentum in the fiscal third quarter did not sustain through to the end. As a result, EA revised its outlook for Global Football to end the fiscal year down mid-single-digit at the midpoint of the new outlook. “Today we announced plans for a $1 billion accelerated share repurchase, which is expected to bring total stock repurchases to $2.5 billion within the first year of our $5 billion authorization,” said Stuart Canfield, CFO of Electronic Arts, in a statement. “This reflects both our confidence in EA’s long-term strategy and our ability to balance investment in growth with capital returns.” Updating its forecasts, EA said it expects net revenue for the fiscal year ending March 31, 2025, to be $7.25 billion to $7.4 billion. EA had previously anticipated $7.5 billion to $7.8 billion. Change in deferred revenue is expected to be $250 million down. Dragon Age: The Veilguard was released in October for PS5, Xbox Series X/S, and PC. There was softer acquisition of players, and that resulted in the lower FC revenues. And there was faster user engagement churn, so this group was down single digits. In an analyst call, Canfield said live services are now 74% of EA’s business. EA said the gameplay update for EA Sports FC (released on January 16) drove engagements with over two million Ultimate Team players. EA also said EA Sports FC Mobile saw a double-digit increase in new players and engagement year over year. EA Sports FC 25 EA said the Global Football (soccer) franchise net bookings have grown more than 70% over the last five fiscal years, making it one of the biggest sports entertainment properties worldwide. In analyst call, Wilson said, “Our relentless focus on execution and delivery ensures we continue to bring incredible sports experiences and blockbuster entertainment to hundreds of millions of players and fans around the world. However, Q3 was not the financial performance we wanted or expected. We know as a leader in global entertainment, great titles – even when built and delivered with polished execution – can sometimes miss our financial expectations.” American Football (Madden) saw double-digit growth in weekly active users year-over-year in the third quarter and remains on pace to surpass $1 billion in net bookings for fiscal year 2025. And as EA announced on Monday, EA unveiled Battlefield Labs, a new initiative allowing player-driven testing and innovation ahead of the franchise’s expected fiscal year 2026 release. EA said that full game net bookings were $633 million, while live services net bookings were $1.58 billion. For the fourth quarter ending March 31, 2025, EA expects net revenue will be $1.682 billion to $1.832 billion, with a change in deferred net revenue down $238 million. Net income is expected to be $171 million to $263 million. Net bookings is expected to be $1.444 billion to $1.594 billion. FY25 is expected to be the second biggest year for the EA Sports FC franchise. In the call, EA Sports FC 25 had a good start, but Wilson said this momentum did not sustain through the quarter. Two contributing factors to the performance downside were soft top of funnel acquisition and lapsed engagement later in the quarter. “While early acquisitions started out strong, post-launch acquisition cohorts waited longer in the cycle to acquire the new title as many stayed in prior iterations. Combined players in our full HD experiences were flat year over year. This mix shift and slower new player acquisition accounted for about half of the title’s underperformance versus expectations,” Wilson said. He added that softer than expected engagement made up most of the rest. The core community said they felt the game was more “defensively focused,” Wilson said. “We’re constantly tuning the game to drive a competitive and engaging experience. This year, after a number of key changes to gameplay, we started to hear more feedback than usual around specific issues with balance from one of our most competitive cohorts. This resulted in lower-than-expected engagement into the end of the quarter,” Wilson said. He said the team took the time to listen and validate what players were saying, and implemented somesignificant changes to both the gameplay experience, and corresponding progression and rewards, in a large update that went live for players on January 16th just before the launch of the Team of the Year event. He said the January 16 was well received by the core cohort. The Veilguard’s companions come to Rook with all of their problems. Yesterday, EA announced the acquisition of Tracab Technologies, a leader in advanced sports optical tracking and analysis solutions that will enhance EA Sports’ ability to deliver unrivaled realism and immersive experiences. “In service of our players and fans we are also pushing beyond the bounds of our sports franchises. Yesterday, we shared that we reached an agreement to acquire Tracab Technologies,” Wilson said. “Data is at the center of every meaningful advancement in sports today, and this group has developed best-in-class optical sports tracking, real-time volumetric data capture technology, and analysis capabilities that can extend EA Sports’ lead, accelerating how we deliver more authentic, deeply immersive gameplay that mirrors the fluidity and excitement of real-world athletes and competition.” He added, “Longer-term, Tracab’s capabilities also help us accelerate against our bold vision for the EASPORTS App to be the world’s leading interactive sports platform, following a successful initial regional trial in Q3. Through a combination of Tracab’s real-time data technology and our proprietary game engine, we can enable completely new opportunities for fans to create and share real-world sports content in their own way, reimagining highlights, generating casual and complex game simulations, and watching broadcast alternatives on demand. We’re working to make the EA SPORTS App the new frontier for interactive sports fandom beyond games, and we look forward to sharing more about our plans in the months ahead.” Wilson said EA’s blockbuster storytelling strategy is built on three strategic objectives: First, create anauthentic story and experience for the core audience; Second, build innovative, groundbreakingfeatures; and third, emphasize high quality launches across both PC and console. “In order to break beyond the core audience, games need to directly connect to the evolving demands ofplayers who increasingly seek shared-world features and deeper engagement alongside high-quality narratives in this beloved category,” Wilson said. “Dragon Age had a high-quality launch and was well-reviewed by critics and those who played; however, it did not resonate with a broad-enough audience in this highly competitive market.” That’s about all that EA said about the weakness of Dragon Age: The Veilguard. Wilson said he expects a record year for EA Sports in the fiscal year ending March 31, 2026. “We are developing an entirely new world within the FC platform built around ground-breaking gameplay and cutting-edge tools for social connection and content creation,” he said. “We are leaning into next-level ways to engage fans of the world’s biggest sport across the FC platform through play, create, watch, and connect.” He said Battlefield has the biggest team it has ever had, and it is focused on working with players in a way that it had not in years past. He noted previous Battlefield games were not developed as closely with fans as EA intends with this upcoming game. “Yesterday’s announcement of Battlefield Labs is a key development in our ongoing expansion of Massive Online Communities. Battlefield Labs is launching at a crucial moment in our development journey—at a scale that allows us to test and refine the game with our community in a way that’s unprecedented for Battlefield. This is about embracing a modern, more dynamic approach to development—one that acknowledges how the market has shifted, how player expectations have evolved, and how we show up for our players in ways to deliver a truly next level experience. This latest news from our teams is a crucial step toward Battlefield’s release in FY26,” Wilson said. As far as The Sims goes, the franchise is celebrating its 25th anniversary. The company is launching the first two Creator Kits ever designed by top influencers and content creators. These kits mark the first timethat a full collection of in-game assets have been crafted by creators and officially published by The Sims development team. This is a great step on a path to building a global creator platform in The Sims, Wilson said. During the quarter, EA launched two new creator kits in The Sims 4 and the launch of the MySims: Cozy Bundle outperformed our expectations. With MySims: Cozy Bundle, EA saw over 50% of those who purchased the game were new to EA as it expanded offerings on the Switch platform, Canfield said. In closing, Wilson said, “The very definition of entertainment is rapidly changing. Now, more than ever, our success as a company will come from anticipating and exceeding player expectations to deliver innovative experiences that engage, entertain, and connect people everywhere across an ever-evolvinglandscape.” Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2024/06/Dragon-Age-Veilguard-Featured.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2025-02-04T21:46:00+00:00\" datetime=\"2025-02-04T21:46:00+00:00\"\u003eFebruary 4, 2025 1:46 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"422\" src=\"https://venturebeat.com/wp-content/uploads/2024/06/Dragon-Age-Veilguard-Featured.jpg?w=750\" alt=\"\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eImage Credit: Electronic Arts\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003eAs the big video game publisher warned, \u003ca href=\"https://venturebeat.com/games/ea-teams-with-comcast-and-peacock-on-ea-sports-fc-games/\"\u003eElectronic Arts\u003c/a\u003e reported weak earnings today for the holiday quarter, with results hurt by muted sales of its \u003ca href=\"https://venturebeat.com/games/dragon-age-looks-better-plays-better-than-ever-in-the-veilguard/\"\u003eDragon Age: The Veilguard\u003c/a\u003e and global football (soccer) games.\u003c/p\u003e\n\n\n\n\u003cp\u003eEA’s stock was up 1.44% to $123 a share in after-hours trading. Net bookings for the quarter were $2.215 billion, down 6% from $2.366 billion a year earlier. Net revenue was $1.883 billion, down from $1.945 billion a year earlier. \u003c/p\u003e\n\n\n\n\u003cp\u003eNet cash from operating activities was $1.176 billion for the quarter. EA plans for an accelerated stock repurchase program of $1 billion, which is expected to bring total stockholder return to $2.5 billion within the first year of the $5 billion authorization. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"2048\" height=\"1152\" src=\"https://venturebeat.com/wp-content/uploads/2025/02/battlefieldlabs.png?w=800\" alt=\"\" srcset=\"https://venturebeat.com/wp-content/uploads/2025/02/battlefieldlabs.png 2048w, https://venturebeat.com/wp-content/uploads/2025/02/battlefieldlabs.png?resize=300,169 300w, https://venturebeat.com/wp-content/uploads/2025/02/battlefieldlabs.png?resize=768,432 768w, https://venturebeat.com/wp-content/uploads/2025/02/battlefieldlabs.png?resize=800,450 800w, https://venturebeat.com/wp-content/uploads/2025/02/battlefieldlabs.png?resize=1536,864 1536w, https://venturebeat.com/wp-content/uploads/2025/02/battlefieldlabs.png?resize=400,225 400w, https://venturebeat.com/wp-content/uploads/2025/02/battlefieldlabs.png?resize=750,422 750w, https://venturebeat.com/wp-content/uploads/2025/02/battlefieldlabs.png?resize=578,325 578w, https://venturebeat.com/wp-content/uploads/2025/02/battlefieldlabs.png?resize=930,523 930w\" sizes=\"(max-width: 2048px) 100vw, 2048px\"/\u003e\u003cfigcaption\u003eEA is using Battlefield Labs to test its games with fans.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eEA preannounced weak earnings for the third-fiscal quarter ended December 31, and it also warned that fiscal year 2025 anticipated mid-single-digit growth in live services net bookings. However, the company reported a mid-single-digit decline, with Global Football accounting for the majority of the change.\u003c/p\u003e\n\n\n\n\u003cp\u003eSeparately, Dragon Age: The Veilguard only engaged 1.5 million players during the quarter, down nearly 50% from EA’s expectations. Our own \u003ca href=\"https://venturebeat.com/games/dragon-age-looks-better-plays-better-than-ever-in-the-veilguard/\"\u003eRachel Kaser\u003c/a\u003e loved it.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The record success of our EA Sports FC 25 Team of the Year event demonstrates our creative teams’ ability to adapt, innovate, and execute at scale,” said Andrew Wilson, CEO of Electronic Arts, in a statement. “As we build on this momentum across EA, we are confident in a return to growth in FY26 and beyond as we bring our next wave of iconic entertainment to players and fans worldwide.”\u003c/p\u003e\n\n\n\n\u003cp\u003eGlobal Football had experienced two consecutive fiscal years of double-digit net bookings growth. However, the franchise experienced a slowdown as early momentum in the fiscal third quarter did not sustain through to the end. As a result, EA revised its outlook for Global Football to end the fiscal year down mid-single-digit at the midpoint of the new outlook. \u003c/p\u003e\n\n\n\n\u003cp\u003e“Today we announced plans for a $1 billion accelerated share repurchase, which is expected to bring total stock repurchases to $2.5 billion within the first year of our $5 billion authorization,” said Stuart Canfield, CFO of Electronic Arts, in a statement. “This reflects both our confidence in EA’s long-term strategy and our ability to balance investment in growth with capital returns.”\u003c/p\u003e\n\n\n\n\u003cp\u003eUpdating its forecasts, EA said it expects net revenue for the fiscal year ending March 31, 2025, to be $7.25 billion to $7.4 billion. EA had previously anticipated $7.5 billion to $7.8 billion. Change in deferred revenue is expected to be $250 million down. \u003c/p\u003e\n\n\n\n\u003cp\u003eDragon Age: The Veilguard was released in October for PS5, Xbox Series X/S, and PC. There was softer acquisition of players, and that resulted in the lower FC revenues. And there was faster user engagement churn, so this group was down single digits. In an analyst call, Canfield said live services are now 74% of EA’s business. \u003c/p\u003e\n\n\n\n\u003cp\u003eEA said the gameplay update for EA Sports FC (released on January 16) drove engagements with over two million Ultimate Team players. EA also said EA Sports FC Mobile saw a double-digit increase in new players and engagement year over year. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://venturebeat.com/wp-content/uploads/2024/10/EA-Sports-FC-25.jpg?w=800\" alt=\"EA Sports FC 25\" srcset=\"https://venturebeat.com/wp-content/uploads/2024/10/EA-Sports-FC-25.jpg 1920w, https://venturebeat.com/wp-content/uploads/2024/10/EA-Sports-FC-25.jpg?resize=300,169 300w, https://venturebeat.com/wp-content/uploads/2024/10/EA-Sports-FC-25.jpg?resize=768,432 768w, https://venturebeat.com/wp-content/uploads/2024/10/EA-Sports-FC-25.jpg?resize=800,450 800w, https://venturebeat.com/wp-content/uploads/2024/10/EA-Sports-FC-25.jpg?resize=1536,864 1536w, https://venturebeat.com/wp-content/uploads/2024/10/EA-Sports-FC-25.jpg?resize=400,225 400w, https://venturebeat.com/wp-content/uploads/2024/10/EA-Sports-FC-25.jpg?resize=750,422 750w, https://venturebeat.com/wp-content/uploads/2024/10/EA-Sports-FC-25.jpg?resize=578,325 578w, https://venturebeat.com/wp-content/uploads/2024/10/EA-Sports-FC-25.jpg?resize=930,523 930w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003cfigcaption\u003eEA Sports FC 25\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eEA said the Global Football (soccer) franchise net bookings have grown more than 70% over the last five fiscal years, making it one of the biggest sports entertainment properties worldwide. \u003c/p\u003e\n\n\n\n\u003cp\u003eIn analyst call, Wilson said, “Our relentless focus on execution and delivery ensures we continue to bring incredible sports experiences and blockbuster entertainment to hundreds of millions of players and fans around the world. However, Q3 was not the financial performance we wanted or expected. We know as a leader in global entertainment, great titles – even when built and delivered with polished execution – can sometimes miss our financial expectations.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAmerican Football (Madden) saw double-digit growth in weekly active users year-over-year in the third quarter and remains on pace to surpass $1 billion in net bookings for fiscal year 2025.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd as EA announced on Monday, EA unveiled Battlefield\u003csup\u003e \u003c/sup\u003eLabs, a new initiative allowing player-driven testing and innovation ahead of the franchise’s expected fiscal year 2026 release.\u003c/p\u003e\n\n\n\n\u003cp\u003eEA said that full game net bookings were $633 million, while live services net bookings were $1.58 billion. \u003c/p\u003e\n\n\n\n\u003cp\u003eFor the fourth quarter ending March 31, 2025, EA expects net revenue will be $1.682 billion to $1.832 billion, with a change in deferred net revenue down $238 million. Net income is expected to be $171 million to $263 million. Net bookings is expected to be $1.444 billion to $1.594 billion.\u003c/p\u003e\n\n\n\n\u003cp\u003eFY25 is expected to be the second biggest year for the EA Sports FC franchise.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn the call, EA Sports FC 25 had a good start, but Wilson said this momentum did not sustain through the quarter. Two contributing factors to the performance downside were soft top of funnel acquisition and lapsed engagement later in the quarter.\u003c/p\u003e\n\n\n\n\u003cp\u003e“While early acquisitions started out strong, post-launch acquisition cohorts waited longer in the cycle to acquire the new title as many stayed in prior iterations. Combined players in our full HD experiences were flat year over year. This mix shift and slower new player acquisition accounted for about half of the title’s underperformance versus expectations,” Wilson said.\u003c/p\u003e\n\n\n\n\u003cp\u003eHe added that softer than expected engagement made up most of the rest. The core community said they felt the game was more “defensively focused,” Wilson said. \u003c/p\u003e\n\n\n\n\u003cp\u003e“We’re constantly tuning the game to drive a competitive and engaging experience. This year, after a number of key changes to gameplay, we started to hear more feedback than usual around specific issues with balance from one of our most competitive cohorts. This resulted in lower-than-expected engagement into the end of the quarter,” Wilson said.\u003c/p\u003e\n\n\n\n\u003cp\u003eHe said the team took the time to listen and validate what players were saying, and implemented some\u003cbr/\u003esignificant changes to both the gameplay experience, and corresponding progression and rewards, in a large update that went live for players on January 16th just before the launch of the Team of the Year event. He said the January 16 was well received by the core cohort. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://venturebeat.com/wp-content/uploads/2024/12/20241030163601_1.jpg?w=800\" alt=\"The Veilguard\u0026#39;s companions come to Rook with all of their problems.\" srcset=\"https://venturebeat.com/wp-content/uploads/2024/12/20241030163601_1.jpg 1920w, https://venturebeat.com/wp-content/uploads/2024/12/20241030163601_1.jpg?resize=300,169 300w, https://venturebeat.com/wp-content/uploads/2024/12/20241030163601_1.jpg?resize=768,432 768w, https://venturebeat.com/wp-content/uploads/2024/12/20241030163601_1.jpg?resize=800,450 800w, https://venturebeat.com/wp-content/uploads/2024/12/20241030163601_1.jpg?resize=1536,864 1536w, https://venturebeat.com/wp-content/uploads/2024/12/20241030163601_1.jpg?resize=400,225 400w, https://venturebeat.com/wp-content/uploads/2024/12/20241030163601_1.jpg?resize=750,422 750w, https://venturebeat.com/wp-content/uploads/2024/12/20241030163601_1.jpg?resize=578,325 578w, https://venturebeat.com/wp-content/uploads/2024/12/20241030163601_1.jpg?resize=930,523 930w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003cfigcaption\u003eThe Veilguard’s companions come to Rook with all of their problems.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eYesterday, \u003ca href=\"https://www.ea.com/news/ea-sports-realism-technology\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eEA announced\u003c/a\u003e the acquisition of Tracab Technologies, a leader in advanced sports optical tracking and analysis solutions that will enhance EA Sports’ ability to deliver unrivaled realism and immersive experiences.\u003c/p\u003e\n\n\n\n\u003cp\u003e“In service of our players and fans we are also pushing beyond the bounds of our sports franchises. Yesterday, we shared that we reached an agreement to acquire Tracab Technologies,” Wilson said. “Data is at the center of every meaningful advancement in sports today, and this group has developed best-in-class optical sports tracking, real-time volumetric data capture technology, and analysis capabilities that can extend EA Sports’ lead, accelerating how we deliver more authentic, deeply immersive gameplay that mirrors the fluidity and excitement of real-world athletes and competition.”\u003c/p\u003e\n\n\n\n\u003cp\u003eHe added, “Longer-term, Tracab’s capabilities also help us accelerate against our bold vision for the EA\u003cbr/\u003eSPORTS App to be the world’s leading interactive sports platform, following a successful initial regional trial in Q3. Through a combination of Tracab’s real-time data technology and our proprietary game engine, we can enable completely new opportunities for fans to create and share real-world sports content in their own way, reimagining highlights, generating casual and complex game simulations, and watching broadcast alternatives on demand. We’re working to make the EA SPORTS App the new frontier for interactive sports fandom beyond games, and we look forward to sharing more about our plans in the months ahead.”\u003c/p\u003e\n\n\n\n\u003cp\u003eWilson said EA’s blockbuster storytelling strategy is built on three strategic objectives: First, create an\u003cbr/\u003eauthentic story and experience for the core audience; Second, build innovative, groundbreaking\u003cbr/\u003efeatures; and third, emphasize high quality launches across both PC and console.\u003c/p\u003e\n\n\n\n\u003cp\u003e“In order to break beyond the core audience, games need to directly connect to the evolving demands of\u003cbr/\u003eplayers who increasingly seek shared-world features and deeper engagement alongside high-quality narratives in this beloved category,” Wilson said. “Dragon Age had a high-quality launch and was well-reviewed by critics and those who played; however, it did not resonate with a broad-enough audience in this highly competitive market.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s about all that EA said about the weakness of Dragon Age: The Veilguard.\u003c/p\u003e\n\n\n\n\u003cp\u003eWilson said he expects a record year for EA Sports in the fiscal year ending March 31, 2026. \u003c/p\u003e\n\n\n\n\u003cp\u003e“We are developing an entirely new world within the FC platform built around ground-breaking gameplay and cutting-edge tools for social connection and content creation,” he said. “We  are leaning into next-level ways to engage fans of the world’s biggest sport across the FC platform through play, create, watch, and connect.”\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003eHe said Battlefield has the biggest team it has ever had, and it is focused on working with players in a way that it had not in years past. He noted previous Battlefield games were not developed as closely with fans as EA intends with this upcoming game. \u003c/p\u003e\u003cp\u003e“Yesterday’s announcement of Battlefield Labs is a key development in our ongoing expansion of Massive Online Communities. Battlefield Labs is launching at a crucial moment in our development journey—at a scale that allows us to test and refine the game with our community in a way that’s unprecedented for Battlefield. This is about embracing a modern, more dynamic approach to development—one that acknowledges how the market has shifted, how player expectations have evolved, and how we show up for our players in ways to deliver a truly next level experience. This latest news from our teams is a crucial step toward Battlefield’s release in FY26,” Wilson said.\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003eAs far as The Sims goes, the franchise is celebrating its 25th anniversary. The company is launching the first two Creator Kits ever designed by top influencers and content creators. These kits mark the first time\u003cbr/\u003ethat a full collection of in-game assets have been crafted by creators and officially published by The Sims development team. This is a great step on a path to building a global creator platform in The Sims, Wilson said. \u003c/p\u003e\n\n\n\n\u003cp\u003eDuring the quarter, EA launched two new creator kits in The Sims 4 and the launch of the MySims: Cozy Bundle outperformed our expectations. With MySims: Cozy Bundle, EA saw over 50% of those who  purchased the game were new to EA as it expanded offerings on the Switch platform, Canfield said.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn closing, Wilson said, “The very definition of entertainment is rapidly changing. Now, more than ever, our success as a company will come from anticipating and exceeding player expectations to deliver innovative experiences that engage, entertain, and connect people everywhere across an ever-evolving\u003cbr/\u003elandscape.”\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://venturebeat.com/wp-content/themes/vb-news/brand/img/vb-daily-phone.png\" alt=\"\"/\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-02-04T21:46:00Z",
  "modifiedTime": "2025-02-04T23:01:00Z"
}
