{
  "id": "27544cc1-5fb9-41b5-a5bf-95f542cc03da",
  "title": "Ambsheets: Spreadsheets for Exploring Scenarios",
  "link": "https://www.inkandswitch.com/ambsheets/",
  "description": "Article URL: https://www.inkandswitch.com/ambsheets/ Comments URL: https://news.ycombinator.com/item?id=42941143 Points: 15 # Comments: 1",
  "author": "azhenley",
  "published": "Tue, 04 Feb 2025 23:56:25 +0000",
  "source": "https://hnrss.org/frontpage",
  "categories": null,
  "byline": "Alex Warth Geoffrey Litt",
  "length": 5978,
  "excerpt": "Ambsheets is a research project about new kinds of spreadsheets for exploring possibility spaces and making better decisions.",
  "siteName": "",
  "favicon": "https://www.inkandswitch.com/apple-touch-icon.png",
  "text": "01 · A spreadsheet for exploring scenarios 2025 Feb 4 From calculating monthly budgets to planning dream vacations, spreadsheets are our trusted companions as we navigate life’s complex decisions—a playground for thinking, where possibilities come to life through numbers. Spreadsheets are particularly useful for thinking through financial models, budgets, or any situation that involves considering lots of possible scenarios. Instead of laboriously redoing a bunch of math, you can quickly ask “what if?” questions and see the effects. But, as great as spreadsheets already are for this task, we think they could be even better. In our Ambsheets project, we are exploring a small extension to the spreadsheet: what if a single cell could hold multiple values at once? The problem of comparing scenariosSuppose you’re moving to a new city, and you want to figure out how much you can afford to spend on your car, apartment, and other essentials each month. You start out by making a spreadsheet that sums up the various line items: Now, you want to consider a few scenarios for possible cars and apartments. How might you compare those scenarios in the spreadsheets of today? One thing you can do is toggle, by temporarily entering different values into a cell: Toggling is straightforward because it doesn’t require restructuring the spreadsheet at all. But it has a key drawback: there’s no way to see all the scenarios at once! Another option is to restructure by adding more columns to the sheet: Restructuring does let you compare multiple scenarios at the same time, but it has its own drawbacks. It’s more work than toggling, because you need to pause and edit the layout. And it’s easy to run out of space—even in this small example, if you wanted to consider two possible cars and three possible apartments, your spreadsheet would grow rapidly. Introducing amb valuesNeither of the options above is fully satisfying. What if instead you could directly tell the spreadsheet that you’re considering multiple values for the price of the car? In an ambsheet, you can do just that: The new value of B3, {500,1200}, means either 500 or 1200. We call this an amb value, and it represents one dimension in our possibility space. (Amb is shorthand for “ambiguous”, and is a reference to the nondeterministic evaluator from Abelson and Sussman’s Structure and Interpretation of Computer Programs.) Amb values flow through the computation just like regular values and don’t require any special treatment in formulas. Cell B7, whose formula is SUM(B3:B5), now evaluates to either $3,318 or $4,018—this is what your total monthly spend will be if you decide to lease the car that costs $500/month or the car that costs $1,200/month, respectively. If you’re willing to spend up to $5,000, you may also want to consider apartments that are larger and/or in nicer neighborhoods. In our ambsheet, all we have to do is change B4 to an amb value: Now the total monthly spend (cell B7) has 6 different values, one for each possible scenario: in the 1st one, we leased the $500/month car and rented the $2,800/month apartment, in the 2nd one, we leased the $500/month car and rented the $3,700/month apartment, … and so on. We say this possibility space has two dimensions because there are two different amb values where we are making a choice. We can visualize the possible values of B7 in a 2-dimensional table: Within each scenario, an ambsheet operates like a normal spreadsheet—the SUM formula only sees “regular” (non-amb) numbers. Behind the scenes, the ambsheet’s evaluator takes care of enumerating all possible scenarios and running the formulas for each one. Ambsheets aren’t limited to 2 dimensions. For example, if you’re choosing among different Netflix plans, you could turn the last budget item into an amb value, resulting in a 3-dimensional possibility space. This is more flexible than doing restructuring in traditional spreadsheets, where you’re limited to the 2D grid. What about Excel’s “What-if”? If you’ve used What-If Analysis in Microsoft Excel, some of these ideas may seem familiar. That feature aims to solve the same problem as Ambsheets, but there are two key differences. First, What-If Analysis has a clunky UI that’s not integrated into the spreadsheet itself. You need to open a separate mode to enter cell values or view the possible scenarios. In an ambsheet, you can start exploring scenarios right within the sheet itself. We also take a different approach to enumerating scenarios. Excel requires the user to manually enter every scenario—even in the simple example above, exploring 2 cars, 3 apartments, and 2 Netflix plans would require entering 12 scenarios, with names like “Cheap Car / Medium apartment / Premium Netflix”. In contrast, an ambsheet automatically computes all combinations of the three amb values. Going deeperThat covers the basics of amb values, but many questions remain if we want to grow this kernel into a powerful medium for exploring scenarios. Filtering: How can you interactively explore large possibility spaces and narrow down to the subset of scenarios that you care about? Visualization: A table works fine for visualizing six values in two dimensions, but how do you show hundreds of possible values across many dimensions in a useful way? Continuous distributions: What does it look like to have an amb value that represents a probability distribution rather than a list of discrete values? Applications: How can ambsheets apply to specific domains of decision-making? For example, could you make an ambsheet for budgeting, or for analyzing card games? We’ve been exploring these questions and more, and we’ll be posting the results of our experiments in this lab notebook. If you have a problem that you think might benefit from Ambsheets, we’d love to chat—please reach out to us at alexwarth@inkandswitch.com and geoffrey@inkandswitch.com.",
  "image": "https://www.inkandswitch.com/ambsheets/assets/logo-favicon-196x196.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n  \u003ch2\u003e\u003ca href=\"https://www.inkandswitch.com/ambsheets/notebook/01/\"\u003e01 · A spreadsheet for exploring scenarios\u003c/a\u003e\u003c/h2\u003e\n  \u003cp\u003e2025 Feb 4\u003c/p\u003e\n  \u003cp\u003eFrom calculating monthly budgets to planning dream vacations, spreadsheets are our trusted companions as we navigate life’s complex decisions—a playground for thinking, where possibilities come to life through numbers.\u003c/p\u003e\n\u003cp\u003eSpreadsheets are particularly useful for thinking through financial models, budgets, or any situation that involves considering lots of possible scenarios. Instead of laboriously redoing a bunch of math, you can quickly ask “what if?” questions and see the effects.\u003c/p\u003e\n\u003cp\u003eBut, as great as spreadsheets already are for this task, we think they could be even better. In our \u003cem\u003eAmbsheets\u003c/em\u003e project, we are exploring a small extension to the spreadsheet: \u003cstrong\u003ewhat if a single cell could hold multiple values at once\u003c/strong\u003e?\u003c/p\u003e\n\n\n\u003cfigure\u003e\n  \u003cvideo controls=\"\" preload=\"metadata\" width=\"100%\" src=\"https://www.inkandswitch.com/ambsheets/notebook/static/01/ambsheets-1-bells-and-whistles.mp4\"\u003e\n\u003c/video\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"the-problem-of-comparing-scenarios\"\u003e\u003ca href=\"#the-problem-of-comparing-scenarios\"\u003eThe problem of comparing scenarios\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eSuppose you’re moving to a new city, and you want to figure out how much you can afford to spend on your car, apartment, and other essentials each month. You start out by making a spreadsheet that sums up the various line items:\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.inkandswitch.com/ambsheets/notebook/static/01/ambsheets-0-spreadsheet.jpg\" alt=\"\"/\u003e\u003c/p\u003e\n\u003cp\u003eNow, you want to consider a few scenarios for possible cars and apartments. \u003cstrong\u003eHow might you compare those scenarios in the spreadsheets of today?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOne thing you can do is \u003cstrong\u003etoggle,\u003c/strong\u003e by temporarily entering different values into a cell:\u003c/p\u003e\n\n\n\u003cfigure\u003e\n  \u003cvideo controls=\"\" preload=\"metadata\" width=\"100%\" src=\"https://www.inkandswitch.com/ambsheets/notebook/static/01/ambsheets-2-toggle.mp4\"\u003e\n\u003c/video\u003e\u003c/figure\u003e\n\n\n\u003cp\u003eToggling is straightforward because it doesn’t require restructuring the spreadsheet at all. But it has a key drawback: there’s no way to see all the scenarios at once!\u003c/p\u003e\n\u003cp\u003eAnother option is to \u003cstrong\u003erestructure\u003c/strong\u003e by adding more columns to the sheet:\u003c/p\u003e\n\n\n\u003cfigure\u003e\n  \u003cvideo controls=\"\" preload=\"metadata\" width=\"100%\" src=\"https://www.inkandswitch.com/ambsheets/notebook/static/01/ambsheets-3-restructure.mp4\"\u003e\n\u003c/video\u003e\u003c/figure\u003e\n\n\n\u003cp\u003eRestructuring does let you compare multiple scenarios at the same time, but it has its own drawbacks. It’s more work than toggling, because you need to pause and edit the layout. And it’s easy to run out of space—even in this small example, if you wanted to consider two possible cars and three possible apartments, your spreadsheet would grow rapidly.\u003c/p\u003e\n\n\u003ch2 id=\"introducing-amb-values\"\u003e\u003ca href=\"#introducing-amb-values\"\u003eIntroducing amb values\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eNeither of the options above is fully satisfying.  What if instead you could directly tell the spreadsheet that you’re considering multiple values for the price of the car? In an ambsheet, you can do just that:\u003c/p\u003e\n\n\n\u003cfigure\u003e\n  \u003cvideo controls=\"\" preload=\"metadata\" width=\"100%\" src=\"https://www.inkandswitch.com/ambsheets/notebook/static/01/ambsheets-4-amb-car.mp4\"\u003e\n\u003c/video\u003e\u003c/figure\u003e\n\n\n\u003cp\u003eThe new value of B3, \u003ccode\u003e{500,1200}\u003c/code\u003e, means \u003cem\u003eeither\u003c/em\u003e \u003ccode\u003e500\u003c/code\u003e \u003cem\u003eor\u003c/em\u003e \u003ccode\u003e1200\u003c/code\u003e. We call this an \u003cem\u003eamb value\u003c/em\u003e, and it represents one dimension in our possibility space. (Amb is shorthand for “ambiguous”, and is a reference to the \u003ca href=\"https://sarabander.github.io/sicp/html/4_002e3.xhtml\"\u003enondeterministic evaluator\u003c/a\u003e from Abelson and Sussman’s Structure and Interpretation of Computer Programs.)\u003c/p\u003e\n\u003cp\u003eAmb values flow through the computation just like regular values and don’t require any special treatment in formulas. Cell B7, whose formula is \u003ccode\u003eSUM(B3:B5)\u003c/code\u003e, now evaluates to either $3,318 or $4,018—this is what your total monthly spend will be if you decide to lease the car that costs $500/month or the car that costs $1,200/month, respectively.\u003c/p\u003e\n\u003cp\u003eIf you’re willing to spend up to $5,000, you may also want to consider apartments that are larger and/or in nicer neighborhoods. In our ambsheet, all we have to do is change B4 to an amb value:\u003c/p\u003e\n\n\n\u003cfigure\u003e\n  \u003cvideo controls=\"\" preload=\"metadata\" width=\"100%\" src=\"https://www.inkandswitch.com/ambsheets/notebook/static/01/ambsheets-5-amb-apartment.mp4\"\u003e\n\u003c/video\u003e\u003c/figure\u003e\n\n\n\u003cp\u003eNow the total monthly spend (cell B7) has 6 different values, one for each possible \u003cem\u003escenario:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ein the 1st one, we leased the $500/month car and rented the $2,800/month apartment,\u003c/li\u003e\n\u003cli\u003ein the 2nd one, we leased the $500/month car and rented the $3,700/month apartment,\u003c/li\u003e\n\u003cli\u003e… and so on.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe say this possibility space has two \u003cem\u003edimensions\u003c/em\u003e because there are two different amb values where we are making a choice. We can visualize the possible values of B7 in a 2-dimensional table:\u003c/p\u003e\n\n\n\u003cfigure\u003e\n  \u003cvideo controls=\"\" preload=\"metadata\" width=\"100%\" src=\"https://www.inkandswitch.com/ambsheets/notebook/static/01/ambsheets-1-bells-and-whistles.mp4\"\u003e\n\u003c/video\u003e\u003c/figure\u003e\n\n\n\u003cp\u003eWithin each scenario, an ambsheet operates like a normal spreadsheet—the SUM formula only sees “regular” (non-amb) numbers. Behind the scenes, the ambsheet’s evaluator takes care of enumerating all possible scenarios and running the formulas for each one.\u003c/p\u003e\n\u003cp\u003eAmbsheets aren’t limited to 2 dimensions. For example, if you’re choosing among different Netflix plans, you could turn the last budget item into an amb value, resulting in a 3-dimensional possibility space. This is more flexible than doing restructuring in traditional spreadsheets, where you’re limited to the 2D grid.\u003c/p\u003e\n\n\u003ch2 id=\"what-about-excels-what-if\"\u003e\u003ca href=\"#what-about-excels-what-if\"\u003eWhat about Excel’s “What-if”?\u003c/a\u003e\u003c/h2\u003e\u003cp\u003e\u003cimg src=\"https://www.inkandswitch.com/ambsheets/notebook/static/01/what-if.png\" alt=\"\"/\u003e\u003c/p\u003e\n\u003cp\u003eIf you’ve used What-If Analysis in Microsoft Excel, some of these ideas may seem familiar. That feature aims to solve the same problem as Ambsheets, but there are two key differences.\u003c/p\u003e\n\u003cp\u003eFirst, What-If Analysis has a clunky UI that’s not integrated into the spreadsheet itself. You need to open a separate mode to enter cell values or view the possible scenarios. In an ambsheet, you can start exploring scenarios right within the sheet itself.\u003c/p\u003e\n\u003cp\u003eWe also take a different approach to enumerating scenarios. Excel requires the user to manually enter every scenario—even in the simple example above, exploring 2 cars, 3 apartments, and 2 Netflix plans would require entering 12 scenarios, with names like “Cheap Car / Medium apartment / Premium Netflix”. In contrast, an ambsheet automatically computes all combinations of the three amb values.\u003c/p\u003e\n\n\u003ch2 id=\"going-deeper\"\u003e\u003ca href=\"#going-deeper\"\u003eGoing deeper\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eThat covers the basics of amb values, but many questions remain if we want to grow this kernel into a powerful medium for exploring scenarios.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFiltering: How can you interactively explore large possibility spaces and narrow down to the subset of scenarios that you care about?\u003c/li\u003e\n\u003cli\u003eVisualization: A table works fine for visualizing six values in two dimensions, but how do you show hundreds of possible values across many dimensions in a useful way?\u003c/li\u003e\n\u003cli\u003eContinuous distributions: What does it look like to have an amb value that represents a probability distribution rather than a list of discrete values?\u003c/li\u003e\n\u003cli\u003eApplications: How can ambsheets apply to specific domains of decision-making? For example, could you make an ambsheet for budgeting, or for analyzing card games?\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe’ve been exploring these questions and more, and we’ll be posting the results of our experiments in this lab notebook.\u003c/p\u003e\n\u003cp\u003eIf you have a problem that you think might benefit from Ambsheets, we’d love to chat—please reach out to us at \u003ca href=\"mailto:alexwarth@inkandswitch.com\"\u003ealexwarth@inkandswitch.com\u003c/a\u003e and \u003ca href=\"mailto:geoffrey@inkandswitch.com\"\u003egeoffrey@inkandswitch.com\u003c/a\u003e.\u003c/p\u003e\n\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
