{
  "id": "31170076-c320-4bd8-aca9-27d0695f6ddf",
  "title": "I drank every cocktail",
  "link": "https://aaronson.org/blog/i-drank-every-cocktail",
  "description": "Article URL: https://aaronson.org/blog/i-drank-every-cocktail Comments URL: https://news.ycombinator.com/item?id=44665373 Points: 60 # Comments: 11",
  "author": "colinprince",
  "published": "Wed, 23 Jul 2025 23:56:25 +0000",
  "source": "https://hnrss.org/frontpage",
  "categories": null,
  "byline": "Adam Aaronson",
  "length": 22252,
  "excerpt": "The International Bartenders Association, or IBA, maintains a list of official cocktails, ones they deem to be “the most requested recipes” at bars all around the world. It’s the closest thing the bartending industry has to a canonical list of cocktails, akin to the American Kennel Club’s registry of dog breeds or a jazz musician’s Real Book of standards.",
  "siteName": "Adam Aaronson",
  "favicon": "https://aaronson.org/apple-touch-icon.png",
  "text": "The International Bartenders Association, or IBA, maintains a list of official cocktails, ones they deem to be “the most requested recipes” at bars all around the world. It’s the closest thing the bartending industry has to a canonical list of cocktails, akin to the American Kennel Club’s registry of dog breeds or a jazz musician’s Real Book of standards. The IBA official cocktail list is the kind of list that has its own Sporcle quiz and its own Wikipedia article—an “IBA official cocktail” label even christens the top of each cocktail’s own Wikipedia infobox: As of 2025, there are 102 IBA official cocktails, and as of July 12, 2025, I’ve had every one of them. The journey has taken me to some interesting places, and now that it’s done, I have a little story to tell for each cocktail. I’m not gonna tell you all 102 stories, but I do want to debrief the experience. Drinking all 102 cocktails turned out to be unexpectedly tricky, and for reasons you’ll soon understand, I might be one of the first people in the world to do it. ⚠ Drink responsibly! This endeavor involved drinking a lot of alcohol, but I did it over the course of a few years. It’s rare that I have more than a drink or two in one night (and never have I ever blacked out from drinking). I do not recommend speedrunning the IBA official cocktail list. It’s important to know your limits, be conscious about how much you’re drinking, and drink a lot of water. If you’re struggling with an alcohol addiction, you should probably stop reading this post and talk to someone (if you’re outside of the US, you can find a helpline here). How it started I’m something of a list keeper. But it can be hard to decide when to start keeping track of things. So sometimes, I pick an arbitrary starting point that feels vaguely fateful, and I keep a list from that point on. For albums, it was the day I got my AirPods Pro delivered. For restaurants, it was the day I moved to New York City. For cocktails, it was the day I turned 21. I started a note in Obsidian called Legal Cocktails, enumerating each type of classic cocktail I had consumed since I came of age. A dry martini at 5801 to usher in my birthday. A sex on the beach on an intern dinner cruise a couple weeks later. Over the next couple years, Legal Cocktails grew to about 50 different drinks. Throughout my senior year at Illinois, my more epicurean friends Aidan and Christian would host a series of little get-togethers where they’d mix us drinks in their apartments, ranging from more pedestrian picks like the daiquiri and negroni to deeper cuts like the hanky panky and a half-decent Ramos gin fizz Christian made from melted butter. First semester that year, I took a Beverage Management class, which was ostensibly about managing bars, but it was no secret that everyone took it because of its tasting component. The very last lecture focused on cocktails, and the tasting section featured an old fashioned, martini, margarita, whiskey sour, and the new-to-me Planter’s punch—not bad for a college class. And through it all, I was sometimes a normal college student, drinking Long Island iced teas at Legends happy hour and shitty tequila sunrises at Red Lion (I regret to inform you I deemed the Kams Blue Guy too proprietary for my list). Some time after graduating and moving to New York City, I began to reckon with Legal Cocktails. What really counted as a “classic” cocktail? Where do I draw the line? It felt a little arbitrary. So on May 9, 2024, I decided to retcon the list into a checklist, and nix the “legal” requirement (something something statute of limitations). I had heard of the IBA official cocktail list from my time on Sporcle and Wikipedia, so it seemed like as good a list as any to base mine on. At that point, there were 89 IBA official cocktails, and I had tried 33 of them (a bunch of the ones on Legal Cocktails weren’t IBA official, like the Jägerbomb and, weirdly, the amaretto sour). One thing was for sure: I had a lot of drinking to do. Anatomy of a list The IBA official cocktail list has existed for over 60 years. It was first proposed in Paris in 1960 by bartender and IBA founding member Angelo Zola, who felt the need to standardize the mess of cocktail recipes that differed depending on which bartender you asked. Zola assembled a committee within the IBA, and together, they decided on a set of cocktails that best represented the most important recipes served around the world. The following year in Oslo, Zola’s vision became a reality, and the inaugural list was unveiled. It comprised 50 cocktails, many of which remain on the list today, but some of which (like the zaza) have gone by the wayside. That’s because the list has gone through big revisions every 10 years or so, with the IBA adding drinks they deem newly relevant and removing ones that have fallen out of fashion. (The 89-cocktail list I based my checklist on was established in the 2020 update.) There are many ways one might organize a list of cocktails, but the IBA chooses to group them into three categories: the Unforgettables (these are all-time classics, like the Manhattan and the uhhh monkey gland), the Contemporary (these are newer, but have solidified classic status, like the Mai Tai and the Moscow mule), and the New Era (these are rising stars invented in the late 20th or early 21st century, like the espresso martini and the paper plane). Most of the list comprises pretty normal cocktails that a good bartender would recognize. But some immediately struck me as esoteric, or hard to obtain for one reason or another—like the Canchanchara, which calls for Cuban aguardiente; the Spicy Fifty, an oddly specific recipe with red chili pepper in it; and what I saw as the final boss of the list, the Ve.n.to, with its arcanely formatted name and a recipe centered on grappa and a hyper-specialized “chamomile cordial.” All of them, nonetheless, had a Wikipedia page (no matter how small), their inclusion on the list alone serving as a badge of legitimacy. I was slightly convinced the Ve.n.to was planted on the list by Big Grappa, and as far as I could tell, it was only served at one bar in middle-of-nowhere Italy (the Spicy Fifty, one in London). But I had a list to complete, and nothing was gonna stop me. Smooth sailing For a while, checking cocktails off the list was easy. It was just a matter of going to bars and restaurants (which, like any other yuppie, I was already doing), scanning the menu, and hoping to find a classic cocktail I hadn’t yet tried. A boulevardier at Kelly’s. A Champagne cocktail at Antler (one of my early favorites, a nice blend of bitters and bubbles). A formative moment early in the quest came at Uncle Charlie’s Piano Lounge in Midtown with Ming and Alina. A divey gay bar with no menu? Sounded like a perfect opportunity to check off some drinks! I scanned through my list to find something simple to try and order, went up to a mustachioed bartender, and asked, “could you do a caipirinha?” He replied, “nah, we don’t have cachaça”—a reality check—and I said, “alright, I’ll just do uhhh an Aperol spritz” (one of my old reliables). After crushing my spritz, I went back to the same bartender. Still determined to check some boxes, I asked for a mint julep. “I’m afraid we don’t have mint,” he laughed, “you fancy boy!” Unwilling to settle for another spritz, I scurried back to Ming and Alina and asked them what to do. Alina suggested, “why don’t you just show him the list and see what he can make?” So that’s exactly what I did. Back at the bar, I briefly explained my mission to the bartender, handed him my phone, and he scrolled through the list. “Oh, I can do a few of these,” he said, “You’re cool with any of them?” “Yeah, whatever you can make,” I replied. Soon enough, I had a lemon drop martini in hand. (Alina tried mine and then ordered one for herself, but the bartender asked her, “Is that for your friend or you? If it’s for your friend I’ll make him something new!”) After gleefully finishing the lemon drop (and singing “Y.M.C.A.” at the mic), I returned to the bar one last time. The bartender greeted me, “What’s next for you, fancy?” I handed him my phone again, told him to “surprise me,” and emerged with a New York sour, which he explained was basically a whiskey sour with a red wine float. Sometimes all you have to do is ask. On our way out that night, the bartender bade me farewell—”bye, fancy!”—and I had a new favorite service experience of my life. Monkeying around The monkey gland, that one odd duck in the Unforgettables section, was my white whale for a while. Obscure even to a seasoned bartender, it taught me that you can’t go ordering every drink on the list willy-nilly. At another dive, my friend Michael went up to the bar and asked point-blank, “two monkey glands, please!” You could imagine the bartender’s confusion. A month or so later, at Gage \u0026 Tollner with fellow cocktail enjoyer Malaika, we were bantering with the bartender about my list. He had also never heard of the monkey gland, but he was curious, so we explained it to him, and the conversation moved on. Just as my rusty nail and Malaika’s French 75 neared completion, the bartender plopped down two cocktail glasses in front of us, each half-filled with a pinkish-orange liquid. “Two monkey glands,” he declared. They were pretty good—the orange and anise flavors complemented each other surprisingly nicely, but also, they were free, which makes everything taste better. London calling I kept cruising through the list. A naked and famous at Death \u0026 Co. (where the naked and famous was invented). A Clover Club at the Clover Club (where, I learned, the Clover Club was in fact not invented). Then in November, I was in London for a two-week work trip. This would mark a significant turning point in my journey, for multiple reasons. For one, I was able to check off the Spicy Fifty, one of the list’s most perplexing inclusions, by going to creator Salvatore Calabrese’s own Velvet bar at the Corinthia hotel, seemingly the only place in the world where it’s served. The bar was truly posh—before I had my drink (which was great, though I kinda wished it was spicier), I was greeted with a complimentary tray of candied almonds, olives, and blue corn flatbread. But this luxury was juxtaposed with an extremely cursed cocktail menu, featuring an AI-generated image for each drink (and one AI-generated Nelson Mandela quote): I hit up the American Bar at the Savoy Hotel, London’s oldest extant cocktail bar, for an angel face (which was invented there) and a painstakingly garnished horse’s neck. I got a corpse reviver #2 at the confusingly similarly named Bar Américain. Turns out “American bar” just means a cocktail bar, as opposed to the city’s many beer-centric pubs, because cocktails are an American invention. That’s what I call a cultural victory. But the most important bar on this whole journey, and my new favorite bar in the world, was Satan’s Whiskers in London’s Bethnal Green neighborhood. I went there on a whim, per Malaika’s recommendation, not realizing it would be a godsend for someone trying to complete this list. The thing about Satan’s Whiskers is that their printed menu, focused on classic and modern classic cocktails, completely changes every day. This means the bartenders have an encyclopedic knowledge of the cocktail canon, and they have the ingredients on hand to make any of the 900 drinks they rotate between. At first, I scanned the menu and didn’t see anything I needed for the list, so I panic-ordered a Jungle Bird (which wasn’t on the list, but I had heard of it—it was great). Then I decided to venture off the day’s menu: “Do you know a… brandy crusta?” Without hesitation, the bartender Ollie said, “sure, I can do that!” and confirmed I wanted a sugared rim. Next, I had a Tipperary, which he explained was an odd flavor combination that they’d only really list on their menu on an unpopular day (Mia, another bartender walking by, chimed in, “Tipperary Tuesdays!”). I capped off the night with an Alexander—​“gin or brandy?”—a brandy Alexander, which made for a perfect dessert cocktail. It all felt unreal, like a bar created in a lab for the sole purpose of me finishing this list. A spanner in the works A couple days later, I was checking in on the IBA official cocktail list website, and I could not believe my eyes. There were new cocktails on the list. It felt like a bad dream. Still in an unfamiliar city, having just been to this magical bar, now confronted with these freaky new cocktail names on a list I had grown so accustomed to. Wasn’t the last update only a few years ago? (Since then, I’ve had several actual nightmares of the IBA adding anywhere from a few to a few hundred new drinks to the list.) To be precise, there were now 102 IBA official cocktails, up from the previous 89. 3 had been removed from the list (including the golden dream, which I had gotten at Attaboy, long live the golden dream), and 16 new ones were added (including the Jungle Bird I had just had at Satan’s Whiskers, nice). I coped by tweeting through it, seemingly the first person on the internet to discover the update. In reality, and I only learned this several months later, the day I discovered the update was the exact same day it was added to the IBA website. What I didn’t know was that there had been news articles about the update 8 months earlier, but they were all in Italian because the update coincided with a new 101 IBA Cocktails book, published exclusively in Italian for whatever reason (the book inexplicably leaves out the fernandito, fernet and Coke, maybe because 101 sounds more fun than 102). It was no longer true that every IBA official cocktail had its own Wikipedia page. A few of the new ones did, like the sherry cobbler, the porn star martini, and the South Side (which had previously been added and removed from the list), but now the list was sprinkled with red links. Most of the new ones were pretty legit modern classics, but one stuck out like a sore thumb. It was called, bafflingly, the IBA Tiki. A Google search revealed almost no information about it. Its recipe had 9 ingredients, including gengibre (just Portuguese for ginger) and two specific Havana Club rums, which are illegal in the United States thanks to Cuban sanctions. Step aside, Ve.n.to, there’s a new final boss in town. I later learned that the drink’s recipe was commissioned by the IBA for their 2022 World Cocktail Championship, which was held in Cuba and, naturally, sponsored by Havana Club. For some reason, they saw fit to make it cocktail number 101 in their 101 IBA Cocktails book, and now it’s forever enshrined in cocktail history. *** That night, I did the only thing I could do, and I went back to Satan’s Whiskers. In fact, I ended up going there four nights that week, checking off an obscene 13 cocktails within their taxidermied walls. The bartenders had, obviously, never heard of the IBA Tiki (and didn’t have those rums on hand), but they knew plenty of the other new additions off the dome. It was also there that I discovered my love for the Porto flip, the only IBA official cocktail to contain egg yolk. I wasn’t sure if Satan’s Whiskers would be able to make one, but Mia’s face lit up when I ordered it—she had a soft spot for flips, and once I took a few sips, I knew it was one of my new favorites too. (On the Sporcle quiz, the Porto flip currently sits as the single least-guessed IBA official cocktail.) I left London with a new favorite cocktail, a new favorite bar, and a napkin listing 6 bars Mia recommended in NYC. 82 down, 20 to go. The final stretch At this point, it was exceedingly unlikely to stumble upon the remaining cocktails on a bar menu. It was now a matter of seeking out particular bars that offered each drink, or failing that, going to really good bars and hoping they could whip one up. Such was the case with one new addition, the Brazilian rabo de galo (literally “tail of the cock,” or “cocktail”), which I ordered off-menu at the bitters bar Amor y Amargo to excellent effect—I’ve since had two more of them at actual Brazilian restaurant Berimbau, and I’d easily place it next to the Porto flip as a favorite on the list. I knocked out the Canchanchara at The Rum Bar BK, which miraculously had one on their menu. I got the new Chartreuse swizzle and pisco punch at the ice-obsessed Dutch Kills, which captures the Satan’s Whiskers magic as well as any bar I’ve been to in New York City. I was this close to booking a trip to Italy for the Ve.n.to, when suddenly, googling “chamomile liqueur nyc,” I came across Santi, a new Midtown Italian restaurant that just so happened to have the exact right grappa and chamomile liqueur on hand. I went there with Alina, and the bartender, Emanuel, had never heard of a Ve.n.to, but he was determined to make me one—he even went on a wild goose chase to fetch a grape from the kitchen as a garnish, before coming back with some delicious vanilla poached pears. Impeccable service, tasty drink, and cheaper than a flight to Italy. The last several drinks were more of a crawl than a sprint, many of them an exercise in explaining the recipe to a bartender in the least annoying way possible. An improvised paradise at Montréal’s Cloakroom. The very obscure Don’s special daiquiri at Paradise Lost. A Russian spring punch, a British creation I really should’ve gotten at Satan’s Whiskers, at Dear Irving. And then there was one. Let’s have a Tiki Up until this point, I had acquired every cocktail by ordering it at a bar (or a makeshift bar at a friend’s apartment). But for the 102nd and final cocktail, the IBA Tiki, that wasn’t gonna work. Too obscure, too many ingredients, rums too illegal in the United States. So I took matters into my own hands. The plan: gather all the ingredients, batch-prepare some IBA Tikis, and throw perhaps the world’s first IBA Tiki party. Incidentally, my 24th birthday was quickly approaching, so I even had an occasion for the celebration. The rums, of course, were the hard part. I can’t exactly explain what I did in a blog post, but let’s just say we were about to have some of the most faithful IBA Tikis that had ever been made in the United States. (Shoutouts to my mom and my sister, who both played instrumental roles in the operation.) The rest of the ingredients were straightforward enough. Amaretto, check. Luxardo maraschino, check. Frangelico (hazelnut liqueur, which the IBA Tiki is the only IBA official cocktail to include), check. The juices and purée and gengibre, check. All that was left was to put it all together. And so I did. On Saturday, July 12th, 2025, my 24th birthday, about 20 people gathered in a modest Brooklyn apartment. For the crowd, we prepared an industrial-sized IBA Tiki in the vessel of choice, a borg. But for my personal drink, I mixed it myself using a cocktail shaker my mom got me for my birthday, and I served it for myself in a highball glass. After carefully garnishing the cocktail (for the Wikipedia picture) and making a speech to the attendees, it was time to drink it. The IBA Tiki was great. Everyone agreed it was great. It was sweet, sour, nutty, and gingery, and we went through two full borgs of it. It may be a completely contrived recipe, and it may or may not deserve to be on the list, but one thing’s for sure: it was a fitting end to the journey. Closing time 102 cocktails, 7 states, 3 countries, and 1 surprise update later, my work here was done. But you can’t drink 102 cocktails without learning a few things along the way. One thing I learned is that the IBA official cocktail list is a weird list. But that’s probably bound to happen when you try to represent the whole world of cocktails in one list. The list might be a helpful guide for a bartender aiming to be well-rounded, but in a practical sense, for normal people just going to bars and ordering drinks, it’s not all that useful. So from my research and my interactions with dozens of bartenders, I recategorized the list into a spectrum based on name recognition and ingredient availability. It’s probably an oversimplification, and the perspective is definitely US-centric, but I think it makes for a good starting point if you’re wondering what to order: Between the Canchanchara, IBA Tiki, Spicy Fifty, Ve.n.to, and the relative obscurity of several others, you really have to be trying hard if you want to drink all 102. As far as I could find, no one else online has done so, at least not since the update that brought the IBA Tiki along. (It seems possible that someone high up at the IBA has tried one of everything, but I bet they made a lot of them themselves.) (Update after posting: it looks like some folks on Reddit have made their way through the list!) When I first embarked on this journey, I didn’t really know what I liked in a cocktail. Now I know I like bitters, and egg whites, and silky, stirred drinks on a big rock. I’ve learned I have an affinity for Porto flips and rabo de galos. And I’ve learned that Satan’s Whiskers is the best bar in the world. (I also wrote its Wikipedia page, plus ones for the Jungle Bird, the Chartreuse swizzle, and the IBA Tiki. There’s still work to be done on many of last year’s additions!) A common refrain at the IBA Tiki party was, “now that you’re done with cocktails, what’s next?” Well, I’ve gotten pretty good at drinking cocktails, but now that I have some mixology equipment, I might as well start making some. And while I’m at it, I can venture into the endless expanse of cocktails that aren’t on the IBA list. I may be done with one list, but I’ll never stop checking boxes. I’m ambiently working my way through the NYT’s 100 Best Restaurants in New York City (18/100) and their 57 Sandwiches That Define New York City (18/57). I want to visit all 50 states (42/50) and all 63 national parks (12/63). Who knows, maybe I’ll try to pet every dog breed (???/292) or learn every tune in the Real Book (???/400). But the IBA official cocktail list (102/102) is done and dusted. Until the next update, that is.",
  "image": "https://aaronson.org/assets/images/cocktail-thumbnail-tiki.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n        \u003cp\u003eThe \u003ca href=\"https://iba-world.com\"\u003eInternational Bartenders Association\u003c/a\u003e, or IBA, maintains a list of official cocktails, ones they deem to be “the most requested recipes” at bars all around the world. It’s the closest thing the bartending industry has to a canonical list of cocktails, akin to the American Kennel Club’s registry of \u003ca href=\"https://www.akc.org/dog-breeds/\"\u003edog breeds\u003c/a\u003e or a jazz musician’s \u003ca href=\"https://99percentinvisible.org/episode/the-real-book/\"\u003eReal Book\u003c/a\u003e of standards.\u003c/p\u003e\n\n\u003cp\u003eThe IBA official cocktail list is the kind of list that has \u003ca href=\"https://www.sporcle.com/games/fm_/ibacocktails\"\u003eits own Sporcle quiz\u003c/a\u003e and \u003ca href=\"https://en.wikipedia.org/wiki/List_of_IBA_official_cocktails\"\u003eits own Wikipedia article\u003c/a\u003e—an “IBA official cocktail” label even christens the top of each cocktail’s own Wikipedia infobox:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://aaronson.org/assets/images/cocktail-old-fashioned-wikipedia.png\" alt=\"Screenshot of the old fashioned (cocktail) Wikipedia page\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eAs of 2025, there are 102 IBA official cocktails, and as of July 12, 2025, \u003ca href=\"https://aaronson.org/cocktails/\"\u003eI’ve had every one of them\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eThe journey has taken me to some interesting places, and now that it’s done, I have a little story to tell for each cocktail. I’m not gonna tell you all 102 stories, but I do want to debrief the experience. Drinking all 102 cocktails turned out to be unexpectedly tricky, and for reasons you’ll soon understand, I might be one of the first people in the world to do it.\u003c/p\u003e\n\n\u003cblockquote\u003e\n  \u003ch3 id=\"-drink-responsibly\"\u003e⚠ Drink responsibly!\u003c/h3\u003e\n\n  \u003cp\u003eThis endeavor involved drinking a lot of alcohol, but I did it over the course of a few years. It’s rare that I have more than a drink or two in one night (and never have I ever blacked out from drinking).\u003c/p\u003e\n\n  \u003cp\u003eI do not recommend speedrunning the IBA official cocktail list. It’s important to know your limits, be conscious about how much you’re drinking, and drink a lot of water. If you’re struggling with an alcohol addiction, you should probably stop reading this post and \u003ca href=\"https://www.samhsa.gov/find-help/helplines/national-helpline\"\u003etalk to someone\u003c/a\u003e (if you’re outside of the US, you can find a helpline \u003ca href=\"https://findahelpline.com/topics/substance-use\"\u003ehere\u003c/a\u003e).\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003ch2 id=\"how-it-started\"\u003eHow it started\u003c/h2\u003e\n\n\u003cp\u003eI’m something of a list keeper. But it can be hard to decide when to start keeping track of things. So sometimes, I pick an arbitrary starting point that feels vaguely fateful, and I keep a list from that point on. For \u003ca href=\"https://aaronson.org/blog/full-moon-albums\"\u003ealbums\u003c/a\u003e, it was the day I got my AirPods Pro delivered. For \u003ca href=\"https://app.beliapp.com/lists/aaaronson\"\u003erestaurants\u003c/a\u003e, it was the day I moved to New York City. For cocktails, it was the day I turned 21.\u003c/p\u003e\n\n\u003cp\u003eI started a note in \u003ca href=\"https://obsidian.md\"\u003eObsidian\u003c/a\u003e called Legal Cocktails, enumerating each type of classic cocktail I had consumed since I came of age. A \u003ca href=\"https://iba-world.com/iba-cocktail/dry-martini/\"\u003edry martini\u003c/a\u003e at \u003ca href=\"https://www.5801pgh.com\"\u003e5801\u003c/a\u003e to usher in my birthday. A \u003ca href=\"https://iba-world.com/iba-cocktail/sex-on-the-beach/\"\u003esex on the beach\u003c/a\u003e on an intern dinner cruise a couple weeks later.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://aaronson.org/assets/images/cocktail-ramos-gin-fizz.png\" alt=\"Ramos gin fizz\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eOver the next couple years, Legal Cocktails grew to about 50 different drinks. Throughout my senior year at Illinois, my more epicurean friends Aidan and Christian would host a series of little get-togethers where they’d mix us drinks in their apartments, ranging from more pedestrian picks like the \u003ca href=\"https://iba-world.com/iba-cocktail/daiquiri/\"\u003edaiquiri\u003c/a\u003e and \u003ca href=\"https://iba-world.com/iba-cocktail/negroni/\"\u003enegroni\u003c/a\u003e to deeper cuts like the \u003ca href=\"https://iba-world.com/iba-cocktail/hanky-panky/\"\u003ehanky panky\u003c/a\u003e and a half-decent \u003ca href=\"https://iba-world.com/iba-cocktail/ramos-fizz/\"\u003eRamos gin fizz\u003c/a\u003e Christian made from melted butter.\u003c/p\u003e\n\n\u003cp\u003eFirst semester that year, I took a \u003ca href=\"https://staging.fshn.illinois.edu/academics/courses/FSHN343\"\u003eBeverage Management\u003c/a\u003e class, which was ostensibly about managing bars, but it was no secret that everyone took it because of its tasting component. The very last lecture focused on cocktails, and the tasting section featured an \u003ca href=\"https://iba-world.com/iba-cocktail/old-fashioned/\"\u003eold fashioned\u003c/a\u003e, \u003ca href=\"https://iba-world.com/iba-cocktail/dry-martini/\"\u003emartini\u003c/a\u003e, \u003ca href=\"https://iba-world.com/iba-cocktail/margarita/\"\u003emargarita\u003c/a\u003e, \u003ca href=\"https://iba-world.com/iba-cocktail/whiskey-sour/\"\u003ewhiskey sour\u003c/a\u003e, and the new-to-me \u003ca href=\"https://iba-world.com/iba-cocktail/planters-punch/\"\u003ePlanter’s punch\u003c/a\u003e—not bad for a college class. And through it all, I was sometimes a normal college student, drinking \u003ca href=\"https://iba-world.com/iba-cocktail/long-island-iced-tea/\"\u003eLong Island iced teas\u003c/a\u003e at Legends happy hour and shitty \u003ca href=\"https://iba-world.com/iba-cocktail/tequila-sunrise/\"\u003etequila sunrises\u003c/a\u003e at Red Lion (I regret to inform you I deemed the Kams \u003ca href=\"https://dailyillini.com/buzz-stories/best-of-cu/2022/11/05/best-drink-blue-guy/\"\u003eBlue Guy\u003c/a\u003e too proprietary for my list).\u003c/p\u003e\n\n\u003cp\u003eSome time after graduating and moving to New York City, I began to reckon with Legal Cocktails. What really counted as a “classic” cocktail? Where do I draw the line? It felt a little arbitrary. So on May 9, 2024, I decided to retcon the list into a checklist, and nix the “legal” requirement (something something statute of limitations). I had heard of the IBA official cocktail list from my time on Sporcle and Wikipedia, so it seemed like as good a list as any to base mine on.\u003c/p\u003e\n\n\u003cp\u003eAt that point, there were 89 IBA official cocktails, and I had tried 33 of them (a bunch of the ones on Legal Cocktails weren’t IBA official, like the Jägerbomb and, weirdly, the amaretto sour). One thing was for sure: I had a lot of drinking to do.\u003c/p\u003e\n\n\u003ch2 id=\"anatomy-of-a-list\"\u003eAnatomy of a list\u003c/h2\u003e\n\n\u003cp\u003e\u003cimg src=\"https://aaronson.org/assets/images/cocktail-zola.png\" alt=\"Angelo Zola\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eThe IBA official cocktail list has existed for over 60 years. It was first proposed in Paris in 1960 by bartender and IBA \u003ca href=\"https://iba-world.com/iba/about-us/\"\u003efounding member\u003c/a\u003e Angelo Zola, who felt the need to standardize the mess of cocktail recipes that differed depending on which bartender you asked. Zola assembled a committee within the IBA, and together, they decided on a set of cocktails that best represented the most important recipes served around the world.\u003c/p\u003e\n\n\u003cp\u003eThe following year in Oslo, Zola’s vision became a reality, and the inaugural list was unveiled. It comprised \u003ca href=\"https://en.wikipedia.org/wiki/List_of_IBA_official_cocktails#1961\"\u003e50 cocktails\u003c/a\u003e, many of which remain on the list today, but some of which (like the \u003ca href=\"https://www.diffordsguide.com/cocktails/recipe/2123/zaza\"\u003ezaza\u003c/a\u003e) have gone by the wayside. That’s because the list has gone through big revisions every 10 years or so, with the IBA adding drinks they deem newly relevant and removing ones that have fallen out of fashion. (The 89-cocktail list I based my checklist on was established in the 2020 update.)\u003c/p\u003e\n\n\u003cp\u003eThere are many ways one might organize a list of cocktails, but the IBA chooses to group them into three categories: the \u003ca href=\"https://iba-world.com/cocktails/the-unforgettables/\"\u003eUnforgettables\u003c/a\u003e (these are all-time classics, like the \u003ca href=\"https://iba-world.com/iba-cocktail/manhattan/\"\u003eManhattan\u003c/a\u003e and the uhhh \u003ca href=\"https://iba-world.com/iba-cocktail/monkey-gland/\"\u003emonkey gland\u003c/a\u003e), the \u003ca href=\"https://iba-world.com/cocktails/the-contemporary/\"\u003eContemporary\u003c/a\u003e (these are newer, but have solidified classic status, like the \u003ca href=\"https://iba-world.com/iba-cocktail/mai-tai/\"\u003eMai Tai\u003c/a\u003e and the \u003ca href=\"https://iba-world.com/iba-cocktail/moscow-mule/\"\u003eMoscow mule\u003c/a\u003e), and the \u003ca href=\"https://iba-world.com/cocktails/the-new-era/\"\u003eNew Era\u003c/a\u003e (these are rising stars invented in the late 20th or early 21st century, like the \u003ca href=\"https://iba-world.com/iba-cocktail/espresso-martini/\"\u003eespresso martini\u003c/a\u003e and the \u003ca href=\"https://iba-world.com/iba-cocktail/paper-plane/\"\u003epaper plane\u003c/a\u003e).\u003c/p\u003e\n\n\u003cp\u003eMost of the list comprises pretty normal cocktails that a good bartender would recognize. But some immediately struck me as esoteric, or hard to obtain for one reason or another—like the \u003ca href=\"https://iba-world.com/iba-cocktail/canchanchara/\"\u003eCanchanchara\u003c/a\u003e, which calls for Cuban \u003ca href=\"https://en.wikipedia.org/wiki/Aguardiente\"\u003eaguardiente\u003c/a\u003e; the \u003ca href=\"https://iba-world.com/iba-cocktail/spicy-fifty/\"\u003eSpicy Fifty\u003c/a\u003e, an oddly specific recipe with red chili pepper in it; and what I saw as the final boss of the list, the \u003ca href=\"https://iba-world.com/iba-cocktail/ve-n-to/\"\u003eVe.n.to\u003c/a\u003e, with its arcanely formatted name and a recipe centered on \u003ca href=\"https://en.wikipedia.org/wiki/Grappa\"\u003egrappa\u003c/a\u003e and a hyper-specialized “chamomile cordial.” All of them, nonetheless, had a Wikipedia page (no matter how \u003ca href=\"https://en.wikipedia.org/wiki/Ve.n.to\"\u003esmall\u003c/a\u003e), their inclusion on the list alone serving as a badge of legitimacy.\u003c/p\u003e\n\n\u003cp\u003eI was slightly convinced the Ve.n.to was planted on the list by Big Grappa, and as far as I could tell, it was only served at \u003ca href=\"https://rivabar.it\"\u003eone bar\u003c/a\u003e in middle-of-nowhere Italy (the Spicy Fifty, \u003ca href=\"https://www.corinthia.com/en-gb/london/restaurants-bars/velvet-by-salvatore-calabrese/\"\u003eone\u003c/a\u003e in London). But I had a list to complete, and nothing was gonna stop me.\u003c/p\u003e\n\n\u003ch2 id=\"smooth-sailing\"\u003eSmooth sailing\u003c/h2\u003e\n\n\u003cp\u003eFor a while, checking cocktails off the list was easy. It was just a matter of going to bars and restaurants (which, like any other yuppie, I was already doing), scanning the menu, and hoping to find a classic cocktail I hadn’t yet tried. A \u003ca href=\"https://iba-world.com/iba-cocktail/boulevardier/\"\u003eboulevardier\u003c/a\u003e at \u003ca href=\"https://kellysbarlounge.com\"\u003eKelly’s\u003c/a\u003e. A \u003ca href=\"https://iba-world.com/iba-cocktail/champagne-cocktail/\"\u003eChampagne cocktail\u003c/a\u003e at \u003ca href=\"https://www.timeout.com/newyork/bars/antler-beer-wine-dispensary\"\u003eAntler\u003c/a\u003e (one of my early favorites, a nice blend of bitters and bubbles).\u003c/p\u003e\n\n\u003cp\u003eA formative moment early in the quest came at \u003ca href=\"https://www.timeout.com/newyork/bars/uncle-charlies-piano-bar-and-lounge\"\u003eUncle Charlie’s Piano Lounge\u003c/a\u003e in Midtown with Ming and Alina. A divey gay bar with no menu? Sounded like a perfect opportunity to check off some drinks! I scanned through my list to find something simple to try and order, went up to a mustachioed bartender, and asked, “could you do a \u003ca href=\"https://iba-world.com/iba-cocktail/caipirinha/\"\u003ecaipirinha\u003c/a\u003e?” He replied, “nah, we don’t have cachaça”—a reality check—and I said, “alright, I’ll just do uhhh an \u003ca href=\"https://iba-world.com/iba-cocktail/spritz/\"\u003eAperol spritz\u003c/a\u003e” (one of my old reliables).\u003c/p\u003e\n\n\u003cp\u003eAfter crushing my spritz, I went back to the same bartender. Still determined to check some boxes, I asked for a \u003ca href=\"https://iba-world.com/iba-cocktail/mint-julep/\"\u003emint julep\u003c/a\u003e. “I’m afraid we don’t have mint,” he laughed, “you fancy boy!” Unwilling to settle for another spritz, I scurried back to Ming and Alina and asked them what to do. Alina suggested, “why don’t you just show him the list and see what he can make?”\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://aaronson.org/assets/images/cocktail-new-york-sour.jpg\" alt=\"Lemon drop martini\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eSo that’s exactly what I did. Back at the bar, I briefly explained my mission to the bartender, handed him my phone, and he scrolled through the list. “Oh, I can do a few of these,” he said, “You’re cool with any of them?” “Yeah, whatever you can make,” I replied. Soon enough, I had a \u003ca href=\"https://iba-world.com/iba-cocktail/lemon-drop-martini/\"\u003elemon drop martini\u003c/a\u003e in hand. (Alina tried mine and then ordered one for herself, but the bartender asked her, “Is that for your friend or you? If it’s for your friend I’ll make him something new!”)\u003c/p\u003e\n\n\u003cp\u003eAfter gleefully finishing the lemon drop (and singing “Y.M.C.A.” at the mic), I returned to the bar one last time. The bartender greeted me, “What’s next for you, fancy?” I handed him my phone again, told him to “surprise me,” and emerged with a \u003ca href=\"https://iba-world.com/iba-cocktail/new-york-sour/\"\u003eNew York sour\u003c/a\u003e, which he explained was basically a whiskey sour with a red wine float. Sometimes all you have to do is ask.\u003c/p\u003e\n\n\u003cp\u003eOn our way out that night, the bartender bade me farewell—”bye, fancy!”—and I had a new favorite service experience of my life.\u003c/p\u003e\n\n\u003cblockquote\u003e\n  \u003ch3 id=\"monkeying-around\"\u003eMonkeying around\u003c/h3\u003e\n\n  \u003cp\u003eThe \u003ca href=\"https://iba-world.com/iba-cocktail/monkey-gland/\"\u003emonkey gland\u003c/a\u003e, that one odd duck in the Unforgettables section, was my white whale for a while. Obscure even to a seasoned bartender, it taught me that you can’t go ordering every drink on the list willy-nilly. At another dive, my friend Michael went up to the bar and asked point-blank, “two monkey glands, please!” You could imagine the bartender’s confusion.\u003c/p\u003e\n\n  \u003cp\u003eA month or so later, at \u003ca href=\"https://www.gageandtollner.com\"\u003eGage \u0026amp; Tollner\u003c/a\u003e with fellow cocktail enjoyer Malaika, we were bantering with the bartender about my list. He had also never heard of the monkey gland, but he was curious, so we explained it to him, and the conversation moved on.\u003c/p\u003e\n\n  \u003cp\u003eJust as my \u003ca href=\"https://iba-world.com/iba-cocktail/rusty-nail/\"\u003erusty nail\u003c/a\u003e and Malaika’s \u003ca href=\"https://iba-world.com/iba-cocktail/french-75/\"\u003eFrench 75\u003c/a\u003e neared completion, the bartender plopped down two cocktail glasses in front of us, each half-filled with a pinkish-orange liquid. “Two monkey glands,” he declared.\u003c/p\u003e\n\n  \u003cp\u003eThey were pretty good—the orange and anise flavors complemented each other surprisingly nicely, but also, they were free, which makes everything taste better.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003ch2 id=\"london-calling\"\u003eLondon calling\u003c/h2\u003e\n\n\u003cp\u003eI kept cruising through the list. A \u003ca href=\"https://iba-world.com/iba-cocktail/naked-and-famous/\"\u003enaked and famous\u003c/a\u003e at \u003ca href=\"https://www.deathandcompany.com\"\u003eDeath \u0026amp; Co.\u003c/a\u003e (where the naked and famous was invented). A \u003ca href=\"https://iba-world.com/iba-cocktail/clover-club/\"\u003eClover Club\u003c/a\u003e at the \u003ca href=\"https://www.cloverclubny.com\"\u003eClover Club\u003c/a\u003e (where, I learned, the Clover Club was in fact not invented).\u003c/p\u003e\n\n\u003cp\u003eThen in November, I was \u003ca href=\"https://docs.google.com/document/d/1-x73efjvoFPIvjjWFUphEhH6h3jbkFeOupUEm5Iirtk/edit?tab=t.0#heading=h.zbrm5kdh01ne\"\u003ein London\u003c/a\u003e for a two-week work trip. This would mark a significant turning point in my journey, for multiple reasons.\u003c/p\u003e\n\n\u003cp\u003eFor one, I was able to check off the \u003ca href=\"https://iba-world.com/iba-cocktail/spicy-fifty/\"\u003eSpicy Fifty\u003c/a\u003e, one of the list’s most perplexing inclusions, by going to creator Salvatore Calabrese’s own \u003ca href=\"https://www.corinthia.com/en-gb/london/restaurants-bars/velvet-by-salvatore-calabrese/\"\u003eVelvet\u003c/a\u003e bar at the Corinthia hotel, seemingly the only place in the world where it’s served. The bar was truly posh—before I had my drink (which was great, though I kinda wished it was spicier), I was greeted with a complimentary tray of candied almonds, olives, and blue corn flatbread. But this luxury was juxtaposed with an extremely cursed cocktail menu, featuring an AI-generated image for each drink (and one AI-generated Nelson Mandela quote):\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://aaronson.org/assets/images/cocktail-spicy-fifty.png\" alt=\"Spicy Fifty\"/\u003e\n    \u003cimg src=\"https://aaronson.org/assets/images/cocktail-nelson-mandela.png\" alt=\"Cursed cocktail menu\"/\u003e\n\u003c/p\u003e\n\n\u003cp\u003eI hit up the \u003ca href=\"https://www.thesavoylondon.com/restaurant/american-bar/\"\u003eAmerican Bar\u003c/a\u003e at the Savoy Hotel, London’s oldest extant cocktail bar, for an \u003ca href=\"https://iba-world.com/iba-cocktail/angel-face/\"\u003eangel face\u003c/a\u003e (which was invented there) and a painstakingly garnished \u003ca href=\"https://iba-world.com/iba-cocktail/horses-neck/\"\u003ehorse’s neck\u003c/a\u003e. I got a \u003ca href=\"https://iba-world.com/iba-cocktail/corpse-reviver/\"\u003ecorpse reviver #2\u003c/a\u003e at the confusingly similarly named \u003ca href=\"https://www.brasseriezedel.com/bar-americain/\"\u003eBar Américain\u003c/a\u003e. Turns out “American bar” just means a cocktail bar, as opposed to the city’s many beer-centric pubs, because cocktails are an American invention. That’s what I call a cultural victory.\u003c/p\u003e\n\n\u003cp\u003eBut the most important bar on this whole journey, and my new favorite bar in the world, was \u003ca href=\"https://www.satanswhiskers.com\"\u003eSatan’s Whiskers\u003c/a\u003e in London’s Bethnal Green neighborhood. I went there on a whim, per Malaika’s recommendation, not realizing it would be a godsend for someone trying to complete this list.\u003c/p\u003e\n\n\u003cp\u003eThe thing about Satan’s Whiskers is that their printed menu, focused on classic and modern classic cocktails, completely changes every day. This means the bartenders have an encyclopedic knowledge of the cocktail canon, and they have the ingredients on hand to make any of the \u003ca href=\"https://classbarmag.com/news/fullstory.php/aid/1271/Mastering_the_bar_experience%3A_Kevin_Armstrong_on_ten_years_of_Satan_s_Whiskers_.html\"\u003e900 drinks\u003c/a\u003e they rotate between.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://aaronson.org/assets/images/cocktail-brandy-crusta.jpg\" alt=\"Brandy crusta\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eAt first, I scanned the menu and didn’t see anything I needed for the list, so I panic-ordered a Jungle Bird (which wasn’t on the list, but I had heard of it—it was great). Then I decided to venture off the day’s menu: “Do you know a… \u003ca href=\"https://iba-world.com/iba-cocktail/brandy-crusta/\"\u003ebrandy crusta\u003c/a\u003e?” Without hesitation, the bartender Ollie said, “sure, I can do that!” and confirmed I wanted a sugared rim. Next, I had a \u003ca href=\"https://iba-world.com/iba-cocktail/tipperary/\"\u003eTipperary\u003c/a\u003e, which he explained was an odd flavor combination that they’d only really list on their menu on an unpopular day (Mia, another bartender walking by, chimed in, “Tipperary Tuesdays!”). I capped off the night with an \u003ca href=\"https://iba-world.com/iba-cocktail/alexander/\"\u003eAlexander\u003c/a\u003e—​“gin or brandy?”—a brandy Alexander, which made for a perfect dessert cocktail. It all felt unreal, like a bar created in a lab for the sole purpose of me finishing this list.\u003c/p\u003e\n\n\u003ch2 id=\"a-spanner-in-the-works\"\u003eA spanner in the works\u003c/h2\u003e\n\n\u003cp\u003eA couple days later, I was checking in on the \u003ca href=\"https://iba-world.com/cocktails/all-cocktails/\"\u003eIBA official cocktail list website\u003c/a\u003e, and I could not believe my eyes. There were new cocktails on the list.\u003c/p\u003e\n\n\u003cp\u003eIt felt like a bad dream. Still in an unfamiliar city, having just been to this magical bar, now confronted with these freaky new cocktail names on a list I had grown so accustomed to. Wasn’t the last update only a few years ago? (Since then, I’ve had several actual nightmares of the IBA adding anywhere from a few to a few hundred new drinks to the list.)\u003c/p\u003e\n\n\u003cp\u003eTo be precise, there were now 102 IBA official cocktails, up from the previous 89. 3 had been removed from the list (including the \u003ca href=\"https://en.wikipedia.org/wiki/Golden_dream_(cocktail)\"\u003egolden dream\u003c/a\u003e, which I had gotten at \u003ca href=\"https://attaboy.us/visit-us\"\u003eAttaboy\u003c/a\u003e, \u003ca href=\"https://x.com/aaaronson/status/1856741386629861387\"\u003elong live\u003c/a\u003e the golden dream), and 16 new ones were added (including the \u003ca href=\"https://iba-world.com/iba-cocktail/jungle-bird/\"\u003eJungle Bird\u003c/a\u003e I had just had at Satan’s Whiskers, nice). I coped by \u003ca href=\"https://x.com/aaaronson/status/1856704599253488034\"\u003etweeting\u003c/a\u003e through it, seemingly the first person on the internet to discover the update.\u003c/p\u003e\n\n\u003cblockquote\u003e\n  \u003cp\u003eIn reality, and I only learned this several months later, the day I discovered the update was the \u003ca href=\"https://web.archive.org/web/20250000000000*/https://iba-world.com/cocktails/all-cocktails/\"\u003eexact same day\u003c/a\u003e it was added to the IBA website. What I didn’t know was that there had been \u003ca href=\"https://www.italiaatavola.net/wine/2024/3/29/enuova-lista-iba-101-cocktail-storia-tips-video-ricette-tutte-novita/104238/\"\u003enews articles\u003c/a\u003e about the update 8 months earlier, but they were all in Italian because the update coincided with a new \u003ca href=\"https://www.instagram.com/p/C5g48h5L-Qv/?hl=en\u0026amp;img_index=1\"\u003e\u003cem\u003e101 IBA Cocktails\u003c/em\u003e\u003c/a\u003e book, published exclusively in Italian for whatever reason (the book inexplicably leaves out the \u003ca href=\"https://iba-world.com/iba-cocktail/fernandito/\"\u003efernandito\u003c/a\u003e, fernet and Coke, maybe because 101 sounds more fun than 102).\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eIt was no longer true that every IBA official cocktail had its own Wikipedia page. A few of the new ones did, like the \u003ca href=\"https://iba-world.com/iba-cocktail/sherry-cobbler/\"\u003esherry cobbler\u003c/a\u003e, the \u003ca href=\"https://iba-world.com/iba-cocktail/porn-star-martini/\"\u003eporn star martini\u003c/a\u003e, and the \u003ca href=\"https://iba-world.com/iba-cocktail/south-side/\"\u003eSouth Side\u003c/a\u003e (which had previously been added and removed from the list), but now the list was sprinkled with \u003ca href=\"https://en.wikipedia.org/wiki/Wikipedia:Red_link\"\u003ered links\u003c/a\u003e. Most of the new ones were pretty legit modern classics, but one stuck out like a sore thumb.\u003c/p\u003e\n\n\u003cp\u003eIt was called, bafflingly, the \u003ca href=\"https://iba-world.com/iba-cocktail/iba-tiki/\"\u003eIBA Tiki\u003c/a\u003e. A Google search revealed almost no information about it. Its recipe had 9 ingredients, including \u003cem\u003egengibre\u003c/em\u003e (just Portuguese for \u003cem\u003eginger\u003c/em\u003e) and two specific \u003ca href=\"https://en.wikipedia.org/wiki/Havana_Club\"\u003eHavana Club\u003c/a\u003e rums, which are illegal in the United States thanks to Cuban sanctions. Step aside, Ve.n.to, there’s a new final boss in town.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://aaronson.org/assets/images/cocktail-iba-tiki.png\" alt=\"IBA Tiki\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eI later learned that the drink’s recipe was commissioned by the IBA for their 2022 World Cocktail Championship, which was held in Cuba and, naturally, sponsored by Havana Club. For some reason, they saw fit to make it cocktail number 101 in their \u003cem\u003e101 IBA Cocktails\u003c/em\u003e book, and now it’s forever enshrined in cocktail history.\u003c/p\u003e\n\n\u003cp\u003e***\u003c/p\u003e\n\n\u003cp\u003eThat night, I did the only thing I could do, and I went back to Satan’s Whiskers. In fact, I ended up going there four nights that week, checking off an obscene 13 cocktails within their taxidermied walls. The bartenders had, obviously, never heard of the IBA Tiki (and didn’t have those rums on hand), but they knew plenty of the other new additions off the dome.\u003c/p\u003e\n\n\u003cp\u003eIt was also there that I discovered my love for the \u003ca href=\"https://iba-world.com/iba-cocktail/porto-flip/\"\u003ePorto flip\u003c/a\u003e, the only IBA official cocktail to contain egg \u003cem\u003eyolk\u003c/em\u003e. I wasn’t sure if Satan’s Whiskers would be able to make one, but Mia’s face lit up when I ordered it—she had a soft spot for flips, and once I took a few sips, I knew it was one of my new favorites too. (On the \u003ca href=\"https://www.sporcle.com/games/fm_/ibacocktails/results\"\u003eSporcle quiz\u003c/a\u003e, the Porto flip currently sits as the single least-guessed IBA official cocktail.)\u003c/p\u003e\n\n\u003cp\u003eI left London with a new favorite cocktail, a new favorite bar, and a napkin listing 6 bars Mia recommended in NYC.\u003c/p\u003e\n\n\u003cp\u003e82 down, 20 to go.\u003c/p\u003e\n\n\u003ch2 id=\"the-final-stretch\"\u003eThe final stretch\u003c/h2\u003e\n\n\u003cp\u003eAt this point, it was exceedingly unlikely to stumble upon the remaining cocktails on a bar menu. It was now a matter of seeking out particular bars that offered each drink, or failing that, going to really good bars and hoping they could whip one up.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://aaronson.org/assets/images/cocktail-rabo-de-galo.png\" alt=\"Rabo de galo\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eSuch was the case with one new addition, the Brazilian \u003ca href=\"https://iba-world.com/iba-cocktail/rabo-de-galo/\"\u003erabo de galo\u003c/a\u003e (literally “tail of the cock,” or “cocktail”), which I ordered off-menu at the bitters bar \u003ca href=\"https://www.amoryamargo.com\"\u003eAmor y Amargo\u003c/a\u003e to excellent effect—I’ve since had two more of them at actual Brazilian restaurant \u003ca href=\"https://www.berimbaunyc.com\"\u003eBerimbau\u003c/a\u003e, and I’d easily place it next to the Porto flip as a favorite on the list.\u003c/p\u003e\n\n\u003cp\u003eI knocked out the \u003ca href=\"https://iba-world.com/iba-cocktail/canchanchara/\"\u003eCanchanchara\u003c/a\u003e at \u003ca href=\"http://www.therumbarbk.com\"\u003eThe Rum Bar BK\u003c/a\u003e, which miraculously had one on their menu. I got the new \u003ca href=\"https://iba-world.com/iba-cocktail/chartreuse-swizzle/\"\u003eChartreuse swizzle\u003c/a\u003e and \u003ca href=\"https://iba-world.com/iba-cocktail/pisco-punch/\"\u003episco punch\u003c/a\u003e at the ice-obsessed \u003ca href=\"https://www.dutchkillsbar.com\"\u003eDutch Kills\u003c/a\u003e, which captures the Satan’s Whiskers magic as well as any bar I’ve been to in New York City.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://aaronson.org/assets/images/cocktail-vento.png\" alt=\"Ve.n.to\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eI was \u003cem\u003ethis\u003c/em\u003e close to booking a trip to Italy for the \u003ca href=\"https://iba-world.com/iba-cocktail/ve-n-to/\"\u003eVe.n.to\u003c/a\u003e, when suddenly, googling “chamomile liqueur nyc,” I came across \u003ca href=\"https://www.santinyc.com\"\u003eSanti\u003c/a\u003e, a new Midtown Italian restaurant that just so happened to have the exact right grappa and chamomile liqueur on hand. I went there with Alina, and the bartender, Emanuel, had never heard of a Ve.n.to, but he was \u003cem\u003edetermined\u003c/em\u003e to make me one—he even went on a wild goose chase to fetch a grape from the kitchen as a garnish, before coming back with some delicious vanilla poached pears. Impeccable service, tasty drink, and cheaper than a flight to Italy.\u003c/p\u003e\n\n\u003cp\u003eThe last several drinks were more of a crawl than a sprint, many of them an exercise in explaining the recipe to a bartender in the least annoying way possible. An improvised \u003ca href=\"https://iba-world.com/iba-cocktail/paradise/\"\u003eparadise\u003c/a\u003e at Montréal’s \u003ca href=\"https://www.cloakroombarmtl.com\"\u003eCloakroom\u003c/a\u003e. The very obscure \u003ca href=\"https://iba-world.com/iba-cocktail/dons-special-daiquiri/\"\u003eDon’s special daiquiri\u003c/a\u003e at \u003ca href=\"https://www.paradiselost.nyc\"\u003eParadise Lost\u003c/a\u003e. A \u003ca href=\"https://iba-world.com/iba-cocktail/russian-spring-punch/\"\u003eRussian spring punch\u003c/a\u003e, a British creation I really should’ve gotten at Satan’s Whiskers, at \u003ca href=\"https://www.dearirving.com\"\u003eDear Irving\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eAnd then there was one.\u003c/p\u003e\n\n\u003ch2 id=\"lets-have-a-tiki\"\u003eLet’s have a Tiki\u003c/h2\u003e\n\n\u003cp\u003eUp until this point, I had acquired every cocktail by ordering it at a bar (or a makeshift bar at a friend’s apartment). But for the 102nd and final cocktail, the \u003ca href=\"https://iba-world.com/iba-cocktail/iba-tiki/\"\u003eIBA Tiki\u003c/a\u003e, that wasn’t gonna work. Too obscure, too many ingredients, rums too illegal in the United States. So I took matters into my own hands.\u003c/p\u003e\n\n\u003cp\u003eThe plan: gather all the ingredients, batch-prepare some IBA Tikis, and throw perhaps the world’s first IBA Tiki party. Incidentally, my 24th birthday was quickly approaching, so I even had an occasion for the celebration.\u003c/p\u003e\n\n\u003cp\u003eThe rums, of course, were the hard part. I can’t exactly explain what I did in a blog post, but let’s just say we were about to have some of the most faithful IBA Tikis that had ever been made in the United States. (Shoutouts to my mom and my sister, who both played instrumental roles in the operation.)\u003c/p\u003e\n\n\u003cp\u003eThe rest of the ingredients were straightforward enough. \u003ca href=\"https://en.wikipedia.org/wiki/Amaretto\"\u003eAmaretto\u003c/a\u003e, check. \u003ca href=\"https://en.wikipedia.org/wiki/Girolamo_Luxardo\"\u003eLuxardo maraschino\u003c/a\u003e, check. \u003ca href=\"https://en.wikipedia.org/wiki/Frangelico\"\u003eFrangelico\u003c/a\u003e (hazelnut liqueur, which the IBA Tiki is the only IBA official cocktail to include), check. The juices and purée and \u003cem\u003egengibre\u003c/em\u003e, check. All that was left was to put it all together.\u003c/p\u003e\n\n\u003cp\u003eAnd so I did. On Saturday, July 12th, 2025, my 24th birthday, about 20 people gathered in a modest Brooklyn apartment. For the crowd, we prepared an industrial-sized IBA Tiki in the vessel of choice, a \u003ca href=\"https://en.wikipedia.org/wiki/Borg_(drink)\"\u003eborg\u003c/a\u003e. But for my personal drink, I mixed it myself using a cocktail shaker my mom got me for my birthday, and I served it for myself in a highball glass. After carefully garnishing the cocktail (for the Wikipedia picture) and making a speech to the attendees, it was time to drink it.\u003c/p\u003e\n\n\u003cp\u003eThe IBA Tiki was great. Everyone agreed it was great. It was sweet, sour, nutty, and gingery, and we went through two full borgs of it. It may be a completely contrived recipe, and it may or may not deserve to be on the list, but one thing’s for sure: it was a fitting end to the journey.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://aaronson.org/assets/images/cocktail-iba-tiki-portrait.png\" alt=\"The completed IBA Tiki\"/\u003e\n    \u003cimg src=\"https://aaronson.org/assets/images/cocktail-iba-tiki-borg.png\" alt=\"The IBA Tiki borg\"/\u003e\n\u003c/p\u003e\n\n\u003ch2 id=\"closing-time\"\u003eClosing time\u003c/h2\u003e\n\n\u003cp\u003e102 cocktails, 7 states, 3 countries, and 1 surprise update later, my work here was done. But you can’t drink 102 cocktails without learning a few things along the way.\u003c/p\u003e\n\n\u003cp\u003eOne thing I learned is that the IBA official cocktail list is a weird list. But that’s probably bound to happen when you try to represent the whole world of cocktails in one list. The list might be a helpful guide for a bartender aiming to be well-rounded, but in a practical sense, for normal people just going to bars and ordering drinks, it’s not all that useful.\u003c/p\u003e\n\n\u003cp\u003eSo from my research and my interactions with dozens of bartenders, I recategorized the list into a spectrum based on name recognition and ingredient availability. It’s probably an oversimplification, and the perspective is definitely US-centric, but I think it makes for a good starting point if you’re wondering what to order:\u003c/p\u003e\n\n\n\n\u003cp\u003eBetween the \u003ca href=\"https://iba-world.com/iba-cocktail/canchanchara/\"\u003eCanchanchara\u003c/a\u003e, \u003ca href=\"https://iba-world.com/iba-cocktail/iba-tiki/\"\u003eIBA Tiki\u003c/a\u003e, \u003ca href=\"https://iba-world.com/iba-cocktail/spicy-fifty/\"\u003eSpicy Fifty\u003c/a\u003e, \u003ca href=\"https://iba-world.com/iba-cocktail/ve-n-to/\"\u003eVe.n.to\u003c/a\u003e, and the relative obscurity of several others, you really have to be trying hard if you want to drink all 102. As far as I could find, no one else online has done so, at least not since the update that brought the IBA Tiki along. (It seems possible that someone high up at the IBA has tried one of everything, but I bet they made a lot of them themselves.) (Update after posting: it looks like \u003ca href=\"https://www.reddit.com/r/cocktails/comments/1m7ch2v/i_drank_all_102_iba_official_cocktails/\"\u003esome folks on Reddit\u003c/a\u003e have made their way through the list!)\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://aaronson.org/assets/images/cocktail-satans-whiskers-2.png\" alt=\"Satan\u0026#39;s Whiskers Wikipedia infobox\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eWhen I first embarked on this journey, I didn’t really know what I liked in a cocktail. Now I know I like bitters, and egg whites, and silky, stirred drinks on a big rock. I’ve learned I have an affinity for \u003ca href=\"https://iba-world.com/iba-cocktail/porto-flip/\"\u003ePorto flips\u003c/a\u003e and \u003ca href=\"https://iba-world.com/iba-cocktail/rabo-de-galo/\"\u003erabo de galos\u003c/a\u003e. And I’ve learned that Satan’s Whiskers is the best bar in the world. (I also wrote \u003ca href=\"https://en.wikipedia.org/wiki/Satan%27s_Whiskers\"\u003eits Wikipedia page\u003c/a\u003e, plus ones for the \u003ca href=\"https://en.wikipedia.org/wiki/Jungle_Bird\"\u003eJungle Bird\u003c/a\u003e, the \u003ca href=\"https://en.wikipedia.org/wiki/Chartreuse_swizzle\"\u003eChartreuse swizzle\u003c/a\u003e, and the \u003ca href=\"https://en.wikipedia.org/wiki/IBA_Tiki\"\u003eIBA Tiki\u003c/a\u003e. There’s still work to be done on many of last year’s additions!)\u003c/p\u003e\n\n\u003cp\u003eA common refrain at the IBA Tiki party was, “now that you’re done with cocktails, what’s next?” Well, I’ve gotten pretty good at \u003cem\u003edrinking\u003c/em\u003e cocktails, but now that I have some mixology equipment, I might as well start making some. And while I’m at it, I can venture into the endless expanse of cocktails that \u003cem\u003earen’t\u003c/em\u003e on the IBA list.\u003c/p\u003e\n\n\u003cp\u003eI may be done with one list, but I’ll never stop checking boxes. I’m ambiently working my way through the NYT’s \u003ca href=\"https://www.nytimes.com/interactive/2025/dining/best-nyc-restaurants.html\"\u003e100 Best Restaurants in New York City\u003c/a\u003e (18/100) and their \u003ca href=\"https://www.nytimes.com/interactive/2024/dining/best-nyc-sandwiches.html\"\u003e57 Sandwiches That Define New York City\u003c/a\u003e (18/57). I want to visit all 50 states (42/50) and all 63 national parks (12/63). Who knows, maybe I’ll try to pet every dog breed (???/292) or learn every tune in the Real Book (???/400).\u003c/p\u003e\n\n\u003cp\u003eBut the IBA official cocktail list (102/102) is done and dusted. Until the next update, that is.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://aaronson.org/assets/images/cocktail-me.jpg\" alt=\"Me holding an IBA Tiki\"/\u003e\u003c/p\u003e\n\n        \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "24 min read",
  "publishedTime": "2025-07-23T00:00:00Z",
  "modifiedTime": null
}
