{
  "id": "4e0201e4-2051-4994-884e-5c75600beeb9",
  "title": "In the News: Small Business and Generative AI Technology After 2 Years",
  "link": "https://smallbiztrends.com/small-business-news-generative-ai-small-business-2-year-anniversary/",
  "description": "…",
  "author": "Small Business Editor",
  "published": "Sat, 19 Oct 2024 21:47:19 +0000",
  "source": "https://feeds2.feedburner.com/SmallBusinessTrends",
  "categories": [
    "Small Business News"
  ],
  "byline": "Small Business Editor",
  "length": 5755,
  "excerpt": "…",
  "siteName": "Small Business Trends",
  "favicon": "",
  "text": "It’s been about two years since small businesses first got their collective hands on generative AI technology. And quite a lot has changed in  that time. But two years into this era, if you will, what has really changed? And has AI really changed small business?Our panel of small business experts discuss this and other hot topics in this week’s episode of Small Business Breakdown.Small Business News Roundup – Oct. 18, 2024Here’s the rest of this week’s headlines that matter most to small business owners, solopreneurs, and more …TikTok Unveils New Performance Advertising Solutions to Help Brands Drive Business ResultsTikTok introduced a suite of new performance advertising solutions aimed at helping brands achieve tangible business results. As TikTok continues to grow with over 1 billion users worldwide, these new tools focus on automation, enhanced measurement capabilities, and improved privacy technologies to support advertisers. “TikTok is building for the future.From Living in Foster Homes to Making a FortuneI am always amazed about the resiliency of people in their lives and their companies. On this week’s episode of The Small Business Radio I talked with an executive that has an amazing story, At the age of 3, Ed Hajim is kidnapped by his father, driven cross-country, and told his mother is dead.Snapchat Introduces Sponsored Snaps and Promoted Places for AdvertisersSnapchat has announced the launch of two new advertising placements: Sponsored Snaps and Promoted Places. These new features are being introduced with launch partners Disney, McDonald’s, and Taco Bell, and are designed to help businesses engage with Snapchat’s community in new, innovative ways.Connecticut Fisherman Sentenced to Prison for Tax Evasion on $1.2M in IncomeA Connecticut man was sentenced today to one year and one day in prison for evading federal income taxes on more than $1.2 million he earned from commercial fishing in Massachusetts. According to court documents and statements made in court, Brian Kobus, of Durham, Connecticut, worked as a commercial fisherman and deckhand for various fishing companies.SBA Exhausts Funds for New Disaster Loans, Urges Continued Applications as Agency Awaits Additional FundingThe U.S. Small Business Administration (SBA) announced today that it has exhausted available funds for its disaster loan program due to the high demand for financial relief following Hurricane Helene. As a result, the SBA is pausing new loan offers for its low-interest, long-term disaster loans until Congress appropriates additional funding.Dropbox Introduces Dash for BusinessDropbox announced the launch of Dash for Business, an AI-powered universal search tool designed to help teams efficiently search, organize, share, and protect content across various connected apps. Dash for Business provides businesses of all sizes with advanced content access control, streamlining their ability to manage and secure data across platforms.Apple Introduces New iPad Mini with A17 Pro Chip and Apple IntelligenceApple today unveiled the new iPad mini, featuring the powerful A17 Pro chip and support for Apple Intelligence. Designed for portability and performance, the new iPad mini offers users a versatile experience with a stunning 8.3-inch Liquid Retina display and all-day battery life.DHL Express Announces 2025 Price Adjustments for U.S. CustomersSmall businesses and entrepreneurs who use DHL Express to ship packages can expect to pay a bit more for that service at the beginning of next year. DHL Express has announced a 5.9% general average shipment price increase for U.S. account holders, effective January 1, 2025. In addition to the price adjustment, a limited number of services and surcharges will also be modified.Venmo Introduces New Feature to Schedule Payments and RequestsVenmo recently announced the introduction of a highly anticipated feature allowing users to schedule both one-time and recurring payments or requests. This new functionality is designed to simplify managing regular expenses such as rent, utilities, or other recurring payments between friends and family.Square Report Reveals Shift in Coffee RitualsNew data from Square highlights significant changes in coffee consumption habits among Americans and Canadians.Xero Survey Finds Half of U.S. Small Businesses Struggle with Fiscal Challenges Due to Lack of Financial LiteracyA recent survey by global cloud-based small business platform Xero reveals that a significant number of U.S. small business owners face financial difficulties stemming from a lack of financial literacy.Instagram Launches ‘Best Practices’ Hub to Help Creators Grow and Optimize ContentInstagram recently announced the launch of Best Practices, a new educational hub designed to provide creators with the tools and information they need to optimize their content, expand their reach, and achieve their goals on the platform.AAA Reports Gas Prices Rise Slightly as Hurricane Milton Causes Regional DisruptionsThe national average for a gallon of gasoline has risen by two cents over the past week to $3.21, according to the latest data from AAA. This small increase is attributed to the effects of back-to-back storms, with large areas of the country experiencing infrastructure damage, road flooding, and power outages due to Hurricane Helene and now Storm Milton.Amazon’s Prime Big Deal Days Becomes Biggest October Shopping Event EverAmazon announced that its 2024 Prime Big Deal Days was the company’s largest October shopping event in history. Events like Prime Big Deal Days can be a boon for small businesses that sell on Amazon. They also serve as an opportunity for small businesses with tight budgets to score good deals on needed new technology and supplies.",
  "image": "https://smallbiztrends.com/wp-content/themes/sahifa/images/logo-full.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eIt’s been about two years since small businesses first got their collective hands on generative AI technology. And quite a lot has changed in  that time. But two years into this era, if you will, what has really changed? And has AI really changed small business?\u003c/p\u003e\u003cp\u003eOur panel of small business experts discuss this and other hot topics in this week’s episode of Small Business Breakdown.\u003c/p\u003e\u003cp\u003e\u003ciframe title=\"YouTube video player\" data-ezsrc=\"https://www.youtube.com/embed/uVMpYueoRco?si=KWoa1NIsYyQa023Y\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003ch2\u003eSmall Business News Roundup – Oct. 18, 2024\u003c/h2\u003e\u003cp\u003eHere’s the rest of this week’s headlines that matter most to small business owners, solopreneurs, and more …\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/tiktok-automated-advertising-solutions/\" target=\"_blank\" rel=\"noopener\"\u003eTikTok Unveils New Performance Advertising Solutions to Help Brands Drive Business Results\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eTikTok introduced a suite of new performance advertising solutions aimed at helping brands achieve tangible business results. As TikTok continues to grow with over 1 billion users worldwide, these new tools focus on automation, enhanced measurement capabilities, and improved privacy technologies to support advertisers. “TikTok is building for the future.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/small-business-radio-show-ed-hajim-interview/\" target=\"_blank\" rel=\"noopener\"\u003eFrom Living in Foster Homes to Making a Fortune\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eI am always amazed about the resiliency of people in their lives and their companies. On this week’s episode of The Small Business Radio I talked with an executive that has an amazing story, At the age of 3, Ed Hajim is kidnapped by his father, driven cross-country, and told his mother is dead.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/snapchat-sponsored-snaps-promoted-places-for-advertisers/\" target=\"_blank\" rel=\"noopener\"\u003eSnapchat Introduces Sponsored Snaps and Promoted Places for Advertisers\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eSnapchat has announced the launch of two new advertising placements: Sponsored Snaps and Promoted Places. These new features are being introduced with launch partners Disney, McDonald’s, and Taco Bell, and are designed to help businesses engage with Snapchat’s community in new, innovative ways.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/connecticut-fisherman-sentenced-failing-to-pay-income-tax/\" target=\"_blank\" rel=\"noopener\"\u003eConnecticut Fisherman Sentenced to Prison for Tax Evasion on $1.2M in Income\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eA Connecticut man was sentenced today to one year and one day in prison for evading federal income taxes on more than $1.2 million he earned from commercial fishing in Massachusetts. According to court documents and statements made in court, Brian Kobus, of Durham, Connecticut, worked as a commercial fisherman and deckhand for various fishing companies.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/sba-exhausts-funds-new-disaster-loans/\" target=\"_blank\" rel=\"noopener\"\u003eSBA Exhausts Funds for New Disaster Loans, Urges Continued Applications as Agency Awaits Additional Funding\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eThe U.S. Small Business Administration (SBA) announced today that it has exhausted available funds for its disaster loan program due to the high demand for financial relief following Hurricane Helene. As a result, the SBA is pausing new loan offers for its low-interest, long-term disaster loans until Congress appropriates additional funding.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/dropbox-for-busines/\" target=\"_blank\" rel=\"noopener\"\u003eDropbox Introduces Dash for Business\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eDropbox announced the launch of Dash for Business, an AI-powered universal search tool designed to help teams efficiently search, organize, share, and protect content across various connected apps. Dash for Business provides businesses of all sizes with advanced content access control, streamlining their ability to manage and secure data across platforms.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/new-apple-ipad-mini/\" target=\"_blank\" rel=\"noopener\"\u003eApple Introduces New iPad Mini with A17 Pro Chip and Apple Intelligence\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eApple today unveiled the new iPad mini, featuring the powerful A17 Pro chip and support for Apple Intelligence. Designed for portability and performance, the new iPad mini offers users a versatile experience with a stunning 8.3-inch Liquid Retina display and all-day battery life.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/dhl-express-announces-price-increase-2025/\" target=\"_blank\" rel=\"noopener\"\u003eDHL Express Announces 2025 Price Adjustments for U.S. Customers\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eSmall businesses and entrepreneurs who use DHL Express to ship packages can expect to pay a bit more for that service at the beginning of next year. DHL Express has announced a 5.9% general average shipment price increase for U.S. account holders, effective January 1, 2025. In addition to the price adjustment, a limited number of services and surcharges will also be modified.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/venmo-schedule-request-payments-feature/\" target=\"_blank\" rel=\"noopener\"\u003eVenmo Introduces New Feature to Schedule Payments and Requests\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eVenmo recently announced the introduction of a highly anticipated feature allowing users to schedule both one-time and recurring payments or requests. This new functionality is designed to simplify managing regular expenses such as rent, utilities, or other recurring payments between friends and family.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/square-survey-coffee-trends-among-consumers/\" target=\"_blank\" rel=\"noopener\"\u003eSquare Report Reveals Shift in Coffee Rituals\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eNew data from Square highlights significant changes in coffee consumption habits among Americans and Canadians.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/xero-financial-literacy-survey/\" target=\"_blank\" rel=\"noopener\"\u003eXero Survey Finds Half of U.S. Small Businesses Struggle with Fiscal Challenges Due to Lack of Financial Literacy\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eA recent survey by global cloud-based small business platform Xero reveals that a significant number of U.S. small business owners face financial difficulties stemming from a lack of financial literacy.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/instagram-best-practices-hub/\" target=\"_blank\" rel=\"noopener\"\u003eInstagram Launches ‘Best Practices’ Hub to Help Creators Grow and Optimize Content\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eInstagram recently announced the launch of Best Practices, a new educational hub designed to provide creators with the tools and information they need to optimize their content, expand their reach, and achieve their goals on the platform.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/aaa-gas-prices-update-october-10-2024/\" target=\"_blank\" rel=\"noopener\"\u003eAAA Reports Gas Prices Rise Slightly as Hurricane Milton Causes Regional Disruptions\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eThe national average for a gallon of gasoline has risen by two cents over the past week to $3.21, according to the latest data from AAA. This small increase is attributed to the effects of back-to-back storms, with large areas of the country experiencing infrastructure damage, road flooding, and power outages due to Hurricane Helene and now Storm Milton.\u003c/p\u003e\u003ch3\u003e\u003ca href=\"https://smallbiztrends.com/amazon-prime-big-deal-days-biggest-ever-2024/\" target=\"_blank\" rel=\"noopener\"\u003eAmazon’s Prime Big Deal Days Becomes Biggest October Shopping Event Ever\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eAmazon announced that its 2024 Prime Big Deal Days was the company’s largest October shopping event in history. Events like Prime Big Deal Days can be a boon for small businesses that sell on Amazon. They also serve as an opportunity for small businesses with tight budgets to score good deals on needed new technology and supplies.\u003c/p\u003e\u003chr/\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-19T21:47:19Z",
  "modifiedTime": null
}
