{
  "id": "50bcb25a-cb70-4765-8a33-ad2514e5ce9b",
  "title": "Getting in touch with the Fortnite generation | Cody ‘Clix’ Conrod interview",
  "link": "https://venturebeat.com/business/getting-in-touch-with-the-fortnite-generation-cody-clix-conrod-interview/",
  "description": "I spoke with Cody \"Clix\" Conrod, who has millions of followers on social. He has been playing Fortnite since a young age and now he is world famous.",
  "author": "Dean Takahashi",
  "published": "Sun, 30 Mar 2025 15:45:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "Business",
    "category-/Online Communities"
  ],
  "byline": "Dean Takahashi",
  "length": 13779,
  "excerpt": "I spoke with Cody \"Clix\" Conrod, who has millions of followers on social. He has been playing Fortnite since a young age and now he is world famous.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "As an old timer in games, it’s good for me to get to know what young people on the bleeding edge of technology and games think about. I had a chance to do that with Cody “Clix” Conrod, who has millions of followers on social. He has been playing Fortnite since a young age and now he is world famous. Clix started generating tons of money and followers since he was 13, given his skills at gaming. Now he’s 20 years old and he has promo deals with brands like JBL. At SXSW, Conrod talked about being a creator on a panel with DJ/content creator Xandra and Chris Epple, VP of marketing at Harman/JBL and Ryan Joe of AdWeek. He’s a co-owner and ambassador for esports organization XSET. In addition to competition and content creation, Conrod works with XSET on a Fortnite Creative project called Clix Creative. Clix Creative maps and modes have had tens of millions of players. In March, Epic Games said Clix would receive an Icon Series Skin, allowing players to compete as him. He dropped out of school in the eighth grade to focus on Fortnite, with the support of his father. He was the 2024 Most Watched English Fortnite Streamer in the World and won the 2024 Stream Awards Fortnite Streamer of the Year. And Conrod has his own apparel brand called Dr3amin. I caught up with Conrod at the recent SXSW event in Austin, Texas, where he was doing a panel with fellow streamers and working with his sponsor JBL electronics brand. I asked him if he wanted to make his own games, but he said he was more interested in pursuing a career in acting. After all, it’s pretty rare for Fortnite stars to last for a long time. He thinks the best players peak around 16, and he feels good he is still competitive at 20. But he figures it’s rare to make it past 23. Here’s an edited transcript of our interview. Cody “Clilx” Conrod is a Fortnite legend and popular content creator. GamesBeat: Bob Iger, the CEO of Disney, was talking about why he invested in Epic. He said that one of his guys came to him with a bunch of charts that said, “This is Gen Z, all the younger folks now. This is their awareness of Disney. They don’t watch TV. We can’t reach them through traditional Disney channels. In a generation, when these people grow up, Disney will not be on their radar.” You have to go where people are, and where young people are, because that’s Disney’s thing, capturing an audience when they’re young. It’s interesting that they view your generation as something that they still have to get hold of. You’re important to them. Conrod: It’s crazy to hear. You think he knows me? Maybe. GamesBeat: Better chance he knows you than me. But it’s interesting to see how brands think now, that they have to reach the generation that’s in Fortnite and Roblox and Minecraft now. Are you becoming aware of that? Do you see them starting to care more? Conrod: When I was born–I started playing video games when I was five. The second they came out, I was on there. Waking up, sneaking into my brother’s room. When I was getting to be 12 and 13, winning a championship and making six figures at 13, having millions of people watch–that’s when I realized, “I think I’m living in the future. What I’m doing right now is the next generation.” Now I’m 20, seven years later, and still doing the same thing, but at such a large scale. Epic Games is building Disney’s universe. People are considering esports like they would look at the NBA. It’s crazy. The top streamers, like Kai Cenat, the kind of influence they have, it’s getting to the point where they’re on a level with NBA prospects. GamesBeat: I used to wonder if people would ever get paid to play games. Maybe just the top 1% of the top 1% that’s good at esports. But when AI comes along and wipes out all our jobs– Conrod: Good thing that AI can’t play video games for me. That’d be pretty bad. GamesBeat: We’ll see if they can challenge you. Conrod: I’ll whoop their ass. GamesBeat: It’s a changing world. My generation grew up when gaming was the stepchild in entertainment. It’s not true anymore. Conrod: Instead of going outside, kids are playing video games. I feel like when I was young–my parents would press me. “Go outside. You need to play outside.” That’s how it was back then. Now parents see influencers like me–not to pump myself up, but I had a documentary that had 10 million views. The story of my life. It was from my dad investing $1,000 in me, getting me my first computer. That $1,000 computer became tens of millions of dollars. A lot of kids showed that to their parents. “I could be that!” This is a generation where it doesn’t really matter what age you are. You can make so much money. The internet is full of opportunities. GamesBeat: What would you say is your proudest Fortnite moment? Conrod: You’re going to see it this weekend. Come back to this in four days, you’ll see it. I can’t tell you anything other than that. But in the past–I don’t know if you know too much about my competitive career. I qualified for the World Cup the most times out of anyone. That’s the $100 million tournament. Tens of millions of people were watching. Millions of people were competing. You had 10 weeks to qualify. I alone qualified five times in those 10 weeks. Only 100 people qualified in all. That was definitely my biggest accomplishment. Even then, just the duality of streaming every day and competing every day, that’s my favorite accomplishment. Nobody’s been able to do that. That’s why streaming at the pro level is so rare. It’s why I’m different from the others. GamesBeat: What’s your Spider-Man thought? With great power comes great responsibility. Conrod: It does. I remember when I was 16. I would go off at people, at creators, not knowing I had that much of an impact. I would cuss them out, go crazy. I was immature. I’d end my stream and see Twitter going viral from me going off on a creator. That creator’s getting all this hate because of the power that I had. That’s when I realized, “Wow. There are better ways I could take my anger than just ruining someone’s week.” Now that I’m 20 I know that. When I choose to go off I know it’s for a valid reason. GamesBeat: This generation that loves Fortnite so much, do you think they don’t care as much about graphics as earlier generations of gamers? I’m a Call of Duty guy. There’s a big difference in visuals between Call of Duty and Fortnite. Conrod: You’re the first person I’ve heard say that, but it’s so true. Graphics now–I don’t give a shit about graphics. I don’t think kids either–in Fortnite there’s a mode, the performance mode. Everyone who’s competing plays in performance mode to get better FPS and play more smoothly. People now really just care about the performance of the game and how to accomplish the highest achievements there. In Fortnite my graphics look terrible. The grass isn’t grass. It’s just a green floor. GamesBeat: As long as they’re good enough. Conrod: Good enough to be able to compete, yeah. GamesBeat: What else comes to mind when you think about the Fortnite generation? Conrod: I see a world where, 10 to 20 years from now, the esports industry is going to be on par with the NBA, that type of audience. I feel like these LAN events will have courtside. I already know of an event I’m going to that’s going to have courtside games at a similar price. This could go so many ways that we can’t even imagine. GamesBeat: Do you want the larger game industry to go a certain way? Fortnite itself, the industry beyond it? What do you think can be improved about it? Conrod: The way I would want it to go is Fortnite being able to partner with third-party brands to have their own LAN events. The one thing I wish they did more of would be more tournaments, real-life tournaments. We compete five times a week, but it’s virtual, streaming. The LAN events bring the hype. Every single LAN, I sell 500 jerseys out in 10 minutes. It’s the craziest thing in my life. I wish I could experience that more than just once a year. GamesBeat: The same way musicians make all their money off concerts. Conrod: Exactly. Or sports. They have games all the time. People can come see them in real life. Fortnite and video games in general, it’s not really at that level yet. GamesBeat: What do you think about the fame at this point? Conrod: I guess you could use the word fame. I got there so young. I was 13. It’s kind of just life. It’s not really anything else. What’s weird is, whatever I do is going to be perceived differently than how I want it to be perceived. I need to watch everything I say to make sure it doesn’t come off as this, doesn’t come off as that. The internet now is just trying to spread lies. That’s the reality of it. That’s how you get your clicks, how you get your views. Just lies or crazy stuff happening. That’s weird. But the reward is lot greater than that. GamesBeat: Have you ever wanted to make your own game? Conrod: No, never. After I retire from gaming professionally, where I want to go–I still need tons of practice. But acting, something like that, is my way to go. I stream every day to thousands of people. GamesBeat: Do you think you’ll have to retire at some point? Is this a young man’s sport? Conrod: Oh, man. Fortnite especially is a young man’s game. The prime age for this game is 16. The second you go over 23, you’re not a pro anymore. I’m considered old. I’ve been playing seven years, I’m 20 years old, and I just came second in one of the biggest finals yesterday, which is very good. I’m still at the top of the top. But who knows how long that’s going to last? GamesBeat: What advice would you give to the younger people coming behind you? How should they approach the goal of being an influencer or a pro gamer? Conrod: For kids who are young especially, it’s good that video games are getting more normalized. At least in my opinion. Back then, when I was playing, nobody would be able to play as much as I could. Their parents would say, “Get off your computer and go outside!” The number one thing I would tell people–if someone is telling you, “No, you can’t do this,” if it’s someone like your family, show them proof that it’s possible. If it’s someone just nagging on you, ignore it. Use that as motivation. My whole school looked at me and said, “Yeah, he wants to be a video game pro,” and laughed at me. Now where are they? Use that as fuel. Use that as motivation. GamesBeat: The JBL partnership, what’s interesting about doing things like this? Cody Conrod: I’ve been with JBL for a year and a half. I’m young. At the start I was very skeptical. Most brands that you work with, there needs to be love from both sides. You need to have a plan and you need to come together to accomplish that plan. At our first event I knew JBL was the right pick for me. We did an event in New York. It was pouring down rain, but more than 200 kids came, which was insane. It felt like I was in a movie. I had a mic on, pointing at people, giving stuff away. That I’m able to collab with a brand like JBL and put on a show like that and have 15,000 people watching online as well, I never thought I could accomplish something like that. I’ve said many times, I don’t want to work with a brand I don’t enjoy. Your community can see right through you. If I don’t enjoy the product, they’re not going to enjoy it either. That I’m able to wear a JBL headset every day while competing in top tournaments and still perform at a top level, even better than before, that tells you something. Since Clix is so famous, I had to take a selfie with him. Maybe the fame will rub off on me. GamesBeat: What else is weighing on your mind these days? Conrod: Number one, it’s just being happy. First and foremost, if you’re happy, everything else will come to you. I used to think it was a money thing. “If I make this much, I’ll be happy.” But I don’t really care about the money anymore. If I’m happy, that’s worth more than I can imagine. I don’t necessarily do whatever I want every day, but I enjoy what I do. Everything I do is something that I love doing. I want to create on an even larger scale. GamesBeat: What opportunities does gaming create for you? What kind of people do you get to meet? Conrod: Oh, man. I’ve met NBA players. I did a Fortnite thing with Steph Curry, which was super cool. He gave me signed shoes. Even music celebrities. I did a crazy Fortnite stream with Snoop Dogg, 60,000 viewers with him. I was smoking a fake piece of paper. It was the most family-friendly thing I could try to do. It was so funny. The opportunities this has made–the only reason I have a job is because of this game. I’m grateful for all of it. GamesBeat: How did you get this good? Conrod: It’s God’s plan. Like I said, I started playing when I was five years old. The second I was born, practically, I was touching a keyboard and understanding what I was doing. That’s definitely been a blessing. The amount of discipline I have, more than others–that really spoke out, ever since I was 13. The reason I’m a professional now is my discipline to do every single thing. GamesBeat: You could be CEO of Disney someday. Conrod: Someday! Hopefully CEO of some crazy company like that. Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/03/JBL-SXSW-Panel.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003eAs an old timer in games, it’s good for me to get to know what young people on the bleeding edge of technology and games think about. \u003c/p\u003e\n\n\n\n\u003cp\u003eI had a chance to do that with \u003ca href=\"https://www.youtube.com/channel/UCym0XKpmoSl594oT9yhEk0Q\"\u003eCody “Clix” Conrod\u003c/a\u003e, who has millions of followers on social. He has been playing Fortnite since a young age and now he is world famous. Clix started generating tons of money and followers since he was 13, given his skills at gaming. Now he’s 20 years old and he has promo deals with brands like JBL.\u003c/p\u003e\n\n\n\n\u003cp\u003eAt SXSW, Conrod talked about being a creator on a \u003ca href=\"https://schedule.sxsw.com/2025/events/PP155459\"\u003epanel\u003c/a\u003e with DJ/content creator Xandra and Chris Epple, VP of marketing at Harman/JBL and Ryan Joe of AdWeek. \u003c/p\u003e\n\n\n\n\u003cp\u003eHe’s a co-owner and ambassador for esports organization XSET. In addition to competition and content creation, Conrod works with XSET on a Fortnite Creative project called Clix Creative. Clix Creative maps and modes have had tens of millions of players. \u003c/p\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003eIn March, Epic Games said Clix would receive an Icon Series Skin, allowing players to compete as him. He dropped out of school in the eighth grade to focus on Fortnite, with the support of his father. \u003c/p\u003e\u003cp\u003eHe was the 2024 Most Watched English Fortnite Streamer in the World and won the 2024 Stream Awards Fortnite Streamer of the Year. And Conrod has his own apparel brand called Dr3amin.\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003eI caught up with Conrod at the recent SXSW event in Austin, Texas, where he was doing a panel with fellow streamers and working with his sponsor JBL electronics brand. I asked him if he wanted to make his own games, but he said he was more interested in pursuing a career in acting. After all, it’s pretty rare for Fortnite stars to last for a long time. He thinks the best players peak around 16, and he feels good he is still competitive at 20. But he figures it’s rare to make it past 23. \u003c/p\u003e\n\n\n\n\u003cp\u003eHere’s an edited transcript of our interview.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1200\" height=\"679\" src=\"https://venturebeat.com/wp-content/uploads/2025/03/clix.jpg?w=800\" alt=\"\" srcset=\"https://venturebeat.com/wp-content/uploads/2025/03/clix.jpg 1200w, https://venturebeat.com/wp-content/uploads/2025/03/clix.jpg?resize=300,170 300w, https://venturebeat.com/wp-content/uploads/2025/03/clix.jpg?resize=768,435 768w, https://venturebeat.com/wp-content/uploads/2025/03/clix.jpg?resize=800,453 800w, https://venturebeat.com/wp-content/uploads/2025/03/clix.jpg?resize=400,226 400w, https://venturebeat.com/wp-content/uploads/2025/03/clix.jpg?resize=750,424 750w, https://venturebeat.com/wp-content/uploads/2025/03/clix.jpg?resize=578,327 578w, https://venturebeat.com/wp-content/uploads/2025/03/clix.jpg?resize=930,526 930w\" sizes=\"(max-width: 1200px) 100vw, 1200px\"/\u003e\u003cfigcaption\u003eCody “Clilx” Conrod is a Fortnite legend and popular content creator.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: Bob Iger, the CEO of Disney, was talking about why he invested in Epic. He said that one of his guys came to him with a bunch of charts that said, “This is Gen Z, all the younger folks now. This is their awareness of Disney. They don’t watch TV. We can’t reach them through traditional Disney channels. In a generation, when these people grow up, Disney will not be on their radar.” You have to go where people are, and where young people are, because that’s Disney’s thing, capturing an audience when they’re young. It’s interesting that they view your generation as something that they still have to get hold of. You’re important to them.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e It’s crazy to hear. You think he knows me? Maybe.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: Better chance he knows you than me. But it’s interesting to see how brands think now, that they have to reach the generation that’s in Fortnite and Roblox and Minecraft now. Are you becoming aware of that? Do you see them starting to care more?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e When I was born–I started playing video games when I was five. The second they came out, I was on there. Waking up, sneaking into my brother’s room. When I was getting to be 12 and 13, winning a championship and making six figures at 13, having millions of people watch–that’s when I realized, “I think I’m living in the future. What I’m doing right now is the next generation.” Now I’m 20, seven years later, and still doing the same thing, but at such a large scale.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1200\" height=\"675\" src=\"https://venturebeat.com/wp-content/uploads/2024/02/disney.jpg?w=800\" alt=\"Epic Games is building Disney\u0026#39;s universe.\" srcset=\"https://venturebeat.com/wp-content/uploads/2024/02/disney.jpg 1200w, https://venturebeat.com/wp-content/uploads/2024/02/disney.jpg?resize=300,169 300w, https://venturebeat.com/wp-content/uploads/2024/02/disney.jpg?resize=768,432 768w, https://venturebeat.com/wp-content/uploads/2024/02/disney.jpg?resize=800,450 800w, https://venturebeat.com/wp-content/uploads/2024/02/disney.jpg?resize=400,225 400w, https://venturebeat.com/wp-content/uploads/2024/02/disney.jpg?resize=750,422 750w, https://venturebeat.com/wp-content/uploads/2024/02/disney.jpg?resize=578,325 578w, https://venturebeat.com/wp-content/uploads/2024/02/disney.jpg?resize=930,523 930w\" sizes=\"(max-width: 1200px) 100vw, 1200px\"/\u003e\u003cfigcaption\u003eEpic Games is building Disney’s universe.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePeople are considering esports like they would look at the NBA. It’s crazy. The top streamers, like Kai Cenat, the kind of influence they have, it’s getting to the point where they’re on a level with NBA prospects.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: I used to wonder if people would ever get paid to play games. Maybe just the top 1% of the top 1% that’s good at esports. But when AI comes along and wipes out all our jobs–\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e Good thing that AI can’t play video games for me. That’d be pretty bad.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: We’ll see if they can challenge you.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e I’ll whoop their ass.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: It’s a changing world. My generation grew up when gaming was the stepchild in entertainment. It’s not true anymore.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e Instead of going outside, kids are playing video games. I feel like when I was young–my parents would press me. “Go outside. You need to play outside.” That’s how it was back then. Now parents see influencers like me–not to pump myself up, but I had a documentary that had 10 million views. The story of my life. It was from my dad investing $1,000 in me, getting me my first computer. That $1,000 computer became tens of millions of dollars. A lot of kids showed that to their parents. “I could be that!” This is a generation where it doesn’t really matter what age you are. You can make so much money. The internet is full of opportunities.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: What would you say is your proudest Fortnite moment?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e You’re going to see it this weekend. Come back to this in four days, you’ll see it. I can’t tell you anything other than that. But in the past–I don’t know if you know too much about my competitive career. I qualified for the World Cup the most times out of anyone. That’s the $100 million tournament. Tens of millions of people were watching. Millions of people were competing. You had 10 weeks to qualify. I alone qualified five times in those 10 weeks. Only 100 people qualified in all. That was definitely my biggest accomplishment.\u003c/p\u003e\n\n\n\n\u003cp\u003eEven then, just the duality of streaming every day and competing every day, that’s my favorite accomplishment. Nobody’s been able to do that. That’s why streaming at the pro level is so rare. It’s why I’m different from the others.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"Sommerset came over... (Cooking Date)\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/ws3TOO_2isE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: What’s your Spider-Man thought? With great power comes great responsibility.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e It does. I remember when I was 16. I would go off at people, at creators, not knowing I had that much of an impact. I would cuss them out, go crazy. I was immature. I’d end my stream and see Twitter going viral from me going off on a creator. That creator’s getting all this hate because of the power that I had. That’s when I realized, “Wow. There are better ways I could take my anger than just ruining someone’s week.” Now that I’m 20 I know that. When I choose to go off I know it’s for a valid reason.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: This generation that loves Fortnite so much, do you think they don’t care as much about graphics as earlier generations of gamers? I’m a Call of Duty guy. There’s a big difference in visuals between Call of Duty and Fortnite.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e You’re the first person I’ve heard say that, but it’s so true. Graphics now–I don’t give a shit about graphics. I don’t think kids either–in Fortnite there’s a mode, the performance mode. Everyone who’s competing plays in performance mode to get better FPS and play more smoothly. People now really just care about the performance of the game and how to accomplish the highest achievements there. In Fortnite my graphics look terrible. The grass isn’t grass. It’s just a green floor.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: As long as they’re good enough.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e Good enough to be able to compete, yeah.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: What else comes to mind when you think about the Fortnite generation?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e I see a world where, 10 to 20 years from now, the esports industry is going to be on par with the NBA, that type of audience. I feel like these LAN events will have courtside. I already know of an event I’m going to that’s going to have courtside games at a similar price. This could go so many ways that we can’t even imagine.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: Do you want the larger game industry to go a certain way? Fortnite itself, the industry beyond it? What do you think can be improved about it?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e The way I would want it to go is Fortnite being able to partner with third-party brands to have their own LAN events. The one thing I wish they did more of would be more tournaments, real-life tournaments. We compete five times a week, but it’s virtual, streaming. The LAN events bring the hype. Every single LAN, I sell 500 jerseys out in 10 minutes. It’s the craziest thing in my life. I wish I could experience that more than just once a year.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Whatchu On ? | Clix\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/EKaiq5qj7Go?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: The same way musicians make all their money off concerts.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e Exactly. Or sports. They have games all the time. People can come see them in real life. Fortnite and video games in general, it’s not really at that level yet.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: What do you think about the fame at this point?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod: \u003c/strong\u003eI guess you could use the word fame. I got there so young. I was 13. It’s kind of just life. It’s not really anything else. What’s weird is, whatever I do is going to be perceived differently than how I want it to be perceived. I need to watch everything I say to make sure it doesn’t come off as this, doesn’t come off as that. The internet now is just trying to spread lies. That’s the reality of it. That’s how you get your clicks, how you get your views. Just lies or crazy stuff happening. That’s weird. But the reward is lot greater than that.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: Have you ever wanted to make your own game?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e No, never. After I retire from gaming professionally, where I want to go–I still need tons of practice. But acting, something like that, is my way to go. I stream every day to thousands of people.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: Do you think you’ll have to retire at some point? Is this a young man’s sport?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e Oh, man. Fortnite especially is a young man’s game. The prime age for this game is 16. The second you go over 23, you’re not a pro anymore. I’m considered old. I’ve been playing seven years, I’m 20 years old, and I just came second in one of the biggest finals yesterday, which is very good. I’m still at the top of the top. But who knows how long that’s going to last?\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: What advice would you give to the younger people coming behind you? How should they approach the goal of being an influencer or a pro gamer?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"End Of The World ? | Clix\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/0OvehEvvwoQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e For kids who are young especially, it’s good that video games are getting more normalized. At least in my opinion. Back then, when I was playing, nobody would be able to play as much as I could. Their parents would say, “Get off your computer and go outside!” The number one thing I would tell people–if someone is telling you, “No, you can’t do this,” if it’s someone like your family, show them proof that it’s possible. If it’s someone just nagging on you, ignore it. Use that as motivation.\u003c/p\u003e\n\n\n\n\u003cp\u003eMy whole school looked at me and said, “Yeah, he wants to be a video game pro,” and laughed at me. Now where are they? Use that as fuel. Use that as motivation.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: The JBL partnership, what’s interesting about doing things like this?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eCody Conrod:\u003c/strong\u003e I’ve been with JBL for a year and a half. I’m young. At the start I was very skeptical. Most brands that you work with, there needs to be love from both sides. You need to have a plan and you need to come together to accomplish that plan. At our first event I knew JBL was the right pick for me. We did an event in New York. It was pouring down rain, but more than 200 kids came, which was insane. It felt like I was in a movie. I had a mic on, pointing at people, giving stuff away. That I’m able to collab with a brand like JBL and put on a show like that and have 15,000 people watching online as well, I never thought I could accomplish something like that.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’ve said many times, I don’t want to work with a brand I don’t enjoy. Your community can see right through you. If I don’t enjoy the product, they’re not going to enjoy it either. That I’m able to wear a JBL headset every day while competing in top tournaments and still perform at a top level, even better than before, that tells you something.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1200\" height=\"900\" src=\"https://venturebeat.com/wp-content/uploads/2025/03/clix-3.jpg?w=800\" alt=\"\" srcset=\"https://venturebeat.com/wp-content/uploads/2025/03/clix-3.jpg 1200w, https://venturebeat.com/wp-content/uploads/2025/03/clix-3.jpg?resize=300,225 300w, https://venturebeat.com/wp-content/uploads/2025/03/clix-3.jpg?resize=768,576 768w, https://venturebeat.com/wp-content/uploads/2025/03/clix-3.jpg?resize=800,600 800w, https://venturebeat.com/wp-content/uploads/2025/03/clix-3.jpg?resize=400,300 400w, https://venturebeat.com/wp-content/uploads/2025/03/clix-3.jpg?resize=750,563 750w, https://venturebeat.com/wp-content/uploads/2025/03/clix-3.jpg?resize=578,434 578w, https://venturebeat.com/wp-content/uploads/2025/03/clix-3.jpg?resize=930,698 930w\" sizes=\"auto, (max-width: 1200px) 100vw, 1200px\"/\u003e\u003cfigcaption\u003eSince Clix is so famous, I had to take a selfie with him. Maybe the fame will rub off on me.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: What else is weighing on your mind these days?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e Number one, it’s just being happy. First and foremost, if you’re happy, everything else will come to you. I used to think it was a money thing. “If I make this much, I’ll be happy.” But I don’t really care about the money anymore. If I’m happy, that’s worth more than I can imagine. I don’t necessarily do whatever I want every day, but I enjoy what I do. Everything I do is something that I love doing. I want to create on an even larger scale.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: What opportunities does gaming create for you? What kind of people do you get to meet?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod: \u003c/strong\u003eOh, man. I’ve met NBA players. I did a Fortnite thing with Steph Curry, which was super cool. He gave me signed shoes. Even music celebrities. I did a crazy Fortnite stream with Snoop Dogg, 60,000 viewers with him. I was smoking a fake piece of paper. It was the most family-friendly thing I could try to do. It was so funny. The opportunities this has made–the only reason I have a job is because of this game. I’m grateful for all of it.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: How did you get this good?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e It’s God’s plan. Like I said, I started playing when I was five years old. The second I was born, practically, I was touching a keyboard and understanding what I was doing. That’s definitely been a blessing. The amount of discipline I have, more than others–that really spoke out, ever since I was 13. The reason I’m a professional now is my discipline to do every single thing.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGamesBeat: You could be CEO of Disney someday.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConrod:\u003c/strong\u003e Someday! Hopefully CEO of some crazy company like that.\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://venturebeat.com/wp-content/themes/vb-news/brand/img/vb-daily-phone.png\" alt=\"\"/\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-03-30T15:45:00Z",
  "modifiedTime": "2025-03-30T06:58:19Z"
}
