{
  "id": "5284ada3-e3d8-400c-85f3-65069e610493",
  "title": "Fortnite makes its data API public to offer creators more insights",
  "link": "https://venturebeat.com/games/fortnite-makes-its-data-api-public-to-offer-creators-more-insights/",
  "description": "Epic Games has launched the Fortnite Data API to the public, allowing anyone to access information about the company's own islands.",
  "author": "Rachel Kaser",
  "published": "Thu, 29 May 2025 21:46:49 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "Game Development",
    "GamesBeat",
    "OS and Hosting Platforms"
  ],
  "byline": "Rachel Kaser",
  "length": 1512,
  "excerpt": "Epic Games has launched the Fortnite Data API to the public, allowing anyone to access information about the company's own islands.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "Epic Games announced this week that it is launching the Fortnite Data API, which makes several data points about Fortnite islands public for creators to access. This data includes engagement and retention metrics, allowing other creators to better understand what makes certain kinds of games successful with players. According to Epic, it plans to reveal more about the data’s uses at the upcoming Unreal Fest in Orlando. The Fortnite Data API includes various data points on each island, including: Total minutes played by all players Average total minutes per unique player Number of game sessions played Number of times players favorited the island Number of times players recommended the island (previously “Likes”) Peak concurrent player count Number of distinct players Day-over-day retention Week-over-week retention Each of these data points is available for third-party analysis and insights, for a period of up to seven days. It’s publicly accessible and doesn’t require authentication to access. According to Epic’s FAQ, this new change only applies to islands made by Epic itself, including Fortnite Battle Royale, at least currently. On June 9, it plans to expand to include all creator-made islands, and the same FAQ also notes that there’s no way for creators to opt out of the sharing of this information: “Data transparency applies equally to all islands published in the Fortnite ecosystem, which is why we’re sharing data from Epic-made islands as well.”",
  "image": "https://venturebeat.com/wp-content/uploads/2025/05/28FNE_Cyan_SavePointDevice.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003ca href=\"https://venturebeat.com/games/epic-games-touts-victory-in-latest-court-ruling-in-apple-antitrust-case/\"\u003eEpic Games\u003c/a\u003e announced this week that it is launching the Fortnite Data API, which makes several data points about Fortnite islands public for creators to access. This data includes engagement and retention metrics, allowing other creators to better understand what makes certain kinds of games successful with players. According to Epic, it plans to reveal more about the data’s uses at the upcoming Unreal Fest in Orlando.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Fortnite Data API includes various data points on each island, including:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eTotal minutes played by all players\u003c/li\u003e\n\n\n\n\u003cli\u003eAverage total minutes per unique player\u003c/li\u003e\n\n\n\n\u003cli\u003eNumber of game sessions played\u003c/li\u003e\n\n\n\n\u003cli\u003eNumber of times players favorited the island\u003c/li\u003e\n\n\n\n\u003cli\u003eNumber of times players recommended the island (previously “Likes”)\u003c/li\u003e\n\n\n\n\u003cli\u003ePeak concurrent player count\u003c/li\u003e\n\n\n\n\u003cli\u003eNumber of distinct players\u003c/li\u003e\n\n\n\n\u003cli\u003eDay-over-day retention\u003c/li\u003e\n\n\n\n\u003cli\u003eWeek-over-week retention\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eEach of these data points is available for third-party analysis and insights, for a period of up to seven days. It’s publicly accessible and doesn’t require authentication to access.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to \u003ca href=\"https://create.fortnite.com/news/fortnite-data-api-unlocks-more-island-insights-for-creators?team=personal\"\u003eEpic’s FAQ\u003c/a\u003e, this new change only applies to islands made by Epic itself, including Fortnite Battle Royale, at least currently. On June 9, it plans to expand to include all creator-made islands, and the same FAQ also notes that there’s no way for creators to opt out of the sharing of this information: “Data transparency applies equally to all islands published in the Fortnite ecosystem, which is why we’re sharing data from Epic-made islands as well.”\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-05-29T21:46:49Z",
  "modifiedTime": "2025-05-29T21:46:57Z"
}
