{
  "id": "62c169d9-0294-4ab3-bdbd-ad39aad885e2",
  "title": "Iwot Studios launches game team for Wheel of Time RPG",
  "link": "https://venturebeat.com/games/iwot-studios-launches-game-team-for-wheel-of-time-rpg/",
  "description": "Iwot Studios announced that it's creating an in-house game development team to work on an RPG based on The Wheel of Time.",
  "author": "Rachel Kaser",
  "published": "Tue, 29 Apr 2025 00:23:09 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "Game Development",
    "GamesBeat",
    "Gaming Business",
    "Amazon Prime",
    "Audio, Video, Design",
    "Gaming Workplace",
    "iWot",
    "The Wheel of Time"
  ],
  "byline": "Rachel Kaser",
  "length": 2090,
  "excerpt": "Iwot Studios announced that it's creating an in-house game development team to work on an RPG based on The Wheel of Time.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "April 28, 2025 5:23 PM Image Credit: Iwot Studios Iwot Studios announced recently that it has launched its own game development studio, called Iwot Games. The new studio is helmed by Craig Alexander, formerly the VP of product development at Warner Bros. Games. Its first project is an open-world RPG based on The Wheel of Time series authored by Robert Jordan, with an eye towards a multi-platform strategy based around the intellectual property. According to Iwot, the new game will build on the success of The Wheel of Time Amazon Prime show by delivering more of the series’ world and lore to its community of fans. Iwot is involved with the production of the prime show. Alexander plans to begin development by establishing a headquarters in Montreal with plans to build the leadership team out in the coming months. Alexander said in a statement, “Adapting such a legendary mythology into an open-world RPG is a rare and ambitious challenge. It takes vision, scale, and a vibrant creative environment — all of which Montreal provides. I’m thrilled to lead the effort and build a world-class team capable of honoring this beloved world.” This is not the first time Iwot — or Red Eagle Entertainment, as it was formerly known — revealed its intentions to make games based on Jordan’s world. Back in 2008, Red Eagle announced its intention to adapt the series into games and films, though a planned collaboration with Obsidian never appeared to go anywhere. Rick Selvage, Iwot Studios CEO, said in a statement, “Developing a game worthy of The Wheel of Time brand required the right moment, the right leader, and the right location. Craig brings the leadership, vision, and experience we need, and Montreal offers the creative talent to bring this to life. We’re confident this team will deliver something truly special for the fans.” GB Daily Stay in the know! Get the latest news in your inbox daily Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/04/Iwot-Studios.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2025-04-29T00:23:09+00:00\" datetime=\"2025-04-29T00:23:09+00:00\"\u003eApril 28, 2025 5:23 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"322\" src=\"https://venturebeat.com/wp-content/uploads/2025/04/Iwot-Studios.jpg?w=750\" alt=\"\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eImage Credit: Iwot Studios\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003eIwot Studios announced recently that it has launched its own game development studio, called Iwot Games. The new studio is helmed by Craig Alexander, formerly the VP of product development at Warner Bros. Games. Its first project is an open-world RPG based on \u003ca href=\"https://venturebeat.com/ai/true-source-unveils-ai-llm-service-based-on-the-wheel-of-time/\"\u003e\u003cem\u003eThe Wheel of Time\u003c/em\u003e series\u003c/a\u003e authored by Robert Jordan, with an eye towards a multi-platform strategy based around the intellectual property.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to Iwot, the new game will build on the success of \u003cem\u003eThe Wheel of Time\u003c/em\u003e Amazon Prime show by delivering more of the series’ world and lore to its community of fans. Iwot is involved with the production of the prime show. Alexander plans to begin development by establishing a headquarters in Montreal with plans to build the leadership team out in the coming months.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlexander said in a statement, “Adapting such a legendary mythology into an open-world RPG is a rare and ambitious challenge. It takes vision, scale, and a vibrant creative environment — all of which Montreal provides. I’m thrilled to lead the effort and build a world-class team capable of honoring this beloved world.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThis is not the first time Iwot — or Red Eagle Entertainment, as it was formerly known — revealed its intentions to make games based on Jordan’s world. Back in 2008, \u003ca href=\"https://venturebeat.com/games/red-eagle-to-make-multiple-films-and-games-based-on-robert-jordans-wheel-of-time-books/\"\u003eRed Eagle announced\u003c/a\u003e its intention to adapt the series into games and films, though \u003ca href=\"https://www.vg247.com/obsidian-to-assist-red-eagle-in-development-of-wheel-of-time-games\"\u003ea planned collaboration with Obsidian\u003c/a\u003e never appeared to go anywhere.\u003c/p\u003e\n\n\n\n\u003cp\u003eRick Selvage, Iwot Studios CEO, said in a statement, “Developing a game worthy of The Wheel of Time brand required the right moment, the right leader, and the right location. Craig brings the leadership, vision, and experience we need, and Montreal offers the creative talent to bring this to life. We’re confident this team will deliver something truly special for the fans.”\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2663995\"\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eGB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eStay in the know! Get the latest news in your inbox daily\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-29T00:23:09Z",
  "modifiedTime": "2025-04-29T00:23:16Z"
}
