{
  "id": "65576e9e-2cb3-47f1-ac2c-9e9fcce6c501",
  "title": "Co-Founders of PPP Lender Service Provider Charged in COVID-19 Fraud Scheme",
  "link": "https://smallbiztrends.com/blueacorn-founders-indicted-ppp-loan-fraud/",
  "description": "Two co-founders of Blueacorn have been charged with fraudulently obtaining COVID-19 relief funds through falsified PPP loan applications and illegal kickbacks.",
  "author": "Joshua Sophy",
  "published": "Sat, 23 Nov 2024 22:35:54 +0000",
  "source": "https://feeds2.feedburner.com/SmallBusinessTrends",
  "categories": [
    "Small Business News"
  ],
  "byline": "Joshua Sophy",
  "length": 3682,
  "excerpt": "Two co-founders of Blueacorn have been charged with fraudulently obtaining COVID-19 relief funds through falsified PPP loan applications and illegal kickbacks.",
  "siteName": "Small Business Trends",
  "favicon": "",
  "text": "The Department of Justice has unsealed an indictment charging Nathan Reis, 45, and Stephanie Hockridge, 41, co-founders of Blueacorn, with orchestrating a fraudulent scheme to obtain millions in COVID-19 relief funds through the Paycheck Protection Program (PPP). The indictment, filed in the Northern District of Texas, accuses the married couple of submitting false loan applications and collecting illegal kickbacks from borrowers.Allegations of Fraudulent PracticesAccording to court documents, Reis and Hockridge, who previously lived in Arizona and now reside in Puerto Rico, are alleged to have fabricated documents, including payroll records, tax documentation, and bank statements, to secure PPP loans for themselves and their businesses.Blueacorn, which they co-founded in April 2020, purportedly aimed to assist small businesses and individuals in obtaining PPP loans. However, prosecutors allege that Reis and Hockridge exploited their role by recruiting co-conspirators and coaching borrowers to submit fraudulent loan applications.The indictment also claims the duo charged borrowers illegal kickbacks based on a percentage of the funds received. To facilitate their operations, they entered into lender service provider agreements (LSPAs) with two lenders, allowing Blueacorn to collect and review PPP applications and receive a percentage of the SBA fees paid to the lenders.VIPPP Program and Fraudulent Loan ApplicationsThe couple allegedly expanded their operations through a personalized service called “VIPPP,” which offered borrowers tailored assistance with loan applications. Prosecutors allege that Hockridge and others in the program actively guided applicants on how to falsify documents, enabling them to obtain loans for which they were not eligible.To increase the volume of loans and associated kickbacks, Reis, Hockridge, and their co-conspirators allegedly submitted applications containing materially false information, benefiting from both borrower kickbacks and a greater share of SBA lender fees.Charges and Potential PenaltiesReis and Hockridge face one count of conspiracy to commit wire fraud and four counts of wire fraud. Each count carries a maximum penalty of 20 years in prison if convicted.Ongoing Investigation and ProsecutionThe investigation is led by the FBI, IRS Criminal Investigation, the Special Inspector General for Pandemic Recovery (SIGPR), the Office of Inspector General for the Board of Governors of the Federal Reserve System and the Consumer Financial Protection Bureau, and the Small Business Administration Office of Inspector General.Principal Deputy Assistant Attorney General Nicole M. Argentieri of the DOJ’s Criminal Division highlighted the importance of holding individuals accountable for exploiting pandemic relief programs.The case is being prosecuted by Acting Assistant Chief Philip Trout of the Criminal Division’s Fraud Section, Trial Attorneys Elizabeth Carr and Ryan McLaren of the Money Laundering and Asset Recovery Section (MLARS), and Assistant U.S. Attorney Matthew Weybrecht for the Northern District of Texas.Background on PPP Fraud EnforcementSince the enactment of the CARES Act, the DOJ’s Fraud Section has prosecuted over 200 defendants in more than 130 cases involving PPP fraud, recovering over $78 million in cash proceeds and numerous assets, including luxury items and real estate purchased with stolen funds.In May 2021, the Attorney General launched the COVID-19 Fraud Enforcement Task Force to enhance efforts to combat pandemic-related fraud. The task force coordinates investigations across federal agencies and works to prevent fraud through improved oversight of relief programs.",
  "image": "https://media.smallbiztrends.com/2024/11/PPP-fraud.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe Department of Justice has unsealed an indictment charging Nathan Reis, 45, and Stephanie Hockridge, 41, co-founders of Blueacorn, with orchestrating a fraudulent scheme to obtain millions in COVID-19 relief funds through the Paycheck Protection Program (PPP). The indictment, filed in the Northern District of Texas, accuses the married couple of submitting false loan applications and collecting illegal kickbacks from borrowers.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eAllegations of Fraudulent Practices\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eAccording to court documents, Reis and Hockridge, who previously lived in Arizona and now reside in Puerto Rico, are alleged to have fabricated documents, including payroll records, tax documentation, and bank statements, to secure PPP loans for themselves and their businesses.\u003c/p\u003e\u003cp\u003eBlueacorn, which they co-founded in April 2020, purportedly aimed to assist small businesses and individuals in obtaining PPP loans. However, prosecutors allege that Reis and Hockridge exploited their role by recruiting co-conspirators and coaching borrowers to submit fraudulent loan applications.\u003c/p\u003e\u003cp\u003eThe indictment also claims the duo charged borrowers illegal kickbacks based on a percentage of the funds received. To facilitate their operations, they entered into lender service provider agreements (LSPAs) with two lenders, allowing Blueacorn to collect and review PPP applications and receive a percentage of the SBA fees paid to the lenders.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eVIPPP Program and Fraudulent Loan Applications\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eThe couple allegedly expanded their operations through a personalized service called “VIPPP,” which offered borrowers tailored assistance with loan applications. Prosecutors allege that Hockridge and others in the program actively guided applicants on how to falsify documents, enabling them to obtain loans for which they were not eligible.\u003c/p\u003e\u003cp\u003eTo increase the volume of loans and associated kickbacks, Reis, Hockridge, and their co-conspirators allegedly submitted applications containing materially false information, benefiting from both borrower kickbacks and a greater share of SBA lender fees.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eCharges and Potential Penalties\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eReis and Hockridge face one count of conspiracy to commit wire fraud and four counts of wire fraud. Each count carries a maximum penalty of 20 years in prison if convicted.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eOngoing Investigation and Prosecution\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eThe investigation is led by the FBI, IRS Criminal Investigation, the Special Inspector General for Pandemic Recovery (SIGPR), the Office of Inspector General for the Board of Governors of the Federal Reserve System and the Consumer Financial Protection Bureau, and the Small Business Administration Office of Inspector General.\u003c/p\u003e\u003cp\u003ePrincipal Deputy Assistant Attorney General Nicole M. Argentieri of the DOJ’s Criminal Division highlighted the importance of holding individuals accountable for exploiting pandemic relief programs.\u003c/p\u003e\u003cp\u003eThe case is being prosecuted by Acting Assistant Chief Philip Trout of the Criminal Division’s Fraud Section, Trial Attorneys Elizabeth Carr and Ryan McLaren of the Money Laundering and Asset Recovery Section (MLARS), and Assistant U.S. Attorney Matthew Weybrecht for the Northern District of Texas.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eBackground on PPP Fraud Enforcement\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eSince the enactment of the CARES Act, the DOJ’s Fraud Section has prosecuted over 200 defendants in more than 130 cases involving PPP fraud, recovering over $78 million in cash proceeds and numerous assets, including luxury items and real estate purchased with stolen funds.\u003c/p\u003e\u003cp\u003eIn May 2021, the Attorney General launched the COVID-19 Fraud Enforcement Task Force to enhance efforts to combat pandemic-related fraud. The task force coordinates investigations across federal agencies and works to prevent fraud through improved oversight of relief programs.\u003c/p\u003e\u003chr/\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-23T22:35:54Z",
  "modifiedTime": null
}
