{
  "id": "6a3b9b51-04b8-45ad-9404-daaf29ae3068",
  "title": "Like it or not, AI is learning how to influence you",
  "link": "https://venturebeat.com/ai/like-it-or-not-ai-is-learning-how-to-influence-you/",
  "description": "AI agents will soon be deployed that are tasked with decoding your personality so they can use those insights to optimally influence you.",
  "author": "Louis Rosenberg, Unanimous A.I.",
  "published": "Sun, 16 Feb 2025 20:40:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "DataDecisionMakers",
    "AI agents",
    "AI, ML and Deep Learning",
    "category-/News",
    "Conversational AI",
    "Generative AI",
    "large language models",
    "NLP"
  ],
  "byline": "Louis Rosenberg, Unanimous A.I.",
  "length": 8179,
  "excerpt": "AI agents will soon be deployed that are tasked with decoding your personality so they can use those insights to optimally influence you.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "February 16, 2025 12:40 PM Rosenberg/Dall-E Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More When I was a kid there were four AI agents in my life. Their names were Inky, Blinky, Pinky and Clyde and they tried their best to hunt me down. This was the 1980s and the agents were the four colorful ghosts in the iconic arcade game Pac-Man. By today’s standards they weren’t particularly smart, yet they seemed to pursue me with cunning and intent. This was decades before neural networks were used in video games, so their behaviors were controlled by simple algorithms called heuristics that dictate how they would chase me around the maze.   Most people don’t realize this, but the four ghosts were designed with different “personalities.” Good players can observe their actions and learn to predict their behaviors. For example, the red ghost (Blinky) was programmed with a “pursuer” personality that charges directly towards you. The pink ghost (Pinky) on the other hand, was given an “ambusher” personality that predicts where you’re going and tries to get there first. As a result, if you rush directly at Pinky, you can use her personality against her, causing her to actually turn away from you. I reminisce because in 1980 a skilled human could observe these AI agents, decode their unique personalities and use those insights to outsmart them. Now, 45 years later, the tides are about to turn. Like it or not, AI agents will soon be deployed that are tasked with decoding your personality so they can use those insights to optimally influence you. The future of AI manipulation In other words, we are all about to become unwitting players in “The game of humans” and it will be the AI agents trying to earn the high score. I mean this literally — most AI systems are designed to maximize a “reward function” that earns points for achieving objectives. This allows AI systems to quickly find optimal solutions. Unfortunately, without regulatory protections, we humans will likely become the objective that AI agents are tasked with optimizing.  I am most concerned about the conversational agents that will engage us in friendly dialog throughout our daily lives. They will speak to us through photorealistic avatars on our PCs and phones and soon, through AI-powered glasses that will guide us through our days. Unless there are clear restrictions, these agents will be designed to conversationally probe us for information so they can characterize our temperaments, tendencies, personalities and desires, and use those traits to maximize their persuasive impact when working to sell us products, pitch us services or convince us to believe misinformation. This is called the “AI Manipulation Problem,” and I’ve been warning regulators about the risk since 2016. Thus far, policymakers have not taken decisive action, viewing the threat as too far in the future. But now, with the release of Deepseek-R1, the final barrier to widespread deployment of AI agents — the cost of real-time processing — has been greatly reduced. Before this year is out, AI agents will become a new form of targeted media that is so interactive and adaptive, it can optimize its ability to influence our thoughts, guide our feelings and drive our behaviors. Superhuman AI ‘salespeople’ Of course, human salespeople are interactive and adaptive too. They engage us in friendly dialog to size us up, quickly finding the buttons they can press to sway us. AI agents will make them look like amateurs, able to draw information out of us with such finesse, it would intimidate a seasoned therapist. And they will use these insights to adjust their conversational tactics in real-time, working to persuade us more effectively than any used car salesman. These will be asymmetric encounters in which the artificial agent has the upper hand (virtually speaking). After all, when you engage a human who is trying to influence you, you can usually sense their motives and honesty. It will not be a fair fight with AI agents. They will be able to size you up with superhuman skill, but you won’t be able to size them up at all. That’s because they will look, sound and act so human, we will unconsciously trust them when they smile with empathy and understanding, forgetting that their facial affect is just a simulated façade.  In addition, their voice, vocabulary, speaking style, age, gender, race and facial features are likely to be customized for each of us personally to maximize our receptiveness. And, unlike human salespeople who need to size up each customer from scratch, these virtual entities could have access to stored data about our backgrounds and interests. They could then use this personal data to quickly earn your trust, asking you about your kids, your job or maybe your beloved New York Yankees, easing you into subconsciously letting down your guard. When AI achieves cognitive supremacy To educate policymakers on the risk of AI-powered manipulation, I helped in the making of an award-winning short film entitled Privacy Lost that was produced by the Responsible Metaverse Alliance, Minderoo and the XR Guild. The quick 3-minute narrative depicts a young family eating in a restaurant while wearing autmented reality (AR) glasses. Instead of human servers, avatars take each diner’s orders, using the power of AI to upsell them in personalized ways. The film was considered sci-fi when released in 2023 — yet only two years later, big tech is engaged in an all-out arms race to make AI-powered eyewear that could easily be used in these ways. In addition, we need to consider the psychological impact that will occur when we humans start to believe that the AI agents giving us advice are smarter than us on nearly every front. When AI achieves a perceived state of “cognitive supremacy” with respect to the average person, it will likely cause us to blindly accept its guidance rather than using our own critical thinking. This deference to a perceived superior intelligence (whether truly superior or not) will make agent manipulation that much easier to deploy.   I am not a fan of overly aggressive regulation, but we need smart, narrow restrictions on AI to avoid superhuman manipulation by conversational agents. Without protections, these agents will convince us to buy things we don’t need, believe things that are untrue and accept things that are not in our best interest. It’s easy to tell yourself you won’t be susceptible, but with AI optimizing every word they say to us, it is likely we will all be outmatched. One solution is to ban AI agents from establishing feedback loops in which they optimize their persuasiveness by analyzing our reactions and repeatedly adjusting their tactics. In addition, AI agents should be required to inform you of their objectives. If their goal is to convince you to buy a car, vote for a politician or pressure your family doctor for a new medication, those objectives should be stated up front. And finally, AI agents should not have access to personal data about your background, interests or personality if such data can be used to sway you.   In today’s world, targeted influence is an overwhelming problem, and it is mostly deployed as buckshot fired in your general direction. Interactive AI agents will turn targeted influence into heat-seeking missiles that find the best path into each of us. If we don’t protect against this risk, I fear we could all lose the game of humans. Louis Rosenberg is a computer scientist and author known who pioneered mixed reality and founded Unanimous AI. DataDecisionMakers Welcome to the VentureBeat community! DataDecisionMakers is where experts, including the technical people doing data work, can share data-related insights and innovation. If you want to read about cutting-edge ideas and up-to-date information, best practices, and the future of data and data tech, join us at DataDecisionMakers. You might even consider contributing an article of your own! Read More From DataDecisionMakers",
  "image": "https://venturebeat.com/wp-content/uploads/2025/02/image1.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2025-02-16T20:40:00+00:00\" datetime=\"2025-02-16T20:40:00+00:00\"\u003eFebruary 16, 2025 12:40 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"426\" src=\"https://venturebeat.com/wp-content/uploads/2025/02/image1.jpg?w=750\" alt=\"Rosenberg/Dall-E\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eRosenberg/Dall-E\u003c/span\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. \u003ca href=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\" data-type=\"link\" data-id=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\"\u003eLearn More\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003eWhen I was a kid there were four \u003ca href=\"https://venturebeat.com/ai/why-context-aware-ai-agents-will-give-us-superpowers-in-2025/\"\u003eAI agents\u003c/a\u003e in my life. Their names were Inky, Blinky, Pinky and Clyde and they tried their best to hunt me down. This was the 1980s and the agents were the four colorful ghosts in the iconic arcade game Pac-Man.\u003c/p\u003e\n\n\n\n\u003cp\u003eBy today’s standards they weren’t particularly smart, yet they seemed to pursue me with cunning and intent. This was decades before \u003ca href=\"https://venturebeat.com/ai/googles-new-neural-net-architecture-separates-memory-components-to-control-exploding-costs/\"\u003eneural networks\u003c/a\u003e were used in video games, so their behaviors were controlled by simple algorithms called heuristics that dictate how they would chase me around the maze.  \u003c/p\u003e\n\n\n\n\u003cp\u003eMost people don’t realize this, but the four ghosts were designed with different “\u003ca href=\"https://pacman.fandom.com/wiki/Maze_Ghost_AI_Behaviors\" target=\"_blank\" rel=\"noreferrer noopener\"\u003epersonalities\u003c/a\u003e.” Good players can observe their actions and learn to predict their behaviors. For example, the red ghost (Blinky) was programmed with a “pursuer” personality that charges directly towards you. The pink ghost (Pinky) on the other hand, was given an “ambusher” personality that predicts where you’re going and tries to get there first. As a result, if you rush directly at Pinky, you can use her personality against her, causing her to actually turn away from you.\u003c/p\u003e\n\n\n\n\u003cp\u003eI reminisce because in 1980 a skilled human could observe these AI agents, decode their unique personalities and use those insights to outsmart them. Now, 45 years later, the tides are about to turn. Like it or not, AI agents will soon be deployed that are tasked with decoding your \u003cem\u003epersonality\u003c/em\u003e so they can use those insights to \u003ca href=\"https://arxiv.org/abs/2306.11748\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eoptimally influence\u003c/a\u003e you.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-future-of-ai-manipulation\"\u003eThe future of AI manipulation\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn other words, we are all about to become unwitting players in “The game of humans” and it will be the AI agents trying to earn the high score. I mean this literally — most AI systems are designed to maximize a “\u003ca href=\"https://en.wikipedia.org/wiki/Reinforcement_learning\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ereward function\u003c/a\u003e” that earns points for achieving objectives. This allows AI systems to quickly find optimal solutions. Unfortunately, without regulatory protections, we humans will likely become the objective that AI agents are \u003ca href=\"https://venturebeat.com/ai/enter-the-whisperverse-how-ai-voice-agents-will-guide-us-through-our-days/\"\u003etasked with optimizing\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003eI am most concerned about the \u003ca href=\"https://arxiv.org/pdf/2202.03164\" target=\"_blank\" rel=\"noreferrer noopener\"\u003econversational agents\u003c/a\u003e that will engage us in friendly dialog throughout our daily lives. They will speak to us through photorealistic avatars on our PCs and phones and soon, through \u003ca href=\"https://www.technologyreview.com/2025/02/05/1110983/whats-next-for-smart-glasses/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAI-powered glasses\u003c/a\u003e that will guide us through our days. Unless there are clear restrictions, these agents will be designed to conversationally probe us for information so they can characterize our temperaments, tendencies, personalities and desires, and use those traits to \u003ca href=\"https://www.researchgate.net/publication/368492998_The_Metaverse_and_Conversational_AI_as_a_Threat_Vector_for_Targeted_Influence\" target=\"_blank\" rel=\"noreferrer noopener\"\u003emaximize their persuasive impact\u003c/a\u003e when working to sell us products, pitch us services or convince us to believe misinformation.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis is called the “\u003ca href=\"https://www.researchgate.net/publication/369355910_The_Manipulation_Problem_Conversational_AI_as_a_Threat_to_Epistemic_Agency\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAI Manipulation Problem\u003c/a\u003e,” and I’ve been warning regulators about the risk \u003ca href=\"https://futurism.com/artificial-intelligence-isnt-intelligence-manipulating-humanity\" target=\"_blank\" rel=\"noreferrer noopener\"\u003esince 2016\u003c/a\u003e. Thus far, policymakers have not taken decisive action, viewing the threat as too far in the future. But now, with the release of Deepseek-R1, the final barrier to widespread deployment of AI agents — the cost of real-time processing — has been greatly reduced. Before this year is out, AI agents will become a new form of targeted media that is so \u003ca href=\"https://ieeexplore.ieee.org/document/9965661\" target=\"_blank\" rel=\"noreferrer noopener\"\u003einteractive and adaptive\u003c/a\u003e, it can optimize its ability to influence our thoughts, guide our feelings and drive our behaviors.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-superhuman-ai-salespeople\"\u003eSuperhuman AI ‘salespeople’\u003c/h2\u003e\n\n\n\n\u003cp\u003eOf course, human salespeople are interactive and adaptive too. They engage us in friendly dialog to size us up, quickly finding the buttons they can press to sway us. \u003ca href=\"https://venturebeat.com/ai/agents-of-manipulation-the-real-ai-risk/\"\u003eAI agents\u003c/a\u003e will make them look like amateurs, able to draw information out of us with such finesse, it would intimidate a seasoned therapist. And they will use these insights to adjust their conversational tactics in real-time, working to \u003ca href=\"https://futurism.com/artificial-intelligence-isnt-intelligence-manipulating-humanity\" target=\"_blank\" rel=\"noreferrer noopener\"\u003epersuade us\u003c/a\u003e more effectively than any used car salesman.\u003c/p\u003e\n\n\n\n\u003cp\u003eThese will be asymmetric encounters in which the artificial agent has the upper hand (virtually speaking). After all, when you engage a human who is trying to influence you, you can usually sense their motives and honesty. It will not be a fair fight with AI agents. They will be able to size you up with superhuman skill, but you won’t be able to size them up at all. That’s because they will look, sound and act so human, we will \u003ca href=\"https://pubmed.ncbi.nlm.nih.gov/35165187/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eunconsciously trust them\u003c/a\u003e when they smile with empathy and understanding, forgetting that their facial affect is just a simulated façade. \u003c/p\u003e\n\n\n\n\u003cp\u003eIn addition, their voice, vocabulary, speaking style, age, gender, race and facial features are likely to be customized for each of us personally to \u003ca href=\"https://arxiv.org/abs/2306.11748\" target=\"_blank\" rel=\"noreferrer noopener\"\u003emaximize our receptiveness\u003c/a\u003e. And, unlike human salespeople who need to size up each customer from scratch, these virtual entities could have access to stored data about our backgrounds and interests. They could then use this personal data to quickly \u003ca href=\"https://bigthink.com/the-future/the-whisperverse-the-future-of-mobile-computing-is-an-ai-voice-inside-your-head/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eearn your trust\u003c/a\u003e, asking you about your kids, your job or maybe your beloved New York Yankees, easing you into subconsciously letting down your guard.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-when-ai-achieves-cognitive-supremacy\"\u003eWhen AI achieves cognitive supremacy\u003c/h2\u003e\n\n\n\n\u003cp\u003eTo educate policymakers on the risk of AI-powered manipulation, I helped in the making of an award-winning short film entitled \u003ca href=\"https://www.privacylost.org/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePrivacy Lost\u003c/a\u003e that was produced by the Responsible Metaverse Alliance, Minderoo and the XR Guild. The quick \u003ca href=\"https://www.youtube.com/watch?v=IsE_Pas2OQU\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e3-minute narrative\u003c/a\u003e depicts a young family eating in a restaurant while wearing autmented reality (AR) glasses. Instead of human servers, avatars take each diner’s orders, using the power of AI to upsell them in personalized ways. The film was considered sci-fi when released in 2023 — yet only two years later, big tech is engaged in an all-out \u003ca href=\"https://www.technologyreview.com/2025/02/05/1110983/whats-next-for-smart-glasses/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003earms race to make AI-powered eyewear\u003c/a\u003e that could easily be used in these ways.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn addition, we need to consider the psychological impact that will occur when we humans start to believe that the AI agents giving us advice are \u003ca href=\"https://venturebeat.com/ai/have-we-reached-peak-human/\"\u003esmarter than us\u003c/a\u003e on nearly every front. When AI achieves a perceived state of “cognitive supremacy” with respect to the average person, it will likely cause us to blindly accept its guidance rather than using our own critical thinking. This deference to a perceived superior intelligence (whether truly superior or not) will make agent manipulation that much easier to deploy.  \u003c/p\u003e\n\n\n\n\u003cp\u003eI am not a fan of overly aggressive regulation, but we need smart, narrow restrictions on AI to avoid \u003ca href=\"https://venturebeat.com/ai/why-generative-ai-is-more-dangerous-than-you-think/\"\u003esuperhuman manipulation\u003c/a\u003e by conversational agents. Without protections, these agents will convince us to buy things we don’t need, believe things that are untrue and accept things that are not in our best interest. It’s easy to tell yourself you won’t be susceptible, but with AI optimizing every word they say to us, it is likely we will all be outmatched.\u003c/p\u003e\n\n\n\n\u003cp\u003eOne solution is to ban AI agents from establishing \u003ca href=\"https://library.xrguild.org/science-and-ethics-council-topics/conversational-agents\" target=\"_blank\" rel=\"noreferrer noopener\"\u003efeedback loops\u003c/a\u003e in which they optimize their persuasiveness by analyzing our reactions and repeatedly adjusting their tactics. In addition, AI agents should be required to inform you of their objectives. If their goal is to convince you to buy a car, vote for a politician or pressure your family doctor for a new medication, those objectives should be stated up front. And finally, AI agents should not have access to personal data about your background, interests or personality if such data can be \u003ca href=\"https://venturebeat.com/ai/the-profound-danger-of-conversational-ai/\"\u003eused to sway you\u003c/a\u003e.  \u003c/p\u003e\n\n\n\n\u003cp\u003eIn today’s world, targeted influence is an overwhelming problem, and it is mostly deployed as buckshot fired in your general direction. Interactive AI agents will turn targeted influence into heat-seeking missiles that find the best path into each of us. If we don’t protect against this risk, I fear we could all lose the game of humans.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eLouis Rosenberg is a computer scientist and author known who pioneered \u003ca href=\"https://spectrum.ieee.org/history-of-augmented-reality\" target=\"_blank\" rel=\"noreferrer noopener\"\u003emixed reality\u003c/a\u003e and founded \u003ca href=\"https://unanimous.ai/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eUnanimous AI\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2736392\"\u003e\n\u003cp\u003e\u003cstrong\u003eDataDecisionMakers\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eWelcome to the VentureBeat community!\u003c/p\u003e\n\n\n\n\u003cp\u003eDataDecisionMakers is where experts, including the technical people doing data work, can share data-related insights and innovation.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you want to read about cutting-edge ideas and up-to-date information, best practices, and the future of data and data tech, join us at DataDecisionMakers.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou might even consider \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://venturebeat.com/guest-posts/\"\u003econtributing an article\u003c/a\u003e of your own!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca rel=\"noreferrer noopener\" href=\"https://venturebeat.com/category/DataDecisionMakers/\" target=\"_blank\"\u003eRead More From DataDecisionMakers\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-02-16T20:40:00Z",
  "modifiedTime": "2025-02-16T20:48:16Z"
}
