{
  "id": "7825d28e-4085-49cb-a0b7-94a3c5f8bb0a",
  "title": "The Hollow Men of Hims",
  "link": "https://www.alexkesin.com/p/the-hollow-men-of-hims",
  "description": "Article URL: https://www.alexkesin.com/p/the-hollow-men-of-hims Comments URL: https://news.ycombinator.com/item?id=44382582 Points: 62 # Comments: 31",
  "author": "quadrin",
  "published": "Wed, 25 Jun 2025 22:59:23 +0000",
  "source": "https://hnrss.org/frontpage",
  "categories": null,
  "byline": "Alex Kesin",
  "length": 22685,
  "excerpt": "An admittedly partial–but deeply troubling–case against America's most brazen medical grift, involving Chinese knockoffs, subscription traps, and prescription gas station sex pills.",
  "siteName": "Alex Kesin's Pharmacopoeia",
  "favicon": "https://substackcdn.com/image/fetch/$s_!yFDM!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb919cd4a-08d0-4e88-9532-4559b0f3f5eb%2Fapple-touch-icon-1024x1024.png",
  "text": "There are two examples of American justice that never fail to warm my heart. The first is how O.J. Simpson walked free after a little light murder. The second is how Hims \u0026 Hers will undoubtedly walk free after theirs—though in fairness to the Juice, at least he didn't claim to be democratizing justice while brandishing the knife.There was a time, not so long ago, when a man who could not perform sexually might visit his doctor in shame, when a woman losing her hair might accept it as the cruel arithmetic of genetics, when the overweight resigned themselves to the pedestrian tyranny of diet and exercise. These conditions deserve treatment—real treatment, from qualified providers who understand both the science and the human cost of sexual dysfunction, hair loss, and obesity. But then—and you can almost hear the angels singing here—Hims \u0026 Hers Health discovered that desperation, properly monetized, could become a billion-dollar enterprise wrapped in the gauzy rhetoric of disruption and accessibility. They were part of a sprawling ecosystem of barely regulated companies that had learned to transform the FDA's good faith into their own profit centers, while maintaining the sort of pious expression one might expect from a Victorian missionary bringing enlightenment to the benighted masses—which, come to think of it, is probably exactly how they see themselves.We threw in Elizabeth Holmes for a lot less—though one suspects her fatal error was not the fraud itself but the transparency of it, the sheer crudeness of promising blood tests that did not work rather than the more sophisticated approach of selling actual drugs through loopholes so baroque that even their exploitation carries a patina of legitimacy.The company's Super Bowl commercial in early 2025—titled \"Sick of the System\"—told us everything we needed to know about the particular pathology it represents. There, between the beer ads and the crypto pitches, Hims positioned itself as David against Big Pharma's Goliath, dramatically blaming \"Big Pharma's price-gouging\" for making effective weight-loss drugs unaffordable while promoting their own cheaper compounded semaglutide as salvation. The irony was not lost on those paying attention—which, given that it was the Super Bowl, was approximately 113 million Americans simultaneously eating nachos and absorbing pharmaceutical propaganda: within weeks, this self-appointed enemy of pharmaceutical greed would partner with Novo Nordisk, the very Danish giant behind the thousand-dollar-a-month Wegovy injections they had just finished condemning.The partnership lasted exactly two months. Which, in fairness to both parties, is longer than most celebrity marriages and roughly equivalent to the lifespan of a mayfly, though considerably less dignified than either.What happened in those eight weeks reveals something essential about the kind of company Hims has become. Even as they shook hands with Novo executives in April 2025—presumably in a conference room with aggressively modern furniture—Hims continued selling what their new partner called \"illegitimate, knockoff versions\" of Wegovy. These were compounded semaglutide injections sourced, according to Novo's investigation, from Chinese suppliers whose quality control standards remained opaque at best and terrifying at worst. Novo Nordisk terminated the deal in June, publicly accusing Hims of \"deceptive marketing\" and breaking their agreement by failing to halt mass promotion of compounded semaglutide. \"We had an agreement that the mass compounding would stop and unfortunately it didn't,\" a Novo VP explained with the kind of corporate understatement that makes one suspect he was restraining himself from more colorful language. \"That's why we ended the partnership.\"From trash talking Novo while bootlegging its drug, to inking a “strategic partnership,” to getting dumped once the compounding scheme got too brazen: Hims has speedrun the full corporate hypocrisy arc in only six short months. And it’s still only June!It was a perfect crystallization of corporate duplicity: promising revolution while profiting from the very system they claimed to oppose, selling Chinese-made compounds while wrapping themselves in the flag of healthcare accessibility. The sort of performance that would make a Renaissance cardinal—a professional class not exactly known for their moral squeamishness—admire its brazen sanctimony.The compounding loophole they exploited tells its own story about regulatory capture and creative interpretation.1 The most damning aspect is not their exploitation of loopholes or their willingness to combine dangerous drug cocktails or even their reliance on unvetted Chinese suppliers. Rather, their perfect understanding of how to manipulate regulatory frameworks created in good faith. The FDA's compounding exemptions were designed to help patients who needed truly customized medications—diabetics requiring non-standard insulin concentrations, children needing liquid formulations, patients allergic to specific inactive ingredients. Hims took these compassionate provisions and turned them into industrial-scale patent circumvention.By adding vitamin B12 to semaglutide, or adjusting dosages slightly, Hims could claim their injections were \"personalized\" rather than mass-produced copies. Pharmaceutical theater, performed for an audience of FDA regulators who had created the framework in good faith for legitimate medical compounding, only to watch it perverted into industrial-scale patent circumvention. The law, as Hims understood it, was not about intent but about technicalities, not about spirit but about the precise arrangement of molecules—a kind of regulatory formalism that would make a Talmudic scholar weep with admiration at its baroque complexity.They are hardly alone in this exploitation of regulatory good faith. Companies like Eden are marketing sermorelin—another peptide hormone—as fitness enhancers with bold taglines like \"Cardio + Strength\" and promises that the compound \"may support HGH production.\" Never mind that sermorelin's original FDA approval was withdrawn not for safety reasons but because the manufacturer simply stopped selling it in 2008. Eden has found a way to resurrect dead drugs through the same compounding loopholes, selling what amounts to pharmaceutical zombies to customers desperate enough to believe that regulatory disappearance was merely an oversight rather than abandonment.The pattern extends beyond peptides. Other outfits continue selling compounds like BPC-157 and follistatin even after the FDA has flagged them as having \"significant safety concerns.\" The regulatory response is always reactive, always behind the curve, always playing catch-up to entrepreneurs who have learned that moving fast and breaking things works just as well in healthcare as it does in Silicon Valley.Regulatory arbitrage disguised as innovation, dressed in the fashionable vocabulary of patient empowerment while serving no master but the quarterly earnings call. The FDA had created pathways for legitimate medical needs, and companies like Hims turned those pathways into profit maximization systems. When Elizabeth Holmes manipulated investors with fake blood tests, she went to prison. When Hims manipulates the compounding exemption to mass-produce patent-dodging weight loss drugs sourced from Chinese suppliers of dubious quality, they continue operating with impunity, their executives appearing on podcasts to discuss their vision for the future of healthcare with the serene confidence of men who have mistaken regulatory capture for moral authority.But perhaps the most telling aspect of the Hims empire lies not in their weight-loss duplicity but in their approach to sexual dysfunction—specifically, their \"Hard Mints,\" chewable tablets combining both sildenafil and tadalafil, the active ingredients in Viagra and Cialis. The pharmaceutical equivalent of putting both ketchup and mustard on a hot dog and calling it gourmet—though one suspects the hot dog vendor would display more honest shame about his craft.What made this particularly grotesque was its resemblance to the infamous \"Rhino\" pills that haunted gas station counters in the early 2000s. Those black-market supplements secretly contained both sildenafil and tadalafil—an illegal combination that sent men to emergency rooms and prompted years of FDA warnings. The agency repeatedly flagged products like \"Rhino SE7EN\" for containing undisclosed pharmaceutical ingredients, noting the dangers especially for men on nitrates or with heart conditions. Hims had essentially taken this discredited gas-station formula, added a dash of vitamin B12 for \"personalization,\" and wrapped it in the legitimacy of prescription telehealth.From bodega counter to VC brochure: the old “Rhino” gas-station cocktail, reincarnated as Hims’ two-in-one, overpriced “Hard Mints.”The medical establishment had good reasons for not combining these drugs: they work through the same mechanism, making their combination redundant at best and dangerous at worst. Both are PDE5 inhibitors that block the same enzyme to increase penile blood flow—taking them together doesn't target different pathways, it simply amplifies the dose and the side effects. But redundancy, in the Hims universe, was rebranded as comprehensiveness, danger as innovation, medical caution as the timid conservatism of an establishment too hidebound to embrace progress.2The company's own blog warns against combining Viagra and Cialis due to risks including \"sudden drops in blood pressure,\" even as they market products that do exactly that. This contradiction—simultaneously cautioning against and profiting from the same practice—would be remarkable if it were not so characteristic of the entire enterprise. Hims has created a business model based on having things both ways: attacking Big Pharma while partnering with it, warning about drug combinations while selling them, claiming personalization while mass-producing. The difference between their \"Hard Mints\" and the gas station pills is not medical sophistication but marketing sophistication—the same dangerous combination, now delivered with a prescription and a smile.The genius of Hims lies in understanding that consumers will pay almost any premium to avoid the humiliation of discussing erectile dysfunction or hair loss with an actual human being. They have identified a market inefficiency—not in drug prices, but in desperation—and built an empire around it. The telehealth consultations are brief by design, the prescriptions automatic, the human interaction minimized. Healthcare as Amazon understands commerce: frictionless, algorithmic, optimized for conversion rather than care.This becomes clear when examining their pricing structure, perhaps the most audacious aspect of the entire operation. The drugs Hims prescribes are, in most cases, generic medications that have been available for decades—pharmaceutical workhorses that have been around so long they've practically entered the public domain of human consciousness. Sildenafil, the active ingredient in Viagra, costs roughly $2-4 per pill through traditional pharmacies like Amazon Pharmacy or GoodRx—sometimes even less with insurance. Finasteride for hair loss runs about $10-15 per month as a generic, and can cost as little as $2 per month with a GoodRx coupon.Yet Hims charges $79 per month for \"personalized kits\" of these same compounds, locking customers into ten-month advance payments. Their own website admits that finasteride \"usually costs between $20 and $60\" depending on where you buy, then pegs their own price at $22 per month—still dramatically more expensive than alternatives, but who's counting when you're disrupting the healthcare-industrial complex one follicle at a time? The premium isn't for better drugs or better care—it's for the privilege of avoiding human interaction while receiving inferior medical oversight, like paying extra for a luxury hotel room that turns out to be a closet with a cot.Customer complaints reveal the true scope of the extraction: users reporting being charged $300-400 immediately after brief online questionnaires that appear to have been designed by someone who learned about medicine from WebMD and customer service from a DMV training manual. Sometimes they're \"approved in 1 minute\" with no live doctor interaction—which is either remarkably efficient healthcare or remarkably efficient fraud, depending on your perspective. One Reddit user recounted: \"Didn't talk to a single doctor and was charged $395!!! … Approved in 1 min by checking some boxes and then charged within 5 min.\" One customer spent $3,588 on a weight-loss subscription only to discover the drugs made them violently ill. When they sought a refund, they learned what many customers learn too late: that convenience and customer service are not the same thing.The workflow appears to be heavily automated to convert questionnaire answers into instant prescriptions and bill customers' cards within minutes—a system so streamlined it makes Amazon's one-click purchasing look positively cumbersome by comparison. Most would find this whole process totally irresponsible, though one suspects Hims would prefer the term \"innovatively frictionless\" or perhaps \"patient-experience-optimized,\" because nothing says quality healthcare like removing all the inconvenient parts involving actual medical judgment.But the subscription traps are where the real extraction occurs—and here we encounter the kind of business model innovation that would make a mobster tip his hat in professional admiration. Customers complain of being locked into year-long commitments they can't escape, like hotel California but with erectile dysfunction pills. Better Business Bureau complaints reveal the pattern with the reliability of a Swiss timepiece: customers who pause subscriptions for six months only to have Hims automatically resume billing without warning, charging $85 \"out of the blue.\" Others discovered they had been auto-enrolled in recurring shipments without notification, a practice that combines the worst aspects of subscription boxes with the medical necessity of prescription drugs. Picture ordering a 3-month hair loss kit only to find Hims has shipped and charged for a fourth without consent, like a pharmaceutical version of that friend who keeps ordering shots when you've already said you're driving.When they try to cancel immediately—because apparently \"immediately\" is a foreign concept in subscription-land—Hims refuses refunds because the product has already shipped. It's customer service that makes dealing with your cable company seem like a zen meditation retreat.The irony is that Amazon itself offers many of these same medications at a fraction of the cost, with actual pharmacists available for consultation and no year-long subscription traps—but Amazon doesn't market shame as a premium service.What makes their \"oral weight loss kits\" particularly grotesque is their shotgun approach to pharmacology.3 Rather than prescribing one medication and monitoring its effects, Hims combines three or four different drugs into cocktails that have never been tested together—what they call \"personalized kits\" that can \"include a combination of bupropion, metformin, topiramate, vitamin B12, and naltrexone,\" taken once or twice daily. Pharmaceutical gambling with customer health.While each medication is sometimes used individually for weight management, or in known FDA-approved pairings like bupropion plus naltrexone (Contrave), Hims goes further. One user described being prescribed a triple regimen: bupropion XL every morning, plus a naltrexone + B12 tablet each morning, with metformin to be added later. The patient experienced severe side effects within hours: \"massive headaches\" followed by repeated vomiting for hours. They were so sick they had to stop and consult the provider, who then advised re-introducing the drugs one by one more gradually.A single generic pill might cost a few dollars; a \"personalized kit\" of multiple medications can command $79 per month, paid ten months in advance—pricing that would make a defense contractor weep with envy at its elegant extraction of desperation premiums.The (alleged) Chinese sourcing of their semaglutide represents the logical endpoint of this philosophy, but it also connects Hims to a broader supply chain that has learned to exploit regulatory gaps. When Novo Nordisk investigated, they found that \"ingredients in knock-off drugs sold by telehealth entities and compounding pharmacies are manufactured by foreign suppliers in China,\" with much of that supply never inspected or approved by the FDA. Novo warned that \"U.S. patients should not be exposed to knock-off drugs made with unsafe and illicit foreign ingredients.\"Why pay for FDA-approved ingredients when unregulated Chinese suppliers can provide the same molecule at a fraction of the cost? The safety implications are abstract - the profit margins are concrete. Hims can offer compounded semaglutide for $165-199 per month versus over $1,000 monthly for brand-name Wegovy, but this cost-cutting comes with potential safety trade-offs that neither Hims nor its pharmacy partners can guarantee against.While they market weight-loss shots, other companies push even more brazen products: Adrafül Labs has created an \"adrafinil productivity energy drink\" combining adrafinil–an unapproved prescription stimulant—in a 12-ounce canned beverage. The company positions this as a cognitive enhancement product, though the FDA has previously indicated concerns about adrafinil in dietary supplements (1, 2, 3, 4). Adrafül packages their formulation with beverage-like branding while making claims about \"executive-function boost,\" creating what regulators might view as a product that straddles multiple regulatory categories without fitting neatly into any single framework.To be clear, these are not prudish objections to treating erectile dysfunction, hair loss, or obesity—these are real medical conditions that cause genuine suffering and deserve effective treatment. Nor are these Luddite objections to loosening direct-to-consumer medical access—in theory, such expansion represents a net good: more people treated, fewer bureaucratic hoops, less institutional inertia. The problem lies not in people wanting these treatments but in Hims representing the worst possible way to provide them: sanctimonious, slippery, ethics-as-marketing-until-it-becomes-inconvenient. They market virtue and sell vanity. They pantomime trust while systematically gutting it. There is a certain smarmy self-regard that proves hard to pin down but impossible to ignore; they are not evil, exactly—just hollow, and worse: pleased with themselves about it. One imagines their executives possess the peculiar moral confidence of the megachurch pastor who has convinced himself that his private jet serves the Lord's work, combined with the dead-eyed certitude of the middle manager who has successfully optimized human suffering into quarterly growth metrics. This is the banality of disruption: evil made efficient, hypocrisy made scalable, mendacity made into a mission statement.The entire ecosystem reveals itself to be interconnected—Hims with their compounded semaglutide, Eden with their resurrected sermorelin, Adrafül with their stimulant energy drinks, and dozens of others exploiting the same regulatory frameworks. They have collectively transformed legitimate medical exemptions into profit centers, where the line between necessary compounding and sophisticated patent evasion has been deliberately obscured, where venture capital flows toward companies that have learned to monetize regulatory good faith rather than actually solve medical problems.The FTC has tried to keep pace, mass-mailing warnings to 700 marketers about unsubstantiated health claims; but these enforcement efforts feel perpetually behind the curve in an economy where regulatory complexity has become a competitive advantage, where the time lag between innovation and oversight creates profitable windows of ambiguity.In the end, Hims is not an aberration but a culmination—the logical result of what happens when regulatory frameworks designed to help patients get exploited by companies determined to help themselves. They have simply completed the transformation, turning medicine into another form of direct-to-consumer retail, patients into subscribers, side effects into customer service issues. And they have done all this while maintaining the sort of earnest expression one might expect from a startup founder explaining how their app will solve human loneliness by optimizing social interactions through machine learning algorithms.The real tragedy is not that Hims exists, but that it works so perfectly. Every day, thousands of people choose their compounded weight-loss drugs over FDA-approved alternatives, their combination ED pills over established single-ingredient treatments, their algorithmic consultations over actual medical care. They make these choices not because the products are better, but because the entire experience has been optimized to feel more like shopping and less like confronting the mortality and vulnerability that define the human condition. This is what disruption looks like when applied to the oldest human needs: not improvement, but the illusion of improvement, packaged in the familiar aesthetics of technological progress and sold to a population that has been taught to confuse convenience with care, innovation with integrity, and the availability of options with the presence of actual choice.Like Upton Sinclair's meatpacking plants, these companies have taken something essential—in this case, the trust between regulator and regulated that makes modern medicine possible—and corrupted it for profit. The only difference is that instead of adulterating our food, they are adulterating our pharmaceuticals, and instead of hiding behind industrial secrecy, they are hiding behind the complexity of modern drug regulation. But the fundamental dynamic remains the same: companies gaming a system built on good faith, regulators playing catch-up to bad actors, and consumers paying the price for both the corruption and the cleanup. The irony is that while Sinclair's exposé led to the Pure Food and Drug Act of 1906, our modern pharmaceutical jungle continues to flourish under regulations that have become so complex they serve as cover rather than constraint, so sophisticated they enable the very abuses they were designed to prevent.Discussion about this post",
  "image": "https://substackcdn.com/image/fetch/$s_!iLoB!,w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle\u003e\u003cdiv dir=\"auto\"\u003e\u003cdiv\u003e\u003cfigure\u003e\u003ca target=\"_blank\" href=\"https://substackcdn.com/image/fetch/$s_!iLoB!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png\" data-component-name=\"Image2ToDOM\" rel=\"\"\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/$s_!iLoB!,w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png 424w, https://substackcdn.com/image/fetch/$s_!iLoB!,w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png 848w, https://substackcdn.com/image/fetch/$s_!iLoB!,w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png 1272w, https://substackcdn.com/image/fetch/$s_!iLoB!,w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png 1456w\" sizes=\"100vw\"/\u003e\u003cimg src=\"https://substackcdn.com/image/fetch/$s_!iLoB!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png\" width=\"934\" height=\"444\" data-attrs=\"{\u0026#34;src\u0026#34;:\u0026#34;https://substack-post-media.s3.amazonaws.com/public/images/23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png\u0026#34;,\u0026#34;srcNoWatermark\u0026#34;:null,\u0026#34;fullscreen\u0026#34;:null,\u0026#34;imageSize\u0026#34;:null,\u0026#34;height\u0026#34;:444,\u0026#34;width\u0026#34;:934,\u0026#34;resizeWidth\u0026#34;:null,\u0026#34;bytes\u0026#34;:679543,\u0026#34;alt\u0026#34;:null,\u0026#34;title\u0026#34;:null,\u0026#34;type\u0026#34;:\u0026#34;image/png\u0026#34;,\u0026#34;href\u0026#34;:null,\u0026#34;belowTheFold\u0026#34;:false,\u0026#34;topImage\u0026#34;:true,\u0026#34;internalRedirect\u0026#34;:\u0026#34;https://www.alexkesin.com/i/166774057?img=https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png\u0026#34;,\u0026#34;isProcessing\u0026#34;:false,\u0026#34;align\u0026#34;:null,\u0026#34;offset\u0026#34;:false}\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/$s_!iLoB!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png 424w, https://substackcdn.com/image/fetch/$s_!iLoB!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png 848w, https://substackcdn.com/image/fetch/$s_!iLoB!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png 1272w, https://substackcdn.com/image/fetch/$s_!iLoB!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F23a83298-b69c-4e8c-a12f-ddee32fbfbd4_934x444.png 1456w\" sizes=\"100vw\" fetchpriority=\"high\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eThere are two examples of American justice that never fail to warm my heart. The first is how O.J. Simpson walked free after a little light murder. The second is how Hims \u0026amp; Hers will undoubtedly walk free after theirs—though in fairness to the Juice, at least he didn\u0026#39;t claim to be democratizing justice while brandishing the knife.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThere was a time, not so long ago, when a \u003c/span\u003e\u003ca href=\"https://www.youtube.com/watch?v=oMeulTWdqiY\u0026amp;pp=0gcJCdgAo7VqN5tD\" rel=\"\"\u003eman who could not perform sexually \u003c/a\u003e\u003cspan\u003emight visit his doctor in shame, when a woman losing her hair might accept it as the cruel arithmetic of genetics, when the overweight resigned themselves to the pedestrian tyranny of diet and exercise. These conditions deserve treatment—real treatment, from qualified providers who understand both the science and the human cost of sexual dysfunction, hair loss, and obesity. But then—and you can almost hear the angels singing here—Hims \u0026amp; Hers Health discovered that desperation, properly monetized, could become a billion-dollar enterprise wrapped in the gauzy rhetoric of disruption and accessibility. They were part of a sprawling ecosystem of barely regulated companies that had learned to transform the FDA\u0026#39;s good faith into their own profit centers, while maintaining the sort of pious expression one might expect from a Victorian missionary bringing enlightenment to the benighted masses—which, come to think of it, is probably exactly how they see themselves.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eWe threw in Elizabeth Holmes for a lot less—though one suspects her fatal error was not the fraud itself but the transparency of it, the sheer crudeness of promising blood tests that did not work rather than the more sophisticated approach of selling actual drugs through loopholes so baroque that even their exploitation carries a patina of legitimacy.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe company\u0026#39;s Super Bowl commercial in early 2025—titled \u003c/span\u003e\u003ca href=\"https://www.youtube.com/watch?v=mFtKnRPq8sE\" rel=\"\"\u003e\u0026#34;Sick of the System\u0026#34;\u003c/a\u003e\u003cspan\u003e—told us everything we needed to know about the particular pathology it represents. There, between the beer ads and the crypto pitches, Hims positioned itself as David against Big Pharma\u0026#39;s Goliath, dramatically blaming \u0026#34;Big Pharma\u0026#39;s price-gouging\u0026#34; for making effective weight-loss drugs unaffordable while promoting their own cheaper compounded semaglutide as salvation. The irony was not lost on those paying attention—which, given that it was the Super Bowl, was approximately 113 million Americans simultaneously eating nachos and absorbing pharmaceutical propaganda: within weeks, this self-appointed enemy of pharmaceutical greed \u003c/span\u003e\u003ca href=\"https://www.reuters.com/business/healthcare-pharmaceuticals/hims-hers-partners-with-novo-nordisk-sell-wegovy-its-platform-2025-04-29/\" rel=\"\"\u003ewould partner with Novo Nordisk,\u003c/a\u003e\u003cspan\u003e the very Danish giant behind the thousand-dollar-a-month Wegovy injections they had just finished condemning.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.cbsnews.com/news/novo-nordisk-hims-hers-wegovy-weight-loss-drugs/\" rel=\"\"\u003eThe partnership lasted exactly two months.\u003c/a\u003e\u003cspan\u003e Which, in fairness to both parties, is longer than most celebrity marriages and roughly equivalent to the lifespan of a mayfly, though considerably less dignified than either.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhat happened in those eight weeks reveals something essential about the kind of company Hims has become. Even as they shook hands with Novo executives in April 2025—presumably in a conference room with aggressively modern furniture—Hims continued selling what their new partner called \u0026#34;illegitimate, knockoff versions\u0026#34; of Wegovy. These were compounded semaglutide injections sourced, according to Novo\u0026#39;s investigation, from Chinese suppliers whose quality control standards remained opaque at best and terrifying at worst. Novo Nordisk terminated the deal in June, publicly accusing Hims of \u0026#34;deceptive marketing\u0026#34; and breaking their agreement by failing to halt mass promotion of compounded semaglutide. \u0026#34;We had an agreement that the mass compounding would stop and unfortunately it didn\u0026#39;t,\u0026#34; a Novo VP \u003c/span\u003e\u003ca href=\"https://www.latimes.com/business/story/2025-06-24/novo-exits-hims-hers-partnership-citing-concerns-over-compounded-drugs#:~:text=%E2%80%9CThe%20big%20issue%20with%20Hims%20is%20that%20we%20had%20an%20agreement%20that%20the%20mass%20compounding%20would%20stop%20and%20unfortunately%20it%20didn%E2%80%99t%20stop%2C%E2%80%9D\" rel=\"\"\u003eexplained\u003c/a\u003e\u003cspan\u003e with the kind of corporate understatement that makes one suspect he was restraining himself from more colorful language. \u0026#34;That\u0026#39;s why we ended the partnership.\u0026#34;\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003ca target=\"_blank\" href=\"https://substackcdn.com/image/fetch/$s_!M4cv!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5f182ea8-6c33-432f-9fa3-281a1a5dce00_2120x2325.png\" data-component-name=\"Image2ToDOM\" rel=\"\"\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/$s_!M4cv!,w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5f182ea8-6c33-432f-9fa3-281a1a5dce00_2120x2325.png 424w, https://substackcdn.com/image/fetch/$s_!M4cv!,w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5f182ea8-6c33-432f-9fa3-281a1a5dce00_2120x2325.png 848w, https://substackcdn.com/image/fetch/$s_!M4cv!,w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5f182ea8-6c33-432f-9fa3-281a1a5dce00_2120x2325.png 1272w, https://substackcdn.com/image/fetch/$s_!M4cv!,w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5f182ea8-6c33-432f-9fa3-281a1a5dce00_2120x2325.png 1456w\" sizes=\"100vw\"/\u003e\u003cimg src=\"https://substackcdn.com/image/fetch/$s_!M4cv!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5f182ea8-6c33-432f-9fa3-281a1a5dce00_2120x2325.png\" width=\"2120\" height=\"2325\" data-attrs=\"{\u0026#34;src\u0026#34;:\u0026#34;https://substack-post-media.s3.amazonaws.com/public/images/5f182ea8-6c33-432f-9fa3-281a1a5dce00_2120x2325.png\u0026#34;,\u0026#34;srcNoWatermark\u0026#34;:null,\u0026#34;fullscreen\u0026#34;:null,\u0026#34;imageSize\u0026#34;:null,\u0026#34;height\u0026#34;:2325,\u0026#34;width\u0026#34;:2120,\u0026#34;resizeWidth\u0026#34;:null,\u0026#34;bytes\u0026#34;:2285652,\u0026#34;alt\u0026#34;:\u0026#34;Output image\u0026#34;,\u0026#34;title\u0026#34;:null,\u0026#34;type\u0026#34;:\u0026#34;image/png\u0026#34;,\u0026#34;href\u0026#34;:null,\u0026#34;belowTheFold\u0026#34;:false,\u0026#34;topImage\u0026#34;:false,\u0026#34;internalRedirect\u0026#34;:null,\u0026#34;isProcessing\u0026#34;:false,\u0026#34;align\u0026#34;:null,\u0026#34;offset\u0026#34;:false}\" alt=\"Output image\" title=\"Output image\" srcset=\"https://substackcdn.com/image/fetch/$s_!M4cv!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5f182ea8-6c33-432f-9fa3-281a1a5dce00_2120x2325.png 424w, https://substackcdn.com/image/fetch/$s_!M4cv!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5f182ea8-6c33-432f-9fa3-281a1a5dce00_2120x2325.png 848w, https://substackcdn.com/image/fetch/$s_!M4cv!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5f182ea8-6c33-432f-9fa3-281a1a5dce00_2120x2325.png 1272w, https://substackcdn.com/image/fetch/$s_!M4cv!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5f182ea8-6c33-432f-9fa3-281a1a5dce00_2120x2325.png 1456w\" sizes=\"100vw\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003c/a\u003e\u003cfigcaption\u003eFrom trash talking Novo while bootlegging its drug, to inking a “strategic partnership,” to getting dumped once the compounding scheme got too brazen: Hims has speedrun the full corporate hypocrisy arc in only six short months. And it’s still only June!\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eIt was a perfect crystallization of corporate duplicity: promising revolution while profiting from the very system they claimed to oppose, selling Chinese-made compounds while wrapping themselves in the flag of healthcare accessibility. The sort of performance that would make a Renaissance cardinal—a professional class not exactly known for their moral squeamishness—admire its brazen sanctimony.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe compounding loophole they exploited tells its own story about regulatory capture and creative interpretation.\u003c/span\u003e\u003cspan\u003e\u003ca data-component-name=\"FootnoteAnchorToDOM\" id=\"footnote-anchor-1-166774057\" href=\"https://www.alexkesin.com/p/the-hollow-men-of-hims#footnote-1-166774057\" target=\"_self\" rel=\"\"\u003e1\u003c/a\u003e\u003c/span\u003e\u003cspan\u003e  The most damning aspect is not their exploitation of loopholes or their willingness to combine dangerous drug cocktails or even their reliance on unvetted Chinese suppliers. Rather, their perfect understanding of how to manipulate regulatory frameworks created in good faith. The FDA\u0026#39;s compounding exemptions were designed to help patients who needed truly customized medications—diabetics requiring non-standard insulin concentrations, children needing liquid formulations, patients allergic to specific inactive ingredients. Hims took these compassionate provisions and turned them into industrial-scale patent circumvention.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eBy adding vitamin B12 to semaglutide, or adjusting dosages slightly, Hims could claim their injections were \u0026#34;personalized\u0026#34; rather than mass-produced copies. Pharmaceutical theater, performed for an audience of FDA regulators who had created the framework in good faith for legitimate medical compounding, only to watch it perverted into industrial-scale patent circumvention. The law, as Hims understood it, was not about intent but about technicalities, not about spirit but about the precise arrangement of molecules—a kind of regulatory formalism that would make a Talmudic scholar weep with admiration at its baroque complexity.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThey are hardly alone in this exploitation of regulatory good faith. Companies like Eden are marketing \u003c/span\u003e\u003ca href=\"https://archive.is/7h5PZ\" rel=\"\"\u003esermorelin\u003c/a\u003e\u003cspan\u003e—another peptide hormone—as fitness enhancers with bold taglines like \u0026#34;Cardio + Strength\u0026#34; and promises that the compound \u0026#34;may support HGH production.\u0026#34; Never mind that \u003c/span\u003e\u003ca href=\"https://www.federalregister.gov/documents/2013/03/04/2013-04827/determination-that-geref-sermorelin-acetate-injection-05-milligrams-basevial-and-10-milligrams\" rel=\"\"\u003esermorelin\u0026#39;s original FDA approval was withdrawn\u003c/a\u003e\u003cspan\u003e not for safety reasons but because the manufacturer simply stopped selling it in 2008. Eden has found a way to resurrect dead drugs through the same compounding loopholes, selling what amounts to pharmaceutical zombies to customers desperate enough to believe that regulatory disappearance was merely an oversight rather than abandonment.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe pattern extends beyond peptides. Other outfits continue selling compounds like BPC-157 and follistatin even after the FDA has \u003c/span\u003e\u003ca href=\"https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/warning-letters/tailor-made-compounding-llc-594743-04012020?\" rel=\"\"\u003eflagged them\u003c/a\u003e\u003cspan\u003e as having \u0026#34;significant safety concerns.\u0026#34; The regulatory response is always reactive, always behind the curve, always playing catch-up to entrepreneurs who have learned that moving fast and breaking things works just as well in healthcare as it does in Silicon Valley.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eRegulatory arbitrage disguised as innovation, dressed in the fashionable vocabulary of patient empowerment while serving no master but the quarterly earnings call. The FDA had created pathways for legitimate medical needs, and companies like Hims turned those pathways into profit maximization systems. When Elizabeth Holmes manipulated investors with fake blood tests, she went to prison. When Hims manipulates the compounding exemption to mass-produce patent-dodging weight loss drugs sourced from Chinese suppliers of dubious quality, they continue operating with impunity, their executives appearing on podcasts to discuss their vision for the future of healthcare with the serene confidence of men who have mistaken regulatory capture for moral authority.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBut perhaps the most telling aspect of the Hims empire lies not in their weight-loss duplicity but in their approach to sexual dysfunction—specifically, their \u003c/span\u003e\u003ca href=\"https://archive.is/LcbRB\" rel=\"\"\u003e\u0026#34;Hard Mints,\u0026#34;\u003c/a\u003e\u003cspan\u003e chewable tablets combining both sildenafil and tadalafil, the active ingredients in Viagra and Cialis. The pharmaceutical equivalent of putting both ketchup and mustard on a hot dog and calling it gourmet—though one suspects the hot dog vendor would display more honest shame about his craft.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhat made this particularly grotesque was its resemblance to the infamous \u0026#34;Rhino\u0026#34; pills that haunted gas station counters in the early 2000s. Those black-market supplements secretly contained both sildenafil and tadalafil—an illegal combination that sent men to emergency rooms and prompted years of FDA warnings. The agency repeatedly flagged products like \u003c/span\u003e\u003ca href=\"https://www.fda.gov/drugs/medication-health-fraud/public-notification-rhino-se7en2-contains-hidden-drug-ingredients#:~:text=FDA%20laboratory%20analysis%20confirmed%20that,heart%20disease%20often%20take%20nitrates\" rel=\"\"\u003e\u0026#34;Rhino SE7EN\u0026#34;\u003c/a\u003e\u003cspan\u003e for containing undisclosed pharmaceutical ingredients, noting the dangers especially for men on nitrates or with heart conditions. Hims had essentially taken this discredited gas-station formula, added a dash of vitamin B12 for \u0026#34;personalization,\u0026#34; and wrapped it in the legitimacy of prescription telehealth.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003ca target=\"_blank\" href=\"https://substackcdn.com/image/fetch/$s_!I1fI!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0358dd11-a104-4b80-afc3-b5e1a9efd08f_1405x880.bin\" data-component-name=\"Image2ToDOM\" rel=\"\"\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/$s_!I1fI!,w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0358dd11-a104-4b80-afc3-b5e1a9efd08f_1405x880.bin 424w, https://substackcdn.com/image/fetch/$s_!I1fI!,w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0358dd11-a104-4b80-afc3-b5e1a9efd08f_1405x880.bin 848w, https://substackcdn.com/image/fetch/$s_!I1fI!,w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0358dd11-a104-4b80-afc3-b5e1a9efd08f_1405x880.bin 1272w, https://substackcdn.com/image/fetch/$s_!I1fI!,w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0358dd11-a104-4b80-afc3-b5e1a9efd08f_1405x880.bin 1456w\" sizes=\"100vw\"/\u003e\u003cimg src=\"https://substackcdn.com/image/fetch/$s_!I1fI!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0358dd11-a104-4b80-afc3-b5e1a9efd08f_1405x880.bin\" width=\"1405\" height=\"880\" data-attrs=\"{\u0026#34;src\u0026#34;:\u0026#34;https://substack-post-media.s3.amazonaws.com/public/images/0358dd11-a104-4b80-afc3-b5e1a9efd08f_1405x880.bin\u0026#34;,\u0026#34;srcNoWatermark\u0026#34;:null,\u0026#34;fullscreen\u0026#34;:null,\u0026#34;imageSize\u0026#34;:null,\u0026#34;height\u0026#34;:880,\u0026#34;width\u0026#34;:1405,\u0026#34;resizeWidth\u0026#34;:null,\u0026#34;bytes\u0026#34;:null,\u0026#34;alt\u0026#34;:\u0026#34;Output image\u0026#34;,\u0026#34;title\u0026#34;:null,\u0026#34;type\u0026#34;:null,\u0026#34;href\u0026#34;:null,\u0026#34;belowTheFold\u0026#34;:true,\u0026#34;topImage\u0026#34;:false,\u0026#34;internalRedirect\u0026#34;:null,\u0026#34;isProcessing\u0026#34;:false,\u0026#34;align\u0026#34;:null,\u0026#34;offset\u0026#34;:false}\" alt=\"Output image\" title=\"Output image\" srcset=\"https://substackcdn.com/image/fetch/$s_!I1fI!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0358dd11-a104-4b80-afc3-b5e1a9efd08f_1405x880.bin 424w, https://substackcdn.com/image/fetch/$s_!I1fI!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0358dd11-a104-4b80-afc3-b5e1a9efd08f_1405x880.bin 848w, https://substackcdn.com/image/fetch/$s_!I1fI!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0358dd11-a104-4b80-afc3-b5e1a9efd08f_1405x880.bin 1272w, https://substackcdn.com/image/fetch/$s_!I1fI!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F0358dd11-a104-4b80-afc3-b5e1a9efd08f_1405x880.bin 1456w\" sizes=\"100vw\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003c/a\u003e\u003cfigcaption\u003eFrom bodega counter to VC brochure: the old “Rhino” gas-station cocktail, reincarnated as Hims’ two-in-one, overpriced “Hard Mints.”\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eThe medical establishment had good reasons for not combining these drugs: they work through the same mechanism, making their combination redundant at best and dangerous at worst. Both are PDE5 inhibitors that block the same enzyme to increase penile blood flow—taking them together doesn\u0026#39;t target different pathways, it simply amplifies the dose and the side effects. But redundancy, in the Hims universe, was rebranded as comprehensiveness, danger as innovation, medical caution as the timid conservatism of an establishment too hidebound to embrace progress.\u003c/span\u003e\u003cspan\u003e\u003ca data-component-name=\"FootnoteAnchorToDOM\" id=\"footnote-anchor-2-166774057\" href=\"https://www.alexkesin.com/p/the-hollow-men-of-hims#footnote-2-166774057\" target=\"_self\" rel=\"\"\u003e2\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe company\u0026#39;s own blog \u003c/span\u003e\u003ca href=\"https://www.hims.com/blog/viagra-cialis-together#:~:text=While%20it%E2%80%99s%20not,for%20a%20reason.\" rel=\"\"\u003ewarns against combining Viagra and Cialis\u003c/a\u003e\u003cspan\u003e due to risks including \u0026#34;sudden drops in blood pressure,\u0026#34; even as they market products that do exactly that. This contradiction—simultaneously cautioning against and profiting from the same practice—would be remarkable if it were not so characteristic of the entire enterprise. Hims has created a business model based on having things both ways: attacking Big Pharma while partnering with it, warning about drug combinations while selling them, claiming personalization while mass-producing. The difference between their \u0026#34;Hard Mints\u0026#34; and the gas station pills is not medical sophistication but marketing sophistication—the same dangerous combination, now delivered with a prescription and a smile.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThe genius of Hims lies in understanding that consumers will pay almost any premium to avoid the humiliation of discussing erectile dysfunction or hair loss with an actual human being. They have identified a market inefficiency—not in drug prices, but in desperation—and built an empire around it. The telehealth consultations are brief by design, the prescriptions automatic, the human interaction minimized. Healthcare as Amazon understands commerce: frictionless, algorithmic, optimized for conversion rather than care.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThis becomes clear when examining their pricing structure, perhaps the most audacious aspect of the entire operation. The drugs Hims prescribes are, in most cases, generic medications that have been available for decades—pharmaceutical workhorses that have been around so long they\u0026#39;ve practically entered the public domain of human consciousness. Sildenafil, the active ingredient in Viagra, costs roughly $2-4 per pill through traditional pharmacies like Amazon Pharmacy or GoodRx—sometimes even less with insurance. Finasteride for hair loss runs about $10-15 per month as a generic, and can cost \u003c/span\u003e\u003ca href=\"https://www.goodrx.com/finasteride?srsltid=AfmBOoqaHtXibwJm3AhNWyD0BbANfTH6rStfu5aAAxKeFM0krZLK3-xY#:~:text=lower\" rel=\"\"\u003eas little as $2 per month with a GoodRx coupon.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eYet Hims charges $79 per month for \u0026#34;personalized kits\u0026#34; of these same compounds, locking customers into ten-month advance payments. Their own website admits that finasteride \u0026#34;usually costs between $20 and $60\u0026#34; depending on where you buy, then pegs their own price at \u003c/span\u003e\u003ca href=\"https://www.hims.com/blog/finasteride-costs-pricing-guide#:~:text=But%20how%20much%20is%20finasteride%3F,by%20various%20brands%2C%20including%20Hims\" rel=\"\"\u003e$22 per month\u003c/a\u003e\u003cspan\u003e—still dramatically more expensive than alternatives, but who\u0026#39;s counting when you\u0026#39;re disrupting the healthcare-industrial complex one follicle at a time? The premium isn\u0026#39;t for better drugs or better care—it\u0026#39;s for the privilege of avoiding human interaction while receiving inferior medical oversight, like paying extra for a luxury hotel room that turns out to be a closet with a cot.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCustomer complaints reveal the true scope of the extraction: users reporting \u003c/span\u003e\u003ca href=\"https://www.reddit.com/r/HIMS/comments/16iyh9i/comment/lex1lno/?utm_source=share\u0026amp;utm_medium=web3x\u0026amp;utm_name=web3xcss\u0026amp;utm_term=1\u0026amp;utm_content=share_button\" rel=\"\"\u003ebeing charged $300-400\u003c/a\u003e\u003cspan\u003e immediately after brief online questionnaires that appear to have been designed by someone who learned about medicine from WebMD and customer service from a DMV training manual. Sometimes they\u0026#39;re \u0026#34;approved in 1 minute\u0026#34; \u003c/span\u003e\u003ca href=\"https://www.reddit.com/r/HIMS/comments/16iyh9i/comment/k23hmzd/?utm_source=share\u0026amp;utm_medium=web3x\u0026amp;utm_name=web3xcss\u0026amp;utm_term=1\u0026amp;utm_content=share_button\" rel=\"\"\u003ewith no live doctor interaction\u003c/a\u003e\u003cspan\u003e—which is either remarkably efficient healthcare or remarkably efficient fraud, depending on your perspective. \u003c/span\u003e\u003ca href=\"https://www.reddit.com/r/HIMS/comments/16iyh9i/comment/kv7n2fb/?utm_source=share\u0026amp;utm_medium=web3x\u0026amp;utm_name=web3xcss\u0026amp;utm_term=1\u0026amp;utm_content=share_button\" rel=\"\"\u003eOne Reddit user recounted: \u003c/a\u003e\u003cspan\u003e\u0026#34;Didn\u0026#39;t talk to a single doctor and was charged $395!!! … Approved in 1 min by checking some boxes and then charged within 5 min.\u0026#34; One customer \u003c/span\u003e\u003ca href=\"https://www.bbb.org/us/ca/san-francisco/profile/health-and-medical-products/hims-hers-inc-1116-880029/complaints\" rel=\"\"\u003espent $3,588 on a weight-loss subscription only to discover the drugs made them violently ill.\u003c/a\u003e\u003cspan\u003e When they sought a refund, they learned what many customers learn too late: that convenience and customer service are not the same thing.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThe workflow appears to be heavily automated to convert questionnaire answers into instant prescriptions and bill customers\u0026#39; cards within minutes—a system so streamlined it makes Amazon\u0026#39;s one-click purchasing look positively cumbersome by comparison. Most would find this whole process totally irresponsible, though one suspects Hims would prefer the term \u0026#34;innovatively frictionless\u0026#34; or perhaps \u0026#34;patient-experience-optimized,\u0026#34; because nothing says quality healthcare like removing all the inconvenient parts involving actual medical judgment.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBut the subscription traps are where the real extraction occurs—and here we encounter the kind of business model innovation that would make a mobster tip his hat in professional admiration. Customers complain of being locked into year-long commitments they can\u0026#39;t escape, like hotel California but with erectile dysfunction pills. \u003c/span\u003e\u003ca href=\"https://www.bbb.org/us/ca/san-francisco/profile/health-and-medical-products/hims-hers-inc-1116-880029/complaints\" rel=\"\"\u003eBetter Business Bureau complaints\u003c/a\u003e\u003cspan\u003e reveal the pattern with the reliability of a Swiss timepiece: customers who pause subscriptions for six months \u003c/span\u003e\u003ca href=\"https://www.bbb.org/us/ca/san-francisco/profile/health-and-medical-products/hims-hers-inc-1116-880029/complaints#:~:text=I%20had%20put,It%20is%20unacceptable.\" rel=\"\"\u003eonly to have Hims automatically resume billing without warning,\u003c/a\u003e\u003cspan\u003e charging $85 \u0026#34;out of the blue.\u0026#34; Others discovered they had been \u003c/span\u003e\u003ca href=\"https://www.bbb.org/us/ca/san-francisco/profile/health-and-medical-products/hims-hers-inc-1116-880029/complaints#:~:text=I%20signed%20up,do%20nothing%20else.\" rel=\"\"\u003eauto-enrolled in recurring shipments without notification,\u003c/a\u003e\u003cspan\u003e a practice that combines the worst aspects of subscription boxes with the medical necessity of prescription drugs. Picture ordering a 3-month hair loss kit only to find Hims has shipped and charged for a fourth without consent, like a pharmaceutical version of that friend who keeps ordering shots when you\u0026#39;ve already said you\u0026#39;re driving.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhen they try to cancel immediately—because apparently \u0026#34;immediately\u0026#34; is a foreign concept in subscription-land—\u003c/span\u003e\u003ca href=\"https://www.bbb.org/us/ca/san-francisco/profile/health-and-medical-products/hims-hers-inc-1116-880029/complaints#:~:text=And%20when%20I%20contacted%20them%20about%20it%2C%20they%20said%20it%20was%20too%20late%20and%20that%20the%20medication%20was%20already%20shipped.\" rel=\"\"\u003eHims refuses refunds because the product has already shipped.\u003c/a\u003e\u003cspan\u003e It\u0026#39;s customer service that makes dealing with your cable company seem like a zen meditation retreat.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe irony is that \u003c/span\u003e\u003ca href=\"https://health.amazon.com/onemedical\" rel=\"\"\u003eAmazon itself offers many of these same medications at a fraction of the cost,\u003c/a\u003e\u003cspan\u003e with actual pharmacists available for consultation and no year-long subscription traps—but Amazon doesn\u0026#39;t market shame as a premium service.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhat makes their \u003c/span\u003e\u003ca href=\"https://www.hims.com/weight-loss/oral-weight-loss-medication-kits#:~:text=Hims%20offers%20personalized%20medication%20kits,as%20once%20or%20twice\" rel=\"\"\u003e\u0026#34;oral weight loss kits\u0026#34;\u003c/a\u003e\u003cspan\u003e particularly grotesque is their shotgun approach to pharmacology.\u003c/span\u003e\u003cspan\u003e\u003ca data-component-name=\"FootnoteAnchorToDOM\" id=\"footnote-anchor-3-166774057\" href=\"https://www.alexkesin.com/p/the-hollow-men-of-hims#footnote-3-166774057\" target=\"_self\" rel=\"\"\u003e3\u003c/a\u003e\u003c/span\u003e\u003cspan\u003e Rather than prescribing one medication and monitoring its effects, Hims combines three or four different drugs into cocktails that have never been tested together—what they call \u0026#34;personalized kits\u0026#34; that can \u0026#34;include a combination of bupropion, metformin, topiramate, vitamin B12, and naltrexone,\u0026#34; taken once or twice daily. Pharmaceutical gambling with customer health.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003ca target=\"_blank\" href=\"https://substackcdn.com/image/fetch/$s_!RBSr!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbc9dba52-5900-469c-9fd2-be4c0b5dc63d_2358x704.png\" data-component-name=\"Image2ToDOM\" rel=\"\"\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/$s_!RBSr!,w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbc9dba52-5900-469c-9fd2-be4c0b5dc63d_2358x704.png 424w, https://substackcdn.com/image/fetch/$s_!RBSr!,w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbc9dba52-5900-469c-9fd2-be4c0b5dc63d_2358x704.png 848w, https://substackcdn.com/image/fetch/$s_!RBSr!,w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbc9dba52-5900-469c-9fd2-be4c0b5dc63d_2358x704.png 1272w, https://substackcdn.com/image/fetch/$s_!RBSr!,w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbc9dba52-5900-469c-9fd2-be4c0b5dc63d_2358x704.png 1456w\" sizes=\"100vw\"/\u003e\u003cimg src=\"https://substackcdn.com/image/fetch/$s_!RBSr!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbc9dba52-5900-469c-9fd2-be4c0b5dc63d_2358x704.png\" width=\"2358\" height=\"704\" data-attrs=\"{\u0026#34;src\u0026#34;:\u0026#34;https://substack-post-media.s3.amazonaws.com/public/images/bc9dba52-5900-469c-9fd2-be4c0b5dc63d_2358x704.png\u0026#34;,\u0026#34;srcNoWatermark\u0026#34;:null,\u0026#34;fullscreen\u0026#34;:null,\u0026#34;imageSize\u0026#34;:null,\u0026#34;height\u0026#34;:704,\u0026#34;width\u0026#34;:2358,\u0026#34;resizeWidth\u0026#34;:null,\u0026#34;bytes\u0026#34;:1029282,\u0026#34;alt\u0026#34;:null,\u0026#34;title\u0026#34;:null,\u0026#34;type\u0026#34;:\u0026#34;image/png\u0026#34;,\u0026#34;href\u0026#34;:null,\u0026#34;belowTheFold\u0026#34;:true,\u0026#34;topImage\u0026#34;:false,\u0026#34;internalRedirect\u0026#34;:\u0026#34;https://www.alexkesin.com/i/166774057?img=https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F1bcc3d6d-bf8d-428b-a865-9465e9103b8d_2374x704.png\u0026#34;,\u0026#34;isProcessing\u0026#34;:false,\u0026#34;align\u0026#34;:null,\u0026#34;offset\u0026#34;:false}\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/$s_!RBSr!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbc9dba52-5900-469c-9fd2-be4c0b5dc63d_2358x704.png 424w, https://substackcdn.com/image/fetch/$s_!RBSr!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbc9dba52-5900-469c-9fd2-be4c0b5dc63d_2358x704.png 848w, https://substackcdn.com/image/fetch/$s_!RBSr!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbc9dba52-5900-469c-9fd2-be4c0b5dc63d_2358x704.png 1272w, https://substackcdn.com/image/fetch/$s_!RBSr!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbc9dba52-5900-469c-9fd2-be4c0b5dc63d_2358x704.png 1456w\" sizes=\"100vw\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eWhile each medication is sometimes used individually for weight management, or in known FDA-approved pairings like bupropion plus naltrexone (Contrave), Hims goes further. \u003c/span\u003e\u003ca href=\"https://www.reddit.com/r/HimsWeightloss/comments/1bfw8rs/my_initial_experience_with_hims_weightloss/#:~:text=at%20a%20loss%20as%20to,medications%20on%20an%20empty%20stomach\" rel=\"\"\u003eOne user described being prescribed\u003c/a\u003e\u003cspan\u003e a triple regimen: bupropion XL every morning, plus a naltrexone + B12 tablet each morning, with metformin to be added later. The patient experienced severe side effects within hours: \u0026#34;massive headaches\u0026#34; followed by repeated vomiting for hours. They were so sick they had to stop and consult the provider, who then advised re-introducing the drugs one by one more gradually.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eA single generic pill might cost a few dollars; a \u0026#34;personalized kit\u0026#34; of multiple medications \u003c/span\u003e\u003ca href=\"https://www.fiercehealthcare.com/digital-health/hims-hers-expands-weight-loss-program-include-access-glp-1-medications#:~:text=The%20company%20said%20pricing%20for%20weight%20loss%20medications%20starts%20at%20%2479%20per%20month%20for%20oral%20medication%20kits\" rel=\"\"\u003ecan command $79 per month,\u003c/a\u003e\u003cspan\u003e paid ten months in advance—pricing that would make a defense contractor weep with envy at its elegant extraction of desperation premiums.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe (alleged) Chinese sourcing of their semaglutide represents the logical endpoint of this philosophy, but it also connects Hims to a \u003c/span\u003e\u003ca href=\"https://www.brookings.edu/articles/the-wild-east-of-semaglutide/\" rel=\"\"\u003ebroader supply chain that has learned to exploit regulatory gaps.\u003c/a\u003e\u003cspan\u003e When Novo Nordisk \u003c/span\u003e\u003ca href=\"https://www.prnewswire.com/news-releases/new-novo-nordisk-initiatives-support-patient-access-to-authentic-fda-approved-wegovy-as-federal-ban-on-mass-compounding-of-semaglutide-takes-effect-302463064.html#:~:text=According%20to%20analysis,for%20US%20patients.\" rel=\"\"\u003einvestigated,\u003c/a\u003e\u003cspan\u003e they found that \u0026#34;ingredients in knock-off drugs sold by telehealth entities and compounding pharmacies are manufactured by foreign suppliers in China,\u0026#34; with much of that supply never inspected or approved by the FDA. Novo \u003c/span\u003e\u003ca href=\"https://www.prnewswire.com/news-releases/novo-nordisk-terminates-collaboration-with-hims--hers-health-inc-due-to-concerns-about-their-illegal-mass-compounding-and-deceptive-marketing-302488189.html#:~:text=US%20patients%20should%20not%20be%20exposed%20to%20knock%2Doff%20drugs%20made%20with%20unsafe%20and%20illicit%20foreign%20ingredients.\" rel=\"\"\u003ewarned that \u003c/a\u003e\u003cspan\u003e\u0026#34;U.S. patients should not be exposed to knock-off drugs made with unsafe and illicit foreign ingredients.\u0026#34;\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhy pay for FDA-approved ingredients when unregulated Chinese suppliers can provide the same molecule at a fraction of the cost? The safety implications are abstract - the profit margins are concrete. \u003c/span\u003e\u003ca href=\"https://www.fiercehealthcare.com/health-tech/hims-hers-sees-650-spike-traffic-following-super-bowl-ad-clash-over-compounded-glp-1s#:~:text=Hims%20%26%20Hers%20is,for%20a%20subscription.\" rel=\"\"\u003eHims can offer compounded semaglutide for $165-199 per month versus over $1,000 monthly for brand-name Wegovy,\u003c/a\u003e\u003cspan\u003e but this cost-cutting comes with potential safety trade-offs that neither Hims nor its pharmacy partners can guarantee against.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhile they market weight-loss shots, other companies push even more brazen products: \u003c/span\u003e\u003ca href=\"https://adraful.com/?srsltid=AfmBOorSqlrkXEjCRKPVvddyQ4F2PDuMp8eDG5RVhFRmeAkltY-NHeR-\" rel=\"\"\u003eAdrafül Labs\u003c/a\u003e\u003cspan\u003e has created an \u0026#34;adrafinil productivity energy drink\u0026#34; combining \u003c/span\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Adrafinil?utm_source=chatgpt.com\" rel=\"\"\u003eadrafinil\u003c/a\u003e\u003cspan\u003e–an \u003c/span\u003e\u003ca href=\"https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/doj-press-releases-involving-fda-oci/arizona-company-and-ceo-plead-guilty-distribution-drugs-not-approved-fda-and-will-pay-24-million#:~:text=FDA%20has%20not%20approved%20drugs%20containing%20tianeptine%2C%20adrafinil%2C%20phenibut%2C%20and%20racetams%20for%20use%20in%20the%20United%20States.\" rel=\"\"\u003eunapproved prescription stimulant\u003c/a\u003e\u003cspan\u003e—in a 12-ounce canned beverage. The company positions this as a cognitive enhancement product, though the FDA has previously indicated concerns about adrafinil in dietary supplements (\u003c/span\u003e\u003ca href=\"https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/warning-letters/peak-nootropics-llc-aka-advanced-nootropics-557887-02052019\" rel=\"\"\u003e1\u003c/a\u003e\u003cspan\u003e, \u003c/span\u003e\u003ca href=\"https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/press-releases/hermitage-man-sentenced-importing-and-selling-drugs-not-approved-fda\" rel=\"\"\u003e2\u003c/a\u003e\u003cspan\u003e, \u003c/span\u003e\u003ca href=\"https://web.archive.org/web/20220614222233/https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/press-releases/fort-collins-couple-sentenced-federal-prison-illegally-selling-unapproved-drugs\" rel=\"\"\u003e3\u003c/a\u003e\u003cspan\u003e, \u003c/span\u003e\u003ca href=\"https://web.archive.org/web/20231031152019/https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/press-releases/arizona-company-and-ceo-plead-guilty-distribution-drugs-not-approved-fda-and-will-pay-24-million\" rel=\"\"\u003e4\u003c/a\u003e\u003cspan\u003e). Adrafül packages their formulation with beverage-like branding while making claims about \u0026#34;executive-function boost,\u0026#34; creating what regulators might view as a product that straddles multiple regulatory categories without fitting neatly into any single framework.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eTo be clear, these are not prudish objections to treating erectile dysfunction, hair loss, or obesity—these are real medical conditions that cause genuine suffering and deserve effective treatment. Nor are these Luddite objections to loosening direct-to-consumer medical access—in theory, such expansion represents a net good: more people treated, fewer bureaucratic hoops, less institutional inertia. The problem lies not in people wanting these treatments but in Hims representing the worst possible way to provide them: sanctimonious, slippery, ethics-as-marketing-until-it-becomes-inconvenient. They market virtue and sell vanity. They pantomime trust while systematically gutting it. There is a certain smarmy self-regard that proves hard to pin down but impossible to ignore; they are not evil, exactly—just hollow, and worse: pleased with themselves about it. One imagines their executives possess the peculiar moral confidence of the megachurch pastor who has convinced himself that his private jet serves the Lord\u0026#39;s work, combined with the dead-eyed certitude of the middle manager who has successfully optimized human suffering into quarterly growth metrics. This is the banality of disruption: evil made efficient, hypocrisy made scalable, mendacity made into a mission statement.\u003c/p\u003e\u003cp\u003eThe entire ecosystem reveals itself to be interconnected—Hims with their compounded semaglutide, Eden with their resurrected sermorelin, Adrafül with their stimulant energy drinks, and dozens of others exploiting the same regulatory frameworks. They have collectively transformed legitimate medical exemptions into profit centers, where the line between necessary compounding and sophisticated patent evasion has been deliberately obscured, where venture capital flows toward companies that have learned to monetize regulatory good faith rather than actually solve medical problems.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe FTC has tried to keep pace, \u003c/span\u003e\u003ca href=\"https://www.ftc.gov/news-events/news/press-releases/2023/04/ftc-warns-almost-700-marketing-companies-they-could-face-civil-penalties-if-they-cant-back-their\" rel=\"\"\u003emass-mailing warnings to 700 marketers about unsubstantiated health claims\u003c/a\u003e\u003cspan\u003e; but these enforcement efforts feel perpetually behind the curve in an economy where regulatory complexity has become a competitive advantage, where the time lag between innovation and oversight creates profitable windows of ambiguity.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eIn the end, Hims is not an aberration but a culmination—the logical result of what happens when regulatory frameworks designed to help patients get exploited by companies determined to help themselves. They have simply completed the transformation, turning medicine into another form of direct-to-consumer retail, patients into subscribers, side effects into customer service issues. And they have done all this while maintaining the sort of earnest expression one might expect from a startup founder explaining how their app will solve human loneliness by optimizing social interactions through machine learning algorithms.\u003c/p\u003e\u003cp\u003eThe real tragedy is not that Hims exists, but that it works so perfectly. Every day, thousands of people choose their compounded weight-loss drugs over FDA-approved alternatives, their combination ED pills over established single-ingredient treatments, their algorithmic consultations over actual medical care. They make these choices not because the products are better, but because the entire experience has been optimized to feel more like shopping and less like confronting the mortality and vulnerability that define the human condition. This is what disruption looks like when applied to the oldest human needs: not improvement, but the illusion of improvement, packaged in the familiar aesthetics of technological progress and sold to a population that has been taught to confuse convenience with care, innovation with integrity, and the availability of options with the presence of actual choice.\u003c/p\u003e\u003cp\u003eLike Upton Sinclair\u0026#39;s meatpacking plants, these companies have taken something essential—in this case, the trust between regulator and regulated that makes modern medicine possible—and corrupted it for profit. The only difference is that instead of adulterating our food, they are adulterating our pharmaceuticals, and instead of hiding behind industrial secrecy, they are hiding behind the complexity of modern drug regulation. But the fundamental dynamic remains the same: companies gaming a system built on good faith, regulators playing catch-up to bad actors, and consumers paying the price for both the corruption and the cleanup. The irony is that while Sinclair\u0026#39;s exposé led to the Pure Food and Drug Act of 1906, our modern pharmaceutical jungle continues to flourish under regulations that have become so complex they serve as cover rather than constraint, so sophisticated they enable the very abuses they were designed to prevent.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003cdiv id=\"discussion\"\u003e\u003ch4\u003eDiscussion about this post\u003c/h4\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "24 min read",
  "publishedTime": "2025-06-25T01:00:20Z",
  "modifiedTime": null
}
