{
  "id": "8172bbd6-1df5-4882-ba34-29fc89043201",
  "title": "5 Economic Forces that Could Shape Trump’s First Year of Presidency",
  "link": "https://www.inc.com/associated-press/5-economic-forces-that-could-shape-trumps-first-year-of-presidency/91139326",
  "description": "The economy won’t exactly bend to Trump’s whims.",
  "author": "Associated Press",
  "published": "Fri, 24 Jan 2025 19:28:43 -0500",
  "source": "https://www.inc.com/rss/",
  "categories": [
    "Uncategorized"
  ],
  "byline": "Associated Press",
  "length": 7614,
  "excerpt": "The economy won't exactly bend to Trump's whims.",
  "siteName": "Inc",
  "favicon": "https://www.inc.com/_public/icons/apple-icon.png",
  "text": "Like most presidents, Donald Trump faces an economy that seldom bends to political ambitions.The Republican has promised strong growth, high tariffs, income tax cuts and booming oilfields. But despite the solid job market and low 4.1 percent unemployment rate, he has to contend with headwinds like inflation, a budget deficit, increased tensions over trade, the fallout from his plans to curtail immigration and a persistent wealth gap.Each of these issues could help to shape how voters feel about a president they returned to the White House with the specific goal of fixing the economy.For his part, Trump wants to blame all the challenges before him on his predecessor, Joe Biden, who in turn blamed Trump in 2021 for the problems his own administration had to tackle.“This begins with confronting the economic chaos caused by the failed policies of the last administration,” Trump told the World Economic Forum on Thursday.Here are five economic forces that could shape the first year of Trump’s presidency:For voters, the price still isn’t rightWhipping inflation is easier said than done.In AP VoteCast, an extensive survey of last year’s electorate, 4 in 10 voters called inflation the “single most important factor” in their choice for president. About two-thirds of this group voted for Trump — a sign he owes his victory in large part to the high cost of groceries, gasoline, housing, autos and other goods.Going forward, monthly reports on the consumer price index will be a clear measure of whether Trump can deliver. But inflation has actually increased in recent months. Consumer prices were increasing at a healthy 2.4 percent annual rate in September, compared with 2.9 percent in December. Economists say inflation could worsen if Trump imposes tariffs and uses deficit-funded income tax cuts.Republicans often hit Biden hard on egg prices. But Democrats could use similar attacks on Trump. Over the past year, coffee costs have risen just 1 percent for U.S. consumers, but the International Monetary Fund has the price of the actual beans climbing 55 percent in a sign that lattes, espressos and plain old cups of joe could soon cost more.Then there’s housingVoters are still frustrated by high mortgage rates and prices staying elevated due to a shortage of properties. Shelter is 37 percent of the consumer price index. Price increases for housing have eased, but shelter costs are still rising at 4.6 percent a year, compared with annual increases averaging 3.3 percent before the pandemic.Trump is betting that more energy production can cut into inflation rates, but domestic production is already near record levels, according to the government.Which tariffs are really comingTrump says 25 percent tariffs are coming for Mexican and Canadian imports as soon as Feb. 1. He’s also talked about additional tariffs of 10 percent on Chinese goods. His stated goal is to stop illegal border crossings and the flow of chemicals used to make drugs such as fentanyl.For Trump, tariffs are a diplomatic tool for his policy goals. But they’re also a threat possibly meant to jumpstart trade talks. They’re also a revenue raiser that he claims could bring trillions of dollars into the treasury.Trump did increase tariffs during his first term, with revenue collection more than doubling to an annual rate of $85.4 billion, which might sound like a lot but was equal to just 0.4 percent of the gross domestic product. Multiple analyses by the Budget Lab at Yale and the Peterson Institute for International Economics, among others, say the threatened tariffs would increase costs for a typical family in a way that effectively raises taxes.What really matters is whether Trump delivers on his threats. That is why Ben Harris, a former Biden adviser who is now director of economic studies at the Brookings Institution, says voters should focus on average tariff rates.“Trade is really tricky” Harris said. “But in broad terms, look at what he does and not what he says.”What happens with the national debtTrump likes to blame inflation on the national debt, saying Biden’s policies flooded the U.S. economy with more money than it could absorb. But about 22 percent of the $36 trillion outstanding total debt originated from the policies of Trump’s first term, according to the Committee for a Responsible Federal Budget, a fiscal watchdog.Paul Winfree, a former Trump staffer who is now president and CEO of the Economic Policy Innovation Center, warned in a recent analysis that the U.S. is getting too close for comfort to its fiscal limits. His analysis suggests that if Trump can preserve 3 percent growth he could extend his expiring 2017 tax cuts while keeping the debt sufficiently stable by cutting spending $100 billion to $140 billion a year.The risk is that higher borrowing costs and debt can limit what Trump does while keeping borrowing costs high for consumers. Lawmakers who once viewed the debt as problem years away increasingly see it as something to address now.“One of the biggest vibe shifts I’m picking up on now among policymakers is they’re beginning to realize the long-term is today,” Winfree said.Winfree said the key number to watch is the interest rates charged on U.S. debt — which will tell the public if investors think the amount of borrowing is problematic. Interest on the 10-year U.S. Treasury note is at roughly 4.6 percent, up a full percentage point since September.Immigrants are still needed to fill jobsTrump’s executive orders are a clear crackdown on immigration — and that could be a drag on economic growth and cause monthly job gains to slow. Trump often frames immigration as a criminal and national security issue by focusing on people crossing the border illegally.But economies that can’t add enough workers are at risk of stagnating — and the U.S. labor market at this stage needs immigrants as part of the jobs mix. About 84 percent of America’s net population growth last year came from immigrants, according to the Census Bureau. That’s 2.8 million immigrants.“They not only work in the economy, but they spend in the economy,” said Satyam Panday, chief U.S. economist at S\u0026P Global Ratings. “Their spending is somebody else’s income in the economy.”If Trump were simply to put immigration back at his 2017 and 2019 averages of 750,000 immigrants annually, growth could slow from an estimated 2.7 percent last year to 2 percent going forward, Panday’s analysis found. The construction, agriculture and leisure and hospitality industries would probably struggle to find employees.In other words, it’s worth monitoring the monthly jobs report and immigration flows.Mind the wealth gapTrump is going to have to figure out how to balance the interests of billionaires with those of his blue- collar voters. His inaugural events included several of the world’s wealthiest men: Tesla’s Elon Musk, Amazon’s Jeff Bezos, Meta’s Mark Zuckerberg and LVMH’s Bernard Arnault. Each is worth roughly $200 billion or more, according to the Bloomberg Billionaire’s Index.Scott Ellis, a member of the group Patriotic Millionaires, said it’s worth monitoring just how much their wealth increases under Trump. This year, as of Friday, Arnault’s net worth has risen $23 billion, Bezos is up by $15 billion, Zuckerberg is up by $18 billion and Musk’s wealth has risen by $6 billion. Those are all monthly increases.By contrast, the most recent available Census Bureau data show that the median U.S. household wealth rose $9,600 in 2021-2022, to $176,500.Copyright 2025. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.",
  "image": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit,w_1024,h_1024/vip/2025/01/GettyImages-2194375169.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eLike most presidents, Donald Trump faces an \u003ca href=\"https://www.inc.com/phil-rosen/economic-outlook-trump-markets-powell-fed-investors-yields-bond-recession/91105992\"\u003eeconomy\u003c/a\u003e that seldom bends to political ambitions.\u003c/p\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eThe Republican has promised strong growth, high tariffs, income tax \u003ca href=\"https://www.inc.com/phil-rosen/economic-outlook-investors-markets-stocks-fed-rate-cut-traders-retail-sales/90990841\"\u003ecuts\u003c/a\u003e and booming oilfields. But despite the solid job market and low 4.1 percent unemployment rate, he has to contend with headwinds like inflation, a budget deficit, increased tensions over trade, the fallout from his plans to curtail immigration and a persistent wealth gap.\u003c/p\u003e\u003cp\u003eEach of these issues could help to shape how voters feel about a president they returned to the White House with the specific goal of fixing the economy.\u003c/p\u003e\u003cp\u003eFor his part, Trump wants to blame all the challenges before him on his predecessor, Joe Biden, who in turn blamed Trump in 2021 for the problems his own administration had to tackle.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003e“This begins with confronting the economic chaos caused by the failed policies of the last administration,” Trump told the World Economic Forum on Thursday.\u003cbr/\u003eHere are five economic forces that could shape the first year of Trump’s presidency:\u003c/p\u003e\u003ch2 id=\"h-for-voters-the-price-still-isn-t-right\"\u003eFor voters, the price still isn’t right\u003c/h2\u003e\u003cp\u003eWhipping inflation is easier said than done.\u003c/p\u003e\u003cp\u003eIn AP VoteCast, an extensive survey of last year’s electorate, 4 in 10 voters called inflation the “single most important factor” in their choice for president. About two-thirds of this group voted for Trump — a sign he owes his victory in large part to the high cost of groceries, gasoline, housing, autos and other goods.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eGoing forward, monthly reports on the consumer price index will be a clear measure of whether Trump can deliver. But inflation has actually increased in recent months. Consumer prices were increasing at a healthy 2.4 percent annual rate in September, compared with 2.9 percent in December. Economists say inflation could worsen if Trump imposes tariffs and uses deficit-funded income tax cuts.\u003c/p\u003e\u003cp\u003eRepublicans often hit Biden hard on egg prices. But Democrats could use similar attacks on Trump. Over the past year, coffee costs have risen just 1 percent for U.S. consumers, but the International Monetary Fund has the price of the actual beans climbing 55 percent in a sign that lattes, espressos and plain old cups of joe could soon cost more.\u003c/p\u003e\u003ch2 id=\"h-then-there-s-housing\"\u003eThen there’s housing\u003c/h2\u003e\u003cp\u003eVoters are still frustrated by high mortgage rates and prices staying elevated due to a shortage of properties. Shelter is 37 percent of the consumer price index. Price increases for housing have eased, but shelter costs are still rising at 4.6 percent a year, compared with annual increases averaging 3.3 percent before the pandemic.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eTrump is betting that more energy production can cut into inflation rates, but domestic production is already near record levels, according to the government.\u003cbr/\u003eWhich tariffs are really coming\u003c/p\u003e\u003cp\u003eTrump says 25 percent tariffs are coming for Mexican and Canadian imports as soon as Feb. 1. He’s also talked about additional tariffs of 10 percent on Chinese goods. His stated goal is to stop illegal border crossings and the flow of chemicals used to make drugs such as fentanyl.\u003c/p\u003e\u003cp\u003eFor Trump, tariffs are a diplomatic tool for his policy goals. But they’re also a threat possibly meant to jumpstart trade talks. They’re also a revenue raiser that he claims could bring trillions of dollars into the treasury.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eTrump did increase tariffs during his first term, with revenue collection more than doubling to an annual rate of $85.4 billion, which might sound like a lot but was equal to just 0.4 percent of the gross domestic product. Multiple analyses by the Budget Lab at Yale and the Peterson Institute for International Economics, among others, say the threatened tariffs would increase costs for a typical family in a way that effectively raises taxes.\u003c/p\u003e\u003cp\u003eWhat really matters is whether Trump delivers on his threats. That is why Ben Harris, a former Biden adviser who is now director of economic studies at the Brookings Institution, says voters should focus on average tariff rates.\u003c/p\u003e\u003cp\u003e“Trade is really tricky” Harris said. “But in broad terms, look at what he does and not what he says.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003ch2 id=\"h-what-happens-with-the-national-debt\"\u003eWhat happens with the national debt\u003c/h2\u003e\u003cp\u003eTrump likes to blame inflation on the national debt, saying Biden’s policies flooded the U.S. economy with more money than it could absorb. But about 22 percent of the $36 trillion outstanding total debt originated from the policies of Trump’s first term, according to the Committee for a Responsible Federal Budget, a fiscal watchdog.\u003c/p\u003e\u003cp\u003ePaul Winfree, a former Trump staffer who is now president and CEO of the Economic Policy Innovation Center, warned in a recent analysis that the U.S. is getting too close for comfort to its fiscal limits. His analysis suggests that if Trump can preserve 3 percent growth he could extend his expiring 2017 tax cuts while keeping the debt sufficiently stable by cutting spending $100 billion to $140 billion a year.\u003c/p\u003e\u003cp\u003eThe risk is that higher borrowing costs and debt can limit what Trump does while keeping borrowing costs high for consumers. Lawmakers who once viewed the debt as problem years away increasingly see it as something to address now.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003e“One of the biggest vibe shifts I’m picking up on now among policymakers is they’re beginning to realize the long-term is today,” Winfree said.\u003c/p\u003e\u003cp\u003eWinfree said the key number to watch is the interest rates charged on U.S. debt — which will tell the public if investors think the amount of borrowing is problematic. Interest on the 10-year U.S. Treasury note is at roughly 4.6 percent, up a full percentage point since September.\u003c/p\u003e\u003ch2 id=\"h-immigrants-are-still-needed-to-fill-jobs\"\u003eImmigrants are still needed to fill jobs\u003c/h2\u003e\u003cp\u003eTrump’s executive orders are a clear crackdown on immigration — and that could be a drag on economic growth and cause monthly job gains to slow. Trump often frames immigration as a criminal and national security issue by focusing on people crossing the border illegally.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eBut economies that can’t add enough workers are at risk of stagnating — and the U.S. labor market at this stage needs immigrants as part of the jobs mix. About 84 percent of America’s net population growth last year came from immigrants, according to the Census Bureau. That’s 2.8 million immigrants.\u003c/p\u003e\u003cp\u003e“They not only work in the economy, but they spend in the economy,” said Satyam Panday, chief U.S. economist at S\u0026amp;P Global Ratings. “Their spending is somebody else’s income in the economy.”\u003c/p\u003e\u003cp\u003eIf Trump were simply to put immigration back at his 2017 and 2019 averages of 750,000 immigrants annually, growth could slow from an estimated 2.7 percent last year to 2 percent going forward, Panday’s analysis found. The construction, agriculture and leisure and hospitality industries would probably struggle to find employees.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eIn other words, it’s worth monitoring the monthly jobs report and immigration flows.\u003c/p\u003e\u003ch2 id=\"h-mind-the-wealth-gap\"\u003eMind the wealth gap\u003c/h2\u003e\u003cp\u003eTrump is going to have to figure out how to balance the interests of billionaires with those of his blue- collar voters. His inaugural events included several of the world’s wealthiest men: Tesla’s Elon Musk, Amazon’s Jeff Bezos, Meta’s Mark Zuckerberg and LVMH’s Bernard Arnault. Each is worth roughly $200 billion or more, according to the Bloomberg Billionaire’s Index.\u003c/p\u003e\u003cp\u003eScott Ellis, a member of the group Patriotic Millionaires, said it’s worth monitoring just how much their wealth increases under Trump. This year, as of Friday, Arnault’s net worth has risen $23 billion, Bezos is up by $15 billion, Zuckerberg is up by $18 billion and Musk’s wealth has risen by $6 billion. Those are all monthly increases.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eBy contrast, the most recent available Census Bureau data show that the median U.S. household wealth rose $9,600 in 2021-2022, to $176,500.\u003c/p\u003e\u003cp\u003e\u003cem\u003eCopyright 2025. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-25T00:28:43Z",
  "modifiedTime": "2025-01-25T00:28:46Z"
}
