{
  "id": "84a1cfbb-35f3-4b80-9af8-479cbaae3738",
  "title": "Celebrating Juneteenth Isn't Just for Black People. How Companies and Other Employees Benefit, Too.",
  "link": "https://www.entrepreneur.com/growing-a-business/celebrating-juneteenth-isnt-just-for-black-people-how/492007",
  "description": "Celebrating Juneteenth isn't just the right thing to do — it's a meaningful opportunity for companies and employees to foster inclusion, reflect on progress and strengthen workplace culture.",
  "author": "Nika White",
  "published": "Tue, 10 Jun 2025 21:00:00 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Nika White",
  "length": 6080,
  "excerpt": "Celebrating Juneteenth isn't just the right thing to do — it's a meaningful opportunity for companies and employees to foster inclusion, reflect on progress and strengthen workplace culture.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "Opinions expressed by Entrepreneur contributors are their own. June 19th is one of the newest holidays on the federal calendar. It commemorates Juneteenth, the day that the last enslaved people in Texas learned that they were free in 1865. Since it was officially declared a national holiday in 2021, most people don't know much about it or why it's a day worth celebrating. All that most people know about the holiday is that they get an extra day off between Memorial Day and the 4th of July, and that's a win for their work-life balance (or work-life blend as I like to call it).Although Black Americans have celebrated the holiday for centuries, more and more businesses are jumping on board. For many Black Americans, Juneteenth symbolizes freedom and independence from a hard, dark history. But I have good news: the holiday isn't just for them — it's for you, too. Companies and employees alike can benefit from celebrating Juneteenth. Here are four reasons why they can benefit, too. Celebrating Juneteenth gives your employees a much-needed day off and positions your company as the \"hero\"Instead of waiting until the 4th of July for a much-needed long weekend, you can offer your employees an extra day off on Juneteenth. Whether it's a paid or unpaid holiday, giving your employees a break in the summer months gives them a much-needed reprieve from their stressful to-do lists. A recent meta-analysis has shown that holiday breaks and vacations play a crucial role in the mental and emotional wellbeing of your employees. These benefits can extend to improved mental health, enhanced problem-solving, and a boost in job satisfaction. Simply put, refreshed employees are happy employees. Giving workers that additional day off pays dividends toward their productivity and general contentment at the company. And all it costs the business is one working day. Who knew adding one additional day to your company's holiday roster would have such a positive impact on retention and employee happiness?Related: You Need a Real Vacation (And So Do Your Employees) Juneteenth conversations can strengthen connections and communication within the companyWhile many people are new to Juneteenth and don't know much about it, some people have been celebrating it for a very long time. Creating the opportunity for knowledgeable employees and less knowledgeable employees to connect and share facts, history and information about the holiday can not only strengthen connections within the company but also create space for deeper dialogue and more open communication in the future. As a Diversity, Equity and Inclusion (DEI) consultant, I've seen employees who would otherwise have nothing to discuss with colleagues other than work topics actually bond and learn something new from one another's lived experiences. Those extended discussions about non-work-related topics can build stronger employee rapport and nurture company cohesion in subtle yet durable ways.Related: The 6 Do's and Don'ts for Engaging in Juneteenth ConversationsCelebrating Juneteenth allows leadership to re-engage employees in the company's core valuesI've led my fair share of values-driven meetings, and all too often, just months after the company values presentation, employees forget what they are and why they matter. That's not the fault of leadership as much as it's the lack of seeing the company's values in action. Juneteenth can be an opportunity to practice what your company preaches and show your employees that you truly value diversity, curiosity, collaboration, fairness or any other core value that's relevant. For example, on Juneteenth, you can encourage your employees to seize the day by volunteering with an organization that promotes diversity or uplifts the wellbeing of Black folks in their communities. This act can encourage your employees to embody the core values of diversity and collaboration. An alternative idea is for leadership to use Juneteenth as an opportunity to send a company-wide email sharing a brief history of the holiday and why it aligns with the organization's core values of curiosity and fairness. The opportunities are endless to lean into Juneteenth and leverage it as a learning tool and a way to show — not tell — your employees how to exemplify the company's core values.Related: Core Values and Practices Are Booster Fuel for Your Business. Here's How to Establish the Right Ones. Celebrating Juneteenth reaffirms your company's commitment to DEIAs mentioned, when it comes to your company values, it's best to show and not tell. One way to do that is to demonstrate to your employees that DEI is still a priority by holding an insightful group session. I've been invited to speak or lead a session around Juneteenth on numerous occasions, and it's one of my favorite times of the year to show up. Not only are employees already engaged in the topic, but they're also learning more about it from others and are often more receptive to new information during that period. I come in to help employees recognize how Juneteenth and its history and learnings can inspire the day-to-day business operations, strengthen inclusion efforts at the company and improve overall cohesion. Investing in hosting a speaker or seminar on or around Juneteenth can be a great way to educate, engage, and reiterate your DEI commitments to employees at all levels of the organization.Final thoughtsJuneteenth is an opportunity for companies to lean in, not lean back. Instead of hesitating around the holiday and what it means for non-Black employees, step confidently into the space of making meaning, connection and a learning experience out of it for everyone. No employees are ever upset about having a paid day off, and a bonus benefit is that they can often enjoy learning something new about the country and our shared history. Companies and employees who treat Juneteenth as more than just a \"Black\" holiday and instead as an opportunity to rest, reflect, and connect can benefit greatly on the employee wellbeing and productivity fronts.",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1749563631-celebrating-juneteenth-benefits-everyone-0625-g2177411758.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n    Opinions expressed by Entrepreneur contributors are their own.  \u003c/p\u003e\u003cdiv\u003e\n  \u003cp\u003eJune 19th is one of the newest holidays on the federal calendar. It commemorates \u003ca href=\"https://www.entrepreneur.com/business-news/what-companies-are-closed-on-juneteenth-2022/429409\" rel=\"follow\" target=\"_self\"\u003eJuneteenth\u003c/a\u003e, the day that the last enslaved people in Texas learned that they were free in 1865. Since it was officially declared a national holiday in 2021, most people don\u0026#39;t know much about it or why it\u0026#39;s a day worth celebrating. All that most people know about the holiday is that they get an extra day off between Memorial Day and the 4th of July, and that\u0026#39;s a win for their \u003ca href=\"https://www.entrepreneur.com/living/10-strategies-for-achieving-work-life-balance/472302\" rel=\"follow\" target=\"_self\"\u003ework-life balance\u003c/a\u003e (or work-life blend as I like to call it).\u003c/p\u003e\u003cp\u003eAlthough Black Americans have celebrated the holiday for centuries, more and more businesses are jumping on board. For many Black Americans, Juneteenth symbolizes freedom and independence from a hard, dark history. But I have good news: the holiday isn\u0026#39;t \u003ci\u003ejust\u003c/i\u003e for them — it\u0026#39;s for you, too. Companies and employees alike can benefit from celebrating Juneteenth. Here are four reasons why they can benefit, too.\u003c/p\u003e\n  \n  \n  \n\n  \u003ch2\u003eCelebrating Juneteenth gives your employees a much-needed day off and positions your company as the \u0026#34;hero\u0026#34;\u003c/h2\u003e\u003cp\u003eInstead of waiting until the 4th of July for a much-needed long weekend, you can offer your employees an extra day off on Juneteenth. Whether it\u0026#39;s a paid or unpaid holiday, giving your \u003ca href=\"https://www.entrepreneur.com/leadership/why-employee-experience-matters-more-than-you-think/440700\" rel=\"follow\" target=\"_self\"\u003eemployees\u003c/a\u003e a break in the summer months gives them a much-needed reprieve from their stressful to-do lists. \u003ca href=\"https://psycnet.apa.org/doiLanding?doi=10.1037/apl0001262\" rel=\"follow\" target=\"_self\"\u003eA recent meta-analysis\u003c/a\u003e has shown that holiday breaks and vacations play a crucial role in the mental and emotional wellbeing of your employees. These benefits can extend to improved mental health, enhanced problem-solving, and a boost in job satisfaction. Simply put, refreshed employees are happy employees. Giving workers that additional day off pays dividends toward their \u003ca href=\"https://www.entrepreneur.com/living/want-to-be-more-productive-stop-trying-to-finish-every/444414\" rel=\"follow\" target=\"_self\"\u003eproductivity\u003c/a\u003e and general contentment at the company. And all it costs the business is one working day. Who knew adding one additional day to your company\u0026#39;s holiday roster would have such a positive impact on retention and employee happiness?\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/living/you-need-a-real-vacation-and-so-do-your-employees/232766\" rel=\"follow\" target=\"_self\"\u003e\u003cb\u003eYou Need a Real Vacation (And So Do Your Employees)\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e\n\n  \u003ch2\u003eJuneteenth conversations can strengthen connections and communication within the company\u003c/h2\u003e\u003cp\u003eWhile many people are new to Juneteenth and don\u0026#39;t know much about it, some people have been celebrating it for a very long time. Creating the opportunity for knowledgeable employees and less knowledgeable employees to connect and share facts, history and information about the holiday can not only strengthen connections within the company but also create space for deeper dialogue and more open communication in the future. As a Diversity, Equity and Inclusion (DEI) consultant, I\u0026#39;ve seen employees who would otherwise have nothing to discuss with colleagues other than work topics actually bond and learn something new from one another\u0026#39;s lived experiences. Those extended discussions about non-work-related topics can build stronger employee rapport and nurture company cohesion in subtle yet durable ways.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/leadership/the-6-dos-and-donts-for-engaging-in-juneteenth/451837\" rel=\"follow\" target=\"_self\"\u003e\u003cb\u003eThe 6 Do\u0026#39;s and Don\u0026#39;ts for Engaging in Juneteenth Conversations\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eCelebrating Juneteenth allows leadership to re-engage employees in the company\u0026#39;s core values\u003c/h2\u003e\u003cp\u003eI\u0026#39;ve led my fair share of values-driven meetings, and all too often, just months after the company values presentation, employees forget what they are and why they matter. That\u0026#39;s not the fault of \u003ca href=\"https://www.entrepreneur.com/growing-a-business/want-to-be-a-better-leader-show-employees-you-care/236806\" rel=\"follow\" target=\"_self\"\u003eleadership\u003c/a\u003e as much as it\u0026#39;s the lack of seeing the company\u0026#39;s values in action. Juneteenth can be an opportunity to practice what your company preaches and \u003ci\u003eshow\u003c/i\u003e your employees that you truly value diversity, curiosity, collaboration, fairness or any other core value that\u0026#39;s relevant. For example, on Juneteenth, you can encourage your employees to seize the day by \u003ca href=\"https://www.entrepreneur.com/living/why-you-should-volunteer-before-launching-your-career/281513\" rel=\"follow\" target=\"_self\"\u003evolunteering\u003c/a\u003e with an organization that promotes diversity or uplifts the wellbeing of Black folks in their communities. This act can encourage your employees to embody the core values of diversity and collaboration. An alternative idea is for leadership to use Juneteenth as an opportunity to send a company-wide email sharing a brief history of the holiday and why it aligns with the organization\u0026#39;s core values of curiosity and fairness. The opportunities are endless to lean into Juneteenth and leverage it as a learning tool and a way to \u003ci\u003eshow \u003c/i\u003e— not tell — your employees how to exemplify the company\u0026#39;s core values.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/leadership/core-values-and-practices-are-booster-fuel-for-your/453794\" rel=\"follow\" target=\"_self\"\u003e\u003cb\u003eCore Values and Practices Are Booster Fuel for Your Business. Here\u0026#39;s How to Establish the Right Ones.\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e\n\n  \u003ch2\u003eCelebrating Juneteenth reaffirms your company\u0026#39;s commitment to DEI\u003c/h2\u003e\u003cp\u003eAs mentioned, when it comes to your company values, it\u0026#39;s best to \u003ci\u003eshow\u003c/i\u003e and not tell. One way to do that is to demonstrate to your employees that DEI is still a priority by holding an insightful group session. I\u0026#39;ve been invited to speak or lead a session around Juneteenth on numerous occasions, and it\u0026#39;s one of my favorite times of the year to show up. Not only are employees already engaged in the topic, but they\u0026#39;re also learning more about it from others and are often more receptive to new information during that period. I come in to help employees recognize how Juneteenth and its history and learnings can inspire the day-to-day business operations, strengthen inclusion efforts at the company and improve overall cohesion. Investing in hosting a speaker or seminar on or around Juneteenth can be a great way to educate, engage, and reiterate your DEI commitments to employees at all levels of the organization.\u003c/p\u003e\u003ch2\u003eFinal thoughts\u003c/h2\u003e\u003cp\u003eJuneteenth is an opportunity for companies to lean in, not lean back. Instead of hesitating around the holiday and what it means for non-Black employees, step confidently into the space of making meaning, connection and a learning experience out of it for everyone. No employees are ever upset about having a paid day off, and a bonus benefit is that they can often enjoy learning something new about the country and our shared history. Companies and employees who treat Juneteenth as more than just a \u0026#34;Black\u0026#34; holiday and instead as an opportunity to rest, reflect, and connect can benefit greatly on the employee wellbeing and productivity fronts.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-06-10T21:00:00Z",
  "modifiedTime": "2025-06-10T21:00:00Z"
}
