{
  "id": "859ab649-a9e5-470b-bf3b-d309d8f2c8d2",
  "title": "SBA Launches Made in America Manufacturing Initiative to Boost U.S. Industry",
  "link": "https://smallbiztrends.com/sba-made-in-america-manufacturing-initiative/",
  "description": "The SBA has launched the Made in America Manufacturing Initiative to cut regulations, expand access to capital, and support small manufacturers through dedicated resources and workforce development.",
  "author": "Joshua Sophy",
  "published": "Mon, 10 Mar 2025 21:36:35 +0000",
  "source": "https://feeds2.feedburner.com/SmallBusinessTrends",
  "categories": [
    "Small Business News"
  ],
  "byline": "Joshua Sophy",
  "length": 3785,
  "excerpt": "The SBA has launched the Made in America Manufacturing Initiative to cut regulations, expand access to capital, and support small manufacturers through dedicated resources and workforce development.",
  "siteName": "Small Business Trends",
  "favicon": "",
  "text": "The U.S. Small Business Administration (SBA) has announced the launch of the Made in America Manufacturing Initiative, an effort aimed at revitalizing American manufacturing by cutting regulations, expanding access to capital, and strengthening supply chains. The initiative, unveiled by SBA Administrator Kelly Loeffler, aligns with the administration’s broader agenda to restore American economic dominance and bolster national security.Supporting Small ManufacturersAccording to the SBA, approximately 99% of American manufacturers are small businesses, and the initiative aims to further support their resurgence. The agency highlighted recent job growth in the sector, citing the addition of 10,000 manufacturing jobs in the President’s first full month in office, reversing previous job losses in the industry.“With the Made in America Manufacturing Initiative, we’re slashing red tape, expanding access to capital, and fueling a manufacturing resurgence that will create high-paying jobs and revitalize communities across the country,” Loeffler said in the announcement.Key Components of the InitiativeThe SBA outlined several measures under the initiative to support small manufacturers, including:Regulatory Reduction: The agency plans to cut $100 billion in regulatory burdens through its Office of Advocacy, which will work across federal agencies to eliminate policies that disproportionately impact small manufacturers.Red Tape Hotline: A new hotline will allow small business owners to submit feedback on excessive regulations for review.Office of Manufacturing and Trade: A newly established office will provide dedicated resources, training, and support to small manufacturers in collaboration with SBA field offices nationwide.Loan Program Enhancements: The SBA will reduce barriers to its 504 loan program, which provides funding for real estate, construction, and equipment purchases without requiring ongoing taxpayer subsidies. Additionally, the 7(a) Working Capital Pilot program will be expanded to help small businesses finance inventory purchases and export-related expenses.Workforce Development: The SBA will partner with agencies, trade schools, and private sector stakeholders to promote a pipeline of skilled manufacturing workers.Trade and Tax Policies: The initiative supports broader manufacturing policies, including tariffs for fair trade, tax cuts on domestic production, and 100% expensing retroactive to Jan. 20, 2025.Made in America RoadshowAs part of the initiative, representatives from the newly established Office of Manufacturing and Trade will embark on a multistate “Made in America Roadshow” over the next two months. The tour will feature roundtables with small manufacturers across the country to gather industry feedback and identify further opportunities for support.Administrator Loeffler will formally launch the initiative today at an aerospace and defense manufacturing facility in Indianapolis, where she will be joined by state and federal leaders as well as small business owners in the manufacturing sector.The SBA stated that this initiative reflects a commitment to bolstering the nation’s industrial base while ensuring that essential goods are produced domestically. The agency emphasized that supporting small manufacturers is a key component of economic growth, job creation, and national security.Editor's Picks Joshua Sophy is the Editor for Small Business Trends and has been a member of the team for 16 years. A professional journalist with 20 years of experience in traditional media and online media, he attended Waynesburg University and is a member of the Society of Professional Journalists. He has held roles of reporter, editor and publisher, having founded his own local newspaper, the Pottsville Free Press.",
  "image": "https://media.smallbiztrends.com/2025/03/Kelly-Loeffler-sba.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle\u003e\u003cdiv\u003e\u003cmeta content=\"SBA Launches Made in America Manufacturing Initiative to Boost U.S. Industry\"/\u003e\u003chr/\u003e\u003cp\u003e\u003cspan\u003e\u003cimg width=\"850\" height=\"478\" src=\"https://smallbiztrends.com/ezoimgfmt/media.smallbiztrends.com/2025/03/Kelly-Loeffler-sba-850x478.png\" alt=\"\" decoding=\"async\" ezimgfmt=\"rs rscb1 src ng ngcb1\" data-ezsrc=\"https://smallbiztrends.com/ezoimgfmt/media.smallbiztrends.com/2025/03/Kelly-Loeffler-sba-850x478.png\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp data-pm-slice=\"1 1 []\"\u003eThe U.S. Small Business Administration (SBA) has announced the launch of the Made in America Manufacturing Initiative, an effort aimed at revitalizing American manufacturing by cutting regulations, expanding access to capital, and strengthening supply chains. The initiative, unveiled by SBA Administrator Kelly Loeffler, aligns with the administration’s broader agenda to restore American economic dominance and bolster national security.\u003c/p\u003e\u003ch3\u003eSupporting Small Manufacturers\u003c/h3\u003e\u003cp\u003eAccording to the SBA, approximately 99% of American manufacturers are small businesses, and the initiative aims to further support their resurgence. The agency highlighted recent job growth in the sector, citing the addition of 10,000 manufacturing jobs in the President’s first full month in office, reversing previous job losses in the industry.\u003c/p\u003e\u003cp\u003e“With the Made in America Manufacturing Initiative, we’re slashing red tape, expanding access to capital, and fueling a manufacturing resurgence that will create high-paying jobs and revitalize communities across the country,” Loeffler said in the announcement.\u003c/p\u003e\u003ch3\u003eKey Components of the Initiative\u003c/h3\u003e\u003cp\u003eThe SBA outlined several measures under the initiative to support small manufacturers, including:\u003c/p\u003e\u003cul data-spread=\"false\"\u003e\u003cli\u003eRegulatory Reduction: The agency plans to cut $100 billion in regulatory burdens through its Office of Advocacy, which will work across federal agencies to eliminate policies that disproportionately impact small manufacturers.\u003c/li\u003e\u003cli\u003eRed Tape Hotline: A new hotline will allow small business owners to submit feedback on excessive regulations for review.\u003c/li\u003e\u003cli\u003eOffice of Manufacturing and Trade: A newly established office will provide dedicated resources, training, and support to small manufacturers in collaboration with SBA field offices nationwide.\u003c/li\u003e\u003cli\u003eLoan Program Enhancements: The SBA will reduce barriers to its 504 loan program, which provides funding for real estate, construction, and equipment purchases without requiring ongoing taxpayer subsidies. Additionally, the 7(a) Working Capital Pilot program will be expanded to help small businesses finance inventory purchases and export-related expenses.\u003c/li\u003e\u003cli\u003eWorkforce Development: The SBA will partner with agencies, trade schools, and private sector stakeholders to promote a pipeline of skilled manufacturing workers.\u003c/li\u003e\u003cli\u003eTrade and Tax Policies: The initiative supports broader manufacturing policies, including tariffs for fair trade, tax cuts on domestic production, and 100% expensing retroactive to Jan. 20, 2025.\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003eMade in America Roadshow\u003c/h3\u003e\u003cp\u003eAs part of the initiative, representatives from the newly established Office of Manufacturing and Trade will embark on a multistate “Made in America Roadshow” over the next two months. The tour will feature roundtables with small manufacturers across the country to gather industry feedback and identify further opportunities for support.\u003c/p\u003e\u003cp\u003eAdministrator Loeffler will formally launch the initiative today at an aerospace and defense manufacturing facility in Indianapolis, where she will be joined by state and federal leaders as well as small business owners in the manufacturing sector.\u003c/p\u003e\u003cp\u003eThe SBA stated that this initiative reflects a commitment to bolstering the nation’s industrial base while ensuring that essential goods are produced domestically. The agency emphasized that supporting small manufacturers is a key component of economic growth, job creation, and national security.\u003c/p\u003e\u003chr/\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003csection id=\"related-articles\"\u003e\u003cp\u003eEditor\u0026#39;s Picks\u003c/p\u003e\u003c/section\u003e\u003csection id=\"abouttheauthor\"\u003e\u003cul\u003e\u003c/ul\u003e\u003chr/\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://smallbiztrends.com/author/joshua-sophy/\"\u003e\u003cimg src=\"https://smallbiztrends.com/wp-content/uploads/userphoto/431.thumbnail.jpg\" alt=\"Joshua Sophy\" width=\"65\" height=\"150\" ezimgfmt=\"rs rscb1 src ng ngcb1\" data-ezsrc=\"https://smallbiztrends.com/wp-content/uploads/userphoto/431.thumbnail.jpg\"/\u003e\u003c/a\u003e\nJoshua Sophy is the Editor for Small Business Trends and has been a member of the team for 16 years. A professional journalist with 20 years of experience in traditional media and online media, he attended Waynesburg University and is a member of the Society of Professional Journalists. He has held roles of reporter, editor and publisher, having founded his own local newspaper, the Pottsville Free Press.\u003c/p\u003e\u003chr/\u003e\u003c/div\u003e\u003chr/\u003e\u003c/section\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-10T21:36:35Z",
  "modifiedTime": null
}
