{
  "id": "86b6b483-39af-4580-ba3a-a2285b73b40e",
  "title": "Transform 2025: Why observability is critical for AI agent ecosystems",
  "link": "https://venturebeat.com/ai/transform-2025-why-observability-is-critical-for-ai-agent-ecosystems/",
  "description": "New Relic's Ashan Willy talked about how they're instrumenting agentic systems for measurable ROI to maximize agentic AI.",
  "author": "VB Staff",
  "published": "Wed, 02 Jul 2025 13:50:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "Agentic AI",
    "New Relic",
    "observability",
    "observability platform",
    "VB Transform 2025"
  ],
  "byline": "VB Staff",
  "length": 4695,
  "excerpt": "New Relic's Ashan Willy talked about how they're instrumenting agentic systems for measurable ROI to maximize agentic AI.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "July 2, 2025 6:50 AM Ashan Willy, Sam Witteveen The autonomous software revolution is coming. At Transform 2025, Ashan Willy, CEO of New Relic and Sam Witteveen, CEO and co-founder of Red Dragon AI, talked about how they’re instrumenting agentic systems for measurable ROI and charting the infrastructure roadmap to maximize agentic AI. New Relic provides observability to customers by capturing and correlating application, log, and infrastructure telemetry in real time. Observability goes beyond monitoring — it’s about equipping teams with the context and insight needed to understand, troubleshoot, and optimize complex systems, even in the face of unexpected issues. Today that’s become a considerably more complex undertaking now that generative and agentic AI are in the mix. And observability for the company now includes monitoring everything from Nvidia NIM, DeepSeek, ChatGPT and so on — use of its AI monitoring is up roughly 30%, quarter over quarter, reflecting the acceleration of adoption. “The other thing we see is a huge diversity in models,” Willy said. “Enterprises started with GPT, but are starting to use a whole bunch of models. We’ve seen about a 92% increase in variance of models that are being used. And we’re starting to see enterprises adopt more models. The question is, how do you measure the effectiveness?” Observability in an agentic world In other words, how is observability evolving? That’s a big question. The use cases vary wildly across industries, and the functionality is fundamentally different for each individual company, depending on size and goals. A financial firm might be focused on maximizing EBITDA margins, while a product-focused company is measuring speed to market alongside quality control. When New Relic was founded in 2008, the center of gravity for observability was application monitoring for SaaS, mobile, and then eventually cloud infrastructure. The rise of AI and agentic AI is bringing observability back to applications, as agents, micro-agents, and nano-agents are running and producing AI-written code. AI for observability As the number of services and microservices rises, especially for digitally native organizations, the cognitive load for any human handling observability tasks becomes overwhelming. Of course, AI can help that, Willy says. “The way it’s going to work is you’re going to have enough information where you’ll work in cooperative mode,” he explained. “The promise of agents in observability is to take some of those automatic workloads and make them happen. That will democratize it to more people.” Single platform agentic observability A single platform for observability takes advantage of the agentic world. Agents automate workflows, but they form deep integrations into the entire ecosystem, across all the multiple tools an organization has in play, like Harness, GitHub, ServiceNow, and so on. With agentic AI, developers can be alerted to what’s happening with code errors anywhere in the ecosystem and fix them immediately, without leaving their coding platform. In other words, if there’s an issue with code deployed in GitHub, an observability platform powered by agents can detect it, determine how to solve it, and then alert the engineer — or automate the process entirely. “Our agent is fundamentally looking at every piece of information we have on our platform,” Willy said. “That could be anything from how the application’s performing, how the underlying Azure or AWS structure is performing — anything we think is relevant to that code deployment. We call it agentic skills. We don’t rely on a third party to know APIs and so on.” In GitHub for example, they let a developer know when code is running fine, where errors are being handled, or even when a software rollback is necessary, and then automate that rollback, with developer approval. The next step, which New Relic announced last month, is working with Copilot coding agent to tell the developer exactly which lines of code it’s seeing the issue with. Copilot then goes back, corrects the issue, and then gets a version ready to deploy again. The future of agentic AI As organizations adopt agentic AI and start to adapt to it, they’re going to find that observability is a critical part of its functionality, Willy says. “As you start to build all these agentic integrations and pieces, you’re going to want to know what the agent does,” he says. “This is sort of reasoning for the infrastructure. Reasoning to find out what’s going on in your production. That’s what observability will bring, and we’re on the forefront of that.”",
  "image": "https://venturebeat.com/wp-content/uploads/2025/07/VBTRANSFORM25-0220-X3.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2025-07-02T13:50:00+00:00\" datetime=\"2025-07-02T13:50:00+00:00\"\u003eJuly 2, 2025 6:50 AM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"442\" src=\"https://venturebeat.com/wp-content/uploads/2025/07/VBTRANSFORM25-0220-X3.jpg?w=750\" alt=\" WitteveenAshan Willy, Sam\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAshan Willy, Sam Witteveen\u003c/span\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003eThe autonomous software revolution is coming. At \u003ca href=\"https://www.vbtransform.com/\"\u003eTransform 2025\u003c/a\u003e, Ashan Willy, CEO of New Relic and Sam Witteveen, CEO and co-founder of Red Dragon AI, talked about how they’re instrumenting agentic systems for measurable ROI and charting the infrastructure roadmap to maximize agentic AI.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"Building observable AI agent ecosystems in the $1 trillion post-SaaS economy | VB Transform 2025\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/d-l0SH8PYqM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eNew Relic provides observability to customers by capturing and correlating application, log, and infrastructure telemetry in real time. Observability goes beyond monitoring — it’s about equipping teams with the context and insight needed to understand, troubleshoot, and optimize complex systems, even in the face of unexpected issues. Today that’s become a considerably more complex undertaking now that generative and agentic AI are in the mix. And observability for the company now includes monitoring everything from Nvidia NIM, DeepSeek, ChatGPT and so on — use of its AI monitoring is up roughly 30%, quarter over quarter, reflecting the acceleration of adoption.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The other thing we see is a huge diversity in models,” Willy said. “Enterprises started with GPT, but are starting to use a whole bunch of models. We’ve seen about a 92% increase in variance of models that are being used. And we’re starting to see enterprises adopt more models. The question is, how do you measure the effectiveness?”\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-observability-in-an-agentic-world\"\u003e\u003cstrong\u003eObservability in an agentic world\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn other words, how is observability evolving? That’s a big question. The use cases vary wildly across industries, and the functionality is fundamentally different for each individual company, depending on size and goals. A financial firm might be focused on maximizing EBITDA margins, while a product-focused company is measuring speed to market alongside quality control.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen New Relic was founded in 2008, the center of gravity for observability was application monitoring for SaaS, mobile, and then eventually cloud infrastructure. The rise of AI and agentic AI is bringing observability back to applications, as agents, micro-agents, and nano-agents are running and producing AI-written code.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-ai-for-observability\"\u003e\u003cstrong\u003eAI for observability\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs the number of services and microservices rises, especially for digitally native organizations, the cognitive load for any human handling observability tasks becomes overwhelming. Of course, AI can help that, Willy says.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The way it’s going to work is you’re going to have enough information where you’ll work in cooperative mode,” he explained. “The promise of agents in observability is to take some of those automatic workloads and make them happen. That will democratize it to more people.”\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-single-platform-agentic-observability\"\u003e\u003cstrong\u003eSingle platform agentic observability\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eA single platform for observability takes advantage of the agentic world. Agents automate workflows, but they form deep integrations into the entire ecosystem, across all the multiple tools an organization has in play, like Harness, GitHub, ServiceNow, and so on. With agentic AI, developers can be alerted to what’s happening with code errors anywhere in the ecosystem and fix them immediately, without leaving their coding platform.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn other words, if there’s an issue with code deployed in GitHub, an observability platform powered by agents can detect it, determine how to solve it, and then alert the engineer — or automate the process entirely.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Our agent is fundamentally looking at every piece of information we have on our platform,” Willy said. “That could be anything from how the application’s performing, how the underlying Azure or AWS structure is performing — anything we think is relevant to that code deployment. We call it agentic skills. We don’t rely on a third party to know APIs and so on.”\u003c/p\u003e\n\n\n\n\u003cp\u003eIn GitHub for example, they let a developer know when code is running fine, where errors are being handled, or even when a software rollback is necessary, and then automate that rollback, with developer approval. The next step, which New Relic announced last month, is working with Copilot coding agent to tell the developer exactly which lines of code it’s seeing the issue with. Copilot then goes back, corrects the issue, and then gets a version ready to deploy again.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-future-of-agentic-ai\"\u003e\u003cstrong\u003eThe future of agentic AI\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs organizations adopt agentic AI and start to adapt to it, they’re going to find that observability is a critical part of its functionality, Willy says.\u003c/p\u003e\n\n\n\n\u003cp\u003e“As you start to build all these agentic integrations and pieces, you’re going to want to know what the agent does,” he says. “This is sort of reasoning for the infrastructure. Reasoning to find out what’s going on in your production. That’s what observability will bring, and we’re on the forefront of that.”\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-02T13:50:00Z",
  "modifiedTime": "2025-07-01T22:20:39Z"
}
