{
  "id": "88e6ae25-3d74-4259-94f6-b33cfb0a3126",
  "title": "The future of engineering belongs to those who build with AI, not without it",
  "link": "https://venturebeat.com/ai/the-future-of-engineering-belongs-to-those-who-build-with-ai-not-without-it/",
  "description": "As we look ahead, the relationship between engineers and AI systems will likely evolve from tool and user to something more symbiotic.",
  "author": "Rizwan Patel, Altimetrik",
  "published": "Sat, 31 May 2025 19:05:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "DataDecisionMakers",
    "Programming \u0026 Development",
    "AI, ML and Deep Learning",
    "Generative AI",
    "large language models",
    "LLMOps",
    "NLP"
  ],
  "byline": "Rizwan Patel, Altimetrik",
  "length": 7120,
  "excerpt": "As we look ahead, the relationship between engineers and AI systems will likely evolve from tool and user to something more symbiotic.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More When Salesforce CEO Marc Benioff recently announced that the company would not hire any more engineers in 2025, citing a “30% productivity increase on engineering” due to AI, it sent ripples through the tech industry. Headlines quickly framed this as the beginning of the end for human engineers — AI was coming for their jobs. But those headlines miss the mark entirely. What’s really happening is a transformation of engineering itself. Gartner named agentic AI as its top tech trend for this year. The firm also predicts that 33% of enterprise software applications will include agentic AI by 2028 — a significant portion, but far from universal adoption. The extended timeline suggests a gradual evolution rather than a wholesale replacement. The real risk isn’t AI taking jobs; it’s engineers who fail to adapt and are left behind as the nature of engineering work evolves. The reality across the tech industry reveals an explosion of demand for engineers with AI expertise. Professional services firms are aggressively recruiting engineers with generative AI experience, and technology companies are creating entirely new engineering positions focused on AI implementation. The market for professionals who can effectively leverage AI tools is extraordinarily competitive. While claims of AI-driven productivity gains may be grounded in real progress, such announcements often reflect investor pressure for profitability as much as technological advancement. Many companies are adept at shaping narratives to position themselves as leaders in enterprise AI — a strategy that aligns well with broader market expectations. How AI is transforming engineering work The relationship between AI and engineering is evolving in four key ways, each representing a distinct capability that augments human engineering talent but certainly doesn’t replace it.  AI excels at summarization, helping engineers distill massive codebases, documentation and technical specifications into actionable insights. Rather than spending hours poring over documentation, engineers can get AI-generated summaries and focus on implementation. Also, AI’s inferencing capabilities allow it to analyze patterns in code and systems and proactively suggest optimizations. This empowers engineers to identify potential bugs and make informed decisions more quickly and with greater confidence. Third, AI has proven remarkably adept at converting code between languages. This capability is proving invaluable as organizations modernize their tech stacks and attempt to preserve institutional knowledge embedded in legacy systems. Finally, the true power of gen AI lies in its expansion capabilities — creating novel content like code, documentation or even system architectures. Engineers are using AI to explore more possibilities than they could alone, and we’re seeing these capabilities transform engineering across industries.  In healthcare, AI helps create personalized medical instruction systems that adjust based on a patient’s specific conditions and medical history. In pharmaceutical manufacturing, AI-enhanced systems optimize production schedules to reduce waste and ensure an adequate supply of critical medications. Major banks have invested in gen AI for longer than most people realize, too; they are building systems that help manage complex compliance requirements while improving customer service.  The new engineering skills landscape As AI reshapes engineering work, it’s creating entirely new in-demand specializations and skill sets, like the ability to effectively communicate with AI systems. Engineers who excel at working with AI can extract significantly better results. Similar to how DevOps emerged as a discipline, large language model operations (LLMOps) focuses on deploying, monitoring and optimizing LLMs in production environments. Practitioners of LLMOps track model drift, evaluate alternative models and help to ensure consistent quality of AI-generated outputs. Creating standardized environments where AI tools can be safely and effectively deployed is becoming crucial. Platform engineering provides templates and guardrails that enable engineers to build AI-enhanced applications more efficiently. This standardization helps ensure consistency, security and maintainability across an organization’s AI implementations. Human-AI collaboration ranges from AI merely providing recommendations that humans may ignore, to fully autonomous systems that operate independently. The most effective engineers understand when and how to apply the appropriate level of AI autonomy based on the context and consequences of the task at hand.  Keys to successful AI integration Effective AI governance frameworks — which ranks No. 2 on Gartner’s top trends list — establish clear guidelines while leaving room for innovation. These frameworks address ethical considerations, regulatory compliance and risk management without stifling the creativity that makes AI valuable. Rather than treating security as an afterthought, successful organizations build it into their AI systems from the beginning. This includes robust testing for vulnerabilities like hallucinations, prompt injection and data leakage. By incorporating security considerations into the development process, organizations can move quickly without compromising safety. Engineers who can design agentic AI systems create significant value. We’re seeing systems where one AI model handles natural language understanding, another performs reasoning and a third generates appropriate responses, all working in concert to deliver better results than any single model could provide. As we look ahead, the relationship between engineers and AI systems will likely evolve from tool and user to something more symbiotic. Today’s AI systems are powerful but limited; they lack true understanding and rely heavily on human guidance. Tomorrow’s systems may become true collaborators, proposing novel solutions beyond what engineers might have considered and identifying potential risks humans might overlook. Yet the engineer’s essential role — understanding requirements, making ethical judgments and translating human needs into technological solutions — will remain irreplaceable. In this partnership between human creativity and AI, there lies the potential to solve problems we’ve never been able to tackle before — and that’s anything but a replacement. Rizwan Patel is head of information security and emerging technology at Altimetrik.  Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/05/DDM-programming.jpeg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. \u003ca href=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\" data-type=\"link\" data-id=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\"\u003eLearn More\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003eWhen Salesforce CEO Marc Benioff \u003ca href=\"https://www.techradar.com/pro/salesforce-ceo-says-no-plans-to-hire-more-engineers-as-ai-is-doing-a-great-job\" target=\"_blank\" rel=\"noreferrer noopener\"\u003erecently announced\u003c/a\u003e that the company would not hire any more engineers in 2025, citing a “30% productivity increase on engineering” due to AI, it sent ripples through the tech industry. Headlines quickly framed this as the beginning of the end for human engineers — AI was coming for their jobs.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut those headlines miss the mark entirely. What’s really happening is a transformation of engineering itself. \u003ca href=\"https://www.gartner.com/en/articles/intelligent-agent-in-ai\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eGartner named agentic AI\u003c/a\u003e as its top tech trend for this year. \u003ca href=\"https://www.gartner.com/en/articles/intelligent-agent-in-ai\"\u003eThe firm also predicts\u003c/a\u003e that 33% of enterprise software applications will include agentic AI by 2028 — a significant portion, but far from universal adoption. The extended timeline suggests a gradual evolution rather than a wholesale replacement. The real risk isn’t AI taking jobs; it’s engineers who fail to adapt and are left behind as the nature of engineering work evolves.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe reality across the tech industry reveals an explosion of demand for engineers with \u003ca href=\"https://venturebeat.com/ai/from-disruption-to-reinvention-how-knowledge-workers-can-thrive-after-ai/\"\u003eAI expertise\u003c/a\u003e. Professional services firms are aggressively recruiting engineers with generative AI experience, and technology companies are creating entirely new engineering positions focused on AI implementation. The market for professionals who can effectively leverage AI tools is extraordinarily competitive.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile claims of AI-driven productivity gains may be grounded in real progress, such announcements often reflect investor pressure for profitability as much as technological advancement. Many companies are adept at shaping narratives to position themselves as leaders in \u003ca href=\"https://venturebeat.com/ai/beyond-single-model-ai-how-architectural-design-drives-reliable-multi-agent-orchestration/\u0026#39;\"\u003eenterprise AI\u003c/a\u003e — a strategy that aligns well with broader market expectations.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-how-ai-is-transforming-engineering-work\"\u003eHow AI is transforming engineering work\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe relationship between AI and engineering is evolving in four key ways, each representing a distinct capability that augments human engineering talent but certainly doesn’t replace it. \u003c/p\u003e\n\n\n\n\u003cp\u003eAI excels at summarization, helping engineers distill massive codebases, documentation and technical specifications into actionable insights. Rather than spending hours poring over documentation, engineers can get AI-generated summaries and focus on implementation.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlso, \u003ca href=\"https://venturebeat.com/ai/adopting-agentic-ai-build-ai-fluency-redesign-workflows-dont-neglect-supervision/\"\u003eAI’s inferencing capabilities\u003c/a\u003e allow it to analyze patterns in code and systems and proactively suggest optimizations. This empowers engineers to identify potential bugs and make informed decisions more quickly and with greater confidence.\u003c/p\u003e\n\n\n\n\u003cp\u003eThird, AI has proven remarkably adept at converting code between languages. This capability is proving invaluable as organizations modernize their tech stacks and attempt to preserve institutional knowledge embedded in legacy systems.\u003c/p\u003e\n\n\n\n\u003cp\u003eFinally, the true power of gen AI lies in its expansion capabilities — creating novel content like code, documentation or even system architectures. Engineers are using AI to explore more possibilities than they could alone, and we’re seeing these capabilities transform engineering across industries. \u003c/p\u003e\n\n\n\n\u003cp\u003eIn healthcare, AI helps create personalized medical instruction systems that adjust based on a patient’s specific conditions and medical history. In pharmaceutical manufacturing, AI-enhanced systems optimize production schedules to reduce waste and ensure an adequate supply of critical medications. Major banks have invested in gen AI for longer than most people realize, too; they are building systems that help manage complex compliance requirements while improving customer service. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-new-engineering-skills-landscape\"\u003eThe new engineering skills landscape\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs AI reshapes engineering work, it’s creating entirely new in-demand specializations and skill sets, like the ability to effectively \u003ca href=\"https://venturebeat.com/ai/the-great-cognitive-migration-ai-will-win-at-intelligence-but-only-we-can-make-it-matter/\"\u003ecommunicate with AI systems\u003c/a\u003e. Engineers who excel at working with AI can extract significantly better results.\u003c/p\u003e\n\n\n\n\u003cp\u003eSimilar to how DevOps emerged as a discipline, large language model operations (LLMOps) focuses on deploying, monitoring and optimizing LLMs in production environments. Practitioners of LLMOps track model drift, evaluate alternative models and help to ensure consistent quality of AI-generated outputs.\u003c/p\u003e\n\n\n\n\u003cp\u003eCreating standardized environments where AI tools can be safely and effectively deployed is becoming crucial. Platform engineering provides templates and guardrails that enable engineers to build AI-enhanced applications more efficiently. This standardization helps ensure consistency, security and maintainability across an organization’s AI implementations.\u003c/p\u003e\n\n\n\n\u003cp\u003eHuman-AI collaboration ranges from AI merely providing recommendations that humans may ignore, to fully autonomous systems that operate independently. The most effective engineers understand when and how to apply the appropriate level of AI autonomy based on the context and consequences of the task at hand. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-keys-to-successful-ai-integration\"\u003eKeys to successful AI integration\u003c/h2\u003e\n\n\n\n\u003cp\u003eEffective AI governance frameworks — which ranks No. 2 on Gartner’s top trends list — establish clear guidelines while leaving room for innovation. These frameworks address ethical considerations, regulatory compliance and risk management without stifling the creativity that makes AI valuable.\u003c/p\u003e\n\n\n\n\u003cp\u003eRather than treating security as an afterthought, successful organizations build it into their AI systems from the beginning. This includes robust testing for vulnerabilities like hallucinations, prompt injection and data leakage. By incorporating security considerations into the development process, organizations can move quickly without compromising safety.\u003c/p\u003e\n\n\n\n\u003cp\u003eEngineers who can design agentic AI systems create significant value. We’re seeing systems where one AI model handles natural language understanding, another performs reasoning and a third generates appropriate responses, all working in concert to deliver better results than any single model could provide.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs we look ahead, the relationship between engineers and AI systems will likely evolve from tool and user to something more symbiotic. Today’s AI systems are powerful but limited; they lack true understanding and rely heavily on human guidance. Tomorrow’s systems may become true collaborators, proposing novel solutions beyond what engineers might have considered and identifying potential risks humans might overlook.\u003c/p\u003e\n\n\n\n\u003cp\u003eYet the engineer’s essential role — understanding requirements, making ethical judgments and translating human needs into technological solutions — will remain irreplaceable. In this partnership between human creativity and AI, there lies the potential to solve problems we’ve never been able to tackle before — and that’s anything but a replacement.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eRizwan Patel is head of information security and emerging technology at \u003ca href=\"https://www.altimetrik.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAltimetrik\u003c/a\u003e. \u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://venturebeat.com/wp-content/themes/vb-news/brand/img/vb-daily-phone.png\" alt=\"\"/\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-05-31T19:05:00Z",
  "modifiedTime": "2025-05-31T15:54:36Z"
}
