{
  "id": "8bf818fb-f108-4f9f-b74e-d31e99ef14f5",
  "title": "Dark and Darker Mobile soft launches in Canada in February",
  "link": "https://venturebeat.com/games/krafton/",
  "description": "Krafton said it will soft launch Dark and Darker Mobile, under development by Bluehole Studio, in Canada on February 5.",
  "author": "Dean Takahashi",
  "published": "Fri, 17 Jan 2025 00:00:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "Game Development",
    "GamesBeat",
    "Gaming Business",
    "Bluehole Studio",
    "category-/Games/Computer \u0026 Video Games",
    "Dark and Darker Mobile",
    "Krafton"
  ],
  "byline": "Dean Takahashi",
  "length": 2857,
  "excerpt": "Krafton said it will soft launch Dark and Darker Mobile, under development by Bluehole Studio, in Canada on February 5.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "Krafton said it will soft launch Dark and Darker Mobile, under development by Bluehole Studio, in Canada on February 5. Dark and Darker Mobile garnered significant attention last year by conducting two large-scale global tests. The game is currently undergoing development to enhance the fun of its gameplay and add diverse content based on user feedback. Following the soft launch in Canada, the game is set for a global release in phases during the first half of this year. Updates about future changes to the game will be shared through official channels including Dark and Darker Mobile’s Discord server. Key planned updates include adjustments to the “Darkswarm” system and escape mechanics to enhance the freedom and excitement of exploration and escape. Dungeon structures will be refined to make party play more seamless. Class differentiation will be bolstered with improvements to basic attacks and combat mechanics. These changes will enable players to enjoy a wider range of gameplay experiences based on their choice of weapons and skills. The game will also offer more ways for users to express their individuality. The character customization system will be upgraded, allowing users to create unique characters, and a variety of costume items will provide diverse visual effects. Additionally, the mercenary system will be enhanced, introducing special mercenaries with exclusive appearances, illustrations, stories, combat styles, and unique abilities that are not available with standard mercenaries. User interface improvements tailored for mobile environments are also in progress, aiming to make the game more intuitive and convenient. A new system will allow players to easily gauge the value of acquired resources and loot, while touch zones for buttons will be optimized to minimize input errors. The game will adopt a season system, introducing new content such as dungeons and classes with each season. Each season will feature unique themes and objectives, allowing users to achieve season ranks based on their performance. Additionally, a progression system will enable users to enjoy subsequent seasons more comfortably, depending on their key achievements from the previous season. Joonseok Ahn, executive producer at Bluehole Studio overseeing the development of Dark and Darker Mobile, said in a statement, “We are thrilled to present Dark and Darker Mobile to users through the soft launch in Canada. We hope the game’s unique features and newly updated content deliver an exciting and memorable experience for users.” Dark and Darker Mobile is currently available for global pre-registration. GB Daily Stay in the know! Get the latest news in your inbox daily Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/01/dark-and-darker-mobile.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003ca href=\"https://venturebeat.com/gaming-business/krafton-and-nvidia-team-up-to-create-smarter-ai-characters-for-pubg-and-inzoi/\"\u003eKrafton\u003c/a\u003e said it will soft launch \u003ca href=\"https://dndm.krafton.com/en\"\u003eDark and Darker Mobile\u003c/a\u003e, under development by Bluehole Studio, in Canada on February 5.\u003c/p\u003e\n\n\n\n\u003cp\u003eDark and Darker Mobile garnered significant attention last year by conducting two large-scale global tests. The game is currently undergoing development to enhance the fun of its gameplay and add diverse content based on user feedback. Following the soft launch in Canada, the game is set for a global release in phases during the first half of this year.\u003c/p\u003e\n\n\n\n\u003cp\u003eUpdates about future changes to the game will be shared through official channels including Dark and Darker Mobile’s Discord server. Key planned updates include adjustments to the “Darkswarm” system and escape mechanics to enhance the freedom and excitement of exploration and escape. \u003c/p\u003e\n\n\n\n\u003cp\u003eDungeon structures will be refined to make party play more seamless. Class differentiation will be bolstered with improvements to basic attacks and combat mechanics. These changes will enable players to enjoy a wider range of gameplay experiences based on their choice of weapons and skills.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe game will also offer more ways for users to express their individuality. The character customization system will be upgraded, allowing users to create unique characters, and a variety of costume items will provide diverse visual effects. Additionally, the mercenary system will be enhanced, introducing special mercenaries with exclusive appearances, illustrations, stories, combat styles, and unique abilities that are not available with standard mercenaries.\u003c/p\u003e\n\n\n\n\u003cp\u003eUser interface improvements tailored for mobile environments are also in progress, aiming to make the game more intuitive and convenient. A new system will allow players to easily gauge the value of acquired resources and loot, while touch zones for buttons will be optimized to minimize input errors.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe game will adopt a season system, introducing new content such as dungeons and classes with each season. Each season will feature unique themes and objectives, allowing users to achieve season ranks based on their performance. Additionally, a progression system will enable users to enjoy subsequent seasons more comfortably, depending on their key achievements from the previous season.\u003c/p\u003e\n\n\n\n\u003cp\u003eJoonseok Ahn, executive producer at Bluehole Studio overseeing the development of Dark and Darker Mobile, said in a statement, “We are thrilled to present Dark and Darker Mobile to users through the soft launch in Canada. We hope the game’s unique features and newly updated content deliver an exciting and memorable experience for users.”\u003c/p\u003e\n\n\n\n\u003cp\u003eDark and Darker Mobile is currently available for global pre-registration. \u003c/p\u003e\n\u003cdiv id=\"boilerplate_2663995\"\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eGB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eStay in the know! Get the latest news in your inbox daily\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-17T00:00:00Z",
  "modifiedTime": "2025-01-16T06:12:21Z"
}
