{
  "id": "8e44c84f-b19c-4719-bae4-83be80472ca3",
  "title": "Walk Into Your Next Client Meeting Armed With These 4 Guiding Principles, And Leave With a Paying Client",
  "link": "https://www.entrepreneur.com/growing-a-business/walk-into-your-next-client-meeting-armed-with-these-4/487728",
  "description": "I was going on four professional coffee dates and averaging one new client a week, and it's thanks to these four guiding principles.",
  "author": "Chuck Blakeman",
  "published": "Fri, 21 Mar 2025 22:00:00 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Chuck Blakeman",
  "length": 6819,
  "excerpt": "Getting our mindset right walking in to an appointment with a potential buyer is the whole game. Here's how successful people do it.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "Opinions expressed by Entrepreneur contributors are their own. I had been having four cups of coffee a week with potential clients and acquiring about one out of four. The back-of-the-napkin data I was keeping showed my conversion rate from \"Buying Conversation\" to signing a new client was 27.59%.Then \"it\" happened. For almost two months, nobody bought anything – it was a business development desert out there. I learned later I had contracted a bad case of what I like to call \"Commission Breath\" (yeah, it should be capitalized – it's an official selling disease). I had unconsciously moved to a place where I was more intent on separating potential clients from their money than actually trying to help them. I was focused on selling, not serving, and they could smell it. As a result, I developed the \"Four Walking-In Commitments,\" and not long after, \"Commission Breath\" was a thing of the past.I was never trained to do sales. I didn't like it and wanted to put all my energies into serving my existing customers. But in my first business, it didn't take long to find out that I had to have buying conversations in order to have clients. So, cups of coffee became a staple weekly activity for me. Related: Tips for Acing Your Next Client MeetingEarly on, I was relieved to find a cure for the common cold call in these \"Buying Conversations\" with the simple principle: serve — don't sell. I learned how to stop having \"Selling Conversations\" and to flip the script to \"Buying Conversations,\" where I was no longer selling, but the customer was actively pursuing me to buy. For decades, I've embraced three business development principles, and these eventually gave birth to what I call \"Walking-In Commitments.\"Meet people where they are — not where I want them to be. Many sales tactics are built around enticing the potential customer to join me \"over here,\" mentally or emotionally, to look at my product from my point of view. When we do the opposite and meet them where they are, we gain trust. Where are they right now? Personally?Seek to understand — not to be understood. Listen and truly hear first, and listen more than talk. If you want them to understand you, they need to know you understand them first. When they feel understood, they are much more likely to want to hear what you have to say.Serve — don't sell. Their best interest must be served. Many times, what people want is not what they need, and selling them what they want could backfire on you and on them. When we put the longterm best interests of the customer first, we serve them by steering them to what they need, even if it's not something we provide. Zig Ziglar was right: you'll get what you want after you get your customers what they need.The \"Walking-in Commitments\"With these three simple buying principles in mind, over the years, I developed the habit of reviewing four intentions we eventually called \"Walking-In Commitments\" because we reviewed them as we walked into meetings with potential clients. I memorized them, and I review them every time I meet with a potential client:I intend to serve this person, not to sell.I will not talk about my business unless asked.I intend to make money from this meeting.I will make an offer.Related: How Do You Acquire Clients in Any Situation? You Need to Ask These Questions.At first reading, it could easily look like committing to one or two of the \"Walking-In Commitments\" would make it impossible to commit to the others. Let's unpack them to find they are congruent: I intend to serve— not sell. Nobody wants to be sold anything. I intend to find out what they need and offer them that, even if it's somebody else's product or service. I'm committed to doing what is best for them, not for our company. If both our interests line up, great. If not, I will steer them to a product or service that truly meets their needs. It has to work for both of us, not just for me.I will not talk about my business unless asked. - This sounds like financial suicide, right? But I've been committed to it for a few decades, and I'm convinced if you stop talking about your business in One2One meetings unless you're asked, you will gain more clients. And we have to ask the tricky question: if you're in a 60-minute cup of coffee and they never ask about me or my business, do I really want to do business with them?I intend to make money from this meeting. If I just want to serve and won't talk about my business unless asked, it's hard to see how I'm going to make money from this meeting. Please note, though, that I didn't say I intended to make money in this meeting, but rather, I intended to make money from this meeting.I met with a business owner, and I found out in the first few minutes that she and her spouse had lost their babysitter for their 20th-anniversary dinner that evening. Did she need my service right now? No, she needed a babysitter. So I got hold of my spouse, who gave us contacts, and we called around our neighborhood and found a babysitter. That took 20 minutes or so, and we didn't have much time left to backtrack into having a \"Buying Conversation.\" But I still intended to make money from that meeting. And I did, by making her the right offer. I intend to make an offer. My offer was what she needed, not what I needed – a babysitter. I also offered to meet again, but we never did. Eight months later, a business owner called who needed help with her fast-growing business. She and I had a great working relationship for a long time. The woman was the sister of the woman who had lost her babysitter. I had kept all four walking-in commitments. I served her by getting her a babysitter, and I didn't talk about my business because it didn't come up in the context of solving her problem. I gave her an offer (a babysitter), and many months later, I made money from that meeting, not in that meeting. This isn't voodoo or mystical karma. You get what you intend, and you reap what you sow.The four \"Walking-In Commitments\" separate us from salespeople who have been taught the only successful conclusion to a meeting is to sell something. It is my conviction that when we focus on relationships instead of transactions, we will always do better in the long run. I would love it if everybody who came in needed my services. And when they don't, I steer them to what they need because I know I will get what I need down the road.If you memorize these \"Walking-in Commitments,\" as thousands of business owners have, they could make all the difference walking into your next meeting, and they are a great way to ensure you never have \"Commission Breath\" again.Want to read more stories like this? Subscribe to Money Makers, our free newsletter packed with creative side hustle ideas and successful strategies. Sign up here.",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1742486128-walk-into-client-meeting-0325-g-1462983040.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n    Opinions expressed by Entrepreneur contributors are their own.  \u003c/p\u003e\u003cdiv\u003e\n      \u003cp\u003eI had been having four cups of coffee a week with potential clients and acquiring about one out of four. The back-of-the-napkin data I was keeping showed my conversion rate from \u0026#34;Buying Conversation\u0026#34; to signing a new client was 27.59%.\u003c/p\u003e\u003cp\u003eThen \u0026#34;it\u0026#34; happened. For almost two months, nobody bought anything – it was a business development desert out there. I learned later I had contracted a bad case of what I like to call \u0026#34;Commission Breath\u0026#34; (yeah, it should be capitalized – it\u0026#39;s an official selling disease). I had unconsciously moved to a place where I was more intent on separating potential clients from their money than actually trying to help them. I was focused on selling, not serving, and they could smell it. As a result, I developed the \u0026#34;Four Walking-In Commitments,\u0026#34; and not long after, \u0026#34;Commission Breath\u0026#34; was a thing of the past.\u003c/p\u003e\u003cp\u003eI was never trained to do sales. I didn\u0026#39;t like it and wanted to put all my energies into serving my existing customers. But in my first business, it didn\u0026#39;t take long to find out that I had to have buying conversations in order to have clients. So, cups of coffee became a staple weekly activity for me.\u003c/p\u003e\n  \n  \n  \n\n  \u003cp\u003e\u003cb\u003eRelated: \u003ca href=\"https://www.entrepreneur.com/business-news/tips-for-acing-your-next-client-meeting/385144\" rel=\"follow\" target=\"_self\"\u003eTips for Acing Your Next Client Meeting\u003c/a\u003e\u003c/b\u003e\u003c/p\u003e\u003cp\u003eEarly on, I was relieved to find a cure for the common cold call in these \u0026#34;Buying Conversations\u0026#34; with the simple principle: \u003ci\u003eserve\u003c/i\u003e — don\u0026#39;t sell. I learned how to stop having \u0026#34;Selling Conversations\u0026#34; and to flip the script to \u0026#34;Buying Conversations,\u0026#34; where I was no longer selling, but the customer was actively pursuing me to buy.\u003c/p\u003e\n\n  \u003cp\u003eFor decades, I\u0026#39;ve embraced three business development principles, and these eventually gave birth to what I call \u0026#34;Walking-In Commitments.\u0026#34;\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cb\u003eMeet people where they are\u003c/b\u003e — \u003cb\u003enot where I want them to be\u003c/b\u003e. Many sales tactics are built around enticing the potential customer to join me \u0026#34;over here,\u0026#34; mentally or emotionally, to look at my product from \u003ci\u003emy\u003c/i\u003e point of view. When we do the opposite and meet them where \u003ci\u003ethey\u003c/i\u003e are, we gain trust. Where are \u003ci\u003ethey\u003c/i\u003e right now? Personally?\u003c/li\u003e\u003cli\u003e\u003cb\u003eSeek to understand — not to be understood\u003c/b\u003e. Listen and truly hear first, and listen more than talk. If you want them to understand you, they need to know you understand them first. When they feel understood, they are much more likely to want to hear what you have to say.\u003c/li\u003e\u003cli\u003e\u003cb\u003eServe — don\u0026#39;t sell\u003c/b\u003e. Their best interest must be served. Many times, what people want is not what they need, and selling them what they want could backfire on you and on them. When we put the longterm best interests of the customer first, we serve them by steering them to what they need, even if it\u0026#39;s not something we provide. \u003ca href=\"https://www.entrepreneur.com/leadership/zig-ziglar-and-the-importance-of-helping-others/225131\" rel=\"follow\" target=\"_self\"\u003eZig Ziglar was right\u003c/a\u003e: you\u0026#39;ll get what you want after you get your customers what they need.\u003c/li\u003e\u003c/ol\u003e\u003ch2\u003e\u003cb\u003eThe \u0026#34;Walking-in Commitments\u0026#34;\u003c/b\u003e\u003c/h2\u003e\u003cp\u003eWith these three simple buying principles in mind, over the years, I developed the habit of reviewing four intentions we eventually called \u0026#34;Walking-In Commitments\u0026#34; because we reviewed them as we walked into meetings with potential clients. I memorized them, and I review them every time I meet with a potential client:\u003c/p\u003e\u003col\u003e\u003cli\u003eI intend to serve this person, not to sell.\u003c/li\u003e\u003cli\u003eI will not talk about my business unless asked.\u003c/li\u003e\u003cli\u003eI intend to make money from this meeting.\u003c/li\u003e\u003cli\u003eI will make an offer.\u003c/li\u003e\u003c/ol\u003e\u003cp\u003e\u003cb\u003eRelated: \u003ca href=\"https://www.entrepreneur.com/growing-a-business/how-do-you-acquire-clients-in-any-situation-you-need-to/440529\" rel=\"follow\" target=\"_self\"\u003eHow Do You Acquire Clients in Any Situation? You Need to Ask These Questions.\u003c/a\u003e\u003c/b\u003e\u003c/p\u003e\u003cp\u003eAt first reading, it could easily look like committing to one or two of the \u0026#34;Walking-In Commitments\u0026#34; would make it impossible to commit to the others. Let\u0026#39;s unpack them to find they are congruent:\u003c/p\u003e\n\n  \u003cp\u003e\u003cb\u003eI intend to serve— not sell.\u003c/b\u003e Nobody wants to be sold anything. I intend to find out what \u003ci\u003ethey \u003c/i\u003eneed and offer them that, even if it\u0026#39;s somebody else\u0026#39;s product or service. I\u0026#39;m committed to doing what is best for them, not for our company. If both our interests line up, great. If not, I will steer them to a product or service that truly meets their needs. It has to work for both of us, not just for me.\u003c/p\u003e\u003cp\u003e\u003cb\u003eI will not talk about my business unless asked.\u003c/b\u003e - This sounds like financial suicide, right? But I\u0026#39;ve been committed to it for a few decades, and I\u0026#39;m convinced if you stop talking about your business in One2One meetings unless you\u0026#39;re asked, you will gain more clients. And we have to ask the tricky question: if you\u0026#39;re in a 60-minute cup of coffee and they never ask about me or my business, do I really want to do business with them?\u003c/p\u003e\u003cp\u003e\u003cb\u003eI intend to make money from this meeting.\u003c/b\u003e If I just want to serve and won\u0026#39;t talk about my business unless asked, it\u0026#39;s hard to see how I\u0026#39;m going to make money from this meeting. Please note, though, that I didn\u0026#39;t say I intended to make money \u003ci\u003ein\u003c/i\u003e this meeting, but rather, I intended to make money \u003ci\u003efrom\u003c/i\u003e this meeting.\u003c/p\u003e\u003cp\u003eI met with a business owner, and I found out in the first few minutes that she and her spouse had lost their babysitter for their 20th-anniversary dinner that evening. Did she need my service right now? No, she needed a babysitter. So I got hold of my spouse, who gave us contacts, and we called around our neighborhood and found a babysitter. That took 20 minutes or so, and we didn\u0026#39;t have much time left to backtrack into having a \u0026#34;Buying Conversation.\u0026#34; But I still intended to make money\u003ci\u003e from\u003c/i\u003e that meeting. And I did, by making her the right offer.\u003c/p\u003e\n\n  \u003cp\u003e\u003cb\u003eI intend to make an offer. \u003c/b\u003eMy offer was what she needed, not what I needed – a babysitter. I also offered to meet again, but we never did. Eight months later, a business owner called who needed help with her fast-growing business. She and I had a great working relationship for a long time. The woman was the sister of the woman who had lost her babysitter. I had kept all four walking-in commitments. I served her by getting her a babysitter, and I didn\u0026#39;t talk about my business because it didn\u0026#39;t come up in the context of solving her problem. I gave her an offer (a babysitter), and many months later, I made money \u003ci\u003efrom \u003c/i\u003ethat meeting, not \u003ci\u003ein\u003c/i\u003e that meeting. This isn\u0026#39;t voodoo or mystical karma. You get what you intend, and you reap what you sow.\u003c/p\u003e\u003cp\u003eThe four \u0026#34;Walking-In Commitments\u0026#34; separate us from salespeople who have been taught the only successful conclusion to a meeting is to sell something. It is my conviction that when we focus on relationships instead of transactions, we will always do better in the long run. I would love it if everybody who came in needed my services. And when they don\u0026#39;t, I steer them to what they need because I know I will get what I need down the road.\u003c/p\u003e\u003cp\u003eIf you memorize these \u0026#34;Walking-in Commitments,\u0026#34; as thousands of business owners have, they could make all the difference walking into your next meeting, and they are a great way to ensure you never have \u0026#34;Commission Breath\u0026#34; again.\u003c/p\u003e\u003cp\u003e\u003cb\u003eWant to read more stories like this?\u003c/b\u003e Subscribe to \u003ci\u003eMoney Makers\u003c/i\u003e, our free newsletter packed with creative side hustle ideas and successful strategies. \u003ca href=\"https://info.entrepreneur.com/money-makers-newsletter?utm_campaign=Money-Makers-Newsletter\u0026amp;utm_source=Website\u0026amp;utm_medium=Article\u0026amp;utm_content=Text-Link-1\" rel=\"follow\" target=\"_self\"\u003eSign up here.\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-21T22:00:00Z",
  "modifiedTime": "2025-03-21T22:00:00Z"
}
