{
  "id": "a20dcc26-efeb-4999-b201-2fe9d48c4bd8",
  "title": "'Probably Died Waiting for You to Do Your Lesson': Duolingo Says Its Mascot, Duo the Owl, Is Dead",
  "link": "https://www.entrepreneur.com/business-news/duolingo-says-its-mascot-duo-the-owl-is-dead/486944",
  "description": "The language app posted the news on social media Tuesday.",
  "author": "Erin Davis",
  "published": "Tue, 11 Feb 2025 21:48:48 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Erin Davis",
  "length": 2184,
  "excerpt": "Duolingo took to social media on Tuesday to announce that it has killed off its mascot, or, rather, the bird has died. The post ends with the company asking everyone to \"respect Dua Lipa's privacy at this time.\"",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "Duolingo took to social media on Tuesday to announce that it has killed off its mascot, or, rather, the bird has died.\"It is with heavy hearts that we inform you that Duo, formally known as The Duolingo Owl, is dead,\" the post begins. \"Authorities are currently investigating his death and we are cooperating fully.\"We suggest checking the marketing department for evidence. \"TBH, he probably died waiting for you to do your lesson, but what do we know?\" the company continued. \"If you feel inclined to share, please also include your credit card number so we can automatically sign you up for Duolingo Max in his memory.\"In a statement to a CBS affiliate, a Duolingo spokesperson confirmed that as a part of a new brand marketing campaign, Duo is \"dead\" but people shouldn't actually post their credit card information, as that part of the post was supposed to be a joke. The owl's popularity has taken on a life of its own, with the bird even making an appearance at Berlin Fashion Week last month.It's not the first time Duolingo has been unconventional in its approach to marketing (and meetings). In November 2024, the company replaced CEO Luis von Ahn on its earnings call with its purple-haired chatbot, Lily.\"Over time, she's going to do more and more of my job, and I can just retire,\" von Ahn said, at the time. The Duolingo bird during the Marina Hoermanseder Fashion Show as part of the Berlin Fashion Week AW25 at Hotel Oderberger on January 31, 2025, in Berlin, Germany. (Photo by Isa Foltin/Hoermanseder via Getty Images)The post ends with the company asking everyone to \"respect Dua Lipa's privacy at this time.\"The company's TikTok account has been posting about Dua Lipa for years, with Duolingo's social media team keeping the gag relevant with regular posting.Although the company didn't say what killed the owl, the marketing team decided to do this in the middle of the global bird flu, though it's not clear if that was intentional or ill-timed. Still, we'll wait for the final autopsy. Related: From an Airbnb Stay at Barbie's Malibu DreamHouse to Frozen Yogurt Flavors and Park Benches—The 'Barbie' Movie Team Is Going All In on Marketing",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1739308852-Duoowl-2196432829.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003eDuolingo took to social media on Tuesday to announce that it has killed off its mascot, or, rather, the bird has died.\u003c/p\u003e\u003cp\u003e\u0026#34;It is with heavy hearts that we inform you that Duo, formally known as The Duolingo Owl, is dead,\u0026#34; the \u003ca href=\"https://www.instagram.com/p/DF79IjgxfuE/\" rel=\"follow\" target=\"_self\"\u003epost begins\u003c/a\u003e. \u0026#34;Authorities are currently investigating his death and we are cooperating fully.\u0026#34;\u003c/p\u003e\u003cp\u003eWe suggest checking the marketing department for evidence.\u003c/p\u003e\n  \n  \n  \n\n  \u003cp\u003e\u0026#34;TBH, he probably died waiting for you to do your lesson, but what do we know?\u0026#34; the company continued. \u0026#34;If you feel inclined to share, please also include your credit card number so we can automatically sign you up for Duolingo Max in his memory.\u0026#34;\u003c/p\u003e\u003cp\u003eIn a \u003ca href=\"https://www.cbsnews.com/pittsburgh/news/duolingo-owl-dead/\" rel=\"follow\" target=\"_self\"\u003estatement to a CBS affiliate\u003c/a\u003e, a Duolingo spokesperson confirmed that as a part of a new brand marketing campaign, Duo is \u0026#34;dead\u0026#34; but people shouldn\u0026#39;t actually post their credit card information, as that part of the post was supposed to be a joke.\u003c/p\u003e\n\n  \u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/DF79IjgxfuE/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\u003c/blockquote\u003e\u003cp\u003eThe owl\u0026#39;s popularity has taken on a life of its own, with the bird even \u003ca href=\"https://culted.com/why-do-we-see-so-many-viral-moments-at-berlin-fashion-week/\" rel=\"follow\" target=\"_self\"\u003emaking an appearance\u003c/a\u003e at Berlin Fashion Week last month.\u003c/p\u003e\u003cp\u003eIt\u0026#39;s not the first time Duolingo has been unconventional in its approach to marketing (and meetings). In November 2024, the company replaced CEO Luis von Ahn \u003ca href=\"https://www.entrepreneur.com/business-news/duolingos-bored-teen-chatbot-spoke-for-ceo-on-earnings-call/482533\" rel=\"follow\" target=\"_self\"\u003eon its earnings call\u003c/a\u003e with its purple-haired chatbot, Lily.\u003c/p\u003e\u003cp\u003e\u0026#34;Over time, she\u0026#39;s going to do more and more of my job, and I can just retire,\u0026#34; von Ahn said, at the time.\u003c/p\u003e\n\n  \u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" role=\"presentation\" src=\"https://assets.entrepreneur.com/images/misc/1739307753_Duoowl-2196432829.jpg?width=1000\" width=\"1000\" height=\"667\"/\u003e\u003csup\u003eThe Duolingo bird during the Marina Hoermanseder Fashion Show as part of the Berlin Fashion Week AW25 at Hotel Oderberger on January 31, 2025, in Berlin, Germany. (Photo by Isa Foltin/Hoermanseder via Getty Images)\u003c/sup\u003e\u003c/p\u003e\u003cp\u003eThe post ends with the company asking everyone to \u0026#34;respect Dua Lipa\u0026#39;s privacy at this time.\u0026#34;\u003c/p\u003e\u003cp\u003eThe company\u0026#39;s TikTok account has been \u003ca href=\"https://www.linkedin.com/pulse/duolingo-dua-lipa-love-story-ages-tsch-agency-bwrfc/\" rel=\"follow\" target=\"_self\"\u003eposting about Dua Lipa\u003c/a\u003e for years, with Duolingo\u0026#39;s social media team keeping the gag relevant with regular posting.\u003c/p\u003e\u003cp\u003eAlthough the company didn\u0026#39;t say what killed the owl, the marketing team decided to do this in the middle of the global \u003ca href=\"https://www.entrepreneur.com/business-news/waffle-house-adds-egg-surcharge-restaurants-raise-prices/486570\" rel=\"follow\" target=\"_self\"\u003ebird flu\u003c/a\u003e, though it\u0026#39;s not clear if that was intentional or ill-timed. Still, we\u0026#39;ll wait for the final autopsy.\u003c/p\u003e\n\n  \u003cp\u003e\u003cb\u003eRelated:\u003c/b\u003e \u003ca href=\"https://www.entrepreneur.com/business-news/barbies-malibu-dreamhouse-is-latest-movie-marketing-stunt/454956\" rel=\"follow\" target=\"_self\"\u003eFrom an Airbnb Stay at Barbie\u0026#39;s Malibu DreamHouse to Frozen Yogurt Flavors and Park Benches—The \u0026#39;Barbie\u0026#39; Movie Team Is Going All In on Marketing\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-11T21:48:48Z",
  "modifiedTime": "2025-02-11T21:48:48Z"
}
