{
  "id": "a7338463-2e39-4a9e-8ed5-961ce4b0c91d",
  "title": "JPMorgan Shuts Down Internal Message Board Comments After Employees React to Return-to-Office Mandate",
  "link": "https://www.entrepreneur.com/business-news/jpmorgans-return-to-office-mandate-spurs-internal-pushback/485483",
  "description": "Employees were given the option to leave comments about the RTO mandate with their first and last names on display — and they did not hold back.",
  "author": "Sherin Shibu",
  "published": "Mon, 13 Jan 2025 19:33:00 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Sherin Shibu",
  "length": 2556,
  "excerpt": "JPMorgan Chase employees spoke out against the bank's new return-to-office mandate on an internal company website. Soon after, JPMorgan disabled comments.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "JPMorgan Chase informed its 300,000 employees on Friday that it is implementing a strict return-to-office policy and almost all workers are required to work in the office five days a week beginning in March, according to an internal memo seen by Barron's.\"We feel that now is the right time to solidify our full-time in-office approach,\" the memo reads. \"We think it is the best way to run the company.\" The only exceptions to the mandate are teams with work that \"can be easily and clearly measured.\"According to Bloomberg, more than half of JPMorgan staff, or about 60%, are already working in the office five days per week. These employees are managing directors, bank branch workers, and salespeople, among other senior or client-facing roles. The shift from hybrid to fully in-person work will most likely affect back-office roles, like call center workers, the outlet noted. The bank posted the news to an internal company website, and the return-to-office mandate was met with pushback by employees.JPMorgan CEO Jamie Dimon. Photographer: Kent Nishimura/Bloomberg via Getty ImagesRelated: 'Five Is Ideal': JPMorgan Will Reportedly Follow Amazon, Walmart With Strict Return-to-Office PolicyEmployees could leave comments attached to the news with their first and last names on display — and they did, with more than 300 sharing worries about the return-to-office mandate's effects on their commute, childcare costs, and work-life balance.According to people familiar with the matter who spoke with the WSJ, one person even brought up unionizing to keep the hybrid schedule.This reportedly led JPMorgan to shut down comments on Saturday, though parts are still available for employees to see, per the WSJ.Related: JPMorgan Chase CEO Jamie Dimon Isn't Worried About AI Taking Over Jobs — Here's WhyJPMorgan CEO Jamie Dimon told the Wall Street Journal in April that he prefers people work in the office five days per week, though in some cases, \"taking a day or two at home is fine.\"JPMorgan is the largest bank in the U.S. with $3.9 trillion in assets. In implementing a fully in-person schedule, JPMorgan follows the example of companies like Amazon and Walmart, both of which have received pushback from employees.Some Walmart employees opted to quit instead of comply and 73% of Amazon corporate employees stated in September that they were looking for a new job, shortly after Amazon announced the return-to-office mandate.Related: JPMorgan Chase CEO Jamie Dimon Says Bankers Are 'Dancing in the Street' Following Donald Trump's Win",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1736789322-Jamie-Dimon-GettyImages-2179872090.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003eJPMorgan Chase informed its 300,000 employees on Friday that it is implementing a \u003ca href=\"https://www.entrepreneur.com/business-news/jpmorgan-to-implement-a-five-day-return-to-office-mandate/485281\" rel=\"follow\" target=\"_self\"\u003estrict return-to-office policy\u003c/a\u003e and almost all workers are required to work in the office five days a week beginning in March, according to an internal memo seen by \u003ca href=\"https://www.barrons.com/articles/jpmorgan-chase-back-to-office-employees-72121f66\" rel=\"follow\" target=\"_self\"\u003eBarron\u0026#39;s\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u0026#34;We feel that now is the right time to solidify our full-time in-office approach,\u0026#34; the memo reads. \u0026#34;We think it is the best way to run the company.\u0026#34; The only exceptions to the mandate are teams with work that \u0026#34;can be easily and clearly measured.\u0026#34;\u003c/p\u003e\u003cp\u003eAccording to \u003ca href=\"https://www.bloomberg.com/news/articles/2025-01-07/jpmorgan-planning-to-bring-staff-back-to-office-five-days-a-week\" rel=\"follow\" target=\"_self\"\u003eBloomberg\u003c/a\u003e, more than half of JPMorgan staff, or about 60%, are already working in the office five days per week. These employees are managing directors, bank branch workers, and salespeople, among other senior or client-facing roles. The shift from hybrid to fully in-person work will most likely affect back-office roles, like call center workers, the outlet noted.\u003c/p\u003e\n  \n  \n  \n\n  \u003cp\u003eThe bank posted the news to an internal company website, and the return-to-office mandate was met with pushback by employees.\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" role=\"presentation\" src=\"https://assets.entrepreneur.com/images/misc/1736789341_Jamie-Dimon-GettyImages-2179872090.jpg?width=1000\" width=\"1000\" height=\"667\"/\u003e\u003c/p\u003e\u003cp\u003e\u003csup\u003e\u003ci\u003eJPMorgan CEO Jamie Dimon. Photographer: Kent Nishimura/Bloomberg via Getty Images\u003c/i\u003e\u003c/sup\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/business-news/jpmorgan-to-implement-a-five-day-return-to-office-mandate/485281\" rel=\"follow\" target=\"_self\"\u003e\u0026#39;Five Is Ideal\u0026#39;: JPMorgan Will Reportedly Follow Amazon, Walmart With Strict Return-to-Office Policy\u003c/a\u003e\u003c/p\u003e\u003cp\u003eEmployees could leave comments attached to the news with their first and last names on display — and they did, with more than 300 sharing worries about the return-to-office mandate\u0026#39;s effects on their commute, childcare costs, and work-life balance.\u003c/p\u003e\u003cp\u003eAccording to people familiar with the matter who spoke with the WSJ, one person even brought up unionizing to keep the hybrid schedule.\u003c/p\u003e\u003cp\u003eThis reportedly led JPMorgan to shut down comments on Saturday, though parts are still available for employees to see, per the \u003ca href=\"https://www.wsj.com/business/jpmorgan-chase-disables-employee-comments-after-return-to-office-backlash-19199a4a?mod=business_lead_story\" rel=\"follow\" target=\"_self\"\u003eWSJ\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated:\u003c/b\u003e \u003ca href=\"https://www.entrepreneur.com/business-news/jpmorgan-chase-ceo-jamie-dimon-ai-will-take-over-some-jobs/481027\" rel=\"follow\" target=\"_self\"\u003eJPMorgan Chase CEO Jamie Dimon Isn\u0026#39;t Worried About AI Taking Over Jobs — Here\u0026#39;s Why\u003c/a\u003e\u003c/p\u003e\u003cp\u003eJPMorgan CEO Jamie Dimon \u003ca href=\"https://www.wsj.com/podcasts/the-journal/jp-morgan-ceo-jamie-dimon-on-what-next-for-the-economy/88c92388-fbb0-4194-bc05-13cceea3e64b\" rel=\"follow\" target=\"_self\"\u003etold the Wall Street Journal\u003c/a\u003e in April that he prefers people work in the office five days per week, though in some cases, \u0026#34;taking a day or two at home is fine.\u0026#34;\u003c/p\u003e\u003cp\u003eJPMorgan is the largest bank in the U.S. with \u003ca href=\"https://www.jpmorgan.com/about-us\" rel=\"follow\" target=\"_self\"\u003e$3.9 trillion in assets\u003c/a\u003e.\u003c/p\u003e\n\n  \u003cp\u003eIn implementing a fully in-person schedule, JPMorgan follows the example of companies like \u003ca href=\"https://www.entrepreneur.com/business-news/amazon-ceo-this-is-why-employees-must-work-in-office-rto/482473\" rel=\"follow\" target=\"_self\"\u003eAmazon\u003c/a\u003e and \u003ca href=\"https://www.entrepreneur.com/business-news/sams-club-cto-quits-over-walmarts-return-to-office-mandate/481704\" rel=\"follow\" target=\"_self\"\u003eWalmart\u003c/a\u003e, both of which have received pushback from employees.\u003c/p\u003e\u003cp\u003eSome Walmart employees \u003ca href=\"https://www.entrepreneur.com/business-news/walmart-employees-push-back-against-return-to-office-mandate/477986\" rel=\"follow\" target=\"_self\"\u003eopted to quit\u003c/a\u003e instead of comply and \u003ca href=\"https://www.entrepreneur.com/business-news/corporate-amazon-employees-fuming-online-over-rto-mandate/480432\" rel=\"follow\" target=\"_self\"\u003e73% of Amazon corporate employees\u003c/a\u003e stated in September that they were looking for a new job, shortly after Amazon announced the return-to-office mandate.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated:\u003c/b\u003e \u003ca href=\"https://www.entrepreneur.com/business-news/jamie-dimon-bankers-dancing-in-the-street-after-trump-win/482985\" rel=\"follow\" target=\"_self\"\u003eJPMorgan Chase CEO Jamie Dimon Says Bankers Are \u0026#39;Dancing in the Street\u0026#39; Following Donald Trump\u0026#39;s Win\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-13T19:33:00Z",
  "modifiedTime": "2025-01-13T19:33:00Z"
}
