{
  "id": "a7a3c38a-ddf9-4299-b0f3-ae0e6f526a8c",
  "title": "US asked to kick UK out of Five Eyes",
  "link": "https://www.computerweekly.com/news/366619170/UK-accused-of-political-foreign-cyberattack-on-US-after-serving-secret-snooping-order-on-Apple",
  "description": "Article URL: https://www.computerweekly.com/news/366619170/UK-accused-of-political-foreign-cyberattack-on-US-after-serving-secret-snooping-order-on-Apple Comments URL: https://news.ycombinator.com/item?id=43166670 Points: 9 # Comments: 3",
  "author": "dmitrygr",
  "published": "Tue, 25 Feb 2025 00:31:29 +0000",
  "source": "https://hnrss.org/frontpage",
  "categories": null,
  "byline": "Duncan Campbell",
  "length": 6065,
  "excerpt": "US administration asked to kick UK out of 65-year-old UK-US Five Eyes intelligence sharing agreement after secret order to access encrypted data of Apple users",
  "siteName": "ComputerWeekly.com",
  "favicon": "https://www.computerweekly.com/apple-touch-icon-144x144.png",
  "text": "hanohiki - stock.adobe.com US administration asked to kick UK out of 65-year-old UK-US Five Eyes intelligence sharing agreement after secret order to access encrypted data of Apple users By Duncan Campbell , Published: 13 Feb 2025 17:54 An unprecedented letter from the US Congress, released today, accuses the UK of “a foreign cyber attack waged through political means”. The claim refers to a Home Office secret demand last month (reported by Computer Weekly here, here and here) that Apple break the security protecting its Advanced Data Protection cloud security system to let British spies into anyone’s secure files. In a letter to the recently appointed US Director of National Intelligence (DNI) Tulsi Gabbard, senator Ron Wyden of Colorada and representative Andy Biggs of Arizona bluntly ask the administration to kick the UK out of the 65-year-old UK-USA signals intelligence sharing agreement, commonly known as Five Eyes, if they do not now withdraw the demand to Apple. ”If the UK does not immediately reverse this dangerous effort, we urge you to reevaluate US-UK cyber security arrangements and programmes as well as US intelligence sharing with the UK,” the new DNI was advised.  Politically, on other issues, the signatories are on opposite sides of US politics. Wyden is a liberal democrat who has campaigned for healthcare and the environment; Biggs is a loud Trump supporter and a noted organiser of the “MAGA squad”.  Wyden, from Oregon, serves on the Senate Intelligence and Finance Committee; Biggs, from Arizona, chairs the House Judiciary Subcommittee on Crime and Federal Government Surveillance.   Their unified complaint against British tactics and conduct is potentially a unique event in the turbulent political period since Donald Trump’s accession.   Damage to information sharing with US The letter was also copied to incoming British ambassador Peter Mandelson. The British Embassy, Home Office and DNI have not made any official comment on the letter at the time of writing. The representatives have asked the DNI to tell US Congress whether the administration accepts British claims that it can impose “gag orders” on demands to American companies to provide user data, or to make technical changes to their systems and software. They also demand to know if the Home Office warned the US government about the January notice before it was revealed in the press.   The British move against Apple also threatens to prejudice recent valuable gains in co-operative information sharing. It took four years for the US and Britain to agree a Data Access Agreement in 2022 that does allow Apple to provide data and files from UK iCloud Accounts, provided that the user has not turned on advanced security.   This arrangement was authorised under the Cloud (Clarifying Lawful Overseas Use of Data) Act and was, according to the Department of Justice (DoJ), “the first agreement of its kind, allowing each country’s investigators to gain better access to vital data to combat serious crime in a way that is consistent with privacy and civil liberties standards”. The data flows both aways, allowing US agents automatic access to British-controlled data. “Under the Data Access Agreement, service providers in one country may respond to qualifying, lawful orders for electronic data issued by the other country, without fear of running afoul of restrictions on cross-border disclosures,” the DoJ noted. Home Office ‘greedy for everything’ According to UK academic and industry sources, the recent better level of access to some iCloud data may have caused the Home Office to get “impatient and greedy for everything”, and to proceed without legally required technical caution.   According to reliable industry sources, the recent notice was not first scrutinised by the statutory Technical Advisory Panel (TAP), which includes vetted external cryptosecurity and computer science experts. If this is correct, then both the home secretary and the UK “judicial commissioner” who authorised the Notice to Apple may have been misled, requiring the procedure for issuing the notice to be reviewed. The representatives reminded DNI Gabbard that she stated at her confirmation hearing that “backdoors lead down a dangerous path that can undermine Americans’ Fourth Amendment rights and civil liberties,” warning later that compulsory “mechanisms to bypass encryption or privacy technologies undermines user security, privacy and trust, and poses significant risks of exploitation by malicious actors”. “We urge you to put those words into action by giving the UK an ultimatum,” their letter concludes. “Back down from this dangerous attack on US cyber security or face serious consequences.”  Beijing could exploit UK ‘backdoor’ American cryptographers and cryptosecurity experts back the demand and have warned that “Beijing would quickly exploit the British order to allow access to encrypted data”. “The US should pass laws that forbid US companies from installing encryption backdoors at the request of foreign countries,” said Matt Green, a leading cryptographer and professor of computer science at John Hopkins University.  “This would put companies like Apple in a bind. But it would be a good bind.” Read more on Privacy and data protection Top cryptography experts join calls for UK to drop plans to snoop on Apple’s encrypted data By: Bill Goodwin Apple: British techies to advise on ‘devastating’ UK global crypto power grab By: Duncan Campbell Tech companies brace after UK demands back door access to Apple cloud By: Bill Goodwin What are the options when migrating from VMware? By: Cliff Saran",
  "image": "https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-1-adobe.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-1-adobe_searchsitetablet_520X173.jpg\" data-credit=\"hanohiki - stock.adobe.com\" srcset=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-1-adobe_searchsitetablet_520X173.jpg 960w,https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-1-adobe.jpg 1280w\" width=\"520\" height=\"173\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003ehanohiki - stock.adobe.com\u003c/p\u003e\n\t\t\t\t\t\t\t\u003c/div\u003e\u003cdiv id=\"content-header\"\u003e\n\t\n\t\n\n\n\n\n\n\n\t\n\n\t\u003ch2\u003eUS administration asked to kick UK out of 65-year-old UK-US Five Eyes intelligence sharing agreement after secret order to access encrypted data of Apple users\u003c/h2\u003e\n\u003c/div\u003e\u003cdiv id=\"content-center\"\u003e\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cul\u003e\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\n\t\n\t\t\u003cli\u003e\u003ci data-icon=\"1\"\u003e\u003c/i\u003e\u003c/li\u003e\n\t\n\t\n\t\t\u003cli\u003e\u003ci data-icon=\"2\"\u003e\u003c/i\u003e\u003c/li\u003e\n\t\n\t\n\t\t\n\t\n\u003c/ul\u003e\u003cdiv id=\"contributors-block\"\u003e\n\u003cp\u003e\u003cimg src=\"https://cdn.ttgtmedia.com/rms/computerweekly/Duncan-Campbell-2015-140x180px.jpg\" alt=\"Duncan Campbell \"/\u003e\n\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003e\u003cspan\u003eBy\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\n\t\t\u003cli\u003e\n\t\t\t\t\t\u003ca href=\"https://www.techtarget.com/contributor/Duncan-Campbell\"\u003eDuncan Campbell ,\u003c/a\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\u003c/li\u003e \n\t\t\u003c/ul\u003e\n\t\t\u003cp\u003e\n\tPublished: \u003cspan\u003e13 Feb 2025 17:54\u003c/span\u003e\n\u003c/p\u003e\n\u003c/div\u003e\t\t\u003csection id=\"content-body\"\u003e\n\u003cp\u003eAn unprecedented letter from the US Congress, released today, accuses the UK of “a foreign cyber attack waged through political means”. The claim refers to a Home Office secret demand last month (reported by Computer Weekly \u003ca href=\"https://www.computerweekly.com/news/366619028/Apple-British-techies-to-advise-on-devastating-UK-global-crypto-power-grab\"\u003ehere,\u003c/a\u003e \u003ca href=\"https://www.computerweekly.com/news/366618999/Tech-companies-brace-after-UK-demands-back-door-access-to-Apple-cloud-Tech-companies-brace-for-more\"\u003ehere\u003c/a\u003e and \u003ca href=\"https://www.computerweekly.com/news/366619260/Top-cryptography-experts-join-calls-for-UK-to-drop-plans-to-snoop-on-Apples-encrypted-data\"\u003ehere\u003c/a\u003e) that Apple break the security protecting its Advanced Data Protection cloud security system to let British spies into anyone’s secure files.\u003c/p\u003e\n \n\u003cp\u003eIn a \u003ca href=\"https://biggs.house.gov/sites/evo-subsites/biggs.house.gov/files/evo-media-document/Wyden-Biggs-letter-to-DNI-re-UK-backdoors.pdf\"\u003eletter to the recently appointed US Director of National Intelligence\u003c/a\u003e (DNI) Tulsi Gabbard, senator Ron Wyden of Colorada and representative Andy Biggs of Arizona bluntly ask the administration to kick the UK out of the 65-year-old UK-USA signals intelligence sharing agreement, commonly known as Five Eyes, if they do not now withdraw the demand to Apple.\u003c/p\u003e \n\u003cp\u003e”If the UK does not immediately reverse this dangerous effort, we urge you to reevaluate US-UK cyber security arrangements and programmes as well as US intelligence sharing with the UK,” the new DNI was advised. \u003c/p\u003e \n\u003cp\u003ePolitically, on other issues, the signatories are on opposite sides of US politics. Wyden is a liberal democrat who has campaigned for healthcare and the environment; Biggs is a loud Trump supporter and a noted organiser of the “MAGA squad”.  Wyden, from Oregon, serves on the Senate Intelligence and Finance Committee; Biggs, from Arizona, chairs the House Judiciary Subcommittee on Crime and Federal Government Surveillance.  \u003c/p\u003e \n\u003cp\u003eTheir unified complaint against British tactics and conduct is potentially a unique event in the turbulent political period since Donald Trump’s accession.  \u003c/p\u003e \n\u003csection data-menu-title=\"Damage to information sharing with US\"\u003e\n \u003ch2\u003e\u003ci data-icon=\"1\"\u003e\u003c/i\u003eDamage to information sharing with US\u003c/h2\u003e\n \u003cp\u003eThe letter was also copied to incoming British ambassador Peter Mandelson. The British Embassy, Home Office and DNI have not made any official comment on the letter at the time of writing.\u003c/p\u003e\n \u003cp\u003eThe representatives have asked the DNI to tell US Congress whether the administration accepts British claims that it can impose “gag orders” on demands to American companies to provide user data, or to make technical changes to their systems and software. They also demand to know if the Home Office warned the US government about the January notice before it was revealed in the press.  \u003c/p\u003e\n \u003cp\u003eThe British move against Apple also threatens to prejudice recent valuable gains in co-operative information sharing. It took four years for the US and Britain to agree a Data Access Agreement in 2022 that does allow Apple to provide data and files from UK iCloud Accounts, provided that the user has not turned on advanced security.  \u003c/p\u003e\n \u003cp\u003eThis arrangement was authorised under the Cloud (Clarifying Lawful Overseas Use of Data) Act and was, \u003ca href=\"https://web.archive.org/web/20221010215107/https://www.justice.gov/opa/pr/landmark-us-uk-data-access-agreement-enters-force \"\u003eaccording to the Department of Justice\u003c/a\u003e (DoJ), “the first agreement of its kind, allowing each country’s investigators to gain better access to vital data to combat serious crime in a way that is consistent with privacy and civil liberties standards”.\u003c/p\u003e\n \u003cp\u003eThe data flows both aways, allowing US agents automatic access to British-controlled data. “Under the Data Access Agreement, service providers in one country may respond to qualifying, lawful orders for electronic data issued by the other country, without fear of running afoul of restrictions on cross-border disclosures,” the DoJ noted.\u003c/p\u003e\n\u003c/section\u003e      \n\u003csection data-menu-title=\"Home Office ‘greedy for everything’\"\u003e\n \u003ch2\u003e\u003ci data-icon=\"1\"\u003e\u003c/i\u003eHome Office ‘greedy for everything’\u003c/h2\u003e\n \u003cp\u003eAccording to UK academic and industry sources, the recent better level of access to some iCloud data may have caused the Home Office to get “impatient and greedy for everything”, and to proceed without legally required technical caution.  \u003c/p\u003e\n \u003cp\u003eAccording to reliable industry sources, the recent notice was not first scrutinised by the statutory Technical Advisory Panel (TAP), which includes vetted external cryptosecurity and computer science experts. If this is correct, then both the home secretary and the UK “judicial commissioner” who authorised the Notice to Apple may have been misled, requiring the procedure for issuing the notice to be reviewed.\u003c/p\u003e\n \u003cp\u003eThe representatives reminded DNI Gabbard that she stated at her confirmation hearing that “backdoors lead down a dangerous path that can undermine Americans’ Fourth Amendment rights and civil liberties,” warning later that compulsory “mechanisms to bypass encryption or privacy technologies undermines user security, privacy and trust, and poses significant risks of exploitation by malicious actors”.\u003c/p\u003e\n \u003cp\u003e“We urge you to put those words into action by giving the UK an ultimatum,” their letter concludes. “Back down from this dangerous attack on US cyber security or face serious consequences.” \u003c/p\u003e\n\u003c/section\u003e     \n\u003csection data-menu-title=\"Beijing could exploit UK ‘backdoor’\"\u003e\n \u003ch2\u003e\u003ci data-icon=\"1\"\u003e\u003c/i\u003eBeijing could exploit UK ‘backdoor’\u003c/h2\u003e\n \u003cp\u003eAmerican cryptographers and cryptosecurity experts back the demand and have warned that “Beijing would quickly exploit the British order to allow access to encrypted data”.\u003c/p\u003e\n \u003cp\u003e“The US should pass laws that forbid US companies from installing encryption backdoors at the request of foreign countries,” said \u003ca href=\"%20https://blog.cryptographyengineering.com/2025/02/12/u-k-asks-to-backdoor-icloud-backup-encryption/\"\u003eMatt Green\u003c/a\u003e, a leading cryptographer and professor of computer science at John Hopkins University.  “This would put companies like Apple in a bind. But it would be a good bind.”\u003c/p\u003e\n \n\u003c/section\u003e\u003c/section\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003csection id=\"DigDeeperSplash\"\u003e\n\t\t\u003ch4\u003e\n\t\t\t\u003ci data-icon=\"m\"\u003e\u003c/i\u003eRead more on Privacy and data protection\u003c/h4\u003e\n\t\t\u003cul\u003e\n\t\t\t\u003cli\u003e\u003ca id=\"DigDeeperItem-1\" href=\"https://www.computerweekly.com/news/366619260/Top-cryptography-experts-join-calls-for-UK-to-drop-plans-to-snoop-on-Apples-encrypted-data\"\u003e\n\t\t\t\t\t\u003cimg data-src=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-2-adobe_searchsitetablet_520X173.jpg\" data-srcset=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-2-adobe_searchsitetablet_520X173.jpg 960w,https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-2-adobe.jpg 1280w\" alt=\"\" src=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-2-adobe_searchsitetablet_520X173.jpg\" srcset=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-2-adobe_searchsitetablet_520X173.jpg 960w,https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-2-adobe.jpg 1280w\"/\u003e\n\t\t\t\t\t\u003ch5\u003eTop cryptography experts join calls for UK to drop plans to snoop on Apple’s encrypted data\u003c/h5\u003e\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://www.computerweekly.com/rms/computerweekly/Bill-Goodwin-CW-contributor-2022-140x180px.jpg\" alt=\"BillGoodwin\"/\u003e\n\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cspan\u003eBy: \u003cspan\u003eBill Goodwin\u003c/span\u003e\u003c/span\u003e\n\t\t\t\t\t\t\t\u003c/p\u003e\u003c/div\u003e\n\t\t\t\t\u003c/a\u003e\u003c/li\u003e\n\t\t\t\u003cli\u003e\u003ca id=\"DigDeeperItem-2\" href=\"https://www.computerweekly.com/news/366619028/Apple-British-techies-to-advise-on-devastating-UK-global-crypto-power-grab\"\u003e\n\t\t\t\t\t\u003cimg data-src=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-1-adobe_searchsitetablet_520X173.jpg\" data-srcset=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-1-adobe_searchsitetablet_520X173.jpg 960w,https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-1-adobe.jpg 1280w\" alt=\"\" src=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-1-adobe_searchsitetablet_520X173.jpg\" srcset=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-1-adobe_searchsitetablet_520X173.jpg 960w,https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/Apple-Store-Hong-Kong-hanohiki-1-adobe.jpg 1280w\"/\u003e\n\t\t\t\t\t\u003ch5\u003eApple: British techies to advise on ‘devastating’ UK global crypto power grab\u003c/h5\u003e\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://www.computerweekly.com/rms/computerweekly/Duncan-Campbell-2015-140x180px.jpg\" alt=\"DuncanCampbell \"/\u003e\n\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cspan\u003eBy: \u003cspan\u003eDuncan Campbell \u003c/span\u003e\u003c/span\u003e\n\t\t\t\t\t\t\t\u003c/p\u003e\u003c/div\u003e\n\t\t\t\t\u003c/a\u003e\u003c/li\u003e\n\t\t\t\u003cli\u003e\u003ca id=\"DigDeeperItem-3\" href=\"https://www.computerweekly.com/news/366618999/Tech-companies-brace-after-UK-demands-back-door-access-to-Apple-cloud-Tech-companies-brace-for-more\"\u003e\n\t\t\t\t\t\u003cimg data-src=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/privacy-encryption-security-Rabbit1990-adobe_searchsitetablet_520X173.jpg\" data-srcset=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/privacy-encryption-security-Rabbit1990-adobe_searchsitetablet_520X173.jpg 960w,https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/privacy-encryption-security-Rabbit1990-adobe.jpg 1280w\" alt=\"\" src=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/privacy-encryption-security-Rabbit1990-adobe_searchsitetablet_520X173.jpg\" srcset=\"https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/privacy-encryption-security-Rabbit1990-adobe_searchsitetablet_520X173.jpg 960w,https://www.computerweekly.com/visuals/ComputerWeekly/HeroImages/privacy-encryption-security-Rabbit1990-adobe.jpg 1280w\"/\u003e\n\t\t\t\t\t\u003ch5\u003eTech companies brace after UK demands back door access to Apple cloud\u003c/h5\u003e\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://www.computerweekly.com/rms/computerweekly/Bill-Goodwin-CW-contributor-2022-140x180px.jpg\" alt=\"BillGoodwin\"/\u003e\n\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cspan\u003eBy: \u003cspan\u003eBill Goodwin\u003c/span\u003e\u003c/span\u003e\n\t\t\t\t\t\t\t\u003c/p\u003e\u003c/div\u003e\n\t\t\t\t\u003c/a\u003e\u003c/li\u003e\n\t\t\t\u003cli\u003e\u003ca id=\"DigDeeperItem-4\" href=\"https://www.computerweekly.com/news/366599700/What-are-the-options-when-migrating-from-VMware\"\u003e\n\t\t\t\t\t\u003cimg data-src=\"https://www.computerweekly.com/visuals/German/article/cloud-migration-2-adobe_searchsitetablet_520X173.jpg\" data-srcset=\"https://www.computerweekly.com/visuals/German/article/cloud-migration-2-adobe_searchsitetablet_520X173.jpg 960w,https://www.computerweekly.com/visuals/German/article/cloud-migration-2-adobe.jpg 1280w\" alt=\"\" src=\"https://www.computerweekly.com/visuals/German/article/cloud-migration-2-adobe_searchsitetablet_520X173.jpg\" srcset=\"https://www.computerweekly.com/visuals/German/article/cloud-migration-2-adobe_searchsitetablet_520X173.jpg 960w,https://www.computerweekly.com/visuals/German/article/cloud-migration-2-adobe.jpg 1280w\"/\u003e\n\t\t\t\t\t\u003ch5\u003eWhat are the options when migrating from VMware?\u003c/h5\u003e\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://www.computerweekly.com/rms/computerweekly/Cliff-Saran-Sep-2022-140x180px.jpg\" alt=\"CliffSaran\"/\u003e\n\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cspan\u003eBy: \u003cspan\u003eCliff Saran\u003c/span\u003e\u003c/span\u003e\n\t\t\t\t\t\t\t\u003c/p\u003e\u003c/div\u003e\n\t\t\t\t\u003c/a\u003e\u003c/li\u003e\n\t\t\t\u003c/ul\u003e\n\t\u003c/section\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-02-13T12:54:00Z",
  "modifiedTime": null
}
