{
  "id": "ab5ee3c0-a61f-41a9-888f-b1c15d6ac3b3",
  "title": "Business Owners Brace Themselves For Trump’s Tariffs",
  "link": "https://www.inc.com/melissa-angell/business-owners-brace-themselves-for-trumps-tariffs/91018140",
  "description": "It’s all but certain that tariffs will soar with Donald Trump’s return to office. Many companies are struggling with the calculus that uniform tariffs of up to 20 percent may bring.",
  "author": "Melissa Angell",
  "published": "Tue, 12 Nov 2024 17:56:09 -0500",
  "source": "https://www.inc.com/rss/",
  "categories": [
    "Lead"
  ],
  "byline": "Melissa Angell",
  "length": 5907,
  "excerpt": "It's all but certain that tariffs will soar with Donald Trump's return to office. Many companies are struggling with the calculus that uniform tariffs of up to 20 percent may bring.",
  "siteName": "Inc",
  "favicon": "https://www.inc.com/_public/icons/apple-icon.png",
  "text": "Global trade could get reshuffled if President-elect Donald Trump’s tariff proposals are enacted, with business owners and consumers likely to foot the bill.Trump has called tariffs “the most beautiful word” in the dictionary and has proposed to hike tariffs across all imports in the realm of 10 to 20 percent, plus a 60 percent tariff increase on Chinese goods. His logic is that raising tariffs will swell funding for the government, promote American innovation and prompt more companies manufacture domestically. But that logic is faulty according to conventional economic thinking. If anything, it’s a sure way to egg on inflation, says Maurice Obstfeld, a senior fellow at the Peterson Institute for International Economics, a nonpartisan research organization based in Washington, D.C.  While the good news is that countries will still continue to trade with the U.S., trade volumes will likely diminish.“I think there’s no question that these tariffs will be inflationary, even though the Trump team and their allies deny it,” says Obstfeld, who was previously the chief economist at the International Monetary Fund. “The whole point of tariffs is to reduce trade, it’s to shift demand from imports to domestic goods.” About half of industrialized goods (like machinery and raw materials) are imported duty free, according to the Office of the U.S. Trade Representative, while the average import tariff on industrial goods is two percent.Raising tariffs to the 20 percent benchmark, or higher in China’s case, will force business owners to confront their own pricing calculus. You can’t pass that much of a price increase to your customers, says Brooks Running Co. CEO Dan Sheridan. (Brooks, which sources in Vietnam, currently pays 20 percent.) Which suggests that business owners either have to absorb part of the tariff themselves, or, reconfigure their supply chains to avoid the increase. Both are costly endeavors. “That’s a profitability challenge for us, which then puts you into modeling out what you would pull back on to keep profitability up,” Sheridan says. “And that’s a really hard puzzle for Brooks. But I think for all of our competitors, because the majority of performance running shoes are built and manufactured in Southeast Asia.”By the Peterson Institute’s estimates, Trump’s tariff proposals may cost households about $2,600 per year on average, though Kamala Harris’s campaign claimed that the costs could be much higher, at $4,000 a year per household. The Tax Foundation has a more conservative estimate, predicting that a 10 percent tariff could cost households $1,253 per year, while a 20 percent tariff would run that cost up to $2,045.The impact is already shaking up supply chains. Last week, shoe maker Steve Madden exited China to avoid any Trump tariff, which could very well start a domino effect for other companies currently exploring their options. But if there’s a mass exodus, China could very well retaliate as it’s done so in the past, which would be to the detriment of U.S. businesses that have large footprints there, like Tesla and General Motors. Some believe that U.S. agricultural products could be the most severely affected, such as soybeans and corn exports—as has happened in the past.Other U.S. trade partners may increase their own duties to help pad losses, with European countries looking to ink new trade agreements with Canada or Mexico instead. CNBC reports that trade between Mexico and China increased by 26.2 percent during the first seven months of this year. Moving goods or parts through Mexico allows companies to sidestep any tariffs on Chinese products. If larger, more-established companies are sweating, just imagine the situation for startups. Take the case of the Los Angeles-based Hydrology Zodiac Water, which launched last month and just created its first batch of product. Hydrology sells flavored sparkling water catering to each zodiac sign, and was formulated by the same developer that’s worked with Poppi Soda and Lemon Perfect.“As a small business, we rely on a network of different suppliers since we can’t do it all under one roof,” says Hydrology CEO and co-founder Nick Geleta. Though most of Hydrology’s partners and suppliers are U.S.-based, some of its ingredients and materials are imported. Which means that companies like Hydrology face higher costs.Larger, more established companies have more flexibility in their sourcing. Doing so would be really tough for a brand new business, Geleta says, since it can take a month, if not longer, to establish new connections within the supply chain.“Even with a single cent increase on aluminum, the costs add up very quickly when you’re making tens of thousands, or hundreds of thousands of cans,” he adds. The silver lining here might be that the pandemic prompted many companies to diversify supply chains. Nanit, which sells a smart baby monitoring device, began relocating most of its production from China after supply chains became severely crunched in 2021. It now has facilities in Vietnam and Malaysia, and Nanit CEO Anushka Salinas says that she feels more reassured having already moved her operations out of China.Still, the company is keeping tabs on the tariff proposals to see how their facilities in Asia will be affected. One thing is certain, she says: moving production so that all products are made domestically isn’t in the cards.But it is in the cards for Laurel Orley, the co-founder and CEO of Daily Crunch Snacks, which sells sprouted almonds. Orley’s almond farm is in California and the company mostly sources and produces its sprouted nut snacks in the U.S.“This gives us a competitive edge by allowing tighter control over production quality and reducing supply chain risks,” Orley says. “I’m hoping that if anything, this gives us an edge against our competitors who produce and source the majority of ingredients outside the U.S.”",
  "image": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit/vip/2024/11/small-businesses-prep-for-tariffs-inc-GettyImages-1317622513.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eGlobal trade \u003ca href=\"https://www.inc.com/reuters/trumps-tariff-plan-would-upend-trade-flows-raise-costs-draw-retaliation/90998866\"\u003ecould get reshuffled\u003c/a\u003e if President-elect Donald Trump’s\u003ca href=\"https://www.inc.com/melissa-angell/from-golf-to-economy-everything-entrepreneurs-missed-at-biden-trump-debate.html\"\u003e tariff proposals\u003c/a\u003e are enacted, with business owners and consumers likely to foot the bill.\u003c/p\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eTrump has called tariffs “the most beautiful word” in the dictionary and has proposed to hike tariffs across all imports in the realm of 10 to 20 percent, plus a 60 percent tariff increase on Chinese goods. \u003c/p\u003e\u003cp\u003eHis logic is that raising tariffs will swell funding for the government, promote American innovation and prompt more companies manufacture domestically. \u003c/p\u003e\u003cp\u003eBut that logic is faulty according to conventional economic thinking. If anything, it’s a sure way to egg on inflation, says Maurice Obstfeld, a senior fellow at the Peterson Institute for International Economics, a nonpartisan research organization based in Washington, D.C.  While the good news is that countries will still continue to trade with the U.S., trade volumes will likely diminish.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003csvg width=\"28\" height=\"20\" aria-label=\"Video player icon\"\u003e\u003cuse href=\"/_public/sprite.svg?v=8#video-player\"\u003e\u003c/use\u003e\u003c/svg\u003e\u003cp\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg alt=\"Collapse icon\" loading=\"lazy\" width=\"15\" height=\"15\" decoding=\"async\" data-nimg=\"1\" srcset=\"https://www.inc.com/_next/image?url=%2F_public%2Fcollapse-icon_2x.webp\u0026amp;w=16\u0026amp;q=75 1x, https://www.inc.com/_next/image?url=%2F_public%2Fcollapse-icon_2x.webp\u0026amp;w=32\u0026amp;q=75 2x\" src=\"https://www.inc.com/_next/image?url=%2F_public%2Fcollapse-icon_2x.webp\u0026amp;w=32\u0026amp;q=75\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003e“I think there’s no question that these tariffs will be inflationary, even though the Trump team and their allies deny it,” says Obstfeld, who was previously the chief economist at the International Monetary Fund. “The whole point of tariffs is to reduce trade, it’s to shift demand from imports to domestic goods.” \u003c/p\u003e\u003cp\u003eAbout half of industrialized goods (like machinery and raw materials) are imported duty free, according to the Office of the U.S. Trade Representative, while the average import tariff on industrial goods is two percent.\u003c/p\u003e\u003cp\u003eRaising tariffs to the 20 percent benchmark, or higher in China’s case, will force business owners to confront their own pricing calculus. You can’t pass\u003cem\u003e that \u003c/em\u003emuch of a price increase to your customers, says Brooks Running Co. CEO Dan Sheridan. (Brooks, which sources in Vietnam, currently pays 20 percent.) Which suggests that business owners either have to absorb part of the tariff themselves, or, reconfigure their supply chains to avoid the increase. Both are costly endeavors. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003e“That’s a profitability challenge for us, which then puts you into modeling out what you would pull back on to keep profitability up,” Sheridan says. “And that’s a really hard puzzle for Brooks. But I think for all of our competitors, because the majority of performance running shoes are built and manufactured in Southeast Asia.”\u003c/p\u003e\u003cp\u003eBy the Peterson Institute’s estimates, Trump’s tariff proposals may cost households about $2,600 per year on average, though Kamala Harris’s campaign claimed that the costs could be much higher, at $4,000 a year per household. The Tax Foundation has a more conservative estimate, predicting that a 10 percent tariff could cost households $1,253 per year, while a 20 percent tariff would run that cost up to $2,045.\u003c/p\u003e\u003cp\u003eThe impact is already shaking up supply chains. Last week, shoe maker Steve Madden exited China to avoid any Trump tariff, which could very well start a domino effect for other companies currently exploring their options. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eBut if there’s a mass exodus, China could very well retaliate as it’s done so in the past, which would be to the detriment of U.S. businesses that have large footprints there, like Tesla and General Motors. Some believe that U.S. agricultural products could be the most severely affected, such as soybeans and corn exports—as has happened in the past.\u003c/p\u003e\u003cp\u003eOther U.S. trade partners may increase their own duties to help pad losses, with European countries looking to ink new trade agreements with Canada or Mexico instead. \u003ca href=\"https://www.cnbc.com/2024/09/20/china-mexico-backdoor-trade-booms-in-trump-biden-tariff-era.html\"\u003eCNBC reports\u003c/a\u003e that trade between Mexico and China increased by 26.2 percent during the first seven months of this year. Moving goods or parts through Mexico allows companies to sidestep any tariffs on Chinese products. \u003c/p\u003e\u003cp\u003eIf larger, more-established companies are sweating, just imagine the situation for  startups. Take the case of the Los Angeles-based Hydrology Zodiac Water, which launched last month and just created its first batch of product. Hydrology sells flavored sparkling water catering to each zodiac sign, and was formulated by the same developer that’s worked with Poppi Soda and Lemon Perfect.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003e“As a small business, we rely on a network of different suppliers since we can’t do it all under one roof,” says Hydrology CEO and co-founder Nick Geleta. Though most of Hydrology’s partners and suppliers are U.S.-based, some of its ingredients and materials are imported. Which means that companies like Hydrology face higher costs.\u003c/p\u003e\u003cp\u003eLarger, more established companies have more flexibility in their sourcing. Doing so would be really tough for a brand new business, Geleta says, since it can take a month, if not longer, to establish new connections within the supply chain.\u003c/p\u003e\u003cp\u003e“Even with a single cent increase on aluminum, the costs add up very quickly when you’re making tens of thousands, or hundreds of thousands of cans,” he adds. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eThe silver lining here might be that the pandemic prompted many companies to \u003ca href=\"https://www.inc.com/melissa-angell/biden-cracks-down-on-price-gouging-during-first-supply-chain-council-meeting.html\"\u003ediversify supply chains. \u003c/a\u003eNanit, which sells a smart baby monitoring device, began relocating most of its production from China after supply chains became severely crunched in 2021. It now has facilities in Vietnam and Malaysia, and Nanit CEO Anushka Salinas says that she feels more reassured having already moved her operations out of China.\u003c/p\u003e\u003cp\u003eStill, the company is keeping tabs on the tariff proposals to see how their facilities in Asia will be affected. One thing is certain, she says: moving production so that all products are made domestically isn’t in the cards.\u003c/p\u003e\u003cp\u003eBut it is in the cards for Laurel Orley, the co-founder and CEO of Daily Crunch Snacks, which sells sprouted almonds. Orley’s almond farm is in California and the company mostly sources and produces its sprouted nut snacks in the U.S.“This gives us a competitive edge by allowing tighter control over production quality and reducing supply chain risks,” Orley says. “I’m hoping that if anything, this gives us an edge against our competitors who produce and source the majority of ingredients outside the U.S.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-11-12T22:56:09Z",
  "modifiedTime": null
}
