{
  "id": "b7e05b6f-12dd-4768-8016-e2636953be27",
  "title": "Meta Informs Staff that Layoffs Will Begin Monday Morning in a Now-Leaked Internal Memo",
  "link": "https://www.entrepreneur.com/business-news/meta-tells-staff-exactly-when-they-will-be-laid-off-memo/486811",
  "description": "Have a good weekend, Meta employees!",
  "author": "Sherin Shibu",
  "published": "Fri, 07 Feb 2025 22:24:00 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Sherin Shibu",
  "length": 2657,
  "excerpt": "Meta informed U.S. staff in a leaked memo that they would find out if they were laid off on Monday at 5 a.m. PT. Meta plans to lay off over 3,000 workers.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "Meta sent employees an internal memo on Friday outlining what to expect as the tech giant implements its latest round of layoffs affecting 5% of its 72,000-person workforce, around 3,000 employees.A memo obtained by Business Insider and posted to Meta's internal Workplace forum by Vice President of Human Resources Janelle Gale said that employees affected by the performance-based cuts will be notified Monday morning through an email sent to their work and personal email addresses. The times are scheduled for different time zones beginning Sunday at 1 p.m. PT with some international employees not hearing the news until Feb 18.Related: Meta Reminds Staff of Its Strict No-Leaks Policy — That Has Since Been Leaked to the Press U.S.-based employees will receive a notification on Monday at 5 a.m. PT. Within an hour of receiving the email, affected employees will be kicked off of company systems. The email will inform them of their termination and contain details about their severance package.\"For teams that have a teammate or manager exit on Monday, I understand this might be a difficult day, and there could be some disruption and short-term impacts on your day-to-day work,\" Gale wrote in the memo. She also added that Meta's offices would be open on Monday, but anyone \"whose job allows\" was allowed to work from home and have the day count as \"in-person time.\" Meta currently follows a hybrid schedule, requiring full-time employees to work from the office three days per week and two days remotely.Meta CEO Mark Zuckerberg. Photographer: David Paul Morris/Bloomberg via Getty ImagesGale included an FAQ section in the memo clarifying that Meta does not plan to tell the entire company who was laid off after notifying affected employees and intends to backfill the impacted roles on an unspecified timeline. She also wrote that if employees had a manager who had been terminated, their newly assigned manager would reach out to them.Related: 'Masculine Energy Is Good': Mark Zuckerberg Tells Joe Rogan He Thinks Companies Need More Aggression Meta CEO Mark Zuckerberg told employees about the layoffs last month, informing staff that he had \"decided to raise the bar on performance management and move out low-performers faster.\"Zuckerberg wrote that while Meta \"typically\" manages out employees who don't meet expectations over a year, Meta was going to make more \"extensive\" cuts of low performers during the performance cycle ending in February.Meta isn't the only tech giant to recently conduct layoffs. Amazon laid off dozens of employees last month and Salesforce reportedly let go of 1,000 workers earlier this year.",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1738963250-Mark-Zuckerberg0GettyImages-2170596427.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003eMeta sent employees an internal memo on Friday outlining what to expect as the tech giant implements its latest round of layoffs affecting \u003ca href=\"https://www.entrepreneur.com/business-news/meta-is-laying-off-5-of-its-workforce-read-the-memo/485540\" rel=\"follow\" target=\"_self\"\u003e5% of its 72,000-person workforce\u003c/a\u003e, around 3,000 employees.\u003c/p\u003e\u003cp\u003eA memo obtained by \u003ca href=\"https://www.businessinsider.com/internal-meta-memo-shows-how-performance-based-cuts-will-work-2025-2\" rel=\"follow\" target=\"_self\"\u003eBusiness Insider\u003c/a\u003e and posted to Meta\u0026#39;s internal Workplace forum by Vice President of Human Resources Janelle Gale said that employees affected by the performance-based cuts will be notified Monday morning through an email sent to their work and personal email addresses. The times are scheduled for different time zones beginning Sunday at 1 p.m. PT with some international employees not hearing the news until Feb 18.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated:\u003c/b\u003e \u003ca href=\"https://www.entrepreneur.com/business-news/mark-zuckerberg-warns-meta-staff-stop-leaking-to-the-press/486422\" rel=\"follow\" target=\"_self\"\u003eMeta Reminds Staff of Its Strict No-Leaks Policy — That Has Since Been Leaked to the Press\u003c/a\u003e\u003c/p\u003e\n  \n  \n  \n\n  \u003cp\u003eU.S.-based employees will receive a notification\u003cb\u003e \u003c/b\u003eon Monday at 5 a.m. PT.\u003cb\u003e \u003c/b\u003eWithin an hour of receiving the email, affected employees will be kicked off of company systems. The email will inform them of their termination and contain details about their severance package.\u003c/p\u003e\u003cp\u003e\u0026#34;For teams that have a teammate or manager exit on Monday, I understand this might be a difficult day, and there could be some disruption and short-term impacts on your day-to-day work,\u0026#34; Gale wrote in the memo.\u003c/p\u003e\n\n  \u003cp\u003eShe also added that Meta\u0026#39;s offices would be open on Monday, but anyone \u0026#34;whose job allows\u0026#34; was allowed to work from home and have the day count\u003cb\u003e \u003c/b\u003eas \u0026#34;in-person time.\u0026#34; Meta currently follows a \u003ca href=\"https://www.cnbc.com/2023/08/25/harvard-expert-new-meta-return-to-office-policy-is-a-clear-problem.html\" rel=\"follow\" target=\"_self\"\u003ehybrid schedule\u003c/a\u003e, requiring full-time employees to work from the office three days per week and two days remotely.\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" role=\"presentation\" src=\"https://assets.entrepreneur.com/images/misc/1738963593_Mark-Zuckerberg0GettyImages-2170596427.jpg?width=1000\" width=\"1000\" height=\"666\"/\u003e\u003csup\u003e\u003ci\u003eMeta CEO Mark Zuckerberg. Photographer: David Paul Morris/Bloomberg via Getty Images\u003c/i\u003e\u003c/sup\u003e\u003c/p\u003e\u003cp\u003eGale included an FAQ section in the memo clarifying that Meta does not plan to tell the entire company who was laid off after notifying affected employees and intends to backfill the impacted roles on an unspecified timeline. She also wrote that if employees had a manager who had been terminated, their newly assigned manager would reach out to them.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/business-news/mark-zuckerberg-tells-joe-rogan-that-masculinity-is-back/485481\" rel=\"follow\" target=\"_self\"\u003e\u0026#39;Masculine Energy Is Good\u0026#39;: Mark Zuckerberg Tells Joe Rogan He Thinks Companies Need More Aggression\u003c/a\u003e\u003c/p\u003e\n\n  \u003cp\u003eMeta CEO Mark Zuckerberg \u003ca href=\"https://www.bloomberg.com/news/articles/2025-01-14/meta-is-planning-to-cut-5-of-lowest-performers-memo-shows?srnd=homepage-americas\u0026amp;embedded-checkout=true\" rel=\"follow\" target=\"_self\"\u003etold employees\u003c/a\u003e about the layoffs last month, informing staff that he had \u0026#34;decided to raise the bar on performance management and move out low-performers faster.\u0026#34;\u003c/p\u003e\u003cp\u003eZuckerberg wrote that while Meta \u0026#34;typically\u0026#34; manages out employees who don\u0026#39;t meet expectations over a year, Meta was going to make more \u0026#34;extensive\u0026#34; cuts of low performers during the performance cycle ending in February.\u003c/p\u003e\u003cp\u003eMeta isn\u0026#39;t the only tech giant\u003cb\u003e \u003c/b\u003eto recently\u003cb\u003e \u003c/b\u003econduct layoffs. \u003ca href=\"https://www.entrepreneur.com/business-news/amazon-layoffs-dozens-of-corporate-employees-cut-in-january/486367\" rel=\"follow\" target=\"_self\"\u003eAmazon\u003c/a\u003e laid off dozens of employees last month and \u003ca href=\"https://www.entrepreneur.com/business-news/salesforce-is-laying-off-1000-employees-report/486566\" rel=\"follow\" target=\"_self\"\u003eSalesforce\u003c/a\u003e reportedly let go of 1,000 workers earlier this year.\u003c/p\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-07T22:24:00Z",
  "modifiedTime": "2025-02-07T22:24:00Z"
}
