{
  "id": "c51af354-a506-4cc2-98f6-df80fe7b5cfd",
  "title": "Quarter Up is Skybound’s new internal studio working on Invincible VS",
  "link": "https://venturebeat.com/games/quarter-up-is-skybounds-new-internal-studio-working-on-invincible-vs/",
  "description": "Quarter Up is a new internal studio at Skybound, which is working on Invincible VS, its new fighting game launching in 2026.",
  "author": "Rachel Kaser",
  "published": "Mon, 09 Jun 2025 21:24:07 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "GamesBeat",
    "Gaming Business",
    "Gaming Workplace",
    "Invincible VS",
    "Robert Kirkman",
    "Skybound Entertainment",
    "Skybound Games"
  ],
  "byline": "Rachel Kaser",
  "length": 3565,
  "excerpt": "Quarter Up is a new internal studio at Skybound, which is working on Invincible VS, its new fighting game launching in 2026.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "Skybound announced today that it has launched its first internal development studio, Quarter Up. The new studio is working on Invincible VS, a new fighting game set in the franchise of the same name created by Robert Kirkman, Cory Walker and Ryan Ottley. Skybound revealed the new studio today, shortly after revealing the new title, which is set for launch sometime in 2026. According to Skybound, Quarter Up is a Los Angeles-based team with around 40+ members. The team has collective experience in studios such as Activision Blizzard, Riot Games, Naughty Dog, Netflix, Amazon Games and Double Helix, among others. The name is a reference to putting quarters in arcade machines in order to keep your gameplay going. Several members of the team have previous experience working on fighting games, in particular 2013’s Killer Instinct. Mike Willette, Invincible VS executive producer, told GamesBeat in an interview, “Quarter Up is the first in-house game development studio at Skybound (second major in-house studio) dedicated to creating fighting games. We’re a hyper passionate team with extensive experience in competitive and combat-focused games. From the start, our goal and vision has always been to create experiences that make players jump out of their seats and feel heroic…feel like a badass… We’re a combat-focused studio and fighting games are where we want to leave our mark!” As for how the studio started, Willette added, “A few of our key team members were part of the Double Helix Game’ Killer Instinct development team, which was eventually purchased by Amazon. We’ve always felt like we had unfinished business in the fighting game genre and we had dreamed too long about starting our own studio – we owed it to ourselves. I approached the team at Skybound about developing an Invincible fighting game; they believed and trusted in our vision and have been huge advocates in helping bring Invincible VS to life.” Bringing the Invincible universe to bloody, violent life Skybound and Quarter Up revealed the game over the weekend during the Xbox Games Showcase for Summer Game Fest. Invincible VS is a 3v3 tag fighting game set in the Invincible universe and starring several of its familiar characters, including Mark “Invincible” Grayson, Atom Eve, Omni-Man and more. Quarter Up has not only recreated the comic book settings in the game, but also its gory, hyper-violent combat, as shown in the reveal trailer. Chris Paulson, Skybound Games EVP and general manager, told GamesBeat in an interview, “We’re huge fans of Invincible, and each of us connects with the story and characters in different ways. We’re fortunate to work very closely with Robert Kirkman – he’s incredibly engaged and deeply involved in the process. We’ve had unprecedented access to teams behind the franchise across all mediums; the creators behind the hit TV series are leading charge on the story for Invincible VS. Capturing the franchise’s signature brutality and destruction is top priority; we want the game to reflect the true stakes of superhero combat — the kind fans already know and love.” Paulson also added in a separate statement, “The roster of talent at Quarter Up proves there’s no better studio to bring this bold project to life. This team carries a deep legacy in fighting games, and Invincible was the perfect title for in-house development by their fearless and confident crew. We’re thrilled that Mike and the team are part of Skybound and we can’t wait to see our vision come to life — on this game and beyond.”",
  "image": "https://venturebeat.com/wp-content/uploads/2025/06/Quarter-Up-Logo.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003eSkybound announced today that it has launched its first internal development studio, Quarter Up. The new studio is working on \u003ca href=\"https://venturebeat.com/games/skybound-reveals-invincible-vs-a-3v3-fighting-game/\"\u003eInvincible VS\u003c/a\u003e, a new fighting game set in the franchise of the same name created by Robert Kirkman, Cory Walker and Ryan Ottley. Skybound revealed the new studio today, shortly after revealing the new title, which is set for launch sometime in 2026.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to Skybound, Quarter Up is a Los Angeles-based team with around 40+ members. The team has collective experience in studios such as Activision Blizzard, Riot Games, Naughty Dog, Netflix, Amazon Games and Double Helix, among others. The name is a reference to putting quarters in arcade machines in order to keep your gameplay going. Several members of the team have previous experience working on fighting games, in particular 2013’s Killer Instinct.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"Invincible VS Studio Reveal and Behind the Scenes\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/i2iNDwXtYqU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eMike Willette, Invincible VS executive producer, told GamesBeat in an interview, “Quarter Up is the first in-house game development studio at Skybound (second major in-house studio) dedicated to creating fighting games. We’re a hyper passionate team with extensive experience in competitive and combat-focused games. From the start, our goal and vision has always been to create experiences that make players jump out of their seats and feel heroic…feel like a badass… We’re a combat-focused studio and fighting games are where we want to leave our mark!”\u003c/p\u003e\n\n\n\n\u003cp\u003eAs for how the studio started, Willette added, “A few of our key team members were part of the Double Helix Game’ Killer Instinct development team, which was eventually purchased by Amazon. We’ve always felt like we had unfinished business in the fighting game genre and we had dreamed too long about starting our own studio – we owed it to ourselves. I approached the team at Skybound about developing an Invincible fighting game; they believed and trusted in our vision and have been huge advocates in helping bring Invincible VS to life.”\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-bringing-the-invincible-universe-to-bloody-violent-life\"\u003eBringing the Invincible universe to bloody, violent life\u003c/h2\u003e\n\n\n\n\u003cp\u003eSkybound and Quarter Up revealed the game over the weekend during the Xbox Games Showcase for Summer Game Fest. Invincible VS is a 3v3 tag fighting game set in the Invincible universe and starring several of its familiar characters, including Mark “Invincible” Grayson, Atom Eve, Omni-Man and more. Quarter Up has not only recreated the comic book settings in the game, but also its gory, hyper-violent combat, as shown in the reveal trailer.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"Invincible VS | Official Reveal Trailer | Xbox Games Showcase 2025\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/girNiXE-4E8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eChris Paulson, Skybound Games EVP and general manager, told GamesBeat in an interview, “We’re huge fans of Invincible, and each of us connects with the story and characters in different ways. We’re fortunate to work very closely with Robert Kirkman – he’s incredibly engaged and deeply involved in the process. We’ve had unprecedented access to teams behind the franchise across all mediums; the creators behind the hit TV series are leading charge on the story for Invincible VS. Capturing the franchise’s signature brutality and destruction is top priority; we want the game to reflect the true stakes of superhero combat — the kind fans already know and love.”\u003c/p\u003e\n\n\n\n\u003cp\u003ePaulson also added in a separate statement, “The roster of talent at Quarter Up proves there’s no better studio to bring this bold project to life. This team carries a deep legacy in fighting games, and Invincible was the perfect title for in-house development by their fearless and confident crew. We’re thrilled that Mike and the team are part of Skybound and we can’t wait to see our vision come to life — on this game and beyond.”\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-09T21:24:07Z",
  "modifiedTime": "2025-06-09T21:24:15Z"
}
