{
  "id": "c87b2ec7-a822-4335-8b86-f7c6bcd01a87",
  "title": "A 74-Year-Old Musician Makes a Million a Year From an Unpopular Song Written Nearly 50 Years Ago. Here's How.",
  "link": "https://www.entrepreneur.com/business-news/ridiculousness-theme-song-makes-writer-1-million-per-year/486074",
  "description": "The song never became a Billboard hit but proved extremely lucrative for its writer.",
  "author": "Sherin Shibu",
  "published": "Fri, 24 Jan 2025 21:31:32 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Sherin Shibu",
  "length": 3460,
  "excerpt": "Mark Mothersbaugh, now 74, wrote \"Uncontrollable Urge\" nearly 50 years ago. MTV's hit show \"Ridiculousness\" popularized it. Now the song is his main source of income.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "If you went back in time and asked composer and musician Mark Mothersbaugh to predict what his biggest moneymaker would be in his nearly 50-year career, he would not have said \"Uncontrollable Urge.\"The now 74-year-old musician has composed music for TV shows like \"The Fairly OddParents\" and \"Rugrats\" and movies like \"Thor: Ragnarok\" and \"The Lego Movie,\" but \"Uncontrollable Urge,\" a song he wrote in 1978 as a founding member of the band Devo, has turned into his biggest source of income over the past decade.Mothersbaugh's wife and manager Anita Greenspan told Rolling Stone earlier this month that the composer makes $1 million per year in royalties on just that one song. The turning point for \"Uncontrollable Urge\" was when the MTV comedy clip show Ridiculousness first launched in 2011. The show, which spotlights and reacts to viral Internet comedy videos, features a cover of \"Uncontrollable Urge\" as its theme song.Related: How the 'Oh-Oh-Oh Ozempic' Commercial Song Made a Musician $1 Million After over 12 years running on MTV and over 1,500 episodes, Ridiculousness has catapulted \"Uncontrollable Urge\" to theme song fame. At one point in June 2020, Variety noticed that \"Ridiculousness\" aired for 113 hours out of MTV's 168-hour week of programming.Still, the song's success came as a surprise to its writer.\"I've written so many other songs for films and television shows,\" Mothersbaugh told Rolling Stone. \"I would've been shocked [years ago] if you told me this is the one that would become this prime source of income.\"Mark Mothersbaugh. Photo by Rodin Eckenroth/Getty Images for AFIMothersbaugh wrote \"Uncontrollable Urge\" as the first track to Devo's debut album, \"Q: Are We Not Men? A: We Are Devo!\" The song was never released as a single and has only earned $150,000 across all time from Spotify streaming royalties. It never made it to the Billboard Hot 100, unlike the 1980s hit \"Whip It\" from Devo, which peaked at number 14 on the Billboard Hot 100. \"This was the very first song off our first album,\" Mothersbaugh told Rolling Stone. \"But it's a nice ironic twist because this was one of the songs we never even made a music video for. And now it's maybe the most-played song ever on MTV.\"Theme songs are big earnersMothersbaugh isn't the only musician to cash in on a lucrative theme song.Ed Robertson, who wrote the theme song for \"The Big Bang Theory,\" told Rolling Stone that he has made between seven to ten figures so far in total royalties for the one song from the time the show ran from 2007 to 2019 to its syndications on TBS today.Related: How TikTok and YouTube Have Changed the Music Industry Forever Marco Jacobo, who created the theme song for \"Abbott Elementary,\" told the publication that he had made six figures from the song since the show came out in 2021.The late musician Allee Willis had a 15% cut of the \"I'll Be There for You\" Friends theme song. That cut equals about $700,000 per year for Primary Wave Publishing, the company that now owns the rights to her work, per Rolling Stone.One industry executive told the publication that network TV pays 15 times more per minute for music than a streaming service like Spotify.It's not just shows that pay well — TV advertisement theme songs are lucrative too. The New York Times reports that David Paton, one of the two men who wrote the Billboard Top 10 hit \"Magic\" in 1974, earns seven figures from the song used in a TV ad for Ozempic.",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1737752012-Mark-Mothersbaugh-GettyImages-2180673819.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003eIf you went back in time and asked composer and musician Mark Mothersbaugh to predict what his biggest moneymaker would be in his nearly 50-year career, he would not have said \u0026#34;Uncontrollable Urge.\u0026#34;\u003c/p\u003e\u003cp\u003eThe now 74-year-old musician has \u003ca href=\"https://www.imdb.com/name/nm0006205/\" rel=\"follow\" target=\"_self\"\u003ecomposed\u003c/a\u003e music for TV shows like \u0026#34;The Fairly OddParents\u0026#34; and \u0026#34;Rugrats\u0026#34; and movies like \u0026#34;Thor: Ragnarok\u0026#34; and \u0026#34;The Lego Movie,\u0026#34; but \u0026#34;Uncontrollable Urge,\u0026#34; a song he wrote in 1978 as a founding member of the band Devo, has turned into his biggest source of income over the past decade.\u003c/p\u003e\u003cp\u003eMothersbaugh\u0026#39;s wife and manager Anita Greenspan \u003ca href=\"http://www.rollingstone.com/music/music-features/theme-songs-devo-ridiculousness-big-bang-theory-abbott-elementary-1235233087/\" rel=\"follow\" target=\"_self\"\u003etold Rolling Stone\u003c/a\u003e earlier this month that the composer makes $1 million per year in royalties on just that one song.\u003c/p\u003e\n  \n  \n  \n\n  \u003cp\u003eThe turning point for \u0026#34;Uncontrollable Urge\u0026#34; was when the MTV comedy clip show \u003ci\u003eRidiculousness \u003c/i\u003efirst launched in 2011. The show, which spotlights and reacts to viral Internet comedy videos, features a cover of \u0026#34;Uncontrollable Urge\u0026#34; as its theme song.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated:\u003c/b\u003e \u003ca href=\"https://www.entrepreneur.com/business-news/ozempic-song-used-in-commercial-makes-70s-rockers-millions/472492\" rel=\"follow\" target=\"_self\"\u003eHow the \u0026#39;Oh-Oh-Oh Ozempic\u0026#39; Commercial Song Made a Musician $1 Million\u003c/a\u003e\u003c/p\u003e\n\n  \u003cp\u003eAfter over 12 years running on MTV and over 1,500 episodes, \u003ci\u003eRidiculousness\u003c/i\u003e has catapulted \u0026#34;Uncontrollable Urge\u0026#34; to theme song fame. At one point in June 2020, \u003ca href=\"https://variety.com/2020/tv/news/cable-tv-decline-streaming-cord-cutting-1234710007/\" rel=\"follow\" target=\"_self\"\u003eVariety noticed\u003c/a\u003e that \u0026#34;Ridiculousness\u0026#34; aired for 113 hours out of MTV\u0026#39;s 168-hour week of programming.\u003c/p\u003e\u003cp\u003eStill, the song\u0026#39;s success came as a surprise to its writer.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve written so many other songs for films and television shows,\u0026#34; Mothersbaugh told Rolling Stone. \u0026#34;I would\u0026#39;ve been shocked [years ago] if you told me this is the one that would become this prime source of income.\u0026#34;\u003cimg alt=\"\" loading=\"lazy\" role=\"presentation\" src=\"https://assets.entrepreneur.com/images/misc/1737752042_Mark-Mothersbaugh-GettyImages-2180673819.jpg?width=1000\" width=\"1000\" height=\"712\"/\u003e\u003csup\u003e\u003ci\u003eMark Mothersbaugh. Photo by Rodin Eckenroth/Getty Images for AFI\u003c/i\u003e\u003c/sup\u003e\u003c/p\u003e\u003cp\u003eMothersbaugh wrote \u0026#34;Uncontrollable Urge\u0026#34; as the first track to Devo\u0026#39;s debut album, \u0026#34;Q: Are We Not Men? A: We Are Devo!\u0026#34; The song was never released as a single and has only earned $150,000 across all time from Spotify streaming royalties. It never made it to the Billboard Hot 100, unlike the 1980s hit \u0026#34;Whip It\u0026#34; from Devo, which \u003ca href=\"https://rock-reflections.com/pt-br/blogs/videos-lyrics-facts/devo-whip-it?srsltid=AfmBOooc8rnaad_hJoI16b-n09FcZCVdzG60D0Ki3JAJ2yCUi0LcNmtn\" rel=\"follow\" target=\"_self\"\u003epeaked at number 14\u003c/a\u003e on the Billboard Hot 100.\u003c/p\u003e\n\n  \u003cp\u003e\u0026#34;This was the very first song off our first album,\u0026#34; Mothersbaugh told Rolling Stone. \u0026#34;But it\u0026#39;s a nice ironic twist because this was one of the songs we never even made a music video for. And now it\u0026#39;s maybe the most-played song ever on MTV.\u0026#34;\u003c/p\u003e\u003ch2\u003eTheme songs are big earners\u003c/h2\u003e\u003cp\u003eMothersbaugh isn\u0026#39;t the only musician to cash in on a lucrative theme song.\u003c/p\u003e\u003cp\u003eEd Robertson, who wrote the theme song for \u0026#34;The Big Bang Theory,\u0026#34; told Rolling Stone that he has made between seven to ten figures so far in total royalties for the one song from the time the show ran from 2007 to 2019 to its \u003ca href=\"https://deadline.com/2024/12/the-big-bang-theory-nick-at-nite-mtv-nickelodeon-paramount-1236205305/\" rel=\"follow\" target=\"_self\"\u003esyndications on TBS\u003c/a\u003e today.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/living/how-tiktok-and-youtube-are-changing-music/453129\" rel=\"follow\" target=\"_self\"\u003eHow TikTok and YouTube Have Changed the Music Industry Forever\u003c/a\u003e\u003c/p\u003e\n\n  \u003cp\u003eMarco Jacobo, who created the theme song for \u0026#34;Abbott Elementary,\u0026#34; told the publication that he had made six figures from the song since the show came out in 2021.\u003c/p\u003e\u003cp\u003eThe late musician Allee Willis had a 15% cut of the \u0026#34;I\u0026#39;ll Be There for You\u0026#34; Friends theme song. That cut equals about $700,000 per year for Primary Wave Publishing, the company that now owns the rights to her work, per Rolling Stone.\u003c/p\u003e\u003cp\u003eOne industry executive told the publication that network TV pays 15 times more per minute for music than a streaming service like Spotify.\u003c/p\u003e\u003cp\u003eIt\u0026#39;s not just shows that pay well — TV advertisement theme songs are lucrative too. \u003ca href=\"https://www.nytimes.com/2024/04/09/arts/music/ozempic-jingle-oh-oh-oh-its-magic-pilot.html\" rel=\"follow\" target=\"_self\"\u003eThe New York Times\u003c/a\u003e reports that David Paton, one of the two men who wrote the Billboard Top 10 hit \u0026#34;Magic\u0026#34; in 1974, earns seven figures from the song used in a TV ad for Ozempic.\u003c/p\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-24T21:31:32Z",
  "modifiedTime": "2025-01-24T21:31:32Z"
}
