{
  "id": "d3b623ee-7392-4dcc-a9c4-5cabde0bbbca",
  "title": "Flying Taxis Rise on Aviation Industry’s Horizon",
  "link": "https://www.inc.com/associated-press/flying-taxis-rise-on-aviation-industrys-horizon/91105070",
  "description": "Flying taxis are making major strides.",
  "author": "Associated Press",
  "published": "Wed, 08 Jan 2025 19:35:40 -0500",
  "source": "https://www.inc.com/rss/",
  "categories": [
    "Technology"
  ],
  "byline": "Associated Press",
  "length": 6858,
  "excerpt": "Flying taxis are making major strides.",
  "siteName": "Inc",
  "favicon": "https://www.inc.com/_public/icons/apple-icon.png",
  "text": "When he was still a boy making long, tedious trips between his school and his woodsy home in the mountains during the 1980s, JoeBen Bevirt began fantasizing about flying cars that could whisk him to his destination in a matter of minutes. As CEO of Joby Aviation, Bevirt is getting closer to turning his boyhood flights of fancy into a dream come true as he and latter-day versions of the Wright Brothers launch a new class of electric-powered aircraft vying to become taxis in the sky. The aircraft — known as “electric vertical take-off and landing vehicle, or eVTOL — lift off the ground like a helicopter before flying at speeds up to 200 miles per hour (322 kilometers per hour) with a range of about 100 miles (161 kilometers). And these craft do it without filling the air with excessive noise caused by fuel-powered helicopters and small airplanes. “We are just a few steps from the finish line. We want to turn what are now one- and two-hour trips into five-minute trips,” Bevirt, 51, told The Associated Press before a Joby air taxi took off on a test flight in Marina, California — located about 40 miles south from where he grew up in the mountains. Flying taxis future Archer Aviation, a Silicon Valley a Silicon Valley company backed by automaker Stellantis and United Airlines, has been testing its own eVTOLs over farmland in Salinas, California, where a prototype called “Midnight” could be seen gliding above a tractor plowing fields last November. The tests are part of the journey that Joby Aviation and other ambitious companies that collectively have raised billions of dollars are taking to turn flying cars into more than just pie-in-the-sky concepts popularized in 1960s-era cartoon series, “The Jetsons,” and the 1982 science fiction film, “Blade Runner.” Archer Aviation and nearby Wisk Aero, with ties to aerospace giant Boeing Co. and Google co-founder Larry Page, are also at the forefront in the race to bring air taxis to market in the United States. Joby has already formed a partnership to connect its air taxis with Delta Air Lines passengers while Archer Aviation has lined up a deal to sell up to 200 of its aircraft to United Airlines. Flying taxis have made enough regulatory inroads with the U.S. Federal Aviation Administration to result in the recent creation of a new aircraft category called “powered lift,” a step that the agency hadn’t taken since helicopters were introduced for civilian use in the 1940s. But there are more regulatory hurdles to be cleared before air taxis will be allowed to carry passengers in the U.S., making Dubai the most likely place where eVTOLs will take commercial flight — perhaps by the end of this year. “It’s a tricky business to develop a whole new class of vehicles,” said Alan Lim, director of Alton Aviation Consultancy, a firm tracking the industry’s evolution. “It is going to be like a crawl, walk, run situation. Right now, I think we are still crawling. We are not going to have the Jetsons-type reality where everyone will be flying around everywhere in the next two to three years.” China is also vying to make flying cars a reality, a quest that has piqued President-elect Donald Trump’s interest in making the vehicles a priority for his incoming administration during the next four years. If the ambitions of eVTOL pioneers are realized in the U.S., people will be able to hop in an air taxi to get to and from airports serving New York and Los Angeles within the next few years. Because its electric taxis can fly unimpeded at high speeds, Joby envisions transporting up to four Delta Air Lines passengers at a time from New York area airports to Manhattan in about 10 minutes or less. To start, air taxi prices almost certainly will be significantly more that the cost of taking a cab or Uber ride from JFK airport to Manhattan, but the difference could narrow over time because eVTOLs should be able to transport a higher volume of passengers than ground vehicles stuck in traffic going each way. “You will see highways in the sky,” Archer Aviation CEO Adam Goldstein predicted during an interview at the company’s San Jose, California, headquarters. “There will be hundreds, maybe thousands of these aircraft flying in these individual cities and it will truly change the way cities are being built.” Investors are betting Goldstein is right, helping Archer raise an additional $430 million late last year from a group that included Stellantis and United Airlines. The infusion came shortly after a Japanese automaker poured another $500 million into Joby to bring its total investment in that company to nearly $900 million. Those investments were part of the $13 billion that eVTOL companies have raised during the past five years, according to Alton Aviation. Both Joby Aviation and Archer Aviation went public in 2021 through reverse mergers, opening up another fundraising avenue and making it easier to recruit engineers with the allure of stock options. The companies have been able to attract workers away from electric automaker Tesla and rocket maker SpaceX and, in Archer’s instance, raiding the ranks of Wisk Aero. The Wisk defections triggered a lawsuit accusing Archer of intellectual property theft in a dispute that was resolved with a 2023 settlement that included an agreement for the two sides to collaborate on some facets of eVTOL technology. Before going public, Joby also acquired eVTOL technology developed by ride-hailing service Uber in an $83 million deal that also brought those two companies together as partners. But none of the deals or technological advances have stopped the losses from piling up at the companies building flying cars. Joby, whose roots date back to 2009 when Bevirt founded the company, has sustained $1.6 billion in losses since its inception while Archer has amassed nearly $1.5 billion in losses since its founding in 2018. While they moved to commercial air taxi services, both Joby and Archer are trying to bring in revenue by negotiating contracts to use their eVTOLs in the U.S. military for deliveries and other other short-range missions. Archer has forged a partnership with Anduril Industries, a military defense technology specialist founded by Oculus headset inventor Palmer Luckey, to help it win deals. The uncertain prospects have left both companies with relatively low market values by tech industry standards, with Joby’s hovering around $7 billion and Archer’s $6 billion. But Bevirt sees blue skies ahead. “eVTOLs are going to transform the way we move,” he said. “It’s a dramatically better way to get around. Seeing the world from the air is better than being stuck in the traffic on the interstate.” Copyright 2025. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.",
  "image": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit,w_1024,h_1024/vip/2025/01/GettyImages-1689517963.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eWhen he was still a boy making long, tedious trips between his school and his woodsy home in the mountains during the 1980s, JoeBen Bevirt began fantasizing about \u003ca href=\"https://www.inc.com/bruce-crumley/u-s-air-taxi-developers-hope-2024-gains-help-services-take-off-in-2025/91068332\"\u003eflying\u003c/a\u003e cars that could whisk him to his destination in a matter of minutes.\u003c/p\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eAs CEO of Joby Aviation, Bevirt is getting closer to turning his boyhood flights of fancy into a dream come true as he and latter-day versions of the Wright Brothers launch a new class of electric-powered aircraft vying to become \u003ca href=\"https://www.inc.com/bruce-crumley/air-taxis-inch-closer-to-2025-takeoff-after-long-awaited-faa-rule-passes/90993349\"\u003etaxis in the sky\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe aircraft — known as “electric vertical take-off and landing vehicle, or eVTOL — lift off the ground like a helicopter before flying at speeds up to 200 miles per hour (322 kilometers per hour) with a range of about 100 miles (161 kilometers). And these craft do it without filling the air with excessive noise caused by fuel-powered helicopters and small airplanes.\u003c/p\u003e\n\n\n\n\u003cp\u003e“We are just a few steps from the finish line. We want to turn what are now one- and two-hour trips into five-minute trips,” Bevirt, 51, told The Associated Press before a Joby air taxi took off on a test flight in Marina, California — located about 40 miles south from where he grew up in the mountains.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003ch2 id=\"h-flying-taxis-future\"\u003eFlying taxis future\u003c/h2\u003e\n\n\n\n\u003cp\u003eArcher Aviation, a Silicon Valley a Silicon Valley company backed by automaker Stellantis and United Airlines, has been testing its own eVTOLs over farmland in Salinas, California, where a prototype called “Midnight” could be seen gliding above a tractor plowing fields last November.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe tests are part of the journey that Joby Aviation and other ambitious companies that collectively have raised billions of dollars are taking to turn flying cars into more than just pie-in-the-sky concepts popularized in 1960s-era cartoon series, “The Jetsons,” and the 1982 science fiction film, “Blade Runner.”\u003c/p\u003e\n\n\n\n\u003cp\u003eArcher Aviation and nearby Wisk Aero, with ties to aerospace giant Boeing Co. and Google co-founder Larry Page, are also at the forefront in the race to bring air taxis to market in the United States. Joby has already formed a partnership to connect its air taxis with Delta Air Lines passengers while Archer Aviation has lined up a deal to sell up to 200 of its aircraft to United Airlines.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eFlying taxis have made enough regulatory inroads with the U.S. Federal Aviation Administration to result in the recent creation of a new aircraft category called “powered lift,” a step that the agency hadn’t taken since helicopters were introduced for civilian use in the 1940s.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut there are more regulatory hurdles to be cleared before air taxis will be allowed to carry passengers in the U.S., making Dubai the most likely place where eVTOLs will take commercial flight — perhaps by the end of this year.\u003c/p\u003e\n\n\n\n\u003cp\u003e“It’s a tricky business to develop a whole new class of vehicles,” said Alan Lim, director of Alton Aviation Consultancy, a firm tracking the industry’s evolution. “It is going to be like a crawl, walk, run situation. Right now, I think we are still crawling. We are not going to have the Jetsons-type reality where everyone will be flying around everywhere in the next two to three years.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eChina is also vying to make flying cars a reality, a quest that has piqued President-elect Donald Trump’s interest in making the vehicles a priority for his incoming administration during the next four years.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf the ambitions of eVTOL pioneers are realized in the U.S., people will be able to hop in an air taxi to get to and from airports serving New York and Los Angeles within the next few years.\u003c/p\u003e\n\n\n\n\u003cp\u003eBecause its electric taxis can fly unimpeded at high speeds, Joby envisions transporting up to four Delta Air Lines passengers at a time from New York area airports to Manhattan in about 10 minutes or less. To start, air taxi prices almost certainly will be significantly more that the cost of taking a cab or Uber ride from JFK airport to Manhattan, but the difference could narrow over time because eVTOLs should be able to transport a higher volume of passengers than ground vehicles stuck in traffic going each way.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003e“You will see highways in the sky,” Archer Aviation CEO Adam Goldstein predicted during an interview at the company’s San Jose, California, headquarters. “There will be hundreds, maybe thousands of these aircraft flying in these individual cities and it will truly change the way cities are being built.”\u003c/p\u003e\n\n\n\n\u003cp\u003eInvestors are betting Goldstein is right, helping Archer raise an additional $430 million late last year from a group that included Stellantis and United Airlines. The infusion came shortly after a Japanese automaker poured another $500 million into Joby to bring its total investment in that company to nearly $900 million.\u003c/p\u003e\n\n\n\n\u003cp\u003eThose investments were part of the $13 billion that eVTOL companies have raised during the past five years, according to Alton Aviation.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eBoth Joby Aviation and Archer Aviation went public in 2021 through reverse mergers, opening up another fundraising avenue and making it easier to recruit engineers with the allure of stock options.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe companies have been able to attract workers away from electric automaker Tesla and rocket maker SpaceX and, in Archer’s instance, raiding the ranks of Wisk Aero.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Wisk defections triggered a lawsuit accusing Archer of intellectual property theft in a dispute that was resolved with a 2023 settlement that included an agreement for the two sides to collaborate on some facets of eVTOL technology.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eBefore going public, Joby also acquired eVTOL technology developed by ride-hailing service Uber in an $83 million deal that also brought those two companies together as partners.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut none of the deals or technological advances have stopped the losses from piling up at the companies building flying cars. Joby, whose roots date back to 2009 when Bevirt founded the company, has sustained $1.6 billion in losses since its inception while Archer has amassed nearly $1.5 billion in losses since its founding in 2018.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile they moved to commercial air taxi services, both Joby and Archer are trying to bring in revenue by negotiating contracts to use their eVTOLs in the U.S. military for deliveries and other other short-range missions. Archer has forged a partnership with Anduril Industries, a military defense technology specialist founded by Oculus headset inventor Palmer Luckey, to help it win deals.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eThe uncertain prospects have left both companies with relatively low market values by tech industry standards, with Joby’s hovering around $7 billion and Archer’s $6 billion.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut Bevirt sees blue skies ahead. “eVTOLs are going to transform the way we move,” he said. “It’s a dramatically better way to get around. Seeing the world from the air is better than being stuck in the traffic on the interstate.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eCopyright 2025. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-09T00:35:40Z",
  "modifiedTime": "2025-01-09T00:35:41Z"
}
