{
  "id": "dc53cb5c-a7cc-4651-85c1-fe908ea1270a",
  "title": "Mike Verdu of Netflix Games leads new generative AI initiative",
  "link": "https://venturebeat.com/games/mike-verdu-of-netflix-games-leads-new-generative-ai-initiative/",
  "description": "The former VP in charge of Netflix Games has taken on a new rule to use generative AI technologies in game development for the publisher.",
  "author": "Imran Khan",
  "published": "Mon, 04 Nov 2024 20:27:31 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "Game Development",
    "GamesBeat",
    "Gaming Business",
    "category-/Arts \u0026 Entertainment/Online Media",
    "category-/Games/Computer \u0026 Video Games",
    "Generative AI"
  ],
  "byline": "Imran Khan",
  "length": 2208,
  "excerpt": "The former VP in charge of Netflix Games has taken on a new rule to use generative AI technologies in game development for the publisher.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "November 4, 2024 12:27 PM Mike Verdu, who had largely spearheaded Netflix’s foray into gaming in recent years as VP of Netflix Games, announced on LinkedIn a new role within Netflix Games leading the company’s effort to capitalize on generative AI. The role, Vice President of GenAI for Games, focuses on using generative AI for the next step in creating games with big teams. “GenAI is that next challenge. I don’t think I’ve been this excited about an opportunity in this industry since the 90s, when we saw a new game launch every few months that redefined what was possible,” Verdu writes in his LinkedIn post. “It was an incredible time to be making games as talented creators showed all of us what the future looked like. Guess what? We’re back to those days of seemingly unlimited potential and the rapid pace of innovation, which resulted in mind-blowing surprises for players every few months.” It is worth noting that the announcement of this role comes shortly after Netflix shut down its only triple-A studio before it announced or released any games. Verdu speaks in the blog post about how AI will accelerate and a catalyst for creator-driven decisions, hoping to make game development more lithe and agile. “I can’t believe how lucky I am to be alive when a wave this big is about to hit the game industry,” Verdu writes. “Many view this technology with fear, but I am a game-maker at heart and I see its potential to unlock all of us, to create mind-blowing new experiences for players, to lift us to new heights. Yes, we’ll have to adapt and change, but when have we failed to meet that challenge as an industry?” Netflix is far from the only gaming publisher to go this route. Electronic Arts is betting big on AI being a fundamental part of their game creation process. That said, Electronic Arts has also recently laid off a large chunk of their workforce, so some skepticism is warranted. GB Daily Stay in the know! Get the latest news in your inbox daily By subscribing, you agree to VentureBeat's Terms of Service. Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2024/11/1730687581340.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2024-11-04T20:27:31+00:00\" datetime=\"2024-11-04T20:27:31+00:00\"\u003eNovember 4, 2024 12:27 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"750\" src=\"https://venturebeat.com/wp-content/uploads/2024/11/1730687581340.jpg?w=750\" alt=\"Verdu Generative AI\"/\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003eMike Verdu, who had largely spearheaded Netflix’s foray into gaming in recent years as VP of Netflix Games, \u003ca href=\"https://www.linkedin.com/posts/mike-verdu-2a6113_new-role-at-netflix-vp-genai-for-games-activity-7259029850827423744-YMg4\"\u003eannounced on LinkedIn\u003c/a\u003e a new role within Netflix Games leading the company’s effort to capitalize on generative AI.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe role, Vice President of GenAI for Games, focuses on using generative AI for the next step in creating games with big teams.\u003c/p\u003e\n\n\n\n\u003cp\u003e“GenAI is that next challenge. I don’t think I’ve been this excited about an opportunity in this industry since the 90s, when we saw a new game launch every few months that redefined what was possible,” Verdu writes in his LinkedIn post. “It was an incredible time to be making games as talented creators showed all of us what the future looked like. Guess what? We’re back to those days of seemingly unlimited potential and the rapid pace of innovation, which resulted in mind-blowing surprises for players every few months.” \u003c/p\u003e\n\n\n\n\u003cp\u003eIt is worth noting that the announcement of this role comes \u003ca href=\"https://venturebeat.com/games/netflix-shutters-its-only-triple-a-studio-loses-major-industry-hires/\"\u003eshortly after Netflix shut down its only triple-A studio before it announced or released any games\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eVerdu speaks in the blog post about how AI will accelerate and a catalyst for creator-driven decisions, hoping to make game development more lithe and agile. \u003c/p\u003e\n\n\n\n\u003cp\u003e“I can’t believe how lucky I am to be alive when a wave this big is about to hit the game industry,” Verdu writes. “Many view this technology with fear, but I am a game-maker at heart and I see its potential to unlock all of us, to create mind-blowing new experiences for players, to lift us to new heights. Yes, we’ll have to adapt and change, but when have we failed to meet that challenge as an industry?”\u003c/p\u003e\n\n\n\n\u003cp\u003eNetflix is far from the only gaming publisher to go this route. \u003ca href=\"https://venturebeat.com/ai/electronic-arts-goes-deep-into-artificial-intelligence-for-game-development/\"\u003eElectronic Arts is betting big on AI\u003c/a\u003e being a fundamental part of their game creation process. That said, Electronic Arts has also recently laid off a large chunk of their workforce, so some skepticism is warranted.\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2663995\"\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eGB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eStay in the know! Get the latest news in your inbox daily\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eBy subscribing, you agree to VentureBeat\u0026#39;s \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003eTerms of Service.\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-04T20:27:31Z",
  "modifiedTime": "2024-11-04T20:27:35Z"
}
