{
  "id": "f707bb38-8a18-4998-b0d8-98df33c274ca",
  "title": "'The Most Important Traits Are Confidence and Humility': Leadership Lessons From an Army Ranger Turned CEO",
  "link": "https://www.entrepreneur.com/leadership/leadership-lessons-from-an-army-ranger-turned-ceo/487203",
  "description": "Dan Streetman, the CEO of Tanium, a leading cybersecurity company located in the San Francisco Bay Area, on how being an Army Ranger has prepared him to be a CEO, what leadership means to him and how his company works to deliver the power of certainty for the organizations it serves.",
  "author": "William Salvi",
  "published": "Fri, 21 Feb 2025 19:30:00 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "William Salvi",
  "length": 2994,
  "excerpt": "Dan Streetman, the CEO of Tanium, on how the military has prepared him to be a CEO, what leadership means to him and how his company works to deliver the power of certainty for the organizations it serves.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "Opinions expressed by Entrepreneur contributors are their own. In our most recent The CEO Series episode, we filmed the CEO of Tanium, Dan Streetman. In an era where cyber threats are ever-changing and growing more sophisticated, Tanium is leading the charge to fortify organizations against digital attacks. A former U.S. Army Ranger and experienced executive, Streetman brings a unique blend of military discipline and corporate leadership to one of the world's leading cybersecurity companies.With Tanium serving major U.S. banks, all U.S. military branches, government agencies, retailers and more, Streetman emphasized the company's mission of delivering \"the power of certainty\" to organizations navigating an increasingly volatile cyber landscape. After all, when a major bank, or a military branch or a school experiences a cyber attack from a bad actor, it can throw the organization into a tailspin.Related: How Military Service Taught the CEO of Arc'teryx to Lead with Precision and Passion A lot of Streetman's leadership philosophies came from his military experience, particularly his training in high-pressure situations. He drew parallels between military operations and business challenges, emphasizing that great leaders must balance confidence with humility.Tanium has sophisticated technology, but so do the people implementing cyber attacks. One major concern Dan raised is the growing role of AI in cyber attacks. We all hear about the great aspects of AI. I, myself, use it every day. Businesses are implementing AI into everything they do. AI has revolutionized the business world, and hopefully it will improve our overall society as a whole, but it has also empowered bad actors to launch more sophisticated attacks at an unprecedented pace. He warns that adversaries, free from ethical constraints, often weaponize AI to outmaneuver traditional security measures. Tanium is responding in kind, leveraging AI to enhance autonomous endpoint management, allowing organizations to detect and neutralize threats faster than ever before.Beyond his CEO role at Tanium, Streetman displayed his passion for mentorship, particularly in helping veterans transition from the military to technology careers. Through initiatives like VetForce and VetsinTech, he actively supports former service members by equipping them with the skills needed for the digital economy. After talking with Dan for a few hours, it made sense. And I mean that in a great way. On top of that, Dan has competed in 13 ironmans! 13. He's also run a few marathons guiding blind runners. I gotta be honest, I was a little weary of the CEO who runs Ironmans, works at a cybersecurity company in the Bay Area and was a U.S. Army Ranger. That's intense! But the end of it all, I thought he seemed like a great leader, engaged, and he was passionate about security.Related: 5 Founder-CEOs Come Together to Discuss the Realities of Leadership, Entrepreneurship and What It Takes to Succeed",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1739900625-Thumbnail2000x1333px1copy.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n    Opinions expressed by Entrepreneur contributors are their own.  \u003c/p\u003e\u003cdiv\u003e\n      \u003cp\u003eIn our most recent \u003ca href=\"https://www.youtube.com/@TheCEOSeries\" rel=\"follow\" target=\"_self\"\u003eThe CEO Series\u003c/a\u003e episode, we filmed the CEO of \u003ca href=\"https://www.tanium.com/\" rel=\"follow\" target=\"_self\"\u003eTanium\u003c/a\u003e, Dan Streetman. In an era where cyber threats are ever-changing and growing more sophisticated, Tanium is leading the charge to fortify organizations against digital attacks. A former U.S. Army Ranger and experienced executive, Streetman brings a unique blend of military discipline and corporate leadership to one of the world\u0026#39;s leading cybersecurity companies.\u003c/p\u003e\u003cp\u003eWith Tanium serving major U.S. banks, all U.S. military branches, government agencies, retailers and more, Streetman emphasized the company\u0026#39;s mission of delivering \u0026#34;the power of certainty\u0026#34; to organizations navigating an increasingly volatile \u003ca href=\"https://www.entrepreneur.com/science-technology/how-to-avoid-leaving-your-business-exposed-to-cyber-threats/469667\" rel=\"follow\" target=\"_self\"\u003ecyber landscape\u003c/a\u003e. After all, when a major bank, or a military branch or a school experiences a cyber attack from a bad actor, it can throw the organization into a tailspin.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003ca href=\"https://www.entrepreneur.com/leadership/arcteryx-s-ceo-on-how-to-lead-with-precision-and-passion/479059\" rel=\"follow\" target=\"_self\"\u003eHow Military Service Taught the CEO of Arc\u0026#39;teryx to Lead with Precision and Passion\u003c/a\u003e\u003c/b\u003e\u003c/p\u003e\n  \n  \n  \n\n  \u003cp\u003eA lot of Streetman\u0026#39;s leadership philosophies came from his military experience, particularly his training in high-pressure situations. He drew parallels between military operations and business challenges, emphasizing that great leaders must balance confidence with humility.\u003c/p\u003e\u003cp\u003eTanium has sophisticated technology, but so do the people implementing cyber attacks. One major concern Dan raised is the growing role of \u003ca href=\"https://www.entrepreneur.com/en-in/news-and-trends/ai-powered-cyberattacks-top-concern-for-executives-in-2024/482523\" rel=\"follow\" target=\"_self\"\u003eAI in cyber attacks\u003c/a\u003e. We all hear about the great aspects of AI. I, myself, use it every day. Businesses are implementing AI into everything they do. AI has revolutionized the business world, and hopefully it will improve our overall society as a whole, but it has also empowered bad actors to launch more sophisticated attacks at an unprecedented pace.\u003c/p\u003e\n\n  \u003cp\u003eHe warns that adversaries, free from ethical constraints, often weaponize AI to outmaneuver traditional security measures. Tanium is responding in kind, leveraging AI to enhance autonomous endpoint management, allowing organizations to detect and neutralize threats faster than ever before.\u003c/p\u003e\u003cp\u003eBeyond his CEO role at Tanium, Streetman displayed his passion for mentorship, particularly in helping veterans transition from the \u003ca href=\"https://www.entrepreneur.com/starting-a-business/military-vets-increasingly-look-to-solve-techs-chronic/312462\" rel=\"follow\" target=\"_self\"\u003emilitary to technology careers\u003c/a\u003e. Through initiatives like VetForce and VetsinTech, he actively supports former service members by equipping them with the skills needed for the digital economy. After talking with Dan for a few hours, it made sense. And I mean that in a great way. On top of that, Dan has competed in 13 ironmans! 13. He\u0026#39;s also run a few marathons guiding blind runners. I gotta be honest, I was a little weary of the CEO who runs Ironmans, works at a cybersecurity company in the Bay Area and was a U.S. Army Ranger. That\u0026#39;s intense! But the end of it all, I thought he seemed like a great leader, engaged, and he was passionate about security.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003ca href=\"https://www.entrepreneur.com/leadership/key-insights-from-a-roundtable-discussion-with-5/485235\" rel=\"follow\" target=\"_self\"\u003e5 Founder-CEOs Come Together to Discuss the Realities of Leadership, Entrepreneurship and What It Takes to Succeed\u003c/a\u003e\u003c/b\u003e\u003c/p\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-21T19:30:00Z",
  "modifiedTime": "2025-02-21T19:30:00Z"
}
