[
  {
    "id": "3d39c173-c6e4-45b9-b44b-ab9a2cd3cae1",
    "title": "Where the Crawdads Sing",
    "link": "https://wokeread.home.blog/2020/11/01/where-the-crawdads-sing/",
    "description": "Book Review Author :Delia Owens Genre: Historical Fiction Publisher : GP Putnam’s Sons Year of Publication: 2019 Number of Pages: 368 My Rating : 4 out of 5 I picked this up with a bit of hesitation. In spite of the great reviews that it got, I must say the title made me expect something … Continue reading Where the Crawdads Sing →",
    "author": "Wokeread",
    "published": "Sun, 01 Nov 2020 09:30:18 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Book Reviews# Crawdads# Delia Owens# Historical Fiction"
    ]
  },
  {
    "id": "59925314-459d-4933-8f7e-f3dd9503fedb",
    "title": "North and South",
    "link": "https://wokeread.home.blog/2020/06/07/north-and-south/",
    "description": "Classics Book Review Author : Elizabeth Gaskell Genre : Literary Classic Fiction Original Publisher : Chapman and Hall Year of Publication : 1854 Number of Pages : 396 My Rating : 5 out of 5 My most recent read is this gem of a book by Elizabeth Gaskell, based in Victorian England. Margaret Hale is … Continue reading North and South →",
    "author": "Wokeread",
    "published": "Sun, 07 Jun 2020 13:53:14 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Classics",
      "#book review",
      "#Classics Review",
      "#ClassicsClub",
      "#Elizabeth Gaskell",
      "#North and South"
    ]
  },
  {
    "id": "f8861d8e-f287-4b3e-93c2-7df7cbf7c1e3",
    "title": "CHARCUTERIE GIRL",
    "link": "https://www.kirkusreviews.com/book-reviews/ja-wright/charcuterie-girl/",
    "description": "Before she met bank CEO Jack Davis in 2013, Emma Davis was an up-and-coming software developer who built and sold her own successful company. During their 10-year marriage, he used nearly all the money she’d earned on failed investment opportunities. After Emma learns that Jack is having an affair with a restaurant server he met during one of their family dinners, he leaves her. Now that he’s gone, she has no income, no emotional support, and no idea what to do next. She takes a low-level tech job and loses whatever standing she had in the community. “What I desperately wanted was to stop loathing myself so much,” she narrates. “Rotten mother. Horrible at relationships. Pathetic career. Fat. Alone. And just plain scared.” Then creative writing professor Evy Hanover moves into Emma’s small suburban hamlet of Belmont, New York, and the pair strike up an instant and intense friendship. Evy seems to be just what Emma needs in her life; she convinces Emma to hire a divorce attorney, to stand up to Jack, to use some dating apps, and to live healthier. However, the future isn’t quite as bright as Evy makes it seem, and once Emma learns about the secret that Evy’s keeping, she questions whether their friendship will be enough to see them through. Emma’s first-person perspective effectively gives Wright’s novel a lighthearted and conversational tone, and it’s filled with humorous dating mishaps, clever gripes about dieting, and several slapstick moments. It initially presents as a fun, quick read; however, it later delves into some darker territory, including topics such as eating disorders, mental illness, and profoundly abusive relationships—each of which are described with greater nonchalance than readers may feel they deserve. The story is also weighed down by excessive detail that does little to move the plot forward, and some characters are rendered in such exaggerated fashion that they lack nuance.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/50f809baff68401080cb6269610b10ca/e26bf17a64df4e1893d59150007eedb0.png.180x0_q85_autocrop.webp",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "0b593a3e-00b6-4d93-9aba-1e7c9958a95c",
    "title": "The Contender from Delos",
    "link": "https://www.kirkusreviews.com/book-reviews/leo-carrington/the-contender-from-delos/",
    "description": "Alexander longs to be a champion wrestler—he yearns to train at an elite palaestra and receive the laurel crown of victory from none other than the Caesar, Marcus Aurelius. He’s naturally gifted and has never been defeated, but for the time being he merely fights in disreputable matches (upon which drunks and criminals wager) arranged by his father, Marcus, a carpenter of modest means, in the Roman neighborhood the Subura. Such informal bouts can be dangerous—those who lose their bets can be violently vindictive, and a local gang leader, Flavius, aims to commandeer Alexander’s career for his own profit (such perils of ancient Rome are vividly depicted by the author). An opportunity arises when Marcus asks Aulus Virius, an old friend from his days in the navy, to help Alexander; he arranges for the youth to train with Gaius, a renowned wrestling coach. Part of the deal is that Marcus must return to the navy, a fraught exchange given the brewing of rebellion among the Germanic tribes and the Sarmatians. A bright future seems to dawn for Alexander, but his prospects dim when he is quickly expelled from Gaius’ school for illicit gambling and Marcus is killed in an ambush while at sea. In the aftermath of these disasters, Alexander’s mother, Elena, decides to move the two of them back to her homeland of Delos and enjoy the hospitality of her well-heeled brother, Nikos. Alexander begins to train again with Demetrius, a rival of Gaius and an old friend of Marcus. Alexander still aspires to become a great champion, and to win the love of Zoe, who was once the paramour of his chief competitor in Delos, the smug Dario. Carrington’s command of the relevant historical information is extraordinary, and as a result both Rome and Delos are brought to pulsing life. For all its greatness and wealth, Rome is depicted here as a morally squalid place brimming with dangers and temptations to vice. Alexander’s ambition is palpable—he can’t bear the thought of sinking into eternal oblivion, his name forgotten. (He’s driven by a desire for “A place among the elite. A name held in the highest regard. A reputation worthy of the greatest wrestlers.”) The author provides a powerfully dramatic backdrop for Alexander’s quest for fame—while in Delos, he learns an extraordinary family secret, one his mother has zealously guarded his entire life that could potentially threaten them if discovered. Carrington’s writing style is straightforward and simple, unadorned by poetic embellishments or narrative gimmicks. The story’s strength lies in its engrossing plot and painstakingly crafted characters—there are no contrived types in this story, no obviously manufactured token personalities. (There is so much depth in the portrayal of Elena, she could warrant a novel of her own.) This is exactly what a discerning reader should expect from historical fiction—rigorous verisimilitude, complex characterization, and an enthralling plot.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/007251d7e21a4f64bb3b99c0615d37d5/d799aacec9aa4f349238258bb3f38cd2.jpeg.180x0_q85_autocrop.webp",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "93f122f6-ffd4-4dfb-95c8-5f79bcd7770b",
    "title": "Book Riot’s Deals of the Day for May 25, 2025",
    "link": "https://bookriot.com/book-riots-deals-of-the-day-for-may-25-2025/",
    "description": "A beautifully written Ethiopia-set family saga, occultists and the film industry in 1990s Mexico City, a visceral story set in the wild Scottish Highlands, and more of the best book deals of the day.",
    "author": "Deals",
    "published": "Sun, 25 May 2025 11:30:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/05/deals-52525.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Book Deals"
    ]
  },
  {
    "id": "19eca5d3-806c-47ba-ac69-ab251723802f",
    "title": "The Book Stories We Covered This Week",
    "link": "https://bookriot.com/the-book-stories-we-covered-this-week/",
    "description": "Here are the stories we covered ourselves this week.",
    "author": "Jeff O'Neal",
    "published": "Sun, 25 May 2025 10:21:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/01/tied-up-stacks-of-newspapers.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Today in Books"
    ]
  },
  {
    "id": "9c619fb6-05ec-49ae-b366-447302ba6f76",
    "title": "The Buzziest Books of May | 2025",
    "link": "https://www.newinbooks.com/the-buzziest-books-of-may-2025/",
    "description": "The Buzziest Books of May | 2025 There’s something about May; maybe it’s the light or the warmth that makes us open up, and these stories meet that mood perfectly. ✨ Rich in feeling, full of heart, and fearless in the way they explore love, loss, identity, and connection, these... Read More The post The Buzziest Books of May | 2025 appeared first on NewInBooks.",
    "author": "zaida",
    "published": "Fri, 23 May 2025 15:12:37 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "eBook",
      "News"
    ]
  },
  {
    "id": "d629b802-11cf-4708-bcd3-51526fcb82c4",
    "title": "Portal Problems: 6 Fantasies Where Worlds Collide",
    "link": "https://www.newinbooks.com/portal-problems-6-fantasies-where-worlds-collide/",
    "description": "Portal Problems: 6 Fantasies Where Worlds Collide Fall through the veil—literally. These fantasy novels explore portal magic, multiverse collisions, and characters caught between worlds. If you love Narnia vibes with adult stakes and stunning worldbuilding, step in. Lost and Stolen Gods (Labyrinth of Gods Book 1) by Debbie Cassidy Release... Read More The post Portal Problems: 6 Fantasies Where Worlds Collide appeared first on NewInBooks.",
    "author": "zaida",
    "published": "Thu, 22 May 2025 22:09:52 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "eBook",
      "Fantasy \u0026 Science Fiction"
    ]
  },
  {
    "id": "b6469161-0f76-4ba5-9f19-ac537917b974",
    "title": "RLF Collected podcast",
    "link": "https://ayearofreadingtheworld.com/2025/05/13/rlf-collected-podcast/",
    "description": "One of the joyous things that has come out of this project is the way that I’m frequently invited to take part in discussions about writing and the ways stories travel. Often, these conversations take place at literary festivals or conferences, but they sometimes involve podcasts too. Last year, I was asked to produce a […]",
    "author": "Ann Morgan",
    "published": "Tue, 13 May 2025 10:58:26 +0000",
    "image": "",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Events",
      "books",
      "community",
      "culture",
      "podcast",
      "Royal Literary Fund",
      "writers",
      "writing"
    ]
  },
  {
    "id": "689ec1f4-3add-4edb-8778-a845e4c04baf",
    "title": "Blog tour: Where Snowbirds Play",
    "link": "https://ayearofreadingtheworld.com/2025/05/04/blog-tour-where-snowbirds-play/",
    "description": "I’m not really a book blogger. Yes, I write about books on this blog – and yes, I did once upon a time review close to 200 books in a year here – but the commitment, stamina and output of other book reviewers in the virtual sphere now leave me and my once-a-month writeups in […]",
    "author": "Ann Morgan",
    "published": "Sun, 04 May 2025 11:51:34 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2025/05/Where-Snowbirds-Play-3d-with-colour-BG.jpg?resize=550%2C550\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Post-world",
      "blog tour",
      "book review",
      "books",
      "Gina Goldhammer",
      "novel",
      "Palm Beach",
      "Renard Press",
      "writing"
    ]
  },
  {
    "id": "288c2e52-c764-44f7-b23b-eaaa3f8fe83f",
    "title": "Letter from Aestas",
    "link": "https://aestasbookblog.com/letter-from-aestas/",
    "description": "After a decade of reading and reviewing books, I’ve decided that it’s time for me to take a step back from blogging. Running this book blog has been such a huge and wonderful part of my life. I’ve written over 600 book reviews and loved the experience of getting to share my love of reading ...Read More  \u003e",
    "author": "Aestas",
    "published": "Thu, 09 Jun 2022 17:23:47 +0000",
    "image": "https://s.w.org/images/core/emoji/13.1.0/72x72/2764.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "f8f8116e-03f0-4997-bcbf-de8daa3c3166",
    "title": "Latest Book News — January 10, 2022",
    "link": "https://aestasbookblog.com/latest-book-news-january-10-2022/",
    "description": "BOOKWORM NEWS: Juniper Hill by Devney Perry is now live!! — “Memphis Ward arrives in Quincy, Montana, on the fifth worst day of her life. She needs a shower. She needs a snack. She needs some sanity. Because moving across the country with her newborn baby is by far the craziest thing she’s ever done. ...Read More  \u003e",
    "author": "Aestas",
    "published": "Tue, 11 Jan 2022 19:52:45 +0000",
    "image": "https://aestasbookblog.com/wp-content/uploads/2021/11/JUNIPER-HILL-sm.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  }
]
