[
  {
    "id": "693eec5b-6a4f-4568-9173-2535bcea3c17",
    "title": "Where the Crawdads Sing",
    "link": "https://wokeread.home.blog/2020/11/01/where-the-crawdads-sing/",
    "description": "Book Review Author :Delia Owens Genre: Historical Fiction Publisher : GP Putnam’s Sons Year of Publication: 2019 Number of Pages: 368 My Rating : 4 out of 5 I picked this up with a bit of hesitation. In spite of the great reviews that it got, I must say the title made me expect something … Continue reading Where the Crawdads Sing →",
    "author": "Wokeread",
    "published": "Sun, 01 Nov 2020 09:30:18 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Book Reviews# Crawdads# Delia Owens# Historical Fiction"
    ]
  },
  {
    "id": "cd9c09e4-74d9-4d7d-84c9-9dc92ab021f5",
    "title": "North and South",
    "link": "https://wokeread.home.blog/2020/06/07/north-and-south/",
    "description": "Classics Book Review Author : Elizabeth Gaskell Genre : Literary Classic Fiction Original Publisher : Chapman and Hall Year of Publication : 1854 Number of Pages : 396 My Rating : 5 out of 5 My most recent read is this gem of a book by Elizabeth Gaskell, based in Victorian England. Margaret Hale is … Continue reading North and South →",
    "author": "Wokeread",
    "published": "Sun, 07 Jun 2020 13:53:14 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Classics",
      "#book review",
      "#Classics Review",
      "#ClassicsClub",
      "#Elizabeth Gaskell",
      "#North and South"
    ]
  },
  {
    "id": "127bda40-5a7d-4368-b327-bf67171ad8ef",
    "title": "JUST LIKE QUEEN ESTHER",
    "link": "https://www.kirkusreviews.com/book-reviews/kerry-olitzky/just-like-queen-esther/",
    "description": "Atara wears a crown everywhere she goes—in fact, her name even means crown. One day, her mom reads her a book about Purim, and Atara sees herself in Queen Esther; while Esther hid her Jewish identity, for a long time Atara never told her parents she was really a girl. Just as Esther’s crown made it clear that she was a queen, Atara’s crown gives her a sense of assurance about her identity. In drama class, Atara is even cast as Queen Esther in the Purim play. The show is a hit. But when Atara forgets her crown at home the next day, she must summon her inner confidence. The book’s full-color, pastel illustrations are reminiscent of newspaper comic strips, with rounded, squiggly lines. The dyslexia-friendly text appears separately from the images. Though the writing is purposeful and at times clunky, it’s wonderful to see a Purim story that centers a trans protagonist; many young people will identify with both Atara and Esther. The book has no endnotes about the holiday, so adults may want to pair this offering with an informational text. Atara and her mom have tan complexions and curly brown hair. Queen Esther has brown skin; the Persian King Ahasuerus is light-skinned.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/56a10a11fccf45dc831aff3ebf1f1fb5/2ab85484148342568f6df8c90a154657.jpg.180x0_q85_autocrop.jpg",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "450318cb-2279-4372-b412-67dc6c4d6bc0",
    "title": "THE SPEAR AND THE SENTINEL",
    "link": "https://www.kirkusreviews.com/book-reviews/jl-hancock/the-spear-and-the-sentinel/",
    "description": "War veteran and widower “Voodoo” leads a group of hackers and “wrench-turners” for the United States Naval Special Warfareunit at the Directorate in San Diego. His skills earned him a spot in a rescue operation the previous year in Japan; now, the CIA station chief in Japan wants the same team for a mission in Central Asia, which, like the previous op, has ties to an escalating artificial intelligence Cold War. That’s not the only connection—the God Algorithm, a powerful AI that Voodoo and the others learned about last year, may still be trouble. For their newest assignment, the team must first recover an asset named Kobra Siddik, who, after escaping a reeducation camp in China, rushes to make it across the border to Kazakhstan. She has intel Voodoo’s team needs, but she will only supply it if the team helps her get someone else out of the camp. Do the Chinese have the God Algorithm? And for what diabolical purpose will they use the AI? In any case, soldiers (courtesy of China’s Ministry of State Security) are gunning for Kobra as well as Voodoo, and such team members as the burly, taciturn Stu Slater and Voodoo’s redheaded directorate co-worker Sparks. The team’s ultimate goal is thwarting “this AI network” that seems to be gathering force. But that’s easier planned than done, as protests devolve into riots that upset the Kazakh city of Almaty, surprising villains crop up, and double-crossings throw everything into disarray. Hancock packs this brisk thriller with rousing action scenes and intriguing ideas (a scientist makes a specific type of diamond whose value isn’t monetary; China uses a “predictive algorithm” that warns officials of the enigmatic “Sentinel” that will trigger insurgency). The narrative’s complex concepts are made abundantly clear via the action or characters’ discourse. That’s also true for the military and tech terminology, in addition to a veritable alphabet soup of acronyms for various organizations and shorthand communications (RTB: Return To Base). The novel delivers action in an entertaining fashion as the team skydives, goes undercover, and finds itself engaged in frenzied gunfights and pursuits. They also employ impressive technology, the highlight being four-legged, heavily-armed robotic machines that the team can access remotely. Best of all, the author meticulously develops the cast: Voodoo shares a tension with team member Mason Gallegos that harkens back to their tour in Afghanistan, and there are memorable individuals throughout, including the resilient Kobra, who comes with a tragic backstory; the ever-inquisitive Inspector Chen Wei; and the highly-skilled CIA operative Sasha Zhakupova. This sophomore series installment seamlessly connects to the preceding book—new readers will easily follow along, but may want to check out the series opener to avoid spoilers.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/01f95c33ca284c7a8718d039151f7263/ca648db826b746ce898a7e34d1af37e5.jpeg.180x0_q85_autocrop.jpg",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "5342ef6b-17d0-4f9e-89f9-fa8d05351a34",
    "title": "6 New Mystery Novels for Fans of Netflix’s Missing You",
    "link": "https://www.newinbooks.com/6-new-mystery-novels-for-fans-of-netflixs-missing-you/",
    "description": "6 New Mystery Novels for Fans of Netflix’s Missing You If Netflix’s Missing You kept you on the edge of your seat with its twists, suspense, and gripping drama, you’re in for a treat. These six new mystery novels deliver the same pulse-pounding tension, intricate plots, and unforgettable characters. Perfect... Read More The post 6 New Mystery Novels for Fans of Netflix’s Missing You appeared first on NewInBooks.",
    "author": "meghan",
    "published": "Fri, 17 Jan 2025 13:27:31 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "eBook",
      "Mystery",
      "News",
      "Thriller"
    ]
  },
  {
    "id": "198ae802-c214-42b0-b4fb-544e75decf20",
    "title": "6 Brand New Sports Romance Novels",
    "link": "https://www.newinbooks.com/6-brand-new-sports-romance-novels/",
    "description": "6 Brand New Sports Romance Novels Love stories that combine heart-pounding romance with the thrill of the game? These six brand-new sports romance novels bring all the feels, from fiery chemistry to inspiring journeys on and off the field. Whether you’re a fan of swoon-worthy athletes, fierce competition, or the... Read More The post 6 Brand New Sports Romance Novels appeared first on NewInBooks.",
    "author": "meghan",
    "published": "Fri, 17 Jan 2025 13:27:28 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "eBook",
      "News",
      "Romance"
    ]
  },
  {
    "id": "11b386d8-6f95-46e4-a440-9bac1053d931",
    "title": "Book of the month: Kim Leine",
    "link": "https://ayearofreadingtheworld.com/2024/12/23/book-of-the-month-kim-leine/",
    "description": "This novel was a recommendation from leading English-Danish translator Signe Lyng. After we met at the Dublin Book Festival in November, she generously sent me a list of recent Danish-language novels that she admires, including Niviaq Korneliussen’s Last Night in Nuuk and Solvej Balle’s On the Calculation of Volume. One of Lyng’s suggestions stood out […]",
    "author": "Ann Morgan",
    "published": "Mon, 23 Dec 2024 12:40:26 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/12/52695486065_e6dfcd5dc2_b.jpg?resize=550%2C413\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Book of the month",
      "Europe",
      "Post-world",
      "The stories",
      "book review",
      "books",
      "colonialism",
      "culture",
      "Danish",
      "Greenland",
      "history",
      "Kim Leine",
      "Martin Aitken",
      "translation"
    ]
  },
  {
    "id": "8cf69665-ecde-4d5b-84ba-8d8c1f1b89a5",
    "title": "Book of the month: Angèle Rawiri",
    "link": "https://ayearofreadingtheworld.com/2024/11/26/book-of-the-month-angele-rawiri/",
    "description": "This was a recommendation from Suroor Alikhan, who kindly invited me to be part of the Hyderabad Literature Festival Online series earlier this year and wrote about our event on her blog. Suroor is an extremely widely read person, so I knew when she suggested Gabonese author Angèle Rawiri’s The Fury and Cries of Women, […]",
    "author": "Ann Morgan",
    "published": "Tue, 26 Nov 2024 16:30:12 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/11/image.png?resize=300%2C464\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Africa",
      "Book of the month",
      "Angèle Rawiri",
      "book review",
      "books",
      "culture",
      "feminism",
      "Gabon",
      "infertility",
      "novel",
      "politics",
      "translation"
    ]
  },
  {
    "id": "580bbf51-8303-4cf7-b3a4-20d2721dfefa",
    "title": "Letter from Aestas",
    "link": "https://aestasbookblog.com/letter-from-aestas/",
    "description": "After a decade of reading and reviewing books, I’ve decided that it’s time for me to take a step back from blogging. Running this book blog has been such a huge and wonderful part of my life. I’ve written over 600 book reviews and loved the experience of getting to share my love of reading ...Read More  \u003e",
    "author": "Aestas",
    "published": "Thu, 09 Jun 2022 17:23:47 +0000",
    "image": "https://s.w.org/images/core/emoji/13.1.0/72x72/2764.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "ae9bcef7-3589-472b-bc3e-8a1f9e30c798",
    "title": "Latest Book News — January 10, 2022",
    "link": "https://aestasbookblog.com/latest-book-news-january-10-2022/",
    "description": "BOOKWORM NEWS: Juniper Hill by Devney Perry is now live!! — “Memphis Ward arrives in Quincy, Montana, on the fifth worst day of her life. She needs a shower. She needs a snack. She needs some sanity. Because moving across the country with her newborn baby is by far the craziest thing she’s ever done. ...Read More  \u003e",
    "author": "Aestas",
    "published": "Tue, 11 Jan 2022 19:52:45 +0000",
    "image": "https://aestasbookblog.com/wp-content/uploads/2021/11/JUNIPER-HILL-sm.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "fb8306e8-f4e6-4954-ad5d-67755fb63b5e",
    "title": "The Biggest Literary News of the Week",
    "link": "https://bookriot.com/today-in-books-january-19-2025/",
    "description": "The women accusing Neil Gaiman of sexual assault speak out, the most anticipated list of most-anticipated books, a new romance store, and more.",
    "author": "Rebecca Joines Schinsky",
    "published": "Sun, 19 Jan 2025 16:00:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/01/the-hands-of-two-people-with-different-skin-tones-reading-books.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Today in Books"
    ]
  },
  {
    "id": "7d75c2c6-23e3-46b7-b666-b8ba052ab74f",
    "title": "Book Riot’s Deals of the Day for January 19, 2024",
    "link": "https://bookriot.com/book-riots-deals-of-the-day-for-january-19-2024-2/",
    "description": "A James Baldwin classic, Haruki Murakami, a foodie romance, a novel about high art and fascism, and more of today's best book deals",
    "author": "Deals",
    "published": "Sun, 19 Jan 2025 12:00:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/01/deals-11925.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Book Deals"
    ]
  }
]
