[
  {
    "id": "840d4d7a-efa6-4926-92c4-ee417ffac9c4",
    "title": "Max, Formerly Known as HBO Max, Launches New Black-and-White Logo and Color Palette, Evoking HBO Branding",
    "link": "https://variety.com/2025/digital/news/max-changes-logo-black-and-white-hbo-1236352161/",
    "description": "It’s not HBO, it’s Max — but the new standalone logo for Warner Bros. Discovery’s streamer now certainly looks like HBO’s at a glance. The Max streaming service has quietly launched a fresh look, ditching its shiny blue user interface for a new monochrome color palette that, either purposefully or not, evokes the longtime branding […]",
    "author": "J. Kim Murphy",
    "published": "Sun, 30 Mar 2025 22:45:29 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/03/max-logo.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "HBO",
      "Max",
      "Warner Bros. Discovery"
    ]
  },
  {
    "id": "85952161-fb66-42b7-a5ed-a78a17653bbb",
    "title": "Carrie Coon Says Her ‘White Lotus’ Character Was Written to Have a Nonbinary Child, but That Scene Was Cut After Trump’s Election",
    "link": "https://variety.com/2025/tv/news/carrie-coon-white-lotus-cut-trans-scene-1236352137/",
    "description": "“The White Lotus” has gotten political during Season 3, with one viral scene that featured Kate (Leslie Bibb) declining to say whether she voted for Donald Trump or not, shocking her friends Jaclyn (Michelle Monaghan) and Laurie (Carrie Coon). But the interaction originally had a more loaded political context, shares Coon. The star recently told […]",
    "author": "Abigail Lee",
    "published": "Sun, 30 Mar 2025 20:25:51 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/02/carrie-coon.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Carrie Coon",
      "Mike White",
      "The White Lotus"
    ]
  },
  {
    "id": "fdc865f4-382f-406d-b974-a82a22900c79",
    "title": "Michael Mann Wishes ‘The Insider’ Was Appreciated a Bit More: ‘The Ambition of It Is the Challenge’",
    "link": "https://www.indiewire.com/news/general-news/michael-mann-the-insider-not-appreciated-enough-1235112080/",
    "description": "Though a box-office flop, the biographical thriller earned seven Academy Award nominations, including Best Picture, Best Director, and Best Actor for Russell Crowe.",
    "author": "Harrison Richlin",
    "published": "Sun, 30 Mar 2025 22:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "General News",
      "News",
      "Film",
      "Michael Mann",
      "The Insider"
    ]
  },
  {
    "id": "a3d721e8-d218-4346-a1e3-ce737d9c44f2",
    "title": "DGA President Believes Studios and Networks Producing Material ‘For a Cost’ Is Preventing Production from Returning to LA",
    "link": "https://www.indiewire.com/news/general-news/dga-president-studios-bring-production-back-to-la-1235112081/",
    "description": "\"We cannot lose and not support the labor that has built Hollywood. The studios and networks need to be part of that solution,\" said director Lesli Linka Glatter in a recent interview with The Hollywood Reporter.",
    "author": "Harrison Richlin",
    "published": "Sun, 30 Mar 2025 20:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "General News",
      "News",
      "DGA",
      "Film",
      "Lesli Linka Glatter",
      "Los Angeles",
      "TV"
    ]
  },
  {
    "id": "6d68aa13-0c4b-4631-904a-2017d7c0f9db",
    "title": "The Georgie Scene That Made Young Sheldon's Lance Barber Extremely Emotional",
    "link": "https://www.slashfilm.com/1811446/lance-barber-emotional-georgie-scene-young-sheldon/",
    "description": "Lance Barber had his fair share of emotional moments as George on Young Sheldon, but it was a moment with Georgie that sparked the waterworks.",
    "author": "Kieran Fisher",
    "published": "Sun, 30 Mar 2025 22:45:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/the-georgie-scene-that-made-young-sheldons-lance-barber-extremely-emotional/l-intro-1741995260.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Comedy Shows",
      "Drama Shows"
    ]
  },
  {
    "id": "0d4c78eb-10e6-4104-a8a6-74054b59ecb5",
    "title": "One Of The First Movies Released On DVD Was A '90s Disaster Classic",
    "link": "https://www.slashfilm.com/1819534/first-movies-released-dvd-disaster-classic-twister/",
    "description": "The DVD might feel omnipresent to younger /Film readers, but one of the first films released on DVD is so recent, it had a sequel in 2024.",
    "author": "Ryan Scott",
    "published": "Sun, 30 Mar 2025 22:20:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/one-of-the-first-movies-released-on-dvd-was-a-90s-disaster-classic/l-intro-1742948281.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Action \u0026 Adventure Movies",
      "Drama Movies",
      "Thriller Movies"
    ]
  },
  {
    "id": "a3ab2243-900f-4307-80ef-23c41d555607",
    "title": "Gina Gershon talks HIGH ROLLERS",
    "link": "https://www.aintitcool.com/gina-gershon-interview-killer-joe-showgirls-83609/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Actress Gina Gershon speaks with McEric about new film HIGH ROLLERS with John Travolta and cult classics SHOWGIRLS and KILLER JOE. Read the full article on AICN When I received an email asking me if I wanted to watch a brand new independent film starring John Travolta, Gina Gershon, and Lukas Haas, my first instinct was to say no. When I was told I might be able to interview Gina Gershon, I said sure, and watched Ives’ HIGH ROLLERS. What follows was my experience: This film isn’t good, you guys, but I did watch the whole thing, not only because I had to. It’s a caper, and once I get into a caper, I can’t walk away. I’ve got to know if and how they’ll pull it off. I think that’s universal. That said, this is not a good caper.    The film opens with Travolta as Mason with Gershon as Amy on a beautiful beach, looking out at the crystal blue water. They are gathered with their friends and team to watch two of their own tie the knot, but before they can both conclude their “I dos,” attack helicopters descend, accompanied by SUVS filled with masked mercenaries. They are held at gunpoint and Amy is taken. In a blink, the baddies are gone and the team is unharmed - you know, like mercenaries are wont to do. Next, Mason is giving chase in his muscle car in a poorly edited road piece, concluding in a crash that likely accounts for the film’s entire budget.This is followed by the team grouped around a table while Mason exposition dumps their accolades for the sake of the audience. They are contacted by Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 18 Mar 2025 19:24:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "dcb2ec5b-b236-4be6-9e04-a880d5f71aa6",
    "title": "New Releases - RAGING MIDLIFE and AMERICAN DREAMER",
    "link": "https://www.aintitcool.com/reviews-raging-midlife-american-dreamer-83608/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric reviews (new) releases RAGING MIDLIFE and AMERICAN DREAMER. Read the full article on AICN Hello all! McEric here with a quick review of two (new) releases hitting the market this St. Patrick's Day Weekend, both of which I actually enjoyed. RAGING MIDLIFE First was RAGING MIDLIFE, a movie that was pitched to me as starring Paula Abdul (I'm a massive fan), Eddie Griffin (DOUBLE TAKE), Walter Koenig (STAR TREK), and Motch O. Mann, the world's foremost Macho Man Randy Savage impersonator. Yeah, I hear it, too. Luckily, I didn't read any further. I saw Paula Abdul's name and shouted \"I'm in!\" Going in to this film blind is the best way to see it. As I'm furnishing you with a review, however, I must speak further to the film. If you want to skip down to AMERICAN DREAMER and go in blind, I do suggest it. Otherwise, here we go. The film, written by Nic Costa and Rob Taylor, and directed by the latter, follows childhood friends Alex and Mark, now in their midlives (see that?) who are chasing their dragon - a purple tanktop once worn by their favorite wrestler, Raging Abe. Raging Abe is a Macho Man Randy Savage-type character who wears a stove pipe hat and chin beard and lives by five \"proclamations,\" all meant to help his young fans navigate life and walk as better people. The film opens with grainy footage of a talk show appearance (think Arsenio Hall) from Raging Abe and his handler, Mary Todd, played by Abdul. The action opens in the eighties with young Alex and Mark ringside Finish the article on AICN",
    "author": "McEric",
    "published": "Sat, 15 Mar 2025 16:35:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "9c7b2599-9bdb-485b-a644-c74f0407c879",
    "title": "Judas and the Black Messiah 4K Review: Daniel Kaluuya Movie Is Still Great",
    "link": "https://www.comingsoon.net/movies/reviews/1947205-judas-and-the-black-messiah-4k-review",
    "description": "Judas and the Black Messiah is one of those films that you know is great upon your very first viewing. That’s why it was near-criminal that the historical drama centering on Fred Hampton and William O’Neal didn’t receive a 4K release when it came out in 2021. Instead, fans had to wait four extra years […] The post Judas and the Black Messiah 4K Review: Daniel Kaluuya Movie Is Still Great appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Tyler Treese",
    "published": "Mon, 31 Mar 2025 00:16:06 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/03/Judas-and-the-Black-Messiah-4K-review.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Movies",
      "4K Reviews",
      "Daniel Kaluuya",
      "Judas and the Black Messiah",
      "LaKeith Stanfield",
      "Movie Reviews",
      "shaka king"
    ]
  },
  {
    "id": "0e756d47-1606-4f90-88ce-a25fad735ad2",
    "title": "The Penguin Season 1 4K Review: DC’s Great \u0026 Gritty HBO Show",
    "link": "https://www.comingsoon.net/tv/reviews/1947201-the-penguin-season-1-4k-review-dc-hbo-show",
    "description": "DC and HBO’s The Penguin wowed viewers last year as the sequel series to 2022’s The Batman delivered a grounded and stellar look at Oswald Cobb’s rise of power. While a second season is looking less like the sure thing people expected following its critical and commercial success, The Penguin Season 1 4K release allows […] The post The Penguin Season 1 4K Review: DC’s Great \u0026 Gritty HBO Show appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Tyler Treese",
    "published": "Sun, 30 Mar 2025 23:32:28 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/03/The-Penguin-Season-1-4K-Review-DCs-Great-Gritty-HBO-Show.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "TV",
      "4K Reviews",
      "DC",
      "exclude_from_yahoo",
      "HBO",
      "The Penguin",
      "TV Reviews"
    ]
  },
  {
    "id": "f6a4ad20-2a08-4b8d-8e0c-ffac56545609",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "cc4edac2-2116-43c6-95f7-1f8aed576a2f",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "5dea612a-e9bd-4e79-bdb6-91b3ef40f634",
    "title": "WBD Rolls Out New Max Logo Color Scheme; Has Serious HBO Vibes",
    "link": "https://bleedingcool.com/tv/wbd-rolls-out-new-max-logo-color-scheme-has-serious-hbo-vibes/",
    "description": "In a follow-up to last month's report, Warner Bros. Discovery started rolling out the new Max logo color scheme, which has serious HBO vibes.",
    "author": "Ray Flook",
    "published": "Sun, 30 Mar 2025 18:45:07 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Max",
      "Movies",
      "TV",
      "HBO",
      "hbo max",
      "max"
    ]
  },
  {
    "id": "5353bbbf-0018-4a21-9a2e-7d0fdfff1bac",
    "title": "Downton Abbey: The Grand Finale Poster On Display At CinemaCon 2025",
    "link": "https://bleedingcool.com/movies/cinemacon-2025-downton-abbey-the-grand-finale-poster/",
    "description": "It is time to say goodbye. The poster for Downton Abbey: The Grand Finale is on display right now at CinemaCon 2025.",
    "author": "Jeremy Konrad",
    "published": "Sun, 30 Mar 2025 17:57:07 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Cinemacon",
      "Focus Features",
      "Movies",
      "CinemaCon 2025",
      "Downton Abbey: The Grand Finale"
    ]
  },
  {
    "id": "8b2d2358-2052-469d-9d9d-1e992c95925b",
    "title": "Very Loud Neighbors Thriller 'Restless' Trailer with Lyndsey Marshal",
    "link": "https://www.firstshowing.net/2025/very-loud-neighbors-thriller-restless-trailer-with-lyndsey-marshal/",
    "description": "\"They go all night, every night...\" 🔊 Quiver Distribution has debuted their official trailer for an indie film titled Restless from the UK, made by filmmaker Jed Hart as his feature directorial debut. This premiered at the 2024 Tribeca Film Festival last year, and it will be out to watch on VOD in the US starting in May this year. Described as a \"psychological thriller with shades of dark humor.\" Restless is the disquieting story of an empty nester whose quiet life is turned upside down when hard-partying – and potentially dangerous – new neighbors move in next door. A mild-mannered care worker's peaceful life shatters when a wild party animal moves in next door. As sleepless nights pile up, she finds herself in a battle of wills that tests her sanity. Will she reclaim her life, or will chaos consume her? Starring Lyndsey Marsha as Nicky and Aston McAuley as Deano, with Barry Ward, Kate Robbins, Denzel Baidoo, and Ciara Ford. Holy hell, this looks intense! I would freak out, too! I hope she figures out hot to get proper revenge on these raucous boys. Here's the official trailer (+ two posters) for Jed Hart's indie thriller Restless, direct from […]",
    "author": "Alex Billington",
    "published": "Sun, 30 Mar 2025 19:46:51 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/RestlessPartytrailerukmainimgTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Indies",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "054e452a-f220-4b62-866d-3e55392aca6c",
    "title": "Full Trailer for Crazy Midwest Indie Horror 'Dead Mail' Set in the 80s",
    "link": "https://www.firstshowing.net/2025/full-trailer-for-crazy-midwest-indie-horror-dead-mail-set-in-the-80s/",
    "description": "\"Tell me what delights you...\" Shudder has revealed their official trailer for the wacky, grainy indie horror film titled Dead Mail, created by Midwest filmmakers Joe DeBoer \u0026 Kyle McConaghy. This first premiered at the 2024 SXSW Film Festival a year ago (here's the festival teaser), and it also played at TIFF, FrightFest, Screamfest, Grimmfest, Night Visions, and the Splat!FilmFest last year. After a great fest run, it's ready for streaming on Shudder later in April. An ominous, bloody help note finds its way to the desk of a seasoned dead letter investigator at a 1980’s midwestern post office. As he begins to piece together the letter’s origins, it leads him down a violent, unforeseen path to a kidnapped keyboard engineer and his eccentric business associate. The film features Sterling Macer, Jr., John Fleck, Susan Priver, Micki Jackson, Tomas Boykin, and Nick Heyman. Reviews from fests have been quite positive: \"a gripping script and a fictional story that feels ripped from a viral Netflix doc [make] Dead Mail definitely worth hunting down.\" Worth a look based on this kind of effusive praise and also because it looks as totally crazy as a Park Chan-wook film. Here's the official trailer (+ […]",
    "author": "Alex Billington",
    "published": "Sun, 30 Mar 2025 19:04:49 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/DeadMailPostermain25rlsbigTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Horror",
      "Indies",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "7991a044-20b2-4383-b6cc-6116b3378d67",
    "title": "Trump Now Claims A Third Term “In A Way Is A Fourth Term” Because 2020 Was Rigged Against Him – Update",
    "link": "https://deadline.com/2025/03/trump-third-term-polls-nbc-1236354223/",
    "description": "UPDATE, 5:48 PM: Donald Trump seemed to joke around with gallows humor before about never leaving the White House now he’s back in power. Today, with some new math deployed, the current President of the United States started sounding like a President for life, for real. After phoning in to Meet the Press earlier Sunday […]",
    "author": "Dominic Patten",
    "published": "Mon, 31 Mar 2025 00:48:00 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/03/trump-march-30-af1-getty.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Politics",
      "Donald Trump",
      "George W. Bush",
      "Joe Biden",
      "MAGA",
      "Meet The Press",
      "NBC News"
    ]
  },
  {
    "id": "01f4d516-e695-4bdc-9a22-8556e713affc",
    "title": "Matthew Lillard On Being “Slightly Terrified” To Return To ‘Scream’ Franchise: “Hope I Don’t F It Up”",
    "link": "https://deadline.com/2025/03/matthew-lillard-scream-franchise-return-slightly-terrified-1236354326/",
    "description": "Ghostface might like a game of questions here and there, but actor Matthew Lillard is not playing about his return to the Scream franchise. Joining original castmates David Arquette, Jamie Kennedy, Dermot Mulroney and Skeet Ulrich earlier today at Hartford’s 90s Con held at the Connecticut Convention Center, Lillard spoke on a panel moderated by […]",
    "author": "Natalie Oganesyan",
    "published": "Mon, 31 Mar 2025 00:40:56 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/03/matthew.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Matthew Lillard",
      "Paramount",
      "Scream 7"
    ]
  }
]
