[
  {
    "id": "b7c455a1-5c25-48ef-b8af-d3da1401b012",
    "title": "Jeff Goldblum Bets Against ‘Jurassic World’ Return: ‘Dr. Ian Malcolm May Have Ridden Off Into the Sunset’",
    "link": "https://variety.com/2024/film/news/jeff-goldblum-finished-jurassic-park-dominion-reviews-1236177941/",
    "description": "Jeff Goldblum believes he’s faced off with his last dinosaur. In an interview with Total Film for the publication’s final issue, the actor shares that he thinks his “Jurassic Park” character, the celebrity mathematician Dr. Ian Malcolm, may be finished, as the franchise prepares to relaunch next summer with the release of “Jurassic World Rebirth,” […]",
    "author": "J. Kim Murphy",
    "published": "Tue, 15 Oct 2024 00:46:24 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/10/goldblum-jurassic.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Jeff Goldblum",
      "Jurassic Park",
      "Jurassic World Dominion"
    ]
  },
  {
    "id": "29bd51c8-c774-472c-8e2f-33d7e67dc5d2",
    "title": "Executives from Walmart, iHeartMedia and TalkShopLive Discuss the Secrets of Live Streaming and the Original Influencers",
    "link": "https://variety.com/2024/biz/news/advertising-week-executive-studio-variety-1236177859/",
    "description": "More highlights from Variety’s Executive Interview Studio, presented by Canva, during this year’s Advertising Week held in New York City. EVP of digital marketing at iHeartMedia Jeff Cucinell, sat down to reveal how they trust the personalities of iHeartRadio and how the early radio were, in fact, the first influencers. Meanwhile, Bryan Moore, CEO and co-founder […]",
    "author": "Emiliana Betancourt",
    "published": "Tue, 15 Oct 2024 00:35:04 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/10/2177662362.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Advertising Week Studio",
      "iHeart Radio",
      "Talk Shop Live",
      "Walmart"
    ]
  },
  {
    "id": "085d36a0-4f34-45b6-8891-c330bd7f0b71",
    "title": "‘Caddo Lake’ Twists Mystery, Loss, and Emotion Into an Affecting Thriller",
    "link": "https://filmschoolrejects.com/caddo-lake-review/",
    "description": "Give this film your complete attention (phones off!), and you won't be disappointed.",
    "author": "Rob Hunter",
    "published": "Fri, 11 Oct 2024 12:06:45 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Movies",
      "Reviews",
      "Caddo Lake",
      "Dylan O'Brien"
    ]
  },
  {
    "id": "672a34d2-db11-49d3-b571-5f8c47a285ed",
    "title": "‘Terrifier 3’ Is More of Exactly What You Think It Is, For Better and Worse",
    "link": "https://filmschoolrejects.com/terrifier-3-review/",
    "description": "And it's also the bloodiest, goriest, gnarliest entry in the Christmas horror subgenre, yet.",
    "author": "Rob Hunter",
    "published": "Fri, 11 Oct 2024 00:32:04 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Movies",
      "Reviews",
      "Christmas horror",
      "Horror",
      "terrifier"
    ]
  },
  {
    "id": "b5e02455-85b9-4972-8594-54375c572e72",
    "title": "Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE",
    "link": "https://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE Read the full article on AICN Snake Plotzkin, reporting from Fantastic Fest 2024, where I got to see the biographical documentary, The Life and Deaths of Christopher Lee. I’m a big fan of Hammer horror, and I will watch literally any Hammer film with Christopher Lee and Peter Cushing in it. One of my favorite Hammer films is Rasputin the Mad Monk, which, if you haven’t seen it, is one of Lee’s best performances. The gigantically tall Lee stalks around St. Peterburg as the mad monk, hypnotizing women, seducing them, and then yelling at them to get out of his room and leave their money on the bed. It’s amazing.  If The Life and Deaths of Christopher Lee had been made up completely of anecdotes about Christopher Lee and Peter Cushing on the Hammer films, I would honestly have been very satisfied with it. But the movie unexpectedly goes much further, revealing not just another side of the actor, but multiple facets. For instance, did you know that Christopher Lee fought Nazis? That he may have been the inspiration for James Bond (which was written by his cousin)? That he released two heavy metal albums? Well, this movie goes where no marionette-narrated biopic has gone before, using a mix of interviews, animation, and puppetry to bring Christopher Lee to life (the man himself passed away in 2015). Yes, I said puppetry. The movie is narrated by a marionette of Christopher Lee – who, in an uncanny imitation of Lee’s sonorous voice (played by Peter Szymon Serafinowicz, an English actor Finish the article on AICN",
    "author": "staff",
    "published": "Sat, 05 Oct 2024 14:56:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "eb24819c-ea77-45f8-b4b7-da1417f519e0",
    "title": "STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024!",
    "link": "https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews",
    "description": "STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024! Read the full article on AICN Hey friends. Barbarella here. Strange Harvest: The Occult Murder in the Inland Empire is a long title for a great narrative utilizing the true-crime documentary format. The format proves so effective at tricking my brain into thinking I’m watching actual footage of crime scenes and caught-on-tape moments that I had to occasionally remind myself to relax, it’s only a movie.  It made its world premiere at Fantastic Fest 2024 on September 22, 2024 at 11:50 p.m. CT, and I had the delightful opportunity to sit down with genre director Stuart Ortiz, and actors Peter Zisso and Terri Apple in Austin last week. Check it out! Barbara: I'm one of these people that I can watch the most gruesome stuff in movies, and it doesn't bother me, heads getting drilled and stuff. Peter: Bless You.  Barbara: But it really upsets me to see people getting hurt, even these skateboarding videos and such, and this movie messed with my brain because I knew it’s fictional, but my brain got tricked into thinking it was real at times because the way it was done. I'm very impressed with the effectiveness of that.  Stuart: Thank you.   Barbara: Why do this in a true crime format? What were you going for?  Stuart: I just think it's a really interesting way to tell a story, and in particular to tell a horror story because it just allows you to have this vantage point that you don't normally have with horror, to investigate certain details or aspects of a horror story that you wouldn't focus on necessarily in a more conventional story. I Finish the article on AICN",
    "author": "Barbarella",
    "published": "Sat, 05 Oct 2024 02:02:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "a31dc169-0140-47af-beed-4632913b3244",
    "title": "A Notorious Hollywood Producer Wanted Daniel Day-Lewis In Pulp Fiction",
    "link": "https://www.slashfilm.com/1688025/hollywood-producer-harvey-weinstein-daniel-day-lewis-pulp-fiction/",
    "description": "Had Pulp Fiction's most infamous producer gotten their way, Quentin Tarantino's movie would've featured Daniel Day-Lewis in a major lead role.",
    "author": "Nina Starner",
    "published": "Mon, 14 Oct 2024 22:45:58 +0000",
    "image": "https://www.slashfilm.com/img/gallery/a-notorious-hollywood-producer-wanted-daniel-day-lewis-in-pulp-fiction/l-intro-1728934954.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Movie News",
      "Comedy Movies",
      "Drama Movies"
    ]
  },
  {
    "id": "b1fd4b40-f58c-41bc-91fa-94c5c79c8e3c",
    "title": "The One Line That Even The Terrifier Movies Won't Cross",
    "link": "https://www.slashfilm.com/1688123/terrifier-movies-wont-cross-one-line/",
    "description": "The Terrifier movies are full of extreme gore and shocking kills, but there's one place even creator Damien Leone won't take the horror franchise.",
    "author": "Ryan Scott",
    "published": "Mon, 14 Oct 2024 21:45:28 +0000",
    "image": "https://www.slashfilm.com/img/gallery/the-one-line-that-even-the-terrifier-movies-wont-cross/l-intro-1728942810.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Horror Movies"
    ]
  },
  {
    "id": "8dd7857b-17c0-4848-99c4-3ea02f1b1b81",
    "title": "What Happened to IShowSpeed After Backflip Challenge? Health Update",
    "link": "https://www.comingsoon.net/guides/news/1863516-ishowspeed-backflip-challenge-paralysed-health-update",
    "description": "IShowSpeed is making waves after a challenging attempt to break a world record left him temporarily paralysed. His ambitious goal of completing over 1,000 backflips in 24 hours came to an abrupt halt, sparking concern and curiosity among his fans. After several days offline, Speed returned to explain what happened and how the extreme challenge […] The post What Happened to IShowSpeed After Backflip Challenge? Health Update appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Vritti Johar",
    "published": "Mon, 14 Oct 2024 21:31:19 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/10/MixCollage-10-Oct-2024-06-42-AM-3044_dcd8b9.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "FAQ",
      "FAQ Pop Culture",
      "IShowspeed"
    ]
  },
  {
    "id": "02b294d7-e47c-4e71-9dc7-41d4f352dfa7",
    "title": "Why Did Adin Ross Cancel Lieutenant Dan’s Kick Deal?",
    "link": "https://www.comingsoon.net/guides/news/1863508-why-did-adin-ross-cancel-kick-deal-lt-dan-explained",
    "description": "Adin Ross cancels Kick deal for Lt. Dan, redirects to Tampa Terrence. Discover why in this unfolding story! The post Why Did Adin Ross Cancel Lieutenant Dan’s Kick Deal? appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Vritti Johar",
    "published": "Mon, 14 Oct 2024 21:16:47 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/10/MixCollage-15-Oct-2024-08-13-AM-3830.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "FAQ",
      "FAQ Pop Culture"
    ]
  },
  {
    "id": "a9805fd7-821a-481f-8b48-06274ee8270f",
    "title": "‘Shrinking’ Season 2 Release Schedule: When Do New Episodes Arrive?",
    "link": "https://deadline.com/2024/10/shrinking-season-2-release-schedule-1236115887/",
    "description": "Get ready for some more “Jimmying” as Shrinking Season 2 starts to unfold on Apple TV+ this week. The second season of the comedy from creators Bill Lawrence, Jason Segel and Brett Goldstein will pick up where Season 1 left off, with some messes to clean up involving Jason Segel’s Jimmy Laird, Jessica Williams’ Gaby […]",
    "author": "Dessi Gomez",
    "published": "Tue, 15 Oct 2024 00:53:27 +0000",
    "image": "https://deadline.com/wp-content/uploads/2024/10/Shrinking_Photo_010803.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Apple TV+",
      "Brett Goldstein",
      "Harrison Ford",
      "Jason Segel",
      "Shrinking"
    ]
  },
  {
    "id": "8c6cac8c-f78f-48cb-86df-7810c09db231",
    "title": "New On Hulu In October 2024: Daily Streaming Schedule For TV, Movies \u0026 More",
    "link": "https://deadline.com/feature/new-on-hulu-streaming-1234823120/",
    "description": "Hulu‘s October, 2024 schedule has a wealth of originals, catalog titles and plenty of holiday offerings. Films to help get one in the mood for Halloween and spookey season include thrillers like Barbarian and Edward Scissorhands, horrors like Ma, The Purge, horror comedies like Ready or Not and The Rocky Horror Picture Show andThe Curse of […]",
    "author": "tomt",
    "published": "Tue, 15 Oct 2024 00:27:30 +0000",
    "image": "https://deadline.com/wp-content/uploads/2024/09/Abbott-Elementary-.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Hulu",
      "November 2021",
      "Schedule",
      "Streaming",
      "TV News"
    ]
  },
  {
    "id": "a4c09b36-afd0-44d8-b1d3-d8639c50afc6",
    "title": "Mahershala Ali’s Long Lost Film Debut Will Finally Be Released Almost 25 Years Later — Watch Trailer",
    "link": "https://www.indiewire.com/news/trailers/taste-the-revolution-trailer-mahershala-ali-lost-film-debut-1235056878/",
    "description": "Colin Trevorrow executive produces and co-stars in the political satire film \"Taste the Revolution,\" which was shelved in 2001 after 9/11.",
    "author": "Samantha Bergeson",
    "published": "Mon, 14 Oct 2024 22:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "News",
      "Trailers",
      "Colin Trevorrow",
      "Film",
      "Mahershala Ali",
      "Taste the Revolution"
    ]
  },
  {
    "id": "b4a2f851-a027-495b-ad45-7fe02ba24fe6",
    "title": "2025 Oscars: Best Documentary Feature Predictions",
    "link": "https://www.indiewire.com/awards/predictions/2025-oscars-best-documentary-feature-predictions-1235034356/",
    "description": "Coming off of Critics Choice Documentary Awards nominations, Netflix and National Geographic have some of the strongest Best Documentary Feature Oscar contenders.",
    "author": "Marcus Jones",
    "published": "Mon, 14 Oct 2024 22:15:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Awards",
      "Predictions",
      "Academy Awards",
      "Best Documentary Feature",
      "Film",
      "Oscar predictions",
      "Oscars"
    ]
  },
  {
    "id": "8ed9de7c-ba93-459a-aa29-08207bd1265e",
    "title": "Joker: Folie À Deux Hits Digital Platforms On October 29th",
    "link": "https://bleedingcool.com/movies/joker-folie-a-deux-hits-digital-platforms-on-october-29th/",
    "description": "After underperforming critically and commercially, Joker: Folie À Deux will be released on digital platforms on October 29th.",
    "author": "Kaitlyn Booth",
    "published": "Mon, 14 Oct 2024 19:33:07 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Joker",
      "Movies",
      "Warner Bros",
      "Joker: Folie à Deux"
    ]
  },
  {
    "id": "4ec8d79b-69cc-44ee-8310-6768d9926e0a",
    "title": "Jesse Eisenberg Says Now You See Me 3 \"Is Really Astounding\"",
    "link": "https://bleedingcool.com/movies/jesse-eisenberg-says-now-you-see-me-3-is-really-astounding/",
    "description": "Now You See Me 3 is finally emerging from development hell next year, and star Jesse Eisenberg says the film \"is really astounding.\"",
    "author": "Kaitlyn Booth",
    "published": "Mon, 14 Oct 2024 16:32:07 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Lionsgate",
      "Movies",
      "now you see me 3"
    ]
  },
  {
    "id": "14a5ff0d-8442-483e-be7f-d05477cc2d93",
    "title": "Trailer for 'Yintah' Doc - Indigenous Women Fight to Save Their Land",
    "link": "https://www.firstshowing.net/2024/trailer-for-yintah-doc-indigenous-women-fight-to-save-their-land/",
    "description": "\"You are trespassing!\" Netflix has revealed an official trailer for a documentary film called Yintah, which is the word for \"land\" in this tribe's language. This premiered at the True/False Film Festival earlier this year and has played at a number of other prestigious fests in 2024. The film focuses on the impact on the lives of the Wet'suwet'en people who live on unceded territory (in Canada), as they push back against and oppose the construction of multiple pipelines. Yintah is \"about an anti-colonial resurgence—a fierce \u0026 ongoing fight for Indigenous and human rights in the face of a colonial government committed to seizing lands at gunpoint.\" Canada has authorized fossil fuel giants to build pipelines across Wet'suwet'en land. The result: a decade long clash between Wet'suwet'en land defenders and Canadian police seeking to seize Wet'suwet'en land at gunpoint. The story is about two Indigenous women and other land defenders fighting to hold onto their land. Looks like an empowering and vitally important doc spending time with the real people involved. Here's the official trailer (+ poster) for Toledano \u0026 Wickham ...",
    "author": "Alex Billington",
    "published": "Mon, 14 Oct 2024 21:07:00 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/YintahPostermainimagebigTsr01.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Documentaries",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "e66abfae-04e9-480e-bb24-9de51c41bcbe",
    "title": "Watch: Vibrant Animated Music Video for 'Dark Mystery Enigma Bird'",
    "link": "https://www.firstshowing.net/2024/watch-vibrant-animated-music-video-for-dark-mystery-enigma-bird/",
    "description": "\"I am that mystery enigma bird, that resolved itself out from the weird...\" Yet another trippy, entrancing animated music video to enjoy as part of our short film collection. This is another fun discovery! Made by an animation filmmaker from Montreal for a band from Montreal called Nap Eyes, this super weird super fun music video is worth a watch. \"Dr. Cool\", as he calls himself, created this hand-drawn music video for the Nap Eyes' song \"Dark Mystery Enigma Bird\" off of their new album out this month. It starts out with a group of horses going on a joy ride when the truck they're standing in rolls down a hill and takes them into the mountains and around the hills. As usual with these music videos, all kinds of weird things happen. Dr. Cool jokes in his intro: \"I shoulda made it so the horses roll back down the hill in the final scene but at some point you just gotta stop working on the video!\" Ahaha love it. I'm always a fan of these kind of super wacky ...",
    "author": "Alex Billington",
    "published": "Mon, 14 Oct 2024 20:20:22 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/NapeyesDarkenigmaMVmainTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Animation",
      "Short Film",
      "To Watch"
    ]
  }
]
