[
  {
    "id": "0c378c47-8c38-4488-a3f5-31c21c2da764",
    "title": "Disney’s Dana Walden on New Ways to Reach Kids, Streaming Growth, International Expansion and What’s Next for ‘Shogun’",
    "link": "https://variety.com/2025/tv/news/disney-dana-walden-kids-streaming-international-shogun-1236327705/",
    "description": "Disney is looking at new ways to engage young fans, Dana Walden told the Morgan Stanley Technology, Media and Telecom Conference on Tuesday. Walden, the co-chairman of Disney Entertainment at the Walt Disney Co., told media analyst Ben Swinburne that the company is aiming to target kids and young families on the social media platforms […]",
    "author": "Varietyschneider",
    "published": "Wed, 05 Mar 2025 01:05:45 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/11/Dana-Walden_395x395-1024x1024-1-e1730749884306.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Dana Walden",
      "Morgan Stanley",
      "Walt Disney Co."
    ]
  },
  {
    "id": "acdf3a7e-00e2-4fee-b90b-d6e305cc27cf",
    "title": "Neil Gaiman Says Rape Accuser Is ‘Fantasist’ and Produces Texts to Refute Claim",
    "link": "https://variety.com/2025/tv/news/neil-gaiman-scarlett-pavlovich-text-messages-rape-fantasist-1236327576/",
    "description": "“The Sandman” author Neil Gaiman fired back at his former babysitter on Tuesday, calling her a “fantasist” and producing WhatsApp messages that he says refute her sexual abuse claims. Gaiman and his estranged wife, Amanda Palmer, were sued in federal court last month for alleged sexual assault and trafficking. The plaintiff, Scarlett Pavlovich, had previously […]",
    "author": "Gmaddaus",
    "published": "Tue, 04 Mar 2025 23:26:52 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/01/neil-2.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Neil Gaiman",
      "Scarlett Pavlovich"
    ]
  },
  {
    "id": "ea727802-9dfb-4d71-b8ea-d0cd16da9d1d",
    "title": "How To Watch Donald Trump’s Address To Joint Session Of Congress Online \u0026 On TV",
    "link": "https://deadline.com/2025/03/trump-address-joint-session-of-congress-how-to-watch-1236310106/",
    "description": "President Donald Trump will conduct an address to a joint session of Congress on Tuesday, March 4, 2025, providing a summary of his first weeks in his second term in office. It comes on the heels of Trump’s contentious sit-down with Ukrainian President Volodymyr Zelensky last week, and his administration today imposing trade tariffs on […]",
    "author": "Dessi Gomez",
    "published": "Wed, 05 Mar 2025 01:05:11 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/03/GettyImages-2201833478.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Politics",
      "Donald Trump",
      "Media"
    ]
  },
  {
    "id": "72b17e89-59f8-4afc-a4ec-8d01e2c6256f",
    "title": "Robert Pattinson On ‘The Batman II’ Delay: “I’m Going To Be F***ing Old Batman By The Sequel”",
    "link": "https://deadline.com/2025/03/robert-pattinson-the-batman-2-delays-1236311143/",
    "description": "Time is ticking and no one is getting any younger and Robert Pattinson is well aware of that. The actor is set to reprise his role of the Dark Knight in The Batman II, which has been in development for quite some time and is due to hit theaters in 2027. Pattinson is seemingly anxious […]",
    "author": "Armando Tinoco",
    "published": "Wed, 05 Mar 2025 00:50:00 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/03/robert-pattinson-the-batman-sequel.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Robert Pattinson",
      "The Batman",
      "The Batman II"
    ]
  },
  {
    "id": "2bbf556a-c979-4e0a-b186-b533137cf40f",
    "title": "Pierce Brosnan's Final James Bond Performance Wasn't What You Think",
    "link": "https://www.slashfilm.com/1800697/pierce-brosnan-final-james-bond-007-performance-everything-or-nothing/",
    "description": "A full year after Pierce Brosnan's last outing as James Bond in Die Another Day, he reappeared in the role in a very different medium.",
    "author": "Jeremy Smith",
    "published": "Tue, 04 Mar 2025 22:45:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/pierce-brosnans-final-james-bond-performance-wasnt-what-you-think/l-intro-1740614423.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Action \u0026 Adventure Movies"
    ]
  },
  {
    "id": "d375733e-a984-4ff5-ae25-6a0f895a980d",
    "title": "Why Beth Dutton Had To Kill Jamie In Yellowstone, According To A Producer",
    "link": "https://www.slashfilm.com/1800685/why-beth-dutton-killed-jaime-yellowstone-producer/",
    "description": "The shocking end of Yellowstone brought Beth and Jamie Dutton's rivalry to a head, but according to one producer, this was always how it would end.",
    "author": "Nick Staniforth",
    "published": "Tue, 04 Mar 2025 22:00:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/why-beth-dutton-had-to-kill-jamie-in-yellowstone-according-to-a-producer/l-intro-1740613112.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Drama Shows"
    ]
  },
  {
    "id": "e5f78105-3570-4711-9397-71dd67644944",
    "title": "Director Simon West and Star Lucy Liu Talk OLD GUY",
    "link": "https://www.aintitcool.com/simon-west-lucy-liu-interview-old-guy-mceric-83606/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Director Simon West and star Lucy Liu talk OLD GUY, starring Christoph Waltz, now streaming everywhere! Read the full article on AICN Director Simon West should be a household name; his first film was a little picture from 1997 called CON AIR. Perhaps you've heard of it? He went on to helm similar big budget action extravaganzas, such as 2001's LARA CROFT: TOMB RAIDER and 2012's THE EXPENDABLES 2. Eventually, however, time and changing tastes caught up with West, and now he's directing smaller budget flicks, from action to drama, that move at a slightly slower pace and appeal to a different audience.  The same could be said for Danny Dolinski, the titular OLD GUY of West's latest feature, played by Academy-Award Winner Christoph Waltz (INGLORIOUS BASTERDS, THE GREEN HORNET). Danny's a wetworks expert in a field saturated with hot young assassins, desperately trying to prove he's still relevant, often to his detriment. After recovering from a wrist injury that found him relegated to a cleaner role at a local bakery, Danny is itching to get back in the field. When he's told the only role available is support for young assassing Wihlborg (Cooper Hoffman), he is understandably unenthused. He invites his longtime friend Anata (Lucy Liu) along for their job since it'll take them to some charming locations around Europe, and once underway, tries to take point on every hit. Things don't go as planned. As you can probably already divine, there are so many parallels between Waltz's OLD GUY and West's career. Danny was once the best, the biggest game in town, and his name still opens doors... but the game has Finish the article on AICN",
    "author": "McEric",
    "published": "Wed, 26 Feb 2025 20:15:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "9f4fc187-3357-4abb-a59d-aeddf152251e",
    "title": "Julianna Margulies and Gretchen Mol Talk MILLERS IN MARRIAGE",
    "link": "https://www.aintitcool.com/interview-julianna-margulies-gretchen-mol-mceric-83605/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Julianna Margulies and Gretchen Mol Talk MILLERS IN MARRIAGE, Edward Burns' latest with Eric McClanahan Read the full article on AICN Edward Burns made quite the impression after winning the Best Picture prize at the Sundance Film Festival with his 1995 masterpiece THE BROTHERS MCMULLEN, signifying the emergence of a new and singular voice. The plot synopsis for the film was \"Three Irish Catholic brothers from Long Island struggle to deal with love, marriage, and infidelity.\" Now, thirty years later, Burns has returned with a new vision, MILLERS IN MARRIAGE, with the plot synopsis sounding vaguely familiar - \"Three Irish Catholic siblings from New York struggle to deal with love, marriage, and infidelity.\" What can I say? Dude's got range. However, I'm not here to say that Edward Burns is a one-trick pony or that MILLERS IN MARRIAGE is recycled and tired. Truth is, I really liked this movie. The cast is impeccable and the narrative kept me interested, even when I thought some plot points were a bit contrived or predictable. Burns crafts characters that we want to care about, even if they're narcissistic, self-destructive, manipulative, or just plain wrong. Burns' gift of character and dialogue is that we are drawn into the maw of the devouring devils of his narratives.  This film is no different. Following the Miller siblings, Andy (Burns), Maggie (Julianna Margulies), and Eve (Gretchen Mol), and their orbiting cadre of lovers. Andy is a painter, fresh off a separation from his wife Tina (Morena Baccarin) and now dating one of her former colleagues Renee (Minnie Driver). Maggie is an active novelist married to inert novelist Nick (Campbell Scott), Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 25 Feb 2025 01:43:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "de87e152-8858-43b7-b83d-d5779fa5abd3",
    "title": "Is There a With Love, Meghan Episode 9 Release Date \u0026 Time?",
    "link": "https://www.comingsoon.net/guides/news/1931541-is-there-a-with-love-meghan-season-1-episode-9-release-date-time",
    "description": "Viewers are wondering if there’s a With Love, Meghan Season 1 Episode 9 release date and time. The much-awaited reality series hosted by Meghan, Duchess of Sussex is finally here. Following the release of Episode 8, fans are now wondering if more episodes of the debut season are on the horizon. So, here’s all you […] The post Is There a With Love, Meghan Episode 9 Release Date \u0026 Time? appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Namrata Ghosh",
    "published": "Wed, 05 Mar 2025 01:04:41 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/03/MixCollage-05-Mar-2025-06-25-AM-8260.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Entertainment",
      "exclude_from_yahoo",
      "Is There a Release Date",
      "With Love Meghan",
      "With Love Meghan Season 1"
    ]
  },
  {
    "id": "cdfcdadb-4f05-4f9b-997f-998cc13cfe36",
    "title": "Wheel of Fortune Bonus Puzzle Answer Today for March 3-7, 2025",
    "link": "https://www.comingsoon.net/guides/features/1930934-wheel-of-fortune-bonus-puzzle-march-3-7-2025-today-answer-tonight",
    "description": "The puzzle solutions for the first week of March 2025. The post Wheel of Fortune Bonus Puzzle Answer Today for March 3-7, 2025 appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Nicholas Tan",
    "published": "Wed, 05 Mar 2025 00:51:07 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/03/wheel-of-fortune-bonus-puzzle-answer-tonight-today-march-2025-round.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "ABC",
      "ABC Guides",
      "Evergreen",
      "Game Show",
      "Ryan Seacrest",
      "Sony Pictures",
      "Vanna White",
      "Wheel of Fortune"
    ]
  },
  {
    "id": "eaea62bd-6bf9-46b5-a8dd-0f93123960cb",
    "title": "The 17 Best Thrillers Streaming on Netflix in March, from ‘Fair Play’ to ‘Emily the Criminal’",
    "link": "https://www.indiewire.com/feature/best-thrillers-netflix-1234703006/",
    "description": "There are many bad thrillers on the streamer, but you can dig into the best of the genre if you know where to look.",
    "author": "",
    "published": "Wed, 05 Mar 2025 00:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Best Of",
      "Features",
      "Film",
      "Netflix",
      "Thriller"
    ]
  },
  {
    "id": "1626cb6d-468b-4836-970b-86b2fe6a19d9",
    "title": "Amanda Seyfried Hints ‘Jennifer’s Body 2’ Is in the Works: ‘I Think We’re Making Another One’",
    "link": "https://www.indiewire.com/news/general-news/amanda-seyfried-teases-jennifers-body-2-1235100915/",
    "description": "Diablo Cody, who wrote the 2009 film, first championed a sequel idea in 2024.",
    "author": "Samantha Bergeson",
    "published": "Tue, 04 Mar 2025 23:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "General News",
      "News",
      "Amanda Seyfried",
      "Diablo Cody",
      "Film",
      "Jennifer's Body",
      "Jennifer's Body 2"
    ]
  },
  {
    "id": "77ba462f-a9c4-4255-b45a-a2ceb82ec7c0",
    "title": "Amazing First Teaser for Japan's 'Bullet Train Explosion' New Reboot",
    "link": "https://www.firstshowing.net/2025/amazing-first-teaser-for-japans-bullet-train-explosion-new-reboot/",
    "description": "\"I will never stop it.\" Netflix has revealed a fantastic teaser trailer for an action thriller movie from Japan titled Bullet Train Explosion, arriving to watch pretty soon in April. This is a surprise remake / reboot of the 1975 Japanese action classic Bullet Train, which many action filmmakers have been influenced by. It's the brand new modern Japanese update like Shin Godzilla, and yep, it's even directed by the same guy who co-directed Shin Godzilla, and made the most recent Shin Ultraman. When panic erupts on a Tokyo-bound bullet train (known as Shinkansen) planted with a bomb that will explode if it slows below 100 km/h, the authorities race against time to save everyone. There's also an superb new poster showing Takaichi standing before the burning Hayabusa No. 60 train, capturing the extreme tension. Starring Tsuyoshi Kusanagi, with Kanata Hosoda, Non, Jun Kaname, Machiko Ono, Hana Toyoshima, and Daisuke Kuroda. This has some incredible footage, modernizing it in a captivating way - with so much attention from viewers and extremely fast bullet trains. I gotta admit - as a train geek, I cannot wait to watch this. A perfect teaser. Here's the first teaser trailer for Shinji Higuchi's film […]",
    "author": "Alex Billington",
    "published": "Wed, 05 Mar 2025 00:41:02 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/bullettrainexplosionposterbigTsr1.jpg?quality=96",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Foreign Films",
      "Streaming",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "b3ddcc59-a556-4ca4-bf8b-8af3d84a6522",
    "title": "Explosive Trailer for Intense Action Comedy Film 'Zero' Set in Senegal",
    "link": "https://www.firstshowing.net/2025/explosive-trailer-for-intense-action-comedy-film-zero-set-in-senegal/",
    "description": "\"If you want to live - RUN!\" Whoa! Don't miss this one. Well Go USA has revealed an official trailer for the action thriller film from Africa titled Zero, the latest creation of director Jean Luc Herbulot. It debuted at Beyond Fest and the Sitges Film Festival last year (read my review) and it will be dropping in US theaters and on VOD this April to watch. This has such a bold \u0026 crazy concept! Two American strangers searching for purpose in the city of Dakar, Senegal, wake up with bombs strapped to their chests, counting down from ten hours. Controlled by a mysterious voice on a phone (Willem Dafoe), they must complete a series of chaotic missions with devastating consequences. As the city erupts in protest against Western influences, the two confused men race for redemption. ZER0 is a thrilling, darkly humorous tale of survival, connection, and the human search for meaning. Starring Hus Miller, Cam McHarg, Gary Dourdan, Roger Sallah, and Moran Rosenblatt. Even if it's a little rough around the edges, this is still so rad - a \"cool, inventive, and very kinetic action thriller.\" A new one from the same guy behind Saloum! And it's definitely […]",
    "author": "Alex Billington",
    "published": "Tue, 04 Mar 2025 21:27:11 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/ZeroSenegalPostermainbigTsr1.jpg?quality=96",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "65edb926-656b-45eb-b569-ce04a72ef611",
    "title": "Descendants: The Rise Of Red Sequel Adds New VKs To Cast",
    "link": "https://bleedingcool.com/tv/disney-descendants-5-rise-of-red-4-new-vks-cast/",
    "description": "Four more new VKs have been cast in the next \"Descendants\" film, which is heading into production soon. Get excited, \"The Rise of Red\" fans!",
    "author": "Jeremy Konrad",
    "published": "Tue, 04 Mar 2025 16:07:07 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Disney+",
      "Movies",
      "TV",
      "descendants",
      "Descendants 5",
      "Rise of Red"
    ]
  },
  {
    "id": "3f26af7c-9ac3-4b39-8af4-d6fcd8e17e4f",
    "title": "The Odyssey: Cosmo Jarvis Has Joined The Cast As Filming Continues",
    "link": "https://bleedingcool.com/movies/the-odyssey-cosmo-jarvis-has-joined-the-cast-as-filming-continues/",
    "description": "Filming on The Odyssey has kicked off in Morocco, but the cast continues to grow. Cosmo Jarvis is the latest to join the cast.",
    "author": "Kaitlyn Booth",
    "published": "Tue, 04 Mar 2025 15:17:06 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Universal",
      "the odyssey"
    ]
  },
  {
    "id": "19744fa5-045a-4ac9-9b25-e3e334dc3c56",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "3029a413-6577-4b85-8e1a-e820ef8ec82d",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  }
]
