[
  {
    "id": "f2826403-5ebb-4311-9c33-0425291dbed7",
    "title": "Andrew Scott Passed a Kidney Stone at the 2020 SAG Awards Right as Laura Dern Won, Left the Ceremony in an Ambulance With No One Knowing",
    "link": "https://variety.com/2025/film/news/andrew-scott-passed-kidney-stone-at-2020-sag-awards-laura-dern-won-left-in-ambulance-1236317111/",
    "description": "Andrew Scott is feeling good at tonight’s SAG Awards. But the same can’t be said for the first time the “Ripley” actor was at the ceremony back in 2020 when he passed a kidney stone on the same night he was nominated for his role in “Fleabag.” “I was beside Phoebe [Waller-Bridge] and Laura Dern […]",
    "author": "Matthew Minton",
    "published": "Mon, 24 Feb 2025 00:47:24 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/02/Andrew-Scott-SAG-Awards.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Andrew Scott",
      "Laura Dern",
      "Ripley",
      "SAG Awards"
    ]
  },
  {
    "id": "f00fce06-a149-423b-9a8f-07a634f38f1e",
    "title": "SAG Awards 2025 Winners List (Updating Live): ‘Shōgun’ and ‘The Fall Guy’ Win Stunt Awards",
    "link": "https://variety.com/2025/film/news/sag-awards-winners-2025-1236313200/",
    "description": "The 2025 Screen Actors Guild Awards are underway Sunday night, one week before the Oscars crown its winners. Universal’s Broadway adaptation “Wicked” and FX/Hulu’s Japanese drama “Shogun” led the film and TV categories with five nominations each at the SAG Awards. Tying for the most film nominations in SAG history, “Wicked” earned nods for its […]",
    "author": "Jordan Moreau",
    "published": "Mon, 24 Feb 2025 00:36:30 +0000",
    "image": "https://variety.com/wp-content/uploads/2024/05/Shogun-finale-Blackthorne-Toranaga.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "SAG Awards",
      "Wicked"
    ]
  },
  {
    "id": "a7a40772-09dd-4d91-8703-dae11b725c06",
    "title": "Why George Sr. Was The One Who Took Sheldon To Caltech In Young Sheldon",
    "link": "https://www.slashfilm.com/1791993/why-george-sr-took-sheldon-caltech-young-sheldon/",
    "description": "Sheldon Cooper has almost wholly negative feelings about his father on The Big Bang Theory, but he changes his tune a bit on Young Sheldon.",
    "author": "Danielle Ryan",
    "published": "Sun, 23 Feb 2025 23:45:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/why-george-sr-was-the-one-who-took-sheldon-to-caltech-in-young-sheldon/l-intro-1739833929.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Comedy Shows"
    ]
  },
  {
    "id": "915d45d1-5404-475e-8f22-caf03a8c87fa",
    "title": "The 1923 Season 2 Premiere Continues Yellowstone's Most Unnecessary Trend",
    "link": "https://www.slashfilm.com/1796650/1923-season-2-premiere-continues-yellowstone-unnecessary-trend/",
    "description": "The 1923 Season 2 premiere sets up some compelling storylines. It also, unfortunately, continues perhaps the Yellowstone franchise's worst trend.",
    "author": "Kieran Fisher",
    "published": "Sun, 23 Feb 2025 22:45:09 +0000",
    "image": "https://www.slashfilm.com/img/gallery/the-1923-season-2-premiere-continues-yellowstones-most-unnecessary-trend/l-intro-1740164203.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Drama Shows"
    ]
  },
  {
    "id": "8fa1feb7-c86f-4771-b349-b53f6b25944c",
    "title": "Spider One's New Flick LITTLE BITES Releases on Physical Media and SHUDDER This Week",
    "link": "https://www.aintitcool.com/little-bites-interviews-spider-one-krsy-fox-mceric-83604/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Writer/Director Spider One and star Krsy Fox speak with McEric about their new film LITTLE BITES, releasing on physical media Tuesday 2/18 and streaming on SHUDDER Friday 2/21. Read the full article on AICN Parenthood is sacrifice, and that is the message behind the latest horror film from filmmaker Michael Cummings, aka Spider One of Powerman 5000, aka Rob Zombie's brother. As he puts it in his director's statement: \"In the film, Mindy’s relationship with her monster, Agyar, is clearly my allegory for parenthood. His bites are her pain. His words are her insecurities. His intentions are to prove Mindy’s failure as a parent. We are in solidarity with Mindy, even if, at times we are frustrated and baffled by her actions. And that is exactly the point. She doesn’t know what to do. None of us do. Framing this movie in horror was a natural choice.\" LITTLE BITES tells the story of Mindy Vogel (Krsy Fox, TERRIFIER 3), who is inexplicably saddled with a demon, Agyar (Jon Skarloff, CAPTAIN AMERICA: THE WINTER SOLDIER) that demands to feast upon her daughter, Alice. Unwilling to acquiesce, Mindy sends Alice to stay with her mother (Bonnie Arons, THE NUN) while she placates the monster with bites of her own flesh, spinning a plan to rid of her the burden once and for all.  I had the opportunity to speak with writer/director Spider One and lead actress Krsy Fox, neither of whom I felt comfortable addressing by name because I didn't feel entirely sure if Krsy was just pronounced \"Krissy\" and I couldn't rightly look a man in the face and call him \"Spider\". I really wanted to like this feature when I sat down to watch it, and a lot about it is quite Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 18 Feb 2025 08:34:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "51fd70cc-2267-499c-b83e-803a5dbca892",
    "title": "THE THINKING GAME Stream this Friday",
    "link": "https://www.aintitcool.com/the-thinking-game-greg-kohs-gary-krieg-83603/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric talks to director Greg Kohs and producer Gary Krieg about the new documentary THE THINKING GAME Read the full article on AICN It’s apparent that we’re living in the future, but how did we get here? Moreover, who shepherded us into this bold new world. Director Greg Kohrs and producer Gary Krieg sought this very answer and it brought them to Demis Hassabis.   Demis Hassabis began his journey as a young chess prodigy before shifting gears toward changing the world. He was drawn to the game as a “A fun thinking game,” but after a particularly long battle at a world tournament, he saw a futility in wasting his brain on games when there were real challenges to which he could apply his talents.    During a gap year between high school and college, Demis got an internship at Bullfrog games, where he implemented rudimentary AI into a PC game called Theme Park. His innovation allowed the NPCs to react to each other as well as the gamers’ intervention and create a more interconnected and immersive experience. This caught the eye of Electronic Arts and changed the trajectory of video games for years to come. Despite this transformative influence, Demis focused on college and after graduation sought to tackle the issue of Artificial General Intelligence.   For the uninitiated, Artificial General Intelligence refers to a true thinking creation. Inspired to a point by the AI Deep Blue defeating Chess master Kasparov in 1997, Demis was duly impressed by the victory but saw the limitation of an innovation that could ONLY play chess. As admirable as that was, Demis saw an imminent future where an AI could beat Finish the article on AICN",
    "author": "McEric",
    "published": "Thu, 06 Feb 2025 01:26:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "bc71a28b-f7a5-4be5-b453-e9455292ac8f",
    "title": "The 1% Club Questions \u0026 Answers for UK Season 4 (2025)",
    "link": "https://www.comingsoon.net/guides/features/1911071-1-percent-club-questions-answers-uk-season-4-series-2025",
    "description": "Will you make The 1% Club? The post The 1% Club Questions \u0026 Answers for UK Season 4 (2025) appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Nicholas Tan",
    "published": "Sun, 23 Feb 2025 11:28:28 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/01/the-1-club-questions-answers-for-uk-season-4.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Evergreen",
      "Explainer",
      "Game Show",
      "ITV",
      "Lee Mack",
      "The 1% Club",
      "The 1% Club (UK)",
      "TV Guides"
    ]
  },
  {
    "id": "c675309b-d34f-4de7-a9c0-ecdbaad2cde8",
    "title": "Taylor Swift News Today: Latest Updates for February 23, 2025",
    "link": "https://www.comingsoon.net/guides/news/1925840-taylor-swift-news-today-february-23-2025",
    "description": "Wondering what’s today’s news for Taylor Swift? From her latest chart milestone to Travis Kelce’s public shoutout, Swift continues to dominate the news cycle. With new achievements, industry records, and ongoing speculation surrounding her circle, there’s plenty to cover. Let’s break down the biggest Taylor Swift updates and the key moments shaping the discussion. Taylor […] The post Taylor Swift News Today: Latest Updates for February 23, 2025 appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Vritti Johar",
    "published": "Sun, 23 Feb 2025 09:00:00 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/02/MixCollage-21-Feb-2025-12-43-PM-560.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Pop Culture",
      "Pop Culture News",
      "Taylor Swift"
    ]
  },
  {
    "id": "3e2ee5b7-c629-4ee5-bcda-99e6aefe66d6",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "34e9431a-640c-4d1e-ad3f-a59460c34b26",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "b7074f57-c7fd-4f18-8008-fbe2e05c3c01",
    "title": "Berlinale 2025: Dag Johan Haugerud's Golden Bear Winner 'Dreams'",
    "link": "https://www.firstshowing.net/2025/berlinale-2025-dag-johan-haugeruds-golden-bear-winner-dreams/",
    "description": "\"I was simply head over heels in love with Johanna. That's why I wrote it down. To keep it with me.\" After another long winter film festival at the end of February, the 2025 Berlin Film Festival announced the award winners - giving the Golden Bear top prize to Norwegian filmmaker Dag Johan Haugerud and his film known as Dreams (in English). This warm and fuzzy Norwegian film is deserving of the top prize at this year's festival, finally a winner that seems to be less of a political pick and more about wonderful filmmaking getting reconigition. I'm glad I had a chance to catch up with Dreams at the end of Berlinale, right before it would go on to win, as it is a seriously wholesome and uplifting cinematic experience. Everyone feels better after watching it. And I'm glad I could catch this one on the big screen and take it in, be wrapped up in it, feel the warmth it exudes like the warmth of the light from the projector. Dreams is the third feature in Dag Johan Haugerud's recent trilogy \u0026 it is undoubtedly the best of the three. He really did save the best for last. […]",
    "author": "Alex Billington",
    "published": "Sun, 23 Feb 2025 20:45:29 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/DreamsBerlinaleReviewmainTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Berlinale",
      "Foreign Films",
      "Review"
    ]
  },
  {
    "id": "da6fc398-366d-4b72-81b8-7fd14bcefa7a",
    "title": "Concert Doc 'Hans Zimmer \u0026 Friends: Diamond in the Desert' Trailer",
    "link": "https://www.firstshowing.net/2025/concert-doc-hans-zimmer-friends-diamond-in-the-desert-trailer/",
    "description": "\"A performance that mesmerized the masses.\" An official trailer is available for a concert doc movie called Hans Zimmer \u0026 Friends: Diamond in the Desert, filmed in Dubai last year. This musical experience will be hitting theaters worldwide in March, for anyone looking to dive deeper into Hans Zimmer's world of sound. A journey through Dubai featuring live performances at Coca-Cola Arena, intimate talks with friends, and stunning moments across desert dunes and the iconic Burj Al Arab. This was filmed at both the Dubai performances on May 31st \u0026 June 1st, 2024 – and seems to be acting as a Dubai tourism video in addition to a Hans Zimmer experience. The doc also features conversations with Billie Eilish, Sir Christopher Nolan, Denis Villeneuve, Finneas, Jerry Bruckheimer, Johnny Marr, Pharrell Williams, Tanya Lapointe, Timothée Chalamet and Zendaya. It offers viewers a rare glimpse into Zimmer's creative process, exploring the drive to create and stories behind his closest collaborations. Executive produced by Jerry Bruckheimer, directed by Emmy-winning \u0026 multi Grammy-nominated Paul Dugdale, this film captures the magic and storytelling power of Zimmer's music in an unforgettable cinematic experience. It definitely looks exhilarating! Enjoy it. Official trailer for Paul Dugdale's doc Hans Zimmer […]",
    "author": "Alex Billington",
    "published": "Sun, 23 Feb 2025 18:13:51 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/HansZimmerFriendsDesertTsr1.jpg?quality=96",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Documentaries",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "b3e80f40-41b5-4f57-be8d-8d83f15a5e19",
    "title": "‘Suits: L.A.’ Review: NBC Spinoff Is a Bad Fit for Fans and Newcomers",
    "link": "https://www.indiewire.com/criticism/shows/suits-la-review-suits-spinoff-bad-1235097637/",
    "description": "Rushed to air after the original series' resurgence on Netflix, Aaron Korsh's strange sequel series only sports loose ties to \"Suits\" — a new cast, a new firm, and very few fun vibes.",
    "author": "Ben Travers",
    "published": "Mon, 24 Feb 2025 01:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Criticism",
      "Shows",
      "NBC",
      "Suits",
      "Suits: LA",
      "TV",
      "TV Reviews"
    ]
  },
  {
    "id": "f42a7d0a-2392-4383-93ac-8cfc7f837329",
    "title": "2025 SAG Awards Winners List (Updating Live)",
    "link": "https://www.indiewire.com/awards/results/2025-sag-awards-winners-list-1235097783/",
    "description": "\"Wicked\" and \"Shogun\" led the film and TV nominations respectively, with five nods apiece.",
    "author": "Christian Blauvelt",
    "published": "Mon, 24 Feb 2025 00:43:10 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Awards",
      "Results",
      "Film",
      "SAG Awards",
      "Screen Actors Guild Awards",
      "TV"
    ]
  },
  {
    "id": "c458aa96-e42a-4b8e-b05c-27050fbaed20",
    "title": "SAG Awards Winners List – Updating Live",
    "link": "https://deadline.com/2025/02/sag-awards-winners-list-2025-1236299263/",
    "description": "Refresh for latest... Awards season is in the homestretch, and tonight the actors are in the spotlight. The 31st annual SAG Awards are being handed out at the Shrine Auditorium \u0026 Expo Hall in Los Angeles and, Deadline is posting the winners as they are revealed. See the list below. Hollywood continues to celebrate the […]",
    "author": "Erik Pedersen",
    "published": "Mon, 24 Feb 2025 01:01:37 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/02/SAG-Awards-logo.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "Below The Line",
      "Kristen Bell",
      "Netflix",
      "SAG Awards",
      "SAG-AFTRA",
      "Screen Actors Guild",
      "Screen Actors Guild Awards"
    ]
  },
  {
    "id": "4fe63f5e-8a63-485a-a31e-2fc53499bcb0",
    "title": "Ashley Flowers’ Audiochuck Gets $40 Million Investment From The Chernin Group",
    "link": "https://deadline.com/2025/02/ashley-flowers-audiochuck-the-chernin-group-investment-1236299317/",
    "description": "Crime Junkie creator and host Ashley Flowers’ Audiochuck, a juggernaut podcast company in true crime and mystery storytelling, has received a $40 million minority investment from Peter Chernin’s The Chernin Group. It will leverage its first-ever outside capital to scale the company into its next phase of growth. Founded in 2017 by Flowers in Indianapolis, […]",
    "author": "Natalie Oganesyan",
    "published": "Mon, 24 Feb 2025 00:45:30 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/02/GettyImages-1780612428.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Ashley Flowers",
      "Audiochuck",
      "Peter Chernin",
      "The Chernin Group"
    ]
  },
  {
    "id": "2e6d5d04-0fff-4c40-810a-1b2bc3085d11",
    "title": "Constantine 2: Keanu Reeves Says DC Has Given Their Pitch A Greenlight",
    "link": "https://bleedingcool.com/movies/constantine-2-keanu-reeves-says-dc-has-given-their-pitch-a-greenlight/",
    "description": "Keanu Reeves has confirmed that the story treatment they have submitted for Constantine 2 has been approved, and they're moving on to writing the script.",
    "author": "Kaitlyn Booth",
    "published": "Sun, 23 Feb 2025 18:17:07 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "Warner Bros",
      "constantine 2",
      "keanu reeves"
    ]
  },
  {
    "id": "b854cf5c-13b3-4b4e-a39f-31cdd8fa8617",
    "title": "Lanterns: DC Studios Series Wraps First Week of Filming (We Think)",
    "link": "https://bleedingcool.com/tv/lanterns-dc-studios-series-wraps-first-week-of-filming-we-think/",
    "description": "Based on a recent post, the first week of filming on DC Studios' Aaron Pierre and Kyle Chandler-starring Lanterns has wrapped - we think.",
    "author": "Ray Flook",
    "published": "Sun, 23 Feb 2025 14:37:07 -0600",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "HBO",
      "Movies",
      "TV",
      "dc studios",
      "lanterns"
    ]
  }
]
