[
  {
    "id": "21092244-cafb-46b1-a50b-11abbe5a4a59",
    "title": "How VistaVision Made an Unlikely Comeback at the TCM Film Festival, With First Screenings Since the 1950s to Bring Back the Long-Lost Format’s Imax-Style Projectors",
    "link": "https://variety.com/2025/film/news/vistavision-comeback-tcm-classic-film-festival-screenings-1236382162/",
    "description": "The TCM Classic Film Festival isn’t just high on vintage films — occasionally, at least, the festival also finds a way to make room for long-gone methods of projection and exhibition. This is, after all, the festival that brought back Smell-o-vision for a screening back in the 2010s. “We bring back in every format, eventually,” […]",
    "author": "Chris Willman",
    "published": "Wed, 30 Apr 2025 00:30:22 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/04/vistavision-logo-GettyImages-2212009405.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "Tcm Classic Film Festival",
      "VistaVision"
    ]
  },
  {
    "id": "fe4a9f40-263a-4514-b211-e41df0498995",
    "title": "‘St. Denis Medical’ Co-Creator Breaks Down Joyce’s Big Plan for the Hospital’s Future and Why the Show May Never Address Its Mockumentary Format",
    "link": "https://variety.com/2025/tv/news/st-denis-medical-finale-joyce-plan-birthing-center-1236381759/",
    "description": "SPOILER ALERT: This post contains spoilers from “This Place Is Our Everything,” the Season 1 finale of NBC’s “St. Denis Medical,” now streaming on Peacock. A big change is coming to St. Denis Medical, just as long as the ceiling doesn’t cave in. All season, hospital executive director Joyce (Wendi McClendon-Covey) has gone to great […]",
    "author": "Kate Aurthur",
    "published": "Wed, 30 Apr 2025 00:30:00 +0000",
    "image": "https://variety.com/wp-content/uploads/2025/04/StDenisMedical-finale.MAIN_.jpg",
    "source": "https://variety.com/feed/",
    "categories": [
      "News",
      "St. Denis Medical"
    ]
  },
  {
    "id": "0038f07a-c92e-4759-819a-666b30c18376",
    "title": "Marvel's Original Thunderbolts Plans Were Similar To A Bruce Willis Action Movie",
    "link": "https://www.slashfilm.com/1843673/marvel-thunderbolts-plans-bruce-willis-action-movie-die-hard/",
    "description": "Marvel Studios originally thought about making a Thunderbolts* movie that would have been more aligned with a Bruce Willis classic.",
    "author": "Quinn Bilodeau",
    "published": "Tue, 29 Apr 2025 22:20:00 +0000",
    "image": "https://www.slashfilm.com/img/gallery/marvels-original-thunderbolts-plans-were-similar-to-a-bruce-willis-action-movie/l-intro-1745609558.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Movie News",
      "Action \u0026 Adventure Movies",
      "Superhero Movies"
    ]
  },
  {
    "id": "08b7c41a-d670-4e2e-a999-619a61df5dbe",
    "title": "Sinners, Star Wars, And Ben Affleck Led The Most Important Box Office Weekend In Ages",
    "link": "https://www.slashfilm.com/1847281/sinners-star-wars-ben-affleck-the-accountant-2-box-office-weekend/",
    "description": "If Hollywood wants to see what a healthy box office weekend looks like, this past weekend showcases the type of spread studios should be aiming for year round.",
    "author": "Ryan Scott",
    "published": "Tue, 29 Apr 2025 21:44:30 +0000",
    "image": "https://www.slashfilm.com/img/gallery/sinners-star-wars-and-ben-affleck-led-the-most-important-box-office-weekend-in-ages/l-intro-1745961072.jpg",
    "source": "https://feeds2.feedburner.com/slashfilm",
    "categories": [
      "Podcast",
      "Action \u0026 Adventure Movies",
      "Comedy Movies",
      "Drama Movies",
      "Science Fiction Movies"
    ]
  },
  {
    "id": "1b7f75d8-44ef-4df9-8809-6e50cfefc99b",
    "title": "New (and Old) Releases This Week, with McEric!",
    "link": "https://www.aintitcool.com/renner-neighborhood-watch-mob-cops-young-werther-83610/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "McEric cleans up his inbox by dumping reviews for NEIGHBORHOOD WATCH, RENNER, MOB COPS, and YOUNG WERTHER. Read the full article on AICN Hello all!  I've got some reviews of two films releasing this Friday, April 25th - but thought I'd also take this opportunity to highlight two other films that are already out there but I haven't yet found the time to cover. Hopefully there's something here for everyone, so let's get right to it: First up is NEIGHBORHOOD WATCH, starring Jack Quaid (NOVOCAINE, THE COMPANION, \"The Boys\"), Jeffrey Dean Morgan (\"The Boys,\" \"The Walking Dead\"), and Malin Ackerman (WATCHMEN, SLAYERS), directed by Duncan Skiles (THE CLOVEHITCH KILLER) and written by Sean Farley. The film features troubled young man Simon McNally (Quaid), who is trying to find his feet after spending a decade in a facility for mental health treatment, and his paranoid ex-security guard neighbor Ed Deerman. The two form an unlikely partnership when Simon believes he's seen a woman kidnapped but is deemed an unreliable witness by police due to his history and behavior. The two men take it upon themselves to investigate the crime and rescue the woman, revealing a deeper web of villainy in their quiet town. Quaid and Morgan have great chemistry, and Quaid, specifically, does some great work in this film. Whereas the majority of his characters have been able to rely and charm and humor, Simon is stripped of these tools due to the abuse he received at a young age, so the tricks that Quaid would normally utilize to endear himself to audiences are out of reach. Quaid does a great job of humanizing McNally as a Finish the article on AICN",
    "author": "McEric",
    "published": "Thu, 24 Apr 2025 20:33:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "9e6e1c5a-2414-4f2e-8884-b76f7f1e49df",
    "title": "Gina Gershon talks HIGH ROLLERS",
    "link": "https://www.aintitcool.com/gina-gershon-interview-killer-joe-showgirls-83609/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
    "description": "Actress Gina Gershon speaks with McEric about new film HIGH ROLLERS with John Travolta and cult classics SHOWGIRLS and KILLER JOE. Read the full article on AICN When I received an email asking me if I wanted to watch a brand new independent film starring John Travolta, Gina Gershon, and Lukas Haas, my first instinct was to say no. When I was told I might be able to interview Gina Gershon, I said sure, and watched Ives’ HIGH ROLLERS. What follows was my experience: This film isn’t good, you guys, but I did watch the whole thing, not only because I had to. It’s a caper, and once I get into a caper, I can’t walk away. I’ve got to know if and how they’ll pull it off. I think that’s universal. That said, this is not a good caper.    The film opens with Travolta as Mason with Gershon as Amy on a beautiful beach, looking out at the crystal blue water. They are gathered with their friends and team to watch two of their own tie the knot, but before they can both conclude their “I dos,” attack helicopters descend, accompanied by SUVS filled with masked mercenaries. They are held at gunpoint and Amy is taken. In a blink, the baddies are gone and the team is unharmed - you know, like mercenaries are wont to do. Next, Mason is giving chase in his muscle car in a poorly edited road piece, concluding in a crash that likely accounts for the film’s entire budget.This is followed by the team grouped around a table while Mason exposition dumps their accolades for the sake of the audience. They are contacted by Finish the article on AICN",
    "author": "McEric",
    "published": "Tue, 18 Mar 2025 19:24:00 +0000",
    "image": "",
    "source": "https://www.aintitcool.com/node/feed/",
    "categories": null
  },
  {
    "id": "298e8a69-450a-4728-8d3f-06c7c12434d5",
    "title": "Devin Booker \u0026 Molly Murphy Dating Rumors Explained",
    "link": "https://www.comingsoon.net/guides/news/1964360-devin-booker-molly-murphy-dating-rumors",
    "description": "Fans speculate that the Phoenix Suns guard Devin Booker is dating Molly Murphy, who accompanied him at the Stagecoach music festival. The 28-year-old NBA standout, who previously dated Kendall Jenner, was spotted in an embrace with the social media star at the event, fueling rumors about a potential new romantic connection. So, here are all […] The post Devin Booker \u0026 Molly Murphy Dating Rumors Explained appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Arpita Adhya",
    "published": "Wed, 30 Apr 2025 00:58:16 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/04/MixCollage-30-Apr-2025-06-25-AM-2842.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "Devin Booker",
      "Kendall Jenner",
      "Molly Murphy",
      "Pop Culture",
      "Pop Culture FAQ"
    ]
  },
  {
    "id": "5ac57190-4ed0-49ad-b4fe-4f02a5a05c2c",
    "title": "Wheel of Fortune Bonus Puzzle Answer Today for April 2025",
    "link": "https://www.comingsoon.net/guides/features/1948327-wheel-of-fortune-bonus-puzzle-april-2025-today-answer-tonight",
    "description": "The bonus round solutions for April. The post Wheel of Fortune Bonus Puzzle Answer Today for April 2025 appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
    "author": "Nicholas Tan",
    "published": "Tue, 29 Apr 2025 23:59:07 +0000",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/04/wheel-of-fortune-bonus-puzzle-answer-tonight-today-april-2025.jpg?w=1024",
    "source": "https://www.comingsoon.net/feed",
    "categories": [
      "Guides",
      "ABC",
      "ABC Guides",
      "Evergreen",
      "exclude_from_yahoo",
      "Game Show",
      "Ryan Seacrest",
      "Sony Pictures",
      "Vanna White",
      "Wheel of Fortune"
    ]
  },
  {
    "id": "21cfc5d0-3d6e-499c-b7c7-5cf00508bf8b",
    "title": "Film School Rejects is Seeking New Ownership",
    "link": "https://filmschoolrejects.com/film-school-rejects-for-sale/",
    "description": "After nearly two decades of operating independently, FSR is now for sale.",
    "author": "Film School Rejects",
    "published": "Tue, 10 Dec 2024 22:24:37 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "News",
      "Breaking News",
      "Industry"
    ]
  },
  {
    "id": "4afae35e-cef8-46fe-a690-2037826df764",
    "title": "A Giant Lizard Stomps His Way Through a 4K Tokyo in Our Pick of the Week",
    "link": "https://filmschoolrejects.com/godzilla-4kuhd-review/",
    "description": "Plus 10 more new releases to watch at home this week on 4K UHD, Blu-ray, and DVD!",
    "author": "Rob Hunter",
    "published": "Tue, 05 Nov 2024 23:31:20 +0000",
    "image": "",
    "source": "https://filmschoolrejects.com/feed/",
    "categories": [
      "Features",
      "Movies",
      "Home Video"
    ]
  },
  {
    "id": "78aa9f6b-5eea-40b7-acf4-cfe4618bacd5",
    "title": "Mesmerizing Teaser for 'Lost in Starlight' Sci-Fi Romance Anime Movie",
    "link": "https://www.firstshowing.net/2025/mesmerizing-teaser-for-lost-in-starlight-sci-fi-romance-anime-movie/",
    "description": "\"Let's keep our distance... because someday, I'll be flying off to space.\" Netflix has revealed the first look teaser trailer for Lost in Starlight, made by Korean filmmaker Han Ji-won. The upcoming film is Netflix's very first Korean-language animated feature film - starring the voices of K-drama powerhouses Kim Tae-ri and Hong Kyung. When an astronaut leaves Earth for Mars, the vastness of space divides the star-crossed lovers. This wonderful teaser trailer showcases some of the spectacular imagery. Director Bong Joon-ho has already given a comment - saying: \"This visual masterpiece takes you around the universe.\" Set in 2050 Seoul, an astronaut dreaming of Mars and a musician with a broken dream find each other among the stars, guided by their hopes \u0026 their love for one another. This teaser opens with the fateful first meeting of Nan-young and Jay, accompanied by the film’s evocative soundtrack. When Nan-young visits an audio equipment repair shop to fix an old record player her mom left behind, she runs right into Jay, and a romance slowly blossoms. Lost in Starlight will debut streaming on Netflix at the end of May – not long to wait at all. Enjoy. Here's the official trailer (+ […]",
    "author": "Alex Billington",
    "published": "Tue, 29 Apr 2025 21:05:14 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/LostinstarlightPostermainbigTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Animation",
      "Foreign Films",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "b2d344d8-8a14-4150-8b62-250d0d83dfcf",
    "title": "Disturbing Horror Thriller 'The Other' Trailer About a Mute Foster Girl",
    "link": "https://www.firstshowing.net/2025/disturbing-horror-thriller-the-other-trailer-about-a-mute-foster-girl/",
    "description": "\"It follows you everywhere... it's already here.\" Quiver Distribution has revealed an official trailer for The Other, an indie horror film from filmmaker Paul Etheredge - known for his cult classic indie horror flick Hellbent from 2004. He's back with a new film after 20 years offering something new and scary. Unable to conceive, a couple seeks to build a family with a young mute orphan named Kathelia (played by newcomer Avangeline Friedlander), who is a survivor of tragic childhood. But their act of love turns to horror when they realize the violence in their foster's past has returned to destroy the new family. As an evil force takes hold, they must fight for their family—and their survival. The film stars Olivia Macklin, Dylan McTee, Lily D. Moore, and Shawnee Smith, along with Avangeline Friedlander. From one of the producers who also created Final Destination. This horror will be out to view in June on VOD for anyone who's intrigued to watch. This looks like a mostly generic supernatural plot with some intriguing twists involving this little girl. Here's the official trailer (+ poster) for Paul Etheredge's horror film The Other, direct from YouTube: After years of infertility, Robin and […]",
    "author": "Alex Billington",
    "published": "Tue, 29 Apr 2025 19:50:53 +0000",
    "image": "https://media2.firstshowing.net/firstshowing/img16/TheOtherhorror25posterbigTsr1.jpg",
    "source": "https://www.firstshowing.net/feed/",
    "categories": [
      "Horror",
      "Indies",
      "To Watch",
      "Trailer"
    ]
  },
  {
    "id": "0266b6cd-3ee3-4897-b519-4991d16aa2a3",
    "title": "Aspiring Horror Cinematographers: Learn How Ari Aster and Ti West Scare the Hell Out of You",
    "link": "https://www.indiewire.com/features/interviews/three-cinematographers-break-down-technical-approach-horror-1235117039/",
    "description": "Practical tips for setting mood from those who lensed Ari Aster's \"Midsommar,\" Jane Schoenbrun's \"I Saw the TV Glow,\" and Ti West's \"X\" Trilogy.",
    "author": "Harrison Richlin",
    "published": "Tue, 29 Apr 2025 22:00:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Features",
      "Interviews | Celebrity Interviews \u0026 Insider Takes",
      "Cinematography",
      "Film",
      "Future of Filmmaking",
      "TV"
    ]
  },
  {
    "id": "1153dc99-4e0c-473a-847b-c5486a469ccc",
    "title": "From Animatronics to Wiki-Diving: How ‘The Legend of Ochi’ Created Its Title Character",
    "link": "https://www.indiewire.com/features/craft/the-legend-of-ochi-making-of-puppetry-a24-1235118994/",
    "description": "Director Isaiah Saxon tells IndieWire about creating the perfect puppet for 'The Legend of Ochi'",
    "author": "Sarah Shachat",
    "published": "Tue, 29 Apr 2025 21:30:00 +0000",
    "image": "",
    "source": "https://www.indiewire.com/feed",
    "categories": [
      "Craft | Technology, Sound and Set Design",
      "Features",
      "A24",
      "Film",
      "Isaiah Saxon",
      "The Legend of Ochi",
      "Top of the Line"
    ]
  },
  {
    "id": "e3d82817-3de1-491f-af0a-082e99287c19",
    "title": "Weapons: Trailer, Poster, And Images Tease A Small Town Mystery",
    "link": "https://bleedingcool.com/movies/weapons-trailer-poster-and-images-tease-a-small-town-mystery/",
    "description": "The official trailer, poster, and images for Zach Cregger's new film Weapons is a whole lot of Absolutely Not for anyone with a fear of spooky kids.",
    "author": "Kaitlyn Booth",
    "published": "Tue, 29 Apr 2025 18:47:07 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Movies",
      "New Line Cinema",
      "Warner Bros",
      "weapons",
      "Zach Cregger"
    ]
  },
  {
    "id": "c06eac3e-c6ee-472c-ba66-76da80b6136c",
    "title": "CinemaCon Sneak Peek Showcase: Good Idea, Bad Execution",
    "link": "https://bleedingcool.com/movies/cinemacon-sneak-peek-showcase-good-idea-bad-execution/",
    "description": "We went to the CinemaCon Sneak Peek Showcase last week, and if it continues, some work will be needed to get it where it should be.",
    "author": "Jeremy Konrad",
    "published": "Tue, 29 Apr 2025 14:32:06 -0500",
    "image": "",
    "source": "https://www.bleedingcool.com/movies/feed/",
    "categories": [
      "Cinemacon",
      "Film Promo",
      "Movies",
      "cinemacon",
      "Sneak Peek Showcase"
    ]
  },
  {
    "id": "a3e64963-56ec-4a59-9b71-f7f5ec95baa1",
    "title": "Arnold Schwarzenegger To Receive Legacy Award From South East European Film Festival In Los Angeles",
    "link": "https://deadline.com/2025/04/arnold-schwarzenegger-legacy-award-seefest-1236380614/",
    "description": "EXCLUSIVE: Actor, clean energy advocate and former governor of California Arnold Schwarzenegger will receive the Legacy Award from the South East European Film Festival in Los Angeles on Wednesday evening, the opening night of the 20th edition of the festival. “The Legacy Award is honoring an iconic movie star, who began his trailblazing immigrant journey […]",
    "author": "Matthew Carey",
    "published": "Wed, 30 Apr 2025 00:49:00 +0000",
    "image": "https://deadline.com/wp-content/uploads/2023/04/Arnold-Schwarzenegger-e1682343706673.jpeg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "Festivals",
      "News",
      "Arnold Schwaezenegger",
      "SEEfest",
      "The Man Who Could Not Remain Silent",
      "The New Year That Never Came",
      "Vera Mijojlić"
    ]
  },
  {
    "id": "a167c429-6155-46ff-bf72-469a5ba04088",
    "title": "Netflix Adding Alfred Hitchcock’s ‘The Birds’, ‘Rear Window’, ‘Vertigo’ \u0026 More, Sets Screening Series In NYC",
    "link": "https://deadline.com/2025/04/netflix-hitchcock-the-birds-rear-window-vertigo-1236380553/",
    "description": "Alfred Hitchcock enjoyed making his audiences suffer, and now that uneasy feeling is coming to Netflix in large doses. The streamer said today that it will add several of the horror-suspense master’s best loved films, including The Birds, Vertigo, Rear Window, his final film Family Plot and more. They join the filmmaker’s beloved and dreaded […]",
    "author": "Erik Pedersen",
    "published": "Wed, 30 Apr 2025 00:42:31 +0000",
    "image": "https://deadline.com/wp-content/uploads/2025/04/Netflix-Hitchcock.jpg",
    "source": "https://deadline.com/feed/",
    "categories": [
      "News",
      "Alfre Woodard",
      "Alfred Hitchcock",
      "Netflix",
      "Psycho",
      "Rear Window",
      "Vertigo"
    ]
  }
]
