{
  "id": "10dfcce9-86d4-43f4-be7a-8316bec7fc46",
  "title": "Bride TikTok Drama Highlights Social Media Pitfalls for Photographers",
  "link": "https://petapixel.com/2025/01/28/bride-tiktok-drama-highlights-social-media-pitfalls-for-photographers/",
  "description": "A bride who attempted to shame two photographers for bad photos of her wedding received serious blowback from the internet after it was revealed she wasn't being totally honest. [Read More]",
  "author": "Matt Growcoot",
  "published": "Tue, 28 Jan 2025 18:47:11 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Features",
    "Industry",
    "News",
    "bride",
    "drama",
    "groom",
    "newlyweds",
    "tiktok",
    "weddingphotographer",
    "weddingphotos"
  ],
  "byline": "Matt Growcoot",
  "length": 3988,
  "excerpt": "A sorry saga played out this week on TikTok.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "A bride who attempted to shame two photographers for bad photos of her wedding received serious blowback from the internet after it was revealed she wasn’t being totally honest. Austyn Mae made a viral TikTok video in which she shared several bad photos from her wedding. In the post, she named photographer Madison Wood as well as the name of another photographer who PetaPixel understands actually took the photos. However, the TikTok spectacularly backfired on Mae when an internet sleuth found the gallery of images that the photographer had delivered. The full set of photos includes beautiful shots from the couple’s big day that Mae had conveniently left out of her post. @atrustedadult @austyn mae hope you have a happy marriage #wedding #weddingphotographer #photography #greenscreenvideo #greenscreen ♬ original sound – JJ “Seriously, what are you complaining about?” says amateur sleuth JJ on TikTok. “Coming on an app like this and trying to get some sort of clout because you’re complaining about a photographer seems to be a common trend.” Blowback The videos blew up: receiving millions of views and thousands of comments. Virtually everyone sided with the photographer. The bride wound up not only deleting her original video, but her entire account and online presence — so severe was the fallout. Arizona-based Madison Wood has responded to the drama with her own video, adding more context to the situation. Wood says that the debacle was already unfolding “offline” when the couple revealed they were unhappy with the photos. Wood herself didn’t actually take the photos, instead an “associate” of hers took the photos. “There was multiple talks with the mom and then everything was kind of, I wouldn’t say settled, because obviously they were unhappy,” Wood says in a TikTok video. “But everything came to an agreement and then the bride decided to post this (video) on TikTok. She stated that I went against my contract, which is not true. I sent an associate.” @madisonnnwood Just wanted to thank everyone for the kind words \u0026 offer my side💛 never thought it would get to this point ♬ original sound – Madison Wood Wood goes on to say that she offered the couple a refund and the RAW photos but both offers were refused. “I know I’m not going to please everyone, but I just wish this was handled in such a different way,” she says. “I was at work and one of my friends sent me the TikTok…I called the Mom and I just said, ‘Listen, I completely understand that you guys are upset. I thought that we had talked about this, but I do not understand online bashing at all. She just made a TikTok video and I’m tagged in it’.” “Obviously I did not physically take those pictures,” Wood continues. “But I sent the associate out there. I have taken full accountability for that. I did literally everything in my power to make that right. And this was still posted on social media.” However, while the experience has been “extremely overwhelming” for Wood it may ultimately be a good thing since her social media followers have now skyrocketed thanks to the drama and she has received well wishes from hundreds of people. Social Media: A Minefield for Photographers The saga is reminiscent of the “sepia tone bride” drama from last year when another disgruntled newlywed used TikTok to name and shame a photographer whose work she was unhappy with — this time it was because she felt the pictures had a strong orange tint on them. This too largely backfired on the bride. However, this type of online retribution where photographers are named and shamed is a serious risk to the photographer’s business and another headache for overworked shooters to worry about. Worryingly, it also seems to be becoming a trend. Image credits: Header photo licensed via Depositphotos. PetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.",
  "image": "https://petapixel.com/assets/uploads/2023/10/Wedding-Photographer.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\u003carticle data-post-id=\"777023\"\u003e\n\n    \u003cheader\u003e\n          \n    \n\n        \n  \u003c/header\u003e\n      \n  \n\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://petapixel.com/assets/uploads/2023/10/Wedding-Photographer.jpg\" data-wpel-link=\"internal\"\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2023/10/Wedding-Photographer-800x420.jpg\" alt=\"Wedding photographer\" width=\"800\" height=\"420\" srcset=\"https://petapixel.com/assets/uploads/2023/10/Wedding-Photographer-800x420.jpg 800w, https://petapixel.com/assets/uploads/2023/10/Wedding-Photographer-320x168.jpg 320w, https://petapixel.com/assets/uploads/2023/10/Wedding-Photographer-1536x806.jpg 1536w, https://petapixel.com/assets/uploads/2023/10/Wedding-Photographer-150x79.jpg 150w, https://petapixel.com/assets/uploads/2023/10/Wedding-Photographer-300x157.jpg 300w, https://petapixel.com/assets/uploads/2023/10/Wedding-Photographer-400x209.jpg 400w, https://petapixel.com/assets/uploads/2023/10/Wedding-Photographer-550x288.jpg 550w, https://petapixel.com/assets/uploads/2023/10/Wedding-Photographer.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eA bride who attempted to shame two photographers for bad photos of her wedding received serious blowback from the internet after it was revealed she wasn’t being totally honest. \u003c/p\u003e  \u003cp\u003eAustyn Mae made a viral TikTok video in which she shared several \u003cem\u003ebad\u003c/em\u003e photos from her wedding. In the post, she named photographer Madison Wood as well as the name of another photographer who \u003cem\u003ePetaPixel\u003c/em\u003e understands actually took the photos. \u003c/p\u003e \u003cp\u003eHowever, the TikTok spectacularly backfired on Mae when an internet sleuth found the gallery of images that the photographer had delivered. The full set of photos includes beautiful shots from the couple’s big day that Mae had conveniently left out of her post. \u003c/p\u003e \u003ccenter\u003e \u003cblockquote cite=\"https://www.tiktok.com/@atrustedadult/video/7463154953482177822\" data-video-id=\"7463154953482177822\"\u003e \u003csection\u003e \u003ca target=\"_blank\" title=\"@atrustedadult\" href=\"https://www.tiktok.com/@atrustedadult?refer=embed\" rel=\"noopener follow external\" data-wpel-link=\"external\"\u003e@atrustedadult\u003c/a\u003e @austyn mae hope you have a happy marriage \u003ca title=\"wedding\" target=\"_blank\" href=\"https://www.tiktok.com/tag/wedding?refer=embed\" rel=\"noopener follow external\" data-wpel-link=\"external\"\u003e#wedding\u003c/a\u003e \u003ca title=\"weddingphotographer\" target=\"_blank\" href=\"https://www.tiktok.com/tag/weddingphotographer?refer=embed\" rel=\"noopener follow external\" data-wpel-link=\"external\"\u003e#weddingphotographer\u003c/a\u003e \u003ca title=\"photography\" target=\"_blank\" href=\"https://www.tiktok.com/tag/photography?refer=embed\" rel=\"noopener follow external\" data-wpel-link=\"external\"\u003e#photography\u003c/a\u003e \u003ca title=\"greenscreenvideo\" target=\"_blank\" href=\"https://www.tiktok.com/tag/greenscreenvideo?refer=embed\" rel=\"noopener follow external\" data-wpel-link=\"external\"\u003e#greenscreenvideo\u003c/a\u003e \u003ca title=\"greenscreen\" target=\"_blank\" href=\"https://www.tiktok.com/tag/greenscreen?refer=embed\" rel=\"noopener follow external\" data-wpel-link=\"external\"\u003e#greenscreen\u003c/a\u003e \u003ca target=\"_blank\" title=\"♬ original sound - JJ\" href=\"https://www.tiktok.com/music/original-sound-7463154848469355295?refer=embed\" rel=\"noopener follow external\" data-wpel-link=\"external\"\u003e♬ original sound – JJ\u003c/a\u003e \u003c/section\u003e \u003c/blockquote\u003e \u003c/center\u003e \u003cp\u003e“Seriously, what are you complaining about?” says amateur sleuth JJ on TikTok. “Coming on an app like this and trying to get some sort of \u003cem\u003eclout\u003c/em\u003e because you’re complaining about a photographer seems to be a common trend.”  \u003c/p\u003e\n \u003ch2\u003eBlowback\u003c/h2\u003e \u003cp\u003eThe videos blew up: receiving millions of views and thousands of comments. Virtually everyone sided with the photographer. The bride wound up not only deleting her original video, but her entire account and online presence — so severe was the fallout.\u003c/p\u003e \u003cp\u003eArizona-based \u003ca href=\"https://www.instagram.com/madiwoodphoto/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eMadison Wood\u003c/a\u003e has responded to the drama with her own video, adding more context to the situation. Wood says that the debacle was already unfolding “offline” when the couple revealed they were unhappy with the photos. Wood herself didn’t actually take the photos, instead an “associate” of hers took the photos. \u003c/p\u003e \u003cp\u003e“There was multiple talks with the mom and then everything was kind of, I wouldn’t say settled, because obviously they were unhappy,” Wood says in a TikTok video. “But everything came to an agreement and then the bride decided to post this (video) on TikTok. She stated that I went against my contract, which is not true. I sent an associate.” \u003c/p\u003e \u003ccenter\u003e \u003cblockquote cite=\"https://www.tiktok.com/@madisonnnwood/video/7463127942604983598\" data-video-id=\"7463127942604983598\"\u003e \u003csection\u003e \u003ca target=\"_blank\" title=\"@madisonnnwood\" href=\"https://www.tiktok.com/@madisonnnwood?refer=embed\" rel=\"noopener follow external\" data-wpel-link=\"external\"\u003e@madisonnnwood\u003c/a\u003e  \u003cp\u003eJust wanted to thank everyone for the kind words \u0026amp; offer my side💛 never thought it would get to this point \u003c/p\u003e \u003cp\u003e \u003ca target=\"_blank\" title=\"♬ original sound - Madison Wood\" href=\"https://www.tiktok.com/music/original-sound-7463127925886487342?refer=embed\" rel=\"noopener follow external\" data-wpel-link=\"external\"\u003e♬ original sound – Madison Wood\u003c/a\u003e \u003c/p\u003e\u003c/section\u003e \u003c/blockquote\u003e \u003c/center\u003e \u003cp\u003eWood goes on to say that she offered the couple a refund and the RAW photos but both offers were refused. \u003c/p\u003e \u003cp\u003e“I know I’m not going to please everyone, but I just wish this was handled in such a different way,” she says. “I was at work and one of my friends sent me the TikTok…I called the Mom and I just said, ‘Listen, I completely understand that you guys are upset. I thought that we had talked about this, but I do not understand online bashing at all. She just made a TikTok video and I’m tagged in it’.”\u003c/p\u003e\n \u003cp\u003e“Obviously I did not physically take those pictures,” Wood continues. “But I sent the associate out there. I have taken full accountability for that. I did literally everything in my power to make that right. And this was still posted on social media.” \u003c/p\u003e \u003cp\u003eHowever, while the experience has been “extremely overwhelming” for Wood it may ultimately be a good thing since her social media followers have now skyrocketed thanks to the drama and she has received well wishes from hundreds of people. \u003c/p\u003e \u003ch2\u003eSocial Media: A Minefield for Photographers\u003c/h2\u003e \u003cp\u003eThe saga is reminiscent of the \u003ca href=\"https://petapixel.com/2024/07/03/the-sepia-tone-bride-drama-is-a-valuable-lesson-for-photographers/\" data-wpel-link=\"internal\"\u003e“sepia tone bride” drama\u003c/a\u003e from last year when another disgruntled newlywed used TikTok to name and shame a photographer whose work she was unhappy with — this time it was because she felt the pictures had a strong orange tint on them. \u003c/p\u003e \u003cp\u003eThis too largely backfired on the bride. However, this type of online retribution where photographers are named and shamed is a serious risk to the photographer’s business and another headache for overworked shooters to worry about. Worryingly, it also seems to be becoming a trend. \u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e Header photo licensed via \u003ca href=\"https://depositphotos.com/\" rel=\"nofollow external noopener\" data-wpel-link=\"external\" target=\"_blank\"\u003eDepositphotos\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e      \u003c/div\u003e\n\n          \n      \n\n              \u003cdiv\u003e\n          \u003cp\u003ePetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.\u003c/p\u003e\n        \u003c/div\u003e\n      \n    \n\n    \n          \n      \n\n\n\n\n    \n    \n    \n          \n      \u003c/div\u003e\n\u003c/article\u003e\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-28T18:47:11Z",
  "modifiedTime": null
}
