{
  "id": "1c76b7b5-8d9e-4d19-ae2a-e1cc442e7c31",
  "title": "An Absolute Beginner’s Guide To Film Photography",
  "link": "https://www.lightstalking.com/beginners-film-photography/",
  "description": "Film photography has never really gone away. Sure, it’s declined massively since the arrival of digital, however these days increasing numbers of newer photographers are trying their hand at film photography. I have written several articles about shooting film here at Light Stalking, yet I have realized that there may well be an entire section […] The post An Absolute Beginner’s Guide To Film Photography appeared first on Light Stalking.",
  "author": "Jason Row",
  "published": "Tue, 27 May 2025 12:00:00 +0000",
  "source": "https://www.lightstalking.com/feed/",
  "categories": [
    "Camera Craft"
  ],
  "byline": "Jason Row",
  "length": 9367,
  "excerpt": "Film photography has never really gone away. Sure, it’s declined massively since the arrival of digital, however these days increasing numbers of newer photographers are trying their hand at film photography. I have written several articles about shooting film here at Light Stalking, yet I have realized that there may well be an entire section of you that know little to nothing about it. Many of you will have developed your photographic skills through the digital age, and whilst understanding the existence of film photography may be daunted by trying it out for yourselves. So today I am going to",
  "siteName": "Light Stalking",
  "favicon": "",
  "text": "Film photography has never really gone away. Sure, it’s declined massively since the arrival of digital, however these days increasing numbers of newer photographers are trying their hand at film photography. I have written several articles about shooting film here at Light Stalking, yet I have realized that there may well be an entire section of you that know little to nothing about it. Many of you will have developed your photographic skills through the digital age, and whilst understanding the existence of film photography may be daunted by trying it out for yourselves. So today I am going to look at the absolute basics. Cameras, films, processing and shooting on film. Let’s get into it by looking at film. There are a plethera of film cameras available for all budgets. By Mali Maeder on Pexels Photographic Films Photographic films can be broken down into three main types. Black and white negative film, colour negative film and colour transparency film also known as slide film. Negative films do exactly as the name suggests, they record a negative image to the film. Blacks and whites are reversed, primaries become secondaries on colour negative film. Some of you might have seen processed colour negatives and wondered why they are orange. This is simply to mask the imperfections of the dyes in the film. Colour negative film has an orange base. By Luriko Yamaguchi on Pexels Negative films are made so because they are designed for printing. When you expose a negative onto photographic paper, you get a normal, positive image. Transparency film is designed to be projected rather than printed, much like you would have watched a film in the cinema before the advent of digital projectors. It is much less tolerant to incorrect exposure than negative films. It used to be able to be printed via an Ilford process called Cibachrome, however that has been discontinued. As far as I am aware, the only way to print transparency films these days is to digitise them. What’s also important to note, especially for digital photographers is that the ISO, also known as ASA, is fixed. A film will have a speed rating such as 100, 200 or 400 ISO and the camera must be set to that ISO to shoot. There are ways to change the ISO through the film processing, however that’s not for this basic guide. I should note that photographic films and processing are relatively expensive these days compared to the film era. This is a simple supply and demand issue, whilst film is seeing a resurgence, it’s nowhere near large enough to bring prices down. Typically you will pay $8-10 for a roll of 35mm black and white film plus $15-20 for processing and scanning. Black and white is the easiest to home process. By Annushka Ahuja on Pexels Film Sizes As digital photographers you will be aware of different sensor sizes, from the very small ones on our phones to the medium format sensors of Hasselblad and Fuji. Film cameras are very much the same. At the peak of film photography in the 1990s, the smallest commercial film was Disk Film, this was really tiny and as the name suggests, each frame was placed around a disk rather than a roll. Next came 110 and 126, before we got to the ubiquitous 35mm. From there we stepped up to 120/220, both the same width of film but 220 being able to take twice the number of exposure. These are commonly known as medium format. Above that we had 5×4 and 8×10 sheet film used in plate/field style cameras. Returning to the modern day, 35mm, 120 and sheet films are still made and available, the smaller films are now obsolete. Medium format is within reach of many. By Amar Preciado on Pexels The Cameras Apart from a few speciality companies, film cameras are not mass produced anymore. However there is a massive secondhand market for these cameras. The recent resurgence of film photography has pushed up the price of these significantly, however they are still bargains compared to modern mirrorless cameras. As you might guess, the camera you buy determines the film that it requires. By far the most commonly used format is 35mm and there are two main camera types you will find. The SLR is the direct predecessor to the modern DSLR and shares a lot of the same ergonomics. Secondly there are the compact, rangefinder cameras. These can be as simple as the excellent Olympus Trip all the way through to Leica Ms with their interchangeable lenses. Loading film takes some practice. By Vinh Vo on Pexels Medium format, 120 film gets a little more complicated and a lot more expensive, even used. The smallest medium format cameras are 645. These take 15 images on a roll of 120 and as the name suggests the frame size is 6 cm by 4.5 cm. Next we step up to 6×6, the most common medium format, then 6×7 and 6×9. Generally all these formats use different cameras. For example Mamiya did a compact 645 camera and a 6×9 Press camera whilst Hasselbald were famous for their 6×6 cameras. As a newcomer to film photography, I would strongly recommend a 35mm SLR camera. These are the cheapest and most available. Buy from a reputable used dealer rather than eBay or marketplace. This will ensure that the camera is in good working order. Things to look out for are light leaks, slow running shutters and electrical issues. You can also break down SLRs into two main eras. Pre 1990s, cameras were mainly manual focus, manual film wind and with fairly rudimentary exposure meters and modes. The 1990s saw the introduction of many of the features we see in modern cameras such as matrix metering and autofocus. They also often had motorized film advance built in. Shooting With A Film Camera Those used to modern digital cameras will be in for quite a culture shock. The first thing you will notice is how bright the viewfinders are, before realizing that the information in that viewfinder is severely lacking, often just an exposure scale. There will be a dial on the exterior of the body for setting ISO and this is very important to set as the wrong ISO will give you incorrectly exposed images. Plus of course, you cannot see that the images are incorrectly exposed. Shooting on a film camera is a culture shock. By Pratik Gupta on Pexels On older cameras, focussing can be quite a challenge. Even more modern autofocus film cameras were slow and unreliable. Focusing manually, you would have the viewfinder’s fresnel screen or split screen. If you have less than stellar eyesight, this can be quite a challenge. Loading film requires dexterity and practice. Getting the end of the film into the slots on the spool can be hard and often different cameras have slightly different ways to achieve this. One tip for manually wound cameras, is to watch the film rewind lever after loading the film. If this turns as you wind the film on, it is loaded correctly. You are going to need to get used to shooting either 24 or 36 frames before needing to change the film but more importantly not 100% knowing whether you have nailed the shot until you get the films processed. Speaking of which. Film Processing and Printing At the top I mentioned the three main types of photographic film, colour and black and white negative film and transparency. Each of these has a different way of being processed. Standard black and white film is actually pretty easy to process yourself, however you need to have a dust free environment to do it. You don’t actually need a darkroom as you can load the film into a processing tank inside a dark bag. This can be a bit fiddly at first but becomes second nature with practice. Once the film is in the drum you can do the actual processing in light. Both colour negative and slide films require much more complicated processing that are really best suited to a professional lab. Slide/transparency film, in particular, is very prone to colour variations when processed. Black and white processing and printing is not hard. By Tima Miroshnichenko on. Pexels If you do not want to go down the home processing route, most labs will also offer black and white processing. These days there are plenty of processing labs available although they are unlikely to be local. You usually have to post your film in, and wait a week or two. The lab will probably offer processing and printing or processing with scans only. Printing colour or black and white negative films has two options. You can print directly from the negative onto photographic paper, or you can scan the negative and print on a home printer. Most modern labs will actually be scanning your negative although that scan will be output to real photographic paper. The more ambitious amongst you might want to try printing black and white at home. Although you can print under a red light, your darkroom must be completely sealed from any external white light. Enlargers and processing trays are readily available, and most decent camera stores stock the processing chemicals. It’s not a difficult task to print black and white yet, immensely satisfying. So that’s my brief beginners guide to film photography. Film photography is a wonderful medium that can teach you patience, the value of an image and a deep understanding of exposure. It can be relatively expensive compared to digital but can give great satisfaction.",
  "image": "https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\n\u003cp\u003eFilm photography has never really gone away. Sure, it’s declined massively since the arrival of digital, however these days increasing numbers of newer photographers are trying their hand at film photography.\u003c/p\u003e\n\n\n\n\u003cp\u003eI have written several articles about shooting film here at Light Stalking, yet I have realized that there may well be an entire section of you that know little to nothing about it.\u003c/p\u003e\n\n\n\n\u003cp\u003eMany of you will have developed your photographic skills through the digital age, and whilst understanding the existence of film photography may be daunted by trying it out for yourselves. So today I am going to look at the absolute basics. Cameras, films, processing and shooting on film. Let’s get into it by looking at film.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik.jpeg.webp 2048w, https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik-400x265.jpeg.webp 400w, https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik-1024x679.jpeg.webp 1024w, https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik-768x509.jpeg.webp 768w, https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik-1536x1018.jpeg.webp 1536w, https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik-1200x795.jpeg.webp 1200w, https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik-1980x1312.jpeg.webp 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"2048\" height=\"1357\" src=\"https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik.jpeg\" alt=\"Beautiful black Olympus OM40 film camera with Zuiko lens\" srcset=\"https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik.jpeg 2048w, https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik-400x265.jpeg 400w, https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik-1024x679.jpeg 1024w, https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik-768x509.jpeg 768w, https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik-1536x1018.jpeg 1536w, https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik-1200x795.jpeg 1200w, https://www.lightstalking.com/wp-content/uploads/beautiful-black-olympus-om40-film-camera-with-zuik-1980x1312.jpeg 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eThere are a plethera of film cameras available for all budgets. By\u003ca href=\"https://www.pexels.com/photo/black-olympus-slr-camera-102108/\"\u003e Mali Maeder on Pexels\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-photographic-films\"\u003e\u003ca id=\"post-519547-_98ew1xliaie5\"\u003e\u003c/a\u003ePhotographic Films\u003c/h2\u003e\n\n\n\n\u003cp\u003ePhotographic films can be broken down into three main types. Black and white negative film, colour negative film and colour transparency film also known as slide film.\u003c/p\u003e\n\n\n\n\u003cp\u003eNegative films do exactly as the name suggests, they record a negative image to the film. Blacks and whites are reversed, primaries become secondaries on colour negative film. Some of you might have seen processed colour negatives and wondered why they are orange. This is simply to mask the imperfections of the dyes in the film.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi.jpeg.webp 2048w, https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi-400x267.jpeg.webp 400w, https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi-1024x683.jpeg.webp 1024w, https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi-768x512.jpeg.webp 768w, https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi-1536x1024.jpeg.webp 1536w, https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi-1200x800.jpeg.webp 1200w, https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi-1980x1320.jpeg.webp 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"2048\" height=\"1365\" src=\"https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi.jpeg\" alt=\"Hand holding a colour negative strip against a white background\" srcset=\"https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi.jpeg 2048w, https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi-400x267.jpeg 400w, https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi-1024x683.jpeg 1024w, https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi-768x512.jpeg 768w, https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi-1536x1024.jpeg 1536w, https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi-1200x800.jpeg 1200w, https://www.lightstalking.com/wp-content/uploads/hand-holding-a-colour-negative-strip-against-a-whi-1980x1320.jpeg 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eColour negative film has an orange base. By \u003ca href=\"https://www.pexels.com/photo/person-holding-camera-film-2061678/\"\u003eLuriko Yamaguchi on Pexels\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eNegative films are made so because they are designed for printing. When you expose a negative onto photographic paper, you get a normal, positive image.\u003c/p\u003e\n\n\n\n\u003cp\u003eTransparency film is designed to be projected rather than printed, much like you would have watched a film in the cinema before the advent of digital projectors. It is much less tolerant to incorrect exposure than negative films. It used to be able to be printed via an Ilford process called Cibachrome, however that has been discontinued. As far as I am aware, the only way to print transparency films these days is to digitise them.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhat’s also important to note, especially for digital photographers is that the ISO, also known as ASA, is fixed. A film will have a speed rating such as 100, 200 or 400 ISO and the camera must be set to that ISO to shoot. There are ways to change the ISO through the film processing, however that’s not for this basic guide.\u003c/p\u003e\n\n\n\n\u003cp\u003eI should note that \u003ca href=\"https://www.lightstalking.com/10-facts-need-know-film-photography/\"\u003ephotographic films\u003c/a\u003e and processing are relatively expensive these days compared to the film era. This is a simple supply and demand issue, whilst film is seeing a resurgence, it’s nowhere near large enough to bring prices down. Typically you will pay $8-10 for a roll of 35mm black and white film plus $15-20 for processing and scanning.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with.jpeg.webp 2048w, https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with-400x267.jpeg.webp 400w, https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with-1024x683.jpeg.webp 1024w, https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with-768x512.jpeg.webp 768w, https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with-1536x1024.jpeg.webp 1536w, https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with-1200x800.jpeg.webp 1200w, https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with-1980x1320.jpeg.webp 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"2048\" height=\"1365\" src=\"https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with.jpeg\" alt=\"Strips of black and white film on a lightbox with loupe\" srcset=\"https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with.jpeg 2048w, https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with-400x267.jpeg 400w, https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with-1024x683.jpeg 1024w, https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with-768x512.jpeg 768w, https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with-1536x1024.jpeg 1536w, https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with-1200x800.jpeg 1200w, https://www.lightstalking.com/wp-content/uploads/strips-of-black-and-white-film-on-a-lightbox-with-1980x1320.jpeg 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eBlack and white is the easiest to home process. By \u003ca href=\"https://www.pexels.com/photo/a-film-strip-with-images-8113887/\"\u003eAnnushka Ahuja on Pexels\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-film-sizes\"\u003e\u003ca id=\"post-519547-_x7cpcpmxzxow\"\u003e\u003c/a\u003eFilm Sizes\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs digital photographers you will be aware of different sensor sizes, from the very small ones on our phones to the medium format sensors of Hasselblad and Fuji. Film cameras are very much the same. At the peak of film photography in the 1990s, the smallest commercial film was Disk Film, this was really tiny and as the name suggests, each frame was placed around a disk rather than a roll.\u003c/p\u003e\n\n\n\n\u003cp\u003eNext came 110 and 126, before we got to the ubiquitous 35mm. From there we stepped up to 120/220, both the same width of film but 220 being able to take twice the number of exposure. These are commonly known as medium format. Above that we had 5×4 and 8×10 sheet film used in plate/field style cameras.\u003c/p\u003e\n\n\n\n\u003cp\u003eReturning to the modern day, 35mm, 120 and sheet films are still made and available, the smaller films are now obsolete.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma.jpeg.webp 2048w, https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma-400x267.jpeg.webp 400w, https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma-1024x683.jpeg.webp 1024w, https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma-768x512.jpeg.webp 768w, https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma-1536x1024.jpeg.webp 1536w, https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma-1200x800.jpeg.webp 1200w, https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma-1980x1320.jpeg.webp 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"2048\" height=\"1365\" src=\"https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma.jpeg\" alt=\"POV image of person holding a Bronica medium format film camera\" srcset=\"https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma.jpeg 2048w, https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma-400x267.jpeg 400w, https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma-1024x683.jpeg 1024w, https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma-768x512.jpeg 768w, https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma-1536x1024.jpeg 1536w, https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma-1200x800.jpeg 1200w, https://www.lightstalking.com/wp-content/uploads/pov-image-of-person-holding-a-bronica-medium-forma-1980x1320.jpeg 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eMedium format is within reach of many. By \u003ca href=\"https://www.pexels.com/photo/man-hands-holding-camera-27858211/\"\u003eAmar Preciado on Pexels\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-the-cameras\"\u003e\u003ca id=\"post-519547-_qyzlixumwl85\"\u003e\u003c/a\u003eThe Cameras\u003c/h2\u003e\n\n\n\n\u003cp\u003eApart from a few speciality companies, film cameras are not mass produced anymore. However there is a massive secondhand market for these cameras. The recent resurgence of \u003ca href=\"https://www.lightstalking.com/film-photography-era/\"\u003efilm photography\u003c/a\u003e has pushed up the price of these significantly, however they are still bargains compared to modern mirrorless cameras.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs you might guess, the camera you buy determines the film that it requires. By far the most commonly used format is 35mm and there are two main camera types you will find. The SLR is the direct predecessor to the modern DSLR and shares a lot of the same ergonomics. Secondly there are the compact, rangefinder cameras. These can be as simple as the excellent Olympus Trip all the way through to Leica Ms with their interchangeable lenses.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera.jpeg.webp 2048w, https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera-400x267.jpeg.webp 400w, https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera-1024x683.jpeg.webp 1024w, https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera-768x512.jpeg.webp 768w, https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera-1536x1024.jpeg.webp 1536w, https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera-1200x800.jpeg.webp 1200w, https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera-1980x1320.jpeg.webp 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"2048\" height=\"1365\" src=\"https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera.jpeg\" alt=\"Person loading a 35mm film into a camera\" srcset=\"https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera.jpeg 2048w, https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera-400x267.jpeg 400w, https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera-1024x683.jpeg 1024w, https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera-768x512.jpeg 768w, https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera-1536x1024.jpeg 1536w, https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera-1200x800.jpeg 1200w, https://www.lightstalking.com/wp-content/uploads/person-loading-a-35mm-film-into-a-camera-1980x1320.jpeg 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eLoading film takes some practice. By \u003ca href=\"https://www.pexels.com/photo/film-in-analogue-camera-16154737/\"\u003eVinh Vo on Pexels \u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eMedium format, 120 film gets a little more complicated and a lot more expensive, even used. The smallest medium format cameras are 645. These take 15 images on a roll of 120 and as the name suggests the frame size is 6 cm by 4.5 cm. Next we step up to 6×6, the most common medium format, then 6×7 and 6×9. Generally all these formats use different cameras. For example Mamiya did a compact 645 camera and a 6×9 Press camera whilst Hasselbald were famous for their 6×6 cameras.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs a newcomer to film photography, I would strongly recommend a \u003ca href=\"https://www.lightstalking.com/returning-to-film-photography/\"\u003e35mm SLR camera\u003c/a\u003e. These are the cheapest and most available. Buy from a reputable used dealer rather than eBay or marketplace. This will ensure that the camera is in good working order. Things to look out for are light leaks, slow running shutters and electrical issues.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can also break down SLRs into two main eras. Pre 1990s, cameras were mainly manual focus, manual film wind and with fairly rudimentary exposure meters and modes. The 1990s saw the introduction of many of the features we see in modern cameras such as matrix metering and autofocus. They also often had motorized film advance built in.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-shooting-with-a-film-camera\"\u003e\u003ca id=\"post-519547-_cppmkagsn6ky\"\u003e\u003c/a\u003eShooting With A Film Camera\u003c/h2\u003e\n\n\n\n\u003cp\u003eThose used to modern digital cameras will be in for quite a culture shock. The first thing you will notice is how bright the viewfinders are, before realizing that the information in that viewfinder is severely lacking, often just an exposure scale.\u003c/p\u003e\n\n\n\n\u003cp\u003eThere will be a dial on the exterior of the body for setting ISO and this is very important to set as the wrong ISO will give you incorrectly exposed images. Plus of course, you cannot see that the images are incorrectly exposed.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov.jpeg.webp 2048w, https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov-400x225.jpeg.webp 400w, https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov-1024x576.jpeg.webp 1024w, https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov-768x432.jpeg.webp 768w, https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov-1536x864.jpeg.webp 1536w, https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov-1200x675.jpeg.webp 1200w, https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov-1980x1114.jpeg.webp 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"2048\" height=\"1152\" src=\"https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov.jpeg\" alt=\"top down view of film camera with pentaprism removed\" srcset=\"https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov.jpeg 2048w, https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov-400x225.jpeg 400w, https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov-1024x576.jpeg 1024w, https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov-768x432.jpeg 768w, https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov-1536x864.jpeg 1536w, https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov-1200x675.jpeg 1200w, https://www.lightstalking.com/wp-content/uploads/top-down-view-of-film-camera-with-pentaprism-remov-1980x1114.jpeg 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eShooting on a film camera is a culture shock. By \u003ca href=\"https://www.pexels.com/photo/black-camera-3630742/\"\u003ePratik Gupta on Pexels\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eOn older cameras, focussing can be quite a challenge. Even more modern autofocus film cameras were slow and unreliable. Focusing manually, you would have the viewfinder’s fresnel screen or split screen. If you have less than stellar eyesight, this can be quite a challenge.\u003c/p\u003e\n\n\n\n\u003cp\u003eLoading film requires dexterity and practice. Getting the end of the film into the slots on the spool can be hard and often different cameras have slightly different ways to achieve this. One tip for manually wound cameras, is to watch the film rewind lever after loading the film. If this turns as you wind the film on, it is loaded correctly.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou are going to need to get used to shooting either 24 or 36 frames before needing to change the film but more importantly not 100% knowing whether you have nailed the shot until you get the films processed. Speaking of which.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-film-processing-and-printing\"\u003e\u003ca id=\"post-519547-_5qobx7w6ylu7\"\u003e\u003c/a\u003eFilm Processing and Printing\u003c/h2\u003e\n\n\n\n\u003cp\u003eAt the top I mentioned the three main types of photographic film, colour and black and white negative film and transparency. Each of these has a different way of being processed. Standard black and white film is actually pretty easy to process yourself, however you need to have a dust free environment to do it. You don’t actually \u003ca href=\"https://www.lightstalking.com/set-cheap-darkroom-today/\"\u003eneed a darkroom\u003c/a\u003e as you can load the film into a processing tank inside a dark bag. This can be a bit fiddly at first but becomes second nature with practice. Once the film is in the drum you can do the actual processing in light.\u003c/p\u003e\n\n\n\n\u003cp\u003eBoth colour negative and slide films require much more complicated processing that are really best suited to a professional lab. Slide/transparency film, in particular, is very prone to colour variations when processed.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white.jpeg.webp 2048w, https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white-400x267.jpeg.webp 400w, https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white-1024x683.jpeg.webp 1024w, https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white-768x512.jpeg.webp 768w, https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white-1536x1024.jpeg.webp 1536w, https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white-1200x800.jpeg.webp 1200w, https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white-1980x1320.jpeg.webp 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"2048\" height=\"1365\" src=\"https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white.jpeg\" alt=\"Man in darkroom preparing to print black and white film under red light\" srcset=\"https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white.jpeg 2048w, https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white-400x267.jpeg 400w, https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white-1024x683.jpeg 1024w, https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white-768x512.jpeg 768w, https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white-1536x1024.jpeg 1536w, https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white-1200x800.jpeg 1200w, https://www.lightstalking.com/wp-content/uploads/man-in-darkroom-preparing-to-print-black-and-white-1980x1320.jpeg 1980w\" sizes=\"(max-width: 2048px) 100vw, 2048px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eBlack and white processing and printing is not hard. By \u003ca href=\"https://www.pexels.com/photo/light-person-camera-photographer-7205374/\"\u003eTima Miroshnichenko on. Pexels\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIf you do not want to go down the home processing route, most labs will also offer black and white processing. These days there are plenty of processing labs available although they are unlikely to be local. You usually have to post your film in, and wait a week or two. The lab will probably offer processing and printing or processing with scans only.\u003c/p\u003e\n\n\n\n\u003cp\u003ePrinting colour or black and white negative films has two options. You can print directly from the negative onto photographic paper, or you can scan the negative and print on a home printer. Most modern labs will actually be scanning your negative although that scan will be output to real photographic paper.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe more ambitious amongst you might want to try printing black and white at home. Although you can print under a red light, your darkroom must be completely sealed from any external white light.\u003c/p\u003e\n\n\n\n\u003cp\u003eEnlargers and processing trays are readily available, and most decent camera stores stock the processing chemicals. It’s not a difficult task to print black and white yet, immensely satisfying.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo that’s my brief beginners guide to film photography. Film photography is a wonderful medium that can teach you patience, the value of an image and a deep understanding of exposure. It can be relatively expensive compared to digital but can give great satisfaction.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-05-27T12:00:00Z",
  "modifiedTime": null
}
