{
  "id": "1dc7b278-e52e-495d-be45-4c5ba46bcb4f",
  "title": "SLC-1L-11: Planting Rice at Sunrise",
  "link": "http://strobist.blogspot.com/2020/07/slc-1l-11-planting-rice-at-sunrise.html",
  "description": "Seeing as no one is doing much traveling these days, I thought it'd be fun to pay a visit with a Strobist reader photographing somewhere far away. Up for a little Lighting Cookbook field trip to Indonesia? Yeah? Then let's go... Read more »",
  "author": "David Hobby",
  "published": "Mon, 13 Jul 2020 23:24:00 +0000",
  "source": "http://feeds.feedburner.com/blogspot/WOBq",
  "categories": null,
  "byline": "",
  "length": 6055,
  "excerpt": "The world's most popular free resource for learning how to use off-camera flash.",
  "siteName": "",
  "favicon": "",
  "text": "Seeing as no one is doing much traveling these days, I thought it'd be fun to pay a visit with a Strobist reader photographing somewhere far away. Up for a little Lighting Cookbook field trip to Indonesia? Yeah? Then let's go... __________ Our local guide and guest photographer for this trip is Mr. Tommy Soebagjo. He divides his time between the cities of Bekasi and Surakarta on Java, one of the main islands among the over 17,000 islands that comprise Indonesia. Java is the economic center of the Southeast Asian nation, and features the city of Jakarta on its west end and a lot of volcanoes scattered all over the island. That's Tommy, above, whom I first met via Instagram. Trapped at home these days, I currently do a lot of my travel vicariously through Instagram. I follow hashtags of places I know and love, and places I can't wait to visit when all of this COVID-19 mess is over. The former list includes places like Hanoi, Vietnam and Lisbon, Portugal. And the latter definitely includes Indonesia. I mean, how could I not want to visit there? Cool and industrious people, amazing scenery, fantastic food, and a killer Vespa modding community: I mean, dude. And then to top it all off, there's the ID-Strobist community. They are a super active bunch, with social get-togethers, classes, and a general vibe of people of different experience levels helping each other in all sorts of ways. Which, through their Instagram account that I follow, is how I came across the photo above by Tommy. After I reached out to him via Instagram's messaging function, he wrote back and graciously shared some of the details of this particular outing and the resulting photo. So let's ride along.We're Getting Up Early Tommy is a sculptor by trade and a photographer by avocation. He says he often leaves his house as early as 2:00am to get to a good site in time to photograph the sunrise. But for this particular morning we get to sleep in a bit, as he is not leaving until 4:00am. Fun little aside: I have a friend, Chris Hurtt, who used to lead landscape photography workshops in the San Fransisco area. People would take them to get access to great locations and to finally learn the magic f/stop to get beautiful landscape photos. As we all know, there is no magic f/stop. But there is a time-worn secret: get your butt out of bed really early and be in all set and in place before the other blue hour starts to happen. There is no crowd at 5:00am. No one is gonna call the cops on you. You can pretty much shoot anywhere without a permit. Because everyone is asleep. Seriously, at 5:00am, the world is your oyster. In the west, lots of successful photographers have started out this way, taking advantage of the cloak of early morning. Tommy is similarly industrious. He loads his photo gear onto his Honda Vario scooter and heads out into the pre-dawn darkness from Surakarta, traveling east en route to Tawangmangu which is 25 miles away. But about 20 miles into his trip, he spots some freelance rice planters working the paddies. With one of Java's volcanoes, Mt. Lawu, serving as a backdrop. So he stops. (And yeah, I would have stopped, too.)It's Also About the Journey Having a camera with you is a great excuse to go up and talk to someone. Which is how you meet interesting people and learn cool things. Which in turn is how you form great memories, that you then cement with beautiful photos. What a deal. So Tommy hops off his motorbike and strikes up a conversation with the ladies planting in the field. These ladies were happy to tell him all about what they do. As freelance rice planters, their job is to transplant the rice shoots, spaced out, into the flooded paddies by hand. During the transplanting season, they work from 5am until 11am every day. The calendar won't wait; no days off until you are finished. Over the next three-to-four months, the rice plants fill in the gaps and finally become ready for harvest — also by hand. One of our X-Peditions trips to Vietnam is timed to the rice harvest. Beginning to end, this is hard, manual work. Honestly, I'll never look at a bowl of rice the same way again. And stopping to make the photo is what gives you the access to the conversation. Which also makes the photo that much more meaningful to you later. Tommy asked and got permission to make pictures as the ladies were planting. They continued to talk the whole time he was shooting. Tommy set up his Godox TT685 speedlight on a stand about 17 feet away from the ladies, low and positioned at far camera left. (Moving it back this far gives him, of course, a more even throw of light across the scene.) He set the flash to full power, using no modifier. This gave him a working aperture of f/8 at ISO 400 on the people in his scene. At this point, it's just a matter of choosing the shutter speed that gives him the best sky — which the water in the flooded paddy is helpfully reflecting. He went with 1/125th of a second. Here's a pullback showing the whole, simple setup: I think the photo at top (and, honestly, the BTS pic too) is gorgeous. And I also love that by posting it to Instagram, Tommy has allowed us to vicariously share the experience. He even tagged the exact area in Google Maps for us: How cool is that? And of COURSE Google has already had a street view crew through there (most likely, on the back of a motor scooter). As a result, I just spent the last 20 minutes or so exploring the area as if I was there. __________ Thanks to Tommy, to Instagram, to the ID-Strobist group, to Google for all pitching in to give us an armchair trip while we are (at least in the US) stuck at home. I very much look forward for things to get back to normal, offering the chance to explore places like Java in person. Photos ©2020 Tommy Soebagjo, used with permission. __________ This article was published as an entry in Strobist Lighting Cookbook. New articles and how-to's appear monthly. To receive notifications for new posts, you can follow via email or via Instagram.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhFeraISC7hRjrXThr9pap3iHK3WSLw2cYO16BXyXIpJeW4Kkahsp2JCqfu2sVKk1e3K8eYamChvKRJlQ1Ye6MUyytTm2VDV6LYn4nMP8H3e0nF43W_e-Md2I02PZg3IPzN0DZ7/s1600/Tanam+Padi+%255BFor+David%255D-1600.jpg\" imageanchor=\"1\"\u003e\u003cimg src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhFeraISC7hRjrXThr9pap3iHK3WSLw2cYO16BXyXIpJeW4Kkahsp2JCqfu2sVKk1e3K8eYamChvKRJlQ1Ye6MUyytTm2VDV6LYn4nMP8H3e0nF43W_e-Md2I02PZg3IPzN0DZ7/s400/Tanam+Padi+%255BFor+David%255D-1600.jpg\" width=\"400\" height=\"279\" data-original-width=\"1600\" data-original-height=\"1115\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\n\nSeeing as no one is doing much traveling these days, I thought it\u0026#39;d be fun to pay a visit with a Strobist reader photographing somewhere far away. \u003c/p\u003e\u003cp\u003e\n\nUp for a little Lighting Cookbook field trip to Indonesia? Yeah? Then let\u0026#39;s go... \u003ca name=\"more\"\u003e\u003c/a\u003e\u003cbr/\u003e\n__________\u003c/p\u003e\u003cp\u003e\n\nOur local guide and guest photographer for this trip is Mr. Tommy Soebagjo. He divides his time between the cities of Bekasi and Surakarta on Java, one of the main islands among the over 17,000 islands that comprise Indonesia. Java is the economic center of the Southeast Asian nation, and features the city of Jakarta on its west end and \u003ci\u003ea lot\u003c/i\u003e of \u003ca href=\"https://en.wikipedia.org/wiki/Volcanology_of_Java\" target=\"_blank\"\u003evolcanoes scattered all over the island\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\n\n\u003ca href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg3Sl7JL2y8EaEM1CURINjsynC58BfjOzhU9jaKWN37GowcZNQyeacbvwLEfs67tdFM1lLy9LOajQ-WE-zrhECkovl1q44QsN-bblc8UDG6XrOonMhkZt01fcwK2HFNk4oEZXQg/s1600/Tommy-800.jpg\" imageanchor=\"1\"\u003e\u003cimg src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg3Sl7JL2y8EaEM1CURINjsynC58BfjOzhU9jaKWN37GowcZNQyeacbvwLEfs67tdFM1lLy9LOajQ-WE-zrhECkovl1q44QsN-bblc8UDG6XrOonMhkZt01fcwK2HFNk4oEZXQg/s400/Tommy-800.jpg\" width=\"400\" height=\"263\" data-original-width=\"800\" data-original-height=\"526\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\n\nThat\u0026#39;s Tommy, above, whom I first met via Instagram. Trapped at home these days, I currently do a lot of my travel vicariously through Instagram. I follow hashtags of places I know and love, and places I can\u0026#39;t wait to visit when all of this COVID-19 mess is over.\u003c/p\u003e\u003cp\u003e\n\nThe former list includes places like Hanoi, Vietnam and Lisbon, Portugal. And the latter definitely includes Indonesia. I mean, how could I not want to visit there? Cool and industrious people, amazing scenery, fantastic food, and a killer Vespa modding community:\u003c/p\u003e\u003ciframe width=\"425\" height=\"240\" src=\"https://www.youtube.com/embed/cK-pUoCBc-4\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003cp\u003e\n\nI mean, \u003ci\u003edude.\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\n\nAnd then to top it all off, there\u0026#39;s the \u003ca href=\"https://www.instagram.com/idstrobist/?hl=en\" target=\"_blank\"\u003eID-Strobist community\u003c/a\u003e. They are a super active bunch, with social get-togethers, classes, and a general vibe of people of different experience levels helping each other in all sorts of ways.\u003c/p\u003e\u003cp\u003e\n\n\u003ca href=\"https://www.instagram.com/idstrobist/?hl=en\" target=\"_blank\" imageanchor=\"1\"\u003e\u003cimg src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiO5leTEo29KkKQHCiiaZEPPAQVC21WpZmkuFFLwoe_oiEnXVewOjR-XoRaq31jNfAh-Vie_fJmGBg-suZUGz77NJESeHLKnZXuVlMEwha34ngEZKYv-5s-m7VzXf1OVHav2m3A/s1600/Screen+Shot+2020-07-13+at+8.33.02+PM.jpg\" data-original-width=\"400\" data-original-height=\"529\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\n\nWhich, through their Instagram account that I follow, is how I came across the photo above by \u003ca href=\"https://www.instagram.com/tommysoebagjo/\" target=\"_blank\"\u003eTommy\u003c/a\u003e. After I reached out to him via Instagram\u0026#39;s messaging function, he wrote back and graciously shared some of the details of this particular outing and the resulting photo.\u003c/p\u003e\u003cp\u003e\n\nSo let\u0026#39;s ride along.\u003c/p\u003e\u003cp\u003e\u003cspan size=\"4\"\u003eWe\u0026#39;re Getting Up Early\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\n\nTommy is a sculptor by trade and a photographer by avocation. He says he often leaves his house as early as 2:00am to get to a good site in time to photograph the sunrise. But for this particular morning we get to sleep in a bit, as he is not leaving until 4:00am.\u003c/p\u003e\u003cp\u003e\n\nFun little aside: I have a friend, Chris Hurtt, who used to lead landscape photography workshops in the San Fransisco area. People would take them to get access to great locations and to finally learn the magic f/stop to get beautiful landscape photos.\u003c/p\u003e\u003cp\u003e\n\nAs we all know, there is no magic f/stop. But there is a time-worn secret: get your butt out of bed really early and be in all set and in place before the \u003ci\u003eother\u003c/i\u003e blue hour starts to happen. \u003c/p\u003e\u003cp\u003e\n\nThere is no crowd at 5:00am. No one is gonna call the cops on you. You can pretty much shoot anywhere without a permit. Because everyone is asleep.\u003c/p\u003e\u003cp\u003e\n\nSeriously, at 5:00am, the world is your oyster. In the west, lots of successful photographers have \u003ca href=\"https://strobist.blogspot.com/2011/03/miller-mobley-on-making-work-for-your.html\"\u003estarted out this way\u003c/a\u003e, taking advantage of the cloak of early morning.\u003c/p\u003e\u003cp\u003e\n\nTommy is similarly industrious. He loads his photo gear onto his Honda Vario scooter and heads out into the pre-dawn darkness from Surakarta, traveling east en route to Tawangmangu which is 25 miles away. But about 20 miles into his trip, he spots some freelance rice planters working the paddies. With one of Java\u0026#39;s volcanoes, Mt. Lawu, serving as a backdrop. \u003c/p\u003e\u003cp\u003e\n\nSo he stops. (And yeah, I would have stopped, too.)\u003c/p\u003e\u003cp\u003e\u003cspan size=\"4\"\u003eIt\u0026#39;s Also About the Journey\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\n\nHaving a camera with you is a great excuse to go up and talk to someone. Which is how you meet interesting people and learn cool things. Which in turn is how you form great memories, that you then cement with beautiful photos. What a deal.\u003c/p\u003e\u003cp\u003e\n\nSo Tommy hops off his motorbike and strikes up a conversation with the ladies planting in the field. These ladies were happy to tell him all about what they do. As freelance rice planters, their job is to transplant the rice shoots, spaced out, into the flooded paddies by hand. During the transplanting season, they work from 5am until 11am every day. The calendar won\u0026#39;t wait; no days off until you are finished.\u003c/p\u003e\u003cp\u003e\n\nOver the next three-to-four months, the rice plants fill in the gaps and finally become ready for harvest — also by hand. \u003c/p\u003e\u003cp\u003e\n\nOne of our X-Peditions trips to Vietnam is \u003ca href=\"https://x-peditions.com/hanoi-workshop-september-2020/\"\u003etimed to the rice harvest\u003c/a\u003e. Beginning to end, this is hard, manual work. Honestly, I\u0026#39;ll never look at a bowl of rice the same way again.\u003c/p\u003e\u003cp\u003e\n\nAnd stopping to make the photo is what gives you the access to the conversation. Which also makes the photo that much more meaningful to you later. Tommy asked and got permission to make pictures as the ladies were planting.\u003c/p\u003e\u003cp\u003e\n\nThey continued to talk the whole time he was shooting.\u003c/p\u003e\u003cp\u003e\n\nTommy set up his Godox TT685 speedlight on a stand about 17 feet away from the ladies, low and positioned at far camera left. (Moving it back this far gives him, of course, a \u003ca href=\"https://strobist.blogspot.com/2016/07/lighting-102-distance.html\"\u003emore even throw of light\u003c/a\u003e across the scene.) He set the flash to full power, using no modifier. This gave him a working aperture of f/8 at ISO 400 on the people in his scene.\u003c/p\u003e\u003cp\u003e\n\nAt this point, it\u0026#39;s just a matter of choosing the shutter speed that gives him the best sky — which the water in the flooded paddy is helpfully reflecting. He went with 1/125th of a second.\u003c/p\u003e\u003cp\u003e\n\nHere\u0026#39;s a pullback showing the whole, simple setup:\u003c/p\u003e\u003cp\u003e\n\n\u003ca href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg2xThpfVo_-LbNY0y05bG2D3t5taH2XrdAk_XsNcy-a4DZegd_gFk2jIb_3xffqoVK8QknfIsduQ6lW3m95Jz7ymH7JD5fdlHbBvykQ7kyHdSKkGkFK8OSFelpVwIjqmMwDCxE/s1600/BTS+%255BFor+David%255D-1600.jpg\" imageanchor=\"1\"\u003e\u003cimg src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg2xThpfVo_-LbNY0y05bG2D3t5taH2XrdAk_XsNcy-a4DZegd_gFk2jIb_3xffqoVK8QknfIsduQ6lW3m95Jz7ymH7JD5fdlHbBvykQ7kyHdSKkGkFK8OSFelpVwIjqmMwDCxE/s400/BTS+%255BFor+David%255D-1600.jpg\" width=\"400\" height=\"240\" data-original-width=\"1600\" data-original-height=\"959\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\n\nI think the photo at top (and, honestly, the BTS pic too) is gorgeous. And I also love that by posting it to Instagram, Tommy has allowed us to vicariously share the experience.\u003c/p\u003e\u003cp\u003e\n\nHe even tagged the exact area in Google Maps for us:\u003c/p\u003e\u003cp\u003e\n\nHow cool is that? And of COURSE Google has already had a street view crew through there (most likely, on the back of a motor scooter). As a result, I just spent the last 20 minutes or so exploring the area as if I was there.\u003cbr/\u003e\n__________\u003c/p\u003e\u003cp\u003e\n\n\nThanks to Tommy, to Instagram, to the ID-Strobist group, to Google for all pitching in to give us an armchair trip while we are (at least in the US) stuck at home.\u003c/p\u003e\u003cp\u003e\n\nI very much look forward for things to get back to normal, offering the chance to explore places like Java in person.\u003c/p\u003e\u003cp\u003e\n\n\u003ci\u003ePhotos ©2020 Tommy Soebagjo, used with permission.\u003c/i\u003e\u003cbr/\u003e\n__________\u003c/p\u003e\u003cp\u003e\n\n\n\u003ci\u003eThis article was published as an entry in \u003ca href=\"http://strobist.blogspot.com/2017/11/strobist-lighting-cookbook.html\"\u003eStrobist Lighting Cookbook\u003c/a\u003e. New articles and how-to\u0026#39;s appear monthly. To receive notifications for new posts, you can follow via \u003ca href=\"http://www.feedburner.com/fb/a/emailverifySubmit?feedId=1138352\u0026amp;loc=en_US\"\u003eemail\u003c/a\u003e or via \u003ca href=\"https://www.instagram.com/strobistlightingcookbook/\"\u003eInstagram\u003c/a\u003e.\u003c/i\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
