{
  "id": "1f55acbd-3d4b-49b1-97d0-5cc5e549d8f2",
  "title": "April 2025 Photo Contest Winners: The Essence Of Movement",
  "link": "https://www.lightstalking.com/the-essence-of-movement-winners/",
  "description": "April's contest theme was \"The Essence Of Movement\" and the images submitted to the contest were varied, with images from nature, setups, events like dance, sports and the participants used different techniques like panning, long exposure, zoom effect, motion blur, intentional camera movement and even freezing the moment to capture their shots. The post April 2025 Photo Contest Winners: The Essence Of Movement appeared first on Light Stalking.",
  "author": "",
  "published": "Tue, 20 May 2025 12:00:00 +0000",
  "source": "https://www.lightstalking.com/feed/",
  "categories": [
    "Cool Photos \u0026 Photographers"
  ],
  "byline": "Rob Wood (Admin)",
  "length": 6208,
  "excerpt": "April's contest theme was 'The Essence Of Movement' and the images submitted to the contest were varied, with images from nature, setups, events like dance, sports and the participants used different techniques like panning, long exposure, zoom effect, motion blur, intentional camera movement and even freezing the moment to capture their shots.",
  "siteName": "Light Stalking",
  "favicon": "",
  "text": "We're happy to announce the winner of April's competition “The Essence Of Movement.” For those who don't know, the Light Stalking Monthly Photography Competition carries a $100 People's Choice Award and a $250 Overall Winner Award. The People's Choice Winner is selected by a vote of the community, whereas our guest judge selects the overall winner. Capturing movement in photography is a great way to show dynamism in an otherwise static scene. Most action scenes would benefit from either freezing movements or capturing the movements in the form of motion blur in order to tell the story effectively and photographers will need to study and understand the scene and use the right settings, especially the camera's shutter speed to get the results they desire. Besides the above, for a moving subject, tracking focus will be a great feature to use when capturing movements. The photographer can track the subject's movement while allowing the background to blur and show movement or can allow the subject to blur and keep the background static. All these depend on the photographer's creative vision and what they intend to capture. Movements in photography can be captured in various ways – one can freeze a moment if desired, using a very fast shutter speed, or use techniques like motion blur, panning, long exposures, etc. This can be done with elements in nature or scenes from day to day life. April's contest theme was “The Essence Of Movement” and the images submitted to the contest were varied, with images from nature, setups, events like dance, sports and the participants used different techniques like panning, long exposure, zoom effect, motion blur, intentional camera movement and even freezing the moment to capture their shots. When choosing the winning photos, we wanted to make sure that the decision process was based on a good interpretation of the theme followed by other factors like light, composition, story, details, creative vision / thought, etc. The results are entirely subjective and there are no losers in any competition as we all know.  Here are April's winners: First Place: “Happiness in Action” by Jean T Happiness in Action – Copyright Jean T Jean T has used motion blur to capture the story and he has chosen the right shutter speed to capture enough details, while still showing movement in the photo. The image of the two subjects enjoying the ice skating moment tells the story beautifully though their pose and Jean made sure to capture the right moment. Jean has also made sure to not include any more subjects from the scene and to focus on just the two subjects and their interaction. The muted colours in the frame contribute to the cold atmosphere and the exposure is just right to capture some details of the ice and not have any clippings in the bright areas. Congratulations on the win Jean and the painterly look of the photo is just beautiful! Second Place: “Rush” by Patrick Speed and Dynamism – Copyright Patrick The photo “Rush” by Patrick shows speed and dynamism as the description provided by Patrick. Patrick has chosen the right shutter speed and used the panning technique to capture movement in the scene. The movement in the frame is evident on the subject, the bicycle and the background, but Patrick has made sure to keep the subject's face in focus. The lines in the frame work together as great compositional elements pointing towards the subject and then the direction of movement of the subject. Patrick's choice to convert the image to black and white has worked really well allowing the viewer to just focus on the subject and not get distracted by anything else in the frame. Congratulations Patrick for this well thought and executed shot! Third Place: “Fast Flyer” by Pat Garrett Fast Flyer – Copyright Pat Garrett The photo “Fast Flyer” by Pat stands true to the title. Hummingbirds are generally difficult to photograph because of their rapid movements and their smaller size. Pat has used the right shutter speed to capture great details on the bird, especially the eyes. Without very fast shutter speeds, it can be difficult to capture wing details of the humming bird, but Pat has again made use of the right choice for shutter speed to show wing movement, but also managed to preserve details on both the wings which makes the resulting image look perfect. Also the negative space around the hummingbird, especially more in the direction that it is looking, helps to keep the composition in balance. The slight blur on the birds legs also contribute to the movements captured in the image. Congratulations on this amazing shot Pat! People's Choice Award Winner Our monthly photo contests also come with a People's Choice Award. The winner of this part of the contest receives $100 worth of store credit on Lightstalking which they can spend as they please on our blueprints, drills, courses or Presets. Water Drops Colliding – Copyright Frogdaily The most popular photo for April, voted by the contestants was “Water Drops Colliding” by Frogdaily which has won the people's choice award. Frogdaily has made use of the right setup that includes light, background and shutter speed to execute this shot. The lighting used and the moment captured is so perfect with the rule of odds in play and the three layers work well together by sharing an interesting connection, while the top layer makes the image even more interesting by breaking repetition. The monochrome treatment makes the image stand out and lets the viewer focus on the shapes/forms of the water drops. The black background really makes the water drops stand out by detailing the lines and textures created by light and water drops splashing. Congratulations Frogdaily on the win and a beautifully made image. We are two weeks into this month's photo contest and still have two weeks left to submit photos to our May's monthly contest. It has already seen some entries with interesting submissions. This month our theme is “Storytelling In A Single Frame.” If you would like to join and enter some images into our monthly contest then take a look at your options here.",
  "image": "https://www.lightstalking.com/wp-content/uploads/Happiness-in-Action-by-Jean-T.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"site-content\" role=\"main\"\u003e\n\t\n\u003carticle id=\"post-519751\"\u003e\n\t\n\t\u003cdiv\u003e\n\t\t\t\t\n\u003cp\u003eWe\u0026#39;re happy to announce the winner of April\u0026#39;s competition “The Essence Of Movement.”\u003c/p\u003e\n\n\n\n\u003cp\u003eFor those who don\u0026#39;t know, the \u003ca href=\"https://www.lightstalking.com/photography-contest/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLight Stalking Monthly Photography Competition\u003c/a\u003e carries a $100 People\u0026#39;s Choice Award and a $250 Overall Winner Award. The People\u0026#39;s Choice Winner is selected by a vote of the community, whereas our guest judge selects the overall winner.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eCapturing movement in photography is a great way to show dynamism in an otherwise static scene.  Most action scenes would benefit from either freezing movements or capturing the movements in the form of motion blur in order to tell the story effectively and photographers will need to study and understand the scene and use the right settings, especially the camera\u0026#39;s shutter speed to get the results they desire. \u003c/p\u003e\n\n\n\n\u003cp\u003eBesides the above, for a moving subject, tracking focus will be a great feature to use when capturing movements. The photographer can track the subject\u0026#39;s movement while allowing the background to blur and show movement or can allow the subject to blur and keep the background static. All these depend on the photographer\u0026#39;s creative vision and what they intend to capture.\u003c/p\u003e\n\n\n\n\u003cp\u003eMovements in photography can be captured in various ways – one can freeze a moment if desired, using a very fast shutter speed, or use techniques like motion blur, panning, long exposures, etc. This can be done with elements in nature or scenes from day to day life. \u003c/p\u003e\n\n\n\n\u003cp\u003eApril\u0026#39;s contest theme was “The Essence Of Movement” and the images submitted to the contest were varied, with images from nature, setups, events like dance, sports and the participants used different techniques like panning, long exposure, zoom effect, motion blur, intentional camera movement and even freezing the moment to capture their shots. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhen choosing the winning photos, we wanted to make sure that the decision process was based on a good interpretation of the theme followed by other factors like light, composition, story, details, creative vision / thought, etc. The results are entirely subjective and there are no losers in any competition as we all know. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eHere are April\u0026#39;s winners:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-first-place-happiness-in-action-by-jean-t\"\u003eFirst Place: “Happiness in Action” by Jean T\u003c/h2\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/Happiness-in-Action-by-Jean-T-1024x683.jpg.webp 1024w, https://www.lightstalking.com/wp-content/uploads/Happiness-in-Action-by-Jean-T-400x267.jpg.webp 400w, https://www.lightstalking.com/wp-content/uploads/Happiness-in-Action-by-Jean-T-768x512.jpg.webp 768w, https://www.lightstalking.com/wp-content/uploads/Happiness-in-Action-by-Jean-T.jpg.webp 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"1024\" height=\"683\" src=\"https://www.lightstalking.com/wp-content/uploads/Happiness-in-Action-by-Jean-T-1024x683.jpg\" alt=\"\" srcset=\"https://www.lightstalking.com/wp-content/uploads/Happiness-in-Action-by-Jean-T-1024x683.jpg 1024w, https://www.lightstalking.com/wp-content/uploads/Happiness-in-Action-by-Jean-T-400x267.jpg 400w, https://www.lightstalking.com/wp-content/uploads/Happiness-in-Action-by-Jean-T-768x512.jpg 768w, https://www.lightstalking.com/wp-content/uploads/Happiness-in-Action-by-Jean-T.jpg 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eHappiness in Action – Copyright Jean T\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eJean T has used motion blur to capture the story and he has chosen the right shutter speed to capture enough details, while still showing movement in the photo. The image of the two subjects enjoying the ice skating moment tells the story beautifully though their pose and Jean made sure to capture the right moment. \u003c/p\u003e\n\n\n\n\u003cp\u003eJean has also made sure to not include any more subjects from the scene and to focus on just the two subjects and their interaction. The muted colours in the frame contribute to the cold atmosphere and the exposure is just right to capture some details of the ice and not have any clippings in the bright areas.\u003c/p\u003e\n\n\n\n\u003cp\u003eCongratulations on the win Jean and the painterly look of the photo is just beautiful!\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-second-place-rush-by-patrick\"\u003eSecond Place: “Rush” by Patrick\u003c/h2\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-1024x683.jpg.webp 1024w, https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-400x267.jpg.webp 400w, https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-768x512.jpg.webp 768w, https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-1536x1024.jpg.webp 1536w, https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-1200x800.jpg.webp 1200w, https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-1980x1320.jpg.webp 1980w, https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick.jpg.webp 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"1024\" height=\"683\" src=\"https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-1024x683.jpg\" alt=\"\" srcset=\"https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-1024x683.jpg 1024w, https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-400x267.jpg 400w, https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-768x512.jpg 768w, https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-1536x1024.jpg 1536w, https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-1200x800.jpg 1200w, https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick-1980x1320.jpg 1980w, https://www.lightstalking.com/wp-content/uploads/Rush-by-Patrick.jpg 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eSpeed and Dynamism – Copyright Patrick\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eThe photo “Rush” by Patrick shows speed and dynamism as the description provided by Patrick. Patrick has chosen the right shutter speed and used the panning technique to capture movement in the scene. The movement in the frame is evident on the subject, the bicycle and the background, but Patrick has made sure to keep the subject\u0026#39;s face in focus.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe lines in the frame work together as great compositional elements pointing towards the subject and then the direction of movement of the subject. Patrick\u0026#39;s choice to convert the image to black and white has worked really well allowing the viewer to just focus on the subject and not get distracted by anything else in the frame.\u003c/p\u003e\n\n\n\n\u003cp\u003eCongratulations Patrick for this well thought and executed shot!\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-third-place-fast-flyer-by-pat-garrett\"\u003eThird Place: “Fast Flyer” by Pat Garrett\u003c/h2\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-1024x669.jpg.webp 1024w, https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-400x261.jpg.webp 400w, https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-768x502.jpg.webp 768w, https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-1536x1004.jpg.webp 1536w, https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-1200x784.jpg.webp 1200w, https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-1980x1294.jpg.webp 1980w, https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat.jpg.webp 2000w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"1024\" height=\"669\" src=\"https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-1024x669.jpg\" alt=\"\" srcset=\"https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-1024x669.jpg 1024w, https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-400x261.jpg 400w, https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-768x502.jpg 768w, https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-1536x1004.jpg 1536w, https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-1200x784.jpg 1200w, https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat-1980x1294.jpg 1980w, https://www.lightstalking.com/wp-content/uploads/Fast-Flyer-by-Pat.jpg 2000w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eFast Flyer – Copyright Pat Garrett\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eThe photo “Fast Flyer” by Pat stands true to the title. Hummingbirds are generally difficult to photograph because of their rapid movements and their smaller size. Pat has used the right shutter speed to capture great details on the bird, especially the eyes.\u003c/p\u003e\n\n\n\n\u003cp\u003eWithout very fast shutter speeds, it can be difficult to capture wing details of the humming bird, but Pat has again made use of the right choice for shutter speed to show wing movement, but also managed to preserve details on both the wings which makes the resulting image look perfect. Also the negative space around the hummingbird, especially more in the direction that it is looking, helps to keep the composition in balance. The slight blur on the birds legs also contribute to the movements captured in the image.\u003c/p\u003e\n\n\n\n\u003cp\u003eCongratulations on this amazing shot Pat!\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-people-s-choice-award-winner\"\u003ePeople\u0026#39;s Choice Award Winner\u003c/h2\u003e\n\n\n\n\u003cp\u003eOur monthly photo contests also come with a People\u0026#39;s Choice Award. The winner of this part of the contest receives $100 worth of store credit on Lightstalking which they can spend as they please on our blueprints, drills, courses or Presets.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-1024x1024.png.webp 1024w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-300x300.png.webp 300w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-150x150.png.webp 150w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-768x768.png.webp 768w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-1536x1536.png.webp 1536w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-1200x1200.png.webp 1200w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-1980x1980.png.webp 1980w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-24x24.png.webp 24w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-48x48.png.webp 48w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-96x96.png.webp 96w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily.png.webp 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"1024\" height=\"1024\" src=\"https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-1024x1024.png\" alt=\"\" srcset=\"https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-1024x1024.png 1024w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-300x300.png 300w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-150x150.png 150w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-768x768.png 768w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-1536x1536.png 1536w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-1200x1200.png 1200w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-1980x1980.png 1980w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-24x24.png 24w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-48x48.png 48w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily-96x96.png 96w, https://www.lightstalking.com/wp-content/uploads/WaterDrops-Colliding-by-FrogDaily.png 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eWater Drops Colliding – Copyright Frogdaily\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eThe most popular photo for April, voted by the contestants was “Water Drops Colliding” by Frogdaily which has won the people\u0026#39;s choice award. Frogdaily has made use of the right setup that includes light, background and shutter speed to execute this shot. The lighting used and the moment captured is so perfect with the rule of odds in play and the three layers work well together by sharing an interesting connection, while the top layer makes the image even more interesting by breaking repetition.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe monochrome treatment makes the image stand out and lets the viewer focus on the shapes/forms of the water drops. The black background really makes the water drops stand out by detailing the lines and textures created by light and water drops splashing. Congratulations Frogdaily on the win and a beautifully made image.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe are two weeks into this month\u0026#39;s photo contest and still have two weeks left to submit photos to our May\u0026#39;s monthly contest. It has already seen some entries with interesting submissions. This month our theme is “Storytelling In A Single Frame.”\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you would like to join and enter some images into our monthly contest then \u003ca href=\"https://www.lightstalking.com/photography-contest/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003etake a look at your options here\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\n\t\t\t\u003c/div\u003e\n\u003c/article\u003e\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-20T12:00:00Z",
  "modifiedTime": null
}
