{
  "id": "3096c691-5500-4184-9cb3-d40f7b8b44ee",
  "title": "Cyanotype Photography: A Comprehensive Guide",
  "link": "https://digital-photography-school.com/cyanotype-photography/",
  "description": "The post Cyanotype Photography: A Comprehensive Guide appeared first on Digital Photography School. It was authored by Ana Mireles. Are you looking to try cyanotype photography but don’t know where to start? Keep on reading. Cyanotype photography has a long history, and it’s currently experiencing a strong comeback. There are many professional artists and even hobbyists using cyanotype to do some amazing things – so don’t think that, just because it’s old, it’s no […] The post Cyanotype Photography: A Comprehensive Guide appeared first on Digital Photography School. It was authored by Ana Mireles.",
  "author": "Ana Mireles",
  "published": "Thu, 02 Jan 2025 09:00:00 +0000",
  "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
  "categories": [
    "Photography Tips and Tutorials",
    "beginner",
    "creative techniques"
  ],
  "byline": "Ana Mireles",
  "length": 11342,
  "excerpt": "Cyanotype photography is a fun way to produce creative (and beautiful!) images. We share an easy, step-by-step process for amazing results.",
  "siteName": "Digital Photography School",
  "favicon": "https://digital-photography-school.com/android-chrome-192x192.png",
  "text": "Are you looking to try cyanotype photography but don’t know where to start? Keep on reading. Cyanotype photography has a long history, and it’s currently experiencing a strong comeback. There are many professional artists and even hobbyists using cyanotype to do some amazing things – so don’t think that, just because it’s old, it’s no longer relevant. In this article, I’ll show you how to make cyanotypes at home with a basic setup and a few dollars’ worth of materials. Then I’ll give you some tips and tricks to help you explore and find your own creative path. Let’s get started! What is cyanotype photography? The principles that guide photography have been around for many centuries. The camera obscura allowed people to project an image since at least 1600; the problem was that scientists and artists didn’t know how to permanently fix that projection onto a surface. The first successful commercial photography process was the daguerreotype. Its discovery was followed by the release of myriad other techniques, including the cyanotype. The cyanotype was discovered in 1842 by Sir John Herschel. The light-sensitive emulsion he created reacts to UVA radiation and creates cyan-blue prints – hence the name. Cyanotype photography became more broadly known a year later when it was published in a book called Photogenic Manipulation: Containing Plain Instructions in the Theory and Practice of the Arts of Photography. And while the process’s use has waxed and waned, it’s still a popular printing method for artists and amateurs because it’s inexpensive and easy to do. Why should you do cyanotype photography? The main reason to create cyanotypes is that you like the hands-on artistic process, or you’re at least curious to see how it’s done. However, if you’re looking for the advantages of cyanotype photography, here are a few to consider: You can do it at home You don’t need any high-tech equipment You can print on many different materials The chemicals are inexpensive and easy to find It allows you to do cameraless photography You can mix it with other media such as collage or painting How to do cyanotype photography: step by step In this section, I give you a rundown of the basic cyanotype process. Step 1: Grab your materials Happily, cyanotype photography doesn’t require expensive materials or equipment. Here’s a list of the basic items you’ll need: Cyanotype chemicals. Depending on where you live, you can find these at a local photography shop. Otherwise, you can find them online. Some photography websites have multiple options (e.g., B\u0026H). However, if you don’t live in the US, the shipping might be rather expensive, in which case I’d recommend purchasing a kit on Amazon. I use the Jacquard Cyanotype Sensitizer Set, myself. Watercolor paper. You can actually do cyanotype photography on many materials. I recommend starting off with watercolor paper because it’s inexpensive and easy to find and handle. Brush. You’ll need a brush to coat the paper with the cyanotype chemicals. Feel free to experiment with a roller, sponge, cloth, or any other material to get different textures and finishes. Water and containers. These are to prepare the formula with the chemicals you bought. Something to print. You can do cyanotype photography using anything you like. For this tutorial, I’ll do botanical cameraless images, so I’ll need flowers and leaves. However, you can use other objects or digital negatives. Glass. The glass helps the materials stay in place while you expose your cyanotype print. Clamps. These hold the glass so you can move your piece to a sunny area for easy exposure. Step 2: Prepare the formula and coat the paper To prepare the formula, you’ll need to follow the instructions provided by the manufacturer of the product you bought. You should do this in a place with dim lighting. In the case of the Jacquard Cyanotype Sensitizer Set, the instructions are printed on the back. You can also download them as a PDF on their website. Here’s how my kit works: First, fill both bottles with water. (Room temperature water from the faucet works well.) Shake the bottles and leave them to rest for 24 hrs. Mix the product from bottles A and B in equal parts. It’s important that you only mix the part that you’ll need; once the bottles are mixed, they’re only good for 2 to 4 hours. In my experience, mixing 10 mL of each bottle is good for six A4 watercolor paper sheets. Once you have your solution, use a brush or a roller to coat the paper. Step 3: Let the paper dry After you’ve coated the paper with your solution, you need to let it dry. The process can take varying times depending on the materials and the weather. In my case, it took about half an hour. Remember that you need to keep your paper away from sunlight during this process. If you don’t have a dark room or heavy curtains, you can always work in the evening and leave the materials to dry overnight. Note: When you first apply the chemicals, they’ll be light green. They then become darker and bluer as they dry. Step 4: Compose your image Once your paper is dry, go ahead and start arranging the objects you want to print in your cyanotype. Keep in mind that the areas you leave empty will be fully exposed (i.e., blue). Whatever you cover with an object will turn out white, and objects with some level of transparency will turn the paper a shade of blue. Once you have your composition, place a piece of glass on top of the paper to keep everything in place. You can use clamps to ensure the paper is well-pressed against the glass. Just be careful to avoid putting the clamp on top of a coated area. Otherwise, it won’t get exposed and you’ll have a mark ruining your cyanotype. Step 5: Expose your image Once your composition is ready, expose your cyanotype to the sunlight. The amount of time required will depend on the weather. On a sunny day, a cyanotype may take only five minutes to expose, but on heavily overcast days, you may have to wait far longer. You’ll need to experiment a bit until you get more familiar with the process under different weather conditions, though you can use this survey from Alternative Photography as a starting point. And when you’re just starting out, be sure to pay attention to the way the color of your cyanotype photograph changes as it gets exposed. Once it looks oxidized with some brownish tones, you’ll know it’s ready. Pro tip: It’s important that you don’t move the objects while you’re exposing the cyanotype. Movement will result in blurry edges! Step 6: Wash your print Now that your cyanotype is exposed, it’s time to rinse the chemicals off your print. Just put the paper under running water for a few minutes until it looks clean. If you don’t wash your print properly, the residual chemicals will continue developing when exposed to sunlight. (This will be mainly noticeable in the areas that weren’t previously exposed – instead of keeping the color of the paper, they will turn a light blue.) That’s it. Leave your cyanotype to dry, and you’re done! Cyanotype photography tips Once you’ve enjoyed a few cyanotype photography attempts, here are more tips to help you improve and produce creative results! 1. Check the UV index UV rays aren’t exclusive to bright summer days. Even when it’s cloudy outside, there’s UVA radiation, which is the reason dermatologists recommend using sunscreen every day. So before doing cyanotype photography, don’t just check the weather forecast. Also look at the UV index – because the more UV light, the faster your images will expose. Generally, faster is better, though you can also use longer exposures to produce creative effects: 2. Try long exposures When the UV index is low, you can experiment with long-exposure cyanotypes. Set up your initial composition, let it expose for a bit, then move existing elements or add new ones halfway through. You’ll end up with some elements that are more defined than others. They’ll also have different tones due to the different exposure times, which can look very cool! 3. Do a step test If you want to know the precise exposure time you’ll need for your cyanotype, you can always do a step test. The idea is to prepare paper using the process discussed above (or cut a strip from your existing cyanotype paper), then trace lines about one inch apart from one another. Start by covering most of the paper, then reveal one of the segments every minute. Keep in mind that this is helpful only if the light is constant – if, for example, you use UV lights instead of sunlight, or if the exposure is short and the weather is stable. 4. Experiment with the coating and materials Cyanotype photography is an artisanal process, which means that you should experiment with everything. For instance, the paper doesn’t need to be evenly coated from edge to edge, and you can leave visible brushstrokes to add visual interest to the edges. Also, try coating the paper using different objects (such as cloths, sponges, etc.). Additionally, I encourage you to print on different materials. By changing the type of paper, you’ll get very different results, and if you want a completely different look, go ahead and print cyanotypes on wood, fabrics, leather, glass, clay, etc. 5. Tone your prints Cyanotype photography has a very characteristic blue tone; you can change this, however, by toning your prints. For example, you can use washing soda to turn the blue to a yellow, or you can use tea to give your prints a brown tone. Cyanotype photography: final words As you can see, cyanotype photography involves a very simple process, but it’s full of possibilities! And while it takes some practice to get great results, it’s a lot of fun. I highly recommend looking for local alternative photography groups; that way, you can find folks who share your passion. You can discuss techniques and get inspired by the works of others. And if you can’t find anything locally, you can always connect with cyanotype photographers online. Actually, I recommend doing that anyway. I mean, why limit yourself to your area when there are cyanotype artists and enthusiasts worldwide? You can follow hashtags like #cyanotype, #cyanotypeprint, #cyanotypeprocess, and #wetcyano on Instagram, and you can find helpful and friendly groups on Facebook. Now over to you: Do you know of any cyanotype groups that readers can join? Share them in the comments! Also, let us know about your experiences and experiments in cyanotype photography. We’d love to hear from you. Read more from our Tips \u0026 Tutorials category Ana Mirelesis a photographer and artistic researcher. She has been awarded and exhibited in Mexico, Italy, and the Netherlands. Through theory and practice, she explores the cultural aspect of photography, how it helps us relate to each other, the world, and ourselves. She has also a passion for teaching, communication, and social media. You can find more about her and her work at her website or acquire some of her works here. I need help with...",
  "image": "https://digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00007.jpg.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\t\t\t\n\t\t\n\t\t\n\t\t\n\n\t\t\u003csection\u003e\n\t\t\t\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1200\" height=\"1254\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/04/cyanotype-photography-1005.jpg?resize=1200%2C1254\u0026amp;ssl=1\" alt=\"How to create cyanotype photography (step by step)\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/04/cyanotype-photography-1005.jpg?w=1200\u0026amp;ssl=1 1200w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/04/cyanotype-photography-1005.jpg?resize=287%2C300\u0026amp;ssl=1 287w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/04/cyanotype-photography-1005.jpg?resize=574%2C600\u0026amp;ssl=1 574w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/04/cyanotype-photography-1005.jpg?resize=768%2C803\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/04/cyanotype-photography-1005.jpg?resize=717%2C749\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eAre you looking to try cyanotype photography but don’t know where to start? Keep on reading. \u003c/p\u003e\n\n\n\n\u003cp\u003eCyanotype photography has a long history, and it’s currently experiencing a strong comeback. There are many professional artists and even hobbyists using cyanotype to do some amazing things – so don’t think that, just because it’s old, it’s no longer relevant.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn this article, I’ll show you how to make cyanotypes at home with a basic setup and a few dollars’ worth of materials. Then I’ll give you some tips and tricks to help you explore and find your own creative path. \u003c/p\u003e\n\n\n\n\u003cp\u003eLet’s get started!\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"what-is-cyanotype-photography\"\u003eWhat is cyanotype photography?\u003c/h2\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1129\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00007.jpg.jpg?resize=1500%2C1129\u0026amp;ssl=1\" alt=\"Cyanotype photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00007.jpg.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00007.jpg.jpg?resize=300%2C226\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00007.jpg.jpg?resize=600%2C452\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00007.jpg.jpg?resize=768%2C578\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00007.jpg.jpg?resize=717%2C540\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eThe principles that guide photography have been around for many centuries. The \u003ca href=\"https://digital-photography-school.com/how-do-cameras-work/\" target=\"_blank\" aria-label=\"camera obscura (opens in a new tab)\" rel=\"noreferrer noopener\"\u003ecamera obscura\u003c/a\u003e allowed people to project an image since at least 1600; the problem was that scientists and artists didn’t know how to permanently fix that projection onto a surface. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe first successful commercial photography process was the \u003ca href=\"https://digital-photography-school.com/a-short-history-of-photography-the-daguerreotype/\" target=\"_blank\" aria-label=\"daguerreotype (opens in a new tab)\" rel=\"noreferrer noopener\"\u003edaguerreotype\u003c/a\u003e. Its discovery was followed by the release of myriad other techniques, including the cyanotype.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe cyanotype was discovered in 1842 by Sir John Herschel. The light-sensitive emulsion he created reacts to UVA radiation and creates cyan-blue prints – hence the name.\u003c/p\u003e\n\n\n\n\u003cp\u003eCyanotype photography became more broadly known a year later when it was published in a book called \u003cem\u003ePhotogenic Manipulation: Containing Plain Instructions in the Theory and Practice of the Arts of Photography\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd while the process’s use has waxed and waned, it’s still a popular printing method for artists and amateurs because it’s inexpensive and easy to do.\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"why-should-you-do-cyanotype-photography\"\u003eWhy should you do cyanotype photography?\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe main reason to create cyanotypes is that you like the hands-on artistic process, or you’re at least curious to see how it’s done. However, if you’re looking for the advantages of cyanotype photography, here are a few to consider:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eYou can do it at home\u003c/li\u003e\n\n\n\n\u003cli\u003eYou don’t need any high-tech equipment\u003c/li\u003e\n\n\n\n\u003cli\u003eYou can print on many different materials\u003c/li\u003e\n\n\n\n\u003cli\u003eThe chemicals are inexpensive and easy to find\u003c/li\u003e\n\n\n\n\u003cli\u003eIt allows you to do cameraless photography\u003c/li\u003e\n\n\n\n\u003cli\u003eYou can mix it with other media such as collage or painting\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"how-to-do-cyanotype-photography-step-by-step\"\u003eHow to do cyanotype photography: step by step\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn this section, I give you a rundown of the basic cyanotype process. \u003c/p\u003e\n\n\n\n\u003ch3 data-section=\"\" id=\"step-grab-your-materials\"\u003eStep 1: Grab your materials\u003c/h3\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1129\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00001.jpg.jpg?resize=1500%2C1129\u0026amp;ssl=1\" alt=\"Cyanotype photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00001.jpg.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00001.jpg.jpg?resize=300%2C226\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00001.jpg.jpg?resize=600%2C452\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00001.jpg.jpg?resize=768%2C578\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00001.jpg.jpg?resize=717%2C540\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eHappily, cyanotype photography doesn’t require expensive materials or equipment. Here’s a list of the basic items you’ll need:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eCyanotype chemicals\u003c/strong\u003e. Depending on where you live, you can find these at a local photography shop. Otherwise, you can find them online. Some photography websites have multiple options (e.g., \u003ca aria-label=\"B\u0026amp;H (opens in a new tab)\" href=\"https://geni.us/cyanotypekitBHdPS\" target=\"_blank\" rel=\"nofollow noopenernoreferrer noopener nofollow sponsored\"\u003eB\u0026amp;H\u003c/a\u003e). However, if you don’t live in the US, the shipping might be rather expensive, in which case I’d recommend purchasing \u003ca aria-label=\"a kit on Amazon (opens in a new tab)\" href=\"https://geni.us/cyanotypekitdPS\" target=\"_blank\" rel=\"nofollow noopenernoreferrer noopener nofollow sponsored\"\u003ea kit on Amazon\u003c/a\u003e. I use the \u003ca aria-label=\"Jacquard Cyanotype Sensitizer Set (opens in a new tab)\" href=\"https://geni.us/JacquardcyanotypedPS\" target=\"_blank\" rel=\"nofollow noopenernoreferrer noopener nofollow sponsored\"\u003eJacquard Cyanotype Sensitizer Set\u003c/a\u003e, myself.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eWatercolor paper\u003c/strong\u003e. You can actually do cyanotype photography on many materials. I recommend starting off with watercolor paper because it’s inexpensive and easy to find and handle. \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eBrush\u003c/strong\u003e. You’ll need a brush to coat the paper with the cyanotype chemicals. Feel free to experiment with a roller, sponge, cloth, or any other material to get different textures and finishes.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eWater and containers\u003c/strong\u003e. These are to prepare the formula with the chemicals you bought. \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eSomething to print\u003c/strong\u003e. You can do cyanotype photography using anything you like. For this tutorial, I’ll do botanical cameraless images, so I’ll need flowers and leaves. However, you can use other objects or digital negatives. \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eGlass\u003c/strong\u003e. The glass helps the materials stay in place while you expose your cyanotype print.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eClamps\u003c/strong\u003e. These hold the glass so you can move your piece to a sunny area for easy exposure. \u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3 data-section=\"\" id=\"step-prepare-the-formula-and-coat-the-paper\"\u003eStep 2: Prepare the formula and coat the paper\u003c/h3\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1129\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00002.jpg.jpg?resize=1500%2C1129\u0026amp;ssl=1\" alt=\"Cyanotype photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00002.jpg.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00002.jpg.jpg?resize=300%2C226\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00002.jpg.jpg?resize=600%2C452\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00002.jpg.jpg?resize=768%2C578\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00002.jpg.jpg?resize=717%2C540\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eTo prepare the formula, you’ll need to follow the instructions provided by the manufacturer of the product you bought. You should do this in a place with dim lighting.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn the case of the Jacquard Cyanotype Sensitizer Set, the instructions are printed on the back. You can also download them as a PDF on their \u003ca href=\"https://www.jacquardproducts.com/cyanotype-set\" target=\"_blank\" aria-label=\" (opens in a new tab)\" rel=\"nofollow noopenernoreferrer noopener nofollow\"\u003ewebsite\u003c/a\u003e. Here’s how my kit works:\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eFirst, fill both bottles with water. (Room temperature water from the faucet works well.) Shake the bottles and leave them to rest for 24 hrs. \u003c/li\u003e\n\n\n\n\u003cli\u003eMix the product from bottles A and B in equal parts. It’s important that you only mix the part that you’ll need; once the bottles are mixed, they’re only good for 2 to 4 hours. In my experience, mixing 10 mL of each bottle is good for six A4 watercolor paper sheets.\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eOnce you have your solution, use a brush or a roller to coat the paper.\u003c/p\u003e\n\n\n\n\u003ch3 data-section=\"\" id=\"step-let-the-paper-dry\"\u003eStep 3: Let the paper dry\u003c/h3\u003e\n\n\n\n\u003cp\u003eAfter you’ve coated the paper with your solution, you need to let it dry. The process can take varying times depending on the materials and the weather. In my case, it took about half an hour. \u003c/p\u003e\n\n\n\n\u003cp\u003eRemember that you need to keep your paper away from sunlight during this process. If you don’t have a dark room or heavy curtains, you can always work in the evening and leave the materials to dry overnight. \u003c/p\u003e\n\n\n\n\u003cp\u003eNote: When you first apply the chemicals, they’ll be light green. They then become darker and bluer as they dry.\u003c/p\u003e\n\n\n\n\u003ch3 data-section=\"\" id=\"step-compose-your-image\"\u003eStep 4: Compose your image\u003c/h3\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1129\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography-composition.jpg?resize=1500%2C1129\u0026amp;ssl=1\" alt=\"Cyanotype photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography-composition.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography-composition.jpg?resize=300%2C226\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography-composition.jpg?resize=600%2C452\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography-composition.jpg?resize=768%2C578\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography-composition.jpg?resize=717%2C540\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eOnce your paper is dry, go ahead and start arranging the objects you want to print in your cyanotype. \u003c/p\u003e\n\n\n\n\u003cp\u003eKeep in mind that the areas you leave empty will be fully exposed (i.e., blue). Whatever you cover with an object will turn out white, and objects with some level of transparency will turn the paper a shade of blue. \u003c/p\u003e\n\n\n\n\u003cp\u003eOnce you have your \u003ca href=\"https://digital-photography-school.com/composition-in-photography/\" target=\"_blank\" aria-label=\"composition (opens in a new tab)\" rel=\"noreferrer noopener\"\u003ecomposition\u003c/a\u003e, place a piece of glass on top of the paper to keep everything in place. You can use clamps to ensure the paper is well-pressed against the glass.\u003c/p\u003e\n\n\n\n\u003cp\u003eJust be careful to avoid putting the clamp on top of a coated area. Otherwise, it won’t get exposed and you’ll have a mark ruining your cyanotype.\u003c/p\u003e\n\n\n\n\u003ch3 data-section=\"\" id=\"step-expose-your-image\"\u003eStep 5: Expose your image\u003c/h3\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"917\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography-exposure.jpg?resize=1500%2C917\u0026amp;ssl=1\" alt=\"Cyanotype photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography-exposure.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography-exposure.jpg?resize=300%2C183\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography-exposure.jpg?resize=600%2C367\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography-exposure.jpg?resize=768%2C470\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography-exposure.jpg?resize=717%2C438\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eOnce your composition is ready, expose your cyanotype to the sunlight. The amount of time required will depend on the weather. On a sunny day, a cyanotype may take only five minutes to expose, but on heavily overcast days, you may have to wait far longer.  \u003c/p\u003e\n\n\n\n\u003cp\u003eYou’ll need to experiment a bit until you get more familiar with the process under different weather conditions, though you can use \u003ca href=\"https://www.alternativephotography.com/the-big-cyanotype-exposure-survey-results/\" target=\"_blank\" aria-label=\" (opens in a new tab)\" rel=\"nofollow noopenernoreferrer noopener\"\u003ethis survey\u003c/a\u003e from Alternative Photography as a starting point. \u003c/p\u003e\n\n\n\n\u003cp\u003eAnd when you’re just starting out, be sure to pay attention to the way the color of your cyanotype photograph changes as it gets exposed. Once it looks oxidized with some brownish tones, you’ll know it’s ready. \u003c/p\u003e\n\n\n\n\u003cp\u003ePro tip: It’s important that you don’t move the objects while you’re exposing the cyanotype. Movement will result in blurry edges!\u003c/p\u003e\n\n\n\n\u003ch3 data-section=\"\" id=\"step-wash-your-print\"\u003eStep 6: Wash your print\u003c/h3\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"1129\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00003.jpg.jpg?resize=1500%2C1129\u0026amp;ssl=1\" alt=\"Cyanotype photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00003.jpg.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00003.jpg.jpg?resize=300%2C226\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00003.jpg.jpg?resize=600%2C452\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00003.jpg.jpg?resize=768%2C578\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography00003.jpg.jpg?resize=717%2C540\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eNow that your cyanotype is exposed, it’s time to rinse the chemicals off your print. Just put the paper under running water for a few minutes until it looks clean. \u003c/p\u003e\n\n\n\n\u003cp\u003eIf you don’t wash your print properly, the residual chemicals will continue developing when exposed to sunlight. (This will be mainly noticeable in the areas that weren’t previously exposed – instead of keeping the color of the paper, they will turn a light blue.)\u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s it. Leave your cyanotype to dry, and you’re done!\u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"cyanotype-photography-tips\"\u003eCyanotype photography tips\u003c/h2\u003e\n\n\n\n\u003cp\u003eOnce you’ve enjoyed a few cyanotype photography attempts, here are more tips to help you improve and produce creative results!\u003c/p\u003e\n\n\n\n\u003ch3 data-section=\"\" id=\"check-the-uv-index\"\u003e1. Check the UV index\u003c/h3\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1500\" height=\"827\" src=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography.jpg?resize=1500%2C827\u0026amp;ssl=1\" alt=\"Cyanotype photography\" srcset=\"https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography.jpg?w=1500\u0026amp;ssl=1 1500w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography.jpg?resize=300%2C165\u0026amp;ssl=1 300w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography.jpg?resize=600%2C331\u0026amp;ssl=1 600w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography.jpg?resize=768%2C423\u0026amp;ssl=1 768w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography.jpg?resize=160%2C88\u0026amp;ssl=1 160w, https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/03/Cyanotype-photography.jpg?resize=717%2C395\u0026amp;ssl=1 717w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eUV rays aren’t exclusive to bright summer days. Even when it’s cloudy outside, there’s UVA radiation, which is the reason dermatologists recommend using sunscreen every day. \u003c/p\u003e\n\n\n\n\u003cp\u003eSo before doing cyanotype photography, don’t just check the weather forecast. Also look at the UV index – because the more UV light, the faster your images will expose. Generally, faster is better, though you can also use \u003ca href=\"https://digital-photography-school.com/step-by-step-guide-to-long-exposure-photography/\" target=\"_blank\" aria-label=\"longer exposures (opens in a new tab)\" rel=\"noreferrer noopener\"\u003elonger exposures\u003c/a\u003e to produce creative effects:\u003c/p\u003e\n\n\n\n\u003ch3 data-section=\"\" id=\"try-long-exposures\"\u003e2. Try long exposures\u003c/h3\u003e\n\n\n\n\u003cp\u003eWhen the UV index is low, you can experiment with long-exposure cyanotypes. Set up your initial composition, let it expose for a bit, then move existing elements or add new ones halfway through. \u003c/p\u003e\n\n\n\n\u003cp\u003eYou’ll end up with some elements that are more defined than others. They’ll also have different tones due to the different \u003ca href=\"https://digital-photography-school.com/learning-exposure-in-digital-photography/\" target=\"_blank\" aria-label=\"exposure times (opens in a new tab)\" rel=\"noreferrer noopener\"\u003eexposure times\u003c/a\u003e, which can look very cool! \u003c/p\u003e\n\n\n\n\u003ch3 data-section=\"\" id=\"do-a-step-test\"\u003e3. Do a step test\u003c/h3\u003e\n\n\n\n\u003cp\u003eIf you want to know the precise exposure time you’ll need for your cyanotype, you can always do a step test. The idea is to prepare paper using the process discussed above (or cut a strip from your existing cyanotype paper), then trace lines about one inch apart from one another. Start by covering most of the paper, then reveal one of the segments every minute. \u003c/p\u003e\n\n\n\n\u003cp\u003eKeep in mind that this is helpful only if the light is constant – if, for example, you use UV lights instead of sunlight, or if the exposure is short and the weather is stable. \u003c/p\u003e\n\n\n\n\u003ch3 data-section=\"\" id=\"experiment-with-the-coating-and-materials\"\u003e4. Experiment with the coating and materials\u003c/h3\u003e\n\n\n\n\u003cp\u003eCyanotype photography is an artisanal process, which means that you should experiment with \u003cem\u003eeverything\u003c/em\u003e. For instance, the paper doesn’t need to be evenly coated from edge to edge, and you can leave visible brushstrokes to add visual interest to the edges. Also, try coating the paper using different objects (such as cloths, sponges, etc.).\u003c/p\u003e\n\n\n\n\u003cp\u003eAdditionally, I encourage you to print on different materials. By changing the type of paper, you’ll get very different results, and if you want a completely different look, go ahead and print cyanotypes on wood, fabrics, leather, glass, clay, etc.\u003c/p\u003e\n\n\n\n\u003ch3 data-section=\"\" id=\"tone-your-prints\"\u003e5. Tone your prints\u003c/h3\u003e\n\n\n\n\u003cp\u003eCyanotype photography has a very characteristic blue tone; you can change this, however, by toning your prints. \u003c/p\u003e\n\n\n\n\u003cp\u003eFor example, you can use washing soda to turn the blue to a yellow, or you can use tea to give your prints a brown tone. \u003c/p\u003e\n\n\n\n\u003ch2 data-section=\"\" id=\"cyanotype-photography-final-words\"\u003eCyanotype photography: final words\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs you can see, cyanotype photography involves a very simple process, but it’s full of possibilities! And while it takes some practice to get great results, it’s a lot of fun.\u003c/p\u003e\n\n\n\n\u003cp\u003eI highly recommend looking for local alternative photography groups; that way, you can find folks who share your passion. You can discuss techniques and get inspired by the works of others. \u003c/p\u003e\n\n\n\n\u003cp\u003eAnd if you can’t find anything locally, you can always connect with cyanotype photographers online. Actually, I recommend doing that anyway. I mean, why limit yourself to your area when there are cyanotype artists and enthusiasts worldwide? \u003c/p\u003e\n\n\n\n\u003cp\u003eYou can follow hashtags like #cyanotype, #cyanotypeprint, #cyanotypeprocess, and #wetcyano on Instagram, and you can find helpful and friendly groups on Facebook.\u003c/p\u003e\n\n\n\n\u003cp\u003eNow over to you:\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eDo you know of any cyanotype groups that readers can join? Share them in the comments! Also, let us know about your experiences and experiments in cyanotype photography. We’d love to hear from you.\u003c/em\u003e\u003c/p\u003e\n\n\t  \n      \n    \u003c/section\u003e\n\n\t\t\n\n\t\t\u003csection\u003e\n\t\t\t\u003ch3\u003eRead more from our \u003ca href=\"https://digital-photography-school.com/tips/\"\u003eTips \u0026amp; Tutorials\u003c/a\u003e category\u003c/h3\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003ca href=\"https://digital-photography-school.com/author/ana-mireles/\" title=\"Ana Mireles\"\u003e\u003cimg alt=\"Ana Mireles\" src=\"https://secure.gravatar.com/avatar/9cdbb4161af4b005d7fa4210e6d961d2?s=80\u0026amp;d=blank\u0026amp;r=g\" srcset=\"https://secure.gravatar.com/avatar/9cdbb4161af4b005d7fa4210e6d961d2?s=160\u0026amp;d=blank\u0026amp;r=g 2x\" height=\"80\" width=\"80\" loading=\"lazy\" decoding=\"async\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003ca href=\"https://digital-photography-school.com/author/ana-mireles/\" title=\"Ana Mireles\"\u003eAna Mireles\u003c/a\u003e\u003c/p\u003e\u003cp\u003eis a photographer and artistic researcher. She has been awarded and exhibited in Mexico, Italy, and the Netherlands. Through theory and practice, she explores the cultural aspect of photography, how it helps us relate to each other, the world, and ourselves. She has also a passion for teaching, communication, and social media. You can find more about her and her work \u003ca href=\"http://apmireles.wixsite.com/anamirelesphoto\"\u003eat her website\u003c/a\u003e or \u003ca href=\"http://anamirelesphoto.com/\"\u003eacquire some of her works here\u003c/a\u003e.\u003c/p\u003e\n\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\u003c/section\u003e\n\n\t\t\t\u003csection\u003e\n\t\t\u003cspan\u003eI need help with...\u003c/span\u003e\n\t\t\n\t\u003c/section\u003e\n\t\n\t\t\n\t\t\t\t\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-01-02T09:00:00Z",
  "modifiedTime": "2025-01-02T17:40:18Z"
}
