{
  "id": "321e4c6d-9e44-4134-9880-db51e8b0c412",
  "title": "DJI Urges US Government to Start the Mandated Security Audit of Its Business",
  "link": "https://petapixel.com/2025/04/03/dji-urges-us-government-to-start-the-mandated-security-audit-of-its-business/",
  "description": "Last December, the FY 2025 National Defense Authorization Act (NDAA) passed by US Congress outlined a structured approach for evaluating the security concerns of Chinese-owned companies such as DJI. With less than nine months before the deadline for such an evaluation remaining, DJI is urging any of the five national security agencies to start the process. [Read More]",
  "author": "Jaron Schneider",
  "published": "Thu, 03 Apr 2025 19:35:54 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Industry",
    "Law",
    "News",
    "congress",
    "counteringccpdronesact",
    "dji",
    "drones",
    "law"
  ],
  "byline": "Jaron Schneider",
  "length": 3225,
  "excerpt": "DJI is urging any of the five national security agencies to start the mandated evaluation of its business required by the FY2025 NDAA.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "Last December, the FY 2025 National Defense Authorization Act (NDAA) passed by US Congress outlined a structured approach for evaluating the security concerns of Chinese-owned companies such as DJI. With less than nine months before the deadline for such an evaluation remaining, DJI is urging any of the five national security agencies to start the process. While DJI was not outright banned last year, that didn’t mean the company was out of the woods. The aforementioned “risk assessment” was added and at the time, DJI said that it was scrutiny it looked forward to so that it could showcase its privacy controls and security features to the American government. To date, it hasn’t had the opportunity to do so as, according to DJI, no such risk assessment has even started. Realizing that it was running short on time, DJI has sent a letter urging any of the five national security agencies (the DHS, DoD, FBI, NSA, or ODNI) that could perform that assessment to start. “Section 1709 of the 2025 National Defense Authorization Act ‘mandates that within one year of enactment, a designated national security agency must evaluate whether communications and video surveillance equipment from these manufacturers pose ‘an unacceptable risk’ to U.S. national security or the safety of American citizens,’” Adam Welsh, head of global policy at DJI writes in the letter. “If you determine that DJI’s drones pose an unacceptable risk, the Federal Communications Commission (FCC) must add them to its ‘covered list,’ effectively restricting their use in the United States. If you do not evaluate DJI’s products in 2025, the FCC would also have to add the company’s equipment to its covered list, depriving DJI of its due process and depriving thousands of businesses, consumers, and public safety agencies of products that they want and need for no reason at all. Accordingly, I write to request that any or all of your agencies begin this required evaluation of DJI’s products right away.” DJI addressed the letter to Kristi Noem, Secretary of the Department of Homeland Security, Pete Hegseth, Secretary of the Department of Defense, Kash Patel, Director of the FBI, Timothy Haugh, Director of the NSA, and Tulsi Gabbard, Director of the National Intelligence Office of Strategic Communications. To cover its bases, it also copied a long list of senators and state representatives who lead multiple intelligence committees. It appears the hope is that someone — anyone — will begin the process that was mandated by the NDAA last year and leave enough time to perform the evaluation fairly. “Our message to these agencies is simple: We welcome the scrutiny and are confident that our products can withstand their strictest scrutiny. We feel strongly that the people who have built livelihoods using DJI products deserve a fair and timely evaluation to lift the cloud on our company and reassure DJI’s customers and the American public that DJI’s drones are safe and secure,” a DJI spokesperson writes in an email to PetaPixel. Image credits: DJI PetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.",
  "image": "https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\u003carticle data-post-id=\"787939\"\u003e\n\n    \u003cheader\u003e\n          \n    \n\n        \n  \u003c/header\u003e\n      \n  \n\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured.jpg\" alt=\"A person standing next to a vehicle, flying a drone in a desert landscape. The person holds a remote control, and the sky and distant hills are visible in the background.\" width=\"1600\" height=\"863\" srcset=\"https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured.jpg 1600w, https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured-320x173.jpg 320w, https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured-800x432.jpg 800w, https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured-1536x828.jpg 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\"/\u003e\u003c/p\u003e \u003cp\u003eLast December, the FY 2025 National Defense Authorization Act (NDAA) passed by US Congress \u003ca href=\"https://petapixel.com/2024/12/18/dji-stays-legal-us-congress-finalizes-defense-act-without-drone-ban/\" data-wpel-link=\"internal\"\u003eoutlined a structured approach\u003c/a\u003e for evaluating the security concerns of Chinese-owned companies such as DJI. With less than nine months before the deadline for such an evaluation remaining, DJI is urging any of the five national security agencies to start the process. \u003c/p\u003e  \u003cp\u003eWhile \u003ca href=\"https://petapixel.com/2024/12/18/dji-stays-legal-us-congress-finalizes-defense-act-without-drone-ban/\" data-wpel-link=\"internal\"\u003eDJI was not outright banned last year\u003c/a\u003e, that didn’t mean the company was out of the woods. The aforementioned “risk assessment” was added and at the time, DJI said that it was scrutiny it looked forward to so that it could showcase its privacy controls and security features to the American government. \u003c/p\u003e \u003cp\u003eTo date, it hasn’t had the opportunity to do so as, according to DJI, no such risk assessment has even started. Realizing that it was running short on time, DJI has sent a letter urging any of the five national security agencies (the DHS, DoD, FBI, NSA, or ODNI) that could perform that assessment to start. \u003c/p\u003e \u003cp\u003e“Section 1709 of the 2025 National Defense Authorization Act ‘mandates that within one year of enactment, a designated national security agency must evaluate whether communications and video surveillance equipment from these manufacturers pose ‘an unacceptable risk’ to U.S. national security or the safety of American citizens,’” Adam Welsh, head of global policy at DJI writes \u003ca href=\"https://petapixel.com/assets/uploads/2025/04/FINAL_Letter-from-DJI-on-Sec-1709_3-Mar-2025.pdf\" data-wpel-link=\"internal\"\u003ein the letter\u003c/a\u003e.  \u003c/p\u003e \u003cp\u003e“If you determine that DJI’s drones pose an unacceptable risk, the Federal Communications Commission (FCC) must add them to its ‘covered list,’ effectively restricting their use in the United States. If you do not evaluate DJI’s products in 2025, the FCC would also have to add the company’s equipment to its covered list, depriving DJI of its due process and depriving thousands of businesses, consumers, and public safety agencies of products that they want and need for no reason at all. Accordingly, I write to request that any or all of your agencies begin this required evaluation of DJI’s products right away.”\u003c/p\u003e \u003cp\u003eDJI addressed the letter to Kristi Noem, Secretary of the Department of Homeland Security, Pete Hegseth, Secretary of the Department of Defense, Kash Patel, Director of the FBI, Timothy Haugh, Director of the NSA, and Tulsi Gabbard, Director of the National Intelligence Office of Strategic Communications. To cover its bases, it also copied a long list of senators and state representatives who lead multiple intelligence committees. It appears the hope is that someone — anyone — will begin the process that was mandated by the NDAA last year and leave enough time to perform the evaluation fairly.\u003c/p\u003e\n \u003cp\u003e“Our message to these agencies is simple: We welcome the scrutiny and are confident that our products can withstand their strictest scrutiny. We feel strongly that the people who have built livelihoods using DJI products deserve a fair and timely evaluation to lift the cloud on our company and reassure DJI’s customers and the American public that DJI’s drones are safe and secure,” a DJI spokesperson writes in an email to \u003cem\u003ePetaPixel\u003c/em\u003e. \u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e DJI\u003c/em\u003e\u003c/p\u003e      \u003c/div\u003e\n\n          \n      \n\n              \u003cdiv\u003e\n          \u003cp\u003ePetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.\u003c/p\u003e\n        \u003c/div\u003e\n      \n    \n\n    \n          \n      \n\n\n\n\n    \n    \n    \n          \n      \u003c/div\u003e\n\u003c/article\u003e\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-03T19:35:54Z",
  "modifiedTime": "2025-04-03T19:51:37Z"
}
