{
  "id": "41033364-07d3-4c9d-8fee-3f25e011e2fa",
  "title": "Rhinos Get In the Halloween Spirit by Adorably Goring Pumpkins",
  "link": "https://petapixel.com/2024/10/17/rhinos-get-in-the-halloween-spirit-by-adorably-goring-pumpkins/",
  "description": "The black rhinoceroses (Diceros bicornis) of the Oregon Zoo in Portland, Oregon, have gotten into the Halloween spirit by smashing large pumpkins. [Read More]",
  "author": "Jeremy Gray",
  "published": "Thu, 17 Oct 2024 19:30:31 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "News",
    "Spotlight",
    "animals",
    "blackrhino",
    "conservation",
    "endangered",
    "halloween",
    "humor",
    "nature",
    "oregonzoo",
    "rhino",
    "zoo"
  ],
  "byline": "Jeremy Gray",
  "length": 2896,
  "excerpt": "Black rhinos get a cute close-up.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "The black rhinoceroses (Diceros bicornis) of the Oregon Zoo in Portland, Oregon, have gotten into the Halloween spirit by smashing large pumpkins. The short video, initially shared by Laughing Squid, shows an adult black rhino, Jozi, and her 10-month-old calf, Tamu (which means “sweet” in Swahili), having a grand time breaking apart pumpkins. While black rhinos don’t encounter pumpkins in the wild in their native eastern Africa, the winter squash is a healthy, albeit irregular, treat for the hook-lipped pachyderms. An essential part of an animal’s management plan at a zoo includes diverse enrichment. These include any activities that reasonably mimic a species’ natural behaviors and, in a black rhino’s case, range from foraging for food to engaging different senses. Playing with and eating pumpkins ticks multiple boxes, as the rhinos must use their horns to break the big berries apart before they can eat them. Rhinoceroses rely heavily on smell, sound, and tactile sensations in the wild, and goring pumpkins satisfies all three. Videos like the one above are not only cute, they are a good demonstration of an animal’s natural behavior and help cultivate strong community engagement, ensuring the zoo has the visitors — and funds — to not only care for its animals but engage in vital conservation programs, like the one the Oregon Zoo has for its black rhinos. Since the black rhinoceros is critically endangered and there are only an estimated 6,421 in the wild as of September 2024, per the International Rhino Foundation’s annual State of the Rhino report, every accredited zoo with black rhinos must have an approved species survival plan in order to breed them. This is Tamu’s first Halloween, as the calf was born on December 4, 2023. Rhino calves can put on up to five pounds each day, according to the Oregon Zoo’s rhino area supervisor Chad Harmon, so little Tamu has put on a lot of weight so far this year to get into proper pumpkin-smashing form. Compared to the little tank’s appearance in the video below from February, his horn has grown significantly, and his second horn has already started coming in. The Oregon Zoo’s black rhinos weren’t the only inhabitants getting in on the pumpkin-filled fun. The zoo shared another video on its Instagram page showing other animals, including elephants and polar bears, enjoying breaking gourds apart. Hopefully, videos like these will help people engage more with animals, especially the most threatened ones. “These rhinos represent a species that’s among the most imperiled on the planet,” said Kelly Gomez, the Oregon Zoo’s Africa area supervisor, earlier this year. “Hopefully, their story can help inspire a new chapter in their conservation.” Image credits: Oregon Zoo PetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.",
  "image": "https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003carticle data-post-id=\"764178\"\u003e\n\u003cheader\u003e\n\n\n\u003c/header\u003e\n\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-2-800x420.jpg\" alt=\"A rhinoceros curiously examines an orange pumpkin on the ground. The rhino\u0026#39;s horn and large body are prominent, with a backdrop of trees and dirt. The scene captures an autumnal feel in a natural setting.\" width=\"800\" height=\"420\" srcset=\"https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-2-800x420.jpg 800w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-2-320x168.jpg 320w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-2-1536x806.jpg 1536w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-2-150x79.jpg 150w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-2-300x157.jpg 300w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-2-400x209.jpg 400w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-2-550x288.jpg 550w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-2.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003eThe black rhinoceroses (\u003cem\u003eDiceros bicornis\u003c/em\u003e) of the \u003ca href=\"https://www.oregonzoo.org/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eOregon Zoo\u003c/a\u003e in Portland, Oregon, have gotten into the Halloween spirit by smashing large pumpkins. \u003c/p\u003e  \u003cp\u003eThe short video, initially \u003ca href=\"https://laughingsquid.com/rhinos-gore-halloween-pumpkins/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eshared by \u003cem\u003eLaughing Squid\u003c/em\u003e\u003c/a\u003e, shows an adult black rhino, Jozi, and her 10-month-old calf, Tamu (which means “sweet” in Swahili), having a grand time breaking apart pumpkins. While black rhinos don’t encounter pumpkins in the wild in their native eastern Africa, the winter squash is a healthy, albeit irregular, treat for the hook-lipped pachyderms. \u003c/p\u003e \u003cdiv\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/LkwNpjjUBeA?si=b9KH70Dac9dnSjTr\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e \u003cp\u003eAn essential part of an animal’s management plan at a zoo includes diverse enrichment. These include any activities that reasonably mimic a species’ natural behaviors and, in a black rhino’s case, range from foraging for food to engaging different senses. Playing with and eating pumpkins ticks multiple boxes, as the rhinos must use their horns to break the big berries apart before they can eat them. \u003ca href=\"https://petapixel.com/2024/05/06/adorable-javan-rhino-calf-caught-on-camera-one-of-about-80-still-alive/\" data-wpel-link=\"internal\"\u003eRhinoceroses\u003c/a\u003e rely heavily on smell, sound, and tactile sensations in the wild, and goring pumpkins satisfies all three. \u003c/p\u003e \u003cp\u003eVideos like the one above are not only cute, they are a good demonstration of an animal’s natural behavior and help cultivate strong community engagement, ensuring the zoo has the visitors — and funds — to not only care for its animals but engage in vital conservation programs, like the one the Oregon Zoo has for its black rhinos. \u003c/p\u003e \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-1-800x420.jpg\" alt=\"Two rhinos with large horns munch on broken pieces of an orange pumpkin on the ground. They are positioned closely together, surrounded by greenery and trees in the background.\" width=\"800\" height=\"420\" srcset=\"https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-1-800x420.jpg 800w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-1-320x168.jpg 320w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-1-1536x806.jpg 1536w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-1-150x79.jpg 150w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-1-300x157.jpg 300w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-1-400x209.jpg 400w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-1-550x288.jpg 550w, https://petapixel.com/assets/uploads/2024/10/oregon-zoo-black-rhino-1.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e\n\u003cp\u003eSince the black rhinoceros is critically endangered and there are only an estimated 6,421 in the wild as of September 2024, per the International Rhino Foundation’s annual \u003ca href=\"https://rhinos.org/about-rhinos/state-of-the-rhino/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eState of the Rhino report\u003c/a\u003e, every accredited zoo with black rhinos must have an approved species survival plan in order to breed them. \u003c/p\u003e \u003cp\u003eThis is Tamu’s first Halloween, as the calf was \u003ca href=\"https://www.oregonzoo.org/news/endangered-rhino-baby-has-name-tamu-sweet-can-be\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eborn on December 4, 2023\u003c/a\u003e. Rhino calves can put on up to five pounds each day, according to the Oregon Zoo’s rhino area supervisor Chad Harmon, so little Tamu has put on a lot of weight so far this year to get into proper pumpkin-smashing form. Compared to the little tank’s appearance in the video below from February, his horn has grown significantly, and his second horn has already started coming in. \u003c/p\u003e \u003cdiv\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/h1rStv5M5vc?si=iC-lSTRcDbz_SQt-\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e \u003cp\u003eThe Oregon Zoo’s black rhinos weren’t the only inhabitants getting in on the pumpkin-filled fun. The zoo shared another video on its Instagram page showing other animals, including elephants and polar bears, enjoying breaking gourds apart. \u003c/p\u003e \u003ccenter\u003e  \u003cblockquote data-instgrm-permalink=\"https://www.instagram.com/reel/DAjNxonS-5U/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e  \u003c/blockquote\u003e \u003c/center\u003e \u003cp\u003eHopefully, videos like these will help people engage more with animals, especially the most threatened ones. “These rhinos represent a species that’s among the most imperiled on the planet,” said Kelly Gomez, the Oregon Zoo’s Africa area supervisor, earlier this year. “Hopefully, their story can help inspire a new chapter in their conservation.” \u003c/p\u003e\n\u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e Oregon Zoo \u003c/em\u003e\u003c/p\u003e  \u003c/div\u003e\n\n\n\u003cdiv\u003e\n\u003cp\u003ePetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.\u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\n\n\n\n\u003c/div\u003e\n\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-17T19:30:31Z",
  "modifiedTime": null
}
