{
  "id": "4e7d2472-f920-4035-bb3e-6cfb60c1e28c",
  "title": "Peter McKinnon and 100+ Speakers to Present at Bild Expo 2025 in New York City",
  "link": "https://www.canonrumors.com/peter-mckinnon-and-100-speakers-to-present-at-bild-expo-2025-in-new-york-city/",
  "description": "Event Celebrating Image, Storytelling and Content Creation Returns to Javits Center June 17–18 Following Strong 2023 Debut Taking place June 17–18, 2025, at the Javits Center in New York City, Bild Expo invites creators of all levels to connect, create and experience the technologies shaping the future of the visual and storytelling arts. Attendees can explore [...] The post Peter McKinnon and 100+ Speakers to Present at Bild Expo 2025 in New York City appeared first on Canon Rumors.",
  "author": "Craig Blair",
  "published": "Fri, 16 May 2025 16:55:38 +0000",
  "source": "https://www.canonrumors.com/feed/",
  "categories": [
    "Featured Content",
    "B\u0026H Photo",
    "BILD expo",
    "EOS R1",
    "EOS R5 Mark II"
  ],
  "byline": "Craig Blair",
  "length": 4157,
  "excerpt": "Event Celebrating Image, Storytelling and Content Creation Returns to Javits Center June 17–18 Following Strong 2023 Debut Taking place June 17–18, 2025,",
  "siteName": "Canon Rumors",
  "favicon": "",
  "text": "Event Celebrating Image, Storytelling and Content Creation Returns to Javits Center June 17–18 Following Strong 2023 Debut Taking place June 17–18, 2025, at the Javits Center in New York City, Bild Expo invites creators of all levels to connect, create and experience the technologies shaping the future of the visual and storytelling arts. Attendees can explore the latest gear from industry leaders including Canon, Nikon, Fujifilm, Sony, DJI and more — across a show floor that’s twice as large as 2023’s strongly attended debut. Bild Expo 2025 is free and open to all creatives. Free Registration is now available at bildexpo.com. “Bild Expo brings the creative community together in a way that’s deeply personal and profoundly inspiring,” said Jeff Gerstel, Chief Marketing Officer at B\u0026H. “It’s more than an event — it’s a spark for new ideas, new collaborations and new possibilities. We’re thrilled to open our doors once again to storytellers from around the world.” “Bild”—Yiddish for “image”—honors the enduring power of imagery in culture, communication and human connection. Headliner: Cristina Mittermeier Cristina “Mitty” Mittermeier, marine biologist, photographer and co-founder of SeaLegacy, headlines this year’s speaker lineup. Mittermeier’s storytelling—featured by National Geographic and honored as a Sony Artisan of Imagery—merges urgent environmental advocacy with deeply human narratives, capturing the profound relationship between people and planet. Spotlight on Creators Across Every Discipline Bild Expo 2025 will feature over 100 speakers offering insights across photography, filmmaking and content creation, including: Peter McKinnon, globally renowned filmmaker, photographer and creator, known for his cinematic style, dynamic YouTube presence and collaborations with brands like Canon and Red Bull, empowers millions of followers with tutorials, gear reviews and visual storytelling that break creative boundaries. Drex Lee, whose viral “Epic 1 Shot” films have drawn over 6 billion views, reveals the production secrets behind his signature style. Lynsey Addario, Pulitzer Prize-winning and Emmy-nominated photojournalist, author and Nikon ambassador, has covered conflicts, humanitarian crises and women’s issues for The New York Times and National Geographic. Thandiwe Muriu, award-winning Kenyan visual artist, explores the vibrant intersection of identity, culture and color in her acclaimed “Camo” series. Alex “Alexander the Great” Stemplewski, street photographer and social media innovator, discusses creating spontaneous, authentic imagery that resonates globally. Shuang Hu, actress, director and digital storyteller, shares strategies for crafting viral narratives and amplifying diverse voices through her platform THEONESHU. Scott Kelby, best-selling author and founder of KelbyOne, teaches breakthrough lighting, editing and post-processing techniques that redefine photo mastery. Kendall Vertes, artist and content creator of Dance Moms fame, shares her journey from television to building a multifaceted brand that speaks to the next generation of creatives. Gear, Hands-On Learning and Networking Attendees will also experience: Hands-on access to the latest cameras, lighting, audio and post-production tools from 250+ top brands, 50% more versus 2023. Live demos and workshops covering AI-driven editing, cinematic video production, lighting techniques, immersive audio capture, 16mm filmmaking and more. Portfolio and pitch reviews with leading photographers, publishers and agencies. Guided photo walks through NYC led by top industry ambassadors, offering hands-on tips and techniques while capturing the city’s energy. After-hours networking events and a sports photography experience. Partner Pavilion showcasing organizations such as the American Society of Media Photographers (ASMP) and the Society of Motion Picture and Television Engineers (SMPTE). Free Registration is now available at bildexpo.com. When you purchase through links on our site, we may earn an affiliate commission. Here's how it works.",
  "image": "https://www.canonrumors.com/wp-content/uploads/2025/05/bildexpo2025169.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-67856\"\u003e\n\t\t\t\t\t\n\u003cdiv\u003e\n\n\t\t\n\t\t\t\t\n\t\t\n\u003cp\u003e\u003cem\u003eEvent Celebrating Image, Storytelling and Content Creation Returns to Javits Center June 17–18 Following Strong 2023 Debut\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eTaking place June 17–18, 2025, at the Javits Center in New York City, Bild Expo invites creators of all levels to connect, create and experience the technologies shaping the future of the visual and storytelling arts. Attendees can explore the latest gear from industry leaders including Canon, Nikon, Fujifilm, Sony, DJI and more — across a show floor that’s twice as large as 2023’s strongly attended debut. Bild Expo 2025 is free and open to all creatives.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eFree Registration is now available at \u003ca href=\"https://www.bildexpo.com?ref=AFF\u0026amp;BI=2466\u0026amp;KBID=3296\" target=\"_blank\" rel=\"noreferrer noopener sponsored nofollow\"\u003ebildexpo.com\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e“Bild Expo brings the creative community together in a way that’s deeply personal and profoundly inspiring,” said Jeff Gerstel, Chief Marketing Officer at B\u0026amp;H. “It’s more than an event — it’s a spark for new ideas, new collaborations and new possibilities. We’re thrilled to open our doors once again to storytellers from around the world.”\u003c/p\u003e\n\n\n\n\u003cp\u003e“Bild”—Yiddish for “image”—honors the enduring power of imagery in culture, communication and human connection.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1187\" height=\"654\" src=\"https://www.canonrumors.com/wp-content/uploads/2025/05/bild2025speakers.jpg\" alt=\"\" srcset=\"https://www.canonrumors.com/wp-content/uploads/2025/05/bild2025speakers.jpg 1187w, https://www.canonrumors.com/wp-content/uploads/2025/05/bild2025speakers-728x401.jpg 728w, https://www.canonrumors.com/wp-content/uploads/2025/05/bild2025speakers-768x423.jpg 768w, https://www.canonrumors.com/wp-content/uploads/2025/05/bild2025speakers-150x83.jpg 150w, https://www.canonrumors.com/wp-content/uploads/2025/05/bild2025speakers-450x248.jpg 450w\" sizes=\"(max-width: 1187px) 100vw, 1187px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003ch2 id=\"h-headliner-nbsp-cristina-mittermeier\"\u003e\u003cstrong\u003eHeadliner: Cristina Mittermeier\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eCristina “Mitty” Mittermeier, marine biologist, photographer and co-founder of SeaLegacy, headlines this year’s speaker lineup. Mittermeier’s storytelling—featured by National Geographic and honored as a Sony Artisan of Imagery—merges urgent environmental advocacy with deeply human narratives, capturing the profound relationship between people and planet.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-spotlight-on-creators-across-every-discipline\"\u003e\u003cstrong\u003eSpotlight on Creators Across Every Discipline\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eBild Expo 2025 will feature over 100 speakers offering insights across photography, filmmaking and content creation, including:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003ePeter McKinnon\u003c/strong\u003e, globally renowned filmmaker, photographer and creator, known for his cinematic style, dynamic YouTube presence and collaborations with brands like Canon and Red Bull, empowers millions of followers with tutorials, gear reviews and visual storytelling that break creative boundaries.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eDrex Lee\u003c/strong\u003e, whose viral “Epic 1 Shot” films have drawn over 6 billion views, reveals the production secrets behind his signature style.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eLynsey Addario\u003c/strong\u003e, Pulitzer Prize-winning and Emmy-nominated photojournalist, author and Nikon ambassador, has covered conflicts, humanitarian crises and women’s issues for The New York Times and National Geographic.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eThandiwe Muriu\u003c/strong\u003e, award-winning Kenyan visual artist, explores the vibrant intersection of identity, culture and color in her acclaimed “Camo” series.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eAlex “Alexander the Great” Stemplewski\u003c/strong\u003e, street photographer and social media innovator, discusses creating spontaneous, authentic imagery that resonates globally.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eShuang Hu\u003c/strong\u003e, actress, director and digital storyteller, shares strategies for crafting viral narratives and amplifying diverse voices through her platform THEONESHU.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eScott Kelby\u003c/strong\u003e, best-selling author and founder of KelbyOne, teaches breakthrough lighting, editing and post-processing techniques that redefine photo mastery.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eKendall Vertes\u003c/strong\u003e, artist and content creator of \u003cem\u003eDance Moms\u003c/em\u003e fame, shares her journey from television to building a multifaceted brand that speaks to the next generation of creatives.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1187\" height=\"654\" src=\"https://www.canonrumors.com/wp-content/uploads/2025/05/bild2025sponsor.jpg\" alt=\"\" srcset=\"https://www.canonrumors.com/wp-content/uploads/2025/05/bild2025sponsor.jpg 1187w, https://www.canonrumors.com/wp-content/uploads/2025/05/bild2025sponsor-728x401.jpg 728w, https://www.canonrumors.com/wp-content/uploads/2025/05/bild2025sponsor-768x423.jpg 768w, https://www.canonrumors.com/wp-content/uploads/2025/05/bild2025sponsor-150x83.jpg 150w, https://www.canonrumors.com/wp-content/uploads/2025/05/bild2025sponsor-450x248.jpg 450w\" sizes=\"(max-width: 1187px) 100vw, 1187px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003ch2 id=\"h-gear-hands-on-learning-and-networking\"\u003e\u003cstrong\u003eGear, Hands-On Learning and Networking\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003ch3 id=\"h-attendees-will-also-experience\"\u003eAttendees will also experience:\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eHands-on access to the latest cameras, lighting, audio and post-production tools from 250+ top brands, 50% more versus 2023.\u003c/li\u003e\n\n\n\n\u003cli\u003eLive demos and workshops covering AI-driven editing, cinematic video production, lighting techniques, immersive audio capture, 16mm filmmaking and more.\u003c/li\u003e\n\n\n\n\u003cli\u003ePortfolio and pitch reviews with leading photographers, publishers and agencies.\u003c/li\u003e\n\n\n\n\u003cli\u003eGuided photo walks through NYC led by top industry ambassadors, offering hands-on tips and techniques while capturing the city’s energy.\u003c/li\u003e\n\n\n\n\u003cli\u003eAfter-hours networking events and a sports photography experience.\u003c/li\u003e\n\n\n\n\u003cli\u003ePartner Pavilion showcasing organizations such as the American Society of Media Photographers (ASMP) and the Society of Motion Picture and Television Engineers (SMPTE).\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eFree Registration is now available at \u003ca href=\"https://www.bildexpo.com?ref=AFF\u0026amp;BI=2466\u0026amp;KBID=3296\" target=\"_blank\" rel=\"noreferrer noopener sponsored nofollow\"\u003ebildexpo.com\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\n\t\t\u003cdiv id=\"wpadc-wrapper\"\u003e\n\u003cp\u003e\u003cspan\u003eWhen you purchase through links on our site, we may earn an affiliate commission. \u003c/span\u003e\u003cspan\u003e\u003ca href=\"https://www.canonrumors.com/affiliate-disclosure/\"\u003eHere\u0026#39;s how it works\u003c/a\u003e\u003c/span\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\n\t\t\n\t\t\t\t\n\t\t\n\t\t\n\t\t\n\t\u003c/div\u003e\n\t\n\t\n\t\t\t\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-16T11:55:38-05:00",
  "modifiedTime": "2025-05-16T16:55:45Z"
}
