{
  "id": "5421b669-120b-4768-bc1b-6ec365336f9b",
  "title": "Microsoft Publishes Full AI-Generated Ad and No One Noticed",
  "link": "https://www.lightstalking.com/microsoft-publishes-full-ai-generated-ad-and-no-one-noticed/",
  "description": "Well, until they told us that is. In a sign of the times, Microsoft published a blog describing the process behind one of their latest ads which relied upon AI-generated imagery and content to work. Ostensibly conceived to demonstrate the company’s prowess in AI, the ads show off Microsoft’s latest iteration of the Surface along […] The post Microsoft Publishes Full AI-Generated Ad and No One Noticed appeared first on Light Stalking.",
  "author": "Kehl Bayern",
  "published": "Tue, 29 Apr 2025 03:40:56 +0000",
  "source": "https://www.lightstalking.com/feed/",
  "categories": [
    "Photography News"
  ],
  "byline": "Kehl Bayern",
  "length": 2082,
  "excerpt": "Well, until they told us that is. Gray microsoft surface laptop computer on white table. Photo by Windows In a sign of the times, Microsoft published a blog describing the process behind one of their latest ads which relied upon AI-generated imagery and content to work. Ostensibly conceived to demonstrate the company’s prowess in AI, the ads show off Microsoft’s latest iteration of the Surface along with what is can do for businesses using CoPilot. How did this come to be? Hint: If you’ve ever used ChatGPT or anything like it before, then you probably have some idea. “We probably",
  "siteName": "Light Stalking",
  "favicon": "",
  "text": "Well, until they told us that is. Gray microsoft surface laptop computer on white table. Photo by Windows In a sign of the times, Microsoft published a blog describing the process behind one of their latest ads which relied upon AI-generated imagery and content to work. Ostensibly conceived to demonstrate the company’s prowess in AI, the ads show off Microsoft’s latest iteration of the Surface along with what is can do for businesses using CoPilot. How did this come to be? Hint: If you’ve ever used ChatGPT or anything like it before, then you probably have some idea. “We probably went through thousands of different prompts, chiseling away at the output little by little until we got what we wanted. There’s never really a one-and-done prompt,” Creative Director Cisco McCarthy told Microsoft.  “Like carving a masterpiece from a block of marble, each prompt was a careful stroke of the sculptor’s tool that gradually revealed the form within. Through relentless experimentation and countless revisions alongside generative AI, the team eventually conjured a library of stunning art for characters and sets, translating their ideas into captivating visualizations for the ad,” the company writes.  That’s an interesting way to describe it. The results speak for themselves, naturally, and you can watch them over on YouTube at this link. From our perspective, we’re seeing it as yet another sign of the times and as further evidence of one of the biggest trends to shake up our industry since we started writing this news blog. How we got here and where we are going are always interesting to ponder but they might make us miss the fact that the future is very much here and now already.  Any thoughts that you might have on AI-generated advertising are welcome in the comments.  We have some other news you might like to read at this link. Kehl is our staff photography news writer since 2017 and has over a decade of experience in online media and publishing and you can get to know him better here and follow him on Insta.",
  "image": "https://www.lightstalking.com/wp-content/uploads/139Uv2t0Ez0.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"site-content\" role=\"main\"\u003e\n\t\n\u003carticle id=\"post-519580\"\u003e\n\t\n\t\u003cdiv\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\n\u003cp\u003eWell, until they told us that is.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/139Uv2t0Ez0-1024x1536.jpg.webp 1024w, https://www.lightstalking.com/wp-content/uploads/139Uv2t0Ez0-200x300.jpg.webp 200w, https://www.lightstalking.com/wp-content/uploads/139Uv2t0Ez0-768x1152.jpg.webp 768w, https://www.lightstalking.com/wp-content/uploads/139Uv2t0Ez0.jpg.webp 1080w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"1024\" height=\"1536\" src=\"https://www.lightstalking.com/wp-content/uploads/139Uv2t0Ez0-1024x1536.jpg\" alt=\"gray microsoft surface laptop computer on white table\" srcset=\"https://www.lightstalking.com/wp-content/uploads/139Uv2t0Ez0-1024x1536.jpg 1024w, https://www.lightstalking.com/wp-content/uploads/139Uv2t0Ez0-200x300.jpg 200w, https://www.lightstalking.com/wp-content/uploads/139Uv2t0Ez0-768x1152.jpg 768w, https://www.lightstalking.com/wp-content/uploads/139Uv2t0Ez0.jpg 1080w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eGray microsoft surface laptop computer on white table. Photo by Windows\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIn a sign of the times, Microsoft published a blog describing the process behind one of their latest ads which relied upon AI-generated imagery and content to work.\u003c/p\u003e\n\n\n\n\u003cp\u003eOstensibly conceived to demonstrate the company’s prowess in AI, the ads show off Microsoft’s latest iteration of the Surface along with what is can do for businesses using CoPilot.\u003c/p\u003e\n\n\n\n\u003cp\u003eHow did this come to be?\u003c/p\u003e\n\n\n\n\u003cp\u003eHint: If you’ve ever used ChatGPT or anything like it before, then you probably have some idea.\u003c/p\u003e\n\n\n\n\u003cp\u003e“We probably went through thousands of different prompts, chiseling away at the output little by little until we got what we wanted. There’s never really a one-and-done prompt,” Creative Director Cisco McCarthy told Microsoft. \u003c/p\u003e\n\n\n\n\u003cp\u003e“Like carving a masterpiece from a block of marble, each prompt was a careful stroke of the sculptor’s tool that gradually revealed the form within. Through relentless experimentation and countless revisions alongside generative AI, the team eventually conjured a library of stunning art for characters and sets, translating their ideas into captivating visualizations for the ad,” the company \u003ca href=\"https://microsoft.design/articles/we-made-an-ad-with-generative-ai/\"\u003ewrites\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s an interesting way to describe it. The results speak for themselves, naturally, and you can watch them over on YouTube at this \u003ca href=\"https://youtu.be/9SWEA2y2DjQ\"\u003elink\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eFrom our perspective, we’re seeing it as yet another sign of the times and as further evidence of one of the biggest trends to shake up our industry since we started writing this news blog. How we got here and where we are going are always interesting to ponder but they might make us miss the fact that the future is very much here and now already. \u003c/p\u003e\n\n\n\n\u003cp\u003eAny thoughts that you might have on AI-generated advertising are welcome in the comments. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe have some other news you might like to read \u003ca href=\"https://www.lightstalking.com/category/news/\"\u003eat this link\u003c/a\u003e.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\u003cp\u003e\u003cimg alt=\"\" src=\"https://secure.gravatar.com/avatar/105c790fa869c42d4960f657a087d59c?s=120\u0026amp;r=g\" srcset=\"https://secure.gravatar.com/avatar/105c790fa869c42d4960f657a087d59c?s=240\u0026amp;r=g 2x\" height=\"120\" width=\"120\" decoding=\"async\"/\u003e\t\t\t\u003c/p\u003e\n\t\t\t\u003cp\u003eKehl is our staff photography news writer since 2017 and has over a decade of experience in online media and publishing and you can get to \u003ca href=\"https://www.lightstalking.com/about/\"\u003eknow him better here\u003c/a\u003e and follow him on \u003ca href=\"https://www.instagram.com/kehlbayern/\"\u003eInsta\u003c/a\u003e.\u003c/p\u003e\n\t\t\u003c/div\u003e\t\t\n\t\t\t\u003c/div\u003e\n\u003c/article\u003e\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-29T03:40:56Z",
  "modifiedTime": "2025-04-29T03:40:59Z"
}
