{
  "id": "5655d71f-fdd0-4790-8604-af50fa858b25",
  "title": "Insta360 announces the Insta360 Flow 2 Pro Gimbal",
  "link": "https://www.canonrumors.com/insta360-announces-the-insta360-flow-2-pro-gimbal/",
  "description": "It wasn’t too long ago that Insta360 launched its Flow gimbal, and they are at it again, updating and improving it in quite a few areas. It’s already available and shipping now. Key features; Purchase from our Preferred Vendors Press Release Meet Insta360 Flow 2 Pro: Revolutionary Smartphone Filmmaking with Advanced AI \u0026 Seamless iPhone [...] The post Insta360 announces the Insta360 Flow 2 Pro Gimbal appeared first on Canon Rumors.",
  "author": "Richard",
  "published": "Thu, 16 Jan 2025 15:58:14 +0000",
  "source": "https://www.canonrumors.com/feed/",
  "categories": [
    "Industry News",
    "industry news",
    "Insta360",
    "Insta360 Flow 2 Pro"
  ],
  "byline": "Richard",
  "length": 6921,
  "excerpt": "It wasn't too long ago that Insta360 launched its Flow gimbal, and they are at it again, updating and improving it in quite a few areas. It's already availabl",
  "siteName": "Canon Rumors",
  "favicon": "",
  "text": "It wasn’t too long ago that Insta360 launched its Flow gimbal, and they are at it again, updating and improving it in quite a few areas. It’s already available and shipping now.Key features;3-Axis Stabilization for Smooth FootageBuilt-In Selfie Stick and TripodDeep Track 4.0 AI Subject Tracking1-Tap Pairing, Native iOS TrackingRing Light Indicator360° Infinite PanSmartWheel Control for Zoom/Mode/TriggerMagnetic Phone ClampEdit with Insta360 AppPurchase from our Preferred VendorsPress ReleaseMeet Insta360 Flow 2 Pro: Revolutionary Smartphone Filmmaking with Advanced AI \u0026 Seamless iPhone IntegrationInsta360 is excited to unveil the latest evolution in smartphone stabilizers: Insta360 Flow 2 Pro.Designed for creators, solo adventurers, and professionals alike, this next-generation AI-powered gimbal combines groundbreaking technology with an all-in-one design to transform your smartphone into the ultimate content creation tool.With extended Apple DockKit integration, all-new Deep Track 4.0 AI tracking, and professional-grade features like Active Zoom Tracking and Multi-Person Tracking, Flow 2 Pro pushes Insta360’s innovations in the mobile content creation space to new heights. Upgrades to its built-in tripod, power bank, and selfie stick, and Flow 2 Pro sets a new benchmark for smartphone filmmaking.“The idea of Flow 2 Pro is simple: Bridge the gap between professional-quality tools and everyday accessibility,” shares JK Liu, founder of Insta360. “We’re bringing our cutting-edge AI tracking to the table, with even more enhancements, as well as seamless iPhone and Android integration.”Unprecedented Tracking CapabilitiesInsta360 Flow 2 Pro elevates mobile videography by integrating Apple DockKit, an industry-first innovation that bridges the gap between professional-grade tracking and user-friendly convenience.Designed exclusively for iPhones, Flow 2 Pro uses Apple DockKit to unlock seamless native subject tracking for iPhone’s built-in Camera app, as well as Blackmagic (including SmartWheel use) and over 200+ third-party iOS apps. From Photo and Cinematic modes to Slow Motion, Flow 2 Pro eliminates the need for additional software, offering a user experience that combines simplicity with performance.DockKit transforms your device into a powerful production tool—perfect for content creation, virtual meetings, video calls, live streaming, and more.Meet Deep Track 4.0Flow 2 Pro introduces Deep Track 4.0, the ultimate evolution in AI-powered tracking technology. Available in the Insta360 app, the latest rendition is built for creators who demand the best, bringing a host of cutting-edge capabilities that ensure your shots are always perfectly framed and effortlessly smooth.New Active Zoom TrackingZooming in up to 15x while tracking a moving subject is now possible thanks to Active Zoom Tracking. Perfect for capturing dynamic sports or distant scenes, this feature is a game-changer for creators looking to hone in on the action. Unlike competing products that cap zoom capabilities and are unable to track effectively at range, Flow 2 Pro ensures your shot is crystal clear and perfectly framed, no matter how the distance.Multi-Person TrackingCapture every moment—Flow 2 Pro tracks multiple people in real time, keeping your whole group perfectly framed. From family photos to group dancing videos, AI automatically adapts to your environment and keep up with every movement so your whole group is centered and in shot.Pro Framing GridStorytelling is made richer with the built-in Pro Framing Grid, an AI-assisted feature designed to incorporate the Golden Ratio into every shot. By guiding your framing and composition, Flow 2 Pro helps even novice creators achieve professional, cinematic results.When shooting in the Insta360 app, simply tap one of the nine grids, and the gimbal will automatically analyze subject position and composition to get a better result. Perfect for cinematic moments.An All-in-One Content Creation ToolWhether you’re filming on the go, setting up a professional shoot, or exploring new creative angles, Flow 2 Pro has you covered. Its upgraded features ensure every creator can bring their vision to life, easier.Sturdier Build, 360° Tracking and Free Tilt ModeFlow 2 Pro’s sturdier build offers enhanced durability with a stronger tripod, while the Free Tilt Mode unlocks creative potential for filmmakers and vloggers. With this feature, creators can achieve breathtaking shots like:Crane Shots: Sweeping vertical and horizontal movements for cinematic storytelling.Tilt Shots: Elevate perspectives with smooth, controlled angles.Crane + Tilt Combinations: Combine movements for even richer narratives.Flow 2 Pro also supports complete 360° Infinite Pan Tracking, which allows it to rotate endlessly for uninterrupted tracking. Whether you’re following fast-paced sports, capturing live events, or experimenting with creative transitions, this innovation ensures you never miss a moment.Advanced HDR and CodecsFlow 2 Pro supports Dolby Vision and Apple ProRes for cinematic clarity, color depth, and dynamic range. Highlights include:Dolby Vision: Boost brightness and color contrast for a vibrant, lifelike look.Apple ProRes: Capture in HDR, SDR, or Log for detailed, professional-grade editing flexibility.The result? Every shot, whether spontaneous or planned, shines with incredible visual fidelity.New Selfie MirrorThe gimbal now sports a mirror right on its body, ensuring creators can frame without a screen, perfect for selfies or vlogging when using the rear camera of your phone for better image quality. The mirror’s adjustable angle ensures you look your best in every shot.TeleprompterFor live streamers or content creation, forget memorizing lines or awkward pauses. With Flow 2 Pro’s Teleprompter Mode, creators can integrate scripts directly into their filming or livestream workflow.Remote Control via Apple Watch or Second SmartphoneControl Flow 2 Pro remotely using either an Apple Watch or a second smartphone. This allows creators to adjust angles, start/stop recording, or manage tracking—all without interrupting the shot. Perfect for dynamic filming setups or solo creators who need flexibility.New Accessories and EssentialsExpand your creative possibilities with Flow 2 Pro’s lineup of dedicated accessories, including:Magnetic Phone Mount: Snap on for an easy setup. Doubles as a desktop stand.Magnetic Cooling Mount: Optimized for iPhones with two sizes to fit different models.Backpack Mount: Hands-free filming on the move.Available NowInsta360 Flow 2 Pro will be available globally starting January 16th 2025 in two colors: Stone Grey and Summit White. The Standard Bundle is priced at USD $159.99, and the Creator Bundle at USD $189.99. For more details and to purchase, visit Insta360.com, Amazon, and more.When you purchase through links on our site, we may earn an affiliate commission. Here's how it works.",
  "image": "https://www.canonrumors.com/wp-content/uploads/2025/01/1736984819_1868607.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-63088\"\u003e\u003cdiv\u003e\u003cp\u003eIt wasn’t too long ago that Insta360 launched its Flow gimbal, and they are at it again,  updating and improving it in quite a few areas.  It’s already available and shipping now.\u003c/p\u003e\u003cp\u003eKey features;\u003c/p\u003e\u003cul\u003e\u003cli\u003e3-Axis Stabilization for Smooth Footage\u003c/li\u003e\u003cli\u003eBuilt-In Selfie Stick and Tripod\u003c/li\u003e\u003cli\u003eDeep Track 4.0 AI Subject Tracking\u003c/li\u003e\u003cli\u003e1-Tap Pairing, Native iOS Tracking\u003c/li\u003e\u003cli\u003eRing Light Indicator\u003c/li\u003e\u003cli\u003e360° Infinite Pan\u003c/li\u003e\u003cli\u003eSmartWheel Control for Zoom/Mode/Trigger\u003c/li\u003e\u003cli\u003eMagnetic Phone Clamp\u003c/li\u003e\u003cli\u003eEdit with Insta360 App\u003c/li\u003e\u003c/ul\u003e\u003chr/\u003e\u003cp\u003ePurchase from our Preferred Vendors\u003c/p\u003e\u003cp\u003ePress Release\u003c/p\u003e\u003cdiv\u003e\u003ch2 id=\"h-meet-insta360-flow-2-pro-revolutionary-smartphone-filmmaking-with-advanced-ai-amp-seamless-iphone-integration\"\u003eMeet Insta360 Flow 2 Pro: Revolutionary Smartphone Filmmaking with Advanced AI \u0026amp; Seamless iPhone Integration\u003c/h2\u003e\u003cp\u003eInsta360 is excited to unveil the latest evolution in smartphone stabilizers: Insta360 Flow 2 Pro.\u003c/p\u003e\u003cp\u003eDesigned for creators, solo adventurers, and professionals alike, this next-generation AI-powered gimbal combines groundbreaking technology with an all-in-one design to transform your smartphone into the ultimate content creation tool.\u003c/p\u003e\u003cp\u003e\u003cbr/\u003eWith extended Apple DockKit integration, all-new Deep Track 4.0 AI tracking, and professional-grade features like Active Zoom Tracking and Multi-Person Tracking, Flow 2 Pro pushes Insta360’s innovations in the mobile content creation space to new heights. Upgrades to its built-in tripod, power bank, and selfie stick, and Flow 2 Pro sets a new benchmark for smartphone filmmaking.\u003c/p\u003e\u003cp\u003e“The idea of Flow 2 Pro is simple: Bridge the gap between professional-quality tools and everyday accessibility,” shares JK Liu, founder of Insta360. “We’re bringing our cutting-edge AI tracking to the table, with even more enhancements, as well as seamless iPhone and Android integration.”\u003c/p\u003e\u003ch3 id=\"h-unprecedented-tracking-capabilities\"\u003eUnprecedented Tracking Capabilities\u003c/h3\u003e\u003cp\u003eInsta360 Flow 2 Pro elevates mobile videography by integrating Apple DockKit, an industry-first innovation that bridges the gap between professional-grade tracking and user-friendly convenience.\u003c/p\u003e\u003cp\u003eDesigned exclusively for iPhones, Flow 2 Pro uses Apple DockKit to unlock seamless native subject tracking for iPhone’s built-in Camera app, as well as Blackmagic (including SmartWheel use) and over 200+ third-party iOS apps. From Photo and Cinematic modes to Slow Motion, Flow 2 Pro eliminates the need for additional software, offering a user experience that combines simplicity with performance.\u003c/p\u003e\u003cp\u003eDockKit transforms your device into a powerful production tool—perfect for content creation, virtual meetings, video calls, live streaming, and more.\u003c/p\u003e\u003ch3 id=\"h-meet-deep-track-4-0\"\u003eMeet Deep Track 4.0\u003c/h3\u003e\u003cp\u003eFlow 2 Pro introduces Deep Track 4.0, the ultimate evolution in AI-powered tracking technology. Available in the Insta360 app, the latest rendition is built for creators who demand the best, bringing a host of cutting-edge capabilities that ensure your shots are always perfectly framed and effortlessly smooth.\u003c/p\u003e\u003ch3 id=\"h-new-active-zoom-tracking\"\u003eNew Active Zoom Tracking\u003c/h3\u003e\u003cp\u003eZooming in up to 15x while tracking a moving subject is now possible thanks to Active Zoom Tracking. Perfect for capturing dynamic sports or distant scenes, this feature is a game-changer for creators looking to hone in on the action. Unlike competing products that cap zoom capabilities and are unable to track effectively at range, Flow 2 Pro ensures your shot is crystal clear and perfectly framed, no matter how the distance.\u003c/p\u003e\u003ch3 id=\"h-multi-person-tracking\"\u003eMulti-Person Tracking\u003c/h3\u003e\u003cp\u003eCapture every moment—Flow 2 Pro tracks multiple people in real time, keeping your whole group perfectly framed. From family photos to group dancing videos, AI automatically adapts to your environment and keep up with every movement so your whole group is centered and in shot.\u003c/p\u003e\u003ch3 id=\"h-pro-framing-grid\"\u003ePro Framing Grid\u003c/h3\u003e\u003cp\u003eStorytelling is made richer with the built-in Pro Framing Grid, an AI-assisted feature designed to incorporate the Golden Ratio into every shot. By guiding your framing and composition, Flow 2 Pro helps even novice creators achieve professional, cinematic results.\u003c/p\u003e\u003cp\u003eWhen shooting in the Insta360 app, simply tap one of the nine grids, and the gimbal will automatically analyze subject position and composition to get a better result. Perfect for cinematic moments.\u003c/p\u003e\u003ch3 id=\"h-an-all-in-one-content-creation-tool\"\u003eAn All-in-One Content Creation Tool\u003c/h3\u003e\u003cp\u003eWhether you’re filming on the go, setting up a professional shoot, or exploring new creative angles, Flow 2 Pro has you covered. Its upgraded features ensure every creator can bring their vision to life, easier.\u003c/p\u003e\u003ch3 id=\"h-sturdier-build-360-tracking-and-free-tilt-mode\"\u003eSturdier Build, 360° Tracking and Free Tilt Mode\u003c/h3\u003e\u003cp\u003eFlow 2 Pro’s sturdier build offers enhanced durability with a stronger tripod, while the Free Tilt Mode unlocks creative potential for filmmakers and vloggers. With this feature, creators can achieve breathtaking shots like:\u003c/p\u003e\u003cul\u003e\u003cli\u003eCrane Shots: Sweeping vertical and horizontal movements for cinematic storytelling.\u003c/li\u003e\u003cli\u003eTilt Shots: Elevate perspectives with smooth, controlled angles.\u003c/li\u003e\u003cli\u003eCrane + Tilt Combinations: Combine movements for even richer narratives.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eFlow 2 Pro also supports complete 360° Infinite Pan Tracking, which allows it to rotate endlessly for uninterrupted tracking. Whether you’re following fast-paced sports, capturing live events, or experimenting with creative transitions, this innovation ensures you never miss a moment.\u003c/p\u003e\u003ch3 id=\"h-advanced-hdr-and-codecs\"\u003eAdvanced HDR and Codecs\u003c/h3\u003e\u003cp\u003eFlow 2 Pro supports Dolby Vision and Apple ProRes for cinematic clarity, color depth, and dynamic range. Highlights include:\u003c/p\u003e\u003cul\u003e\u003cli\u003eDolby Vision: Boost brightness and color contrast for a vibrant, lifelike look.\u003c/li\u003e\u003cli\u003eApple ProRes: Capture in HDR, SDR, or Log for detailed, professional-grade editing flexibility.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe result? Every shot, whether spontaneous or planned, shines with incredible visual fidelity.\u003c/p\u003e\u003ch3 id=\"h-new-selfie-mirror\"\u003eNew Selfie Mirror\u003c/h3\u003e\u003cp\u003eThe gimbal now sports a mirror right on its body, ensuring creators can frame without a screen, perfect for selfies or vlogging when using the rear camera of your phone for better image quality. The mirror’s adjustable angle ensures you look your best in every shot.\u003c/p\u003e\u003ch3 id=\"h-teleprompter\"\u003eTeleprompter\u003c/h3\u003e\u003cp\u003eFor live streamers or content creation, forget memorizing lines or awkward pauses. With Flow 2 Pro’s Teleprompter Mode, creators can integrate scripts directly into their filming or livestream workflow.\u003c/p\u003e\u003ch3 id=\"h-remote-control-via-apple-watch-or-second-smartphone\"\u003eRemote Control via Apple Watch or Second Smartphone\u003c/h3\u003e\u003cp\u003eControl Flow 2 Pro remotely using either an Apple Watch or a second smartphone. This allows creators to adjust angles, start/stop recording, or manage tracking—all without interrupting the shot. Perfect for dynamic filming setups or solo creators who need flexibility.\u003c/p\u003e\u003ch3 id=\"h-new-accessories-and-essentials\"\u003eNew Accessories and Essentials\u003c/h3\u003e\u003cp\u003eExpand your creative possibilities with Flow 2 Pro’s lineup of dedicated accessories, including:\u003c/p\u003e\u003cul\u003e\u003cli\u003eMagnetic Phone Mount: Snap on for an easy setup. Doubles as a desktop stand.\u003c/li\u003e\u003cli\u003eMagnetic Cooling Mount: Optimized for iPhones with two sizes to fit different models.\u003c/li\u003e\u003cli\u003eBackpack Mount: Hands-free filming on the move.\u003c/li\u003e\u003c/ul\u003e\u003ch3 id=\"h-available-now\"\u003eAvailable Now\u003c/h3\u003e\u003cp\u003eInsta360 Flow 2 Pro will be available globally starting January 16th 2025 in two colors: Stone Grey and Summit White. The Standard Bundle is priced at USD $159.99, and the Creator Bundle at USD $189.99. For more details and to purchase, visit Insta360.com, Amazon, and more.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"wpadc-wrapper\"\u003e\u003cp\u003e\u003cspan\u003eWhen you purchase through links on our site, we may earn an affiliate commission. \u003c/span\u003e\u003cspan\u003e\u003ca href=\"https://www.canonrumors.com/affiliate-disclosure/\"\u003eHere\u0026#39;s how it works\u003c/a\u003e\u003c/span\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-16T15:58:14Z",
  "modifiedTime": "2025-01-16T16:00:09Z"
}
