{
  "id": "5e2a67cb-8d41-4e8e-a573-e47f39bcd75a",
  "title": "DJI Stays Legal: US Congress Finalizes Defense Act Without Drone Ban",
  "link": "https://petapixel.com/2024/12/18/dji-stays-legal-us-congress-finalizes-defense-act-without-drone-ban/",
  "description": "DJI earned a key win today in an increasingly complicated legal landscape for Chinese companies operating within the United States. The Countering CCP Drones Act was not included in the FY25 National Defense Authorization Act (NDAA) that passed in the United States Congress this week, meaning that DJI is not banned from operating or selling products in the United States. [Read More]",
  "author": "Jeremy Gray",
  "published": "Wed, 18 Dec 2024 22:25:41 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Equipment",
    "Law",
    "News",
    "congress",
    "counteringccpdronesact",
    "dji",
    "drones",
    "law"
  ],
  "byline": "Jeremy Gray",
  "length": 2762,
  "excerpt": "DJI avoids a drone ban in the United States... for now.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "DJI earned a key win today in an increasingly complicated legal landscape for Chinese companies operating within the United States. The Countering CCP Drones Act was not included in the FY25 National Defense Authorization Act (NDAA) that passed in the United States Congress this week, meaning that DJI is not banned from operating or selling products in the United States. “We want to take this opportunity to express our gratitude to the drone community for your tireless and productive efforts to engage Senators and House Representatives,” DJI writes in a new post on its official blog. “Sharing your personal stories and explaining how such actions would impact you and your business have been truly impactful. We reaffirm our commitment to you, our valued partners and customers, and will continue to engage with members of Congress and other relevant stakeholders to ensure you maintain access to our products.” That last line is crucial, as while the Countering CCP Drones Act was not included in the newly passed NDAA, that does not mean DJI is out of the woods. The company notes that the NDAA “calls for a risk assessment” concerning Chinese drones, scrutiny that DJI says it looks forward to, such that it can showcase its privacy controls and security features to the American government. However, the company maintains concerns. DJI says the legislation “unfairly singles out Chinese drones” and fails to designate an agency to conduct the required risk study. If no agency performs the study, DJI will automatically be added to the FCC’s Covered List of banned drones. Further, DJI says it should have a fair opportunity to respond to any assessment findings, “as no technology audit is ever perfect.” The company has conducted regular internal and external audits of its products since 2017. “To be clear, DJI is not banned from operating or selling products in the U.S. market,” it emphasizes, despite its concerns over the NDAA passed this week. DJI has formally requested that Congress designate a technically focused agency to conduct the required assessment and allow DJI to reply to findings. “This year has seen a flurry of legislative activity with potential implications for DJI’s operations… With a new Administration taking office in 2025, next year will be equally critical, making it more important than ever to stay informed and engaged,” DJI concludes. For now, DJI has evaded an outright ban in the United States, and the company appears cautiously optimistic that it will continue to be able to operate within the country. Image credits: DJI PetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.",
  "image": "https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\u003carticle data-post-id=\"773336\"\u003e\n\n    \u003cheader\u003e\n          \n    \n\n        \n  \u003c/header\u003e\n      \n  \n\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured.jpg\" alt=\"A person standing next to a vehicle, flying a drone in a desert landscape. The person holds a remote control, and the sky and distant hills are visible in the background.\" width=\"1600\" height=\"863\" srcset=\"https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured.jpg 1600w, https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured-320x173.jpg 320w, https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured-800x432.jpg 800w, https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured-1536x828.jpg 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\"/\u003e\u003c/p\u003e \u003cp\u003eDJI earned a key win today in an increasingly complicated legal landscape for Chinese companies operating within the United States. The \u003ca href=\"https://petapixel.com/2024/09/11/dji-drone-ban-bill-passes-house-and-is-headed-to-the-senate/\" data-wpel-link=\"internal\"\u003eCountering CCP Drones Act\u003c/a\u003e was not included in the FY25 National Defense Authorization Act (NDAA) that passed in the United States Congress this week, meaning that DJI is not banned from operating or selling products in the United States. \u003c/p\u003e  \u003cp\u003e“We want to take this opportunity to express our gratitude to the drone community for your tireless and productive efforts to engage Senators and House Representatives,” DJI writes in a \u003ca href=\"https://viewpoints.dji.com/blog/u.s.-congress-finalizes-fy25-national-defense-authorization-act-ndaa-without-countering-ccp-drones-act-heres-what-to-watch-for-in-2025\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003enew post\u003c/a\u003e on its official blog. “Sharing your personal stories and explaining how such actions would impact you and your business have been truly impactful. We reaffirm our commitment to you, our valued partners and customers, and will continue to engage with members of Congress and other relevant stakeholders to ensure you maintain access to our products.” \u003c/p\u003e \u003cp\u003eThat last line is crucial, as while the Countering CCP Drones Act was not included in the newly passed NDAA, that does not mean DJI is out of the woods. The company notes that the NDAA “calls for a risk assessment” concerning Chinese drones, scrutiny that DJI says it looks forward to, such that it can showcase its privacy controls and security features to the American government. \u003c/p\u003e \u003cp\u003eHowever, the company maintains concerns. DJI says the legislation “unfairly singles out Chinese drones” and fails to designate an agency to conduct the required risk study. If no agency performs the study, DJI will automatically be added to the FCC’s Covered List of banned drones. \u003c/p\u003e \u003cp\u003eFurther, DJI says it should have a fair opportunity to respond to any assessment findings, “as no technology audit is ever perfect.” The company has conducted regular internal and external audits of its products since 2017. \u003c/p\u003e \u003cp\u003e“To be clear, DJI is not banned from operating or selling products in the U.S. market,” it emphasizes, despite its concerns over the NDAA passed this week. \u003c/p\u003e\n \u003cp\u003eDJI has formally requested that Congress designate a technically focused agency to conduct the required assessment and allow DJI to reply to findings. \u003c/p\u003e \u003cp\u003e“This year has seen a flurry of legislative activity with potential implications for DJI’s operations… With a new Administration taking office in 2025, next year will be equally critical, making it more important than ever to stay informed and engaged,” DJI concludes. \u003c/p\u003e \u003cp\u003eFor now, DJI has evaded an outright ban in the United States, and the company appears cautiously optimistic that it will continue to be able to operate within the country. \u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e DJI \u003c/em\u003e \u003c/p\u003e      \u003c/div\u003e\n\n          \n      \n\n              \u003cdiv\u003e\n          \u003cp\u003ePetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.\u003c/p\u003e\n        \u003c/div\u003e\n      \n    \n\n    \n          \n      \n\n\n\n\n    \n    \n    \n          \n      \u003c/div\u003e\n\u003c/article\u003e\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-18T22:25:41Z",
  "modifiedTime": null
}
