{
  "id": "9154f167-e29b-4e0e-b542-df8620ead291",
  "title": "More from my in progress Project",
  "link": "https://stuckincustoms.com/2025/04/29/more-from-my-in-progress-project/",
  "description": "Hey awesome reader. A little more from me on Aperty, which if you read the previous post you’ll know I’m using for a current project. A couple of things this time round. Firstly Sklyum let me know that the offer I mentioned expires in the next day or so. Therefore, if you want to grab […] The post More from my in progress Project appeared first on Stuck in Customs.",
  "author": "Stu Davidson",
  "published": "Tue, 29 Apr 2025 19:01:00 +0000",
  "source": "https://stuckincustoms.com/feed/",
  "categories": [
    "Aperty",
    "Photo Software",
    "Skylum",
    "aperty",
    "portrait",
    "Post processing"
  ],
  "byline": "Stu Davidson",
  "length": 2737,
  "excerpt": "Hey awesome reader. A little more from me on Aperty, which if you read the previous post you’ll know I’m using for a current project. A couple of things this time round. Firstly Sklyum let me know that the offer I mentioned expires in the next day or so. Therefore, if you want to grab […]",
  "siteName": "Stuck in Customs",
  "favicon": "",
  "text": "29 April 2025 : Tuesday Apr 2025 : Tuesday Hey awesome reader. A little more from me on Aperty, which if you read the previous post you’ll know I’m using for a current project. A couple of things this time round. Firstly Sklyum let me know that the offer I mentioned expires in the next day or so. Therefore, if you want to grab it, now’s the time. Secondly, I wanted to cover some of other features that stood out in my time so far with the software… Last time I talked about a couple of features which really help with processing workflow. Fixing common issues with skin, etc. This time let’s focus a bit on the eyes. I LOVE a good iris in an image… or two depending on how you look at it. Sometimes that can be a challenge though, like the image above. Originally, with such a bright day in the African desert, the lovely Rose had some significant reflections in her eyes. Not a problem with Aperty, just a few button clicks and we’ve got some nice iris replacement. You can also keep things more natural and enhance what’s already there if you have a good clear image however here replacement was needed to remove the distracting reflection. The before and after can be a little odd, so here’s the final version. Aperty also has some cool creative enhancements, like the ability to add a flash of color via generated eyeliner. Again a click or two and a move of a slider and it’s done. It’s not my sort of thing usually, I tend to stick with whatever look the person had, however this software magic tickles my tech brain in a fun way. Nicely done Skylum! Wrapping things up for now, I think the best way I’d sum up Aperty is that at its core it is a great bit of software for those processing people photos (including groups, street photography, etc) on a regular basis. Especially those who do sessions with the same model, or have a consistent look to go for over a large range of images. For example, being able to apply some sympathetic, natural skin smoothing and blemish removal quickly and easily across a batch of images of the same person is a real time saver. Oh, and the batch processing feature is included in the price, not as a charged extra as with some competing software. The speed and lack of clutter in the UI is also great, getting you (well, me in this case) to the more creative, fun processing as quickly as possible. So, that’s it for now. As I mentioned, their current offer with 50% off and some free stuff ends tomorrow-ish. So it’s now or never for that. Be sure to share some of your creations with me… by email, or tag me on socials. Have fun! 🙂 And finally, here are a few more of my creations. 🙂",
  "image": "https://i0.wp.com/photos.smugmug.com/photos/i-v6bXMRB/0/MMjfk8RmGgR4dFJXrWkzdwzjFDqV4kjzRFsjTGB9D/XL/i-v6bXMRB-XL.jpg?w=900\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t29\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cspan\u003eApril 2025 : Tuesday \u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003eApr 2025 : Tuesday \u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\u003cp\u003eHey awesome reader. A little more from me on Aperty, which if you read the previous post you’ll know I’m using for a current project. A couple of things this time round. Firstly Sklyum let me know that the offer I mentioned expires in the next day or so. Therefore, if you want to \u003ca target=\"_blank\" href=\"https://stuckincustoms.com/aperty\"\u003egrab it, now’s the time\u003c/a\u003e. Secondly, I wanted to cover some of other features that stood out in my time so far with the software… \u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://stuckincustoms.com/aperty\" target=\"_blank\"\u003e\u003cbr/\u003e\n  \u003cimg data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/photos.smugmug.com/photos/i-6Xb2m5Q/0/MgPBWzSwRtXfJnk7mnfF6xSTsgqxSwQ99hdfpSS6z/X2/i-6Xb2m5Q-X2.png?w=900\u0026amp;ssl=1\" alt=\"Skylum Aperty Example\"/\u003e\u003cbr/\u003e\n\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eLast time I talked about a couple of features which really help with processing workflow. Fixing common issues with skin, etc. This time let’s focus a bit on the eyes. I LOVE a good iris in an image… or two depending on how you look at it. Sometimes that can be a challenge though, like the image above. Originally, with such a bright day in the African desert, the lovely Rose had some significant reflections in her eyes. Not a problem with Aperty, just a few button clicks and we’ve got some nice iris replacement. You can also keep things more natural and enhance what’s already there if you have a good clear image however here replacement was needed to remove the distracting reflection.\u003cbr/\u003e\n\u003ca href=\"https://stuckincustoms.com/aperty\" target=\"_blank\"\u003e\u003cbr/\u003e\n  \u003cimg data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/photos.smugmug.com/photos/i-BcC2vbg/0/KM5d8dvz6k5GWTDQSnnKW2VvVb4wxML7mRNBsVQpC/X2/i-BcC2vbg-X2.jpg?w=900\u0026amp;ssl=1\" alt=\"Skylum Aperty Example Iris\"/\u003e\u003cbr/\u003e\n\u003c/a\u003e\u003cbr/\u003e\nThe before and after can be a little odd, so here’s the final version.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://stuckincustoms.com/aperty\" target=\"_blank\"\u003e\u003cbr/\u003e\n  \u003cimg data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/photos.smugmug.com/photos/i-BpT4JpF/0/K283KkjT8mSL9HBN37fSs2Mj2w9nvzkWdRL73P8tC/XL/i-BpT4JpF-XL.jpg?w=900\u0026amp;ssl=1\" alt=\"Skylum Aperty Eyeliner Example\"/\u003e\u003cbr/\u003e\n\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAperty also has some cool creative enhancements, like the ability to add a flash of color via generated eyeliner. Again a click or two and a move of a slider and it’s done. It’s not my sort of thing usually, I tend to stick with whatever look the person had, however this software magic tickles my tech brain in a fun way. Nicely done Skylum!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://stuckincustoms.com/aperty\" target=\"_blank\"\u003e\u003cbr/\u003e\n  \u003cimg data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/photos.smugmug.com/photos/i-KNqb7bg/0/KGBcCKxd2d2np4Nv8nr5jBJ973NBkGfkMvKKBrbF4/X2/i-KNqb7bg-X2.jpg?w=900\u0026amp;ssl=1\" alt=\"Skylum Aperty Wrinkle Example\"/\u003e\u003cbr/\u003e\n\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWrapping things up for now, I think the best way I’d sum up Aperty is that at its core it is a great bit of software for those processing people photos (including groups, street photography, etc) on a regular basis. Especially those who do sessions with the same model, or have a consistent look to go for over a large range of images. For example, being able to apply some sympathetic, natural skin smoothing and blemish removal quickly and easily across a batch of images of the same person is a real time saver. Oh, and the batch processing feature is included in the price, not as a charged extra as with some competing software. The speed and lack of clutter in the UI is also great, getting you (well, me in this case) to the more creative, fun processing as quickly as possible.\u003c/p\u003e\n\u003cp\u003eSo, that’s it for now. As I mentioned, their current offer with 50% off and some free stuff ends tomorrow-ish. So it’s \u003ca target=\"_blank\" href=\"https://stuckincustoms.com/aperty\"\u003enow or never\u003c/a\u003e for that. Be sure to share some of your creations with me… by email, or tag me on socials. Have fun! 🙂 And finally, here are a few more of my creations. 🙂\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://stuckincustoms.com/aperty\" target=\"_blank\"\u003e\u003cbr/\u003e\n  \u003cimg data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/photos.smugmug.com/photos/i-tDQLfS2/0/MC5NnNNm3RvZs4rCHnCrctBRwRkJx2WCwD2CjBLTM/X2/i-tDQLfS2-X2.jpg?w=900\u0026amp;ssl=1\" alt=\"Skylum Aperty Example 1\"/\u003e\u003cbr/\u003e\n\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://stuckincustoms.com/aperty\" target=\"_blank\"\u003e\u003cbr/\u003e\n  \u003cimg data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/photos.smugmug.com/photos/i-mRKQFQ9/0/KRSvqWcFkFB857GLGgwwhz8WNMhKVKtvK9ftL7Wz7/X2/i-mRKQFQ9-X2.jpg?w=900\u0026amp;ssl=1\" alt=\"Skylum Aperty Example 2\"/\u003e\u003cbr/\u003e\n\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://stuckincustoms.com/aperty\" target=\"_blank\"\u003e\u003cbr/\u003e\n  \u003cimg data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/photos.smugmug.com/photos/i-v6bXMRB/0/MMjfk8RmGgR4dFJXrWkzdwzjFDqV4kjzRFsjTGB9D/XL/i-v6bXMRB-XL.jpg?w=900\u0026amp;ssl=1\" alt=\"Skylum Aperty Example 3\"/\u003e\u003cbr/\u003e\n\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-29T19:01:00Z",
  "modifiedTime": null
}
