{
  "id": "d272e100-7a67-413b-a21c-fe7bb4b33aca",
  "title": "Apple Is Redesigning Its Camera App In iOS26",
  "link": "https://www.lightstalking.com/camera-ios26/",
  "description": "In the recent Worldwide Developers Conference (WWDC), Apple previewed the iOS 26 that will elevate the user experience with their iPhones. While there are a lot of new features that will be introduced in the iOS 26 release, the one that looks quite interesting for photographers is the update for iPhone's camera app. There haven't been much in terms of design for the camera app in the recent years and many users may feel that the app is not quite straightforward or user-friendly in terms of certain features. The post Apple Is Redesigning Its Camera App In iOS26 appeared first on Light Stalking.",
  "author": "Dahlia Ambrose",
  "published": "Wed, 11 Jun 2025 12:00:00 +0000",
  "source": "https://www.lightstalking.com/feed/",
  "categories": [
    "Photography News"
  ],
  "byline": "Dahlia Ambrose",
  "length": 2410,
  "excerpt": "In the recent Worldwide Developers Conference (WWDC), Apple previewed the iOS 26 that will elevate the user experience with their iPhones. While there are a lot of new features that will be introduced in the iOS 26 release, the one that looks quite interesting for photographers is the update for iPhone's camera app. There haven't been much in terms of design for the camera app in the recent years and many users may feel that the app is not quite straightforward or user-friendly in terms of certain features.",
  "siteName": "Light Stalking",
  "favicon": "",
  "text": "In the recent Worldwide Developers Conference (WWDC), Apple previewed the iOS 26 that will elevate the user experience with their iPhones. The release will be in late 2025 and it will deliver a new design, powerful Apple intelligence which many users complained about in their latest iPhones and exciting ways to stay connected to their apps while ignoring unwanted or distracting notifications. Image by Apple While there are a lot of new features that will be introduced in the iOS 26 release, the one that looks quite interesting for photographers is the update for iPhone's camera app. There hasn't been much in terms of design for the camera app in the recent years and many users may feel that the app is not quite straightforward or user-friendly in terms of certain features. Also, with the many tabs at the bottom when launching the camera app, some users may find it overwhelming or cluttered, or even accidentally tap on a tab that they do not intend to use. It looks like the new redesign will have just the basic tabs by default and one will have to access the other advanced modes by swiping on the screen. While the Camera app has a new look with the very simplified Photo and Video tabs layout, Apple has also brought back the Library and Collections tab on the main page of the Photos app. This will be a relief as media types and other collections will be displayed in different tabs, rather than having to scroll down the screen. Apple also has mentioned a “Lens Cleaning Hints” feature, which may be useful when the lenses have marks and the photographer isn't aware. This may need to be turned on in the settings app. Some Android phones already have this feature. Besides the above, the Photos app is getting a “Liquid Glass” design. This means the controls will be displayed in a semi-transparent tab or pane. Apple also mentions that it will be updating its Airpods to add remote functionality, which means users can press and hold the AirPods stem to capture photos or start and stop recording videos. This feature will work with the native camera app and compatible third party camera apps. You can read more about the iOS 26 experience here in Apple's newsroom. Note: Apple has changed the naming structure for their operating system updates, tying them to the year after its launch. We have more news for you to read if you are interested at this link here.",
  "image": "https://www.lightstalking.com/wp-content/uploads/iOS26.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"site-content\" role=\"main\"\u003e\n\t\n\u003carticle id=\"post-520565\"\u003e\n\t\n\t\u003cdiv\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\n\u003cp\u003eIn the recent Worldwide Developers Conference (WWDC), Apple previewed the iOS 26 that will elevate the user experience with their iPhones. The release will be in late 2025 and it will deliver a new design, powerful Apple intelligence which many users complained about in their latest iPhones and exciting ways to stay connected to their apps while ignoring unwanted or distracting notifications. \u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://www.lightstalking.com/wp-content/uploads/iOS26.png.webp 679w, https://www.lightstalking.com/wp-content/uploads/iOS26-400x219.png.webp 400w\" sizes=\"(max-width: 679px) 100vw, 679px\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" width=\"679\" height=\"372\" src=\"https://www.lightstalking.com/wp-content/uploads/iOS26.png\" alt=\"\" srcset=\"https://www.lightstalking.com/wp-content/uploads/iOS26.png 679w, https://www.lightstalking.com/wp-content/uploads/iOS26-400x219.png 400w\" sizes=\"(max-width: 679px) 100vw, 679px\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eImage by Apple\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eWhile there are a lot of new features that will be introduced in the iOS 26 release, the one that looks quite interesting for photographers is the update for iPhone\u0026#39;s camera app. There hasn\u0026#39;t been much in terms of design for the camera app in the recent years and many users may feel that the app is not quite straightforward or user-friendly in terms of certain features.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlso, with the many tabs at the bottom when launching the camera app, some users may find it overwhelming or cluttered, or even accidentally tap on a tab that they do not intend to use. It looks like the new redesign will have just the basic tabs by default and one will have to access the other advanced modes by swiping on the screen.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile the Camera app has a new look with the very simplified Photo and Video tabs layout, Apple has also brought back the Library and Collections tab on the main page of the Photos app. This will be a relief as media types and other collections will be displayed in different tabs, rather than having to scroll down the screen. \u003c/p\u003e\n\n\n\n\u003cp\u003eApple also has mentioned a “Lens Cleaning Hints” feature, which may be useful when the lenses have marks and the photographer isn\u0026#39;t aware. This may need to be turned on in the settings app. Some Android phones already have this feature. Besides the above, the Photos app is getting a “Liquid Glass” design. This means the controls will be displayed in a semi-transparent tab or pane.\u003c/p\u003e\n\n\n\n\u003cp\u003eApple also mentions that it will be updating its Airpods to add remote functionality, which means users can press and hold the AirPods stem to capture photos or start and stop recording videos. This feature will work with the native camera app and compatible third party camera apps. You can read more about the iOS 26 experience \u003ca href=\"https://www.apple.com/in/newsroom/2025/06/apple-elevates-the-iphone-experience-with-ios-26/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ehere \u003c/a\u003ein Apple\u0026#39;s newsroom.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eNote\u003c/strong\u003e: Apple has changed the naming structure for their operating system updates, tying them to the year after its launch.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eWe have more news for you to read if you are interested \u003ca href=\"https://www.lightstalking.com/category/news/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eat this link\u003c/a\u003e here.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\u003cp\u003e\u003cimg alt=\"\" src=\"https://secure.gravatar.com/avatar/5a063871b5503bad94812e2cd8588ce40482dc9c673aad5e76647937d4753c55?s=120\u0026amp;r=g\" srcset=\"https://secure.gravatar.com/avatar/5a063871b5503bad94812e2cd8588ce40482dc9c673aad5e76647937d4753c55?s=240\u0026amp;r=g 2x\" height=\"120\" width=\"120\" decoding=\"async\"/\u003e\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/div\u003e\t\t\n\t\t\t\u003c/div\u003e\n\u003c/article\u003e\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-11T12:00:00Z",
  "modifiedTime": null
}
