{
  "id": "f301ac05-671c-40fd-8d4c-aec3b728a76b",
  "title": "Peak Design Denies It ‘Traced’ the Bag of the UnitedHealthcare CEO Shooter",
  "link": "https://petapixel.com/2024/12/13/peak-design-denies-it-traced-the-bag-of-the-unitedhealthcare-ceo-shooter/",
  "description": "In the early hours after the shooting of UnitedHealthcare CEO Brian Thompson earlier this month, one of the first images of the alleged attacker showed him wearing a Peak Design backpack. Rumors in recent days have emerged alleging Peak Design aided in his arrest, and the company's CEO now officially denies this. [Read More]",
  "author": "Jaron Schneider",
  "published": "Fri, 13 Dec 2024 23:16:40 +0000",
  "source": "https://petapixel.com/feed/",
  "categories": [
    "Equipment",
    "News",
    "ceo",
    "everydaybackpack",
    "peakdesign",
    "peterdering",
    "shooting",
    "unitedhealthcare"
  ],
  "byline": "Jaron Schneider",
  "length": 2717,
  "excerpt": "Peak Design's CEO denies it traced the serial number of the backpack worn by the shooter of the UnitedHealthcare CEO.",
  "siteName": "PetaPixel",
  "favicon": "https://petapixel.com/wp-content/themes/petapixel-2017/assets/prod/img/apple-touch-icon-180x180.png",
  "text": "In the early hours after the shooting of UnitedHealthcare CEO Brian Thompson earlier this month, one of the first images of the alleged attacker showed him wearing a Peak Design backpack. Rumors in recent days have emerged alleging Peak Design aided in his arrest, and the company’s CEO now officially denies this. The guman, now allegedly Luigi Mangione, is in custody and multiple rumors and conspiracy theories have been circulating that attempt to explain some perceived inconsistencies in the story of his arrest. One major allegation that has come up in the last day on Threads and TikTok (links via The Verge) is that Peak Design CEO Peter Dering volunteered information of the bag’s purchaser by tracing its owner via its serial number, causing widespread backlash against him and the brand. “Peak Design has not provided customer information to the police and would only do so under the order of a subpoena,” Dering writes in an official statement. “We cannot associate a product serial number with a customer unless that customer has voluntarily registered their product on our site. Serializing our products allows us to track product issues and in some cases quarantine stock if a defect is found.” Additionally, Dering says that the serial numbers of the V1 Everyday Backpack — the bag that the shooter appeared to be wearing — are not unique nor are they identifying. “They were lot numbers used to track batch production units. We did not implement unique serial numbers until V2 iterations of our Everyday Backpack,” he says. I know a peak design everyday backpack when I see one pic.twitter.com/RVury7rd6W — Browningtons 🔜📸 NOUNSVITATIONAL (@Browningtons_) December 4, 2024 “If you do choose to register a Peak Design product, and it is lost or stolen, you can reach out to our Customer Service team and have your registration erased, so the bag is not traceable back to you.” Dering ends by saying he and the company takes its customer privacy seriously. Peak Design has been in the news for reasons the company likely wasn’t prepared for. Dering even spoke to The New York Times for a story related to the shooting and said that the bag appears to be a version that is no longer sold and was likely bought between 2016 and 2019. This rumor of Dering tracing the bag’s serial number and assisting in his capture likely stems from his admission in that story that he called the NYPD tip line to share what he knew, going so far as to do “whatever is possible” to identify the shooter. Image credits: Peak Design PetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.",
  "image": "https://petapixel.com/assets/uploads/2024/12/Peak-Design-Denies-It-Traced-the-Bag-of-the-UnitedHealthcare-CEO-Shooter.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\u003carticle data-post-id=\"772712\"\u003e\n\n    \u003cheader\u003e\n          \n    \n\n        \n  \u003c/header\u003e\n      \n  \n\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cp\u003e\u003cimg data-perfmatters-preload=\"\" fetchpriority=\"high\" decoding=\"async\" src=\"https://petapixel.com/assets/uploads/2024/12/Peak-Design-Denies-It-Traced-the-Bag-of-the-UnitedHealthcare-CEO-Shooter-800x420.jpg\" alt=\"Person with a gray backpack walking down a busy city street lined with vehicles and pedestrians. The street has red lanterns hanging above, and signs in Chinese characters are visible on buildings. The person wears a white sweater and jeans.\" width=\"800\" height=\"420\" srcset=\"https://petapixel.com/assets/uploads/2024/12/Peak-Design-Denies-It-Traced-the-Bag-of-the-UnitedHealthcare-CEO-Shooter-800x420.jpg 800w, https://petapixel.com/assets/uploads/2024/12/Peak-Design-Denies-It-Traced-the-Bag-of-the-UnitedHealthcare-CEO-Shooter-320x168.jpg 320w, https://petapixel.com/assets/uploads/2024/12/Peak-Design-Denies-It-Traced-the-Bag-of-the-UnitedHealthcare-CEO-Shooter-1536x806.jpg 1536w, https://petapixel.com/assets/uploads/2024/12/Peak-Design-Denies-It-Traced-the-Bag-of-the-UnitedHealthcare-CEO-Shooter-150x79.jpg 150w, https://petapixel.com/assets/uploads/2024/12/Peak-Design-Denies-It-Traced-the-Bag-of-the-UnitedHealthcare-CEO-Shooter-300x157.jpg 300w, https://petapixel.com/assets/uploads/2024/12/Peak-Design-Denies-It-Traced-the-Bag-of-the-UnitedHealthcare-CEO-Shooter-400x209.jpg 400w, https://petapixel.com/assets/uploads/2024/12/Peak-Design-Denies-It-Traced-the-Bag-of-the-UnitedHealthcare-CEO-Shooter-550x288.jpg 550w, https://petapixel.com/assets/uploads/2024/12/Peak-Design-Denies-It-Traced-the-Bag-of-the-UnitedHealthcare-CEO-Shooter.jpg 1600w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/p\u003e \u003cp\u003eIn the early hours after the shooting of UnitedHealthcare CEO Brian Thompson earlier this month, one of the first images of the alleged attacker \u003ca href=\"https://petapixel.com/2024/12/05/the-unitedhealthcare-ceo-killer-was-wearing-a-photography-backpack-brian-thompson/\" data-wpel-link=\"internal\"\u003eshowed him wearing a Peak Design backpack\u003c/a\u003e. Rumors in recent days have emerged alleging Peak Design aided in his arrest, and the company’s CEO now officially denies this. \u003c/p\u003e  \u003cp\u003eThe guman, now allegedly Luigi Mangione, is in custody and multiple rumors and conspiracy theories have been circulating that attempt to explain some perceived inconsistencies in the story of his arrest. One major allegation that has come up in the last day on \u003ca href=\"https://www.threads.net/@jaischsolo/post/DDhhh6ZvE_E?xmt=AQGz_nm0nNdc9QdrTjLmkC_Q4ePXyRXU_uVsHtCWN2bKzA\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eThreads\u003c/a\u003e and \u003ca href=\"https://www.tiktok.com/@averyjones1111/video/7447715501901368619\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eTikTok\u003c/a\u003e (links \u003ca href=\"https://www.theverge.com/2024/12/13/24320785/peak-design-everyday-backpack-serial-number-united-healthcare-ceo-shooting\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003evia \u003cem\u003eThe Verge\u003c/em\u003e\u003c/a\u003e) is that Peak Design CEO Peter Dering volunteered information of the bag’s purchaser by tracing its owner via its serial number, causing widespread backlash against him and the brand. \u003c/p\u003e \u003ccenter\u003e \u003cblockquote data-text-post-permalink=\"https://www.threads.net/@jaischsolo/post/DDhhh6ZvE_E\" data-text-post-version=\"0\" id=\"ig-tp-DDhhh6ZvE_E\"\u003e\u003ca href=\"https://www.threads.net/@jaischsolo/post/DDhhh6ZvE_E\" target=\"_blank\" rel=\"noopener follow external\" data-wpel-link=\"external\"\u003e  \u003c/a\u003e\u003c/blockquote\u003e \u003c/center\u003e \u003cp\u003e“Peak Design has not provided customer information to the police and would only do so under the order of a subpoena,” Dering writes in \u003ca href=\"https://journal.peakdesign.com/an-official-statement-from-peak-design\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003ean official statement\u003c/a\u003e. “We cannot associate a product serial number with a customer unless that customer has voluntarily registered their product on our site.  Serializing our products allows us to track product issues and in some cases quarantine stock if a defect is found.”\u003c/p\u003e \u003cp\u003eAdditionally, Dering says that the serial numbers of the V1 Everyday Backpack — the bag that the shooter appeared to be wearing — are not unique nor are they identifying. \u003c/p\u003e \u003cp\u003e“They were lot numbers used to track batch production units. We did not implement unique serial numbers until V2 iterations of our Everyday Backpack,” he says.\u003c/p\u003e\n \u003ccenter\u003e \u003cblockquote\u003e \u003cp lang=\"en\" dir=\"ltr\"\u003eI know a peak design everyday backpack when I see one \u003ca href=\"https://t.co/RVury7rd6W\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003epic.twitter.com/RVury7rd6W\u003c/a\u003e\u003c/p\u003e \u003cp\u003e— Browningtons 🔜📸 NOUNSVITATIONAL (@Browningtons_) \u003ca href=\"https://twitter.com/Browningtons_/status/1864416403991798090?ref_src=twsrc%5Etfw\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003eDecember 4, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e \u003c/center\u003e \u003cp\u003e“If you do choose to register a Peak Design product, and it is lost or stolen, you can reach out to our Customer Service team and have your registration erased, so the bag is not traceable back to you.”\u003c/p\u003e \u003cp\u003eDering ends by saying he and the company takes its \u003ca href=\"http://peakdesign.com/privacy\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003ecustomer privacy\u003c/a\u003e seriously.\u003c/p\u003e \u003cp\u003ePeak Design has been in the news for reasons the company likely wasn’t prepared for. Dering even spoke to \u003ca href=\"https://www.nytimes.com/2024/12/05/nyregion/peak-design-backpack-brian-thompson-shooting.html\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003e\u003cem\u003eThe New York Times\u003c/em\u003e\u003c/a\u003e for a story related to the shooting and said that the bag appears to be a version that is no longer sold and was likely bought between 2016 and 2019. This rumor of Dering tracing the bag’s serial number and assisting in his capture likely stems from his admission in that story that he called the NYPD tip line to share what he knew, going so far as to do \u003ca href=\"https://www.theverge.com/2024/12/13/24320785/peak-design-everyday-backpack-serial-number-united-healthcare-ceo-shooting\" data-wpel-link=\"external\" target=\"_blank\" rel=\"follow external noopener\"\u003e“whatever is possible”\u003c/a\u003e to identify the shooter.\u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cem\u003e\u003cstrong\u003eImage credits:\u003c/strong\u003e Peak Design\u003c/em\u003e\u003c/p\u003e      \u003c/div\u003e\n\n          \n      \n\n              \u003cdiv\u003e\n          \u003cp\u003ePetaPixel articles may include affiliate links; if you buy something through such a link, PetaPixel may earn a commission.\u003c/p\u003e\n        \u003c/div\u003e\n      \n    \n\n    \n          \n      \n\n\n\n\n    \n    \n    \n          \n      \u003c/div\u003e\n\u003c/article\u003e\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-13T23:16:40Z",
  "modifiedTime": "2024-12-13T23:16:48Z"
}
