{
  "id": "4392b04d-24e5-49b3-8efb-8bddaa0db49e",
  "title": "Boosting Up Your Creativity Without Endless Reference Scrolling",
  "link": "https://smashingmagazine.com/2025/04/neuroscience-designers-boost-creativity-endless-reference-scrolling/",
  "description": "While it is clear that creativity is driven by both the left and right hemispheres, an important question remains: how can we boost creativity while keeping the process enjoyable? It may not be obvious, but non-design-related activities can, in fact, be an opportunity to enhance creativity.",
  "author": "Marina Chernyshova",
  "published": "Thu, 24 Apr 2025 10:00:00 GMT",
  "source": "https://www.smashingmagazine.com/feed",
  "categories": null,
  "byline": "About The Author",
  "length": 25774,
  "excerpt": "While it is clear that creativity is driven by both the left and right hemispheres, an important question remains: how can we boost creativity while keeping the process enjoyable? It may not be obvious, but non-design-related activities can, in fact, be an opportunity to enhance creativity.",
  "siteName": "Smashing Magazine",
  "favicon": "https://smashingmagazine.com/images/favicon/apple-touch-icon.png",
  "text": "19 min readCreativity, Workflow, Design, UXProduct design requires a balance between logic and creativity. This balance results in products that not only meet technical and user requirements but also deliver a captivating user experience. While it is clear that creativity is driven by both the left and right hemispheres, an important question remains: how can we boost creativity while keeping the process enjoyable? It may not be obvious, but non-design-related activities can, in fact, be an opportunity to enhance creativity.The work of a designer largely consists of inventing new things, which requires creativity that is generally believed to depend on inspiration, making it unpredictable and difficult to control. Many designers, as well as those who would like to try their hand at design, are wondering: what to do if inspiration does not come at the right moment?There are many practical recommendations from experienced designers and design managers on how to work without inspiration. These mainly rely on discipline, planning, and working with references. I would like to suggest an alternative approach: how to boost creativity and “lure” inspiration with the help of neuroscience.I’m Marina, and I have been deeply interested in neuroscience for a long time. I have tried many methods from my own experience and observed the experience of my colleagues. In this article, I want to share the ways that seemed to me the most effective in luring creativity, which I eventually built into my life routine on an ongoing basis.How Our Brain WorksThe brain has been and remains an important topic that is underexplored, especially in the context of design and design thinking. No other profession represents the blend of creativity and logic quite like design, in my opinion. This raises a fair question: which part of the brain is more important, the left or the right? To start with, let’s briefly refresh which part of the brain is responsible for what:Left HemisphereRight HemisphereLanguage and Speech: Language-related activities like speaking, writing, and comprehensionCreativity and Artistic Abilities: Imagination, creative thinking, music, visual arts, etc.Analytical Thinking: Mathematical operations, sequential processing, and problem-solvingEmotional Processing: Emotion recognition, facial expressions, tone of voice, gesturesLinear Thinking: Step-by-step way of information processingHolistic Thinking: Looking at the big picture rather than focusing on detailsWhile each part of the brain is responsible for certain functions, they work together to process information. For some activities (analyzing data, solving equations, and working with precise calculations), it might be more important to rely on the left hemisphere, while for others (composing music, acting), the right hemisphere.However, when it comes to the design process and design thinking, it’s essential to stimulate both hemispheres and not limit the role of a product designer to being either predominantly left- or right-brained.Interhemispheric Interaction In Product Design: Why Are Both Equally Important?In product design, the need for well-established interhemispheric interaction is especially noticeable since this work requires a balance between logic and creativity. The left hemisphere’s logical functions help designers break down complex problems, analyze user needs, and organize structured workflows, ensuring the product’s functionality and usability.For example, logical processes are crucial in creating wireframes and user flows and adhering to technical constraints. On the other side, the right hemisphere’s creative and spatial abilities play a critical role in developing visually appealing designs and innovative user experiences. It’s extremely important for a designer to think outside the box and solve user problems without forgetting about the balanced and attractive visual part at the same time.A harmonious interaction between the two hemispheres allows product designers to seamlessly integrate both practical functionality and creative innovation. This balance results in products that not only meet technical and user requirements but also deliver an enjoyable, intuitive, and visually captivating user experience.The Relevance Of This SubjectThe idea that two parts of the brain are interconnected and complement each other during creative tasks isn’t new, nor is it my invention. One of the most influential works for product designers is Experiences in Visual Thinking by Robert H. McKim, an Emeritus Professor of Mechanical Engineering. The value of this book lies in the author’s attempt to explain visual thinking through the lenses of psychology, neurology, semantics, art, and perception. This work was later included in Stanford University’s list of recommended readings for engineering and art design students, further highlighting its significance beyond the field of design.In the context of the brain’s left and right hemispheres, the author explains and demonstrates through a range of experiments that, to achieve productive thinking — the kind that leads to creative actions — we need to achieve an “internal transfer” between the so-called rational and intuitive halves of the brain. In our thinking process, to achieve creativity, we need to build bridges to “integrate the artist and scientist within each one of us.”He offers a series of exercises (“3-1/Food for Thought,” “3-2/Dominant Eye,” “3-3/Internal Transfer”) that demonstrate that both brain hemispheres complement each other in cognition and creativity, and he offers to practice them to achieve the so-called “internal transfer”.One of the simplest exercises offered by McKim is the “3-2/Dominant Eye”. Look at the picture and try to describe what you see:Ambiguous figure (Large preview)If you see a duck first (most people see it first) — your left hemisphere is more active. This is because the left hemisphere was activated before reading. If you see a rabbit — often after it’s mentioned — your right hemisphere is more active. This exercise shows that we can consciously choose to shift between hemispheres, training ourselves to engage either side more effectively.In his work, Professor H. McKim not only demonstrates how to activate the left or right hemisphere but also explains the complementary modes of thought, which consist of two stages. The first stage involves generating an array of ideas, often through a visual thinking process, while the second stage focuses on selecting and refining these ideas (or objects) for further development. Creativity is born during the first stage, but to be executed tangibly, it requires the second stage. Even mathematicians do not only think in terms of mathematical symbols; many, particularly creative ones, use vague images and visuals as part of their thought processes.According to McKim, creativity requires a balanced development of both hemispheres, as creative thinkers are ambidextrous and capable of transferring ideas into actionable steps. Another important aspect of visual thinking is the right environment, which leads to creativity. McKim describes it as “relaxed attention” — a mental state where ideas emerge spontaneously. Relaxed attention is often achieved through side activities like meditation, taking breaks, physical relaxation, and engaging in non-linear thinking, such as doodling or daydreaming.I will further share my perspective on enhancing creativity through side activities and present my top three mental and physical occupations. However, it’s important to understand the complementary nature of our brain and how visual thinking often stems from diverse activities and practices.What Helps CreativityWhile it is clear that creativity is driven by both the left and right hemispheres, an important question remains: how can we boost creativity while keeping the process enjoyable? It may not be obvious, but non-design-related activities can, in fact, be an opportunity to enhance creativity.Physical ActivityThe interconnection between our body, mind, and thinking process might be key to awakening creativity. Motor skills are controlled by both hemispheres, with the right hemisphere controlling the left side of the body and the left hemisphere controlling the right side. But it also works in the opposite direction — movements trigger active brain activity.Sports that combine the need to develop a strategy while also requiring active movement may work best for turning up creativity.Understanding the intricacies of the brain highlights the importance of integrating all parts of the brain. In order to learn, you must first have a sensory experience, then reflect and make connections. Finally, you must take action based on the experience. The knowledge that your first movements, even inside the womb, help build your brain underscores the fact that you actually move to learn. In other words, movement is essential to learning. (Source: Anne Green Gilbert. Brain-Compatible Dance Education, 2019)Here are the top activities that positively impact creativity, and I will explain why they have this effect.TennisThe basis of a good game is a well-thought-out and trained strategy. Tennis requires a quick analysis of the situation, prompt decisions, and maximum involvement. No wonder this sport is called “chess in motion”: in the process, it is developing memory, concentration, and strategic thinking. At the same time, working in a group and communicating during workouts help reduce stress levels and improve mood.Table tennis also develops concentration. The need to memorize combinations, develop motor skills, visual and motor types of memory, and compare the opponent’s movements, speed, angle of flight of the ball, and its rotational force form the basis of a successful game. It is suitable for those who do not have the opportunity to play lawn tennis.I asked several designers if they do any of these things in their free time and how they think it affects their productivity and professional skills. Here is what they’ve shared:“I started playing tennis a couple of years ago. I work out once or twice a week individually with a coach or in a group. This is a sport that requires high concentration during the game. It seems to me that this skill helped me in my work as well; before that, I was often distracted, and it was difficult for me to do the same task for a long time.At the same time, due to the fact that I have to fully concentrate during the game, I manage to switch from everyday problems and unload my brain. I prefer to play in the morning or afternoon and take a break from work. Therefore, I return to work more energetically and can take a fresh look at my tasks.”— Ilia Kanazin, Product Designer with 7+ years of experience working in SaaSIlia’s project screenshot (Large preview)DanceDance challenges the brain by requiring the integration of movement, rhythm, coordination, and memory, which promotes neuroplasticity, or the brain’s ability to form new neural connections. The more varied the movement patterns and rhythmic complexities, the more the brain is stimulated to adapt and reorganize. Neuroplasticity has a positive effect on memory capacity, learning abilities, and problem-solving skills, which are good for the design process.At the same time, cognitive flexibility supports the developed design because you always need to adjust your decisions, getting new data from user testing and feedback from the stakeholders. Dancers often have to improvise or adapt to changes in the rhythm and conditions. Also, they constantly learn new movements and combinations of them. Such experience in choreography and expression develops connections between hemispheres, which influences a person’s ability to think creatively in general.Balance ExercisesIn my opinion, the balance board is one of the most convenient and affordable home simulators. With its help, you can do a short workout at any time to take a break from long work and return to work with a fresh look.Board balance exercises can be quite diverse. It can be added to your usual exercises and diversified with squats, exercises with a slight weight on the upper body, or shoulder and neck warm-up, which will increase cognitive activity as a result.You can also just stand on the balance board while listening to work calls, which don’t require active participation, watching TV shows, or chatting on the phone with friends.Case Study“By training your body to move more creatively, you train your mind to think more creatively.”— Jennifer Heisz. Move The Body, Heal The Mind, 2022While it may be challenging to find documented real-life cases that provide clear examples of famous designs fueled by sport and physical activity, there are historically backed examples and research studies demonstrating that physical activity positively influences creativity.For example, Charles Darwin’s “Thinking Path”. The scientist developed his most famous works, “On the Origin of Species” and “The Descent of Man,” at Down House, where he took daily walks. This activity is known as Darwin’s Thinking Path, and it is well-documented how his walking routine influenced the way he contemplated his scientific theories.With the emergence of neuroscience as a science in the mid-20th century, we have gained a new perspective on what drives creative thinking, which is ultimately beneficial for design. Neuroscience provides insights into how various activities influence the brain, which, as a result, leads to changes in other fields.For example, tennis is recognized for its benefits to brain health. It enhances the ability to process sensory information rapidly, improving overall cognitive processing speed and reaction time. In addition, strategic thinking is required in this game and engages the prefrontal cortex — the brain’s hub for decision-making and strategic planning. And we can see how this single activity demonstrates the far-reaching cognitive benefits of physical exercise.Nowadays, researchers in neuroscience are united in their opinion on what unleashes creativity — physical activity unlocks it. There are even experiments that measure it: Marily Oppezzo, a behavioral and learning scientist at Stanford, studied how walking affects creativity. Her experiment compared walking on a treadmill, walking outdoors, sitting indoors and outdoors, and being pushed in a wheelchair. Surprisingly, even treadmill walking in a dull room boosted creativity by 60% compared to sitting.“It’s not specific activities but individuals’ experiences of them that determine their effect.”— Amir-Homayoun Javadi, Associate Professor at the University of KentAnother study goes further, explaining that not all sports impact creativity to the same extent.“It may surprise you — it wasn’t artistic sports but net and combat sports. Why? Because cultivating a creative mind depends on how we train. In artistic sports (figure skating, gymnastics, synchronized swimming), athletes memorize a series of predefined steps. Although creating these routines may involve creativity, the training itself is structured, predictable, and planned.”Training that is mostly predictable makes our brain less mentally flexible, in contrast to net and combat sports (such as badminton, tennis, volleyball, and fencing), which make us learn to act instinctively. As we train physically, our brain also adapts, becoming more flexible — particularly in terms of cognitive flexibility. This, in turn, enhances our creativity. (Source: Jennifer Heisz. Move The Body, Heal The Mind, 2022)Mental ActivityHowever, physical activity is not the only way to achieve a ‘relaxed attention’ state and learn to balance the left and right hemispheres of the brain. Mental activities also trigger the same process. I have selected the top 3 activities that will enhance your creativity at work.Learning Foreign LanguagesAs we discussed above, during the design process, both brain hemispheres are used, and when you’re learning foreign languages, it leads to similar processes in your brain, so you train it through similar activities.Language processing primarily occurs in the left hemisphere, but emotional intonation and context (e.g., sarcasm, tone) are understood by the right hemisphere. When someone says “Oh, great!” after receiving bad news, the left hemisphere processes the words and grammar, understanding the literal meaning, while the right hemisphere interprets the tone and context, allowing the person to get the real point of the message.Learning a second language exposes people to new methods of expressing the same thoughts, which promotes creativity. Finding synonyms, understanding idiomatic terms, and gaining the ability to flip between languages all promote divergent thinking, which is the ability to generate several solutions to a given problem.In parallel, learning foreign languages helps to develop storytelling and self-presentation skills, which are also very useful in a designer’s work.“I’ve lived in several countries for a long time, so in addition to my native language, I speak three other foreign languages as well. It helps me to build communication with different people, which is very important in the designer’s work.I think because I know how to say the same thing in different languages, I also use this approach in design. To solve the same problem, I can offer several solutions and choose the most appropriate one together with the stakeholders.Now I am a Senior Growth Designer, and this job requires constantly looking for non-standard solutions and implementing them quickly. I think the use of different languages contributes to this from the point of view of brain function.Speaking multiple languages also comes really handy when you are dealing with personas from different nationalities. For example, Western Saas products use a more minimalist approach, whereas Saas from Asia or China, for example, more information is better than less.”— Maxence Akodjenou, Senior Growth Designer (working on complex B2B apps)Maxence’s project screenshot (Large preview)Board GamesTable games develop strategic thinking, require players to anticipate opponents’ moves, solve problems in real-time, and sometimes think outside the box. Traditional games like chess encourage critical thinking, as players must analyze the current situation, weigh potential outcomes, and decide on the best course of action. This improves the brain’s executive functions, including decision-making, planning, and strategic thinking.Some tabletop games are based on role-playing or storytelling, such as Dungeons \u0026 Dragons or Dixit. These games encourage players to invent stories, create characters, and navigate imaginative scenarios, fostering creative thinking and imagination.Board games also train communication skills, which product designers have to use a lot in their jobs. Playing table games, especially in groups, encourages the participants to convince their teammates of their decisions and carefully listen to others. The games that involve cooperation help the players develop their collaboration skills, such as finding compromises, negotiating, and making concessions.Music LessonsPlaying a musical instrument has been a widely researched topic in neuroscience in recent decades. It has been proven that music lessons improve cognitive abilities by improving the neural connection between the left and right hemispheres of the brain, which leads to a positive effect on memory, learning ability, and non-verbal thinking, as a result of which the brain as a whole works much more productively in other areas of life.The brain learns to hear and interpret sounds, which happens only while playing an instrument and is impossible while simply listening to music. As a result, a person is better able to process complex information. Playing musical instruments involves the relationship between the motor, sensory, auditory, visual, and emotional components of the central and peripheral nervous systems. Such brain training includes artistic and aesthetic aspects of learning, which is a unique feature of playing a musical instrument. The combination of linguistic and mathematical activity in the left hemisphere gets used to working in coordination with creative functions in the right hemisphere.An interesting fact: Albert Einstein often played the violin during moments of deep thinking, claiming that music was an extension of his thought process and helped him solve particularly difficult problems.A Lesson From Paul KleeIt is worth noting that it works both ways — both your music lessons enhance your creativity in design, and design pushes your success in music.In the book Enchanted Neurons, Pierre Boulez, French composer and conductor, talks about the lessons that Paul Klee (Swiss-born German artist. His highly individual style was influenced by movements in art that included expressionism, cubism, and surrealism) taught at the Bauhaus (German art school which became famous for its approach to design based on unifying individual artistic vision with the principles of mass production and emphasis on function).“Theoretical reflection is particularly interesting to me when it is applied to something that is completely foreign to music because it then makes it possible to discover solutions that you would never have found if you had remained bound by the limits of your art.I’ll give you a personal example: the discovery not only of Klee’s painting but also the lessons that he gave at the Bauhaus, which we spoke about earlier, was extremely important to me, especially from the point of view of composition. I understood how using very simple elements like two motifs made it possible to think about the way in which these two motifs could interact. I remember, in particular, an exercise given by Klee to his students: a straight line and a circle. That’s it. The exercise consisted of trying to invent something, a meeting of this line and this circle.”— Pierre Boulez, Jean-Pierre Changeux, Philippe Manoury. Enchanted Neurons, 2020This lesson shared by Pierre Boulez demonstrates how interdisciplinary inspiration — such as the course of visual artist Paul Klee — shaped his creative process and how concepts from outside music can lead to new solutions.In my opinion, the reverse can also be true: music and its principles can inspire creativity in other disciplines.“I started composing music even earlier than I started designing. Music has a composition and rhythm-like design. And development in one area also entails a boost in another. It works both ways; success in music develops my design skills. Design helps me make more complex music.In addition, there is also a practical benefit; I make my own covers for my tracks and use my tracks for my showcases. Plus, I listen to a lot of different music, and it develops my world perception, fills me with energy, and creates the right mood for working on projects.”— Sergei Diuzhev, Design Leader at MuseScoreSergei’s project screenshot (Large preview)Tips For Incorporating A Routine That Sustains Designer’s CreativityWhenever you feel stuck in your work or overly critical of your designs or prototype, think about the strategies from the above that might help your creative process.Find something you genuinely enjoy or have always wanted to try and implement in small steps.It doesn’t need to be a completely new hobby. For example, you could dance to your favorite music at home, stand on a balance board between work calls, or try something new once a month or quarter with friends, like skating, rock climbing, or other activities. This year, I plan to go skiing for the first time.Constantly explore new things, even small ones.Take different routes to work, cook new dishes, or listen to unfamiliar music. Even if you don’t end up loving it, it’s still valuable because your brain is enriched by the experience.Meet new people.As I mentioned earlier, communication skills are essential for designers, but beyond that, new people can inspire you in unexpected ways. They might introduce you to a new sport, hobby, or activity that you could even try together.I shared examples of designers who have rebuilt their creativity through activities like tennis, music, and languages, and I feel the impact in my own daily routine when I try new things and hobbies. Whatever approach you decide to follow, I guarantee your brain will feel the difference and reward you with fresh ideas and inspiration.ConclusionCreativity may be developed in a variety of ways, including browsing reference sites and putting in a lot of practice — both of which are important. Outside these classic ways, you can engage in activities that not only promote creativity but also improve your mental and physical health.There are many possibilities for increasing brain activity, and you can develop your own entertaining and useful ways of spending time. Finally, trying something new will generate new thoughts and break down the monotony.When you experience virtual reality, read poetry or fiction, see a film, listen to a piece of music, or move your body to dance, to name a few of the many arts, you are biologically changed. There is a neurochemical exchange that can lead to what Aristotle called catharsis, or a release of emotion that leaves you feeling more connected to yourself and others afterward. (Source: Susan Magsamen, Ivy Ross. Your Brain on Art, 2023)Further Reading on Smashing Magazine“Why Perceived Performance Matters: The Perception Of Time,” Denys Mishunov“Why Performance Matters: Perception Management,” Denys Mishunov“Biometrics And Neuro-Measurements For User Testing,” Susan Weinschenk“A Designer’s Guide To Better Decisions,” Eric Olive (cc, il, mrn, yk)",
  "image": "https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/neuroscience-designers-boost-creativity-endless-reference-scrolling.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article__content\"\u003e\u003cul\u003e\u003cli\u003e19 min read\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://smashingmagazine.com/category/creativity\"\u003eCreativity\u003c/a\u003e,\n\u003ca href=\"https://smashingmagazine.com/category/workflow\"\u003eWorkflow\u003c/a\u003e,\n\u003ca href=\"https://smashingmagazine.com/category/design\"\u003eDesign\u003c/a\u003e,\n\u003ca href=\"https://smashingmagazine.com/category/ux\"\u003eUX\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003csection aria-label=\"Quick summary\"\u003eProduct design requires a balance between logic and creativity. This balance results in products that not only meet technical and user requirements but also deliver a captivating user experience. While it is clear that creativity is driven by both the left and right hemispheres, an important question remains: how can we boost creativity while keeping the process enjoyable? It may not be obvious, but non-design-related activities can, in fact, be an opportunity to enhance creativity.\u003c/section\u003e\u003c/p\u003e\u003cp\u003eThe work of a designer largely consists of inventing new things, which requires creativity that is generally believed to depend on \u003cstrong\u003einspiration\u003c/strong\u003e, making it unpredictable and difficult to control. Many designers, as well as those who would like to try their hand at design, are wondering: what to do if inspiration does not come at the right moment?\u003c/p\u003e\u003cp\u003eThere are many practical recommendations from experienced designers and design managers on how to work without inspiration. These mainly rely on discipline, planning, and working with references. I would like to suggest an alternative approach: \u003cstrong\u003ehow to boost creativity and “lure” inspiration with the help of neuroscience\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eI’m Marina, and I have been deeply interested in neuroscience for a long time. I have tried many methods from my own experience and observed the experience of my colleagues. In this article, I want to share the ways that seemed to me the most effective in luring creativity, which I eventually built into my life routine on an ongoing basis.\u003c/p\u003e\u003ch2 id=\"how-our-brain-works\"\u003eHow Our Brain Works\u003c/h2\u003e\u003cp\u003eThe brain has been and remains an important topic that is underexplored, especially in the context of design and design thinking. No other profession represents the blend of creativity and logic quite like design, in my opinion. This raises a fair question: which part of the brain is more important, the left or the right? To start with, let’s briefly refresh which part of the brain is responsible for what:\u003c/p\u003e\u003ctable\u003e\u003cthead\u003e\u003ctr\u003e\u003cth\u003eLeft Hemisphere\u003c/th\u003e\u003cth\u003eRight Hemisphere\u003c/th\u003e\u003c/tr\u003e\u003c/thead\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\u003cstrong\u003eLanguage and Speech\u003c/strong\u003e: Language-related activities like speaking, writing, and comprehension\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eCreativity and Artistic Abilities\u003c/strong\u003e: Imagination, creative thinking, music, visual arts, etc.\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e\u003cstrong\u003eAnalytical Thinking\u003c/strong\u003e: Mathematical operations, sequential processing, and problem-solving\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eEmotional Processing\u003c/strong\u003e: Emotion recognition, facial expressions, tone of voice, gestures\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e\u003cstrong\u003eLinear Thinking\u003c/strong\u003e: Step-by-step way of information processing\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eHolistic Thinking\u003c/strong\u003e: Looking at the big picture rather than focusing on details\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003cp\u003eWhile each part of the brain is responsible for certain functions, they work together to process information. For some activities (\u003cem\u003eanalyzing data, solving equations, and working with precise calculations\u003c/em\u003e), it might be more important to rely on the left hemisphere, while for others (\u003cem\u003ecomposing music, acting\u003c/em\u003e), the right hemisphere.\u003c/p\u003e\u003cp\u003eHowever, when it comes to the design process and design thinking, \u003cstrong\u003eit’s essential to stimulate both hemispheres\u003c/strong\u003e and not limit the role of a product designer to being either predominantly left- or right-brained.\u003c/p\u003e\u003ch2 id=\"interhemispheric-interaction-in-product-design-why-are-both-equally-important\"\u003eInterhemispheric Interaction In Product Design: Why Are Both Equally Important?\u003c/h2\u003e\u003cp\u003eIn product design, the need for well-established \u003cstrong\u003einterhemispheric interaction\u003c/strong\u003e is especially noticeable since this work requires \u003cstrong\u003ea balance between logic and creativity\u003c/strong\u003e. The left hemisphere’s logical functions help designers break down complex problems, analyze user needs, and organize structured workflows, ensuring the product’s functionality and usability.\u003c/p\u003e\u003cp\u003eFor example, logical processes are crucial in creating wireframes and user flows and adhering to technical constraints. On the other side, the right hemisphere’s creative and spatial abilities play a critical role in developing visually appealing designs and innovative user experiences. It’s extremely important for a designer to think outside the box and solve user problems without forgetting about the balanced and attractive visual part at the same time.\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca aria-label=\"Share on Twitter\" href=\"https://twitter.com/share?text=%0aA%20harmonious%20interaction%20between%20the%20two%20hemispheres%20allows%20product%20designers%20to%20seamlessly%20integrate%20both%20practical%20functionality%20and%20creative%20innovation.%20This%20balance%20results%20in%20products%20that%20not%20only%20meet%20technical%20and%20user%20requirements%20but%20also%20deliver%20an%20enjoyable,%20intuitive,%20and%20visually%20captivating%20user%20experience.%0a\u0026amp;url=https://smashingmagazine.com%2f2025%2f04%2fneuroscience-designers-boost-creativity-endless-reference-scrolling%2f\"\u003eA harmonious interaction between the two hemispheres allows product designers to seamlessly integrate both practical functionality and creative innovation. This balance results in products that not only meet technical and user requirements but also deliver an enjoyable, intuitive, and visually captivating user experience.\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003ch2 id=\"the-relevance-of-this-subject\"\u003eThe Relevance Of This Subject\u003c/h2\u003e\u003cp\u003eThe idea that two parts of the brain are interconnected and complement each other during creative tasks isn’t new, nor is it my invention. One of the most influential works for product designers is \u003cem\u003eExperiences in Visual Thinking\u003c/em\u003e by Robert H. McKim, an Emeritus Professor of Mechanical Engineering. The value of this book lies in the author’s attempt to explain visual thinking through the lenses of psychology, neurology, semantics, art, and perception. This work was later included in Stanford University’s list of recommended readings for engineering and art design students, further highlighting its significance beyond the field of design.\u003c/p\u003e\u003cp\u003eIn the context of the brain’s left and right hemispheres, the author explains and demonstrates through a range of experiments that, to achieve \u003cstrong\u003eproductive thinking\u003c/strong\u003e — the kind that leads to creative actions — we need to achieve an “internal transfer” between the so-called rational and intuitive halves of the brain. In our thinking process, to achieve creativity, we need to build bridges to \u003cem\u003e“integrate the artist and scientist within each one of us.”\u003c/em\u003e\u003c/p\u003e\u003cp\u003eHe offers a series of exercises (\u003cem\u003e“3-1/Food for Thought,” “3-2/Dominant Eye,” “3-3/Internal Transfer”\u003c/em\u003e) that demonstrate that both brain hemispheres complement each other in cognition and creativity, and he offers to practice them to achieve the so-called “internal transfer”.\u003c/p\u003e\u003cp\u003eOne of the simplest exercises offered by McKim is the \u003cem\u003e“3-2/Dominant Eye”\u003c/em\u003e. Look at the picture and try to describe what you see:\u003c/p\u003e\u003cfigure\u003e\u003ca href=\"https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/1-neuroscience-designers-boost-creativity-endless-reference-scrolling.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" fetchpriority=\"low\" width=\"800\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/1-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 400w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_800/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/1-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 800w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1200/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/1-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 1200w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1600/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/1-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 1600w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_2000/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/1-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/1-neuroscience-designers-boost-creativity-endless-reference-scrolling.png\" sizes=\"100vw\" alt=\"A picture of a duck\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eAmbiguous figure (\u003ca href=\"https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/1-neuroscience-designers-boost-creativity-endless-reference-scrolling.png\"\u003eLarge preview\u003c/a\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eIf you see a duck first (most people see it first) — your left hemisphere is more active. This is because the left hemisphere was activated before reading. If you see a rabbit — often after it’s mentioned — your right hemisphere is more active. This exercise shows that we can consciously choose to shift between hemispheres, training ourselves to engage either side more effectively.\u003c/p\u003e\u003cp\u003eIn his work, Professor H. McKim not only demonstrates how to activate the left or right hemisphere but also explains the \u003cstrong\u003ecomplementary modes of thought\u003c/strong\u003e, which consist of two stages. The first stage involves generating an array of ideas, often through a visual thinking process, while the second stage focuses on selecting and refining these ideas (or objects) for further development. Creativity is born during the first stage, but to be executed tangibly, it requires the second stage. Even mathematicians do not only think in terms of mathematical symbols; many, particularly creative ones, use vague images and visuals as part of their thought processes.\u003c/p\u003e\u003cp\u003eAccording to McKim, creativity requires a balanced development of both hemispheres, as creative thinkers are ambidextrous and capable of transferring ideas into actionable steps. Another important aspect of visual thinking is the right environment, which leads to creativity. McKim describes it as \u003cstrong\u003e“relaxed attention”\u003c/strong\u003e — a mental state where ideas emerge spontaneously. Relaxed attention is often achieved through side activities like meditation, taking breaks, physical relaxation, and engaging in non-linear thinking, such as doodling or daydreaming.\u003c/p\u003e\u003cp\u003eI will further share my perspective on enhancing creativity through side activities and present my top three mental and physical occupations. However, it’s important to understand the complementary nature of our brain and how visual thinking often stems from diverse activities and practices.\u003c/p\u003e\u003ch2 id=\"what-helps-creativity\"\u003eWhat Helps Creativity\u003c/h2\u003e\u003cp\u003eWhile it is clear that creativity is driven by both the left and right hemispheres, an important question remains: how can we boost creativity while keeping the process enjoyable? It may not be obvious, but non-design-related activities can, in fact, be an opportunity to enhance creativity.\u003c/p\u003e\u003ch2 id=\"physical-activity\"\u003ePhysical Activity\u003c/h2\u003e\u003cp\u003eThe interconnection between our body, mind, and thinking process might be key to awakening creativity. Motor skills are controlled by both hemispheres, with the right hemisphere controlling the left side of the body and the left hemisphere controlling the right side. But it also works in the opposite direction — movements trigger active brain activity.\u003c/p\u003e\u003cblockquote\u003eSports that combine the need to develop a strategy while also requiring active movement may work best for turning up creativity.\u003c/blockquote\u003e\u003cp\u003eUnderstanding the intricacies of the brain highlights the importance of integrating all parts of the brain. In order to learn, you must first have a sensory experience, then reflect and make connections. Finally, you must take action based on the experience. The knowledge that your first movements, even inside the womb, help build your brain underscores the fact that you actually move to learn. In other words, \u003cstrong\u003emovement is essential to learning\u003c/strong\u003e. (\u003cem\u003eSource: Anne Green Gilbert. Brain-Compatible Dance Education, 2019\u003c/em\u003e)\u003c/p\u003e\u003cp\u003eHere are the top activities that positively impact creativity, and I will explain why they have this effect.\u003c/p\u003e\u003ch3 id=\"tennis\"\u003eTennis\u003c/h3\u003e\u003cp\u003eThe basis of a good game is a well-thought-out and trained strategy. Tennis requires a quick analysis of the situation, prompt decisions, and maximum involvement. No wonder this sport is called “chess in motion”: in the process, it is developing memory, concentration, and strategic thinking. At the same time, working in a group and communicating during workouts help reduce stress levels and improve mood.\u003c/p\u003e\u003cp\u003eTable tennis also develops \u003cstrong\u003econcentration\u003c/strong\u003e. The need to memorize combinations, develop motor skills, visual and motor types of memory, and compare the opponent’s movements, speed, angle of flight of the ball, and its rotational force form the basis of a successful game. It is suitable for those who do not have the opportunity to play lawn tennis.\u003c/p\u003e\u003cp\u003eI asked several designers if they do any of these things in their free time and how they think it affects their productivity and professional skills. Here is what they’ve shared:\u003c/p\u003e\u003cblockquote\u003e“I started playing tennis a couple of years ago. I work out once or twice a week individually with a coach or in a group. This is a sport that requires high concentration during the game. It seems to me that this skill helped me in my work as well; before that, I was often distracted, and it was difficult for me to do the same task for a long time.\u003cp\u003eAt the same time, due to the fact that I have to fully concentrate during the game, I manage to switch from everyday problems and unload my brain. I prefer to play in the morning or afternoon and take a break from work. Therefore, I return to work more energetically and can take a fresh look at my tasks.”\u003c/p\u003e\u003cp\u003e— Ilia Kanazin, Product Designer with 7+ years of experience working in SaaS\u003c/p\u003e\u003c/blockquote\u003e\u003cfigure\u003e\u003ca href=\"https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/2-neuroscience-designers-boost-creativity-endless-reference-scrolling.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" fetchpriority=\"low\" width=\"800\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/2-neuroscience-designers-boost-creativity-endless-reference-scrolling.jpg 400w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_800/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/2-neuroscience-designers-boost-creativity-endless-reference-scrolling.jpg 800w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1200/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/2-neuroscience-designers-boost-creativity-endless-reference-scrolling.jpg 1200w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1600/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/2-neuroscience-designers-boost-creativity-endless-reference-scrolling.jpg 1600w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_2000/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/2-neuroscience-designers-boost-creativity-endless-reference-scrolling.jpg 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/2-neuroscience-designers-boost-creativity-endless-reference-scrolling.jpg\" sizes=\"100vw\" alt=\"Ilia’s project screenshot\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eIlia’s project screenshot (\u003ca href=\"https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/2-neuroscience-designers-boost-creativity-endless-reference-scrolling.jpg\"\u003eLarge preview\u003c/a\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\u003ch3 id=\"dance\"\u003eDance\u003c/h3\u003e\u003cp\u003eDance challenges the brain by requiring the integration of movement, rhythm, coordination, and memory, which promotes \u003cstrong\u003eneuroplasticity\u003c/strong\u003e, or the brain’s ability to form new neural connections. The more varied the movement patterns and rhythmic complexities, the more the brain is stimulated to adapt and reorganize. Neuroplasticity has a positive effect on memory capacity, learning abilities, and problem-solving skills, which are good for the design process.\u003c/p\u003e\u003cp\u003eAt the same time, \u003cstrong\u003ecognitive flexibility\u003c/strong\u003e supports the developed design because you always need to adjust your decisions, getting new data from user testing and feedback from the stakeholders. Dancers often have to improvise or adapt to changes in the rhythm and conditions. Also, they constantly learn new movements and combinations of them. Such experience in choreography and expression develops connections between hemispheres, which influences a person’s ability to think creatively in general.\u003c/p\u003e\u003ch3 id=\"balance-exercises\"\u003eBalance Exercises\u003c/h3\u003e\u003cp\u003eIn my opinion, the balance board is one of the most convenient and affordable home simulators. With its help, you can do a short workout at any time to take a break from long work and return to work with a fresh look.\u003c/p\u003e\u003cp\u003eBoard balance exercises can be quite diverse. It can be added to your usual exercises and diversified with squats, exercises with a slight weight on the upper body, or shoulder and neck warm-up, which will increase cognitive activity as a result.\u003c/p\u003e\u003cp\u003eYou can also just stand on the balance board while listening to work calls, which don’t require active participation, watching TV shows, or chatting on the phone with friends.\u003c/p\u003e\u003ch3 id=\"case-study\"\u003eCase Study\u003c/h3\u003e\u003cblockquote\u003e“By training your body to move more creatively, you train your mind to think more creatively.”\u003cp\u003e— Jennifer Heisz. Move The Body, Heal The Mind, 2022\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eWhile it may be challenging to find documented real-life cases that provide clear examples of famous designs fueled by sport and physical activity, there are historically backed examples and research studies demonstrating that physical activity positively influences creativity.\u003c/p\u003e\u003cp\u003eFor example, Charles Darwin’s \u003cem\u003e“Thinking Path”\u003c/em\u003e. The scientist developed his most famous works, \u003cem\u003e“On the Origin of Species”\u003c/em\u003e and \u003cem\u003e“The Descent of Man,”\u003c/em\u003e at Down House, where he took daily walks. This activity is known as \u003ca href=\"https://www.philipmandel.com/darwin-s-thinking-path\"\u003eDarwin’s Thinking Path\u003c/a\u003e, and it is well-documented how his walking routine influenced the way he contemplated his scientific theories.\u003c/p\u003e\u003cp\u003eWith the emergence of neuroscience as a science in the mid-20th century, we have gained a new perspective on what drives creative thinking, which is ultimately beneficial for design. Neuroscience provides insights into how various activities influence the brain, which, as a result, leads to changes in other fields.\u003c/p\u003e\u003cp\u003eFor example, tennis is recognized for its benefits to brain health. It enhances the ability to process sensory information rapidly, improving overall cognitive processing speed and reaction time. In addition, \u003cstrong\u003estrategic thinking\u003c/strong\u003e is required in this game and engages the prefrontal cortex — the brain’s hub for decision-making and strategic planning. And we can see how this single activity demonstrates the far-reaching \u003ca href=\"https://www.nuvancehealth.org/health-tips-and-news/the-neuroscience-of-tennis-for-brain-health#:~:text=Learning%20and%20mastering%20tennis%20techniques,neural%20networks%20during%20formative%20years\"\u003ecognitive benefits of physical exercise\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eNowadays, researchers in neuroscience are united in their opinion on what unleashes creativity — physical activity unlocks it. There are even experiments that measure it: Marily Oppezzo, a behavioral and learning scientist at Stanford, studied how walking affects creativity. Her experiment compared walking on a treadmill, walking outdoors, sitting indoors and outdoors, and being pushed in a wheelchair. Surprisingly, even treadmill walking in a dull room boosted creativity by 60% compared to sitting.\u003c/p\u003e\u003cblockquote\u003e“It’s not specific activities but individuals’ experiences of them that determine their effect.”\u003cp\u003e— \u003ca href=\"https://www.theguardian.com/lifeandstyle/2024/mar/04/all-it-takes-is-a-quick-walk-how-a-few-minutes-exercise-can-unleash-creativity-even-if-you-hate-it\"\u003eAmir-Homayoun Javadi, Associate Professor at the University of Kent\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eAnother study goes further, explaining that not all sports impact creativity to the same extent.\u003c/p\u003e\u003cblockquote\u003e“It may surprise you — it wasn’t artistic sports but net and combat sports. Why? Because cultivating a creative mind depends on how we train. In artistic sports (figure skating, gymnastics, synchronized swimming), athletes memorize a series of predefined steps. Although creating these routines may involve creativity, the training itself is structured, predictable, and planned.”\u003c/blockquote\u003e\u003cp\u003eTraining that is mostly predictable makes our brain less mentally flexible, in contrast to net and combat sports (such as badminton, tennis, volleyball, and fencing), which make us \u003cstrong\u003elearn to act instinctively\u003c/strong\u003e. As we train physically, our brain also adapts, becoming more flexible — particularly in terms of cognitive flexibility. This, in turn, enhances our creativity. (\u003cem\u003eSource: Jennifer Heisz. Move The Body, Heal The Mind, 2022\u003c/em\u003e)\u003c/p\u003e\u003ch2 id=\"mental-activity\"\u003eMental Activity\u003c/h2\u003e\u003cp\u003eHowever, physical activity is not the only way to achieve a ‘relaxed attention’ state and learn to balance the left and right hemispheres of the brain. Mental activities also trigger the same process. I have selected the top 3 activities that will enhance your creativity at work.\u003c/p\u003e\u003ch3 id=\"learning-foreign-languages\"\u003eLearning Foreign Languages\u003c/h3\u003e\u003cp\u003eAs we discussed above, during the design process, both brain hemispheres are used, and when you’re learning foreign languages, it leads to similar processes in your brain, so you train it through similar activities.\u003c/p\u003e\u003cp\u003eLanguage processing primarily occurs in the left hemisphere, but emotional intonation and context (e.g., sarcasm, tone) are understood by the right hemisphere. When someone says \u003cem\u003e“Oh, great!”\u003c/em\u003e after receiving bad news, the left hemisphere processes the words and grammar, understanding the literal meaning, while the right hemisphere interprets the tone and context, allowing the person to get the real point of the message.\u003c/p\u003e\u003cp\u003eLearning a second language exposes people to \u003cstrong\u003enew methods of expressing the same thoughts\u003c/strong\u003e, which promotes creativity. Finding synonyms, understanding idiomatic terms, and gaining the ability to flip between languages all promote \u003cstrong\u003edivergent thinking\u003c/strong\u003e, which is the ability to generate several solutions to a given problem.\u003c/p\u003e\u003cp\u003eIn parallel, learning foreign languages helps to develop \u003cstrong\u003estorytelling\u003c/strong\u003e and \u003cstrong\u003eself-presentation skills\u003c/strong\u003e, which are also very useful in a designer’s work.\u003c/p\u003e\u003cblockquote\u003e“I’ve lived in several countries for a long time, so in addition to my native language, I speak three other foreign languages as well. It helps me to build communication with different people, which is very important in the designer’s work.\u003cp\u003eI think because I know how to say the same thing in different languages, I also use this approach in design. To solve the same problem, I can offer several solutions and choose the most appropriate one together with the stakeholders.\u003c/p\u003e\u003cp\u003eNow I am a Senior Growth Designer, and this job requires constantly looking for non-standard solutions and implementing them quickly. I think the use of different languages contributes to this from the point of view of brain function.\u003c/p\u003e\u003cp\u003eSpeaking multiple languages also comes really handy when you are dealing with personas from different nationalities. For example, Western Saas products use a more minimalist approach, whereas Saas from Asia or China, for example, more information is better than less.”\u003c/p\u003e\u003cp\u003e— Maxence Akodjenou, Senior Growth Designer (working on complex B2B apps)\u003c/p\u003e\u003c/blockquote\u003e\u003cfigure\u003e\u003ca href=\"https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/3-neuroscience-designers-boost-creativity-endless-reference-scrolling.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" fetchpriority=\"low\" width=\"800\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/3-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 400w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_800/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/3-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 800w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1200/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/3-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 1200w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1600/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/3-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 1600w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_2000/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/3-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/3-neuroscience-designers-boost-creativity-endless-reference-scrolling.png\" sizes=\"100vw\" alt=\"Maxence’s project screenshot\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eMaxence’s project screenshot (\u003ca href=\"https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/3-neuroscience-designers-boost-creativity-endless-reference-scrolling.png\"\u003eLarge preview\u003c/a\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\u003ch3 id=\"board-games\"\u003eBoard Games\u003c/h3\u003e\u003cp\u003eTable games develop \u003cstrong\u003estrategic thinking\u003c/strong\u003e, require players to anticipate opponents’ moves, solve problems in real-time, and sometimes think outside the box. Traditional games like chess encourage \u003cstrong\u003ecritical thinking\u003c/strong\u003e, as players must analyze the current situation, weigh potential outcomes, and decide on the best course of action. This improves the \u003cstrong\u003ebrain’s executive functions\u003c/strong\u003e, including decision-making, planning, and strategic thinking.\u003c/p\u003e\u003cp\u003eSome tabletop games are based on role-playing or storytelling, such as Dungeons \u0026amp; Dragons or Dixit. These games encourage players to invent stories, create characters, and navigate imaginative scenarios, fostering creative thinking and imagination.\u003c/p\u003e\u003cp\u003eBoard games also train \u003cstrong\u003ecommunication skills\u003c/strong\u003e, which product designers have to use a lot in their jobs. Playing table games, especially in groups, encourages the participants to convince their teammates of their decisions and carefully listen to others. The games that involve cooperation help the players develop their \u003cstrong\u003ecollaboration skills\u003c/strong\u003e, such as finding compromises, negotiating, and making concessions.\u003c/p\u003e\u003ch3 id=\"music-lessons\"\u003eMusic Lessons\u003c/h3\u003e\u003cp\u003ePlaying a musical instrument has been a widely researched topic in neuroscience in recent decades. It has been proven that music lessons \u003cstrong\u003eimprove cognitive abilities\u003c/strong\u003e by improving the neural connection between the left and right hemispheres of the brain, which leads to a positive effect on memory, learning ability, and non-verbal thinking, as a result of which the brain as a whole works much more productively in other areas of life.\u003c/p\u003e\u003cp\u003eThe brain learns to hear and interpret sounds, which happens only while playing an instrument and is impossible while simply listening to music. As a result, \u003cstrong\u003ea person is better able to process complex information\u003c/strong\u003e. Playing musical instruments involves the relationship between the motor, sensory, auditory, visual, and emotional components of the central and peripheral nervous systems. Such brain training includes artistic and aesthetic aspects of learning, which is a unique feature of playing a musical instrument. The combination of linguistic and mathematical activity in the left hemisphere gets used to working in coordination with creative functions in the right hemisphere.\u003c/p\u003e\u003cp\u003eAn interesting fact: Albert Einstein often played the violin during moments of deep thinking, claiming that music was an extension of his thought process and helped him solve particularly difficult problems.\u003c/p\u003e\u003ch3 id=\"a-lesson-from-paul-klee\"\u003eA Lesson From Paul Klee\u003c/h3\u003e\u003cp\u003eIt is worth noting that it works both ways — both your music lessons enhance your creativity in design, and design pushes your success in music.\u003c/p\u003e\u003cp\u003eIn the book \u003cem\u003eEnchanted Neurons\u003c/em\u003e, Pierre Boulez, French composer and conductor, talks about the lessons that Paul Klee (Swiss-born German artist. His highly individual style was influenced by movements in art that included expressionism, cubism, and surrealism) taught at the Bauhaus (German art school which became famous for its approach to design based on unifying individual artistic vision with the principles of mass production and emphasis on function).\u003c/p\u003e\u003cblockquote\u003e“Theoretical reflection is particularly interesting to me when it is applied to something that is completely foreign to music because it then makes it possible to discover solutions that you would never have found if you had remained bound by the limits of your art.\u003cp\u003eI’ll give you a personal example: the discovery not only of Klee’s painting but also the lessons that he gave at the Bauhaus, which we spoke about earlier, was extremely important to me, especially from the point of view of composition. I understood how using very simple elements like two motifs made it possible to think about the way in which these two motifs could interact. I remember, in particular, an exercise given by Klee to his students: a straight line and a circle. That’s it. The exercise consisted of trying to invent something, a meeting of this line and this circle.”\u003c/p\u003e\u003cp\u003e— Pierre Boulez, Jean-Pierre Changeux, Philippe Manoury. Enchanted Neurons, 2020\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eThis lesson shared by Pierre Boulez demonstrates how \u003cstrong\u003einterdisciplinary inspiration\u003c/strong\u003e — such as the course of visual artist Paul Klee — shaped his creative process and how concepts from outside music can lead to new solutions.\u003c/p\u003e\u003cp\u003eIn my opinion, the reverse can also be true: music and its principles can inspire creativity in other disciplines.\u003c/p\u003e\u003cblockquote\u003e“I started composing music even earlier than I started designing. Music has a composition and rhythm-like design. And development in one area also entails a boost in another. It works both ways; \u003cstrong\u003esuccess in music develops my design skills\u003c/strong\u003e. Design helps me make more complex music.\u003cp\u003eIn addition, there is also a practical benefit; I make my own covers for my tracks and use my tracks for my showcases. Plus, I listen to a lot of different music, and it develops my world perception, fills me with energy, and creates the right mood for working on projects.”\u003c/p\u003e\u003cp\u003e— Sergei Diuzhev, Design Leader at \u003ca href=\"http://musescore.com/\"\u003eMuseScore\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cfigure\u003e\u003ca href=\"https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/4-neuroscience-designers-boost-creativity-endless-reference-scrolling.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" fetchpriority=\"low\" width=\"800\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/4-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 400w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_800/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/4-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 800w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1200/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/4-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 1200w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1600/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/4-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 1600w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_2000/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/4-neuroscience-designers-boost-creativity-endless-reference-scrolling.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/4-neuroscience-designers-boost-creativity-endless-reference-scrolling.png\" sizes=\"100vw\" alt=\"Sergei’s project screenshot\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eSergei’s project screenshot (\u003ca href=\"https://files.smashing.media/articles/neuroscience-designers-boost-creativity-endless-reference-scrolling/4-neuroscience-designers-boost-creativity-endless-reference-scrolling.png\"\u003eLarge preview\u003c/a\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2 id=\"tips-for-incorporating-a-routine-that-sustains-designer-s-creativity\"\u003eTips For Incorporating A Routine That Sustains Designer’s Creativity\u003c/h2\u003e\u003cp\u003eWhenever you feel stuck in your work or overly critical of your designs or prototype, think about the strategies from the above that might help your creative process.\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eFind something you genuinely enjoy or have always wanted to try and implement in small steps.\u003c/strong\u003e\u003cbr/\u003eIt doesn’t need to be a completely new hobby. For example, you could dance to your favorite music at home, stand on a balance board between work calls, or try something new once a month or quarter with friends, like skating, rock climbing, or other activities. This year, I plan to go skiing for the first time.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eConstantly explore new things, even small ones.\u003c/strong\u003e\u003cbr/\u003eTake different routes to work, cook new dishes, or listen to unfamiliar music. Even if you don’t end up loving it, it’s still valuable because your brain is enriched by the experience.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eMeet new people.\u003c/strong\u003e\u003cbr/\u003eAs I mentioned earlier, communication skills are essential for designers, but beyond that, new people can inspire you in unexpected ways. They might introduce you to a new sport, hobby, or activity that you could even try together.\u003c/li\u003e\u003c/ol\u003e\u003cp\u003eI shared examples of designers who have rebuilt their creativity through activities like tennis, music, and languages, and I feel the impact in my own daily routine when I try new things and hobbies. Whatever approach you decide to follow, I guarantee your brain will feel the difference and reward you with fresh ideas and inspiration.\u003c/p\u003e\u003ch2 id=\"conclusion\"\u003eConclusion\u003c/h2\u003e\u003cp\u003eCreativity may be developed in a variety of ways, including browsing reference sites and putting in a lot of practice — both of which are important. Outside these classic ways, you can engage in \u003cstrong\u003eactivities that not only promote creativity but also improve your mental and physical health\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eThere are many possibilities for increasing brain activity, and you can develop your own entertaining and useful ways of spending time. Finally, trying something new will generate new thoughts and break down the monotony.\u003c/p\u003e\u003cp\u003eWhen you experience virtual reality, read poetry or fiction, see a film, listen to a piece of music, or move your body to dance, to name a few of the many arts, you are biologically changed. There is a neurochemical exchange that can lead to what Aristotle called \u003cstrong\u003ecatharsis\u003c/strong\u003e, or a release of emotion that leaves you feeling more connected to yourself and others afterward. (\u003cem\u003eSource: Susan Magsamen, Ivy Ross. Your Brain on Art, 2023\u003c/em\u003e)\u003c/p\u003e\u003ch4 id=\"further-reading-on-smashing-magazine\"\u003eFurther Reading on Smashing Magazine\u003c/h4\u003e\u003cul\u003e\u003cli\u003e“\u003ca href=\"https://www.smashingmagazine.com/2015/09/why-performance-matters-the-perception-of-time/\"\u003eWhy Perceived Performance Matters: The Perception Of Time\u003c/a\u003e,” Denys Mishunov\u003c/li\u003e\u003cli\u003e“\u003ca href=\"https://www.smashingmagazine.com/2015/11/why-performance-matters-part-2-perception-management/\"\u003eWhy Performance Matters: Perception Management\u003c/a\u003e,” Denys Mishunov\u003c/li\u003e\u003cli\u003e“\u003ca href=\"https://www.smashingmagazine.com/2019/03/biometrics-neuro-measurements-user-testing/\"\u003eBiometrics And Neuro-Measurements For User Testing\u003c/a\u003e,” Susan Weinschenk\u003c/li\u003e\u003cli\u003e“\u003ca href=\"https://www.smashingmagazine.com/2019/04/designers-guide-better-decisions/\"\u003eA Designer’s Guide To Better Decisions\u003c/a\u003e,” Eric Olive\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cimg src=\"https://www.smashingmagazine.com/images/logo/logo--red.png\" alt=\"Smashing Editorial\" width=\"35\" height=\"46\" loading=\"lazy\" decoding=\"async\"/\u003e\n\u003cspan\u003e(cc, il, mrn, yk)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "27 min read",
  "publishedTime": "2025-04-24T10:00:00Z",
  "modifiedTime": "2025-04-24T10:00:00Z"
}
