{
  "id": "4bfc019d-c265-468c-8540-1da9f45f242b",
  "title": "Why You Should Speak At Events As An Early-Career Professional",
  "link": "https://smashingmagazine.com/2024/11/why-you-speak-events-early-career-professional/",
  "description": "Many talented professionals hold back from speaking at tech events, believing they need years of experience or expert status first. Drawing from her experience as a first-time speaker at WordPress Accessibility Day 2024, Victoria Nduka discusses how speaking at events benefits both individuals and the tech community.",
  "author": "Victoria Nduka",
  "published": "Fri, 22 Nov 2024 09:00:00 GMT",
  "source": "https://www.smashingmagazine.com/feed",
  "categories": null,
  "byline": "About The Author",
  "length": 19670,
  "excerpt": "Many talented professionals hold back from speaking at tech events, believing they need years of experience or expert status first. Drawing from her experience as a first-time speaker at WordPress Accessibility Day 2024, Victoria Nduka discusses how speaking at events benefits both individuals and the tech community.",
  "siteName": "Smashing Magazine",
  "favicon": "https://smashingmagazine.com/images/favicon/apple-touch-icon.png",
  "text": "16 min readConferences, Career, Events, InspirationMany talented professionals hold back from speaking at tech events, believing they need years of experience or expert status first. Drawing from her experience as a first-time speaker at WordPress Accessibility Day 2024, Victoria Nduka discusses how speaking at events benefits both individuals and the tech community.On Thursday, October 10, 2024, I gave my first talk at an international event, the WordPress Accessibility Day (WPAD) 2024. Just a few months before, I was a newcomer to the world of web accessibility. Yet here I was, speaking to an audience of accessibility specialists and advocates, and they were genuinely interested in what I had to share. How did I get here? Most importantly, how can you get here?My Journey To Web Accessibility And Public SpeakingI first learned about web accessibility from contributing to caMicroscope as an Outreachy intern. Outreachy offers internships in open source and open science to people underrepresented in tech within their home countries. caMicroscope is basically an open-source tool for studying and analyzing digital images of body tissues.During my three-month internship, I worked on enhancing the caMicroscope’s accessibility. I conducted accessibility audits to identify areas for improvement and fixed several technical issues to make the web app more accessible. Since this was my first exposure to accessibility, I spent a lot of time researching and learning, gradually building a knowledge base that would later inspire my first talk.The more I learned about accessibility, the more I realized how important it is to digital product design and user experience, yet few people seemed to be talking about it. Just before my internship ended, I began searching for accessibility events that I could attend to connect with people in the field. That was how I stumbled on the Call for Proposals (CFP) for WordPress Accessibility Day 2024.Initially, I was hesitant to apply. I wondered,What do I know about accessibility that people would care to listen to me?But I also thought,How often do you find a UX designer not only testing for accessibility but actually implementing technical fixes for the first time?This was my experience, my story, and no one could tell it better than me. The CFP also encouraged first-time speakers to submit a proposal. That was an additional motivation. I figured,What’s the worst that could happen?So, I pushed through my doubts, did extensive research to choose a topic, and finally submitted my proposal.When I received the email that my proposal was accepted, I was thrilled. But then came the next hurdle — preparing the presentation itself. Now, I had to think deeply about my audience: what message I wanted to convey and how to make it engaging and informative. After all, people were going to spend their time listening to me. I wanted to make it worth their while.I reworked my slides at least four times. Even the night before my talk, I was still making edits (something I don’t recommend!). Watching the sessions of speakers who presented before me helped me learn some last-minute tips, but it also led to comparing my slides to theirs, wondering if I was missing something. Up until my talk began, I struggled with imposter syndrome. What if I forgot what I was supposed to say? Or don’t know how to answer a question that an attendee asks?Finally, the moment came. I spent 40 minutes sharing with attendees the importance of manual accessibility testing. Not long into my presentation, I felt my initial anxiety melt away. I was calm and enthusiastic throughout the rest of my talk. It was an amazing experience, one that I’m grateful for.Since then, I’ve submitted another talk proposal to speak at a different conference. While I still have some doubts, they’re no longer about whether or not I’m qualified to speak but rather about whether or not my talk will be accepted. I’ve grown since my first talk, and if you’re considering a similar path, you can too.Why We Hold BackAt every tech event I attend, when the hosts introduce the speakers, the introductions typically go something like the following:“John Doe is the Senior Product Designer at XYZ Company, bringing over seven years of expertise to his role. He serves as Chairman of the Technical Steering Committee for the ABC Community, contributing to its strategic direction and growth. As the founder of LMNOP, John has driven a startup that has generated over $XXXX in revenue and created over 500 jobs, making a substantial impact on the African tech ecosystem.”Impressive. Inspiring. And for a newbie, maybe even intimidating.When they’re giving their talk, I often catch myself thinking:With so many years of experience, no wonder they know so much. When will I ever reach this level?I was subconsciously beginning to associate “speaker” with “expert.” I started believing that to qualify as a speaker, I needed an impressive title, years of experience, or some remarkable achievement under my belt. And I know I’m not the only one who feels this way.How To Deal With Impostor SyndromeWhen I first saw the call for speakers for WordPress Accessibility Day, my immediate reaction was to scroll past it. After all, I had only been working with web accessibility for a short time. Surely, they were looking for seasoned professionals with years of experience, right? Wrong. Had I given in to this misconception, I would have robbed myself of an incredible opportunity for growth.If you’ve ever held back from submitting a talk proposal because you feel you’re not qualified enough to talk on a subject, here are some tips to help you deal with the imposter syndrome:Embrace Your Newbie StatusThe reason you feel like an imposter is probably because you’re cosplaying as an expert that you’re not (yet), and you’re afraid people might see through the facade. So, the fear of failing and the pressure to meet expectations weigh you down. Be proud of your novice status. And who said experts make the best speakers? Even the so-called experts get nervous to speak.Practice, Practice, PracticeAnother reason you may hold back is because you don’t have speaking experience. But how do you gain speaking experience? You guessed right — by speaking. So, speak. Or at least practice speaking. The more prepared you are, the more confident you’ll feel. Start by presenting to your rubber duck, your pet, a friend, or a family member. Each time you practice, you’ll discover ways to explain concepts more clearly and identify areas where you need to strengthen your understanding. Record yourself and watch it back. Yes, it’s uncomfortable, but it’s one of the best ways to improve your delivery and body language.Focus On Your JourneyYour recent learning experience is actually an advantage. You still remember what it’s like to struggle with concepts that experts take for granted. This makes you qualified to help others who are just starting. Think about it: Who better to explain the challenges of learning a new technology than someone who just overcame them?Focus On Sharing, Not ProvingShift your mindset from “I need to prove I’m an expert” to “I want to share what I’ve learned.” This subtle change removes the pressure of perfection and places the focus where it belongs — on helping others. Share your mistakes, your “aha” moments, the resources that helped you. These are often more valuable than polished theory from someone who’s forgotten what it’s like to be a beginner.I’m not the first UX designer to dive into accessibility, but out of many contributors who applied to the project, I was the one selected to improve caMicroscope’s accessibility. That’s my unique angle. Your background and experience bring a perspective that others can learn from. Don’t try to compete with comprehensive tutorials or documentation. Instead, share your practical, real-world experience. Focus on sharing:Specific problems you encountered and how you solved them;Lessons learned from failed approaches;Real-world trade-offs and decisions you had to make;Insights that surprised you along the way;Practical tips that aren’t found in standard documentation.Remember That The Audience Wants You To SucceedConference attendees (and organizers) aren’t there to judge you or catch you making mistakes. They’re there to learn, and they want you to succeed. Many will be grateful to hear from someone who can relate to their current experience level. Your vulnerability and openness about being new to the field can actually make your talk more approachable and engaging.Why Newbie Voices MatterYou Bring A Fresh PerspectiveAs an early-career professional, you bring a fresh, unencumbered viewpoint to the table. The questions you ask and the solutions you propose aren’t constrained by the “way things have always been done.”This reminds me of the story about the truck that got stuck under a bridge. Experts spent hours trying complex maneuvers to free it until a schoolboy suggested a simple solution — deflating the tires. Your recent learning experiences make you uniquely positioned to see solutions that seasoned professionals overlook.You see, innovation often arises from those not bound by conventional thinking. As a newcomer, you’re more likely to draw parallels from other industries or suggest unconventional approaches that could lead to breakthroughs.You Inspire Others Like YouWhenever I see a call for speakers for an event, I have a habit of checking the speakers’ lineup from past events to see if there’s anyone like me — Nigerian, female, relatively new to tech, young. If I don’t find anyone similar, I often feel hesitant about submitting a proposal. But if I do, I’m immediately encouraged to apply.Your Story Has PowerYour story, your ideas, your fresh take — they could be the solution to someone’s problem, ignite a new area of exploration, or simply give another budding professional the confidence to pursue their goals. Your journey could be exactly what someone in the audience needs to hear. So, don’t let imposter syndrome hold you back. The tech community needs your voice.When you speak at events, you’re not just sharing your own knowledge. You’re inspiring other newcomers to step up and share their voices, too. Representation matters, and you’re contributing to the diversity of perspectives, which is necessary for progress and innovation.Benefits Of Speaking As A NewcomerBesides the anxiety that comes with speaking, are there benefits that you gain from being a first-time speaker at an event? Short answer: Yes. What are they?Your Knowledge GrowsYou know what they say: If you want to master something, teach it.When I started preparing for my accessibility talk, I extensively researched not just my topic but also how best to deliver it. I read articles on creating accessible presentations. I was speaking at an accessibility event, after all, so my slides and delivery had to be accessible to all in the audience. The questions from the audience also challenged me to think about accessibility from angles I hadn’t considered before. Trust me, you’ll learn more preparing for a 30-minute talk than you would in months of regular work.You Become More ConfidentRemember that shaky feeling when you first pushed code to production? Speaking at an event is similar — terrifying at first but incredibly empowering once you’ve done it. After my first talk, I found that I became more confident in team meetings, more willing to share ideas, and more comfortable with challenging assumptions. There’s something powerful about standing in front of a room (virtual or physical) and sharing your knowledge that makes other professional challenges seem less daunting.The more you speak, the more confident you become. (Image source: Unsplash) (Large preview)The Quality And Quantity Of Your Network IncreasesNetworking hits differently when you’re a speaker. Before my talk, I was just another attendee sending connection requests. After? Industry leaders were reaching out to ME. I remember checking my LinkedIn notifications after my accessibility talk and seeing connection requests from people I’d only dreamed of connecting with.Now, instead of trying to start conversations at networking sessions (which, let’s be honest, can be awkward), your talk becomes the conversation starter. People approach you with genuine interest in your perspective, and suddenly, you’re having meaningful discussions about your passion with folks who share it.It Gives Your Career A Significant BoostWant to know what sets you apart from other candidates with similar years of experience? Speaking credentials. Imagine listing “Speaker at WordPress Accessibility Day” on my resume. It shows initiative and expertise that goes beyond day-to-day work activities.Plus, conferences often give speakers free or discounted tickets to future events; that’s premium access to learning and networking opportunities that might otherwise be out of reach for early-career professionals. That’s how you get to “that level”.You Contribute To The Tech Knowledge BaseOften, especially with virtual conferences, a recording of the event is uploaded on YouTube. That means anyone searching the web for a topic related to your talk will find your talk in the search results. Your 30-minute presentation becomes a permanent resource in the vast library of tech knowledge. I can’t count the number of times a conference video addressed a concern I had or served as a resource for a talk or an article I was working on. Now, I get to be on the other side, helping someone else figure things out.And here’s another bonus: those YouTube videos also work as a portfolio of sorts. So, not only are you contributing to the community, but you’re also building a body of work that showcases your expertise and speaking skills.You Just Might Get PaidHere’s something people don’t talk about enough: many conferences pay their speakers or at least cover travel expenses. Not only are you learning and growing, but you might also get paid for it! Even if the event doesn’t offer payment, the experience itself is invaluable for your portfolio.You Build Your Personal BrandEvery time you speak, you’re building your personal brand. Your talks become content you can share on social media, add to your portfolio, and reference in job interviews. Imagine a recruiter saying to you, “I remember you from your talk at a so-and-so conference.” In an industry as competitive as tech, this kind of recognition is invaluable.Tips For First-Time SpeakersI found this article by Andy Budd on how to become a better speaker at conferences very helpful when I was preparing for my talk. In addition to his expert advice, here are a few tips I’d like to share from my own experience as a first-time speaker:Choose A Topic You’re Passionate AboutWhen selecting a topic, pick something you’re genuinely passionate about. Your enthusiasm will shine through your presentation and captivate the audience.Recently learned a new skill that simplified your workflow?Participated in a workshop that changed how you approach a problem?Discovered a clever workaround to a common problem?Topics like these, drawn from your personal experiences, make for compelling talk ideas.Here’s a hack I’ve used to uncover potential speaking ideas: instead of racking your brain when a call for proposals goes out, stay alert for inspiration in your day-to-day activities. As you go about your work or scroll through social media, jot down any concepts that pique your curiosity. That seemingly mundane task you were performing when the idea struck could serve as a fascinating hook for your presentation.Prepare ThoroughlyOnce you’ve settled on a topic, it’s time to dive deep into research and practice. Spend time mastering the subject matter from every angle so you can speak with authority. If you followed tip no. 1 (choose a topic you’re passionate about and are drawing from your personal experience), you are already halfway prepared.But don’t stop there. Rehearse your talk multiple times, refining your delivery and transitions until you feel confident. Watch recordings of similar presentations and critically analyze what worked well and where there’s room for improvement. How did the speakers engage the audience? Were there any areas that could have been explained better? Studying successful talks will help you identify ways to elevate your own performance.Engage With Your AudienceA speaking engagement is a conversation, not a monologue. Encourage questions and discussion throughout your talk. Be responsive to the audience’s needs and interests. If you notice puzzled expressions or hesitant body language, pause to clarify or rephrase. Making that personal connection will keep people invested and eager to learn from you.Start With A Virtual EventIf the prospect of speaking in front of a live audience makes you nervous, consider starting with a virtual event. The online format can feel more approachable since you’ll be delivering the talk from the comfort of your home, and you’ll have the flexibility to reference notes or prompts without the audience noticing.Start with a virtual conference (Image source: Unsplash) (Large preview)Connect With Other First-Time SpeakersWhen I was preparing my talk, I spent hours on YouTube searching for talks by people who shared my background. I was particularly interested in their early speaking appearances, so I’d scroll through their video history to find their first-ever talks.These speakers weren’t polished professionals at the time, and that’s exactly what made their talks valuable to me. Watching them helped me realize that perfection isn’t the goal. I studied their presentations carefully, noted what worked well and what could be improved, and used these insights to strengthen my own talk.If you’re more outgoing than I am, consider reaching out directly to other new speakers in your community. You can find them on Twitter, LinkedIn, or at local tech meetups. Building a support system of people who understand exactly what you’re going through can be incredibly reassuring. You can practice your talks together and provide feedback to each other.Be AuthenticFinally, don’t be afraid to let your authentic self shine through. Share personal anecdotes, tell jokes, discuss the challenges you faced, and be vulnerable about your own learning journey.Your honesty and humility will resonate far more than a polished, impersonal presentation. Remember, the audience wants to connect with you, not just your expertise.ConclusionIn retrospect, I’m glad that I pushed past my initial doubts and applied to speak at WordPress Accessibility Day. It was a transformative experience that has accelerated my growth in the field and connected me with an incredible community.To all the newcomers reading this:Your voice matters. Your perspective is valuable. The tech community needs fresh voices and perspectives. Your “I just learned this” enthusiasm can be infectious and inspiring.So, the next time you see a call for speakers, don’t scroll past it. Take that leap. Apply to speak. Share your knowledge. You never know who you might inspire or what doors you might open for yourself and for others.Remember, every expert was once a beginner. I hope you’re inspired to take the stage and let your voice be heard.Further Resources“Getting Started in Public Speaking: Global Diversity CFP Day,” Rachel Andrew“Complete Guide to Giving Your First Conference Talk,” Gwendolyn Faraday“How to Prepare for Your First Conference Talk,” Lisa Wentz M.A.“How to Write a Conference Talk Abstract That Will Get Accepted,” Linda Ikechukwu (yk)",
  "image": "https://files.smashing.media/articles/why-you-speak-events-early-career-professional/why-you-speak-events-early-career-professional.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article__content\"\u003e\u003cul\u003e\u003cli\u003e16 min read\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://smashingmagazine.com/category/conferences\"\u003eConferences\u003c/a\u003e,\n\u003ca href=\"https://smashingmagazine.com/category/career\"\u003eCareer\u003c/a\u003e,\n\u003ca href=\"https://smashingmagazine.com/category/events\"\u003eEvents\u003c/a\u003e,\n\u003ca href=\"https://smashingmagazine.com/category/inspiration\"\u003eInspiration\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003csection aria-label=\"Quick summary\"\u003eMany talented professionals hold back from speaking at tech events, believing they need years of experience or expert status first. Drawing from her experience as a first-time speaker at WordPress Accessibility Day 2024, Victoria Nduka discusses how speaking at events benefits both individuals and the tech community.\u003c/section\u003e\u003c/p\u003e\u003cp\u003eOn Thursday, October 10, 2024, I gave my first talk at an international event, the \u003ca href=\"https://2024.wpaccessibility.day/\"\u003eWordPress Accessibility Day (WPAD) 2024\u003c/a\u003e. Just a few months before, I was a newcomer to the world of web accessibility. Yet here I was, speaking to an audience of accessibility specialists and advocates, and they were genuinely interested in what I had to share. How did I get here? Most importantly, how can you get here?\u003c/p\u003e\u003ch2 id=\"my-journey-to-web-accessibility-and-public-speaking\"\u003eMy Journey To Web Accessibility And Public Speaking\u003c/h2\u003e\u003cp\u003eI first learned about web accessibility from contributing to caMicroscope as an Outreachy intern. \u003ca href=\"https://www.outreachy.org/\"\u003eOutreachy\u003c/a\u003e offers internships in open source and open science to people underrepresented in tech within their home countries. \u003ca href=\"https://camicroscope.org/\"\u003ecaMicroscope\u003c/a\u003e is basically an open-source tool for studying and analyzing digital images of body tissues.\u003c/p\u003e\u003cp\u003eDuring my three-month internship, I worked on enhancing the caMicroscope’s accessibility. I conducted accessibility audits to identify areas for improvement and fixed several technical issues to make the web app more accessible. Since this was my first exposure to accessibility, I spent a lot of time researching and learning, gradually building a knowledge base that would later inspire my first talk.\u003c/p\u003e\u003cp\u003eThe more I learned about accessibility, the more I realized how important it is to digital product design and user experience, yet few people seemed to be talking about it. Just before my internship ended, I began searching for accessibility events that I could attend to connect with people in the field. That was how I stumbled on the Call for Proposals (CFP) for WordPress Accessibility Day 2024.\u003c/p\u003e\u003cp\u003eInitially, I was hesitant to apply. I wondered,\u003c/p\u003e\u003cblockquote\u003eWhat do I know about accessibility that people would care to listen to me?\u003c/blockquote\u003e\u003cp\u003eBut I also thought,\u003c/p\u003e\u003cblockquote\u003eHow often do you find a UX designer not only testing for accessibility but actually implementing technical fixes for the first time?\u003c/blockquote\u003e\u003cp\u003eThis was \u003cem\u003emy\u003c/em\u003e experience, \u003cem\u003emy\u003c/em\u003e story, and no one could tell it better than me. The CFP also encouraged first-time speakers to submit a proposal. That was an additional motivation. I figured,\u003c/p\u003e\u003cblockquote\u003eWhat’s the worst that could happen?\u003c/blockquote\u003e\u003cp\u003eSo, I pushed through my doubts, did extensive research to choose a topic, and finally submitted my proposal.\u003c/p\u003e\u003cp\u003eWhen I received the email that my proposal was accepted, I was thrilled. But then came the next hurdle — preparing the presentation itself. Now, I had to think deeply about my audience: \u003cstrong\u003ewhat message I wanted to convey and how to make it engaging and informative\u003c/strong\u003e. After all, people were going to spend their time listening to me. I wanted to make it worth their while.\u003c/p\u003e\u003cp\u003eI reworked my slides at least four times. Even the night before my talk, I was still making edits (something I don’t recommend!). Watching the sessions of speakers who presented before me helped me learn some last-minute tips, but it also led to comparing my slides to theirs, wondering if I was missing something. Up until my talk began, I struggled with imposter syndrome. What if I forgot what I was supposed to say? Or don’t know how to answer a question that an attendee asks?\u003c/p\u003e\u003cp\u003eFinally, the moment came. I spent 40 minutes sharing with attendees the importance of manual accessibility testing. Not long into my presentation, I felt my initial anxiety melt away. I was calm and enthusiastic throughout the rest of my talk. It was an amazing experience, one that I’m grateful for.\u003c/p\u003e\u003cp\u003eSince then, I’ve submitted another talk proposal to speak at a different conference. While I still have some doubts, they’re no longer about whether or not I’m qualified to speak but rather about whether or not my talk will be accepted. I’ve grown since my first talk, and if you’re considering a similar path, you can too.\u003c/p\u003e\u003ch2 id=\"why-we-hold-back\"\u003eWhy We Hold Back\u003c/h2\u003e\u003cp\u003eAt every tech event I attend, when the hosts introduce the speakers, the introductions typically go something like the following:\u003c/p\u003e\u003cblockquote\u003e“John Doe is the Senior Product Designer at XYZ Company, bringing over seven years of expertise to his role. He serves as Chairman of the Technical Steering Committee for the ABC Community, contributing to its strategic direction and growth. As the founder of LMNOP, John has driven a startup that has generated over $XXXX in revenue and created over 500 jobs, making a substantial impact on the African tech ecosystem.”\u003c/blockquote\u003e\u003cp\u003eImpressive. Inspiring. And for a newbie, maybe even intimidating.\u003c/p\u003e\u003cp\u003eWhen they’re giving their talk, I often catch myself thinking:\u003c/p\u003e\u003cblockquote\u003eWith so many years of experience, no wonder they know so much. When will I ever reach this level?\u003c/blockquote\u003e\u003cp\u003eI was subconsciously beginning to associate “speaker” with “expert.” I started believing that to qualify as a speaker, I needed an impressive title, years of experience, or some remarkable achievement under my belt. And I know I’m not the only one who feels this way.\u003c/p\u003e\u003ch2 id=\"how-to-deal-with-impostor-syndrome\"\u003eHow To Deal With Impostor Syndrome\u003c/h2\u003e\u003cp\u003eWhen I first saw the call for speakers for WordPress Accessibility Day, my immediate reaction was to scroll past it. After all, I had only been working with web accessibility for a short time. Surely, they were looking for seasoned professionals with years of experience, right? Wrong. Had I given in to this misconception, I would have robbed myself of an incredible opportunity for growth.\u003c/p\u003e\u003cp\u003eIf you’ve ever held back from submitting a talk proposal because you feel you’re not qualified enough to talk on a subject, here are some tips to help you deal with the imposter syndrome:\u003c/p\u003e\u003ch3 id=\"embrace-your-newbie-status\"\u003eEmbrace Your Newbie Status\u003c/h3\u003e\u003cp\u003eThe reason you feel like an imposter is probably because you’re cosplaying as an expert that you’re not (yet), and you’re afraid people might see through the facade. So, the fear of failing and the pressure to meet expectations weigh you down. Be proud of your novice status. \u003cstrong\u003eAnd who said experts make the best speakers?\u003c/strong\u003e Even the so-called experts get nervous to speak.\u003c/p\u003e\u003ch3 id=\"practice-practice-practice\"\u003ePractice, Practice, Practice\u003c/h3\u003e\u003cp\u003eAnother reason you may hold back is because you don’t have speaking experience. But how do you gain speaking experience? You guessed right — by speaking. So, \u003cstrong\u003espeak\u003c/strong\u003e. Or at least practice speaking. The more prepared you are, the more confident you’ll feel. Start by presenting to your rubber duck, your pet, a friend, or a family member. Each time you practice, you’ll discover ways to explain concepts more clearly and identify areas where you need to strengthen your understanding. Record yourself and watch it back. Yes, it’s uncomfortable, but it’s one of the best ways to improve your delivery and body language.\u003c/p\u003e\u003ch3 id=\"focus-on-your-journey\"\u003eFocus On Your Journey\u003c/h3\u003e\u003cp\u003eYour recent learning experience is actually an advantage. You still remember what it’s like to struggle with concepts that experts take for granted. This makes you qualified to help others who are just starting. Think about it: \u003cstrong\u003eWho better to explain the challenges of learning a new technology than someone who just overcame them?\u003c/strong\u003e\u003c/p\u003e\u003ch3 id=\"focus-on-sharing-not-proving\"\u003eFocus On Sharing, Not Proving\u003c/h3\u003e\u003cp\u003eShift your mindset from \u003cem\u003e“I need to prove I’m an expert”\u003c/em\u003e to \u003cem\u003e“I want to share what I’ve learned.”\u003c/em\u003e This subtle change \u003cstrong\u003eremoves the pressure of perfection\u003c/strong\u003e and places the focus where it belongs — on helping others. Share your mistakes, your “aha” moments, the resources that helped you. These are often more valuable than polished theory from someone who’s forgotten what it’s like to be a beginner.\u003c/p\u003e\u003cp\u003eI’m not the first UX designer to dive into accessibility, but out of many contributors who applied to the project, I was the one selected to improve caMicroscope’s accessibility. That’s my unique angle. Your background and experience bring a perspective that others can learn from. Don’t try to compete with comprehensive tutorials or documentation. Instead, \u003cstrong\u003eshare your practical, real-world experience\u003c/strong\u003e. Focus on sharing:\u003c/p\u003e\u003cul\u003e\u003cli\u003eSpecific problems you encountered and how you solved them;\u003c/li\u003e\u003cli\u003eLessons learned from failed approaches;\u003c/li\u003e\u003cli\u003eReal-world trade-offs and decisions you had to make;\u003c/li\u003e\u003cli\u003eInsights that surprised you along the way;\u003c/li\u003e\u003cli\u003ePractical tips that aren’t found in standard documentation.\u003c/li\u003e\u003c/ul\u003e\u003ch3 id=\"remember-that-the-audience-wants-you-to-succeed\"\u003eRemember That The Audience Wants You To Succeed\u003c/h3\u003e\u003cp\u003eConference attendees (and organizers) aren’t there to judge you or catch you making mistakes. They’re there to learn, and they want you to succeed. Many will be grateful to hear from someone who can relate to their current experience level. Your vulnerability and openness about being new to the field can actually make your talk more approachable and engaging.\u003c/p\u003e\u003ch2 id=\"why-newbie-voices-matter\"\u003eWhy Newbie Voices Matter\u003c/h2\u003e\u003ch3 id=\"you-bring-a-fresh-perspective\"\u003eYou Bring A Fresh Perspective\u003c/h3\u003e\u003cp\u003eAs an early-career professional, you bring a fresh, unencumbered viewpoint to the table. The questions you ask and the solutions you propose aren’t constrained by the “way things have always been done.”\u003c/p\u003e\u003cp\u003eThis reminds me of \u003ca href=\"https://purposefocuscommitment.medium.com/problem-solving-story-how-to-find-the-right-solution-when-you-are-completely-stuck-d3c89593e67d\"\u003ethe story about the truck that got stuck under a bridge\u003c/a\u003e. Experts spent hours trying complex maneuvers to free it until a schoolboy suggested a simple solution — deflating the tires. Your recent learning experiences make you uniquely positioned to see solutions that seasoned professionals overlook.\u003c/p\u003e\u003cp\u003eYou see, innovation often arises from those not bound by conventional thinking. As a newcomer, you’re more likely to draw parallels from other industries or suggest unconventional approaches that could lead to breakthroughs.\u003c/p\u003e\u003ch3 id=\"you-inspire-others-like-you\"\u003eYou Inspire Others Like You\u003c/h3\u003e\u003cp\u003eWhenever I see a call for speakers for an event, I have a habit of checking the speakers’ lineup from past events to see if there’s anyone like me — Nigerian, female, relatively new to tech, young. If I don’t find anyone similar, I often feel hesitant about submitting a proposal. But if I do, I’m immediately encouraged to apply.\u003c/p\u003e\u003ch3 id=\"your-story-has-power\"\u003eYour Story Has Power\u003c/h3\u003e\u003cp\u003eYour story, your ideas, your fresh take — they could be the solution to someone’s problem, ignite a new area of exploration, or simply give another budding professional the confidence to pursue their goals. Your journey could be exactly what someone in the audience needs to hear. So, don’t let imposter syndrome hold you back. The tech community needs your voice.\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca aria-label=\"Share on Twitter\" href=\"https://twitter.com/share?text=%0aWhen%20you%20speak%20at%20events,%20you%e2%80%99re%20not%20just%20sharing%20your%20own%20knowledge.%20You%e2%80%99re%20inspiring%20other%20newcomers%20to%20step%20up%20and%20share%20their%20voices,%20too.%20Representation%20matters,%20and%20you%e2%80%99re%20contributing%20to%20the%20diversity%20of%20perspectives,%20which%20is%20necessary%20for%20progress%20and%20innovation.%0a\u0026amp;url=https://smashingmagazine.com%2f2024%2f11%2fwhy-you-speak-events-early-career-professional%2f\"\u003eWhen you speak at events, you’re not just sharing your own knowledge. You’re inspiring other newcomers to step up and share their voices, too. Representation matters, and you’re contributing to the diversity of perspectives, which is necessary for progress and innovation.\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003ch2 id=\"benefits-of-speaking-as-a-newcomer\"\u003eBenefits Of Speaking As A Newcomer\u003c/h2\u003e\u003cp\u003eBesides the anxiety that comes with speaking, are there benefits that you gain from being a first-time speaker at an event? Short answer: Yes. What are they?\u003c/p\u003e\u003ch3 id=\"your-knowledge-grows\"\u003eYour Knowledge Grows\u003c/h3\u003e\u003cp\u003eYou know what they say: \u003cstrong\u003eIf you want to master something, teach it\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eWhen I started preparing for my accessibility talk, I extensively researched not just my topic but also how best to deliver it. I read articles on \u003ca href=\"https://www.smashingmagazine.com/2018/11/inclusive-design-accessible-presentations/\"\u003ecreating accessible presentations\u003c/a\u003e. I was speaking at an accessibility event, after all, so my slides and delivery had to be accessible to all in the audience. The questions from the audience also challenged me to think about accessibility from angles I hadn’t considered before. Trust me, you’ll learn more preparing for a 30-minute talk than you would in months of regular work.\u003c/p\u003e\u003ch3 id=\"you-become-more-confident\"\u003eYou Become More Confident\u003c/h3\u003e\u003cp\u003eRemember that shaky feeling when you first pushed code to production? Speaking at an event is similar — terrifying at first but incredibly empowering once you’ve done it. After my first talk, I found that I became more confident in team meetings, more willing to share ideas, and more comfortable with challenging assumptions. There’s something powerful about standing in front of a room (virtual or physical) and sharing your knowledge that makes other professional challenges seem less daunting.\u003c/p\u003e\u003cfigure\u003e\u003ca href=\"https://files.smashing.media/articles/why-you-speak-events-early-career-professional/2-speaker-conference.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" fetchpriority=\"low\" width=\"800\" height=\"533\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/why-you-speak-events-early-career-professional/2-speaker-conference.jpg 400w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_800/https://files.smashing.media/articles/why-you-speak-events-early-career-professional/2-speaker-conference.jpg 800w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1200/https://files.smashing.media/articles/why-you-speak-events-early-career-professional/2-speaker-conference.jpg 1200w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1600/https://files.smashing.media/articles/why-you-speak-events-early-career-professional/2-speaker-conference.jpg 1600w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_2000/https://files.smashing.media/articles/why-you-speak-events-early-career-professional/2-speaker-conference.jpg 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/why-you-speak-events-early-career-professional/2-speaker-conference.jpg\" sizes=\"100vw\" alt=\"A woman standing on a stage and speaking to a crowd\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eThe more you speak, the more confident you become. (Image source: \u003ca href=\"https://unsplash.com/photos/a-woman-standing-on-a-stage-in-front-of-a-crowd-B2wJ5pYxZJw?utm_content=creditShareLink\u0026amp;utm_medium=referral\u0026amp;utm_source=unsplash\"\u003eUnsplash\u003c/a\u003e) (\u003ca href=\"https://files.smashing.media/articles/why-you-speak-events-early-career-professional/2-speaker-conference.jpg\"\u003eLarge preview\u003c/a\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\u003ch3 id=\"the-quality-and-quantity-of-your-network-increases\"\u003eThe Quality And Quantity Of Your Network Increases\u003c/h3\u003e\u003cp\u003eNetworking hits differently when you’re a speaker. Before my talk, I was just another attendee sending connection requests. After? Industry leaders were reaching out to ME. I remember checking my LinkedIn notifications after my accessibility talk and seeing connection requests from people I’d only dreamed of connecting with.\u003c/p\u003e\u003cp\u003eNow, instead of trying to start conversations at networking sessions (which, let’s be honest, can be awkward), \u003cstrong\u003eyour talk becomes the conversation starter\u003c/strong\u003e. People approach you with genuine interest in your perspective, and suddenly, you’re having meaningful discussions about your passion with folks who share it.\u003c/p\u003e\u003ch3 id=\"it-gives-your-career-a-significant-boost\"\u003eIt Gives Your Career A Significant Boost\u003c/h3\u003e\u003cp\u003eWant to know what sets you apart from other candidates with similar years of experience? Speaking credentials. Imagine listing “Speaker at WordPress Accessibility Day” on my resume. It shows initiative and expertise that goes beyond day-to-day work activities.\u003c/p\u003e\u003cp\u003ePlus, conferences often give speakers free or discounted tickets to future events; that’s premium access to learning and networking opportunities that might otherwise be out of reach for early-career professionals. That’s how you get to “that level”.\u003c/p\u003e\u003ch3 id=\"you-contribute-to-the-tech-knowledge-base\"\u003eYou Contribute To The Tech Knowledge Base\u003c/h3\u003e\u003cp\u003eOften, especially with virtual conferences, a recording of the event is uploaded on YouTube. That means anyone searching the web for a topic related to your talk will find your talk in the search results. Your 30-minute presentation becomes a permanent resource in the vast library of tech knowledge. I can’t count the number of times a conference video addressed a concern I had or served as a resource for a talk or an article I was working on. Now, I get to be on the other side, helping someone else figure things out.\u003c/p\u003e\u003cp\u003eAnd here’s another bonus: those \u003cstrong\u003eYouTube videos also work as a portfolio of sorts\u003c/strong\u003e. So, not only are you contributing to the community, but you’re also building a body of work that showcases your expertise and speaking skills.\u003c/p\u003e\u003ch3 id=\"you-just-might-get-paid\"\u003eYou Just Might Get Paid\u003c/h3\u003e\u003cp\u003eHere’s something people don’t talk about enough: many conferences pay their speakers or at least cover travel expenses. Not only are you learning and growing, but you might also get paid for it! Even if the event doesn’t offer payment, the experience itself is invaluable for your portfolio.\u003c/p\u003e\u003ch3 id=\"you-build-your-personal-brand\"\u003eYou Build Your Personal Brand\u003c/h3\u003e\u003cp\u003eEvery time you speak, you’re building your personal brand. Your talks become content you can share on social media, add to your portfolio, and reference in job interviews. Imagine a recruiter saying to you, \u003cem\u003e“I remember you from your talk at a so-and-so conference.”\u003c/em\u003e In an industry as competitive as tech, this kind of recognition is invaluable.\u003c/p\u003e\u003ch2 id=\"tips-for-first-time-speakers\"\u003eTips For First-Time Speakers\u003c/h2\u003e\u003cp\u003eI found this article by Andy Budd on \u003ca href=\"https://www.smashingmagazine.com/2023/07/become-better-speaker-conferences/\"\u003ehow to become a better speaker at conferences\u003c/a\u003e very helpful when I was preparing for my talk. In addition to his expert advice, here are a few tips I’d like to share from my own experience as a first-time speaker:\u003c/p\u003e\u003ch3 id=\"choose-a-topic-you-re-passionate-about\"\u003eChoose A Topic You’re Passionate About\u003c/h3\u003e\u003cp\u003eWhen selecting a topic, pick something you’re genuinely passionate about. Your enthusiasm will shine through your presentation and captivate the audience.\u003c/p\u003e\u003cul\u003e\u003cli\u003eRecently learned a new skill that simplified your workflow?\u003c/li\u003e\u003cli\u003eParticipated in a workshop that changed how you approach a problem?\u003c/li\u003e\u003cli\u003eDiscovered a clever workaround to a common problem?\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eTopics like these, drawn from your personal experiences, make for compelling talk ideas.\u003c/p\u003e\u003cp\u003eHere’s a hack I’ve used to uncover potential speaking ideas: instead of racking your brain when a call for proposals goes out, \u003cstrong\u003estay alert for inspiration in your day-to-day activities\u003c/strong\u003e. As you go about your work or scroll through social media, jot down any concepts that pique your curiosity. That seemingly mundane task you were performing when the idea struck could serve as a fascinating hook for your presentation.\u003c/p\u003e\u003ch3 id=\"prepare-thoroughly\"\u003ePrepare Thoroughly\u003c/h3\u003e\u003cp\u003eOnce you’ve settled on a topic, it’s time to dive deep into research and practice. Spend time mastering the subject matter from every angle so you can speak with authority. If you followed tip no. 1 (choose a topic you’re passionate about and are drawing from your personal experience), you are already halfway prepared.\u003c/p\u003e\u003cp\u003eBut don’t stop there. Rehearse your talk multiple times, refining your delivery and transitions until you feel confident. Watch recordings of similar presentations and critically analyze what worked well and where there’s room for improvement. How did the speakers engage the audience? Were there any areas that could have been explained better? Studying successful talks will help you identify ways to elevate your own performance.\u003c/p\u003e\u003ch3 id=\"engage-with-your-audience\"\u003eEngage With Your Audience\u003c/h3\u003e\u003cp\u003eA speaking engagement is a conversation, not a monologue. Encourage questions and discussion throughout your talk. Be responsive to the audience’s needs and interests. If you notice puzzled expressions or hesitant body language, pause to clarify or rephrase. Making that \u003cstrong\u003epersonal connection\u003c/strong\u003e will keep people invested and eager to learn from you.\u003c/p\u003e\u003ch3 id=\"start-with-a-virtual-event\"\u003eStart With A Virtual Event\u003c/h3\u003e\u003cp\u003eIf the prospect of speaking in front of a live audience makes you nervous, consider starting with a virtual event. The online format can feel more approachable since you’ll be delivering the talk from the comfort of your home, and you’ll have the flexibility to reference notes or prompts without the audience noticing.\u003c/p\u003e\u003cfigure\u003e\u003ca href=\"https://files.smashing.media/articles/why-you-speak-events-early-career-professional/1-virtual-conference.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" fetchpriority=\"low\" width=\"800\" height=\"600\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/why-you-speak-events-early-career-professional/1-virtual-conference.jpg 400w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_800/https://files.smashing.media/articles/why-you-speak-events-early-career-professional/1-virtual-conference.jpg 800w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1200/https://files.smashing.media/articles/why-you-speak-events-early-career-professional/1-virtual-conference.jpg 1200w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1600/https://files.smashing.media/articles/why-you-speak-events-early-career-professional/1-virtual-conference.jpg 1600w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_2000/https://files.smashing.media/articles/why-you-speak-events-early-career-professional/1-virtual-conference.jpg 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/why-you-speak-events-early-career-professional/1-virtual-conference.jpg\" sizes=\"100vw\" alt=\"A laptop screen displaying a group of people in a virtual call.\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eStart with a virtual conference (Image source: \u003ca href=\"https://unsplash.com/photos/macbook-pro-displaying-group-of-people-smgTvepind4\"\u003eUnsplash\u003c/a\u003e) (\u003ca href=\"https://files.smashing.media/articles/why-you-speak-events-early-career-professional/1-virtual-conference.jpg\"\u003eLarge preview\u003c/a\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\u003ch3 id=\"connect-with-other-first-time-speakers\"\u003eConnect With Other First-Time Speakers\u003c/h3\u003e\u003cp\u003eWhen I was preparing my talk, I spent hours on YouTube searching for talks by people who shared my background. I was particularly interested in their early speaking appearances, so I’d scroll through their video history to find their first-ever talks.\u003c/p\u003e\u003cp\u003eThese speakers weren’t polished professionals at the time, and that’s exactly what made their talks valuable to me. Watching them helped me realize that \u003cstrong\u003eperfection isn’t the goal\u003c/strong\u003e. I studied their presentations carefully, noted what worked well and what could be improved, and used these insights to strengthen my own talk.\u003c/p\u003e\u003cp\u003eIf you’re more outgoing than I am, consider reaching out directly to other new speakers in your community. You can find them on Twitter, LinkedIn, or at local tech meetups. Building a support system of people who understand exactly what you’re going through can be incredibly reassuring. You can practice your talks together and provide feedback to each other.\u003c/p\u003e\u003ch3 id=\"be-authentic\"\u003eBe Authentic\u003c/h3\u003e\u003cp\u003eFinally, don’t be afraid to let your authentic self shine through. Share personal anecdotes, tell jokes, discuss the challenges you faced, and be vulnerable about your own learning journey.\u003c/p\u003e\u003cp\u003eYour honesty and humility will resonate far more than a polished, impersonal presentation. Remember, the audience wants to connect with you, not just your expertise.\u003c/p\u003e\u003ch2 id=\"conclusion\"\u003eConclusion\u003c/h2\u003e\u003cp\u003eIn retrospect, I’m glad that I pushed past my initial doubts and applied to speak at WordPress Accessibility Day. It was a transformative experience that has \u003cstrong\u003eaccelerated my growth in the field and connected me with an incredible community\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eTo all the newcomers reading this:\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca aria-label=\"Share on Twitter\" href=\"https://twitter.com/share?text=%0aYour%20voice%20matters.%20Your%20perspective%20is%20valuable.%20The%20tech%20community%20needs%20fresh%20voices%20and%20perspectives.%20Your%20%e2%80%9cI%20just%20learned%20this%e2%80%9d%20enthusiasm%20can%20be%20infectious%20and%20inspiring.%0a\u0026amp;url=https://smashingmagazine.com%2f2024%2f11%2fwhy-you-speak-events-early-career-professional%2f\"\u003eYour voice matters. Your perspective is valuable. The tech community needs fresh voices and perspectives. Your “I just learned this” enthusiasm can be infectious and inspiring.\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eSo, the next time you see a call for speakers, don’t scroll past it. Take that leap. Apply to speak. Share your knowledge. You never know who you might inspire or what doors you might open for yourself and for others.\u003c/p\u003e\u003cp\u003eRemember, every expert was once a beginner. I hope you’re inspired to take the stage and let your voice be heard.\u003c/p\u003e\u003ch3 id=\"further-resources\"\u003eFurther Resources\u003c/h3\u003e\u003cul\u003e\u003cli\u003e“\u003ca href=\"https://www.smashingmagazine.com/2018/02/getting-started-public-speaking/\"\u003eGetting Started in Public Speaking: Global Diversity CFP Day\u003c/a\u003e,” Rachel Andrew\u003c/li\u003e\u003cli\u003e“\u003ca href=\"https://www.freecodecamp.org/news/complete-guide-to-giving-your-first-conference-talk/\"\u003eComplete Guide to Giving Your First Conference Talk\u003c/a\u003e,” Gwendolyn Faraday\u003c/li\u003e\u003cli\u003e“\u003ca href=\"https://www.linkedin.com/pulse/how-prepare-your-first-conference-talk-lisa-wentz/\"\u003eHow to Prepare for Your First Conference Talk\u003c/a\u003e,” Lisa Wentz M.A.\u003c/li\u003e\u003cli\u003e“\u003ca href=\"https://www.everythingtechnicalwriting.com/write-a-conference-talk-abstract/\"\u003eHow to Write a Conference Talk Abstract That Will Get Accepted\u003c/a\u003e,” Linda Ikechukwu\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cimg src=\"https://www.smashingmagazine.com/images/logo/logo--red.png\" alt=\"Smashing Editorial\" width=\"35\" height=\"46\" loading=\"lazy\" decoding=\"async\"/\u003e\n\u003cspan\u003e(yk)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "21 min read",
  "publishedTime": "2024-11-22T09:00:00Z",
  "modifiedTime": "2024-11-22T09:00:00Z"
}
