{
  "id": "615ca215-02f6-441d-b701-68d90505436d",
  "title": "[Podcast] Coaching for Brand Builders: Guide Clients to Clarity Without Burning Out with Michael Bungay Stanier",
  "link": "https://justcreative.com/coaching-brand-builders",
  "description": "If you’re a creative shifting into strategy, leading workshops, or simply trying to manage client relationships without losing your mind, this one’s for you.",
  "author": "Jacob Cass",
  "published": "Fri, 30 May 2025 07:48:52 +0000",
  "source": "https://feeds.feedburner.com/JustCreativeDesignBlog",
  "categories": [
    "Podcast",
    "brand builders",
    "Brand Strategy",
    "Branding",
    "Coaching"
  ],
  "byline": "Jacob Cass",
  "length": 68239,
  "excerpt": "If you’re a creative shifting into strategy, leading workshops, or simply trying to manage client relationships without losing your mind, this one’s for you.",
  "siteName": "JUST™ Creative",
  "favicon": "https://justcreative.com/wp-content/uploads/2017/02/cropped-Just-Creative-FavIcon-192x192.png",
  "text": "In this episode of JUST Branding, we sit down with Michael Bungay Stanier (MBS), the best-selling author of The Coaching Habit, The Advice Trap, and How to Work with (Almost) Anyone, to explore how coaching can become your secret weapon in branding and business. If you’re a creative shifting into strategy, leading workshops, or simply trying to manage client relationships without losing your mind, this one’s for you. We unpack: • Why giving advice too fast can derail your projects (and burn you out) • How to stay curious longer and ask smarter questions that unlock clarity • The difference between mentoring, coaching, and consulting—and when to use each • How to use coaching to move from freelancer to trusted advisor • Practical tools from MBS’s “7 Essential Coaching Questions” to use in brand strategy sessions • What to do when client relationships get tricky—and how to build ones that actually work MBS drops wisdom with warmth and wit, showing how brand builders can level up their impact, not by saying more, but by listening better. Listen Here Love the show? Please review us on Apple. Play Now Watch on YouTube Learn Brand Strategy Brand Master Secrets helps you become a brand strategist and earn specialist fees. And in my opinion, this is the most comprehensive brand strategy course on the market. The course gave me all the techniques and processes and more importantly… all the systems and tools I needed to build brand strategies for my clients. This is the consolidated “fast-track” version to becoming a brand strategist. I wholeheartedly endorse this course for any designer who wants to become a brand strategist and earn specialist fees. Check out the 15-minute video about the course, which lays out exactly what you get in the Brand Master Secrets. Transcript It’s really great to start noticing how much you want to give advice. Most of us don’t even realize just how relentlessly we leap to the answer and we think that that’s what the other person is asking for. It is surprising how many situations don’t have somebody going, what I’m hoping for here is your advice. Mostly they want your encouragement, being seen, being helped, and you can do that with questions and thank you as longer. Hello and welcome to JUST Branding, the only podcast dedicated to helping designers and entrepreneurs grow brands. Here are your hosts, Jacob Cass and Matt Davies. Hello and welcome to JUST Branding. Today’s guest is someone we’ve been wanting to have on the show for a long time. His name is Michael Bungay Stanier or MBS as is known by many. He’s the author of The Coaching Habit, which was an absolute game changer for me, The Advice Trap, How to Begin and How to Work with Almost Anyone. His work has helped leaders, teams and creatives get better results by saying less, listening more and leading with intention. In this episode, we’re digging into a powerful idea, how coaching can be a superpower for brand builders. So whether you’re a designer leading strategy sessions, a consultant guiding clients or a creative looking to level up, this conversation is all about how coaching can help you show up with more clarity, ask better questions and build stronger relationships without burning out. We’ll get into why giving advice isn’t always the best move, how to handle tricky client dynamics and how shifting from being the doer to being the guide can actually transform your work. So let’s jump in. Here’s our conversation with the one and only Michael Bungay Stanier. Welcome to the show. Welcome. Yeah, thank you. Look, I’m super happy to be here. I’ve been in this world of being brand building, of being a vendor, a consultant on the other side of the table. So a lot of what I want to talk about actually comes from all the mistakes I made. And the scar tissue I have, and the learnings I took around. Just that my advice is not always as good as I think it is. And sometimes asking a good question can make all the difference. Absolutely. And I got so much of that from your book, The Coaching Habit, which we’ll tuck into in a moment. Just before we tuck into that, we’re having a conversation off air about how many books we had of Michael’s. So we’re just showing them up on screen here. I love that. I’ll show you all the books you’ve got. Wait, he’s just saying you’ve only got one of them. Just one. Jacob is literally five times the man you are, Matt. And I’m not talking about Beards here. I’m talking about book ownership. I have failed miserably because I’ve got The Coaching Habit. Jacob’s got about 10 books he’s holding up, if you can see. So I feel ashamed. However, I would say that this book, The Coaching Habit, I have really appreciated. And I thought it was quite interesting, like the first question that you recommend, you know, what’s on your mind? So what’s on your mind, Michael? What are you thinking? Well, if I’m honest, part of what I’m thinking about is what’s for dinner, because I’m a little bit different time zones. You know, Jacob’s in Australia, which is where I’m originally from. So that’s what, 14 hours ahead of here. You’re in Wales, which is five or six hours ahead of me. So we’re all in different time zones catching up. But here, it’s evening’s falling, dusk is coming, my wife is cooking something in the kitchen over there. So I’m enjoying this conversation, but also looking forward to having a meal with her later on. That’s precisely what’s on my mind right now. That’s the honest truth. All right. Well, let’s tuck into your story a little bit more. We want to know who Michael is. So in your own words, can you let us know a little bit about Michael, how he came into coaching, why it’s such a big part of your mission? Yeah. If I’m known at all, I’m best known for this book, The Coaching Habit. About nine years old and it’s become the best-selling book on coaching. Or really it’s the best-selling book on how to be more coach-like. Because I’m actually not trying to convince people to be a coach. I’m trying to make this technology useful to everybody because it’s a really powerful everyday technique. But they say inspiration is when your past suddenly makes sense. So this kind of culminating moment of writing The Coaching Habit, you kind of rewind it and you can kind of see the story in my back past. So I’m Australian, grew up in Canberra, which as Jacob would know, you get mocked by every other Australian for growing up in Canberra, because it’s the national capital and it’s the government town. Everybody goes, you know, Canberra, you loser. But I love growing up in Canberra. I went to high school there, I went to uni there, Australian National University, did a degree in literature and a degree in law. Literature I loved and I was pretty good at it and I kind of crushed that. Law, not so much. I literally finished my law degree being sued by one of my law professors for defamation. So that really wasn’t going that well. I was saved from becoming a lawyer by winning a Rhodes Scholarship, a fancy scholarship over to England. So not only did I not become a lawyer, good for the legal profession and great for me, but I also met my wife studying at Oxford. That was 30 plus years ago now. So I did a master’s degree in literature at Oxford. And so I’m now in my mid-20s and still not any idea whatsoever about what I wanted to do with my life. I knew I didn’t want to become an academic. I knew I didn’t want to become a lawyer, but it wasn’t obvious what I did want to become. And so my first job at a university, I stumbled into this small agency. It was an innovation agency and this is in the mid-90s. So they really knew what innovation was. I’m trying to explain it to my family. They’re like, we don’t understand what you’re doing. And it was a brilliant first job in many ways because these guys were kind of all up on the maverick thing. So they’re like, no, don’t, because I used to sew my own clothes, long hair, earrings, and they’re like, we like that you’re weird. So just keep doing that, that was great. At the same time, we didn’t have a whole lot of a success in actually launching products. I can now say that I had a small role in Stuffed Crust Pizza for Pizza Hut and I also invented a or helped invent a single malt whiskey that is being described on whiskey.com as the worst single malt whiskey ever invented. I got to this point going, look, you know what? I don’t want to die with those being the two career highlights of my life. I need to go find something else to do. But what that work had taught me was how to run a focus group, how to sit with people and ask questions and be curious. In fact, at university, I’d done crisis canceling, so young people having a tough time, mental health issues, suicide. I’d been trained in sitting and listening and asking questions. Now I can see that these were really foundational moments for me about learning the power of asking a question, being present to the answer, not assuming that the first answer was the right answer. And these are all things that come up in The Coaching Habit book. So I moved from this innovation company. I moved into change management because I was like, why do none of our good ideas survive to see the light of day? And that took me from the UK, London, where I was living then, to Boston, worked in Boston for a while. Finally, it was like, okay, I’m done with this. I’m going to head up to Canada, the Great White North. I lined up a job, but my flight out of Boston was on 9-11. So that all went haywire. So out of necessity, because my job didn’t exist anymore, I started my own company. And I was also becoming increasingly unemployable. And that was 20-some years ago, 22-23 years ago. And after a certain amount of time where my only business plan was to find somebody with a wallet and try and persuade them to give me some money, I caught on to this idea of coaching being powerful. And I trained as a coach and I loved it. And I was also deeply irritated by it. Because on the one hand, I could see the power of what it meant to be present to somebody, to ask them a question, to help them figure some stuff out on their own. On the other hand, it drove me nuts that coaching came with all this baggage. It was a woo-woo, it was caftans, it was incense, it was touchy-feely, it was HR. And I was like, you know, I’m going to drive to try and make coaching feel like a regular everyday technology that normal people can use. And I started training, I started teaching people around that, and then that culminated in A Coaching Habit book nine years ago. Since then, I’ve written some other books as well. But that’s the broad sweep of the story. What are your other books about, Michael? Because as you know, I’ve got The Coaching Habit, but, you know, I wasn’t that… I’ve got to be honest, before, you know, we started talking, I wasn’t that familiar with any of your other works. So it’d be great. Perhaps other folks are like me. Give us a flavor. So there’s one type of audience I help, which are people who work with other people. So The Coaching Habit is this book to Unweird Coaching. The Advice Trap, which is like a sister book to The Coaching Habit, is all about kind of a deeper dive into how do you tame your advice monster, that driving force you have to kind of want to jump in and offer up ideas and suggestions and opinions. And then my most recent book for managers and leaders and individual contributors is How to Work with Almost Anyone, which is all about how do you build better working relationships with people. Because you’re working relationships with your clients, with your boss, with your team, determine your happiness and success. And most people don’t actively do much about that. They just cross their fingers and they hope for their best. So that’s kind of one cluster of books. And then there’s another cluster of books, which is helping people figure out what they want to do with their lives. So the book How to Begin is all about how do you find your worthy goal, something that is thrilling and important and daunting for you, that you can kind of go, right, here’s the next big thing for me to work on. And the most recent book I published is called The Do Something That Matters Journal. So it’s a journaling process to support the quest to go find a life that matters. Amazing. Thank you for sharing. I had a follow up question with your story because you said you were trained as a coach. I’m curious on where you got trained or who trained you or just like that back. So there’s a number of great coaching schools around. I went with one called CTI or the Coach Training Institute. They’re one of the more established ones. And I actually built a coaching practice and then went to my surprise. This isn’t actually what I want to be doing. I don’t like coaching enough. I find it a bit restrictive. I like actually the creative act. I like creating content. I like connecting with people. I like being on the stage in front of an audience. So having built a coaching practice and gone, this is it. Finally, I’ve reached the destination I’ve been working towards for 25 years. I was like, this is not the destination. Shut it down and figure out other things to do. So my world now is I’ve got a training company that’s run by a team and they support big companies like Microsoft and Salesforce and Gucci to make their cultures more coach-like. A business which is about helping people in midlife figure out the next big thing. And a new project called Chain Signal, which is about helping people understand organizational change. So that sucks a little less. Amazing. Well, thank you for sharing that background. I’d love to get into the coaching side of things now. And we often start with definitions on the show. So I’d love to hear how you define coaching and perhaps how it’s different from mentoring or consulting. Yeah. Well, it’s a good question because there’s a bazillion definitions of coaching. And everyone has kind of heard of it and really like, I’m not quite sure what we’re talking about. Everybody who’s selling coaching has their own definition of coaching. People might have heard, I mean, probably heard of sports coaches and it’s like the same as sports coaching. There’s executive coaching, there’s life coaching. How are these things related, if at all? But for me, it is about a very everyday behavior. And it is simply this. Can you stay curious a little bit longer? Can you rush to action and advice giving a little bit more slowly? Because most people are advice giving maniacs. They’re like somebody starts talking and after about 30 seconds, you’re like, I already know the answer. I’m now pretending to listen. I’ve got my fake active listening mode on, just waiting to add value to this conversation by telling them what I’ve already decided. And this superpower of actually staying curious just a little bit longer, and I’m not talking a week longer or a day longer, I’m talking like 90 seconds longer, can actually revolutionize the experience of a conversation. And then how it’s related to something like mentoring, Jacob. Well, you know, mentoring, broadly speaking, is somebody who’s walked a similar path to you, and it’s just a little bit ahead of you, like a year or a decade going. You know, I’ve got some stories and I’ve got some wisdom and I’ve got some understanding of this landscape that you may not have. And the very best mentors I know also are powerful questioners because they know that when you ask a question and you help people figure it out themselves, that’s a wisdom that lands in a much deeper way. So, whereas with coaching, you can stay curious a little bit longer with anyone. You don’t have to have had particular subject matter expertise to kind of assume that role with them. And the last one is just consulting, just so we got broad definitions for each of them. Yeah, well, you hear my bias in all of this, which is like, you know, what a good consultant is, somebody who asks questions. Same with being a good sales person. You know, a good person who is in sales is somebody who asks questions. Now, a consultant is often somebody going, oh, I’m hiring a consultant because they have the answer. But a great consultant will feel the need to kind of present a solution, if that’s the agreement that they have with their client. But what they’ll know is when a client goes, hey, here’s my problem, that’s almost certainly not the problem. That’s just their first go at trying to express the problem. And way too many consultants, and I’ve been one of these consultants, have generated PowerPoint decks with detailed explanations and outstanding answers to solve the wrong problem. Because we fell for the illusion that the presenting problem is the actual problem. So I guess you could say if it’s like a music mixing board, each one of these have different levels of advice giving, of subject matter expertise and of curiosity. My stand would be the more curious you are with all of them, particularly in the first part of the interaction, the more powerful and more useful and more on point your answers and solutions will be when you actually get to them. 100%. I often obviously do a bit of consulting myself and I think, you know, you are always presented with the problem, you know, in the outset, in the initial sales discussions actually, but, you know, before you’ve even sort of been hired, it’s like, can you come and help us with this? And I always make that point, like you said there, Michael, when I’m talking to people, because I always say, look, you know, it very well may be that as you’ve, you know, you describe things that that is the problem. But look, think of me like a doctor, right? If you went to the doctor and you said, I’ve got a broken leg, right? The doctor doesn’t just go, oh, okay, and wrap you in plaster. The doctor says, let’s just diagnose that first. Let’s just double check that. Let’s go for a scan first. And then once we’ve established that, we will then patch it up. And that should be a good role. And that comes with curiosity and asking questions, as you say. That’s right. And even if the thing they’re talking about is an issue, it may not be the issue. Exactly. Because I’ve been on both sides of the table where I’ve got people to solve something for me that has been a thing that I wanted to solve, but it hasn’t been the big thing that’s actually going to make the real difference to my company or my business or whatever, whatever else might be framing that up. So part of the great gift of a consultant is a willingness to say, look, I’m going to really help you figure out what the real challenge is because advice is never, never as cheap as it is now. I mean, honestly, anything you know, ChatGPT knows better than you, and in a more succinct way than you, and often with better references than you because you’ve actually half-assed it and you can’t even quite, quite remember what the actual solution is. So if you think your idea and your content and your answer is unique, and valuable, and differentiated, I reckon you’re fighting a losing battle on that. But your curiosity and your ability to help people actually figure out for themselves what the real challenge they might be facing, that, that is something special. Absolutely. Well, let’s get in the practical side of things now, how we can actually use coaching as a, as a superpower. You’ve done a lot of podcasts on The Coaching Habit and The Seven Questions inside. So we’re not going to go through all of those questions. You can get access to that in the book and many other podcasts. But what do you find the most powerful question out of those seven? Well, context is everything. So in some ways, the most powerful question is what’s the most going to be most helpful for the person in front of me right now? You know, because coaching is an act of service and an act of empowerment. You’re like, I am, I am trying to be helpful for you or, and or particularly if you’re coaching somebody in your team, I am trying to invite you to step forward and assume responsibility and accountability and kind of capacity for this challenge that we’re talking about. So what’s the most useful question just depends a little bit on what’s going on. But if we’re springboarding off that rant I just had around, whatever you think, if your first idea is not going to be the right idea, the first challenge is not the right challenge. That question that you’ve already heard me say, which is so what’s the real challenge here for you? That’s a really powerful question. And I’ll break it down and I get kind of nerdy about it. You could ask somebody, what’s the challenge here? And you know, as creatives, people probably ask that question a thousand times. And what’s the challenge here is okay. But just listen how different it is when you guys say, what’s the real challenge here? Because that actually shifts it to say, look, there’s a bunch of things going on. What do you think the real challenge is? And my bet is that most of the time, people are going to stop and go, oh yeah, what is the real challenge? They’re going to stop and they’re going to think. And when you’ve stopped somebody and you’ve got them thinking, you have become a more valuable partner to them right away. But then when you go, what’s the real challenge here for you? Now you’re not talking about some sort of abstract business problem out there. You’re like, here’s what’s hard about this for me. So now you are solving the problem and you’re solving that person’s problem as well. And you’re helping to deep dive into that. And I think that becomes really powerful. So what’s the real challenge here for you? And they’ll give you an answer to that. And if you’re smart, you’ll know that that’s not their only answer and it’s probably not their best answer. So what I would do is I would then combine that with the question I actually often say is the best coaching question in the world which is simply and what else? So here’s a script that everybody listening can just use and it will be powerful for them. What’s the real challenge here for you? And what else? And what else? So what’s the real challenge here for you? And if you’re listening and you’re like, that sounds a little easy and a little glib. And actually I’m a bit anxious because how am I providing value in this conversation? I’m just kind of reading off a script. Well, the thing is, it’ll milk the other person’s brain as they suddenly go, oh my God, this is the real challenge. And that, if you’re a consultant or a creative and you help your client figure out what the real challenge is, that is a moment of real value to them. You know, when I started using that question, it took a long time to get used to the long silence. It’s like you had not like coming in and saying something and they’re just like, you have to watch them and their brain tick. It could be a long time. By a long time, that’s often like two and a half seconds. It feels like a long time because you’re in this moment of ambiguity and powerlessness. That’s kind of the underlined dynamic, doesn’t get talked about much. But when you go, what’s the real challenge here for you? And that person is like, oh, wow. And there’s that pause. You’re on the other side of the table going, oh, is that a good question? Did it land? What are they thinking? What are they going to come up with? How am I going to react? I’ve got nothing to do now other than just stop and wait and listen to the answer. So it’s an act, you’ve given them power. It’s an act of powerlessness for you. But an ability to sit with that silence and allow that person to do the thinking is incredibly powerful. And if people actually want to hear an example of this, some years ago, maybe, I’m not sure now, like three years, two, three, four years ago, I was on Brené Brown’s podcast and I coached Brené at about the 45 minute mark. Wasn’t expecting it. She didn’t warn me. He didn’t tell me I was gonna coach her. She goes, okay, Michael, so coach me. It’s 5 a.m. I’m in my 14 year old bedroom as a kid, this is where I grew up in Canberra. The video has failed so I can’t see her and her team in Texas. I’m like, okay, don’t screw this up, Michael. This is Brené Brown, you know, there’s a bazillion people going to listen to this podcast. But you hear me asking questions and you hear the silence that is there as Brené is processing the question. What you can’t hear is me in my bedroom in Australia panicking because I’m like, do we have connection? Has the thing got cut? But I have just enough experience to kind of hold the line, keep silent, keep the space for her. And you can feel the, I think the power of that conversation. And partly it’s driven by my ability to ask a question and then just shut up and wait for the answer to show up. To follow up on that, so, you know, there’s a balance, right, between being curious, but being in like, you know, having some authority. So how do you balance that, especially like in a paid consulting role, when should we coach and when should we just like give them the advice? Yeah. So it depends, and it’s a really hard question to ask, but as a bet, at the moment, people are giving too much advice, too much content, and they’d be better off asking some better questions. So part of what I want to do when I’m in a relation, a thing like that, like Jacob, if you come to me and go, Michael, how do I? It’s a great lead in this. How do I? I’m like, it could be more explicit what you want from me. It’s not a question, you want a solution. And my advice monster, the lizard brain is just going, just tell the man, you know a whole bunch of stuff, just tell him, this is how you prove that you’re smarter than him and wiser than him, and you’re still adding value even though you’re getting old. Everybody wants this, tell it to him. And I just know because I’ve been banging on about it now for years, which is like, you know what? There’s a place for advice and I’m just trying to slow down the rush to action and advice. So Jacob, if you came to me and said, Michael, how do I? I go, look, Jacob, I have some ideas around how to do that thing for sure. But let me just check with you first. When you say that, what is the real challenge here for you? And now suddenly I’ve just gone, okay, I’ve kind of received that and I’ve flipped it back into a question. Or I might go, okay, if that’s the real challenge, Jacob, and I’ve got some good ideas about that, I think you’re going to like them. But just so I know, what ideas do you already have around how to tackle that? Because I’m guessing you’ve already done some thinking about that. And you go, well, yeah, what about this? I like that. What else could you do? And you go, okay, how about this? I’m like, yeah, that’s great as well. What else? What else could you do here? And one of the principles about being more coach-like, and it’s one that people struggle with, creatives in particular, because I’m used to delivering the work, is to be lazy. You know, my three principles around coaching are be lazy, be curious, be often. Be lazy, stop doing all the work, allow a place for the other person to do the work, be curious, tame your advice monster, ask some questions, and be often. Realize that every interaction, in person, over Slack, text, phone, you can all email, you can always be, all of those are places where you can be curious a little bit longer. I’m curious to know how that answer lands for you. It was amazing. I love hearing the example of how you go through the process and you could flip it back, flip the script and put it back on them. So that kind of leads me into like Brené Brown, how did that conversation end up? Did you flip the script on her? Well, I was, she asked me to coach her and I went, sure, so what’s on your mind Brené? You know, and it’s like what people will notice if they hear examples of me coaching and if they’ve read The Coaching Habit book is, I really do just stick to some of the questions. There are only seven questions in The Coaching Habit book. And I mostly stick to those questions because people show up indicating that they want an answer, but there’s a deeper need or want that people have is to be seen and to be heard and to be encouraged and to be given the responsibility that they’re capable of. And so, Sean, there is a there is look, I’m not saying advice is bad and there are times where advice is the thing to do. Like, Matt, if you’re coming to me going, I’ve accidentally set the house on fire. What should I be doing? I’m not going to be going, well, I don’t know how you feel about smoke, Matt. What’s the real challenge? I’m not going, listen, follow me, we’re going to exit stage left. I’m a pyromaniac, that’s the real challenge here. And that is the challenge, that’s the challenge for everybody. No, I was just going to say, yeah, I think it’s super smart because the other thing that I think about it is that I always say to folks, look, at least in my role as a consultant, it doesn’t mean that I actually always have the answers. Like, you are hiring me to help you get to the bottom of it, but you’ve got an amazing team, you’re amazing, you know this industry, this brand way better than I ever will because you built it, right? You’ve been living and breathing this. What I can do, though, is breathe a breath of fresh air in, I can talk to the right people, I can be curious, and we can get to a solution together. Now, that’s a better, in my view, approach, because a lot of consultants, I think, frankly, and perhaps I can be like this as well, can be a little bit arrogant, like, I’ve got the answers to your particular issue in your particular context. But as you rightly say, like, that’s a really foolish way, I think, of actually conducting oneself. If you ask questions, there’s a whole myriad of things that you can learn as well. Like, you were saying, like, what other ideas have you been considering to solve your problem? Now, that can save a heap of time, because, you know, you might have had one of those ideas and we’re going to present it, and, you know, the client will be sat there thinking, well, I’ve already thought about this. We tried this three weeks ago and it failed miserably. So it’s wise to be curious and it’s wise to hold back, I think, and ask some of these questions that you’re recommending. There’s a way that your accumulated wisdom feeds into your ability to ask a question and also to understand the answer that they give you. I just think it’s a mistake to say the way that you prove your authority is by having the answer, because the faster you are to have the answer, the more likely you are to be wrong. Now it’s a challenge because a lot of the time people are like, look, I don’t want a question, I don’t want a conversation, I just want the answer. And there’s that paradox that when you see an expert on TV, the more certain they are, the more people like them and the more likely they are to be wrong. There’s just a ton of statistics around that, which is like, you know, because they’re an expert on TV, nobody holds them accountable in six months’ time. They go, well, you know how you said, and in fact, this happened. So when somebody shows up and is being very clear, let me be absolutely clear, our lizard brain loves certainty. So when somebody is being really clear and really directive and really authoritative, our brain goes, oh, this is excellent. They’ve got it. I don’t even know what we’re talking about directly, but they’ve got it and I can relax a bit about this because I feel safe. And the brains, the lizard brain is all about going, my job is to keep you safe because the longer you live, the more likely you are to have kids and the more likely you have kids, the more my DNA passes on. So it’s a brain replication strategy, which is to keep you alive as long as possible. And keeping you safe is a key part of that. And the clearer you feel about things, the safer you feel. So part of what you have to do as you ask a good question is you’re also trying to make it feel safe while doing something that feels a little unsafe for both of you, which is to ask a question. Of that, put people at ease in any way you can when you’re asking these probing questions. Right. I have a quick question because obviously we’re talking here about coaching a lot and kind of one-to-one conversations. And I just wondered in terms of just a sort of a, you know, a curveball question, what are your thoughts on sort of group dynamics? You know, I do a lot of work and I’m sure a lot of listeners do a lot of work with, say, leadership teams or groups of teams. And obviously, sometimes you need to listen to lots of perspectives in order to come to understand a problem truly. So I wondered what your thoughts were on group coaching, if you like. Do you ever do one-to-many, for example? Do you ever advise that? And, you know, what are your thoughts around that sort of dynamic? Yeah, look, if you buy into this idea that being more coach-like is staying curious longer, then every situation can lend itself to questions. And then you’re going kind of at a at a facilitative or logistical level. How am I going to make that work? Because, for instance, if you show up into a room and there’s 12 people on a team, and you go, okay, so I hear this team’s a bit dysfunctional, what’s the challenge here? What you’re going to get is a very awkward silence from 12 people who are kind of looking at the floor and deliberately not looking at that person over there. So there’s a way to manage that in a way that can be really powerful. You know, people don’t feel safe in sharing an answer in a large group, for the most part, unless a bunch of trust and safety has been developed. So what you do, perhaps, or one thing you could do is you get pair people up, and you’re like, we’re going to pair you up or put you in threes. And we’re like, what’s the thing that we want to do more of or do less of, or whatever in this team and then find a way to come back and share it. So people will be getting my message by now, which is like almost everything is improved by staying curious a little bit longer. Because it sets you up for success when you’re actually giving guidance and advice and specificity and you can definitely do it for teams or large groups. If you’re building a brand and want to do it right, this is for you. Join the Brand Builders Alliance for expert coaching, live master classes and a crew of brand builders who’ve got your back. Get on the waitlist now at joinbba.com. Now back to the show. So Michael, you talk about The Advice Trap, right? You’ve written a whole book on it about how you tame the advice monster. I know we’re kind of circled around this idea a bit, but is there any rituals or go-to techniques you could share with our audience to just be comfortable with that silence and being curious? How do you actually implement that in a practical way? The first thing to do is just it’s really great to start noticing how much you want to give advice because most of us don’t even realize just how relentlessly we leap to the answer and we think that that’s what the other person is asking for. So there’s just a self-awareness going, how keen am I to interrupt and come in with the answer? How much do I think that this conversation is about them coming to me for an answer? There’s statistics that say a general practitioner, a doctor on average interrupts their patient within the first 17 seconds of a conversation with them. And I’ve always felt that was a bit unfair for doctors, because I’m like, I’m pretty sure that’s everybody. Everybody’s like, oh, let me be helpful for you. But it is surprising how many situations don’t have somebody going, what I’m hoping for here is your advice. Mostly they want your encouragement, your questions, your presence, being seen, being heard, being helped. And you can do that with questions and thank you as longer. But for me, part of the taming advice monster is just notice that. Second thing is to go. The goal is not to become comfortable with silence, although that’s a bonus if you can get there. All you have to do is be less uncomfortable with it than the other person. Because when you ask a question and there’s this heartbeat, and another heartbeat, and you’re like, oh my god, this is a terrible question, what am I doing? And about a second and a half has transpired. Either they’re feeling the same as you, which is like, oh my god, this is awkward, and they will crack first. Or else, they’re going, they’re sometimes labeled introverts, and they’re going, this is great, because I actually need a heartbeat or three just to get my answer together in my head before I can articulate it. I mean, there’s lots of different definitions for introverts and extroverts, but one of the definitions talks about how people process information. If you’re an extrovert like me on this scale, the way I process information is I start talking. So when I go, look, Jacob, there are three things you need to know here. I don’t yet know what those three things are. I’m about to discover them myself. I hope they’re interesting. But I’ve just got to set myself up and go, I’m going to start talking, I’m going to find out this answer along with you. If you’re introverted, you’re like, one, two, okay, I’ve got my three things. All right, here we go. And so if you’re wired like that, it is a great gift to be given just two seconds of silence to get my thoughts in one before I actually get to start talking. And then for me, I think there’s something about, well, what’s the habit you want to build that can kind of help you manage your advice monster? And it’s really useful just to have a go to question that can help with that. And people have already heard the question I want to recommend, which is, and what else? Because when you’re sitting there and you’ve asked a question and they say something and you’re like, oh man, I’ve got so I’ve got things to say to that. Oh, here we go. Because you’ve been seduced into thinking that their first answer is their actual answer, and it’s only their first answer. But if you just go to default going, after their first answer, regardless of what’s going on in my head, I go, and what else? What else are you thinking here? What else is the challenge here? What other ideas do you have? That’s a way that you stay curious longer, tame your advice monster and allow people to get a little deeper into the conversation. Brilliant. Thank you. Matt, did you have any follow-up questions? No, really, I think that was really fantastic here. I think you’re absolutely right. I’m probably the worst though, I would say, and Jake will testify to this, of jumping in. So on paper, I completely agree with everything you’ve said. Let me interrupt for a moment. Interrupt me? Come on, let’s go. Because there are times when you do want to interrupt, because sometimes you ask a question and the person starts monologuing. You’re like, oh my God, this is my life ticking away and I don’t even know what this person’s saying. I’m trying to be polite and encouraging and doing the active listening thing. But part of you is going, what is this about? So interrupting can be absolutely appropriate. What I just tried to role model, which is, hey Matt, let me interrupt. That’s the way I interrupt. Because the best way to interrupt somebody is not with a question, but with the statement or the signaling that you are currently interrupting them. So, hey Matt, let me hold you there for a moment. Matt, let me just stop you. Matt, let me interrupt. Matt, I’m just going to jump in here. Matt, sorry to break the flow of your thoughts here, but what I’ve done is I just told you what’s happening. So, you go, oh okay, right, Mike was interrupting me. This doesn’t feel rude. It feels like part of the process. And then I’ll go, this is all very interesting, but you know, what’s the real challenge here for you in this? So, there are times we’re interrupting to focus the conversation can be really powerful. And I say that to deal with a bigger issue that kind of lives in this world, which is people are anxious about coaching because they’re like, I don’t have time for this. I am busy, I’ve got responsibilities, I’ve got projects I’m working on, client conversations I need to be part of. If I’m starting to coach everybody, like I’m already working a 60-hour week, suddenly it’s going to be a 90-hour week because now I have to ask questions on kind of, who has time for this? And my take on that is, first of all, coaching shouldn’t be seen as an add-on to what you’re currently doing. It should be a way of transforming what you currently do to be more coach-like. Secondly, I think that a typical coaching conversation should take less than 10 minutes. And that means you have to get into the real stuff as fast as possible. A lot of flabby coaching just takes too long to get anywhere that’s interested because the person is so busy actively listening, that they don’t realize that we’re not talking about anything interesting at the moment. They’re giving a whole lot of background that I don’t actually need. So you know when somebody starts talking and I’m like, okay, we’re kind of… You’re filling in all the background and I actually don’t need any background because I’m not trying to solve your problem. I’m trying to help you solve your problem and you already have all your background. So I will interrupt regularly, but I’ll interrupt regularly to ask a question. So what if they don’t know their real challenge? How do you help or guide them then? Well, I get as close as we can. I will go, so what do you think the real challenge here for you is? I’m like, yeah, yeah, I don’t know. I’ll go, yeah, that’s hard. If you had to take a guess, what do you think your real challenge might be? And that kind of, so just take a guess, takes the pressure off. It’s feeling like, oh, I get it right or I die, but I don’t know what my real challenge is. I fail. You’re like, yeah, yeah, it’s hard. I get that. But if you had to take a guess, because I think you’re getting close to it, what’s your best guess at what the real challenge is? And there’s a way you can build up experience over time going, oh, it feels like we’ve landed somewhere really interesting here. Or sometimes you go, okay, that sounds like it might be it. And then you get into a conversation, and you realize it just doesn’t feel really that urgent or that important. And then you can say that, you’re like, we could keep digging into this, but it feels a bit academic, and almost a little boring. So let me check, is this the real challenge, or is there another challenge that’s lurking here? And they’re like, yeah, I thought that was the real challenge, but I don’t think it is anymore. So let’s get back into figuring out what the real challenge is. Because if you can do one thing as a creative, as a project manager, as a coach, as a consultant, if you can just help your clients figure out what the real challenge is that they’re facing, that makes you one of the most valuable people they know. Because they are surrounded by people trying to sell them advice, and they have very few people helping them figure out what the real challenge is, which is actually what it means to be strategic. Yeah, 100%. I’m glad we’re getting to strategy. I’m going to touch on that in a minute, but you know, it just occurred to me as we go through, like, if you think it through, like, if they don’t actually know what the challenge is, okay, that can be of value to them in itself, if you’ve drilled down and drilled down, and they’re facing it, and they think, flip, actually, I don’t really know. So sometimes if that happens to me, well, I was going to ask you actually, I wonder, would you ever encourage them to, or ask them, say for example, like, what could you do to better understand it then? You know, if you don’t understand it, what could you do? Because that again is sparking ideas. It’s getting them to think through, okay, don’t get this, but maybe we could try this, or maybe I could ask these questions, or go to that person, or, you know, even that is a value, right? Absolutely. I like where you’re going with this. I mean, like, if they’re like, I just can’t figure out what my real challenge is. I’m like, okay, so what if we come up with a short list? What do you think your short list of three might be? What if I give you 24 hours, and your goal is just to sit with it for 24 hours and see what percolates up, and we’ll check back in 24 hours? What if you and your consulting partner go out for dinner tonight, have a glass of wine and just chew this over and kind of get into the conversation? You just have to keep asking yourselves, what’s the real challenge here for you? You know, people don’t always get there in the moment, but you can plant a seed or get a wheel spinning or whatever metaphor you want. Go, let me come back to you on this and we’ll get into this tomorrow. Or like go for a walk around the block and I’ll meet you in the coffee shop in half an hour. You got 30 minutes just to sit with this and just try and, you know, there’s a Latin phrase, solvator, ambulato, everything is solved by walking. So just go for a walk and see what shows up. I love these practical tips and I’m curious if there are any other common roadblocks you come across like, you know, is there a real challenge? Is there anything else that often comes up that you need to solve? Well, the challenge that’s connected to this is just the messiness of interacting with other members of the human species. Because, you know, people are complicated, difficult, irrational, fear-based, misguided, don’t understand themselves as well as they might, you know, and this is me I’m talking about. I mean, it’s true for everybody else as well, which is like people are messy, irrational beings. So, you know, it’s one thing to help people figure out what the real challenge is. Then part of the art is like, what does that mean for you? And what are you up for? And what might you do differently? Because for me, coaching, you know, staying curious a little bit longer, the goal, what you’re trying to trigger in another person is a new insight about themselves and all the situation, but typically both. This is my insight about me in this moment. And then an act to shift that, so something’s different. Because, you know, the point of coaching is to change something. If it’s just a chat and nothing changes, it hasn’t been that helpful as coaching. Well, I think that’s a good segue into your next book, Working With Almost Anyone. Yeah. So you talk about like the best possible relationships. So what does that mean and why is that important? So the starting point for this book is going, look, your working relationships determine the quality of your happiness and success to an inordinate degree. And, you know, people listening to this can just, you know, you can figure this out yourself. Think of a crappy client you had and just how that stained the experience or a terrible boss that you had and how miserable that was. You know, it doesn’t really matter the work you’re doing. If you have a terrible client, it’s a bit of a crappy experience. And likewise, if you’re working with a brilliant client or a brilliant colleague or a brilliant boss, it doesn’t really matter the work you’re doing. It can be fantastic. You’re like, I didn’t even enjoy this work, but man, we had a good time. And most of us don’t do that much to actively shape the working relationships that we have. We just hope, cross our fingers, pray to the gods, roll the dice. And so I want people to rise to that challenge and more actively try and shape the key relationships they have at work so that they’re happier and they’re more successful. And the goal is a BPR, Best Possible Relationship. So a goal that is safe and vital and repairable. So safe meaning psychological safety, you know, we feel like we can talk about the hard things, talk about what’s not working, bring my whole self to the conversation. But not just safe, because that’s a, you know, just safe is actually a bit boring. So also vital, vital is like psychological bravery. You know, how do you push, how do you challenge, how do you step into ambiguity together? And then the third element is repairable, because every working relationship goes off the rails a little bit at some stage or another. And repairable means we get to fix it. And the relationships that get fixed are the relationships that thrive and the relationships that survive. So that’s the goal. How do you build a BPR? All right. Well, let’s get into some practical things we can use with these relationships. When there’s a tension or misalignment, how do we actually, I guess, repair them? Yeah. So the key suggestion I’ve got for in how to work with almost anyone is to set your relationship up. So it has the best chance of navigating these tough times by having a conversation about how should we work together before we start working together. So let me make this up about you and Matt. So you guys, you’re like, let’s do this podcast together. And Matt’s like, yeah, let’s do this podcast together. And Jacob’s like, yeah, let’s do this podcast together. That’s basically how it is, by the way. That basically is what happened. And you’re both creative. So you’re like, we could be creative. And you’re like, yeah, we could be creative. It’s going to be cool. And so all the excitement is about the podcast. All of the excitement is about the work. And you’re into it and you’re like, yeah, have you got a microphone? I’ve got a microphone. What if we had this kind of matching background? I’ve got a matching background. Do I need to shave my beard off? You do need to shave your beard off. I’m not going to shave my beard off. Never going to happen. So when you start working with somebody, you just get into, okay, who will we get as guests? And how often will we do it? Is it once a week, once every two weeks? What will we call it? Why are we going to do it in black and white? Why are we going to do it in black and white? Because it’s cool. You know, we’re kind of all this stuff around kind of the design and experience and who do we want to listen to this and how will I find out about it? But you haven’t done any conversation about, hey, how are you and I going to be awesome together around this? And there’s a conversation to be had, which is like, hey, look, Matt, when you’ve collaborated with somebody and you’ve co-created something together and it’s worked really well, what happened? What did they do that made it work so well? What did I do that made it work so well? And then Jacob can answer the same question. It’s like when I’ve done something and I’ve co-created something and it’s been an amazing experience, here’s what happened. Here’s what made it amazing. And you can say, look, when you’ve tried to collaborate with somebody and it’s sucked or just been mediocre, what happened? What made it go off the rails? Why wasn’t it successful? Where was it disappointing? How did you contribute to that? How did they contribute to that? And now you’re getting into a conversation about what will it take for us to work together so that we have every chance of bringing up best-served selves to the work and not our worst selves to the work. But not many people do that because it’s like, that’s cool, podcast together. We didn’t do that, did we, Jacob? And thinking about it, like, I mean, we basically modeled our way through and we felt like we’re now, this is like our sixth season. So, you know, we’ve been doing this for some years. And I guess it was kind of pretty much fluke, Jacob, because we have a very similar work ethic and a similar approach and we know our roles in the podcast. And we understand that we have different personalities and skill sets that kind of complement one another. So, but we kind of didn’t know that beforehand. We kind of stumbled into it. So I think that would be great advice for any working relationship. We’re going to be interested, which is like, so Matt, when things go wrong and you’re in conflict with somebody, what do you do? I mean, how do you show up under stress? What’s your unilateral action, which is like you being pissed off? Are you a fighter? Do you flight? Do you faint and pretend you’re dead? Do you fall and kind of suck up? Here is the 4F response. What will we do when we’re annoyed with each other? How will we process that? Because here’s my guess. You’re in your sixth season, so you muddle along and you’re doing fine. But my guess is being moments for each of you where you’ve gone, I’m a bit bummed by what happened or that wasn’t as good, or I carried that interview and Matt was a waste of time. Was annoying everybody. And or vice versa. That’s pretty much every episode, Michael. But you’re like, I mean, as an example, let’s assume one of you is feeling it’s unbalanced, I’m carrying a bit too much of the load. Do you know how to have that conversation? Have you talked about it? How would you bring it up? And you might muddle your way through it. Like, you know, finally, somebody goes like, let’s just get clear the air here and get this sorted out. But if you’ve had a conversation upfront going, when it goes a bit wonky, how will we deal with that? Just makes that process a whole lot easier. Yeah, I think getting those questions you’ve said are brilliant. I mean, just for me and Jacob, like, we’re quite open and frank, but again, I didn’t know that before. And so, you know, if Jacob’s not happy about something, I’m pretty sure he would definitely be quite direct and tell me about it, which I can’t appreciate and vice versa. But, you know, it’s tricky, isn’t it? It is tricky. And I think because, as you say, people process conflict very differently. And if they don’t feel, going back to your point before, psychologically safe, then, you know, they’re going to show up in ways that are very difficult and can be very disruptive and even toxic, I suppose, in certain team situations. Whereas if you’ve had those conversations and everybody understands where they stand, I think that’s a really positive thing. So, you know, super, super smart. In this book, there are five questions to say, look, if you want to build a BPR, have a keystone conversation, a conversation about how you work together before you get into the work itself. And there are five questions. We’ve talked about one, which is the repair question, number five, actually, which is like, how will we fix it when things go wrong? But the other good question is that the first question is like, so what’s your best? Like, what does it look like when you’re at your best? When do you shine and when do you flow? Because if you come together and you’re like, I love leading the conversation, I’m less good at the kind of the production of it. It just doesn’t excite me. And one of you guys, I love the production. I love being the number two interviewer, but really I shine when it comes to the production and putting in the soundscape and kind of doing the editing. You know, oh, that’s great because, you know, I’d made up a whole bunch of stuff about you and you’d made up a whole bunch of stuff about me. And now you can actually explain, look, there’s stuff I can do, but the stuff that I’m good at and fulfilled by, that’s this sweet spot. And that’s what I want to be working on in that. It’s really interesting you say that because Matt and I, we both have very different dynamics and personalities. Like Matt’s on the stage is doing talks and he, you know, very out there, whereas I’m much more reserved, I like being behind the screen, I like, you know, working on by myself. And I have done that many years and it’s just a very good complimentary team. But we didn’t have a Keystone conversation to begin with. We just like, we should do, maybe we should have one now. Well, now we’ve been coached by Michael at MBS. We’ll have to have that conversation offline. Love that. I mean, there’s a very, very domestic example. It was like 20 years into my marriage before my wife and I discovered that I don’t mind vacuuming. She hates vacuuming. I hate mopping stuff. She doesn’t mind mopping stuff. And I’m like… Brilliant. How has it taken us 20 years to figure out that we’re both doing the thing that we don’t like doing and another person would be absolutely fine with doing that? Yeah, in the context of podcasting, because we’re talking about that, we found what we did like and didn’t like in terms of, you know, editing and everything, we ended up outsourcing the editing. We have an amazing editor. We both do planning, production side, I do, Matt does a lot of the promo stuff. So it’s a good dynamic that just seemed to work out. I think what you’re talking about, Michael, particularly in teams, and this is just for my anecdotally from past experience, but I think it is pretty universal kind of law of nature that high performing teams, it’s very, everybody understands the strengths and weaknesses possibly that all the component parts of that team have. So to have that conversation off the outset, and obviously our listeners, we’ve got a wide listenership, and I guess if you’re interviewing people for a role in your company or whatever it might be, having that understanding of this is this person at their best, this is what, you know, when things are going to go wrong for them, and having that conversation early is so great. I love the idea of the BPR. So I’m definitely checking that out a little bit more. What often happens in teams is there’s an awareness of presumed strengths and weaknesses, because everyone is very quick to kind of go, oh yeah, they’re good at this, they’re not so good at that. And they’ll be probably 80% right, but only 80% right, so 20% wrong. And not least, because for lots of people, they’re okay at stuff that they don’t actually want to do. Like I’m now old enough that I’m like, I can do a bunch of things, and I never want to do them ever again in my life, because I’m done with them, I’m on to other things. And I want to be able to tell you, here’s the stuff that I’m actually not yet good at, but I want to get good at. So I want to take it on, I just need to have a safety net and coaching and training and guardrails and stuff like that to allow me to actually learn and grow there. Amazing. Thank you. Thank you, Michael. We’re going to jump into some rapid fire wisdom, if you’re up for it. Sure. Well, rapid fire, I can do. Wisdom, we’ll see. We need to have a little jingle here, Jacob. Like, we should do this with some of our guests now. Like, rapid fire. Carry on. We’ll get someone to look into that. Marco, our editor, can look into that at some point. Go for it, Jacob. I’m excited. What are we going to ask him? What’s one coaching question everyone listening should start using today? I’d pick any question you feel that you can ask on a regular basis. So the ones that seem to be most popular, that people can most quickly add in to their life repertoire. The one’s the opening question, the kickstart question, which is what’s on your mind. It’s a really nice way just to kind of like throw the spotlight on to them and give them a chance to talk right away. So that can be helpful. It could be, and what else? That can be a really helpful one. I mean, that’s probably the one I’d guess, which would be the place to start. But it also might be the learning question. And this is really helpful if you interact with other human beings. At the end of every interaction, you go, so what was most helpful or most useful in this conversation for you? It’s a genuine place to be curious because then your client will tell you what they found most useful, or your teammate will tell you what they found most useful, or if I ask this podcast audience, so write to these guys, email them and tell them what was most useful or most valuable for you from this whole podcast. Not only is that helpful feedback for Matt and Jacob, but actually in you doing that, dear audience person, you’re actually helping kind of re-fire the brain neurons and you’re going to remember what was most useful or most valuable. So it’s a service to you as well, which is to embed the wisdom. Love that. Definitely do that, folks. Okay. Quick fire question number two, right? Curveball question. I love doing this. What would the worst coaching question be that you’ve ever come across? Well, there’s a lot of competition for that. Are you kidding me? One possibility. You know, it feels like there’s just a tie for a tie for last place. Because what typically happens with coaching questions is either work or they don’t work. And what’s lovely about asking a question is that when it doesn’t work, for the most part, nobody dies. It’s not a disaster. Everybody can get over it. You can just go, that question didn’t land. Let me ask you another question and maybe this will be more helpful. But you know, typically, I will say, I mostly avoid, in most of the context, closed questions. So questions that are coming with a yes or a no answer. Mostly avoiding why questions. Because when I go, well, why did you do that? It’s very hard for that not to be heard as, why the hell did you do that? So it can sound kind of accusatory. And I am often avoiding how questions, how will you do that? How can we get that done? Because that’s, those are often action based questions. And I only want to move to action based questions when I figure out what the real challenge is and what the best idea might be. So when you hear me ask questions, you’ll notice that almost all of them start with what. All right. Next question is also a what. So what’s the best piece of advice you’ve never given? Oh, I’ve heard, there’s been like probably lots of advice I haven’t given. I’ve also got the memory of a goldfish, so I’ve forgotten most of it. You know, all that advice is like, yeah, you should buy that stock. You know, that person would have been a gazillionaire by now. Or you should get into Bitcoin around about now. All that would have probably been good advice. It’s a tough question. What people talk to me about when they reflect back on what’s been helpful, is rarely advice and rarely the question I ask. It’s more a general sense of encouragement. The language I use to the spirit I want to bring to people I’m coaching or being more coach like with is fierce love. So love meaning I want the very best for you. I see the brilliant person you are and I want the very best for you. And fierceness meaning I’m not going to compromise how I show up to get in the way of that. Because I will often avoid a difficult question or avoid saying the thing that’s occurred to me because I’m like, I don’t want to hurt their feelings or I don’t want to kind of be provocative or I don’t want to do this. And I’ll kind of play small. I’ll tell myself that I’m helping them, but really I’m just protecting me. So the thing that is most valued tends to be this kind of a sense of fierce love coming from me. All right, last question. What would be one underrated book or tool that changed how you personally kind of coach or lead? Well, I’ll give you one of each. There’s a book by Bill Bryson, who is an American writer, travel writer, but he wrote a book called A Short History of Nearly Everything, which is a wonderful book about science. He’s like, science gets murdered for most people in high school. We go through high school and we’re like, I never want to talk about physics or chemistry ever again, because honestly, that was traumatic. He just brings this world to life with these amazing characters and these amazing stories. But really, he brings to life just how amazing the world is. It’s just how unlikely it is to have life on this planet, and to be alive at this moment of life. Because the planet has been around for several billion years, and it’s been in the last tiny, tiny, tiny part of it that human beings have been around. I mean, if you stretch your arms wide, and that your arm span represented the age of the Earth, humans have been around for less than a fingernail clipping of that span. So the fact that we’re having a podcast conversation is, you know, a remarkable coincidence. And for me, a good deal of what I’m brought to is like trying to remember how lucky I am to be alive in this world, and trying to bring that to the people I interact with. And I’d say that book has been helpful for that. And then the tool that I find most adaptable and useful is a consultant’s two by two matrix. So imagine a square and a cross in the middle of it, and then you’ve got two axes, plus, minus on either axis. So you have, you know, top right hand square is plus plus, bottom left hand square is minus minus, and then you’ve got two plus minus combinations. And that’s a really useful tool for teasing apart the tension in two choices. I talked about one of them a bit earlier on, when talking about the question, what’s your best? You know, the tension between what I am good at and what I am fulfilled by. You can imagine that on that matrix. So you’ve got something in the top right hand corner, which is the stuff I am good at and fulfilled by. Like do more of that. Bottom left hand corner, the stuff that you are neither fulfilled by or good at. Stop doing that because that’s just terrible for everybody. And then the stuff on the other thing, one is you are good at it but not fulfilled by, and one you are fulfilled by but not yet good at it. And those are really helpful things to communicate to people because most people don’t know that about you. And that box can be used in all sorts of different things. Like I was with somebody today and she was talking about her business. I was like, what’s the stuff you do that you love, plus minus? What’s the stuff that brings you money, plus minus? So stuff that you love and brings you money, how do you double down on that? The stuff that you love but doesn’t bring you money? Some questions come up for that. The stuff that brings you money but you don’t love? Questions come up from that as well. So that 2×2 matrix and then teasing apart choices can be really powerful. Thank you for sharing that. All right, it’s come to time just to wrap up. Where can people connect with you to go deeper with your work and so forth? Yeah, the kind of umbrella website is mbs.works, W-O-R-K-S, mbs.works. And if you’re particularly interested in The Coaching Habit, you can go to thecoachinghabit.com and there’s videos and downloads and other, all sorts of free stuff that you can pillage if you’re into that sort of stuff. Thank you. I highly recommend checking out all of those books, but especially The Coaching Habit, that was a game changer. We’ve talked about it a lot on here. There’s seven questions. They’re locked in my mind, but it goes into much more detail in the book and online as well. So definitely check that out. Final question, if you had one message for brand builders, trying to grow without burning out, what would it be? I picked one of the questions from The Coaching Habit book, the strategy question. And the strategy question is, what am I saying yes to? If I’m going to say yes to that, what must I say no to? And it is a hard question, but if burning out is the thing that you’re looking to overcome, getting more fierce with the things you’re truly committed to, and doing fewer of them, and getting fiercer to the things you say no to is some way towards that. Thank you. Thank you so much, Michael. It has been a pleasure. Absolute pleasure. So much wisdom advice in here. As much as you don’t want to call it advice, it’s been very, very helpful. Oh, I’m all up for advice. I’m just trying not to get the default response of advice. Okay. You’ve been awesome, Michael. Thank you for coming on the show. Yeah, my pleasure. Thanks, Matt. Thanks, Jacob.",
  "image": "https://justcreative.com/wp-content/uploads/2025/05/michael-bungay-stanier-32.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ftwp-postcontent\"\u003e\u003cp\u003eIn this episode of JUST Branding, we sit down with \u003ca href=\"https://www.linkedin.com/in/michaelbungaystanier?original_referer=https%3A%2F%2Fwww.google.com%2F\" data-lasso-id=\"841897\" rel=\"noopener\"\u003eMichael Bungay Stanier (MBS)\u003c/a\u003e, the best-selling author of \u003ca href=\"http://justc.co/r7sz9F\" target=\"_blank\" rel=\"nofollow sponsored noopener\" data-lasso-id=\"842001\"\u003e\u003cstrong\u003eThe Coaching Habit\u003c/strong\u003e\u003c/a\u003e, The Advice Trap, and How to Work with (Almost) Anyone, to explore how coaching can become your secret weapon in branding and business.\u003c/p\u003e\n\u003cp\u003eIf you’re a creative shifting into strategy, leading workshops, or simply trying to manage client relationships without losing your mind, this one’s for you.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://justcreative.com/go/adobetop/\" target=\"_blank\" rel=\"nofollow noopener sponsored\" data-schema-attribute=\"\"\u003e\u003cimg width=\"1201\" height=\"376\" decoding=\"async\" src=\"https://justcreative.com/wp-content/uploads/2021/10/adobe-discount-65.png.webp\" alt=\"Adobe Creative Cloud Discount\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%201201%20376\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://justcreative.com/wp-content/uploads/2021/10/adobe-discount-65.png.webp\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWe unpack:\u003c/strong\u003e\u003cbr/\u003e\n• Why giving advice too fast can derail your projects (and burn you out)\u003cbr/\u003e\n• How to stay curious longer and ask smarter questions that unlock clarity\u003cbr/\u003e\n• The difference between mentoring, coaching, and consulting—and when to use each\u003cbr/\u003e\n• How to use coaching to move from freelancer to trusted advisor\u003cbr/\u003e\n• Practical tools from MBS’s “7 Essential Coaching Questions” to use in brand strategy sessions\u003cbr/\u003e\n• What to do when client relationships get tricky—and how to build ones that actually work\u003c/p\u003e\n\u003cp\u003eMBS drops wisdom with warmth and wit, showing how brand builders can level up their impact, not by saying more, but by listening better.\u003c/p\u003e\n\u003ch3 id=\"ftoc-listen-here\"\u003e\u003cstrong\u003eListen Here\u003c/strong\u003e\u003c/h3\u003e\n\n\u003cp\u003eLove the show? \u003ca href=\"https://podcasts.apple.com/us/podcast/just-branding/id1507943911\" target=\"_blank\" rel=\"nofollow noopener\" data-lasso-id=\"841899\"\u003ePlease review us on Apple\u003c/a\u003e.\u003c/p\u003e\n\n\u003ch3 id=\"ftoc-play-now\"\u003e\u003cstrong\u003ePlay Now\u003c/strong\u003e\u003c/h3\u003e\n\n\n\u003ch3 id=\"ftoc-watch-on-youtube\"\u003e\u003cstrong\u003eWatch on YouTube\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003ch2 id=\"ftoc-learn-brand-strategy\"\u003e\u003cstrong\u003eLearn Brand Strategy\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://justcreative.com/go/bmspodcast/\" data-lasso-id=\"841900\" rel=\"noopener sponsored\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://justcreative.com/wp-content/uploads/2019/12/best-brand-strategy-course-online.png\" alt=\"Best Brand Strategy Course Online\" width=\"1000\" height=\"563\" data-wp-editing=\"1\" srcset=\"https://justcreative.com/wp-content/uploads/2019/12/best-brand-strategy-course-online.png 1000w, https://justcreative.com/wp-content/uploads/2019/12/best-brand-strategy-course-online-600x338.png 600w, https://justcreative.com/wp-content/uploads/2019/12/best-brand-strategy-course-online-768x432.png 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%201000%20563\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://justcreative.com/wp-content/uploads/2019/12/best-brand-strategy-course-online.png 1000w, https://justcreative.com/wp-content/uploads/2019/12/best-brand-strategy-course-online-600x338.png 600w, https://justcreative.com/wp-content/uploads/2019/12/best-brand-strategy-course-online-768x432.png 768w\" data-lazy-src=\"https://justcreative.com/wp-content/uploads/2019/12/best-brand-strategy-course-online.png\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca title=\"bmsbestcourse\" href=\"https://justcreative.com/go/bmspodcast/\" target=\"_blank\" rel=\"nofollow noopener sponsored\" data-cke-saved-href=\"https://justcreative.com/go/brandmastersecrets\" data-linkid=\"54389\" data-nojs=\"false\" data-lasso-id=\"841901\"\u003e\u003cstrong\u003eBrand Master Secrets\u003c/strong\u003e\u003c/a\u003e helps you become a brand strategist and earn specialist fees. And in my opinion, this is the most comprehensive brand strategy course on the market.\u003c/p\u003e\n\u003cp\u003eThe course gave me all the \u003cstrong\u003etechniques and processes\u003c/strong\u003e and more importantly… all the \u003cstrong\u003esystems and tools \u003c/strong\u003eI needed to build brand strategies for my clients.\u003c/p\u003e\n\u003cp\u003eThis is the consolidated “fast-track” version to becoming a brand strategist.\u003c/p\u003e\n\n\u003cp\u003eI wholeheartedly endorse this course for any designer who wants to become a brand strategist and earn specialist fees.\u003c/p\u003e\n\u003cp\u003e\u003ca title=\"bmsbestcourse\" href=\"https://justcreative.com/go/bmspodcast/\" target=\"_blank\" rel=\"nofollow noopener sponsored\" data-cke-saved-href=\"https://justcreative.com/go/brandmastersecrets\" data-linkid=\"54389\" data-nojs=\"false\" data-lasso-id=\"841902\"\u003e\u003cstrong\u003eCheck out the 15-minute video\u003c/strong\u003e\u003c/a\u003e about the course, which lays out exactly what you get in the Brand Master Secrets.\u003c/p\u003e\n\n\u003ch2 id=\"ftoc-transcript\"\u003e\u003cstrong\u003eTranscript\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eIt’s really great to start noticing how much you want to give advice. Most of us don’t even realize just how relentlessly we leap to the answer and we think that that’s what the other person is asking for. It is surprising how many situations don’t have somebody going, what I’m hoping for here is your advice. Mostly they want your encouragement, being seen, being helped, and you can do that with questions and thank you as longer.\u003c/p\u003e\n\u003cp\u003eHello and welcome to JUST Branding, the only podcast dedicated to helping designers and entrepreneurs grow brands. Here are your hosts, Jacob Cass and Matt Davies.\u003c/p\u003e\n\u003cp\u003eHello and welcome to JUST Branding. Today’s guest is someone we’ve been wanting to have on the show for a long time. His name is Michael Bungay Stanier or MBS as is known by many. He’s the author of The Coaching Habit, which was an absolute game changer for me, The Advice Trap, How to Begin and How to Work with Almost Anyone. His work has helped leaders, teams and creatives get better results by saying less, listening more and leading with intention. In this episode, we’re digging into a powerful idea, how coaching can be a superpower for brand builders. So whether you’re a designer leading strategy sessions, a consultant guiding clients or a creative looking to level up, this conversation is all about how coaching can help you show up with more clarity, ask better questions and build stronger relationships without burning out. We’ll get into why giving advice isn’t always the best move, how to handle tricky client dynamics and how shifting from being the doer to being the guide can actually transform your work. So let’s jump in. Here’s our conversation with the one and only Michael Bungay Stanier. Welcome to the show. Welcome.\u003c/p\u003e\n\u003cp\u003eYeah, thank you. Look, I’m super happy to be here. I’ve been in this world of being brand building, of being a vendor, a consultant on the other side of the table. So a lot of what I want to talk about actually comes from all the mistakes I made. And the scar tissue I have, and the learnings I took around. Just that my advice is not always as good as I think it is. And sometimes asking a good question can make all the difference.\u003c/p\u003e\n\u003cp\u003eAbsolutely. And I got so much of that from your book, The Coaching Habit, which we’ll tuck into in a moment. Just before we tuck into that, we’re having a conversation off air about how many books we had of Michael’s. So we’re just showing them up on screen here.\u003c/p\u003e\n\u003cp\u003eI love that. I’ll show you all the books you’ve got. Wait, he’s just saying you’ve only got one of them.\u003c/p\u003e\n\u003cp\u003eJust one.\u003c/p\u003e\n\u003cp\u003eJacob is literally five times the man you are, Matt. And I’m not talking about Beards here. I’m talking about book ownership.\u003c/p\u003e\n\u003cp\u003eI have failed miserably because I’ve got The Coaching Habit. Jacob’s got about 10 books he’s holding up, if you can see. So I feel ashamed. However, I would say that this book, The Coaching Habit, I have really appreciated. And I thought it was quite interesting, like the first question that you recommend, you know, what’s on your mind? So what’s on your mind, Michael? What are you thinking?\u003c/p\u003e\n\u003cp\u003eWell, if I’m honest, part of what I’m thinking about is what’s for dinner, because I’m a little bit different time zones. You know, Jacob’s in Australia, which is where I’m originally from. So that’s what, 14 hours ahead of here. You’re in Wales, which is five or six hours ahead of me. So we’re all in different time zones catching up. But here, it’s evening’s falling, dusk is coming, my wife is cooking something in the kitchen over there. So I’m enjoying this conversation, but also looking forward to having a meal with her later on. That’s precisely what’s on my mind right now.\u003c/p\u003e\n\u003cp\u003eThat’s the honest truth. All right. Well, let’s tuck into your story a little bit more. We want to know who Michael is. So in your own words, can you let us know a little bit about Michael, how he came into coaching, why it’s such a big part of your mission? Yeah.\u003c/p\u003e\n\u003cp\u003eIf I’m known at all, I’m best known for this book, The Coaching Habit. About nine years old and it’s become the best-selling book on coaching. Or really it’s the best-selling book on how to be more coach-like. Because I’m actually not trying to convince people to be a coach. I’m trying to make this technology useful to everybody because it’s a really powerful everyday technique. But they say inspiration is when your past suddenly makes sense. So this kind of culminating moment of writing The Coaching Habit, you kind of rewind it and you can kind of see the story in my back past. So I’m Australian, grew up in Canberra, which as Jacob would know, you get mocked by every other Australian for growing up in Canberra, because it’s the national capital and it’s the government town. Everybody goes, you know, Canberra, you loser. But I love growing up in Canberra. I went to high school there, I went to uni there, Australian National University, did a degree in literature and a degree in law. Literature I loved and I was pretty good at it and I kind of crushed that. Law, not so much. I literally finished my law degree being sued by one of my law professors for defamation. So that really wasn’t going that well. I was saved from becoming a lawyer by winning a Rhodes Scholarship, a fancy scholarship over to England. So not only did I not become a lawyer, good for the legal profession and great for me, but I also met my wife studying at Oxford. That was 30 plus years ago now. So I did a master’s degree in literature at Oxford. And so I’m now in my mid-20s and still not any idea whatsoever about what I wanted to do with my life. I knew I didn’t want to become an academic. I knew I didn’t want to become a lawyer, but it wasn’t obvious what I did want to become. And so my first job at a university, I stumbled into this small agency. It was an innovation agency and this is in the mid-90s. So they really knew what innovation was. I’m trying to explain it to my family. They’re like, we don’t understand what you’re doing. And it was a brilliant first job in many ways because these guys were kind of all up on the maverick thing. So they’re like, no, don’t, because I used to sew my own clothes, long hair, earrings, and they’re like, we like that you’re weird. So just keep doing that, that was great. At the same time, we didn’t have a whole lot of a success in actually launching products. I can now say that I had a small role in Stuffed Crust Pizza for Pizza Hut and I also invented a or helped invent a single malt whiskey that is being described on whiskey.com as the worst single malt whiskey ever invented. I got to this point going, look, you know what? I don’t want to die with those being the two career highlights of my life. I need to go find something else to do. But what that work had taught me was how to run a focus group, how to sit with people and ask questions and be curious. In fact, at university, I’d done crisis canceling, so young people having a tough time, mental health issues, suicide. I’d been trained in sitting and listening and asking questions. Now I can see that these were really foundational moments for me about learning the power of asking a question, being present to the answer, not assuming that the first answer was the right answer. And these are all things that come up in The Coaching Habit book. So I moved from this innovation company. I moved into change management because I was like, why do none of our good ideas survive to see the light of day? And that took me from the UK, London, where I was living then, to Boston, worked in Boston for a while. Finally, it was like, okay, I’m done with this. I’m going to head up to Canada, the Great White North. I lined up a job, but my flight out of Boston was on 9-11. So that all went haywire. So out of necessity, because my job didn’t exist anymore, I started my own company. And I was also becoming increasingly unemployable. And that was 20-some years ago, 22-23 years ago. And after a certain amount of time where my only business plan was to find somebody with a wallet and try and persuade them to give me some money, I caught on to this idea of coaching being powerful. And I trained as a coach and I loved it. And I was also deeply irritated by it. Because on the one hand, I could see the power of what it meant to be present to somebody, to ask them a question, to help them figure some stuff out on their own. On the other hand, it drove me nuts that coaching came with all this baggage. It was a woo-woo, it was caftans, it was incense, it was touchy-feely, it was HR. And I was like, you know, I’m going to drive to try and make coaching feel like a regular everyday technology that normal people can use. And I started training, I started teaching people around that, and then that culminated in A Coaching Habit book nine years ago. Since then, I’ve written some other books as well. But that’s the broad sweep of the story.\u003c/p\u003e\n\u003cp\u003eWhat are your other books about, Michael? Because as you know, I’ve got The Coaching Habit, but, you know, I wasn’t that… I’ve got to be honest, before, you know, we started talking, I wasn’t that familiar with any of your other works. So it’d be great. Perhaps other folks are like me. Give us a flavor.\u003c/p\u003e\n\u003cp\u003eSo there’s one type of audience I help, which are people who work with other people. So The Coaching Habit is this book to Unweird Coaching. The Advice Trap, which is like a sister book to The Coaching Habit, is all about kind of a deeper dive into how do you tame your advice monster, that driving force you have to kind of want to jump in and offer up ideas and suggestions and opinions. And then my most recent book for managers and leaders and individual contributors is How to Work with Almost Anyone, which is all about how do you build better working relationships with people. Because you’re working relationships with your clients, with your boss, with your team, determine your happiness and success. And most people don’t actively do much about that. They just cross their fingers and they hope for their best. So that’s kind of one cluster of books. And then there’s another cluster of books, which is helping people figure out what they want to do with their lives. So the book How to Begin is all about how do you find your worthy goal, something that is thrilling and important and daunting for you, that you can kind of go, right, here’s the next big thing for me to work on. And the most recent book I published is called The Do Something That Matters Journal. So it’s a journaling process to support the quest to go find a life that matters.\u003c/p\u003e\n\u003cp\u003eAmazing. Thank you for sharing. I had a follow up question with your story because you said you were trained as a coach. I’m curious on where you got trained or who trained you or just like that back.\u003c/p\u003e\n\u003cp\u003eSo there’s a number of great coaching schools around. I went with one called CTI or the Coach Training Institute. They’re one of the more established ones. And I actually built a coaching practice and then went to my surprise. This isn’t actually what I want to be doing. I don’t like coaching enough. I find it a bit restrictive. I like actually the creative act. I like creating content. I like connecting with people. I like being on the stage in front of an audience. So having built a coaching practice and gone, this is it. Finally, I’ve reached the destination I’ve been working towards for 25 years. I was like, this is not the destination. Shut it down and figure out other things to do. So my world now is I’ve got a training company that’s run by a team and they support big companies like Microsoft and Salesforce and Gucci to make their cultures more coach-like. A business which is about helping people in midlife figure out the next big thing. And a new project called Chain Signal, which is about helping people understand organizational change. So that sucks a little less.\u003c/p\u003e\n\u003cp\u003eAmazing. Well, thank you for sharing that background. I’d love to get into the coaching side of things now. And we often start with definitions on the show. So I’d love to hear how you define coaching and perhaps how it’s different from mentoring or consulting.\u003c/p\u003e\n\n\u003cp\u003eYeah. Well, it’s a good question because there’s a bazillion definitions of coaching. And everyone has kind of heard of it and really like, I’m not quite sure what we’re talking about. Everybody who’s selling coaching has their own definition of coaching. People might have heard, I mean, probably heard of sports coaches and it’s like the same as sports coaching. There’s executive coaching, there’s life coaching. How are these things related, if at all? But for me, it is about a very everyday behavior. And it is simply this. Can you stay curious a little bit longer? Can you rush to action and advice giving a little bit more slowly? Because most people are advice giving maniacs. They’re like somebody starts talking and after about 30 seconds, you’re like, I already know the answer. I’m now pretending to listen. I’ve got my fake active listening mode on, just waiting to add value to this conversation by telling them what I’ve already decided. And this superpower of actually staying curious just a little bit longer, and I’m not talking a week longer or a day longer, I’m talking like 90 seconds longer, can actually revolutionize the experience of a conversation. And then how it’s related to something like mentoring, Jacob. Well, you know, mentoring, broadly speaking, is somebody who’s walked a similar path to you, and it’s just a little bit ahead of you, like a year or a decade going. You know, I’ve got some stories and I’ve got some wisdom and I’ve got some understanding of this landscape that you may not have. And the very best mentors I know also are powerful questioners because they know that when you ask a question and you help people figure it out themselves, that’s a wisdom that lands in a much deeper way. So, whereas with coaching, you can stay curious a little bit longer with anyone. You don’t have to have had particular subject matter expertise to kind of assume that role with them.\u003c/p\u003e\n\u003cp\u003eAnd the last one is just consulting, just so we got broad definitions for each of them.\u003c/p\u003e\n\u003cp\u003eYeah, well, you hear my bias in all of this, which is like, you know, what a good consultant is, somebody who asks questions. Same with being a good sales person. You know, a good person who is in sales is somebody who asks questions. Now, a consultant is often somebody going, oh, I’m hiring a consultant because they have the answer. But a great consultant will feel the need to kind of present a solution, if that’s the agreement that they have with their client. But what they’ll know is when a client goes, hey, here’s my problem, that’s almost certainly not the problem. That’s just their first go at trying to express the problem. And way too many consultants, and I’ve been one of these consultants, have generated PowerPoint decks with detailed explanations and outstanding answers to solve the wrong problem. Because we fell for the illusion that the presenting problem is the actual problem. So I guess you could say if it’s like a music mixing board, each one of these have different levels of advice giving, of subject matter expertise and of curiosity. My stand would be the more curious you are with all of them, particularly in the first part of the interaction, the more powerful and more useful and more on point your answers and solutions will be when you actually get to them. 100%.\u003c/p\u003e\n\u003cp\u003eI often obviously do a bit of consulting myself and I think, you know, you are always presented with the problem, you know, in the outset, in the initial sales discussions actually, but, you know, before you’ve even sort of been hired, it’s like, can you come and help us with this? And I always make that point, like you said there, Michael, when I’m talking to people, because I always say, look, you know, it very well may be that as you’ve, you know, you describe things that that is the problem. But look, think of me like a doctor, right? If you went to the doctor and you said, I’ve got a broken leg, right? The doctor doesn’t just go, oh, okay, and wrap you in plaster. The doctor says, let’s just diagnose that first. Let’s just double check that. Let’s go for a scan first. And then once we’ve established that, we will then patch it up. And that should be a good role. And that comes with curiosity and asking questions, as you say.\u003c/p\u003e\n\u003cp\u003eThat’s right. And even if the thing they’re talking about is an issue, it may not be the issue.\u003c/p\u003e\n\u003cp\u003eExactly.\u003c/p\u003e\n\u003cp\u003eBecause I’ve been on both sides of the table where I’ve got people to solve something for me that has been a thing that I wanted to solve, but it hasn’t been the big thing that’s actually going to make the real difference to my company or my business or whatever, whatever else might be framing that up. So part of the great gift of a consultant is a willingness to say, look, I’m going to really help you figure out what the real challenge is because advice is never, never as cheap as it is now. I mean, honestly, anything you know, ChatGPT knows better than you, and in a more succinct way than you, and often with better references than you because you’ve actually half-assed it and you can’t even quite, quite remember what the actual solution is. So if you think your idea and your content and your answer is unique, and valuable, and differentiated, I reckon you’re fighting a losing battle on that. But your curiosity and your ability to help people actually figure out for themselves what the real challenge they might be facing, that, that is something special.\u003c/p\u003e\n\u003cp\u003eAbsolutely. Well, let’s get in the practical side of things now, how we can actually use coaching as a, as a superpower. You’ve done a lot of podcasts on The Coaching Habit and The Seven Questions inside. So we’re not going to go through all of those questions. You can get access to that in the book and many other podcasts. But what do you find the most powerful question out of those seven?\u003c/p\u003e\n\u003cp\u003eWell, context is everything. So in some ways, the most powerful question is what’s the most going to be most helpful for the person in front of me right now? You know, because coaching is an act of service and an act of empowerment. You’re like, I am, I am trying to be helpful for you or, and or particularly if you’re coaching somebody in your team, I am trying to invite you to step forward and assume responsibility and accountability and kind of capacity for this challenge that we’re talking about. So what’s the most useful question just depends a little bit on what’s going on. But if we’re springboarding off that rant I just had around, whatever you think, if your first idea is not going to be the right idea, the first challenge is not the right challenge. That question that you’ve already heard me say, which is so what’s the real challenge here for you? That’s a really powerful question. And I’ll break it down and I get kind of nerdy about it. You could ask somebody, what’s the challenge here? And you know, as creatives, people probably ask that question a thousand times. And what’s the challenge here is okay. But just listen how different it is when you guys say, what’s the real challenge here? Because that actually shifts it to say, look, there’s a bunch of things going on. What do you think the real challenge is? And my bet is that most of the time, people are going to stop and go, oh yeah, what is the real challenge? They’re going to stop and they’re going to think. And when you’ve stopped somebody and you’ve got them thinking, you have become a more valuable partner to them right away. But then when you go, what’s the real challenge here for you? Now you’re not talking about some sort of abstract business problem out there. You’re like, here’s what’s hard about this for me. So now you are solving the problem and you’re solving that person’s problem as well. And you’re helping to deep dive into that. And I think that becomes really powerful. So what’s the real challenge here for you? And they’ll give you an answer to that. And if you’re smart, you’ll know that that’s not their only answer and it’s probably not their best answer. So what I would do is I would then combine that with the question I actually often say is the best coaching question in the world which is simply and what else? So here’s a script that everybody listening can just use and it will be powerful for them. What’s the real challenge here for you? And what else? And what else? So what’s the real challenge here for you? And if you’re listening and you’re like, that sounds a little easy and a little glib. And actually I’m a bit anxious because how am I providing value in this conversation? I’m just kind of reading off a script. Well, the thing is, it’ll milk the other person’s brain as they suddenly go, oh my God, this is the real challenge. And that, if you’re a consultant or a creative and you help your client figure out what the real challenge is, that is a moment of real value to them.\u003c/p\u003e\n\u003cp\u003eYou know, when I started using that question, it took a long time to get used to the long silence. It’s like you had not like coming in and saying something and they’re just like, you have to watch them and their brain tick. It could be a long time.\u003c/p\u003e\n\u003cp\u003eBy a long time, that’s often like two and a half seconds. It feels like a long time because you’re in this moment of ambiguity and powerlessness. That’s kind of the underlined dynamic, doesn’t get talked about much. But when you go, what’s the real challenge here for you? And that person is like, oh, wow. And there’s that pause. You’re on the other side of the table going, oh, is that a good question? Did it land? What are they thinking? What are they going to come up with? How am I going to react? I’ve got nothing to do now other than just stop and wait and listen to the answer. So it’s an act, you’ve given them power. It’s an act of powerlessness for you. But an ability to sit with that silence and allow that person to do the thinking is incredibly powerful. And if people actually want to hear an example of this, some years ago, maybe, I’m not sure now, like three years, two, three, four years ago, I was on Brené Brown’s podcast and I coached Brené at about the 45 minute mark. Wasn’t expecting it. She didn’t warn me. He didn’t tell me I was gonna coach her. She goes, okay, Michael, so coach me. It’s 5 a.m. I’m in my 14 year old bedroom as a kid, this is where I grew up in Canberra. The video has failed so I can’t see her and her team in Texas. I’m like, okay, don’t screw this up, Michael. This is Brené Brown, you know, there’s a bazillion people going to listen to this podcast. But you hear me asking questions and you hear the silence that is there as Brené is processing the question. What you can’t hear is me in my bedroom in Australia panicking because I’m like, do we have connection? Has the thing got cut? But I have just enough experience to kind of hold the line, keep silent, keep the space for her. And you can feel the, I think the power of that conversation. And partly it’s driven by my ability to ask a question and then just shut up and wait for the answer to show up.\u003c/p\u003e\n\n\u003cp\u003eTo follow up on that, so, you know, there’s a balance, right, between being curious, but being in like, you know, having some authority. So how do you balance that, especially like in a paid consulting role, when should we coach and when should we just like give them the advice?\u003c/p\u003e\n\u003cp\u003eYeah. So it depends, and it’s a really hard question to ask, but as a bet, at the moment, people are giving too much advice, too much content, and they’d be better off asking some better questions. So part of what I want to do when I’m in a relation, a thing like that, like Jacob, if you come to me and go, Michael, how do I? It’s a great lead in this. How do I? I’m like, it could be more explicit what you want from me. It’s not a question, you want a solution. And my advice monster, the lizard brain is just going, just tell the man, you know a whole bunch of stuff, just tell him, this is how you prove that you’re smarter than him and wiser than him, and you’re still adding value even though you’re getting old. Everybody wants this, tell it to him. And I just know because I’ve been banging on about it now for years, which is like, you know what? There’s a place for advice and I’m just trying to slow down the rush to action and advice. So Jacob, if you came to me and said, Michael, how do I? I go, look, Jacob, I have some ideas around how to do that thing for sure. But let me just check with you first. When you say that, what is the real challenge here for you? And now suddenly I’ve just gone, okay, I’ve kind of received that and I’ve flipped it back into a question. Or I might go, okay, if that’s the real challenge, Jacob, and I’ve got some good ideas about that, I think you’re going to like them. But just so I know, what ideas do you already have around how to tackle that? Because I’m guessing you’ve already done some thinking about that. And you go, well, yeah, what about this? I like that. What else could you do? And you go, okay, how about this? I’m like, yeah, that’s great as well. What else? What else could you do here? And one of the principles about being more coach-like, and it’s one that people struggle with, creatives in particular, because I’m used to delivering the work, is to be lazy. You know, my three principles around coaching are be lazy, be curious, be often. Be lazy, stop doing all the work, allow a place for the other person to do the work, be curious, tame your advice monster, ask some questions, and be often. Realize that every interaction, in person, over Slack, text, phone, you can all email, you can always be, all of those are places where you can be curious a little bit longer. I’m curious to know how that answer lands for you.\u003c/p\u003e\n\u003cp\u003eIt was amazing. I love hearing the example of how you go through the process and you could flip it back, flip the script and put it back on them. So that kind of leads me into like Brené Brown, how did that conversation end up? Did you flip the script on her?\u003c/p\u003e\n\u003cp\u003eWell, I was, she asked me to coach her and I went, sure, so what’s on your mind Brené? You know, and it’s like what people will notice if they hear examples of me coaching and if they’ve read The Coaching Habit book is, I really do just stick to some of the questions. There are only seven questions in The Coaching Habit book. And I mostly stick to those questions because people show up indicating that they want an answer, but there’s a deeper need or want that people have is to be seen and to be heard and to be encouraged and to be given the responsibility that they’re capable of. And so, Sean, there is a there is look, I’m not saying advice is bad and there are times where advice is the thing to do. Like, Matt, if you’re coming to me going, I’ve accidentally set the house on fire. What should I be doing? I’m not going to be going, well, I don’t know how you feel about smoke, Matt.\u003c/p\u003e\n\u003cp\u003eWhat’s the real challenge?\u003c/p\u003e\n\u003cp\u003eI’m not going, listen, follow me, we’re going to exit stage left.\u003c/p\u003e\n\u003cp\u003eI’m a pyromaniac, that’s the real challenge here.\u003c/p\u003e\n\u003cp\u003eAnd that is the challenge, that’s the challenge for everybody.\u003c/p\u003e\n\u003cp\u003eNo, I was just going to say, yeah, I think it’s super smart because the other thing that I think about it is that I always say to folks, look, at least in my role as a consultant, it doesn’t mean that I actually always have the answers. Like, you are hiring me to help you get to the bottom of it, but you’ve got an amazing team, you’re amazing, you know this industry, this brand way better than I ever will because you built it, right? You’ve been living and breathing this. What I can do, though, is breathe a breath of fresh air in, I can talk to the right people, I can be curious, and we can get to a solution together. Now, that’s a better, in my view, approach, because a lot of consultants, I think, frankly, and perhaps I can be like this as well, can be a little bit arrogant, like, I’ve got the answers to your particular issue in your particular context. But as you rightly say, like, that’s a really foolish way, I think, of actually conducting oneself. If you ask questions, there’s a whole myriad of things that you can learn as well. Like, you were saying, like, what other ideas have you been considering to solve your problem? Now, that can save a heap of time, because, you know, you might have had one of those ideas and we’re going to present it, and, you know, the client will be sat there thinking, well, I’ve already thought about this. We tried this three weeks ago and it failed miserably. So it’s wise to be curious and it’s wise to hold back, I think, and ask some of these questions that you’re recommending.\u003c/p\u003e\n\u003cp\u003eThere’s a way that your accumulated wisdom feeds into your ability to ask a question and also to understand the answer that they give you. I just think it’s a mistake to say the way that you prove your authority is by having the answer, because the faster you are to have the answer, the more likely you are to be wrong. Now it’s a challenge because a lot of the time people are like, look, I don’t want a question, I don’t want a conversation, I just want the answer. And there’s that paradox that when you see an expert on TV, the more certain they are, the more people like them and the more likely they are to be wrong. There’s just a ton of statistics around that, which is like, you know, because they’re an expert on TV, nobody holds them accountable in six months’ time. They go, well, you know how you said, and in fact, this happened. So when somebody shows up and is being very clear, let me be absolutely clear, our lizard brain loves certainty. So when somebody is being really clear and really directive and really authoritative, our brain goes, oh, this is excellent. They’ve got it. I don’t even know what we’re talking about directly, but they’ve got it and I can relax a bit about this because I feel safe. And the brains, the lizard brain is all about going, my job is to keep you safe because the longer you live, the more likely you are to have kids and the more likely you have kids, the more my DNA passes on. So it’s a brain replication strategy, which is to keep you alive as long as possible. And keeping you safe is a key part of that. And the clearer you feel about things, the safer you feel. So part of what you have to do as you ask a good question is you’re also trying to make it feel safe while doing something that feels a little unsafe for both of you, which is to ask a question.\u003c/p\u003e\n\u003cp\u003eOf that, put people at ease in any way you can when you’re asking these probing questions. Right. I have a quick question because obviously we’re talking here about coaching a lot and kind of one-to-one conversations. And I just wondered in terms of just a sort of a, you know, a curveball question, what are your thoughts on sort of group dynamics? You know, I do a lot of work and I’m sure a lot of listeners do a lot of work with, say, leadership teams or groups of teams. And obviously, sometimes you need to listen to lots of perspectives in order to come to understand a problem truly. So I wondered what your thoughts were on group coaching, if you like. Do you ever do one-to-many, for example? Do you ever advise that? And, you know, what are your thoughts around that sort of dynamic?\u003c/p\u003e\n\u003cp\u003eYeah, look, if you buy into this idea that being more coach-like is staying curious longer, then every situation can lend itself to questions. And then you’re going kind of at a at a facilitative or logistical level. How am I going to make that work? Because, for instance, if you show up into a room and there’s 12 people on a team, and you go, okay, so I hear this team’s a bit dysfunctional, what’s the challenge here? What you’re going to get is a very awkward silence from 12 people who are kind of looking at the floor and deliberately not looking at that person over there. So there’s a way to manage that in a way that can be really powerful. You know, people don’t feel safe in sharing an answer in a large group, for the most part, unless a bunch of trust and safety has been developed. So what you do, perhaps, or one thing you could do is you get pair people up, and you’re like, we’re going to pair you up or put you in threes. And we’re like, what’s the thing that we want to do more of or do less of, or whatever in this team and then find a way to come back and share it. So people will be getting my message by now, which is like almost everything is improved by staying curious a little bit longer. Because it sets you up for success when you’re actually giving guidance and advice and specificity and you can definitely do it for teams or large groups.\u003c/p\u003e\n\u003cp\u003eIf you’re building a brand and want to do it right, this is for you. Join the Brand Builders Alliance for expert coaching, live master classes and a crew of brand builders who’ve got your back. Get on the waitlist now at joinbba.com. Now back to the show. So Michael, you talk about The Advice Trap, right? You’ve written a whole book on it about how you tame the advice monster. I know we’re kind of circled around this idea a bit, but is there any rituals or go-to techniques you could share with our audience to just be comfortable with that silence and being curious? How do you actually implement that in a practical way?\u003c/p\u003e\n\u003cp\u003eThe first thing to do is just it’s really great to start noticing how much you want to give advice because most of us don’t even realize just how relentlessly we leap to the answer and we think that that’s what the other person is asking for. So there’s just a self-awareness going, how keen am I to interrupt and come in with the answer? How much do I think that this conversation is about them coming to me for an answer? There’s statistics that say a general practitioner, a doctor on average interrupts their patient within the first 17 seconds of a conversation with them. And I’ve always felt that was a bit unfair for doctors, because I’m like, I’m pretty sure that’s everybody. Everybody’s like, oh, let me be helpful for you. But it is surprising how many situations don’t have somebody going, what I’m hoping for here is your advice. Mostly they want your encouragement, your questions, your presence, being seen, being heard, being helped. And you can do that with questions and thank you as longer. But for me, part of the taming advice monster is just notice that. Second thing is to go. The goal is not to become comfortable with silence, although that’s a bonus if you can get there. All you have to do is be less uncomfortable with it than the other person. Because when you ask a question and there’s this heartbeat, and another heartbeat, and you’re like, oh my god, this is a terrible question, what am I doing? And about a second and a half has transpired. Either they’re feeling the same as you, which is like, oh my god, this is awkward, and they will crack first. Or else, they’re going, they’re sometimes labeled introverts, and they’re going, this is great, because I actually need a heartbeat or three just to get my answer together in my head before I can articulate it. I mean, there’s lots of different definitions for introverts and extroverts, but one of the definitions talks about how people process information. If you’re an extrovert like me on this scale, the way I process information is I start talking. So when I go, look, Jacob, there are three things you need to know here. I don’t yet know what those three things are. I’m about to discover them myself. I hope they’re interesting. But I’ve just got to set myself up and go, I’m going to start talking, I’m going to find out this answer along with you. If you’re introverted, you’re like, one, two, okay, I’ve got my three things. All right, here we go. And so if you’re wired like that, it is a great gift to be given just two seconds of silence to get my thoughts in one before I actually get to start talking. And then for me, I think there’s something about, well, what’s the habit you want to build that can kind of help you manage your advice monster? And it’s really useful just to have a go to question that can help with that. And people have already heard the question I want to recommend, which is, and what else? Because when you’re sitting there and you’ve asked a question and they say something and you’re like, oh man, I’ve got so I’ve got things to say to that. Oh, here we go. Because you’ve been seduced into thinking that their first answer is their actual answer, and it’s only their first answer. But if you just go to default going, after their first answer, regardless of what’s going on in my head, I go, and what else? What else are you thinking here? What else is the challenge here? What other ideas do you have? That’s a way that you stay curious longer, tame your advice monster and allow people to get a little deeper into the conversation.\u003c/p\u003e\n\u003cp\u003eBrilliant. Thank you. Matt, did you have any follow-up questions?\u003c/p\u003e\n\u003cp\u003eNo, really, I think that was really fantastic here. I think you’re absolutely right. I’m probably the worst though, I would say, and Jake will testify to this, of jumping in. So on paper, I completely agree with everything you’ve said.\u003c/p\u003e\n\u003cp\u003eLet me interrupt for a moment.\u003c/p\u003e\n\u003cp\u003eInterrupt me? Come on, let’s go.\u003c/p\u003e\n\u003cp\u003eBecause there are times when you do want to interrupt, because sometimes you ask a question and the person starts monologuing. You’re like, oh my God, this is my life ticking away and I don’t even know what this person’s saying. I’m trying to be polite and encouraging and doing the active listening thing. But part of you is going, what is this about? So interrupting can be absolutely appropriate. What I just tried to role model, which is, hey Matt, let me interrupt. That’s the way I interrupt. Because the best way to interrupt somebody is not with a question, but with the statement or the signaling that you are currently interrupting them. So, hey Matt, let me hold you there for a moment. Matt, let me just stop you. Matt, let me interrupt. Matt, I’m just going to jump in here. Matt, sorry to break the flow of your thoughts here, but what I’ve done is I just told you what’s happening. So, you go, oh okay, right, Mike was interrupting me. This doesn’t feel rude. It feels like part of the process. And then I’ll go, this is all very interesting, but you know, what’s the real challenge here for you in this? So, there are times we’re interrupting to focus the conversation can be really powerful. And I say that to deal with a bigger issue that kind of lives in this world, which is people are anxious about coaching because they’re like, I don’t have time for this. I am busy, I’ve got responsibilities, I’ve got projects I’m working on, client conversations I need to be part of. If I’m starting to coach everybody, like I’m already working a 60-hour week, suddenly it’s going to be a 90-hour week because now I have to ask questions on kind of, who has time for this? And my take on that is, first of all, coaching shouldn’t be seen as an add-on to what you’re currently doing. It should be a way of transforming what you currently do to be more coach-like. Secondly, I think that a typical coaching conversation should take less than 10 minutes. And that means you have to get into the real stuff as fast as possible. A lot of flabby coaching just takes too long to get anywhere that’s interested because the person is so busy actively listening, that they don’t realize that we’re not talking about anything interesting at the moment. They’re giving a whole lot of background that I don’t actually need. So you know when somebody starts talking and I’m like, okay, we’re kind of… You’re filling in all the background and I actually don’t need any background because I’m not trying to solve your problem. I’m trying to help you solve your problem and you already have all your background. So I will interrupt regularly, but I’ll interrupt regularly to ask a question.\u003c/p\u003e\n\u003cp\u003eSo what if they don’t know their real challenge? How do you help or guide them then?\u003c/p\u003e\n\u003cp\u003eWell, I get as close as we can. I will go, so what do you think the real challenge here for you is? I’m like, yeah, yeah, I don’t know. I’ll go, yeah, that’s hard. If you had to take a guess, what do you think your real challenge might be? And that kind of, so just take a guess, takes the pressure off. It’s feeling like, oh, I get it right or I die, but I don’t know what my real challenge is. I fail. You’re like, yeah, yeah, it’s hard. I get that. But if you had to take a guess, because I think you’re getting close to it, what’s your best guess at what the real challenge is? And there’s a way you can build up experience over time going, oh, it feels like we’ve landed somewhere really interesting here. Or sometimes you go, okay, that sounds like it might be it. And then you get into a conversation, and you realize it just doesn’t feel really that urgent or that important. And then you can say that, you’re like, we could keep digging into this, but it feels a bit academic, and almost a little boring. So let me check, is this the real challenge, or is there another challenge that’s lurking here? And they’re like, yeah, I thought that was the real challenge, but I don’t think it is anymore. So let’s get back into figuring out what the real challenge is. Because if you can do one thing as a creative, as a project manager, as a coach, as a consultant, if you can just help your clients figure out what the real challenge is that they’re facing, that makes you one of the most valuable people they know. Because they are surrounded by people trying to sell them advice, and they have very few people helping them figure out what the real challenge is, which is actually what it means to be strategic.\u003c/p\u003e\n\u003cp\u003eYeah, 100%. I’m glad we’re getting to strategy. I’m going to touch on that in a minute, but you know, it just occurred to me as we go through, like, if you think it through, like, if they don’t actually know what the challenge is, okay, that can be of value to them in itself, if you’ve drilled down and drilled down, and they’re facing it, and they think, flip, actually, I don’t really know. So sometimes if that happens to me, well, I was going to ask you actually, I wonder, would you ever encourage them to, or ask them, say for example, like, what could you do to better understand it then? You know, if you don’t understand it, what could you do? Because that again is sparking ideas. It’s getting them to think through, okay, don’t get this, but maybe we could try this, or maybe I could ask these questions, or go to that person, or, you know, even that is a value, right?\u003c/p\u003e\n\u003cp\u003eAbsolutely. I like where you’re going with this. I mean, like, if they’re like, I just can’t figure out what my real challenge is. I’m like, okay, so what if we come up with a short list? What do you think your short list of three might be? What if I give you 24 hours, and your goal is just to sit with it for 24 hours and see what percolates up, and we’ll check back in 24 hours? What if you and your consulting partner go out for dinner tonight, have a glass of wine and just chew this over and kind of get into the conversation? You just have to keep asking yourselves, what’s the real challenge here for you? You know, people don’t always get there in the moment, but you can plant a seed or get a wheel spinning or whatever metaphor you want. Go, let me come back to you on this and we’ll get into this tomorrow. Or like go for a walk around the block and I’ll meet you in the coffee shop in half an hour. You got 30 minutes just to sit with this and just try and, you know, there’s a Latin phrase, solvator, ambulato, everything is solved by walking. So just go for a walk and see what shows up.\u003c/p\u003e\n\u003cp\u003eI love these practical tips and I’m curious if there are any other common roadblocks you come across like, you know, is there a real challenge? Is there anything else that often comes up that you need to solve?\u003c/p\u003e\n\u003cp\u003eWell, the challenge that’s connected to this is just the messiness of interacting with other members of the human species. Because, you know, people are complicated, difficult, irrational, fear-based, misguided, don’t understand themselves as well as they might, you know, and this is me I’m talking about. I mean, it’s true for everybody else as well, which is like people are messy, irrational beings. So, you know, it’s one thing to help people figure out what the real challenge is. Then part of the art is like, what does that mean for you? And what are you up for? And what might you do differently? Because for me, coaching, you know, staying curious a little bit longer, the goal, what you’re trying to trigger in another person is a new insight about themselves and all the situation, but typically both. This is my insight about me in this moment. And then an act to shift that, so something’s different. Because, you know, the point of coaching is to change something. If it’s just a chat and nothing changes, it hasn’t been that helpful as coaching.\u003c/p\u003e\n\u003cp\u003eWell, I think that’s a good segue into your next book, Working With Almost Anyone. Yeah. So you talk about like the best possible relationships. So what does that mean and why is that important?\u003c/p\u003e\n\u003cp\u003eSo the starting point for this book is going, look, your working relationships determine the quality of your happiness and success to an inordinate degree. And, you know, people listening to this can just, you know, you can figure this out yourself. Think of a crappy client you had and just how that stained the experience or a terrible boss that you had and how miserable that was. You know, it doesn’t really matter the work you’re doing. If you have a terrible client, it’s a bit of a crappy experience. And likewise, if you’re working with a brilliant client or a brilliant colleague or a brilliant boss, it doesn’t really matter the work you’re doing. It can be fantastic. You’re like, I didn’t even enjoy this work, but man, we had a good time. And most of us don’t do that much to actively shape the working relationships that we have. We just hope, cross our fingers, pray to the gods, roll the dice. And so I want people to rise to that challenge and more actively try and shape the key relationships they have at work so that they’re happier and they’re more successful. And the goal is a BPR, Best Possible Relationship. So a goal that is safe and vital and repairable. So safe meaning psychological safety, you know, we feel like we can talk about the hard things, talk about what’s not working, bring my whole self to the conversation. But not just safe, because that’s a, you know, just safe is actually a bit boring. So also vital, vital is like psychological bravery. You know, how do you push, how do you challenge, how do you step into ambiguity together? And then the third element is repairable, because every working relationship goes off the rails a little bit at some stage or another. And repairable means we get to fix it. And the relationships that get fixed are the relationships that thrive and the relationships that survive. So that’s the goal. How do you build a BPR?\u003c/p\u003e\n\u003cp\u003eAll right. Well, let’s get into some practical things we can use with these relationships. When there’s a tension or misalignment, how do we actually, I guess, repair them?\u003c/p\u003e\n\u003cp\u003eYeah. So the key suggestion I’ve got for in how to work with almost anyone is to set your relationship up. So it has the best chance of navigating these tough times by having a conversation about how should we work together before we start working together. So let me make this up about you and Matt. So you guys, you’re like, let’s do this podcast together. And Matt’s like, yeah, let’s do this podcast together. And Jacob’s like, yeah, let’s do this podcast together.\u003c/p\u003e\n\u003cp\u003eThat’s basically how it is, by the way. That basically is what happened.\u003c/p\u003e\n\u003cp\u003eAnd you’re both creative. So you’re like, we could be creative. And you’re like, yeah, we could be creative. It’s going to be cool. And so all the excitement is about the podcast. All of the excitement is about the work. And you’re into it and you’re like, yeah, have you got a microphone? I’ve got a microphone. What if we had this kind of matching background? I’ve got a matching background. Do I need to shave my beard off? You do need to shave your beard off. I’m not going to shave my beard off. Never going to happen. So when you start working with somebody, you just get into, okay, who will we get as guests? And how often will we do it? Is it once a week, once every two weeks? What will we call it? Why are we going to do it in black and white? Why are we going to do it in black and white? Because it’s cool. You know, we’re kind of all this stuff around kind of the design and experience and who do we want to listen to this and how will I find out about it? But you haven’t done any conversation about, hey, how are you and I going to be awesome together around this? And there’s a conversation to be had, which is like, hey, look, Matt, when you’ve collaborated with somebody and you’ve co-created something together and it’s worked really well, what happened? What did they do that made it work so well? What did I do that made it work so well? And then Jacob can answer the same question. It’s like when I’ve done something and I’ve co-created something and it’s been an amazing experience, here’s what happened. Here’s what made it amazing. And you can say, look, when you’ve tried to collaborate with somebody and it’s sucked or just been mediocre, what happened? What made it go off the rails? Why wasn’t it successful? Where was it disappointing? How did you contribute to that? How did they contribute to that? And now you’re getting into a conversation about what will it take for us to work together so that we have every chance of bringing up best-served selves to the work and not our worst selves to the work. But not many people do that because it’s like, that’s cool, podcast together.\u003c/p\u003e\n\u003cp\u003eWe didn’t do that, did we, Jacob? And thinking about it, like, I mean, we basically modeled our way through and we felt like we’re now, this is like our sixth season. So, you know, we’ve been doing this for some years. And I guess it was kind of pretty much fluke, Jacob, because we have a very similar work ethic and a similar approach and we know our roles in the podcast. And we understand that we have different personalities and skill sets that kind of complement one another. So, but we kind of didn’t know that beforehand. We kind of stumbled into it. So I think that would be great advice for any working relationship.\u003c/p\u003e\n\u003cp\u003eWe’re going to be interested, which is like, so Matt, when things go wrong and you’re in conflict with somebody, what do you do? I mean, how do you show up under stress? What’s your unilateral action, which is like you being pissed off? Are you a fighter? Do you flight? Do you faint and pretend you’re dead? Do you fall and kind of suck up? Here is the 4F response. What will we do when we’re annoyed with each other? How will we process that? Because here’s my guess. You’re in your sixth season, so you muddle along and you’re doing fine. But my guess is being moments for each of you where you’ve gone, I’m a bit bummed by what happened or that wasn’t as good, or I carried that interview and Matt was a waste of time.\u003c/p\u003e\n\u003cp\u003eWas annoying everybody.\u003c/p\u003e\n\u003cp\u003eAnd or vice versa.\u003c/p\u003e\n\u003cp\u003eThat’s pretty much every episode, Michael.\u003c/p\u003e\n\u003cp\u003eBut you’re like, I mean, as an example, let’s assume one of you is feeling it’s unbalanced, I’m carrying a bit too much of the load. Do you know how to have that conversation? Have you talked about it? How would you bring it up? And you might muddle your way through it. Like, you know, finally, somebody goes like, let’s just get clear the air here and get this sorted out. But if you’ve had a conversation upfront going, when it goes a bit wonky, how will we deal with that? Just makes that process a whole lot easier.\u003c/p\u003e\n\u003cp\u003eYeah, I think getting those questions you’ve said are brilliant. I mean, just for me and Jacob, like, we’re quite open and frank, but again, I didn’t know that before. And so, you know, if Jacob’s not happy about something, I’m pretty sure he would definitely be quite direct and tell me about it, which I can’t appreciate and vice versa. But, you know, it’s tricky, isn’t it? It is tricky. And I think because, as you say, people process conflict very differently. And if they don’t feel, going back to your point before, psychologically safe, then, you know, they’re going to show up in ways that are very difficult and can be very disruptive and even toxic, I suppose, in certain team situations. Whereas if you’ve had those conversations and everybody understands where they stand, I think that’s a really positive thing. So, you know, super, super smart.\u003c/p\u003e\n\u003cp\u003eIn this book, there are five questions to say, look, if you want to build a BPR, have a keystone conversation, a conversation about how you work together before you get into the work itself. And there are five questions. We’ve talked about one, which is the repair question, number five, actually, which is like, how will we fix it when things go wrong? But the other good question is that the first question is like, so what’s your best? Like, what does it look like when you’re at your best? When do you shine and when do you flow? Because if you come together and you’re like, I love leading the conversation, I’m less good at the kind of the production of it. It just doesn’t excite me. And one of you guys, I love the production. I love being the number two interviewer, but really I shine when it comes to the production and putting in the soundscape and kind of doing the editing. You know, oh, that’s great because, you know, I’d made up a whole bunch of stuff about you and you’d made up a whole bunch of stuff about me. And now you can actually explain, look, there’s stuff I can do, but the stuff that I’m good at and fulfilled by, that’s this sweet spot. And that’s what I want to be working on in that.\u003c/p\u003e\n\u003cp\u003eIt’s really interesting you say that because Matt and I, we both have very different dynamics and personalities. Like Matt’s on the stage is doing talks and he, you know, very out there, whereas I’m much more reserved, I like being behind the screen, I like, you know, working on by myself. And I have done that many years and it’s just a very good complimentary team. But we didn’t have a Keystone conversation to begin with. We just like, we should do, maybe we should have one now.\u003c/p\u003e\n\u003cp\u003eWell, now we’ve been coached by Michael at MBS. We’ll have to have that conversation offline. Love that.\u003c/p\u003e\n\u003cp\u003eI mean, there’s a very, very domestic example. It was like 20 years into my marriage before my wife and I discovered that I don’t mind vacuuming. She hates vacuuming. I hate mopping stuff. She doesn’t mind mopping stuff. And I’m like…\u003c/p\u003e\n\u003cp\u003eBrilliant.\u003c/p\u003e\n\u003cp\u003eHow has it taken us 20 years to figure out that we’re both doing the thing that we don’t like doing and another person would be absolutely fine with doing that?\u003c/p\u003e\n\u003cp\u003eYeah, in the context of podcasting, because we’re talking about that, we found what we did like and didn’t like in terms of, you know, editing and everything, we ended up outsourcing the editing. We have an amazing editor. We both do planning, production side, I do, Matt does a lot of the promo stuff. So it’s a good dynamic that just seemed to work out.\u003c/p\u003e\n\u003cp\u003eI think what you’re talking about, Michael, particularly in teams, and this is just for my anecdotally from past experience, but I think it is pretty universal kind of law of nature that high performing teams, it’s very, everybody understands the strengths and weaknesses possibly that all the component parts of that team have. So to have that conversation off the outset, and obviously our listeners, we’ve got a wide listenership, and I guess if you’re interviewing people for a role in your company or whatever it might be, having that understanding of this is this person at their best, this is what, you know, when things are going to go wrong for them, and having that conversation early is so great. I love the idea of the BPR. So I’m definitely checking that out a little bit more.\u003c/p\u003e\n\u003cp\u003eWhat often happens in teams is there’s an awareness of presumed strengths and weaknesses, because everyone is very quick to kind of go, oh yeah, they’re good at this, they’re not so good at that. And they’ll be probably 80% right, but only 80% right, so 20% wrong. And not least, because for lots of people, they’re okay at stuff that they don’t actually want to do. Like I’m now old enough that I’m like, I can do a bunch of things, and I never want to do them ever again in my life, because I’m done with them, I’m on to other things. And I want to be able to tell you, here’s the stuff that I’m actually not yet good at, but I want to get good at. So I want to take it on, I just need to have a safety net and coaching and training and guardrails and stuff like that to allow me to actually learn and grow there.\u003c/p\u003e\n\u003cp\u003eAmazing. Thank you. Thank you, Michael. We’re going to jump into some rapid fire wisdom, if you’re up for it.\u003c/p\u003e\n\u003cp\u003eSure. Well, rapid fire, I can do. Wisdom, we’ll see.\u003c/p\u003e\n\u003cp\u003eWe need to have a little jingle here, Jacob. Like, we should do this with some of our guests now. Like, rapid fire. Carry on. We’ll get someone to look into that. Marco, our editor, can look into that at some point. Go for it, Jacob. I’m excited. What are we going to ask him?\u003c/p\u003e\n\u003cp\u003eWhat’s one coaching question everyone listening should start using today?\u003c/p\u003e\n\u003cp\u003eI’d pick any question you feel that you can ask on a regular basis. So the ones that seem to be most popular, that people can most quickly add in to their life repertoire. The one’s the opening question, the kickstart question, which is what’s on your mind. It’s a really nice way just to kind of like throw the spotlight on to them and give them a chance to talk right away. So that can be helpful. It could be, and what else? That can be a really helpful one. I mean, that’s probably the one I’d guess, which would be the place to start. But it also might be the learning question. And this is really helpful if you interact with other human beings. At the end of every interaction, you go, so what was most helpful or most useful in this conversation for you? It’s a genuine place to be curious because then your client will tell you what they found most useful, or your teammate will tell you what they found most useful, or if I ask this podcast audience, so write to these guys, email them and tell them what was most useful or most valuable for you from this whole podcast. Not only is that helpful feedback for Matt and Jacob, but actually in you doing that, dear audience person, you’re actually helping kind of re-fire the brain neurons and you’re going to remember what was most useful or most valuable. So it’s a service to you as well, which is to embed the wisdom.\u003c/p\u003e\n\u003cp\u003eLove that. Definitely do that, folks. Okay. Quick fire question number two, right? Curveball question. I love doing this. What would the worst coaching question be that you’ve ever come across?\u003c/p\u003e\n\u003cp\u003eWell, there’s a lot of competition for that. Are you kidding me? One possibility. You know, it feels like there’s just a tie for a tie for last place. Because what typically happens with coaching questions is either work or they don’t work. And what’s lovely about asking a question is that when it doesn’t work, for the most part, nobody dies. It’s not a disaster. Everybody can get over it. You can just go, that question didn’t land. Let me ask you another question and maybe this will be more helpful. But you know, typically, I will say, I mostly avoid, in most of the context, closed questions. So questions that are coming with a yes or a no answer. Mostly avoiding why questions. Because when I go, well, why did you do that? It’s very hard for that not to be heard as, why the hell did you do that? So it can sound kind of accusatory. And I am often avoiding how questions, how will you do that? How can we get that done? Because that’s, those are often action based questions. And I only want to move to action based questions when I figure out what the real challenge is and what the best idea might be. So when you hear me ask questions, you’ll notice that almost all of them start with what.\u003c/p\u003e\n\u003cp\u003eAll right. Next question is also a what. So what’s the best piece of advice you’ve never given?\u003c/p\u003e\n\u003cp\u003eOh, I’ve heard, there’s been like probably lots of advice I haven’t given. I’ve also got the memory of a goldfish, so I’ve forgotten most of it. You know, all that advice is like, yeah, you should buy that stock. You know, that person would have been a gazillionaire by now. Or you should get into Bitcoin around about now. All that would have probably been good advice.\u003c/p\u003e\n\u003cp\u003eIt’s a tough question.\u003c/p\u003e\n\u003cp\u003eWhat people talk to me about when they reflect back on what’s been helpful, is rarely advice and rarely the question I ask. It’s more a general sense of encouragement. The language I use to the spirit I want to bring to people I’m coaching or being more coach like with is fierce love. So love meaning I want the very best for you. I see the brilliant person you are and I want the very best for you. And fierceness meaning I’m not going to compromise how I show up to get in the way of that. Because I will often avoid a difficult question or avoid saying the thing that’s occurred to me because I’m like, I don’t want to hurt their feelings or I don’t want to kind of be provocative or I don’t want to do this. And I’ll kind of play small. I’ll tell myself that I’m helping them, but really I’m just protecting me. So the thing that is most valued tends to be this kind of a sense of fierce love coming from me.\u003c/p\u003e\n\u003cp\u003eAll right, last question. What would be one underrated book or tool that changed how you personally kind of coach or lead?\u003c/p\u003e\n\u003cp\u003eWell, I’ll give you one of each. There’s a book by Bill Bryson, who is an American writer, travel writer, but he wrote a book called A Short History of Nearly Everything, which is a wonderful book about science. He’s like, science gets murdered for most people in high school. We go through high school and we’re like, I never want to talk about physics or chemistry ever again, because honestly, that was traumatic. He just brings this world to life with these amazing characters and these amazing stories. But really, he brings to life just how amazing the world is. It’s just how unlikely it is to have life on this planet, and to be alive at this moment of life. Because the planet has been around for several billion years, and it’s been in the last tiny, tiny, tiny part of it that human beings have been around. I mean, if you stretch your arms wide, and that your arm span represented the age of the Earth, humans have been around for less than a fingernail clipping of that span. So the fact that we’re having a podcast conversation is, you know, a remarkable coincidence. And for me, a good deal of what I’m brought to is like trying to remember how lucky I am to be alive in this world, and trying to bring that to the people I interact with. And I’d say that book has been helpful for that. And then the tool that I find most adaptable and useful is a consultant’s two by two matrix. So imagine a square and a cross in the middle of it, and then you’ve got two axes, plus, minus on either axis. So you have, you know, top right hand square is plus plus, bottom left hand square is minus minus, and then you’ve got two plus minus combinations. And that’s a really useful tool for teasing apart the tension in two choices. I talked about one of them a bit earlier on, when talking about the question, what’s your best? You know, the tension between what I am good at and what I am fulfilled by. You can imagine that on that matrix. So you’ve got something in the top right hand corner, which is the stuff I am good at and fulfilled by. Like do more of that. Bottom left hand corner, the stuff that you are neither fulfilled by or good at. Stop doing that because that’s just terrible for everybody. And then the stuff on the other thing, one is you are good at it but not fulfilled by, and one you are fulfilled by but not yet good at it. And those are really helpful things to communicate to people because most people don’t know that about you. And that box can be used in all sorts of different things. Like I was with somebody today and she was talking about her business. I was like, what’s the stuff you do that you love, plus minus? What’s the stuff that brings you money, plus minus? So stuff that you love and brings you money, how do you double down on that? The stuff that you love but doesn’t bring you money? Some questions come up for that. The stuff that brings you money but you don’t love? Questions come up from that as well. So that 2×2 matrix and then teasing apart choices can be really powerful.\u003c/p\u003e\n\u003cp\u003eThank you for sharing that. All right, it’s come to time just to wrap up. Where can people connect with you to go deeper with your work and so forth?\u003c/p\u003e\n\u003cp\u003eYeah, the kind of umbrella website is mbs.works, W-O-R-K-S, mbs.works. And if you’re particularly interested in The Coaching Habit, you can go to thecoachinghabit.com and there’s videos and downloads and other, all sorts of free stuff that you can pillage if you’re into that sort of stuff.\u003c/p\u003e\n\u003cp\u003eThank you. I highly recommend checking out all of those books, but especially The Coaching Habit, that was a game changer. We’ve talked about it a lot on here. There’s seven questions. They’re locked in my mind, but it goes into much more detail in the book and online as well. So definitely check that out. Final question, if you had one message for brand builders, trying to grow without burning out, what would it be?\u003c/p\u003e\n\u003cp\u003eI picked one of the questions from The Coaching Habit book, the strategy question. And the strategy question is, what am I saying yes to? If I’m going to say yes to that, what must I say no to? And it is a hard question, but if burning out is the thing that you’re looking to overcome, getting more fierce with the things you’re truly committed to, and doing fewer of them, and getting fiercer to the things you say no to is some way towards that.\u003c/p\u003e\n\u003cp\u003eThank you. Thank you so much, Michael. It has been a pleasure. Absolute pleasure. So much wisdom advice in here. As much as you don’t want to call it advice, it’s been very, very helpful.\u003c/p\u003e\n\u003cp\u003eOh, I’m all up for advice. I’m just trying not to get the default response of advice.\u003c/p\u003e\n\u003cp\u003eOkay.\u003c/p\u003e\n\u003cp\u003eYou’ve been awesome, Michael. Thank you for coming on the show.\u003c/p\u003e\n\u003cp\u003eYeah, my pleasure. Thanks, Matt. Thanks, Jacob.\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "71 min read",
  "publishedTime": "2025-05-30T03:48:52-04:00",
  "modifiedTime": null
}
