{
  "id": "e8fcebb1-98ad-409b-9606-4ac1acf8d117",
  "title": "Running UX as a business (like we should have all along)",
  "link": "https://uxdesign.cc/running-user-experience-teams-like-a-business-like-we-should-have-all-along-02085c3667b2?source=rss----138adf9c44c---4",
  "description": "",
  "author": "Patrick Neeman",
  "published": "Sun, 18 May 2025 11:27:55 GMT",
  "source": "https://uxdesign.cc/feed",
  "categories": [
    "research",
    "user-experience",
    "ai",
    "ux",
    "business"
  ],
  "byline": "Patrick Neeman",
  "length": 12834,
  "excerpt": "For way too long we’ve been running user experience teams like they’re some kind of magical creative unicorns that should somehow be immune to business realities. Our teams need to deliver value, not…",
  "siteName": "UX Collective",
  "favicon": "https://miro.medium.com/v2/resize:fill:256:256/1*dn6MbbIIlwobt0jnUcrt_Q.png",
  "text": "Aligning design leadership with business goals is the motion we needed from the startFor way too long we’ve been running user experience teams like they’re some kind of magical creative unicorns that should somehow be immune to business realities.That’s complete nonsense.Our teams need to deliver value, not just pretty pictures or endless research projects with a lot of hand waving. We should be thinking about our teams like a CEO thinks about their business — with clear goals, measurements, and accountability for results.I’ve seen organizations where design was treated as a cost center rather than a strategic advantage, and this happens because we haven’t been willing to demonstrate our value in terms executives actually care about — outcomes and the bottom line.The best UX leaders run their teams like strategic businesses within the larger organization, with a focus on delivering measurable outcomes.A lot of the concepts below are not new — hence the links to resources — we have just chosen to ignore them. We need to leverage what’s proven to work so we can forward as a construct.It’s time we grew up and started treating user experience like the business function it truly is — Here’s how we can get there.Map to Business OutcomesNothing matters more than tying UX work to business outcomes. If you can’t explain how your design improves conversion, reduces support costs, or drives retention, you’re just drawing pretty pictures.Too many user experience teams waste time on work that doesn’t move important metrics. They design in a vacuum, divorced from what actually matters to the business. This is career suicide in today’s environment where every team needs to justify their existence.When approaching any project, your first question should be: “What business outcome will this improve?” If you don’t have a clear answer, stop everything until you do.The best design leaders start every presentation with a problem in business terms first, then explain how to addresses it. This approach changes how executives perceive your value.Remember that executives don’t care about your amazing journey map — they care about results.Leverage Research to Manage RiskResearch isn’t just about making users happy, it’s about managing business risk. Every design decision represents potential risk, and good research helps mitigate that risk before you commit significant resources to a direction.When you frame research as risk management, executives suddenly get a lot more interested. Nobody wants to launch a product that fails spectacularly in the market.On a panel, I was asked how do I innovate, and I said something along the lines of I don’t believe in innovation, I believe in managing risk. It’s about making the right small bets until you need to make a big bet that’s informed.Evaluative research shows us where the landmines are before we step on them. It’s like having insurance for your product development process.I’ve worked with companies that saved millions by catching major usability and strategic direction issues before launch through simple testing. That’s not a design win — that’s a business win that came through smart risk management.A lot of this is how you frame your research within business terms — don’t say “users didn’t like it.” Say “we identified a risk that could potentially impact our projected revenue by 15% if we launch as planned.”Agile processes are time-boxed way of measuring value and having mileposts along the way. The word “Sprint” creates a sense of urgency, by design.Time Box Projects To Demonstrate ValueI’m a huge believer in time boxing design work, putting names and dates to drive ownership. Nothing focuses the mind quite like a declared deadline and limited resources.This isn’t about rushing — it’s about being realistic about the diminishing economic returns that come with endless refinement.Time is money. By establishing measurement points, we show stakeholders they are getting value for what they are paying for.Parkinson’s Law, which was published in a 1955 issue of The Economist, states that “work expands so as to fill the time available for its completion,” and I’ve seen this play out countless times in design projects. Give a resource three weeks, and they’ll deliver in three weeks. Give them three months, and they’ll take three months and the solution might not be substantially better.Good user experience leaders understand when to call a design “good enough” and move on, especially in today’s environment. I’ve found that setting aggressive but achievable time boxes forces teams to focus on solving the core problems rather than endless refinement of edge cases.The real reason there was a drive towards agile processes was this — it’s one big time box exercise. It’s a way of driving measurable value.The real world moves fast, and a pretty good solution shipped today usually beats a perfect solution shipped six months from now. The word “Sprint” creates a sense of urgency, by design.As much as we don’t like to admit this, we aren’t inventing fire. We should design into what we have until there’s a clear decision to do something radically different for business reasons.Design into Your Existing Application, Not Around ItOne of the most expensive mistakes I see UX teams make is constantly trying to reinvent the wheel. Every new feature becomes an excuse to redesign everything from scratch, creating massive development costs and confusing users who have to relearn your interface.Jakob’s Law reminds us that users spend most of their time using other products, so they prefer your site to work the same way as all the other sites they already know, including your own.When you design within and in addition to existing patterns, you’re leveraging the learning users already have, reducing cognitive load and development costs simultaneously.I worked with a team that kept pushing for radical redesigns of their enterprise application that would have cost a lot of money, but what actually moved their metrics was incremental improvements that maintained consistency with what users already understood.Redesigns are expensive and unless they are proven to be dramatically better, they hurt engagement which is money poured down the drain. One of the best examples is Microsoft’s Metro Design Langugage — transformative but too different for users to accept.The best UX teams I know understand the difference between innovation that matters and innovation for its own sake. Save your revolutionary thinking for where it truly adds value.Atomic design is a mental model that creates a shared language designers can align on. That saves money and time in any environment.Create Design Systems as a Shared LanguageDesign systems aren’t just about making things look consistent — they’re about creating massive business efficiency and a shared language that aligns organizations.When every designer reinvents buttons, forms, and navigation patterns from scratch and gives them names that are non-sensical, you’re burning money that could be spent solving actual user problems.As Nathan Curtis wisely put it, “A design system isn’t a project. It’s a product serving products.”When you treat your design system as a product, you’re investing in something that pays dividends across your entire portfolio. It’s the difference between buying assets and renting them over and over again. The organizations that get the most value from their UX teams are those that establish and maintain robust design systems.These systems dramatically reduce design and development time, create consistency for users, and allow teams to focus on solving unique problems rather than redesigning form fields for the hundredth time.The business case is clear — design systems aren’t a luxury, they’re a competitive necessity that scales teams.The problem with the double diamond isn’t the labels, but the size of the diamonds themselves — sometimes the problem is clearly evident, and the solution just has to be worked through.Process with Intent, Not for Process’ SakeA lot of UX processes are just religious dogma that people follow without understanding why. I don’t want a process; I want results.That’s why I call them frameworks, not processes — frameworks can be adapted based on the specific challenge you’re facing. Processes sound like you have to follow every step.For example, the concerns I have with the double diamond or design thinking isn’t the labels, but the size of the steps themselves — sometimes the problem is clearly evident, and the solution just has to be worked through. Your approach should be tailored to the problem you are facing.All design approaches are non-linear and we should act accordingly.I’ve seen teams waste weeks on journey maps that never influenced a single design decision. I’ve watched designers conduct extensive user research when the key insights were obvious after the third interview. Blindly following processes without understanding their purpose is just busy work masquerading as UX.Sometimes you need to skip steps. Sometimes you need to adapt the framework to fit your constraints. The best UX leaders know when to follow the book and when to throw it out the window. Your job isn’t to follow a perfect process — it’s to deliver business value in the most efficient way possible.If your process is getting in the way of outcomes, you have the wrong process.Use and Improve Existing Mental Models —Especially in the Time of AIAs we rush headlong into the AI revolution, we don’t need to reinvent how humans interact with technology.Conversational design leverages mental models people already have— they know how to ask questions and have discussions, and have done so for years with existing applications with Natural Language Processing as an example.These mental models are why chatbots and conversational interfaces feel intuitive despite being relatively new.The most successful AI implementations I’ve seen build on familiar interaction patterns rather than forcing users to learn entirely new ways of working. They understand that users already have well-established mental models about how to get things done and teaching new ones is challenging.Smart teams leverage existing models instead of creating cognitive friction because learning new ones cost money and time. That’s good design.This is about being pragmatic, not lazy. When you tap into existing mental models, you reduce the learning curve for your users, which means faster adoption and less resistance to change. You’re making your AI features feel like a natural extension of what users already know rather than an alien imposition.In any gold rush, the winners won’t be those with the most advanced algorithms, but those who make the technology feel most natural and accessible.Craft Costs Money; Use It WiselyLet’s get real about craft — every pixel you perfect costs the company money. Those extra hours spent on subtle animations, perfect typography, and delightful interactions represent real investment that needs to justify itself in business outcomes.This doesn’t mean we abandon craft, it means we need to be strategic about where we invest.The login screen users see once a month probably doesn’t deserve the same level of craft as the core workflow they use every day.I’ve worked with designers who fought for weeks to perfect details that users never noticed, while ignoring fundamental usability issues that were costing the company customers. The best designers I know have a keen sense of where craft translates to business value and where it’s just self-indulgence.Good UX leaders understand how to allocate their craft budget where it matters most to impact the bottom line. They pick their battles carefully and invest their craft where it delivers the most impact for users and for the business.Running UX Like a BusinessAt the end of the day, running your UX team like a business means taking accountability for results, not just activities. It means speaking the language of the organization and showing how design drives business outcomes. It means being strategic about where you invest your limited resources for maximum impact.The most successful UX leaders I’ve worked with don’t hide behind buzzwords or mystify their process — They’re clear about the value they deliver, ruthless about prioritization, and focused on metrics that matter to the business.They understand that UX isn’t a special snowflake that exists outside normal business considerations — it’s a critical business function that needs to demonstrate ROI.If you want your team to get the respect, budget, and influence it deserves, start running it like the CEO of a business, not like the head of an art department.The days of UX getting a pass on business accountability are over, and that’s actually a good thing for all of us.",
  "image": "https://miro.medium.com/v2/resize:fit:1200/0*Ld9aMb3MJZr9rpLB.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch2 id=\"e887\"\u003eAligning design leadership with business goals is the motion we needed from the start\u003c/h2\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca href=\"https://medium.com/@usabilitycounts?source=post_page---byline--02085c3667b2---------------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Patrick Neeman\" src=\"https://miro.medium.com/v2/resize:fill:64:64/1*DlFu1ECdE9gRj-XJ-31gzA.jpeg\" width=\"32\" height=\"32\" loading=\"lazy\" data-testid=\"authorPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"0e4e\"\u003e\u003cstrong\u003eFor way too long we’ve been running user experience teams like they’re some kind of magical creative unicorns that should somehow be immune to business realities.\u003c/strong\u003e\u003c/p\u003e\u003cp id=\"55b4\"\u003eThat’s complete nonsense.\u003c/p\u003e\u003cp id=\"aaa8\"\u003eOur teams need to deliver value, not just pretty pictures or endless research projects with a lot of hand waving. We should be thinking about our teams like a CEO thinks about their business — with clear goals, measurements, and accountability for results.\u003c/p\u003e\u003cp id=\"0c67\"\u003eI’ve seen organizations where design was treated as a cost center rather than a strategic advantage, and this happens because we haven’t been willing to demonstrate our value in terms executives actually care about — outcomes and the bottom line.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"63be\"\u003eThe best UX leaders run their teams like strategic businesses within the larger organization, with a focus on delivering measurable outcomes.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"e49d\"\u003eA lot of the concepts below are not new — hence the links to resources — we have just chosen to ignore them. We need to leverage what’s proven to work so we can forward as a construct.\u003c/p\u003e\u003cp id=\"8848\"\u003e\u003cstrong\u003eIt’s time we grew up and started treating user experience like the business function it truly is — Here’s how we can get there.\u003c/strong\u003e\u003c/p\u003e\u003ch2 id=\"b71f\"\u003eMap to Business Outcomes\u003c/h2\u003e\u003cp id=\"2ac9\"\u003eNothing matters more than tying UX work to business outcomes. If you can’t explain how your design improves conversion, reduces support costs, or drives retention, you’re just drawing pretty pictures.\u003c/p\u003e\u003cp id=\"523a\"\u003eToo many user experience teams waste time on work that doesn’t move important metrics. They design in a vacuum, divorced from what actually matters to the business. This is career suicide in today’s environment where every team needs to justify their existence.\u003c/p\u003e\u003cp id=\"9204\"\u003eWhen approaching any project, your first question should be: “What business outcome will this improve?” If you don’t have a clear answer, stop everything until you do.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"8c1d\"\u003eThe best design leaders start every presentation with a problem in business terms first, then explain how to addresses it. This approach changes how executives perceive your value.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"918f\"\u003e\u003cstrong\u003eRemember that executives don’t care about your amazing journey map — they care about results.\u003c/strong\u003e\u003c/p\u003e\u003ch2 id=\"edff\"\u003eLeverage Research to Manage Risk\u003c/h2\u003e\u003cp id=\"0e32\"\u003eResearch isn’t just about making users happy, it’s about managing business risk. Every design decision represents potential risk, and good research helps mitigate that risk before you commit significant resources to a direction.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"9a95\"\u003eWhen you frame research as risk management, executives suddenly get a lot more interested. Nobody wants to launch a product that fails spectacularly in the market.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"2f0d\"\u003eOn a panel, I was asked how do I innovate, and I said something along the lines of I don’t believe in innovation, I believe in managing risk. It’s about making the right small bets until you need to make a big bet that’s informed.\u003c/p\u003e\u003cp id=\"1433\"\u003eEvaluative research shows us where the landmines are before we step on them. It’s like having insurance for your product development process.\u003c/p\u003e\u003cp id=\"48f8\"\u003eI’ve worked with companies that saved millions by catching major usability and strategic direction issues before launch through simple testing. That’s not a design win — that’s a business win that came through smart risk management.\u003c/p\u003e\u003cp id=\"eb05\"\u003e\u003cstrong\u003eA lot of this is how you frame your research within business terms — don’t say “users didn’t like it.” Say “we identified a risk that could potentially impact our projected revenue by 15% if we launch as planned.”\u003c/strong\u003e\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003ca href=\"https://www.wrike.com/project-management-guide/faq/what-is-agile-methodology-in-project-management/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eAgile processes\u003c/a\u003e are time-boxed way of measuring value and having mileposts along the way. The word “Sprint” creates a sense of urgency, by design.\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2 id=\"ef88\"\u003eTime Box Projects To Demonstrate Value\u003c/h2\u003e\u003cp id=\"feee\"\u003eI’m a huge believer in time boxing design work, putting names and dates to drive ownership. Nothing focuses the mind quite like a declared deadline and limited resources.\u003c/p\u003e\u003cp id=\"cb33\"\u003eThis isn’t about rushing — it’s about being realistic about the diminishing economic returns that come with endless refinement.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"54b6\"\u003eTime is money. By establishing measurement points, we show stakeholders they are getting value for what they are paying for.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"18bf\"\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Parkinson%27s_law\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eParkinson’s Law\u003c/a\u003e, which was published in a 1955 issue of \u003ca href=\"https://www.economist.com/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eThe Economist\u003c/a\u003e, states that “work expands so as to fill the time available for its completion,” and I’ve seen this play out countless times in design projects. Give a resource three weeks, and they’ll deliver in three weeks. Give them three months, and they’ll take three months and the solution might not be substantially better.\u003c/p\u003e\u003cp id=\"65c3\"\u003eGood user experience leaders understand when to call a design “good enough” and move on, especially in today’s environment. I’ve found that setting aggressive but achievable time boxes forces teams to focus on solving the core problems rather than endless refinement of edge cases.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"9bcc\"\u003eThe real reason there was a drive towards \u003ca href=\"https://en.wikipedia.org/wiki/Agile_software_development\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eagile processes\u003c/a\u003e was this — it’s one big time box exercise. It’s a way of driving measurable value.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"b0ff\"\u003eThe real world moves fast, and a pretty good solution shipped today usually beats a perfect solution shipped six months from now. The word “Sprint” creates a sense of urgency, by design.\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eAs much as we don’t like to admit this, we aren’t inventing fire. We should design into what we have until there’s a clear decision to do something radically different for business reasons.\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2 id=\"b765\"\u003eDesign into Your Existing Application, Not Around It\u003c/h2\u003e\u003cp id=\"d50f\"\u003eOne of the most expensive mistakes I see UX teams make is constantly trying to reinvent the wheel. Every new feature becomes an excuse to redesign everything from scratch, creating massive development costs and confusing users who have to relearn your interface.\u003c/p\u003e\u003cp id=\"aad0\"\u003e\u003ca href=\"https://www.nngroup.com/articles/end-of-web-design/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eJakob’s Law\u003c/a\u003e reminds us that users spend most of their time using other products, so they prefer your site to work the same way as all the other sites they already know, including your own.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"6818\"\u003eWhen you design within and in addition to existing patterns, you’re leveraging the learning users already have, reducing cognitive load and development costs simultaneously.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"3beb\"\u003eI worked with a team that kept pushing for radical redesigns of their enterprise application that would have cost a lot of money, but what actually moved their metrics was incremental improvements that maintained consistency with what users already understood.\u003c/p\u003e\u003cp id=\"d664\"\u003eRedesigns are expensive and unless they are proven to be dramatically better, they hurt engagement which is money poured down the drain. One of the best examples is \u003ca href=\"https://en.wikipedia.org/wiki/Metro_(design_language)\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eMicrosoft’s Metro Design Langugage\u003c/a\u003e — transformative but too different for users to accept.\u003c/p\u003e\u003cp id=\"3e2f\"\u003e\u003cstrong\u003eThe best UX teams I know understand the difference between innovation that matters and innovation for its own sake. Save your revolutionary thinking for where it truly adds value.\u003c/strong\u003e\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eAtomic design is a mental model that creates a shared language designers can align on. That saves money and time in any environment.\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2 id=\"f627\"\u003eCreate Design Systems as a Shared Language\u003c/h2\u003e\u003cp id=\"ea8b\"\u003eDesign systems aren’t just about making things look consistent — they’re about creating massive business efficiency and a shared language that aligns organizations.\u003c/p\u003e\u003cp id=\"581b\"\u003eWhen every designer reinvents buttons, forms, and navigation patterns from scratch and gives them names that are non-sensical, you’re burning money that could be spent solving actual user problems.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"62a0\"\u003eAs Nathan Curtis wisely put it, “\u003ca href=\"https://medium.com/eightshapes-llc/a-design-system-isn-t-a-project-it-s-a-product-serving-products-74dcfffef935\" rel=\"noopener\"\u003eA design system isn’t a project. It’s a product serving products.\u003c/a\u003e”\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"35f7\"\u003eWhen you treat your design system as a product, you’re investing in something that pays dividends across your entire portfolio. It’s the difference between buying assets and renting them over and over again. The organizations that get the most value from their UX teams are those that establish and maintain robust design systems.\u003c/p\u003e\u003cp id=\"47d0\"\u003eThese systems dramatically reduce design and development time, create consistency for users, and allow teams to focus on solving unique problems rather than redesigning form fields for the hundredth time.\u003c/p\u003e\u003cp id=\"e155\"\u003e\u003cstrong\u003eThe business case is clear — design systems aren’t a luxury, they’re a competitive necessity that scales teams.\u003c/strong\u003e\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eThe problem with the double diamond isn’t the labels, but the size of the diamonds themselves — sometimes the problem is clearly evident, and the solution just has to be worked through.\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2 id=\"0f96\"\u003eProcess with Intent, Not for Process’ Sake\u003c/h2\u003e\u003cp id=\"7cae\"\u003eA lot of UX processes are just religious dogma that people follow without understanding why. I don’t want a process; I want results.\u003c/p\u003e\u003cp id=\"1ab0\"\u003eThat’s why I call them frameworks, not processes — frameworks can be adapted based on the specific challenge you’re facing. Processes sound like you have to follow every step.\u003c/p\u003e\u003cp id=\"8186\"\u003eFor example, the concerns I have with the \u003ca href=\"https://en.wikipedia.org/wiki/Double_Diamond_(design_process_model)\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003edouble diamond\u003c/a\u003e or \u003ca href=\"https://www.interaction-design.org/literature/article/5-stages-in-the-design-thinking-process#:~:text=Design%20thinking%20is%20an%20iterative,%2C%20Ideate%2C%20Prototype%20and%20Test.\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003edesign thinking\u003c/a\u003e isn’t the labels, but the size of the steps themselves — sometimes the problem is clearly evident, and the solution just has to be worked through. Your approach should be tailored to the problem you are facing.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"e308\"\u003eAll design approaches are non-linear and we should act accordingly.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"2905\"\u003eI’ve seen teams waste weeks on journey maps that never influenced a single design decision. I’ve watched designers conduct extensive user research when the key insights were obvious after the third interview. Blindly following processes without understanding their purpose is just busy work masquerading as UX.\u003c/p\u003e\u003cp id=\"1a78\"\u003eSometimes you need to skip steps. Sometimes you need to adapt the framework to fit your constraints. The best UX leaders know when to follow the book and when to throw it out the window. Your job isn’t to follow a perfect process — it’s to deliver business value in the most efficient way possible.\u003c/p\u003e\u003cp id=\"6b5d\"\u003e\u003cstrong\u003eIf your process is getting in the way of outcomes, you have the wrong process.\u003c/strong\u003e\u003c/p\u003e\u003ch2 id=\"1bbd\"\u003eUse and Improve Existing Mental Models —Especially in the Time of AI\u003c/h2\u003e\u003cp id=\"9976\"\u003eAs we rush headlong into the AI revolution, we don’t need to reinvent how humans interact with technology.\u003c/p\u003e\u003cp id=\"eb10\"\u003e\u003ca href=\"https://uxmag.com/articles/7-principles-of-conversational-design-banner\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eConversational design\u003c/a\u003e leverages mental models people already have— they know how to ask questions and have discussions, and \u003ca href=\"https://theinformed.life/2020/11/22/episode-49-phillip-hunter/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehave done so for years\u003c/a\u003e with existing applications with Natural Language Processing as an example.\u003c/p\u003e\u003cp id=\"777d\"\u003eThese mental models are why chatbots and conversational interfaces feel intuitive despite being relatively new.\u003c/p\u003e\u003cp id=\"b946\"\u003eThe most successful AI implementations I’ve seen build on familiar interaction patterns rather than forcing users to learn entirely new ways of working. They understand that users already have well-established mental models about how to get things done and teaching new ones is challenging.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"45b4\"\u003eSmart teams leverage existing models instead of creating cognitive friction because learning new ones cost money and time. That’s good design.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"9718\"\u003eThis is about being pragmatic, not lazy. When you tap into existing mental models, you reduce the learning curve for your users, which means faster adoption and less resistance to change. You’re making your AI features feel like a natural extension of what users already know rather than an alien imposition.\u003c/p\u003e\u003cp id=\"25d6\"\u003e\u003cstrong\u003eIn any gold rush, the winners won’t be those with the most advanced algorithms, but those who make the technology feel most natural and accessible.\u003c/strong\u003e\u003c/p\u003e\u003ch2 id=\"4158\"\u003eCraft Costs Money; Use It Wisely\u003c/h2\u003e\u003cp id=\"53c3\"\u003eLet’s get real about craft — every pixel you perfect costs the company money. Those extra hours spent on subtle animations, perfect typography, and delightful interactions represent real investment that needs to justify itself in business outcomes.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"8c4c\"\u003eThis doesn’t mean we abandon craft, it means we need to be strategic about where we invest.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"767b\"\u003eThe login screen users see once a month probably doesn’t deserve the same level of craft as the core workflow they use every day.\u003c/p\u003e\u003cp id=\"726e\"\u003eI’ve worked with designers who fought for weeks to perfect details that users never noticed, while ignoring fundamental usability issues that were costing the company customers. The best designers I know have a keen sense of where craft translates to business value and where it’s just self-indulgence.\u003c/p\u003e\u003cp id=\"90b3\"\u003e\u003cstrong\u003eGood UX leaders understand how to allocate their craft budget where it matters most to impact the bottom line. They pick their battles carefully and invest their craft where it delivers the most impact for users and for the business.\u003c/strong\u003e\u003c/p\u003e\u003ch2 id=\"8d10\"\u003eRunning UX Like a Business\u003c/h2\u003e\u003cp id=\"ecb6\"\u003eAt the end of the day, running your UX team like a business means taking accountability for results, not just activities. It means speaking the language of the organization and showing how design drives business outcomes. It means being strategic about where you invest your limited resources for maximum impact.\u003c/p\u003e\u003cp id=\"2958\"\u003eThe most successful UX leaders I’ve worked with don’t hide behind buzzwords or mystify their process — They’re clear about the value they deliver, ruthless about prioritization, and focused on metrics that matter to the business.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"82e3\"\u003eThey understand that UX isn’t a special snowflake that exists outside normal business considerations — it’s a critical business function that needs to demonstrate ROI.\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"0418\"\u003eIf you want your team to get the respect, budget, and influence it deserves, start running it like the CEO of a business, not like the head of an art department.\u003c/p\u003e\u003cp id=\"4b02\"\u003eThe days of UX getting a pass on business accountability are over, and that’s actually a good thing for all of us.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-05-17T15:21:28.442Z",
  "modifiedTime": null
}
