{
  "id": "f00d23a2-b889-4aab-a7aa-f1073842e79c",
  "title": "Collaboration: The Most Underrated UX Skill No One Talks About",
  "link": "https://smashingmagazine.com/2025/06/collaboration-most-underrated-ux-skill/",
  "description": "We often spotlight wireframes, research, or tools like Figma, but none of that moves the needle if we can’t collaborate well. Great UX doesn’t happen in isolation. It takes conversations with engineers, alignment with product, sales, and other stakeholders, and the ability to listen, adapt, and co-create. That’s where design becomes a team sport, and when your ability to capture the outcomes multiplies the UX impact.",
  "author": "Carrie Webster",
  "published": "Thu, 05 Jun 2025 08:00:00 GMT",
  "source": "https://www.smashingmagazine.com/feed",
  "categories": null,
  "byline": "About The Author",
  "length": 12906,
  "excerpt": "We often spotlight wireframes, research, or tools like Figma, but none of that moves the needle if we can’t collaborate well. Great UX doesn’t happen in isolation. It takes conversations with engineers, alignment with product, sales, and other stakeholders, and the ability to listen, adapt, and co-create. That’s where design becomes a team sport, and when your ability to capture the outcomes multiplies the UX impact.",
  "siteName": "Smashing Magazine",
  "favicon": "https://smashingmagazine.com/images/favicon/apple-touch-icon.png",
  "text": "10 min readUX, Workflow, Communication, TeamsWe often spotlight wireframes, research, or tools like Figma, but none of that moves the needle if we can’t collaborate well. Great UX doesn’t happen in isolation. It takes conversations with engineers, alignment with product, sales, and other stakeholders, as well as the ability to listen, adapt, and co-create. That’s where design becomes a team sport, and when your ability to capture the outcomes multiplies the UX impact.When people talk about UX, it’s usually about the things they can see and interact with, like wireframes and prototypes, smart interactions, and design tools like Figma, Miro, or Maze. Some of the outputs are even glamorized, like design systems, research reports, and pixel-perfect UI designs. But here’s the truth I’ve seen again and again in over two decades of working in UX: none of that moves the needle if there is no collaboration.Great UX doesn’t happen in isolation. It happens through conversations with engineers, product managers, customer-facing teams, and the customer support teams who manage support tickets. Amazing UX ideas come alive in messy Miro sessions, cross-functional workshops, and those online chats (e.g., Slack or Teams) where people align, adapt, and co-create.Some of the most impactful moments in my career weren’t when I was “designing” in the traditional sense. They have been gaining incredible insights when discussing problems with teammates who have varied experiences, brainstorming, and coming up with ideas that I never could have come up with on my own. As I always say, ten minds in a room will come up with ten times as many ideas as one mind. Often, many ideas are the most useful outcome.There have been times when a team has helped to reframe a problem in a workshop, taken vague and conflicting feedback, and clarified a path forward, or I’ve sat with a sales rep and heard the same user complaint show up in multiple conversations. This is when design becomes a team sport, and when your ability to capture the outcomes multiplies the UX impact.Why This Article Matters NowThe reason collaboration feels so urgent now is that the way we work since COVID has changed, according to a study published by the US Department of Labor. Teams are more cross-functional, often remote, and increasingly complex. Silos are easier to fall into, due to distance or lack of face-to-face contact, and yet alignment has never been more important. We can’t afford to see collaboration as a “nice to have” anymore. It’s a core skill, especially in UX, where our work touches so many parts of an organisation.Let’s break down what collaboration in UX really means, and why it deserves way more attention than it gets.What Is Collaboration In UX, Really?Let’s start by clearing up a misconception. Collaboration is not the same as cooperation.Cooperation: “You do your thing, I’ll do mine, and we’ll check in later.”Collaboration: “Let’s figure this out together and co-own the outcome.”Collaboration, as defined in the book Communication Concepts, published by Deakin University, involves working with others to produce outputs and/or achieve shared goals. The outcome of collaboration is typically a tangible product or a measurable achievement, such as solving a problem or making a decision. Here’s an example from a recent project:Recently, I worked on a fraud alert platform for a fintech business. It was a six-month project, and we had zero access to users, as the product had not yet hit the market. Also, the users were highly specialised in the B2B finance space and were difficult to find. Additionally, the team members I needed to collaborate with were based in Malaysia and Melbourne, while I am located in Sydney.Instead of treating that as a dead end, we turned inward: collaborating with subject matter experts, professional services consultants, compliance specialists, and customer support team members who had deep knowledge of fraud patterns and customer pain points. Through bi-weekly workshops using a Miro board, iterative feedback loops, and sketching sessions, we worked on design solution options. I even asked them to present their own design version as part of the process.This Miro board shows a series of design solutions created by team members as part of a design thinking workshop. It was conducted online. (Large preview)After months of iterating on the fraud investigation platform through these collaboration sessions, I ended up with two different design frameworks for the investigator’s dashboard. Instead of just presenting the “best one” and hoping for buy-in, I ran a voting exercise with PMs, engineers, SMEs, and customer support. Everyone had a voice. The winning design was created and validated with the input of the team, resulting in an outcome that solved many problems for the end user and was owned by the entire team. That’s collaboration!Multiple and ongoing design collaboration workshops as captured in this Miro board. Stakeholders could also return and comment at their convenience. (Large preview)It is definitely one of the most satisfying projects of my career.On the other hand, I recently caught up with an old colleague who now serves as a product owner. Her story was a cautionary tale: the design team had gone ahead with a major redesign of an app without looping her in until late in the game. Not surprisingly, the new design missed several key product constraints and business goals. It had to be scrapped and redone, with her now at the table. That experience reinforced what we all know deep down: your best work rarely happens in isolation.As illustrated in my experience, true collaboration can span many roles. It’s not just between designers and PMs. It can also include QA testers who identify real-world issues, content strategists who ensure our language is clear and inclusive, sales representatives who interact with customers on a daily basis, marketers who understand the brand’s voice, and, of course, customer support agents who are often the first to hear when something goes wrong. The best outcomes arrive when we’re open to different perspectives and inputs.Why Collaboration Is So Overlooked?If collaboration is so powerful, why don’t we talk about it more?In my experience, one reason is the myth of the “lone UX hero”. Many of us entered the field inspired by stories of design geniuses revolutionising products on their own. Our portfolios often reflect that as well. We showcase our solo work, our processes, and our wins. Job descriptions often reinforce the idea of the solo UX designer, listing tool proficiency and deliverables more than soft skills and team dynamics.And then there’s the team culture within many organisations of “just get the work done”, which often leads to fewer meetings and tighter deadlines. As a result, a sense of collaboration is inefficient and wasted. I have also experienced working with some designers where perfectionism and territoriality creep in — “This is my design” — which kills the open, communal spirit that collaboration needs.When Collaboration Is The User ResearchIn an ideal world, we’d always have direct access to users. But let’s be real. Sometimes that just doesn’t happen. Whether it’s due to budget constraints, time limitations, or layers of bureaucracy, talking to end users isn’t always possible. That’s where collaboration with team members becomes even more crucial.The next best thing to talking to users? Talking to the people who talk to users. Sales teams, customer success reps, tech support, and field engineers. They’re all user researchers in disguise!On another B2C project, the end users were having trouble completing the key task. My role was to redesign the onboarding experience for an online identity capture tool for end users. I was unable to schedule interviews with end users due to budget and time constraints, so I turned to the sales and tech support teams.I conducted multiple mini-workshops to identify the most common onboarding issues they had heard directly from our customers. This led to a huge “aha” moment: most users dropped off before the document capture process. They may have been struggling with a lack of instruction, not knowing the required time, or not understanding the steps involved in completing the onboarding process.That insight reframed my approach, and we ultimately redesigned the flow to prioritize orientation and clear instructions before proceeding to the setup steps. Below is an example of one of the screen designs, including some of the instructions we added.The screen design above includes some of the instructions we added after our design workshop outcomes. (Large preview)This kind of collaboration is user research. It’s not a substitute for talking to users directly, but it’s a powerful proxy when you have limited options.But What About Using AI?Glad you asked! Even AI tools, which are increasingly being used for idea generation, pattern recognition, or rapid prototyping, don’t replace collaboration; they just change the shape of it.AI can help you explore design patterns, draft user flows, or generate multiple variations of a layout in seconds. It’s fantastic for getting past creative blocks or pressure-testing your assumptions. But let’s be clear: these tools are accelerators, not oracles. As an innovation and strategy consultant Nathan Waterhouse points out, AI can point you in a direction, but it can’t tell you which direction is the right one in your specific context. That still requires human judgment, empathy, and an understanding of the messy realities of users and business goals.You still need people, especially those closest to your users, to validate, challenge, and evolve any AI-generated idea. For instance, you might use ChatGPT to brainstorm onboarding flows for a SaaS tool, but if you’re not involving customer support reps who regularly hear “I didn’t know where to start” or “I couldn’t even log in,” you’re just working with assumptions. The same applies to engineers who know what is technically feasible or PMs who understand where the business is headed.AI can generate ideas, but only collaboration turns those ideas into something usable, valuable, and real. Think of it as a powerful ingredient, but not the whole recipe.How To Strengthen Your UX Collaboration Skills?If collaboration doesn’t come naturally or hasn’t been a focus, that’s okay. Like any skill, it can be practiced and improved. Here are a few ways to level up:Cultivate curiosity about your teammates.Ask engineers what keeps them up at night. Learn what metrics your PMs care about. Understand the types of tickets the support team handles most frequently. The more you care about their challenges, the more they’ll care about yours.Get comfortable facilitating.You don’t need to be a certified Design Sprint master, but learning how to run a structured conversation, align stakeholders, or synthesize different points of view is hugely valuable. Even a simple “What’s working? What’s not?” retro can be an amazing starting point in identifying where you need to focus next.Share early, share often.Don’t wait until your designs are polished to get input. Messy sketches and rough prototypes invite collaboration. When others feel like they’ve helped shape the work, they’re more invested in its success.Practice active listening.When someone critiques your work, don’t immediately defend. Pause. Ask follow-up questions. Reframe the feedback. Collaboration isn’t about consensus; it’s about finding a shared direction that can honour multiple truths.Co-own the outcome.Let go of your ego. The best UX work isn’t “your” work. It’s the result of many voices, skill sets, and conversations converging toward a solution that helps users. It’s not “I”, it’s “we” that will solve this problem together.Conclusion: UX Is A Team SportGreat design doesn’t emerge from a vacuum. It comes from open dialogue, cross-functional understanding, and a shared commitment to solving real problems for real people.If there’s one thing I wish every early-career designer knew, it’s this:Collaboration is not a side skill. It’s the engine behind every meaningful design outcome. And for seasoned professionals, it’s the superpower that turns good teams into great ones.So next time you’re tempted to go heads-down and just “crank out a design,” pause to reflect. Ask who else should be in the room. And invite them in, not just to review your work, but to help create it.Because in the end, the best UX isn’t just what you make. It’s what you make together.Further Reading On SmashingMag“Presenting UX Research And Design To Stakeholders: The Power Of Persuasion,” Victor Yocco“Transforming The Relationship Between Designers And Developers,” Chris Day“Effective Communication For Everyday Meetings,” Andrii Zhdan“Preventing Bad UX Through Integrated Design Workflows,” Ceara Crawshaw (yk)",
  "image": "https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/collaboration-most-underrated-ux-skill.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article__content\"\u003e\u003cul\u003e\u003cli\u003e10 min read\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://smashingmagazine.com/category/ux\"\u003eUX\u003c/a\u003e,\n\u003ca href=\"https://smashingmagazine.com/category/workflow\"\u003eWorkflow\u003c/a\u003e,\n\u003ca href=\"https://smashingmagazine.com/category/communication\"\u003eCommunication\u003c/a\u003e,\n\u003ca href=\"https://smashingmagazine.com/category/teams\"\u003eTeams\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003csection aria-label=\"Quick summary\"\u003eWe often spotlight wireframes, research, or tools like Figma, but none of that moves the needle if we can’t collaborate well. Great UX doesn’t happen in isolation. It takes conversations with engineers, alignment with product, sales, and other stakeholders, as well as the ability to listen, adapt, and co-create. That’s where design becomes a team sport, and when your ability to capture the outcomes multiplies the UX impact.\u003c/section\u003e\u003c/p\u003e\u003cp\u003eWhen people talk about UX, it’s usually about the things they can see and interact with, like wireframes and prototypes, smart interactions, and design tools like Figma, Miro, or Maze. Some of the outputs are even glamorized, like design systems, research reports, and pixel-perfect UI designs. But here’s the truth I’ve seen again and again in over two decades of working in UX: none of that moves the needle if there is no collaboration.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eGreat UX doesn’t happen in isolation.\u003c/strong\u003e It happens through conversations with engineers, product managers, customer-facing teams, and the customer support teams who manage support tickets. Amazing UX ideas come alive in messy Miro sessions, cross-functional workshops, and those online chats (e.g., Slack or Teams) where people align, adapt, and co-create.\u003c/p\u003e\u003cp\u003eSome of the most impactful moments in my career weren’t when I was “designing” in the traditional sense. They have been gaining incredible insights when discussing problems with teammates who have varied experiences, brainstorming, and coming up with ideas that I never could have come up with on my own. As I always say, ten minds in a room will come up with ten times as many ideas as one mind. Often, many ideas are the most useful outcome.\u003c/p\u003e\u003cp\u003eThere have been times when a team has helped to reframe a problem in a workshop, taken vague and conflicting feedback, and clarified a path forward, or I’ve sat with a sales rep and heard the same user complaint show up in multiple conversations. This is when \u003cstrong\u003edesign becomes a team sport\u003c/strong\u003e, and when your ability to capture the outcomes multiplies the UX impact.\u003c/p\u003e\u003ch2 id=\"why-this-article-matters-now\"\u003eWhy This Article Matters Now\u003c/h2\u003e\u003cp\u003eThe reason collaboration feels so urgent now is that the way we work since COVID has changed, according to a \u003ca href=\"https://www.bls.gov/opub/btn/volume-13/remote-work-productivity.htm\"\u003estudy published by the US Department of Labor\u003c/a\u003e. Teams are more cross-functional, often remote, and increasingly complex. Silos are easier to fall into, due to distance or lack of face-to-face contact, and yet alignment has never been more important. We can’t afford to see collaboration as a “nice to have” anymore. It’s a \u003cstrong\u003ecore skill\u003c/strong\u003e, especially in UX, where our work touches so many parts of an organisation.\u003c/p\u003e\u003cp\u003eLet’s break down what collaboration in UX really means, and why it deserves way more attention than it gets.\u003c/p\u003e\u003ch2 id=\"what-is-collaboration-in-ux-really\"\u003eWhat Is Collaboration In UX, Really?\u003c/h2\u003e\u003cp\u003eLet’s start by clearing up a misconception. Collaboration is not the same as cooperation.\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eCooperation\u003c/strong\u003e: “You do your thing, I’ll do mine, and we’ll check in later.”\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eCollaboration\u003c/strong\u003e: “Let’s figure this out together and co-own the outcome.”\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eCollaboration, as defined in the \u003ca href=\"https://oercollective.caul.edu.au/communication-concepts/chapter/defining-collaboration/\"\u003ebook Communication Concepts\u003c/a\u003e, published by Deakin University, involves \u003cstrong\u003eworking with others to produce outputs\u003c/strong\u003e and/or achieve shared goals. The outcome of collaboration is typically a tangible product or a measurable achievement, such as solving a problem or making a decision. Here’s an example from a recent project:\u003c/p\u003e\u003cp\u003eRecently, I worked on a fraud alert platform for a fintech business. It was a six-month project, and we had zero access to users, as the product had not yet hit the market. Also, the users were highly specialised in the B2B finance space and were difficult to find. Additionally, the team members I needed to collaborate with were based in Malaysia and Melbourne, while I am located in Sydney.\u003c/p\u003e\u003cp\u003eInstead of treating that as a dead end, we turned inward: collaborating with subject matter experts, professional services consultants, compliance specialists, and customer support team members who had deep knowledge of fraud patterns and customer pain points. Through bi-weekly workshops using a Miro board, iterative feedback loops, and sketching sessions, we worked on \u003cstrong\u003edesign solution options\u003c/strong\u003e. I even asked them to present their own design version as part of the process.\u003c/p\u003e\u003cfigure\u003e\u003ca href=\"https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/1-miro-board.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" fetchpriority=\"low\" width=\"800\" height=\"364\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/1-miro-board.png 400w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_800/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/1-miro-board.png 800w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1200/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/1-miro-board.png 1200w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1600/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/1-miro-board.png 1600w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_2000/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/1-miro-board.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/1-miro-board.png\" sizes=\"100vw\" alt=\"A Miro board with design solutions\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eThis Miro board shows a series of design solutions created by team members as part of a design thinking workshop. It was conducted online. (\u003ca href=\"https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/1-miro-board.png\"\u003eLarge preview\u003c/a\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eAfter months of iterating on the fraud investigation platform through these collaboration sessions, I ended up with two different design frameworks for the investigator’s dashboard. Instead of just presenting the “best one” and hoping for buy-in, I ran a voting exercise with PMs, engineers, SMEs, and customer support. Everyone had a voice. The winning design was created and validated with the input of the team, resulting in an outcome that solved many problems for the end user and was \u003cstrong\u003eowned by the entire team\u003c/strong\u003e. That’s collaboration!\u003c/p\u003e\u003cfigure\u003e\u003ca href=\"https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/2-miro-board-design-collaboration-workshops.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" fetchpriority=\"low\" width=\"800\" height=\"421\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/2-miro-board-design-collaboration-workshops.png 400w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_800/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/2-miro-board-design-collaboration-workshops.png 800w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1200/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/2-miro-board-design-collaboration-workshops.png 1200w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1600/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/2-miro-board-design-collaboration-workshops.png 1600w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_2000/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/2-miro-board-design-collaboration-workshops.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/2-miro-board-design-collaboration-workshops.png\" sizes=\"100vw\" alt=\"Miro board with design collaboration workshops\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eMultiple and ongoing design collaboration workshops as captured in this Miro board. Stakeholders could also return and comment at their convenience. (\u003ca href=\"https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/2-miro-board-design-collaboration-workshops.png\"\u003eLarge preview\u003c/a\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eIt is definitely one of the most satisfying projects of my career.\u003c/p\u003e\u003cp\u003eOn the other hand, I recently caught up with an old colleague who now serves as a product owner. Her story was a cautionary tale: the design team had gone ahead with a major redesign of an app without looping her in until late in the game. Not surprisingly, the new design missed several key product constraints and business goals. It had to be scrapped and redone, with her now at the table. That experience reinforced what we all know deep down: your best work rarely happens in isolation.\u003c/p\u003e\u003cp\u003eAs illustrated in my experience, \u003cstrong\u003etrue collaboration can span many roles\u003c/strong\u003e. It’s not just between designers and PMs. It can also include QA testers who identify real-world issues, content strategists who ensure our language is clear and inclusive, sales representatives who interact with customers on a daily basis, marketers who understand the brand’s voice, and, of course, customer support agents who are often the first to hear when something goes wrong. The best outcomes arrive when we’re open to \u003cstrong\u003edifferent perspectives and inputs\u003c/strong\u003e.\u003c/p\u003e\u003ch2 id=\"why-collaboration-is-so-overlooked\"\u003eWhy Collaboration Is So Overlooked?\u003c/h2\u003e\u003cp\u003eIf collaboration is so powerful, why don’t we talk about it more?\u003c/p\u003e\u003cp\u003eIn my experience, one reason is the \u003ca href=\"https://socialinnovationsjournal.org/editions/75-disruptive-innovations/2908-let-s-bust-the-lone-hero-myth-the-role-of-collective-leadership-in-systems-change#:~:text=It%20requires%20an%20understanding%20of,affected%20by%20the%20targeted%20issue.\"\u003emyth of the “lone UX hero”\u003c/a\u003e. Many of us entered the field inspired by stories of design geniuses revolutionising products on their own. Our portfolios often reflect that as well. We showcase our solo work, our processes, and our wins. Job descriptions often reinforce the idea of the solo UX designer, listing tool proficiency and deliverables more than soft skills and team dynamics.\u003c/p\u003e\u003cp\u003eAnd then there’s the team culture within many organisations of “just get the work done”, which often leads to fewer meetings and tighter deadlines. As a result, a sense of collaboration is inefficient and wasted. I have also experienced working with some designers where perfectionism and territoriality creep in — “This is my design” — which kills the open, communal spirit that collaboration needs.\u003c/p\u003e\u003ch2 id=\"when-collaboration-is-the-user-research\"\u003eWhen Collaboration Is The User Research\u003c/h2\u003e\u003cp\u003eIn an ideal world, we’d always have direct access to users. But let’s be real. Sometimes that just doesn’t happen. Whether it’s due to budget constraints, time limitations, or layers of bureaucracy, talking to end users isn’t always possible. That’s where collaboration with team members becomes even more crucial.\u003c/p\u003e\u003cp\u003eThe next best thing to talking to users? Talking to the people who talk to users. Sales teams, customer success reps, tech support, and field engineers. They’re all user researchers in disguise!\u003c/p\u003e\u003cp\u003eOn another B2C project, the end users were having trouble completing the key task. My role was to redesign the onboarding experience for an online identity capture tool for end users. I was unable to schedule interviews with end users due to budget and time constraints, so I turned to the sales and tech support teams.\u003c/p\u003e\u003cp\u003eI conducted multiple mini-workshops to identify the most common onboarding issues they had heard directly from our customers. This led to a huge “aha” moment: most users dropped off before the document capture process. They may have been struggling with a lack of instruction, not knowing the required time, or not understanding the steps involved in completing the onboarding process.\u003c/p\u003e\u003cp\u003eThat insight reframed my approach, and we ultimately redesigned the flow to prioritize orientation and clear instructions before proceeding to the setup steps. Below is an example of one of the screen designs, including some of the instructions we added.\u003c/p\u003e\u003cfigure\u003e\u003ca href=\"https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/3-screen-design.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" fetchpriority=\"low\" width=\"800\" height=\"885\" srcset=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/3-screen-design.png 400w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_800/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/3-screen-design.png 800w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1200/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/3-screen-design.png 1200w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_1600/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/3-screen-design.png 1600w,\nhttps://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_2000/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/3-screen-design.png 2000w\" src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/3-screen-design.png\" sizes=\"100vw\" alt=\"A screen design\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eThe screen design above includes some of the instructions we added after our design workshop outcomes. (\u003ca href=\"https://files.smashing.media/articles/collaboration-most-underrated-ux-skill/3-screen-design.png\"\u003eLarge preview\u003c/a\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThis kind of collaboration \u003cem\u003eis\u003c/em\u003e user research. It’s not a substitute for talking to users directly, but it’s a \u003cstrong\u003epowerful proxy\u003c/strong\u003e when you have limited options.\u003c/p\u003e\u003ch2 id=\"but-what-about-using-ai\"\u003eBut What About Using AI?\u003c/h2\u003e\u003cp\u003eGlad you asked! Even AI tools, which are increasingly being used for idea generation, pattern recognition, or rapid prototyping, don’t replace collaboration; they just change the shape of it.\u003c/p\u003e\u003cp\u003eAI can help you explore design patterns, draft user flows, or generate multiple variations of a layout in seconds. It’s fantastic for getting past creative blocks or pressure-testing your assumptions. But let’s be clear: these tools are accelerators, not oracles. As an innovation and strategy consultant \u003ca href=\"https://www.linkedin.com/pulse/team-collaboration-does-ai-help-hinder-nathan-waterhouse-canse/\"\u003eNathan Waterhouse points out\u003c/a\u003e, AI can point you in a direction, but it can’t tell you which direction is the \u003cem\u003eright\u003c/em\u003e one in your specific context. That still requires human judgment, empathy, and an understanding of the messy realities of users and business goals.\u003c/p\u003e\u003cp\u003eYou still need people, especially those closest to your users, to validate, challenge, and evolve any AI-generated idea. For instance, you might use ChatGPT to brainstorm onboarding flows for a SaaS tool, but if you’re not involving customer support reps who regularly hear \u003cem\u003e“I didn’t know where to start”\u003c/em\u003e or \u003cem\u003e“I couldn’t even log in,”\u003c/em\u003e you’re just working with assumptions. The same applies to engineers who know what is technically feasible or PMs who understand where the business is headed.\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca aria-label=\"Share on Twitter\" href=\"https://twitter.com/share?text=%0aAI%20can%20generate%20ideas,%20but%20only%20collaboration%20turns%20those%20ideas%20into%20something%20usable,%20valuable,%20and%20real.%20Think%20of%20it%20as%20a%20powerful%20ingredient,%20but%20not%20the%20whole%20recipe.%0a\u0026amp;url=https://smashingmagazine.com%2f2025%2f06%2fcollaboration-most-underrated-ux-skill%2f\"\u003eAI can generate ideas, but only collaboration turns those ideas into something usable, valuable, and real. Think of it as a powerful ingredient, but not the whole recipe.\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003ch2 id=\"how-to-strengthen-your-ux-collaboration-skills\"\u003eHow To Strengthen Your UX Collaboration Skills?\u003c/h2\u003e\u003cp\u003eIf collaboration doesn’t come naturally or hasn’t been a focus, that’s okay. Like any skill, it can be practiced and improved. Here are a few ways to level up:\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eCultivate curiosity about your teammates.\u003c/strong\u003e\u003cbr/\u003eAsk engineers what keeps them up at night. Learn what metrics your PMs care about. Understand the types of tickets the support team handles most frequently. The more you care about their challenges, the more they’ll care about yours.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eGet comfortable facilitating.\u003c/strong\u003e\u003cbr/\u003eYou don’t need to be a certified Design Sprint master, but learning how to run a structured conversation, align stakeholders, or synthesize different points of view is hugely valuable. Even a simple “What’s working? What’s not?” retro can be an amazing starting point in identifying where you need to focus next.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eShare early, share often.\u003c/strong\u003e\u003cbr/\u003eDon’t wait until your designs are polished to get input. Messy sketches and rough prototypes invite collaboration. When others feel like they’ve helped shape the work, they’re more invested in its success.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003ePractice active listening.\u003c/strong\u003e\u003cbr/\u003eWhen someone critiques your work, don’t immediately defend. Pause. Ask follow-up questions. Reframe the feedback. Collaboration isn’t about consensus; it’s about finding a shared direction that can honour multiple truths.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eCo-own the outcome.\u003c/strong\u003e\u003cbr/\u003eLet go of your ego. The best UX work isn’t “your” work. It’s the result of many voices, skill sets, and conversations converging toward a solution that helps users. It’s not “I”, it’s “we” that will solve this problem together.\u003c/li\u003e\u003c/ol\u003e\u003ch2 id=\"conclusion-ux-is-a-team-sport\"\u003eConclusion: UX Is A Team Sport\u003c/h2\u003e\u003cp\u003eGreat design doesn’t emerge from a vacuum. It comes from \u003cstrong\u003eopen dialogue\u003c/strong\u003e, \u003cstrong\u003ecross-functional understanding\u003c/strong\u003e, and a \u003cstrong\u003eshared commitment\u003c/strong\u003e to solving real problems for real people.\u003c/p\u003e\u003cp\u003eIf there’s one thing I wish every early-career designer knew, it’s this:\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e\u003ca aria-label=\"Share on Twitter\" href=\"https://twitter.com/share?text=%0aCollaboration%20is%20not%20a%20side%20skill.%20It%e2%80%99s%20the%20engine%20behind%20every%20meaningful%20design%20outcome.%20And%20for%20seasoned%20professionals,%20it%e2%80%99s%20the%20superpower%20that%20turns%20good%20teams%20into%20great%20ones.%0a\u0026amp;url=https://smashingmagazine.com%2f2025%2f06%2fcollaboration-most-underrated-ux-skill%2f\"\u003eCollaboration is not a side skill. It’s the engine behind every meaningful design outcome. And for seasoned professionals, it’s the superpower that turns good teams into great ones.\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eSo next time you’re tempted to go heads-down and just “crank out a design,” pause to reflect. Ask who else should be in the room. And invite them in, not just to review your work, but to help create it.\u003c/p\u003e\u003cp\u003eBecause in the end, the best UX isn’t just what you make. It’s what you make \u003cem\u003etogether\u003c/em\u003e.\u003c/p\u003e\u003ch3 id=\"further-reading-on-smashingmag\"\u003eFurther Reading On SmashingMag\u003c/h3\u003e\u003cul\u003e\u003cli\u003e“\u003ca href=\"https://www.smashingmagazine.com/2024/06/presenting-ux-research-design-stakeholders/\"\u003ePresenting UX Research And Design To Stakeholders: The Power Of Persuasion\u003c/a\u003e,” Victor Yocco\u003c/li\u003e\u003cli\u003e“\u003ca href=\"https://www.smashingmagazine.com/2024/05/transforming-relationship-between-designers-developers/\"\u003eTransforming The Relationship Between Designers And Developers\u003c/a\u003e,” Chris Day\u003c/li\u003e\u003cli\u003e“\u003ca href=\"https://www.smashingmagazine.com/2022/10/effective-communication-everyday-meetings/\"\u003eEffective Communication For Everyday Meetings\u003c/a\u003e,” Andrii Zhdan\u003c/li\u003e\u003cli\u003e“\u003ca href=\"https://www.smashingmagazine.com/2022/04/ux-integrated-design-workflows/\"\u003ePreventing Bad UX Through Integrated Design Workflows\u003c/a\u003e,” Ceara Crawshaw\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cimg src=\"https://www.smashingmagazine.com/images/logo/logo--red.png\" alt=\"Smashing Editorial\" width=\"35\" height=\"46\" loading=\"lazy\" decoding=\"async\"/\u003e\n\u003cspan\u003e(yk)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-06-05T08:00:00Z",
  "modifiedTime": "2025-06-05T08:00:00Z"
}
