{
  "id": "faf40b05-c418-4a8c-8408-893454195698",
  "title": "A crisis of meaning in UX Design",
  "link": "https://uxdesign.cc/a-crisis-of-meaning-in-ux-design-0831b85a3fb5?source=rss----138adf9c44c---4",
  "description": "",
  "author": "James Harrison",
  "published": "Sun, 02 Mar 2025 13:55:18 GMT",
  "source": "https://uxdesign.cc/feed",
  "categories": [
    "design-thinking",
    "design",
    "ux-design",
    "ux",
    "product-design"
  ],
  "byline": "James Harrison",
  "length": 19015,
  "excerpt": "If you’re a UX Designer and you don’t live under a rock, you’ve probably caught wind of the sense that things in the industry are a little gloomy. What I hear from friends and colleagues is echoed…",
  "siteName": "UX Collective",
  "favicon": "https://miro.medium.com/v2/resize:fill:256:256/1*dn6MbbIIlwobt0jnUcrt_Q.png",
  "text": "Does UX design work feel meaningless lately? You’re not alone.Artwork by @JPdoodlingThe big emptyIf you’re a UX Designer and you don’t live under a rock, you’ve probably caught wind of the sense that things in the industry are a little gloomy. What I hear from friends and colleagues is echoed through linkedIn posts, medium articles, and industry forecasts abound: the work just feels a bit meaningless at the moment.Maybe you’ve found yourself asking why you got into UX in the first place? Maybe you like problem-solving. Maybe you were led here by a passion for design. Maybe you’re interested in people, or technology. Maybe it was so you had something to write clever articles about. Maybe you wanted to make a positive impact on a wide scale.But what parts of your job feel true to that today? Instead you’re burnt out,doing work you’re not proud of for reasons that you’re not passionate about, and feeling like you’re pushing pixels instead of doing stimulating work. When will this all change? Should you get a better job?What if there is no better job?Do you work for one of a shrinking number of very large corporations, and execute whims that aim to inflate shareholder prices and/or enrich weird billionaires? The compensation is good, and you might enjoy some stability, at least until the company restructures to spend more money on AI.Alternatively, you could roll the dice at a startup, work in a maybe-fun (beer!) but maybe-toxic (sexual harassment!) environment, creating window dressing for some fin-bro’s half-baked “disruptive” idea that likely can’t achieve profitability without exploiting a subset of people or breaking a law. Maybe it’ll work out and you’ll get some stocks. Maybe it won’t.If you want the moral high ground, you can go work for a non-profit, maybe a cause that you really believe in, or an arts institution. You’ll be poorly paid, but if your six roommates aren’t too loud you can sleep at night. That is until you realize that your NGO’s board is made up of the families and friends of the same aforementioned weird billionaires (who individually could probably afford to solve whatever problem your NGO attempts to fix), and that the non-profit’s dependance on major donors means that they fundamentally decide what you do and don’t do.What if there’s no job at all?Employment circumstances have changed. The labour market generally has slackened, and tech companies across the board have introduced cuts in the past few years. Maybe that’s affected you, maybe your LinkedIn page is filling up with folks who are #OpenToWork.In either case, you’re either frantically learning about or conveniently ignoring the loudening drumbeat of AI, watching companies pour money into what they won’t say but you know is the hope that the technology will advance enough to replace people– replace you maybe– and thus save money.You still need to work to live, what do you do?Panic? Maybe periodically, when you need to be up early the next morning. But most of the time you’re just going to go to work, do what you have to, and then go home and binge-watch yourself into oblivion. La dolce vita!I’m paraphrasing these sentiments of course, and obviously drawing on some hyperbolic examples to make my point. But designers aren’t feeling challenged right now, and that’s a concern for both designers and the people who employ them.2023: Design’s really bad yearDesigners, but for 2023. Artwork by Jim DavisIf you’re a non-designer reading this, no need to feel too left out. Stuff sucks! The malaise, that feeling that your work doesn’t matter? That’s kind of par for the course at the moment if you work in tech. Or maybe anywhere. Maybe not if you make cheese or shoes or something cool like that.But designers might be feeling the pain rather acutely at the moment. There’s been a dark cloud following design around for the past few years, and well– it’s got an amplifying effect on the bad vibes. At the start of 2024, UX Collective’s annual “state of UX” coined the term “late-stage UX”, which:is characterized by its market saturation, heavy focus on financial growth, commoditization, automation, and increased financialization. Corporations exert significant influence over the economy and society, and designers can only push so far when advocating for user needs.(Braga \u0026 Teixeira)Late-stage UX (what comes after the late stage?) laments the end of the party for UX, and maybe design at large, where a function that once loomed large now had to contend with its own decline in influence.Fast Company writer Robert Fabricant called 2023 “The closing of a chapter,” for Design. In his article “the big design freak-out”, he details what amounts to Design losing its “seat at the table”.After almost two decades of Apple-inspired upswing that saw design roles elevated into the boardroom, the rise of the “Design Thinking” practice, and massive demand for talent, the design bubble started to wobble, and then burst fully by the end of 2023. In 2024, Design continued its downward slide.(Fabricant)Today, CDO roles have faded. The design thinking era has ended (good riddance, IMO). Designers are in less demand, and under increasing threat of replacement. More than anything else, businesses have, on the whole, changed their attitude towards design, its value, and the type of work that designers should do.UX Collective’s annual “State of UX” for 2025, leaned further into the malaise:We’re handing our design systems to growth teams so they can squeeze every last penny out of customers. We’re optimizing our flows for clicks, not clarity. We stopped building tools and started building engagement traps. While in the past UX had a certain aura of care for users, in 2024 we are bluntly following the numbers. In many companies, the pursuit of growth is overshadowing the pursuit of meaning. (Braga \u0026 Teixeira)Things were going so well. What happened?From innovators to optimizers to machinesUX veterans might speak of “good old days” where design was more free, before the tyranny of the MVP sucked the soul out of the work, and discarded the time and space designers so desperately want to be able to think, reflect, and play.This photo of Jonathan Ive and David Rubenstein posing with the iMac in 1999 harkens back to an age where companies looked to design to innovate. (AP Photo/Susan Ragan)This occurred in a very specific context, a technological paradigm shift. The explosion of mobile, social, and cloud technologies reshaped the way we all live. The modern “tech” company emerged. In the innovation stage, design offered immense value to companies looking to distinguish their products and services. Businesses had technology they didn’t know how to wield, and so the designer acted as sense-maker, helping to translate capability into tangible, useful, and desirable products and experiences.In an environment where capturing users was competitive, designers became oracles for the voice of the user, protectors of all that was good and right in the world, and confident that they were the ones negotiating business goals with human needs.In 2004, Bill Breen (employee #1 at Fast Company) wrote:Most companies understand that a product must be more than the sum total of its functioning parts–because today’s customer first experiences a product through its design. Whether it’s Jonathan Ive’s iPod or Tom Ford’s final collection for Gucci, a product must speak to a customer’s emotions–and emotions are sparked by design. And so design, when it is done well, is deeply rooted in a corporation’s culture. It reflects the real idea behind a product and, by extension, behind the company that created it. Design shapes a company’s reason for being; it has become an undeniably transformative force in business and society. (Breen)Over the course of time the paradigm aged, and the space for innovation within it shrank. There’s some organic cyclical aspect to this through human history of course. The companies that found success in the space became massive, publicly traded companies (Amazon, Apple, Google, Meta, and Microsoft make up 5 of the top ten most valuable companies in the world at the time of writing. Three more in the top ten make semiconductors), and hoovered up smaller companies with great ideas or strong patents. (Daly, 2025)Tech CEOs might have chosen hooded sweatshirts over tailored suits, but just like every other company, turning a profit and delivering year-on-year shareholder value was now a must. The seed money, once seemingly being pumped into offices via a pipe in the ceiling, now had to come from things like sales, streams, subscriptions, ads, etc.Design’s value has always been less tangible than other disciplines. There’s good evidence that companies that invest in design perform better and deliver more value for investors, but the exact how is still elusive. Looking at design as a line on a spreadsheet, you can’t expect that companies who didn’t have their own “iPhone moments” to fully understand what they were paying for.In a cost conscious environment, with less opportunity for innovation to occur, there was a phase shift towards optimization. Make fewer things, and more money from those things. Spend less time on big ideas (the kind that designers tend to relish). It also demanded speed. Design’s “double diamond” process, once proudly championed in design thinking workshops everywhere, was just too slow. A drawn out discovery process could lose out to a gamble. A few high profile good guesses, and “going with your gut”, “big bets”, and (cringe) “founder mode” started to be thought of as a viable alternative (which it is, provided you ignore all the times it goes wrong).Design Council.org’s Double Diamond. Discover, Define, Develop, Deliver. Defunct?Unsurprisingly, what came along with this change was an ugly side, one where a product gets optimized for monetary gain at the expense of product quality (a process termed “Enshittification” by journalist Cory Doctorow). Note that the same tech companies that were once progressive, transformative innovators have been increasingly thought of as villainistic for reasons ranging from competition laws, to mental health, to privacy, to worker exploitation, to plain old price-gouging.Enshittification? A Google search for basketball tickets doesn’t put an organic result on the screen.Design always said no. Design always said it’ll take longer to do well. Design became an impediment to progress, to making more money! Maybe the engineers could just design the thing? The role of designers changed.The COVID-19 Pandemic may have been the last nail in the coffin for design’s elevated place in the world. For one, the sudden, widespread, change into remote work may have had accelerationist effects on design’s demise by literally taking designers out of the room. Design’s work as connective tissue within organizations evaporated. Digitally mediating workshops, getting anywhere with whiteboarding, or simply explaining the full round of a problem became more challenging. Second, if you weren’t making masks, vaccines, or ventilators, you were in full optimization mode. Companies were either massively surging (like food delivery services), or massively failing (like movie theatres), and regardless everyone found themselves scrambling to simply execute quickly. Design held up its end, and did less discovery, less validation, and ultimately less thinking to feed impatient engineering teams. That’s been the new expectation from that point forward to date.If you got into design because you like thinking, this change has made your work deeply understimulating. Designers used to talk about changing the world: dedicating your best years to increasing conversion on an ecommerce checkout is not exactly aspirational. It’s no wonder some folks think an AI could do the job (with fewer eye-rolls, too). The stunned silence in the crowd when Figma demoed its “first draft” feature at CONFIG 2024 (Where Figma’s AI could compose high fidelity wireframes based on a prompt) spoke volumes. For some, AI feels like an existential threat to their work, precisely because it fits into the optimization mode so well for companies.Designers might be partly to blame in all of this. We might have been too busy taking big jobs, expanding our teams, nodding knowingly in Design Thinking workshops, and congratulating ourselves for making yet another set of icons. Did we save the world yet?Designing ourselves out of complacencyI sat on writing about this issue for months, because while I could see the problem quite clearly, I didn’t have much in the way of a solution (and I’m trying to be less negative as a person). There’s no magic bullet here, but perhaps there are a few things we can try.One of the things designers don’t currently do well (not on the whole, anyways) is quantifying the time and effort of our work in terms of the value it brings to an organization. Can you truly say that in six weeks, you delivered something more valuable than you could have in four? How do you actually know? This is something that’s going to be crucial for design’s future, and it IS going to be uncomfortable. Would you ask Michelangelo to quantify the value of the Sistine Chapel? Maybe not, but Pope Julius DID reportedly threaten to have him thrown off the scaffolding if he didn’t finish it on time.Aligning design time and effort to business metrics and hypotheses might not be what you got into UX for, but it might be what keeps you there. Designers might have to swallow some pride here and sincerely ask themselves if the effort spent designing new components vs. reusing existing ones is actually worth it to the user, and thus to the business. Getting more agile and metric-centred– and communicating that value well back to your business– is crucial.Second, there are fields in which the paradigms and patterns are less established. AI is obviously one of them (someone please come up with something better than a chatbot). I’d put biotech, robotics, and cybersecurity in the same category. These are spaces that are innovating, not optimizing, and they’ll need smart designers to help guide how users can effectively interact with these new tools. That’s a potential pathway to meaningful work, and design ethics are both valuable and necessary to determine how these powerful technologies are wielded.Last, design can still lead from below. It’s not unusual for a designer to come to understand a solution to a problem, or even a valuable opportunity via their work. Finding ways to bring those ideas to life in a manner that doesn’t require taking weeks at a time away from other priorities IS possible, and it’s something all design leaders should be carving out space for folks to do. Here design is uniquely equipped to bring good ideas to life (a good idea trapped in a hacked powerpoint slide just doesn’t pack the same punch), and to propose and communicate a more cohesive direction for where products can go. Getting back in the room with whoever responds yes to a meeting is a great way of developing a shared vision, and one that brings design back to the table with something of value.The absolute worst thing, in my opinion, is to settle into complacency. Nothing is unchangeable, and if designers treat things as such, then they’re truly just accelerating the demise of their own discipline. The more designers act like lifeless automatons, the easier it is to replace them with lifeless automatons. The issues designers face today can’t solve themselves, and if you’re waiting around for someone to ask you about all your good ideas, you’re going to be waiting a long time. Trying and failing is worth it, if other people are at least considering the value design can bring.For design and company leaders, take note. Design needs a certain degree of idealism to function well. If you’re wise, you’ll do what you can to prevent complacency from infecting your teams, organization, and ultimately your products.Complacency all but guarantees that opportunities will be missed. Innovation and complacency don’t work well together. Bored talent leaves, or works on their own thing after hours. We’re not even talking about the next big thing– maybe rare, and not of much concern if you’re a company that just acquires innovation– but just the next good idea. John Maeda is right when he says “the route of greatest efficiency is rarely the most impactful. It might prevent us from reaching a more creatively meaningful destination”. Allowing designers space to do what they do best maximizes their value, making sure the best idea ships, not just the first one. But it also keeps them happy and engaged. If you don’t let dogs run off leash sometimes, you get a bunch of sad dogs (no one likes a sad dog). A designer’s evangelism can be just as contagious as their apathy.Through the process of writing this I spiralled more than a few times (“UX feels meaningless– what if everything is meaningless?, etc”), because I realized that I really do take meaning from the work that I do. I truly believe that design can positively impact the world, but on the days that it doesn’t, I think it’s important to remember that there’s meaning to be found outside of your job. Spend time with loved ones, look at the ocean, pet a cat. Whatever works.Thanks for reading. Find me on LinkedIn.SourcesBraga \u0026 Teixeira. Enter Late Stage UX, UX Trends, 2024. (https://trends.uxdesign.cc/2024)Fabricant, Robert. The big design freak out: A generation of design leaders grapples with their future, Fast Company, 2024. (https://www.fastcompany.com/91027996/the-big-design-freak-out-a-generation-of-design-leaders-grapple-with-their-future)Braga \u0026 Teixeira. A love letter about change, UX Trends, 2025. (https://trends.uxdesign.cc/2025_)Breen, Bill. Masters of Design, Fast Company, 2004. (https://www.fastcompany.com/49167/masters-of-design-2004)Daly, Lyle. The largest companies by market cap, February 2024, The Motley Fool, 2024. (https://www.fool.com/research/largest-companies-by-market-cap/#:~:text=Apple%20is%20the%20largest%20company,and%20Amazon%20($2.36%20trillion)._)Sheppard, Sarrazin, Kouyoumjian, \u0026 Dore. The Business Value of Design, McKinsey Quarterly, 2018. (https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/the-business-value-of-design)Design Council. The Double Diamond. (https://www.designcouncil.org.uk/our-resources/the-double-diamond/)Doctorow, Cory. Tiktok’s enshittification, Pluralistic, 2023. (Tiktok’s enshittification_)Config 2024: Figma product launch keynote, Youtube, 2024 (Config 2024: Figma product launch keynote_)Clement, Clara. Painters, Sculptors, Artists, Engravers and their works, 1873. (https://www.google.ca/books/edition/Painters_Sculptors_Architects_Engravers/bBNJAAAAIAAJ?hl=en\u0026gbpv=1\u0026dq=julius%20scaffolding%20throw\u0026pg=PA149\u0026printsec=frontcover)Monteiro, Mike. A designer’s Code of Ethics, Dear Design Student, 2017. (https://deardesignstudent.com/a-designers-code-of-ethics-f4a88aca9e95)",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*0keg11YDCEZ4lr_0whTg7g.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ch2 id=\"b69d\"\u003eDoes UX design work feel meaningless lately? You’re not alone.\u003c/h2\u003e\u003cdiv\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca href=\"https://jameswharrison.medium.com/?source=post_page---byline--0831b85a3fb5---------------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"James Harrison\" src=\"https://miro.medium.com/v2/resize:fill:88:88/1*eihE1xF482dA-Ux-z_SAVQ.png\" width=\"44\" height=\"44\" loading=\"lazy\" data-testid=\"authorPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca href=\"https://uxdesign.cc/?source=post_page---byline--0831b85a3fb5---------------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"UX Collective\" src=\"https://miro.medium.com/v2/resize:fill:48:48/1*mDhF9X4VO0rCrJvWFatyxg.png\" width=\"24\" height=\"24\" loading=\"lazy\" data-testid=\"publicationPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cfigure\u003e\u003cfigcaption\u003eArtwork by \u003ca href=\"https://www.instagram.com/jpdoodling/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003e@JPdoodling\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2 id=\"247f\"\u003eThe big empty\u003c/h2\u003e\u003cp id=\"3406\"\u003eIf you’re a UX Designer and you don’t live under a rock, you’ve probably caught wind of the sense that things in the industry are a little gloomy. What I hear from friends and colleagues is echoed through linkedIn posts, medium articles, and industry forecasts abound: the work just feels a bit meaningless at the moment.\u003c/p\u003e\u003cp id=\"6838\"\u003eMaybe you’ve found yourself asking why you got into UX in the first place? Maybe you like problem-solving. Maybe you were led here by a passion for design. Maybe you’re interested in people, or technology. Maybe it was so you had something to write clever articles about. Maybe you wanted to make a positive impact on a wide scale.\u003c/p\u003e\u003cp id=\"a6a0\"\u003eBut what parts of your job feel true to that today? Instead you’re burnt out,doing work you’re not proud of for reasons that you’re not passionate about, and feeling like you’re pushing pixels instead of doing stimulating work. When will this all change? Should you get a better job?\u003c/p\u003e\u003cp id=\"993d\"\u003e\u003cem\u003eWhat if there is no better job?\u003c/em\u003e\u003c/p\u003e\u003cp id=\"ded7\"\u003eDo you work for one of a shrinking number of very large corporations, and execute whims that aim to inflate shareholder prices and/or enrich weird billionaires? The compensation is good, and you might enjoy some stability, at least until the company restructures to spend more money on AI.\u003c/p\u003e\u003cp id=\"e446\"\u003eAlternatively, you could roll the dice at a startup, work in a maybe-fun (beer!) but maybe-toxic (sexual harassment!) environment, creating window dressing for some fin-bro’s half-baked “disruptive” idea that likely can’t achieve profitability without exploiting a subset of people or breaking a law. Maybe it’ll work out and you’ll get some stocks. Maybe it won’t.\u003c/p\u003e\u003cp id=\"6f9d\"\u003eIf you want the moral high ground, you can go work for a non-profit, maybe a cause that you really believe in, or an arts institution. You’ll be poorly paid, but if your six roommates aren’t too loud you can sleep at night. That is until you realize that your NGO’s board is made up of the families and friends of the same aforementioned weird billionaires (who individually could probably afford to solve whatever problem your NGO attempts to fix), and that the non-profit’s dependance on major donors means that they fundamentally decide what you do and don’t do.\u003c/p\u003e\u003cp id=\"a910\"\u003e\u003cem\u003eWhat if there’s no job at all?\u003c/em\u003e\u003c/p\u003e\u003cp id=\"cfcf\"\u003eEmployment circumstances have changed. The labour market generally has slackened, and tech companies across the board have introduced cuts in the past few years. Maybe that’s affected you, maybe your LinkedIn page is filling up with folks who are #OpenToWork.\u003c/p\u003e\u003cp id=\"796d\"\u003eIn either case, you’re either frantically learning about or conveniently ignoring the loudening drumbeat of AI, watching companies pour money into what they won’t say but you know is the hope that the technology will advance enough to replace people– \u003cem\u003ereplace you maybe\u003c/em\u003e– and thus save money.\u003c/p\u003e\u003cp id=\"c6b7\"\u003e\u003cem\u003eYou still need to work to live, what do you do?\u003c/em\u003e\u003c/p\u003e\u003cp id=\"1bab\"\u003ePanic? Maybe periodically, when you need to be up early the next morning. But most of the time you’re just going to go to work, do what you have to, and then go home and binge-watch yourself into oblivion. La dolce vita!\u003c/p\u003e\u003cp id=\"9eb8\"\u003eI’m paraphrasing these sentiments of course, and obviously drawing on some hyperbolic examples to make my point. But designers aren’t feeling challenged right now, and that’s a concern for both designers and the people who employ them.\u003c/p\u003e\u003ch2 id=\"050d\"\u003e2023: Design’s really bad year\u003c/h2\u003e\u003cfigure\u003e\u003cfigcaption\u003eDesigners, but for 2023. Artwork by Jim Davis\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"2717\"\u003eIf you’re a non-designer reading this, no need to feel too left out. Stuff sucks! The malaise, that feeling that your work doesn’t matter? That’s kind of par for the course at the moment if you work in tech. Or maybe anywhere. Maybe not if you make cheese or shoes or something cool like that.\u003c/p\u003e\u003cp id=\"5b5d\"\u003eBut designers might be feeling the pain rather acutely at the moment. There’s been a dark cloud following design around for the past few years, and well– it’s got an amplifying effect on the bad vibes. At the start of 2024, \u003ca href=\"https://trends.uxdesign.cc/2024\" rel=\"noopener\" target=\"_blank\"\u003eUX Collective’s annual “state of UX”\u003c/a\u003e coined the term “late-stage UX”, which:\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"f0b2\"\u003eis characterized by its market saturation, heavy focus on financial growth, commoditization, automation, and increased financialization. Corporations exert significant influence over the economy and society, and designers can only push so far when advocating for user needs.(Braga \u0026amp; Teixeira)\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"19b5\"\u003eLate-stage UX (what comes after the late stage?) laments the end of the party for UX, and maybe design at large, where a function that once loomed large now had to contend with its own decline in influence.\u003c/p\u003e\u003cp id=\"14ff\"\u003eFast Company writer Robert Fabricant called 2023 “The closing of a chapter,” for Design. In his article “\u003ca href=\"https://www.fastcompany.com/91027996/the-big-design-freak-out-a-generation-of-design-leaders-grapple-with-their-future\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ethe big design freak-out\u003c/a\u003e”, he details what amounts to Design losing its “seat at the table”.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"cfd3\"\u003eAfter almost two decades of Apple-inspired upswing that saw design roles elevated into the boardroom, the rise of the “Design Thinking” practice, and massive demand for talent, the design bubble started to wobble, and then burst fully by the end of 2023. In 2024, Design continued its downward slide.(Fabricant)\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"910f\"\u003eToday, CDO roles have faded. The design thinking era has ended (good riddance, IMO). Designers are in less demand, and under increasing threat of replacement. More than anything else, businesses have, on the whole, changed their attitude towards design, its value, and the type of work that designers should do.\u003c/p\u003e\u003cp id=\"74b1\"\u003e\u003ca href=\"https://trends.uxdesign.cc/2025\" rel=\"noopener\" target=\"_blank\"\u003eUX Collective’s annual “State of UX” for 2025\u003c/a\u003e, leaned further into the malaise:\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"a1e4\"\u003eWe’re handing our design systems to growth teams so they can squeeze every last penny out of customers. We’re optimizing our flows for clicks, not clarity. We stopped building tools and started building engagement traps. While in the past UX had a certain aura of care for users, in 2024 we are bluntly following the numbers. In many companies, the pursuit of growth is overshadowing the pursuit of meaning. (Braga \u0026amp; Teixeira)\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"09e3\"\u003eThings were going so well. What happened?\u003c/p\u003e\u003ch2 id=\"f092\"\u003eFrom innovators to optimizers to machines\u003c/h2\u003e\u003cp id=\"1b06\"\u003eUX veterans might speak of “good old days” where design was more free, before the tyranny of the MVP sucked the soul out of the work, and discarded the time and space designers so desperately want to be able to think, reflect, and play.\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eThis photo of Jonathan Ive and David Rubenstein posing with the iMac in 1999 harkens back to an age where companies looked to design to innovate. (AP Photo/Susan Ragan)\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"bbac\"\u003eThis occurred in a very specific context, a technological paradigm shift. The explosion of mobile, social, and cloud technologies reshaped the way we all live. The modern “tech” company emerged. In the innovation stage, design offered immense value to companies looking to distinguish their products and services. Businesses had technology they didn’t know how to wield, and so the designer acted as sense-maker, helping to translate capability into tangible, useful, and desirable products and experiences.\u003c/p\u003e\u003cp id=\"8a94\"\u003eIn an environment where capturing users was competitive, designers became oracles for the voice of the user, protectors of all that was good and right in the world, and confident that they were the ones negotiating business goals with human needs.\u003c/p\u003e\u003cp id=\"5baa\"\u003eIn 2004, Bill Breen (employee #1 at Fast Company) wrote:\u003c/p\u003e\u003cp id=\"0a35\"\u003eMost companies understand that a product must be more than the sum total of its functioning parts–because today’s customer first experiences a product through its design. Whether it’s Jonathan Ive’s iPod or Tom Ford’s final collection for Gucci, a product must speak to a customer’s emotions–and emotions are sparked by design. And so design, when it is done well, is deeply rooted in a corporation’s culture. It reflects the real idea behind a product and, by extension, behind the company that created it. Design shapes a company’s reason for being; it has become an undeniably transformative force in business and society. (\u003ca href=\"https://web.archive.org/web/20220925111428mp_/https://www.fastcompany.com/49167/masters-of-design-2004\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eBreen\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"f2b8\"\u003eOver the course of time the paradigm aged, and the space for innovation within it shrank. There’s some organic cyclical aspect to this through human history of course. The companies that found success in the space became massive, publicly traded companies (Amazon, Apple, Google, Meta, and Microsoft make up 5 of the top ten most valuable companies in the world at the time of writing. Three more in the top ten make semiconductors), and hoovered up smaller companies with great ideas or strong patents. (\u003ca href=\"https://www.fool.com/research/largest-companies-by-market-cap/#:~:text=Apple%20is%20the%20largest%20company,and%20Amazon%20(%242.36%20trillion)._\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eDaly, 2025\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"6a8f\"\u003eTech CEOs might have chosen hooded sweatshirts over tailored suits, but just like every other company, turning a profit and delivering year-on-year shareholder value was now a must. The seed money, once seemingly being pumped into offices via a pipe in the ceiling, now had to come from things like sales, streams, subscriptions, ads, etc.\u003c/p\u003e\u003cp id=\"3c50\"\u003eDesign’s value has always been less tangible than other disciplines. There’s \u003ca href=\"https://www.mckinsey.com/capabilities/mckinsey-design/our-insights/the-business-value-of-design\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003egood evidence\u003c/a\u003e that companies that invest in design perform better and deliver more value for investors, but the exact how is still elusive. Looking at design as a line on a spreadsheet, you can’t expect that companies who didn’t have their own “iPhone moments” to fully understand what they were paying for.\u003c/p\u003e\u003cp id=\"9b25\"\u003eIn a cost conscious environment, with less opportunity for innovation to occur, there was a phase shift towards optimization. Make fewer things, and more money from those things. Spend less time on big ideas (the kind that designers tend to relish). It also demanded speed. Design’s “\u003ca href=\"https://www.designcouncil.org.uk/our-resources/the-double-diamond/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003edouble diamond\u003c/a\u003e” process, once proudly championed in design thinking workshops everywhere, was just too slow. A drawn out discovery process could lose out to a gamble. A few high profile good guesses, and “going with your gut”, “big bets”, and (cringe) “founder mode” started to be thought of as a viable alternative (which it is, provided you ignore all the times it goes wrong).\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eDesign Council.org’s Double Diamond. Discover, Define, Develop, Deliver. Defunct?\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"0515\"\u003eUnsurprisingly, what came along with this change was an ugly side, one where a product gets optimized for monetary gain at the expense of product quality (a process termed “Enshittification” by journalist \u003ca href=\"https://pluralistic.net/2023/01/21/potemkin-ai/#hey-guys\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eCory Doctorow\u003c/a\u003e). Note that the same tech companies that were once progressive, transformative innovators have been increasingly thought of as villainistic for reasons ranging from competition laws, to mental health, to privacy, to worker exploitation, to plain old price-gouging.\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eEnshittification? A Google search for basketball tickets doesn’t put an organic result on the screen.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"fc3b\"\u003eDesign always said no. Design always said it’ll take longer to do well. Design became an impediment to progress, to making more money! Maybe the engineers could just design the thing? The role of designers changed.\u003c/p\u003e\u003cp id=\"48f4\"\u003eThe COVID-19 Pandemic may have been the last nail in the coffin for design’s elevated place in the world. For one, the sudden, widespread, change into remote work may have had accelerationist effects on design’s demise by literally taking designers out of the room. Design’s work as connective tissue within organizations evaporated. Digitally mediating workshops, getting anywhere with whiteboarding, or simply explaining the full round of a problem became more challenging. Second, if you weren’t making masks, vaccines, or ventilators, you were in full optimization mode. Companies were either massively surging (like food delivery services), or massively failing (like movie theatres), and regardless everyone found themselves scrambling to simply execute quickly. Design held up its end, and did less discovery, less validation, and ultimately less thinking to feed impatient engineering teams. That’s been the new expectation from that point forward to date.\u003c/p\u003e\u003cp id=\"90e0\"\u003eIf you got into design because you like thinking, this change has made your work deeply understimulating. Designers used to talk about changing the world: dedicating your best years to increasing conversion on an ecommerce checkout is not exactly aspirational. It’s no wonder some folks think an AI could do the job (with fewer eye-rolls, too). The stunned silence in the crowd \u003ca href=\"https://www.youtube.com/live/n5gJgkO2Dg0?si=iNFTj1NXskTPiF3W\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ewhen Figma demoed its “first draft” feature at CONFIG 2024\u003c/a\u003e (Where Figma’s AI could compose high fidelity wireframes based on a prompt) spoke volumes. For some, AI feels like an existential threat to their work, precisely because it fits into the optimization mode so well for companies.\u003c/p\u003e\u003cp id=\"bf7a\"\u003eDesigners might be partly to blame in all of this. We might have been too busy taking big jobs, expanding our teams, nodding knowingly in Design Thinking workshops, and congratulating ourselves for making yet another set of icons. Did we save the world yet?\u003c/p\u003e\u003ch2 id=\"b147\"\u003eDesigning ourselves out of complacency\u003c/h2\u003e\u003cp id=\"2af7\"\u003eI sat on writing about this issue for months, because while I could see the problem quite clearly, I didn’t have much in the way of a solution (and I’m trying to be less negative as a person). There’s no magic bullet here, but perhaps there are a few things we can try.\u003c/p\u003e\u003cp id=\"8afa\"\u003eOne of the things designers don’t currently do well (not on the whole, anyways) is quantifying the time and effort of our work in terms of the value it brings to an organization. Can you truly say that in six weeks, you delivered something more valuable than you could have in four? How do you actually know? This is something that’s going to be crucial for design’s future, and it IS going to be uncomfortable. Would you ask Michelangelo to quantify the value of the Sistine Chapel? Maybe not, but Pope Julius DID \u003ca href=\"https://www.google.ca/books/edition/Painters_Sculptors_Architects_Engravers/bBNJAAAAIAAJ?hl=en\u0026amp;gbpv=1\u0026amp;dq=julius+scaffolding+throw\u0026amp;pg=PA149\u0026amp;printsec=frontcover\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ereportedly\u003c/a\u003e threaten to have him thrown off the scaffolding if he didn’t finish it on time.\u003c/p\u003e\u003cp id=\"f6f6\"\u003eAligning design time and effort to business metrics and hypotheses might not be what you got into UX for, but it might be what keeps you there. Designers might have to swallow some pride here and sincerely ask themselves if the effort spent designing new components vs. reusing existing ones is actually worth it to the user, and thus to the business. Getting more agile and metric-centred– and communicating that value well back to your business– is crucial.\u003c/p\u003e\u003cp id=\"c9d2\"\u003eSecond, there are fields in which the paradigms and patterns are less established. AI is obviously one of them (someone please come up with something better than a chatbot). I’d put biotech, robotics, and cybersecurity in the same category. These are spaces that are innovating, not optimizing, and they’ll need smart designers to help guide how users can effectively interact with these new tools. That’s a potential pathway to meaningful work, and \u003ca href=\"https://deardesignstudent.com/a-designers-code-of-ethics-f4a88aca9e95\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003edesign ethics\u003c/a\u003e are both valuable and necessary to determine how these powerful technologies are wielded.\u003c/p\u003e\u003cp id=\"3baf\"\u003eLast, design can still lead from below. It’s not unusual for a designer to come to understand a solution to a problem, or even a valuable opportunity via their work. Finding ways to bring those ideas to life in a manner that doesn’t require taking weeks at a time away from other priorities IS possible, and it’s something all design leaders should be carving out space for folks to do. Here design is uniquely equipped to bring good ideas to life (a good idea trapped in a hacked powerpoint slide just doesn’t pack the same punch), and to propose and communicate a more cohesive direction for where products can go. Getting back in the room with whoever responds yes to a meeting is a great way of developing a shared vision, and one that brings design back to the table with something of value.\u003c/p\u003e\u003cp id=\"ba3f\"\u003eThe absolute worst thing, in my opinion, is to settle into complacency. Nothing is unchangeable, and if designers treat things as such, then they’re truly just accelerating the demise of their own discipline. The more designers act like lifeless automatons, the easier it is to replace them with lifeless automatons. The issues designers face today can’t solve themselves, and if you’re waiting around for someone to ask you about all your good ideas, you’re going to be waiting a long time. Trying and failing is worth it, if other people are at least considering the value design can bring.\u003c/p\u003e\u003cp id=\"18d4\"\u003eFor design and company leaders, take note. Design needs a certain degree of idealism to function well. If you’re wise, you’ll do what you can to prevent complacency from infecting your teams, organization, and ultimately your products.\u003c/p\u003e\u003cp id=\"8ed3\"\u003eComplacency all but guarantees that opportunities will be missed. Innovation and complacency don’t work well together. Bored talent leaves, or works on their own thing after hours. We’re not even talking about the next big thing– maybe rare, and not of much concern if you’re a company that just acquires innovation– but just the next good idea. John Maeda is right when he says “the route of greatest efficiency is rarely the most impactful. It might prevent us from reaching a more creatively meaningful destination”. Allowing designers space to do what they do best maximizes their value, making sure the best idea ships, not just the first one. But it also keeps them happy and engaged. If you don’t let dogs run off leash sometimes, you get a bunch of sad dogs (no one likes a sad dog). A designer’s evangelism can be just as contagious as their apathy.\u003c/p\u003e\u003cp id=\"3a7a\"\u003eThrough the process of writing this I spiralled more than a few times (“UX feels meaningless– what if everything is meaningless?, etc”), because I realized that I really do take meaning from the work that I do. I truly believe that design can positively impact the world, but on the days that it doesn’t, I think it’s important to remember that there’s meaning to be found outside of your job. Spend time with loved ones, look at the ocean, pet a cat. Whatever works.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"1035\"\u003e\u003cem\u003eThanks for reading. Find me on \u003c/em\u003e\u003ca href=\"https://www.linkedin.com/in/james-harrison-52103a1b/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003e\u003cem\u003eLinkedIn\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\u003ch2 id=\"b508\"\u003eSources\u003c/h2\u003e\u003cp id=\"8355\"\u003eBraga \u0026amp; Teixeira. Enter Late Stage UX, \u003cem\u003eUX Trends\u003c/em\u003e, 2024. (\u003ca href=\"https://trends.uxdesign.cc/2024\" rel=\"noopener\" target=\"_blank\"\u003ehttps://trends.uxdesign.cc/2024\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"a207\"\u003eFabricant, Robert. The big design freak out: A generation of design leaders grapples with their future, \u003cem\u003eFast Company\u003c/em\u003e, 2024. (\u003ca href=\"https://www.fastcompany.com/91027996/the-big-design-freak-out-a-generation-of-design-leaders-grapple-with-their-future\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehttps://www.fastcompany.com/91027996/the-big-design-freak-out-a-generation-of-design-leaders-grapple-with-their-future\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"232d\"\u003eBraga \u0026amp; Teixeira. A love letter about change, \u003cem\u003eUX Trends\u003c/em\u003e, 2025. (\u003ca href=\"https://trends.uxdesign.cc/2025\" rel=\"noopener\" target=\"_blank\"\u003ehttps://trends.uxdesign.cc/2025\u003c/a\u003e_)\u003c/p\u003e\u003cp id=\"4fe9\"\u003eBreen, Bill. Masters of Design, \u003cem\u003eFast Company\u003c/em\u003e, 2004. (\u003ca href=\"https://www.fastcompany.com/49167/masters-of-design-2004\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehttps://www.fastcompany.com/49167/masters-of-design-2004\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"41ee\"\u003eDaly, Lyle. The largest companies by market cap, February 2024, \u003cem\u003eThe Motley Fool\u003c/em\u003e, 2024. (\u003ca href=\"https://www.fool.com/research/largest-companies-by-market-cap/#:~:text=Apple%20is%20the%20largest%20company,and%20Amazon%20($2.36%20trillion)._\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehttps://www.fool.com/research/largest-companies-by-market-cap/#:~:text=Apple%20is%20the%20largest%20company,and%20Amazon%20($2.36%20trillion)._\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"47a0\"\u003eSheppard, Sarrazin, Kouyoumjian, \u0026amp; Dore. The Business Value of Design, \u003cem\u003eMcKinsey Quarterly\u003c/em\u003e, 2018. (\u003ca href=\"https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/the-business-value-of-design\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehttps://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/the-business-value-of-design\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"0fa8\"\u003eDesign Council. The Double Diamond. (\u003ca href=\"https://www.designcouncil.org.uk/our-resources/the-double-diamond/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehttps://www.designcouncil.org.uk/our-resources/the-double-diamond/\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"abe6\"\u003eDoctorow, Cory. Tiktok’s enshittification, \u003cem\u003ePluralistic\u003c/em\u003e, 2023. (\u003ca href=\"https://pluralistic.net/2023/01/21/potemkin-ai/#hey-guys\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eTiktok’s enshittification_\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"cb21\"\u003eConfig 2024: Figma product launch keynote, \u003cem\u003eYoutube\u003c/em\u003e, 2024 (\u003ca href=\"https://www.youtube.com/live/n5gJgkO2Dg0?si=UIiz9GFpzDMKVjMC\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eConfig 2024: Figma product launch keynote_\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"870f\"\u003eClement, Clara. \u003cem\u003ePainters, Sculptors, Artists, Engravers and their works,\u003c/em\u003e 1873. (\u003ca href=\"https://www.google.ca/books/edition/Painters_Sculptors_Architects_Engravers/bBNJAAAAIAAJ?hl=en\u0026amp;gbpv=1\u0026amp;dq=julius+scaffolding+throw\u0026amp;pg=PA149\u0026amp;printsec=frontcover\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehttps://www.google.ca/books/edition/Painters_Sculptors_Architects_Engravers/bBNJAAAAIAAJ?hl=en\u0026amp;gbpv=1\u0026amp;dq=julius%20scaffolding%20throw\u0026amp;pg=PA149\u0026amp;printsec=frontcover\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"73a3\"\u003eMonteiro, Mike. A designer’s Code of Ethics, \u003cem\u003eDear Design Student\u003c/em\u003e, 2017. (\u003ca href=\"https://deardesignstudent.com/a-designers-code-of-ethics-f4a88aca9e95\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003ehttps://deardesignstudent.com/a-designers-code-of-ethics-f4a88aca9e95\u003c/a\u003e)\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "20 min read",
  "publishedTime": "2025-03-02T13:55:18.409Z",
  "modifiedTime": null
}
