{
  "id": "fea5deb8-6a02-44b9-b0d4-0bd182ef05cc",
  "title": "How Duolingo, Nike, and Amazon use rewards to keep you hooked",
  "link": "https://uxdesign.cc/how-duolingo-nike-and-amazon-use-rewards-to-keep-you-hooked-1b91064636f4?source=rss----138adf9c44c---4",
  "description": "",
  "author": "Angele Lenglemetz",
  "published": "Fri, 27 Dec 2024 11:39:03 GMT",
  "source": "https://uxdesign.cc/feed",
  "categories": [
    "ux",
    "psychology",
    "gamification",
    "design",
    "mobile"
  ],
  "byline": "Angele Lenglemetz",
  "length": 4626,
  "excerpt": "Drumroll, please! I recently sold an item on Vinted for the first time — finally, a win! To be honest, I originally downloaded the app to sell things, but… well, let’s just say I got very good at…",
  "siteName": "UX Collective",
  "favicon": "https://miro.medium.com/v2/resize:fill:256:256/1*dn6MbbIIlwobt0jnUcrt_Q.png",
  "text": "Why Duolingo turns streaks into addictive habits while Amazon’s badges gather dustDrumroll, please! I recently sold an item on Vinted for the first time — finally, a win! To be honest, I originally downloaded the app to sell things, but… well, let’s just say I got very good at buying instead. So yes, this was a proud moment.But just as I was basking in my small victory, surprise! Up pops a screen telling me about an award I could win… 👀After I sold my first item, Vinted prompted me to sell another four to get an “Star Wardrobe Award”Rewards have spread across every app over the past few years, driven by the growing popularity of gamification. In an attempt to boost engagement and retention, many apps have introduced reward systems. Usually, that’s how they work: you do something tied to engagement or retention and receive a reward in return.It’s no surprise this approach is booming — the gamification market is projected to grow from USD 15.43 billion in 2024 to USD 48.72 billion by 2029, at a staggering CAGR of 25.85%¹.And it makes sense that apps are trying to leverage this mechanism!Every habit building framework such as the habit loop described in Hooked or the Atomic Habits framework, highlights the importance of rewards.Although these framework are all different, their core remains similar:1. I do the action that I want to form a habit around or that participates to that habit2. I get a rewardThe four steps of building a habit according to Atomic Habit from James ClearResearch shows that reward plays a crucial role in habit formation by reinforcing the behavior and increasing the likelihood that it will be repeated. It operates on psychological and neurological principles, driving motivation and habit loops.The problem is that apps are trying to recreate this in an artificial way. When I go for a run, I usually then treat myself to a delicious smoothie and my body releases endorphins. Together, this forms a great reward and makes me want to do it again.But it’s really hard to recreate that digitally..B2C apps started to introduce “rewards” also called “achievements” or “badges”.They are little gratifications that are the equivalent of school merit medals when you do a good action. Duolingo gives you an unexpected amount of gems and has a section called “Achievements”, Amazon gives some “Badges”, Nike celebrates “Milestones”.Here are examples of rewards from Duolingo, Amazon, and Nike. As you can see, they share many similarities.Gradually, as I accumulated various rewards across multiple apps over time, I started to seriously question whether they actually provided value to users.In many cases, they didn’t feel very genuine, were childish and therefore didn’t act as a great reward.If rewards are key to building habits but getting them right is tricky, what makes a reward truly effective?And how do you use them strategically?I’ll break it down with real-world examples from apps and websites that nail it (or didn’t..).What Makes a Good Reward?A good reward feels meaningful, authentic, and tied to the user’s motivation. It doesn’t just nudge them towards an action; it increases the sense of satisfaction they feel when completing it².In contrast to some of the superficial gratification provided by digital badges or arbitrary “milestones,” effective rewards connect deeply to what the user values.To create a good reward system, keep these principles in mind::1. Align rewards with intrinsic motivationExtrinsic rewards, like points or badges, can be fleeting unless they tap into something deeper.For example, Strava’s year in review works because they connect to a runner or cyclist’s desire to compete and improve. The reward isn’t just about the badge; it’s about social proof and personal achievement.On the other hand, I find Strava’s Trophy case quite dull and meaningless. It feels like I’m being rewarded for putting up with irrelevant ads from their partners, and it lacks any sense of personalisation.2. Tie rewards to actual outcomesA reward should reflect a tangible benefit from the action. If a language app congratulates me for completing a lesson, I’m more likely to feel rewarded if I can now recall phrases in conversation than if I just earned another badge. Rewards should remind users of their progress or accomplishments in ways that matter to them.4. Avoid Over-RewardingWhen rewards become too frequent or predictable, they lose their impact. This is a common pitfall for gamified systems. If every small action results in a shiny badge, the novelty quickly wears off. Reward systems should strike a balance between recognition and scarcity.",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*K2ApHGeIT9qVCNxtIA85Kw.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch2 id=\"3a16\"\u003eWhy Duolingo turns streaks into addictive habits while Amazon’s badges gather dust\u003c/h2\u003e\u003cdiv\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca href=\"https://medium.com/@angele.lenglemetz?source=post_page---byline--1b91064636f4--------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Angele Lenglemetz\" src=\"https://miro.medium.com/v2/resize:fill:88:88/1*B63h4B9yxSnCv90fagoRew.png\" width=\"44\" height=\"44\" loading=\"lazy\" data-testid=\"authorPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca href=\"https://uxdesign.cc/?source=post_page---byline--1b91064636f4--------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"UX Collective\" src=\"https://miro.medium.com/v2/resize:fill:48:48/1*mDhF9X4VO0rCrJvWFatyxg.png\" width=\"24\" height=\"24\" loading=\"lazy\" data-testid=\"publicationPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"63bf\"\u003eDrumroll, please! I recently sold an item on Vinted for the first time — finally, a win! To be honest, I originally downloaded the app to sell things, but… well, let’s just say I got \u003cem\u003every\u003c/em\u003e good at buying instead. So yes, this was a proud moment.\u003c/p\u003e\u003cp id=\"c87a\"\u003eBut just as I was basking in my small victory, surprise! Up pops a screen telling me about an award I could win… 👀\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eAfter I sold my first item, Vinted prompted me to sell another four to get an “Star Wardrobe Award”\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"65e2\"\u003eRewards have spread across every app over the past few years, driven by the growing popularity of gamification. In an attempt to boost engagement and retention, many apps have introduced reward systems. Usually, that’s how they work: you do something tied to engagement or retention and receive a reward in return.\u003c/p\u003e\u003cp id=\"8489\"\u003eIt’s no surprise this approach is booming — the gamification market is projected to grow from USD 15.43 billion in 2024 to USD 48.72 billion by 2029, at a staggering CAGR of 25.85%¹.\u003c/p\u003e\u003cp id=\"f095\"\u003eAnd it makes sense that apps are trying to leverage this mechanism!\u003c/p\u003e\u003cp id=\"aa9a\"\u003e\u003cem\u003eEvery\u003c/em\u003e habit building framework such as the habit loop described in \u003ca href=\"https://www.nirandfar.com/hooked/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eHooked\u003c/a\u003e or the \u003ca href=\"https://jamesclear.com/atomic-habits-summary\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eAtomic Habits\u003c/a\u003e framework, highlights the importance of rewards.\u003c/p\u003e\u003cp id=\"a871\"\u003eAlthough these framework are all different, their core remains similar:\u003c/p\u003e\u003cp id=\"36a5\"\u003e1. I do the action that I want to form a habit around or that participates to that habit\u003c/p\u003e\u003cp id=\"897b\"\u003e2. I get a reward\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eThe four steps of building a habit according to Atomic Habit from James Clear\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"d2e6\"\u003eResearch shows that \u003ca href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC6302524/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003e\u003cstrong\u003ereward\u003c/strong\u003e plays a crucial role in habit formation\u003c/a\u003e by reinforcing the behavior and increasing the likelihood that it will be repeated. It operates on psychological and neurological principles, driving motivation and habit loops.\u003c/p\u003e\u003cp id=\"6739\"\u003eThe problem is that apps are trying to recreate this in an artificial way. When I go for a run, I usually then treat myself to a delicious smoothie and my body releases endorphins. Together, this forms a great reward and makes me want to do it again.\u003c/p\u003e\u003cp id=\"ac0f\"\u003eBut it’s really hard to recreate that digitally..\u003c/p\u003e\u003cp id=\"3209\"\u003eB2C apps started to introduce “rewards” also called “achievements” or “badges”.\u003c/p\u003e\u003cp id=\"dcd3\"\u003eThey are little gratifications that are the equivalent of school merit medals when you do a good action. Duolingo gives you an unexpected amount of gems and has a section called “Achievements”, Amazon gives some “Badges”, Nike celebrates “Milestones”.\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eHere are examples of rewards from Duolingo, Amazon, and Nike. As you can see, they share many similarities.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"d3f8\"\u003eGradually, as I accumulated various rewards across multiple apps over time, I started to seriously question whether they actually provided value to users.\u003c/p\u003e\u003cp id=\"1054\"\u003eIn many cases, they didn’t feel very genuine, were childish and therefore didn’t act as a great reward.\u003c/p\u003e\u003cp id=\"5801\"\u003eIf rewards are key to building habits but getting them right is tricky, what makes a reward truly effective?\u003c/p\u003e\u003cp id=\"9741\"\u003eAnd how do you use them strategically?\u003c/p\u003e\u003cp id=\"8f84\"\u003eI’ll break it down with real-world examples from apps and websites that nail it (or didn’t..).\u003c/p\u003e\u003ch2 id=\"0b21\"\u003eWhat Makes a Good Reward?\u003c/h2\u003e\u003cp id=\"3c35\"\u003eA good reward feels meaningful, authentic, and tied to the user’s motivation. It doesn’t just nudge them towards an action; it increases the sense of satisfaction they feel when completing it².\u003c/p\u003e\u003cp id=\"c2bf\"\u003eIn contrast to some of the superficial gratification provided by digital badges or arbitrary “milestones,” effective rewards connect deeply to what the user values.\u003c/p\u003e\u003cp id=\"40e3\"\u003eTo create a good reward system, keep these principles in mind::\u003c/p\u003e\u003ch2 id=\"ffde\"\u003e\u003cstrong\u003e1. Align rewards with intrinsic motivation\u003c/strong\u003e\u003c/h2\u003e\u003cp id=\"9e51\"\u003eExtrinsic rewards, like points or badges, can be fleeting unless they tap into something deeper.\u003c/p\u003e\u003cp id=\"0432\"\u003eFor example, Strava’s year in review works because they connect to a runner or cyclist’s desire to compete and improve. The reward isn’t just about the badge; it’s about social proof and personal achievement.\u003c/p\u003e\u003cp id=\"83ef\"\u003eOn the other hand, I find Strava’s Trophy case quite dull and meaningless. It feels like I’m being rewarded for putting up with irrelevant ads from their partners, and it lacks any sense of personalisation.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"516e\"\u003e\u003cstrong\u003e2. Tie rewards to actual outcomes\u003c/strong\u003e\u003c/h2\u003e\u003cp id=\"a1d5\"\u003eA reward should reflect a tangible benefit from the action. If a language app congratulates me for completing a lesson, I’m more likely to feel rewarded if I can now recall phrases in conversation than if I just earned another badge. Rewards should remind users of their progress or accomplishments in ways that matter to them.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"0b8e\"\u003e\u003cstrong\u003e4. Avoid Over-Rewarding\u003c/strong\u003e\u003cbr/\u003eWhen rewards become too frequent or predictable, they lose their impact. This is a common pitfall for gamified systems. If every small action results in a shiny badge, the novelty quickly wears off. Reward systems should strike a balance between recognition and scarcity.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-27T11:39:03.593Z",
  "modifiedTime": null
}
