[
  {
    "id": "1c9c243a-e83b-45bc-b01e-c6ef75f63e19",
    "title": "Episode 150: Late One Night",
    "link": "https://play.prx.org/listen?ge=prx_3_3a97b897-15b5-4e73-a156-257145aa9145\u0026uf=http%3A%2F%2Ffeeds.thememorypalace.us%2Fthememorypalace",
    "description": "Pre-order The Memory Palace book now, dear listener. On Bookshop.org, on Amazon.com, on Barnes \u0026 Noble, or directly from Random House.This episode was originally released in October 2019.The Memory Palace is a proud member of Radiotopia from PRX. Radiotopia is a collective of independently owned and operated podcasts that’s a part of PRX, a not-for-profit public media company. If you’d like to directly support this show, you can make a donation at Radiotopia.fm/donate. I have recently launched a newsletter. You can subscribe to it at thememorypalacepodcast.substack.com.",
    "author": "Nate DiMeo",
    "published": "Thu, 17 Oct 2024 19:00:00 -0000",
    "image": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/_/3/3a97b897-15b5-4e73-a156-257145aa9145/thememorypalace.mp3",
    "source": "http://feeds.thememorypalace.us/thememorypalace",
    "categories": null
  },
  {
    "id": "562a4827-cb7f-43ba-b31d-40414145d896",
    "title": "Episode 222: Ferminia Sarras",
    "link": "https://play.prx.org/listen?ge=prx_3_53bcca43-f8fe-40b1-b47a-f9036b69b8b2\u0026uf=http%3A%2F%2Ffeeds.thememorypalace.us%2Fthememorypalace",
    "description": "Pre-order The Memory Palace book now, dear listener. On Bookshop.org, on Amazon.com, on Barnes \u0026 Noble, or directly from Random House.The Memory Palace is a proud member of Radiotopia from PRX. Radiotopia is a collective of independently owned and operated podcasts that’s a part of PRX, a not-for-profit public media company. If you’d like to directly support this show, you can make a donation at Radiotopia.fm/donate. I have recently launched a newsletter. You can subscribe to it at thememorypalacepodcast.substack.com. Music Riverside by Ann Annie Walking to Town by Lullatone Alice Lake by North Americans Gone for a Wander by Domenique Dumont NotesThe definitive source on Ferminia Sarras (as far as definitive can be in her case) A Mine of Her Own: Women Prospectors in the American West, 1850-1950 by Sally Zanjani.",
    "author": "Nate DiMeo",
    "published": "Thu, 19 Sep 2024 07:30:00 -0000",
    "image": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/_/3/53bcca43-f8fe-40b1-b47a-f9036b69b8b2/thememorypalace.mp3",
    "source": "http://feeds.thememorypalace.us/thememorypalace",
    "categories": null
  },
  {
    "id": "35a5cdac-db00-44e7-85cc-02467bb30110",
    "title": "Show 71 - Mania for Subjugation",
    "link": "http://www.dancarlin.com/product/hardcore-history-71-mania-for-subjugation",
    "description": "What's the recipe for making a historically world-class apex predator? In the case of Alexander the Great, it might be the three Ns: Nature, Nurture, and Nepotism.",
    "author": "",
    "published": "Fri, 07 Jun 2024 12:14:53 PST",
    "image": "https://dts.podtrac.com/redirect.mp3/traffic.libsyn.com/dancarlinhh/dchha71_Mania_for_Subjugation.mp3",
    "source": "https://feeds.feedburner.com/dancarlin/history?format=xml",
    "categories": [
      "Alexander the Great",
      " Phillip II",
      " Macedonia",
      " Macedon",
      " Olympias",
      " Demosthenes",
      " Athens",
      " Sparta",
      " Thebes",
      " Persia",
      " history",
      " podcast",
      " ancient",
      " military",
      " Aristotle",
      " Greece",
      " Hellenistic"
    ]
  },
  {
    "id": "e18e80bb-ad02-464d-8819-2b9241d34681",
    "title": "Show 70 - Twilight of the Aesir II",
    "link": "http://www.dancarlin.com/product/hardcore-history-70-twilight-of-the-aesir-ii",
    "description": "Pagan Viking Sea Kings spend the 10th and 11th centuries morphing into Christian monarchs. But with rulers like Harald Bluetooth and Svein Forkbeard it's debatable whether things will be any less horrific for Scandinavia's neighbors",
    "author": "",
    "published": "Sun, 19 Nov 2023 12:14:53 PST",
    "image": "https://dts.podtrac.com/redirect.mp3/traffic.libsyn.com/dancarlinhh/dchha70_Twilight_of_the_Aesir_II.mp3",
    "source": "https://feeds.feedburner.com/dancarlin/history?format=xml",
    "categories": [
      "Vikings",
      " Scandinavia",
      " Anglo-Saxon",
      " Franks",
      " Irish",
      " Danes",
      " Norway",
      " Sweden",
      " Rus",
      " Russia",
      " Byzantium",
      " Constantinople",
      " raiding",
      " pirates",
      " history",
      " Forkbeard",
      " Bluetooth",
      "Hairfair",
      " Tryggvason"
    ]
  },
  {
    "id": "9862ddf6-b291-4fd3-ac74-3db689f16a3d",
    "title": "I Am a Respectable Person",
    "link": "https://www.thehistoryreader.com/us-history/i-am-a-respectable-person/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=i-am-a-respectable-person",
    "description": "by Jack Kelly “We are not going back,” is a refrain heard in this year’s election campaign. We like to think of history as steady progress forward. But during the struggle toward human rights and racial justice in the United States, we have gone back more than once. In July 1854, residents of New York […] The post I Am a Respectable Person appeared first on The History Reader.",
    "author": "Sara Eslami",
    "published": "Tue, 15 Oct 2024 16:12:05 +0000",
    "image": "https://www.thehistoryreader.com/wp-content/uploads/2024/10/Elizabeth_jennings_01.jpg",
    "source": "https://www.thehistoryreader.com/feed/",
    "categories": [
      "Cultural History",
      "U. S. History",
      "Elizabeth Jennings",
      "Jack Kelly",
      "Rosa Parks",
      "US history"
    ]
  },
  {
    "id": "4700651c-ae51-42b6-a75f-b9ec5cf64526",
    "title": "Featured Excerpt: President Carter",
    "link": "https://www.thehistoryreader.com/us-history/featured-excerpt-ipresident-carter-i/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=featured-excerpt-ipresident-carter-i",
    "description": "by Stuart E. Eizenstat Grounding the B-1 Bomber Far more complex, both politically and technically, was a divisive debate over whether to build the B-1 bomber, which presents a good lesson in how difficult it is, even for a president with a military background like Carter’s, to balance the appetites of what President Eisenhower called […] The post Featured Excerpt: President Carter appeared first on The History Reader.",
    "author": "Sara Eslami",
    "published": "Tue, 01 Oct 2024 16:13:20 +0000",
    "image": "https://www.thehistoryreader.com/wp-content/uploads/2024/10/017_03_20_10_53_18-Book-Cover-Pics-300x231.jpg",
    "source": "https://www.thehistoryreader.com/feed/",
    "categories": [
      "Historical Figures",
      "U. S. History",
      "Jimmy Carter",
      "president carter",
      "President Jimmy Carter",
      "stuart e. eizenstat"
    ]
  },
  {
    "id": "8c0b9f17-3cc0-455c-9fc5-28dc0df19d9a",
    "title": "How We Vote (Throwback)",
    "link": "https://www.npr.org/2024/10/17/1210938289/how-we-vote-throwback",
    "description": "Drunken brawls, coercion, and lace curtains: believe it or not, how regular people vote was not something the Founding Fathers thought much about. Americans went from casting votes at wild parties in the town square to doing so in private booths, behind a drawn curtain. In this episode, the process of voting: how it was designed, who it was meant for, and the moments when we reimagined it altogether.Learn more about sponsor message choices: podcastchoices.com/adchoicesNPR Privacy Policy",
    "author": "",
    "published": "Thu, 17 Oct 2024 07:00:59 +0000",
    "image": "https://chrt.fm/track/138C95/prfx.byspotify.com/e/play.podtrac.com/npr-510333/traffic.megaphone.fm/NPR3311854721.mp3?d=3285\u0026size=52565560\u0026e=1210938289\u0026t=podcast\u0026p=510333",
    "source": "https://feeds.npr.org/510333/podcast.xml",
    "categories": null
  },
  {
    "id": "e3711421-cc55-4111-a52f-adf8834a836c",
    "title": "A History of Christian Nationalism",
    "link": "https://www.npr.org/2025/10/09/1260150915/a-history-of-christian-nationalism",
    "description": "References to God and Christianity are sprinkled throughout American life. Our money has \"In God We Trust\" printed on it. Most presidents have chosen to swear their oath of office on the Bible.Christian nationalists want more.Christian nationalist beliefs are rooted in the idea that the United States was founded as a Christian nation, and that its laws should reflect certain Christian values. And versions of these beliefs are widely held by Americans of different ages, races, and backgrounds. In 2022, a Pew Research poll reported that 45 percent of Americans believe the country should be a Christian nation. More than half of those people said the Bible should influence U.S. laws. Today on the show: the complex relationship between Christianity and the U.S.Love Throughline? Please help us out by taking this quick survey! npr.org/throughlinesurveyTo access bonus episodes and listen to Throughline sponsor-free, subscribe to Throughline+ via Apple Podcasts or at plus.npr.org/throughline.Learn more about sponsor message choices: podcastchoices.com/adchoicesNPR Privacy Policy",
    "author": "",
    "published": "Thu, 10 Oct 2024 07:00:59 +0000",
    "image": "https://chrt.fm/track/138C95/prfx.byspotify.com/e/play.podtrac.com/npr-510333/traffic.megaphone.fm/NPR5134404897.mp3?d=3086\u0026size=49385309\u0026e=1260150915\u0026t=podcast\u0026p=510333",
    "source": "https://feeds.npr.org/510333/podcast.xml",
    "categories": null
  },
  {
    "id": "888e085b-61e0-47ea-a779-664c3e2ed587",
    "title": "Isaac Newton: The Father of Modern Science",
    "link": "http://www.historyisnowmagazine.com/blog/2024/10/22/isaac-newton-the-father-of-modern-science",
    "description": "Sir Isaac Newton, was born (according to the Julian calendar in use in England at the time) on Christmas Day, the 25th of December 1642 (New system calendar the 4th of January 1643), at Woolsthorpe Manor in Woolsthorpe-by-Colsterworth, a hamlet in the county of Lincolnshire, England.Sir Isaac Newton was one of the most influential scientists in human history, with his groundbreaking work in mathematics, physics, and astronomy laying the foundations for classical mechanics continuing to this day and shaping modern science.Terry Bailey explains. Isaac Newton in later life. Painting by James Thornhill.Early Life and EducationNewton's early life was marked by personal hardships. His father died three months before he was born, and when Newton was three, his mother remarried, leaving him in the care of his maternal grandmother. As a child, Newton displayed a curiosity about the world that would later evolve into groundbreaking scientific inquiries. He was sent to The King's School in Grantham, where he demonstrated a gift for mathematics and mechanics, often constructing elaborate mechanical devices, such as sundials and windmills, during his free time.At 18, Newton enrolled at Trinity College, Cambridge, in 1661. Cambridge, however, offered a curriculum centered around Aristotelian philosophy, which Newton found inadequate to explain the natural world. During this time, he encountered the works of philosophers such as René Descartes and astronomers like Galileo Galilei, which inspired his independent thinking. It was during the mid-1660s, when Cambridge was closed, (1665-1667), due to the Great Plague, that Newton made his first breakthroughs. The Annus Mirabilis (The \"Year of Wonders\")Newton's most productive period came during his time away from Cambridge between 1665 and 1667, often referred to as his \"Annus Mirabilis.\" During these years, he developed the fundamental principles of calculus, formulated his theories on optics, and famously began to conceive the laws of motion and universal gravitation. Calculus: The Foundation of Modern Mathematics One of Newton's most profound achievements was the development of calculus, a new branch of mathematics that allowed for the analysis of continuously changing quantities. Although the invention of calculus is often attributed to both Newton and German mathematician Gottfried Wilhelm Leibniz, Newton's work predated Leibniz's publication by several years. It is also important to note that Archimedes, 287 BCE-212 BCE had already started developing the early concepts of integral calculus.Newton used calculus to describe rates of change, which was crucial in his subsequent scientific discoveries. For example, calculus allowed Newton to analyze the motion of objects, calculate the changing velocities of falling bodies, and predict the paths of planets. Optics: The Nature of Light and ColorDuring his retreat in 1666, Newton also conducted groundbreaking experiments with optics. Using a prism, Newton demonstrated that white light could be split into a spectrum of colors, showing that white light was a mixture of different wavelengths of light rather than a pure substance.This discovery revolutionized the field of optics and dispelled prevailing theories that colors were produced by the modification of white light. His work on light also led him to build the first practical reflecting telescope, known as the Newtonian telescope, in 1668. This innovation eliminated chromatic aberration—a problem that plagued refracting telescopes—and allowed for sharper images of celestial objects. The Principia and Newton's Laws of MotionIn 1687, Newton published his magnum opus, Philosophiæ Naturalis Principia Mathematica, often referred to simply as the Principia. This work laid the groundwork for classical mechanics and established Newton's lasting influence on science. Newton's Laws of MotionThe Principia is perhaps most famous for the articulation of Newton's three laws of motion, which describe the relationship between an object's motion and the forces acting upon it:First Law (Inertia): An object at rest stays at rest, and an object in motion stays in motion with the same speed and in the same direction unless acted upon by an unbalanced external force.Second Law (Force and Acceleration): The acceleration of an object is directly proportional to the net force acting upon it and inversely proportional to its mass. This law is succinctly expressed by the formula F = ma (force equals mass times acceleration).Third Law (Action and Reaction): For every action, there is an equal and opposite reaction. This principle explains why a rocket is propelled upward as gas is expelled downward. These laws transformed the study of motion and became the foundation of classical mechanics, allowing scientists to predict the behavior of moving objects and understand phenomena like the orbits of planets and the trajectories of projectiles. The Universal Law of GravitationNewton's law of universal gravitation is another keystone of his legacy. Newton proposed that every particle of matter in the universe attracts every other particle with a force that is proportional to the product of their masses and inversely proportional to the square of the distance between them. This revolutionary idea provided a unifying explanation for both terrestrial and celestial phenomena.Newton's law of gravitation explained why apples fall to the ground, why the Moon orbits the Earth, and why planets revolve around the Sun. It was the first time a mathematical theory provided a comprehensive explanation of the mechanics of the universe. With this law, Newton showed that the same forces governing falling objects on Earth were responsible for the motion of the planets, revolutionizing our understanding of the cosmos. Later Life and Scientific WorkFollowing the publication of the Principia, Newton's reputation as one of the world's foremost scientists was firmly established. He was appointed Lucasian Professor of Mathematics at Cambridge, a position he held until 1696 when he moved to London to become Warden of the Royal Mint. There, Newton played a key role in reforming England's coinage and combating widespread counterfeiting. Alchemy and TheologyAlthough Newton is best known for his contributions to mathematics and physics, he also spent a significant portion of his life studying alchemy and theology. Alchemy, a proto-scientific tradition, sought to transform base metals into gold and discover the elixir of life, (which to the initiated was a metaphorical concept for other scientific Pursuits). While Newton never made significant strides in these areas, his alchemical work reveals the breadth of his intellectual curiosity as he applied solid scientific methodologies to this pursuit.Newton's theological writings were also substantial, though they remained unpublished during his lifetime. He was deeply interested in biblical prophecy and sought to reconcile his scientific work with his religious beliefs. Despite his unorthodox theological views, Newton believed that the universe operated under divine law, and this conviction reinforced his scientific inquiries. However, the more he studied these ideas the more separate the two concepts became. Newton's Legacy in ScienceIsaac Newton's scientific achievements had a profound impact on future generations of scientists. His methods of inquiry—based on empirical observation, mathematical rigor and logical reasoning became the standard for scientific exploration. Influence on PhysicsNewton's work in physics formed the basis for much of what is now called classical mechanics. For over two centuries, Newton's laws of motion and gravitation remained the cornerstone of physics, providing a comprehensive framework for understanding the movement of bodies in the universe.It was not until the 20th century, with the advent of Einstein's theory of relativity and quantum mechanics, that Newton's ideas were modified to account for the behavior of objects at extreme speeds and small scales. However, even in these contexts, Newton's laws remain a valid approximation for much of the physical world.It is vital to understand that Newton was not incorrect and Einstein's theories simply were furtherance of Newton's findings. Issac Newton lived in the time of horse and carriage and the concept of light speed was virtually unknown. When Einstein added light speed into the equation it allowed science to move beyond Newton's discoveries, the true aspect of scientific discovery and solid proof of Newton's legacy to the world. Impact on MathematicsNewton's development of calculus opened new avenues for mathematical exploration. His methods for calculating the rate of change and determining areas under curves became essential tools in mathematics, engineering, and physics. Calculus remains a central component of modern mathematics education and is used extensively in fields ranging from physics to economics. Contributions to Astronomy Newton's law of gravitation allowed astronomers to better understand planetary motion and celestial mechanics. Using Newton's theories, astronomers could predict the orbits of planets and comets with unprecedented accuracy. Newton's work also helped scientists understand the forces governing tides, the behavior of moons, and the dynamics of stars and galaxies.Side note:- Galileo Galilei had already discovered the first 4 moons orbiting around Jupiter, originally named the Galilean moons, (satellites), on the 7th of January 1610. These moons eventually became known as Io, Europa, Ganymede, and Callisto. Newton's Philosophical ImpactIn addition to his scientific work, Newton influenced the philosophical understanding of nature and human knowledge. His emphasis on observation and mathematical explanation helped shape the Enlightenment view that nature operates according to discoverable laws. Philosophers like John Locke and Immanuel Kant were profoundly influenced by Newton's work, and his ideas were integral to the rise of empiricism and the scientific method.In conclusion, Isaac Newton's life and work are solid evidence of the power of human curiosity and intellect. From his formulation of calculus and groundbreaking work in optics to his laws of motion and gravitation, Newton reshaped humanity's understanding of the natural world. His influence extended far beyond his era, setting the stage for centuries of scientific progress. Newton's legacy endures, not only in the discoveries he made but in the methods of inquiry and analysis he championed—methods that continue to drive science forward today. The site has been offering a wide variety of high-quality, free history content since 2012. If you’d like to say ‘thank you’ and help us with site running costs, please consider donating here.  Notes:Reflecting telescope, (Newtonian telescope)A reflecting telescope often referred to as a Newtonian telescope, is a type of reflecting telescope invented by the English scientist Sir Isaac Newton, using a concave primary mirror and a flat diagonal secondary mirror. Newton's first reflecting telescope was completed in 1668 and is the earliest known functional reflecting telescope.The Newtonian telescope's simple design has made it very popular with amateur telescope makers. Refracting telescope A refracting telescope often referred to as a refractor is a type of optical telescope that uses a lens as its objective to form an image, known as a dioptric telescope and was the earliest type of optical telescope.The first record of a refracting telescope appeared in the Netherlands about 1608 when a spectacle maker from Middelburg named Hans Lippershey unsuccessfully tried to patent one.News of the patent spread fast and Galileo Galilei, happening to be in Venice in May 1609, heard of the invention, constructed a version of his own, and applied it to making astronomical discoveries. Chromatic aberrationChromatic aberration, also referred to as chromatic distortion, color fringing, and sphero-chromatism, is a common optical phenomenon that occurs when a lens cannot bring all wavelengths of light to a single converging point Jupiter's moonsJupiter currently has 95 moons that have been officially confirmed and recognized by the International Astronomical Union, (IAU).",
    "author": "George Levrier-Jones",
    "published": "Tue, 22 Oct 2024 21:28:13 +0000",
    "image": "https://images.squarespace-cdn.com/content/v1/50adfa2ae4b0cc1d786569eb/1d3d9798-465e-41b2-8372-e0e46cebd274/20241022+512px-Newton_25.jpg?format=1000w",
    "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
    "categories": [
      "Blog Post"
    ]
  },
  {
    "id": "b99e700c-8f17-40a6-b476-e98084d2d240",
    "title": "The British Labour Party and Welfare: The Legacies of the Attlee and Wilson Governments",
    "link": "http://www.historyisnowmagazine.com/blog/2024/10/18/the-british-labour-party-and-welfare-the-legacies-of-the-attlee-and-wilson-governments",
    "description": "The British Labour Party won the 2024 British general election. With that in mind, Vittorio Trevitt looks at the past Labour governments of Clement Attlee and Harold Wilson. He considers how these governments handled welfare policy. Clement Attlee with John F. Kennedy in 1961.The UK General Election held in July 2024 was a truly historic event, with Labour returning to office after more than a decade in opposition. The fact that Labour did so with such a massive majority means that they have a strong mandate to transform Britain into a fairer nation. Although the state of public finances has resulted in Labour removing universal Winter Fuel Allowances for most pensioners (ironically reversing a policy implemented under the Blair Government in 1997) and more cuts likely to follow, it is highly probable that as economic conditions improve there will be greater leeway for Labour to expand social provisions, such as fulfilling its proposals for extending rights to statutory sick pay and introducing free breakfast clubs in all English primary schools. In the past, Labour has encountered severe financial difficulties but has still managed to establish a broad array of social security grants that have done much to ameliorate the quality of life for ordinary households. Two former Labour administrations that Starmer and his ministers can look to for guidance are the Attlee Government of 1945-51 and the 1964-70 and 1974-76 Wilson Governments. Attlee GovernmentThe Labour Government that came to power in the first election following the end of the Second World War has long been held in high esteem not only by historians but also by Labour Party activists and politicians. Led by veteran Labourite Clement Attlee, it was by far the most radical and successful that Britain had experienced by that time. Although the country Labour inherited was in a parlous financial state (the legacy of World War II), Attlee and his ministers would not disappoint an electorate hungry for change after years of strife and sacrifice. Over the next 6 years, they drastically changed Britain for the better. One way it achieved this was through the construction of a comprehensive and universalistic welfare model. Although Britain had a long history of welfare provision, the Attlee Government greatly built on the existing framework by setting up a system that covered all citizens. One of the pillars of this new solidaristic edifice, the National Health Service, was notable in making free access to every form of healthcare (such as medical and dental care, eyeglasses and hearing aids) a right for every citizen; one that the service has continued to uphold despite frequent cuts and overhauls in the decades since its “birth.” The 1946 National Insurance Act set up a broad network of cash payments incorporating a range of risks such as old age, widowhood and funeral costs. Apart from the normal rates, increases could be made in national insurance paymentsfor particular cases. Also, where employers had failed to meet the contribution requirements of the Act, resulting in recipients losing partly or entirely the maternity, sickness or unemployment benefits that were theirs by right, such individuals could retrieve a civil debt from said employers representing the lost amounts. A Five Year Benefit Reviewwas also included, aimed at ensuring the adequacy of allowances in helping beneficiaries to meet their basic needs. Additionally, groups such as trade unions were enabled to set up their own schemes if they so wished.The equally far-reaching Industrial Injuries Act passed that same year bestowed various cash grants upon workers suffering from work-related injuries such as disablement gratuities and special hardship allowances (aimed at workers unable to carry out their current lines of work or equivalent due to their injuries). Five distinct benefits were also made for dependents of workers who tragically lost their lives, while allowances were given in cases of approved hospital treatment, constant attendance and unemployability; the latter geared towards disability pensioners unable to take on any form of employment. In addition, the National Assistance Act introduced two years later established a non-contributory social safety net for those in need; providing support such as shelter and nutritional assistance. The Attlee years also witnessed the passage of other welfare measures affecting different strata of British society.Dockworkers became entitled to pay in cases of unemployment or underemployment, while a state scheme for mature university students was set up. Regulations provided numerous pension entitlements for NHS employees while the National Insurance and Civil Service (Superannuation) Rules, 1948 provided for preserved pension rights with a compensation award in cases where individuals experienced the impairment or loss of opportunity to earn a further pension. As a means of helping people reach their potential, a special scheme was instituted in 1947 whereby individuals with a gift for skilled crafts became eligible for grants to undertake training in other locations if no suitable facilities existed near where they lived.In 1946, certain pensioners with disabilities that added to wear and tear became entitled to a new clothing allowance, while a couple of years later greater eligibility for special education allowances for children was introduced. The 1948 Local Government Act generalised various powers to pay subsistence and travelling allowances to members of local authorities while also providing payments in cases where council business attendance led to financial loss. The 1947 Agriculture Act incorporated several forms of compensation, such as for disturbance and improvement, while the 1948 Criminal Justice Act provided for the enforcement of payments of compensation or damages. Under the 1948 Children Act, local authorities were empowered to care for children who were orphaned, deserted or unable to be looked after by their parents due to circumstance. Amongst its many provisions included accommodation for children reaching 3 years of age, along with grants for students to help them with the costs of maintenance, training or education. A year later, a system of legal assistance was inaugurated that entitled most people to free legal support in both civil and criminal cases. Impact of the Attlee GovernmentThe extent to which the social security legislation of the Attlee Government dramatically improved people’s lives can be gauged from a poverty study conducted in York in 1950 by the legendary researcher and humanitarian Seebohm Rowntree; using that location as a representative sample. A follow up to a previous survey carried out in the same area in 1936, it estimated that the percentage of working-class people in York who lived in poverty stood at 2.77% in 1950, compared with 31.1% 14 years earlier. Although the study undoubtedly overestimated the extent to which poverty fell during that period, it nevertheless highlights the fact that the Welfare State established under Attlee did much to diminish the numbers experiencing hardship. G.R. Lavers, who co-authored the report, argued that the largest improvement since 1936 had come about as a result of the welfare reforms instituted since 1945, going as far as to claim that the Welfare State had greatly overcome poverty. This assertion gave Labour a positive message to convey to the public during the 1951 election campaign, but despite their efforts would be voted out of office; not returning to power until 1964 under the leadership of former minister Harold Wilson. Wilson GovernmentsLike Attlee’s Administration, Harold Wilson and his ministers inherited a nation in a difficult economic position; one that eventually resulted in the currency being devalued. This culminated in detestable austerity policies including higher charges for school meals. Also, In a dubious move, one that undoubtedly reflected exaggerated perceptions of welfare fraud that persist to this day, a “four-week rule” was instituted in July 1968 in certain places. This involved social assistance benefits being removed from recipients after this time if it was believed that there was suitable work available. Assessing the impact of this measure, one study edited by the anti-poverty activist and future cabinet minister Frank Field provided the estimate that 10% of those affected by the rule subsequently ventured into crime as a consequence of their losing their benefits. Despite a ministerial claim that this policy had been a success in tackling benefit fraud, Field’s study suggests that it was a misguided decision that caused unnecessary hardship.Nevertheless, for most of its period in office Labour not only boosted public spending but also rolled out a programme of radical welfare reform that did much to lessen inequality. New benefits were introduced concerning risks that previously had been left uncovered by the Attlee welfare laws. Redundancy pay was set up, along with income supplements for beneficiaries such as unwell, injured and jobless persons; the latter to lessen the impact of unemployment for skilled employees. New allowances for partially incapacitated men were also established, with increased amounts were permitted in certain cases.The 1965 Solicitors Act allowed for grants to be paid in hardship situations, while other laws introduced varying forms of compensation for those affected by compulsory land purchases and damage. National Assistance was superseded by a new Supplementary Benefits Scheme; an overhaul carried out partly to prevent detailed individual enquiries. Reflecting this philosophical shift, changes were made, for instance, to rent allowance payments for non-householders (previously, these had been dependent upon a household’s make-up). Although not without its faults, it was a definite improvement over the previous social assistance arrangements. Higher benefit rates were provided and, although the allowances under the new scheme were mostly the same as under National Assistance (with exceptions such as an additional allowance for long-term claimants), what differed was the fact that the new scheme sought to ensure that benefits would be given as a right to those who met the means-tested conditions, while seniors were entitled to an income guarantee. Measures were also carried out with the intention of enabling widows and women whose marriages had dissolved to receive higher pensions, while regulations established improved levels of financial assistance for disabled people (such as an allowance for severe disabilities), and allowed for Christmas bonuses to be disregarded in the estimation or calculation of earnings when determining national insurance payments. Local tax rebates were created to assist less well-off ratepayers, and the 1965 Matrimonial Causes Act was designed to helpwomen by means of ordering alimony and other forms of payment to the concerned parties. Additionally, measures were undertaken to tackle homelessness and deliver residential services to persons who are ill and living with disabilities. The social security record of Wilson’s first administration can be justified by the impact its policies had on those living on low incomes. In 1970, the amount that benefits and taxes added to the incomes of those earning £315 annually was more than twice the equivalent amount from 1964. Measurements have also suggested that the number of individuals living in poverty was far lower in 1970 than in 1964; further justification of Labour’s welfare record from the Sixties. One such benchmark, utilising a 1970-based absolute poverty line, has suggested that the percentage of poor Britons fell from around 20% to around 15% by the end of Wilson’s first premiership. Wilson’s last government from 1974 to 1976 would also see further landmarks in social security, with various laws passed that established new entitlements including invalidity pensions and mobility and invalidity care allowances for the disabled, earnings-related pensions, and Child Benefit; a universal payment which for the first time included financial support to families with at least one child and enhanced the amount of assistance allocated to low-income families. The administrations in contextIn a way, both administrations reflected the spirit of the times that they governed in. In the decade or so following the end of the hostilities, several war-torn nations in Europe came under the leadership of left-wing coalitions that expanded their social aid systems, while even poorer nations led by progressives including Burma (Myanmar), Guatemala, Iran and Ceylon (Sri Lanka) undertook reforms in this field. Similarly, during Wilson’s first stint as prime minister several developing nations led by reformers throughout the Sixties like India, Turkey, Honduras and the Philippines also embarked upon their own programmes of welfare innovation. The revolutionary social security reforms implemented under Attlee and Wilson therefore reflected broader geopolitical trends during their incumbencies.The record of the Attlee and Wilson administrations shows that even under dire economic circumstances there is much that can be achieved in strengthening the social security structure that has done much throughout the decades to prevent and mitigate poverty in the United Kingdom. Like their forebears, the Starmer Government must never lose sight of Labour’s goal to make Britain a nation free of injustice. A more generous welfare system is a prerequisite to this. Although it is likely that it will take time until the financial situation improves to the point that Labour will be able to pursue looser, more expansionary fiscal measures to attain its reformist vision, the Starmer Government must nevertheless reinforce the Welfare State as an effective tool against the scourges of poverty, as most Labour governments have done so in the past. The welfare records of the Attlee and Wilson ministries are ones that the new Labour administration can learn greatly from today.  The site has been offering a wide variety of high-quality, free history content since 2012. If you’d like to say ‘thank you’ and help us with site running costs, please consider donating here.",
    "author": "George Levrier-Jones",
    "published": "Sun, 20 Oct 2024 15:19:00 +0000",
    "image": "https://images.squarespace-cdn.com/content/v1/50adfa2ae4b0cc1d786569eb/f168b9d1-ee2b-461c-bfcd-4081897507ee/20241020+1024px-President_John_F._Kennedy_with_Clement_Attlee%2C_1st_Earl_Attlee%2C_Former_British_Prime_Minister_and_Labour_Party_Leader_%2802%29.jpg?format=1000w",
    "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
    "categories": [
      "20th century",
      "Blog Post"
    ]
  },
  {
    "id": "d6c9925b-6dae-4de7-baac-533d60d17183",
    "title": "Celebrating the Legacy of the Office of Strategic Services 82 Years On",
    "link": "https://www.historynet.com/celebrating-the-legacy-of-the-office-of-strategic-services-82-years-on/",
    "description": "From the OSS to the CIA, how Wild Bill Donovan shaped the American intelligence community.",
    "author": "Major Nicholas Dockery",
    "published": "Fri, 21 Jun 2024 13:17:24 +0000",
    "image": "https://www.historynet.com/wp-content/uploads/2024/06/The-OSS.jpg",
    "source": "http://www.historynet.com/feed",
    "categories": [
      "Stories",
      "CIA",
      "OSS"
    ]
  },
  {
    "id": "4290036c-69fe-4858-812e-f065eed5e027",
    "title": "Seminoles Taught American Soldiers a Thing or Two About Guerrilla Warfare",
    "link": "https://www.historynet.com/seminole-warrior-vs-us-soldier-book-review-2/",
    "description": "During the 1835–42 Second Seminole War and as Army scouts out West, these warriors from the South proved formidable.",
    "author": "Jon Guttman",
    "published": "Fri, 12 Apr 2024 12:24:00 +0000",
    "image": "https://www.historynet.com/wp-content/uploads/2024/02/book-review-seminole-warrior-ww.jpg",
    "source": "http://www.historynet.com/feed",
    "categories": [
      "Review",
      "Book Review",
      "Florida",
      "military history",
      "Native Americans",
      "Tactics"
    ]
  }
]
