[
  {
    "id": "cf476020-52a9-4595-8486-0f65bbfd5a77",
    "title": "Episode 222: Ferminia Sarras",
    "link": "https://play.prx.org/listen?ge=prx_3_53bcca43-f8fe-40b1-b47a-f9036b69b8b2\u0026uf=http%3A%2F%2Ffeeds.thememorypalace.us%2Fthememorypalace",
    "description": "Pre-order The Memory Palace book now, dear listener. On Bookshop.org, on Amazon.com, on Barnes \u0026 Noble, or directly from Random House.The Memory Palace is a proud member of Radiotopia from PRX. Radiotopia is a collective of independently owned and operated podcasts that’s a part of PRX, a not-for-profit public media company. If you’d like to directly support this show, you can make a donation at Radiotopia.fm/donate. I have recently launched a newsletter. You can subscribe to it at thememorypalacepodcast.substack.com. Music Riverside by Ann Annie Walking to Town by Lullatone Alice Lake by North Americans Gone for a Wander by Domenique Dumont NotesThe definitive source on Ferminia Sarras (as far as definitive can be in her case) A Mine of Her Own: Women Prospectors in the American West, 1850-1950 by Sally Zanjani.",
    "author": "Nate DiMeo",
    "published": "Thu, 19 Sep 2024 07:30:00 -0000",
    "image": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/_/3/53bcca43-f8fe-40b1-b47a-f9036b69b8b2/thememorypalace.mp3",
    "source": "http://feeds.thememorypalace.us/thememorypalace",
    "categories": null
  },
  {
    "id": "f47fb7a4-30eb-4d80-a956-449cd240987c",
    "title": "Episode 221: Ken Allen",
    "link": "https://play.prx.org/listen?ge=prx_3_a431f68e-c6ea-4388-99a4-69908afb6470\u0026uf=http%3A%2F%2Ffeeds.thememorypalace.us%2Fthememorypalace",
    "description": "Pre-order The Memory Palace book now, pal. On Bookshop.org, on Amazon.com, on Barnes \u0026 Noble, or directly from Random House.The Memory Palace is a proud member of Radiotopia from PRX. Radiotopia is a collective of independently owned and operated podcasts that’s a part of PRX, a not-for-profit public media company. If you’d like to directly support this show and independent media, you can make a donation at Radiotopia.fm/donate. I have recently launched a newsletter. You can subscribe to it at thememorypalacepodcast.substack.com. Music Pure (Ride the World) by (the extraordinary) Brendan Eder Ensemble Violette... from Philippe Sarde's score to Violette et Francois Merry-go-Round and People on Sunday by Domenique Dumont Dane by Nils Frahm Two different versions of Debussy's Passepied, the piano one is performed by Seong-Jin Cho, the synth one by Isao Tomita Love from Matthew Herbert Memorial Park from Bernard Herrmann's score to Obsession. Phantom Signals by Tvarvargen NotesThere's plenty written about Ken Allen, but I particularly appreciated Jason Hribal's book Fear of the Animal Planet: The Hidden History of Animal Resistance.",
    "author": "Nate DiMeo",
    "published": "Thu, 05 Sep 2024 07:00:05 -0000",
    "image": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/_/3/a431f68e-c6ea-4388-99a4-69908afb6470/thememorypalace.mp3",
    "source": "http://feeds.thememorypalace.us/thememorypalace",
    "categories": null
  },
  {
    "id": "e7c495f3-f48e-4bbe-ac00-edd07bcc8025",
    "title": "Show 71 - Mania for Subjugation",
    "link": "http://www.dancarlin.com/product/hardcore-history-71-mania-for-subjugation",
    "description": "What's the recipe for making a historically world-class apex predator? In the case of Alexander the Great, it might be the three Ns: Nature, Nurture, and Nepotism.",
    "author": "",
    "published": "Fri, 07 Jun 2024 12:14:53 PST",
    "image": "https://dts.podtrac.com/redirect.mp3/traffic.libsyn.com/dancarlinhh/dchha71_Mania_for_Subjugation.mp3",
    "source": "https://feeds.feedburner.com/dancarlin/history?format=xml",
    "categories": [
      "Alexander the Great",
      " Phillip II",
      " Macedonia",
      " Macedon",
      " Olympias",
      " Demosthenes",
      " Athens",
      " Sparta",
      " Thebes",
      " Persia",
      " history",
      " podcast",
      " ancient",
      " military",
      " Aristotle",
      " Greece",
      " Hellenistic"
    ]
  },
  {
    "id": "a5322e3b-19cc-4221-a1c5-ddd9068a8a5e",
    "title": "Show 70 - Twilight of the Aesir II",
    "link": "http://www.dancarlin.com/product/hardcore-history-70-twilight-of-the-aesir-ii",
    "description": "Pagan Viking Sea Kings spend the 10th and 11th centuries morphing into Christian monarchs. But with rulers like Harald Bluetooth and Svein Forkbeard it's debatable whether things will be any less horrific for Scandinavia's neighbors",
    "author": "",
    "published": "Sun, 19 Nov 2023 12:14:53 PST",
    "image": "https://dts.podtrac.com/redirect.mp3/traffic.libsyn.com/dancarlinhh/dchha70_Twilight_of_the_Aesir_II.mp3",
    "source": "https://feeds.feedburner.com/dancarlin/history?format=xml",
    "categories": [
      "Vikings",
      " Scandinavia",
      " Anglo-Saxon",
      " Franks",
      " Irish",
      " Danes",
      " Norway",
      " Sweden",
      " Rus",
      " Russia",
      " Byzantium",
      " Constantinople",
      " raiding",
      " pirates",
      " history",
      " Forkbeard",
      " Bluetooth",
      "Hairfair",
      " Tryggvason"
    ]
  },
  {
    "id": "7a89049b-c223-4f15-ad46-c1ad8f633e0a",
    "title": "Featured Excerpt: President Carter",
    "link": "https://www.thehistoryreader.com/us-history/featured-excerpt-ipresident-carter-i/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=featured-excerpt-ipresident-carter-i",
    "description": "by Stuart E. Eizenstat Grounding the B-1 Bomber Far more complex, both politically and technically, was a divisive debate over whether to build the B-1 bomber, which presents a good lesson in how difficult it is, even for a president with a military background like Carter’s, to balance the appetites of what President Eisenhower called […] The post Featured Excerpt: President Carter appeared first on The History Reader.",
    "author": "Sara Eslami",
    "published": "Tue, 01 Oct 2024 16:13:20 +0000",
    "image": "https://www.thehistoryreader.com/wp-content/uploads/2024/10/017_03_20_10_53_18-Book-Cover-Pics-300x231.jpg",
    "source": "https://www.thehistoryreader.com/feed/",
    "categories": [
      "Historical Figures",
      "U. S. History",
      "Jimmy Carter",
      "president carter",
      "President Jimmy Carter",
      "stuart e. eizenstat"
    ]
  },
  {
    "id": "ed313084-f594-4105-9f0c-fcd4ce947d8a",
    "title": "Wednesday, Bloody Wednesday",
    "link": "https://www.thehistoryreader.com/military-history/wednesday-bloody-wednesday/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=wednesday-bloody-wednesday",
    "description": "by Tom Clavin Should anyone consider “civil war” over the outcome, one way or the other, of the presidential election that is six weeks from now, let’s look at the Battle of Antietam. It took place 162 years ago this month and is often referred to as the bloodiest day of Americans killing Americans. In […] The post Wednesday, Bloody Wednesday appeared first on The History Reader.",
    "author": "Sara Eslami",
    "published": "Fri, 27 Sep 2024 14:58:13 +0000",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Thure_de_Thulstrup_-_Battle_of_Antietam.jpg/1280px-Thure_de_Thulstrup_-_Battle_of_Antietam.jpg",
    "source": "https://www.thehistoryreader.com/feed/",
    "categories": [
      "Military History",
      "U. S. History",
      "Bandit Heaven",
      "Battle of Antietam",
      "Civil War",
      "Tom Clavin"
    ]
  },
  {
    "id": "dfe043ca-bfb1-4a73-bca4-30d29cfa8309",
    "title": "A Return from the Dead in Unstable 17th Century Russia?",
    "link": "http://www.historyisnowmagazine.com/blog/2024/10/12/a-return-from-the-dead-in-unstable-17th-century-russia",
    "description": "Here is a fascinating history from early 17th century Russia, featuring somebody who apparently returned from the dead and a coup to take control of the country. This the story of Prince Dmitri. Lanny Cotton, who wrote the below for a podcast originally, explains. Ivan the Terrible. By Hans Weigel. Today, I would like to tell you a story. A story about a sinister conspiracy, a lost and noble prince, an evil tyrant, and a war over the soul of an empire. Or, more likely, a story about a crazed conspiracy theory, a deceitful imposter, an unfortunate monarch, and a chaotic civil war which brought death and destruction to said empire. Along the way we’ll play knife games with the boys, mutilate a poor, innocent church bell, and perform history’s first and only reverse sled-by shooting. I hope you enjoy the ride.PART ONEOur story begins with Ivan the Terrible, the first Tsar of Russia. Ivan is himself a fascinating figure, but here our story concerns itself with what happened after his death. Oh, and a side note: the epithet “the Terrible” is somewhat misleading. The Russian word “grozny” is translated into “terrible” in the sense of something “inspiring terror”, rather than being of low quality. It wasn’t a pleasant nickname, but it wasn’t an insult either, and it suited the paranoid Tsar who had thousands of his subjects murdered on the slightest provocations. Ivan’s first wife was a woman named Anastasia Romanovna, who he chose out of a lineup of a few hundred other eligible maidens. It seems that Anastasia and Ivan got along fairly well, and she managed to keep his more violent tendencies at bay. The couple had six children, four of which would die in infancy. This left Ivan with an heir and a spare, Prince Ivan Ivanovich and Prince Feodor. In the summer of 1560, Anastasia died of a sudden illness. Ivan was convinced that his beloved wife was poisoned and began a purge against the boyars, the Russian nobility, having many noblemen tortured and executed. Was this pure paranoia? In 2001, Anastasia’s body was examined by Russian scientists, who discovered a high buildup of mercury in her bones, a sign that the Tsar’s wife may have actually been poisoned. Ivan took at least five more wives after Anastasia, though there are later reports of another two which historians doubt. Technically, this was illegal under the rules of the Russian Orthodox Church, which only permitted three marriages in a lifetime. Ivan was Tsar, though, and didn’t have to care about the rules. The next two wives, Maria and Marfa, also died suddenly, kicking off another couple rounds of purges. The two after that, both named Anna, eventually bored their imperial husband and found themselves shipped off to nunneries. The sixth and final of Ivan’s canonical wives was named Maria Nagaya. Ivan and Maria didn’t get along well, and she almost got nunneried like the Annas, but then she got pregnant. Maria gave birth on October 19, 1582 to little Prince Dmitri, Ivan’s third son.So let’s talk about the sons. First is Prince Ivan Ivanovich. This Ivan seems to have been a good heir, intelligent and capable, and he might have made a good Tsar. But we’ll never know, because on November 15th, 1581, the two Ivans got into a heated argument which ended in the Tsar striking his son and heir with his scepter. The blow broke the prince’s skull and sent him into a coma. Four days later he died without waking up. This left Feodor as heir, which was problematic because Feodor was kind of useless. Feodor was weak and sickly since childhood, and while personally nice he never showed interest in rulership, preferring to spend his days in prayer and meditation. Some historians believe he may have suffered from some sort of learning disorder, in particular placing him somewhere on the autism spectrum, though we’ll never know for sure. When Ivan died in March of 1584, Feodor was crowned Tsar. However, Feodor didn’t actually reign. The responsibilities of government were turned over to a council of boyars, led by a man named Boris Godunov. The Godunov family was not powerful or influential, Boris had only gotten into the Muscovite court because his father-in-law was the head of the oprichnina, Ivan the Terrible’s infamous secret police.  Feodor was at this time 27 years old, though it was clear that he would never make a good Tsar, and that his regency would be in effect perpetual. And since Feodor didn’t have any children of his own, the technically illegitimate Dmitri stood to inherit the empire. This meant that he could pose a threat to Boris’ regency, should he grow up to be a better ruler than his half-brother. Shortly after Ivan’s death and Feodor’s ascension to the throne, Boris had the sixteen month old Dmitri and his mother Maria sent off to the town of Uglich on the Volga River. The young prince seemed to have suffered from epileptic seizures, but other than that was healthy. His hobbies are said to have included watching cows be slaughtered and beating chickens to death with sticks, which maybe aren’t the most wholesome activities for an eight year old, but who am I to say? He also seemed to have enjoyed a game which consisted of throwing a marlinspike into the ground. What happened next isn’t quite clear. On May 15th, 1591, the eight year old Dmitri was found dead of a neck wound. There are two theories about what happened. The official story, published soon after, was that Dmitri had a seizure while playing the game and ended up falling onto his marlinspike. This was the conclusion of an inquiry led by a boyar by the name of Vasily Shuisky. Remember that name. But the other theory was much sexier. This theory stated that Boris Godunov, the tsar in all but name, had murdered the rightful heir in order to seize the throne for himself. His death was rather convenient for the regent. Incidentally, Maria Nagaya was sent to a nunnery after all, once her son was dead.The church bell rang to signal the death of the prince. Can you imagine which of the two theories the people of Uglich believed first? That’s right, as soon as the bell rang they knew that their beloved prince had been murdered by the cruel tyrant in Moscow. And so they rioted, led by Boris’ political enemies. The citizens of Uglich did usual riot stuff, murdered tax collectors, burned buildings, stole stuff, the whole thing. Soldiers from Moscow soon arrived to put down the rioting, and many of those who took part were exiled to Siberia. One of these exiles was the bell which had begun the riot by announcing the prince’s death. In addition to being exiled, the bell had its “tongue” removed and was whipped through the streets. In 1892, three hundred years after its heinous crime, the bell was pardoned by Tsar Alexander III and allowed to return to Uglich. It was even given a new tongue. So Dmitri is dead. But his story isn’t over, it’s just beginning. Because in the years after his death, a third theory emerged. This theory stated that the prince was not, in fact, dead. He had been replaced by another poor child who died in his place, and was spirited away from Uglich just before the regent’s agents arrived to carry out their scheme. Tsar Feodor died in February of 1598, less than seven years after his brother. The incompetent tsar had only one child, a daughter who died in childhood four years earlier. Without a clear heir, Boris Godunov declared himself Tsar, breaking a dynastic line that had ruled Russia, according to legend, since the Viking chief Rurik of Novgorod seven hundred years earlier. Things went bad for Tsar Boris pretty quickly. The rumors of his role in the prince’s death had not gone away in the intervening years, if anything they had just spread further. The older and wealthier boyars, those that had survived Ivan’s purges at least, resented Boris for his low birth, which meant from the beginning he was surrounded by potential enemies. During Boris’ tenure as imperial regent he had strengthened the power of the aristocracy at the expense of the peasants, in 1592 ending the traditional practice of serfs being able to move freely for the two weeks surrounding St. George’s Day. Without this privilege serfs were effectively made a part of the land itself, to be bought and sold with the land they worked. This would long outlive Boris and remained law until the 19th century. This was done in a desperate attempt to reverse the economic downturn which plagued Russia during the regency. So Boris was unpopular with both the nobility and the peasantry. This would only get worse, because of events taking place on the other side of the planet, in Peru.PART TWOIn February of 1600, the volcano Huaynaputina, in modern day Peru, erupted. The eruption spewed thousands of tons of ash and debris into the atmosphere, where it partially blocked sunlight across the planet for years to come. Russia was among the hardest hit. 1601 was cold and wet, bad news for agriculture. Winter came early that year, ruining harvests across the empire. Food became scarce, prices skyrocketed, and the imperial treasury was stretched to breaking point. The result was perhaps the harshest famine in Russian history. It’s impossible to put an exact number on the death toll, but historians believe that about one third of the entire Russian population died during the next ten years, from starvation or disease or violence. The situation had spiraled far out of control, and the Tsar was powerless to stop it. What popular support he had dissolved. In the superstitious 17th century, this famine was taken as a sign of God’s wrath. A low-born had schemed his way to the throne by murdering Dmitri, the rightful heir, and possibly the pious Feodor as well. But if the tyrant was overthrown, who would replace him? Remember that third theory I mentioned? Well, in 1603 Dmitri returned from the dead. We still don’t know who exactly this man was, but he was about the same age and looked fairly similar to the dead prince, only a decade older. He first emerged in Poland, under the protection of a powerful Ukrainian nobleman by the name of Adam Vishnevetskii. Poland was the main rival of the Russian Empire, a powerful kingdom to the west. Unlike Russia, Poland had a weak ruler and a powerful aristocracy. The Sejm, the Polish parliament, could veto any of the king’s decisions. Unlike just about every other monarchy in Europe, the Polish monarchy was non-hereditary. When the King died, the next king was elected by the Sejm. The Polish nobility saw the weakness of Russia and supported Dmitri in order to further destabilize their mortal enemies. In October of 1604, Dmitri crossed the border at the front of a Polish army. Boris was unable to organize an effective defense. The Russian army was scattered and mostly under the control of local magnates, many of whom opposed the Godunov regime. The food shortages had hit the army hard, desertion was rampant as hungry soldiers left their posts to become bandits or just return home to protect their families. As word of Dmitri’s return spread across Russia, the peasantry rose in support of their true Tsar, the long-lost prince. Boris waged a war of propaganda against the Pretender, claiming to have “discovered” that his true name was Grigory Otrepev and that he was a disgraced former monk. Boris’ health continued to decline amidst famine and civil war, and in April of 1605 he suddenly died. He was succeeded by his son, the sixteen year old Feodor. Feodor II didn’t last long. Two months into his reign, the teenage Tsar was overthrown and assassinated by Dmitri’s supporters in Moscow. Dmitri himself showed up a few weeks later to enter the city, and was proclaimed Tsar Dmitri I. His “mother”, Maria Nagaya, was brought back from the nunnery and publicly acknowledged him as her lost son. For all intents and purposes, this rando was now the son of Ivan the Terrible and the true Tsar. The evidence? Trust me bro.Almost immediately Dmitri messed it up. His alliance with the hated Poles caught up to the Pretender, and rumors spread that he was a secret Catholic, bent on subverting the holy Orthodoxy and twisting Russia towards damnable Catholic heresy. Oh, and remember that name I told you to remember earlier? I’m sure you do, intelligent and wise listener. Vasily Shuisky, the man who had led the inquiry which concluded that Dmitri had died in an accident, changed his story once Dmitri arrived in Moscow. Now he backed Dmitri’s version of the story, admitting that he lied in his initial report due to pressure from Godunov. But Vasily personally hated the new Tsar. And his once messianic reputation among the peasantry began to fade as conditions failed to improve in the countryside. Not only that, but tensions began to grow between the citizens of Moscow and the new Polish arrivals, soldiers and noblemen supported by Dmitri. This situation was not eased when Dmitri announced his plan to marry a Polish woman, the daughter of one of the noblemen who supported his invasion. On the morning of May 17th, 1606, a week after the wedding and a year after his ascension to the throne, an angry mob stormed the palace. Dmitri tried to flee by jumping out a window and running along the rooftops to safety, but he slipped and fell, breaking his leg. The assassins found the Tsar in the alleyway and killed him, presumably telling him to stay dead this time. Dmitri’s body was stripped naked and dragged through the city, while Vasily Shuisky proclaimed him as a heretic and an imposter. His body was publicly displayed in Red Square for three days, before being loaded into a cannon and fired in the direction of Poland. Two days later, Vasily Shuisky proclaimed himself Tsar Vasily IV, ending the reign of False Dmitri… the First. That’s right, we’re not done yet.PART THREEWord of the coup spread through Russia, triggering a new wave of unrest and resentment. While the sheen had started to fade from the Pretender, he was still fairly popular in the provinces. Vasily worked out a pretty clever way to discount the legend of Dmitri’s survival. He sent agents to Uglich to dig up the prince’s body, and these agents “discovered” that the body was miraculously undecomposed. In Russian Orthodoxy, if a body fails to decay that means that the soul of its former inhabitant has ascended to Heaven and been made a saint. So the eight year old princeling who enjoyed torturing farmyard animals had been worthy of sainthood. He could not be on Earth, he had ascended to Heaven, and Vasily had proof. The prince’s coffin was taken from Uglich to Moscow in a grand procession. The coffin, however, was closed. It did smell nice, apparently. The sainted prince was taken to Archangel Cathedral in Moscow where his coffin was displayed for several days, until even incense could no longer cover up the smell. Then the body was quietly buried. The trick didn’t work. A new rumor emerged in Moscow. Not only did Dmitri survive the first assassination, he also survived the second one. The body dragged through the streets of Moscow and displayed in Red Square was another imposter, and the true Dmitri had escaped once more. The unrest that began with the assassination of Dmitri had by this time escalated into full scale rebellion in western and southern Russia. But these rebels didn’t have a claimant to the throne, so even if they overthrew the government in Moscow they would still struggle to find a Tsar. Into this scene comes a traveling beggar claiming to be Andrei Nagoy, a cousin of Prince/Tsar Dmitri, who claimed to have secret information on his cousin’s whereabouts. His true identity is still unknown, though tradition holds that he was either a priest’s servant banished after sleeping with the priest’s wife, or a Jew who had converted to Christianity to escape persecution. Either way, he was captured by the rebels in July of 1607 in order to reveal Dmitri’s whereabouts. Under threat of torture, this man revealed himself to be the missing prince, escaped from Moscow as he had with Uglich, returned once again to take his rightful throne. Upon this shocking declaration, the rebels pledged their allegiance to their Tsar once more, and suddenly the beggar had an army of thousands at his back. But this Tsar would never make it to Moscow. Like the first false Dmitri, Dmitri number two’s army had a large contingent of foreign mercenaries, largely Polish. But this Dmitri didn’t get along quite as well with the Polish nobility, which meant he lacked the funding to pay those mercenaries. Dmitri II made progress in his campaign northeast, but met with heavy resistance along the way, and his army was hemorrhaging men due to desertion from lack of pay. He received the endorsement of the first False Dmitri’s Polish wife, who recognized the pretender as her lost husband. In 1609, King Sigismund of Poland personally intervened in Russia, officially declaring war on the Moscow government and laying siege to the strategic city of Smolensk. His goal was to place his son, Vladislav, on the Russian throne, effectively making it his vassal. This was a complete disaster for Dmitri. His Polish soldiers preferred to fight on the side of their king rather than a Russian pretender, and those nobles that had supported Dmitri defected to the Polish side, declaring Vladislav the new Tsar instead of the pretender. Another faction defected from both sides. These were those patriotic boyars who opposed the Polish invasion on principle, and saw both Vladislav and Dmitri as foreign interlopers. Back in Moscow, the pro-Polish faction staged a coup against Tsar Vasily in July of 1610, forcing him to become a monk while they established a council of Seven Boyars, turning over control of the capital to the Polish army in September. False Dmitri II didn’t outlast his nemesis for long, though. Pushed back and weakened, Dmitri lashed out at his inner circle. On forged evidence he had one of his bodyguards, Peter Usanov, whipped and fired in December of 1610. The former bodyguard then went out and got drunk with his friends, wandering around the city. Then he stumbled upon his former boss on a sleighride, and being drunk and pissed off, pulled out his pistol and shot Dmitri to death. This is the end of False Dmitri II. Two down, one to go.It’s a cliche at this point that Russia is not a good place to invade, and by 1612 the war had started to go the other way. The Patriotic boyars, led by Dmitri Pozharsky, consolidated their power in what part of Russia remained free and negotiated an alliance with Sweden, then a major military power on the rise in central Europe. Incidentally, the king of Sweden was the uncle of the King of Poland. The Polish soldiers in Moscow were now essentially under siege, much of the city was controlled by rebels and their forces outside the city walls were constantly being raided.It’s about this time that Dmitri returns from the dead for the third, and final, time in the border city of Pskov. We don’t know a lot about this guy, just that he showed up in Pskov and said he was Dmitri. His support outside that city was limited to a handful of rebels sitting outside Moscow and harassing random Poles. The first False Dmitri was a big deal, the second was an occasion, but the third was just redundant. And besides, this Dmitri lacked the charisma of the first and the timing of the second and quickly wore out his welcome. He was overthrown by his subjects and turned over to Moscow, where he was executed in May of 1612. And so ends the time of the False Dmitris. Finally, on October 27th, 1612, Prozharsky retook Moscow from the Polish occupation force. The anniversary is still celebrated as National Unity Day. With the last pretender defeated and the capital liberated, the boyars assembled a grand council to decide, once and for all, who was going to be Tsar. They settled on the sixteen year old Michael Romanov, the son of the Patriarch of Moscow and the great-nephew of Anastasia Romanovna, Ivan the Terrible’s beloved first wife. Despite his young age, Michael managed to hold onto power until his death thirty-two years later, kicked the Poles out of Russia, and established a dynasty which would rule Russia until the Russian Revolution in 1917. The period between the death of Feodor I and the ascension of Michael I is known in Russia as the “Time of Troubles”. In fifteen years over one third of the population of Russia had died, the empire had been torn apart by famine and civil war, and central authority had completely collapsed. The Empire that arose from this chaos was more authoritarian than the one that had fallen. The vast majority of the population were serfs, in effect slaves tied to the land. After fifteen years of chaos the nobility accepted Tsarist autocracy as a restoration of proper order. The Tsar became a quasi-religious figure, chosen by God to guide Russia and prevent a second Time of Troubles. The legacy of this autocratic turn still lingers in Russia to this day. Find that piece of interest? If so, join us for free by clicking here.  ReferencesThe main source here is A Short History of Russia’s First Civil War: The Time of Troubles and the Founding of the Romanov Dynasty by Chester S.L. Dunning, if you want to know more go read it. It's a good book.",
    "author": "George Levrier-Jones",
    "published": "Sat, 12 Oct 2024 12:21:00 +0000",
    "image": "https://images.squarespace-cdn.com/content/v1/50adfa2ae4b0cc1d786569eb/aba1da39-c18b-405e-96e4-d39f7051ad34/20241012+512px-Ivan_IV_the_Terrible_portrait_by_Weigel_1882.jpg?format=1000w",
    "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
    "categories": [
      "Blog Post"
    ]
  },
  {
    "id": "4e74c262-e7e4-4cb5-a3d3-99e58e60b122",
    "title": "The Andaman Islands - And Why We Need to Protect the People There",
    "link": "http://www.historyisnowmagazine.com/blog/2024/10/11/the-andaman-islands-and-why-we-need-to-protect-the-people-there",
    "description": "The seventy-seventh anniversary of India and Pakistan’s Independence from Great Britain recently took place, ending a nearly 200 year reign dating back to the British victory at the Battle of Plassey in 1757. But one territory of India has known a very different type of independence for much longer than that.Michael Thomas Leibrandt explains. Maurice Vidal Portman with Andamanese chiefs. Only six weeks away from Indigenous People’s Day, and tucked away in the Andaman archipelago, is a small island known as North Sentinel. It’s not only one of the most dangerous places on earth, it’s also one of the most important. Unlike the other islands in the Andaman Chain including South Sentinel Island, this island is quite different.It is home to one of the last isolated tribes on earth, the Sentinelese. It’s been nearly 1200 years since Marco Polo explored the Andaman Islands and first described what we believe were the Sentinelese mistakenly as cannibals.After the British claimed dominion over the India in 1757 — an East India Company shipped first noticed fires on its beaches in 1771. The first colonial, Holmfray (a British surveyor) landed on the Island in 1867. That same year, the MV Ninevah ran aground on North Sentinel’s reef. The 106 passengers and crew fended off attacks by the Sentinelese until a British ship rescued them. Maurice Vidal PortmanWhen Maurice Vidal Portman became British Government Administrator to the Andaman’s — he may multiple trips to the Island starting in January 1880. In one such trip, taking an elderly Sentinelese couple and their grandchildren back to Port Blair. After the elderly grandparents died of disease shortly after arriving at Port Blair, the children were returned to the island with gifts.In 1896, a convict who escaped from a nearby penal colony drifted his way onto the shores of North Sentinel. His body was found days later full of arrows. And then there was the MV Primrose ran aground on the reefs of North Sentinel Island in 1981. After several harrowing days where the Sentinelese attempted to use boats to board the ship — the shaken crew was rescued. In 2006 — a boat with two fisherman drifted onto the beaches of the island and were killed by the Sentinelese. Most recently in 2018, American Missionary John Allen Chau landed on the island was killed by the tribe. In 1975, they even fired arrows at King Leopold III of Belgium.Thankfully, recent history shows us that not all encounters ended in hostility. North Sentinel isn’t just a forbidden, largely unexplored island. In the 1990s, multiple trips to the island from local anthropologists even saw the tribe accepting coconuts as gifts. Sanctioned trips to the island ceased in 1997.Although the isolated land of wonderment continues to be a magnet for encounters between one of the world’s last uncontacted tribes and modern civilization, we cannot allow it to be for many reasons, and a few of those should serve as dire warnings. Lack of immunityJust like those two elderly Sentinelese that Maurice Vidal Portman abducted, the Sentinelese have no immunity to modern diseases which are prevalent in our society today. Whether the tribe’s population is 50 or 400, contact with us — which they clearly don’t want — could wipe them out completely. Contact from a single American missionary could be catastrophic to the entire tribe.Since the dawn of man, we’ve made choices about our planet. Whether because of tribal belief, invaders who abduct their elders and children, or some history that we don’t know like the Japanese occupation of the Andaman Islands, the Sentinelese want nothing to do with us. Successful trips to the island and periods of contact have frequently ended with Sentinelese standing on their haunches and brandishing weapons. We should honor their wishes. Gateway to the pastNorth Sentinel Island isn’t just a forbidden, unexplored Island. It’s a gateway into our past. Around 60,000 years ago, it’s believed that the Sentinelese walked from the nearby continents and became trapped on the Island as sea levels rose. They are a window into our past, a rare look back at where we’ve come from. One that should not be disturbed.With a world population of approximately 8,091,734,930 and a population of less than 500 on North Sentinel — the responsibility is ours to protect them. Not the other way around. The tribe preserves the lifestyle that they choose each and every day by being independently sustainable on that remote island. Even though they are technically part of India — they don’t know it.It could be argued that we need to study their way of life and make every attempt to see North Sentinel Island. But with the dangers that it posses to the people of North Sentinel from both disease and from the unfortunate violence when outsiders are encounters, makes the status quo that has withstood for thousands of years most appropriate.In 2004, after a tsunami had crashed into the Andaman Islands, the Indian Navy dispatched a helicopter to fly over North Sentinel to offer assistance. A lone tribesman emerged pointing a bow and arrow at the helicopter and so communicated the Sentinelese view of us — please leave well enough alone. Michael Thomas Leibrandt is a historical writer who lives and works in Abington Township, PA.",
    "author": "George Levrier-Jones",
    "published": "Fri, 11 Oct 2024 13:17:00 +0000",
    "image": "https://images.squarespace-cdn.com/content/v1/50adfa2ae4b0cc1d786569eb/150d0498-c3f4-47b8-a27e-e2efec7ae875/20241011+512px-M_V_Portman.jpg?format=1000w",
    "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
    "categories": [
      "19th century",
      "Blog Post"
    ]
  },
  {
    "id": "123d201e-7b25-4ffc-8fbf-0de0321fac17",
    "title": "A History of Christian Nationalism",
    "link": "https://www.npr.org/2025/10/09/1260150915/a-history-of-christian-nationalism",
    "description": "References to God and Christianity are sprinkled throughout American life. Our money has \"In God We Trust\" printed on it. Most presidents have chosen to swear their oath of office on the Bible.Christian nationalists want more.Christian nationalist beliefs are rooted in the idea that the United States was founded as a Christian nation, and that its laws should reflect certain Christian values. And versions of these beliefs are widely held by Americans of different ages, races, and backgrounds. In 2022, a Pew Research poll reported that 45 percent of Americans believe the country should be a Christian nation. More than half of those people said the Bible should influence U.S. laws. Today on the show: the complex relationship between Christianity and the U.S.Love Throughline? Please help us out by taking this quick survey! npr.org/throughlinesurveyTo access bonus episodes and listen to Throughline sponsor-free, subscribe to Throughline+ via Apple Podcasts or at plus.npr.org/throughline.Learn more about sponsor message choices: podcastchoices.com/adchoicesNPR Privacy Policy",
    "author": "",
    "published": "Thu, 10 Oct 2024 07:00:59 +0000",
    "image": "https://chrt.fm/track/138C95/prfx.byspotify.com/e/play.podtrac.com/npr-510333/traffic.megaphone.fm/NPR5134404897.mp3?d=3086\u0026size=49385309\u0026e=1260150915\u0026t=podcast\u0026p=510333",
    "source": "https://feeds.npr.org/510333/podcast.xml",
    "categories": null
  },
  {
    "id": "26c42082-532e-4f93-b5d5-a491a70891cf",
    "title": "The Battle For Jerusalem",
    "link": "https://www.npr.org/2024/10/03/1203261209/throughline-the-battle-for-jerusalem",
    "description": "Today, the city of Jerusalem is seen as so important that people are willing to kill and die to control it. And that struggle goes back centuries. Nearly a thousand years ago, European Christians embarked on what became known as the First Crusade: an unprecedented, massive military campaign to take Jerusalem from Muslims and claim the holy city for themselves. They won a shocking victory – but it didn't last. A Muslim leader named Saladin raised an army to take the city back. What happened next was one of the most consequential battles of the Middle Ages: A battle that would forever change the course of relations between the Islamic and Christian worlds, Europe and The Middle East.In this episode, we travel back to the front lines of that battle to explore a simple question: What is Jerusalem worth?Love Throughline? Please help us out by taking this quick survey! npr.org/throughlinesurveyTo access bonus episodes and listen to Throughline sponsor-free, subscribe to Throughline+ via Apple Podcasts or at plus.npr.org/throughline.Learn more about sponsor message choices: podcastchoices.com/adchoicesNPR Privacy Policy",
    "author": "",
    "published": "Thu, 03 Oct 2024 07:00:59 +0000",
    "image": "https://chrt.fm/track/138C95/prfx.byspotify.com/e/play.podtrac.com/npr-510333/traffic.megaphone.fm/NPR6440337113.mp3?d=3011\u0026size=48177407\u0026e=1203261209\u0026t=podcast\u0026p=510333",
    "source": "https://feeds.npr.org/510333/podcast.xml",
    "categories": null
  },
  {
    "id": "e4b4c560-215c-4f1b-93aa-119ffcdd2543",
    "title": "Celebrating the Legacy of the Office of Strategic Services 82 Years On",
    "link": "https://www.historynet.com/celebrating-the-legacy-of-the-office-of-strategic-services-82-years-on/",
    "description": "From the OSS to the CIA, how Wild Bill Donovan shaped the American intelligence community.",
    "author": "Major Nicholas Dockery",
    "published": "Fri, 21 Jun 2024 13:17:24 +0000",
    "image": "https://www.historynet.com/wp-content/uploads/2024/06/The-OSS.jpg",
    "source": "http://www.historynet.com/feed",
    "categories": [
      "Stories",
      "CIA",
      "OSS"
    ]
  },
  {
    "id": "664e6501-200c-40fc-b1d8-230d7385027e",
    "title": "Seminoles Taught American Soldiers a Thing or Two About Guerrilla Warfare",
    "link": "https://www.historynet.com/seminole-warrior-vs-us-soldier-book-review-2/",
    "description": "During the 1835–42 Second Seminole War and as Army scouts out West, these warriors from the South proved formidable.",
    "author": "Jon Guttman",
    "published": "Fri, 12 Apr 2024 12:24:00 +0000",
    "image": "https://www.historynet.com/wp-content/uploads/2024/02/book-review-seminole-warrior-ww.jpg",
    "source": "http://www.historynet.com/feed",
    "categories": [
      "Review",
      "Book Review",
      "Florida",
      "military history",
      "Native Americans",
      "Tactics"
    ]
  }
]
