{
  "id": "0814bf5e-c17f-4896-9eb0-29576e80e513",
  "title": "NASA Awards Launch Service for Mission to Study Storm Formation",
  "link": "https://www.nasa.gov/news-release/nasa-awards-launch-service-for-mission-to-study-storm-formation/",
  "description": "NASA has selected Firefly Aerospace Inc. of Cedar Park, Texas, to provide the launch service for the agency’s Investigation of Convective Updrafts (INCUS) mission, which aims to understand why, when, and where tropical convective storms form, and why some storms produce extreme weather. The mission will launch on the company’s Alpha rocket from NASA’s Wallops […]",
  "author": "Tiernan P. Doyle",
  "published": "Tue, 04 Mar 2025 21:30:39 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Investigation of Convective Updrafts (INCUS)",
    "Earth Science",
    "Planetary Science Division",
    "Science \u0026 Research",
    "Science Mission Directorate",
    "SmallSats Program",
    "Wallops Flight Facility"
  ],
  "byline": "",
  "length": 2693,
  "excerpt": "NASA has selected Firefly Aerospace Inc. of Cedar Park, Texas, to provide the launch service for the agency’s Investigation of Convective Updrafts (INCUS)",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Tiernan P. DoyleMar 04, 2025 NASA has selected Firefly Aerospace Inc. of Cedar Park, Texas, to provide the launch service for the agency’s Investigation of Convective Updrafts (INCUS) mission, which aims to understand why, when, and where tropical convective storms form, and why some storms produce extreme weather. The mission will launch on the company’s Alpha rocket from NASA’s Wallops Flight Facility in Virginia. The selection is part of NASA’s Venture-Class Acquisition of Dedicated and Rideshare (VADR) launch services contract. This contract allows the agency to make fixed-price indefinite-delivery/indefinite-quantity awards during VADR’s five-year ordering period, with a maximum total value of $300 million across all contracts. The INCUS mission, comprised of three SmallSats flying in tight coordination, will investigate the evolution of the vertical transport of air and water by convective storms. These storms form when rapidly rising water vapor and air create towering clouds capable of producing rain, hail, and lightning. The more air and water that rise, the greater the risk of extreme weather. Convective storms are a primary source of precipitation and cause of the most severe weather on Earth. Each satellite will have a high frequency precipitation radar that observes rapid changes in convective cloud depth and intensities. One of the three satellites also will carry a microwave radiometer to provide the spatial content of the larger scale weather observed by the radars. By flying so closely together, the satellites will use the slight differences in when they make observations to apply a novel time-differencing approach to estimate the vertical transport of convective mass. NASA selected the INCUS mission through the agency’s Earth Venture Mission-3 solicitation and Earth System Science Pathfinder program. The principal investigator for INCUS is Susan van den Heever at Colorado State University in Fort Collins. Several NASA centers support the mission, including Langley Research Center in Hampton, Virginia, the Jet Propulsion Laboratory in Southern California, Goddard Space Flight Center in Greenbelt, Maryland, and Marshall Space Flight Center in Huntsville, Alabama. Key satellite system components will be provided by Blue Canyon Technologies and Tendeg LLC, both in Colorado. NASA’s Launch Services Program, based at the agency’s Kennedy Space Center in Florida, manages the VADR contract. To learn more about NASA’s INCUS mission, visit: https://science.nasa.gov/mission/incus -end- Tiernan DoyleHeadquarters, Washington202-358-1600tiernan.doyle@nasa.gov Patti BiellingKennedy Space Center, Florida321-501-7575patricia.a.bielling@nasa.gov",
  "image": "https://www.nasa.gov/wp-content/uploads/2024/08/meatball-w-black-background.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-829847\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://secure.gravatar.com/avatar/e6b71674c5a285e0963cf2fd1553b5fd?s=300\u0026amp;d=blank\u0026amp;r=g\" alt=\"The headshot image of Tiernan P. Doyle\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch3\u003eTiernan P. Doyle\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eMar 04, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cp\u003eNASA has selected Firefly Aerospace Inc. of Cedar Park, Texas, to provide the launch service for the agency’s Investigation of Convective Updrafts (INCUS) mission, which aims to understand why, when, and where tropical convective storms form, and why some storms produce extreme weather. The mission will launch on the company’s Alpha rocket from NASA’s Wallops Flight Facility in Virginia.\u003c/p\u003e\n\u003cp\u003eThe selection is part of NASA’s \u003ca href=\"https://www.nasa.gov/vadr-venture-class-acquisition-of-dedicated-and-rideshare-launch-services/\"\u003eVenture-Class Acquisition of Dedicated and Rideshare\u003c/a\u003e (VADR) launch services contract. This contract allows the agency to make fixed-price indefinite-delivery/indefinite-quantity awards during VADR’s five-year ordering period, with a maximum total value of $300 million across all contracts.\u003c/p\u003e\n\u003cp\u003eThe INCUS mission, comprised of three SmallSats flying in tight coordination, will investigate the evolution of the vertical transport of air and water by convective storms. These storms form when rapidly rising water vapor and air create towering clouds capable of producing rain, hail, and lightning. The more air and water that rise, the greater the risk of extreme weather. Convective storms are a primary source of precipitation and cause of the most severe weather on Earth.\u003c/p\u003e\n\u003cp\u003eEach satellite will have a high frequency precipitation radar that observes rapid changes in convective cloud depth and intensities. One of the three satellites also will carry a microwave radiometer to provide the spatial content of the larger scale weather observed by the radars. By flying so closely together, the satellites will use the slight differences in when they make observations to apply a novel time-differencing approach to estimate the vertical transport of convective mass.\u003c/p\u003e\n\u003cp\u003eNASA selected the INCUS mission through the agency’s \u003ca href=\"https://www.nasa.gov/news-release/nasa-selects-new-mission-to-study-storms-impacts-on-climate-models/\"\u003eEarth Venture Mission-3\u003c/a\u003e solicitation and \u003ca href=\"https://essp.nasa.gov/\" rel=\"noopener\"\u003eEarth System Science Pathfinder\u003c/a\u003e program. The principal investigator for INCUS is Susan van den Heever at Colorado State University in Fort Collins. Several NASA centers support the mission, including Langley Research Center in Hampton, Virginia, the Jet Propulsion Laboratory in Southern California, Goddard Space Flight Center in Greenbelt, Maryland, and Marshall Space Flight Center in Huntsville, Alabama. Key satellite system components will be provided by Blue Canyon Technologies and Tendeg LLC, both in Colorado. NASA’s Launch Services Program, based at the agency’s Kennedy Space Center in Florida, manages the VADR contract.\u003c/p\u003e\n\u003cp\u003eTo learn more about NASA’s INCUS mission, visit:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://science.nasa.gov/mission/incus\" rel=\"noopener\"\u003e\u003cstrong\u003ehttps://science.nasa.gov/mission/incus\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e-end-\u003c/p\u003e\n\u003cp\u003eTiernan Doyle\u003cbr/\u003eHeadquarters, Washington\u003cbr/\u003e202-358-1600\u003cbr/\u003e\u003ca href=\"mailto:tiernan.doyle@nasa.gov\"\u003etiernan.doyle@nasa.gov\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePatti Bielling\u003cbr/\u003eKennedy Space Center, Florida\u003cbr/\u003e321-501-7575\u003cbr/\u003e\u003ca href=\"mailto:patricia.a.bielling@nasa.gov\"\u003epatricia.a.bielling@nasa.gov\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
