{
  "id": "0a826904-0596-4252-ac81-0217782fde3b",
  "title": "The NASA DC-8 Retires: Reflections on its Contributions to Earth System Science",
  "link": "https://science.nasa.gov/science-research/earth-science/the-nasa-dc-8-retires-reflections-on-its-contributions-to-earth-system-science/",
  "description": "Introduction Since 1987, a highly modified McDonnell Douglas DC-8 aircraft has been a workhorse in NASA’s Airborne Science Program (ASP)—see Photo 1. The aircraft, located at NASA’s Armstrong Flight Research Center (AFRC) in California, flew countless missions as a science laboratory, producing science data that supports projects serving the world’s scientific community, particularly the NASA […]",
  "author": "",
  "published": "Tue, 11 Mar 2025 18:23:27 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Earth Science"
  ],
  "byline": "mmarosy",
  "length": 16467,
  "excerpt": "Introduction",
  "siteName": "NASA Science",
  "favicon": "https://science.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Introduction Since 1987, a highly modified McDonnell Douglas DC-8 aircraft has been a workhorse in NASA’s Airborne Science Program (ASP)—see Photo 1. The aircraft, located at NASA’s Armstrong Flight Research Center (AFRC) in California, flew countless missions as a science laboratory, producing science data that supports projects serving the world’s scientific community, particularly the NASA Earth science community. NASA recently decided to retire the venerable DC-8 aircraft, which made its last science flight in April 2024. The DC-8 is being replaced with a similarly refurbished Boeing 777 aircraft, which will be even more capable than the DC-8. More information is available about the full history of ASP, its primary objectives, and its many achievements in an archived article: see “Flying in the ‘Gap’ Between Earth and Space: NASA’s Airborne Science Program” [The Earth Observer, September–October 2020, 32:5, 4–14]. Workshop Overview The NASA History Office and NASA Earth Science Division cohosted a workshop, titled “Contributions of the DC-8 to Earth System Science at NASA,” October 24–25, 2024 at the Mary W. Jackson NASA Headquarters (HQ) Building in Washington, DC – see Photo 2. The agenda included not just the DC-8’s contributions to Earth Science at NASA, but also its role supporting the Aeronautics Research Mission Directorate and work in space science. Many DC-8 veterans – including several who are now retired – attended the event in person or online. The program consisted of six panels and roundtables, each calling attention to a unique aspect of the DC-8 story. The event featured 38 individuals (speakers, panelists, and moderators) from NASA HQ, five NASA centers, eight universities, the Search for Extraterrestrial Intelligence Institute, and the National Oceanic and Atmospheric Administration. In addition, Spanish filmmaker Rafael Luis Méndez Peña debuted a trailer for his documentary film, NASA-817, on October 24 and took photographs during the workshop. *** MAY HAVE TO DELETE: The ??? agenda a workshop recording ???, and other related materials are available through the NASA History Office. **** The Tale of the NASA DC-8 The article follows the outline of the workshop, which placed the DC-8 in the context of the overall history of NASA aircraft observations, science campaigns, community, and international collaboration, education and outreach activities. A History in Context: the DC-8 and NASA’s Airborne Science Program NASA’s involvement in airborne science extends to the agency’s inception. The National Aeronautics and Space Act of 1958 states that NASA’s first objective shall be “the expansion of human knowledge of phenomena in the atmosphere and space.” Subsequent legislation expanded NASA’s role in atmospheric and Earth system science. To fulfill this objective, NASA maintains a fleet of airborne platforms through ASP – see Figure – to study the environment, develop new technologies, verify satellite data, and monitor space vehicle activity. NASA operated two large flying laboratories prior to the DC-8 Airborne Science Laboratory. Both aircraft were converted Convair (CV) 990s. Regrettably, both aircraft succumbed to catastrophic accidents. The first, known as Galileo, collided with a U.S. Navy P-3 Orion near Moffett Field, CA, in April 1973, killing 11 NASA personnel. Its replacement, Galileo II, crashed on takeoff at March Air Force Base in July 1985. While there were no fatalities in the second accident, the ensuing fire consumed the aircraft and its instruments. The loss of Galileo II left a gaping hole in NASA’s ability to conduct essential scientific and engineering research. In January 1986, after months of bureaucratic scrambling, NASA finalized the purchase of former commercial airliner (DC-8-72) for $24 million, which included costs to modify the aircraft to carry a science payload and crew. The modified DC-8 Airborne Science Laboratory – shown in Photo 2 – arrived at NASA's Ames Research Center during the Summer of 1987. Overview Presentations on Airborne Science Jack Kaye [NASA Headquarters—Associate Director for Research of the Earth Science Division] gave the meeting’s opening remarks, where he placed the DC-8’s activities in a larger perspective. He noted that one of the features that makes airborne science so unique at NASA is the combination of platforms, sensors, systems, people, and opportunities. The DC-8 was able to carry a large number of people as well as instruments to carry out long-range operations under diverse conditions. “[The DC-8 offered] a really versatile, flexible platform that’s allowed for lots of science,” said Kaye. Later in the meeting, Karen St. Germain [NASA Headquarters—Director of the Earth Science Division] built upon Kaye’s comments. She noted that while NASA’s satellite missions receive most of the public’s attention, airborne science is an essential part of the NASA mission. “This is the grassroots of science,” she stressed. “It’s where a lot of the great ideas are born. It’s where a lot of the fledgling sensor technologies are demonstrated.” First Flight for the DC-8 NASA routinely conducts field campaigns – where ground observations are timed and coordinated with aircraft flights (often at more than one altitude) and with satellite overpasses to gain a comprehensive (multilayered, multiscale) picture of the atmosphere over a certain area. A more detailed account of two NASA field campaigns from the 1980s and 1990s, and their follow-up missions, is available in an archived article: see “Reflections on FIFE and BOREAS: Historical Perspective and Meeting Summary” [The Earth Observer, January–February 2017, 29:1, 6–23]. The article illustrates scaled observations as they were conducted during FIFE and BOREAS. Researchers first used the DC-8 Airborne Science Laboratory on a high-profile interagency field campaign – Antarctic Airborne Ozone Expedition (AAOE), the first airborne experiment to study the chemistry and dynamics of the Antarctic ozone hole. The scientific data collected during AAOE produced unequivocable evidence that human-made chemicals were involved in the destruction of ozone over the Antarctic. This data served as a major impetus toward the enactment of amendments to the Montreal Protocol, which banned the manufacture of chlorofluorocarbons. Estelle Condon [NASA’s Ames Research Center (ARC), emeritus] was a program manager for AAOE. During the meeting, she shared her memories of the hectic days leading up to the DC-8’s first mission. “There was an enormous task in front of [the aircraft team] – just a huge task – to get all the relay racks, all the wiring, all the ports for the windows designed and built so that when the scientists finally came, all that instrumentation could actually be put on the aircraft,” said Condon. She added that the ARC staff worked day and night and every weekend to make the plane ready. “It’s a miracle that they were able to put everything together and get it to the tip of South America in time for the mission,” she said. Other Noteworthy Field Campaigns Involving the DC-8 The DC-8 would go on to be used in many other field campaigns throughout its 37-year history and was central to several of NASA’s research disciplines. For example, Michael Kurylo [NASA Headquarters—Atmospheric Composition Program Scientist] was the manager of NASA’s Upper Atmosphere Research Program, where he developed, promoted, and implemented an extramural research program in stratospheric and upper tropospheric composition and directed its advanced planning at a national and international level. Kurylo summarized the DC-8’s many flights to study stratospheric chemistry beyond the AAOE missions. Kurylo also discussed the DC-8’s role in tropospheric chemistry investigations, especially through the many field campaigns that were conducted as part of the Global Troposphere Experiment (GTE). He also touched on the culture of NASA airborne science and the dynamic that existed between scientists and those who operated and maintained the aircraft.  “The scientists were always referred to [by NASA pilots and ground crew] as ‘coneheads’…. Too much college, not enough high school,” Kurylo explained. But he and his colleagues have such fond memories of their time spent working together onboard the DC-8.  James Crawford [NASA’s Langley Research Center], a project scientist for many of the GTE campaigns, explained that from 1983–2001 16 GTE aircraft-based missions, each with its own name and location, took place. Each mission collected a rich set of data records of atmospheric observations and on many occasions the data were used as baselines for subsequent campaigns. The DC-8 was one of several NASA aircraft involved, the others being the Corvair-990, Electra, and P-3B. Joshua Schwarz [NOAA’s Chemical Science Laboratory] discussed the airplane’s role in global atmospheric monitoring.  He recalled thinking, after his first experience with the DC-8 that this flying airborne laboratory, “…was going to make things possible that wouldn’t otherwise be possible.” Other workshop participants went on to describe how – for nearly four decades – investigators used data collected by instruments on the DC-8 to conduct research and write papers on important scientific and engineering topics. The People Behind the Aircraft: The DC-8 Community The DC-8 was a large and durable aircraft capable of long-range flights, which made it ideal for conducting scientific research. Around these research efforts a strong community emerged. Over three decades, the DC-8 accommodated many investigators from NASA, interagency offices, U.S. universities, and international organizations on extended global missions. Agency officials also moved the DC-8 base of operations several times between 1986 and 2024, thereby demanding tremendous cross-center cooperation. “Looking around the room, it’s clear that what brought us together [for the workshop] is more than just an aircraft,” said Nickelle Reid [NASA’s Armstrong Flight Research Center]. “It’s been a shared commitment, decades of passion and dedication from scientists, yes, but also mechanics, technicians, integration engineers, project managers, mission planners, operations engineers, flight engineers, mission directors, mission managers, logistics technicians and, of course, pilots. This village of people has been the beating heart of the DC-8 program.” This DC-8 community was well represented at this workshop and played a key role in its success. The DC-8 as a Means of International Engagement The DC-8 community expanded beyond the U.S., opening unique opportunities for international engagement. The campaigns of the DC-8 Airborne Science Laboratory routinely involved foreign students, institutions, and governments. For example, the Korea–U.S. Air Quality (KORUS-AQ) campaign, an international cooperative air quality field study in Korea, took place in 2016. For more information about this campaign, see the archived Earth Observer article, “Flying in the ‘Gap’ Between Earth and Space: NASA’s Airborne Science Program” [The Earth Observer, September–October 2022, 32:5, 4–14]. Yunling Lou [NASA/Jet Propulsion Laboratory] spoke to the workshop audience about the value of international collaboration. “I think [international collaboration] really helped – not just doing the collaboration [to accomplish a specific mission] but doing the training, the capacity building in these countries to build the community of global scientists and engineers,” said Lou. Trina Dryal [LaRC—Deputy Director] continued that the DC-8 and NASA’s other airborne assets are more than just science laboratories. “[They] are opportunities for science, diplomacy, international collaboration, cross learning, educational inspiration, and goodwill,” said Dryal – see Photo 3. Student Investigations on the DC-8 Closer to home, the flying scientific laboratory affected the lives of many U.S. students and early career professionals. NASA’s Student Airborne Research Program (SARP), is an eight-week summer internship for rising-senior undergraduates that takes place annually on the East and West coasts of the U.S. – see Photo 4. During the program, students gain hands-on experience conducting all aspects of a scientific campaign. They conduct field research, analyze the data, and gain access to one or more of NASA’s ASP flying science laboratories.  *** EITHER FILL (from JACK) OR DELETE this sentence: Since 2009, this program alone has provided hands on experience in conducting NASA Earth science research to XXXX students. *** Berry Lefer [NASA Headquarters—Tropospheric Composition Program Manager] pointed out that SARP helped to integrate American students into DC-8 scientific missions. “I want to make sure the NASA historians understand that the DC-8 is the premier flying laboratory on the planet, bar none,” said Lefer. “You've seen over the whole three-decade life of the DC-8 that education and outreach, student involvement has been a hallmark of the DC-8 [program].” Yaitza Luna-Cruz [NASA Headquarters—Program Executive] was one among several SARP alumni who delivered testimony on the impact of the SARP program at the workshop. “SARP unleashed my potential in ways that I cannot even describe,” said Luna-Cruz. “You never know what a single opportunity could do to shape the career of a student or early career researcher. Luna-Cruz hopes these efforts continue with the coming of NASA’s new Boeing 777 airborne laboratory. Final Flight and Retirement of the DC-8 The DC-8 Airborne Science Laboratory flew its last science flight during the international Airborne and Satellite Investigation of Asian Air Quality mission (ASIA-AQ) in April 2024. Since its final flight, the aircraft has been retired to Idaho State University (ISU). Today, students in ISU’s aircraft maintenance program work on the airplane to develop real-world technical skills – continuing the DC-8’s long history as an educational platform. According to Gerald Anhorn [ISU—Dean of College of Technology], ISU students have a unique opportunity to gain experience working on a legendary research aircraft. “Our students have that opportunity because of [NASA’s] donation” to the school, said Auborn. Conclusion: Flying Toward the Future – From DC-8 to Boeing 777 While the DC-8 is retiring from active service, airborne observations continue to be a vital part of NASA’s mission. The agency recently acquired a Boeing 777and will modify it to support its ongoing airborne scientific research efforts. This new addition expands beyond the capacity of the DC-8 by allowing for even longer flights with larger payloads and more researchers to gather data. Several members of the Boeing 777 team from NASA’s Langley Research Center (LaRC) attended the workshop.  “I mentioned I was in charge of the ‘replacement’ for the DC-8,” said Martin Nowicki [LaRC—Boeing 777 Lead]. “Over the last two days, here, it’s become pretty apparent that there’s no ‘replacing’ the DC-8. It’s carved out its own place in history. It’s just done so much.” Nowicki looks forward to working with workshop participants to identify useful lessons of the past for future operators. He concluded that the Boeing 777 will carry the legacy of the DC-8 and continue with capturing the amazing science of ASP. Acknowledgments The authors wish to thank Jack Kaye [NASA HQ—Associate Director of Research for the Earth Science Division] for his helpful reviews of the article draft.  The first author also wishes to thank Lisa Frazier [NASA Headquarters—Strategic Events and Engagement Lead] for providing support and assistance throughout for the in-person workshop participants. and to the Earth Science Project Office team from NASA’s Ames Research Center, who performed essential conference tasks, such as website construction, audio-visual support, and food service management. This article is an enhanced version of the first author’s summary, which appeared in the Spring 2025 issue of News \u0026 Notes – the NASA History Office’s newsletter. Bradley L. ColemanNASA’s Marshall Space Flight Center, NASA History Officebradley.l.coleman@nasa.gov Alan B. WardNASA’s Goddard Space Flight Center/Global Science \u0026 Technology Inc.alan.b.ward@nasa.gov",
  "image": "https://assets.science.nasa.gov/dynamicimage/assets/science/esd/earth-observer/2025/2025-winter/2025-dc-8/DC8-photo1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\u003cp\u003e\u003cstrong\u003eIntroduction\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eSince 1987, a highly modified McDonnell Douglas DC-8 aircraft has been a workhorse in \u003ca href=\"https://airbornescience.nasa.gov/\"\u003eNASA’s Airborne Science Program\u003c/a\u003e (ASP)—see \u003cstrong\u003ePhoto 1\u003c/strong\u003e. The aircraft, located at NASA’s Armstrong Flight Research Center (AFRC) in California, flew countless missions as a science laboratory, producing science data that supports projects serving the world’s scientific community, particularly the NASA Earth science community. NASA recently decided to retire the venerable DC-8 aircraft, which made its last science flight in April 2024. The DC-8 is being replaced with a similarly refurbished Boeing 777 aircraft, which will be even more capable than the DC-8.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eMore information is available about the full history of ASP, its primary objectives, and its many achievements in an archived article: see “\u003ca href=\"https://eospso.nasa.gov/sites/default/files/eo_pdfs/Sept_Oct_2020_color_508%201.pdf#page=4\"\u003eFlying in the ‘Gap’ Between Earth and Space\u003c/a\u003e: NASA’s Airborne Science Program” [\u003cem\u003eThe Earth Observe\u003c/em\u003er, September–October 2020, \u003cstrong\u003e32:5\u003c/strong\u003e, 4–14].\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWorkshop Overview\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe NASA History Office and NASA Earth Science Division cohosted a workshop, titled “Contributions of the DC-8 to Earth System Science at NASA,”  October 24–25, 2024 at the Mary W. Jackson NASA Headquarters (HQ) Building in Washington, DC – see \u003cstrong\u003ePhoto 2\u003c/strong\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe agenda included not just the DC-8’s contributions to Earth Science at NASA, but also its role supporting the Aeronautics Research Mission Directorate and work in space science. Many DC-8 veterans – including several who are now retired – attended the event in person or online. The program consisted of six panels and roundtables, each calling attention to a unique aspect of the DC-8 story.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThe event featured 38 individuals (speakers, panelists, and moderators) from NASA HQ, five NASA centers, eight universities, the Search for Extraterrestrial Intelligence Institute, and the National Oceanic and Atmospheric Administration. In addition, Spanish filmmaker Rafael Luis Méndez Peña debuted a trailer for his documentary film, \u003cem\u003eNASA-817\u003c/em\u003e, on October 24 and took photographs during the workshop. *** \u003cstrong\u003eMAY HAVE TO DELETE\u003c/strong\u003e: The ??? agenda a workshop recording ???, and other related materials are available through the NASA History Office. ****\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThe Tale of the NASA DC-8\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe article follows the outline of the workshop, which placed the DC-8 in the context of the overall history of NASA aircraft observations, science campaigns, community, and international collaboration, education and outreach activities.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eA History in Context: the DC-8 and NASA’s Airborne Science Program\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eNASA’s involvement in airborne science extends to the agency’s inception. The National Aeronautics and Space Act of 1958 states that NASA’s first objective shall be “the expansion of human knowledge of phenomena in the atmosphere and space.” Subsequent legislation expanded NASA’s role in atmospheric and Earth system science. To fulfill this objective, NASA maintains a fleet of airborne platforms through ASP – see \u003cstrong\u003eFigure\u003c/strong\u003e – to study the environment, develop new technologies, verify satellite data, and monitor space vehicle activity.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eNASA operated two large flying laboratories prior to the DC-8 Airborne Science Laboratory. Both aircraft were converted Convair (CV) 990s. Regrettably, both aircraft succumbed to catastrophic accidents. The first, known as \u003cem\u003eGalileo\u003c/em\u003e, collided with a U.S. Navy P-3 Orion near Moffett Field, CA, in April 1973, killing 11 NASA personnel. Its replacement, \u003cem\u003eGalileo II\u003c/em\u003e, crashed on takeoff at March Air Force Base in July 1985. While there were no fatalities in the second accident, the ensuing fire consumed the aircraft and its instruments. The loss of \u003cem\u003eGalileo II\u003c/em\u003e left a gaping hole in NASA’s ability to conduct essential scientific and engineering research.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn January 1986, after months of bureaucratic scrambling, NASA finalized the purchase of former commercial airliner (DC-8-72) for $24 million, which included costs to modify the aircraft to carry a science payload and crew. The modified DC-8 Airborne Science Laboratory – shown in \u003cstrong\u003ePhoto 2\u003c/strong\u003e – arrived at NASA\u0026#39;s Ames Research Center during the Summer of 1987.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eOverview Presentations on Airborne Science\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eJack Kaye\u003c/strong\u003e [NASA Headquarters—\u003cem\u003eAssociate Director for Research of the Earth Science Division\u003c/em\u003e] gave the meeting’s opening remarks, where he placed the DC-8’s activities in a larger perspective. He noted that one of the features that makes airborne science so unique at NASA is the combination of platforms, sensors, systems, people, and opportunities. The DC-8 was able to carry a large number of people as well as instruments to carry out long-range operations under diverse conditions.\u003c/p\u003e\n\n\n\n\u003cp\u003e“[The DC-8 offered] a really versatile, flexible platform that’s allowed for lots of science,” said Kaye.\u003c/p\u003e\n\n\n\n\u003cp\u003eLater in the meeting, \u003cstrong\u003eKaren St. Germain\u003c/strong\u003e [NASA Headquarters—\u003cem\u003eDirector of the Earth Science Division\u003c/em\u003e] built upon Kaye’s comments. She noted that while NASA’s satellite missions receive most of the public’s attention, airborne science is an essential part of the NASA mission.\u003c/p\u003e\n\n\n\n\u003cp\u003e“This is the grassroots of science,” she stressed. “It’s where a lot of the great ideas are born. It’s where a lot of the fledgling sensor technologies are demonstrated.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eFirst Flight for the DC-8\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eNASA routinely conducts \u003cem\u003efield campaigns\u003c/em\u003e – where ground observations are timed and coordinated with aircraft flights (often at more than one altitude) and with satellite overpasses to gain a comprehensive (multilayered, multiscale) picture of the atmosphere over a certain area. A more detailed account of two NASA field campaigns from the 1980s and 1990s, and their follow-up missions, is available in an archived article: see “\u003ca href=\"https://eospso.nasa.gov/sites/default/files/eo_pdfs/Jan-Feb%202017%20color%20508.pdf#page=6\"\u003eReflections on FIFE and BOREAS: Historical Perspective and Meeting Summary\u003c/a\u003e” [\u003cem\u003eThe Earth Observer\u003c/em\u003e, January–February 2017, \u003cstrong\u003e29:1\u003c/strong\u003e, 6–23]. The article illustrates scaled observations as they were conducted during FIFE and BOREAS.\u003c/p\u003e\n\n\n\n\u003cp\u003eResearchers first used the DC-8 Airborne Science Laboratory on a high-profile interagency field campaign – \u003ca href=\"https://impact.earthdata.nasa.gov/casei/campaign/AAOE/\"\u003eAntarctic Airborne Ozone Expedition\u003c/a\u003e (AAOE), the first airborne experiment to study the chemistry and dynamics of the Antarctic ozone hole. The scientific data collected during AAOE produced unequivocable evidence that human-made chemicals were involved in the destruction of ozone over the Antarctic. This data served as a major impetus toward the enactment of amendments to the Montreal Protocol, which banned the manufacture of chlorofluorocarbons.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eEstelle Condon\u003c/strong\u003e [NASA’s Ames Research Center (ARC), \u003cem\u003eemeritus\u003c/em\u003e] was a program manager for AAOE. During the meeting, she shared her memories of the hectic days leading up to the DC-8’s first mission.\u003c/p\u003e\n\n\n\n\u003cp\u003e“There was an enormous task in front of [the aircraft team] – just a huge task – to get all the relay racks, all the wiring, all the ports for the windows designed and built so that when the scientists finally came, all that instrumentation could actually be put on the aircraft,” said Condon. She added that the ARC staff worked day and night and every weekend to make the plane ready.\u003c/p\u003e\n\n\n\n\u003cp\u003e“It’s a miracle that they were able to put everything together and get it to the tip of South America in time for the mission,” she said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eOther Noteworthy Field Campaigns Involving the DC-8\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe DC-8 would go on to be used in many other field campaigns throughout its 37-year history\u003c/p\u003e\n\n\n\n\u003cp\u003eand was central to several of NASA’s research disciplines. For example, \u003cstrong\u003eMichael Kurylo\u003c/strong\u003e [NASA Headquarters—\u003cem\u003eAtmospheric Composition Program Scientist\u003c/em\u003e] was the manager of NASA’s Upper Atmosphere Research Program, where he developed, promoted, and implemented an extramural research program in stratospheric and upper tropospheric composition and directed its advanced planning at a national and international level. Kurylo summarized the DC-8’s many flights to study stratospheric chemistry beyond the AAOE missions.\u003c/p\u003e\n\n\n\n\u003cp\u003eKurylo also discussed the DC-8’s role in tropospheric chemistry investigations, especially through the many field campaigns that were conducted as part of the \u003ca href=\"https://www-gte.larc.nasa.gov/\"\u003eGlobal Troposphere Experiment\u003c/a\u003e (GTE). He also touched on the culture of NASA airborne science and the dynamic that existed between scientists and those who operated and maintained the aircraft.  “The scientists were always referred to [by NASA pilots and ground crew] as ‘coneheads’…. Too much college, not enough high school,” Kurylo explained. But he and his colleagues have such fond memories of their time spent working together onboard the DC-8. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eJames Crawford\u003c/strong\u003e [NASA’s Langley Research Center], a project scientist for many of the GTE campaigns, explained that from 1983–2001 \u003ca href=\"https://www-gte.larc.nasa.gov/GTE2/missions/Aircraft_Based_Missions/Aircraft_Based_Missions.htm\"\u003e16 GTE aircraft-based missions\u003c/a\u003e, each with its own name and location, took place. Each mission collected a rich set of data records of atmospheric observations and on many occasions the data were used as baselines for subsequent campaigns. The DC-8 was one of several NASA aircraft involved, the others being the Corvair-990, Electra, and P-3B.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eJoshua Schwarz\u003c/strong\u003e [NOAA’s Chemical Science Laboratory] discussed the airplane’s role in global atmospheric monitoring.  He recalled thinking, after his first experience with the DC-8 that this flying airborne laboratory, “…was going to make things possible that wouldn’t otherwise be possible.” \u003c/p\u003e\n\n\n\n\u003cp\u003eOther workshop participants went on to describe how – for nearly four decades – investigators used data collected by instruments on the DC-8 to conduct research and write papers on important scientific and engineering topics.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe People Behind the Aircraft: The DC-8 Community\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe DC-8 was a large and durable aircraft capable of long-range flights, which made it ideal for conducting scientific research. Around these research efforts a strong community emerged. Over three decades, the DC-8 accommodated many investigators from NASA, interagency offices, U.S. universities, and international organizations on extended global missions. Agency officials also moved the DC-8 base of operations several times between 1986 and 2024, thereby demanding tremendous cross-center cooperation.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Looking around the room, it’s clear that what brought us together [for the workshop] is more than just an aircraft,” said \u003cstrong\u003eNickelle Reid\u003c/strong\u003e [NASA’s Armstrong Flight Research Center]. “It’s been a shared commitment, decades of passion and dedication from scientists, yes, but also mechanics, technicians, integration engineers, project managers, mission planners, operations engineers, flight engineers, mission directors, mission managers, logistics technicians and, of course, pilots. This village of people has been the beating heart of the DC-8 program.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThis DC-8 community was well represented at this workshop and played a key role in its success. \u003ca\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe DC-8 as a Means of International Engagement\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe DC-8 community expanded beyond the U.S., opening unique opportunities for international engagement. The campaigns of the DC-8 Airborne Science Laboratory routinely involved foreign students, institutions, and governments. For example, the \u003ca href=\"https://espo.nasa.gov/korus-aq\"\u003eKorea–U.S. Air Quality\u003c/a\u003e (KORUS-AQ) campaign, an international cooperative air quality field study in Korea, took place in 2016. For more information about this campaign, see the archived \u003cem\u003eEarth Observer \u003c/em\u003earticle, “\u003ca href=\"https://eospso.nasa.gov/sites/default/files/eo_pdfs/Sept_Oct_2020_color_508%201.pdf#page=4\"\u003eFlying in the ‘Gap’ Between Earth and Space\u003c/a\u003e: NASA’s Airborne Science Program” [\u003cem\u003eThe Earth \u003c/em\u003eObserver, September–October 2022, \u003cstrong\u003e32:5\u003c/strong\u003e, 4–14].\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eYunling Lou\u003c/strong\u003e [NASA/Jet Propulsion Laboratory] spoke to the workshop audience about the value of international collaboration.\u003c/p\u003e\n\n\n\n\u003cp\u003e“I think [international collaboration] really helped – not just doing the collaboration [to accomplish a specific mission] but doing the training, the capacity building in these countries to build the community of global scientists and engineers,” said Lou.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eTrina Dryal\u003c/strong\u003e [LaRC—\u003cem\u003eDeputy Director\u003c/em\u003e] continued that the DC-8 and NASA’s other airborne assets are more than just science laboratories.\u003c/p\u003e\n\n\n\n\u003cp\u003e“[They] are opportunities for science, diplomacy, international collaboration, cross learning, educational inspiration, and goodwill,” said Dryal – see \u003cstrong\u003ePhoto 3\u003c/strong\u003e.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\u003cem\u003eStudent Investigations on the DC-8\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eCloser to home, the flying scientific laboratory affected the lives of many U.S. students and early career professionals. NASA’s \u003ca href=\"https://science.nasa.gov/earth-science/early-career-opportunities/student-airborne-research-program/\"\u003eStudent Airborne Research Program\u003c/a\u003e (SARP), is an eight-week summer internship for rising-senior undergraduates that takes place annually on the East and West coasts of the U.S. – see \u003cstrong\u003ePhoto 4\u003c/strong\u003e. During the program, students gain hands-on experience conducting all aspects of a scientific campaign. They conduct field research, analyze the data, and gain access to one or more of NASA’s ASP flying science laboratories.  *** \u003cstrong\u003eEITHER FILL (from JACK) OR DELET\u003c/strong\u003eE\u003cstrong\u003e this sentence\u003c/strong\u003e: Since 2009, this program alone has provided hands on experience in conducting NASA Earth science research to XXXX students.  ***\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eBerry Lefer\u003c/strong\u003e [NASA Headquarters—\u003cem\u003eTropospheric Composition Program Manager\u003c/em\u003e] pointed out that SARP helped to integrate American students into DC-8 scientific missions.\u003c/p\u003e\n\n\n\n\u003cp\u003e“I want to make sure the NASA historians understand that the DC-8 is the premier flying laboratory on the planet, bar none,” said Lefer. “You\u0026#39;ve seen over the whole three-decade life of the DC-8 that education and outreach, student involvement has been a hallmark of the DC-8 [program].”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eYaitza Luna-Cruz\u003c/strong\u003e [NASA Headquarters—\u003cem\u003eProgram Executive\u003c/em\u003e] was one among several SARP alumni who delivered testimony on the impact of the SARP program at the workshop.\u003c/p\u003e\n\n\n\n\u003cp\u003e“SARP unleashed my potential in ways that I cannot even describe,” said Luna-Cruz. “You never know what a single opportunity could do to shape the career of a student or early career researcher.\u003c/p\u003e\n\n\n\n\u003cp\u003eLuna-Cruz hopes these efforts continue with the coming of NASA’s new Boeing 777 airborne laboratory.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003e\u003cem\u003eFinal Flight and Retirement of the DC-8\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe \u003ca href=\"https://www.nasa.gov/image-article/nasas-dc-8-completes-final-mission-set-to-retire/\"\u003eDC-8 Airborne Science Laboratory flew its last science flight\u003c/a\u003e during the international \u003ca href=\"https://www-air.larc.nasa.gov/missions/asia-aq/\"\u003eAirborne and Satellite Investigation of Asian Air Quality\u003c/a\u003e mission (ASIA-AQ) in April 2024. Since its final flight, the aircraft has been retired to Idaho State University (ISU). Today, students in ISU’s aircraft maintenance program work on the airplane to develop real-world technical skills – continuing the DC-8’s long history as an educational platform. According to \u003cstrong\u003eGerald Anhorn\u003c/strong\u003e [ISU—\u003cem\u003eDean of College of Technology\u003c/em\u003e], ISU students have a unique opportunity to gain experience working on a legendary research aircraft.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Our students have that opportunity because of [NASA’s] donation” to the school, said Auborn.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eConclusion: Flying Toward the Future – From DC-8 to Boeing 777\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile the DC-8 is retiring from active service, airborne observations continue to be a vital part of NASA’s mission. The agency recently acquired a Boeing 777and will modify it to support its ongoing airborne scientific research efforts. This new addition expands beyond the capacity of the DC-8 by allowing for even longer flights with larger payloads and more researchers to gather data. Several members of the Boeing 777 team from NASA’s Langley Research Center (LaRC) attended the workshop.\u003c/p\u003e\n\n\n\n\u003cp\u003e “I mentioned I was in charge of the ‘replacement’ for the DC-8,” said \u003cstrong\u003eMartin Nowicki\u003c/strong\u003e [LaRC—\u003cem\u003eBoeing 777 Lead\u003c/em\u003e]. “Over the last two days, here, it’s become pretty apparent that there’s no ‘replacing’ the DC-8. It’s carved out its own place in history. It’s just done so much.”\u003c/p\u003e\n\n\n\n\u003cp\u003eNowicki looks forward to working with workshop participants to identify useful lessons of the past for future operators. He concluded that the Boeing 777 will carry the legacy of the DC-8 and continue with capturing the amazing science of ASP.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\u003cem\u003eAcknowledgments\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe authors wish to thank \u003cstrong\u003eJack Kaye \u003c/strong\u003e[NASA HQ—Associate Director of Research for the Earth Science Division] for his helpful reviews of the article draft.  The first author also wishes to thank\u003cstrong\u003e Lisa Frazier\u003c/strong\u003e [NASA Headquarters—\u003cem\u003eStrategic Events and Engagement Lead\u003c/em\u003e] for providing support and assistance throughout for the in-person workshop participants. and to the Earth Science Project Office team from NASA’s Ames Research Center, who performed essential conference tasks, such as website construction, audio-visual support, and food service management. This article is an enhanced version of the first author’s summary, which appeared in the Spring 2025 issue of\u003ca href=\"https://www.nasa.gov/history/history-publications-and-resources/news-and-notes/\"\u003e \u003cem\u003eNews \u0026amp; Notes\u003c/em\u003e\u003c/a\u003e – the NASA History Office’s newsletter.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eBradley L. Coleman\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003e\u003cem\u003eNASA’s Marshall Space Flight Center, NASA History Office\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003e\u003cem\u003e\u003ca href=\"mailto:bradley.l.coleman@nasa.gov\"\u003ebradley.l.coleman@nasa.gov\u003c/a\u003e\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eAlan B. Ward\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003e\u003cem\u003eNASA’s Goddard Space Flight Center/Global Science \u0026amp; Technology Inc.\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003e\u003cem\u003e\u003ca href=\"mailto:alan.b.ward@nasa.gov\"\u003ealan.b.ward@nasa.gov\u003c/a\u003e\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": "2025-03-11T14:23:27-04:00",
  "modifiedTime": "2025-03-11T15:25:28-04:00"
}
