{
  "id": "22449de5-ff44-4377-96a3-fe986dd4b989",
  "title": "Is there really life on planet K2-18b? We can’t rule it out, but some key questions must be answered | Nathalie Cabrol",
  "link": "https://www.theguardian.com/commentisfree/2025/apr/22/life-on-another-planet-k2-18b-science",
  "description": "A new study of a sphere orbiting a red dwarf star 124 light years from Earth is raising hopes. Here’s why the evidence is inconclusiveNathalie Cabrol is director of the Carl Sagan Center at the Seti InstituteAstrobiology has entered an exciting new phase in recent decades. Since the 1990s, but accelerating in recent years, researchers have begun confirming the existence of exoplanets – that is, planets outside our own solar system – and studying their properties. We now know that planets are common, and a sizeable fraction orbit in the habitable zone of their parent star – suggesting they could have the conditions to sustain biological life.Studies have also revealed entirely new classes of worlds we had no idea could exist. Hycean planets are unknown in our solar system, and are possibly some of the strangest planets discovered to date. They may be ocean-covered worlds with hydrogen-rich atmospheres and, as such, are promising candidates for the detection of biosignature gases – chemical products we associate with living things. But this is not the only possibility. Their discovery has expanded our concept of habitability and challenged our notions of what kinds of environments can sustain life – both as we know it and as we might not.Nathalie Cabrol is director of the Carl Sagan Center at the Seti Institute, and author of The Secret Life of the Universe: An Astrobiologist’s Search for the Origins and Frontiers of Life Continue reading...",
  "author": "Nathalie Cabrol",
  "published": "Tue, 22 Apr 2025 10:39:58 GMT",
  "source": "https://www.theguardian.com/science/space/rss",
  "categories": [
    "Alien life",
    "Science",
    "Astronomy",
    "Space",
    "UK news"
  ],
  "byline": "Nathalie Cabrol",
  "length": 6559,
  "excerpt": "A new study of a sphere orbiting a red dwarf star 124 light years from Earth is raising hopes. Here’s why the evidence is inconclusive, says astrobiologist Nathalie Cabrol",
  "siteName": "the Guardian",
  "favicon": "https://assets.guim.co.uk/static/frontend/icons/homescreen/apple-touch-icon-512.png",
  "text": "Astrobiology has entered an exciting new phase in recent decades. Since the 1990s, but accelerating in recent years, researchers have begun confirming the existence of exoplanets – that is, planets outside our own solar system – and studying their properties. We now know that planets are common, and a sizeable fraction orbit in the habitable zone of their parent star – suggesting they could have the conditions to sustain biological life.Studies have also revealed entirely new classes of worlds we had no idea could exist. Hycean planets are unknown in our solar system, and are possibly some of the strangest planets discovered to date. They may be ocean-covered worlds with hydrogen-rich atmospheres and, as such, are promising candidates for the detection of biosignature gases – chemical products we associate with living things. But this is not the only possibility. Their discovery has expanded our concept of habitability and challenged our notions of what kinds of environments can sustain life – both as we know it and as we might not.Against this backdrop, the recent James Webb space telescope observations of K2-18b, a planet orbiting a red dwarf star 124 light years from Earth, stand out. The latest study, published last week in Astrophysical Journal Letters by a team led by Nikku Madhusudhan, reports a tentative detection of dimethyl sulphide (DMS) or dimethyl disulphide (DMDS), which are gases that we know to be produced by living organisms. While the media tends to focus on the exciting possibility of the presence of life on a distant planet, it seems unlikely that this will be the lasting contribution of this study. As the authors acknowledge, the signal that was detected suggesting the presence of the gases is modest, and other studies may contradict some of its claims.But first, let’s understand why these results could be exciting. Astrobiologists consider DMS and DMDS plausible biosignature candidates, or signs of life, especially on planets with hydrogen-dominated atmospheres. On Earth, marine micro-organisms are the primary producers of DMS. Researchers often cite its presence in theoretical models of sulphur-based biospheres: places where life might thrive in a high-sulphur environment. But there are also known abiotic pathways (not involving life) that could produce the gases. One is the photolysis or electric discharge in hydrogen-sulphide and methane-rich environments, where light or electrical energy could drive the formation of these gases. These pathways have been confirmed by experiments, although they do not produce much DMS or DMDS, and the resulting molecules tend to have a short atmospheric lifetime.The study argues that the inferred abundance of these gases on K2-18b would be difficult to sustain abiotically without strong sources or specific atmospheric conditions. According to the study, the lack of detection of the compound hydrogen sulphide (H2S) makes it harder to explain the presence of sulphur-based gases like DMS by nonbiological processes, since H2S is often a necessary ingredient in the abiotic chemical pathways. On the other hand, scientists can’t fully rule out non-living sources, since they have in the past detected DMS on a lifeless comet.The reported detection of DMS or DMDS, while intriguing, is certainly not definitive. The data cannot distinguish between the two molecules due to their similar infrared features: to the detection instruments, both signals look very similar. The detection level remains within the realm where researchers cannot rule out false positives or error introduced by the experimental equipment. There is another significant caveat: additional information essential to accurately interpreting the data is missing, in particular the planet’s environmental characteristics. Other studies still question whether K2-18b even has a surface, water, or is completely barren.Such contextual information is always critical to proper data analysis. Life co-evolves with its environment, and so if we don’t know much about the environment on a planet, it’s hard to say whether a potential signal of life makes sense. This is difficult in the solar system and even more difficult for exoplanets, because we can only access them through distant observation. For this reason, chemical signals in the form of atmospheric pollutants might actually be the most solid candidates for the presence of life in an exoplanet. Some pollutants are a byproduct of industrial processes or specific technological activities that are not expected to occur naturally in significant quantities on a planet. But DMS and DMDS do not fall into that category; and with them, we are left with the vexing ambiguity that accompanies most of our potential biosignatures.Nevertheless, this study achieves something important beyond its speculations about life. It proposes a methodology that pushes the limits of what can be done with our current technology (some will say too far) in studying exoplanets. It also helps us determine what steps we must take next to refute or validate its findings. For instance, arguments that abundance of DMS or DMDS inferred in the atmosphere by the study is difficult to sustain by non-living processes calls for developing new research that can theoretically, empirically and experimentally seek the existence of these potential nonbiological pathways. To their credit, the authors call for a “dedicated community effort”. But until we can prove the absence of abiotic sources, it is premature to suggest from these molecules that there is life on K2-18b.While the paper repeatedly stresses the preliminary nature of the findings and the need for further data, public statements by the lead author have at times conveyed a stronger sense of confidence than the published evidence supports. When this happens, we miss the critically important opportunity to understand that science progresses carefully, incrementally, and with eyes wide open to its strengths and limitations. There is always room for extraordinary conclusions, but these must be backed by compelling evidence. We are all excited at the prospect that one day soon, we will find unambiguous evidence of life beyond Earth. We are not there yet. But we should celebrate how far we have come, and how each additional bit of knowledge takes us that much closer to a definitive answer. Nathalie Cabrol is director of the Carl Sagan Center at the Seti Institute, and author of The Secret Life of the Universe: An Astrobiologist’s Search for the Origins and Frontiers of Life",
  "image": "https://i.guim.co.uk/img/media/967e4fe877283e5b4e430c31586e5e63ad32832f/0_81_2002_1201/master/2002.jpg?width=1200\u0026height=630\u0026quality=85\u0026auto=format\u0026fit=crop\u0026overlay-align=bottom%2Cleft\u0026overlay-width=100p\u0026overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n\u0026enable=upscale\u0026s=4a920ec7e43e1eeca04a43e36e905408",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"maincontent\"\u003e\u003cp\u003e\u003cspan\u003eA\u003c/span\u003estrobiology has entered an exciting new phase in recent decades. Since the 1990s, but accelerating in recent years, researchers have begun confirming the existence of exoplanets – that is, planets outside our own solar system – and studying their properties. We now know that planets are common, and a sizeable fraction orbit in the habitable zone of their parent star – suggesting they could have the conditions to sustain biological life.\u003c/p\u003e\u003cp\u003eStudies have also revealed entirely new classes of worlds we had no idea could exist. Hycean planets are unknown in our solar system, and are possibly some of the strangest planets discovered to date. They may be ocean-covered worlds with hydrogen-rich atmospheres and, as such, are promising candidates for the detection of biosignature gases – chemical products we associate with living things. But this is not the only possibility. Their discovery has expanded our concept of habitability and challenged our notions of what kinds of environments can sustain life – both as we know it and as we might not.\u003c/p\u003e\u003cp\u003eAgainst this backdrop, the recent \u003ca href=\"https://www.theguardian.com/science/2025/apr/17/scientists-hail-strongest-evidence-so-far-for-life-beyond-our-solar-system\" data-link-name=\"in body link\"\u003eJames Webb space telescope observations\u003c/a\u003e of K2-18b, a planet orbiting a red dwarf star 124 light years from Earth, stand out. The latest study, published last week in Astrophysical Journal Letters by a team led by Nikku Madhusudhan, reports a tentative detection of dimethyl sulphide (DMS) or dimethyl disulphide (DMDS), which are gases that we know to be produced by living organisms. While the media tends to focus on the exciting possibility of the \u003ca href=\"https://www.theguardian.com/science/2025/apr/19/are-we-alone-new-discovery-raises-hopes-of-finding-alien-life\" data-link-name=\"in body link\"\u003epresence of life on a distant planet\u003c/a\u003e, it seems unlikely that this will be the lasting contribution of this study. As the authors acknowledge, the signal that was detected suggesting the presence of the gases is modest, and other studies may contradict some of its claims.\u003c/p\u003e\u003cp\u003eBut first, let’s understand why these results could be exciting. Astrobiologists consider DMS and DMDS plausible biosignature candidates, or signs of life, especially on planets with hydrogen-dominated atmospheres. On Earth, marine micro-organisms are the primary producers of DMS. Researchers often cite its presence in theoretical models of sulphur-based biospheres: places where life might thrive in a high-sulphur environment. But there are also known abiotic pathways (not involving life) that could produce the gases. One is the photolysis or electric discharge in hydrogen-sulphide and methane-rich environments, where light or electrical energy could drive the formation of these gases. These pathways\u003cstrong\u003e \u003c/strong\u003ehave been confirmed by experiments, although they do not produce much DMS or DMDS, and the resulting molecules tend to have a short atmospheric lifetime.\u003c/p\u003e\u003cp\u003eThe study argues that the inferred abundance of these gases on K2-18b would be difficult to sustain abiotically without strong sources or specific atmospheric conditions. According to the study, the lack of detection of the compound hydrogen sulphide (H2S) makes it harder to explain the presence of sulphur-based gases like DMS by nonbiological processes, since H2S is often a necessary ingredient in the abiotic chemical pathways. On the other hand, scientists can’t fully rule out non-living sources, since they have in the past detected DMS on a lifeless comet.\u003c/p\u003e\u003cp\u003eThe reported detection of DMS or DMDS, while intriguing, is certainly not definitive. The data cannot distinguish between the two molecules due to their similar infrared features: to the detection instruments, both signals look very similar. The detection level remains within the realm where researchers cannot rule out false positives or error introduced by the experimental equipment. There is another significant caveat: additional information essential to accurately interpreting the data is missing, in particular the planet’s environmental characteristics. Other studies still question whether K2-18b even has a surface, water, or is completely barren.\u003c/p\u003e\u003cfigure id=\"ccc3a5b3-0de1-44e3-8660-9f50116eabb3\" data-spacefinder-role=\"richLink\" data-spacefinder-type=\"model.dotcomrendering.pageElements.RichLinkBlockElement\"\u003e\u003cgu-island name=\"RichLinkComponent\" priority=\"feature\" deferuntil=\"idle\" props=\"{\u0026#34;richLinkIndex\u0026#34;:6,\u0026#34;element\u0026#34;:{\u0026#34;_type\u0026#34;:\u0026#34;model.dotcomrendering.pageElements.RichLinkBlockElement\u0026#34;,\u0026#34;prefix\u0026#34;:\u0026#34;Related: \u0026#34;,\u0026#34;text\u0026#34;:\u0026#34;Are we alone? New discovery raises hopes of finding alien life\u0026#34;,\u0026#34;elementId\u0026#34;:\u0026#34;ccc3a5b3-0de1-44e3-8660-9f50116eabb3\u0026#34;,\u0026#34;role\u0026#34;:\u0026#34;richLink\u0026#34;,\u0026#34;url\u0026#34;:\u0026#34;https://www.theguardian.com/science/2025/apr/19/are-we-alone-new-discovery-raises-hopes-of-finding-alien-life\u0026#34;},\u0026#34;ajaxUrl\u0026#34;:\u0026#34;https://api.nextgen.guardianapps.co.uk\u0026#34;,\u0026#34;format\u0026#34;:{\u0026#34;design\u0026#34;:8,\u0026#34;display\u0026#34;:0,\u0026#34;theme\u0026#34;:1}}\"\u003e\u003c/gu-island\u003e\u003c/figure\u003e\u003cp\u003eSuch contextual information is always critical to proper data analysis. Life co-evolves with its environment, and so if we don’t know much about the environment on a planet, it’s hard to say whether a potential signal of life makes sense. This is difficult in the solar system and even more difficult for exoplanets, because we can only access them through distant observation. For this reason, chemical signals in the form of atmospheric pollutants might actually be the most solid candidates for the presence of life in an exoplanet. Some pollutants are a byproduct of industrial processes or specific technological activities that are not expected to occur naturally in significant quantities on a planet. But DMS and DMDS do not fall into that category; and with them, we are left with the vexing ambiguity that accompanies most of our potential biosignatures.\u003c/p\u003e\u003cp\u003eNevertheless, this study achieves something important beyond its speculations about life. It proposes a methodology that pushes the limits of what can be done with our current technology (some will say too far) in studying exoplanets. It also helps us determine what steps we must take next to refute or validate its findings. For instance, arguments that abundance of DMS or DMDS inferred in the atmosphere by the study is difficult to sustain by non-living processes calls for developing new research that can theoretically, empirically and experimentally seek the existence of these potential nonbiological pathways. To their credit, the authors call for a “dedicated community effort”\u003cem\u003e.\u003c/em\u003e But until we can prove the absence of abiotic sources, it is premature to suggest from these molecules that there is life on K2-18b.\u003c/p\u003e\u003cp\u003eWhile the paper repeatedly stresses the preliminary nature of the findings and the need for further data, public statements by the lead author have at times conveyed a stronger sense of confidence than the published evidence supports. When this happens, we miss the critically important opportunity to understand that science progresses carefully, incrementally, and with eyes wide open to its strengths and limitations. There is always room for extraordinary conclusions, but these must be backed by compelling evidence. We are all excited at the prospect that one day soon, we will find unambiguous evidence of life beyond Earth. We are not there yet. But we should celebrate how far we have come, and how each additional bit of knowledge takes us that much closer to a definitive answer.\u003c/p\u003e\u003cul\u003e\n \u003cli\u003e\n  \u003cp\u003eNathalie Cabrol is director of the Carl Sagan Center at the Seti Institute, and author of The Secret Life of the Universe: An Astrobiologist’s Search for the Origins and Frontiers of Life\u003c/p\u003e\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-04-22T10:39:58Z",
  "modifiedTime": "2025-04-22T15:52:46Z"
}
