{
  "id": "34bd40e4-125d-4024-8560-fc92030765a0",
  "title": "NASA Statement on Nomination of Matt Anderson for Deputy Administrator",
  "link": "https://www.nasa.gov/news-release/nasa-statement-on-nomination-of-matt-anderson-for-deputy-administrator/",
  "description": "Acting NASA Administrator Janet Petro issued the following statement regarding the nomination by President Donald Trump of Matt Anderson Wednesday to serve as the agency’s deputy administrator: “As a retired United States Air Force colonel and executive of the Space Force Association, Matt Anderson brings extensive knowledge of space operations, aeronautics expertise, and industry experience. […]",
  "author": "Jessica Taveau",
  "published": "Wed, 07 May 2025 20:37:59 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Leadership"
  ],
  "byline": "",
  "length": 1831,
  "excerpt": "Acting NASA Administrator Janet Petro issued the following statement regarding the nomination by President Donald Trump of Matt Anderson Wednesday to serve as",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Jessica TaveauMay 07, 2025 Acting NASA Administrator Janet Petro issued the following statement regarding the nomination by President Donald Trump of Matt Anderson Wednesday to serve as the agency’s deputy administrator: “As a retired United States Air Force colonel and executive of the Space Force Association, Matt Anderson brings extensive knowledge of space operations, aeronautics expertise, and industry experience. If confirmed, he would join NASA’s leadership team at a time when partnerships and a sharpened focus on mission are essential to our continued success. Along with President Trump’s nominee to lead NASA, Jared Isaacman, he will strengthen collaboration across sectors and help NASA advance exploration, serve the American people, and deliver results for the benefit of all.” Throughout his over 24-year tenure in the U.S. Air Force, Anderson culminated his career as the U.S. Transportation Command’s senior liaison officer to North American Aerospace Defense Command (NORAD), U.S. Northern Command (USNORTHCOM), and U.S. Space Command (USSPACECOM). He retired as a colonel Oct. 1, 2021. Anderson is currently a vice president and Space Force \u0026 Air Force client executive at CACI. He also serves as the chief growth officer at the Space Force Association. An alum of the U.S. Air Force Academy, Embry-Riddle Aeronautical University, and the University of Colorado at Colorado Springs, Anderson holds degrees in biology, aeronautical science, and leadership \u0026 counseling. In 2024, Anderson was named by the Washington Exec as one of their “Top Space Execs to Watch.” For more about NASA’s mission, visit: https://www.nasa.gov -end- Bethany Stevens / Amber JacobsonHeadquarters, Washington202-358-1600bethany.c.stevens@nasa.gov / amber.c.jacobson@nasa.gov Share Details",
  "image": "https://www.nasa.gov/wp-content/uploads/2025/05/matt-anderson.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-860982\"\u003e\u003csection\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://secure.gravatar.com/avatar/e7cb47608b3ad8baa3af5c64d7ba6065?s=300\u0026amp;d=blank\u0026amp;r=g\" alt=\"The headshot image of Jessica Taveau\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch3\u003eJessica Taveau\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eMay 07, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cp\u003eActing NASA Administrator Janet Petro issued the following statement regarding the nomination by President Donald Trump of Matt Anderson Wednesday to serve as the agency’s deputy administrator:\u003c/p\u003e\n\u003cp\u003e“As a retired United States Air Force colonel and executive of the Space Force Association, Matt Anderson brings extensive knowledge of space operations, aeronautics expertise, and industry experience. If confirmed, he would join NASA’s leadership team at a time when partnerships and a sharpened focus on mission are essential to our continued success. Along with President Trump’s nominee to lead NASA, Jared Isaacman, he will strengthen collaboration across sectors and help NASA advance exploration, serve the American people, and deliver results for the benefit of all.”\u003c/p\u003e\n\u003cp\u003eThroughout his over 24-year tenure in the U.S. Air Force, Anderson culminated his career as the U.S. Transportation Command’s senior liaison officer to North American Aerospace Defense Command (NORAD), U.S. Northern Command (USNORTHCOM), and U.S. Space Command (USSPACECOM). He retired as a colonel Oct. 1, 2021. Anderson is currently a vice president and Space Force \u0026amp; Air Force client executive at CACI. He also serves as the chief growth officer at the Space Force Association.\u003c/p\u003e\n\u003cp\u003eAn alum of the U.S. Air Force Academy, Embry-Riddle Aeronautical University, and the University of Colorado at Colorado Springs, Anderson holds degrees in biology, aeronautical science, and leadership \u0026amp; counseling. In 2024, Anderson was named by the Washington Exec as one of their “Top Space Execs to Watch.”\u003c/p\u003e\n\u003cp\u003eFor more about NASA’s mission, visit:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.nasa.gov\"\u003e\u003cstrong\u003ehttps://www.nasa.gov\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e-end-\u003c/p\u003e\n\u003cp\u003eBethany Stevens / Amber Jacobson\u003cbr/\u003eHeadquarters, Washington\u003cbr/\u003e202-358-1600\u003cbr/\u003e\u003ca href=\"mailto:bethany.c.stevens@nasa.gov\"\u003ebethany.c.stevens@nasa.gov\u003c/a\u003e / \u003ca href=\"mailto:amber.c.jacobson@nasa.gov\"\u003eamber.c.jacobson@nasa.gov\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"\"\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eShare\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\u003c/div\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eDetails\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\t\t\u003c/div\u003e\n\t\n\t\u003c/div\u003e\n\u003c/section\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
