{
  "id": "3ad8b53a-b8a9-4440-a462-1c75bb9c9254",
  "title": "NASA’s Lucy Spacecraft Images Asteroid Donaldjohanson",
  "link": "https://science.nasa.gov/image-article/nasas-lucy-spacecraft-images-asteroid-donaldjohanson/",
  "description": "In its second asteroid encounter, NASA’s Lucy spacecraft obtained a close look at a uniquely shaped fragment of an asteroid that formed about 150 million years ago. The spacecraft has begun returning images that were collected as it flew approximately 600 miles (960 km) from the asteroid Donaldjohanson on April 20, 2025. The asteroid was […]",
  "author": "",
  "published": "Mon, 21 Apr 2025 17:56:57 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Asteroids",
    "Goddard Space Flight Center",
    "Lucy"
  ],
  "byline": "Jamie Adkins",
  "length": 4390,
  "excerpt": "In its second asteroid encounter, NASA’s Lucy spacecraft obtained a close look at a uniquely shaped fragment of an asteroid that formed about 150 million",
  "siteName": "NASA Science",
  "favicon": "https://science.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "NASA Science Editorial TeamApr 21, 2025 In its second asteroid encounter, NASA’s Lucy spacecraft obtained a close look at a uniquely shaped fragment of an asteroid that formed about 150 million years ago. The spacecraft has begun returning images that were collected as it flew approximately 600 miles (960 km) from the asteroid Donaldjohanson on April 20, 2025. The asteroid was previously observed to have large brightness variations over a 10-day period, so some of Lucy team members’ expectations were confirmed when the first images showed what appeared to be an elongated contact binary (an object formed when two smaller bodies collide). However, the team was surprised by the odd shape of the narrow neck connecting the two lobes, which looks like two nested ice cream cones. “Asteroid Donaldjohanson has strikingly complicated geology,” says Hal Levison, principal investigator for Lucy at Southwest Research Institute, Boulder, Colorado. “As we study the complex structures in detail, they will reveal important information about the building blocks and collisional processes that formed the planets in our Solar System.” From a preliminary analysis of the first available images collected by the spacecraft's L’LORRI imager, the asteroid appears to be larger than originally estimated, about 5 miles (8 km) long and 2 miles (3.5 km) wide at the widest point. In this first set of high-resolution images returned from the spacecraft, the full asteroid is not visible as the asteroid is larger than the imager’s field of view. It will take up to a week for the team to downlink the remainder of the encounter data from the spacecraft; this dataset will give a more complete picture of the asteroid’s overall shape. Like Lucy’s first asteroid flyby target, Dinkinesh, Donaldjohanson is not a primary science target of the Lucy mission. As planned, the Dinkinesh flyby was a system’s test for the mission, while this encounter was a full dress rehearsal, in which the team conducted a series of dense observations to maximize data collection. Data collected by Lucy’s other scientific instruments, the L’Ralph color imager and infrared spectrometer and the L’TES thermal infrared spectrometer, will be retrieved and analyzed over the next few weeks. The Lucy spacecraft will spend most of the remainder of 2025 travelling through the main asteroid belt. Lucy will encounter the mission’s first main target, the Jupiter Trojan asteroid Eurybates, in August 2027. “These early images of Donaldjohanson are again showing the tremendous capabilities of the Lucy spacecraft as an engine of discovery,” said Tom Statler, program scientist for the Lucy mission at NASA Headquarters in Washington. “The potential to really open a new window into the history of our solar system when Lucy gets to the Trojan asteroids is immense.” NASA’s Goddard Space Flight Center in Greenbelt, Maryland, provides overall mission management, systems engineering and the safety and mission assurance for Lucy, as well as the designing and building the L’Ralph instrument. Hal Levison of the Boulder, Colorado, office of SwRI is the principal investigator. SwRI is headquartered in San Antonio and also leads the mission's science team, science observation planning, and data processing. NASA’s Goddard Space Flight Center in Greenbelt, Maryland, provides overall mission management, systems engineering, and the safety and mission assurance for Lucy, as well as the L’Ralph instrument. Lockheed Martin Space in Littleton, Colorado, built the spacecraft, designed the orbital trajectory, and provides flight operations. Goddard and KinetX Aerospace are responsible for navigating the Lucy spacecraft. The Johns Hopkins Applied Physics Laboratory in Laurel, Maryland, designed and built the L’LORRI (Lucy Long Range Reconnaissance Imager) instrument. Arizona State University designed and built the L’TES (Lucy Thermal Emission Spectrometer). Lucy is the thirteenth mission in NASA’s Discovery Program, which is managed by NASA’s Marshall Space Flight Center in Huntsville, Alabama. By Katherine KretkeSouthwest Research Institute Media Contact:Karen Fox / Molly WasserHeadquarters, Washington202-358-1600karen.c.fox@nasa.gov / molly.l.wasser@nasa.gov Nancy N. JonesNASA’s Goddard Space Flight Center, Greenbelt, Md. Share Details",
  "image": "https://assets.science.nasa.gov/content/dam/science/missions/lucy/djencounter_movie_release_v2.gif",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-498438\"\u003e\u003csection\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://science.nasa.gov/wp-content/uploads/2023/04/NASA_logo.png?w=300\" alt=\"The headshot image of NASA Science Editorial Team\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch3\u003eNASA Science Editorial Team\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eApr 21, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\n\n\u003cp\u003eIn its second asteroid encounter, NASA’s Lucy spacecraft obtained a close look at a uniquely shaped fragment of an asteroid that formed about 150 million years ago. The spacecraft has begun returning images that were collected as it flew approximately 600 miles (960 km) from the asteroid Donaldjohanson on April 20, 2025.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThe asteroid was previously observed to have large brightness variations over a 10-day period, so some of Lucy team members’ expectations were confirmed when the first images showed what appeared to be an elongated contact binary (an object formed when two smaller bodies collide). However, the team was surprised by the odd shape of the narrow neck connecting the two lobes, which looks like two nested ice cream cones.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Asteroid Donaldjohanson has strikingly complicated geology,” says Hal Levison, principal investigator for Lucy at Southwest Research Institute, Boulder, Colorado. “As we study the complex structures in detail, they will reveal important information about the building blocks and collisional processes that formed the planets in our Solar System.”\u003c/p\u003e\n\n\n\n\u003cp\u003eFrom a preliminary analysis of the first available images collected by the spacecraft\u0026#39;s L’LORRI imager, the asteroid appears to be larger than originally estimated, about 5 miles (8 km) long and 2 miles (3.5 km) wide at the widest point. In this first set of high-resolution images returned from the spacecraft, the full asteroid is not visible as the asteroid is larger than the imager’s field of view. It will take up to a week for the team to downlink the remainder of the encounter data from the spacecraft; this dataset will give a more complete picture of the asteroid’s overall shape.\u003c/p\u003e\n\n\n\n\u003cp\u003eLike Lucy’s first asteroid flyby target, Dinkinesh, Donaldjohanson is not a primary science target of the Lucy mission. As planned, the Dinkinesh flyby was a system’s test for the mission, while this encounter was a full dress rehearsal, in which the team conducted a series of dense observations to maximize data collection. Data collected by Lucy’s other scientific instruments, the L’Ralph color imager and infrared spectrometer and the L’TES thermal infrared spectrometer, will be retrieved and analyzed over the next few weeks.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Lucy spacecraft will spend most of the remainder of 2025 travelling through the main asteroid belt. Lucy will encounter the mission’s first main target, the Jupiter Trojan asteroid Eurybates, in August 2027.\u003c/p\u003e\n\n\n\n\u003cp\u003e“These early images of Donaldjohanson are again showing the tremendous capabilities of the Lucy spacecraft as an engine of discovery,” said Tom Statler, program scientist for the Lucy mission at NASA Headquarters in Washington. “The potential to really open a new window into the history of our solar system when Lucy gets to the Trojan asteroids is immense.”\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eNASA’s Goddard Space Flight Center in Greenbelt, Maryland, provides overall mission management, systems engineering and the safety and mission assurance for Lucy, as well as the designing and building the L’Ralph instrument. Hal Levison of the Boulder, Colorado, office of SwRI is the principal investigator. SwRI is headquartered in San Antonio and also leads the mission\u0026#39;s science team, science observation planning, and data processing. NASA’s Goddard Space Flight Center in Greenbelt, Maryland, provides overall mission management, systems engineering, and the safety and mission assurance for Lucy, as well as the L’Ralph instrument. Lockheed Martin Space in Littleton, Colorado, built the spacecraft, designed the orbital trajectory, and provides flight operations. Goddard and KinetX Aerospace are responsible for navigating the Lucy spacecraft. The Johns Hopkins Applied Physics Laboratory in Laurel, Maryland, designed and built the L’LORRI (Lucy Long Range Reconnaissance Imager) instrument. Arizona State University designed and built the L’TES (Lucy Thermal Emission Spectrometer). Lucy is the thirteenth mission in NASA’s Discovery Program, which is managed by NASA’s Marshall Space Flight Center in Huntsville, Alabama.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eBy Katherine Kretke\u003cbr/\u003eSouthwest Research Institute\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eMedia Contact:\u003c/strong\u003e\u003c/em\u003e\u003cbr/\u003e\u003cem\u003eKaren Fox / Molly Wasser\u003c/em\u003e\u003cbr/\u003e\u003cem\u003eHeadquarters, Washington\u003c/em\u003e\u003cbr/\u003e\u003cem\u003e202-358-1600\u003c/em\u003e\u003cbr/\u003e\u003ca href=\"mailto:karen.c.fox@nasa.gov\"\u003e\u003cem\u003ekaren.c.fox@nasa.gov\u003c/em\u003e\u003c/a\u003e\u003cem\u003e / \u003c/em\u003e\u003ca href=\"mailto:molly.l.wasser@nasa.gov\"\u003e\u003cem\u003emolly.l.wasser@nasa.gov\u003c/em\u003e\u003c/a\u003e\u003cem\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"mailto:nancy.n.jones@nasa.gov\"\u003e\u003cem\u003e\u003cstrong\u003eNancy N. Jones\u003c/strong\u003e\u003c/em\u003e\u003c/a\u003e\u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003e\u003ca href=\"https://www.nasa.gov/goddard\"\u003e\u003cem\u003e\u003cstrong\u003eNASA’s Goddard Space Flight Center\u003c/strong\u003e\u003c/em\u003e\u003c/a\u003e\u003cem\u003e\u003cstrong\u003e, Greenbelt, Md.\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"\"\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eShare\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\u003c/div\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eDetails\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\t\t\u003c/div\u003e\n\t\n\t\u003c/div\u003e\u003c/section\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-21T13:56:57-04:00",
  "modifiedTime": "2025-04-21T18:15:12-04:00"
}
