{
  "id": "3db778c2-9217-4c2c-9701-feb16dffaede",
  "title": "Solar Cycle 25 is still in max phase, so more aurora-boosting sun storms could be coming",
  "link": "https://www.space.com/solar-cycle-25-max-phase-more-sun-storms",
  "description": "Solar Cycle 25 remains in its maximum phase, and more powerful sun storms are likely to come over the next few months, experts say.",
  "author": "",
  "published": "Tue, 15 Oct 2024 22:03:14 +0000",
  "source": "https://www.space.com/feeds/all",
  "categories": [
    "The Sun",
    "The Universe",
    "Solar System"
  ],
  "byline": "Meredith Garofalo",
  "length": 5654,
  "excerpt": "'We're anticipating another year or so of maximum phase before we really enter the declining phase.'",
  "siteName": "Space",
  "favicon": "https://vanilla.futurecdn.net/space/1084089/apple-touch-icon.png",
  "text": "The aurora as seen from Griffey Lake, in Bloomington, Indiana, on Oct. 10, 2024. (Image credit: Space.com/ Josh Dinner) You could get more opportunities to see supercharged auroras over the next few months, thanks to our very active sun.Solar activity waxes and wanes on an 11-year cycle. The current cycle, known as Solar Cycle 25, began in December 2019 and is still in its maximum phase, experts say.\"Currently, we're about two years into the maximum period, so we're anticipating another year or so of maximum phase before we really enter the declining phase, which will lead us back to solar minimum,\" Lisa Upton, co-chair of the Solar Cycle 25 Prediction Panel and lead scientist at Southwest Research Institute in San Antonio, Texas, said in a press conference on Tuesday (Oct. 15). Solar flares, CMEs and dancing aurorasEach solar cycle features a rise and fall in the sun's natural magnetic activity, as well as the number of sunspots that develop. Sunspots, which are relatively cool and dark regions on our star's face, arise when the magnetic field of the sun experiences a disturbance. Related: 'It was 3 hours of magic': Spectacular auroras thrill stargazers (photos)Sunspots serve as launch pads for solar flares, powerful explosions that blast high-energy light out into space. Flares are often accompanied by coronal mass ejections (CMEs), huge eruptions of magnetic field and plasma that can generate geomagnetic storms when they hit Earth. Those storms can boost auroral displays, as people around the world saw last week. But they can also have negative impacts, disrupting power grids on Earth and affecting astronauts and satellites in space. Solar Cycle 25 has featured a more prominent maximum phase than its predecessor but is still considered a smaller cycle by forecasters, according to Upton.Breaking space news, the latest updates on rocket launches, skywatching events and more!\"Smaller cycles are long, so their maximum phases are longer, lasting three or four years,\" she said. Such cycles are \"also more likely to have a double or even triple peak, which makes it more difficult to say for certain that maximum has occurred.\"During solar maximum, there's a higher possibility of impacts from space weather to Earth. A great example of this occurred with the solar storms of May 2024, when several CMEs slammed into our planet, triggering what scientists say may have been the most powerful aurora display in the past 500 years.\"Solar Cycle 25 sunspot activity has slightly exceeded expectations; however, despite seeing a few large storms, they aren't larger than what we might expect during the maximum phase of the cycle,\" Upton said.If there is another year or two left in Solar Cycle 25's max phase, it could affect voyaging astronauts: NASA plans to launch its crewed Artemis 2 and Artemis 3 moon missions during that time frame. Crewmembers will be far from the protection of Earth's atmosphere and magnetic field and so will be more susceptible to the radiation thrown off by our star.Preparing for the storm\"When we do get these big geomagnetic storms, like last week, it can interfere with the layout of the atmosphere above us called the ionosphere. Signals can be bouncing up from the ground off the ionosphere, and signals coming from satellites have to go through the ionosphere to receivers on the ground. During the big storms, it can be interfered with, and we see it all the time,\" Bill Murtagh, program coordinator at the U.S. National Oceanic and Atmospheric Administration's (NOAA) Space Weather Prediction Center (SWPC), said during Tuesday's press conference. \"Last week and back in May, high-frequency communications with aircraft were significantly impacted,\" he added. \"If we don't issue any relative warnings and nobody knows, we're going to have some problems. It's so important we take action with new technologies working closely with various groups, private sector and government to assess their vulnerability and work on the mitigation strategies so they can prepare and take action.\"SWPC forecasters say that, while we remain in this current solar maximum, there will likely be more solar and geomagnetic storms, with the potential for some to be relatively large and significant. But we can minimize the impacts on Earth and in space through advanced communication efforts.\"We are becoming a spacefaring race; we're putting more and more assets out into space and moving to other places in our solar system,\" Upton said. \"As we increase our assets out in space, venture to the moon, Mars, and anywhere else that we might want, we're going to need to increase our ability to understand space weather, not just here at Earth but across the entire solar system.\" Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. Meredith is a regional Murrow award-winning Certified Broadcast Meteorologist and science/space correspondent. She most recently was a Freelance Meteorologist for NY 1 in New York City \u0026 the 19 First Alert Weather Team in Cleveland. A self-described \"Rocket Girl,\" Meredith's personal and professional work has drawn recognition over the last decade, including the inaugural Valparaiso University Alumni Association First Decade Achievement Award, two special reports in News 12's Climate Special \"Saving Our Shores\" that won a Regional Edward R. Murrow Award, multiple Fair Media Council Folio \u0026 Press Club of Long Island awards for meteorology \u0026 reporting, and a Long Island Business News \u0026 NYC TV Week \"40 Under 40\" Award. Most Popular",
  "image": "https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-1200-80.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-widget-type=\"contentparsed\" id=\"content\"\u003e\n\n\u003csection\u003e\n\u003cdiv itemprop=\"image\" itemscope=\"\" itemtype=\"https://schema.org/ImageObject\"\u003e\n\u003cdiv\u003e\n\u003cpicture data-new-v2-image=\"true\"\u003e\n\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-320-80.png.webp 320w, https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-480-80.png.webp 480w, https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-650-80.png.webp 650w, https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-970-80.png.webp 970w, https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-1024-80.png.webp 1024w, https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-1160-80.png.webp 1200w, https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-1160-80.png.webp 1920w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\"/\u003e\n\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-320-80.png\" alt=\"red and green auroras dance above hills and trees in a dark sky\" srcset=\"https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-320-80.png 320w, https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-480-80.png 480w, https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-650-80.png 650w, https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-970-80.png 970w, https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-1024-80.png 1024w, https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-1160-80.png 1200w, https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ-1160-80.png 1920w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ.png\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ.png\" data-pin-nopin=\"true\" fetchpriority=\"high\"/\u003e\n\u003c/picture\u003e\n\u003c/div\u003e\n\u003cmeta itemprop=\"url\" content=\"https://cdn.mos.cms.futurecdn.net/MQvkiKAgGd6SxFJNKGmXxQ.png\"/\u003e\n\u003cmeta itemprop=\"height\" content=\"600\"/\u003e\n\u003cmeta itemprop=\"width\" content=\"338\"/\u003e\n\u003cfigcaption itemprop=\"caption description\"\u003e\n\u003cspan\u003eThe aurora as seen from Griffey Lake, in Bloomington, Indiana, on Oct. 10, 2024.\u003c/span\u003e\n\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: Space.com/ Josh Dinner)\u003c/span\u003e\n\u003c/figcaption\u003e\n\u003c/div\u003e\n\n\u003cdiv id=\"article-body\"\u003e\n\u003cp\u003eYou could get more opportunities to see supercharged auroras over the next few months, thanks to our very active sun.\u003c/p\u003e\u003cp\u003eSolar activity waxes and wanes on an \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/solar-cycle-frequency-prediction-facts\" data-before-rewrite-localise=\"https://www.space.com/solar-cycle-frequency-prediction-facts\"\u003e\u003cu\u003e11-year cycle\u003c/u\u003e\u003c/a\u003e. The current cycle, known as Solar Cycle 25, began in December 2019 and is still in its maximum phase, experts say.\u003c/p\u003e\u003cp\u003e\u0026#34;Currently, we\u0026#39;re about two years into the maximum period, so we\u0026#39;re anticipating another year or so of maximum phase before we really enter the declining phase, which will lead us back to \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/37330-solar-minimum-coronal-holes-space-junk.html\" data-before-rewrite-localise=\"https://www.space.com/37330-solar-minimum-coronal-holes-space-junk.html\"\u003e\u003cu\u003esolar minimum\u003c/u\u003e\u003c/a\u003e,\u0026#34; Lisa Upton, co-chair of the Solar Cycle 25 Prediction Panel and lead scientist at Southwest Research Institute in San Antonio, Texas, said in a press conference on Tuesday (Oct. 15). \u003c/p\u003e\u003ch2 id=\"solar-flares-cmes-and-dancing-auroras-3\"\u003eSolar flares, CMEs and dancing auroras\u003c/h2\u003e\u003cp\u003eEach solar cycle features a rise and fall in the sun\u0026#39;s natural magnetic activity, as well as the number of \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/sunspots-formation-discovery-observations\" data-before-rewrite-localise=\"https://www.space.com/sunspots-formation-discovery-observations\"\u003e\u003cu\u003esunspots\u003c/u\u003e\u003c/a\u003e that develop. Sunspots, which are relatively cool and dark regions on our star\u0026#39;s face, arise when the magnetic field of \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/58-the-sun-formation-facts-and-characteristics.html\" data-before-rewrite-localise=\"https://www.space.com/58-the-sun-formation-facts-and-characteristics.html\"\u003e\u003cu\u003ethe sun\u003c/u\u003e\u003c/a\u003e experiences a disturbance. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRelated: \u003c/strong\u003e\u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/spectacular-auroras-photos-thrill-skywatchers-from-geomagnetic-storm-october-2024\" data-before-rewrite-localise=\"https://www.space.com/spectacular-auroras-photos-thrill-skywatchers-from-geomagnetic-storm-october-2024\"\u003e\u003cstrong\u003e\u0026#39;It was 3 hours of magic\u0026#39;: Spectacular auroras thrill stargazers (photos)\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSunspots serve as launch pads for \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/solar-flares-effects-classification-formation\" data-before-rewrite-localise=\"https://www.space.com/solar-flares-effects-classification-formation\"\u003e\u003cu\u003esolar flares\u003c/u\u003e\u003c/a\u003e, powerful explosions that blast high-energy light out into space. Flares are often accompanied by \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/coronal-mass-ejections-cme\" data-before-rewrite-localise=\"https://www.space.com/coronal-mass-ejections-cme\"\u003e\u003cu\u003ecoronal mass ejections\u003c/u\u003e\u003c/a\u003e (CMEs), huge eruptions of magnetic field and plasma that can generate geomagnetic storms when they hit Earth. Those storms can boost auroral displays, as people around the world \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/spectacular-auroras-photos-thrill-skywatchers-from-geomagnetic-storm-october-2024\" data-before-rewrite-localise=\"https://www.space.com/spectacular-auroras-photos-thrill-skywatchers-from-geomagnetic-storm-october-2024\"\u003e\u003cu\u003esaw last week\u003c/u\u003e\u003c/a\u003e. But they can also have negative impacts, disrupting power grids on Earth and affecting astronauts and satellites in space. \u003c/p\u003e\u003cp\u003eSolar Cycle 25 has featured a more prominent maximum phase than its predecessor but is still considered a smaller cycle by forecasters, according to Upton.\u003c/p\u003e\u003cdiv data-hydrate=\"true\" id=\"slice-container-newsletterForm-articleInbodyContent-4oRkgSg7fkr3M4dtr2Zi9A\"\u003e\u003csection\u003e\u003cp\u003eBreaking space news, the latest updates on rocket launches, skywatching events and more!\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e\u003cp\u003e\u0026#34;Smaller cycles are long, so their maximum phases are longer, lasting three or four years,\u0026#34; she said. Such cycles are \u0026#34;also more likely to have a double or even triple peak, which makes it more difficult to say for certain that maximum has occurred.\u0026#34;\u003c/p\u003e\u003cp\u003eDuring solar maximum, there\u0026#39;s a higher possibility of impacts from space weather to Earth. A great example of this occurred with the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/solar-storm-effects-reach-deep-sea\" data-before-rewrite-localise=\"https://www.space.com/solar-storm-effects-reach-deep-sea\"\u003e\u003cu\u003esolar storms of May 2024\u003c/u\u003e\u003c/a\u003e, when several CMEs slammed into our planet, triggering what scientists say may have been the most powerful aurora display \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/solar-storms-may-2024-strongest-auroras-500-years\" data-before-rewrite-localise=\"https://www.space.com/solar-storms-may-2024-strongest-auroras-500-years\"\u003e\u003cu\u003ein the past 500 years\u003c/u\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u0026#34;Solar Cycle 25 sunspot activity has slightly exceeded expectations; however, despite seeing a few large storms, they aren\u0026#39;t larger than what we might expect during the maximum phase of the cycle,\u0026#34; Upton said.\u003c/p\u003e\u003cp\u003eIf there is another year or two left in Solar Cycle 25\u0026#39;s max phase, it could affect voyaging astronauts: NASA plans to launch its crewed \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/artemis-2-humans-moon-orbit\" data-before-rewrite-localise=\"https://www.space.com/artemis-2-humans-moon-orbit\"\u003e\u003cu\u003eArtemis 2\u003c/u\u003e\u003c/a\u003e and \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/artemis-3-moon-landing-mission\" data-before-rewrite-localise=\"https://www.space.com/artemis-3-moon-landing-mission\"\u003e\u003cu\u003eArtemis 3\u003c/u\u003e\u003c/a\u003e moon missions during that time frame. Crewmembers will be far from the protection of Earth\u0026#39;s atmosphere and magnetic field and so will be more susceptible to the radiation thrown off by our star.\u003c/p\u003e\u003ch2 id=\"preparing-for-the-storm-3\"\u003ePreparing for the storm\u003c/h2\u003e\u003cp\u003e\u0026#34;When we do get these big geomagnetic storms, like last week, it can interfere with the layout of the atmosphere above us called the ionosphere. Signals can be bouncing up from the ground off the ionosphere, and signals coming from \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/24839-satellites.html\" data-before-rewrite-localise=\"https://www.space.com/24839-satellites.html\"\u003e\u003cu\u003esatellites\u003c/u\u003e\u003c/a\u003e have to go through the ionosphere to receivers on the ground. During the big storms, it can be interfered with, and we see it all the time,\u0026#34; Bill Murtagh, program coordinator at the U.S. National Oceanic and Atmospheric Administration\u0026#39;s (NOAA) Space Weather Prediction Center (SWPC), said during Tuesday\u0026#39;s press conference. \u003c/p\u003e\u003cp\u003e\u0026#34;Last week and back in May, high-frequency communications with aircraft were significantly impacted,\u0026#34; he added. \u0026#34;If we don\u0026#39;t issue any relative warnings and nobody knows, we\u0026#39;re going to have some problems. It\u0026#39;s so important we take action with new technologies working closely with various groups, private sector and government to assess their vulnerability and work on the mitigation strategies so they can prepare and take action.\u0026#34;\u003c/p\u003e\u003cp\u003eSWPC forecasters say that, while we remain in this current solar maximum, there will likely be more solar and geomagnetic storms, with the potential for some to be relatively large and significant. But we can minimize the impacts on Earth and in space through advanced communication efforts.\u003c/p\u003e\u003cp\u003e\u0026#34;We are becoming a spacefaring race; we\u0026#39;re putting more and more assets out into space and moving to other places in our \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/16080-solar-system-planets.html\" data-before-rewrite-localise=\"https://www.space.com/16080-solar-system-planets.html\"\u003e\u003cu\u003esolar system\u003c/u\u003e\u003c/a\u003e,\u0026#34; Upton said. \u0026#34;As we increase our assets out in space, venture to the moon, \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/47-mars-the-red-planet-fourth-planet-from-the-sun.html\" data-before-rewrite-localise=\"https://www.space.com/47-mars-the-red-planet-fourth-planet-from-the-sun.html\"\u003e\u003cu\u003eMars\u003c/u\u003e\u003c/a\u003e, and anywhere else that we might want, we\u0026#39;re going to need to increase our ability to understand space weather, not just here at Earth but across the entire solar system.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://forums.space.com/\"\u003eJoin our Space Forums\u003c/a\u003e to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: \u003ca href=\"mailto:community@space.com\"\u003ecommunity@space.com.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"slice-container-authorBio-4oRkgSg7fkr3M4dtr2Zi9A\"\u003e\u003cp\u003eMeredith is a regional Murrow award-winning Certified Broadcast Meteorologist and science/space correspondent. She most recently was a Freelance Meteorologist for NY 1 in New York City \u0026amp; the 19 First Alert Weather Team in Cleveland. A self-described \u0026#34;Rocket Girl,\u0026#34; Meredith\u0026#39;s personal and professional work has drawn recognition over the last decade, including the inaugural Valparaiso University Alumni Association First Decade Achievement Award, two special reports in News 12\u0026#39;s Climate Special \u0026#34;Saving Our Shores\u0026#34; that won a Regional Edward R. Murrow Award, multiple Fair Media Council Folio \u0026amp; Press Club of Long Island awards for meteorology \u0026amp; reporting, and a Long Island Business News \u0026amp; NYC TV Week \u0026#34;40 Under 40\u0026#34; Award.\n\u003c/p\u003e\u003c/div\u003e\n\n\n\u003c/section\u003e\n\n\n\n\n\n\u003cdiv id=\"slice-container-relatedArticles\"\u003e\u003cp\u003e\u003ch5\u003eMost Popular\u003c/h5\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-15T22:03:14Z",
  "modifiedTime": "2024-10-15T22:03:14Z"
}
