{
  "id": "5539563f-dc12-468b-ae28-0eb0d3e74749",
  "title": "Blue Origin’s all-female spaceflight brought down to earth",
  "link": "https://www.theguardian.com/science/2025/apr/20/blue-origin-all-female-spaceflight-brought-down-to-earth",
  "description": "Readers critique the symbolism, substance and style of the recent all-female rocket tripFor those who have not already read Ursula K Le Guin’s 1976 essay Space Crone, it is the perfect antidote to this weird Charlie’s Angels-in-space exploit (So Katy Perry went to space. Wasn’t there anyone else we could have sent?, 14 April).Le Guin rightly suggests that it is an apparently unremarkable postmenopausal woman who is the ideal candidate to represent humanity on a space mission. The “crone” has a depth of experience of being human that no young, fit, looks-great-in-Lycra man or woman can match. Continue reading...",
  "author": "Guardian Staff",
  "published": "Sun, 20 Apr 2025 16:27:21 GMT",
  "source": "https://www.theguardian.com/science/space/rss",
  "categories": [
    "Blue Origin",
    "Space",
    "Katy Perry",
    "Jeff Bezos"
  ],
  "byline": "",
  "length": 3669,
  "excerpt": "Letters: Readers critique the symbolism, substance and style of the recent all-female rocket trip",
  "siteName": "the Guardian",
  "favicon": "https://assets.guim.co.uk/static/frontend/icons/homescreen/apple-touch-icon-512.png",
  "text": "For those who have not already read Ursula K Le Guin’s 1976 essay Space Crone, it is the perfect antidote to this weird Charlie’s Angels-in-space exploit (So Katy Perry went to space. Wasn’t there anyone else we could have sent?, 14 April).Le Guin rightly suggests that it is an apparently unremarkable postmenopausal woman who is the ideal candidate to represent humanity on a space mission. The “crone” has a depth of experience of being human that no young, fit, looks-great-in-Lycra man or woman can match.Sure, Blue Origin didn’t expect to encounter alien life on a suborbital flight on the edge of space – unlike Le Guin’s intergalactic ambassador – but this flight, as Zoe Williams suggests, is still deeply symbolic of who is chosen as representatives of our strange race.The crone, having travelled through and embraced all stages of being a woman, is fit not just to represent womankind; having also endured life and death and change in a way that no man has ever experienced, she is most suited for representing humanity as a whole.Thankfully we do have alternative narratives which are more powerful than this tech bro fantasy. Le Guin’s Space Crone is a must-read. Georgina TreloarFolkestone, Kent Publicising the posturing of the “crew” of Blue Origin (Blue Origin crew including Katy Perry safely returns to Earth after space flight, 14 April) overlooks as usual the achievements of the many engineers and scientists who made this trip possible, however pointless, both through their design of the craft and their control of its operation.In CM Kornbluth’s rather dark short story The Marching Morons (1951), Earth’s problem of overpopulation is solved by persuading the masses to board rockets that are making one-way trips to nowhere, in the belief that they are heading for a new and comfortable life on Venus.If Messrs Bezos and Musk could be persuaded to be part of the next “crew” of Blue Origin, perhaps the backroom team could help solve some of Earth’s current problems by providing enough extra boost for the rocket to be able to break out of Earth’s gravitational field.And yes, I am aware of what happened in the story to the person who came up with the idea, but I’m willing to take the risk.David BudgenDurham I am in full agreement with Zoe Williams’ view about the wanton money waste of the recent flit into space by a group of women with luxuriant hair and tight clothing. But I have to disagree that they resembled Charlie’s Angels. Surely they were cosplaying early Star Trek, a TV series which I suspect would have been one of Jeff Bezos’s favourites.Claire WhatleyBerwick St James, Wiltshire Your piece on the Blue Origin flight (Celebrities criticize all-female rocket launch: ‘This is beyond parody’, 15 April) says that it was “the first all-female space flight since 1963, when Soviet astronaut Valentina Tereshkova flew into orbit solo”. However, this overlooks the achievements of females such as Martine, a pig-tailed macaque, sole occupant of a French Vesta rocket launched on 7 March 1967. She survived the flight, living for several years afterwards, and – rather inspiringly – never tried to cash in on the experience. Andrew CarrollCastletimon, County Wicklow, Ireland Contributors to your letters page (15 April) criticise the short journey into space taken by Jeff Bezos’s wife and her friends. The environmental damage done by such a trip is “colossal” (Chris Burr). Those on board were not “crew” as often described, merely passengers (Dan Stacey). The triviality of the jaunt is captured by Toby Wood’s phrase “ladies who launch”. We might expand on this: there is no such thing as a free launch. Richard SmithDurham",
  "image": "https://i.guim.co.uk/img/media/ce656c6d78b9ee5e1cfcce18799853caeb6b98e7/250_0_3342_2006/master/3342.jpg?width=1200\u0026height=630\u0026quality=85\u0026auto=format\u0026fit=crop\u0026overlay-align=bottom%2Cleft\u0026overlay-width=100p\u0026overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc\u0026enable=upscale\u0026s=4d595e8c0a8d675c3da9145603f268b4",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"maincontent\"\u003e\u003cp\u003eFor those who have not already read Ursula K Le Guin’s 1976 essay Space Crone, it is the perfect antidote to this weird Charlie’s Angels-in-space exploit (\u003ca href=\"https://www.theguardian.com/commentisfree/2025/apr/14/so-katy-perry-went-to-space-wasnt-there-anyone-else-we-couldve-sent\" data-link-name=\"in body link\"\u003eSo Katy Perry went to space. Wasn’t there anyone else we could have sent?, 14 April\u003c/a\u003e).\u003c/p\u003e\u003cp\u003eLe Guin rightly suggests that it is an apparently unremarkable postmenopausal woman who is the ideal candidate to represent humanity on a space mission. The “crone” has a depth of experience of being human that no young, fit, looks-great-in-Lycra man or woman can match.\u003c/p\u003e\u003cp\u003eSure, \u003ca href=\"https://www.theguardian.com/science/blue-origin\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\"\u003eBlue Origin\u003c/a\u003e didn’t expect to encounter alien life on a suborbital flight on the edge of space – unlike Le Guin’s intergalactic ambassador – but this flight, as Zoe Williams suggests, is still deeply symbolic of who is chosen as representatives of our strange race.\u003c/p\u003e\u003cp\u003eThe crone, having travelled through and embraced all stages of being a woman, is fit not just to represent womankind; having also endured life and death and change in a way that no man has ever experienced, she is most suited for representing humanity as a whole.\u003c/p\u003e\u003cp\u003eThankfully we do have alternative narratives which are more powerful than this tech bro fantasy. Le Guin’s \u003ca href=\"https://www.theguardian.com/science/space\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\"\u003eSpace\u003c/a\u003e Crone is a must-read. \u003cbr/\u003e\u003cstrong\u003eGeorgina Treloar\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003eFolkestone, Kent\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-dcr-style=\"bullet\"\u003e\u003c/span\u003e Publicising the posturing of the “crew” of Blue Origin (\u003ca href=\"https://www.theguardian.com/science/2025/apr/14/blue-origin-rocket-launch\" data-link-name=\"in body link\"\u003eBlue Origin crew including Katy Perry safely returns to Earth after space flight, 14 April\u003c/a\u003e) overlooks as usual the achievements of the many engineers and scientists who made this trip possible, however pointless, both through their design of the craft and their control of its operation.\u003c/p\u003e\u003cp\u003eIn CM Kornbluth’s rather dark short story The Marching Morons (1951), Earth’s problem of overpopulation is solved by persuading the masses to board rockets that are making one-way trips to nowhere, in the belief that they are heading for a new and comfortable life on Venus.\u003c/p\u003e\u003cp\u003eIf Messrs Bezos and Musk could be persuaded to be part of the next “crew” of Blue Origin, perhaps the backroom team could help solve some of Earth’s current problems by providing enough extra boost for the rocket to be able to break out of Earth’s gravitational field.\u003c/p\u003e\u003cp\u003eAnd yes, I am aware of what happened in the story to the person who came up with the idea, but I’m willing to take the risk.\u003cbr/\u003e\u003cstrong\u003eDavid Budgen\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003eDurham\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-dcr-style=\"bullet\"\u003e\u003c/span\u003e I am in full agreement with Zoe Williams’ view about the wanton money waste of the recent flit into space by a group of women with luxuriant hair and tight clothing. But I have to disagree that they resembled Charlie’s Angels. Surely they were cosplaying early Star Trek, a TV series which I suspect would have been one of Jeff Bezos’s favourites.\u003cbr/\u003e\u003cstrong\u003eClaire Whatley\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003eBerwick St James, Wiltshire\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-dcr-style=\"bullet\"\u003e\u003c/span\u003e Your piece on the Blue Origin flight (\u003ca href=\"https://www.theguardian.com/culture/2025/apr/15/blue-origin-space-flight-criticism\" data-link-name=\"in body link\"\u003eCelebrities criticize all-female rocket launch: ‘This is beyond parody’, 15 April\u003c/a\u003e) says that it was “the first all-female space flight since 1963, when Soviet astronaut Valentina Tereshkova flew into orbit solo”. However, this overlooks the achievements of females such as Martine, a pig-tailed macaque, sole occupant of a French Vesta rocket launched on 7 March 1967. She survived the flight, living for several years afterwards, and – rather inspiringly – never tried to cash in on the experience. \u003cbr/\u003e\u003cstrong\u003eAndrew Carroll\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003eCastletimon, County Wicklow, Ireland\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-dcr-style=\"bullet\"\u003e\u003c/span\u003e Contributors to your letters page (\u003ca href=\"https://www.theguardian.com/science/2025/apr/15/katy-perrys-blast-off-was-a-waste-of-space\" data-link-name=\"in body link\"\u003e15 April\u003c/a\u003e) criticise the short journey into space taken by Jeff Bezos’s wife and her friends. The environmental damage done by such a trip is “colossal” (Chris Burr). Those on board were not “crew” as often described, merely passengers (Dan Stacey). The triviality of the jaunt is captured by Toby Wood’s phrase “ladies who launch”. We might expand on this: there is no such thing as a free launch. \u003cbr/\u003e\u003cstrong\u003eRichard Smith\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003eDurham\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-20T16:27:21Z",
  "modifiedTime": "2025-04-20T18:24:43Z"
}
