{
  "id": "7e1c0ad1-fd87-4459-901c-e19fba28a8ec",
  "title": "Our writers pick their favourite science fiction books of all time",
  "link": "https://www.newscientist.com/article/2433037-our-writers-pick-their-favourite-science-fiction-books-of-all-time/?utm_campaign=RSS%7CNSNS\u0026utm_source=NSNS\u0026utm_medium=RSS\u0026utm_content=space",
  "description": "We asked New Scientist staff to pick their favourite science fiction books. Here are the results, ranging from 19th-century classics to modern day offerings, and from Octavia E. Butler to Iain M. Banks",
  "author": "",
  "published": "Thu, 30 May 2024 16:00:33 +0100",
  "source": "https://www.newscientist.com/subject/space/feed/",
  "categories": null,
  "byline": "Alison Flood",
  "length": 25878,
  "excerpt": "We asked New Scientist staff to pick their favourite science fiction books. Here are the results, ranging from 19th-century classics to modern day offerings, and from Octavia E. Butler to Iain M. Banks",
  "siteName": "New Scientist",
  "favicon": "https://www.newscientist.com/build/images/layup/touch-icon/180x180.50b024f6.png",
  "text": "Space We asked New Scientist staff to pick their favourite science fiction books. Here are the results, ranging from 19th-century classics to modern day offerings, and from Octavia E. Butler to Iain M. Banks Facebook / Meta Twitter / X icon Linkedin Reddit Email By its very nature, science fiction encompasses a vast and sprawling world of stories, from the galaxy-spanning novels of Iain M. Banks and Ursula K. Le Guin to the dystopias of Margaret Atwood and Kazuo Ishiguro. Asking our team of dedicated staff here at New Scientist to pick their personal favourite, then, has created an eclectic and wide-ranging list to dig into. To be clear: this isn’t a definitive and all-encompassing line-up: it is our personal top picks, and we hope it will send you towards some novels you might not have come across before. So, in no particular order, here they are: New Scientist’s favourite science fiction books of all time. We’d love to hear from readers, too, about your own favourite sci-fi. Join the conversation on our Facebook post here. The Culture series by Iain M. Banks The Culture books, by UK author Banks, aren’t so much a series as a collection of stories – readable in any order – about the exploits of one fascinating, far-future, galaxy spanning civilisation. With unlimited resources, energy and, effectively, lifespans, its citizens have solved all of life’s problems, so it is usually when they collide with more primitive societies – which still have to worry about minor matters like making money or waging war – that the fireworks begin. The plots may be mind-bending, but it is the characters that are unforgettable, especially the super-intelligent, starship-embodying AI minds, whose attitudes to humans run the gamut from benevolent to downright Machiavellian. Nevertheless, if AIs ever do become sentient, I hope they model themselves on Banks’s vision. Clare Wilson The Hitchhiker’s Guide to the Galaxy series by Douglas Adams When you think of your favourite story about an imagined future, it is probably profound and thought-provoking, perhaps beautiful, but it is rarely funny. Adams’s The Hitchhiker’s Guide to the Galaxy series, which features the hapless Englishman Arthur Dent and his reluctant jaunts around the universe after Earth is destroyed, is all of the former, but it is the rich comedic vein that has sustained it and drawn a devoted following, of which I count myself a member. Simple gags and one-liners abound, and the offbeat cast of characters summoned to accompany Dent, like the depressed Marvin the paranoid android or the gung-ho and feckless two-headed alien Zaphod Beeblebrox, are endlessly entertaining. Almost 50 years after it debuted as a BBC radio play, the books that followed have lost none of their sparkle. Alex Wilkins New Scientist book club Love reading? Come and join our friendly group of fellow book lovers. Every six weeks, we delve into an exciting new title, with members given free access to extracts from our books, articles from our authors and video interviews. The Handmaid’s Tale by Margaret Atwood The Handmaid’s Tale by Atwood is a haunting novel that still gives me shivers to think about, years after I read it. It describes a dystopian, not-so-distant future where a “handmaid’s” sole purpose is to reproduce in an effort to combat society’s falling birth rates due to widespread infertility. Despite having their freedoms severely restricted, the handmaids are allowed to make daily shopping trips, during which they are faced with the hanged bodies of “rebels”. What once seemed like an unrealistic nightmare has felt a tad too close to the bone for this feminist given a recent political overturning in the US. An unsettling and gripping read in equal measure. Alexandra Thompson A scene from the series The Handmaid’s TaleAlamy Stock Photo Kindred by Octavia E. Butler Other Butler novels may seem more obviously sci-fi, but Kindred is, I think, her best. It tells the story of Dana, who every time the life of her ancestor Rufus is in danger is somehow summoned back in time to save him. The problem is, she is an African American woman living in 1970s Los Angeles and he is the son of a white plantation owner living in Maryland in the early 1800s, a time and place when enslaved people still work the fields and brutal violence towards them is normalised. Butler is unafraid to hit where it hurts as she explores the past and our relationship with it. Kindred is the best use of time travel in a story I’ve ever read. Eleanor Parsons Neuromancer by William Gibson Gibson’s 1984 novel Neuromancer is as cyberpunk as cyberpunk gets. Remarkably, it is his debut novel, and the only one to simultaneously win three of the most prestigious literary awards for science fiction. It is something of a holy text of the cyberpunk genre, which is often summarised by the phrase “high tech, low life”. Neuromancer lives up to that grim description by offering the reader a story about a disgraced hacker, a mercenary whose body was modified for violence, shadowy ex-military officers, an old friend turned into a consciousness-on-a-chip, several artificial intelligences and one last epic heist onboard a bourgeois space habitat. Having been raised on a steady diet of Isaac Asimov and Arthur C. Clarke, I was stunned by how grimy Gibson’s world was in comparison, how it lacked the clean, inspirational framing of more traditional science fiction, and how hard his characters, most of whom remain far removed from inspiration or virtue throughout the novel, had to work to retain some shred of human joy in an environment overrun with out-of-control corporations, crime and malicious tech. Neuromancer introduced a perfectly dystopian and rebellious aesthetic, as well as a paradigm similar to magical realism, except that all magic is actually technology, and all such magic has gone dark. As a teenager, I wanted to look as cool as Neuromancer’s protagonists, but these days the world where the metaverse, neural interfaces, smart prosthetics, designer drugs and collapsing social norms are features rather than bugs feels terrifyingly close and plausible. I was enthralled and deeply influenced by Gibson’s work as a young person who had barely experienced dial-up internet, but the punchlines that Neuromancer lands with style remain more than relevant today. Karmela Padavic-Callaghan Neuromancer is as cyberpunk as cyberpunk getsAlamy Stock Photo Stories of Your Life and Others by Ted Chiang Ted Chiang is one of the most extraordinary sci-fi writers working today. Each of his stories is a precious gem, plucked from his mind and honed to perfection. The titular story of his first collection, Stories of Your Life and Others, inspired the brilliant film Arrival, and while excellent it doesn’t even break the top three of the book. From a reimagining of the biblical Tower of Babel myth to a mathematician who breaks mathematics, this thin volume contains more ideas than most encyclopaedias. I only wish Chiang were more prolific – he has written just 18 short stories in a career spanning over 30 years – but then of course, if we had diamonds on tap, would they still be as valuable? Jacob Aron Flatland: A romance of many dimensions by A Square (Edwin Abbott Abbott) Flatland is set in a 2D world where inhabitants are shapes and their number of lines determines their social status. When the narrator visits a place with one extra dimension, Spaceland, he begins to understand that the universe is more complex than he ever knew. A good chunk of the book is contrived exposition on how the 2D world works, but if you get past that, then it is part satirical look at the rigid social and gender structures of the time – Flatland was published in 1884 – and part dive into the near-impossibility of grasping the concept of higher dimensions. I’ve always thought it is also a bit of a love letter to physics and how exploring what-ifs can push our understanding of the universe; residents of Flatland are baffled about where their light comes from, something the Spacelanders intuitively understand. Matthew Sparkes War With the Newts by Karel Čapek Bridging the gap between social satire and science fiction, Čapek’s witty parable of politics in the first half of the 20th century is an easy pick for my number one. Told through newspaper clippings, firsthand accounts and quasi-historical narration, it charts the downfall of humanity by arrogance and shortsightedness following the emergence of – of all things – a rather adorable species of impressionable, sentient, near-human-sized newts. This unusual source of aquatic labour is quickly exploited, and the scramble for profit brings the world to its knees. As onlookers react with a mix of bewilderment, high-minded philosophising and capitalistic glee, newt numbers only multiply and the amphibian apocalypse waddles inexorably on. “Hello, hello, you people,” chirps the Chief Salamander, “we will now entertain you with music from your gramophone records. Here, for your pleasure, is the March of the Tritons from the film, Poseidon.” Tom Leslie 17776 by Jon Bois The year is 17776. War, poverty and disease no longer exist. For the past 15,000 years, no one has died or even aged. The thing most people occupy their time with is play – and in North America, that takes the form of outlandish games of American football that would be completely unrecognisable to today’s fans of the sport. This is the premise of a bizarre and truly novel piece of science fiction published on SBnation.com, a sports blogging network. The future of the game envisioned by Bois is absurd. It is traditionally played on a field 100 yards long, but far in the future it has morphed into insane matches that extend across entire states. Some last hundreds or even thousands of years. In one, a player gets picked up in a tornado and tossed miles away. All this comes to the reader through the eyes of three defunct space probes: Pioneer 9, Pioneer 10 and the Jupiter Icy Moons Explorer (JUICE). These craft have become sentient and are still on the trajectories we put them on, alone in the vastness of space, except for their communications with each other and the TV show called Earth that they watch. It’s the presentation of their communications that first got my attention in 17776. They show us something that is nearly impossible to hold in a human brain: the vastness of time and space. The beginning of the story is delivered via messages displayed on a wall calendar between Pioneer 9 and 10, communicating across millions of miles. The frustration and impatience that comes from the endless scrolling as you wait to read the next response from one of the probes, who must wait hundreds of days to hear from one another, is just a glimmer of what it would actually be like to deal with interstellar communications – and it’s a fantastic demonstration of the endlessness of our universe. The piece is meant to be read on a computer, and includes videos and maps that are blocky, awful approximations of Earth – perhaps what it would look like through the eyes of ageing satellites. The spacecraft characters are where the heart lies in the story. Yes, they watch football. But they also contemplate the nature of loss in a world where nothing dies. They wrestle with the boredom that comes with immortality. They make jokes and poke fun at the humans below. They ponder what existence means, and the things that matter, even when you’re floating alone through the stars: grief, joy, friendship and the delight of mystery. Overall, 17776 paints a surprisingly hopeful picture of the future, one that is much needed these days. It’s heart-warming and weird and funny enough that it made me laugh out loud. Chelsea Whyte God Emperor of Dune by Frank Herbert I became a fan of the Dune literary universe after the Denis Villeneuve films. If there are any die-hard Dune devotees reading this who already dislike me for this reason, then you will dislike me more when I tell you I haven’t even read the first, original Dune book. Why not, you might be wondering. After watching, and thoroughly enjoying, the two recent Dune films, I was overcome with an intense desire to know exactly what happens to the central character Paul Atreides and so I skipped Dune and went straight to book two, Dune Messiah, which continues the story beyond that told in those movies. After that I kept reading. Friends and family told me to stop after book three because it gets too weird. Little do they know that the weirder it gets, the more I enjoy it! God Emperor of Dune is my pick for best sci-fi book of all time for one reason. Leto II, the tyrant-cum-God-cum-emperor-cum-sandworm who rules the universe dreamt up by Herbert, is, in my opinion, one of the most ambitious characters ever written in sci-fi history. The author deserves great credit for even trying to conceptualise the thought process of a being who literally has every memory that has ever been created swirling around his head. I enjoyed God Emperor of Dune so much that I may even read the first book. Finn Grant A scene from Dune: Part Two showing the sheer size of the sandwormsAlamy Stock Photo Parable of the Sower by Octavia E. Butler While Parable of the Sower was first published more than three decades ago, it has arguably never been more relevant than today. Set in 2024, the dystopian novel follows Lauren Oya Olamina, an African American teenager living in southern California, as she navigates a world crippled by climate change, income inequality and corporate greed. She and her family reside in a gated community, protected from the anarchy raging outside. But eventually Lauren must trek northward, to a part of the country where water, paid jobs and safety are more abundant. The perilous journey is made even more dangerous by the fact that Lauren suffers from a condition that causes her to feel the pain and pleasure of others. At certain points, Parable of the Sower can feel eerily prophetic rather than fictitious. This is what makes it such a compelling, albeit terrifying, read. Grace Wade Never Let Me Go by Kazuo Ishiguro Traditional science fiction – space battles, aliens, time-bending lasers, and the like – doesn’t really do it for me. But the haunting, close-to-home dystopia in Ishiguro’s Never Let Me Go is an entirely different offering. Set in an alternative 1990s England, this novel is a tale of youth, love and sorrow that play out against a backdrop of major breakthroughs in biotechnology being used to selfish, awful ends. The first time I read it, I was just a couple of years older than Ruth, Kathy and Tommy, the three main characters doomed to die early as organ donors. Their emotional naivety, their uncertainty about what it means to be alive, to be human, struck a chord. Rereading the novel more than a decade later, having experienced more of the joy and sadness life has to offer, the book’s slow, savage heartbreak cuts even deeper. Madeleine Cuff The Dispossessed by Ursula K. Le Guin I love idea-driven sci-fi such as Cixin Liu’s incredibly imaginative body of work, but I’m going to pick  one ofLe Guin’s offerings as the greatest because she has the ideas, deep humanity and vision of what society could be. She sets her stories in entirely believable worlds and fills them with complex and relatable people. In The Dispossessed, a physicist living on the planet Anarres makes a breakthrough in fundamental and applied physics, creating the Ansible, which allows information to travel faster-than-light and so permits instant communication across interstellar distances. We learn that Anarres is one of several planets settled by humans, including Terra (Earth), which is a now an ecologically ruined world. Le Guin explores different ways humans can live and exist together, different societies, even utopias, that are possible. Rowan Hooper The Vorkosigan Saga by Lois McMaster Bujold The Hugo Award-winning Vorkosigan Saga features the space opera adventures and romantic forays of Miles Vorkosigan, the scion of an imperial lord regent who is born with a teratogenic condition involving fragile bones and an unusually short stature on a planet that is highly suspicious of anything resembling genetic abnormality. Undaunted, Miles relies on his wit and relentless nature to make his mark within the feudal Barrayaran Imperium, while also navigating the politics of rival interstellar empires as an imperial agent and mercenary leader. Along the way, he and his eclectic but exceptional constellation of family and friends – including his highly capable mother Cordelia whose own story inaugurates the series – begin to slowly transform the socially conservative Barrayaran society into something more grudgingly accepting of artificial womb technology, gender equality and diversity, and even unexpected clone siblings. Jeremy Hsu The Long Earth by Terry Pratchett and Stephen Baxter When I was asked to pick my very favourite sci-fi book, my first move was to go look at my shelf containing every one of Pratchett’s Discworld books to figure out if any of them could count as science fiction rather than fantasy. The Long Earth, which he wrote with Baxter, is the next-best thing. It has the same untamed imagination and keen social commentary as Pratchett’s other works, grounded in Baxter’s signature science-based speculation. The book (and subsequent series) is set in a sort of multiverse in which one can “step” between a recognisable future Earth and other versions of our world, some similar and some wildly different. It deals with the consequences of this vast new frontier and how humanity – and other humanoid species across the Long Earth – have adapted to its discovery, along with dangers both familiar and strange. Leah Crane An Unkindness of Ghosts by Rivers Solomon While I object on principle to picking single favourite books, I very much loved Solomon’s An Unkindness of Ghosts. The story takes place on the Matilda, a generation ship barrelling humanity’s remnants toward a vaguely outlined “Promised Land” after a similarly vague ecological catastrophe on Earth. It is like many other fictional ships for multigenerational voyages: huge, self-contained, and moving fast toward a destination its current inhabitants don’t expect to see. But it is also a story about the worst of humanity. The Matilda is racially segregated, and our protagonist Aster lives, like the other Black passengers, on the lowest and poorest-resourced decks. She is autistic, genderqueer, and traumatised by the enslavement-like conditions under which she lives. And throughout the course of the book she must unravel a puzzle that connects the decades-ago death of her mother, Lune, to the eventual fate of the entire ship. An Unkindness of Ghosts isn’t an easy read, emotionally. But it’s a riveting story, told from a singular point of view, with characters who challenge us to think bigger. Christie Taylor The City \u0026 the City by China Miéville This noir thriller from Miéville is closer to crime fiction than sci-fi, but its setting – in two rival cities that occupy the same space – feels reminiscent of the quantum realm. Citizens of the “crosshatched” Besźel and Ul Qoma are banned from acknowledging each other’s existence, while those who “breach” are spirited away, never to be seen again. But when a woman is found murdered in Besźel, Inspector Tyador Borlú must team up with his Ul Qoman opposite number to crack the case. I loved this book the minute I heard its premise, which challenged my visual imagination like few novels have since. The way the characters must “unsee” people who are right before their eyes is such a revealing way to discuss how we are encouraged to view those on the fringes of society. Bethan Ackerley Red Mars by Kim Stanley Robinson It’s 2026 (!) and 100 colonists are setting off from Earth to Mars to colonise the Red Planet. “It loomed before them in all its immense potential: tabula rasa, blank slate. A blank red slate. Anything was possible, anything could happen.” Once there, though, different factions have different ideas about how this new life should look – should Mars be terraformed as much as possible, or should humanity take a little more time to think before it bends an entire planet to its will? Things on Earth, meanwhile, are turning pear-shaped as resources dwindle while the population booms. This is a story of adventure and derring-do 225 million kilometres from home, but it is also a story of politics and science and people that is utterly gripping and fascinating, with the bonus of marvelling at the beauty and wonder and possibilities of life on another planet. It is a huge book – more than 650 pages – but I flew through it on my first reading and went on to bury myself in the sequels. Alison Flood Slaughterhouse-Five by Kurt Vonnegut Billy Pilgrim continuously gets “unstuck in time” thanks to the intervention of a Tralfamadorian flying saucer in Vonnegut’s breakthrough, absurdist, ferociously anti-war novel. Vonnegut, who served with the US Army, was  held in Dresden, Germany, during the second world war after being taken prisoner. There he witnessed the devastating Allied fire-bombing of the city, similar to the protagonist in Slaughterhouse-Five. The post-war psychological trauma and piercing black humour is woven with a narrative that darts back and forth in time, as does Billy. It is often disorientating, yet easily absorbed thanks to Vonnegut’s deeply satirical and straightforward linguistic style, along with his conversational tone. It makes for a potent mix. What has always happened, always will happen in this most poignant of reads; and one that is sadly as relevant today as when it was released in the 1960s. So it goes. Tim Boddy The Murderbot Diaries by Martha Wells Murderbot doesn’t actually want to kill people. After all, this machine-organic hybrid is a Security Unit designed to protect human clients. Sure, it has hacked the governor module that enforces obedience to humans. Sure, it frequently tears apart anything that threatens its teammates. And fine, it is the one that named itself “Murderbot”. I love the narration in this series of books: our protagonist is snarky and grouchy, socially awkward but eminently capable. It can strategise expertly, hack almost any system, fight brutally and even murder when that is what it takes to protect the often-irritating people and bots that it, annoyingly, sort of cares about. Beyond the tentative friendships it forms against its will, Murderbot is on a quest for full personhood and independence – even if what it does with that freedom is binge-watch as much media as is (in)humanly possible. Sophie Bushwick We by Yevgeny Zamyatin We is a searing, prescient book that you have to take a step back from to truly appreciate. Zamyatin probably finished it, writing in his native Russian, in 1921. But because the tale’s dystopian nature, railing against a totalitarian OneState society, would have been taken as criticism of the Russian regime, it was published in other countries at first and didn’t get the reach it deserved until a corrected version was published in Russia in 1988 and then translated into English a few years later. Despite that, the effects of its earlier versions on dystopian sci-fi have been huge. George Orwell’s Nineteen Eighty-Four (1949) was massively influenced by We and you can see its imprint in the sexual politics at play in Margaret Atwood’s The Handmaid’s Tale (1985), for example. The story is set in the 26th century in a city built in straight lines and ruled by a Benefactor, where everyone has a number not a name. Every hour of people’s lives is dictated, including two daily hour-long slots to be alone with your thoughts. On Sex Day, you hand in your pink ticket and meet up with your pre-allocated, rotating partner. Residents ostensibly have happiness at the cost of freedom. In this straitened – and straightened – environment, a mathematician known as D-503 is unsettled when he is hit by the curveball of I-333, a secretive and intelligent political activist he doesn’t have a pink ticket for, and he starts to question everything. Some of the lines in We are naturally of their time – as well as potentially being suited to the 26th century – but regardless, this book is an enlightening, surprising and unsettling read, packed full of clever, quotable phrases. Chris Simms Join the New Scientist book club. Love reading? Come and join our friendly group of fellow book lovers. Every six weeks, we delve into an exciting new title, with members given free access to extracts from our books, articles from our authors and video interviews. Sign up here. The art and science of writing science fiction Take your science fiction writing to a new dimension! Join New Scientist Culture Editor Alison Flood, and former New Scientist Editor Emily Wilson, for an immersive writing weekend. Topics:",
  "image": "https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                \u003cdiv\u003e\n                        \u003cheader\u003e\n                                                            \u003ch4\u003e\n                                                                        \u003ca href=\"https://www.newscientist.com/subject/space/\" data-analytics-hook=\"article-header-subject-link\"\u003eSpace\u003c/a\u003e\n                                \u003c/h4\u003e\n                                                        \n                            \n\n                            \n                                                            \u003cp\u003eWe asked \u003cem\u003eNew Scientist\u003c/em\u003e staff to pick their favourite science fiction books. Here are the results, ranging from 19th-century classics to modern day offerings, and from Octavia E. Butler to Iain M. Banks\u003c/p\u003e\n                            \n                            \n                            \n                            \u003cp\u003e\n        \n\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.newscientist.com%2Farticle%2F2433037-our-writers-pick-their-favourite-science-fiction-books-of-all-time%2F\" target=\"_blank\" rel=\"nofollow\" data-social-platform=\"facebook\" aria-label=\"Link to Facebook / Meta\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" viewBox=\"0 0 32 32\" version=\"1.1\" role=\"img\" fill=\"rgb(0, 0, 0)\"\u003e\n        \u003ctitle\u003eFacebook / Meta\u003c/title\u003e\n        \u003cg\u003e\n            \u003cpath d=\"M22 5.16c-.406-.054-1.806-.16-3.43-.16-3.4 0-5.733 1.825-5.733 5.17v2.882H9v3.913h3.837V27h4.604V16.965h3.823l.587-3.913h-4.41v-2.5c0-1.123.347-1.903 2.198-1.903H22V5.16z\" fill-rule=\"evenodd\"\u003e\u003c/path\u003e\n        \u003c/g\u003e\n    \u003c/svg\u003e\n\u003c/a\u003e\n        \n\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fwww.newscientist.com%2Farticle%2F2433037-our-writers-pick-their-favourite-science-fiction-books-of-all-time%2F\" target=\"_blank\" rel=\"nofollow\" data-social-platform=\"twitter\" aria-label=\"Link to Twitter / X\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" width=\"22\" height=\"22\" fill=\"none\" viewBox=\"0 0 22 22\"\u003e\n        \u003ctitle\u003eTwitter / X icon\u003c/title\u003e\n        \u003cpath fill=\"#000\" d=\"m12.21 9.814 5.644-6.556h-1.338l-4.9 5.692L7.7 3.258H3.185l5.92 8.608-5.92 6.875h1.338L9.7 12.73l4.134 6.011h4.515L12.21 9.814Zm-1.833 2.128-.6-.857-4.772-6.821H7.06l3.851 5.505.6.857 5.006 7.155h-2.055l-4.085-5.839Z\"\u003e\u003c/path\u003e\n    \u003c/svg\u003e\n\u003c/a\u003e\n        \n\u003ca href=\"https://api.whatsapp.com/send?text=Our%20writers%20pick%20their%20favourite%20science%20fiction%20books%20of%20all%20time%20https%3A%2F%2Fwww.newscientist.com%2Farticle%2F2433037-our-writers-pick-their-favourite-science-fiction-books-of-all-time%2F\" data-action=\"share/whatsapp/share\" target=\"_blank\" rel=\"nofollow\" data-social-platform=\"whatsapp\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" style=\"fill:#000\" viewBox=\"0 0 32 32\"\u003e\u003cpath fill-rule=\"evenodd\" d=\"M19.11 17.205c-.372 0-1.088 1.39-1.518 1.39a.63.63 0 0 1-.315-.1c-.802-.402-1.504-.817-2.163-1.447-.545-.516-1.146-1.29-1.46-1.963a.426.426 0 0 1-.073-.215c0-.33.99-.945.99-1.49 0-.143-.73-2.09-.832-2.335-.143-.372-.214-.487-.6-.487-.187 0-.36-.043-.53-.043-.302 0-.53.115-.746.315-.688.645-1.032 1.318-1.06 2.264v.114c-.015.99.472 1.977 1.017 2.78 1.23 1.82 2.506 3.41 4.554 4.34.616.287 2.035.888 2.722.888.817 0 2.15-.515 2.478-1.318.13-.33.244-.73.244-1.088 0-.058 0-.144-.03-.215-.1-.172-2.434-1.39-2.678-1.39zm-2.908 7.593c-1.747 0-3.48-.53-4.942-1.49L7.793 24.41l1.132-3.337a8.955 8.955 0 0 1-1.72-5.272c0-4.955 4.04-8.995 8.997-8.995S25.2 10.845 25.2 15.8c0 4.958-4.04 8.998-8.998 8.998zm0-19.798c-5.96 0-10.8 4.842-10.8 10.8 0 1.964.53 3.898 1.546 5.574L5 27.176l5.974-1.92a10.807 10.807 0 0 0 16.03-9.455c0-5.958-4.842-10.8-10.802-10.8z\"\u003e\u003c/path\u003e\u003c/svg\u003e\n\u003c/a\u003e\n        \n\u003ca href=\"https://www.linkedin.com/sharing/share-offsite/?url=https%3A%2F%2Fwww.newscientist.com%2Farticle%2F2433037-our-writers-pick-their-favourite-science-fiction-books-of-all-time%2F\" target=\"_blank\" rel=\"nofollow\" data-social-platform=\"linkedin\" aria-label=\"Link to Linkedin\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" viewBox=\"0 0 32 32\" version=\"1.1\" role=\"img\" style=\"fill: rgb(0, 0, 0);\"\u003e\n    \u003ctitle\u003eLinkedin\u003c/title\u003e\n    \u003cg\u003e\n        \u003cpath d=\"M26 25.963h-4.185v-6.55c0-1.56-.027-3.57-2.175-3.57-2.18 0-2.51 1.7-2.51 3.46v6.66h-4.182V12.495h4.012v1.84h.058c.558-1.058 1.924-2.174 3.96-2.174 4.24 0 5.022 2.79 5.022 6.417v7.386zM8.23 10.655a2.426 2.426 0 0 1 0-4.855 2.427 2.427 0 0 1 0 4.855zm-2.098 1.84h4.19v13.468h-4.19V12.495z\" fill-rule=\"evenodd\"\u003e\u003c/path\u003e\n    \u003c/g\u003e\n    \u003c/svg\u003e\n\u003c/a\u003e\n        \n\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fwww.newscientist.com%2Farticle%2F2433037-our-writers-pick-their-favourite-science-fiction-books-of-all-time%2F\u0026amp;title=Our%20writers%20pick%20their%20favourite%20science%20fiction%20books%20of%20all%20time\" target=\"_blank\" rel=\"nofollow\" data-social-platform=\"reddit\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" viewBox=\"0 0 32 32\" version=\"1.1\" role=\"img\" style=\"fill: rgb(0, 0, 0);\"\u003e\n        \u003ctitle\u003eReddit\u003c/title\u003e\n        \u003cg\u003e\n            \u003cpath d=\"M27 15.5a2.452 2.452 0 0 1-1.338 2.21c.098.38.147.777.147 1.19 0 1.283-.437 2.47-1.308 3.563-.872 1.092-2.06 1.955-3.567 2.588-1.506.634-3.143.95-4.91.95-1.768 0-3.403-.316-4.905-.95-1.502-.632-2.69-1.495-3.56-2.587-.872-1.092-1.308-2.28-1.308-3.562 0-.388.045-.777.135-1.166a2.47 2.47 0 0 1-1.006-.912c-.253-.4-.38-.842-.38-1.322 0-.678.237-1.26.712-1.744a2.334 2.334 0 0 1 1.73-.726c.697 0 1.29.26 1.78.782 1.785-1.258 3.893-1.928 6.324-2.01l1.424-6.467a.42.42 0 0 1 .184-.26.4.4 0 0 1 .32-.063l4.53 1.006c.147-.306.368-.553.662-.74a1.78 1.78 0 0 1 .97-.278c.508 0 .94.18 1.302.54.36.36.54.796.54 1.31 0 .512-.18.95-.54 1.315-.36.364-.794.546-1.302.546-.507 0-.94-.18-1.295-.54a1.793 1.793 0 0 1-.533-1.308l-4.1-.92-1.277 5.86c2.455.074 4.58.736 6.37 1.985a2.315 2.315 0 0 1 1.757-.757c.68 0 1.256.242 1.73.726.476.484.713 1.066.713 1.744zm-16.868 2.47c0 .513.178.95.534 1.315.356.365.787.547 1.295.547.508 0 .942-.182 1.302-.547.36-.364.54-.802.54-1.315 0-.513-.18-.95-.54-1.31-.36-.36-.794-.54-1.3-.54-.5 0-.93.183-1.29.547a1.79 1.79 0 0 0-.54 1.303zm9.944 4.406c.09-.09.135-.2.135-.323a.444.444 0 0 0-.44-.447c-.124 0-.23.042-.32.124-.336.348-.83.605-1.486.77a7.99 7.99 0 0 1-1.964.248 7.99 7.99 0 0 1-1.964-.248c-.655-.165-1.15-.422-1.486-.77a.456.456 0 0 0-.32-.124.414.414 0 0 0-.306.124.41.41 0 0 0-.135.317.45.45 0 0 0 .134.33c.352.355.837.636 1.455.843.617.207 1.118.33 1.503.366a11.6 11.6 0 0 0 1.117.056c.36 0 .733-.02 1.117-.056.385-.037.886-.16 1.504-.366.62-.207 1.104-.488 1.456-.844zm-.037-2.544c.507 0 .938-.182 1.294-.547.356-.364.534-.802.534-1.315 0-.505-.18-.94-.54-1.303a1.75 1.75 0 0 0-1.29-.546c-.506 0-.94.18-1.3.54-.36.36-.54.797-.54 1.31s.18.95.54 1.315c.36.365.794.547 1.3.547z\" fill-rule=\"evenodd\"\u003e\u003c/path\u003e\n        \u003c/g\u003e\n    \u003c/svg\u003e\n\u003c/a\u003e\n    \u003ca href=\"mailto:?subject=Our%20writers%20pick%20their%20favourite%20science%20fiction%20books%20of%20all%20time\u0026amp;body=We%20asked%20New%20Scientist%20staff%20to%20pick%20their%20favourite%20science%20fiction%20books.%20Here%20are%20the%20results%2C%20ranging%20from%2019th-century%20classics%20to%20modern%20day%20offerings%2C%20and%20from%20Octavia%20E.%20Butler%20to%20Iain%20M.%20Banks%0D%0Aread more: https%3A%2F%2Fwww.newscientist.com%2Farticle%2F2433037-our-writers-pick-their-favourite-science-fiction-books-of-all-time%2F\" target=\"_blank\" rel=\"nofollow\" data-social-platform=\"email\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" viewBox=\"0 0 32 32\" version=\"1.1\" role=\"img\" style=\"fill: rgb(0, 0, 0);\"\u003e\n        \u003ctitle\u003eEmail\u003c/title\u003e\n        \u003cg\u003e\n            \u003cg fill-rule=\"evenodd\"\u003e\u003c/g\u003e\n            \u003cpath d=\"M27 22.757c0 1.24-.988 2.243-2.19 2.243H7.19C5.98 25 5 23.994 5 22.757V13.67c0-.556.39-.773.855-.496l8.78 5.238c.782.467 1.95.467 2.73 0l8.78-5.238c.472-.28.855-.063.855.495v9.087z\"\u003e\u003c/path\u003e\u003cpath d=\"M27 9.243C27 8.006 26.02 7 24.81 7H7.19C5.988 7 5 8.004 5 9.243v.465c0 .554.385 1.232.857 1.514l9.61 5.733c.267.16.8.16 1.067 0l9.61-5.733c.473-.283.856-.96.856-1.514v-.465z\"\u003e\u003c/path\u003e\n        \u003c/g\u003e\n    \u003c/svg\u003e\n\u003c/a\u003e\n    \u003ca rel=\"nofollow\" tabindex=\"0\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" viewBox=\"0 0 32 32\" version=\"1.1\" role=\"img\" style=\"fill: rgb(0, 0, 0);\"\u003e\n        \u003cg\u003e\n            \u003cpath d=\"M24.67 10.62h-2.86V7.49H10.82v3.12H7.95c-.5 0-.9.4-.9.9v7.66h3.77v1.31L15 24.66h6.81v-5.44h3.77v-7.7c-.01-.5-.41-.9-.91-.9zM11.88 8.56h8.86v2.06h-8.86V8.56zm10.98 9.18h-1.05v-2.1h-1.06v7.96H16.4c-1.58 0-.82-3.74-.82-3.74s-3.65.89-3.69-.78v-3.43h-1.06v2.06H9.77v-3.58h13.09v3.61zm.75-4.91c-.4 0-.72-.32-.72-.72s.32-.72.72-.72c.4 0 .72.32.72.72s-.32.72-.72.72zm-4.12 2.96h-6.1v1.06h6.1v-1.06zm-6.11 3.15h6.1v-1.06h-6.1v1.06z\"\u003e\u003c/path\u003e\n        \u003c/g\u003e\n    \u003c/svg\u003e\n\u003c/a\u003e\u003c/p\u003e                        \u003c/header\u003e\n                    \u003c/div\u003e\n                \u003csection data-barrier=\"None\"\u003e\n                    \u003cfigure\u003e\u003cp\u003e\u003cimg width=\"1350\" height=\"900\" alt=\"New Scientist. Science news and long reads from expert journalists, covering developments in science, technology, health and the environment on the website and the magazine.\" src=\"https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png\" data-src=\"https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png\" sizes=\"(min-width: 1288px) 837px, (min-width: 1024px) calc(57.5vw + 55px), (min-width: 415px) calc(100vw - 40px), calc(70vw + 74px)\" srcset=\"https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=300 300w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=400 400w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=500 500w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=600 600w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=700 700w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=800 800w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=837 837w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=900 900w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=1003 1003w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=1100 1100w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=1200 1200w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=1300 1300w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=1400 1400w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=1500 1500w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=1600 1600w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=1674 1674w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=1700 1700w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=1800 1800w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=1900 1900w, https://images.newscientist.com/wp-content/uploads/2024/05/24140958/sei204548736.png?width=2006 2006w\" loading=\"eager\" fetchpriority=\"high\" data-image-context=\"Article\" data-image-id=\"2433040\" data-caption=\"\" data-credit=\"\"/\u003e\u003c/p\u003e\u003c/figure\u003e\n\u003cp\u003eBy its very nature, science fiction encompasses a vast and sprawling world of stories, from the galaxy-spanning novels of Iain M. Banks and Ursula K. Le Guin to the dystopias of Margaret Atwood and Kazuo Ishiguro. Asking our team of dedicated staff here at \u003cem\u003eNew Scientist\u003c/em\u003e to pick their personal favourite, then, has created an eclectic and wide-ranging list to dig into. To be clear: this isn’t a definitive and all-encompassing line-up: it is our personal top picks, and we hope it will send you towards some novels you might not have come across before.\u003c/p\u003e\n\u003cp\u003eSo, in no particular order, here they are: \u003cem\u003eNew Scientist\u003c/em\u003e’s favourite science fiction books of all time. We’d love to hear from readers, too, about your own favourite sci-fi. Join the conversation on our \u003ca href=\"https://www.facebook.com/newscientist/posts/pfbid0Saf7G6xCQ8Wd8NAP8nJVibfmvVdvFnuJJH29E4qgEff77rGBnKbXK75V5rFGN7ARl\"\u003eFacebook post here\u003c/a\u003e.\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://store.orbit-books.co.uk/collections/author-iain-m-banks-pid-8791\"\u003e\u003cstrong\u003e\u003cem\u003eThe Culture series by Iain M. Banks\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cspan\u003e\u003c/span\u003e\u003cp\u003e\u003cem\u003eThe Culture\u003c/em\u003e books, by UK author \u003ca href=\"https://www.newscientist.com/article/mg20827855-900-iain-m-banks-upload-for-everlasting-life/\"\u003eBanks\u003c/a\u003e, aren’t so much a series as a collection of stories – readable in any order – about the exploits of one fascinating, far-future, galaxy spanning civilisation. With unlimited resources, energy and, effectively, lifespans, its citizens have solved all of life’s problems, so it is usually when they collide with more primitive societies – which still have to worry about minor matters like making money or waging war – that the fireworks begin. The plots may be mind-bending, but it is the characters that are unforgettable, especially the super-intelligent, starship-embodying AI minds, whose attitudes to humans run the gamut from benevolent to downright Machiavellian. Nevertheless, if AIs ever do become sentient, I hope they model themselves on Banks’s vision.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/clare-wilson/\"\u003eClare Wilson\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://www.penguinrandomhouse.com/series/HGG/hitchhikers-guide-to-the-galaxy/\"\u003e\u003cstrong\u003e\u003cem\u003eThe Hitchhiker’s Guide to the Galaxy series by Douglas Adams\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eWhen you think of your favourite story about an imagined future, it is probably profound and thought-provoking, perhaps beautiful, but it is rarely funny. Adams’s\u003cem\u003e The Hitchhiker’s Guide to the Galaxy\u003c/em\u003e series, which features the hapless Englishman Arthur Dent and his reluctant jaunts around the universe after Earth is destroyed, is all of the former, but it is the rich comedic vein that has sustained it and drawn a devoted following, of which I count myself a member. Simple gags and one-liners abound, and the offbeat cast of characters summoned to accompany Dent, like the depressed Marvin the paranoid android or the gung-ho and feckless two-headed alien Zaphod Beeblebrox, are endlessly entertaining. Almost 50 years after it debuted as a BBC radio play, the books that followed have lost none of their sparkle.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/alex-wilkins/\"\u003eAlex Wilkins\u003c/a\u003e\u003c/p\u003e\n\u003csection\u003e\n            \u003cpicture\u003e\n            \n\u003cimg width=\"500\" height=\"337\" alt=\"New Scientist. Science news and long reads from expert journalists, covering developments in science, technology, health and the environment on the website and the magazine.\" sizes=\"(min-width: 1277px) 375px, (min-width: 1040px) 26.36vw, 99.44vw\" data-srcset=\"https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=300 300w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=375 375w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=500 500w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=600 600w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=700 700w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=750 750w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=800 800w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=900 900w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=1003 1003w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=1100 1100w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=1200 1200w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=1300 1300w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=1400 1400w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=1500 1500w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=1600 1600w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=1700 1700w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=1800 1800w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=1900 1900w, https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg?width=2006 2006w\" data-src=\"https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg\" loading=\"lazy\" data-image-context=\"Special Article Unit\" data-caption=\"\" data-credit=\"\" src=\"https://images.newscientist.com/wp-content/uploads/2024/05/30174819/book_club6.jpg\"/\u003e\n        \u003c/picture\u003e\n        \u003cdiv\u003e\n        \u003ch3\u003eNew Scientist book club\u003c/h3\u003e\n        \u003cp\u003eLove reading? Come and join our friendly group of fellow book lovers. Every six weeks, we delve into an exciting new title, with members given free access to extracts from our books, articles from our authors and video interviews.\u003c/p\u003e\n                    \n            \u003c/div\u003e\n\u003c/section\u003e\n\u003ch2\u003e\u003ca href=\"https://www.penguin.co.uk/books/354755/the-handmaids-tale-by-atwood-margaret/9781784879679\"\u003e\u003cstrong\u003e\u003cem\u003eThe Handmaid’s Tale by Margaret Atwood\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cem\u003eThe Handmaid’s Tale \u003c/em\u003eby Atwood is a haunting novel that still gives me shivers to think about, years after I read it. It describes a dystopian, not-so-distant future where a “handmaid’s” sole purpose is to reproduce in an effort to combat society’s falling birth rates due to widespread infertility. Despite having their freedoms severely restricted, the handmaids are allowed to make daily shopping trips, during which they are faced with the hanged bodies of “rebels”. What once seemed like an unrealistic nightmare has felt a tad too close to the bone for this feminist given a recent political overturning in the US. An unsettling and gripping read in equal measure.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/alexandra-thompson/\"\u003eAlexandra Thompson\u003c/a\u003e\u003c/p\u003e\n\u003cfigure\u003e\u003cp\u003e\u003cimg width=\"1350\" height=\"900\" alt=\"New Scientist. Science news and long reads from expert journalists, covering developments in science, technology, health and the environment on the website and the magazine.\" sizes=\"(min-width: 1288px) 837px, (min-width: 1024px) calc(57.5vw + 55px), (min-width: 415px) calc(100vw - 40px), calc(70vw + 74px)\" data-srcset=\"https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=300 300w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=400 400w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=500 500w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=600 600w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=700 700w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=800 800w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=837 837w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=900 900w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=1003 1003w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=1100 1100w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=1200 1200w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=1300 1300w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=1400 1400w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=1500 1500w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=1600 1600w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=1674 1674w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=1700 1700w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=1800 1800w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=1900 1900w, https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg?width=2006 2006w\" data-src=\"https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg\" loading=\"lazy\" data-image-context=\"Article\" data-image-id=\"2433042\" data-caption=\"A scene from the series The Handmaid\u0026#39;s Tale\" data-credit=\"Alamy Stock Photo\" src=\"https://images.newscientist.com/wp-content/uploads/2024/05/24141131/sei204548428.jpg\"/\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eA scene from the series The Handmaid’s Tale\u003c/p\u003e\u003cp\u003eAlamy Stock Photo\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003ch2\u003e\u003ca href=\"https://www.headline.co.uk/titles/octavia-e-butler/kindred/9781035409686/\"\u003e\u003cstrong\u003e\u003cem\u003eKindred by Octavia E. Butler\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eOther Butler novels may seem more obviously sci-fi, but \u003cem\u003eKindred\u003c/em\u003e is, I think, her best. It tells the story of Dana, who every time the life of her ancestor Rufus is in danger is somehow summoned back in time to save him. The problem is, she is an African American woman living in 1970s Los Angeles and he is the son of a white plantation owner living in Maryland in the early 1800s, a time and place when enslaved people still work the fields and brutal violence towards them is normalised. Butler is unafraid to hit where it hurts as she explores the past and our relationship with it. \u003cem\u003eKindred\u003c/em\u003e is the best use of time travel in a story I’ve ever read.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/eleanor-parsons/\"\u003eEleanor Parsons\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://www.gollancz.co.uk/titles/william-gibson/neuromancer/9781473217379/\"\u003e\u003cstrong\u003e\u003cem\u003eNeuromancer by William Gibson\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eGibson’s 1984 novel \u003cem\u003eNeuromancer\u003c/em\u003e is as cyberpunk as cyberpunk gets. Remarkably, it is his debut novel, and the only one to simultaneously win three of the most prestigious literary awards for science fiction. It is something of a holy text of the cyberpunk genre, which is often summarised by the phrase “high tech, low life”. \u003cem\u003eNeuromancer\u003c/em\u003e lives up to that grim description by offering the reader a story about a disgraced hacker, a mercenary whose body was modified for violence, shadowy ex-military officers, an old friend turned into a consciousness-on-a-chip, several artificial intelligences and one last epic heist onboard a bourgeois space habitat. Having been raised on a steady diet of Isaac Asimov and Arthur C. Clarke, I was stunned by how grimy Gibson’s world was in comparison, how it lacked the clean, inspirational framing of more traditional science fiction, and how hard his characters, most of whom remain far removed from inspiration or virtue throughout the novel, had to work to retain some shred of human joy in an environment overrun with out-of-control corporations, crime and malicious tech. \u003cem\u003eNeuromancer\u003c/em\u003e introduced a perfectly dystopian and rebellious aesthetic, as well as a paradigm similar to magical realism, except that all magic is actually technology, and all such magic has gone dark. As a teenager, I wanted to look as cool as \u003cem\u003eNeuromancer\u003c/em\u003e’s protagonists, but these days the world where the metaverse, neural interfaces, smart prosthetics, designer drugs and collapsing social norms are features rather than bugs feels terrifyingly close and plausible. I was enthralled and deeply influenced by Gibson’s work as a young person who had barely experienced dial-up internet, but the punchlines that \u003cem\u003eNeuromancer\u003c/em\u003e lands with style remain more than relevant today.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/karmela-padavic-callaghan/\"\u003eKarmela Padavic-Callaghan\u003c/a\u003e\u003c/p\u003e\n\u003cfigure\u003e\u003cp\u003e\u003cimg width=\"1350\" height=\"900\" alt=\"A futuristic man holding a gun in destroyed city\" sizes=\"(min-width: 1288px) 837px, (min-width: 1024px) calc(57.5vw + 55px), (min-width: 415px) calc(100vw - 40px), calc(70vw + 74px)\" data-srcset=\"https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=300 300w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=400 400w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=500 500w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=600 600w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=700 700w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=800 800w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=837 837w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=900 900w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=1003 1003w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=1100 1100w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=1200 1200w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=1300 1300w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=1400 1400w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=1500 1500w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=1600 1600w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=1674 1674w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=1700 1700w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=1800 1800w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=1900 1900w, https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg?width=2006 2006w\" data-src=\"https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg\" loading=\"lazy\" data-image-context=\"Article\" data-image-id=\"2433527\" data-caption=\"Neuromancer is as cyberpunk as cyberpunk gets\" data-credit=\"Alamy Stock Photo\" src=\"https://images.newscientist.com/wp-content/uploads/2024/05/30100306/cyberpunk-neuromancer.jpg\"/\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eNeuromancer is as cyberpunk as cyberpunk gets\u003c/p\u003e\u003cp\u003eAlamy Stock Photo\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003ch2\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Stories_of_Your_Life_and_Others\"\u003e\u003cstrong\u003e\u003cem\u003eStories of Your Life and Others by Ted Chiang\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eTed Chiang is one of the most extraordinary sci-fi writers working today. Each of his stories is a precious gem, plucked from his mind and honed to perfection. The titular story of his first collection, \u003cem\u003eStories of Your Life and Others\u003c/em\u003e, inspired the brilliant film \u003cem\u003eArrival\u003c/em\u003e, and while excellent it doesn’t even break the top three of the book. From a reimagining of the biblical Tower of Babel myth to a mathematician who breaks mathematics, this thin volume contains more ideas than most encyclopaedias. I only wish Chiang were more prolific – he has written just 18 short stories in a career spanning over 30 years – but then of course, if we had diamonds on tap, would they still be as valuable?\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/jacob-aron/\"\u003eJacob Aron\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://www.gutenberg.org/cache/epub/201/pg201-images.html\"\u003e\u003cstrong\u003e\u003cem\u003eFlatland: A romance of many dimensions by A Square (Edwin Abbott Abbott)\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cem\u003eFlatland\u003c/em\u003e is set in a 2D world where inhabitants are shapes and their number of lines determines their social status. When the narrator visits a place with one extra dimension, Spaceland, he begins to understand that the universe is more complex than he ever knew. A good chunk of the book is contrived exposition on how the 2D world works, but if you get past that, then it is part satirical look at the rigid social and gender structures of the time – \u003cem\u003eFlatland\u003c/em\u003e was published in 1884 – and part dive into the near-impossibility of grasping the concept of higher dimensions. I’ve always thought it is also a bit of a love letter to physics and how exploring what-ifs can push our understanding of the universe; residents of Flatland are baffled about where their light comes from, something the Spacelanders intuitively understand.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/matthew-sparkes/\"\u003eMatthew Sparkes\u003c/a\u003e\u003c/p\u003e\n\u003cfigure\u003e\u003cp\u003e\u003cimg width=\"1350\" height=\"900\" alt=\"New Scientist. Science news and long reads from expert journalists, covering developments in science, technology, health and the environment on the website and the magazine.\" sizes=\"(min-width: 1288px) 837px, (min-width: 1024px) calc(57.5vw + 55px), (min-width: 415px) calc(100vw - 40px), calc(70vw + 74px)\" data-srcset=\"https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=300 300w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=400 400w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=500 500w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=600 600w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=700 700w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=800 800w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=837 837w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=900 900w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=1003 1003w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=1100 1100w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=1200 1200w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=1300 1300w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=1400 1400w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=1500 1500w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=1600 1600w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=1674 1674w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=1700 1700w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=1800 1800w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=1900 1900w, https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png?width=2006 2006w\" data-src=\"https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png\" loading=\"lazy\" data-image-context=\"Article\" data-image-id=\"2433043\" data-caption=\"\" data-credit=\"\" src=\"https://images.newscientist.com/wp-content/uploads/2024/05/24141210/sei204548721.png\"/\u003e\u003c/p\u003e\u003c/figure\u003e\n\u003ch2\u003e\u003ca href=\"https://www.penguin.co.uk/books/177530/war-with-the-newts-by-capek-karel/9780241343456\"\u003e\u003cstrong\u003e\u003cem\u003eWar With the Newts by Karel \u003c/em\u003e\u003c/strong\u003e\u003cstrong\u003e\u003cem\u003eČapek\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eBridging the gap between social satire and science fiction, Čapek’s witty parable of politics in the first half of the 20th century is an easy pick for my number one. Told through newspaper clippings, firsthand accounts and quasi-historical narration, it charts the downfall of humanity by arrogance and shortsightedness following the emergence of – of all things – a rather adorable species of impressionable, sentient, near-human-sized newts. This unusual source of aquatic labour is quickly exploited, and the scramble for profit brings the world to its knees. As onlookers react with a mix of bewilderment, high-minded philosophising and capitalistic glee, newt numbers only multiply and the amphibian apocalypse waddles inexorably on. “Hello, hello, you people,” chirps the Chief Salamander, “we will now entertain you with music from your gramophone records. Here, for your pleasure, is the March of the Tritons from the film, Poseidon.”\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/tom-leslie/\"\u003eTom Leslie\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://eur02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.sbnation.com%2Fa%2F17776-football\u0026amp;data=05%7C02%7CAlison.Flood%40newscientist.com%7C71c4522bb752465f5ef008dc695f9738%7C0f3a4c644dc54a768d4152d85ca158a5%7C0%7C0%7C638501106491713584%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C0%7C%7C%7C\u0026amp;sdata=gQKAe7e6uUygHkNrZd1xADaT8YSu4e7q7PgusYm1KU8%3D\u0026amp;reserved=0\"\u003e\u003cstrong\u003e\u003cem\u003e17776\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e\u003cem\u003e by \u003c/em\u003e\u003c/strong\u003e\u003cstrong\u003e\u003cem\u003eJon Bois\u003c/em\u003e\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eThe year is 17776. War, poverty and disease no longer exist. For the past 15,000 years, no one has died or even aged. The thing most people occupy their time with is play – and in North America, that takes the form of outlandish games of American football that would be completely unrecognisable to today’s fans of the sport. This is the premise of a bizarre and truly novel piece of science fiction published on SBnation.com, a sports blogging network. The future of the game envisioned by Bois is absurd. It is traditionally played on a field 100 yards long, but far in the future it has morphed into insane matches that extend across entire states. Some last hundreds or even thousands of years. In one, a player gets picked up in a tornado and tossed miles away. All this comes to the reader through the eyes of three defunct space probes: Pioneer 9, Pioneer 10 and the Jupiter Icy Moons Explorer (JUICE). These craft have become sentient and are still on the trajectories we put them on, alone in the vastness of space, except for their communications with each other and the TV show called Earth that they watch. It’s the presentation of their communications that first got my attention in \u003cem\u003e17776\u003c/em\u003e. They show us something that is nearly impossible to hold in a human brain: the vastness of time and space. The beginning of the story is delivered via messages displayed on a wall calendar between Pioneer 9 and 10, communicating across millions of miles. The frustration and impatience that comes from the endless scrolling as you wait to read the next response from one of the probes, who must wait hundreds of days to hear from one another, is just a glimmer of what it would actually be like to deal with interstellar communications – and it’s a fantastic demonstration of the endlessness of our universe.\u003c/p\u003e\n\u003cp\u003eThe piece is meant to be read on a computer, and includes videos and maps that are blocky, awful approximations of Earth – perhaps what it would look like through the eyes of ageing satellites. The spacecraft characters are where the heart lies in the story. Yes, they watch football. But they also contemplate the nature of loss in a world where nothing dies. They wrestle with the boredom that comes with immortality. They make jokes and poke fun at the humans below. They ponder what existence means, and the things that matter, even when you’re floating alone through the stars: grief, joy, friendship and the delight of mystery. Overall, \u003cem\u003e17776\u003c/em\u003e paints a surprisingly hopeful picture of the future, one that is much needed these days. It’s heart-warming and weird and funny enough that it made me laugh out loud.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/chelsea-whyte/\"\u003eChelsea Whyte\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://www.gollancz.co.uk/titles/frank-herbert/god-emperor-of-dune/9781473233805/\"\u003e\u003cstrong\u003e\u003cem\u003eGod Emperor of Dune by Frank Herbert\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eI became a fan of the \u003cem\u003eDune\u003c/em\u003e literary universe after the Denis Villeneuve films. If there are any die-hard \u003cem\u003eDune\u003c/em\u003e devotees reading this who already dislike me for this reason, then you will dislike me more when I tell you I haven’t even read the first, original \u003cem\u003eDune\u003c/em\u003e book. Why not, you might be wondering. After watching, and thoroughly enjoying, the two recent \u003cem\u003eDune\u003c/em\u003e films, I was overcome with an intense desire to know exactly what happens to the central character Paul Atreides and so I skipped \u003cem\u003eDune\u003c/em\u003e and went straight to book two, \u003cem\u003eDune Messiah, \u003c/em\u003ewhich continues the story beyond that told in those movies. After that I kept reading. Friends and family told me to stop after book three because it gets too weird. Little do they know that the weirder it gets, the more I enjoy it! \u003cem\u003eGod Emperor of Dune\u003c/em\u003e is my pick for best sci-fi book of all time for one reason. Leto II, the tyrant-cum-God-cum-emperor-cum-sandworm who rules the universe dreamt up by Herbert, is, in my opinion, one of the most ambitious characters ever written in sci-fi history. The author deserves great credit for even trying to conceptualise the thought process of a being who literally has every memory that has ever been created swirling around his head. I enjoyed \u003cem\u003eGod Emperor of Dune\u003c/em\u003e so much that I may even read the first book.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/finn-grant/\"\u003eFinn Grant\u003c/a\u003e\u003c/p\u003e\n\u003cfigure\u003e\u003cp\u003e\u003cimg width=\"1350\" height=\"900\" alt=\"A scene from Dune: Part Two which features sandworms\" sizes=\"(min-width: 1288px) 837px, (min-width: 1024px) calc(57.5vw + 55px), (min-width: 415px) calc(100vw - 40px), calc(70vw + 74px)\" data-srcset=\"https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=300 300w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=400 400w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=500 500w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=600 600w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=700 700w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=800 800w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=837 837w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=900 900w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=1003 1003w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=1100 1100w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=1200 1200w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=1300 1300w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=1400 1400w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=1500 1500w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=1600 1600w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=1674 1674w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=1700 1700w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=1800 1800w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=1900 1900w, https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg?width=2006 2006w\" data-src=\"https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg\" loading=\"lazy\" data-image-context=\"Article\" data-image-id=\"2433528\" data-caption=\"A scene from Dune: Part Two showing the sheer size of the sandworms\" data-credit=\"Alamy Stock Photo\" src=\"https://images.newscientist.com/wp-content/uploads/2024/05/30100309/dune-sandworm.jpg\"/\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eA scene from Dune: Part Two showing the sheer size of the sandworms\u003c/p\u003e\u003cp\u003eAlamy Stock Photo\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003ch2\u003e\u003ca href=\"https://www.headline.co.uk/titles/octavia-e-butler/parable-of-the-sower/9781472214775/\"\u003e\u003cstrong\u003e\u003cem\u003eParable of the Sower by Octavia E. Butler\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eWhile \u003cem\u003eParable of the Sower\u003c/em\u003e was first published more than three decades ago, it has arguably never been more relevant than today. Set in 2024, the dystopian novel follows Lauren Oya Olamina, an African American teenager living in southern California, as she navigates a world crippled by climate change, income inequality and corporate greed. She and her family reside in a gated community, protected from the anarchy raging outside. But eventually Lauren must trek northward, to a part of the country where water, paid jobs and safety are more abundant. The perilous journey is made even more dangerous by the fact that Lauren suffers from a condition that causes her to feel the pain and pleasure of others. At certain points, \u003cem\u003eParable of the Sower \u003c/em\u003ecan feel eerily prophetic rather than fictitious. This is what makes it such a compelling, albeit terrifying, read.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/grace-wade/\"\u003eGrace Wade\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://www.faber.co.uk/product/9780571249381-never-let-me-go/\"\u003e\u003cstrong\u003e\u003cem\u003eNever Let Me Go by Kazuo Ishiguro\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eTraditional science fiction – space battles, aliens, time-bending lasers, and the like – doesn’t really do it for me. But the haunting, close-to-home dystopia in Ishiguro’s \u003cem\u003eNever Let Me Go\u003c/em\u003e is an entirely different offering. Set in an alternative 1990s England, this novel is a tale of youth, love and sorrow that play out against a backdrop of major breakthroughs in biotechnology being used to selfish, awful ends. The first time I read it, I was just a couple of years older than Ruth, Kathy and Tommy, the three main characters doomed to die early as organ donors. Their emotional naivety, their uncertainty about what it means to be alive, to be human, struck a chord. Rereading the novel more than a decade later, having experienced more of the joy and sadness life has to offer, the book’s slow, savage heartbreak cuts even deeper.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/madeleine-cuff/\"\u003eMadeleine Cuff\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://www.gollancz.co.uk/titles/ursula-k-le-guin/the-dispossessed/9781857988826/\"\u003e\u003cstrong\u003e\u003cem\u003eThe Dispossessed by Ursula K. Le Guin\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eI love idea-driven sci-fi such as Cixin Liu’s incredibly imaginative body of work, but I’m going to pick  one ofLe Guin’s offerings as the greatest because she has the ideas, deep humanity and vision of what society could be. She sets her stories in entirely believable worlds and fills them with complex and relatable people. In \u003cem\u003eThe Dispossessed\u003c/em\u003e, a physicist living on the planet Anarres makes a breakthrough in fundamental and applied physics, creating the Ansible, which allows information to travel faster-than-light and so permits instant communication across interstellar distances. We learn that Anarres is one of several planets settled by humans, including Terra (Earth), which is a now an ecologically ruined world. Le Guin explores different ways humans can live and exist together, different societies, even utopias, that are possible.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/rowan-hooper/\"\u003eRowan Hooper\u003c/a\u003e\u003c/p\u003e\n    \n\u003ch2\u003e\u003ca href=\"https://vorkosigan.fandom.com/wiki/Vorkosigan_Saga\"\u003e\u003cstrong\u003e\u003cem\u003eThe Vorkosigan Saga by Lois McMaster Bujold\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eThe Hugo Award-winning Vorkosigan Saga features the space opera adventures and romantic forays of Miles Vorkosigan, the scion of an imperial lord regent who is born with a teratogenic condition involving fragile bones and an unusually short stature on a planet that is highly suspicious of anything resembling genetic abnormality. Undaunted, Miles relies on his wit and relentless nature to make his mark within the feudal Barrayaran Imperium, while also navigating the politics of rival interstellar empires as an imperial agent and mercenary leader. Along the way, he and his eclectic but exceptional constellation of family and friends – including his highly capable mother Cordelia whose own story inaugurates the series – begin to slowly transform the socially conservative Barrayaran society into something more grudgingly accepting of artificial womb technology, gender equality and diversity, and even unexpected clone siblings.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/jeremy-hsu/\"\u003eJeremy Hsu\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://www.terrypratchettbooks.com/book-series/the-long-earth/\"\u003e\u003cstrong\u003e\u003cem\u003eThe Long Earth by Terry Pratchett and Stephen Baxter\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eWhen I was asked to pick my very favourite sci-fi book, my first move was to go look at my shelf containing every one of Pratchett’s \u003cem\u003eDiscworld\u003c/em\u003e books to figure out if any of them could count as science fiction rather than fantasy. \u003cem\u003eThe Long Earth\u003c/em\u003e, which he wrote with Baxter, is the next-best thing. It has the same untamed imagination and keen social commentary as Pratchett’s other works, grounded in Baxter’s signature science-based speculation. The book (and subsequent series) is set in a sort of multiverse in which one can “step” between a recognisable future Earth and other versions of our world, some similar and some wildly different. It deals with the consequences of this vast new frontier and how humanity – and other humanoid species across the Long Earth – have adapted to its discovery, along with dangers both familiar and strange.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/leah-crane/1/\"\u003eLeah Crane\u003c/a\u003e\u003c/p\u003e\n\u003cfigure\u003e\u003cp\u003e\u003cimg width=\"1350\" height=\"900\" alt=\"New Scientist. Science news and long reads from expert journalists, covering developments in science, technology, health and the environment on the website and the magazine.\" sizes=\"(min-width: 1288px) 837px, (min-width: 1024px) calc(57.5vw + 55px), (min-width: 415px) calc(100vw - 40px), calc(70vw + 74px)\" data-srcset=\"https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=300 300w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=400 400w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=500 500w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=600 600w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=700 700w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=800 800w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=837 837w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=900 900w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=1003 1003w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=1100 1100w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=1200 1200w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=1300 1300w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=1400 1400w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=1500 1500w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=1600 1600w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=1674 1674w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=1700 1700w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=1800 1800w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=1900 1900w, https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png?width=2006 2006w\" data-src=\"https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png\" loading=\"lazy\" data-image-context=\"Article\" data-image-id=\"2433044\" data-caption=\"\" data-credit=\"\" src=\"https://images.newscientist.com/wp-content/uploads/2024/05/24141236/sei204548743.png\"/\u003e\u003c/p\u003e\u003c/figure\u003e\n\u003ch2\u003e\u003ca href=\"https://www.akashicbooks.com/catalog/an-unkindness-of-ghosts/\"\u003e\u003cstrong\u003e\u003cem\u003eAn Unkindness of Ghosts by Rivers Solomon\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eWhile I object on principle to picking single favourite books, I very much loved Solomon’s \u003cem\u003eAn Unkindness of Ghosts\u003c/em\u003e. The story takes place on the Matilda, a generation ship barrelling humanity’s remnants toward a vaguely outlined “Promised Land” after a similarly vague ecological catastrophe on Earth. It is like many other fictional ships for multigenerational voyages: huge, self-contained, and moving fast toward a destination its current inhabitants don’t expect to see. But it is also a story about the worst of humanity. The Matilda is racially segregated, and our protagonist Aster lives, like the other Black passengers, on the lowest and poorest-resourced decks. She is autistic, genderqueer, and traumatised by the enslavement-like conditions under which she lives. And throughout the course of the book she must unravel a puzzle that connects the decades-ago death of her mother, Lune, to the eventual fate of the entire ship. \u003cem\u003eAn Unkindness of Ghosts\u003c/em\u003e isn’t an easy read, emotionally. But it’s a riveting story, told from a singular point of view, with characters who challenge us to think bigger.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/christie-taylor/\"\u003eChristie Taylor\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://www.panmacmillan.com/authors/china-mieville/the-city-the-city/9780330534192\"\u003e\u003cstrong\u003e\u003cem\u003eThe City \u0026amp; the City by China Miéville\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eThis noir thriller from Miéville is closer to crime fiction than sci-fi, but its setting – in two rival cities that occupy the same space – feels reminiscent of the quantum realm. Citizens of the “crosshatched” Besźel and Ul Qoma are banned from acknowledging each other’s existence, while those who “breach” are spirited away, never to be seen again. But when a woman is found murdered in Besźel, Inspector Tyador Borlú must team up with his Ul Qoman opposite number to crack the case. I loved this book the minute I heard its premise, which challenged my visual imagination like few novels have since. The way the characters must “unsee” people who are right before their eyes is such a revealing way to discuss how we are encouraged to view those on the fringes of society.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/bethan-ackerley/\"\u003eBethan Ackerley\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://www.penguinrandomhouse.com/series/ZMS/mars-trilogy/\"\u003e\u003cstrong\u003e\u003cem\u003eRed Mars by Kim Stanley Robinson\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eIt’s 2026 (!) and 100 colonists are setting off from Earth to Mars to colonise the Red Planet. “It loomed before them in all its immense potential: \u003cem\u003etabula \u003c/em\u003erasa, blank slate. A blank red slate. Anything was possible, anything could happen.” Once there, though, different factions have different ideas about how this new life should look – should Mars be terraformed as much as possible, or should humanity take a little more time to think before it bends an entire planet to its will? Things on Earth, meanwhile, are turning pear-shaped as resources dwindle while the population booms. This is a story of adventure and derring-do 225 million kilometres from home, but it is also a story of politics and science and people that is utterly gripping and fascinating, with the bonus of marvelling at the beauty and wonder and possibilities of life on another planet. It is a huge book – more than 650 pages – but I flew through it on my first reading and went on to bury myself in the sequels.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/alison-flood/\"\u003eAlison Flood\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://www.penguin.co.uk/books/360655/slaughterhouse-5-by-vonnegut-kurt/9781784879693\"\u003e\u003cstrong\u003e\u003cem\u003eSlaughterhouse-Five by Kurt Vonnegut\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eBilly Pilgrim continuously gets “unstuck in time” thanks to the intervention of a Tralfamadorian flying saucer in Vonnegut’s breakthrough, absurdist, ferociously anti-war novel. Vonnegut, who served with the US Army, was  held in Dresden, Germany, during the second world war after being taken prisoner. There he witnessed the devastating Allied fire-bombing of the city, similar to the protagonist in \u003cem\u003eSlaughterhouse-Five\u003c/em\u003e. The post-war psychological trauma and piercing black humour is woven with a narrative that darts back and forth in time, as does Billy. It is often disorientating, yet easily absorbed thanks to Vonnegut’s deeply satirical and straightforward linguistic style, along with his conversational tone. It makes for a potent mix. What has always happened, always will happen in this most poignant of reads; and one that is sadly as relevant today as when it was released in the 1960s. So it goes.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/tim-boddy/\"\u003eTim Boddy\u003c/a\u003e\u003c/p\u003e\n\u003ch2\u003e\u003ca href=\"https://dmgtcloud-my.sharepoint.com/personal/alison_flood_newscientist_com/Documents/The%20Murderbot%20books%20by%20Martha%20Wells\"\u003e\u003cstrong\u003e\u003cem\u003eThe Murderbot Diaries by Martha Wells\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/article/2432953-read-an-extract-from-all-systems-red-by-martha-wells/\"\u003eMurderbot\u003c/a\u003e doesn’t actually want to kill people. After all, this machine-organic hybrid is a Security Unit designed to protect human clients. Sure, it has hacked the governor module that enforces obedience to humans. Sure, it frequently tears apart anything that threatens its teammates. And fine, it is the one that named itself “Murderbot”. I love the narration in this series of books: our protagonist is snarky and grouchy, socially awkward but eminently capable. It can strategise expertly, hack almost any system, fight brutally and even murder when that is what it takes to protect the often-irritating people and bots that it, annoyingly, sort of cares about. Beyond the tentative friendships it forms against its will, Murderbot is on a quest for full personhood and independence – even if what it does with that freedom is binge-watch as much media as is (in)humanly possible.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/sophie-bushwick/\"\u003eSophie Bushwick\u003c/a\u003e\u003c/p\u003e\n    \n\u003ch2\u003e\u003ca href=\"https://gutenberg.org/files/61963/61963-h/61963-h.htm\"\u003e\u003cstrong\u003e\u003cem\u003eWe by Yevgeny Zamyatin\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cem\u003eWe\u003c/em\u003e is a searing, prescient book that you have to take a step back from to truly appreciate. Zamyatin probably finished it, writing in his native Russian, in 1921. But because the tale’s dystopian nature, railing against a totalitarian OneState society, would have been taken as criticism of the Russian regime, it was published in other countries at first and didn’t get the reach it deserved until a corrected version was published in Russia in 1988 and then translated into English a few years later. Despite that, the effects of its earlier versions on dystopian sci-fi have been huge. George Orwell’s \u003cem\u003eNineteen Eighty-Four\u003c/em\u003e (1949) was massively influenced by \u003cem\u003eWe\u003c/em\u003e and you can see its imprint in the sexual politics at play in Margaret Atwood’s \u003cem\u003eThe Handmaid’s Tale\u003c/em\u003e (1985), for example.\u003c/p\u003e\n\u003cp\u003eThe story is set in the 26\u003csup\u003eth\u003c/sup\u003e century in a city built in straight lines and ruled by a Benefactor, where everyone has a number not a name. Every hour of people’s lives is dictated, including two daily hour-long slots to be alone with your thoughts. On Sex Day, you hand in your pink ticket and meet up with your pre-allocated, rotating partner. Residents ostensibly have happiness at the cost of freedom. In this straitened – and straightened – environment, a mathematician known as D-503 is unsettled when he is hit by the curveball of I-333, a secretive and intelligent political activist he doesn’t have a pink ticket for, and he starts to question everything. Some of the lines in \u003cem\u003eWe\u003c/em\u003e are naturally of their time – as well as potentially being suited to the 26\u003csup\u003eth\u003c/sup\u003e century – but regardless, this book is an enlightening, surprising and unsettling read, packed full of clever, quotable phrases.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.newscientist.com/author/chris-simms/\"\u003eChris Simms\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eJoin the \u003cem\u003eNew Scientist\u003c/em\u003e book club. Love reading? Come and join our friendly group of fellow book lovers. Every six weeks, we delve into an exciting new title, with members given free access to extracts from our books, articles from our authors and video interviews. \u003ca href=\"https://www.newscientist.com/sign-up/bookclub/\"\u003eSign up here.\u003c/a\u003e\u003c/p\u003e\n\u003cdiv\u003e\n        \u003ch3\u003eThe art and science of writing science fiction\u003c/h3\u003e\n        \u003cp\u003eTake your science fiction writing to a new dimension! Join New Scientist Culture Editor Alison Flood, and former New Scientist Editor Emily Wilson, for an immersive writing weekend.\u003c/p\u003e\n                    \n            \u003c/div\u003e\n\n                    \u003csection\u003e\u003cp\u003eTopics:\u003c/p\u003e\u003c/section\u003e                \u003c/section\u003e\n            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "27 min read",
  "publishedTime": "2024-05-30T15:00:33+01:00",
  "modifiedTime": null
}
