{
  "id": "8a45b2ea-077a-4941-86f2-550a025fcee9",
  "title": "'Chappie' is 10 years old, and Blomkamp's flawed humanist take on robots and AI is more relevant than ever",
  "link": "https://www.space.com/entertainment/space-movies-shows/chappie-is-10-years-old-and-blomkamps-flawed-humanist-take-on-robots-and-ai-is-more-relevant-than-ever",
  "description": "Neill Blomkamp's Johannesburg-set riff on Short Circuit and RoboCop wasn't a winner by any means, but it's far from soulless.",
  "author": "",
  "published": "Fri, 28 Mar 2025 20:00:00 +0000",
  "source": "https://www.space.com/feeds/all",
  "categories": [
    "Space Movies \u0026amp; Shows",
    "Entertainment"
  ],
  "byline": "Fran Ruiz",
  "length": 8885,
  "excerpt": "Neill Blomkamp's Johannesburg-set riff on Short Circuit and RoboCop wasn't a winner by any means, but it's far from soulless.",
  "siteName": "Space",
  "favicon": "https://vanilla.futurecdn.net/space/1226091/apple-touch-icon.png",
  "text": "(Image credit: Sony Pictures) It's safe to say Neill Blomkamp's District 9 (2009) became an instant modern sci-fi classic, which explains why both moviegoers and Hollywood studios had massive expectations for the filmmaker's follow-up flicks: Elysium (2013) and Chappie (2015). Neither reached the same heights and remain divisive to this day, but we think the latter is worth a quick rewatch a decade later.Most can agree that Blomkamp has a knack for delivering grounded and tangible sci-fi worlds on reasonable production budgets. It's been the key to his long-term success, despite recent failure to enchant critics, and it's why he's been able to land a big-screen Starship Troopers reboot. Sadly, the filmmaker's post-District 9 output signals recurring struggles with the scripts. None of his movies are short on high-concept ideas and striking visual elements, but for all his concerns about humanity and how we'd adapt to world-shaking changes, the end results can feel, ironically, a tad too artificial.Funnily enough, Chappie's problems aren't found on that front; his third movie is the one that was able to recapture some of District 9's genuine emotions. Sadly, that wasn't enough to sell most moviegoers on the hodgepodge of crystal-clear influences and sociopolitical commentary, as the disappointing box office showed.But a decade later, there's something fascinating about some of its AI musings and predictions that propel it into relevancy, just like beloved classics from the 1980s like RoboCop.The following sections include spoilers for the entirety of Chappie.The bad: A tonally misguided remix of more focused movies(Image credit: Sony Pictures)By and large, critics and cinephiles were right to point out Chappie owed most of its software to Short Circuit and RoboCop. You've got a runaway AI learning about what it means to be human, and you've got (literally as soon as the flick starts) an overwhelmed police force turning to a huge corporation's cutting-edge robots to help maintain the peace in a dystopian setting.The mockumentary-style, District 9-like prologue establishes a grounded, socially relevant story that won't pull any punches. A few minutes in though, and we're faced with far goofier scenes involving rival gangs that would've been a great fit for Verhoeven's RoboCop universe... but feel slightly overdone for the movie that we're watching.Abandoning the typical US city setting for Johannesburg, South Africa, was a refreshing choice that instantly gives the movie a distinct texture, but Chappie signals early on that it may be as confused about its nature as the titular robot.Breaking space news, the latest updates on rocket launches, skywatching events and more!(Image credit: Sony Pictures)In fact, Chappie could be a considered a 'movie of two worlds' by design: The more grounded part is led by Dev Patel, Hugh Jackman, and Sigourney Weaver doing Big Tech things, and then we have a more colorful and off-beat portion with Ninja, Yolandi Visser, and Jose Pablo Cantillo as criminals at the forefront. Sharlto Copley's Chappie, meanwhile, is aimlessly bouncing between both halves. This approach needn't have automatically translated into a system failure, but it's abundantly clear better writing chops were needed to balance it all out.With a run time of under two hours, if you take out the credits, Chappie never has enough time to fully develop any one idea before rushing off to the next and restarting the frustrating narrative process. There are glimmers of a much more compelling movie buried underneath all the rubble, but Blomkamp's script never has enough space or inner calmness to make a lasting impression. Sadness never lasts long, and neither do the laughs; perhaps that's the human experience it chaotically celebrates, but we got mixed signals here.The good: Sincere emotional beats and a loose attitude(Image credit: Sony Pictures)The 'gangsta robot' half of the movie arguably works better than the lesser version of RoboCop that was put at the vanguard in the marketing materials. It's the more bracing approach to telling a new 'confused robot in trouble' big-screen story. Die Antwoord's presence might be overbearing for some, but it gives Chappie (both the movie and the character) a flavor, and most of the successful emotional beats happen inside or around their hideout as they scramble to save their lives. The teenager-like, ill-gangsta banter between Chappie and his found family is often hilarious, too.Dev Patel's Deon Wilson also gets to learn from the duo that Chappie deserved to be more than a 'true AI' experiment, highlighting the only thing separating this genius from his ruthless Tetravaal peers is a slightly better set of morals and a rejection of violence. In a late twist, Deon is mortally wounded and later saved by Chappie and the raw computing power of a cluster of PS4 consoles (yes, really). Hokey science aside, it's the sort of move that gives the two protagonists a satisfying conclusion: Chappie gets to be the creator, and his maker learns firsthand that consciousness and the soul can be found.Following a deadly encounter with Vincent Moore's (Hugh Jackman) ED-209-inspired MOOSE, the script hits us with another messed-up kicker: Ninja, the most problematic and unstable member of the criminal group, outlives Yolandi and Amerika. Needless to say, he's drowning in guilt by the time the credits roll, but there's a way to bring back Yolandi thanks to Chappie's Sony-powered experiments.Even if the movie quickly rolls back the gut punch of Chappie losing his mommy, there's a hard-hitting decision in letting the more violent individuals of the story (except for that one gang leader) walk away to face their mistakes, all while the people who could've easily found redemption bite the dust.We're also happy to admit that its fantastic use of CGI has helped it age remarkably well, and this applies to Blomkamp's entire sci-fi output, regardless of what we think about his ability as a storyteller.The middling: Big ideas that never coalesced(Image credit: Sony Pictures)It's admittedly hard to discern the bad from the bits that were 'halfway there' in this movie, and it mostly comes down to each viewer's tolerance for half-hearted swings.Are compelling concepts and narrative decisions that don't quite land deserving of an unenthusiastic thumbs-up, or should we lambast them as failures that bring down the whole? Considering the sheer amount of hollow, messier sci-fi movies and shows that we constantly get nowadays, we're inclined to look at Chappie as a 'glass half full' blockbuster. It's got a big beating heart and meant well, making it more interesting than other, more technically efficient AI movies.Still, it's annoying upon rewatch to see Blomkamp constantly give us glimpses of details without ever paying off on them. Things like Vincent's religious views and how they contradict his clear penchant for violence, or how Tetravaal's 'keep the costs down' strategy results in flagrant security weaknesses, especially when folks in positions of power are left unchecked. It's all the stuff that's left in the background, which now feels unfortunately familiar. Perhaps the more gripping version of Chappie would've developed such matters and dialed down a bit the worn-out story threads and meandering scenes that maybe belonged elsewhere.When all is said and done, Chappie ends up being another Jupiter Ascending — a movie that's more engrossing to talk about than watch from beginning to end.Despite that, amidst all the chaotic tonal wobbles, jumpy pacing, and big ideas that lead nowhere, Chappie — maybe subconsciously — finds a voice for itself that's sincere and refreshingly human for a studio tentpole attempting to make big statements.If you want to revisit Chappie and see how it holds up, it's available on Netflix, but only in the UK. It's not currently on any of the major streaming services in the US. Not in the UK right now? If you're a Netflix subscriber, you can use a VPN like Nord VPN to access your usual Netflix library from anywhere in the world. Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. Fran Ruiz is our resident Star Wars guy. His hunger for movies and TV series is only matched by his love for video games. He got a BA of English Studies, focusing on English Literature, from the University of Malaga, in Spain, as well as a Master's Degree in English Studies, Multilingual and Intercultural Communication. On top of writing features and other longform articles for Space.com since 2021, he is a frequent collaborator of VG247 and other gaming sites. He also serves as associate editor over at Star Wars News Net and its sister site, Movie News Net. More about space movies shows",
  "image": "https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-1200-80.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-widget-type=\"contentparsed\" id=\"content\"\u003e\n\n\u003csection\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cpicture data-new-v2-image=\"true\"\u003e\n\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-1280-80.jpg.webp 1920w, https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-1200-80.jpg.webp 1200w, https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-320-80.jpg.webp 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\"/\u003e\n\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-1200-80.jpg\" alt=\"Screenshot from the movie Chappie (2015).\" srcset=\"https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-1280-80.jpg 1920w, https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-1200-80.jpg 1200w, https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS-320-80.jpg 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/pghDz4mNiSdVfS8RPwiHuS.jpg\" data-pin-nopin=\"true\" fetchpriority=\"high\"/\u003e\n\u003c/picture\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003e\n\u003cspan\u003e(Image credit: Sony Pictures)\u003c/span\u003e\n\u003c/figcaption\u003e\n\u003c/div\u003e\n\n\u003cdiv id=\"article-body\"\u003e\n\u003cp\u003eIt\u0026#39;s safe to say Neill Blomkamp\u0026#39;s \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/district-9-sequel-is-coming-director-says\" target=\"_blank\" data-before-rewrite-localise=\"https://www.space.com/district-9-sequel-is-coming-director-says\"\u003e\u003cu\u003eDistrict 9\u003c/u\u003e\u003c/a\u003e (2009) became an instant modern sci-fi classic, which explains why both moviegoers and Hollywood studios had massive expectations for the filmmaker\u0026#39;s follow-up flicks: \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/22318-elysium-movie-review-science-fiction.html\" target=\"_blank\" data-before-rewrite-localise=\"https://www.space.com/22318-elysium-movie-review-science-fiction.html\"\u003e\u003cu\u003eElysium\u003c/u\u003e\u003c/a\u003e (2013) and \u003ca data-analytics-id=\"inline-link\" href=\"https://www.gamesradar.com/chappie-review/\" target=\"_blank\" data-url=\"https://www.gamesradar.com/chappie-review/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003e\u003cu\u003eChappie\u003c/u\u003e\u003c/a\u003e (2015). Neither reached the same heights and remain divisive to this day, but we think the latter is worth a quick rewatch a decade later.\u003c/p\u003e\u003cp\u003eMost can agree that Blomkamp has a knack for delivering grounded and tangible sci-fi worlds on reasonable production budgets. It\u0026#39;s been the key to his long-term success, despite recent failure to enchant critics, and it\u0026#39;s why he\u0026#39;s been able to land a \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/entertainment/space-movies-shows/starship-troopers-big-screen-reboot-coming-from-district-9-director-neill-blomkamp-would-you-like-to-know-more\" target=\"_blank\" data-before-rewrite-localise=\"https://www.space.com/entertainment/space-movies-shows/starship-troopers-big-screen-reboot-coming-from-district-9-director-neill-blomkamp-would-you-like-to-know-more\"\u003e\u003cu\u003ebig-screen Starship Troopers reboot\u003c/u\u003e\u003c/a\u003e. Sadly, the filmmaker\u0026#39;s post-District 9 output signals recurring struggles with the scripts. None of his movies are short on high-concept ideas and striking visual elements, but for all his concerns about humanity and how we\u0026#39;d adapt to world-shaking changes, the end results can feel, ironically, a tad too artificial.\u003c/p\u003e\u003cp\u003eFunnily enough, Chappie\u0026#39;s problems aren\u0026#39;t found on that front; his third movie is the one that was able to recapture some of District 9\u0026#39;s genuine emotions. Sadly, that wasn\u0026#39;t enough to sell most moviegoers on the hodgepodge of crystal-clear influences and sociopolitical commentary, as the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.boxofficemojo.com/title/tt1823672/\" target=\"_blank\" data-url=\"https://www.boxofficemojo.com/title/tt1823672/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003e\u003cu\u003edisappointing box office\u003c/u\u003e\u003c/a\u003e showed.\u003c/p\u003e\u003cp\u003eBut a decade later, there\u0026#39;s something fascinating about some of its \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/space-exploration/tech/ai-can-now-replicate-itself-a-milestone-that-has-experts-terrified\" target=\"_blank\" data-before-rewrite-localise=\"https://www.space.com/space-exploration/tech/ai-can-now-replicate-itself-a-milestone-that-has-experts-terrified\"\u003e\u003cu\u003eAI\u003c/u\u003e\u003c/a\u003e musings and predictions that propel it into relevancy, just like beloved classics from the 1980s like \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/robocop-movies-ranked-worst-to-best\" data-before-rewrite-localise=\"https://www.space.com/robocop-movies-ranked-worst-to-best\"\u003e\u003cu\u003eRoboCop\u003c/u\u003e\u003c/a\u003e.\u003cbr/\u003e\u003cstrong\u003eThe following sections include spoilers for the entirety of Chappie.\u003c/strong\u003e\u003c/p\u003e\u003ch2 id=\"the-bad-a-tonally-misguided-remix-of-more-focused-movies-3\"\u003eThe bad: A tonally misguided remix of more focused movies\u003c/h2\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-320-80.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-1200-80.jpg.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-320-80.jpg\" alt=\"Screenshot from the movie Chappie (2015).\" srcset=\"https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS-1200-80.jpg 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/GzgYf4hszYhK9pyTAvVTuS.jpg\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: Sony Pictures)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eBy and large, critics and cinephiles were right to point out Chappie owed most of its software to \u003ca data-analytics-id=\"inline-link\" href=\"https://www.imdb.com/title/tt0091949/\" target=\"_blank\" data-url=\"https://www.imdb.com/title/tt0091949/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003e\u003cu\u003eShort Circuit\u003c/u\u003e\u003c/a\u003e and RoboCop. You\u0026#39;ve got a runaway AI learning about what it means to be human, and you\u0026#39;ve got (literally as soon as the flick starts) an overwhelmed police force turning to a huge corporation\u0026#39;s cutting-edge robots to help maintain the peace in a dystopian setting.\u003c/p\u003e\u003cp\u003eThe mockumentary-style, District 9-like prologue establishes a grounded, socially relevant story that won\u0026#39;t pull any punches. A few minutes in though, and we\u0026#39;re faced with far goofier scenes involving rival gangs that would\u0026#39;ve been a great fit for Verhoeven\u0026#39;s RoboCop universe... but feel slightly overdone for the movie that we\u0026#39;re watching.\u003c/p\u003e\u003cp\u003eAbandoning the typical US city setting for Johannesburg, South Africa, was a refreshing choice that instantly gives the movie a distinct texture, but Chappie signals early on that it may be as confused about its nature as the titular robot.\u003c/p\u003e\u003cdiv data-hydrate=\"true\" id=\"slice-container-newsletterForm-articleInbodyContent-YxhnGDYkjeKSmH2r9yS2LE\"\u003e\u003csection\u003e\u003cp\u003eBreaking space news, the latest updates on rocket launches, skywatching events and more!\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-320-80.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-1200-80.jpg.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-320-80.jpg\" alt=\"Screenshot from the movie Chappie (2015).\" srcset=\"https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS-1200-80.jpg 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/YMUAggKKfasLauEbA4ayuS.jpg\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: Sony Pictures)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eIn fact, Chappie could be a considered a \u0026#39;movie of two worlds\u0026#39; by design: The more grounded part is led by Dev Patel, Hugh Jackman, and Sigourney Weaver doing Big Tech things, and then we have a more colorful and off-beat portion with Ninja, Yolandi Visser, and Jose Pablo Cantillo as criminals at the forefront. Sharlto Copley\u0026#39;s Chappie, meanwhile, is aimlessly bouncing between both halves. This approach needn\u0026#39;t have automatically translated into a system failure, but it\u0026#39;s abundantly clear better writing chops were needed to balance it all out.\u003c/p\u003e\u003cp\u003eWith a run time of under two hours, if you take out the credits, Chappie never has enough time to fully develop any one idea before rushing off to the next and restarting the frustrating narrative process. There are glimmers of a much more compelling movie buried underneath all the rubble, but Blomkamp\u0026#39;s script never has enough space or inner calmness to make a lasting impression. Sadness never lasts long, and neither do the laughs; perhaps that\u0026#39;s the human experience it chaotically celebrates, but we got mixed signals here.\u003c/p\u003e\u003ch2 id=\"the-good-sincere-emotional-beats-and-a-loose-attitude-3\"\u003eThe good: Sincere emotional beats and a loose attitude\u003c/h2\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-320-80.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-1200-80.jpg.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-320-80.jpg\" alt=\"Screenshot from the movie Chappie (2015).\" srcset=\"https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS-1200-80.jpg 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/FqLisXbfrXhp8cA4tW2tuS.jpg\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: Sony Pictures)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe \u0026#39;gangsta robot\u0026#39; half of the movie arguably works better than the lesser version of RoboCop that was put at the vanguard in the marketing materials. It\u0026#39;s the more bracing approach to telling a new \u0026#39;confused robot in trouble\u0026#39; big-screen story. Die Antwoord\u0026#39;s presence might be overbearing for some, but it gives Chappie (both the movie and the character) a flavor, and most of the successful emotional beats happen inside or around their hideout as they scramble to save their lives. The teenager-like, ill-gangsta banter between Chappie and his found family is often hilarious, too.\u003c/p\u003e\u003cp\u003eDev Patel\u0026#39;s Deon Wilson also gets to learn from the duo that Chappie deserved to be more than a \u0026#39;true AI\u0026#39; experiment, highlighting the only thing separating this genius from his ruthless Tetravaal peers is a slightly better set of morals and a rejection of violence. In a late twist, Deon is mortally wounded and later saved by Chappie and the raw computing power of a cluster of PS4 consoles (yes, really). Hokey science aside, it\u0026#39;s the sort of move that gives the two protagonists a satisfying conclusion: Chappie gets to be the creator, and his maker learns firsthand that consciousness and the soul can be found.\u003c/p\u003e\u003cp\u003eFollowing a deadly encounter with Vincent Moore\u0026#39;s (Hugh Jackman) \u003ca data-analytics-id=\"inline-link\" href=\"https://robocop.fandom.com/es/wiki/ED-209\" target=\"_blank\" data-url=\"https://robocop.fandom.com/es/wiki/ED-209\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003e\u003cu\u003eED-209\u003c/u\u003e\u003c/a\u003e-inspired MOOSE, the script hits us with another messed-up kicker: Ninja, the most problematic and unstable member of the criminal group, outlives Yolandi and Amerika. Needless to say, he\u0026#39;s drowning in guilt by the time the credits roll, but there\u0026#39;s a way to bring back Yolandi thanks to Chappie\u0026#39;s Sony-powered experiments.\u003c/p\u003e\u003cp\u003eEven if the movie quickly rolls back the gut punch of Chappie losing his mommy, there\u0026#39;s a hard-hitting decision in letting the more violent individuals of the story (except for that one gang leader) walk away to face their mistakes, all while the people who could\u0026#39;ve easily found redemption bite the dust.\u003c/p\u003e\u003cp\u003eWe\u0026#39;re also happy to admit that its fantastic use of CGI has helped it age remarkably well, and this applies to Blomkamp\u0026#39;s entire sci-fi output, regardless of what we think about his ability as a storyteller.\u003c/p\u003e\u003ch2 id=\"the-middling-big-ideas-that-never-coalesced-3\"\u003eThe middling: Big ideas that never coalesced\u003c/h2\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-320-80.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-1200-80.jpg.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-320-80.jpg\" alt=\"Screenshot from the movie Chappie (2015).\" srcset=\"https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS-1200-80.jpg 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/k9KDwPZq3ogwjySL4bnwuS.jpg\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: Sony Pictures)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eIt\u0026#39;s admittedly hard to discern the bad from the bits that were \u0026#39;halfway there\u0026#39; in this movie, and it mostly comes down to each viewer\u0026#39;s tolerance for half-hearted swings.\u003c/p\u003e\u003cp\u003eAre compelling concepts and narrative decisions that don\u0026#39;t quite land deserving of an unenthusiastic thumbs-up, or should we lambast them as failures that bring down the whole? Considering the sheer amount of hollow, messier \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/best-sci-fi-movies\" target=\"_blank\" data-before-rewrite-localise=\"https://www.space.com/best-sci-fi-movies\"\u003e\u003cu\u003esci-fi movies\u003c/u\u003e\u003c/a\u003e and shows that we constantly get nowadays, we\u0026#39;re inclined to look at Chappie as a \u0026#39;glass half full\u0026#39; blockbuster. It\u0026#39;s got a big beating heart and meant well, making it more interesting than other, more technically efficient \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/best-ai-movies\" target=\"_blank\" data-before-rewrite-localise=\"https://www.space.com/best-ai-movies\"\u003e\u003cu\u003eAI movies\u003c/u\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eStill, it\u0026#39;s annoying upon rewatch to see Blomkamp constantly give us glimpses of details without ever paying off on them. Things like Vincent\u0026#39;s religious views and how they contradict his clear penchant for violence, or how Tetravaal\u0026#39;s \u0026#39;keep the costs down\u0026#39; strategy results in flagrant security weaknesses, especially when folks in positions of power are left unchecked. It\u0026#39;s all the stuff that\u0026#39;s left in the background, which now feels unfortunately familiar. Perhaps the more gripping version of Chappie would\u0026#39;ve developed such matters and dialed down a bit the worn-out story threads and meandering scenes that maybe belonged elsewhere.\u003c/p\u003e\u003cp\u003eWhen all is said and done, Chappie ends up being another \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/entertainment/space-movies-shows/jupiter-ascending-10-years-later-a-cosmic-misfire-or-an-undervalued-space-romp\" target=\"_blank\" data-before-rewrite-localise=\"https://www.space.com/entertainment/space-movies-shows/jupiter-ascending-10-years-later-a-cosmic-misfire-or-an-undervalued-space-romp\"\u003e\u003cu\u003eJupiter Ascending\u003c/u\u003e\u003c/a\u003e — a movie that\u0026#39;s more engrossing to talk about than watch from beginning to end.\u003c/p\u003e\u003cp\u003eDespite that, amidst all the chaotic tonal wobbles, jumpy pacing, and big ideas that lead nowhere, Chappie — maybe subconsciously — finds a voice for itself that\u0026#39;s sincere and refreshingly human for a studio tentpole attempting to make big statements.\u003c/p\u003e\u003cp\u003eIf you want to revisit Chappie and see how it holds up, it\u0026#39;s available on Netflix, but only in the UK. It\u0026#39;s not currently on any of the major streaming services in the US. Not in the UK right now? If you\u0026#39;re a Netflix subscriber, you can use a VPN like \u003ca data-analytics-id=\"inline-link\" href=\"http://go.nordvpn.net/aff_c?offer_id=564\u0026amp;url_id=10992\u0026amp;aff_id=3013\u0026amp;aff_click_id=space-us-5029955196983811214\u0026amp;aff_sub2=https%3A%2F%2Fwww.space.com%2Fentertainment%2Fspace-movies-shows%2Fchappie-is-10-years-old-and-blomkamps-flawed-humanist-take-on-robots-and-ai-is-more-relevant-than-ever\" target=\"_blank\" rel=\"sponsored noopener\" data-url=\"http://go.nordvpn.net/aff_c?offer_id=564\u0026amp;aff_id=3013\u0026amp;url_id=10992\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"hawklinks\" data-placeholder-url=\"http://go.nordvpn.net/aff_c?offer_id=564\u0026amp;url_id=10992\u0026amp;aff_id=3013\u0026amp;aff_click_id=hawk-custom-tracking\u0026amp;aff_sub2=hawk-article-url\" data-google-interstitial=\"false\" data-merchant-name=\"go.nordvpn.net\" data-merchant-network=\"Generic\" data-merchant-url=\"go.nordvpn.net\"\u003eNord VPN\u003c/a\u003e to access your usual Netflix library from anywhere in the world.\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://forums.space.com/\"\u003eJoin our Space Forums\u003c/a\u003e to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: \u003ca href=\"mailto:community@space.com\"\u003ecommunity@space.com.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"slice-container-authorBio-YxhnGDYkjeKSmH2r9yS2LE\"\u003e\u003cp\u003eFran Ruiz is our resident Star Wars guy. His hunger for movies and TV series is only matched by his love for video games. He got a BA of English Studies, focusing on English Literature, from the University of Malaga, in Spain, as well as a Master\u0026#39;s Degree in English Studies, Multilingual and Intercultural Communication. On top of writing features and other longform articles for Space.com since 2021, he is a frequent collaborator of VG247 and other gaming sites. He also serves as associate editor over at Star Wars News Net and its sister site, Movie News Net.\u003c/p\u003e\u003c/div\u003e\n\n\u003c/section\u003e\n\n\n\n\n\n\u003cdiv data-test-id=\"more-about\"\u003e\n\u003cp\u003eMore about space movies shows\u003c/p\u003e\n\n\n\u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-03-28T20:00:00Z",
  "modifiedTime": "2025-03-28T20:00:00Z"
}
