{
  "id": "bd7f8ce8-ac53-4124-b5a5-e1a47f2e20a8",
  "title": "Next-Generation Water Satellite Maps Seafloor From Space",
  "link": "https://www.nasa.gov/missions/swot/next-generation-water-satellite-maps-seafloor-from-space/",
  "description": "More accurate maps based on data from the SWOT mission can improve underwater navigation and result in greater knowledge of how heat and life move around the world’s ocean. There are better maps of the Moon’s surface than of the bottom of Earth’s ocean. Researchers have been working for decades to change that. As part […]",
  "author": "Anthony Greicius",
  "published": "Wed, 19 Mar 2025 21:37:20 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "SWOT (Surface Water and Ocean Topography)",
    "Earth",
    "Jet Propulsion Laboratory",
    "Oceans"
  ],
  "byline": "Anthony Greicius",
  "length": 6809,
  "excerpt": "More accurate maps based on data from the SWOT mission can improve underwater navigation and result in greater knowledge of how heat and life move around the",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "More accurate maps based on data from the SWOT mission can improve underwater navigation and result in greater knowledge of how heat and life move around the world’s ocean. There are better maps of the Moon’s surface than of the bottom of Earth’s ocean. Researchers have been working for decades to change that. As part of the ongoing effort, a NASA-supported team recently published one of the most detailed maps yet of the ocean floor, using data from the SWOT (Surface Water and Ocean Topography) satellite, a collaboration between NASA and the French space agency CNES (Centre National d’Études Spatiales). Ships outfitted with sonar instruments can make direct, incredibly detailed measurements of the ocean floor. But to date, only about 25% of it has been surveyed in this way. To produce a global picture of the seafloor, researchers have relied on satellite data. This animation shows seafloor features derived from SWOT data on regions off Mexico, South America, and the Antarctic Peninsula. Purple denotes regions that are lower relative to higher areas like seamounts, depicted in green. Eötvös is the unit of measure for the gravity-based data used to create these maps.NASA’s Scientific Visualization Studio More accurate maps of the ocean floor are crucial for a range of seafaring activities, including navigation and laying underwater communications cables. “Seafloor mapping is key in both established and emerging economic opportunities, including rare-mineral seabed mining, optimizing shipping routes, hazard detection, and seabed warfare operations,” said Nadya Vinogradova Shiffer, head of physical oceanography programs at NASA Headquarters in Washington. Accurate seafloor maps are also important for an improved understanding of deep-sea currents and tides, which affect life in the abyss, as well as geologic processes like plate tectonics. Underwater mountains called seamounts and other ocean floor features like their smaller cousins, abyssal hills, influence the movement of heat and nutrients in the deep sea and can attract life. The effects of these physical features can even be felt at the surface by the influence they exert on ecosystems that human communities depend on. Mapping the seafloor isn’t the SWOT mission’s primary purpose. Launched in December 2022, the satellite measures the height of water on nearly all of Earth’s surface, including the ocean, lakes, reservoirs, and rivers. Researchers can use these differences in height to create a kind of topographic map of the surface of fresh- and seawater. This data can then be used for tasks such as assessing changes in sea ice or tracking how floods progress down a river. “The SWOT satellite was a huge jump in our ability to map the seafloor,” said David Sandwell, a geophysicist at Scripps Institution of Oceanography in La Jolla, California. He’s used satellite data to chart the bottom of the ocean since the 1990s and was one of the researchers responsible for the SWOT-based seafloor map, which was published in the journal Science in December 2024. The study authors relied on the fact that because geologic features like seamounts and abyssal hills have more mass than their surroundings, they exert a slightly stronger gravitational pull that creates small, measurable bumps in the sea surface above them. These subtle gravity signatures help researchers predict the kind of seafloor feature that produced them. Through repeated observations — SWOT covers about 90% of the globe every 21 days — the satellite is sensitive enough to pick up these minute differences, with centimeter-level accuracy, in sea surface height caused by the features below. Sandwell and his colleagues used a year’s worth of SWOT data to focus on seamounts, abyssal hills, and underwater continental margins, where continental crust meets oceanic crust. Previous ocean-observing satellites have detected massive versions of these bottom features, such as seamounts over roughly 3,300 feet (1 kilometer) tall. The SWOT satellite can pick up seamounts less than half that height, potentially increasing the number of known seamounts from 44,000 to 100,000. These underwater mountains stick up into the water, influencing deep sea currents. This can concentrate nutrients along their slopes, attracting organisms and creating oases on what would otherwise be barren patches of seafloor. The improved view from SWOT also gives researchers more insight into the geologic history of the planet. “Abyssal hills are the most abundant landform on Earth, covering about 70% of the ocean floor,” said Yao Yu, an oceanographer at Scripps Institution of Oceanography and lead author on the paper. “These hills are only a few kilometers wide, which makes them hard to observe from space. We were surprised that SWOT could see them so well.” Abyssal hills form in parallel bands, like the ridges on a washboard, where tectonic plates spread apart. The orientation and extent of the bands can reveal how tectonic plates have moved over time. Abyssal hills also interact with tides and deep ocean currents in ways that researchers don’t fully understand yet. The researchers have extracted nearly all the information on seafloor features they expected to find in the SWOT measurements. Now they’re focusing on refining their picture of the ocean floor by calculating the depth of the features they see. The work complements an effort by the international scientific community to map the entire seafloor using ship-based sonar by 2030. “We won’t get the full ship-based mapping done by then,” said Sandwell. “But SWOT will help us fill it in, getting us close to achieving the 2030 objective.” The SWOT satellite was jointly developed by NASA and CNES, with contributions from the Canadian Space Agency (CSA) and the UK Space Agency. NASA’s Jet Propulsion Laboratory, managed for the agency by Caltech in Pasadena, California, leads the U.S. component of the project. For the flight system payload, NASA provided the Ka-band radar interferometer (KaRIn) instrument, a GPS science receiver, a laser retroreflector, a two-beam microwave radiometer, and NASA instrument operations. The Doppler Orbitography and Radioposition Integrated by Satellite system, the dual frequency Poseidon altimeter (developed by Thales Alenia Space), the KaRIn radio-frequency subsystem (together with Thales Alenia Space and with support from the UK Space Agency), the satellite platform, and ground operations were provided by CNES. The KaRIn high-power transmitter assembly was provided by CSA. To learn more about SWOT, visit: https://swot.jpl.nasa.gov Jane J. Lee / Andrew WangJet Propulsion Laboratory, Pasadena, Calif.818-354-0307 / 626-379-6874jane.j.lee@jpl.nasa.gov / andrew.wang@jpl.nasa.gov 2025-040",
  "image": "https://www.nasa.gov/wp-content/uploads/2025/03/1-paramount-seamount-noaa.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003cem\u003eMore accurate maps based on data from the SWOT mission can improve underwater navigation and result in greater knowledge of how heat and life move around the world’s ocean.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThere are better maps of the Moon’s surface than of the bottom of Earth’s ocean. Researchers have been working for decades to change that. As part of the ongoing effort, a NASA-supported team recently published one of the most detailed maps yet of the ocean floor, using data from the SWOT (Surface Water and Ocean Topography) satellite, a collaboration between NASA and the French space agency CNES (Centre National d’Études Spatiales).\u003c/p\u003e\n\u003cp\u003eShips outfitted with sonar instruments can make direct, incredibly detailed measurements of the ocean floor. But to date, only about 25% of it has been surveyed in this way. To produce a global picture of the seafloor, researchers have relied on satellite data.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cp\u003e\n\u003ciframe title=\"Surface Water and Ocean Topography (SWOT) Vertical Gravity Gradient\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/v5GJ4trliE4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003cfigcaption\u003eThis animation shows seafloor features derived from SWOT data on regions off Mexico, South America, and the Antarctic Peninsula. Purple denotes regions that are lower relative to higher areas like seamounts, depicted in green. Eötvös is the unit of measure for the gravity-based data used to create these maps.\u003cbr/\u003eNASA’s Scientific Visualization Studio\u003c/figcaption\u003e\u003c/figure\u003e\n\n\u003cp\u003eMore accurate maps of the ocean floor are crucial for a range of seafaring activities, including navigation and laying underwater communications cables. “Seafloor mapping is key in both established and emerging economic opportunities, including rare-mineral seabed mining, optimizing shipping routes, hazard detection, and seabed warfare operations,” said Nadya Vinogradova Shiffer, head of physical oceanography programs at NASA Headquarters in Washington.\u003c/p\u003e\n\u003cp\u003eAccurate seafloor maps are also important for an improved understanding of deep-sea currents and tides, which affect life in the abyss, as well as geologic processes like plate tectonics. Underwater mountains called seamounts and other ocean floor features like their smaller cousins, abyssal hills, influence the movement of heat and nutrients in the deep sea and can attract life. The effects of these physical features can even be felt at the surface by the influence they exert on ecosystems that human communities depend on.\u003c/p\u003e\n\n\n\n\u003cp\u003eMapping the seafloor isn’t the \u003ca href=\"https://swot.jpl.nasa.gov/\" rel=\"noopener\"\u003eSWOT\u003c/a\u003e mission’s primary purpose. Launched in December 2022, the satellite measures the height of water on nearly all of Earth’s surface, including the ocean, lakes, reservoirs, and rivers. Researchers can use these differences in height to create a kind of topographic map of the surface of fresh- and seawater. This data can then be used for tasks such as assessing changes in sea ice or tracking how floods progress down a river.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The SWOT satellite was a huge jump in our ability to map the seafloor,” said David Sandwell, a geophysicist at Scripps Institution of Oceanography in La Jolla, California. He’s used satellite data to chart the bottom of the ocean since the 1990s and was one of the researchers responsible for the SWOT-based seafloor map, which was \u003ca href=\"https://www.science.org/doi/10.1126/science.ads4472\" rel=\"noopener\"\u003epublished\u003c/a\u003e in the journal Science in December 2024.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThe study authors relied on the fact that because geologic features like seamounts and abyssal hills have more mass than their surroundings, they exert a slightly stronger gravitational pull that creates small, measurable bumps in the sea surface above them. These subtle gravity signatures help researchers predict the kind of seafloor feature that produced them.\u003c/p\u003e\n\n\n\n\u003cp\u003eThrough repeated observations — SWOT covers about 90% of the globe every 21 days — the satellite is sensitive enough to pick up these minute differences, with centimeter-level accuracy, in sea surface height caused by the features below. Sandwell and his colleagues used a year’s worth of SWOT data to focus on seamounts, abyssal hills, and underwater continental margins, where continental crust meets oceanic crust.\u003c/p\u003e\n\n\n\n\u003cp\u003ePrevious ocean-observing satellites have detected massive versions of these bottom features, such as seamounts over roughly 3,300 feet (1 kilometer) tall. The SWOT satellite can pick up seamounts less than half that height, potentially increasing the number of known seamounts from 44,000 to 100,000. These underwater mountains stick up into the water, influencing deep sea currents. This can concentrate nutrients along their slopes, attracting organisms and creating oases on what would otherwise be barren patches of seafloor.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThe improved view from SWOT also gives researchers more insight into the geologic history of the planet.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Abyssal hills are the most abundant landform on Earth, covering about 70% of the ocean floor,” said Yao Yu, an oceanographer at Scripps Institution of Oceanography and lead author on the paper. “These hills are only a few kilometers wide, which makes them hard to observe from space. We were surprised that SWOT could see them so well.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAbyssal hills form in parallel bands, like the ridges on a washboard, where tectonic plates spread apart. The orientation and extent of the bands can reveal how tectonic plates have moved over time. Abyssal hills also interact with tides and deep ocean currents in ways that researchers don’t fully understand yet.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe researchers have extracted nearly all the information on seafloor features they expected to find in the SWOT measurements. Now they’re focusing on refining their picture of the ocean floor by calculating the depth of the features they see. The work complements an effort by the international scientific community to map the entire seafloor using ship-based sonar by 2030. “We won’t get the full ship-based mapping done by then,” said Sandwell. “But SWOT will help us fill it in, getting us close to achieving the 2030 objective.”\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThe SWOT satellite was jointly developed by NASA and CNES, with contributions from the Canadian Space Agency (CSA) and the UK Space Agency. NASA’s Jet Propulsion Laboratory, managed for the agency by Caltech in Pasadena, California, leads the U.S. component of the project. For the flight system payload, NASA provided the Ka-band radar interferometer (KaRIn) instrument, a GPS science receiver, a laser retroreflector, a two-beam microwave radiometer, and NASA instrument operations. The Doppler Orbitography and Radioposition Integrated by Satellite system, the dual frequency Poseidon altimeter (developed by Thales Alenia Space), the KaRIn radio-frequency subsystem (together with Thales Alenia Space and with support from the UK Space Agency), the satellite platform, and ground operations were provided by CNES. The KaRIn high-power transmitter assembly was provided by CSA.\u003c/p\u003e\n\n\n\n\u003cp\u003eTo learn more about SWOT, visit:\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://swot.jpl.nasa.gov\" rel=\"noopener\"\u003ehttps://swot.jpl.nasa.gov\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eJane J. Lee / Andrew Wang\u003cbr/\u003eJet Propulsion Laboratory, Pasadena, Calif.\u003cbr/\u003e818-354-0307 / 626-379-6874\u003cbr/\u003e\u003ca href=\"mailto:jane.j.lee@jpl.nasa.gov\"\u003ejane.j.lee@jpl.nasa.gov\u003c/a\u003e / \u003ca href=\"mailto:andrew.wang@jpl.nasa.gov\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eandrew.wang@jpl.nasa.gov\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e2025-040\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-19T17:37:20-04:00",
  "modifiedTime": "2025-03-19T18:22:44-04:00"
}
