{
  "id": "cf7a31e5-d35b-4062-83fd-4eb4cfe5d14b",
  "title": "Best of 2024: Reestablished NASA Art Program Begins with Mural in New York City",
  "link": "https://www.nasa.gov/image-article/best-of-2024-reestablished-nasa-art-program-begins-with-mural-in-new-york-city/",
  "description": "The New York-based artist team Geraluz, left, and WERC, right, pose in front of their mural “To the Moon, and Back” with their son Amaru, 5. The community mural was created as part of the reimagined NASA Art Program, which aims to inspire and engage the next generation of explorers – the Artemis Generation – […]",
  "author": "Monika Luabeya",
  "published": "Tue, 07 Jan 2025 21:00:44 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "NASA Art Program"
  ],
  "byline": "",
  "length": 551,
  "excerpt": "The New York-based artist team Geraluz, left, and WERC, right, pose in front of their mural “To the Moon, and Back” with their son Amaru, 5. The community",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Monika LuabeyaJan 07, 2025 The New York-based artist team Geraluz, left, and WERC, right, pose in front of their mural “To the Moon, and Back” with their son Amaru, 5. The community mural was created as part of the reimagined NASA Art Program, which aims to inspire and engage the next generation of explorers – the Artemis Generation – in new and unexpected ways, including through art. The NASA Headquarters photo team chose this image as one of their best from 2024. See more of the top 100 from last year on Flickr. Image credit: NASA/Joel Kowsky",
  "image": "https://www.nasa.gov/wp-content/uploads/2025/01/54023707668-041ea3961a-o.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-797610\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://secure.gravatar.com/avatar/03a037bcd81d253e17b250d7d6b39bcf?s=300\u0026amp;d=blank\u0026amp;r=g\" alt=\"The headshot image of Monika Luabeya\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch3\u003eMonika Luabeya\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eJan 07, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cp\u003eThe New York-based artist team Geraluz, left, and WERC, right, pose in front of their mural “To the Moon, and Back” with their son Amaru, 5. The community mural was created as part of the reimagined \u003ca href=\"https://www.nasa.gov/history/nasa-and-art/\"\u003eNASA Art Program\u003c/a\u003e, which aims to inspire and engage the next generation of explorers – the \u003ca href=\"https://www.nasa.gov/feature/artemis/\"\u003eArtemis\u003c/a\u003e Generation – in new and unexpected ways, including through art.\u003c/p\u003e\n\u003cp\u003eThe NASA Headquarters photo team chose this image as one of their best from 2024. \u003ca href=\"https://flic.kr/s/aHBqjBWE5U\" rel=\"noopener\"\u003eSee more of the top 100 from last year on Flickr.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eImage credit: NASA/Joel Kowsky\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
