{
  "id": "f0a398e1-5144-4249-8a9a-6b5cabbe9fd6",
  "title": "The cosmos is vast, so how do we measure it?",
  "link": "https://www.newscientist.com/article/mg26735510-100-the-cosmos-is-vast-so-how-do-we-measure-it/?utm_campaign=RSS%7CNSNS\u0026utm_source=NSNS\u0026utm_medium=RSS\u0026utm_content=space",
  "description": "The awe-inspiring distances of the cosmos are hard to visualise, so how can we be certain we are measuring them correctly? Chanda Prescod-Weinstein explains",
  "author": "",
  "published": "Wed, 09 Jul 2025 19:00:00 +0100",
  "source": "https://www.newscientist.com/subject/space/feed/",
  "categories": null,
  "byline": "Chanda Prescod-Weinstein",
  "length": 5695,
  "excerpt": "The awe-inspiring distances of the cosmos are hard to visualise, so how can we be certain we are measuring them correctly? Chanda Prescod-Weinstein explains",
  "siteName": "New Scientist",
  "favicon": "https://www.newscientist.com/build/images/layup/touch-icon/180x180.50b024f6.png",
  "text": "An estimated 500,000 stars shine in this portion of the Milky Way galaxyNASA, ESA, CSA, STScI, and S. Crowe (University of Virginia). One of the big challenges in communicating about space and space-time is that the universe is so large the scales are very difficult to imagine. Even just trying to get a sense of our solar system can be hard. If I were to make a scale-accurate model in which the sun is 1 centimetre across, I would have to put Pluto 42 metres away. I don’t know about your house, but mine doesn’t have a ballroom in it – which would be about that length. Yet our solar system is tiny on the scale of the Milky Way. Ignoring the fact our galaxy exists in a halo of invisible dark matter that extends well beyond the visible parts, the Milky Way is so large that it would take light about 100,000 years to cross it. In contrast, light gets from the sun to Pluto in just 5.5 hours. You might have noticed that I switched from everyday distances to units that relate to light speed. A hundred thousand light years is 9.46 × 1020 metres. How would I even tell you to visualise that? I might as well say it is a bajillion ballrooms. And the Milky Way is pretty small compared with the cosmos. It isn’t even an especially large galaxy. Our neighbour Andromeda is twice as wide. On top of that, space-time is expanding. That doesn’t affect distance measurements in gravitationally bound regions like our solar system or the Milky Way. It doesn’t even necessarily affect the distances between galaxies: the Milky Way and Andromeda are actually headed for each other, although the eventual collision will be more like a gentle dance than cars crashing, and it is 4.5 billion years away at least, so have no fear! But on the largest scales, space-time is stretching, and groups of galaxies are being pulled away from each other. This is known as the Hubble expansion, and it means that many measurements of distance in the universe will change. Billions of years from now, people will get a different figure for the gap between us and the Virgo galaxy cluster, which is currently 50 million light years away. In principle, these numbers are awe-inspiring, but it is also understandable that they invite some scepticism. First of all, how can we be so certain about these measurements? This is actually a subtle issue in astronomy. The way we do this is by building a “ladder” of measurements, often using objects of known brightness such as certain types of stars, that allow us to gauge distance. In our images of distant galaxies, why don’t we see them as a blur, given that space-time is expanding? The lowest – easiest – rung involves using cepheid variable stars, which pulse regularly, to calculate how far away things are. These are effective up to a certain distance, at which point we have to switch to something else. For the past 30 years, astronomers have used specific types of supernovae, or dying stars, because we know how to characterise the way in which their light is stretched out by the expansion of space-time. There are other ways too, some using what we know about the brightest red giant stars. We have a high level of confidence in our ability to measure long distances, but I do understand why, despite this, I have received a few questions from readers related to this. One is about what happens to light as the universe expands. A standard part of our cosmological picture is that, just as the frequency of a siren that is moving away from us is shifted down, light waves stretch as space-time expands, reddening the light. Measuring this redshift is crucial to our use of supernovae to gauge distance, as mentioned earlier. Redshift also means the light is of lower energy than it was before. But there is no apparent place the lost energy goes, which looks suspicious. Usually, when we get rid of energy, it goes somewhere. That is required in Newtonian physics. It isn’t, however, in general relativity. In other words, the thing that makes it possible for us to measure long distances is also something that violates our day-to-day notions about how energy moves about in the universe. Another, related question that came in recently from a reader is about pictures of distant galaxies, like the ones among the new Vera C. Rubin Observatory’s first images. Shouldn’t we see the galaxies as a blur, as space-time is expanding? The important thing to keep in mind here is that “seeing” the expansion of space-time isn’t like watching Lewis Hamilton in F1. It is a lot more like watching F1 if a race took billions of years, really, really far away. On that scale, the cars wouldn’t visibly move. The only way we know that galaxies are moving away from us at all is by measuring something like redshift, and that is just a measurement of how the light is stretched out, not an observation of the galaxy’s real-time motion. I especially like these kinds of questions because they go to the heart of the metaphors we science communicators use to talk to our audiences. I appreciate that New Scientist readers are pushing these metaphors to their limits! Chanda’s week What I’m reading For reasons that will become public, a lot of Alice’s Adventures in Wonderland. What I’m watching I finally saw and enjoyed Station Eleven. What I’m working on I have been thinking a lot about what quantum fields really are. Strange! Chanda Prescod-Weinstein is an associate professor of physics and astronomy, and a core faculty member in women’s studies at the University of New Hampshire. Her most recent book is The Disordered Cosmos: A journey into dark matter, spacetime, and dreams deferred Topics:",
  "image": "https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection data-barrier=\"None\"\u003e\n                    \u003cfigure\u003e\u003cp\u003e\u003cimg alt=\"The NIRCam (Near-Infrared Camera) instrument on NASA?s James Webb Space Telescope?s reveals a portion of the Milky Way?s dense core in a new light. An estimated 500,000 stars shine in this image of the Sagittarius C (Sgr C) region, along with some as-yet unidentified features. A large region of ionized hydrogen, shown in cyan, contains intriguing needle-like structures that lack any uniform orientation. NASA, ESA, CSA, STScI, and S. Crowe (University of Virginia).\" width=\"1350\" height=\"900\" src=\"https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg\" srcset=\"https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=300 300w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=400 400w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=500 500w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=600 600w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=700 700w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=800 800w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=837 837w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=900 900w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=1003 1003w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=1100 1100w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=1200 1200w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=1300 1300w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=1400 1400w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=1500 1500w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=1600 1600w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=1674 1674w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=1700 1700w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=1800 1800w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=1900 1900w, https://images.newscientist.com/wp-content/uploads/2025/07/08104631/SEI_257514856.jpg?width=2006 2006w\" sizes=\"(min-width: 1288px) 837px, (min-width: 1024px) calc(57.5vw + 55px), (min-width: 415px) calc(100vw - 40px), calc(70vw + 74px)\" loading=\"eager\" fetchpriority=\"high\" data-image-context=\"Article\" data-image-id=\"2487373\" data-caption=\"An estimated 500,000 stars shine in this portion of the Milky Way galaxy\" data-credit=\"NASA, ESA, CSA, STScI, and S. Crowe (University of Virginia).\"/\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eAn estimated 500,000 stars shine in this portion of the Milky Way galaxy\u003c/p\u003e\u003cp\u003eNASA, ESA, CSA, STScI, and S. Crowe (University of Virginia).\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eOne of the big challenges in communicating about space and space-time is that the universe is so large the scales are very difficult to imagine. Even just trying to get a sense of our solar system can be hard. If I were to make a scale-accurate model in which the sun is 1 centimetre across, I would have to put Pluto 42 metres away. I don’t know about your house, but mine doesn’t have a ballroom in it – which would be about that length.\u003c/p\u003e\u003cspan\u003e\u003c/span\u003e\n\u003cp\u003eYet our solar system is tiny on the scale of the Milky Way. Ignoring the fact our galaxy exists in a halo of invisible dark matter that extends well beyond the visible parts, the Milky Way is so large that it would take light about 100,000 years to cross it. In contrast, light gets from the sun to Pluto in just 5.5 hours.\u003c/p\u003e\n\u003cp\u003eYou might have noticed that I switched from everyday distances to units that relate to light speed. A hundred thousand light years is 9.46 × 10\u003csup\u003e20\u003c/sup\u003e metres. How would I even tell you to visualise that? I might as well say it is a bajillion ballrooms. And the Milky Way is pretty small compared with the cosmos. It isn’t even an especially large galaxy. Our neighbour Andromeda is twice as wide.\u003c/p\u003e\n\u003cp\u003eOn top of that, \u003ca href=\"https://www.newscientist.com/article/mg25533940-200-what-does-it-mean-when-we-say-that-space-time-is-expanding/\"\u003espace-time is expanding\u003c/a\u003e. That doesn’t affect distance measurements in gravitationally bound regions like our solar system or the Milky Way. It doesn’t even necessarily affect the distances between galaxies: the Milky Way and Andromeda are actually headed for each other, although the eventual collision will be more like a gentle dance than cars crashing, and it is 4.5 billion years away at least, so have no fear!\u003c/p\u003e\n\u003cp\u003eBut on the largest scales, space-time is stretching, and groups of galaxies are being pulled away from each other. This is known as the Hubble expansion, and it means that many measurements of distance in the universe will change. Billions of years from now, people will get a different figure for the gap between us and the Virgo galaxy cluster, which is currently 50 million light years away.\u003c/p\u003e\n\u003cp\u003eIn principle, these numbers are awe-inspiring, but it is also understandable that they invite some scepticism. First of all, how can we be so certain about these measurements? This is actually a \u003ca href=\"https://www.newscientist.com/article/2158462-the-universe-still-seems-to-be-expanding-faster-than-it-ought-to/\"\u003esubtle issue\u003c/a\u003e in astronomy. The way we do this is by building a “ladder” of measurements, often using objects of known brightness such as certain types of stars, that allow us to gauge distance.\u003c/p\u003e\n\u003cfigure data-quote=\"In our images of distant galaxies, why don\u0026#39;t we see them as a blur, given that space-time is expanding?\" data-component-name=\"pull-quote\"\u003e\n    \u003cblockquote\u003e\n                    \u003cp\u003eIn our images of distant galaxies, why don’t we see them as a blur, given that space-time is expanding?\u003c/p\u003e\n                    \u003c/blockquote\u003e\n\u003c/figure\u003e\n\u003cp\u003eThe lowest – easiest – rung involves using cepheid variable stars, which pulse regularly, to calculate how far away things are. These are effective up to a certain distance, at which point we have to switch to something else. For the past 30 years, astronomers have used specific types of supernovae, or dying stars, because we know how to characterise the way in which their light is stretched out by the expansion of space-time. There are other ways too, some using what we know about the brightest red giant stars.\u003c/p\u003e\n\u003cp\u003eWe have a high level of confidence in our ability to measure long distances, but I do understand why, despite this, I have received a few questions from readers related to this. One is about what happens to light as the universe expands. A standard part of our cosmological picture is that, just as the frequency of a siren that is moving away from us is shifted down, light waves stretch as space-time expands, reddening the light. Measuring this redshift is crucial to our use of supernovae to gauge distance, as mentioned earlier.\u003c/p\u003e\n\u003cp\u003eRedshift also means the light is of lower energy than it was before. But there is no apparent place the lost energy goes, which looks suspicious. Usually, when we get rid of energy, it goes somewhere. That is required in Newtonian physics. It isn’t, however, in general relativity. In other words, the thing that makes it possible for us to measure long distances is also something that violates our day-to-day notions about how energy moves about in the universe.\u003c/p\u003e\n\u003cp\u003eAnother, related question that came in recently from a reader is about pictures of distant galaxies, like the ones among the \u003ca href=\"https://www.newscientist.com/article/2485201-stunning-first-images-show-the-power-of-the-vera-c-rubin-observatory/\"\u003enew Vera C. Rubin Observatory’s\u003c/a\u003e first images. Shouldn’t we see the galaxies as a blur, as space-time is expanding?\u003c/p\u003e\n\u003cp\u003eThe important thing to keep in mind here is that “seeing” the expansion of space-time isn’t like watching Lewis Hamilton in F1. It is a lot more like watching F1 if a race took billions of years, really, really far away. On that scale, the cars wouldn’t visibly move. The only way we know that galaxies are moving away from us at all is by measuring something like redshift, and that is just a measurement of how the light is stretched out, not an observation of the galaxy’s real-time motion.\u003c/p\u003e\n\u003cp\u003eI especially like these kinds of questions because they go to the heart of the metaphors we science communicators use to talk to our audiences. I appreciate that \u003ci\u003eNew Scientist\u003c/i\u003e readers are pushing these metaphors to their limits!\u003c/p\u003e\n\u003ch3\u003eChanda’s week\u003c/h3\u003e\n\u003cp\u003e\u003cb\u003eWhat I’m reading\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eFor reasons that will become public, a lot of\u003c/i\u003e Alice’s Adventures in Wonderland.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eWhat I’m watching\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eI finally saw and enjoyed\u003c/i\u003e Station Eleven.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eWhat I’m working on\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eI have been thinking a lot about what quantum fields really are. Strange!\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eChanda Prescod-Weinstein is an associate professor of physics and astronomy, and a core faculty member in women’s studies at the University of New Hampshire. Her most recent book is The Disordered Cosmos: A journey into dark matter, spacetime, and dreams deferred\u003c/em\u003e\u003c/p\u003e\n\n                    \u003csection data-component-name=\"article-topics\"\u003e\u003cp\u003eTopics:\u003c/p\u003e\u003c/section\u003e                \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-07-09T18:00:00+01:00",
  "modifiedTime": null
}
