{
  "id": "f1f3e8b2-6330-41d8-bf7e-6a7ccc00d5c8",
  "title": "NASA’s IXPE Reveals X-ray-Generating Particles in Black Hole Jets",
  "link": "https://www.nasa.gov/centers-and-facilities/marshall/nasas-ixpe-reveals-x-ray-generating-particles-in-black-hole-jets/",
  "description": "The blazar BL Lacertae, a supermassive black hole surrounded by a bright disk and jets oriented toward Earth, provided scientists with a unique opportunity to answer a longstanding question: How are X-rays generated in extreme environments like this? NASA’s IXPE (Imaging X-ray Polarimetry Explorer) collaborated with radio and optical telescopes to find answers. The results […]",
  "author": "Beth Ridgeway",
  "published": "Tue, 06 May 2025 20:24:24 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Marshall Space Flight Center",
    "IXPE (Imaging X-ray Polarimetry Explorer)",
    "Marshall Astrophysics"
  ],
  "byline": "Beth Ridgeway",
  "length": 5176,
  "excerpt": "Data from NASA’s IXPE enables astronomers to learn more about black hole jets known as blazars.",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "The blazar BL Lacertae, a supermassive black hole surrounded by a bright disk and jets oriented toward Earth, provided scientists with a unique opportunity to answer a longstanding question: How are X-rays generated in extreme environments like this? NASA’s IXPE (Imaging X-ray Polarimetry Explorer) collaborated with radio and optical telescopes to find answers. The results (preprint available here), to be published in the journal Astrophysical Journal Letters, show that interactions between fast-moving electrons and particles of light, called photons, must lead to this X-ray emission.  Scientists had two competing possible explanations for the X-rays, one involving protons and one involving electrons. Each of these mechanisms would have a different signature in the polarization of X-ray light. Polarization is a property of light that describes the average direction of the electromagnetic waves that make up light. If the X-rays in a black hole’s jets are highly polarized, that would mean that the X-rays are produced by protons gyrating in the magnetic field of the jet or protons interacting with jet’s photons. If the X-rays have a lower polarization degree, it would suggest that electron-photons interactions lead to X-ray production.   IXPE, which launched Dec. 9, 2021, is the only satellite flying today that can make such a polarization measurement.  “This was one of the biggest mysteries about supermassive black hole jets” said Iván Agudo, lead author of the study and astronomer at the Instituto de Astrofísica de Andalucía – CSIC in Spain. “And IXPE, with the help of a number of supporting ground-based telescopes, finally provided us with the tools to solve it.” Astronomers found that electrons must be the culprits through a process called Compton Scattering. Compton scattering (or the Compton effect) happens when a photon loses or gains energy after interacting with a charged particle, usually an electron. Within jets from supermassive black holes, electrons move near the speed of light. IXPE helped scientists learn that, in the case of a blazar jet, the electrons have enough energy to scatter photons of infrared light up to X-ray wavelengths.  BL Lacertae (BL Lac for short) is one of the first blazars ever discovered, originally thought to be a variable star in the Lacerta constellation. IXPE observed BL Lac at the end of November 2023 for seven days along with several ground-based telescopes measuring optical and radio polarization at the same time. While IXPE observed BL Lac in the past, this observation was special. Coincidentally, during the X-ray polarization observations, the optical polarization of BL Lac reached a high number: 47.5%.  “This was not only the most polarized BL Lac has been in the past 30 years, this is the most polarized any blazar has ever been observed!” said Ioannis Liodakis, one of the primary authors of the study and astrophysicist at the Institute of Astrophysics – FORTH in Greece.  IXPE found the X-rays were far less polarized than the optical light. The team was not able to measure a strong polarization signal and determined that the X-rays cannot be more polarized than 7.6%. This proved that electrons interacting with photons, via the Compton effect, must explain the X-rays.  Steven Ehlert Project Scientist for IXPE at Marshall Space Flight Center “The fact that optical polarization was so much higher than in the X-rays can only be explained by Compton scattering”, said Steven Ehlert, project scientist for IXPE and astronomer at the Marshall Space Flight Center.  “IXPE has managed to solve another black hole mystery” said Enrico Costa, astrophysicist in Rome at the Istituto di Astrofísica e Planetologia Spaziali of the Istituto Nazionale di Astrofísica. Costa is one of the scientists who conceived this experiment and proposed it to NASA 10 years ago, under the leadership of Martin Weisskopf, IXPE’s first principal investigator. “IXPE’s polarized X-ray vision has solved several long lasting mysteries, and this is one of the most important. In some other cases, IXPE results have challenged consolidated opinions and opened new enigmas, but this is how science works and, for sure, IXPE is doing very good science.” What’s next for the blazar research? “One thing we’ll want to do is try to find as many of these as possible,” Ehlert said. “Blazars change quite a bit with time and are full of surprises.” More about IXPE IXPE, which continues to provide unprecedented data enabling groundbreaking discoveries about celestial objects across the universe, is a joint NASA and Italian Space Agency mission with partners and science collaborators in 12 countries. IXPE is led by NASA’s Marshall Space Flight Center in Huntsville, Alabama. BAE Systems, Inc., headquartered in Falls Church, Virginia, manages spacecraft operations together with the University of Colorado’s Laboratory for Atmospheric and Space Physics in Boulder. Learn more about IXPE’s ongoing mission here: https://www.nasa.gov/ixpe Elizabeth LandauNASA Headquarterselizabeth.r.landau@nasa.gov202-358-0845 Lane FigueroaMarshall Space Flight Center, Huntsville, Ala.lane.e.figueroa@nasa.gov256.544.0034",
  "image": "https://www.nasa.gov/wp-content/uploads/2025/05/g-680772-figueroa-cs80-high-res.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe blazar BL Lacertae, a supermassive black hole surrounded by a bright disk and jets oriented toward Earth, provided scientists with a unique opportunity to answer a longstanding question: How are X-rays generated in extreme environments like this?\u003c/p\u003e\n\u003cp\u003eNASA’s IXPE (\u003ca href=\"https://www.nasa.gov/mission/imaging-x-ray-polarimetry-explorer-ixpe/\"\u003eImaging X-ray Polarimetry Explorer\u003c/a\u003e) collaborated with radio and optical telescopes to find answers. The results (\u003ca href=\"https://arxiv.org/abs/2505.01832\" rel=\"noopener\"\u003epreprint available here\u003c/a\u003e), to be published in the journal Astrophysical Journal Letters, show that interactions between fast-moving electrons and particles of light, called photons, must lead to this X-ray emission. \u003c/p\u003e\n\n\u003cp\u003eScientists had two competing possible explanations for the X-rays, one involving protons and one involving electrons. Each of these mechanisms would have a different signature in the polarization of X-ray light. Polarization is a property of light that describes the average direction of the electromagnetic waves that make up light.\u003c/p\u003e\n\u003cp\u003eIf the X-rays in a black hole’s jets are highly polarized, that would mean that the X-rays are produced by protons gyrating in the magnetic field of the jet or protons interacting with jet’s photons. If the X-rays have a lower polarization degree, it would suggest that electron-photons interactions lead to X-ray production.  \u003c/p\u003e\n\u003cp\u003eIXPE, which launched Dec. 9, 2021, is the only satellite flying today that can make such a polarization measurement. \u003c/p\u003e\n\u003cp\u003e“This was one of the biggest mysteries about supermassive black hole jets” said Iván Agudo, lead author of the study and astronomer at the Instituto de Astrofísica de Andalucía – CSIC in Spain. “And IXPE, with the help of a number of supporting ground-based telescopes, finally provided us with the tools to solve it.”\u003c/p\u003e\n\u003cp\u003eAstronomers found that electrons must be the culprits through a process called Compton Scattering. Compton scattering (or the Compton effect) happens when a photon loses or gains energy after interacting with a charged particle, usually an electron. Within jets from supermassive black holes, electrons move near the speed of light. IXPE helped scientists learn that, in the case of a blazar jet, the electrons have enough energy to scatter photons of infrared light up to X-ray wavelengths. \u003c/p\u003e\n\u003cp\u003eBL Lacertae (BL Lac for short) is one of the first blazars ever discovered, originally thought to be a variable star in the Lacerta constellation. IXPE observed BL Lac at the end of November 2023 for seven days along with several ground-based telescopes measuring optical and radio polarization at the same time. While IXPE observed BL Lac in the past, this observation was special. Coincidentally, during the X-ray polarization observations, the optical polarization of BL Lac reached a high number: 47.5%. \u003c/p\u003e\n\u003cp\u003e“This was not only the most polarized BL Lac has been in the past 30 years, this is the most polarized any blazar has ever been observed!” said Ioannis Liodakis, one of the primary authors of the study and astrophysicist at the Institute of Astrophysics – FORTH in Greece. \u003c/p\u003e\n\u003cp\u003eIXPE found the X-rays were far less polarized than the optical light. The team was not able to measure a strong polarization signal and determined that the X-rays cannot be more polarized than 7.6%. This proved that electrons interacting with photons, via the Compton effect, must explain the X-rays. \u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eSteven Ehlert\u003c/p\u003e\n\u003cp\u003eProject Scientist for IXPE at Marshall Space Flight Center\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e“The fact that optical polarization was so much higher than in the X-rays can only be explained by Compton scattering”, said Steven Ehlert, project scientist for IXPE and astronomer at the Marshall Space Flight Center. \u003c/p\u003e\n\u003cp\u003e“IXPE has managed to solve another black hole mystery” said Enrico Costa\u003cstrong\u003e, \u003c/strong\u003eastrophysicist in Rome at the Istituto di Astrofísica e Planetologia Spaziali of the Istituto Nazionale di Astrofísica. Costa is one of the scientists who conceived this experiment and proposed it to NASA 10 years ago, under the leadership of Martin Weisskopf, IXPE’s first principal investigator. “IXPE’s polarized X-ray vision has solved several long lasting mysteries, and this is one of the most important. In some other cases, IXPE results have challenged consolidated opinions and opened new enigmas, but this is how science works and, for sure, IXPE is doing very good science.”\u003c/p\u003e\n\u003cp\u003eWhat’s next for the blazar research?\u003c/p\u003e\n\u003cp\u003e“One thing we’ll want to do is try to find as many of these as possible,” Ehlert said. “Blazars change quite a bit with time and are full of surprises.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMore about IXPE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIXPE, which continues to provide unprecedented data enabling groundbreaking discoveries about celestial objects across the universe, is a joint NASA and Italian Space Agency mission with partners and science collaborators in 12 countries. IXPE is led by NASA’s Marshall Space Flight Center in Huntsville, Alabama. BAE Systems, Inc., headquartered in Falls Church, Virginia, manages spacecraft operations together with the University of Colorado’s Laboratory for Atmospheric and Space Physics in Boulder. Learn more about IXPE’s ongoing mission here:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.nasa.gov/ixpe\"\u003ehttps://www.nasa.gov/ixpe\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eElizabeth Landau\u003cbr/\u003e\u003c/strong\u003eNASA Headquarters\u003cbr/\u003e\u003ca href=\"mailto:elizabeth.r.landau@nasa.gov\"\u003eelizabeth.r.landau@nasa.gov\u003c/a\u003e\u003cbr/\u003e202-358-0845\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLane Figueroa\u003cbr/\u003e\u003c/strong\u003eMarshall Space Flight Center, Huntsville, Ala.\u003cbr/\u003e\u003ca href=\"mailto:lane.e.figueroa@nasa.gov\"\u003elane.e.figueroa@nasa.gov\u003c/a\u003e\u003cbr/\u003e256.544.0034 \u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-06T16:24:24-04:00",
  "modifiedTime": "2025-05-06T16:27:14-04:00"
}
