{
  "id": "f7da4a51-d5e5-4a6a-93ee-6e135e010c99",
  "title": "NASA, SpaceX targeting July 31 for launch of Crew-11 astronaut mission to ISS",
  "link": "https://www.space.com/space-exploration/international-space-station/nasa-spacex-targeting-july-31-for-launch-of-crew-11-astronaut-mission-to-iss",
  "description": "NASA and SpaceX are targeting July 31 for the launch of the four-astronaut Crew-11 mission, which will fly a mix of rookies and spaceflight veterans to the ISS.",
  "author": "",
  "published": "Thu, 10 Jul 2025 22:18:23 +0000",
  "source": "https://www.space.com/feeds/all",
  "categories": [
    "International Space Station",
    "Space Exploration",
    "Missions"
  ],
  "byline": "Josh Dinner",
  "length": 8491,
  "excerpt": "\"I have spent so many years imagining exactly what this is going to be like.\"",
  "siteName": "Space",
  "favicon": "https://vanilla.futurecdn.net/space/1322740/apple-touch-icon.png",
  "text": "Members of SpaceX Crew-11 sit aboard a Dragon spacecraft. From left: Roscosmos cosmonaut Oleg Platonov, NASA astronaut Mike Fincke and Zena Cardman, and JAXA astronaut Kimiya Yui. (Image credit: NASA) The next astronaut launch to the International Space Station (ISS) is just around the corner.NASA is targeting July 31 for the launch of its next astronaut mission with SpaceX. The flight, called Crew-11, will lift off atop a Falcon 9 rocket from Launch Complex-39A (LC-39A), at NASA's Kennedy Space Center in Florida, sending the Crew Dragon Endeavour to low Earth orbit (LEO). The flight will mark the sixth mission for Endeavour, making it SpaceX's most-flown Crew Dragon spacecraft.Aboard, NASA astronauts Zena Cardman (Crew-11 commander) and Mike Fincke (pilot) will be joined by mission specialists Kimiya Yui from the Japanese Aerospace Exploration Agency (JAXA), and Oleg Platonov, of the Russian space agency Roscosmos. This will be the first spaceflight for Cardman and Platonov, the second for Yui and the fourth for Fincke.The Falcon 9 first stage supporting Crew-11, designated B1094, has launched two previous missions: Starlink 12-10 and, most recently, the private Ax-4 astronaut mission on June 25. B1094 is currently undergoing the final stages of refurbishment leading up to the July 31 launch. It will be transported to SpaceX's Horizontal Integration Facility next to LC-39A to be mated to the rocket's second stage ahead of a static-fire test at the pad in a week or two, according to NASA's Commercial Crew Program Manager Steve Stich during a mission briefing on Thursday (July 10).Crew Dragon Endeavour has also undergone refurbishment since its last launch  — Crew-8, in March 2024  — and has received some upgrades ahead of the Crew-11 mission. Endeavour will be the first Crew Dragon to fly with the updated drogue 3.1 parachutes, first flown on SpaceX's CRS-32 Cargo Dragon mission. The upgrades include stronger crowns in the parachutes' materials and a new packaging system designed for \"more orderly inflation,\" Stich said during Thursday's briefing.\"This Dragon spacecraft has successfully flown 18 crew members representing eight countries to space already, starting with [NASA astronauts] Bob [Behnken] and Doug [Hurley] in 2020, when it returned human spaceflight capabilities to the United States for the first time since the shuttle retired in July of 2011,\" explained Sarah Walker, SpaceX's director of Dragon mission management.Crew-11 had been slated for launch in \"late July/early August\" but was accelerated by about 2 weeks to accommodate a critical ISS reboost maneuver to be performed by a SpaceX Cargo Dragon as a part of the upcoming CRS-33 station resupply mission. CRS-33 will be the first Cargo Dragon with altitude-correction hardware designed to maintain the space station's orbit, and will mark a step furthering NASA and SpaceX's efforts to develop a U.S. vehicle that will deorbit the ISS at the end of its life at the end of 2030 or thereabouts.Breaking space news, the latest updates on rocket launches, skywatching events and more!The Crew-11 launch date is part of a tight choreography of space station traffic over the next several months, which includes the recent arrivals of the Ax-4 private astronaut mission, as well as Russia's Progress 92 cargo flight. Axiom's astronauts must depart the ISS before Crew-11's launch, which will be followed in a matter of days by the departure of Crew-10. That will clear a port for the arrival of SpaceX's CRS-33 Cargo Dragon and make way for the upcoming boost maneuver.\"Providing multiple methods for us to maintain the station altitude is critically important as we continue to operate and get the most use out of our limited launch resources that we do have,\" Bill Spetch, ISS operations integration manager at NASA's Johnson Space Center in Houston, said during Thursday's briefing. \"We're really looking forward to demonstrating that capability with [CRS-33] showing up after we get through the Crew-11 and Crew-10 handover.\"Between now and the end of the year, the ISS is also expecting the arrival of Northrop Grumman's NG-23 Cygnus cargo mission, JAXA's HTV-X cargo vehicle, and the Soyuz MS-28 mission carrying NASA astronaut Christopher Williams and Russian cosmonauts Sergey Kud-Sverchkov and Sergey Mikayev in November.The members of Crew-11 will be part of ISS Expedition 73/74 and will experience a significant milestone during their mission. Nov. 2 will mark 25 consecutive years that the ISS has sustained a continual human presence. \"That's going to be a huge milestone,\" said Ken Bowersox, associate administrator of NASA's Space Operations Mission Directorate. The occasion, he added, is \"a great testament to the work of our commercial partners, our international partners and the whole NASA team.\"Crew-11's launch window opens at 12:09 p.m. EDT (1609 GMT) on July 31. If that launch schedule holds, the crew will have a 39-hour transit to meet up with the space station — the longest time between launch and rendezvous for a Crew Dragon ISS mission to date. Mission constraints like onboard consumables dictate that the spacecraft dock with the ISS within a 40-hour window following launch, but Cardman says that comes with some wiggle room.\"That 40-hour limit is in place so that we can preserve margin for the downhill as well,\" Cardman explained to Space.com, \"so nothing magically happens at 40 hours and one second.\"An on-time departure would put Crew-11 on track to dock with the ISS around 3:00 p.m. EDT (1900 GMT) on Aug. 3, after which the four astronauts will settle into their new orbital home for a long-duration stint aboard the space station that will be filled with a complex schedule of science, maintenance and staring endlessly at the wonders of Earth below.\"We will have a world-class physics experiment one hour and then fixing the toilet the next hour and then doing some biological science data collection on myself the next,\" Cardman explained.\"Understanding how to live and work for long durations — going and staying — is a really interesting challenge, and I'm grateful that we've gotten the chance to do this — to hone our skills on the ISS, so that we can do this for longer durations on the moon,\" she said. \"The International Space Station, in my perspective, is an absolutely critical stepping stone as we think about going farther afield.\"NASA's Artemis program aims to extend humanity's reach back to the lunar surface, where the space agency hopes to establish a sustained presence, in part as a testing ground for even longer missions to Mars.Cardman, like the rest of Crew-11, is excited for her mission ahead, and also for her first spaceflight. \"I have spent so many years imagining exactly what this is going to be like. I know very much what my day-to-day will be like, but I have no idea how it will make me feel. I can't wait to find that out, and I can't wait to find that out specifically with this crew. Both Oleg and I are rookies, and we've got the great fortune of flying with two veterans who will hopefully be there to take pictures of us taking our first pictures of Earth.\"Fincke, who has logged 382 days in space to date over the course of three missions, is the most experienced of the Crew-11 spacefarers.\"I'm looking forward to seeing Zena and Oleg's expressions the first time that they're in space, because I remember how moving it was, and how breathtaking it was for me, and I want to share their joy in that,\" he told Space.com.His advice for his fellow crew members: \"Really enjoy every day. Whether it's fixing a toilet or doing some world-class science, or getting ready for a spacewalk, or talking to some school kids on the ground, it's just a really special time.\" Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. Josh Dinner is the Staff Writer for Spaceflight at Space.com. He is a writer and photographer with a passion for science and space exploration, and has been working the space beat since 2016. Josh has covered the evolution of NASA's commercial spaceflight partnerships and crewed missions from the Space Coast, as well as NASA science missions and more. He also enjoys building 1:144-scale model rockets and human-flown spacecraft. Find some of Josh's launch photography on Instagram and his website, and follow him on X, where he mostly posts in haiku.",
  "image": "https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-widget-type=\"contentparsed\" id=\"content\"\u003e\n\u003csection\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cpicture data-new-v2-image=\"true\"\u003e\n\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-825-80.jpg.webp 1920w, https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-825-80.jpg.webp 1200w, https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-825-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-825-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-320-80.jpg.webp 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\"/\u003e\n\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ.jpg\" alt=\"Four humans in blue jumpsuits sit in a spacecraft.\" srcset=\"https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-825-80.jpg 1920w, https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-825-80.jpg 1200w, https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-825-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-825-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ-320-80.jpg 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\" data-new-v2-image=\"true\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/ijzJTRXFVqz6VpLxqqqQQ.jpg\" data-pin-nopin=\"true\" fetchpriority=\"high\"/\u003e\n\u003c/picture\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003e\n\u003cspan\u003eMembers of SpaceX Crew-11 sit aboard a Dragon spacecraft. From left: Roscosmos cosmonaut Oleg Platonov, NASA astronaut Mike Fincke and Zena Cardman, and JAXA astronaut Kimiya Yui.\u003c/span\u003e\n\u003cspan\u003e(Image credit: NASA)\u003c/span\u003e\n\u003c/figcaption\u003e\n\u003c/div\u003e\n\n\u003cdiv id=\"article-body\"\u003e\n\u003cp\u003eThe next astronaut launch to the International Space Station (ISS) is just around the corner.\u003c/p\u003e\u003cp\u003eNASA is targeting July 31 for the launch of its next astronaut mission with SpaceX. The flight, called Crew-11, will lift off atop a \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/18962-spacex-falcon-9.html\" data-before-rewrite-localise=\"https://www.space.com/18962-spacex-falcon-9.html\"\u003e\u003cu\u003eFalcon 9\u003c/u\u003e\u003c/a\u003e rocket from Launch Complex-39A (LC-39A), at NASA\u0026#39;s Kennedy Space Center in Florida, sending the Crew Dragon Endeavour to \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/low-earth-orbit\" data-before-rewrite-localise=\"https://www.space.com/low-earth-orbit\"\u003e\u003cu\u003elow Earth orbit\u003c/u\u003e\u003c/a\u003e (LEO). The flight will mark the sixth mission for Endeavour, making it SpaceX\u0026#39;s most-flown Crew Dragon spacecraft.\u003c/p\u003e\u003cp\u003eAboard, NASA astronauts Zena Cardman (Crew-11 commander) and Mike Fincke (pilot) will be joined by mission specialists Kimiya Yui from the Japanese Aerospace Exploration Agency (\u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/22672-japan-aerospace-exploration-agency.html\" data-before-rewrite-localise=\"https://www.space.com/22672-japan-aerospace-exploration-agency.html\"\u003e\u003cu\u003eJAXA\u003c/u\u003e\u003c/a\u003e), and Oleg Platonov, of the Russian space agency \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/22724-roscosmos.html\" data-before-rewrite-localise=\"https://www.space.com/22724-roscosmos.html\"\u003e\u003cu\u003eRoscosmos\u003c/u\u003e\u003c/a\u003e. This will be the first spaceflight for Cardman and Platonov, the second for Yui and the fourth for Fincke.\u003c/p\u003e\u003cp\u003eThe Falcon 9 first stage supporting Crew-11, designated B1094, has launched two previous missions: \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/space-exploration/launches-spacecraft/spacex-starlink-11-9-b1063-vsfb\" data-before-rewrite-localise=\"https://www.space.com/space-exploration/launches-spacecraft/spacex-starlink-11-9-b1063-vsfb\"\u003e\u003cu\u003eStarlink 12-10\u003c/u\u003e\u003c/a\u003e and, most recently, the private \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/space-exploration/launches-spacecraft/spacex-launches-historic-private-axiom-4-astronaut-mission-to-the-iss\" data-before-rewrite-localise=\"https://www.space.com/space-exploration/launches-spacecraft/spacex-launches-historic-private-axiom-4-astronaut-mission-to-the-iss\"\u003e\u003cu\u003eAx-4 astronaut mission\u003c/u\u003e\u003c/a\u003e on June 25. B1094 is currently undergoing the final stages of refurbishment leading up to the July 31 launch. It will be transported to SpaceX\u0026#39;s Horizontal Integration Facility next to LC-39A to be mated to the rocket\u0026#39;s second stage ahead of a static-fire test at the pad in a week or two, according to NASA\u0026#39;s Commercial Crew Program Manager Steve Stich during a mission briefing on Thursday (July 10).\u003c/p\u003e\u003cp\u003eCrew Dragon Endeavour has also undergone refurbishment since its last launch  — Crew-8, in March 2024  — and has received some upgrades ahead of the Crew-11 mission. Endeavour will be the first Crew Dragon to fly with the updated drogue 3.1 parachutes, first flown on SpaceX\u0026#39;s CRS-32 Cargo Dragon mission. The upgrades include stronger crowns in the parachutes\u0026#39; materials and a new packaging system designed for \u0026#34;more orderly inflation,\u0026#34; Stich said during Thursday\u0026#39;s briefing.\u003c/p\u003e\u003cp\u003e\u0026#34;This Dragon spacecraft has successfully flown 18 crew members representing eight countries to space already, starting with [NASA astronauts] Bob [Behnken] and Doug [Hurley] in 2020, when it \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/spacex-crew-dragon-demo-2-test-flight-explained.html\" data-before-rewrite-localise=\"https://www.space.com/spacex-crew-dragon-demo-2-test-flight-explained.html\"\u003e\u003cu\u003ereturned human spaceflight capabilities\u003c/u\u003e\u003c/a\u003e to the United States for the first time since the shuttle retired in July of 2011,\u0026#34; explained Sarah Walker, SpaceX\u0026#39;s director of Dragon mission management.\u003c/p\u003e\u003cp\u003eCrew-11 had been slated for launch in \u0026#34;late July/early August\u0026#34; but was accelerated by about 2 weeks to accommodate a critical ISS reboost maneuver to be performed by a SpaceX Cargo Dragon as a part of the upcoming CRS-33 station resupply mission. CRS-33 will be the first Cargo Dragon with altitude-correction hardware designed to maintain the space station\u0026#39;s orbit, and will mark a step furthering NASA and SpaceX\u0026#39;s efforts to develop a \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/nasa-spacex-international-space-station-deorbit-vehicle\" data-before-rewrite-localise=\"https://www.space.com/nasa-spacex-international-space-station-deorbit-vehicle\"\u003e\u003cu\u003eU.S. vehicle that will deorbit the ISS\u003c/u\u003e\u003c/a\u003e at the end of its life at the end of 2030 or thereabouts.\u003c/p\u003e\u003cdiv data-hydrate=\"true\" id=\"slice-container-newsletterForm-articleInbodyContent-9BVwXSRakUMAaAfnCJpWDj\"\u003e\u003csection\u003e\u003cp\u003eBreaking space news, the latest updates on rocket launches, skywatching events and more!\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e\u003cp\u003eThe Crew-11 launch date is part of a tight choreography of space station traffic over the next several months, which includes the recent arrivals of the Ax-4 private astronaut mission, as well as Russia\u0026#39;s Progress 92 cargo flight. Axiom\u0026#39;s astronauts must depart the ISS before Crew-11\u0026#39;s launch, which will be followed in a matter of days by the departure of Crew-10. That will clear a port for the arrival of SpaceX\u0026#39;s CRS-33 Cargo Dragon and make way for the upcoming boost maneuver.\u003c/p\u003e\u003cp\u003e\u0026#34;Providing multiple methods for us to maintain the station altitude is critically important as we continue to operate and get the most use out of our limited launch resources that we do have,\u0026#34; Bill Spetch, ISS operations integration manager at NASA\u0026#39;s \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/17216-nasa-johnson-space-center.html\" data-before-rewrite-localise=\"https://www.space.com/17216-nasa-johnson-space-center.html\"\u003e\u003cu\u003eJohnson Space Center\u003c/u\u003e\u003c/a\u003e in Houston, said during Thursday\u0026#39;s briefing. \u0026#34;We\u0026#39;re really looking forward to demonstrating that capability with [CRS-33] showing up after we get through the Crew-11 and Crew-10 handover.\u0026#34;\u003c/p\u003e\u003cp\u003eBetween now and the end of the year, the ISS is also expecting the arrival of Northrop Grumman\u0026#39;s NG-23 \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/cygnus-spacecraft.html\" data-before-rewrite-localise=\"https://www.space.com/cygnus-spacecraft.html\"\u003e\u003cu\u003eCygnus\u003c/u\u003e\u003c/a\u003e cargo mission, JAXA\u0026#39;s HTV-X cargo vehicle, and the Soyuz MS-28 mission carrying NASA astronaut Christopher Williams and Russian cosmonauts Sergey Kud-Sverchkov and Sergey Mikayev in November.\u003c/p\u003e\u003cp\u003eThe members of Crew-11 will be part of ISS Expedition 73/74 and will experience a significant milestone during their mission. Nov. 2 will mark 25 consecutive years that the ISS has sustained a continual human presence. \u0026#34;That\u0026#39;s going to be a huge milestone,\u0026#34; said Ken Bowersox, associate administrator of NASA\u0026#39;s Space Operations Mission Directorate. The occasion, he added, is \u0026#34;a great testament to the work of our commercial partners, our international partners and the whole NASA team.\u0026#34;\u003c/p\u003e\u003cp\u003eCrew-11\u0026#39;s launch window opens at 12:09 p.m. EDT (1609 GMT) on July 31. If that launch schedule holds, the crew will have a 39-hour transit to meet up with the space station — the longest time between launch and rendezvous for a Crew Dragon ISS mission to date. Mission constraints like onboard consumables dictate that the spacecraft dock with the ISS within a 40-hour window following launch, but Cardman says that comes with some wiggle room.\u003c/p\u003e\u003cp\u003e\u0026#34;That 40-hour limit is in place so that we can preserve margin for the downhill as well,\u0026#34; Cardman explained to Space.com, \u0026#34;so nothing magically happens at 40 hours and one second.\u0026#34;\u003c/p\u003e\u003cp\u003eAn on-time departure would put Crew-11 on track to dock with the ISS around 3:00 p.m. EDT (1900 GMT) on Aug. 3, after which the four astronauts will settle into their new orbital home for a long-duration stint aboard the space station that will be filled with a complex schedule of science, maintenance and staring endlessly at the wonders of \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/54-earth-history-composition-and-atmosphere.html\" data-before-rewrite-localise=\"https://www.space.com/54-earth-history-composition-and-atmosphere.html\"\u003e\u003cu\u003eEarth\u003c/u\u003e\u003c/a\u003e below.\u003c/p\u003e\u003cp\u003e\u0026#34;We will have a world-class physics experiment one hour and then fixing the toilet the next hour and then doing some biological science data collection on myself the next,\u0026#34; Cardman explained.\u003c/p\u003e\u003cp\u003e\u0026#34;Understanding how to live and work for long durations — going and staying — is a really interesting challenge, and I\u0026#39;m grateful that we\u0026#39;ve gotten the chance to do this — to hone our skills on the ISS, so that we can do this for longer durations on \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/55-earths-moon-formation-composition-and-orbit.html\" data-before-rewrite-localise=\"https://www.space.com/55-earths-moon-formation-composition-and-orbit.html\"\u003e\u003cu\u003ethe moon\u003c/u\u003e\u003c/a\u003e,\u0026#34; she said. \u0026#34;The \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/16748-international-space-station.html\" data-before-rewrite-localise=\"https://www.space.com/16748-international-space-station.html\"\u003e\u003cu\u003eInternational Space Station\u003c/u\u003e\u003c/a\u003e, in my perspective, is an absolutely critical stepping stone as we think about going farther afield.\u0026#34;\u003c/p\u003e\u003cp\u003eNASA\u0026#39;s \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/artemis-program.html\" data-before-rewrite-localise=\"https://www.space.com/artemis-program.html\"\u003e\u003cu\u003eArtemis program\u003c/u\u003e\u003c/a\u003e aims to extend humanity\u0026#39;s reach back to the lunar surface, where the space agency hopes to establish a sustained presence, in part as a testing ground for even longer missions to \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/47-mars-the-red-planet-fourth-planet-from-the-sun.html\" data-before-rewrite-localise=\"https://www.space.com/47-mars-the-red-planet-fourth-planet-from-the-sun.html\"\u003e\u003cu\u003eMars\u003c/u\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eCardman, like the rest of Crew-11, is excited for her mission ahead, and also for her first spaceflight. \u0026#34;I have spent so many years imagining exactly what this is going to be like. I know very much what my day-to-day will be like, but I have no idea how it will make me feel. I can\u0026#39;t wait to find that out, and I can\u0026#39;t wait to find that out specifically with this crew. Both Oleg and I are rookies, and we\u0026#39;ve got the great fortune of flying with two veterans who will hopefully be there to take pictures of us taking our first pictures of Earth.\u0026#34;\u003c/p\u003e\u003cp\u003eFincke, who has logged 382 days in space to date over the course of three missions, is the most experienced of the Crew-11 spacefarers.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m looking forward to seeing Zena and Oleg\u0026#39;s expressions the first time that they\u0026#39;re in space, because I remember how moving it was, and how breathtaking it was for me, and I want to share their joy in that,\u0026#34; he told \u003cu\u003eSpace.com\u003c/u\u003e.\u003c/p\u003e\u003cp\u003eHis advice for his fellow crew members: \u0026#34;Really enjoy every day. Whether it\u0026#39;s fixing a toilet or doing some world-class science, or getting ready for a \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/spacewalk-history.html\" data-before-rewrite-localise=\"https://www.space.com/spacewalk-history.html\"\u003e\u003cu\u003espacewalk\u003c/u\u003e\u003c/a\u003e, or talking to some school kids on the ground, it\u0026#39;s just a really special time.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://forums.space.com/\"\u003eJoin our Space Forums\u003c/a\u003e to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: \u003ca href=\"mailto:community@space.com\"\u003ecommunity@space.com.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"slice-container-authorBio-9BVwXSRakUMAaAfnCJpWDj\"\u003e\u003cp\u003eJosh Dinner is the Staff Writer for Spaceflight at Space.com. He is a writer and photographer with a passion for science and space exploration, and has been working the space beat since 2016. Josh has covered the evolution of NASA\u0026#39;s commercial spaceflight partnerships and crewed missions from the Space Coast, as well as NASA science missions and more. He also enjoys building 1:144-scale model rockets and human-flown spacecraft. Find some of Josh\u0026#39;s launch photography on \u003ca href=\"https://www.instagram.com/joshdinner/\" target=\"_blank\"\u003eInstagram\u003c/a\u003e and \u003ca href=\"https://www.joshdinner.com/\" target=\"_blank\"\u003ehis website\u003c/a\u003e, and follow him on \u003ca href=\"https://twitter.com/JoshDinner\" target=\"_blank\"\u003eX\u003c/a\u003e, where he mostly posts in haiku.\u003c/p\u003e\u003c/div\u003e\n\n\u003c/section\u003e\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-07-10T22:18:23Z",
  "modifiedTime": null
}
