{
  "id": "030ecd97-84f2-4b74-a8ca-6c67ef100566",
  "title": "Meta announces its Superintelligence Labs Chief Scientist: former OpenAI GPT-4 co-creator Shengjia Zhao",
  "link": "https://venturebeat.com/ai/meta-announces-its-superintelligence-labs-chief-scientist-former-openai-gpt-4-co-creator-shengjia-zhao/",
  "description": "The move underscores Meta’s strategy of spending aggressively now to secure a dominant position in what it views as the next foundational technology platform.",
  "author": "Carl Franzen",
  "published": "Sat, 26 Jul 2025 00:58:24 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "AI, ML and Deep Learning",
    "artificial superintelligence",
    "asi",
    "ChatGPT",
    "Conversational AI",
    "GPT-4",
    "hiring",
    "meta superintelligence labs",
    "NLP",
    "OpenAI",
    "shengjia zhao",
    "superintelligence"
  ],
  "byline": "Carl Franzen",
  "length": 5748,
  "excerpt": "The move underscores Meta’s strategy of spending aggressively now to secure a dominant position in what it views as the next foundational technology platform.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "July 25, 2025 5:58 PM Mark Zuckerberg sits beside former Scale AI CEO Alexandr Wang and new Superintelligence Labs Chief Scientist Shengjia Zhao. Credit: Mark Zuckerberg/Meta Want smarter insights in your inbox? Sign up for our weekly newsletters to get only what matters to enterprise AI, data, and security leaders. Subscribe Now Meta has appointed Shengjia Zhao, a former OpenAI researcher and co‑creator of GPT‑4, as the Chief Scientist of its newly created Meta Superintelligence Labs (MSL). The announcement was made Friday by Mark Zuckerberg on Threads, noting Zhao will lead the lab’s scientific agenda alongside him and Alexandr Wang, the former CEO of Scale AI who Meta recently brought onboard as Chief AI Officer. “I am very excited to take up the role of chief scientist for meta super-intelligence labs. Looking forward to building asi [artificial superintelligence] and aligning it to empower people with the amazing team here. Let’s build!” Zhao wrote in his own Threads post. “Artificial superintelligence” is a nebulous term used in the AI industry to describe systems more powerful and capable than any today, beyond even the smartest humans, making them difficult to control. The AI Impact Series Returns to San Francisco - August 5 The next phase of AI is here - are you ready? Join leaders from Block, GSK, and SAP for an exclusive look at how autonomous agents are reshaping enterprise workflows - from real-time decision-making to end-to-end automation. Secure your spot now - space is limited: https://bit.ly/3GuuPLF Zhao’s strong commercial AI background Zhao, who previously worked at OpenAI, played a key role in the development of foundational models like GPT-4 and GPT-4o, according to arXiv system cards and research papers listing him as a co-author. He’s also known for his academic work on generative models and fair representations, with widely cited papers in venues like NeurIPS, ICML, and ICLR. Zhao joins Meta amid a high-stakes hiring blitz across the AI industry. Over the past few months, Meta has poached researchers from OpenAI, Apple, Google, and Anthropic as part of a multibillion-dollar bet on superintelligence as CNN reported. Meta recently invested $14.3 billion in Scale AI, acquiring a 49% stake and bringing on Wang to lead the superintelligence effort. Former GitHub CEO Nat Friedman also joined the team. The company has reportedly offered compensation packages worth as much as $100 million to $300 million over four years to lure top AI talent, according to multiple reports. One claim from a rival AI startup founder alleged Meta offered $1.25 billion over four years—approximately $312 million per year—to a single candidate who declined. Other insiders say Meta’s most senior AI scientists may be receiving $10 million+ per year, while first-year comp for some new hires reportedly reached $100 million. Aspirations of leading the AI frontier Zuckerberg has made no secret of his ambition to make Meta a leader in AI’s next frontier, repeatedly stating that the company plans to “invest hundreds of billions of dollars into compute to build superintelligence” using its own business-generated capital. He said the Llama 4 rollout underscored the importance of elite talent: “You can have hundreds of thousands of GPUs, but if you don’t have the right team developing the model, it doesn’t matter.” Meta’s fundamental AI research group (FAIR), still led by acclaimed scientist Yann LeCun, will remain separate from the new lab. The creation of Meta Superintelligence Labs signals a more product- and mission-focused arm of Meta’s AI efforts, centered on building and aligning ASI with human interests. Making up for the mixed reception of Llama 4 However, Meta’s push into superintelligence has come on the heels of a bumpy rollout of its latest open-source foundation models. The company released its Llama 4 model family in April 2025, positioning it as a leap forward in multimodal reasoning and long-context understanding. But the release has struggled to gain traction amid the rise of powerful Chinese open-source rivals like DeepSeek and Qwen. Meta faced public criticism from researchers and developers who cited poor real-world performance, confusion around benchmark results, and inconsistent quality across deployments. Some accused the company of “benchmark gamesmanship” and using unreleased optimized versions of Llama 4 to boost public perception—a claim Meta has denied. Internal sources blamed fast rollout timelines and bugs for the issues, but the episode has cast a shadow over Meta’s generative AI credibility just as it embarks on its most ambitious effort yet. Jim Fan, a former Stanford colleague of Zhao and now Nvidia’s Director of Robotics and Distinguished Scientist, offered his endorsement on X: “Shengjia is one of the brightest, humblest, and most passionate scientists I know. Very bullish on MSL!” The move underscores Meta’s strategy of spending aggressively now to secure a dominant position in what it views as the next foundational technology platform — one that could eclipse the mobile internet. As Zuckerberg sees it, ASI isn’t a moonshot — it’s the next frontier, and Meta intends to lead. Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/07/zuck-superintel.png?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2025-07-26T00:58:24+00:00\" datetime=\"2025-07-26T00:58:24+00:00\"\u003eJuly 25, 2025 5:58 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"500\" src=\"https://venturebeat.com/wp-content/uploads/2025/07/zuck-superintel.png?w=750\" alt=\"Mark Zuckerberg sits beside former Scale AI CEO Alexandr Wang and new Superintelligence Labs Chief Scientist Shengjia Zhao\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMark Zuckerberg sits beside former Scale AI  CEO Alexandr Wang and new Superintelligence Labs Chief Scientist Shengjia Zhao. Credit: Mark Zuckerberg/Meta\u003c/span\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eWant smarter insights in your inbox? Sign up for our weekly newsletters to get only what matters to enterprise AI, data, and security leaders.\u003c/em\u003e \u003cem\u003e\u003ca href=\"https://venturebeat.com/newsletters/\"\u003eSubscribe Now\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003eMeta has appointed \u003cstrong\u003eShengjia Zhao\u003c/strong\u003e, a former OpenAI researcher and \u003ca href=\"https://scholar.google.com/citations?user=bMoauM4AAAAJ\u0026amp;hl=en\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eco‑creator of GPT‑4\u003c/a\u003e, as the Chief Scientist of its newly created \u003cstrong\u003eMeta Superintelligence Labs (MSL)\u003c/strong\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe announcement was made Friday by \u003ca href=\"https://www.threads.com/@zuck/post/DMiwjXJSYCd/just-shared-internally-that-zhaoshengjia-will-be-chief-scientist-of-meta-superin\"\u003eMark Zuckerberg on Threads\u003c/a\u003e, noting Zhao will lead the lab’s scientific agenda alongside him and Alexandr Wang, the former CEO of Scale AI who Meta recently brought onboard as Chief AI Officer.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e“I am very excited to take up the role of chief scientist for meta super-intelligence labs. Looking forward to building asi [artificial superintelligence] and aligning it to empower people with the amazing team here. Let’s build!”\u003c/em\u003e Zhao wrote in \u003ca href=\"https://www.threads.com/@shengjia_zhao/post/DMivXCEoKUn/i-am-very-excited-to-take-up-the-role-of-chief-scientist\"\u003ehis own Threads post\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Artificial superintelligence” is a nebulous term used in the AI industry to describe systems more powerful and capable than any today, beyond even the smartest humans, making them difficult to control. \u003c/p\u003e\n\n\n\n\u003cdiv id=\"boilerplate_2803147\"\u003e\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThe AI Impact Series Returns to San Francisco - August 5\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe next phase of AI is here - are you ready? Join leaders from Block, GSK, and SAP for an exclusive look at how autonomous agents are reshaping enterprise workflows - from real-time decision-making to end-to-end automation.\u003c/p\u003e\n\n\n\n\u003cp\u003eSecure your spot now - space is limited: \u003ca href=\"https://bit.ly/3GuuPLF\"\u003ehttps://bit.ly/3GuuPLF\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003ch2 id=\"h-zhao-s-strong-commercial-ai-background\"\u003eZhao’s strong commercial AI background\u003c/h2\u003e\n\n\n\n\u003cp\u003eZhao, who previously worked at OpenAI, played a key role in the development of foundational models like GPT-4 and GPT-4o, according to arXiv system cards and research papers listing him as a co-author. He’s also known for his academic work on generative models and fair representations, with widely cited papers in venues like NeurIPS, ICML, and ICLR.\u003c/p\u003e\n\n\n\n\u003cp\u003eZhao joins Meta amid a high-stakes hiring blitz across the AI industry. Over the past few months, Meta has poached researchers from OpenAI, Apple, Google, and Anthropic as part of a multibillion-dollar bet on superintelligence as \u003ca href=\"https://www.cnn.com/2025/07/25/tech/meta-ai-superintelligence-team-who-its-hiring\"\u003eCNN reported.\u003c/a\u003e \u003c/p\u003e\n\n\n\n\u003cp\u003eMeta recently invested $14.3 billion in Scale AI, acquiring a 49% stake and bringing on Wang to lead the superintelligence effort. Former GitHub CEO Nat Friedman also joined the team. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe company has reportedly offered compensation packages worth as much as \u003cstrong\u003e$100 million to $300 million over four years\u003c/strong\u003e to lure top AI talent, according to multiple reports. One claim from a rival AI startup founder alleged Meta offered \u003cstrong\u003e$1.25 billion over four years\u003c/strong\u003e—approximately \u003cstrong\u003e$312 million per year\u003c/strong\u003e—to a single candidate who declined. \u003c/p\u003e\n\n\n\n\u003cp\u003eOther insiders say Meta’s most senior AI scientists may be receiving \u003cstrong\u003e$10 million+ per year\u003c/strong\u003e, while first-year comp for some new hires reportedly reached \u003cstrong\u003e$100 million\u003c/strong\u003e.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-aspirations-of-leading-the-ai-frontier\"\u003eAspirations of leading the AI frontier\u003c/h2\u003e\n\n\n\n\u003cp\u003eZuckerberg has made no secret of his ambition to make Meta a leader in AI’s next frontier, repeatedly stating that the company plans to “invest hundreds of billions of dollars into compute to build superintelligence” using its own business-generated capital. \u003c/p\u003e\n\n\n\n\u003cp\u003eHe said the Llama 4 rollout underscored the importance of elite talent: “You can have hundreds of thousands of GPUs, but if you don’t have the right team developing the model, it doesn’t matter.”\u003c/p\u003e\n\n\n\n\u003cp\u003eMeta’s fundamental AI research group (FAIR), still led by acclaimed scientist Yann LeCun, will remain separate from the new lab. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe creation of Meta Superintelligence Labs signals a more product- and mission-focused arm of Meta’s AI efforts, centered on building and aligning ASI with human interests.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-making-up-for-the-mixed-reception-of-llama-4\"\u003eMaking up for the mixed reception of Llama 4\u003c/h2\u003e\n\n\n\n\u003cp\u003eHowever, Meta’s push into superintelligence has come on the heels of a bumpy rollout of its latest open-source foundation models. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe company released its \u003ca href=\"https://venturebeat.com/ai/metas-answer-to-deepseek-is-here-llama-4-launches-with-long-context-scout-and-maverick-models-and-2t-parameter-behemoth-on-the-way/\"\u003eLlama 4 model family in April 2025\u003c/a\u003e, positioning it as a leap forward in multimodal reasoning and long-context understanding. But the release has struggled to gain traction amid the rise of powerful Chinese open-source rivals like DeepSeek and Qwen. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://venturebeat.com/ai/meta-defends-llama-4-release-against-reports-of-mixed-quality-blames-bugs/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMeta faced public criticism\u003c/a\u003e from researchers and developers who cited poor real-world performance, confusion around benchmark results, and inconsistent quality across deployments. \u003c/p\u003e\n\n\n\n\u003cp\u003eSome accused the company of “benchmark gamesmanship” and using unreleased optimized versions of Llama 4 to boost public perception—a claim Meta has denied. \u003c/p\u003e\n\n\n\n\u003cp\u003eInternal sources blamed fast rollout timelines and bugs for the issues, but the episode has cast a shadow over Meta’s generative AI credibility just as it embarks on its most ambitious effort yet. \u003c/p\u003e\n\n\n\n\u003cp\u003eJim Fan, a former Stanford colleague of Zhao and now Nvidia’s Director of Robotics and Distinguished Scientist, \u003ca href=\"https://x.com/DrJimFan/status/1948841055916622157\"\u003eoffered his endorsement on X\u003c/a\u003e: “Shengjia is one of the brightest, humblest, and most passionate scientists I know. Very bullish on MSL!”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe move underscores Meta’s strategy of spending aggressively now to secure a dominant position in what it views as the next foundational technology platform — one that could eclipse the mobile internet. As Zuckerberg sees it, ASI isn’t a moonshot — it’s the next frontier, and Meta intends to lead.\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://venturebeat.com/wp-content/themes/vb-news/brand/img/vb-daily-phone.png\" alt=\"\"/\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-07-26T00:58:24Z",
  "modifiedTime": "2025-07-26T00:58:30Z"
}
