{
  "id": "23dcea43-2c47-4048-8c06-2a6d210e5278",
  "title": "Pivot: Reid Hoffman joins Kara Swisher and Scott Galloway to go deep on AI news",
  "link": "",
  "description": "Masters of Scale brings you a special episode of Pivot with Kara Swisher and Scott Galloway featuring conversation with our show’s founding host Reid Hoffman. Together, they discuss the hype and fears around DeepSeek, why spending money on AI is a good thing and insights from Reid’s newest book: \"Superagency: What Could Possibly Go Right with Our AI Future.\" Then, Kara and Scott discuss Meta settling with Trump for $25 million, and the White House attempt to take a page out of Elon's playbook in offering buyouts to federal employees. Plus, the contentious RFK Jr. hearings. And will Kara get a podcaster seat at the White House briefings? We hope you enjoy! About Pivot:Every Tuesday and Friday, tech journalist Kara Swisher and NYU Professor Scott Galloway offer sharp, unfiltered insights into the biggest stories in tech, business, and politics. They make bold predictions, pick winners and losers, and bicker and banter like no one else. After all, with great power comes great scrutiny. From New York Magazine and the Vox Media Podcast Network.Listen and follow Pivot in your favorite podcast app: https://link.chtbl.com/PivotPod2025Subscribe to Pivot on YouTube: youtube.com/@pivotSee Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
  "author": "",
  "published": "Fri, 07 Feb 2025 10:00:00 -0000",
  "source": "https://rss.art19.com/masters-of-scale",
  "categories": [
    "Jeff Berman",
    "Mindset",
    "Bob Safian",
    "Diversity \u0026 Inclusion",
    "Management",
    "Entrepreneurship",
    "Business",
    "Reid Hoffman",
    "Startups"
  ],
  "byline": "",
  "length": 0,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "",
  "image": "",
  "html": "",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
