{
  "id": "2572172b-7bc1-4486-9c4e-26b89bcc258e",
  "title": "Founders Need to Be Ruthless When Chasing Deals",
  "link": "https://steveblank.com/2024/04/16/founders-need-to-be-ruthless-when-chasing-deals/",
  "description": "One of the most exciting things a startup CEO in a business-to-business market can hear from a potential customer is, “We’re excited. When can you come back and show us a prototype?” This can be the beginning of a profitable customer relationship or a disappointing sinkhole of wasted time, money, resources, and a demoralized engineering […]",
  "author": "steve blank",
  "published": "Tue, 16 Apr 2024 13:00:20 +0000",
  "source": "https://steveblank.com/feed/",
  "categories": [
    "Customer Development",
    "E.piphany"
  ],
  "byline": "",
  "length": 7106,
  "excerpt": "One of the most exciting things a startup CEO in a business-to-business market can hear from a potential customer is, “We’re excited. When can you come back and show us a prototype?” This can be th…",
  "siteName": "Steve Blank",
  "favicon": "https://s0.wp.com/i/webclip.png",
  "text": "One of the most exciting things a startup CEO in a business-to-business market can hear from a potential customer is, “We’re excited. When can you come back and show us a prototype?” This can be the beginning of a profitable customer relationship or a disappointing sinkhole of wasted time, money, resources, and a demoralized engineering team. It all depends on one question every startup CEO needs to ask. I was having coffee and pastries with Justin, an ex-student, listening to him to complain over the time he wasted with a potential customer. He was building a complex robotic system for factories. “We spent weeks integrating the sample data they gave us to build a functional prototype, and then after our demo they just ghosted us. I still don’t know what happened!” After listening to how he got into that predicament, I realized it sounded exactly like the mistake I had made selling enterprise software. Enthusiasm Versus Validation Finding product/market fit is the holy grail for startups. For me, it was a real rush when potential users in a large company loved our slideware and our minimum viable product (MVP). They were ecstatic about the time the product could save them and started pulling others into our demos. A few critical internal recommenders and technical evaluators gave our concept the thumbs up. Now we were in discussions with the potential buyers who had the corporate checkbook, and they were ready to have a “next step” conversation. This buyer wanted us to transform our slideware and MVP into a demonstration of utility with their actual data. This was going to require our small, overcommitted engineering team to turn the MVP into a serviceable prototype. When I heard a potential customer offer us their own internal customer data I was already imagining popping Champagne corks once we showed them our prototype. (For context, our products sold for hundreds of thousands of dollars, and lifetime value to each customer was potentially measured in millions.) I rallied our engineering team to work for the next few months to get the demo of the prototype ready. As much as we could, we integrated the customers’ users and technical evaluators into our prototype development process. Then came the meeting with the potential customer. And it went great. The users were in the room, the buyer asked lots of questions, everyone made some suggestions and then we all went home. And the follow up from the potential customer? Crickets… Even our user advocates stopped responding to emails. What did I do wrong? In my unbridled and very naive enthusiasm for impressing a potential customer, I made a rookie mistake – I never asked the user champion or the potential buyer what were the steps for turning the demo into a purchase order. I had made a ton of assumptions – all of them wrong. And most importantly I wasted the most precious things a startup has – engineering resources, time, and money. In hindsight I had no idea whether my potential customer was asking other companies to demo their product. I had no idea whether the buyer had a budget or even purchase authority. If they did, I had no idea of their timeline for a decision. I had no idea who were the other decision-makers in the company to integrate, deploy and scale the product. I didn’t even know what the success criteria for getting an order looked like. I didn’t check for warning signs of a deal that would go nowhere: whether the person requesting the demo was in a business unit or a tech evaluation/innovation group, whether they’d pay for a functional prototype they could use, etc.  And for good measure, I never even considered asking the potential customer to pay for the demo and/or my costs. (My only excuse was that this was my first foray into enterprise sales.) Be Ruthless about the Opportunity Costs of Chasing Deals After that demoralizing experience I realized that every low probability demo got us further from success rather than closer. While a big company could afford to chase lots of deals I just had a small set of engineering resources. I became ruthless about the opportunity costs of chasing deals whose outcome I couldn’t predict. So we built rigor into our sales process. We built a sales road map of finding first product/market fit with the users and recommenders. However, we realized that there was a second product/market fit with the organization(s) that controlled the budget and the path to deployment and scale. For this second group of gatekeepers we came up with a cheap hack to validate that a demo wasn’t just a tire-kicking exercise on their part. First, we asked them basic questions about the process: the success criteria, the decision timeline, did a budget exist, who had the purchase authority, what were the roles and approval processes of other organizations (IT, Compliance and Security, etc.) and what was the expected rate of scaling the product across their enterprise. (All the rookie questions I should have asked the first time around.) That was just the starting point to decide if we wanted to invest our resources. We followed up our questions by sending them a fully cancelable purchase order. We listed all the features we had demoed that had gotten the users excited and threw in the features the technical evaluators had suggested. And we listed our price. In big letters the purchase order said, “FULLY CANCELABLE.” And then we sent it to the head of the group that asked us for the prototype. As you can imagine most of the time the response was – WTF? Figure Out Who’s A Serious Prospect That’s when the real learning started. It was more than OK with me if they said they weren’t ready to sign. Or they told me there were other groups who needed be involved. I was now learning things I never would have if I just showed up with a prototype. By asking the customer to sign a fully cancelable purchase order we excluded “least likely to close prospects”; those who weren’t ready to make a purchase decision, or those who already had a vendor selected but needed to go through “demo theater” to make the selection seem fair. But most importantly it started a conversation with serious prospects that informed us about the entire end-to-end approval process to get an order- who were the additional people who needed to say yes across the corporation – and what were their decision processes. Our conversions of demos into orders went through the roof. Finally, I was learning some of the basics of complex sales. — Justin stared at his uneaten pastry for a while and then looked up at me and said smiling, “I never knew you could do that. That’s given me a few ideas what we could do.”  And just like that he was gone. Lessons Learned In complex sales there are multiple product/market fits – Users, Buyers, etc. — each with different criteria Don’t invest time and resources in building on-demand prototypes if you don’t know the path to a purchase order Use polite forcing functions, e.g. cancelable purchase orders, to discover who else needs to say “yes” Filed under: Customer Development, E.piphany |",
  "image": "https://steveblank.com/wp-content/uploads/2024/04/purchase-order-150x150.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\t\t\t\t\t\u003cp\u003eOne of the most exciting things a startup CEO in a business-to-business market can hear from a potential customer is, “We’re excited. When can you come back and show us a prototype?”\u003ca href=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/04/purchase-order.jpg?ssl=1\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" data-attachment-id=\"30745\" data-permalink=\"https://steveblank.com/2024/04/16/founders-need-to-be-ruthless-when-chasing-deals/purchase-order/\" data-orig-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/04/purchase-order.jpg?fit=1024%2C1024\u0026amp;ssl=1\" data-orig-size=\"1024,1024\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;1\u0026#34;}\" data-image-title=\"purchase order\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/04/purchase-order.jpg?fit=300%2C300\u0026amp;ssl=1\" data-large-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/04/purchase-order.jpg?fit=468%2C468\u0026amp;ssl=1\" tabindex=\"0\" role=\"button\" src=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/04/purchase-order.jpg?resize=112%2C112\u0026amp;ssl=1\" alt=\"\" width=\"112\" height=\"112\" srcset=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/04/purchase-order.jpg?resize=150%2C150\u0026amp;ssl=1 150w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/04/purchase-order.jpg?resize=300%2C300\u0026amp;ssl=1 300w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/04/purchase-order.jpg?resize=768%2C768\u0026amp;ssl=1 768w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/04/purchase-order.jpg?w=1024\u0026amp;ssl=1 1024w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/04/purchase-order.jpg?w=936\u0026amp;ssl=1 936w\" sizes=\"(max-width: 112px) 100vw, 112px\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThis can be the beginning of a profitable customer relationship or a disappointing sinkhole of wasted time, money, resources, and a demoralized engineering team.\u003c/p\u003e\n\u003cp\u003eIt all depends on one question every startup CEO needs to ask.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eI was having coffee and pastries with Justin, an ex-student, listening to him to complain over the time he wasted with a potential customer. He was building a complex robotic system for factories. “We spent weeks integrating the sample data they gave us to build a functional prototype, and then after our demo they just ghosted us. I still don’t know what happened!”\u003c/p\u003e\n\u003cp\u003eAfter listening to how he got into that predicament, I realized it sounded exactly like the mistake I had made selling enterprise software.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEnthusiasm Versus Validation\u003cbr/\u003e\n\u003c/strong\u003eFinding product/market fit is the holy grail for startups. For me, it was a real rush when potential users in a large company loved our slideware and our minimum viable product (MVP). They were ecstatic about the time the product could save them and started pulling others into our demos. A few critical internal recommenders and technical evaluators gave our concept the thumbs up. Now we were in discussions with the potential buyers who had the corporate checkbook, and they were ready to have a “next step” conversation.\u003c/p\u003e\n\u003cp\u003eThis buyer wanted us to transform our slideware and MVP into a demonstration of utility with their actual data. This was going to require our small, overcommitted engineering team to turn the MVP into a serviceable prototype.\u003c/p\u003e\n\u003cp\u003eWhen I heard a potential customer offer us their own internal customer data I was already imagining popping Champagne corks once we showed them our prototype. (For context, our products sold for hundreds of thousands of dollars, and lifetime value to each customer was potentially measured in millions.) I rallied our engineering team to work for the next few months to get the demo of the prototype ready. As much as we could, we integrated the customers’ users and technical evaluators into our prototype development process. Then came the meeting with the potential customer. And it went great. The users were in the room, the buyer asked lots of questions, everyone made some suggestions and then we all went home. And the follow up from the potential customer? Crickets…\u003c/p\u003e\n\u003cp\u003eEven our user advocates stopped responding to emails.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat did I do wrong?\u003cbr/\u003e\n\u003c/strong\u003eIn my unbridled and very naive enthusiasm for impressing a potential customer, I made a rookie mistake –\u003cem\u003e I never asked the user champion or the potential buyer what were the steps for turning the demo into a purchase order\u003c/em\u003e. I had made a ton of assumptions – all of them wrong. And most importantly I wasted the most precious things a startup has – engineering resources, time, and money.\u003c/p\u003e\n\u003cp\u003eIn hindsight I had no idea whether my potential customer was asking other companies to demo their product. I had no idea whether the buyer had a budget or even purchase authority. If they did, I had no idea of their timeline for a decision. I had no idea who were the other decision-makers in the company to integrate, deploy and scale the product. I didn’t even know what the success criteria for getting an order looked like. I didn’t check for warning signs of a deal that would go nowhere: whether the person requesting the demo was in a business unit or a tech evaluation/innovation group, whether they’d pay for a functional prototype they could use, etc.  And for good measure, I never even considered asking the potential customer to pay for the demo and/or my costs.\u003c/p\u003e\n\u003cp\u003e(My only excuse was that this was my first foray into enterprise sales.)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBe Ruthless about the Opportunity Costs of Chasing Deals\u003cbr/\u003e\n\u003c/strong\u003eAfter that demoralizing experience I realized that every low probability demo got us further from success rather than closer. While a big company could afford to chase lots of deals I just had a small set of engineering resources. I became ruthless about the opportunity costs of chasing deals whose outcome I couldn’t predict.\u003c/p\u003e\n\u003cp\u003eSo we built rigor into our sales process.\u003c/p\u003e\n\u003cp\u003eWe built a sales road map of finding \u003cu\u003efirst\u003c/u\u003e product/market fit with the users and recommenders. However, we realized that there was a \u003cu\u003esecond product/market fit\u003c/u\u003e with the organization(s) that controlled the budget and the path to deployment and scale.\u003c/p\u003e\n\u003cp\u003eFor this second group of gatekeepers we came up with a cheap hack to validate that a demo wasn’t just a \u003ca href=\"https://www.zendesk.com/blog/tire-kicker/\"\u003etire-kicking\u003c/a\u003e exercise on their part. First, we asked them basic questions about the process: the success criteria, the decision timeline, did a budget exist, who had the purchase authority, what were the roles and approval processes of other organizations (IT, Compliance and Security, etc.) and what was the expected rate of scaling the product across their enterprise. (All the rookie questions I should have asked the first time around.)\u003c/p\u003e\n\u003cp\u003eThat was just the starting point to decide if we wanted to invest our resources. We followed up our questions by \u003cem\u003esending them a fully cancelable purchase order\u003c/em\u003e. We listed all the features we had demoed that had gotten the users excited and threw in the features the technical evaluators had suggested. And we listed our price. In big letters the purchase order said, “FULLY CANCELABLE.” And then we sent it to the head of the group that asked us for the prototype.\u003c/p\u003e\n\u003cp\u003eAs you can imagine most of the time the response was – WTF?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFigure Out Who’s A Serious Prospect\u003cbr/\u003e\n\u003c/strong\u003eThat’s when the real learning started. It was more than OK with me if they said they weren’t ready to sign. Or they told me there were other groups who needed be involved. I was now learning things I never would have if I just showed up with a prototype. By asking the customer to sign a fully cancelable purchase order we excluded “least likely to close prospects”; those who weren’t ready to make a purchase decision, or those who already had a vendor selected but needed to go through “demo theater” to make the selection seem fair. But most importantly it started a conversation with serious prospects that informed us about the entire end-to-end approval process to get an order- who were the additional people who needed to say yes across the corporation – and what were their decision processes.\u003c/p\u003e\n\u003cp\u003eOur conversions of demos into orders went through the roof.\u003c/p\u003e\n\u003cp\u003eFinally, I was learning some of the basics of complex sales.\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eJustin stared at his uneaten pastry for a while and then looked up at me and said smiling, “I never knew you could do that. That’s given me a few ideas what we could do.”  And just like that he was gone.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLessons Learned\u003c/strong\u003e\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003eIn complex sales there are \u003cu\u003emultiple\u003c/u\u003e product/market fits – Users, Buyers, etc. — each with different criteria\u003c/li\u003e\n\u003cli\u003eDon’t invest time and resources in building on-demand prototypes if you don’t know the path to a purchase order\u003c/li\u003e\n\u003cli\u003eUse polite forcing functions, e.g. cancelable purchase orders, to discover who else needs to say “yes”\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\tFiled under: \u003ca href=\"https://steveblank.com/category/customer-development/\" rel=\"category tag\"\u003eCustomer Development\u003c/a\u003e, \u003ca href=\"https://steveblank.com/category/epiphany/\" rel=\"category tag\"\u003eE.piphany\u003c/a\u003e |\t\t\t\t\t\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-04-16T13:00:20Z",
  "modifiedTime": "2024-04-25T06:00:54Z"
}
