{
  "id": "27b5f685-99d6-433d-bea4-98a9da27f1aa",
  "title": "Your 'Helpful' Feedback Could Actually Be Crushing Your Team's Morale. Transform Your Approach With This Step-by-Step Guide.",
  "link": "https://www.entrepreneur.com/leadership/6-steps-for-giving-employee-feedback-thats-actually-helpful/490157",
  "description": "When feedback is delivered correctly, it becomes a secret weapon for boosting engagement and preventing burnout.",
  "author": "Michel Koopman \u0026 Elizabeth DeRosa",
  "published": "Wed, 23 Apr 2025 19:00:00 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Michel Koopman \u0026 Elizabeth DeRosa",
  "length": 7800,
  "excerpt": "When feedback is delivered correctly, it becomes a secret weapon for boosting engagement and preventing burnout.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "Opinions expressed by Entrepreneur contributors are their own. Most leaders believe they're giving helpful feedback. But too often, what they think is constructive comes across as demoralizing, ineffective or outright damaging. The difference? The best leaders don't just give feedback — they coach, communicate with care, and create an environment where employees feel seen, heard and valued.Gallup and Workhuman research shows that employees who receive valuable feedback are five times more engaged and 57% less likely to experience burnout. Yet too many leaders fall into the trap of delivering feedback in a way that crushes morale instead of driving improvement.The solution? Feedback needs to be an ongoing, trust-based conversation, not a one-time critique. It must be framed as coaching, not criticism, and delivered in a way that accounts for more than just words. Your tone, body language, facial expressions and energy play just as big a role as the message itself. Here's how to be more effective at giving feedback — step by step.Related: Employee Feedback Is Only Effective If It's Done Right. Here's How to Make Sure It Lands. Step 1: Shift your mindset — feedback is a gift, not a gotchaLeaders often hesitate to give honest feedback for fear of being seen as negative. But avoiding feedback doesn't create a culture of psychological safety; it creates a culture of guessing and stagnation. The best employees want to grow, and they need clear, constructive input to do so.Key shift: Move from a criticism mindset to a coaching mindset. Think of your team as business athletes. Just as elite performers rely on coaches to refine their skills, employees need guidance, encouragement and practical ways to improve.Ask yourself:Am I giving feedback because I want this person to succeed?Am I delivering it in a way that invites learning rather than defensiveness?When you see feedback as an investment in someone's success, it changes the way you show up.Step 2: Presence and delivery matter more than you thinkThe most overlooked part of feedback? How you show up.Your body language, vocal range, gaze and facial expressions all send a message before you say a word. To curate a warm and inviting atmosphere conducive to accepting constructive feedback, adopt an open posture, connect visually, show concern and care with facial expressions that are authentic and congruent to what you're saying, and use a conversational tone and cadence. Otherwise, they may feel tension, judgment or discomfort instead. You silently communicate to the world all day through your body language and presence. Be intentional about how you are perceived. Convey, instead of betray, your message.Key shift: Feedback isn't just about what you say but how you make people feel. You need to be fully present, engaged and emotionally attuned.What to do:Make eye contact: Remove distractions and see the person in front of you; stay \"on gaze!\" Not in an intimidating way, but with warmth and attentiveness.Adopt an open posture: To signal partnership as opposed to power, face your employee with open arms and gestures that invite conversation, seated at the same level.Mind your facial expressions: Are you showing genuine curiosity and care or unintentionally conveying frustration?Be intentional with your vocal delivery: Vary your pitch and pace. Speak as you would in conversation. Too fast or too slow, too high-pitched or too low-pitched, and your message may be misunderstood.Effective leaders don't only plan what they'll say; they are also intentional about their presence or how they \"show up.\"Ask yourself:Is my nonverbal communication reinforcing my message, or undermining it?Am I making this a safe, productive space for the other person to engage?Related: Your Words Only Tell a Fraction of the Story — Here's Why Tone and Body Language Actually Matter More Step 3: Start with strengths, not weaknessesToo often, feedback begins with what's wrong rather than what's working. But neuroscience shows that people are more open to feedback when they feel seen, valued and capable.Starting with acknowledgment sets a positive tone and reinforces that feedback is coming from a place of support. \"I always like to start conversations by sharing how my team members' strengths have had a positive effect on our business outcomes,\" says Kristi Snyder, Chief People Officer at Enthuse Marketing Group. Framing the conversation around strengths helps both parties enter the discussion with a constructive, growth-oriented mindset.Key shift: Flip the traditional feedback approach. Start with acknowledgment before diving into areas for improvement.What to say: \"I see the effort you put into this. Tell me about how you approached it.\"\"I really appreciate your creativity here. How did you land on this strategy?\"By opening with a question, you create a loop of engagement rather than a top-down critique. Employees get to explain their thinking first, which makes them far more receptive to guidance.Step 4: Ask more, tell lessGreat leaders use feedback as an opportunity to understand before they correct. Instead of leading with here's what you did wrong, try leading with curiosity.Key shift: Replace statements with open-ended questions to uncover insights and encourage self-reflection.What to ask:\"What was your thought process behind this approach?\"\"What challenges did you run into?\"\"How do you think we could refine this?\"By letting employees talk first, you gather context, acknowledge their thinking and collaborate on solutions rather than dictate them. Approaching situations like this makes sure employees feel heard and increases buy-in.A reminder: Acknowledgment is NOT agreement. Giving employees space to explain their reasoning allows leaders to correct misunderstandings while still respecting their perspective.Step 5: Deliver feedback with directness and careFeedback shouldn't be sugarcoated, but it also shouldn't feel like an attack. The secret? Balance directness with care.Key shift: Avoid vague platitudes (\"You did great\") and harsh bluntness (\"This was bad\"). Instead, use clear, actionable and supportive language.What to say:Instead of \"Your presentation was weak,\" try: \"I see the effort you put in. Let's strengthen the data to make it even more compelling.\"Instead of \"You handled that customer situation poorly,\" try: \"I appreciate how you followed the process. Let's explore ways to make it more adaptable.\"Related: How to Give Constructive Feedback That Actually Empowers Others Step 6: Follow up and reinforce progressThe biggest mistake leaders make? Giving feedback once and never revisiting it. Without reinforcement, even the best feedback fades into the background.Key shift: Feedback shouldn't be a one-time event — it should be an ongoing dialogue.What to do: Circle back in a week to see what's changed.Recognize progress (even small wins) to reinforce learning.Keep feedback alive in regular conversations, not just performance reviews.Great leaders don't go it aloneThe most remarkable leaders and elite performers lean on coaches to hone their skills. Many of the most effective leaders actively work with executive coaches to refine their ability to deliver impactful feedback. They recognize that feedback is an art — one that can be mastered with guidance, practice and expert insight. Feedback is meant to bring people closer and move the organization forward, but it must be delivered expertly. Mastering feedback isn't just about what you say — it's about how you say it and how it makes people feel. Whether you're a seasoned executive or an emerging leader, investing in expert coaching can elevate your ability to guide, inspire and develop your team.Feedback is your leadership superpower. Use it wisely.",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1744922536-is-your-helpful-feedback-hurting-0425-g2178407151.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n    Opinions expressed by Entrepreneur contributors are their own.  \u003c/p\u003e\u003cdiv\u003e\n      \u003cp\u003eMost leaders believe they\u0026#39;re giving helpful feedback. But too often, what they think is \u003ca href=\"https://www.entrepreneur.com/growing-a-business/how-to-give-constructive-feedback-that-actually-changes/454567\" rel=\"follow\" target=\"_self\"\u003econstructive\u003c/a\u003e comes across as demoralizing, ineffective or outright damaging. The difference? The best leaders don\u0026#39;t just \u003cb\u003egive feedback \u003c/b\u003e—\u003cb\u003e \u003c/b\u003ethey coach, communicate with care, and create an environment where employees feel seen, heard and valued.\u003c/p\u003e\u003cp\u003eGallup and Workhuman research shows that employees who receive valuable feedback are \u003ca href=\"https://www.gallup.com/workplace/651812/organizations-redefine-feedback-including-recognition.aspx\" rel=\"follow\" target=\"_self\"\u003efive times more engaged\u003c/a\u003e and 57% less likely to experience burnout. Yet too many leaders fall into the trap of delivering feedback in a way that crushes morale instead of driving improvement.\u003c/p\u003e\u003cp\u003eThe solution? Feedback needs to be an ongoing, trust-based conversation, not a one-time critique. It must be framed as \u003ca href=\"https://www.entrepreneur.com/leadership/leadership-playbook-3-ways-to-coach-not-criticize/227027\" rel=\"follow\" target=\"_self\"\u003ecoaching\u003c/a\u003e, not criticism, and delivered in a way that accounts for more than just words. Your tone, body language, facial expressions and energy play just as big a role as the message itself.\u003c/p\u003e\n  \n  \n  \n\n  \u003cp\u003eHere\u0026#39;s how to be more effective at giving feedback — step by step.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003ca href=\"https://www.entrepreneur.com/leadership/employee-feedback-is-only-effective-if-its-done-right/298261\" rel=\"follow\" target=\"_self\"\u003eEmployee Feedback Is Only Effective If It\u0026#39;s Done Right. Here\u0026#39;s How to Make Sure It Lands.\u003c/a\u003e\u003c/b\u003e\u003c/p\u003e\n\n  \u003ch2\u003eStep 1: Shift your mindset — feedback is a gift, not a gotcha\u003c/h2\u003e\u003cp\u003eLeaders often hesitate to give honest feedback for fear of being seen as negative. But avoiding feedback doesn\u0026#39;t create a culture of \u003ca href=\"https://www.entrepreneur.com/leadership/why-you-should-care-about-psychological-safety-in-the/423766\" rel=\"follow\" target=\"_self\"\u003epsychological safety\u003c/a\u003e; it creates a culture of guessing and stagnation. The best employees want to grow, and they need clear, constructive input to do so.\u003c/p\u003e\u003cp\u003e\u003cb\u003eKey shift:\u003c/b\u003e Move from a criticism mindset to a coaching mindset. Think of your team as business athletes. Just as elite performers rely on coaches to refine their skills, employees need guidance, encouragement and practical ways to improve.\u003c/p\u003e\u003cp\u003e\u003cb\u003eAsk yourself:\u003c/b\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eAm I giving feedback because I want this person to succeed?\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eAm I delivering it in a way that invites learning rather than defensiveness?\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eWhen you see feedback as an investment in someone\u0026#39;s success, it changes the way you show up.\u003c/p\u003e\u003ch2\u003eStep 2: Presence and delivery matter more than you think\u003c/h2\u003e\u003cp\u003eThe most overlooked part of feedback? How you show up.\u003c/p\u003e\u003cp\u003eYour \u003ca href=\"https://www.entrepreneur.com/leadership/4-body-language-mistakes-you-are-making-and-how-to-fix/465531\" rel=\"follow\" target=\"_self\"\u003ebody language\u003c/a\u003e, vocal range, gaze and facial expressions all send a message before you say a word. To curate a warm and inviting atmosphere conducive to accepting constructive feedback, adopt an open posture, connect visually, show concern and care with facial expressions that are authentic and congruent to what you\u0026#39;re saying, and use a conversational tone and cadence. Otherwise, they may feel tension, judgment or discomfort instead.\u003c/p\u003e\n\n  \u003cp\u003eYou silently communicate to the world all day through your body language and presence. Be intentional about how you are perceived. Convey, instead of betray, your message.\u003c/p\u003e\u003cp\u003e\u003cb\u003eKey shift:\u003c/b\u003e Feedback isn\u0026#39;t just about what you say but how you make people feel. You need to be fully present, engaged and \u003ca href=\"https://www.entrepreneur.com/leadership/6-ways-emotionally-attuned-leaders-motivate-team-members/310670\" rel=\"follow\" target=\"_self\"\u003eemotionally attuned\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cb\u003eWhat to do:\u003c/b\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cb\u003eMake eye contact:\u003c/b\u003e Remove distractions and see the person in front of you; stay \u0026#34;on gaze!\u0026#34; Not in an intimidating way, but with warmth and attentiveness.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cb\u003eAdopt an open posture:\u003c/b\u003e To signal partnership as opposed to power, face your employee with open arms and gestures that invite conversation, seated at the same level.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cb\u003eMind your facial expressions:\u003c/b\u003e Are you showing genuine curiosity and care or unintentionally conveying frustration?\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cb\u003eBe intentional with your vocal delivery:\u003c/b\u003e Vary your pitch and pace. Speak as you would in conversation. Too fast or too slow, too high-pitched or too low-pitched, and your message may be misunderstood.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eEffective leaders don\u0026#39;t only plan what they\u0026#39;ll say; they are also intentional about their presence or how they \u0026#34;show up.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eAsk yourself:\u003c/b\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eIs my \u003ca href=\"https://www.entrepreneur.com/leadership/7-ways-body-language-speaks-louder-than-words/278691\" rel=\"follow\" target=\"_self\"\u003enonverbal communication\u003c/a\u003e reinforcing my message, or undermining it?\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eAm I making this a safe, productive space for the other person to engage?\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cb\u003eRelated: \u003ca href=\"https://www.entrepreneur.com/leadership/your-words-only-tell-a-fraction-of-the-story-heres-why/485004\" rel=\"follow\" target=\"_self\"\u003eYour Words Only Tell a Fraction of the Story — Here\u0026#39;s Why Tone and Body Language Actually Matter More\u003c/a\u003e\u003c/b\u003e\u003c/p\u003e\n\n  \u003ch2\u003eStep 3: Start with strengths, not weaknesses\u003c/h2\u003e\u003cp\u003eToo often, feedback begins with what\u0026#39;s wrong rather than what\u0026#39;s working. But neuroscience shows that people are more open to feedback when they feel seen, valued and capable.\u003c/p\u003e\u003cp\u003eStarting with acknowledgment sets a positive tone and reinforces that feedback is coming from a place of support. \u0026#34;I always like to start conversations by sharing how my team members\u0026#39; strengths have had a positive effect on our business outcomes,\u0026#34; says Kristi Snyder, Chief People Officer at Enthuse Marketing Group. Framing the conversation around strengths helps both parties enter the discussion with a constructive, \u003ca href=\"https://www.entrepreneur.com/leadership/how-and-why-to-cultivate-a-growth-mindset-in-the-workplace/452343\" rel=\"follow\" target=\"_self\"\u003egrowth-oriented mindset\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cb\u003eKey shift:\u003c/b\u003e Flip the traditional feedback approach. Start with acknowledgment before diving into areas for improvement.\u003c/p\u003e\u003cp\u003e\u003cb\u003eWhat to say:\u003c/b\u003e\u003c/p\u003e\n\n  \u003cul\u003e\u003cli\u003e\u003cp\u003e\u0026#34;I see the effort you put into this. Tell me about how you approached it.\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u0026#34;I really appreciate your creativity here. How did you land on this strategy?\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eBy opening with a question, you create a loop of engagement rather than a top-down critique. Employees get to explain their thinking first, which makes them far more receptive to guidance.\u003c/p\u003e\u003ch2\u003eStep 4: Ask more, tell less\u003c/h2\u003e\u003cp\u003eGreat leaders use feedback as an opportunity to understand before they correct. Instead of leading with here\u0026#39;s what you did wrong, try leading with curiosity.\u003c/p\u003e\u003cp\u003e\u003cb\u003eKey shift:\u003c/b\u003e Replace statements with open-ended questions to uncover insights and encourage self-reflection.\u003c/p\u003e\u003cp\u003e\u003cb\u003eWhat to ask:\u003c/b\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u0026#34;What was your thought process behind this approach?\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u0026#34;What challenges did you run into?\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u0026#34;How do you think we could refine this?\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eBy letting employees talk first, you gather context, acknowledge their thinking and collaborate on solutions rather than dictate them. Approaching situations like this makes sure \u003ca href=\"https://www.entrepreneur.com/leadership/how-to-listen-to-your-employees/431344\" rel=\"follow\" target=\"_self\"\u003eemployees feel heard\u003c/a\u003e and increases buy-in.\u003c/p\u003e\u003cp\u003e\u003ci\u003eA reminder: Acknowledgment is NOT agreement. \u003c/i\u003eGiving employees space to explain their reasoning allows leaders to correct misunderstandings while still respecting their perspective.\u003c/p\u003e\u003ch2\u003eStep 5: Deliver feedback with directness and care\u003c/h2\u003e\u003cp\u003eFeedback shouldn\u0026#39;t be sugarcoated, but it also shouldn\u0026#39;t feel \u003ca href=\"https://www.entrepreneur.com/leadership/7-tips-for-delivering-negative-feedback-to-employees/278396\" rel=\"follow\" target=\"_self\"\u003elike an attack\u003c/a\u003e. The secret? Balance directness with care.\u003c/p\u003e\u003cp\u003e\u003cb\u003eKey shift:\u003c/b\u003e Avoid vague platitudes (\u0026#34;You did great\u0026#34;) and harsh bluntness (\u0026#34;This was bad\u0026#34;). Instead, use clear, actionable and supportive language.\u003c/p\u003e\u003cp\u003e\u003cb\u003eWhat to say:\u003c/b\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eInstead of \u0026#34;Your presentation was weak,\u0026#34; try: \u0026#34;I see the effort you put in. Let\u0026#39;s strengthen the data to make it even more compelling.\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eInstead of \u0026#34;You handled that customer situation poorly,\u0026#34; try: \u0026#34;I appreciate how you followed the process. Let\u0026#39;s explore ways to make it more adaptable.\u0026#34;\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cb\u003eRelated: \u003ca href=\"https://www.entrepreneur.com/growing-a-business/how-to-give-constructive-feedback-that-actually-changes/454567\" rel=\"follow\" target=\"_self\"\u003eHow to Give Constructive Feedback That Actually Empowers Others\u003c/a\u003e \u003c/b\u003e\u003c/p\u003e\u003ch2\u003eStep 6: Follow up and reinforce progress\u003c/h2\u003e\u003cp\u003eThe biggest mistake leaders make? Giving feedback once and never revisiting it. Without reinforcement, even the best feedback fades into the background.\u003c/p\u003e\u003cp\u003e\u003cb\u003eKey shift:\u003c/b\u003e Feedback shouldn\u0026#39;t be a one-time event — it should be an \u003ca href=\"https://www.entrepreneur.com/growing-a-business/how-to-create-a-culture-of-feedback/384655\" rel=\"follow\" target=\"_self\"\u003eongoing dialogue\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cb\u003eWhat to do:\u003c/b\u003e\u003c/p\u003e\n\n  \u003cul\u003e\u003cli\u003e\u003cp\u003eCircle back in a week to see what\u0026#39;s changed.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eRecognize progress (even small wins) to reinforce learning.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eKeep feedback alive in regular conversations, not just performance reviews.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003ch2\u003eGreat leaders don\u0026#39;t go it alone\u003c/h2\u003e\u003cp\u003eThe most remarkable leaders and elite performers lean on coaches to hone their skills. Many of the most effective leaders actively work with \u003ca href=\"https://www.entrepreneur.com/leadership/6-ways-executive-leadership-coaching-pays-off/459295\" rel=\"follow\" target=\"_self\"\u003eexecutive coaches\u003c/a\u003e to refine their ability to deliver impactful feedback. They recognize that feedback is an art — one that can be mastered with guidance, practice and expert insight.\u003c/p\u003e\n\n  \u003cp\u003eFeedback is meant to bring people closer and move the organization forward, but it must be delivered expertly. Mastering feedback isn\u0026#39;t just about what you say — it\u0026#39;s about how you say it and how it makes people feel. Whether you\u0026#39;re a seasoned executive or an emerging leader, investing in expert coaching can elevate your ability to guide, inspire and develop your team.\u003c/p\u003e\u003cp\u003eFeedback is your leadership superpower. Use it wisely.\u003c/p\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-04-23T19:00:00Z",
  "modifiedTime": "2025-04-23T19:00:00Z"
}
