{
  "id": "29c79a33-d1f2-4c90-87aa-a5f28be9f1e1",
  "title": "Is Kevin O'Leary Buying TikTok? 'Shark Tank' Star Teams Up With Frank McCourt for 'People's' Bid",
  "link": "https://www.entrepreneur.com/business-news/kevin-oleary-teams-up-with-frank-mccourt-for-tiktok-bid/485306",
  "description": "\"Kevin and I, along with the thousands of supporters who have come forward to back The People's Bid, firmly believe we can build a better TikTok,\" McCourt said.",
  "author": "Erin Davis",
  "published": "Wed, 08 Jan 2025 21:58:00 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Erin Davis",
  "length": 2679,
  "excerpt": "Kevin O'Leary announced that he is joining billionaire and former L.A. Dodgers owner Frank McCourt in a bid to purchase TikTok.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "Kevin O'Leary is talking about buying TikTok again, but this time with more specifics.The social media app is less than two weeks away from facing a potential ban, though the Supreme Court is set to rule on a pause on Jan. 10 after TikTok and its parent company, China-based ByteDance, asked the Court to hold the Jan. 19 deadline.In April, U.S. lawmakers passed a bill that forces ByteDance to sell TikTok, though the company has repeatedly said it is not for sale and would prefer to shut it down. Related: Meta Outage, Looming TikTok Ban Has Creators Questioning How Much of Their Business They Really ControlStill, that hasn't deterred O'Leary, a.k.a \"Mr. Wonderful.\" This week, O'Leary announced that he is joining billionaire and former L.A. Dodgers owner Frank McCourt in a plan to purchase the social network. McCourt launched Project Liberty in 2021 to help build and advocate for a safer and more equitable internet, according to its website.In May, McCourt revealed that Project Liberty was \"building a consortium to purchase TikTok and rearchitect the platform to put people in control of their digital identities and data,\" which is known as \"the People's Bid for TikTok.\"\"We've built a clean, American-made tech stack and continue to be the only viable bidder that can offer a seamless transition for everyone on TikTok without the existing algorithm, said Frank McCourt, founder of Project Liberty, in a press release. \"With the addition of Kevin and his countless followers to our bid, The People's Bid enters a new phase.\"Project Liberty's investor group has committed to more than $20 billion of capital, according to a spokesperson. O'Leary has been vocal about wanting to buy TikTok since March 2024, after the news broke of a potential ban. He told Fox \u0026 Friends that month, \"If this order goes through, it's got to be sold. I'm going to put up my hand and say I'll buy it.\"\"It's the largest entertainment and business network in America as it stands today, so it's of great interest and great value,\" O'Leary said last March.McCourt also noted that he looks forward to \"working with President-elect Trump to save TikTok.\"\"Kevin and I, along with the thousands of supporters who have come forward to back The People's Bid, firmly believe we can build a better TikTok – one that protects our national security and becomes a safe, secure platform that millions of people on the app will trust,\" McCourt said. Related: Remote Work Enthusiast Kevin O'Leary Does TV Appearance Wearing Suit Jacket, Tie and Pajama BottomsO'Leary talked about his bid for the app in a news appearance this week in his signature pink pajama pants and flip-flops.",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1736371266-Kevin-Oleary-1690301810.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003eKevin O\u0026#39;Leary is talking about \u003ca href=\"https://www.entrepreneur.com/business-news/kevin-oleary-wants-to-buy-tiktok-at-a-shark-tank-valuation/471636\" rel=\"follow\" target=\"_self\"\u003ebuying TikTok again\u003c/a\u003e, but this time with more specifics.\u003c/p\u003e\u003cp\u003eThe social media app is less than two weeks away from facing a potential ban, though the Supreme Court is set to rule on a pause on Jan. 10 after \u003ca href=\"https://www.entrepreneur.com/business-news/tiktok-ceo-shou-zi-chew-spotted-at-mar-a-lago-ahead-of-ban/484421\" rel=\"follow\" target=\"_self\"\u003eTikTok\u003c/a\u003e and its parent company, China-based ByteDance, \u003ca href=\"https://www.cbsnews.com/news/tiktok-ceo-trump-meeting-ban/\" rel=\"follow\" target=\"_self\"\u003easked the Court\u003c/a\u003e to hold the Jan. 19 deadline.\u003c/p\u003e\u003cp\u003eIn April, U.S. lawmakers passed a bill that forces ByteDance to sell TikTok, though the company has repeatedly said \u003ca href=\"https://www.reuters.com/technology/bytedance-prefers-tiktok-shutdown-us-if-legal-options-fail-sources-say-2024-04-25/\" rel=\"follow\" target=\"_self\"\u003eit is not for sale\u003c/a\u003e and would prefer to shut it down.\u003c/p\u003e\n  \n  \n  \n\n  \u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/business-news/meta-outage-tiktok-ban-has-creators-building-email-lists/484217\" rel=\"follow\" target=\"_self\"\u003eMeta Outage, Looming TikTok Ban Has Creators Questioning How Much of Their Business They Really Control\u003c/a\u003e\u003c/p\u003e\u003cp\u003eStill, that hasn\u0026#39;t deterred O\u0026#39;Leary, a.k.a \u0026#34;Mr. Wonderful.\u0026#34;\u003c/p\u003e\n\n  \u003cp\u003eThis week, O\u0026#39;Leary announced that he is joining billionaire and former L.A. Dodgers owner \u003ca href=\"https://www.usatoday.com/story/money/2024/12/23/tiktok-ban-frank-mccourt-billionaire-project-liberty/77180505007/\" rel=\"follow\" target=\"_self\"\u003eFrank McCourt\u003c/a\u003e in a plan to \u003ca href=\"http://www.usatoday.com/story/money/2025/01/07/tiktok-ban-kevin-oleary-shark-tank/77511321007/\" rel=\"follow\" target=\"_self\"\u003epurchase the social network\u003c/a\u003e. McCourt launched Project Liberty in 2021 to help build and advocate for a safer and more equitable internet, according to its website.\u003c/p\u003e\u003cp\u003eIn May, \u003ca href=\"https://www.projectliberty.io/peoples-bid-for-tiktok/\" rel=\"follow\" target=\"_self\"\u003eMcCourt revealed\u003c/a\u003e that Project Liberty was \u0026#34;building a consortium to purchase TikTok and rearchitect the platform to put people in control of their digital identities and data,\u0026#34; which is known as \u0026#34;the People\u0026#39;s Bid for TikTok.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;ve built a clean, American-made tech stack and continue to be the only viable bidder that can offer a seamless transition for everyone on TikTok without the existing algorithm, said Frank McCourt, founder of Project Liberty, \u003ca href=\"https://www.projectliberty.io/news/kevin-oleary-joining-the-peoples-bid-for-tiktok/\" rel=\"follow\" target=\"_self\"\u003ein a press release\u003c/a\u003e. \u0026#34;With the addition of Kevin and his countless followers to our bid, The People\u0026#39;s Bid enters a new phase.\u0026#34;\u003c/p\u003e\u003cp\u003eProject Liberty\u0026#39;s investor group has committed to more than $20 billion of capital, \u003ca href=\"https://www.axios.com/2024/12/05/tiktok-frank-mccourt-project-liberty-bid-advances\" rel=\"follow\" target=\"_self\"\u003eaccording to a spokesperson\u003c/a\u003e.\u003c/p\u003e\n\n  \u003cp\u003eO\u0026#39;Leary \u003ca href=\"https://www.entrepreneur.com/business-news/kevin-oleary-wants-to-buy-tiktok-at-a-shark-tank-valuation/471636\" rel=\"follow\" target=\"_self\"\u003ehas been vocal\u003c/a\u003e about wanting to buy TikTok since March 2024, after the news broke of a potential ban. He \u003ca href=\"https://www.foxbusiness.com/technology/kevin-oleary-offers-buy-tiktok-turn-new-american-company-proposed-ban\" rel=\"follow\" target=\"_self\"\u003etold Fox \u0026amp; Friends\u003c/a\u003e that month, \u0026#34;If this order goes through, it\u0026#39;s got to be sold. I\u0026#39;m going to put up my hand and say I\u0026#39;ll buy it.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s the largest entertainment and business network in America as it stands today, so it\u0026#39;s of great interest and great value,\u0026#34; O\u0026#39;Leary said last March.\u003c/p\u003e\u003cp\u003eMcCourt also noted that he looks forward to \u0026#34;working with President-elect Trump to save TikTok.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Kevin and I, along with the thousands of supporters who have come forward to back The People\u0026#39;s Bid, firmly believe we can build a better TikTok – one that protects our national security and becomes a safe, secure platform that millions of people on the app will trust,\u0026#34; McCourt said.\u003c/p\u003e\n\n  \u003cp\u003e\u003cb\u003eRelated:\u003c/b\u003e \u003ca href=\"https://www.entrepreneur.com/business-news/remote-work-advocate-kevin-oleary-pairs-suit-with-pajamas/482401\" rel=\"follow\" target=\"_self\"\u003eRemote Work Enthusiast Kevin O\u0026#39;Leary Does TV Appearance Wearing Suit Jacket, Tie and Pajama Bottoms\u003c/a\u003e\u003c/p\u003e\u003cp\u003eO\u0026#39;Leary talked about his bid for the app in a \u003ca href=\"https://www.instagram.com/p/DEh2nnbMFGS/?hl=en\" rel=\"follow\" target=\"_self\"\u003enews appearance this week\u003c/a\u003e in his signature pink pajama pants and flip-flops.\u003c/p\u003e\u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/DEh2nnbMFGS/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\u003c/blockquote\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-08T21:58:00Z",
  "modifiedTime": "2025-01-08T21:58:00Z"
}
