{
  "id": "3ba003e8-c149-45f5-8622-bc1e32017e1a",
  "title": "Four key steps for training your customer support team for AI",
  "link": "https://www.intercom.com/blog/training-your-team-for-ai/",
  "description": "Every team's journey to getting comfortable with AI-first customer service will look different. Here are steps support leaders can take to set their teams up for success.",
  "author": "Ruth O'Brien",
  "published": "Wed, 25 Sep 2024 13:36:04 +0000",
  "source": "https://www.intercom.com/blog/feed",
  "categories": [
    "Customer Service",
    "ai-first customer service",
    "The Ticket"
  ],
  "byline": "Ruth O'Brien",
  "length": 5576,
  "excerpt": "Adapting to AI-first customer service looks different for every team. Here are steps support leaders can take to set their teams up for success.",
  "siteName": "The Intercom Blog",
  "favicon": "https://blog.intercomassets.com/blog/wp-content/uploads/2018/10/cropped-cropped-site-icon-2-192x192.png",
  "text": "Adopting AI-first customer support looks different for every team. Customer service leaders will experience a range of reactions, with some people on the team eager to try new things immediately, and others being a bit more apprehensive. Ensuring everyone has the right skills and mindset to make the most of what really is an extraordinary opportunity is therefore an important responsibility. Everyone’s approach to this will be different, but here are some foundational things you can do to help guide and support your team as they get comfortable with a new way of working. Make dedicated time for training Get help from the natural enthusiasts on your team Unpack hesitations with resistant team members Be transparent about measuring productivity Make dedicated time for training This might be an obvious starting point, but it’s the most important. Almost all hesitation comes from the unknown, so be deliberate about creating space for your team to learn about AI. For all sorts of reasons, folks won’t take the initiative to read docs, learn processes, or try out new functionality without time being carved out for them to do so. Our team went through a formal AI training program that we worked into our weekly schedule. We created training blocks on Monday and Tuesday, and rotated the team members who were training in a way that best suited our customers and ticket queues. “Your agents being more efficient and confident in the longer term is worth it” Taking a potential hit to response times is tricky for all CS teams to justify, but your agents being more efficient and confident about what they’re doing in the longer term is worth it. Plus, it’s crucial for helping your team upskill and pursue emerging career opportunities in AI. Get help from the natural enthusiasts on your team As with anything, some people are naturally more excited about AI than others. We saw this on our own team – when we rolled out Fin AI Copilot, for example, there were a bunch of teammates who couldn’t wait to jump in and try it out, and others who were more comfortable with their old way of doing things. “Make your training more relatable, and humanize it by connecting it to the team’s everyday tasks and experiences” Leaning on your enthusiasts to get everyone on the same page can be so helpful. Often, they’ll be able to communicate with their peers in a way that just “makes more sense.” We asked team members who were most passionate about AI to be involved in our team training. They helped make the training more relatable and humanized it by connecting it to the team’s everyday tasks and experiences. And they showed others how they could use it to work better and have more fun too. Unpack hesitations with resistant team members No matter what you do, some people are going to take longer than others to adapt. We’re all only human navigating a really big change, so some folks will require more patience than others while they find their bearings. “Ask them about what they’re really feeling to get to the root cause” If there’s an individual on your team who seems resistant to change, set up some time with them to understand why. It’s hardly ever the case that someone is completely obstinate, so ask them about what they’re really feeling to get to the root cause. Maybe they’re concerned AI will steal their job, or maybe they feel overwhelmed having to learn new technologies. Once you uncover the actual reason, it’ll be easier to see what will work best to bring them along on the journey. Be transparent about measuring productivity As your ways of working change, your measures of productivity and success will change too. Most notably, as AI Agents automate away most of the easy-win, quick tasks, your team will have to adapt to moving slower and dealing with more complexity on a daily basis. “Make sure you communicate changing expectations to your team” Sure, work will be more engaging, but your team will likely experience more brain fry and frustration than before. This is why it’s so important to acknowledge this from the beginning and adjust your performance metrics accordingly. Instead of resolution speed being your primary focus, it might make more sense to focus on how things like empathy improve the overall customer experience. Feeling good about work is so intrinsic – and so important to keep everyone motivated, so make sure you communicate changing expectations to your team. Every team is different and we’ll all find what works for us as we get more comfortable with “the new way” of doing customer service. Customer Service 3 min read Announcing Pioneer, Intercom’s first ever AI customer service summit On October 10th, join us for a full-day online event, where we will explore the exciting reality of AI-first customer service Customer Service 23 min watch The Ticket: How to lead your customer service team into the AI future In this episode of The Ticket podcast, we explore the best strategies to ensure your customer service representatives are fully bought-in as you transition to AI-first customer service. Customer Service 30 min watch The Ticket: Evolving your support org to thrive in the AI era AI is radically changing how customer service teams operate. Learn how to evolve your team structure to capitalize on new opportunities.",
  "image": "https://blog.intercomassets.com/blog/wp-content/uploads/2024/06/Evergreen-Opensource-7-700x529.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\" role=\"main\" itemscope=\"\" itemprop=\"mainContentOfPage\"\u003e\n\n\t\u003carticle itemscope=\"\" itemtype=\"https://schema.org/BlogPosting\"\u003e\n\t\t\n\n\t\t\u003cmeta itemscope=\"\" itemprop=\"mainEntityOfPage\" itemtype=\"https://schema.org/WebPage\" itemid=\"https://www.intercom.com/blog/training-your-team-for-ai/\"/\u003e\n\n\t\t\n\t\t\u003cheader\u003e\n\t\t\t\n\t\t\u003c/header\u003e\n\n\t\t\n\n\t\t\u003cdiv\u003e\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\u003cp\u003eAdopting \u003ca href=\"https://www.intercom.com/blog/ai-first-customer-service/\"\u003eAI-first customer support\u003c/a\u003e looks different for every team.\u003c/p\u003e\n\u003cp\u003eCustomer service leaders will experience a range of reactions, with some people on the team eager to try new things immediately, and others being a bit more apprehensive. Ensuring everyone has the right skills and mindset to make the most of what really is an extraordinary opportunity is therefore an important responsibility. Everyone’s approach to this will be different, but here are some foundational things you can do to help guide and support your team as they get comfortable with a new way of working.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMake dedicated time for training\u003c/li\u003e\n\u003cli\u003eGet help from the natural enthusiasts on your team\u003c/li\u003e\n\u003cli\u003eUnpack hesitations with resistant team members\u003c/li\u003e\n\u003cli\u003eBe transparent about measuring productivity\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eMake dedicated time for training\u003c/h2\u003e\n\u003cp\u003eThis might be an obvious starting point, but it’s the most important. Almost all hesitation comes from the unknown, so be deliberate about creating space for your team to learn about AI. For all sorts of reasons, folks won’t take the initiative to read docs, learn processes, or try out new functionality without time being carved out for them to do so.\u003c/p\u003e\n\u003cp\u003eOur team went through a formal AI training program that we worked into our weekly schedule. We created training blocks on Monday and Tuesday, and rotated the team members who were training in a way that best suited our customers and ticket queues.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e“Your agents being more efficient and confident in the longer term is worth it”\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eTaking a potential hit to response times is tricky for all CS teams to justify, but your agents being more efficient and confident about what they’re doing in the longer term is worth it. Plus, it’s crucial for helping your team upskill and pursue emerging career opportunities in AI.\u003c/p\u003e\n\u003ch2\u003eGet help from the natural enthusiasts on your team\u003c/h2\u003e\n\u003cp\u003eAs with anything, some people are naturally more excited about AI than others. We saw this on our own team – when we rolled out \u003ca href=\"https://www.intercom.com/support-for-agents/ai-copilot\"\u003eFin AI Copilot\u003c/a\u003e, for example, there were a bunch of teammates who couldn’t wait to jump in and try it out, and others who were more comfortable with their old way of doing things.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e“Make your training more relatable, and humanize it by connecting it to the team’s everyday tasks and experiences”\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eLeaning on your enthusiasts to get everyone on the same page can be so helpful. Often, they’ll be able to communicate with their peers in a way that just “makes more sense.”\u003c/p\u003e\n\u003cp\u003eWe asked team members who were most passionate about AI to be involved in our team training. They helped make the training more relatable and humanized it by connecting it to the team’s everyday tasks and experiences. And they showed others how they could use it to work better and have more fun too.\u003c/p\u003e\n\u003ch2\u003eUnpack hesitations with resistant team members\u003c/h2\u003e\n\u003cp\u003eNo matter what you do, some people are going to take longer than others to adapt. We’re all only human navigating a really big change, so some folks will require more patience than others while they find their bearings.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e“Ask them about what they’re really feeling to get to the root cause”\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eIf there’s an individual on your team who seems resistant to change, set up some time with them to understand why. It’s hardly ever the case that someone is completely obstinate, so ask them about what they’re really feeling to get to the root cause. Maybe they’re concerned AI will steal their job, or maybe they feel overwhelmed having to learn new technologies.\u003c/p\u003e\n\u003cp\u003eOnce you uncover the \u003cem\u003eactual\u003c/em\u003e reason, it’ll be easier to see what will work best to bring them along on the journey.\u003c/p\u003e\n\u003ch2\u003eBe transparent about measuring productivity\u003c/h2\u003e\n\u003cp\u003eAs your ways of working change, your measures of productivity and success will change too. Most notably, as \u003ca href=\"https://www.intercom.com/fin\"\u003eAI Agents\u003c/a\u003e automate away most of the easy-win, quick tasks, your team will have to adapt to moving slower and dealing with more complexity on a daily basis.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e“Make sure you communicate changing expectations to your team”\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eSure, work will be more engaging, but your team will likely experience more brain fry and frustration than before. This is why it’s so important to acknowledge this from the beginning and adjust your performance metrics accordingly. Instead of resolution speed being your primary focus, it might make more sense to focus on how things like empathy improve the overall customer experience.\u003c/p\u003e\n\u003cp\u003eFeeling good about work is so intrinsic – and so important to keep everyone motivated, so make sure you communicate changing expectations to your team. Every team is different and we’ll all find what works for us as we get more comfortable with “the new way” of doing customer service.\u003c/p\u003e\n\u003cp\u003e\n\n\u003ca href=\"https://www.intercom.com/blog/newsletter?utm_source=ii-blog\u0026amp;utm_medium=internal\u0026amp;utm_campaign=theticket_newsletter_signup\u0026amp;utm_content=ad\" data-ctatype=\"horizontal\" data-ctaname=\"Newsletter The Ticket (Horizontal)\" data-ctacategory=\"Newsletter\" target=\"_blank\"\u003e\n\t\u003cimg decoding=\"async\" src=\"https://blog.intercomassets.com/blog/wp-content/uploads/2024/04/The-Ticket-Rebrand-Horizontal-CTA.jpg.optimal.jpg\" alt=\"The Ticket Newsletter Horizontal CTA\"/\u003e\n\u003c/a\u003e\n\n\u003c/p\u003e\n\n\t\t\t\n\u003cp\u003e\u003ca href=\"https://pioneer.intercom.com/?utm_source=ii-blog\u0026amp;utm_medium=internal\u0026amp;utm_campaign=20241010_ce_wb_all_global_gl_all_support_all_pioneer24summitlivestream\u0026amp;utm_content=blog%20ad\" data-ctatype=\"vertical\" data-ctaname=\"Pioneer virtual promo (Vertical)\" data-ctacategory=\"Events\" target=\"_blank\"\u003e\n\t\u003cimg src=\"https://blog.intercomassets.com/blog/wp-content/uploads/2024/10/Pioneer-blog-CTA-vertical.jpg.optimal.jpg\" alt=\"Pioneer AI Customer Service Summit blog CTA - vertical\"/\u003e\n\u003c/a\u003e\n\n\u003c/p\u003e\n\n\t\t\t\n\t\t\u003c/div\u003e\n\n\t\u003c/article\u003e\n\n\t\n\t\u003csection\u003e\n\t\t\n\n\t\t\n\u003carticle itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"\u003e\n\t\n\n\t\u003cmeta itemscope=\"\" itemprop=\"mainEntityOfPage\" itemtype=\"https://schema.org/WebPage\" itemid=\"https://www.intercom.com/blog/announcing-pioneer-ai-customer-service-summit/\"/\u003e\n\n\t\n\t\u003cfigure itemprop=\"image\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"\u003e\n\t\t\u003ca itemprop=\"url\" href=\"https://www.intercom.com/blog/announcing-pioneer-ai-customer-service-summit/\"\u003e\n\t\t\t\u003cimg width=\"530\" height=\"240\" src=\"https://blog.intercomassets.com/blog/wp-content/uploads/2024/09/Intercom-Pioneer-Summit-Blog-Hero-530x240.jpg.optimal.jpg\" alt=\"Intercom Pioneer 2024 AI Customer Service Summit\" decoding=\"async\" loading=\"lazy\"/\u003e\t\t\t\u003cmeta itemprop=\"url\" content=\"https://blog.intercomassets.com/blog/wp-content/uploads/2024/09/Intercom-Pioneer-Summit-Blog-Hero.jpg.optimal.jpg\"/\u003e\n\t\t\t\u003cmeta itemprop=\"width\" content=\"1800\"/\u003e\n\t\t\t\u003cmeta itemprop=\"height\" content=\"840\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/figure\u003e\n\n\t\u003cp\u003e\n\t\t\u003ca href=\"https://www.intercom.com/blog/customer-support/\"\u003eCustomer Service\u003c/a\u003e\n\t\t\u003cspan\u003e3 min read\u003c/span\u003e\n\t\u003c/p\u003e\n\n\t\u003cheader itemprop=\"headline\"\u003e\n\t\t\u003ctime itemprop=\"datePublished\" datetime=\"2024-09-04T17:00:23+01:00\"\u003e\u003c/time\u003e\n\t\t\u003ctime itemprop=\"dateModified\" datetime=\"2024-10-09T16:13:58+01:00\"\u003e\u003c/time\u003e\n\t\t\u003ch2\u003e\n\t\t\t\u003ca href=\"https://www.intercom.com/blog/announcing-pioneer-ai-customer-service-summit/\" itemprop=\"url\" rel=\"bookmark\"\u003e\n\t\t\t\tAnnouncing Pioneer, Intercom’s first ever AI customer service summit\t\t\t\u003c/a\u003e\n\t\t\u003c/h2\u003e\n\t\u003c/header\u003e\n\n\t\u003cp\u003eOn October 10th, join us for a full-day online event, where we will explore the exciting reality of AI-first customer service\u003c/p\u003e\n\n\t\n\n\u003c/article\u003e\n\n\u003carticle itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"\u003e\n\t\n\n\t\u003cmeta itemscope=\"\" itemprop=\"mainEntityOfPage\" itemtype=\"https://schema.org/WebPage\" itemid=\"https://www.intercom.com/blog/videos/the-ticket-how-to-lead-your-customer-service-team-into-the-ai-future/\"/\u003e\n\n\t\n\t\u003cfigure itemprop=\"image\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"\u003e\n\t\t\u003ca itemprop=\"url\" href=\"https://www.intercom.com/blog/videos/the-ticket-how-to-lead-your-customer-service-team-into-the-ai-future/\"\u003e\n\t\t\t\u003cimg width=\"530\" height=\"240\" src=\"https://blog.intercomassets.com/blog/wp-content/uploads/2024/07/TheTicket-Declan-Bobby-20240718-530x240.jpg.optimal.jpg\" alt=\"The Ticket Declan Ivory Bobby Stapleton\" decoding=\"async\" loading=\"lazy\"/\u003e\t\t\t\u003cmeta itemprop=\"url\" content=\"https://blog.intercomassets.com/blog/wp-content/uploads/2024/07/TheTicket-Declan-Bobby-20240718.jpg.optimal.jpg\"/\u003e\n\t\t\t\u003cmeta itemprop=\"width\" content=\"2560\"/\u003e\n\t\t\t\u003cmeta itemprop=\"height\" content=\"1198\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/figure\u003e\n\n\t\u003cp\u003e\n\t\t\u003ca href=\"https://www.intercom.com/blog/customer-support/\"\u003eCustomer Service\u003c/a\u003e\n\t\t\u003cspan\u003e23 min watch\u003c/span\u003e\n\t\u003c/p\u003e\n\n\t\u003cheader itemprop=\"headline\"\u003e\n\t\t\u003ctime itemprop=\"datePublished\" datetime=\"2024-07-18T11:34:34+01:00\"\u003e\u003c/time\u003e\n\t\t\u003ctime itemprop=\"dateModified\" datetime=\"2024-08-08T16:44:46+01:00\"\u003e\u003c/time\u003e\n\t\t\u003ch2\u003e\n\t\t\t\u003ca href=\"https://www.intercom.com/blog/videos/the-ticket-how-to-lead-your-customer-service-team-into-the-ai-future/\" itemprop=\"url\" rel=\"bookmark\"\u003e\n\t\t\t\tThe Ticket: How to lead your customer service team into the AI future\t\t\t\u003c/a\u003e\n\t\t\u003c/h2\u003e\n\t\u003c/header\u003e\n\n\t\u003cp\u003eIn this episode of The Ticket podcast, we explore the best strategies to ensure your customer service representatives are fully bought-in as you transition to AI-first customer service.\u003c/p\u003e\n\n\t\n\n\u003c/article\u003e\n\n\u003carticle itemscope=\"\" itemtype=\"http://schema.org/BlogPosting\"\u003e\n\t\n\n\t\u003cmeta itemscope=\"\" itemprop=\"mainEntityOfPage\" itemtype=\"https://schema.org/WebPage\" itemid=\"https://www.intercom.com/blog/videos/evolve-support-org-thrive-ai-era/\"/\u003e\n\n\t\n\t\u003cfigure itemprop=\"image\" itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"\u003e\n\t\t\u003ca itemprop=\"url\" href=\"https://www.intercom.com/blog/videos/evolve-support-org-thrive-ai-era/\"\u003e\n\t\t\t\u003cimg width=\"530\" height=\"240\" src=\"https://blog.intercomassets.com/blog/wp-content/uploads/2024/05/The-Ticket_Blog-hero-4-530x240.jpg.optimal.jpg\" alt=\"Ruth O\u0026#39;Brien and Declan Ivory The Ticket Podcast\" decoding=\"async\" loading=\"lazy\"/\u003e\t\t\t\u003cmeta itemprop=\"url\" content=\"https://blog.intercomassets.com/blog/wp-content/uploads/2024/05/The-Ticket_Blog-hero-4-scaled.jpg.optimal.jpg\"/\u003e\n\t\t\t\u003cmeta itemprop=\"width\" content=\"2560\"/\u003e\n\t\t\t\u003cmeta itemprop=\"height\" content=\"1159\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/figure\u003e\n\n\t\u003cp\u003e\n\t\t\u003ca href=\"https://www.intercom.com/blog/customer-support/\"\u003eCustomer Service\u003c/a\u003e\n\t\t\u003cspan\u003e30 min watch\u003c/span\u003e\n\t\u003c/p\u003e\n\n\t\u003cheader itemprop=\"headline\"\u003e\n\t\t\u003ctime itemprop=\"datePublished\" datetime=\"2024-05-24T09:00:23+01:00\"\u003e\u003c/time\u003e\n\t\t\u003ctime itemprop=\"dateModified\" datetime=\"2024-05-24T09:16:19+01:00\"\u003e\u003c/time\u003e\n\t\t\u003ch2\u003e\n\t\t\t\u003ca href=\"https://www.intercom.com/blog/videos/evolve-support-org-thrive-ai-era/\" itemprop=\"url\" rel=\"bookmark\"\u003e\n\t\t\t\tThe Ticket: Evolving your support org to thrive in the AI era\t\t\t\u003c/a\u003e\n\t\t\u003c/h2\u003e\n\t\u003c/header\u003e\n\n\t\u003cp\u003eAI is radically changing how customer service teams operate. Learn how to evolve your team structure to capitalize on new opportunities.\u003c/p\u003e\n\n\t\n\n\u003c/article\u003e\n\n\t\u003c/section\u003e\n\n\t\n\n\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-09-25T13:36:04Z",
  "modifiedTime": "2024-09-25T13:37:21Z"
}
