{
  "id": "3f867fe8-d827-4656-8f25-6bac9181c4ea",
  "title": "Chinese, U.S. Leaders Agree AI Cannot Control Nuclear Arms",
  "link": "https://www.inc.com/reuters/chinese-u-s-leaders-agree-ai-cannot-control-nuclear-arms/91020424",
  "description": "Human beings need to make decisions over the use of nuclear weapons, Biden and Xi suggest.",
  "author": "Reuters",
  "published": "Sun, 17 Nov 2024 19:36:19 -0500",
  "source": "https://www.inc.com/rss/",
  "categories": [
    "Technology"
  ],
  "byline": "Reuters",
  "length": 3289,
  "excerpt": "Human beings need to make decisions over the use of nuclear weapons, Biden and Xi suggest.",
  "siteName": "Inc",
  "favicon": "https://www.inc.com/_public/icons/apple-icon.png",
  "text": "U.S. President Joe Biden and Chinese President Xi Jinping agreed on Saturday that human beings and not artificial intelligence should make decisions over the use of nuclear weapons, according to the White House. “The two leaders affirmed the need to maintain human control over the decision to use nuclear weapons,” the White House said in a statement. “The two leaders also stressed the need to consider carefully the potential risks and develop AI technology in the military field in a prudent and responsible manner.” An official Chinese government summary of the meeting echoed this point. The Chinese foreign ministry did not immediately respond to a request for comment. It was not clear whether the statement would lead to further talks or action on the issue. But it marks a first-of-its-kind step between the two countries in the discussion of two issues on which progress has been elusive: nuclear arms and artificial intelligence. Washington has been pushing Beijing for months to break a longstanding resistance to nuclear arms talks. Nuclear negotiations The two countries briefly resumed official-level talks over nuclear arms in November but those negotiations have since stalled, with a top U.S. official publicly expressing frustration regarding China’s responsiveness. Formal nuclear arms control negotiations have not been expected any time soon, despite U.S. concerns about China’s rapid nuclear weapons build-up, even though semi-official exchanges have resumed. On artificial intelligence, China and the United States launched their first formal bilateral talks on the issue in May in Geneva, but those talks are not believed to have touched on nuclear weapons decision-making. The U.S. defense department estimated last year that Beijing has 500 operational nuclear warheads and will probably field more than 1,000 by 2030. That compares to 1,770 and 1,710 operational warheads deployed by the United States and Russia, respectively. The Pentagon said that by 2030, much of Beijing’s weapons would probably be held at higher levels of readiness. Since 2020, China has also modernized its nuclear program, starting production of its next-generation ballistic missile submarine, testing hypersonic glide vehicle warheads and holding regular nuclear-armed sea patrols. Weapons on land, in the air and at sea give China the “nuclear triad” — a hallmark of a major nuclear power. China has not formally detailed its arsenal but officially maintains a policy of no first use and maintaining a modern nuclear deterrence that is minimal. Officials this year urged other powers to adopt the same stance. In recent semi-official exchanges with U.S. scholars and retired officials, Chinese academics said its policies remained unchanged and described Western assessments as “exaggerations.” The Biden administration updated classified nuclear guidance this year, and a White House spokesperson previously said the update was “not a response to any single entity, country, nor threat,” despite oft-expressed concern about the nuclear arsenals of China, North Korea and Russia. (Reporting by Jarrett Renshaw and Trevor Hunnicutt; Additional reporting by Eduardo Baptista; Editing by Daniel Wallis, Nick Zieminski and Richard Chang)",
  "image": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit/vip/2024/11/gettyimages-2027926323-170667a.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eU.S. President Joe Biden and Chinese President Xi Jinping agreed on Saturday that human beings and not \u003ca href=\"https://www.inc.com/associated-press/ai-power-needs-fuel-demand-for-nuclear-energy/90990439\"\u003eartificial intelligence\u003c/a\u003e should make decisions over the use of nuclear weapons, according to the \u003ca href=\"https://www.inc.com/associated-press/ai-power-needs-fuel-demand-for-nuclear-energy/90990439\"\u003eWhite House\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003e“The two leaders affirmed the need to maintain human control over the decision to use nuclear weapons,” the White House said in a statement. “The two leaders also stressed the need to consider carefully the potential risks and develop AI technology in the military field in a prudent and responsible manner.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAn official Chinese government summary of the meeting echoed this point. The Chinese foreign ministry did not immediately respond to a request for comment.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt was not clear whether the statement would lead to further talks or action on the issue. But it marks a first-of-its-kind step between the two countries in the discussion of two issues on which progress has been elusive: nuclear arms and artificial intelligence.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eWashington has been pushing Beijing for months to break a longstanding resistance to nuclear arms talks.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-nuclear-negotiations\"\u003eNuclear negotiations\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe two countries briefly resumed official-level talks over nuclear arms in November but those negotiations have since stalled, with a top U.S. official publicly expressing frustration regarding China’s responsiveness.\u003c/p\u003e\n\n\n\n\u003cp\u003eFormal nuclear arms control negotiations have not been expected any time soon, despite U.S. concerns about China’s rapid nuclear weapons build-up, even though semi-official exchanges have resumed.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eOn artificial intelligence, China and the United States launched their first formal bilateral talks on the issue in May in Geneva, but those talks are not believed to have touched on nuclear weapons decision-making.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe U.S. defense department estimated last year that Beijing has 500 operational nuclear warheads and will probably field more than 1,000 by 2030.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat compares to 1,770 and 1,710 operational warheads deployed by the United States and Russia, respectively. The Pentagon said that by 2030, much of Beijing’s weapons would probably be held at higher levels of readiness.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eSince 2020, China has also modernized its nuclear program, starting production of its next-generation ballistic missile submarine, testing hypersonic glide vehicle warheads and holding regular nuclear-armed sea patrols.\u003c/p\u003e\n\n\n\n\u003cp\u003eWeapons on land, in the air and at sea give China the “nuclear triad” — a hallmark of a major nuclear power.\u003c/p\u003e\n\n\n\n\u003cp\u003eChina has not formally detailed its arsenal but officially maintains a policy of no first use and maintaining a modern nuclear deterrence that is minimal. Officials this year urged other powers to adopt the same stance.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eIn recent semi-official exchanges with U.S. scholars and retired officials, Chinese academics said its policies remained unchanged and described Western assessments as “exaggerations.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Biden administration updated classified nuclear guidance this year, and a White House spokesperson previously said the update was “not a response to any single entity, country, nor threat,” despite oft-expressed concern about the nuclear arsenals of China, North Korea and Russia.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e(Reporting by Jarrett Renshaw and Trevor Hunnicutt; Additional reporting by Eduardo Baptista; Editing by Daniel Wallis, Nick Zieminski and Richard Chang)\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-18T00:36:19Z",
  "modifiedTime": null
}
