{
  "id": "60ea0cd2-1a43-4bf8-8dc9-c8fcbfa5a7c0",
  "title": "Converting industrial waste heat into power",
  "link": "https://springwise.com/innovation/agriculture-energy/converting-industrial-waste-heat-into-power/",
  "description": "This compact, scalable technology could help industrial plants to cut emissions",
  "author": "Matthew Hempstead",
  "published": "Mon, 04 Nov 2024 05:55:00 +0000",
  "source": "https://www.springwise.com/feed",
  "categories": null,
  "byline": "",
  "length": 2551,
  "excerpt": "This compact, scalable technology could help industrial plants to cut emissions",
  "siteName": "Springwise",
  "favicon": "",
  "text": "| Photo source The Earthshot Prize Innovation Agriculture \u0026 Energy Converting industrial waste heat into power Agriculture \u0026 Energy This compact, scalable technology could help industrial plants to cut emissions Spotted: Industrial energy consumption is dominated by fossil fuels and accounts for around a quarter of the world’s energy-related CO2 emissions. At the same time, industries such as cement and steel production also produce vast amounts of waste heat. Although there are already technologies such as turbines that convert heat to electricity, these moving technologies are considered too risky to be implemented in complex industrial environments. One company has created a low-risk, efficient alternative. Initially investigating advanced materials the company could use for solar panels, the Advanced Thermovoltaic Systems (ATS) team realised that its panels could generate electricity without light, only requiring waste ambient heat. The innovative technology captures this waste thermal energy, generated in abundance during various industrial processes, and safely converts it into electricity. The process involves passing waste heat over small plates that are approximately the size of a smartphone. The compact, container-sized units can easily be integrated into existing industrial plants and generate electricity from any heat source, including geothermal energy. There are no moving parts or hazardous chemicals, making it a lesser risk than turbines or other industrial options that are currently available. The electricity produced can be fed back into a facility’s system, boosting the energy efficiency of industrial operations and minimising its reliance on fossil fuels. On a global scale, this could have a huge impact. ATS is currently focused on scaling up its production, which requires larger manufacturing facilities. A successful pilot programme has already been carried out with a leading cement company and ATS’s target is to become operational in over 100 industrial facilities with the goal of saving 3.5 million tonnes of CO2 by 2030. The company was selected as a finalist for the 2024 Earthshot Prize. Written By: Jessica Wallis 4th November 2024 Website: ats.energy",
  "image": "https://springwise.com/wp-content/uploads/2024/11/innovationagriculture-energyconverting-industrial-waste-heat-into-power-1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n\n    \n    \u003cfigure\u003e\n        \u003cimg src=\"https://springwise.com/wp-content/uploads/2024/11/innovationagriculture-energyconverting-industrial-waste-heat-into-power-1.jpg\" alt=\"\"/\u003e\n        \u003cfigcaption\u003e \n            | Photo source \u003ca href=\"https://earthshotprize.org/\" target=\"_blank\"\u003eThe Earthshot Prize\u003c/a\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\n\n     \u003cul\u003e\n        \u003cli\u003e\n            \u003ca href=\"https://springwise.com/search?type=innovation\"\u003eInnovation\u003c/a\u003e\n        \u003c/li\u003e\n        \u003cli\u003e\n            \u003ca href=\"https://springwise.com/search?type=innovation\u0026amp;sector=agriculture-energy\"\u003eAgriculture \u0026amp; Energy\u003c/a\u003e\n        \u003c/li\u003e\n        \u003cli\u003e\n            \u003cp\u003eConverting industrial waste heat into power\u003c/p\u003e\n        \u003c/li\u003e\n    \u003c/ul\u003e\n\n    \u003csection\u003e\n\n        \u003cheader\u003e\n            \n            \u003cul\u003e\n                \u003cli\u003e\n                    \u003cimg src=\"https://springwise.com/wp-content/uploads/2018/05/united_states.png\" alt=\"\"/\u003e\n                \u003c/li\u003e\n            \u003c/ul\u003e\n            \u003cp\u003eAgriculture \u0026amp; Energy\u003c/p\u003e\n        \u003c/header\u003e\n\n        \u003ch3\u003eThis compact, scalable technology could help industrial plants to cut emissions\u003c/h3\u003e\n        \u003cdiv\u003e\n            \u003cdiv\u003e\n\u003cp\u003e\u003cstrong\u003eSpotted: \u003c/strong\u003eIndustrial energy consumption is dominated by fossil fuels and accounts for \u003ca href=\"https://www.iea.org/energy-system/industry\"\u003earound a quarter of the world’s energy-related CO2 emissions\u003c/a\u003e. At the same time, industries such as cement and steel production also produce vast amounts of waste heat. Although there are already technologies such as turbines that convert heat to electricity, these moving technologies are considered too risky to be implemented in complex industrial environments. One company has created a low-risk, efficient alternative.\u003c/p\u003e\n\n\n\n\u003cp\u003eInitially investigating advanced materials the company could use for solar panels, the Advanced Thermovoltaic Systems (ATS) team realised that its panels could generate electricity without light, only requiring waste ambient heat. The innovative technology captures this waste thermal energy, generated in abundance during various industrial processes, and safely converts it into electricity.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe process involves passing waste heat over small plates that are approximately the size of a smartphone. The compact, container-sized units can easily be integrated into existing industrial plants and generate electricity from any heat source, including geothermal energy.\u003c/p\u003e\n\n\n\n\u003cp\u003eThere are no moving parts or hazardous chemicals, making it a lesser risk than turbines or other industrial options that are currently available. The electricity produced can be fed back into a facility’s system, boosting the energy efficiency of industrial operations and minimising its reliance on fossil fuels. On a global scale, this could have a huge impact.\u003c/p\u003e\n\n\n\n\u003cp\u003eATS is currently focused on scaling up its production, which requires larger manufacturing facilities. A successful pilot programme has already been carried out with a leading cement company and ATS’s target is to become operational in over 100 industrial facilities with the goal of saving 3.5 million tonnes of CO2 by 2030. The company was selected as a finalist for the 2024 Earthshot Prize.\u003c/p\u003e\n\n\n\n\u003cp\u003eWritten By: Jessica Wallis\u003c/p\u003e\n\u003c/div\u003e\n            \u003csection\u003e\n                \u003cp\u003e4th November 2024\u003c/p\u003e\n                \u003cp\u003eWebsite: \u003ca target=\"_blank\" href=\"https://www.ats.energy/\"\u003eats.energy\u003c/a\u003e\u003c/p\u003e\n            \u003c/section\u003e\n        \u003c/div\u003e\n\n    \u003c/section\u003e\n    \n    \n\n    \n    \n\n\n          \n\n\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-04T05:55:00Z",
  "modifiedTime": "2024-11-01T13:36:40Z"
}
