{
  "id": "65baa18d-a06e-4436-a4d3-bfeffccc1419",
  "title": "The Springwise Stocking 2024",
  "link": "https://springwise.com/innovation-snapshot/the-springwise-stocking-2024/",
  "description": "Take a look at some of our favourite sustainable gift ideas for the festive season",
  "author": "Matthew Hempstead",
  "published": "Wed, 04 Dec 2024 09:26:57 +0000",
  "source": "https://www.springwise.com/feed",
  "categories": null,
  "byline": "",
  "length": 6918,
  "excerpt": "Take a look at some of our favourite sustainable gift ideas for the festive season",
  "siteName": "Springwise",
  "favicon": "",
  "text": "The air is getting colder and the nights are getting shorter, which can only mean one thing: Christmas is coming. Even if you’re not personally marking Christmas Day, December is jam-packed full of other celebrations, whether that’s Hanukkah, Kwanzaa, New Year’s, and even the end-of-year office party. But as much as the festive season is full of cheer, it’s also full of something else: waste. Compared with the rest of the year, our waste generation during the Christmas period goes up by 30 per cent. That includes things like holiday cards, wrapping paper, and the huge volumes of food that inevitably end up in the bin after overbuying on ingredients and sweet treats. There are lots of ways we can help to reduce our environmental footprint while still entering into the festive spirit, including by doing things like using repurposed materials to wrap our presents and only buying as much food and drink as we need. You can also help to make a difference in the presents you buy. If you’re yet to start your holiday shopping, why not explore some greener options to give your loved ones? To give you some inspiration, we’ve taken a dive in the Springwise Library to find our top 10 sustainable gift ideas from 2024. Take a look. top 10 Sustainable gift ideas 1. Plant-powered running shoes Photo source Zen Running Club For avid runners, high-quality shoes are a non-negotiable, but that often means materials derived from fossil fuels. Now, Zen Running Club is proving that high performance is compatible with sustainability. The company’s most recent commercial release is the FUTUREone. As well as achieving high performance, comfort, and responsiveness, the shoes are also made up of 68 per cent bio-based components. Plus, they contain enzymes in the bio-based foam that accelerate its breakdown in landfill. Read more 2. Easily repairable earbuds Photo source Fairphone Generally, when smaller electronics break, they’re readily thrown away by consumers – even though they contain valuable resources. To prevent this, Dutch company Fairphone launched Fairbuds – modular and repairable wireless earphones that are designed to last. Made using 100 per cent recycled rare earth elements, Fairbuds contain seven replaceable parts that can be easily exchanged as needed. Read more 3. Ciders made from waste fruit Photo source SXOLLIE Cider is one of the UK’s favourite summer drinks, and sustainable cider brand SXOLLIE saw an opportunity to give the beverage an environmental boost. SXOLLIE uses eating apples that aren’t “pretty enough” to be sold in shops and takes advantage of winemaking techniques to manufacture its lower-sugar cider and get the best out of this fruit that would otherwise go to waste. Read more 4. A biodiversity-boosting puffer jacket Photo source Ponda Peatlands sequester far more carbon than forests, yet these areas have substantially decreased and become degraded in recent years because of human activity and climate change. Biomaterials company Ponda has created a solution that restores wetlands and replaces the fashion industry’s resource-intensive synthetic and natural insulations with a new material. Called BioPuff, the insulation is made from the regenerative fibres of fast-growing wetlands plants. BioPuff is naturally water-repellent, lightweight, and warm, making it ideal for use in homewares and fashion, particularly puffer jackets. Read more 5. Plastic-free denim jeans Today’s clothing is full of plastic, with fossil-based polyester the world’s most widely used clothing fibre. And often to the surprise of consumers, this extends to denim. Now, Triarchy is looking to change this. The company has teamed up with denim producer Candiani to create what it claims is the world’s first plastic-free stretch denim. In place of plastic, this denim uses natural rubber harvested from the rubber tree, which results in a product that is non-toxic, microplastic-free and biodegrades within two years at the end of its life. Read more 6. Chocolate made from crop waste Photo source The Supplant Company Sugarcane is consistently one of the most widely produced crops in the world, and its cultivation is linked to mass deforestation in vulnerable ecosystems as well as highly unsustainable freshwater consumption. Wanting to develop sweet treats that don’t cost the environment, The Supplant Company turned away from sugarcane in favour of agricultural waste. The company uses fungi to transform by-products into a sugar ingredient, which has been used in a range of chocolate bars. Read more 7. Premium refillable deodorants Photo source Rollr Our bathrooms are full of products packaged in single-use plastic containers. UK startup Rollr wants to help reduce that figure with a refillable roll-on deodorant, which comes as a concentrate that fits inside an envelope. Users then mix the concentrate with water in the bottle to create a quick-drying deodorant. The organic scents Rollr uses are designed for health and well-being. For example, Rollr claims its clary sage scent reduces cortisol levels, and the vetiver scent helps keep users focused, calm, and balanced. Read more 8. An AI-powered farm in a box Photo source Agwa Reducing food mileage is one way of avoiding supply chain disruptions and resultant shortages – and grow-your-own is as local as it gets. Embracing the benefits of local growing is Agwa, which has created an autonomous vegetable system for homegrown, sustainable greens. Each Agwa comes with 60 pods of seeds as chosen by the owner. Users simply connect the device to power and Wi-Fi and install the growing pods, which can be reordered at any time. Read more 9. Powdered self care products Photo source Less is More As consumer demand increases, the emissions generated by transporting goods will rise with it. Less is More uses concentrated powders and refillable bottles to reduce its volume of packaging and transport-related carbon emissions. Every shower gel, shampoo, and hand soap comes in powder form in a paper sachet. To prepare the product, users mix the powder with tap water and shake. All the products are made from 99 per cent natural ingredients, including fragrances, which are mostly natural essential oils. Read more 10. Sustainable honey from the Andes Photo source © Leung Kwok Tung Ktleung from Pexels via Canva.com Chile has a long tradition of beekeeping, with almost 9,600 beekeepers managing more than 1.3 million hives across the country. The majority of these are small family farmers who rely on beekeeping as their primary source of income. Alma de Panal sources sustainable honey and bee products from these small beekeepers, pays them fair prices, and promotes their premium products by selling them under the Andes Bee brand. Read more Compiled By: Matilda Cox",
  "image": "https://springwise.com/wp-content/uploads/2024/12/innovation-snapshotthe-springwise-stocking-2024.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eThe air is getting colder and the nights are getting shorter, which can only mean one thing: Christmas is coming. Even if you’re not personally marking Christmas Day, December is jam-packed full of other celebrations, whether that’s Hanukkah, Kwanzaa, New Year’s, and even the end-of-year office party. But as much as the festive season is full of cheer, it’s also full of something else: waste.\u003c/p\u003e\n\n\n\n\u003cp\u003eCompared with the rest of the year, our waste generation during the Christmas period goes up by \u003ca href=\"https://www.businesswaste.co.uk/news/christmas-waste-facts-its-not-very-jolly/\"\u003e30 per cent\u003c/a\u003e. That includes things like holiday cards, wrapping paper, and the huge volumes of food that inevitably end up in the bin after overbuying on ingredients and sweet treats. There are lots of ways we can help to reduce our environmental footprint while still entering into the festive spirit, including by doing things like using repurposed materials to wrap our presents and only buying as much food and drink as we need.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can also help to make a difference in the presents you buy. If you’re yet to start your holiday shopping, why not explore some greener options to give your loved ones? To give you some inspiration, we’ve taken a dive in the Springwise Library to find our top 10 sustainable gift ideas from 2024. Take a look.\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003ch2\u003etop 10 Sustainable gift ideas\u003c/h2\u003e\n\n\n\n\u003ch3\u003e1. Plant-powered running shoes\u003c/h3\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/12/image-2.png\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/12/image-2.png 1500w, https://springwise.com/wp-content/uploads/2024/12/image-2-300x140.png 300w, https://springwise.com/wp-content/uploads/2024/12/image-2-768x357.png 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003cfigcaption\u003ePhoto source \u003ca href=\"https://zenrunningclub.com/nl\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eZen Running Club\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eFor avid runners, high-quality shoes are a non-negotiable, but that often means materials derived from fossil fuels. Now, Zen Running Club is proving that high performance \u003cem\u003eis \u003c/em\u003ecompatible with sustainability. The company’s most recent commercial release is the FUTUREone. As well as achieving high performance, comfort, and responsiveness, the shoes are also made up of 68 per cent bio-based components. Plus, they contain enzymes in the bio-based foam that accelerate its breakdown in landfill. \u003ca href=\"https://springwise.com/innovation/sport-fitness/plant-powered-sustainable-running-shoes/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e2. Easily repairable earbuds\u003c/h3\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/12/image-4.png\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/12/image-4.png 1500w, https://springwise.com/wp-content/uploads/2024/12/image-4-300x140.png 300w, https://springwise.com/wp-content/uploads/2024/12/image-4-768x357.png 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003cfigcaption\u003ePhoto source \u003ca href=\"https://www.fairphone.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFairphone\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eGenerally, when smaller electronics break, they’re readily thrown away by consumers – even though they contain valuable resources. To prevent this, Dutch company Fairphone launched Fairbuds – modular and repairable wireless earphones that are designed to last. Made using 100 per cent recycled rare earth elements, Fairbuds contain seven replaceable parts that can be easily exchanged as needed. \u003ca href=\"https://springwise.com/innovation/computing-tech/earbuds-designed-to-be-repaired-and-upgraded/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e3. Ciders made from waste fruit\u003c/h3\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/12/image-8.png\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/12/image-8.png 1500w, https://springwise.com/wp-content/uploads/2024/12/image-8-300x140.png 300w, https://springwise.com/wp-content/uploads/2024/12/image-8-768x357.png 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003cfigcaption\u003ePhoto source \u003ca href=\"https://sxollie.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSXOLLIE\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eCider is one of the UK’s favourite summer drinks, and sustainable cider brand SXOLLIE saw an opportunity to give the beverage an environmental boost. SXOLLIE uses eating apples that aren’t “pretty enough” to be sold in shops and takes advantage of winemaking techniques to manufacture its lower-sugar cider and get the best out of this fruit that would otherwise go to waste. \u003ca href=\"https://springwise.com/innovation/food-drink/making-cider-more-sustainable/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e4. A biodiversity-boosting puffer jacket\u003c/h3\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/12/image-5.png\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/12/image-5.png 1500w, https://springwise.com/wp-content/uploads/2024/12/image-5-300x140.png 300w, https://springwise.com/wp-content/uploads/2024/12/image-5-768x357.png 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003cfigcaption\u003ePhoto source \u003ca href=\"https://www.ponda.bio/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePonda\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePeatlands sequester far more carbon than forests, yet these areas have substantially decreased and become degraded in recent years because of human activity and climate change. Biomaterials company Ponda has created a solution that restores wetlands and replaces the fashion industry’s resource-intensive synthetic and natural insulations with a new material. Called BioPuff, the insulation is made from the regenerative fibres of fast-growing wetlands plants. BioPuff is naturally water-repellent, lightweight, and warm, making it ideal for use in homewares and fashion, particularly puffer jackets. \u003ca href=\"https://springwise.com/innovation/fashion-beauty/textiles-made-from-truly-regenerative-fibres/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e5. Plastic-free denim jeans\u003c/h3\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/12/image-7.png\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/12/image-7.png 1500w, https://springwise.com/wp-content/uploads/2024/12/image-7-300x140.png 300w, https://springwise.com/wp-content/uploads/2024/12/image-7-768x357.png 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eToday’s clothing is full of plastic, with fossil-based polyester the world’s most \u003ca href=\"https://cfda.com/resources/materials\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ewidely used\u003c/a\u003e clothing fibre. And often to the surprise of consumers, this extends to denim. Now, Triarchy is looking to change this. The company has teamed up with denim producer Candiani to create what it claims is the world’s first plastic-free stretch denim. In place of plastic, this denim uses natural rubber harvested from the rubber tree, which results in a product that is non-toxic, microplastic-free and biodegrades within two years at the end of its life. \u003ca href=\"https://springwise.com/innovation/fashion-beauty/plastic-free-stretch-denim/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e6. Chocolate made from crop waste\u003c/h3\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/12/image-3.png\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/12/image-3.png 1500w, https://springwise.com/wp-content/uploads/2024/12/image-3-300x140.png 300w, https://springwise.com/wp-content/uploads/2024/12/image-3-768x357.png 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003cfigcaption\u003ePhoto source \u003ca href=\"https://supplant.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Supplant Company\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eSugarcane is consistently one of the most widely produced crops in the world, and its cultivation is linked to mass deforestation in vulnerable ecosystems as well as highly unsustainable freshwater consumption. Wanting to develop sweet treats that don’t cost the environment, The Supplant Company turned away from sugarcane in favour of agricultural waste. The company uses fungi to transform by-products into a sugar ingredient, which has been used in a range of chocolate bars. \u003ca href=\"https://springwise.com/innovation/food-drink/transforming-crop-waste-into-a-sugar-substitute/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e7. Premium refillable deodorants\u003c/h3\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/12/image-6.png\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/12/image-6.png 1500w, https://springwise.com/wp-content/uploads/2024/12/image-6-300x140.png 300w, https://springwise.com/wp-content/uploads/2024/12/image-6-768x357.png 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003cfigcaption\u003ePhoto source \u003ca href=\"https://rollr.co.uk/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRollr\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eOur bathrooms are full of products packaged in single-use plastic containers. UK startup Rollr wants to help reduce that figure with a refillable roll-on deodorant, which comes as a concentrate that fits inside an envelope. Users then mix the concentrate with water in the bottle to create a quick-drying deodorant. The organic scents Rollr uses are designed for health and well-being. For example, Rollr claims its clary sage scent reduces cortisol levels, and the vetiver scent helps keep users focused, calm, and balanced. \u003ca href=\"https://springwise.com/innovation/fashion-beauty/premium-refillable-roll-on-deodorant/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e8. An AI-powered farm in a box\u003c/h3\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/12/image-1.png\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/12/image-1.png 1500w, https://springwise.com/wp-content/uploads/2024/12/image-1-300x140.png 300w, https://springwise.com/wp-content/uploads/2024/12/image-1-768x357.png 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003cfigcaption\u003ePhoto source \u003ca href=\"https://www.agwafarm.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAgwa\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eReducing food mileage is one way of avoiding supply chain disruptions and resultant shortages – and grow-your-own is as local as it gets. Embracing the benefits of local growing is Agwa, which has created an autonomous vegetable system for homegrown, sustainable greens. Each Agwa comes with 60 pods of seeds as chosen by the owner. Users simply connect the device to power and Wi-Fi and install the growing pods, which can be reordered at any time. \u003cstrong\u003e\u003ca href=\"https://springwise.com/innovation/food-drink/an-ai-powered-farm-in-a-box/\"\u003eRead more\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e9. Powdered self care products\u003c/h3\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/12/image.png\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/12/image.png 1500w, https://springwise.com/wp-content/uploads/2024/12/image-300x140.png 300w, https://springwise.com/wp-content/uploads/2024/12/image-768x357.png 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003cfigcaption\u003ePhoto source \u003ca href=\"https://lessismore.co/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLess is More\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAs consumer demand increases, the emissions generated by transporting goods will rise with it. Less is More uses concentrated powders and refillable bottles to reduce its volume of packaging and transport-related carbon emissions. Every shower gel, shampoo, and hand soap comes in powder form in a paper sachet. To prepare the product, users mix the powder with tap water and shake. All the products are made from 99 per cent natural ingredients, including fragrances, which are mostly natural essential oils. \u003ca href=\"https://springwise.com/innovation/fashion-beauty/beauty-products-with-less-packaging-and-fewer-emissions/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch3\u003e10. Sustainable honey from the Andes\u003c/h3\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/12/image-9.png\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/12/image-9.png 1500w, https://springwise.com/wp-content/uploads/2024/12/image-9-300x140.png 300w, https://springwise.com/wp-content/uploads/2024/12/image-9-768x357.png 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003cfigcaption\u003ePhoto source \u003ca href=\"https://www.canva.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e© Leung Kwok Tung Ktleung from Pexels via Canva.com\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eChile has a long tradition of beekeeping, with almost \u003ca href=\"https://apimondia2023.com/?p=apiculture#:~:text=According%20to%20official%20sources%2C%20(the,Chile%2C%20who%20manage%201%2C353.301%20hives.\"\u003e9,600 beekeepers\u003c/a\u003e managing more than 1.3 million hives across the country. The majority of these are small family farmers who rely on beekeeping as their primary source of income. Alma de Panal sources sustainable honey and bee products from these small beekeepers, pays them fair prices, and promotes their premium products by selling them under the Andes Bee brand. \u003ca href=\"https://springwise.com/innovation/food-drink/sustainable-honey-from-the-andes-mountains/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eCompiled By: Matilda Cox\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-12-04T09:26:57Z",
  "modifiedTime": "2024-12-04T09:26:59Z"
}
