{
  "id": "6a4c1d12-1060-40f2-8bcf-3ab7dda5a4e3",
  "title": "SpongeBob SquarePants is the latest icon to join the UEFN platform",
  "link": "https://venturebeat.com/games/spongebob-squarepants-is-the-latest-icon-to-join-the-uefn-platform/",
  "description": "Zoned and Paramount have brought SpongeBob to Fortnite’s UEFN platform in four new UGC-based experiences.",
  "author": "Rachel Kaser",
  "published": "Thu, 19 Dec 2024 21:01:13 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "GamesBeat",
    "Latest Games \u0026 Reviews",
    "category-/Arts \u0026 Entertainment/Comics \u0026 Animation/Cartoons",
    "Game Culture",
    "PC Games",
    "SpongeBob SquarePants",
    "UEFN",
    "UGC gaming"
  ],
  "byline": "Rachel Kaser",
  "length": 2285,
  "excerpt": "Zoned and Paramount have brought SpongeBob to Fortnite’s UEFN platform in four new UGC-based experiences.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "December 19, 2024 1:01 PM Image Credit: Zoned/Alliance Studios SpongeBob SquarePants and Bikini Bottom have joined Fortnite via its UGC platform, Unreal Editor for Fortnite. Paramount Game Studios and marketing agency Zoned have collaborated on a series of four experiences based on the popular animated series, bringing SpongeBob, Patrick and the rest to the Fortnite audience. The four games, which Zoned developed with Alliance Studios, span several familiar, popular genres. They include: Red vs Blue, in which participants attack each other with jelly blasters in a free-for-all Prop Hunt, the classic hide-and-seek game featuring Bikini Bottom aesthetics Slap Fight, in which players karate chop each other off of the board while hunting for Krabby Patties Only Up, the UGC staple, a good old obstacle course Doug Rosen, Paramount’s senior VP of games and emerging media, said of the collaboration, “We know so many fans of SpongeBob SquarePants are gamers, so it was a natural next step for us to bring Bikini Bottom to life in this authentic format for them. This collaboration with Zoned allowed us to create an engaging and immersive experience that truly captures the essence of SpongeBob and resonates with the Fortnite community.“ SpongeBob and company are far from the first to join the UEFN platform, as Zoned has worked on previous projects such as Topgolf’s UEFN experience. It’s also not the first time SpongeBob has appeared in a UGC launch, as he’s a staple on Roblox and was part of GameFam’s Super Bowl celebrations on the platform. Carlos Tovar, president of Zoned, said in a statement, “This was a dream project for the team here at Zoned because we ourselves all grew up watching SpongeBob SquarePants and are huge fans. We loved working with the incredible team at Paramount Game Studios, who truly understand how to authentically connect the SpongeBob IP with the Fortnite ecosystem. It’s an ever-evolving platform and it’s been a privilege to bring this iconic IP to fans and gamers alike!” GB Daily Stay in the know! Get the latest news in your inbox daily Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2024/12/unnamed-6.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2024-12-19T21:01:13+00:00\" datetime=\"2024-12-19T21:01:13+00:00\"\u003eDecember 19, 2024 1:01 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"422\" src=\"https://venturebeat.com/wp-content/uploads/2024/12/unnamed-6.jpg?w=750\" alt=\"\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eImage Credit: Zoned/Alliance Studios\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003eSpongeBob SquarePants and Bikini Bottom have joined Fortnite via its UGC platform, Unreal Editor for Fortnite. Paramount Game Studios and marketing agency Zoned have collaborated on a series of four experiences based on the popular animated series, bringing SpongeBob, Patrick and the rest to the Fortnite audience.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe four games, which Zoned developed with Alliance Studios, span several familiar, popular genres. They include:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eRed vs Blue, in which participants attack each other with jelly blasters in a free-for-all\u003c/li\u003e\n\n\n\n\u003cli\u003eProp Hunt, the classic hide-and-seek game featuring Bikini Bottom aesthetics\u003c/li\u003e\n\n\n\n\u003cli\u003eSlap Fight, in which players karate chop each other off of the board while hunting for Krabby Patties\u003c/li\u003e\n\n\n\n\u003cli\u003eOnly Up, the UGC staple, a good old obstacle course\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eDoug Rosen, Paramount’s senior VP of games and emerging media, said of the collaboration, “We know so many fans of SpongeBob SquarePants are gamers, so it was a natural next step for us to bring Bikini Bottom to life in this authentic format for them. This collaboration with Zoned allowed us to create an engaging and immersive experience that truly captures the essence of SpongeBob and resonates with the Fortnite community.“\u003c/p\u003e\n\n\n\n\u003cp\u003eSpongeBob and company are far from the first to join the UEFN platform, as Zoned has worked on previous projects such as \u003ca href=\"https://venturebeat.com/games/topgolf-launches-a-golfing-experience-on-fortnites-uefn-platform/\"\u003eTopgolf’s UEFN experience\u003c/a\u003e. It’s also not the first time SpongeBob has appeared in a UGC launch, as he’s a staple on Roblox and was part of \u003ca href=\"https://venturebeat.com/games/spongebob-gets-ready-for-super-bowl-lviii-with-roblox-and-gamefam/\"\u003eGameFam’s Super Bowl celebrations\u003c/a\u003e on the platform.\u003c/p\u003e\n\n\n\n\u003cp\u003eCarlos Tovar, president of Zoned, said in a statement, “This was a dream project for the team here at Zoned because we ourselves all grew up watching SpongeBob SquarePants and are huge fans. We loved working with the incredible team at Paramount Game Studios, who truly understand how to authentically connect the SpongeBob IP with the Fortnite ecosystem. It’s an ever-evolving platform and it’s been a privilege to bring this iconic IP to fans and gamers alike!”\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2663995\"\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eGB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eStay in the know! Get the latest news in your inbox daily\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-19T21:01:13Z",
  "modifiedTime": "2024-12-19T21:01:18Z"
}
