{
  "id": "778f63a5-369e-4e19-8b51-07a2a8694e7f",
  "title": "Insomniac’s VR titles delisted, casting a shadow over the technology",
  "link": "https://venturebeat.com/games/insomniacs-vr-titles-delisted-casting-a-shadow-over-the-technology/",
  "description": "Insomniac's VR games are no longer for sale, suggesting that the VR market in particular may not be a welcome technology for older titles to thrive.",
  "author": "Imran Khan",
  "published": "Mon, 03 Mar 2025 22:59:56 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "Game Development",
    "GamesBeat",
    "Gaming Business",
    "Gaming Hardware",
    "Insomniac Games",
    "Meta",
    "Oculus VR"
  ],
  "byline": "Imran Khan",
  "length": 2927,
  "excerpt": "Insomniac's VR games are no longer for sale, suggesting that the VR market in particular may not be a welcome technology for older titles to thrive.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "Before they became tied to the Spider-Man series of games and subsequently acquired to become a part of PlayStation Worldwide Studios, Burbank-based Insomniac Games dabbled in VR titles like The Edge of Nowhere and Stormland. Now these titles and more have been removed without explanation, suggesting that the VR software market and perhaps the technology as a whole has still not figured out its gaming expansion questions. Insomniac’s portfolio absence was noticed by journalist Dominic Tarason on social media, who emailed the Meta store to ask about the delistings, and was told to ask Insomniac. Tarason added that delistings likely happened “some time ago,” but that no one had noticed until now. Insomniac has not issued a statement on the delistings, but the games on the Meta store were published by Meta themselves under the Oculus Studios label, so it would be unprecedented for Insomniac to have made a unilateral decision to remove their titles from the store. Especially since they had never been ported to PlayStation VR, as they presumably would be after being acquired by PlayStation. That it took this long for anyone to notice that several notable, high-budget VR games have disappeared speaks to some of the issues with creating and marketing games for the technology. As we have previously discussed before, the next (and now current) trend for VR games is multiplayer, as it allows the market to focus on one major title at a time. The cloud beneath the silver lining of this, though, is that it means the audience moves on when their attention with that game is exhausted. There is not appetite for a backlog of older games in VR. Some of this is due to the way VR advances as a technology. Insomniac’s delisted titles were for PC VR, whereas most of the virtual reality headset use is on the Quest. While the Quest can be used on the PC, that is not the advertised (or wire-free) use-cases most will engage with. With such rapidly improving and bifurcated technology, splitting between what are essentially mainstream and enthusiast options, the idea of a long-term game on VR technology might be a far-off dream. All this to say, developers should be aware of the ways in which VR is filling the container it is in when developing a game for the technology. Even if a game takes off and exceeds first-month expectations, it is unlikely to pick up a new audience years down the line. While titles like Beat Saber stay relevant, they are also frequently ported to new platforms and headsets, which may be the easiest solution to this problem. But you do not want to end up in a situation where no one is even sure if your game is even still for sale and it takes months to notice. GB Daily Stay in the know! Get the latest news in your inbox daily Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/03/edgeofnowhere.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003eBefore they became tied to the Spider-Man series of games and subsequently acquired to become a part of PlayStation Worldwide Studios, Burbank-based Insomniac Games dabbled in VR titles like The Edge of Nowhere and Stormland. Now these titles and more have been removed without explanation, suggesting that the VR software market and perhaps the technology as a whole has still not figured out its gaming expansion questions.\u003c/p\u003e\n\n\n\n\u003cp\u003eInsomniac’s portfolio absence was \u003ca href=\"https://bsky.app/profile/did:plc:knybgc4siigl22kc5t4new4w/post/3ljd4dorpt42n\"\u003enoticed by journalist Dominic Tarason on social media\u003c/a\u003e, who emailed the Meta store to ask about the delistings, and was told to ask Insomniac. Tarason added that delistings likely happened “some time ago,” but that no one had noticed until now. Insomniac has not issued a statement on the delistings, but the games on the Meta store were published by Meta themselves under the Oculus Studios label, so it would be unprecedented for Insomniac to have made a unilateral decision to remove their titles from the store. Especially since they had never been ported to PlayStation VR, as they presumably would be after being acquired by PlayStation.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat it took this long for anyone to notice that several notable, high-budget VR games have disappeared speaks to some of the issues with creating and marketing games for the technology. As we have \u003ca href=\"https://venturebeat.com/gaming-hardware/multiplayer-the-next-big-trend-for-vr/\"\u003epreviously discussed before\u003c/a\u003e, the next (and now current) trend for VR games is multiplayer, as it allows the market to focus on one major title at a time. The cloud beneath the silver lining of this, though, is that it means the audience moves on when their attention with that game is exhausted. There is not appetite for a backlog of older games in VR.\u003c/p\u003e\n\n\n\n\u003cp\u003eSome of this is due to the way VR advances as a technology. Insomniac’s delisted titles were for PC VR, whereas most of the virtual reality headset use is on the Quest. While the Quest can be used on the PC, that is not the advertised (or wire-free) use-cases most will engage with. With such rapidly improving and bifurcated technology, splitting between what are essentially mainstream and enthusiast options, the idea of a long-term game on VR technology might be a far-off dream. \u003c/p\u003e\n\n\n\n\u003cp\u003eAll this to say, developers should be aware of the ways in which VR is filling the container it is in when developing a game for the technology. Even if a game takes off and exceeds first-month expectations, it is unlikely to pick up a new audience years down the line. While titles like Beat Saber stay relevant, they are also frequently ported to new platforms and headsets, which may be the easiest solution to this problem. But you do not want to end up in a situation where no one is even sure if your game is even still for sale and it takes months to notice.\u003c/p\u003e\n\n\n\n\n\u003cdiv id=\"boilerplate_2663995\"\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eGB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eStay in the know! Get the latest news in your inbox daily\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-03T22:59:56Z",
  "modifiedTime": "2025-03-03T23:00:02Z"
}
