{
  "id": "8ef73dae-5081-4956-a2e3-de2dfa2b29e5",
  "title": "#768: What Happens When Israelis and Palestinians Drink Ayahuasca Together?",
  "link": "",
  "description": "Welcome to another episode of The Tim Ferriss Show. For this episode, I’m doing something different. I’m featuring a very special episode from a brand-new podcast called Altered States.Here’s the teaser for the episode you’re about to hear: “For the last couple of years, producer Shaina Shealy has been following Israeli and Palestinian peace activists who have been coming together to drink the psychedelic brew ayahuasca in an effort to heal their collective intergenerational trauma. It seemed to be helping them when suddenly the region erupts into chaos and violence.” Shaina Shealy was a fellow from the Ferriss-UC Berkeley Psychedelic Journalism Fellowship, which offers ten $10,000 reporting grants per year to journalists reporting in-depth print and audio stories on the science, policy, business and culture of this new era of psychedelics. The fellowship is supported by my foundation, the Saisei Foundation, and made possible in collaboration with Michael Pollan, Malia Wollan, and others at UC Berkeley. Altered States looks at how people are taking psychedelics, who has access to them, how they're regulated, who stands to profit, and what these substances might offer us as individuals and as a society.[00:00] An intro to the Altered States podcast and its mission.[00:02:24] Shaina Shealy explains what ayahuasca is and how it affects the human brain.[00:03:47] Palestinian Sami Awad’s peace activism and ayahuasca journey.[00:17:18] Dr. Rachel Yehuda and the science of intergenerational trauma.[00:19:27] How the Israeli-Palestinian ayahuasca experiment came about.[00:25:47] Participants share their experiences.[00:38:35] How the violent events of October 7th affected the participants and the project.[00:45:52] Reflections on the experiment’s effectiveness and participants’ continued commitment to peace.[00:50:29] Closing credits.See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info.",
  "author": "",
  "published": "Tue, 17 Sep 2024 20:51:46 -0000",
  "source": "https://rss.art19.com/tim-ferriss-show",
  "categories": [
    "startups",
    "Longform Interviews",
    "Entrepreneurship",
    "Productivity",
    "Timothy Ferriss Show",
    "Timothy Ferriss",
    "Lifestyle Design",
    "Tim Ferris",
    "Tim Ferriss",
    "The 4-Hour Workweek",
    "Tools of Titans",
    "The Tim Ferriss Show"
  ],
  "byline": "",
  "length": 0,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "",
  "image": "",
  "html": "",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
