{
  "id": "99d22490-ddac-448b-a2e4-3efd91e07e0d",
  "title": "Etsy Says It Has 10 Times More Traffic — Here's How",
  "link": "https://www.entrepreneur.com/business-news/how-etsy-is-using-ai-the-cloud-to-get-10-times-more-traffic/481113",
  "description": "Etsy's revenue has more than tripled in the past five years.",
  "author": "Sherin Shibu",
  "published": "Thu, 10 Oct 2024 18:37:00 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Sherin Shibu",
  "length": 1993,
  "excerpt": "Etsy uses AI to tailor searches for products, generate gift guides, and estimate delivery times. Moving to the cloud yielded a tenfold traffic spike.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "Etsy's revenue has more than tripled, from $818 million in 2019 to $2.75 billion in 2023. And as its revenue rises, so does the platform's investments in technology. Etsy spent $470 million last year for research and development — a record high.\"I think Etsy is uniquely positioned to benefit from AI,\" Etsy CFO Rachel Glaser said in a Wednesday interview with Bloomberg. \"Finding that needle in the haystack is tricky — that's part of what makes Etsy both delightful and frustrating to people. Being able to serve the good stuff to the top fastest is where AI can really benefit us.\"Related: How To Sell on Etsy: A Comprehensive Guide How Etsy Is Using AIAI now tailors product searches on Etsy to increase the chances that a shopper will buy an item. It also gives shoppers more precise delivery times and generates gift guides.Glaser emphasized Etsy's spending on AI and other technology like cloud computing as key to laying the groundwork for more growth. Moving company data to the cloud from on-premise servers, for example, resulted in \"10 times the amount of traffic,\" Glaser said. Etsy's machine-learning tools processed data stored in the cloud more quickly than data stored locally, leading to a traffic spike. The interview also revealed that Etsy doubled its active buyer count during the pandemic, with face mask sales driving growth. According to Bloomberg estimates, Etsy sold $750 million worth of masks in 2020 and the company was able to retain the customers driving those sales even after the pandemic ended.Related: Did AI Make That? Etsy Makes It Easier to Tell If a Seller Used AI to Create a ProductEtsy has recently taken measures to differentiate AI-generated products and designs from human-created ones. The platform set \"Creativity Standards\" in July that only allow sellers to list products they have made, designed, sourced, or handpicked.Etsy had over 91 million active buyers as of its most recent earnings report, a 1% year-over-year increase.",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1728582567-Etsy-GettyImages-2150495190.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003eEtsy\u0026#39;s revenue has more than tripled, from \u003ca href=\"https://investors.etsy.com/press-releases/press-release-details/2020/Etsy-Inc-Reports-Fourth-Quarter-and-Full-Year-2019-Financial-Results/default.aspx\" rel=\"follow\" target=\"_self\"\u003e$818 million\u003c/a\u003e in 2019 to \u003ca href=\"https://www.prnewswire.com/news-releases/etsy-inc-reports-fourth-quarter-and-full-year-2023-results-302067970.html\" rel=\"follow\" target=\"_self\"\u003e$2.75 billion\u003c/a\u003e in 2023. And as its revenue rises, so does the platform\u0026#39;s investments in technology. Etsy spent \u003ca href=\"https://www.macrotrends.net/stocks/charts/ETSY/etsy/research-development-expenses\" rel=\"follow\" target=\"_self\"\u003e$470 million last year\u003c/a\u003e for research and development — a record high.\u003c/p\u003e\u003cp\u003e\u0026#34;I think Etsy is uniquely positioned to benefit from AI,\u0026#34; Etsy CFO Rachel Glaser said in a Wednesday\u003ca href=\"https://www.youtube.com/watch?v=mpmtykBb_nc\" rel=\"follow\" target=\"_self\"\u003e interview with Bloomberg\u003c/a\u003e. \u0026#34;Finding that needle in the haystack is tricky — that\u0026#39;s part of what makes Etsy both delightful and frustrating to people. Being able to serve the good stuff to the top fastest is where AI can really benefit us.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/starting-a-business/how-to-sell-on-etsy-in-2023-a-comprehensive-guide/448517\" rel=\"follow\" target=\"_self\"\u003eHow To Sell on Etsy: A Comprehensive Guide\u003c/a\u003e\u003c/p\u003e\n  \n  \n  \n\n  \u003ch2\u003eHow Etsy Is Using AI\u003c/h2\u003e\u003cp\u003eAI now \u003ca href=\"https://www.reddit.com/r/EtsySellers/comments/16nyq8g/ai_search_feature/\" rel=\"follow\" target=\"_self\"\u003etailors product searches\u003c/a\u003e on Etsy to increase the chances that a shopper will buy an item. It also gives shoppers more precise delivery times and \u003ca href=\"https://techcrunch.com/2024/01/24/etsy-launches-gift-mode-a-new-ai-powered-feature-that-generates-200-gift-guides/\" rel=\"follow\" target=\"_self\"\u003egenerates gift guides\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eGlaser emphasized Etsy\u0026#39;s spending on AI and other technology like cloud computing as key to laying the groundwork for more growth. Moving company data to the cloud from on-premise servers, for example, resulted in \u0026#34;\u003ca href=\"https://www.bloomberg.com/news/articles/2024-10-10/faced-with-an-uncertain-outlook-etsy-etsy-cfo-spends-on-ai-cloud\" rel=\"follow\" target=\"_self\"\u003e10 times the amount of traffic\u003c/a\u003e,\u0026#34; Glaser said. Etsy\u0026#39;s machine-learning tools processed data stored in the cloud more quickly than data stored locally, leading to a traffic spike.\u003c/p\u003e\n\n  \u003cp\u003eThe interview also revealed that Etsy doubled its active buyer count during the pandemic, with face mask sales driving growth. According to Bloomberg estimates, Etsy sold $750 million worth of masks in 2020 and the company was able to retain the customers driving those sales even after the pandemic ended.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/business-news/is-ai-allowed-on-etsy-new-standards-clarify-whats-allowed/476821\" rel=\"follow\" target=\"_self\"\u003eDid AI Make That? Etsy Makes It Easier to Tell If a Seller Used AI to Create a Product\u003c/a\u003e\u003c/p\u003e\u003cp\u003eEtsy has recently taken measures to differentiate AI-generated products and designs from human-created ones. The platform set \u0026#34;\u003ca href=\"https://www.entrepreneur.com/business-news/is-ai-allowed-on-etsy-new-standards-clarify-whats-allowed/476821\" rel=\"follow\" target=\"_self\"\u003eCreativity Standards\u003c/a\u003e\u0026#34; in July that only allow sellers to list products they have made, designed, sourced, or handpicked.\u003c/p\u003e\u003cp\u003eEtsy had over 91 million active buyers as of its \u003ca href=\"https://investors.etsy.com/press-releases/press-release-details/2024/Etsy-Inc.-Reports-Second-Quarter-2024-Results/default.aspx\" rel=\"follow\" target=\"_self\"\u003emost recent earnings report\u003c/a\u003e, a 1% year-over-year increase.\u003c/p\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-10T18:37:00Z",
  "modifiedTime": "2024-10-10T18:37:00Z"
}
