{
  "id": "ac7e908a-dd4e-4ff5-9408-3df025d7f9e8",
  "title": "Sleep",
  "link": "https://avc.com/2023/10/sleep/",
  "description": "I got an Oura ring a couple of years ago and have been working on improving my sleep and sleep habits ever since. For much of my adult life, I have been a poor sleeper. I have always been able to fall asleep quickly, but I have been plagued by two sleep issues. The first […]",
  "author": "Fred Wilson",
  "published": "Mon, 30 Oct 2023 11:21:32 +0000",
  "source": "https://avc.com/feed/",
  "categories": [
    "life lessons"
  ],
  "byline": "Fred Wilson",
  "length": 3674,
  "excerpt": "I got an Oura ring a couple of years ago and have been working on improving my sleep and sleep habits ever since. For much of my adult life, I have been a poor sleeper. I have always been able to fall asleep quickly, but I have been plagued by two sleep issues. The first […]",
  "siteName": "AVC",
  "favicon": "",
  "text": "I got an Oura ring a couple of years ago and have been working on improving my sleep and sleep habits ever since. For much of my adult life, I have been a poor sleeper. I have always been able to fall asleep quickly, but I have been plagued by two sleep issues. The first is waking up in the middle of the night and not being able to get back to sleep. The second is waking up early, like 4:30/5am, and being wide awake. So I’ve been working on those two things. I still wake up in the middle of the night. My Oura ring tells me that I was up from around 4am to 4:30am last night. What I’ve learned about waking up in the middle of the night is that accepting it and not fighting it is the key to falling back to sleep. When I wake up in the middle of the night, I always wake up with something on my mind. It could be work, it could be something personal, it could be something else. I often work out stuff I’m struggling with in the middle of the night. But now I let it happen and not fuss about getting back to sleep. And I fall back to sleep most nights within thirty minutes. The sleeping later thing has been harder to crack for me. I wake up with a lot of energy and I want to get out of bed and take on the world. For over twenty years, I have been blogging first thing in the morning when I wake up. I am doing that now. That is because I wake up with things on my mind and I want to work them out and for me, that means writing. But for the last year, I have been forcing myself to lie in bed instead of jumping out of bed. I started sleeping until 5:30ish last year, I started sleeping until 6ish this year, and recently I have been sleeping until 7ish. My sleep time has gone from 4-5 hours a night to almost 8 on a good night. I got 7:45 of sleep time last night, for example. I don’t always get that much sleep, but I get it a lot more frequently. Longer and better sleep has a lot of health benefits. And at age 62, I need all of the health benefits I can get. I want to age gracefully and be mentally and physically fit for as long as possible. Better sleep is part of my plan to be able to do this. Better sleep comes with some tradeoffs. I don’t have the two hours in the morning when everyone else is still asleep to read, write, and clean out my inbox. So I am writing less and my inbox is a disaster. But it seems like the right tradeoff to make. I moved my workouts to the early evening a few days a week so I no longer workout every morning. That gives me back some time in the mornings that I’ve given to staying in bed longer. I understand that not everyone can make these tradeoffs. When we had a young family, we got up when our kids got up and we went to bed every night exhausted. A lot of my sleep issues started when our kids were very young. My work schedule is very adaptable and I can do things like move my workouts to the early evenings without missing a beat at work. I am lucky that I have all of this flexibility and I am using it to stay healthy and fit. My experience over the last two years tells me that sleep habits can change and those of us who are poor sleepers can become good sleepers. I started with a device (in my case an Oura ring) that let me measure my sleep. I find that measuring helps to manage. But ultimately it is behavior change that helps the most. For me, that meant working out more, eating better, drinking less, and fretting less. I do not consider myself done with this journey to improve my sleep. I think I will be working on this my entire life. But I have made a lot of progress, I am sleeping better, and for those of you who struggle with sleep, I can assure you that you can improve your sleep too.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv v-pre=\"\"\u003e\n\u003cp\u003eI got an Oura ring a couple of years ago and have been working on improving my sleep and sleep habits ever since.\u003c/p\u003e\n\u003cp\u003eFor much of my adult life, I have been a poor sleeper. I have always been able to fall asleep quickly, but I have been plagued by two sleep issues. The first is waking up in the middle of the night and not being able to get back to sleep. The second is waking up early, like 4:30/5am, and being wide awake.\u003c/p\u003e\n\u003cp\u003eSo I’ve been working on those two things.\u003c/p\u003e\n\u003cp\u003eI still wake up in the middle of the night. My Oura ring tells me that I was up from around 4am to 4:30am last night. What I’ve learned about waking up in the middle of the night is that accepting it and not fighting it is the key to falling back to sleep. When I wake up in the middle of the night, I always wake up with something on my mind. It could be work, it could be something personal, it could be something else. I often work out stuff I’m struggling with in the middle of the night. But now I let it happen and not fuss about getting back to sleep. And I fall back to sleep most nights within thirty minutes.\u003c/p\u003e\n\u003cp\u003eThe sleeping later thing has been harder to crack for me. I wake up with a lot of energy and I want to get out of bed and take on the world. For over twenty years, I have been blogging first thing in the morning when I wake up. I am doing that now. That is because I wake up with things on my mind and I want to work them out and for me, that means writing.\u003c/p\u003e\n\u003cp\u003eBut for the last year, I have been forcing myself to lie in bed instead of jumping out of bed. I started sleeping until 5:30ish last year, I started sleeping until 6ish this year, and recently I have been sleeping until 7ish.\u003c/p\u003e\n\u003cp\u003eMy sleep time has gone from 4-5 hours a night to almost 8 on a good night. I got 7:45 of sleep time last night, for example. I don’t always get that much sleep, but I get it a lot more frequently.\u003c/p\u003e\n\u003cp\u003eLonger and better sleep has a lot of health benefits. And at age 62, I need all of the health benefits I can get. I want to age gracefully and be mentally and physically fit for as long as possible. Better sleep is part of my plan to be able to do this.\u003c/p\u003e\n\u003cp\u003eBetter sleep comes with some tradeoffs. I don’t have the two hours in the morning when everyone else is still asleep to read, write, and clean out my inbox. So I am writing less and my inbox is a disaster. But it seems like the right tradeoff to make. I moved my workouts to the early evening a few days a week so I no longer workout every morning. That gives me back some time in the mornings that I’ve given to staying in bed longer.\u003c/p\u003e\n\u003cp\u003eI understand that not everyone can make these tradeoffs. When we had a young family, we got up when our kids got up and we went to bed every night exhausted. A lot of my sleep issues started when our kids were very young. My work schedule is very adaptable and I can do things like move my workouts to the early evenings without missing a beat at work. I am lucky that I have all of this flexibility and I am using it to stay healthy and fit.\u003c/p\u003e\n\u003cp\u003eMy experience over the last two years tells me that sleep habits can change and those of us who are poor sleepers can become good sleepers. I started with a device (in my case an Oura ring) that let me measure my sleep. I find that measuring helps to manage. But ultimately it is behavior change that helps the most.\u003c/p\u003e\n\u003cp\u003eFor me, that meant working out more, eating better, drinking less, and fretting less.\u003c/p\u003e\n\u003cp\u003eI do not consider myself done with this journey to improve my sleep. I think I will be working on this my entire life. But I have made a lot of progress, I am sleeping better, and for those of you who struggle with sleep, I can assure you that you can improve your sleep too.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2023-10-30T11:21:32Z",
  "modifiedTime": "2023-10-30T11:21:33Z"
}
