{
  "id": "ae1fbbc3-67a9-46cd-b35e-44c6e2afbc9b",
  "title": "Trump Administration Extends DEI Ban to French Businesses",
  "link": "https://www.inc.com/reuters/trump-administration-extends-dei-ban-to-french-businesses/91168961",
  "description": "The policy comes in the form of a DEI questionnaire issued to French companies.",
  "author": "Reuters",
  "published": "Sat, 29 Mar 2025 18:56:40 -0400",
  "source": "https://www.inc.com/rss/",
  "categories": [
    "Lead"
  ],
  "byline": "Reuters",
  "length": 3604,
  "excerpt": "The policy comes in the form of a DEI questionnaire issued to French companies.",
  "siteName": "Inc",
  "favicon": "https://www.inc.com/_public/icons/apple-icon.png",
  "text": "The Trump administration has ordered some French companies with U.S. government contracts to comply with his executive order banning diversity, equity, and inclusion programs, highlighting the extraterritorial reach of U.S. policies and their potential impact on European corporate practices. The companies have been told to confirm their compliance in a questionnaire entitled “Certification Regarding Compliance With Applicable Federal Anti-Discrimination Law.” Reuters has seen a copy of the questionnaire. President Donald Trump’s “America First” policies have stoked economic and political tensions between the U.S. and Europe since his January 20 inauguration.  The U.S. questionnaire raises questions about the practical changes targeted companies may need to implement, given the differing approaches between the U.S. and France. U.S. companies have embraced Diversity, Equity, and Inclusion policies, tracking race and ethnicity data and setting diversity targets. In France, a secular approach limits such practices, with laws restricting data collection and corporate efforts focusing more on gender and socioeconomic background. The questionnaire will also spark concerns in European boardrooms that the Trump administration is widening its fight against DEI policies overseas, at a time when Trump’s actions on tariffs and security ties have upended transatlantic relations. French business daily Les Echos, which first reported the U.S. demand late on Friday, said it had been sent out to firms by the U.S. embassy in Paris.  “We inform you that Executive Order 14173, Ending Illegal Discrimination and Restoring Merit-based Opportunities, signed by President Trump, applies to all suppliers and service providers of the U.S. Government, regardless of their nationality and the country in which they operate,” reads the letter, according to a copy that French newspaper Le Figaro published on its website. “We would be grateful if you could complete and sign the document in English within five days and return it to us by email. If you do not agree to sign this document, we would appreciate if you could provide detailed reasons, which we will forward to our legal services,” the letter added, with reference to the certification seen by Reuters.  An embassy spokesperson did not immediately respond to a request for comment. ‘Unacceptable’ There was no indication that the companies receiving the letter were selected based on their presence in the U.S. A source close to the matter confirmed that France’s state-controlled telecoms group Orange, which has no U.S. presence, received the letter.  Meanwhile, defence electronics firm Thales and oil major TotalEnergies, both with operations in the U.S., did not receive it, according to spokespeople for the companies. Orange declined to comment.  “American interference in the inclusion policies of French companies, along with threats of unjustified tariffs, is unacceptable,” France’s Ministry of Foreign Trade said in a statement sent to Reuters. “France and Europe will defend their businesses, their consumers, and also their values,” the ministry, which is under the authority of the country’s Ministry of Foreign Affairs, added. It was not immediately clear if similar letters and questionnaires had been sent to foreign companies in other European countries. (Reporting by John Irish and Mathieu Rosemain. Editing by Richard Lough, Kirsten Donovan, Mark Potter and Paul Simao)The final application deadline for the 2025 Inc. 5000 is Friday, April 25, at 11:59 p.m. PT. Apply Today.",
  "image": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit/vip/2025/03/GettyImages-1498376318.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe Trump administration has ordered some French companies with U.S. government contracts to comply with his executive order banning \u003ca href=\"https://www.inc.com/bruce-crumley/anti-dei-pressure-on-federal-contractors-grows-as-efforts-target-more-private-companies/91167646\"\u003ediversity, equity, and inclusion programs\u003c/a\u003e, highlighting the extraterritorial reach of U.S. policies and their potential impact on European corporate \u003ca href=\"https://www.inc.com/kit-eaton/federal-agencies-sort-of-spell-out-the-dei-practices-your-company-needs-to-avoid/91167786\"\u003epractices\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eThe companies have been told to confirm their compliance in a questionnaire entitled “Certification Regarding Compliance With Applicable Federal Anti-Discrimination Law.” Reuters has seen a copy of the questionnaire.\u003c/p\u003e\n\n\n\n\u003cp\u003ePresident Donald Trump’s “America First” policies have stoked economic and political tensions between the U.S. and Europe since his January 20 inauguration. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe U.S. questionnaire raises questions about the practical changes targeted companies may need to implement, given the differing approaches between the U.S. and France.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003csvg width=\"28\" height=\"20\" aria-label=\"Video player icon\"\u003e\u003cuse href=\"/_public/sprite.svg?v=12#video-player\"\u003e\u003c/use\u003e\u003c/svg\u003e\u003cp\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg alt=\"Collapse icon\" loading=\"lazy\" width=\"15\" height=\"15\" decoding=\"async\" data-nimg=\"1\" srcset=\"https://www.inc.com/_next/image?url=%2F_public%2Fcollapse-icon_2x.webp\u0026amp;w=16\u0026amp;q=75 1x, https://www.inc.com/_next/image?url=%2F_public%2Fcollapse-icon_2x.webp\u0026amp;w=32\u0026amp;q=75 2x\" src=\"https://www.inc.com/_next/image?url=%2F_public%2Fcollapse-icon_2x.webp\u0026amp;w=32\u0026amp;q=75\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eU.S. companies have embraced Diversity, Equity, and Inclusion policies, tracking race and ethnicity data and setting diversity targets. In France, a secular approach limits such practices, with laws restricting data collection and corporate efforts focusing more on gender and socioeconomic background.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe questionnaire will also spark concerns in European boardrooms that the Trump administration is widening its fight against DEI policies overseas, at a time when Trump’s actions on tariffs and security ties have upended transatlantic relations.\u003c/p\u003e\n\n\n\n\u003cp\u003eFrench business daily Les Echos, which first reported the U.S. demand late on Friday, said it had been sent out to firms by the U.S. embassy in Paris. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003e“We inform you that Executive Order 14173, Ending Illegal Discrimination and Restoring Merit-based Opportunities, signed by President Trump, applies to all suppliers and service providers of the U.S. Government, regardless of their nationality and the country in which they operate,” reads the letter, according to a copy that French newspaper Le Figaro published on its website.\u003c/p\u003e\n\n\n\n\u003cp\u003e“We would be grateful if you could complete and sign the document in English within five days and return it to us by email. If you do not agree to sign this document, we would appreciate if you could provide detailed reasons, which we will forward to our legal services,” the letter added, with reference to the certification seen by Reuters. \u003c/p\u003e\n\n\n\n\u003cp\u003eAn embassy spokesperson did not immediately respond to a request for comment.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003ch2 id=\"h-unacceptable\"\u003e‘Unacceptable’\u003c/h2\u003e\n\n\n\n\u003cp\u003eThere was no indication that the companies receiving the letter were selected based on their presence in the U.S. A source close to the matter confirmed that France’s state-controlled telecoms group Orange, which has no U.S. presence, received the letter. \u003c/p\u003e\n\n\n\n\u003cp\u003eMeanwhile, defence electronics firm Thales and oil major TotalEnergies, both with operations in the U.S., did not receive it, according to spokespeople for the companies. Orange declined to comment. \u003c/p\u003e\n\n\n\n\u003cp\u003e“American interference in the inclusion policies of French companies, along with threats of unjustified tariffs, is unacceptable,” France’s Ministry of Foreign Trade said in a statement sent to Reuters.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003e“France and Europe will defend their businesses, their consumers, and also their values,” the ministry, which is under the authority of the country’s Ministry of Foreign Affairs, added.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt was not immediately clear if similar letters and questionnaires had been sent to foreign companies in other European countries.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e(Reporting by John Irish and Mathieu Rosemain. Editing by Richard Lough, Kirsten Donovan, Mark Potter and Paul Simao)\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ci\u003eThe final application deadline for the 2025 \u003ca href=\"https://www.inc.com/inc5000/apply\"\u003eInc. 5000\u003c/a\u003e is Friday, April 25, at 11:59 p.m. PT. \u003ca href=\"https://www.inc.com/inc5000/apply\"\u003eApply Today\u003c/a\u003e. \u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-29T22:56:40Z",
  "modifiedTime": "2025-03-29T22:56:41Z"
}
