{
  "id": "aeb80f0e-e1c3-4d32-a98b-6b0410fee016",
  "title": "Cozy video games can quell stress and anxiety",
  "link": "https://www.reuters.com/business/retail-consumer/cozy-video-games-can-quell-stress-anxiety-2025-01-27/",
  "description": "Article URL: https://www.reuters.com/business/retail-consumer/cozy-video-games-can-quell-stress-anxiety-2025-01-27/ Comments URL: https://news.ycombinator.com/item?id=43733097 Points: 19 # Comments: 10",
  "author": "vinhnx",
  "published": "Sat, 19 Apr 2025 00:21:13 +0000",
  "source": "https://hnrss.org/frontpage",
  "categories": null,
  "byline": "Tiana McGee, Daisy Chung, Dea Bankova",
  "length": 7967,
  "excerpt": "Explore a charming town, meet quirky villagers, and take in the cozy vibes!",
  "siteName": "Reuters",
  "favicon": "https://www.reuters.com/pf/resources/images/reuters/favicon/tr_fvcn_kinesis_180x180_v2.png?d=227",
  "text": "0:00 am Design your character Typical cozy games include a “character creation” stage, where players can customize the protagonist and step into the world with their bespoke avatar. Give it a try, or just keep scrolling. The holiday season has wrapped up, but winter stretches on. It’s time to get cozy. Tuck under the covers, brew a warm cup of tea, and settle in with your gaming console. Don’t feel guilty, it might even be good for you. At least that’s what cozy game-makers would tell you, and some recent studies suggest they may have a point. The gaming industry is larger than the film and music industries combined globally. A growing sector is the subgenre dubbed “cozy games.” They are marked by their relaxing nature, meant to help players unwind with challenges that are typically more constructive than destructive. Recent research explores whether this style of game, along with video games more generally, can improve mental health and quality of life. These play-at-your-own-pace games attract both longtime gamers and newcomers. The genre got its start with games like the farming sim Harvest Moon in 1996. With the release of Animal Crossing: New Horizons in 2020, there’s been a rise in the number of cozy games and a significant increase in popularity. There’s no hard definition for a “cozy game.” If the game gives the player a cozy, warm feeling then it fits. In Cozy games, it’s virtually impossible to lose. Fights are easy to win (if there are fights at all). Help tidy up A perfectly manicured world isn’t all that cozy. Many of these games ask you to lend a helping hand. So, get in there with your ax and clean up the driftwood. It might just come in handy later. Help tidy up A perfectly manicured world isn’t all that cozy. Many of these games ask you to lend a helping hand. So, get in there with your ax and clean up the driftwood. It might just come in handy later. A bear blocks your way! Press and hold to sing him to sleep. A bear blocks your way! Press and hold to sing him to sleep. Because the games focus on offering a feeling of comfort, they don’t require extreme skill. Dorian Signargout, also known as Doot, is a game developer and one half of the couple duo who created Minami Lane. He says he is dedicated to making games a platform for promoting inclusivity. “Every game is a view on how the world should be or should not be, and ours is too,” Signargout said. “So, for example, we knew from the start that if we made humanoid people, we wanted to give them colors of a wide range, and so that's what we did. We knew that we wanted to give them names, genders, and stuff that could be a bit of a mix between nonbinary, male, female, and that's in the game too.” Time to garden You’ve suitably impressed the townsfolk and they’re ready to give you some land of your own. Go talk to the farmer to get yourself some seeds. Time to garden You’ve suitably impressed the townsfolk and they’re ready to give you some land of your own. Go talk to the farmer to get yourself some seeds. Click and hold on any plot to plant and miraculously grow a flower. Click and hold on any plot to plant and miraculously grow a flower. Video games aren't always considered something with the potential for good. In 2019, Gaming Disorder was listed in the 11th Revision of the International Classification of Diseases. It is “characterized by impaired control over gaming, increasing priority given to gaming over other activities to the extent that gaming takes precedence over other interests and daily activities.” Such views sparked researchers like Hiroyuki Egami, assistant professor at Nihon University, to look more closely at the correlation and potential causation between video gaming and negative effects such as aggression. Some studies at the time suggested a link but Egami found that many of these were inconclusive about causation. Last year, Egami published a study addressing the causal effect of video gaming on mental well-being in Japan 2020–2022. During the pandemic, supply chain disruptions and increased demand limited the availability of two major gaming consoles: the Nintendo Switch and the PlayStation 5. Japanese retailers implemented lotteries to assign the consoles to consumers, inadvertently creating a seemingly random distribution of opportunities for people to purchase them. Egami's study found that owning a game console and increased gameplay reduced psychological distress and improved life satisfaction among participants. The study found that spending just one extra hour each day playing video games was associated with an increase in mental health and life satisfaction. Other studies also point to a shift in perceptions of gaming. “As more research has emerged related to video games, we're beginning to recognize that they can actually offer a lot of benefits,” said Michael Wong, an assistant professor in the Department of Psychiatry and Behavioral Neurosciences at McMaster University and former professor at the University of Wisconsin-La Crosse Wong surveyed 80 undergraduate students at the University of Wisconsin-La Crosse to uncover whether mindfulness meditation or “casual” gaming was better at reducing stress. The study published in 2021 measured the effectiveness of playing a casual game like Flower, developed by Thatgamecompany, against a 20-minute mindfulness meditation session in reducing stress. “To our surprise, there really wasn't a difference between the two forms of interventions. For blood pressure and heart rate, there was no statistically significant difference between playing a video game and engaging in meditation,” Wong said. Games are also used by therapists. According to research from 2022 by Aarón Sújar, an assistant professor at Rey Juan Carlos University, video games are being investigated as an innovative method to manage Attention deficit hyperactivity disorder (ADHD). With their pretty packaging, these games can tackle serious topics while maintaining a sense of childlike wonder. Spiritfarer, for example, is a game in which you play as Stella, ferry master to the deceased. She’s modeled after a palliative care nurse. But the game lets you explore death and grief as you garden, meet colorful characters, and enjoy a world with vibrant art, much like the work of Japanese animator and manga artist Hayao Miyazaki, whose work inspired the game. Nicolas Guérin, creative director for the game, recalled a response that particularly moved him. A woman wrote in regarding her experience as a nurse in an end-of-life care facility. “She told us basically, ‘I had given up hope on my own profession, and then I played the game and it helped me process through what my own emotions were.’ And then she got back on the saddle and rekindled her own love for the job and felt it was important,” he said. For many, these games become a sanctuary. In a world that can feel overwhelming, cozy games remind us of the beauty in simplicity. So, go on. Fire up the console. Welcome back home, Nori! Now that you’ve made friends, improved your town and connected with your nature, you’re ready to cozify your own house. Clean it up and decorate, two key parts of a classic cozy game. Welcome back home, Nori! Now that you’ve made friends, improved your town and connected with your nature, you’re ready to cozify your own house. Clean it up and decorate, two key parts of a classic cozy game. Swipe with the broom to clean your house Swipe with the broom to clean your house Drag items from your inventory into your house to decorate. Writing and Reporting by Tiana McGee Illustrations by Daisy Chung Development by Dea Bankova Julia Wolfe Tiana McGee Design by Daisy Chung Tiana McGee Julia Wolfe Sound design by Travis Hartman Animations by Daisy Chung Holly Murtha Editing By Julia Wolfe Claudia Parsons Julia Wolfe, Claudia Parsons",
  "image": "https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/Cozy-share1.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main-content\"\u003e\u003carticle\u003e     \u003caudio id=\"audioPlayer-door\" shouldplay=\"false\" src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/sounds/squeak1.mp3\" preload=\"auto\"\u003e\u003c/audio\u003e \u003caudio id=\"audioPlayer-tock\" shouldplay=\"false\" src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/sounds/tock.mp3\" preload=\"auto\"\u003e\u003c/audio\u003e       \u003caudio id=\"audioPlayer-fire\" shouldplay=\"false\" src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/sounds/fire.mp3\" preload=\"auto\"\u003e\u003c/audio\u003e   \u003cdiv\u003e \u003cp\u003e\u003cspan\u003e0:00\u003c/span\u003e \u003cspan\u003eam\u003c/span\u003e\u003c/p\u003e \u003cp\u003e\u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/ux/daynightcycle/4-Night1.png\" alt=\"moon\"/\u003e\u003c/p\u003e \u003c/div\u003e \u003csection\u003e\u003caudio id=\"audioPlayer-pop1\" shouldplay=\"false\" src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/sounds/pop1.mp3\" preload=\"auto\"\u003e\u003c/audio\u003e \u003caudio id=\"audioPlayer-pop2\" shouldplay=\"false\" src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/sounds/pop2.mp3\" preload=\"auto\"\u003e\u003c/audio\u003e \u003caudio id=\"audioPlayer-pop3\" shouldplay=\"false\" src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/sounds/pop3.mp3\" preload=\"auto\"\u003e\u003c/audio\u003e \u003cheader\u003e\u003ch2\u003eDesign your character\u003c/h2\u003e \u003cp\u003eTypical cozy games include a “character creation” stage, where players can customize the protagonist and step into the world with their bespoke avatar. Give it a try, or just keep scrolling.\u003c/p\u003e\u003c/header\u003e    \u003c/section\u003e \u003cdiv id=\"\"\u003e\u003cp\u003eThe holiday season has wrapped up, but winter stretches on. It’s time to get cozy. Tuck under the covers, brew a warm cup of tea, and settle in with your gaming console. Don’t feel guilty, it might even be good for you.\u003c/p\u003e\n\u003cp\u003eAt least that’s what cozy game-makers would tell you, and some recent studies suggest they may have a point.\u003c/p\u003e\n\u003cp\u003eThe gaming industry is larger than the film and music industries combined globally. A growing sector is the subgenre dubbed “cozy games.” They are marked by their relaxing nature, meant to help players unwind with challenges that are typically more constructive than destructive. Recent research explores whether this style of game, along with video games more generally, can improve mental health and quality of life.\u003c/p\u003e\n\u003cp\u003eThese play-at-your-own-pace games attract both longtime gamers and newcomers. \u003c/p\u003e\n\u003cp\u003eThe genre got its start with games like the farming sim Harvest Moon in 1996. \u003c/p\u003e\n\u003cp\u003eWith the release of Animal Crossing: New Horizons in 2020, there’s been a rise in the number of cozy games and a significant increase in popularity.\u003c/p\u003e\n\u003cp\u003eThere’s no hard definition for a “cozy game.” If the game gives the player a cozy, warm feeling then it fits.\u003c/p\u003e\n\u003c/div\u003e          \u003cdiv id=\"\"\u003e \u003cdiv id=\"\"\u003e   \u003cp\u003eIn Cozy games, it’s virtually impossible to lose. Fights are easy to win (if there are fights at all).\u003c/p\u003e \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eHelp tidy up\u003c/span\u003e A perfectly manicured world isn’t all that cozy. Many of these games ask you to lend a helping hand. So, get in there with your ax and clean up the driftwood. It might just come in handy later.\u003c/p\u003e \u003cp\u003e\u003cspan\u003eHelp tidy up\u003c/span\u003e A perfectly manicured world isn’t all that cozy. Many of these games ask you to lend a helping hand. So, get in there with your ax and clean up the driftwood. It might just come in handy later.\u003c/p\u003e  \u003c/div\u003e \u003cdiv id=\"section-bear-wood-forest\"\u003e         \u003cp\u003e\u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/world/2_A11Y/woods.png\" alt=\"Illustration in the style of pixel art of a wood with some green trees partially covered in snow. Snow is also covering the ground and small footsteps can be seen along a winding path through the wood. A small purple bunny sits on top of a tree trunk and 3 radishes sit around a campfire. At the end of the wood there is a bear which is asking for you to sing it a song to put it to sleep.\"/\u003e \u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/world/2_A11Y/woods-impassable.png\" alt=\"\"/\u003e\u003c/p\u003e        \u003cp\u003eA bear blocks your way! Press and hold to sing him to sleep.\u003c/p\u003e \u003cp\u003eA bear blocks your way! Press and hold to sing him to sleep.\u003c/p\u003e       \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/world/2_A11Y/Progress bar-bear sleep-outer1.png\" alt=\"\"/\u003e\u003c/p\u003e \u003cp\u003e\u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/world/2_A11Y/Progress bar-bear sleep-inner1.png\" alt=\"\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"\"\u003e\u003cp\u003eBecause the games focus on offering a feeling of comfort, they don’t require extreme skill. \u003c/p\u003e\n\u003cp\u003eDorian Signargout, also known as Doot, is a game developer and one half of the couple duo who created Minami Lane. He says he is dedicated to making games a platform for promoting inclusivity.\u003c/p\u003e\n\u003cp\u003e“Every game is a view on how the world should be or should not be, and ours is too,” Signargout said. “So, for example, we knew from the start that if we made humanoid people, we wanted to give them colors of a wide range, and so that\u0026#39;s what we did. We knew that we wanted to give them names, genders, and stuff that could be a bit of a mix between nonbinary, male, female, and that\u0026#39;s in the game too.”\u003c/p\u003e\n\u003c/div\u003e \u003c/div\u003e     \u003cdiv id=\"\"\u003e \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eTime to garden\u003c/span\u003e  You’ve suitably impressed the townsfolk and they’re ready to give you some land of your own. Go talk to the farmer to get yourself some seeds.\u003c/p\u003e \u003cp\u003e\u003cspan\u003eTime to garden\u003c/span\u003e  You’ve suitably impressed the townsfolk and they’re ready to give you some land of your own. Go talk to the farmer to get yourself some seeds.\u003c/p\u003e  \u003c/div\u003e  \u003cdiv id=\"section-garden\"\u003e      \u003cp\u003eClick and hold on any plot to plant and miraculously grow a flower.\u003c/p\u003e \u003cp\u003eClick and hold on any plot to plant and miraculously grow a flower.\u003c/p\u003e  \u003cp\u003e\u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/world/3_MentalHealth/3_Mental-health-garden2.png\" alt=\"Illustration in the style of pixel art of a garden that has a sign saying ‘Rad Garden’ at its entrance. The garden includes a greenhouse, trees, and small plots of plants. A small bridge connects the main garden to another plot with 6 spots where the radish can plant the seeds collected from the farmer radish who waits at the bridge.\"/\u003e \u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/world/3_MentalHealth/foreground.png\" alt=\"\"/\u003e  \u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/world/1_Community/farmer radish1.png\" alt=\"Illustration of a radish who is a farmer\"/\u003e\u003c/p\u003e\u003c/div\u003e    \u003cdiv id=\"\"\u003e\u003cp\u003eVideo games aren\u0026#39;t always considered something with the potential for good. In 2019, Gaming Disorder was listed in the 11th Revision of the International Classification of Diseases. It is “characterized by impaired control over gaming, increasing priority given to gaming over other activities to the extent that gaming takes precedence over other interests and daily activities.” \u003c/p\u003e\n\u003cp\u003eSuch views sparked researchers like Hiroyuki Egami, assistant professor at Nihon University, to look more closely at the correlation and potential causation between video gaming and negative effects such as aggression. Some studies at the time suggested a link but Egami found that many of these were inconclusive about causation. Last year, Egami published a study addressing the causal effect of video gaming on mental well-being in Japan 2020–2022.\u003c/p\u003e\n\u003cp\u003eDuring the pandemic, supply chain disruptions and increased demand limited the availability of two major gaming consoles: the Nintendo Switch and the PlayStation 5. Japanese retailers implemented lotteries to assign the consoles to consumers, inadvertently creating a seemingly random distribution of opportunities for people to purchase them. \u003c/p\u003e\n\u003cp\u003eEgami\u0026#39;s study found that owning a game console and increased gameplay reduced psychological distress and improved life satisfaction among participants. The study found that spending just one extra hour each day playing video games was associated with an increase in mental health and life satisfaction.\u003c/p\u003e\n\u003cp\u003eOther studies also point to a shift in perceptions of gaming. “As more research has emerged related to video games, we\u0026#39;re beginning to recognize that they can actually offer a lot of benefits,” said Michael Wong, an assistant professor in the Department of Psychiatry and Behavioral Neurosciences at McMaster University and former professor at the University of Wisconsin-La Crosse\u003c/p\u003e\n\u003cp\u003eWong surveyed 80 undergraduate students at the University of Wisconsin-La Crosse to uncover whether mindfulness meditation or “casual” gaming was better at reducing stress. The study published in 2021 measured the effectiveness of playing a casual game like Flower, developed by Thatgamecompany, against a 20-minute mindfulness meditation session in reducing stress. \u003c/p\u003e\n\u003cp\u003e“To our surprise, there really wasn\u0026#39;t a difference between the two forms of interventions. For blood pressure and heart rate, there was no statistically significant difference between playing a video game and engaging in meditation,” Wong said. \u003c/p\u003e\n\u003cp\u003eGames are also used by therapists. \u003c/p\u003e\n\u003cp\u003eAccording to research from 2022 by \u003ca href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC9379781/\"\u003eAarón Sújar\u003c/a\u003e, an assistant professor at Rey Juan Carlos University, video games are being investigated as an innovative method to manage Attention deficit hyperactivity disorder (ADHD).\u003c/p\u003e\n\u003c/div\u003e \u003c/div\u003e     \u003cdiv id=\"\"\u003e \u003cdiv id=\"\"\u003e\u003cp\u003eWith their pretty packaging, these games can tackle serious topics while maintaining a sense of childlike wonder.\u003c/p\u003e\n\u003cp\u003eSpiritfarer, for example, is a game in which you play as Stella, ferry master to the deceased. She’s modeled after a palliative care nurse. But the game lets you explore death and grief as you garden, meet colorful characters, and enjoy a world with vibrant art, much like the work of Japanese animator and manga artist Hayao Miyazaki, whose work inspired the game. \u003c/p\u003e\n\u003cp\u003eNicolas Guérin, creative director for the game, recalled a response that particularly moved him. A woman wrote in regarding her experience as a nurse in an end-of-life care facility.\u003c/p\u003e\n\u003cp\u003e“She told us basically, ‘I had given up hope on my own profession, and then I played the game and it helped me process through what my own emotions were.’ And then she got back on the saddle and rekindled her own love for the job and felt it was important,” he said.\u003c/p\u003e\n\u003cp\u003eFor many, these games become a sanctuary. In a world that can feel overwhelming, cozy games remind us of the beauty in simplicity. So, go on. Fire up the console.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWelcome back home, Nori! Now that you’ve made friends, improved your town and connected with your nature, you’re ready to cozify your own house. Clean it up and decorate, two key parts of a classic cozy game.\u003c/p\u003e \u003cp\u003eWelcome back home, Nori! Now that you’ve made friends, improved your town and connected with your nature, you’re ready to cozify your own house. Clean it up and decorate, two key parts of a classic cozy game.\u003c/p\u003e  \u003c/div\u003e \u003cdiv id=\"wrapper-section-house-clean-and-credits\"\u003e      \u003cdiv id=\"section-house-interior-end\"\u003e \u003cp\u003eSwipe with the broom to clean your house\u003c/p\u003e \u003cp\u003eSwipe with the broom to clean your house\u003c/p\u003e  \u003cp\u003eDrag items from your inventory into your house to decorate.\u003c/p\u003e \u003cp\u003e\u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/ux/swipe.png\"/\u003e\u003c/p\u003e \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/ux/Progress bar-clean-outer1.png\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/ux/Broom2.png\" draggable=\"true\"/\u003e\u003c/p\u003e \u003cp\u003e\u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/world/House/House-night-clean1.png\" alt=\"\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003c/div\u003e \u003csection data-svelte-h=\"svelte-nd2dh4\" id=\"wrapper-credits\"\u003e\u003cdiv\u003e \u003cdiv\u003e\u003cp\u003eWriting and Reporting by\u003c/p\u003e \u003cp\u003eTiana McGee\u003c/p\u003e\u003c/div\u003e \u003cdiv\u003e\u003cp\u003eIllustrations by\u003c/p\u003e \u003cp\u003eDaisy Chung\u003c/p\u003e\u003c/div\u003e \u003cdiv\u003e\u003cp\u003eDevelopment by\u003c/p\u003e \u003cp\u003eDea Bankova\u003c/p\u003e \u003cp\u003eJulia Wolfe\u003c/p\u003e \u003cp\u003eTiana McGee\u003c/p\u003e\u003c/div\u003e \u003cdiv\u003e\u003cp\u003eDesign by\u003c/p\u003e \u003cp\u003eDaisy Chung\u003c/p\u003e \u003cp\u003eTiana McGee\u003c/p\u003e \u003cp\u003eJulia Wolfe\u003c/p\u003e\u003c/div\u003e \u003cdiv\u003e\u003cp\u003eSound design by\u003c/p\u003e \u003cp\u003eTravis Hartman\u003c/p\u003e\u003c/div\u003e \u003cdiv\u003e\u003cp\u003eAnimations by\u003c/p\u003e \u003cp\u003eDaisy Chung\u003c/p\u003e \u003cp\u003eHolly Murtha\u003c/p\u003e\u003c/div\u003e \u003cdiv\u003e\u003cp\u003eEditing By\u003c/p\u003e \u003cp\u003eJulia Wolfe\u003c/p\u003e \u003cp\u003eClaudia Parsons\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e \u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/ux/credits.png\" alt=\"A theatre with radishes watching the credits roll in\"/\u003e \u003cimg src=\"https://www.reuters.com/graphics/VIDEO-GAMES/MENTAL-HEALTH/akpeewkqgpr/cdn/images/ux/Credit Scene_1-JustRadish.png\" alt=\"radishes watching the credits roll in\"/\u003e \u003c/section\u003e \u003c/div\u003e \u003c/div\u003e        \u003cdiv id=\"\"\u003e  \u003cp\u003eJulia Wolfe, Claudia Parsons\u003c/p\u003e \u003c/div\u003e\u003c/article\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-01-27T16:00:00Z",
  "modifiedTime": null
}
