{
  "id": "b3b1aac6-53a0-48d4-a3c6-e05ae8185928",
  "title": "The Mysterious Flow of Fluid in the Brain",
  "link": "https://www.quantamagazine.org/the-mysterious-flow-of-fluid-in-the-brain-20250326/",
  "description": "Article URL: https://www.quantamagazine.org/the-mysterious-flow-of-fluid-in-the-brain-20250326/ Comments URL: https://news.ycombinator.com/item?id=43489136 Points: 10 # Comments: 1",
  "author": "pseudolus",
  "published": "Thu, 27 Mar 2025 00:31:47 +0000",
  "source": "https://hnrss.org/frontpage",
  "categories": null,
  "byline": "By Veronique Greenwood",
  "length": 14017,
  "excerpt": "A popular hypothesis for how the brain clears molecular waste, which may help explain why sleep feels refreshing, is a subject of debate.",
  "siteName": "Quanta Magazine",
  "favicon": "https://www.quantamagazine.org/wp-content/themes/quanta2024/frontend/images/favicon.png",
  "text": "A popular hypothesis for how the brain clears molecular waste, which may help explain why sleep feels refreshing, is a subject of debate. No one knows why cerebrospinal fluid circulates through and around our brains, or what directs its flow. Chanelle Nibbelink for Quanta Magazine Introduction Encased in the skull, perched atop the spine, the brain has a carefully managed existence. It receives only certain nutrients, filtered through the blood-brain barrier; an elaborate system of protective membranes surrounds it. That privileged space contains a mystery. For more than a century, scientists have wondered: If it’s so hard for anything to get into the brain, how does waste get out? The brain has one of the highest metabolisms of any organ in the body, and that process must yield by-products that need to be removed. In the rest of the body, blood vessels are shadowed by a system of lymphatic vessels. Molecules that have served their purpose in the blood move into these fluid-filled tubes and are swept away to the lymph nodes for processing. But blood vessels in the brain have no such outlet. Several hundred kilometers of them, all told, seem to thread their way through this dense, busily working tissue without a matching waste system. However, the brain’s blood vessels are surrounded by open, fluid-filled spaces. In recent decades, the cerebrospinal fluid, or CSF, in those spaces has drawn a great deal of interest. “Maybe the CSF can be a highway, in a way, for the flow or exchange of different things within the brain,” said Steven Proulx, who studies the CSF system at the University of Bern. A recent paper in Cell contains a new report about what is going on around the brain and in its hidden cavities. A team at the University of Rochester led by the neurologist Maiken Nedergaard asked whether the slow pumping of the brain’s blood vessels might be able to push the fluid around, among, and in some cases through cells, to potentially drive a system of drainage. In a mouse model, researchers injected a glowing dye into CSF, manipulated the blood vessel walls to trigger a pumping action, and saw the dye concentration increase in the brain soon after. They concluded that the movement of blood vessels might be enough to move CSF, and possibly the brain’s waste, over long distances. The team took a further step in their interpretation. Because this kind of pumping — distinct from the familiar pulse from the heart — is regularly observed during sleep, they suggest that perhaps their observations can help explain why sleep feels refreshing. But it’s a hypothesis that not everyone agrees is well founded. When it comes to ascribing purpose to the fluid moving through the brain, many researchers believe that the truth is still elusive. Brain Drain At the center of the brain are flooded caverns, like great cisterns shrouded in darkness, called ventricles. Cerebrospinal fluid seeps from the ventricle walls and then moves. Under pressure, it emerges elsewhere within the skull, flows down the neck and enters the spine. The neurologist Maiken Nedergaard’s “glymphatic hypothesis” proposes that cerebrospinal fluid helps drain waste from the brain during sleep. Her evidence is highly debated. Adam Fenster, University of Rochester Scientists have known for more than a century that, at the moment of death, CSF flows from the spine into the brain. This suggests that the living brain somehow keeps the stuff moving, but no one knows exactly how or where it flows. Any arrows drawn on diagrams of the brain and skull to show its movement should not be taken as the complete truth. “Everyone accepts that there must be some kind of flow here,” said Christer Betsholtz, a professor of vascular biology at the Karolinska Institute in Sweden. “About half a liter of CSF is produced in the ventricles every day, and it has to get out. People are still fighting about where the cerebrospinal fluid gets out.” Also under discussion is whether it picks up waste on the way out of the brain and, crucially, how. There is good evidence that small molecules, at least, can diffuse through the spaces between cells, make their way to the CSF, and ride it out of the brain. In fact, some researchers believe that the entire system works by way of passive diffusion. In 2012, results from Nedergaard’s lab suggested a more active process. Nedergaard, along with the neurologist Jeffrey Iliff, then a postdoc in her lab, and their colleagues, injected a tracer into cerebrospinal fluid and watched it quickly arrive elsewhere. How did it get from one place to another? They proposed that the spaces around blood vessels commune with even smaller spaces deep in the brain, between individual cells. They also suggested that CSF moves through brain cells called astrocytes into those spaces. There, the fluid might drop off some molecules and pick up others; it may then wend its way back out to the spaces around blood vessels, and thence move waste out of the brain. All of this would have to be driven by a flow of uncertain mechanism. It was a striking idea. Nedergaard, who is the senior author of the new paper, and colleagues soon made it more striking by linking it to another mystery: why sleep seems to be beneficial. In a 2013 paper, her team wrote that there was more movement of cerebrospinal fluid in sleeping and anesthetized mice than in waking ones — and that perhaps during sleep CSF sweeps waste out of the brain. Maybe this “brainwashing,” as headlines described it, could provide one reason why sleep is necessary, and explain how much better we feel after a good night of it. Mark Belan/Quanta Magazine “I’m of the strong belief that the restorative part of sleep is not memory consolidation,” Nedergaard said. “Maybe it is partly. But it is really the housekeeping function of sleep that is important.” In the years since those initial studies, a large number of papers referencing this brain-drainage theory, called the glymphatic hypothesis, have been published. It’s a catchy idea, but parts of the story raise red flags to some researchers who study the brain’s vasculature. Alan Verkman, a professor emeritus at the University of California, San Francisco who studies fluid flow in the body, has argued that some aspects of the theory are physically implausible — for instance, the channels said to let the fluid in cannot actually play the role demanded of them. According to Betsholtz, there is no evidence that fluid is moving into the spaces around blood vessels that leave the brain. But many other researchers appear to have accepted the glymphatic hypothesis. That’s because it fills a hole in our understanding of the brain, said Donald McDonald, who studies blood and lymph vessels at the UCSF School of Medicine. Personally, he doesn’t feel that the theory holds water, but he acknowledges its popularity. It fits comfortably in the space where there is a mystery. Ebb and Flow Imagine a sealed bottle of water. To study that fluid in its natural state, you have to cut a hole in the bottle. This is the difficulty that scientists studying CSF flow have to deal with. “If you are studying a fluid and you put a hole in the system, you really change it,” said Laura Lewis, a professor of neuroscience at the Massachusetts Institute of Technology. “Fluid dynamics are really easily disturbed by invasive procedures.” Further, so many behaviors that living animals perform, such as breathing and having a heartbeat, directly affect the fluid. Building a case for a new hypothesis in this area, then, is tricky. In the Nedergaard group’s recent Cell paper, the team wanted to explore an intriguing connection that would not only explain how CSF could be pumped between brain cells, but also link that process to sleep. For the study, mice underwent surgery to have sensors, wires and tubes implanted within the brain — one way to study the bottle of water. The researchers’ goal was to inject tracer dye into CSF at one point in the brain and then track its oscillations and dynamics while the mice slept. The data showed that, while mice were in their non–rapid eye movement (NREM) phase of sleep, the concentration of tracer moved rhythmically. From a sensor perched above the brain surface, the researchers saw a pattern of increases and decreases, according to first author Natalie Haugland. “It had this wave pattern.” What could be driving this rhythmic flow? The researchers thought of the neurotransmitter norepinephrine, which causes blood vessels to constrict. “Norepinephrine is very well known for controlling blood flow,” Nedergaard said. It’s possible, they thought, that vessels constricting and relaxing could put enough force on the surrounding cerebrospinal fluid to push it through the brain’s tissues. Research led by Natalie Haugland suggests that pulses of norepinephrine help pump cerebrospinal fluid through the brain during non-REM sleep. Björn Sigurdsson What’s more, during NREM sleep norepinephrine levels change rhythmically. This neurotransmitter could help tie together their hypotheses — the physical movement of CSF through brain tissues and the “brainwashing” occurring during sleep. The team engineered mice in which they could switch the production of the neurotransmitter on and off. When norepinephrine levels went up, the volume of CSF in the brain went up, they saw, suggesting that it was somehow altering the fluid’s flow. Then, to test whether the pumping of blood vessels could move CSF, the team engineered mice with blood vessel walls they could manipulate directly. Instead of pumping the vessels slowly, as happens naturally, they moved the walls quickly — once every 10 seconds rather than once every 50. “When we did this, we increased CSF flow on one side of the brain” in a very small area where they were pumping, Haugland said. “It was very local. … Everywhere else in the brain it was the same.” For Nedergaard, Haugland and their collaborators, the findings tie together norepinephrine, the physical movement of blood vessels, and the flow of CSF in the brain. Nedergaard also asserts that the results are consistent with her group’s earlier finding that there is more brain drainage during sleep than during wakefulness. “We have been searching for why the glymphatic [system] primarily works when we sleep for a long time,” Nedergaard said. “The paper is really about: Now we’ve found the motor or the driver of how we wash the brain when we sleep.” However, to critics of the theory, there are still too many open spaces. Under Pressure McDonald, of the UCSF School of Medicine, pointed out that the work is complex and requires many intricate methods. However, he’s concerned that Nedergaard is working backward: seeking an explanation for her hypothesis rather than trying to find out how the system actually works. “In this paper, it’s unclear what is interpretation and what is data,” he said. “Very early on, their interpretation gets substituted for what actually are the data.” He pointed to schematics showing flow dynamics that he doesn’t see supported, for instance. Proulx questioned whether the tracer dye moved via an active force at all. The molecule is so small that it could be traveling by diffusion, he said. He imagines an experiment, using techniques Nedergaard’s lab has used before, where a large molecule is infused into the CSF. If the rhythmic releases of norepinephrine correlate with the arrival of a larger tracer at a sensor on the brain’s surface, that would be a fascinating finding. “That’s what I would have liked to have seen,” he said. To his eye, it would make a clearer connection between fluid flow and norepinephrine than the lab’s work has shown thus far. The critiques of Nedergaard’s work come on strong in part because this idea is currently the most prominent hypothesis of CSF flow in the brain. That may change if other researchers can introduce other ideas that can be tested. Another wrinkle is that not everyone means the same thing when they talk about the glymphatic system. “Some people use ‘glymphatics’ to mean ‘waste transport system of the brain.’ Other people use it to mean a really specific mechanistic model,” Lewis said. “It’s clear that the brain has and needs a waste clearance system. … It’s really interesting to explore what that is and how that works.” Haugland, now a postdoc at the University of Oxford, is aware of the controversy about the glymphatic hypothesis. “There is critique of it. I’m also not sure that we understand it in the right way,” she said. “The more people who are actually working on finding out how it works, no matter what their hypothesis is — all that will help drive the field forward and give us more knowledge. “The results are what they are. They show something about the biology,” she continued. “We are trying to ask a lot of questions and we’re not, maybe, all the time very good at it because we don’t know how it works — the big picture.” “Nobody has the truth,” Proulx said, about what the brain is doing up there, in our skulls, to rid itself of its waste. “Some people think they know. But I think we don’t know.” Next article Three Hundred Years Later, a Tool from Isaac Newton Gets an Update",
  "image": "https://www.quantamagazine.org/wp-content/uploads/2025/03/Glymphatic-Theory-cr.ChanelleNibbelink-Social.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"postBody\"\u003e\n                \u003cdiv\u003e\n        \u003cp\u003e\n            A popular hypothesis for how the brain clears molecular waste, which may help explain why sleep feels refreshing, is a subject of debate.        \u003c/p\u003e\n        \n    \u003c/div\u003e\n    \u003cfigure\u003e\n        \u003cdiv\u003e\n                            \u003cp\u003e\u003cimg width=\"2560\" height=\"1440\" src=\"https://www.quantamagazine.org/wp-content/uploads/2025/03/Glymphatic-Theory-cr.ChanelleNibbelink-Lede.webp\" alt=\"An illustration shows a person’s head that looks like a drawn map. Rushing rivers, standing for cerebrospinal fluid, flow around small islands.\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.quantamagazine.org/wp-content/uploads/2025/03/Glymphatic-Theory-cr.ChanelleNibbelink-Lede.webp 2560w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Glymphatic-Theory-cr.ChanelleNibbelink-Lede-1720x968.webp 1720w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Glymphatic-Theory-cr.ChanelleNibbelink-Lede-520x293.webp 520w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Glymphatic-Theory-cr.ChanelleNibbelink-Lede-768x432.webp 768w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Glymphatic-Theory-cr.ChanelleNibbelink-Lede-1536x864.webp 1536w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Glymphatic-Theory-cr.ChanelleNibbelink-Lede-2048x1152.webp 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\"/\u003e                \u003c/p\u003e\n                        \u003c/div\u003e\n        \u003cfigcaption\u003e\n    \u003cdiv\u003e\n                            \u003cp\u003eNo one knows why cerebrospinal fluid circulates through and around our brains, or what directs its flow.\u003c/p\u003e\n            \u003cp\u003eChanelle Nibbelink for \u003cem\u003eQuanta Magazine\u003c/em\u003e\u003c/p\u003e\n        \u003c/div\u003e\n\u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003cdiv\u003e\n            \u003ch2\u003eIntroduction\u003c/h2\u003e\n            \u003cdiv data-role=\"selectable\"\u003e\n    \u003cp\u003eEncased in the skull, perched atop the spine, the brain has a carefully managed existence. It receives only certain nutrients, filtered through \u003ca href=\"https://www.quantamagazine.org/how-the-brain-protects-itself-from-blood-borne-threats-20230620/\"\u003ethe blood-brain barrier\u003c/a\u003e; an elaborate system of protective membranes surrounds it. That privileged space contains a mystery. For more than a century, scientists have wondered: If it’s so hard for anything to get into the brain, how does waste get out?\u003c/p\u003e\n\u003cp\u003eThe brain has one of the highest metabolisms of any organ in the body, and that process must yield by-products that need to be removed. In the rest of the body, blood vessels are shadowed by a system of lymphatic vessels. Molecules that have served their purpose in the blood move into these fluid-filled tubes and are swept away to the lymph nodes for processing. But blood vessels in the brain have no such outlet. Several hundred kilometers of them, all told, seem to thread their way through this dense, busily working tissue without a matching waste system.\u003c/p\u003e\n\u003cp\u003eHowever, the brain’s blood vessels are surrounded by open, fluid-filled spaces. In recent decades, the cerebrospinal fluid, or CSF, in those spaces has drawn a great deal of interest. “Maybe the CSF can be a highway, in a way, for the flow or exchange of different things within the brain,” said Steven Proulx, who studies the CSF system at the University of Bern.\u003c/p\u003e\n\u003cp\u003eA recent paper in \u003cem\u003eCell\u003c/em\u003e contains a new report about \u003ca href=\"https://doi.org/10.1016/j.cell.2024.11.027\"\u003ewhat is going on around the brain\u003c/a\u003e and in its hidden cavities. A team at the University of Rochester led by the neurologist \u003ca href=\"https://www.urmc.rochester.edu/labs/nedergaard\"\u003eMaiken Nedergaard\u003c/a\u003e asked whether the slow pumping of the brain’s blood vessels might be able to push the fluid around, among, and in some cases through cells, to potentially drive a system of drainage. In a mouse model, researchers injected a glowing dye into CSF, manipulated the blood vessel walls to trigger a pumping action, and saw the dye concentration increase in the brain soon after. They concluded that the movement of blood vessels might be enough to move CSF, and possibly the brain’s waste, over long distances.\u003c/p\u003e\n\u003cp\u003eThe team took a further step in their interpretation. Because this kind of pumping — distinct from the familiar pulse from the heart — is regularly observed during sleep, they suggest that perhaps their observations can help explain why sleep feels refreshing. But it’s a hypothesis that \u003ca href=\"https://www.thetransmitter.org/glymphatic-system/maiken-nedergaards-power-of-disruption/\"\u003enot everyone agrees is well founded\u003c/a\u003e. When it comes to ascribing purpose to the fluid moving through the brain, many researchers believe that the truth is still elusive.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eBrain Drain\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eAt the center of the brain are flooded caverns, like great cisterns shrouded in darkness, called ventricles. Cerebrospinal fluid seeps from the ventricle walls and then moves. Under pressure, it emerges elsewhere within the skull, flows down the neck and enters the spine.\u003c/p\u003e\n\u003c/div\u003e\n    \u003c/div\u003e\n    \u003cfigure\u003e\n        \u003cdiv\u003e\n                            \u003cp\u003e\u003cimg width=\"1580\" height=\"1064\" src=\"https://www.quantamagazine.org/wp-content/uploads/2025/03/Maiken-Nedergaard-cr._______.webp\" alt=\"A portrait of Maiken Nedergaard.\" decoding=\"async\" srcset=\"https://www.quantamagazine.org/wp-content/uploads/2025/03/Maiken-Nedergaard-cr._______.webp 1580w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Maiken-Nedergaard-cr._______-520x350.webp 520w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Maiken-Nedergaard-cr._______-768x517.webp 768w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Maiken-Nedergaard-cr._______-1536x1034.webp 1536w\" sizes=\"(max-width: 1580px) 100vw, 1580px\"/\u003e                \u003c/p\u003e\n                        \u003c/div\u003e\n        \u003cfigcaption\u003e\n    \u003cdiv\u003e\n                            \u003cp\u003eThe neurologist Maiken Nedergaard’s “glymphatic hypothesis” proposes that cerebrospinal fluid helps drain waste from the brain during sleep. Her evidence is highly debated.\u003c/p\u003e\n            \u003cdiv\u003e\n    \u003cp\u003eAdam Fenster, University of Rochester\u003c/p\u003e\n\u003c/div\u003e\n        \u003c/div\u003e\n\u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003cdiv data-role=\"selectable\"\u003e\n    \u003cp\u003eScientists have known for more than a century that, \u003ca href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC2094440/\"\u003eat the moment of death\u003c/a\u003e, CSF flows from the spine into the brain. This suggests that the living brain somehow keeps the stuff moving, but no one knows exactly how or where it flows. Any arrows drawn on diagrams of the brain and skull to show its movement should not be taken as the complete truth.\u003c/p\u003e\n\u003cp\u003e“Everyone accepts that there must be some kind of flow here,” said \u003ca href=\"https://ki.se/en/people/christer-betsholtz\"\u003eChrister Betsholtz\u003c/a\u003e, a professor of vascular biology at the Karolinska Institute in Sweden. “About half a liter of CSF is produced in the ventricles every day, and it has to get out. People are still fighting about where the cerebrospinal fluid gets out.”\u003c/p\u003e\n\n\u003cp\u003eAlso under discussion is whether it picks up waste on the way out of the brain and, crucially, how. There is good evidence that small molecules, at least, can diffuse through the spaces between cells, make their way to the CSF, and \u003ca href=\"https://doi.org/10.1016/b978-0-12-804279-3.00002-2\"\u003eride it out of the brain\u003c/a\u003e. In fact, some researchers believe that the entire system works by way of passive diffusion.\u003c/p\u003e\n\u003cp\u003eIn 2012, results from Nedergaard’s lab suggested a more active process. Nedergaard, along with the neurologist \u003ca href=\"https://psychiatry.uw.edu/profile/jeff-iliff/\"\u003eJeffrey Iliff\u003c/a\u003e, then a postdoc in her lab, and their colleagues, \u003ca href=\"https://doi.org/10.1126/scitranslmed.3003748\"\u003einjected a tracer into cerebrospinal fluid\u003c/a\u003e and watched it quickly arrive elsewhere. How did it get from one place to another? They proposed that the spaces around blood vessels commune with even smaller spaces deep in the brain, between individual cells. They also suggested that CSF moves through brain cells called astrocytes into those spaces. There, the fluid might drop off some molecules and pick up others; it may then wend its way back out to the spaces around blood vessels, and thence move waste out of the brain. All of this would have to be driven by a flow of uncertain mechanism.\u003c/p\u003e\n\u003cp\u003eIt was a striking idea. Nedergaard, who is the senior author of the new paper, and colleagues soon made it more striking by linking it to another mystery: why sleep seems to be beneficial. In a 2013 paper, her team wrote that there was \u003ca href=\"https://doi.org/10.1126/science.1241224\"\u003emore movement of cerebrospinal fluid\u003c/a\u003e in sleeping and anesthetized mice than in waking ones — and that perhaps during sleep CSF sweeps waste out of the brain. Maybe this “brainwashing,” as headlines described it, could provide one reason \u003ca href=\"https://www.linkedin.com/pulse/what-we-know-why-need-sleep-quanta-magazine-sojqe\"\u003ewhy sleep is necessary\u003c/a\u003e, and explain how much better we feel after a good night of it.\u003c/p\u003e\n\u003c/div\u003e\n    \u003cfigure\u003e\n        \u003cdiv\u003e\n                            \u003cp\u003e\u003cimg src=\"https://www.quantamagazine.org/wp-content/uploads/2025/03/Glymphatic_Theory-crMarkBelan-Mobilev3.svg\" alt=\"\" decoding=\"async\"/\u003e\u003cimg src=\"https://www.quantamagazine.org/wp-content/uploads/2025/03/Glymphatic_Theory-crMarkBelan-Desktopv3.svg\" alt=\"\" decoding=\"async\"/\u003e                \u003c/p\u003e\n                        \u003c/div\u003e\n        \u003cfigcaption\u003e\n    \u003cdiv\u003e\n            \u003cp\u003eMark Belan/\u003cem\u003eQuanta Magazine\u003c/em\u003e\u003c/p\u003e\n        \u003c/div\u003e\n\u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003cdiv data-role=\"selectable\"\u003e\n    \u003cp\u003e“I’m of the strong belief that the restorative part of sleep is not memory consolidation,” Nedergaard said. “Maybe it is partly. But it is really the housekeeping function of sleep that is important.”\u003c/p\u003e\n\u003cp\u003eIn the years since those initial studies, \u003ca href=\"https://pubmed.ncbi.nlm.nih.gov/?term=glymphatic\u0026amp;page=1\"\u003ea large number of papers\u003c/a\u003e referencing this brain-drainage theory, called the glymphatic hypothesis, have been published. It’s a catchy idea, but parts of the story \u003ca href=\"https://doi.org/10.7554/eLife.27679\"\u003eraise red flags\u003c/a\u003e to some researchers who study the brain’s vasculature.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://profiles.ucsf.edu/alan.verkman\"\u003eAlan Verkman\u003c/a\u003e, a professor emeritus at the University of California, San Francisco who studies fluid flow in the body, has argued that some aspects of the theory are physically implausible — for instance, the channels said to let the fluid in cannot actually play the role demanded of them. According to Betsholtz, there is no evidence that fluid is moving into the spaces around blood vessels that leave the brain.\u003c/p\u003e\n\u003cp\u003eBut many other researchers appear to have accepted the glymphatic hypothesis. That’s because it fills a hole in our understanding of the brain, said \u003ca href=\"https://mcdonald.ucsf.edu/our-research\"\u003eDonald McDonald\u003c/a\u003e, who studies blood and lymph vessels at the UCSF School of Medicine. Personally, he doesn’t feel that the theory holds water, but he acknowledges its popularity. It fits comfortably in the space where there is a mystery.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eEbb and Flow\u003c/strong\u003e\u003c/h2\u003e\n\n\u003cp\u003eImagine a sealed bottle of water. To study that fluid in its natural state, you have to cut a hole in the bottle. This is the difficulty that scientists studying CSF flow have to deal with. “If you are studying a fluid and you put a hole in the system, you really change it,” said \u003ca href=\"https://imes.mit.edu/people/lewis-laura\"\u003eLaura Lewis\u003c/a\u003e, a professor of neuroscience at the Massachusetts Institute of Technology. “Fluid dynamics are really easily disturbed by invasive procedures.” Further, so many behaviors that living animals perform, such as breathing and having a heartbeat, directly affect the fluid.\u003c/p\u003e\n\u003cp\u003eBuilding a case for a new hypothesis in this area, then, is tricky. In the Nedergaard group’s recent \u003cem\u003eCell\u003c/em\u003e paper, the team wanted to explore \u003ca href=\"https://doi.org/10.1016/j.cell.2024.11.027\"\u003ean intriguing connection\u003c/a\u003e that would not only explain how CSF could be pumped between brain cells, but also link that process to sleep.\u003c/p\u003e\n\u003cp\u003eFor the study, mice underwent surgery to have sensors, wires and tubes implanted within the brain — one way to study the bottle of water. The researchers’ goal was to inject tracer dye into CSF at one point in the brain and then track its oscillations and dynamics while the mice slept.\u003c/p\u003e\n\u003cp\u003eThe data showed that, while mice were in their non–rapid eye movement (NREM) phase of sleep, the concentration of tracer moved rhythmically. From a sensor perched above the brain surface, the researchers saw a pattern of increases and decreases, according to first author Natalie Haugland. “It had this wave pattern.”\u003c/p\u003e\n\u003cp\u003eWhat could be driving this rhythmic flow? The researchers thought of the neurotransmitter norepinephrine, which causes blood vessels to constrict. “Norepinephrine is very well known for controlling blood flow,” Nedergaard said. It’s possible, they thought, that vessels constricting and relaxing could put enough force on the surrounding cerebrospinal fluid to push it through the brain’s tissues.\u003c/p\u003e\n\u003c/div\u003e\n    \u003cfigure\u003e\n        \u003cdiv\u003e\n                            \u003cp\u003e\u003cimg width=\"1496\" height=\"893\" src=\"https://www.quantamagazine.org/wp-content/uploads/2025/03/Natalie-Hauglund-cr._______.webp\" alt=\"A portrait of Natalie Haugland.\" decoding=\"async\" srcset=\"https://www.quantamagazine.org/wp-content/uploads/2025/03/Natalie-Hauglund-cr._______.webp 1496w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Natalie-Hauglund-cr._______-520x310.webp 520w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Natalie-Hauglund-cr._______-768x458.webp 768w\" sizes=\"(max-width: 1496px) 100vw, 1496px\"/\u003e                \u003c/p\u003e\n                        \u003c/div\u003e\n        \u003cfigcaption\u003e\n    \u003cdiv\u003e\n                            \u003cp\u003eResearch led by Natalie Haugland suggests that pulses of norepinephrine help pump cerebrospinal fluid through the brain during non-REM sleep.\u003c/p\u003e\n            \u003cp\u003eBjörn Sigurdsson\u003c/p\u003e\n        \u003c/div\u003e\n\u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003cdiv data-role=\"selectable\"\u003e\n    \u003cp\u003eWhat’s more, during NREM sleep norepinephrine levels change rhythmically. This neurotransmitter could help tie together their hypotheses — the physical movement of CSF through brain tissues and the “brainwashing” occurring during sleep.\u003c/p\u003e\n\u003cp\u003eThe team engineered mice in which they could switch the production of the neurotransmitter on and off. When norepinephrine levels went up, the volume of CSF in the brain went up, they saw, suggesting that it was somehow altering the fluid’s flow.\u003c/p\u003e\n\n\u003cp\u003eThen, to test whether the pumping of blood vessels could move CSF, the team engineered mice with blood vessel walls they could manipulate directly. Instead of pumping the vessels slowly, as happens naturally, they moved the walls quickly — once every 10 seconds rather than once every 50. “When we did this, we increased CSF flow on one side of the brain” in a very small area where they were pumping, Haugland said. “It was very local. … Everywhere else in the brain it was the same.”\u003c/p\u003e\n\u003cp\u003eFor Nedergaard, Haugland and their collaborators, the findings tie together norepinephrine, the physical movement of blood vessels, and the flow of CSF in the brain. Nedergaard also asserts that the results are consistent with her group’s earlier finding that there is more brain drainage during sleep than during wakefulness.\u003c/p\u003e\n\u003cp\u003e“We have been searching for why the glymphatic [system] primarily works when we sleep for a long time,” Nedergaard said. “The paper is really about: Now we’ve found the motor or the driver of how we wash the brain when we sleep.”\u003c/p\u003e\n\u003cp\u003eHowever, to critics of the theory, there are still too many open spaces.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eUnder Pressure\u003c/strong\u003e\u003c/h2\u003e\n\n\u003cp\u003eMcDonald, of the UCSF School of Medicine, pointed out that the work is complex and requires many intricate methods. However, he’s concerned that Nedergaard is working backward: seeking an explanation for her hypothesis rather than trying to find out how the system actually works. “In this paper, it’s unclear what is interpretation and what is data,” he said. “Very early on, their interpretation gets substituted for what actually are the data.” He pointed to schematics showing flow dynamics that he doesn’t see supported, for instance.\u003c/p\u003e\n\u003cp\u003eProulx questioned whether the tracer dye moved via an active force at all. The molecule is so small that it could be traveling by diffusion, he said. He imagines an experiment, using techniques Nedergaard’s lab has used before, where a large molecule is infused into the CSF. If the rhythmic releases of norepinephrine correlate with the arrival of a larger tracer at a sensor on the brain’s surface, that would be a fascinating finding. “That’s what I would have liked to have seen,” he said. To his eye, it would make a clearer connection between fluid flow and norepinephrine than the lab’s work has shown thus far.\u003c/p\u003e\n\u003cp\u003eThe critiques of Nedergaard’s work come on strong in part because this idea is currently the most prominent hypothesis of CSF flow in the brain. That may change if other researchers can introduce other ideas that can be tested. Another wrinkle is that not everyone means the same thing when they talk about the glymphatic system. “Some people use ‘glymphatics’ to mean ‘waste transport system of the brain.’ Other people use it to mean a really specific mechanistic model,” Lewis said. “It’s clear that the brain has and needs a waste clearance system. … It’s really interesting to explore what that is and how that works.”\u003c/p\u003e\n        \n        \n\u003cp\u003eHaugland, now a postdoc at the University of Oxford, is aware of the controversy about the glymphatic hypothesis. “There is critique of it. I’m also not sure that we understand it in the right way,” she said. “The more people who are actually working on finding out how it works, no matter what their hypothesis is — all that will help drive the field forward and give us more knowledge.\u003c/p\u003e\n\u003cp\u003e“The results are what they are. They show something about the biology,” she continued. “We are trying to ask a lot of questions and we’re not, maybe, all the time very good at it because we don’t know how it works — the big picture.”\u003c/p\u003e\n\u003cp\u003e“Nobody has the truth,” Proulx said, about what the brain is doing up there, in our skulls, to rid itself of its waste. “Some people think they know. But I think we don’t know.”\u003c/p\u003e\n\u003c/div\u003e\n                \n                \n            \u003c/div\u003e\u003cdiv\u003e\n        \u003cdiv data-name=\"next-post__image-wrapper\"\u003e\n    \u003cp\u003e\u003cimg width=\"1720\" height=\"728\" src=\"https://www.quantamagazine.org/wp-content/uploads/2025/03/Newtons-Method-cr.MicheleSclafani-HP-1720x728.webp\" alt=\"\" decoding=\"async\" srcset=\"https://www.quantamagazine.org/wp-content/uploads/2025/03/Newtons-Method-cr.MicheleSclafani-HP-1720x728.webp 1720w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Newtons-Method-cr.MicheleSclafani-HP-520x220.webp 520w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Newtons-Method-cr.MicheleSclafani-HP-768x325.webp 768w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Newtons-Method-cr.MicheleSclafani-HP-1536x650.webp 1536w, https://www.quantamagazine.org/wp-content/uploads/2025/03/Newtons-Method-cr.MicheleSclafani-HP-2048x867.webp 2048w\" sizes=\"(max-width: 1720px) 100vw, 1720px\"/\u003e    \u003c/p\u003e\n\u003c/div\u003e\n        \n        \u003cdiv\u003e\n                \u003ch2\u003eNext article\u003c/h2\u003e\n                \u003cp\u003eThree Hundred Years Later, a Tool from Isaac Newton Gets an Update\u003c/p\u003e\n            \u003c/div\u003e\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-03-26T14:22:06Z",
  "modifiedTime": "2025-03-26T14:23:12Z"
}
