{
  "id": "b8aa5efe-b070-4683-9575-527e86941f32",
  "title": "The Springwise Top 5: City Innovations",
  "link": "https://springwise.com/the-springwise-top-5-city-innovations/",
  "description": "Today’s cities face a range of challenges. How are innovators helping to solve them?",
  "author": "Matthew Hempstead",
  "published": "Wed, 30 Oct 2024 13:35:09 +0000",
  "source": "https://www.springwise.com/feed",
  "categories": null,
  "byline": "",
  "length": 7345,
  "excerpt": "Today’s cities face a range of challenges. How are innovators helping to solve them?",
  "siteName": "Springwise",
  "favicon": "",
  "text": "The year 2007 was an important crossover point in world history. Not only did it see the beginning of the largest global financial crisis since the Great Depression, but in the slower and quieter world of demography, the global urban population overtook the rural population for the first time in history. As the world faces the challenges of climate change and biodiversity loss, what goes on in cities will have profound consequences for the whole world. What challenges do cities face? Several of the issues that are defining the 21st century are particularly acute in urban environments. For example, cities are a driver of climate change, contributing around three-quarters of CO2-equivalent emissions, but they are also exposed to global warming’s impacts. According to C40 Cities, the number of cities exposed to extreme temperatures will nearly triple by 2050. Air pollution is another key issue for cities, with almost nine out of ten urban dwellers exposed to unhealthy particulate matter levels, resulting in 1.8 million excess deaths. One of the contributing factors to urban air pollution is traffic congestion, which itself is a major challenge for urban areas. According to the INRIX 2023 Global Traffic Scorecard, $70 billion was lost to traffic congestion in the US in 2023, while the UK and Germany lost £7.5 billion, and €3.3 billion respectively. What is World Cities Day? The 31st October may be Halloween, but it is also World Cities Day as designated by the UN General Assembly. The designation is intended to promote the international community’s interest in urbanisation and foster co-operation on the shared challenges cities face. This year’s theme is ‘Youth Leading Climate and Local Action for Cities,’ which highlights the fact that by 2030 up to 60 per cent of urban dwellers will be under the age of 18. While the challenges cities face are difficult to solve, innovators around the world are paying particular attention to urban environments, and to mark the occasion, we are delving into our library to showcase five of the most exciting recent examples. How are innovators creating smart and sustainable cities? Photo source © Jacob Wackerhausen from Getty Images via Canva.com Could art redefine our relationship with nature? A landscape art project called Circle4Change is hoping to pave the path to a more sustainable future by using “radical imagination” to create a platform for innovation. The project will create a walking and cycling route in the form of a circle that stretches for 3,000 kilometres through nine European countries. The creators will talk to residents and collect stories along the circle route, as well as initiate art and cultural projects that will demonstrate how to embrace a sustainable future where humans, nature, and technology live together in balance. The project will be inaugurated in 2025, when project initiator and land artist Bruno Doedens and others will cycle the entire circumference of the circle over a six-month period. Along the way, they will engage with resident groups, young people, and local authorities to encourage them to participate through actions such as planting a tree to commemorate their birthday. By 2028, Circle4Change hopes to expand and connect villages and cities from all over Europe. Read more Photo source Urban Reef 3D printing biodiversity back into cities Urban Reef uses 3D printing technology to create open-ended habitats that encourage the growth and diversity of life in urban settings. ‘Reefs’ are created using bio-based algorithms and are 3D printed using printers designed to work with fluid-dense materials like ceramics and clay. Because they are porous, the printed ‘reefs’ retain water and provide refuge for many urban species, increasing biodiversity. Unlike conventional green spaces, such as parks, Urban Reef’s designs form dynamic, living ecosystems that actively contribute to urban sustainability. The living structures filter air, support biodiversity, absorb rainwater, regulate humidity, and cool local microclimates, all of which improves the urban environment. Read more Photo source Infrared.City AI-powered urban simulations for green cities Startup Infrared.City has developed state-of-the-art machine learning models that provide real-time feedback on design proposals, helping to guide climate-informed decisions at the planning stages. At present, the software provides feedback on wind speed and comfort, sunlight availability, and solar radiation. The model uses an open integration approach, which allows users to access and build on their environmental impact predictions through a cloud app using common design software, and through Infrared.City’s API. Through the software, the effect of design decisions can be instantly and continuously calculated at every step of the process. These decisions make the difference between urban environments that are well-adapted for climate resilience and those that will struggle to cope. This is why the company is focused on providing simulations that can achieve scalable results at a fraction of the computational and financial cost of other products. This will help Infrared.City bring more resilient design simulations to market segments previously unable to afford them. Read more Photo source Vianova Crunching mobility data with AI for smarter cities French startup Vianova is harnessing data from approximately 70 million vehicles worldwide for its data platform, which collates critical information about urban transportation, such as traffic flows from e-scooters, e-bikes, delivery vans, and mopeds. The company then transforms this complex information into actionable insights using its powerful GeoAI platform, enabling local governments to understand mobility patterns and interactions, while identifying traffic jams or potential conflicts. The startup equips decision-makers with tools to enhance road safety, manage shared mobility, improve logistics, and optimise curbside management. In turn, this helps promote greener, safer, and faster transportation. Read more Photo source Denys Nevozhai on Unsplash AI and satellite data improves the resilience of cities Dutch startup WEO leverages AI analysis of publicly available satellite imagery to provide low-cost, highly detailed analysis of the urban built environment. The company’s platform provides city planners and utility companies with insight into where heat islands occur, where so much soil is covered that runoff is at dangerous levels, and where trees pose a risk to power lines. WEO’s analytics improve the quality of lower-resolution data from satellite imagery and the startup then uses machine learning to extract advanced insights for risk assessment and monitoring. The platform is available in two formats. ‘Resilient Cities’ provides detailed data up to one metre in resolution that helps urban planners and local governments measure the growth and health of trees, track canopy cover, and reduce rainfall runoff. ‘Risk Management’, meanwhile, reviews the proximity of trees to utility infrastructure, maps areas of potential flooding, and highlights areas of especially flammable vegetation that should be cleared to prevent wildfires. Read more Compiled by: Matthew Hempstead",
  "image": "https://springwise.com/wp-content/uploads/2024/10/Top-5-City-innovations.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eThe year 2007 was an important crossover point in world history. Not only did it see the beginning of the largest global financial crisis since the Great Depression, but in the slower and quieter world of demography, the global urban population overtook the rural population for the first time in history. As the world faces the challenges of climate change and biodiversity loss, what goes on in cities will have profound consequences for the whole world.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eWhat challenges do cities face?\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eSeveral of the issues that are defining the 21\u003csup\u003est\u003c/sup\u003e century are particularly acute in urban environments. For example, cities are a driver of climate change, contributing around \u003ca href=\"https://www.ox.ac.uk/news/2024-01-29-expert-comment-urbanisation-s-role-climate-crisis-being-overlooked\"\u003ethree-quarters\u003c/a\u003e of CO2-equivalent emissions, but they are also exposed to global warming’s impacts. According to C40 Cities, the number of cities exposed to extreme temperatures will \u003ca href=\"https://www.c40.org/what-we-do/scaling-up-climate-action/adaptation-water/the-future-we-dont-want/heat-extremes/\"\u003enearly triple\u003c/a\u003e by 2050.\u003c/p\u003e\n\n\n\n\u003cp\u003eAir pollution is another key issue for cities, with almost \u003ca href=\"https://www.thelancet.com/journals/lanplh/article/PIIS2542-5196(21)00350-8/fulltext\"\u003enine out of ten\u003c/a\u003e urban dwellers exposed to unhealthy particulate matter levels, resulting in 1.8 million excess deaths. One of the contributing factors to urban air pollution is traffic congestion, which itself is a major challenge for urban areas. According to the \u003ca href=\"https://www2.inrix.com/l/171932/2024-06-18/6zxt1z/171932/1718740732w9bsy0Ze/INRIX_2023_Global_Traffic_Scorecard.pdf\"\u003eINRIX 2023 Global Traffic Scorecard\u003c/a\u003e, $70 billion was lost to traffic congestion in the US in 2023, while the UK and Germany lost £7.5 billion, and €3.3 billion respectively.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eWhat is World Cities Day?\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe 31\u003csup\u003est\u003c/sup\u003e October may be Halloween, but it is also World Cities Day as designated by the UN General Assembly. The designation is intended to promote the international community’s interest in urbanisation and foster co-operation on the shared challenges cities face. This year’s theme is ‘Youth Leading Climate and Local Action for Cities,’ which highlights the fact that by 2030 up to \u003ca href=\"https://www.un.org/en/observances/cities-day\"\u003e60 per cent\u003c/a\u003e of urban dwellers will be under the age of 18.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile the challenges cities face are difficult to solve, innovators around the world are paying particular attention to urban environments, and to mark the occasion, we are delving into our library to showcase five of the most exciting recent examples.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eHow are innovators creating smart and sustainable cities?\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/10/innovationarts-entertainmenta-landscape-art-project-for-the-planet.jpg\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/10/innovationarts-entertainmenta-landscape-art-project-for-the-planet.jpg 1500w, https://springwise.com/wp-content/uploads/2024/10/innovationarts-entertainmenta-landscape-art-project-for-the-planet-300x140.jpg 300w, https://springwise.com/wp-content/uploads/2024/10/innovationarts-entertainmenta-landscape-art-project-for-the-planet-768x357.jpg 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePhoto source © Jacob Wackerhausen from Getty Images via Canva.com\u003c/p\u003e\n\n\n\n\u003ch4\u003e\u003cstrong\u003eCould art redefine our relationship with nature?\u003c/strong\u003e\u003c/h4\u003e\n\n\n\n\u003cp\u003eA landscape art project called Circle4Change is hoping to pave the path to a more sustainable future by using “radical imagination” to create a platform for innovation.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe project will create a walking and cycling route in the form of a circle that stretches for 3,000 kilometres through nine European countries. The creators will talk to residents and collect stories along the circle route, as well as initiate art and cultural projects that will demonstrate how to embrace a sustainable future where humans, nature, and technology live together in balance. The project will be inaugurated in 2025, when project initiator and land artist Bruno Doedens and others will cycle the entire circumference of the circle over a six-month period. Along the way, they will engage with resident groups, young people, and local authorities to encourage them to participate through actions such as planting a tree to commemorate their birthday. By 2028, Circle4Change hopes to expand and connect villages and cities from all over Europe. \u003cstrong\u003e\u003ca href=\"https://springwise.com/innovation/arts-entertainment/a-landscape-art-project-for-the-planet/\"\u003eRead more\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/10/innovationarchitecture-design3D-printed-reefs-improve-air-quality.jpg\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/10/innovationarchitecture-design3D-printed-reefs-improve-air-quality.jpg 1500w, https://springwise.com/wp-content/uploads/2024/10/innovationarchitecture-design3D-printed-reefs-improve-air-quality-300x140.jpg 300w, https://springwise.com/wp-content/uploads/2024/10/innovationarchitecture-design3D-printed-reefs-improve-air-quality-768x357.jpg 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePhoto source Urban Reef\u003c/p\u003e\n\n\n\n\u003ch4\u003e\u003cstrong\u003e3D printing biodiversity back into cities\u003c/strong\u003e\u003c/h4\u003e\n\n\n\n\u003cp\u003eUrban Reef uses 3D printing technology to create open-ended habitats that encourage the growth and diversity of life in urban settings. ‘Reefs’ are created using bio-based algorithms and are 3D printed using printers designed to work with fluid-dense materials like ceramics and clay. Because they are porous, the printed ‘reefs’ retain water and provide refuge for many urban species, increasing biodiversity. Unlike conventional green spaces, such as parks, Urban Reef’s designs form dynamic, living ecosystems that actively contribute to urban sustainability. The living structures filter air, support biodiversity, absorb rainwater, regulate humidity, and cool local microclimates, all of which improves the urban environment. \u003cstrong\u003e\u003ca href=\"https://springwise.com/innovation/architecture-design/3d-printed-reefs-improve-air-quality/\"\u003eRead more\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/10/innovationarchitecture-designAI-for-urban-environment-simulation.jpg\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/10/innovationarchitecture-designAI-for-urban-environment-simulation.jpg 1500w, https://springwise.com/wp-content/uploads/2024/10/innovationarchitecture-designAI-for-urban-environment-simulation-300x140.jpg 300w, https://springwise.com/wp-content/uploads/2024/10/innovationarchitecture-designAI-for-urban-environment-simulation-768x357.jpg 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePhoto source Infrared.City\u003c/p\u003e\n\n\n\n\u003ch4\u003e\u003cstrong\u003eAI-powered urban simulations for green cities\u003c/strong\u003e\u003c/h4\u003e\n\n\n\n\u003cp\u003eStartup Infrared.City has developed state-of-the-art machine learning models that provide real-time feedback on design proposals, helping to guide climate-informed decisions at the planning stages. At present, the software provides feedback on wind speed and comfort, sunlight availability, and solar radiation. The model uses an open integration approach, which allows users to access and build on their environmental impact predictions through a cloud app using common design software, and through Infrared.City’s API. Through the software, the effect of design decisions can be instantly and continuously calculated at every step of the process. These decisions make the difference between urban environments that are well-adapted for climate resilience and those that will struggle to cope. This is why the company is focused on providing simulations that can achieve scalable results at a fraction of the computational and financial cost of other products. This will help Infrared.City bring more resilient design simulations to market segments previously unable to afford them. \u003cstrong\u003e\u003ca href=\"https://springwise.com/innovation/architecture-design/ai-for-urban-environment-simulation/\"\u003eRead more\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/10/innovationmobility-transportAI-crunches-mobility-data-for-smarter-cities.jpg\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/10/innovationmobility-transportAI-crunches-mobility-data-for-smarter-cities.jpg 1500w, https://springwise.com/wp-content/uploads/2024/10/innovationmobility-transportAI-crunches-mobility-data-for-smarter-cities-300x140.jpg 300w, https://springwise.com/wp-content/uploads/2024/10/innovationmobility-transportAI-crunches-mobility-data-for-smarter-cities-768x357.jpg 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePhoto source Vianova\u003c/p\u003e\n\n\n\n\u003ch4\u003e\u003cstrong\u003eCrunching mobility data with AI for smarter cities\u003c/strong\u003e\u003c/h4\u003e\n\n\n\n\u003cp\u003eFrench startup Vianova is harnessing data from approximately 70 million vehicles worldwide for its data platform, which collates critical information about urban transportation, such as traffic flows from e-scooters, e-bikes, delivery vans, and mopeds. The company then transforms this complex information into actionable insights using its powerful GeoAI platform, enabling local governments to understand mobility patterns and interactions, while identifying traffic jams or potential conflicts. The startup equips decision-makers with tools to enhance road safety, manage shared mobility, improve logistics, and optimise curbside management. In turn, this helps promote greener, safer, and faster transportation. \u003cstrong\u003e\u003ca href=\"https://springwise.com/innovation/mobility-transport/ai-crunches-mobility-data-for-smarter-cities/\"\u003eRead more\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/10/innovationsustainabilityspace-data-and-AI-builds-city-resilience.png\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/10/innovationsustainabilityspace-data-and-AI-builds-city-resilience.png 1500w, https://springwise.com/wp-content/uploads/2024/10/innovationsustainabilityspace-data-and-AI-builds-city-resilience-300x140.png 300w, https://springwise.com/wp-content/uploads/2024/10/innovationsustainabilityspace-data-and-AI-builds-city-resilience-768x357.png 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePhoto source Denys Nevozhai on Unsplash\u003c/p\u003e\n\n\n\n\u003ch4\u003eAI and satellite data improves the resilience of cities\u003c/h4\u003e\n\n\n\n\u003cp\u003eDutch startup WEO leverages AI analysis of publicly available satellite imagery to provide low-cost, highly detailed analysis of the urban built environment. The company’s platform provides city planners and utility companies with insight into where heat islands occur, where so much soil is covered that runoff is at dangerous levels, and where trees pose a risk to power lines. WEO’s analytics improve the quality of lower-resolution data from satellite imagery and the startup then uses machine learning to extract advanced insights for risk assessment and monitoring. The platform is available in two formats. ‘Resilient Cities’ provides detailed data up to one metre in resolution that helps urban planners and local governments measure the growth and health of trees, track canopy cover, and reduce rainfall runoff. ‘Risk Management’, meanwhile, reviews the proximity of trees to utility infrastructure, maps areas of potential flooding, and highlights areas of especially flammable vegetation that should be cleared to prevent wildfires. \u003cstrong\u003e\u003ca href=\"https://springwise.com/innovation/sustainability/space-data-and-ai-builds-city-resilience/\"\u003eRead more\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eCompiled by: Matthew Hempstead\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-10-30T13:35:09Z",
  "modifiedTime": "2024-10-30T13:35:11Z"
}
