{
  "id": "c3334a73-beb1-4f37-949d-0ef31fb42615",
  "title": "When was the famous \"sudo warning\" introduced? Under what background? By whom?",
  "link": "https://retrocomputing.stackexchange.com/questions/12521/when-was-the-famous-sudo-warning-introduced-under-what-background-by-whom",
  "description": "Article URL: https://retrocomputing.stackexchange.com/questions/12521/when-was-the-famous-sudo-warning-introduced-under-what-background-by-whom Comments URL: https://news.ycombinator.com/item?id=42291781 Points: 5 # Comments: 1",
  "author": "Boogie_Man",
  "published": "Mon, 02 Dec 2024 00:08:38 +0000",
  "source": "https://hnrss.org/frontpage",
  "categories": null,
  "byline": "比尔盖子",
  "length": 1935,
  "excerpt": "On all Unix-like operating systems, sudo is often provided as the standard package for executing commands as superuser (or an alternative user). When sudo is invoked by the user for the first time,...",
  "siteName": "Retrocomputing Stack Exchange",
  "favicon": "https://cdn.sstatic.net/Sites/retrocomputing/Img/apple-touch-icon.png?v=d17692917909",
  "text": "The message appears in sudo’s revision control (in its current guise) in June 1993, in the University of Colorado version of sudo, in a slightly shorter form: We trust you have received the usual lecture from the local Systems Administrator. It usually boils down to these two things: #1) Respect the privacy of others. #2) Think before you type. This initial commit also introduced sudo’s other famous message, “This incident will be reported.” The author of the commit is Todd C. Miller, the maintainer of CU sudo (now plain sudo, still maintained by Todd), but the source code predates the commit; and while the source mentions Jeff Nieusma, the messages predate his involvement too and their author is presumably either Bob Coggeshall or Evi Nemeth (see also “A Brief History of Sudo”). The source history doesn’t suggest any particular background to the change. The message is typical of warning messages which were displayed when logging in to academic systems at the time. sudo was published in the UNIX System Administration Handbook, written by Evi Nemeth, Garth Snyder, and Scott Seebass; the version published in the first edition doesn’t include a warning in the program itself, but the authors mention that users who were granted sudo access were sent a (lengthy) email reminding them of the responsibilities associated with that privilege. The third item was added in January 2004, with a more interesting commit message: Add Stan Lee / Uncle Ben quote to the lecture from RedHat Said quote (which, as Tommy points out, wasn’t coined by Stan Lee) was added to Red Hat’s sudo package as a patch on top of version 1.6.6, in June 2002. Historical artifacts: these net.sources archives contain two versions of sudo, posted by Cliff Spencer and Don Gworek in December 1985 (also available in the UTZOO tapes); this unix-pc.sources archive contains a different implementation by Lenny Tropiano.",
  "image": "https://cdn.sstatic.net/Sites/retrocomputing/Img/apple-touch-icon@2.png?v=6b27f39a6023",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv itemprop=\"text\"\u003e\n\u003cp\u003eThe message appears in \u003ccode\u003esudo\u003c/code\u003e’s revision control (in its current guise) \u003ca href=\"https://www.sudo.ws/repos/sudo/rev/c101e9572d7f\" rel=\"noreferrer\"\u003ein June 1993\u003c/a\u003e, in the University of Colorado version of \u003ccode\u003esudo\u003c/code\u003e, in a slightly shorter form:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003eWe trust you have received the usual lecture from the local Systems\nAdministrator. It usually boils down to these two things:\n\n        #1) Respect the privacy of others.\n        #2) Think before you type.\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eThis initial commit also introduced \u003ccode\u003esudo\u003c/code\u003e’s \u003ca href=\"https://xkcd.com/838/\" rel=\"noreferrer\"\u003eother famous message\u003c/a\u003e, “This incident will be reported.”\u003c/p\u003e\n\n\u003cp\u003eThe author of the commit is Todd C. Miller, the maintainer of CU \u003ccode\u003esudo\u003c/code\u003e (now plain \u003ccode\u003esudo\u003c/code\u003e, still maintained by Todd), but the source code predates the commit; and while the source mentions Jeff Nieusma, the messages \u003ca href=\"https://www.quora.com/Who-wrote-the-message-that-comes-up-when-you-use-sudo-for-the-first-time/answer/Brian-Bi\" rel=\"noreferrer\"\u003epredate his involvement too\u003c/a\u003e and their author is presumably either Bob Coggeshall or Evi Nemeth (see also “\u003ca href=\"https://www.sudo.ws/history.html\" rel=\"noreferrer\"\u003eA Brief History of Sudo\u003c/a\u003e”). The source history doesn’t suggest any particular background to the change. The message is typical of warning messages which were displayed when logging in to academic systems at the time.\u003c/p\u003e\n\n\u003cp\u003e\u003ccode\u003esudo\u003c/code\u003e was published in the \u003cem\u003eUNIX System Administration Handbook\u003c/em\u003e, written by  Evi Nemeth, Garth Snyder, and Scott Seebass; \u003ca href=\"https://archive.org/details/isbn_0139334416/page/468\" rel=\"noreferrer\"\u003ethe version published in the first edition\u003c/a\u003e doesn’t include a warning in the program itself, but the authors mention that users who were granted \u003ccode\u003esudo\u003c/code\u003e access were sent a (lengthy) email reminding them of the responsibilities associated with that privilege.\u003c/p\u003e\n\n\u003cp\u003eThe third item was \u003ca href=\"https://www.sudo.ws/repos/sudo/rev/ebd5a76ccd7e\" rel=\"noreferrer\"\u003eadded in January 2004\u003c/a\u003e, with a more interesting commit message:\u003c/p\u003e\n\n\u003cblockquote\u003e\n  \u003cp\u003eAdd Stan Lee / Uncle Ben quote to the lecture from RedHat\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eSaid quote (which, as \u003ca href=\"https://retrocomputing.stackexchange.com/users/4147/tommy\"\u003eTommy\u003c/a\u003e \u003ca href=\"https://retrocomputing.stackexchange.com/questions/12521/when-was-the-famous-sudo-warning-introduced-under-what-background-by-whom#comment39312_12522\"\u003epoints out\u003c/a\u003e, \u003ca href=\"https://en.wikipedia.org/wiki/With_great_power_comes_great_responsibility\" rel=\"noreferrer\"\u003ewasn’t coined by Stan Lee\u003c/a\u003e) was added to Red Hat’s \u003ccode\u003esudo\u003c/code\u003e package as a patch on top of version 1.6.6, in June 2002.\u003c/p\u003e\n\n\u003chr/\u003e\n\n\u003cp\u003eHistorical artifacts: \u003ca href=\"https://archive.org/download/usenet-net/net.sources.mbox.zip\" rel=\"noreferrer\"\u003ethese \u003ccode\u003enet.sources\u003c/code\u003e archives\u003c/a\u003e contain two versions of \u003ccode\u003esudo\u003c/code\u003e, posted by Cliff Spencer and Don Gworek in December 1985 (also available in the UTZOO tapes); \u003ca href=\"https://archive.org/download/utzoo-wiseman-usenet-archive/news061f1.tgz\" rel=\"noreferrer\"\u003ethis \u003ccode\u003eunix-pc.sources\u003c/code\u003e archive\u003c/a\u003e contains a different implementation by Lenny Tropiano.\u003c/p\u003e\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
