{
  "id": "c944ee35-2b5f-4898-a507-88a381378982",
  "title": "UAE’s Falcon 3 challenges open-source leaders amid surging demand for small AI models",
  "link": "https://venturebeat.com/ai/uaes-falcon-3-challenges-open-source-leaders-amid-surging-demand-for-small-ai-models/",
  "description": "The UAE-backed institute has released Falcon 3 in four different sizes with the goal of democratizing access to advanced AI capabilities.",
  "author": "Shubham Sharma",
  "published": "Tue, 17 Dec 2024 20:03:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "Business",
    "AI, ML and Deep Learning",
    "alibaba",
    "category-/Science/Computer Science",
    "Conversational AI",
    "Falcon",
    "Falcon 3",
    "Falcon 3-10B",
    "Falcon 3-7b",
    "Google",
    "LLaMA",
    "Llama-3.1-Nemotron-70B-Instruct",
    "Meta",
    "mistral",
    "NLP",
    "Qwen 2.5",
    "SLM",
    "SLMs",
    "small language models",
    "small language models (SLMs)",
    "Technology innovation institute",
    "UAE"
  ],
  "byline": "Shubham Sharma",
  "length": 4630,
  "excerpt": "The UAE-backed institute has released Falcon 3 in four different sizes with the goal of democratizing access to advanced AI capabilities.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "December 17, 2024 12:03 PM Credit: VentureBeat made with Midjourney Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More The UAE government-backed Technology Innovation Institute (TII) has announced the launch of Falcon 3, a family of open-source small language models (SLMs) designed to run efficiently on lightweight, single GPU-based infrastructures. Falcon 3 features four model sizes — 1B, 3B, 7B, and 10B — with base and instruct variants, promising to democratize access to advanced AI capabilities for developers, researchers, and businesses. According to the Hugging Face leaderboard, the models are already outperforming or closely matching popular open-source counterparts in their size class, including Meta’s Llama and category leader Qwen-2.5. The development comes at a time when the demand for SLMs, with fewer parameters and simpler designs than LLMs, is rapidly growing due to their efficiency, affordability, and ability to be deployed on devices with limited resources. They are suitable for a range of applications across industries, like customer service, healthcare, mobile apps and IoT, where typical LLMs might be too computationally expensive to run effectively. According to Valuates Reports, the market for these models is expected to grow, with a CAGR of nearly 18% over the next five years. What does Falcon 3 bring to the table? Trained on 14 trillion tokens — more than double its predecessor Falcon 2 — the Falcon 3 family employs a decoder-only architecture with grouped query attention to share parameters and minimize memory usage for key-value (KV) cache during inference. This enables faster and more efficient operations when handling diverse text-based tasks. At the core, the models support four primary languages — English, French, Spanish, and Portuguese—and come equipped with a 32K context window, allowing them to process long inputs, such as heavily worded documents. “Falcon 3 is versatile, designed for both general-purpose and specialized tasks, providing immense flexibility to users. Its base model is perfect for generative applications, while the instruct variant excels in conversational tasks like customer service or virtual assistants,” TII notes on its website. According to the leaderboard on Hugging Face, while all four Falcon 3 models perform fairly well, the 10B and 7B versions are the stars of the show, achieving state-of-the-art results on reasoning, language understanding, instruction following, code and mathematics tasks.  Among models under the 13B-parameter size class, Falcon 3’s 10B and 7B versions outperform competitors, including Google’s Gemma 2-9B, Meta’s Llama 3.1-8B, Mistral-7B, and Yi 1.5-9B. They even surpass Alibaba’s category leader Qwen 2.5-7B in most benchmarks — such as MUSR, MATH, GPQA, and IFEval — except for MMLU, which is the test for evaluating how well language models understand and process human language. Falcon 3 benchmarks Deployment across industries With the Falcon 3 models now available on Hugging Face, TII aims to serve a broad range of users, enabling cost-effective AI deployments without computational bottlenecks. With their ability to handle specific, domain-focused tasks with fast processing times, the models can power various applications at the edge and in privacy-sensitive environments, including customer service chatbots, personalized recommender systems, data analysis, fraud detection, healthcare diagnostics, supply chain optimization and education. The institute also plans to expand the Falcon family further by introducing models with multimodal capabilities. These models are expected to launch sometime in January 2025. Notably, all models have been released under the TII Falcon License 2.0, a permissive Apache 2.0-based license with an acceptable use policy that encourages responsible AI development and deployment. To help users get started, TII has also launched a Falcon Playground, a testing environment where researchers and developers can try out Falcon 3 models before integrating them into their applications. Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2023/12/cfr0z3n_photorealistic_35mm_a_tiny_intricate_clockwork_robot_ra_6c68cfa0-0d24-4ad5-8964-179622de805f.png?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2024-12-17T20:03:00+00:00\" datetime=\"2024-12-17T20:03:00+00:00\"\u003eDecember 17, 2024 12:03 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"420\" src=\"https://venturebeat.com/wp-content/uploads/2023/12/cfr0z3n_photorealistic_35mm_a_tiny_intricate_clockwork_robot_ra_6c68cfa0-0d24-4ad5-8964-179622de805f.png?w=750\" alt=\"A pale human hand holds up a tiny robot.\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCredit: VentureBeat made with Midjourney\u003c/span\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. \u003ca href=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\" data-type=\"link\" data-id=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\"\u003eLearn More\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003eThe UAE government-backed \u003ca href=\"https://falconllm.tii.ae/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eTechnology Innovation Institute\u003c/a\u003e (TII) has announced the launch of Falcon 3, a family of open-source small language models (SLMs) designed to run efficiently on lightweight, single GPU-based infrastructures.\u003c/p\u003e\n\n\n\n\u003cp\u003eFalcon 3 features four model sizes — 1B, 3B, 7B, and 10B — with base and instruct variants, promising to democratize access to advanced AI capabilities for developers, researchers, and businesses. According to the Hugging Face leaderboard, the models are already outperforming or closely matching popular open-source counterparts in their size class, including Meta’s Llama and category leader Qwen-2.5.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe development comes at a time when \u003ca href=\"https://venturebeat.com/ai/why-small-language-models-are-the-next-big-thing-in-ai/\"\u003ethe demand for SLMs\u003c/a\u003e, with fewer parameters and simpler designs than LLMs, is rapidly growing due to their efficiency, affordability, and ability to be deployed on devices with limited resources. They are suitable for a range of applications across industries, like customer service, healthcare, mobile apps and IoT, where typical LLMs might be too computationally expensive to run effectively. According to \u003ca href=\"https://reports.valuates.com/market-reports/QYRE-Auto-16C16291/global-small-language-model\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eValuates Reports\u003c/a\u003e, the market for these models is expected to grow, with a CAGR of nearly 18% over the next five years.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-what-does-falcon-3-bring-to-the-table\"\u003e\u003cstrong\u003eWhat does Falcon 3 bring to the table?\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eTrained on 14 trillion tokens — more than double its predecessor Falcon 2 — the Falcon 3 family employs a decoder-only architecture with grouped query attention to share parameters and minimize memory usage for key-value (KV) cache during inference. This enables faster and more efficient operations when handling diverse text-based tasks.\u003c/p\u003e\n\n\n\n\u003cp\u003eAt the core, the models support four primary languages — English, French, Spanish, and Portuguese—and come equipped with a 32K context window, allowing them to process long inputs, such as heavily worded documents.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Falcon 3 is versatile, designed for both general-purpose and specialized tasks, providing immense flexibility to users. Its base model is perfect for generative applications, while the instruct variant excels in conversational tasks like customer service or virtual assistants,” TII notes on its \u003ca href=\"https://falconllm.tii.ae/falcon3/index.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ewebsite\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to the \u003ca href=\"https://huggingface.co/spaces/open-llm-leaderboard/open_llm_leaderboard#/?types=pretrained%2Ccontinuously+pretrained%2Cmultimodal\u0026amp;params=-1%2C11\u0026amp;official=true\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eleaderboard\u003c/a\u003e on Hugging Face, while all four Falcon 3 models perform fairly well, the 10B and 7B versions are the stars of the show, achieving state-of-the-art results on reasoning, language understanding, instruction following, code and mathematics tasks. \u003c/p\u003e\n\n\n\n\u003cp\u003eAmong models under the 13B-parameter size class, Falcon 3’s 10B and 7B versions outperform competitors, including \u003ca href=\"https://venturebeat.com/ai/googles-gemma-2-series-launches-with-not-one-but-two-lightweight-model-options-a-9b-and-27b/\"\u003eGoogle’s Gemma 2-9B\u003c/a\u003e, Meta’s Llama 3.1-8B, \u003ca href=\"https://venturebeat.com/ai/mistral-ai-europe-startup-releases-mistral-7b-model/\"\u003eMistral-7B\u003c/a\u003e, and Yi 1.5-9B. They even surpass Alibaba’s category leader Qwen 2.5-7B in most benchmarks — such as MUSR, MATH, GPQA, and IFEval — except for MMLU, which is the test for evaluating how well language models understand and process human language.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1425\" height=\"567\" src=\"https://venturebeat.com/wp-content/uploads/2024/12/benchmark3-e1734456658797.webp?w=800\" alt=\"Falcon 3 benchmarks\" srcset=\"https://venturebeat.com/wp-content/uploads/2024/12/benchmark3-e1734456658797.webp 1425w, https://venturebeat.com/wp-content/uploads/2024/12/benchmark3-e1734456658797.webp?resize=300,119 300w, https://venturebeat.com/wp-content/uploads/2024/12/benchmark3-e1734456658797.webp?resize=768,306 768w, https://venturebeat.com/wp-content/uploads/2024/12/benchmark3-e1734456658797.webp?resize=800,318 800w, https://venturebeat.com/wp-content/uploads/2024/12/benchmark3-e1734456658797.webp?resize=400,159 400w, https://venturebeat.com/wp-content/uploads/2024/12/benchmark3-e1734456658797.webp?resize=750,298 750w, https://venturebeat.com/wp-content/uploads/2024/12/benchmark3-e1734456658797.webp?resize=578,230 578w, https://venturebeat.com/wp-content/uploads/2024/12/benchmark3-e1734456658797.webp?resize=930,370 930w\" sizes=\"(max-width: 1425px) 100vw, 1425px\"/\u003e\u003cfigcaption\u003eFalcon 3 benchmarks\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003ch3 id=\"h-deployment-across-industries\"\u003e\u003cstrong\u003eDeployment across industries\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eWith the Falcon 3 models now available on \u003ca href=\"https://huggingface.co/collections/tiiuae/falcon3-67605ae03578be86e4e87026\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHugging Face\u003c/a\u003e, TII aims to serve a broad range of users, enabling cost-effective AI deployments without computational bottlenecks. With their ability to handle specific, domain-focused tasks with fast processing times, the models can power various applications at the edge and in privacy-sensitive environments, including customer service chatbots, personalized recommender systems, data analysis, fraud detection, healthcare diagnostics, supply chain optimization and education.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe institute also plans to expand the Falcon family further by introducing models with multimodal capabilities. These models are expected to launch sometime in January 2025.\u003c/p\u003e\n\n\n\n\u003cp\u003eNotably, all models have been released under the TII Falcon License 2.0, a permissive Apache 2.0-based license with an acceptable use policy that encourages responsible AI development and deployment. To help users get started, TII has also launched a Falcon Playground, a testing environment where researchers and developers can try out Falcon 3 models before integrating them into their applications. \u003c/p\u003e\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://venturebeat.com/wp-content/themes/vb-news/brand/img/vb-daily-phone.png\" alt=\"\"/\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-17T20:03:00Z",
  "modifiedTime": "2024-12-17T20:01:16Z"
}
