{
  "id": "c98d3324-a3fe-45fd-9fac-aafaa3f9a072",
  "title": "An Investor Doubted Me and My Business Because I'm a Working Dad — Here's Why You Don't Have to Sacrifice Work or Your Family.",
  "link": "https://www.entrepreneur.com/growing-a-business/an-investor-doubted-me-and-my-business-because-im-a/485021",
  "description": "Prioritizing business should never mean ignoring family. Entrepreneurs who give themselves to both will quickly find that success in the one feeds success in the other.",
  "author": "Levi King",
  "published": "Fri, 07 Feb 2025 21:00:00 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Levi King",
  "length": 5805,
  "excerpt": "Prioritizing business should never mean ignoring family. Entrepreneurs who give themselves to both will quickly find that success in the one feeds success in the other.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "Opinions expressed by Entrepreneur contributors are their own. I've never believed in the Silicon Valley idea that you've got to work 24/7 and sacrifice everything to build a successful company. For me, building a business and raising a family go hand in hand. These contrasting views are perhaps best illustrated with a personal anecdote.Long ago, when a former business partner and I were raising our A round for a company we'd founded, I found myself sitting across some investors from Silicon Valley. I knew they wouldn't have flown out to meet us unless they were fairly serious about investing — they weren't the type of people to waste time and money on something they didn't believe in.My wife Rachel and I had recently learned that Rachel was pregnant with twins. The pregnancy wasn't planned, which meant that we'd gone from thinking we were going to have zero more kids to discover we were actually having two at once in the blink of an eye. I was about to become the proud father of not four but six highly energetic daughters. To break the ice, my co-founder shared the above with our would-be investors. In most cases, spicing up generic small talk with a story about unexpected twins is at least entertaining. But the investors weren't amused.The senior investor — I'll never forget his name, even though I won't mention it here — was as serious as a heart attack. He looked straight at me and said, \"You know, I have a hard time taking guys like you seriously. Why would you have a family when you should be dedicating your whole life to running your business?\" Without missing a beat, I responded, \"That's interesting — I've always struggled to understand guys like you. What's the point of making money if you don't have anybody to enjoy it with? Where's the satisfaction in being a single, 45-year-old guy living in a penthouse on University Avenue in Palo Alto? Wouldn't that feel empty and old after a while? For me, my work is filled with purpose; I get to go home and play with a bunch of adorable little kids who love me.\"I said this in a calm, philosophical way as if I were simply sharing an alternate point of view instead of countering an insult. My co-founder, meanwhile, appeared to be devastated that he'd brought the whole thing up — the meeting was as good as over now.But you know what? The second those words came out of the senior investor's mouth, I knew I didn't want his money. Family means too much to me to partner with someone who could dismiss it so cavalierly.Related: An Open Letter from an Entrepreneur Dad to His Kids on How to Find Success Family and business are not mutually exclusive, but let's be realistic. Running a business is highly difficult, stressful and unpredictable. There will definitely be times when you have to power through setbacks, seemingly at the cost of spending time with the ones you love most.The problem begins when obstacles and opportunities are treated as marathons rather than sprints. Every entrepreneur faces a sprint at one point or another — something goes off the rails, or there's an opportunity you want to capitalize on, so you spend more time at work than you normally want to.A marathon, on the other hand, is what occurs when you're working around the clock merely to alleviate the inevitable anxieties of entrepreneurship. You tell yourself that you must work around the clock because it makes you feel better to do so — \"If I'm working, I'm not failing.\"Make no mistake, this is a lie. Like all lies, it'll end up hurting you temporarily, no matter how good it makes you feel.Related: You Don't Need to Sacrifice Your Family to Pursue Being an Entrepreneur. Here's How to Save Yourself 500 Hours Per Year.Sacrifice versus rewardsIt's a dismal picture: you put in a thirteen-hour day and get home at seven or eight to find that you've missed dinner, the kids are already in bed and your partner's angry that once again you've chosen work over family. In this case, you aren't alleviating the stress of entrepreneurship as much as adding to it unbearably. You're pointlessly exhausting yourself while avoiding your greatest resource for inspiration and renewal.My general rule of thumb for balancing family and work throughout my whole career has been to take advantage of travel. When I'm out of town, I work constantly. I shove five days of work into three. When I'm in town, I'm always home by six or six-thirty. When I'm home, I'm always present with my kids, present with Rachel. It's only when everyone's asleep that I grind out extra work hours if needed.I can't imagine trying to crank out those same hours and being distracted by the fact that you feel like a loser because you're missing dinner yet again. It's the same number of hours regardless — why not go home, take a break, clear your head, invest in a purpose outside of work and then go back to that work once you've fulfilled your obligations as a parent and partner? To begin with, it recharges your batteries. Brain science has taught us that you have a limited amount of time each day to perform at the highest level. After a certain number of hours, there are diminishing returns on the energy you expend versus the quality of the results.Trust me— when you're feeling good about yourself as a spouse or a father or mother, it's like a shot of pure energy. Putting in the extra hours after you've reaffirmed your love for your family will be a much more productive experience.There's really only one rule when it comes to spending time with family: be present, be present, be present. It's not about pretending to be there when your mind is still brooding in the office. To achieve a balance between work and family, you've got to put down your phone, close your computer and give yourself totally to the moment.",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1738947707-working-dad-0225-g-981694782.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n    Opinions expressed by Entrepreneur contributors are their own.  \u003c/p\u003e\u003cdiv\u003e\n      \u003cp\u003eI\u0026#39;ve never believed in the Silicon Valley idea that you\u0026#39;ve got to work 24/7 and \u003ca href=\"https://www.entrepreneur.com/leadership/5-sacrifices-every-entrepreneur-must-make/245203\" rel=\"follow\" target=\"_self\"\u003esacrifice\u003c/a\u003e everything to build a successful company. For me, \u003ca href=\"https://www.entrepreneur.com/starting-a-business/need-a-business-idea-here-are-55/201588\" rel=\"follow\" target=\"_self\"\u003ebuilding a business\u003c/a\u003e and raising a family go hand in hand. These contrasting views are perhaps best illustrated with a personal anecdote.\u003c/p\u003e\u003cp\u003eLong ago, when a former \u003ca href=\"https://www.entrepreneur.com/growing-a-business/5-characteristics-to-look-for-in-a-business-partner/424885\" rel=\"follow\" target=\"_self\"\u003ebusiness partner\u003c/a\u003e and I were raising our A round for a company we\u0026#39;d founded, I found myself sitting across some investors from Silicon Valley. I knew they wouldn\u0026#39;t have flown out to meet us unless they were fairly serious about investing — they weren\u0026#39;t the type of people to waste time and money on something they didn\u0026#39;t believe in.\u003c/p\u003e\u003cp\u003eMy wife Rachel and I had recently learned that Rachel was pregnant with twins. The pregnancy wasn\u0026#39;t planned, which meant that we\u0026#39;d gone from thinking we were going to have zero more kids to discover we were actually having two at once in the blink of an eye. I was about to become the proud father of not four but six highly energetic daughters.\u003c/p\u003e\n  \n  \n  \n\n  \u003cp\u003eTo break the ice, my co-founder shared the above with our would-be investors. In most cases, spicing up generic small talk with a story about unexpected twins is at least entertaining. But the investors weren\u0026#39;t amused.\u003c/p\u003e\u003cp\u003eThe senior investor — I\u0026#39;ll never forget his name, even though I won\u0026#39;t mention it here — was as serious as a heart attack. He looked straight at me and said, \u0026#34;You know, I have a hard time taking guys like you seriously. Why would you have a family when you should be dedicating your whole life to running your business?\u0026#34;\u003c/p\u003e\n\n  \u003cp\u003eWithout missing a beat, I responded, \u0026#34;That\u0026#39;s interesting — I\u0026#39;ve always struggled to understand guys like \u003ci\u003eyou\u003c/i\u003e. What\u0026#39;s the point of making money if you don\u0026#39;t have anybody to enjoy it with? Where\u0026#39;s the satisfaction in being a single, 45-year-old guy living in a penthouse on University Avenue in Palo Alto? Wouldn\u0026#39;t that feel empty and old after a while? For me, my work is filled with purpose; I get to go home and play with a bunch of adorable little kids who love me.\u0026#34;\u003c/p\u003e\u003cp\u003eI said this in a calm, philosophical way as if I were simply sharing an alternate point of view instead of countering an insult. My co-founder, meanwhile, appeared to be devastated that he\u0026#39;d brought the whole thing up — the meeting was as good as over now.\u003c/p\u003e\u003cp\u003eBut you know what? The second those words came out of the senior investor\u0026#39;s mouth, I knew I didn\u0026#39;t want his money. Family means too much to me to partner with someone who could dismiss it so cavalierly.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003ca href=\"https://www.entrepreneur.com/growing-a-business/an-open-letter-from-an-entrepreneur-dad-to-his-kids-on-how/289065\" rel=\"follow\" target=\"_self\"\u003eAn Open Letter from an Entrepreneur Dad to His Kids on How to Find Success\u003c/a\u003e\u003c/b\u003e\u003c/p\u003e\n\n  \u003cp\u003eFamily and business are not mutually exclusive, but let\u0026#39;s be realistic. \u003ca href=\"https://www.entrepreneur.com/starting-a-business/need-a-business-idea-here-are-55/201588\" rel=\"follow\" target=\"_self\"\u003eRunning a business\u003c/a\u003e is highly difficult, stressful and unpredictable. There will definitely be times when you have to power through setbacks, seemingly at the cost of spending time with the ones you love most.\u003c/p\u003e\u003cp\u003eThe problem begins when obstacles and opportunities are treated as marathons rather than sprints. Every entrepreneur faces a sprint at one point or another — something goes off the rails, or there\u0026#39;s an opportunity you want to capitalize on, so you spend more time at work than you normally want to.\u003c/p\u003e\u003cp\u003eA marathon, on the other hand, is what occurs when you\u0026#39;re working around the clock merely to alleviate the inevitable \u003ca href=\"https://www.entrepreneur.com/leadership/4-expert-backed-strategies-for-managing-anxiety/418881\" rel=\"follow\" target=\"_self\"\u003eanxieties\u003c/a\u003e of entrepreneurship. You tell yourself that you must work around the clock because it makes you feel better to do so — \u0026#34;If I\u0026#39;m working, I\u0026#39;m not failing.\u0026#34;\u003c/p\u003e\u003cp\u003eMake no mistake, this is a lie. Like all lies, it\u0026#39;ll end up hurting you temporarily, no matter how good it makes you feel.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003ca href=\"https://www.entrepreneur.com/leadership/working-dads-save-yourself-500-hours-a-year-with-these-tips/446367\" rel=\"follow\" target=\"_self\"\u003eYou Don\u0026#39;t Need to Sacrifice Your Family to Pursue Being an Entrepreneur. Here\u0026#39;s How to Save Yourself 500 Hours Per Year.\u003c/a\u003e\u003c/b\u003e\u003c/p\u003e\u003ch2\u003e\u003cb\u003eSacrifice versus rewards\u003c/b\u003e\u003c/h2\u003e\u003cp\u003eIt\u0026#39;s a dismal picture: you put in a thirteen-hour day and get home at seven or eight to find that you\u0026#39;ve missed dinner, the kids are already in bed and your partner\u0026#39;s angry that once again you\u0026#39;ve chosen work over family. In this case, you aren\u0026#39;t alleviating the stress of entrepreneurship as much as adding to it unbearably. You\u0026#39;re pointlessly exhausting yourself while avoiding your greatest resource for inspiration and renewal.\u003c/p\u003e\u003cp\u003eMy general rule of thumb for \u003ca href=\"https://www.entrepreneur.com/living/how-to-balance-entrepreneurship-and-family-life-in-2023-and/459335\" rel=\"follow\" target=\"_self\"\u003ebalancing\u003c/a\u003e family and work throughout my whole career has been to take advantage of travel. When I\u0026#39;m out of town, I work constantly. I shove five days of work into three. When I\u0026#39;m in town, I\u0026#39;m always home by six or six-thirty. When I\u0026#39;m home, I\u0026#39;m always present with my kids, present with Rachel. It\u0026#39;s only when everyone\u0026#39;s asleep that I grind out extra work hours if needed.\u003c/p\u003e\u003cp\u003eI can\u0026#39;t imagine trying to crank out those same hours and being distracted by the fact that you feel like a loser because you\u0026#39;re missing dinner yet again. It\u0026#39;s the same number of hours regardless — why not go home, take a break, clear your head, invest in a purpose outside of work and then go back to that work once you\u0026#39;ve fulfilled your obligations as a parent and partner?\u003c/p\u003e\n\n  \u003cp\u003eTo begin with, it recharges your batteries. Brain science has taught us that you have a limited amount of time each day to perform at the highest level. After a certain number of hours, there are diminishing returns on the energy you expend versus the quality of the results.\u003c/p\u003e\u003cp\u003eTrust me— when you\u0026#39;re feeling good about yourself as a spouse or a father or mother, it\u0026#39;s like a shot of pure energy. Putting in the extra hours after you\u0026#39;ve reaffirmed your love for your family will be a much more productive experience.\u003c/p\u003e\u003cp\u003eThere\u0026#39;s really only one rule when it comes to spending time with family: be present, be present, be present. It\u0026#39;s not about pretending to be there when your mind is still brooding in the office. To achieve a balance between work and family, you\u0026#39;ve got to put down your phone, close your computer and give yourself totally to the moment.\u003c/p\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-02-07T21:00:00Z",
  "modifiedTime": "2025-02-07T21:00:00Z"
}
