{
  "id": "cc2bd121-f155-4554-bf76-a479a3b9f4d5",
  "title": "'I Hate Bureaucracy': Leaked Internal Amazon Document Reveals How the Tech Giant Is Cutting Down on Middle Management",
  "link": "https://www.entrepreneur.com/business-news/heres-what-amazon-is-doing-to-cut-down-on-middle-management/486381",
  "description": "Amazon could soon let go of thousands of managers, resulting in savings of up to $3.6 billion.",
  "author": "Sherin Shibu",
  "published": "Thu, 30 Jan 2025 21:58:34 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Sherin Shibu",
  "length": 3179,
  "excerpt": "A leaked Amazon Web Services sales team document shows how Amazon is pausing hiring for managers, demoting existing managers, and increasing the number of direct reports.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "Amazon announced on Wednesday that it was laying off dozens of workers in its communications and sustainability departments, and earlier this month, the company let go of 200 employees from its North America stores team. It's only the beginning.In September, Amazon CEO Andy Jassy announced that the company would be eliminating excess layers of middle management by the end of March. Now, a leaked Amazon Web Services (AWS) sales team guidelines document, obtained by Business Insider on Thursday, sheds light on how those middle-manager cuts will happen.The document tells AWS sales managers to increase their number of direct reports, pause hiring new managers, and demote some managers down a level to a non-managerial position of less pay. An Amazon spokesperson did not confirm the internal guidance to BI. AWS had about 115,000 employees out of Amazon's total 1.55 million. When it comes to direct reports, the leaked document requires managers to have at least eight team members, up from the six that Amazon founder Jeff Bezos required in 2017.The AWS sales team guidelines also advised a pause on hiring new managers, stating that the team had hired more managers than entry-level employees in the past few years, driving costs up. Amazon's structure had become more diamond-shaped than pyramid-shaped, the document stated, referring to the heavier middle management layer. The final recommendation in the leaked documentation was to move managers down a level to individual contributors, which has a lower pay range. Two AWS employees told BI that this had already happened to several managers.Andy Jassy. Photo by Noah Berger/Getty Images for Amazon Web ServicesThese changes arrive in response to Jassy's September note, which asked each senior leadership team to \"increase the ratio of individual contributors to managers by at least 15% by the end of Q1 2025.\"Related: 'Not a Cost Play': Amazon CEO Clarifies Why Employees Have to Come Back to the Office A Morgan Stanley note to investors in October estimated that Amazon could let go of 13,834 managers under Jassy's guidelines, assuming that 7% of Amazon's workforce is management. Amazon had 105,770 managers as of the second quarter of 2024 and would cut that number down to 91,936 managers by the first quarter of 2025, per the note.Morgan Stanley estimated that if Amazon's cost per manager ranged from $200,000 to $350,000 per year, Amazon would save between $2.1 billion and $3.6 billion by reducing its manager headcount.At a November all-hands meeting, Jassy explained that changes to middle management were necessary to keep Amazon competitive. He had created a \"Bureaucracy Mailbox\" in September for Amazon employees to email him examples of excessive processes or rules that could be eliminated. As of November, that inbox had received more than 500 emails, with Amazon taking action on more than 150 employee suggestions.\"The reality is that the [senior leadership team] and I hate bureaucracy,\" Jassy said. \"One of the reasons I'm still at this company is because it's not a political or bureaucratic place.\" Related: I Tried Buying a Car on Amazon. Here Are the Pros and Cons.",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1738271028-Andy-Jassy-GettyImages-2188101054.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003eAmazon \u003ca href=\"http://www.entrepreneur.com/business-news/amazon-layoffs-dozens-of-corporate-employees-cut-in-january/486367\" rel=\"follow\" target=\"_self\"\u003eannounced on Wednesday\u003c/a\u003e that it was laying off dozens of workers in its communications and sustainability departments, and earlier this month, the company let go of \u003ca href=\"https://www.cnbc.com/2025/01/16/amazon-lays-off-about-200-employees-in-its-stores-unit.html\" rel=\"follow\" target=\"_self\"\u003e200 employees\u003c/a\u003e from its North America stores team. It\u0026#39;s only the beginning.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.aboutamazon.com/news/company-news/ceo-andy-jassy-latest-update-on-amazon-return-to-office-manager-team-ratio\" rel=\"follow\" target=\"_self\"\u003eIn September\u003c/a\u003e, Amazon CEO Andy Jassy announced that the company would be eliminating excess layers of middle management by the end of March. Now, a leaked Amazon Web Services (AWS) sales \u003ca href=\"https://www.businessinsider.com/amazon-plan-cut-managers-aws-internal-guidelines-2025-1\" rel=\"follow\" target=\"_self\"\u003eteam guidelines document\u003c/a\u003e, obtained by Business Insider on Thursday, sheds light on how those middle-manager cuts will happen.\u003c/p\u003e\u003cp\u003eThe document tells AWS sales managers to increase their number of direct reports, pause hiring new managers, and demote some managers down a level to a non-managerial position of less pay. An Amazon spokesperson did not confirm the internal guidance to BI.\u003cb\u003e \u003c/b\u003eAWS had about \u003ca href=\"https://www.theinformation.com/articles/google-cloud-narrows-gap-with-aws-in-revenue-per-employee\" rel=\"follow\" target=\"_self\"\u003e115,000 employees\u003c/a\u003e out of Amazon\u0026#39;s total \u003ca href=\"https://www.statista.com/statistics/1324557/quarterly-number-of-amazon-employees/#:~:text=The%20combined%20number%20of%20full,%2D%20and%20part%2Dtime%20employees.\" rel=\"follow\" target=\"_self\"\u003e1.55 million\u003c/a\u003e.\u003c/p\u003e\n  \n  \n  \n\n  \u003cp\u003eWhen it comes to direct reports, the leaked document requires managers to have at least eight team members, up from the six that Amazon founder Jeff Bezos \u003ca href=\"https://www.businessinsider.com/amazon-ceo-andy-jassy-day-2-culture-first-year-ceo-2022-8\" rel=\"follow\" target=\"_self\"\u003erequired in 2017\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe AWS sales team guidelines also advised a pause on hiring new managers, stating that the team had hired more managers than entry-level employees in the past few years, driving costs up. Amazon\u0026#39;s structure had become more diamond-shaped than pyramid-shaped, the document stated, referring to the heavier middle management layer.\u003c/p\u003e\n\n  \u003cp\u003eThe final recommendation in the leaked documentation was to move managers down a level to individual contributors, which has a lower pay range. Two AWS employees told BI that this had already happened to several managers.\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" role=\"presentation\" src=\"https://assets.entrepreneur.com/images/misc/1738271150_Andy-Jassy-GettyImages-2188101054.jpg?width=1000\" width=\"1000\" height=\"667\"/\u003e\u003csup\u003e\u003ci\u003eAndy Jassy. Photo by Noah Berger/Getty Images for Amazon Web Services\u003c/i\u003e\u003c/sup\u003e\u003c/p\u003e\u003cp\u003eThese changes arrive in response to Jassy\u0026#39;s September note, which asked each senior leadership team to \u0026#34;increase the ratio of individual contributors to managers by at least 15% by the end of Q1 2025.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/business-news/amazon-ceo-this-is-why-employees-must-work-in-office-rto/482473\" rel=\"follow\" target=\"_self\"\u003e\u0026#39;Not a Cost Play\u0026#39;: Amazon CEO Clarifies Why Employees Have to Come Back to the Office\u003c/a\u003e\u003c/p\u003e\n\n  \u003cp\u003eA \u003ca href=\"https://cybernews.com/news/morgan-stanley-amazon-managers-purge/\" rel=\"follow\" target=\"_self\"\u003eMorgan Stanley note\u003c/a\u003e to investors in October estimated that Amazon could let go of 13,834 managers under Jassy\u0026#39;s guidelines, assuming that 7% of Amazon\u0026#39;s workforce is management. Amazon had 105,770 managers as of the second quarter of 2024 and would cut that number down to 91,936 managers by the first quarter of 2025, per the note.\u003c/p\u003e\u003cp\u003eMorgan Stanley estimated that if Amazon\u0026#39;s cost per manager ranged from $200,000 to $350,000 per year, Amazon would save between $2.1 billion and $3.6 billion by reducing its manager headcount.\u003c/p\u003e\u003cp\u003eAt a November all-hands meeting, Jassy \u003ca href=\"https://www.businessinsider.com/amazon-ceo-says-rto-mandate-not-backdoor-layoff-2024-11\" rel=\"follow\" target=\"_self\"\u003eexplained\u003c/a\u003e that changes to middle management were necessary to keep Amazon competitive. He had created a \u0026#34;Bureaucracy Mailbox\u0026#34; in September for Amazon employees to email him examples of excessive processes or rules that could be eliminated. As of November, that inbox had received \u003ca href=\"https://www.businessinsider.com/amazon-ceo-explains-why-he-wants-fewer-managers-hate-bureaucracy-2024-11\" rel=\"follow\" target=\"_self\"\u003emore than 500 emails\u003c/a\u003e, with Amazon taking action on more than 150 employee suggestions.\u003c/p\u003e\u003cp\u003e\u0026#34;The reality is that the [senior leadership team] and I hate bureaucracy,\u0026#34; Jassy said. \u0026#34;One of the reasons I\u0026#39;m still at this company is because it\u0026#39;s not a political or bureaucratic place.\u0026#34;\u003c/p\u003e\n\n  \u003cp\u003e\u003cb\u003eRelated:\u003c/b\u003e \u003ca href=\"https://www.entrepreneur.com/business-news/i-tried-buying-a-car-through-amazon-here-are-the-pros-cons/484116\" rel=\"follow\" target=\"_self\"\u003eI Tried Buying a Car on Amazon. Here Are the Pros and Cons.\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-30T21:58:34Z",
  "modifiedTime": "2025-01-30T21:58:34Z"
}
