{
  "id": "ccf0ec7c-d165-4f96-b421-f557a1f00c5e",
  "title": "Fin over email: How we built a multichannel AI agent",
  "link": "https://www.intercom.com/blog/fin-over-email-how-we-built/",
  "description": "There’s a perception that AI for customer service can only function over chat. However, our next-generation Fin AI Agent is truly omnichannel – discover how we developed AI technology that delivers great support over email.",
  "author": "Julia Godinho",
  "published": "Thu, 17 Oct 2024 12:31:01 +0000",
  "source": "https://www.intercom.com/blog/feed",
  "categories": [
    "Customer Service",
    "Product \u0026 Design",
    "email",
    "Fin AI Agent"
  ],
  "byline": "Julia Godinho",
  "length": 9702,
  "excerpt": "Our next-generation Fin AI Agent is truly omnichannel – discover how we developed an AI Agent that delivers great support over email.",
  "siteName": "The Intercom Blog",
  "favicon": "https://blog.intercomassets.com/blog/wp-content/uploads/2018/10/cropped-cropped-site-icon-2-192x192.png",
  "text": "Email is an essential channel for support, but email conversations lead to slower resolutions for customers when compared with synchronous channels like live chat. With the advent of AI-first customer service, a lot of frontline customer queries are now being dealt with by LLM-powered AI agents. Our own Fin AI Agent resolves more than 50% of customer queries immediately. However, there’s a perception that AI agents can only function over chat. Our research has shown that many customer service leaders continue to equate AI to chat experiences, rather than thinking about how it can deliver support across multiple channels, just as human agents can. Well, we’re changing that perception with the latest updates to Fin AI Agent – customers can now get instant responses to their emails. Customers can now get AI answers to their emailed support questions Getting Fin AI Agent to work over email presented some interesting technical and UX challenges – here, we dive into the process and share some of our learnings. How Fin for email works When a user contacts a business’ customer support team via email, Fin AI Agent will automatically jump into the conversation to resolve the issue. Fin’s answers use generative AI technology to create the answer based on a range of support content using the Retrieval-Augmented Generation (RAG) framework. Fin not only provides direct answers to queries, it’s also more conversational, with the ability to ask clarifying questions if the user’s initial message isn’t clear enough to find the best response. For the most complex cases that Fin isn’t able to answer, Fin will seamlessly hand over to a support agent. Our development journey When Intercom launched Fin AI Agent in March 2023, it was the first generative AI-powered customer service agent on the market. We tapped into learnings from our previous machine learning-based product, Resolution Bot, to inform what a generative AI Agent could look like. Since then, we’ve continued to improve and expand our offering by introducing completely new features or rolling out improvements to the underlying model, thereby increasing resolutions. Starting from first principles When it came to defining how we would build Fin over email, we didn’t have a blueprint for what the solution should look like. Email as a channel is very different from chat, so we were unsure whether Fin over email should work in the same way. This is where our “Think big, start small, learn fast” principle became relevant, and pushed us to apply first principles thinking. We started with research to better understand why email automation was important for customers, what kind of requirements they had, and what impact we could anticipate if we built Fin over email. The insights were summarized into a doc called an “Intermission”, which we create at the start of all product initiatives, in keeping with our “Start with the problem” principle. Iterative development We decided to start small with an alpha version as there were many assumptions to validate. The team proceeded to build the technical foundations and a very simple teammate experience – just enough to be able to set Fin live on email, but with no bells and whistles. Since we already had a lot of the building blocks in place – a solid email solution and a very flexible automation system (Workflows) – we were up and running quickly. “This close partnership is at the heart of how we work in R\u0026D – it allows us to move fast as we have tight feedback loops with the customers who will use and benefit from our product” We reached out to a handful of Fin AI Agent customers, who have a high number of monthly email conversations, to provide us with feedback on what we had built so far. This provided us with enough insight to define scope for our open beta release. At Intercom, we are very fortunate to be able to partner with our customers as we make progress on our thinking. We work closely together to understand their needs and gather feedback on our initial solution. This close partnership is at the heart of how we work in R\u0026D. It allows us to move fast as we have tight feedback loops with the customers who will use and benefit from our product. The early feedback helped us shape our open beta. At this stage, we kicked off a more in-depth design phase, resulting in an artifact called an “Interconcept”. This phase of development is driven by the product designer and outlines a set of different approaches, each with a list of pros and cons. When we were ready to start building, the lead product engineer created a project plan to outline what we needed to build and in what sequence, making it very easy to bring the rest of the team together. Once we launched Fin over email to open beta, we focused on monitoring usage and gathering as much feedback as possible, aiming to uncover any necessary improvements or new functionality required for general availability. Challenges and considerations Despite the team working on Fin AI Agent for over a year, amassing deep usage insights and seeing a great deal of success, making Fin work over email came with its own challenges. Technical challenges In 2022, prior to the generative AI explosion, Intercom launched the ability to run automations and chatbots over different channels, such as WhatsApp, SMS, and email. At the time, email already proved to be a more complex channel to automate. From a technical perspective, some examples of challenges we faced when working with email automation were: Email deliverability was out of our control – mail clients (such as Gmail and Outlook) can block addresses and throttle usage. Multiple queries in the same message happen more often over email, meaning that we needed to ensure we process them separately so no context is lost. Converting automated content for chat (which tends to be shorter, separate messages) into a single email with correct formatting (i.e a heading, the body, and an email signature) was not a trivial task. User experience considerations Besides the technical challenges, we also had to solve problems that impacted the end user experience. For most end users, talking to an AI agent over email is a much less established habit than talking to one over live chat, which meant that we had to design an experience that took all the standard expectations around email into account, rather than trying to replicate a chat experience over email. It was also important for us that the experience felt natural and intuitive so that end users felt comfortable with interacting with an AI agent over email. We had to consider many differences between live chat and email when designing the new experience, such as: As email is an asynchronous channel, conversations don’t have an instant back-and-forth like they do over live chat and customers often have to wait longer to receive a response to their question. The email content is usually longer and contains more information, whether that’s text or images. Interactive steps that you can add to chat conversations, such as buttons, don’t quite translate over to email. Setting expectations that a user is talking to an AI agent requires different visual cues in email than over live chat. Emails render very differently across a number of email clients (e.g. Gmail and Outlook), resulting in a long list of design requirements. Adapting our underlying AI architecture Lastly, with the learnings gathered from both the technical and end user experience challenges, we partnered with Machine Learning scientists and engineers to create a new component in the AI agent’s underlying architecture specifically for email. Different to our original AI agent over chat, this new agent was developed with the specificities of email in mind, such as: Ability to process multiple questions from a single message separately; for example, it can directly answer some queries and clarify others in the same email response. Not processing email signatures containing images that are not relevant to the query. A built-in mechanism to ignore spam and automated emails. As the expectation for a response over email isn’t as instantaneous as chat, we were also able to perform some more complex LLM querying for better and more robust answers without significantly impacting the response times. Fin over email in action The impact for our customers has been immediate. For instance, Robb Clarke, Head of Technical Operations at RB2B, reported these astonishing results: “RB2B 2x’d its user base in the last 58 days but my support team is fielding 45% LESS inquiries thanks to one major change, Fin AI Agent started handling email replies. This simple yet powerful change saved us from handling an additional 493 tickets. At 15 minutes per ticket, that’s about 123 hours saved. If you’re not using it yet, you’re missing out. The efficiency and time savings are game-changers – 12 months from now, our team of 2 is going to be acting like a team of 20.” Within the first month of release, Fin processed over 1 million end user emails. Fin has provided an AI-generated answer to over 81% of the email conversations it has been involved in, automatically resolving more than 56% of them on average. Fin over email is available now. Learn more about how it can transform your customer support experience, or check out this instructional video, which shows you how to set it up to support your customers. Your customer service experience has to deliver great support everywhere your customers expect to communicate with you, and that means AI agents have to be able to deliver support in those channels too. With Fin AI Agent, that omnichannel AI-powered support experience is a reality.",
  "image": "https://blog.intercomassets.com/blog/wp-content/uploads/2024/10/Fin-over-Email_Blog-Hero.jpg.optimal.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\u003cp\u003eEmail is an essential channel for support, but email conversations lead to slower resolutions for customers when compared with synchronous channels like live chat.\u003c/p\u003e\n\u003cp\u003eWith the advent of AI-first customer service, a lot of frontline customer queries are now being dealt with by LLM-powered AI agents. Our own \u003ca href=\"https://www.intercom.com/support-for-customers/ai-agent\"\u003eFin AI Agent\u003c/a\u003e resolves more than 50% of customer queries immediately.\u003c/p\u003e\n\u003cp\u003eHowever, there’s a perception that AI agents can only function over chat. Our research has shown that many customer service leaders continue to equate AI to chat experiences, rather than thinking about how it can deliver support across multiple channels, just as human agents can.\u003c/p\u003e\n\u003cp\u003eWell, we’re changing that perception with the latest updates to Fin AI Agent – customers can now get instant responses to their emails.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://blog.intercomassets.com/blog/wp-content/uploads/2024/10/Fin2-Announcement-16-Email_b.jpg.optimal.jpg\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eCustomers can now get AI answers to their emailed support questions\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eGetting Fin AI Agent to work over email presented some interesting technical and UX challenges – here, we dive into the process and share some of our learnings.\u003c/p\u003e\n\u003ch2\u003eHow Fin for email works\u003c/h2\u003e\n\u003cp\u003eWhen a user contacts a business’ customer support team via email, Fin AI Agent will automatically jump into the conversation to resolve the issue. Fin’s answers use generative AI technology to create the answer based on a range of support content using the \u003ca href=\"https://aws.amazon.com/what-is/retrieval-augmented-generation/\"\u003eRetrieval-Augmented Generation (RAG) framework\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFin not only provides direct answers to queries, it’s also more conversational, with the ability to ask clarifying questions if the user’s initial message isn’t clear enough to find the best response. For the most complex cases that Fin isn’t able to answer, Fin will seamlessly hand over to a support agent.\u003c/p\u003e\n\u003ch2\u003eOur development journey\u003c/h2\u003e\n\u003cp\u003eWhen Intercom launched Fin AI Agent in March 2023, it was the first generative AI-powered customer service agent on the market. We tapped into learnings from our previous machine learning-based product, \u003ca href=\"https://www.intercom.com/blog/announcing-resolution-bot/\"\u003eResolution Bot\u003c/a\u003e, to inform what a generative AI Agent could look like. Since then, we’ve continued to improve and expand our offering by introducing completely new features or rolling out improvements to the underlying model, thereby increasing resolutions.\u003c/p\u003e\n\u003ch2\u003eStarting from first principles\u003c/h2\u003e\n\u003cp\u003eWhen it came to defining how we would build Fin over email, we didn’t have a blueprint for what the solution should look like. Email as a channel is very different from chat, so we were unsure whether Fin over email should work in the same way. This is where our \u003ca href=\"https://www.intercom.com/blog/intercom-product-principles/\"\u003e“Think big, start small, learn fast”\u003c/a\u003e principle became relevant, and pushed us to apply first principles thinking.\u003c/p\u003e\n\u003cp\u003eWe started with research to better understand why email automation was important for customers, what kind of requirements they had, and what impact we could anticipate if we built Fin over email. The insights were summarized into a doc called an “Intermission”, which we create at the start of all product initiatives, in keeping with our \u003ca href=\"https://www.intercom.com/blog/intercom-product-principles-start-with-the-problem/\"\u003e“Start with the problem”\u003c/a\u003e principle.\u003c/p\u003e\n\u003ch2\u003eIterative development\u003c/h2\u003e\n\u003cp\u003eWe decided to start small with an alpha version as there were many assumptions to validate. The team proceeded to build the technical foundations and a very simple teammate experience – just enough to be able to set Fin live on email, but with no bells and whistles. Since we already had a lot of the building blocks in place – a solid \u003ca href=\"https://www.intercom.com/help/en/collections/2091415-emails\"\u003eemail solution\u003c/a\u003e and a very flexible automation system (\u003ca href=\"https://www.intercom.com/blog/introducing-workflows-customer-service-automations/\"\u003eWorkflows\u003c/a\u003e) – we were up and running quickly.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e“This close partnership is at the heart of how we work in R\u0026amp;D – it allows us to move fast as we have tight feedback loops with the customers who will use and benefit from our product”\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eWe reached out to a handful of Fin AI Agent customers, who have a high number of monthly email conversations, to provide us with feedback on what we had built so far. This provided us with enough insight to define scope for our open beta release.\u003c/p\u003e\n\u003cp\u003eAt Intercom, we are very fortunate to be able to partner with our customers as we make progress on our thinking. We work closely together to understand their needs and gather feedback on our initial solution. This close partnership is at the heart of how we work in R\u0026amp;D. It allows us to move fast as we have tight feedback loops with the customers who will use and benefit from our product.\u003c/p\u003e\n\u003cp\u003eThe early feedback helped us shape our open beta. At this stage, we kicked off a more in-depth design phase, resulting in an artifact called an “Interconcept”. This phase of development is driven by the product designer and outlines a set of different approaches, each with a list of pros and cons.\u003c/p\u003e\n\u003cp\u003eWhen we were ready to start building, the lead product engineer created a project plan to outline what we needed to build and in what sequence, making it very easy to bring the rest of the team together. Once we launched Fin over email to open beta, we focused on monitoring usage and gathering as much feedback as possible, aiming to uncover any necessary improvements or new functionality required for general availability.\u003c/p\u003e\n\u003ch2\u003eChallenges and considerations\u003c/h2\u003e\n\u003cp\u003eDespite the team working on Fin AI Agent for over a year, amassing deep usage insights and seeing a great deal of success, making Fin work over email came with its own challenges.\u003c/p\u003e\n\u003ch3\u003eTechnical challenges\u003c/h3\u003e\n\u003cp\u003eIn 2022, prior to the generative AI explosion, Intercom launched the ability to run automations and chatbots over different channels, such as WhatsApp, SMS, and email. At the time, email already proved to be a more complex channel to automate.\u003c/p\u003e\n\u003cp\u003eFrom a technical perspective, some examples of challenges we faced when working with email automation were:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEmail deliverability was out of our control – mail clients (such as Gmail and Outlook) can block addresses and throttle usage.\u003c/li\u003e\n\u003cli\u003eMultiple queries in the same message happen more often over email, meaning that we needed to ensure we process them separately so no context is lost.\u003c/li\u003e\n\u003cli\u003eConverting automated content for chat (which tends to be shorter, separate messages) into a single email with correct formatting (i.e a heading, the body, and an email signature) was not a trivial task.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eUser experience considerations\u003c/h3\u003e\n\u003cp\u003eBesides the technical challenges, we also had to solve problems that impacted the end user experience.\u003c/p\u003e\n\u003cp\u003eFor most end users, talking to an AI agent over email is a much less established habit than talking to one over live chat, which meant that we had to design an experience that took all the standard expectations around email into account, rather than trying to replicate a chat experience over email.\u003c/p\u003e\n\u003cp\u003eIt was also important for us that the experience felt natural and intuitive so that end users felt comfortable with interacting with an AI agent over email.\u003c/p\u003e\n\u003cp\u003eWe had to consider many differences between live chat and email when designing the new experience, such as:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAs email is an asynchronous channel, conversations don’t have an instant back-and-forth like they do over live chat and customers often have to wait longer to receive a response to their question.\u003c/li\u003e\n\u003cli\u003eThe email content is usually longer and contains more information, whether that’s text or images.\u003c/li\u003e\n\u003cli\u003eInteractive steps that you can add to chat conversations, such as buttons, don’t quite translate over to email.\u003c/li\u003e\n\u003cli\u003eSetting expectations that a user is talking to an AI agent requires different visual cues in email than over live chat.\u003c/li\u003e\n\u003cli\u003eEmails render very differently across a number of email clients (e.g. Gmail and Outlook), resulting in a long list of design requirements.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAdapting our underlying AI architecture\u003c/h2\u003e\n\u003cp\u003eLastly, with the learnings gathered from both the technical and end user experience challenges, we partnered with Machine Learning scientists and engineers to create a new component in the AI agent’s underlying architecture specifically for email. Different to our original AI agent over chat, this new agent was developed with the specificities of email in mind, such as:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAbility to process multiple questions from a single message separately; for example, it can directly answer some queries and clarify others in the same email response.\u003c/li\u003e\n\u003cli\u003eNot processing email signatures containing images that are not relevant to the query.\u003c/li\u003e\n\u003cli\u003eA built-in mechanism to ignore spam and automated emails.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs the expectation for a response over email isn’t as instantaneous as chat, we were also able to perform some more complex LLM querying for better and more robust answers without significantly impacting the response times.\u003c/p\u003e\n\u003ch2\u003eFin over email in action\u003c/h2\u003e\n\u003cp\u003eThe impact for our customers has been immediate. For instance, \u003ca href=\"https://www.linkedin.com/in/robbclarke/\"\u003eRobb Clarke\u003c/a\u003e, Head of Technical Operations at \u003ca href=\"https://www.rb2b.com/\"\u003eRB2B\u003c/a\u003e, reported these astonishing results:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e“RB2B 2x’d its user base in the last 58 days but my support team is fielding 45% LESS inquiries thanks to one major change, Fin AI Agent started handling email replies. This simple yet powerful change saved us from handling an additional 493 tickets. At 15 minutes per ticket, that’s about 123 hours saved. If you’re not using it yet, you’re missing out. The efficiency and time savings are game-changers – 12 months from now, our team of 2 is going to be acting like a team of 20.”\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eWithin the first month of release, Fin processed over 1 million end user emails. Fin has provided an AI-generated answer to over 81% of the email conversations it has been involved in, automatically resolving more than 56% of them on average.\u003c/p\u003e\n\u003cp\u003eFin over email is available now. \u003ca href=\"https://www.intercom.com/help/en/articles/9356221-set-fin-ai-agent-live-for-email\"\u003eLearn more\u003c/a\u003e about how it can transform your customer support experience, or check out this instructional video, which shows you how to set it up to support your customers.\u003cbr/\u003e\n\u003c/p\u003e\n\n\u003cp\u003eYour customer service experience has to deliver great support everywhere your customers expect to communicate with you, and that means AI agents have to be able to deliver support in those channels too. With Fin AI Agent, that omnichannel AI-powered support experience is a reality.\u003c/p\u003e\n\u003cp\u003e\n\n\u003ca href=\"https://www.intercom.com/fin\" data-ctatype=\"horizontal\" data-ctaname=\"Fin2 AI Agent (Horizontal)\" data-ctacategory=\"\" target=\"_blank\"\u003e\n\t\u003cimg decoding=\"async\" src=\"https://blog.intercomassets.com/blog/wp-content/uploads/2024/10/Fin2-CTA-Horizontal-1200.jpg.optimal.jpg\" alt=\"Fin2 AI Agent blog CTA - Horizontal\"/\u003e\n\u003c/a\u003e\n\n\u003c/p\u003e\n\n\t\t\t\n\u003cp\u003e\u003ca href=\"https://events.intercom.com/pioneer-2024/?utm_source=ii-newsletter\u0026amp;utm_medium=internal\u0026amp;utm_campaign=pioneer-2024-ondemand\u0026amp;utm_content=blog%20cta\" data-ctatype=\"vertical\" data-ctaname=\"Pioneer virtual promo (Vertical)\" data-ctacategory=\"Events\" target=\"_blank\"\u003e\n\t\u003cimg src=\"https://blog.intercomassets.com/blog/wp-content/uploads/2024/10/Pioneer-blog-CTA-vertical.jpg.optimal.jpg\" alt=\"Pioneer AI Customer Service Summit blog CTA - vertical\"/\u003e\n\u003c/a\u003e\n\n\u003c/p\u003e\n\n\t\t\t\n\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-10-17T12:31:01Z",
  "modifiedTime": null
}
