{
  "id": "d75d7053-10e9-4eff-8e7b-b1d6111bf195",
  "title": "Smart Passive Income Unites Two Entrepreneurial Communities with a Tiered Membership Model",
  "link": "https://www.smartpassiveincome.com/blog/smart-passive-income-unites-two-entrepreneurial-communities-with-a-tiered-membership-model/",
  "description": "Sign up for our weekly Unstuck newsletter at https://www.smartpassiveincome.com/newsletter/ The merger enhances access to high-quality resources, support, and connections for entrepreneurs at every stage of their journey. The post Smart Passive Income Unites Two Entrepreneurial Communities with a Tiered Membership Model appeared first on Smart Passive Income.",
  "author": "Kelsey Bressie",
  "published": "Mon, 16 Dec 2024 21:06:20 +0000",
  "source": "http://feeds.feedburner.com/smartpassiveincome",
  "categories": [
    "Newsroom"
  ],
  "byline": "Kelsey Bressie",
  "length": 3852,
  "excerpt": "SPI merge two entrepreneur communities to enhance access to resources, support, and connections for early stage entrepreneurs.",
  "siteName": "Smart Passive Income",
  "favicon": "",
  "text": "Sandy Mann, Director of Marketing SPI Media[email protected] Smart Passive Income (SPI) is excited to announce the merger of its two entrepreneurial online communities into one unified SPI Community. This integration introduces a three-tiered membership structure designed to provide targeted resources and benefits that support entrepreneurs from the early stages of ideation to achieving full-time income. The decision behind the merger For years, SPI successfully operated two distinct communities: the All-Access Pass for early-stage entrepreneurs and SPI Pro for advanced business owners. While these communities served members well, SPI recognized the potential to deliver even greater value by combining them into one unified space. “When I joined SPI, we began exploring why these two communities existed separately,” said Caleb Wojcik, CEO of Smart Passive Income. “It became clear that merging them into one place would enhance interactions, learning, and networking opportunities for everyone. This also led us to implement a tiered structure to better meet the needs of entrepreneurs at every stage, including features like mastermind groups, sprints, and quests to foster connection and progress.” These changes ensure members can share insights, collaborate, and grow together within a more dynamic, supportive entrepreneurial ecosystem. The new tiered membership structure The SPI Community now offers three membership tiers tailored to different levels of entrepreneurial growth and unique learning needs: Start: Geared toward beginners, this tier provides DIY education through self-paced courses, live events, and discussion channels to help members build a strong foundation. Accelerate: Designed for those seeking additional support and accountability in a do-it-with-you setting, this tier includes everything in Start plus benefits like cohort-based course accelerators, peer-led masterminds, monthly quests, and office hours with Pat Flynn. Thrive: Built for established entrepreneurs, this application-based tier with quarterly enrollment periods offers exclusive access to vetted Mastermind groups, quarterly Sprints, additional office hours with Pat Flynn, the Full-Time Entrepreneur Playbook, and expert-led Thrive-only discussion channels. This marks the start of an exciting new phase for Smart Passive Income. By uniting its communities and introducing a tiered membership structure, SPI is reinforcing its commitment to equipping members with the knowledge, tools, and connections they need to achieve their business goals — supported by a community of like-minded entrepreneurs. To learn more about the decision to restructure and merge the communities, listen to the bonus podcast episode, The Updated SPI Community Is Here—Behind the Scenes of What’s New with Caleb Wojcik. The episode is available at https://www.smartpassiveincome.com/podcasts/the-updated-spi-community/. About Smart Passive Income Smart Passive Income (SPI) is committed to guiding entrepreneurs from idea to income through education, feedback, and accountability. Founded by Pat Flynn, SPI equips individuals with the tools and support to achieve personal fulfillment, financial independence, and long-term success. By offering a range of resources and a thriving membership community, SPI fosters collaboration, innovation, and growth. Rooted in the belief that entrepreneurship is the best path to controlling your future, SPI empowers its members to build meaningful and sustainable businesses. Learn more at smartpassiveincome.com. Get Unstuck in just 5 minutes, for free Our weekly Unstuck newsletter helps online entrepreneurs break through mental blocks, blind spots, and skill gaps. It’s the best 5-minute read you’ll find in your inbox. Free newsletter. Unsubscribe anytime.",
  "image": "https://www.smartpassiveincome.com/wp-content/uploads/2024/01/SPI-Logo-with-White-Space-Buffer-Smaller.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eSandy Mann, Director of Marketing \u003cbr/\u003eSPI Media\u003cbr/\u003e\u003ca href=\"https://www.smartpassiveincome.com/cdn-cgi/l/email-protection#1c6f7d72786532717d72725c68797d716f6c75327f7371\"\u003e\u003cspan data-cfemail=\"d0a3b1beb4a990a4b5b1bda3a0b9feb3bfbd\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eSmart Passive Income (SPI) is excited to announce the merger of its two entrepreneurial online communities into one unified SPI Community. This integration introduces a three-tiered membership structure designed to provide targeted resources and benefits that support entrepreneurs from the early stages of ideation to achieving full-time income.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-the-decision-behind-the-merger\"\u003eThe decision behind the merger\u003c/h3\u003e\n\n\n\n\u003cp\u003eFor years, SPI successfully operated two distinct communities: the All-Access Pass for early-stage entrepreneurs and SPI Pro for advanced business owners. While these communities served members well, SPI recognized the potential to deliver even greater value by combining them into one unified space.\u003c/p\u003e\n\n\n\n\u003cp\u003e“When I joined SPI, we began exploring why these two communities existed separately,” said Caleb Wojcik, CEO of Smart Passive Income. “It became clear that merging them into one place would enhance interactions, learning, and networking opportunities for everyone. This also led us to implement a tiered structure to better meet the needs of entrepreneurs at every stage, including features like mastermind groups, sprints, and quests to foster connection and progress.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThese changes ensure members can share insights, collaborate, and grow together within a more dynamic, supportive entrepreneurial ecosystem.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-the-new-tiered-membership-structure\"\u003eThe new tiered membership structure\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe SPI Community now offers three membership tiers tailored to different levels of entrepreneurial growth and unique learning needs:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eStart:\u003c/strong\u003e Geared toward beginners, this tier provides DIY education through self-paced courses, live events, and discussion channels to help members build a strong foundation.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eAccelerate: \u003c/strong\u003eDesigned for those seeking additional support and accountability in a do-it-with-you setting, this tier includes everything in Start plus benefits like cohort-based course accelerators, peer-led masterminds, monthly quests, and office hours with Pat Flynn.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eThrive: \u003c/strong\u003eBuilt for established entrepreneurs, this application-based tier with quarterly enrollment periods offers exclusive access to vetted Mastermind groups, quarterly Sprints, additional office hours with Pat Flynn, the Full-Time Entrepreneur Playbook, and expert-led Thrive-only discussion channels.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eThis marks the start of an exciting new phase for Smart Passive Income. By uniting its communities and introducing a tiered membership structure, SPI is reinforcing its commitment to equipping members with the knowledge, tools, and connections they need to achieve their business goals — supported by a community of like-minded entrepreneurs.\u003c/p\u003e\n\n\n\n\u003cp\u003eTo learn more about the decision to restructure and merge the communities, listen to the bonus podcast episode, \u003cem\u003eThe Updated SPI Community Is Here—Behind the Scenes of What’s New with Caleb Wojcik.\u003c/em\u003e The episode is available at \u003ca href=\"https://www.smartpassiveincome.com/podcasts/the-updated-spi-community/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ehttps://www.smartpassiveincome.com/podcasts/the-updated-spi-community/\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-about-smart-passive-income\"\u003eAbout Smart Passive Income\u003c/h3\u003e\n\n\n\n\u003cp\u003eSmart Passive Income (SPI) is committed to guiding entrepreneurs from idea to income through education, feedback, and accountability. Founded by Pat Flynn, SPI equips individuals with the tools and support to achieve personal fulfillment, financial independence, and long-term success. By offering a range of resources and a thriving membership community, SPI fosters collaboration, innovation, and growth. Rooted in the belief that entrepreneurship is the best path to controlling your future, SPI empowers its members to build meaningful and sustainable businesses. Learn more at \u003ca href=\"https://www.smartpassiveincome.com\" target=\"_blank\" rel=\"noreferrer noopener\"\u003esmartpassiveincome.com\u003c/a\u003e.\u003c/p\u003e\n\t\n\t\n\u003c/div\u003e\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg src=\"https://www.smartpassiveincome.com/wp-content/uploads/2023/09/spi_cta1.png\" alt=\"\"/\u003e\u003c/figure\u003e\n\u003c/div\u003e\n\n\n\n\u003cdiv\u003e\n\u003ch2 id=\"h-get-unstuck-in-just-5-minutes-for-free\"\u003eGet \u003cem\u003eUnstuck\u003c/em\u003e in just 5 minutes, for free\u003c/h2\u003e\n\n\n\n\u003cdiv\u003e\n\u003cp\u003eOur weekly \u003cem\u003eUnstuck \u003c/em\u003enewsletter helps online entrepreneurs break through mental blocks, blind spots, and skill gaps. It’s the best 5-minute read you’ll find in your inbox.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\u003cp\u003eFree newsletter. Unsubscribe anytime.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg width=\"365\" height=\"83\" src=\"https://www.smartpassiveincome.com/wp-content/uploads/2023/09/spi_users_avatars.webp\" alt=\"\" srcset=\"https://www.smartpassiveincome.com/wp-content/uploads/2023/09/spi_users_avatars.webp 365w, https://www.smartpassiveincome.com/wp-content/uploads/2023/09/spi_users_avatars-300x68.webp 300w\" sizes=\"(max-width: 365px) 100vw, 365px\"/\u003e\u003c/figure\u003e\n\n\n\n\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg src=\"https://www.smartpassiveincome.com/wp-content/uploads/2023/09/spi_cta2.png\" alt=\"\"/\u003e\u003c/figure\u003e\n\u003c/div\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-16T21:06:20Z",
  "modifiedTime": "2025-01-02T14:40:15Z"
}
