{
  "id": "dacbecfb-1c23-43a9-a7f8-ae931f60eae4",
  "title": "Mammals Evolved into Ant Eaters 12 Times Since Dinosaur Age, Study Finds",
  "link": "https://news.njit.edu/mammals-evolved-ant-eaters-12-times-dinosaur-age-study-finds",
  "description": "Article URL: https://news.njit.edu/mammals-evolved-ant-eaters-12-times-dinosaur-age-study-finds Comments URL: https://news.ycombinator.com/item?id=44599334 Points: 24 # Comments: 9",
  "author": "zdw",
  "published": "Thu, 17 Jul 2025 23:10:38 +0000",
  "source": "https://hnrss.org/frontpage",
  "categories": null,
  "byline": "Written by: Jesse Jenkins",
  "length": 6637,
  "excerpt": "A first-of-its-kind study traces the rise of ant- and termite-eaters, revealing how mammals returned to the evolutionary table — at least a dozen times — to hone traits for feasting on the social insect bonanza that exploded after the extinction of the dinosaurs.",
  "siteName": "NJIT News",
  "favicon": "",
  "text": "A first-of-its-kind study traces the rise of ant- and termite-eaters, revealing how mammals returned to the evolutionary table — at least a dozen times — to hone traits for feasting on the social insect bonanza that exploded after the extinction of the dinosaurs. Mammals have developed some unusual eating habits over the past 100 million years, but a new study has uncovered the surprising lengths some have gone to satisfy one of the more peculiar — a taste for ants and termites. Findings published in Evolution reveal that mammals independently evolved specialized adaptations for exclusively feeding on ants and termites at least 12 times since the Cenozoic era began, roughly 66 million years ago. Researchers say the convergent evolution among mammals toward this dietary strategy — called myrmecophagy — emerged following the K-Pg extinction and fall of non-avian dinosaurs, which reshaped ecosystems and set the stage for ant and termite colonies to rapidly expand worldwide, driving extreme shifts in feeding modes for certain species. “There’s not been an investigation into how this dramatic diet evolved across all known mammal species until now,” said Phillip Barden, the study’s corresponding author and associate professor of biology at New Jersey Institute of Technology (NJIT). “This work gives us the first real roadmap, and what really stands out is just how powerful a selective force ants and termites have been over the last 50 million years — shaping environments and literally changing the face of entire species.” Over 200 mammal species are known to eat ants and termites today, yet only about 20 true myrmecophages — such asgiant anteaters, aardvarks and pangolins — have evolved traits like long sticky tongues, specialized claws and stomachs, and reduced or missing teeth, to efficiently consume thousands of these insects daily as their sole food source. To understand how often and when mammals evolved such traits, the team compiled dietary data for 4,099 mammal species, drawing from nearly a century of natural history records, conservation reports, taxonomic descriptions and dietary datasets. “Compiling dietary data for nearly every living mammal was daunting, but it really illuminates the sheer diversity of diets and ecologies in the mammalian world,” said Thomas Vida, co-corresponding author of the study and University of Bonn researcher who led the study’s literature review of more than 600 published sources. “We see fruit-eating foxes, krill-eating seals and sap-drinking primates, but few rely exclusively on ants and termites … the ecomorphological adaptations required are such a major barrier. “One thing myrmecophages share is an almost insatiable appetite — ants and termites are so low in energy that even a small animal like the numbat must eat about 20,000 termites a day, while an aardwolf can hunt up to 300,000 in a single night.” Species were sorted into five dietary groups — from strict ant- and termite-eaters (“obligate myrmecophages”) to general insectivores, carnivores, omnivores, and herbivores — based on published gut analyses and field observations. The team then mapped these groups onto a time-calibrated mammal family tree and used statistical models to reconstruct ancestral diets, uncovering at least 12 independent origins of obligate myrmecophagy across diverse lineages. The researchers also traced ant and termite colony sizes back to the Cretaceous, about 145 million years ago, to understand when these insects became a reliable, year-round food source. Today, ants and termites number over 15,000 species with a combined biomass exceeding all living wild mammals, but in the Cretaceous, they made up less than 1% of insects on Earth. Numbers did not reach modern levels until the Miocene ~23 million years ago, when they rose to 35% of all insect specimens, Barden says. “It’s not clear exactly why ants and termites both took off around the same time. Some work has implicated the rise of flowering plants, along with some of the planet’s warmest temperatures during the Paleocene-Eocene Thermal Maximum about 55 million years ago,” Barden explained. “What is clear is that their sheer biomass set off a cascade of evolutionary responses across plants and animals.” “While some species evolved defenses to avoid these insects, others took the opposite approach — if you can’t beat them, eat them.” Ultimately, the analysis revealed that myrmecophagy evolved at least once in each major mammal group — monotremes, marsupials and placentals — but unevenly, suggesting some lineages were more “evolutionarily predisposed” to ant and termite eating. Above: A mammal phylogeny with colors depicting the diet of living species and their ancestors; silhouettes of myrmecophagous mammals surround the tree. An inset diagram in the upper right illustrates transitions between dietary states. Credit: Vida, Calamari, \u0026 Barden/NJIT All myrmecophages traced back to ancestors that were either insectivores or carnivores, with insectivorous species making the leap about three times more often than their carnivorous counterparts. While some families within the main mammal groups lack ant- or termite-eaters, others like Carnivora (the family including dogs, bears and weasels) account for about a quarter of all origins. “That was a surprise. Making the leap from eating other vertebrates to consuming thousands of tiny insects daily is a major shift,” Barden said. “Part of the predisposition may lie in certain physiological features or dentition that are more malleable for handling a social insect diet.” However, the study also showed that myrmecophagous mammals almost never switch back to a more conventional diet, or diversify, once they make the evolutionary leap. The elephant shrew genus Macroscelides was the lone exception, hopping diets to omnivory after becoming one of the first adopters of myrmecophagy during the Eocene. Beyond this rare reversal, myrmecophagous lineages remain limited — eight of the twelve origins are represented by just a single species. For now, Barden says the bold strategy of embracing myrmecophagy, and not looking back, could put these species at risk of an evolutionary dead end. Yet at present, they stand as success stories in specialization and may even hold an advantage. “In some ways, specializing on ants and termites paints a species into a corner,” Barden said. “But as long as social insects dominate the world’s biomass, these mammals may have an edge — especially as climate change seems to favor species with massive colonies, like fire ants and other invasive social insects.”",
  "image": "https://news.njit.edu/sites/news/files/iStock-1295353878.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n  \n          \u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003eA \u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003efirst-of-its-kind\u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003e study traces the rise of ant- and termite-eaters, revealing how mammals \u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003ereturned\u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003e to the evolutionary table\u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e \u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003e—\u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003e at least\u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003e a dozen times\u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e \u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003e—\u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e \u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003eto \u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003ehone traits\u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003e for feasting on the social insect \u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003ebonanza\u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003e that exploded \u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003eafter the extinction of the dinosaurs\u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003ci\u003e\u003cspan\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/span\u003e\u003c/i\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003eMammals have developed some unusual eating habits over the past 100 million years, but a new study has uncovered the surprising lengths some have gone to satisfy one of the more peculiar — a taste for ants and termites.\u003c/p\u003e\n\n\u003cp\u003eFindings \u003ca href=\"https://doi.org/10.1093/evolut/qpaf121\"\u003epublished\u003c/a\u003e in \u003cem\u003eEvolution\u003c/em\u003e reveal that mammals independently evolved specialized adaptations for exclusively feeding on ants and termites at least 12 times since the Cenozoic era began, roughly 66 million years ago.\u003c/p\u003e\n\n\u003cp\u003eResearchers say the convergent evolution among mammals toward this dietary strategy — called myrmecophagy — emerged following the K-Pg extinction and fall of non-avian dinosaurs, which reshaped ecosystems and set the stage for ant and termite colonies to rapidly expand worldwide, driving extreme shifts in feeding modes for certain species.\u003c/p\u003e\n\n\u003cp\u003e“There’s not been an investigation into how this dramatic diet evolved across all known mammal species until now,” said Phillip Barden, the study’s corresponding author and associate professor of biology at New Jersey Institute of Technology (NJIT). “This work gives us the first real roadmap, and what really stands out is just how powerful a selective force ants and termites have been over the last 50 million years — shaping environments and literally changing the face of entire species.”\u003c/p\u003e\n\n\u003cp\u003eOver 200 mammal species are known to eat ants and termites today, yet only about 20 true myrmecophages — such asgiant anteaters, aardvarks and pangolins — have evolved traits like long sticky tongues, specialized claws and stomachs, and reduced or missing teeth, to efficiently consume thousands of these insects daily as their sole food source.\u003c/p\u003e\n\n\u003cp\u003eTo understand how often and when mammals evolved such traits, the team compiled dietary data for 4,099 mammal species, drawing from nearly a century of natural history records, conservation reports, taxonomic descriptions and dietary datasets.\u003c/p\u003e\n\n\u003cp\u003e“Compiling dietary data for nearly every living mammal was daunting, but it really illuminates the sheer diversity of diets and ecologies in the mammalian world,” said Thomas Vida, co-corresponding author of the study and University of Bonn researcher who led the study’s literature review of more than 600 published sources. “We see fruit-eating foxes, krill-eating seals and sap-drinking primates, but few rely exclusively on ants and termites … the ecomorphological adaptations required are such a major barrier.\u003c/p\u003e\n\n\u003cp\u003e“One thing myrmecophages share is an almost insatiable appetite — ants and termites are so low in energy that even a small animal like the numbat must eat about 20,000 termites a day, while an aardwolf can hunt up to 300,000 in a single night.”\u003c/p\u003e\n\n\u003cp\u003eSpecies were sorted into five dietary groups — from strict ant- and termite-eaters (“obligate myrmecophages”) to general insectivores, carnivores, omnivores, and herbivores — based on published gut analyses and field observations.\u003c/p\u003e\n\n\u003cp\u003eThe team then mapped these groups onto a time-calibrated mammal family tree and used statistical models to reconstruct ancestral diets, uncovering at least 12 independent origins of obligate myrmecophagy across diverse lineages.\u003c/p\u003e\n\n\u003cp\u003eThe researchers also traced ant and termite colony sizes back to the Cretaceous, about 145 million years ago, to understand when these insects became a reliable, year-round food source.\u003c/p\u003e\n\n\u003cp\u003eToday, ants and termites number over 15,000 species with a combined biomass exceeding all living wild mammals, but in the Cretaceous, they made up less than 1% of insects on Earth. Numbers did not reach modern levels until the Miocene ~23 million years ago, when they rose to 35% of all insect specimens, Barden says.\u003c/p\u003e\n\n\u003cp\u003e“It’s not clear exactly why ants and termites both took off around the same time. Some work has implicated the rise of flowering plants, along with some of the planet’s warmest temperatures during the Paleocene-Eocene Thermal Maximum about 55 million years ago,” Barden explained. “What is clear is that their sheer biomass set off a cascade of evolutionary responses across plants and animals.”\u003c/p\u003e\n\n\u003cp\u003e“While some species evolved defenses to avoid these insects, others took the opposite approach — if you can’t beat them, eat them.”\u003c/p\u003e\n\n\u003cp\u003eUltimately, the analysis revealed that myrmecophagy evolved at least once in each major mammal group — monotremes, marsupials and placentals — but unevenly, suggesting some lineages were more “evolutionarily predisposed” to ant and termite eating.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eAbove:\u003c/strong\u003e \u003cem\u003eA mammal phylogeny with colors depicting the diet of living species and their ancestors; silhouettes of myrmecophagous mammals surround the tree. An inset diagram in the upper right illustrates transitions between dietary states. \u003c/em\u003e\u003cstrong\u003eCredit:\u003c/strong\u003e Vida, Calamari, \u0026amp; Barden/NJIT\u003c/p\u003e\n\n\u003cp\u003eAll myrmecophages traced back to ancestors that were either insectivores or carnivores, with insectivorous species making the leap about three times more often than their carnivorous counterparts.\u003c/p\u003e\n\n\u003cp\u003eWhile some families within the main mammal groups lack ant- or termite-eaters, others like Carnivora (the family including dogs, bears and weasels) account for about a quarter of all origins.\u003c/p\u003e\n\n\u003cp\u003e“That was a surprise. Making the leap from eating other vertebrates to consuming thousands of tiny insects daily is a major shift,” Barden said. “Part of the predisposition may lie in certain physiological features or dentition that are more malleable for handling a social insect diet.”\u003c/p\u003e\n\n\u003cp\u003eHowever, the study also showed that myrmecophagous mammals almost never switch back to a more conventional diet, or diversify, once they make the evolutionary leap.\u003c/p\u003e\n\n\u003cp\u003eThe elephant shrew genus \u003cem\u003eMacroscelides\u003c/em\u003e was the lone exception, hopping diets to omnivory after becoming one of the first adopters of myrmecophagy during the Eocene.\u003c/p\u003e\n\n\u003cp\u003eBeyond this rare reversal, myrmecophagous lineages remain limited — eight of the twelve origins are represented by just a single species.\u003c/p\u003e\n\n\u003cp\u003eFor now, Barden says the bold strategy of embracing myrmecophagy, and not looking back, could put these species at risk of an evolutionary dead end. Yet at present, they stand as success stories in specialization and may even hold an advantage.\u003c/p\u003e\n\n\u003cp\u003e“In some ways, specializing on ants and termites paints a species into a corner,” Barden said. “But as long as social insects dominate the world’s biomass, these mammals may have an edge — especially as climate change seems to favor species with massive colonies, like fire ants and other invasive social insects.”\u003c/p\u003e\n    \n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": null,
  "modifiedTime": null
}
