{
  "id": "de6d8fc2-d81c-42d9-8af9-aac6cffbe971",
  "title": "‘Gradually then suddenly’: Is AI job displacement following this pattern?",
  "link": "https://venturebeat.com/ai/gradually-then-suddenly-is-ai-job-displacement-following-this-pattern/",
  "description": "Many technological shifts have coincided with economic downturns. Will 2025 be the year AI not only augments jobs but starts to replace them?",
  "author": "Gary Grossman, Edelman",
  "published": "Sun, 23 Mar 2025 20:15:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "DataDecisionMakers",
    "AI jobs",
    "AI, ML and Deep Learning",
    "category-/Business \u0026 Industrial",
    "Conversational AI",
    "Generative AI",
    "large language models",
    "NLP"
  ],
  "byline": "Gary Grossman, Edelman",
  "length": 9889,
  "excerpt": "Many technological shifts have coincided with economic downturns. Will 2025 be the year AI not only augments jobs but starts to replace them?",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More Whether by automating tasks, serving as copilots or generating text, images, video and software from plain English, AI is rapidly altering how we work. Yet, for all the talk about AI revolutionizing jobs, widespread workforce displacement has yet to happen.  It seems likely that this could be the lull before the storm. According to a recent World Economic Forum (WEF) survey, 40% of employers anticipate reducing their workforce between 2025 and 2030 in areas wherever AI can automate tasks. This statistic dovetails well with earlier predictions. For example, Goldman Sachs said in a research report two years ago that “generative AI could expose the equivalent of 300 million full-time jobs to automation leading to “significant disruption” in the labor market.  According to the International Monetary Fund (IMF) “almost 40% of global employment is exposed to AI.” Brookings said last fall in another report that “more than 30% of all workers could see at least 50% of their occupation’s tasks disrupted by gen AI.” Several years ago, Kai-Fu Lee, one of the world’s foremost AI experts, said in a 60 Minutes interview that AI could displace 40% of global jobs within 15 years. If AI is such a disruptive force, why aren’t we seeing large layoffs? Some have questioned those predictions, especially as job displacement from AI so far appears negligible. For example, an October 2024 Challenger Report that tracks job cuts said that in the 17 months between May 2023 and September 2024, fewer than 17,000 jobs in the U.S. had been lost due to AI.   On the surface, this contradicts the dire warnings. But does it? Or does it suggest that we are still in a gradual phase before a possible sudden shift? History shows that technology-driven change does not always happen in a steady, linear fashion. Rather, it builds up over time until a sudden shift reshapes the landscape. In a recent Hidden Brain podcast on inflection points, researcher Rita McGrath of Columbia University referenced Ernest Hemingway’s 1926 novel The Sun Also Rises. When one character was asked how they went bankrupt, they answered: “Two ways. Gradually, then suddenly.” This could be an allegory for the impact of AI on jobs. This pattern of change — slow and nearly imperceptible at first, then suddenly undeniable — has been experienced across business, technology and society. Malcolm Gladwell calls this a “tipping point,” or the moment when a trend reaches critical mass, then dramatically accelerates.  In cybernetics — the study of complex natural and social systems — a tipping point can occur when recent technology becomes so widespread that it fundamentally changes the way people live and work. In such scenarios, the change becomes self-reinforcing. This often happens when innovation and economic incentives align, making change inevitable. Gradually, then suddenly While employment impacts from AI are (so far) nascent, that is not true of AI adoption. In a new survey by McKinsey, 78% of respondents said their organizations use AI in at least one business function, up more than 40% from 2023. Other research found that 74% of enterprise C-suite executives are now more confident in AI for business advice than colleagues or friends. The research also revealed that 38% trust AI to make business decisions for them, while 44% defer to AI reasoning over their own insights.  It is not only business executives who are increasing their use of AI tools. A new chart from the investment firm Evercore depicts increased use among all age groups over the last 9 months, regardless of application.  Source: Business Insider This data reveals both broad and growing adoption of AI tools. However, true enterprise AI integration remains in its infancy — just 1% of executives describe their gen AI rollouts as mature, according to another McKinsey survey. This suggests that while AI adoption is surging, companies have yet to fully integrate it into core operations in a way that might displace jobs at scale. But that could change quickly. If economic pressures intensify, businesses may not have the luxury of gradual AI adoption and may feel the need to automate fast. Canary in the coal mine One of the first job categories likely to be hit by AI is software development. Numerous AI tools based on large language models (LLMs) exist to augment programming, and soon the function could be entirely automated. Anthropic CEO Dario Amodei said recently on Reddit that “we’re 3 to 6 months from a world where AI is writing 90% of the code. And then in 12 months, we may be in a world where AI is writing essentially all of the code.” Source: Reddit This trend is becoming clear, as evidenced by startups in the winter 2025 cohort of incubator Y Combinator. Managing partner Jared Friedman said that 25% of this startup batch have 95% of their codebases generated by AI. He added: “A year ago, [the companies] would have built their product from scratch — but now 95% of it is built by an AI.”  The LLMs underlying code generation, such as Claude, Gemini, Grok, Llama and ChatGPT, are all advancing rapidly and increasingly perform well on an array of quantitative benchmark tests. For example, reasoning model o3 from OpenAI missed only one question on the 2024 American Invitational Mathematics Exam, scoring 97.7%, and achieved 87.7% on GPQA Diamond, which has graduate-level biology, physics and chemistry questions. Even more striking is a qualitative impression of the new GPT 4.5, as described in a Confluence post. GPT 4.5 correctly answered a broad and vague prompt that other models could not. This might not seem remarkable, but the authors noted: “This insignificant exchange was the first conversation with an LLM where we walked away thinking, ‘Now that feels like general intelligence.’” Did OpenAI just cross a threshold with GPT 4.5? Tipping points While software engineering may be among the first knowledge-worker professions to face widespread AI automation, it will not be the last. Many other white-collar jobs covering research, customer service and financial analysis are similarly exposed to AI-driven disruption.  What might prompt a sudden shift in workplace adoption of AI? History shows that economic recessions often accelerate technological adoption, and the next downturn may be the tipping point when AI’s impact on jobs shifts from gradual to sudden.  During economic downturns, businesses face pressure to cut costs and improve efficiency, making automation more attractive. Labor becomes more expensive compared to technology investments, especially when companies need to do more with fewer human resources. This phenomenon is sometimes called “forced productivity.” As an example, the Great Recession of 2007 to 2009 saw significant advances in automation, cloud computing and digital platforms. If a recession materializes in 2025 or 2026, companies facing pressure to reduce headcount may well turn to AI technologies, particularly tools and processes based on LLMs, as a strategy to support efficiency and productivity with fewer people. This could be even more pronounced — and more sudden — given business worries about falling behind in AI adoption. Will there be a recession in 2025? It is always difficult to tell when a recession will occur. J.P. Morgan’s chief economist recently estimated a 40% chance. Former Treasury Secretary Larry Summers said it could be around 50%. The betting markets are aligned with these views, predicting a greater than 40% probability that a recession will occur in 2025.  Source: Polymarket If a recession does occur later in 2025, it could indeed be characterized as an “AI recession.” However, AI itself will not be the cause. Instead, economic necessity could force companies to accelerate automation decisions. This would not be a technological inevitability, but a strategic response to financial pressure.    The extent of AI’s impact will depend on several factors, including the pace of technological sophistication and integration, the effectiveness of workforce retraining programs and the adaptability of businesses and employees to an evolving landscape.  Whenever it occurs, the next recession may not just lead to temporary job losses. Companies that have been experimenting with AI or adopting it in limited deployments may suddenly find automation not optional, but essential for survival. If such a scenario happens, it may signal a permanent shift toward a more AI-driven workforce.  As Salesforce CEO Marc Benioff put it in a recent earnings call: “We’re the last generation of CEOs to only manage humans. Every CEO going forward is going to manage humans and agents together. I know that’s what I’m doing. … You can see it also in the global economy. I think productivity is going to rise without additions to more human labor, which is good because human labor is not increasing in the global workforce.” Many of history’s biggest technological shifts have coincided with economic downturns. AI may be next. The only question left is: Will 2025 be the year AI not only augments jobs but begins to replace them? Gradually, then suddenly. Gary Grossman is EVP of technology practice at Edelman and global lead of the Edelman AI Center of Excellence.  Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/03/image1_33685a.png?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. \u003ca href=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\" data-type=\"link\" data-id=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\"\u003eLearn More\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003eWhether by automating tasks, serving as copilots or generating text, images, video and software from plain English, \u003ca href=\"https://venturebeat.com/ai/launching-your-first-ai-project-with-a-grain-of-rice-weighing-reach-impact-confidence-and-effort-to-create-your-roadmap/\"\u003eAI is rapidly altering\u003c/a\u003e how we work. Yet, for all the talk about AI revolutionizing jobs, widespread workforce displacement has yet to happen. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt seems likely that this could be the lull before the storm. According to a recent World Economic Forum (WEF) \u003ca href=\"https://reports.weforum.org/docs/WEF_Future_of_Jobs_Report_2025.pdf\" target=\"_blank\" rel=\"noreferrer noopener\"\u003esurvey\u003c/a\u003e, 40% of employers anticipate reducing their workforce between 2025 and 2030 in areas wherever AI can automate tasks. This statistic dovetails well with earlier predictions. For example, Goldman Sachs said in a \u003ca href=\"https://www.key4biz.it/wp-content/uploads/2023/03/Global-Economics-Analyst_-The-Potentially-Large-Effects-of-Artificial-Intelligence-on-Economic-Growth-Briggs_Kodnani.pdf\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eresearch report\u003c/a\u003e two years ago that “generative AI could expose the equivalent of 300 million full-time jobs to automation leading to “significant disruption” in the labor market. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.imf.org/en/Blogs/Articles/2024/01/14/ai-will-transform-the-global-economy-lets-make-sure-it-benefits-humanity\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAccording\u003c/a\u003e to the International Monetary Fund (IMF) “almost 40% of global employment is exposed to AI.” Brookings said last fall in another \u003ca href=\"https://www.brookings.edu/articles/generative-ai-the-american-worker-and-the-future-of-work/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ereport\u003c/a\u003e that “more than 30% of all workers could see at least 50% of their occupation’s tasks disrupted by gen AI.” Several years ago, Kai-Fu Lee, one of the world’s foremost AI experts, said in a 60 Minutes \u003ca href=\"https://www.cbsnews.com/news/venture-capitalist-kai-fu-lee-ai-will-displace-40-percent-of-worlds-jobs-in-as-soon-as-15-years-60-minutes/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003einterview\u003c/a\u003e that AI could displace 40% of global jobs within 15 years.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-if-ai-is-such-a-disruptive-force-why-aren-t-we-seeing-large-layoffs\"\u003eIf AI is such a disruptive force, why aren’t we seeing large layoffs?\u003c/h2\u003e\n\n\n\n\u003cp\u003eSome have questioned those predictions, especially as job displacement from AI so far appears negligible. For example, an October 2024 \u003ca href=\"https://www.challengergray.com/blog/job-cuts-flat-in-september-2024-from-august-ytd-surpasses-2023/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eChallenger Report\u003c/a\u003e that tracks job cuts said that in the 17 months between May 2023 and September 2024, fewer than 17,000 jobs in the U.S. had been lost due to AI.  \u003c/p\u003e\n\n\n\n\u003cp\u003eOn the surface, this contradicts the dire warnings. But does it? Or does it suggest that we are still in a gradual phase before a possible sudden shift? History shows that technology-driven change does not always happen in a steady, linear fashion. Rather, it builds up over time until a sudden shift reshapes the landscape.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn a recent \u003cem\u003eHidden Brain\u003c/em\u003e \u003ca href=\"https://hiddenbrain.org/podcast/when-to-pivot/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003epodcast\u003c/a\u003e on inflection points, researcher \u003ca href=\"https://business.columbia.edu/staff/people/rita-mcgrath\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRita McGrath\u003c/a\u003e of Columbia University referenced Ernest Hemingway’s 1926 novel \u003cem\u003eThe Sun Also Rises\u003c/em\u003e. When one character was asked how they went bankrupt, they answered: “Two ways. Gradually, then suddenly.” This could be an allegory for the impact of AI on jobs.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis pattern of change — slow and nearly imperceptible at first, then suddenly undeniable — has been experienced across business, technology and society. Malcolm Gladwell calls this a “\u003ca href=\"https://www.hachettebookgroup.com/titles/malcolm-gladwell/the-tipping-point/9780759574731/?lens=little-brown#:~:text=The%20tipping%20point%20is%20that,selling%20products%20and%20disseminating%20ideas.\" target=\"_blank\" rel=\"noreferrer noopener\"\u003etipping point\u003c/a\u003e,” or the moment when a trend reaches critical mass, then dramatically accelerates. \u003c/p\u003e\n\n\n\n\u003cp\u003eIn cybernetics — the study of complex natural and social systems — a tipping point can occur when recent technology becomes so widespread that it fundamentally changes the way people live and work. In such scenarios, the change becomes self-reinforcing. This often happens when innovation and economic incentives align, making change inevitable.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-gradually-then-suddenly\"\u003eGradually, then suddenly\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhile employment impacts from AI are (so far) nascent, that is not true of \u003ca href=\"https://venturebeat.com/ai/the-open-source-ai-debate-why-selective-transparency-poses-a-serious-risk/\"\u003eAI adoption\u003c/a\u003e. In a new \u003ca href=\"https://www.mckinsey.com/capabilities/quantumblack/our-insights/the-state-of-ai\" target=\"_blank\" rel=\"noreferrer noopener\"\u003esurvey\u003c/a\u003e by McKinsey, 78% of respondents said their organizations use AI in at least one business function, up more than 40% from 2023. Other research found that \u003ca href=\"https://fortune.com/2025/03/12/ceos-asking-ai-business-advice-trust-more-friends-peers-study/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e74% of enterprise C-suite executives\u003c/a\u003e are now more confident in AI for business advice than colleagues or friends. The research also revealed that 38% trust AI to make business decisions for them, while 44% defer to AI reasoning over their own insights. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt is not only business executives who are increasing their use of AI tools. A new chart from the investment firm Evercore depicts increased use among all age groups over the last 9 months, regardless of application. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1878\" height=\"1370\" src=\"https://venturebeat.com/wp-content/uploads/2025/03/upscalemedia-transformed_354386.jpeg?w=800\" alt=\"\" srcset=\"https://venturebeat.com/wp-content/uploads/2025/03/upscalemedia-transformed_354386.jpeg 1878w, https://venturebeat.com/wp-content/uploads/2025/03/upscalemedia-transformed_354386.jpeg?resize=300,219 300w, https://venturebeat.com/wp-content/uploads/2025/03/upscalemedia-transformed_354386.jpeg?resize=768,560 768w, https://venturebeat.com/wp-content/uploads/2025/03/upscalemedia-transformed_354386.jpeg?resize=800,584 800w, https://venturebeat.com/wp-content/uploads/2025/03/upscalemedia-transformed_354386.jpeg?resize=1536,1121 1536w, https://venturebeat.com/wp-content/uploads/2025/03/upscalemedia-transformed_354386.jpeg?resize=400,292 400w, https://venturebeat.com/wp-content/uploads/2025/03/upscalemedia-transformed_354386.jpeg?resize=750,547 750w, https://venturebeat.com/wp-content/uploads/2025/03/upscalemedia-transformed_354386.jpeg?resize=578,422 578w, https://venturebeat.com/wp-content/uploads/2025/03/upscalemedia-transformed_354386.jpeg?resize=930,678 930w\" sizes=\"(max-width: 1878px) 100vw, 1878px\"/\u003e\u003cfigcaption\u003e\u003cem\u003eSource: \u003ca href=\"https://www.businessinsider.com/chatgpt-sam-altman-openai-apple-google-search-2025-3\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBusiness Insider\u003c/a\u003e \u003c/em\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThis data reveals both broad and growing adoption of AI tools. However, true enterprise AI integration remains in its infancy — just 1% of executives describe their gen AI rollouts as mature, according to another McKinsey \u003ca href=\"https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/superagency-in-the-workplace-empowering-people-to-unlock-ais-full-potential-at-work\" target=\"_blank\" rel=\"noreferrer noopener\"\u003esurvey\u003c/a\u003e. This suggests that while AI adoption is surging, companies have yet to fully integrate it into core operations in a way that might displace jobs at scale. But that could change quickly. If economic pressures intensify, businesses may not have the luxury of gradual AI adoption and may feel the need to automate fast.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-canary-in-the-coal-mine\"\u003eCanary in the coal mine\u003c/h2\u003e\n\n\n\n\u003cp\u003eOne of the first job categories likely to be hit by AI is software development. Numerous AI tools based on large language models (LLMs) exist to augment programming, and soon the function could be entirely automated. Anthropic CEO Dario Amodei \u003ca href=\"https://www.windowscentral.com/software-apps/work-productivity/anthropic-ceo-dario-amodei-says-ai-will-write-90-percent-of-code-in-6-months\" target=\"_blank\" rel=\"noreferrer noopener\"\u003esaid\u003c/a\u003e recently on Reddit that “we’re 3 to 6 months from a world where AI is writing 90% of the code. And then in 12 months, we may be in a world where AI is writing essentially all of the code.\u003cem\u003e”\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"889\" height=\"669\" src=\"https://venturebeat.com/wp-content/uploads/2025/03/image2_c56839.jpg?w=797\" alt=\"\" srcset=\"https://venturebeat.com/wp-content/uploads/2025/03/image2_c56839.jpg 889w, https://venturebeat.com/wp-content/uploads/2025/03/image2_c56839.jpg?resize=300,226 300w, https://venturebeat.com/wp-content/uploads/2025/03/image2_c56839.jpg?resize=768,578 768w, https://venturebeat.com/wp-content/uploads/2025/03/image2_c56839.jpg?resize=797,600 797w, https://venturebeat.com/wp-content/uploads/2025/03/image2_c56839.jpg?resize=400,301 400w, https://venturebeat.com/wp-content/uploads/2025/03/image2_c56839.jpg?resize=750,564 750w, https://venturebeat.com/wp-content/uploads/2025/03/image2_c56839.jpg?resize=578,435 578w\" sizes=\"(max-width: 889px) 100vw, 889px\"/\u003e\u003cfigcaption\u003e\u003cem\u003eSource: \u003ca href=\"https://www.reddit.com/r/singularity/comments/1j8q3qi/anthropic_ceo_dario_amodei_in_the_next_3_to_6/?\u0026amp;rdt=60159\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eReddit\u003c/a\u003e\u003c/em\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThis trend is becoming clear, as evidenced by startups in the winter 2025 cohort of incubator \u003ca href=\"https://www.ycombinator.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eY Combinator\u003c/a\u003e. Managing partner Jared Friedman said that \u003ca href=\"https://youtu.be/IACHfKmZMr8\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e25% of this startup batch\u003c/a\u003e have 95% of their codebases generated by AI. He added: “A year ago, [the companies] would have built their product from scratch — but now 95% of it is built by an AI.” \u003c/p\u003e\n\n\n\n\u003cp\u003eThe LLMs underlying code generation, such as Claude, Gemini, Grok, Llama and ChatGPT, are all advancing rapidly and increasingly perform well on an array of quantitative benchmark tests. For example, \u003ca href=\"https://venturebeat.com/ai/inching-towards-agi-how-reasoning-and-deep-research-are-expanding-ai-from-statistical-prediction-to-structured-problem-solving/\"\u003ereasoning model\u003c/a\u003e o3 from OpenAI missed only one question on the 2024 American Invitational Mathematics Exam, scoring 97.7%, and achieved 87.7% on GPQA Diamond, which has graduate-level biology, physics and chemistry questions.\u003c/p\u003e\n\n\n\n\u003cp\u003eEven more striking is a qualitative impression of the new GPT 4.5, as described in a \u003ca href=\"https://craai.substack.com/p/confluence-for-392025\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eConfluence\u003c/a\u003e post. GPT 4.5 correctly answered a broad and vague prompt that other models could not. This might not seem remarkable, but the authors noted: “This insignificant exchange was the first conversation with an LLM where we walked away thinking, ‘Now \u003cem\u003ethat\u003c/em\u003e feels like general intelligence.’” Did OpenAI just cross a threshold with GPT 4.5?\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-tipping-points\"\u003eTipping points\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhile software engineering may be among the first knowledge-worker professions to face widespread AI automation, it will not be the last. Many other white-collar jobs covering research, customer service and financial analysis are similarly exposed to AI-driven disruption. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhat might prompt a sudden shift in workplace adoption of AI? History shows that economic recessions often accelerate technological adoption, and the next downturn may be the tipping point when AI’s impact on jobs shifts from gradual to sudden. \u003c/p\u003e\n\n\n\n\u003cp\u003eDuring economic downturns, businesses face pressure to cut costs and improve efficiency, making automation more attractive. Labor becomes more expensive compared to technology investments, especially when companies need to do more with fewer human resources. This phenomenon is sometimes called “forced productivity.” As an example, the Great Recession of 2007 to 2009 saw significant advances in automation, cloud computing and digital platforms.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf a recession materializes in 2025 or 2026, companies facing pressure to reduce headcount may well turn to AI technologies, particularly tools and processes based on LLMs, as a strategy to support efficiency and productivity with fewer people. This could be even more pronounced — and more sudden — given business worries about falling behind in AI adoption.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-will-there-be-a-recession-in-2025\"\u003eWill there be a recession in 2025?\u003c/h2\u003e\n\n\n\n\u003cp\u003eIt is always difficult to tell when a recession will occur. J.P. Morgan’s chief economist recently \u003ca href=\"https://www.yahoo.com/news/j-p-morgan-economist-sees-072220872.html\"\u003eestimated\u003c/a\u003e a 40% chance. Former Treasury Secretary Larry Summers said it could be around 50%. The betting markets are aligned with these views, predicting a greater than 40% probability that a recession will occur in 2025. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"970\" height=\"393\" src=\"https://venturebeat.com/wp-content/uploads/2025/03/image4.jpg?w=800\" alt=\"\" srcset=\"https://venturebeat.com/wp-content/uploads/2025/03/image4.jpg 970w, https://venturebeat.com/wp-content/uploads/2025/03/image4.jpg?resize=300,122 300w, https://venturebeat.com/wp-content/uploads/2025/03/image4.jpg?resize=768,311 768w, https://venturebeat.com/wp-content/uploads/2025/03/image4.jpg?resize=800,324 800w, https://venturebeat.com/wp-content/uploads/2025/03/image4.jpg?resize=400,162 400w, https://venturebeat.com/wp-content/uploads/2025/03/image4.jpg?resize=750,304 750w, https://venturebeat.com/wp-content/uploads/2025/03/image4.jpg?resize=578,234 578w, https://venturebeat.com/wp-content/uploads/2025/03/image4.jpg?resize=930,377 930w\" sizes=\"(max-width: 970px) 100vw, 970px\"/\u003e\u003cfigcaption\u003e\u003cem\u003eSource: \u003ca href=\"https://polymarket.com/event/us-recession-in-2025\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePolymarket\u003c/a\u003e\u003c/em\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIf a recession does occur later in 2025, it could indeed be characterized as an “AI recession.” However, AI itself will not be the cause. Instead, economic necessity could force companies to accelerate automation decisions. This would not be a technological inevitability, but a strategic response to financial pressure.   \u003c/p\u003e\n\n\n\n\u003cp\u003eThe extent of AI’s impact will depend on several factors, including the pace of technological sophistication and integration, the effectiveness of workforce retraining programs and the adaptability of businesses and employees to an evolving landscape. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhenever it occurs, the next recession may not just lead to temporary job losses. Companies that have been experimenting with AI or adopting it in limited deployments may suddenly find automation not optional, but essential for survival. If such a scenario happens, it may signal a permanent shift toward a more AI-driven workforce. \u003c/p\u003e\n\n\n\n\u003cp\u003eAs Salesforce CEO Marc Benioff put it in a \u003ca href=\"https://www.crn.com/news/ai/2025/salesforce-q4-2025-earnings-ceo-benioff-dismisses-saas-danger-from-agentic-ai\" target=\"_blank\" rel=\"noreferrer noopener\"\u003erecent earnings\u003c/a\u003e call: “We’re the last generation of CEOs to only manage humans. Every CEO going forward is going to manage humans and agents together. I know that’s what I’m doing. … You can see it also in the global economy. I think productivity is going to rise without additions to more human labor, which is good because human labor is not increasing in the global workforce.”\u003c/p\u003e\n\n\n\n\u003cp\u003eMany of history’s biggest technological shifts have coincided with economic downturns. AI may be next. The only question left is: Will 2025 be the year AI not only augments jobs but begins to replace them?\u003c/p\u003e\n\n\n\n\u003cp\u003eGradually, then suddenly.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eGary Grossman is EVP of technology practice at \u003ca href=\"https://www.edelman.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eEdelman\u003c/a\u003e and global lead of the Edelman AI Center of Excellence. \u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://venturebeat.com/wp-content/themes/vb-news/brand/img/vb-daily-phone.png\" alt=\"\"/\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-03-23T20:15:00Z",
  "modifiedTime": "2025-03-23T16:17:37Z"
}
