{
  "id": "e2a8d8e1-ca4c-4aab-a631-4227fd901e5d",
  "title": "From AI agent hype to practicality: Why enterprises must consider fit over flash",
  "link": "https://venturebeat.com/ai/from-ai-agent-hype-to-practicality-why-enterprises-must-consider-fit-over-flash/",
  "description": "How do we cut through the hype and understand what AI agents can truly accomplish and, more importantly, how we should use them?",
  "author": "Brian Evergreen, The Future Solving Company",
  "published": "Sun, 06 Apr 2025 18:55:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "DataDecisionMakers",
    "AI agents",
    "AI, ML and Deep Learning",
    "category-/Business \u0026 Industrial/Business Operations",
    "category-/Science/Computer Science",
    "Conversational AI",
    "Generative AI",
    "large language models",
    "NLP"
  ],
  "byline": "Brian Evergreen, The Future Solving Company",
  "length": 6661,
  "excerpt": "How do we cut through the hype and understand what AI agents can truly accomplish and, more importantly, how we should use them?",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "April 6, 2025 11:55 AM DALL·E 3 / Prompted by Brian Evergreen. Foreground by Norman Rockwell. Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More As we step fully into the era of autonomous transformation, AI agents are transforming how businesses operate and create value. But with hundreds of vendors claiming to offer “AI agents,” how do we cut through the hype and understand what these systems can truly accomplish and, more importantly, how we should use them? The answer is more complicated than creating a list of tasks that could be automated and testing whether an AI agent can achieve those tasks against benchmarks. A jet can move faster than a car, but it’s the wrong choice for a trip to the grocery store. Why we shouldn’t be trying to replace our work with AI agents Every organization creates a certain amount of value for their customers, partners and employees. This amount is a fraction of the total addressable value creation (that is, the total amount of value the organization is capable of creating that would be welcomed by its customers, partners and employees). If every employee leaves the workday with a long list of to-dos for the next day and another list of to-dos to deprioritize altogether — items that would have created value if they could have been prioritized — there is an imbalance of value, time and effort, leaving value on the table. The easiest place to start with AI agents is looking at the work already being done and the value being created. This makes the initial mental math easy, as you can map the value that already exists and analyze opportunities to create the same value faster or more reliably. There’s nothing wrong with this exercise as a phase in a transformation process, but where most organizations and AI initiatives fail is in only considering how AI can apply to value already being created. This narrows their focus and investments to the narrow overlapping sliver in the Venn diagram below, leaving the majority of the addressable value on the table. Humans and machines inherently have different strengths and weaknesses. Organizations that collaboratively reinvent work with their business, technology and industry partners will outplay those who merely focus on one body of value and endlessly pursue greater degrees of automation without increasing total value output. Understanding AI agent capabilities through the SPAR framework To help explain how AI agents work, we’ve created what we call the SPAR framework: sense, plan, act and reflect. This framework mirrors how humans achieve our own goals and provides a natural way to understand how AI agents operate. Sensing: Just as we use our senses to gather information about the world around us, AI agents collect signals from their environment. They track triggers, gather relevant information and monitor their operating context. Planning: Once an agent has collected signals about its environment, it doesn’t just jump into execution. Like humans considering their options before acting, AI agents are developed to process available information in the context of their objectives and rules to make informed decisions about achieving their goals. Acting: The ability to take concrete action sets AI agents apart from simple analytical systems. They can coordinate multiple tools and systems to execute tasks, monitor their actions in real-time, and make adjustments to stay on course. Reflecting: Perhaps the most sophisticated capability is learning from experience. Advanced AI agents can evaluate their performance, analyze outcomes and refine their approaches based on what works best — creating a continuous improvement cycle. What makes AI agents powerful is how these four capabilities work together in an integrated cycle, creating a system that can pursue complex goals with increasing sophistication. This exploratory capability can be contrasted against existing processes that have already been optimized several times through digital transformation. Their reinvention might yield small short-term gains, but exploring new methods of creating value and making new markets could yield exponential growth. 5 Steps to build your AI agent strategy Most technologists, consultants and business leaders follow a traditional approach when introducing AI (accounting for an 87% failure rate): Create a list of problems; or Examine your data; Pick a set of potential use cases; Analyze use cases for return on investment (ROI), feasibility, cost, timeline; Choose a subset of use cases and invest in execution. This approach may seem defensible because it’s commonly understood to be best practice, but the data shows that it isn’t working. It’s time for a new approach. Map the total addressable value creation your organization could provide to your customers and partners given your core competencies and the regulatory and geopolitical conditions of the market. Assess the current value creation of your organization. Choose the top five most valuable and market-making opportunities for your organization to create new value. Analyze for ROI, feasibility, cost and timeline to engineer AI agent solutions (repeat steps 3 and 4 as necessary). Choose a subset of value cases and invest in execution. Creating new value with AI The journey into the era of autonomous transformation (with more autonomous systems creating value continuously) isn’t a sprint — it’s a strategic progression, building organizational capability alongside technological advancement. By initially identifying value and growing ambitions methodically, you’ll position your organization to thrive in the era of AI agents. Brian Evergreen is the author of Autonomous Transformation: Creating a More Human Future in the Era of Artificial Intelligence  Pascal Bornet is the author of Agentic Artificial Intelligence: Harnessing AI Agents to Reinvent Business, Work and Life Evergreen and Bornet are teaching a new online course on AI agents with Cassie Kozyrkov: Agentic Artificial Intelligence for Leaders Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/04/upscalemedia-transformed_5d8055.png?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2025-04-06T18:55:00+00:00\" datetime=\"2025-04-06T18:55:00+00:00\"\u003eApril 6, 2025 11:55 AM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"400\" height=\"225\" src=\"https://venturebeat.com/wp-content/uploads/2025/04/upscalemedia-transformed_5d8055.png?w=400\" alt=\"DALL·E 3 / Prompted by Brian Evergreen. Foreground by Norman Rockwell. \"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eDALL·E 3 / Prompted by Brian Evergreen. Foreground by Norman Rockwell. \u003c/span\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. \u003ca href=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\" data-type=\"link\" data-id=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\"\u003eLearn More\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003eAs we step fully into the era of autonomous transformation, \u003ca href=\"https://venturebeat.com/ai/why-businesses-judge-ai-like-humans-and-what-that-means-for-adoption/\"\u003eAI agents\u003c/a\u003e are transforming how businesses operate and create value. But with hundreds of vendors claiming to offer “AI agents,” how do we cut through the hype and understand what these systems can truly accomplish and, more importantly, how we should use them?\u003c/p\u003e\n\n\n\n\u003cp\u003eThe answer is more complicated than creating a list of tasks that could be automated and testing whether an AI agent can achieve those tasks against benchmarks. A jet can move faster than a car, but it’s the wrong choice for a trip to the grocery store.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-why-we-shouldn-t-be-trying-to-replace-our-work-with-ai-agents\"\u003eWhy we shouldn’t be trying to replace our work with AI agents\u003c/h2\u003e\n\n\n\n\u003cp\u003eEvery organization creates a certain amount of value for their customers, partners and employees.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis amount is a fraction of the total addressable value creation (that is, the total amount of value the organization is capable of creating that would be welcomed by its customers, partners and employees).\u003c/p\u003e\n\n\n\n\u003cp\u003eIf every employee leaves the workday with a long list of to-dos for the next day and another list of to-dos to deprioritize altogether — items that would have created value if they could have been prioritized — there is an imbalance of value, time and effort, leaving value on the table.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe easiest place to start with \u003ca href=\"https://venturebeat.com/ai/gradually-then-suddenly-is-ai-job-displacement-following-this-pattern/\"\u003eAI agents\u003c/a\u003e is looking at the work already being done and the value being created. This makes the initial mental math easy, as you can map the value that already exists and analyze opportunities to create the same value faster or more reliably.\u003c/p\u003e\n\n\n\n\u003cp\u003eThere’s nothing wrong with this exercise as a phase in a transformation process, but where most organizations and AI initiatives fail is in \u003cem\u003eonly considering\u003c/em\u003e how AI can apply to value already being created. This narrows their focus and investments to the narrow overlapping sliver in the Venn diagram below, leaving the majority of the addressable value on the table.\u003c/p\u003e\n\n\n\n\u003cp\u003eHumans and machines inherently have different strengths and weaknesses. Organizations that collaboratively reinvent work with their business, technology and industry partners will outplay those who merely focus on one body of value and endlessly pursue greater degrees of automation without increasing total value output.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"934\" height=\"934\" src=\"https://venturebeat.com/wp-content/uploads/2025/04/Diagram.gif?w=600\" alt=\"\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-understanding-ai-agent-capabilities-through-the-spar-framework\"\u003eUnderstanding AI agent capabilities through the SPAR framework\u003c/h2\u003e\n\n\n\n\u003cp\u003eTo help explain how \u003ca href=\"https://venturebeat.com/ai/the-open-source-ai-debate-why-selective-transparency-poses-a-serious-risk/\"\u003eAI agents work\u003c/a\u003e, we’ve created what we call the SPAR framework: sense, plan, act and reflect. This framework mirrors how humans achieve our own goals and provides a natural way to understand how AI agents operate.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eSensing\u003c/strong\u003e: Just as we use our senses to gather information about the world around us, AI agents collect signals from their environment. They track triggers, gather relevant information and monitor their operating context.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003ePlanning\u003c/strong\u003e: Once an agent has collected signals about its environment, it doesn’t just jump into execution. Like humans considering their options before acting, AI agents are developed to process available information in the context of their objectives and rules to make informed decisions about achieving their goals.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eActing\u003c/strong\u003e: The ability to take concrete action sets AI agents apart from simple analytical systems. They can coordinate multiple tools and systems to execute tasks, monitor their actions in real-time, and make adjustments to stay on course.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eReflecting\u003c/strong\u003e: Perhaps the most sophisticated capability is learning from experience. Advanced AI agents can evaluate their performance, analyze outcomes and refine their approaches based on what works best — creating a continuous improvement cycle.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhat makes AI agents powerful is how these four capabilities work together in an integrated cycle, creating a system that can pursue complex goals with increasing sophistication.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis exploratory capability can be contrasted against existing processes that have already been optimized several times through digital transformation. Their reinvention might yield small short-term gains, but exploring new methods of creating value and making new markets could yield exponential growth.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-5-steps-to-build-your-ai-agent-strategy\"\u003e5 Steps to build your AI agent strategy\u003c/h2\u003e\n\n\n\n\u003cp\u003eMost technologists, consultants and business leaders follow a traditional approach when introducing AI (accounting for an 87% failure rate):\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eCreate a list of problems;\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eor\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eExamine your data;\u003c/li\u003e\n\n\n\n\u003cli\u003ePick a set of potential use cases;\u003c/li\u003e\n\n\n\n\u003cli\u003eAnalyze use cases for return on investment (ROI), feasibility, cost, timeline;\u003c/li\u003e\n\n\n\n\u003cli\u003eChoose a subset of use cases and invest in execution.\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eThis approach may seem defensible because it’s commonly understood to be best practice, but the data shows that it isn’t working. It’s time for a new approach. \u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eMap the total addressable value creation your organization could provide to your customers and partners given your core competencies and the regulatory and geopolitical conditions of the market.\u003c/li\u003e\n\n\n\n\u003cli\u003eAssess the current value creation of your organization.\u003c/li\u003e\n\n\n\n\u003cli\u003eChoose the top five most valuable and market-making opportunities for your organization to create new value. \u003c/li\u003e\n\n\n\n\u003cli\u003eAnalyze for ROI, feasibility, cost and timeline to engineer AI agent solutions (repeat steps 3 and 4 as necessary).\u003c/li\u003e\n\n\n\n\u003cli\u003eChoose a subset of value cases and invest in execution.\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003ch2 id=\"h-creating-new-value-with-ai\"\u003eCreating new value with AI\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe journey into the era of autonomous transformation (with more autonomous systems creating value continuously) isn’t a sprint — it’s a strategic progression, building organizational capability alongside technological advancement. By initially identifying value and growing ambitions methodically, you’ll position your organization to thrive in the era of AI agents.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eBrian Evergreen is the author of \u003c/em\u003e\u003ca href=\"https://www.amazon.com/Autonomous-Transformation-Creating-Artificial-Intelligence/dp/1119985293\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eAutonomous Transformation: Creating a More Human Future in the Era of Artificial Intelligence\u003c/em\u003e\u003c/a\u003e\u003cem\u003e \u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003ePascal Bornet is the author of \u003c/em\u003e\u003ca href=\"https://www.amazon.com/Agentic-Artificial-Intelligence-Harnessing-Reinvent/dp/B0F1KFKNBB\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eAgentic Artificial Intelligence: Harnessing AI Agents to Reinvent Business, Work and Life\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eEvergreen and Bornet are teaching a new online course on AI agents with Cassie Kozyrkov: \u003c/em\u003e\u003ca href=\"https://maven.com/s/course/73ce6221d4\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eAgentic Artificial Intelligence for Leaders\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-04-06T18:55:00Z",
  "modifiedTime": "2025-04-04T23:01:48Z"
}
