{
  "id": "e3bdaf2f-ecb8-4b62-9424-e9cb1c44464a",
  "title": "LlamaIndex goes beyond RAG so agents can make complex decisions",
  "link": "https://venturebeat.com/ai/llamaindex-goes-beyond-rag-so-agents-can-make-complex-decisions/",
  "description": "A new orchestration architecture from LlamaIndex brings more context and decision-making capabilities to AI agents.",
  "author": "Emilia David",
  "published": "Thu, 09 Jan 2025 22:46:39 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "Business",
    "Agentic AI",
    "AI agents",
    "ai orchestration",
    "AI Orchestration Tools",
    "AI, ML and Deep Learning",
    "category-/Computers \u0026 Electronics",
    "category-/Internet \u0026 Telecom/Mobile \u0026 Wireless",
    "LlamaIndex"
  ],
  "byline": "Emilia David",
  "length": 4165,
  "excerpt": "A new orchestration architecture from LlamaIndex brings more context and decision-making capabilities to AI agents.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "January 9, 2025 2:46 PM Credit: VentureBeat, generated with MidJourney Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More Popular AI orchestration framework LlamaIndex has introduced Agent Document Workflow (ADW) a new architecture that the company says goes beyond retrieval-augmented generation (RAG) processes and increases agent productivity.  As orchestration frameworks continue to improve, this method could offer organizations an option for enhancing agents’ decision-making capabilities.  LlamaIndex says ADW can help agents manage “complex workflows beyond simple extraction or matching.” Some agentic frameworks are based on RAG systems, which provide agents the information they need to complete tasks. However, this method does not allow agents to make decisions based on this information.  LlamaIndex gave some real-world examples of how ADW would work well. For instance, in contract reviews, human analysts must extract key information, cross-reference regulatory requirements, identify potential risks and generate recommendations. When deployed in that workflow, AI agents would ideally follow the same pattern and make decisions based on the documents they read for contract review and knowledge from other documents.  “ADW addresses these challenges by treating documents as part of broader business processes,” LlamaIndex said in a blog post. “An ADW system can maintain state across steps, apply business rules, coordinate different components and take actions based on document content — not just analyze it.”   LlamaIndex has previously said that RAG, while an important technique, remains primitive, particularly for enterprises seeking more robust decision-making capabilities using AI.  Understanding context for decision making LlamaIndex has developed reference architectures combining its LlamaCloud parsing capabilities with agents. It “builds systems that can understand context, maintain state and drive multi-step processes.” To do this, each workflow has a document that acts as an orchestrator. It can direct agents to tap LlamaParse to extract information from data, maintain the state of the document context and process, then retrieve reference material from another knowledge base. From here, the agents can start generating recommendations for the contract review use case or other actionable decisions for different use cases.  “By maintaining state throughout the process, agents can handle complex multi-step workflows that go beyond simple extraction or matching,” the company said. “This approach allows them to build deep context about the documents they’re processing while coordinating between different system components.” Differing agent frameworks Agentic orchestration is an emerging space, and many organizations are still exploring how agents — or multiple agents — work for them. Orchestrating AI agents and applications may become a bigger conversation this year as agents go from single systems to multi-agent ecosystems. AI agents aree an extension of what RAG offers, that is, the ability to find information grounded on enterprise knowledge.  But as more enterprises begin deploying AI agents, they also want them to do many of the tasks human employees do. And, for these more complicated use cases, “vanilla” RAG isn’t enough. One of the advanced approaches enterprises have considered is agentic RAG, which expands agents’ knowledge base. Models can decide if they needs to find more information, which tool to use to get that information and if the context it just fetched is relevant, before coming up with a result.  Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/01/crimedy7_illustration_of_a_llama_inside_a_computer_as_a_charact_c468cf6d-a586-4ee7-8bc5-77c11e0b2faf.png?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2025-01-09T22:46:39+00:00\" datetime=\"2025-01-09T22:46:39+00:00\"\u003eJanuary 9, 2025 2:46 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"420\" src=\"https://venturebeat.com/wp-content/uploads/2025/01/crimedy7_illustration_of_a_llama_inside_a_computer_as_a_charact_c468cf6d-a586-4ee7-8bc5-77c11e0b2faf.png?w=750\" alt=\"Credit: VentureBeat, generated with MidJourney\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCredit: VentureBeat, generated with MidJourney\u003c/span\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. \u003ca href=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\" data-type=\"link\" data-id=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\"\u003eLearn More\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003ePopular AI orchestration framework \u003ca href=\"https://www.llamaindex.ai/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLlamaIndex\u003c/a\u003e has introduced Agent Document Workflow (ADW) a new architecture that the company says goes beyond retrieval-augmented generation (RAG) processes and increases agent productivity. \u003c/p\u003e\n\n\n\n\u003cp\u003eAs orchestration frameworks continue to improve, this method could offer organizations an option for enhancing agents’ decision-making capabilities. \u003c/p\u003e\n\n\n\n\u003cp\u003eLlamaIndex says ADW can help agents manage “complex workflows beyond simple extraction or matching.”\u003c/p\u003e\n\n\n\n\u003cp\u003eSome agentic frameworks are based on RAG systems, which provide agents the information they need to complete tasks. However, this method does not allow agents to make decisions based on this information. \u003c/p\u003e\n\n\n\n\u003cp\u003eLlamaIndex gave some real-world examples of how ADW would work well. For instance, in contract reviews, human analysts must extract key information, cross-reference regulatory requirements, identify potential risks and generate recommendations. When deployed in that workflow, AI agents would ideally follow the same pattern and make decisions based on the documents they read for contract review and knowledge from other documents. \u003c/p\u003e\n\n\n\n\u003cp\u003e“ADW addresses these challenges by treating documents as part of broader business processes,” LlamaIndex said in a \u003ca href=\"https://www.llamaindex.ai/blog/introducing-agentic-document-workflows\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eblog post\u003c/a\u003e. “An ADW system can maintain state across steps, apply business rules, coordinate different components and take actions based on document content — not just analyze it.”  \u003c/p\u003e\n\n\n\n\u003cp\u003eLlamaIndex has previously said that RAG, while an important technique, \u003ca href=\"https://venturebeat.com/ai/how-llamaindex-is-ushering-in-the-future-of-rag-for-enterprises/\"\u003eremains primitive\u003c/a\u003e, particularly for enterprises seeking more robust decision-making capabilities using AI. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-understanding-context-for-decision-making\"\u003eUnderstanding context for decision making\u003c/h2\u003e\n\n\n\n\u003cp\u003eLlamaIndex has developed reference architectures combining its LlamaCloud parsing capabilities with agents. It “builds systems that can understand context, maintain state and drive multi-step processes.”\u003c/p\u003e\n\n\n\n\u003cp\u003eTo do this, each workflow has a document that acts as an orchestrator. It can direct agents to tap LlamaParse to extract information from data, maintain the state of the document context and process, then retrieve reference material from another knowledge base. From here, the agents can start generating recommendations for the contract review use case or other actionable decisions for different use cases. \u003c/p\u003e\n\n\n\n\u003cp\u003e“By maintaining state throughout the process, agents can handle complex multi-step workflows that go beyond simple extraction or matching,” the company said. “This approach allows them to build deep context about the documents they’re processing while coordinating between different system components.” \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-differing-agent-frameworks\"\u003eDiffering agent frameworks\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://venturebeat.com/ai/orchestrator-agents-integration-human-interaction-and-enterprise-knowledge-at-the-core/\"\u003eAgentic orchestration\u003c/a\u003e is an emerging space, and many organizations are still exploring how agents — or multiple agents — work for them. Orchestrating AI agents and applications may become \u003ca href=\"https://venturebeat.com/ai/three-ways-2025-will-be-the-year-of-agentic-productivity/\"\u003ea bigger conversation\u003c/a\u003e this year as agents go from single systems to multi-agent ecosystems.\u003c/p\u003e\n\n\n\n\u003cp\u003eAI agents aree an extension of what RAG offers, that is, the ability to find information grounded on enterprise knowledge. \u003c/p\u003e\n\n\n\n\u003cp\u003eBut as more enterprises begin deploying AI agents, they also want them to do many of the tasks human employees do. And, for these more complicated use cases, “vanilla” RAG isn’t enough. One of the advanced approaches enterprises have considered is \u003ca href=\"https://venturebeat.com/ai/how-agentic-rag-can-be-a-game-changer-for-data-processing-and-retrieval/\"\u003eagentic RAG\u003c/a\u003e, which expands agents’ knowledge base. Models can decide if they needs to find more information, which tool to use to get that information and if the context it just fetched is relevant, before coming up with a result. \u003c/p\u003e\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://venturebeat.com/wp-content/themes/vb-news/brand/img/vb-daily-phone.png\" alt=\"\"/\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-09T22:46:39Z",
  "modifiedTime": "2025-01-09T22:46:45Z"
}
