{
  "id": "f257fc5e-201d-4d7f-bd5b-1768d45be245",
  "title": "The Springwise top 5: mental health innovations",
  "link": "https://springwise.com/innovartion-snapshot/the-top-5-mental-health-innovations/",
  "description": "To mark World Mental Health Day, we’ve picked out some of the most promising recent innovations improving mental wellbeing",
  "author": "Matthew Hempstead",
  "published": "Wed, 09 Oct 2024 08:02:36 +0000",
  "source": "https://www.springwise.com/feed",
  "categories": null,
  "byline": "",
  "length": 7309,
  "excerpt": "To mark World Mental Health Day, we’ve picked out some of the most promising recent innovations improving mental wellbeing",
  "siteName": "Springwise",
  "favicon": "",
  "text": "WHat is WorlD Mental Health Day? Every year, World Mental Health Day is celebrated on the 10th October. Designed to mobilise efforts in support of mental health, the occasion provides an opportunity for people to come together to talk about their mental health with friends, family, peers, and colleagues. Organisations wishing to get involved are invited to sign-up for a tea and talk to raise money and awareness for the Mental Health Foundation. WHAT IS THIS YEAR’S THEME? The theme for this year’s event, set by the World Federation of Mental Health, is workplace mental health. According to the World Health Organization, 15 per cent of working-age adults were estimated to have a mental health disorder in 2019. Meanwhile, depression and anxiety is estimated to cost the global economy $1 trillion in lost productivity – each year. HOW ARE INNOVATORS HELPING TO BOOST MENTAL HEALTH? In response, innovators around the world are developing new tools and solutions to help workplaces and individuals identify, understand, and treat mental health conditions. We’ve delved into our library to uncover five of the most exciting recent examples. Photo source Tyler Franta on Unsplash A platform for workplace wellbeing While there are a range of wellbeing apps and programmes aimed at businesses, few of them combine technology with real-life, human psychologists. Now, Madrid-based emotional wellbeing service Ifeel hopes to fill this gap. The company has developed a digital wellbeing service aimed at helping businesses provide all employees with access to mental health support. The platform allows employees to track their mood and daily activity with exercises and self-care tips. It also provides professional emotional support over chat, as well as regular assessments to help employees manage their symptoms more effectively. As part of its service, Ifeel also provides ongoing online therapy with a human psychologist. The platform has a team of over 600 psychologists trained in different theoretical models. For employers, the service provides feedback through the use of AI and data analytics. This helps give human resources a clearer picture of areas of concern, while maintaining employee confidentiality. Read more Photo source Louis Hansel on Unsplash A wellbeing app tackles mental health issues in the hospitality sector According to one study, self-reported cases of work-related stress, depression, or anxiety in the UK food and accommodation sector surged by 160 per cent between 2010 and 2020.   In response, The Burnt Chef Project has partnered with Thrive – the UK’s approved mental health and wellbeing app – to bring services to hospitality workers. Thrive offers a range of resources designed to help people manage stress and anxiety, and the team at Burnt Chef Project will be on hand to offer support and advice. Thrive is available to businesses on a monthly subscription basis, with over 100 hours of meditation and wellbeing tools. The app also provides employees with unlimited access to clinically supervised therapists who can provide text-based support via an in-app chat function. The service is available in nine different languages and lets users preserve their anonymity. Read more Photo source Psyomics Tech transforms diagnosis of mental health In the UK, like many other countries, waiting lists for mental health care continue to grow, leaving those in need unable to access essential support. Mental healthcare technology company Psyomics is helping to reduce those waiting times by cutting down on the time it takes clinicians to assess and diagnose patients. The company, a spin-out of Cambridge University’s Centre for Neuropsychiatric Research (CCNR), created the Censeo platform for web-based mental health triage and assessment. Censeo uses an algorithm to tailor questions to the individual and ask personalised queries based on recognised criteria, National Institute for Clinical Excellence guidance, and continuous feedback from patients and clinicians. Following trials and its first year of commercial use in 2023, clinician assessments agreed with Censeo’s diagnoses 91 per cent of the time, and healthcare professionals report that using the platform increases their clinical efficiency by up to 50 per cent. Read more Photo source © AndreyPopov from Getty Images via Canva.com AI-powered voice biomarkers for mental health To help medical professionals better administer care, Canary Speech has developed vocal biomarker technology that uses AI to screen for mood, stress, and energy levels using a single 20-second audio clip. Canary’s technology analyses acoustic and linguistic elements in speech to model and screen for mental health and neurological disorders. The technology is language and device-agnostic and includes ambient listening tools. These are designed to unobtrusively capture and analyse conversations in real time. This allows healthcare professionals to focus all of their attention on patient interactions while the system automatically documents clinical notes.  Canary’s platform can analyse speech data within seconds to identify behavioural and cognitive changes earlier than current clinical screening methods, and before noticeable symptoms present themselves, for invisible illnesses like anxiety, depression, and dementia. There are a wide range of applications for this within the healthcare industry, including evaluating callers to helplines, conducting ambient clinical listening, remote patient monitoring, and annual wellness checks. Read more Photo source © Marc Schulte from Pexels via Canva.com Monitoring patients via eye-tracking in neuropsychology Austrian startup SOMAREALITY is seeking to digitise care in order to provide continuous monitoring of a patient’s neuropsychological health. Co-founder Adrian Brodesser told Springwise that “SOMAREALITY is the first company that enables real-time insights into the cognitive state of the user without the need for an EEG. [electroencephalogram].” This reduces the cost of diagnosis and monitoring while improving accessibility. The company has developed digital cognitive biomarkers, based on eye movement, that are tracked and analysed by virtual or augmented reality headsets and smartphones. The eye-tracking technology allows care teams to capture a much broader range of time in their analysis of a patient’s health, and by digitising the data, the startup’s approach makes it much easier to monitor conditions over extended periods. With much of neuropsychology still reliant on pen-and-paper analysis and record keeping, SOMAREALITY sees digitisation as a way to provide more objective measurements as well as ones that are more easily replicable. And providing the technology via smartphone helps care teams provide care to underserved communities in remote locations. Treatments can also be provided digitally and tailored explicitly to the cognitive load and stress individuals are experiencing at the time they seek care. Read more Compiled by: Matthew Hempstead Mental health is a complex issue, and those in need of urgent help can find information about the services available on the United for Global Mental Health website.",
  "image": "https://springwise.com/wp-content/uploads/2024/10/Top-5-Mental-Health-Innovations.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003ch2\u003eWHat is WorlD Mental Health Day?\u003c/h2\u003e\n\n\n\n\u003cp\u003eEvery year, \u003ca href=\"https://www.mentalhealth.org.uk/our-work/public-engagement/world-mental-health-day\"\u003eWorld Mental Health Day\u003c/a\u003e is celebrated on the 10\u003csup\u003eth\u003c/sup\u003e October. Designed to mobilise efforts in support of mental health, the occasion provides an opportunity for people to come together to talk about their mental health with friends, family, peers, and colleagues.\u003c/p\u003e\n\n\n\n\u003cp\u003eOrganisations wishing to get involved are invited to \u003ca href=\"https://www.mentalhealth.org.uk/get-involved/fundraising/do-your-own-fundraising/tea-talk-world-mental-health-day\"\u003esign-up\u003c/a\u003e for a tea and talk to raise money and awareness for the Mental Health Foundation.\u003c/p\u003e\n\n\n\n\u003ch2\u003eWHAT IS THIS YEAR’S THEME?\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe theme for this year’s event, set by the World Federation of Mental Health, is workplace mental health. According to the World Health Organization, \u003ca href=\"https://www.who.int/news-room/fact-sheets/detail/mental-health-at-work\"\u003e15 per cent\u003c/a\u003e of working-age adults were estimated to have a mental health disorder in 2019. Meanwhile, depression and anxiety is estimated to cost the global economy $1 trillion in lost productivity – each year.\u003c/p\u003e\n\n\n\n\u003ch2\u003eHOW ARE INNOVATORS HELPING TO BOOST MENTAL HEALTH?\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn response, innovators around the world are developing new tools and solutions to help workplaces and individuals identify, understand, and treat mental health conditions. We’ve delved into our library to uncover five of the most exciting recent examples.\u003c/p\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003ca href=\"https://springwise.com/innovation/work-lifestyle/a-platform-for-workplace-wellbeing/\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/10/innovationwork-lifestyleA-platform-for-workplace-wellbeing.jpg\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/10/innovationwork-lifestyleA-platform-for-workplace-wellbeing.jpg 1500w, https://springwise.com/wp-content/uploads/2024/10/innovationwork-lifestyleA-platform-for-workplace-wellbeing-300x140.jpg 300w, https://springwise.com/wp-content/uploads/2024/10/innovationwork-lifestyleA-platform-for-workplace-wellbeing-768x357.jpg 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePhoto source \u003ca href=\"https://unsplash.com/photos/iusJ25iYu1c\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eTyler Franta on Unsplash\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003ch4\u003e\u003ca href=\"https://springwise.com/innovation/work-lifestyle/a-platform-for-workplace-wellbeing/\"\u003e\u003cstrong\u003eA platform for workplace wellbeing\u003c/strong\u003e\u003c/a\u003e\u003c/h4\u003e\n\n\n\n\u003cp\u003eWhile there are a range of wellbeing apps and programmes aimed at businesses, few of them combine technology with real-life, human psychologists. Now, Madrid-based emotional wellbeing service Ifeel hopes to fill this gap.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe company has developed a digital wellbeing service aimed at helping businesses provide all employees with access to mental health support. The platform allows employees to track their mood and daily activity with exercises and self-care tips. It also provides professional emotional support over chat, as well as regular assessments to help employees manage their symptoms more effectively.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs part of its service, Ifeel also provides ongoing online therapy with a human psychologist. The platform has a team of over 600 psychologists trained in different theoretical models. For employers, the service provides feedback through the use of AI and data analytics. This helps give human resources a clearer picture of areas of concern, while maintaining employee confidentiality. \u003ca href=\"https://springwise.com/innovation/work-lifestyle/a-platform-for-workplace-wellbeing/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003ca href=\"https://springwise.com/innovation/health-wellbeing/a-mental-health-app-for-the-hospitality-industry/\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/10/innovation_health-wellbeing_a-mental-health-app-for-the-hospitality-industry.jpg\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/10/innovation_health-wellbeing_a-mental-health-app-for-the-hospitality-industry.jpg 1500w, https://springwise.com/wp-content/uploads/2024/10/innovation_health-wellbeing_a-mental-health-app-for-the-hospitality-industry-300x140.jpg 300w, https://springwise.com/wp-content/uploads/2024/10/innovation_health-wellbeing_a-mental-health-app-for-the-hospitality-industry-768x357.jpg 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePhoto source \u003ca href=\"https://unsplash.com/photos/0sYLBZjgTTw\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLouis Hansel on Unsplash\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003ch4\u003e\u003ca href=\"https://springwise.com/innovation/health-wellbeing/a-mental-health-app-for-the-hospitality-industry/\"\u003e\u003cstrong\u003eA wellbeing app tackles mental health issues in the hospitality sector\u003c/strong\u003e\u003c/a\u003e\u003c/h4\u003e\n\n\n\n\u003cp\u003eAccording to one \u003ca href=\"https://www.thecaterer.com/news/saving-industry-brink-mental-health-collapse\"\u003estudy\u003c/a\u003e, self-reported cases of work-related stress, depression, or anxiety in the UK food and accommodation sector surged by 160 per cent between 2010 and 2020.  \u003c/p\u003e\n\n\n\n\u003cp\u003eIn response, The Burnt Chef Project has partnered with Thrive – the UK’s approved mental health and wellbeing app – to bring services to hospitality workers. Thrive offers a range of resources designed to help people manage stress and anxiety, and the team at Burnt Chef Project will be on hand to offer support and advice.\u003c/p\u003e\n\n\n\n\u003cp\u003eThrive is available to businesses on a monthly subscription basis, with over 100 hours of meditation and wellbeing tools. The app also provides employees with unlimited access to clinically supervised therapists who can provide text-based support via an in-app chat function. The service is available in nine different languages and lets users preserve their anonymity. \u003ca href=\"https://springwise.com/innovation/health-wellbeing/a-mental-health-app-for-the-hospitality-industry/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003ca href=\"https://springwise.com/innovation/health-wellbeing/science-based-tech-for-personalised-mental-health-care/\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/10/innovationhealth-wellbeingscience-based-tech-for-personalised-mental-health-care.jpg\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/10/innovationhealth-wellbeingscience-based-tech-for-personalised-mental-health-care.jpg 1500w, https://springwise.com/wp-content/uploads/2024/10/innovationhealth-wellbeingscience-based-tech-for-personalised-mental-health-care-300x140.jpg 300w, https://springwise.com/wp-content/uploads/2024/10/innovationhealth-wellbeingscience-based-tech-for-personalised-mental-health-care-768x357.jpg 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePhoto source \u003ca href=\"https://www.psyomics.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePsyomics\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003ch4\u003e\u003ca href=\"https://springwise.com/innovation/health-wellbeing/science-based-tech-for-personalised-mental-health-care/\"\u003e\u003cstrong\u003eTech transforms diagnosis of mental health\u003c/strong\u003e\u003c/a\u003e\u003c/h4\u003e\n\n\n\n\u003cp\u003eIn the UK, like many other countries, waiting lists for mental health care continue to grow, leaving those in need unable to access essential support.\u003c/p\u003e\n\n\n\n\u003cp\u003eMental healthcare technology company Psyomics is helping to reduce those waiting times by cutting down on the time it takes clinicians to assess and diagnose patients. The company, a spin-out of Cambridge University’s Centre for Neuropsychiatric Research (CCNR), created the Censeo platform for web-based mental health triage and assessment.\u003c/p\u003e\n\n\n\n\u003cp\u003eCenseo uses an algorithm to tailor questions to the individual and ask personalised queries based on recognised criteria, National Institute for Clinical Excellence guidance, and continuous feedback from patients and clinicians. Following trials and its first year of commercial use in 2023, clinician assessments agreed with Censeo’s diagnoses 91 per cent of the time, and healthcare professionals report that using the platform increases their clinical efficiency by up to 50 per cent. \u003ca href=\"https://springwise.com/innovation/health-wellbeing/science-based-tech-for-personalised-mental-health-care/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003ca href=\"https://springwise.com/innovation/health-wellbeing/ai-powered-voice-biomarkers-for-mental-health/\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/10/innovationhealth-wellbeingAI-powered-voice-biomarkers-for-mental-health.jpg\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/10/innovationhealth-wellbeingAI-powered-voice-biomarkers-for-mental-health.jpg 1500w, https://springwise.com/wp-content/uploads/2024/10/innovationhealth-wellbeingAI-powered-voice-biomarkers-for-mental-health-300x140.jpg 300w, https://springwise.com/wp-content/uploads/2024/10/innovationhealth-wellbeingAI-powered-voice-biomarkers-for-mental-health-768x357.jpg 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePhoto source \u003ca href=\"https://www.canva.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e© AndreyPopov from Getty Images via Canva.com\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003ch4\u003e\u003ca href=\"https://springwise.com/innovation/health-wellbeing/ai-powered-voice-biomarkers-for-mental-health/\"\u003e\u003cstrong\u003eAI-powered voice biomarkers for mental health\u003c/strong\u003e\u003c/a\u003e\u003c/h4\u003e\n\n\n\n\u003cp\u003eTo help medical professionals better administer care, Canary Speech has developed vocal biomarker technology that uses AI to screen for mood, stress, and energy levels using a single 20-second audio clip. Canary’s technology analyses acoustic and linguistic elements in speech to model and screen for mental health and neurological disorders.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe technology is language and device-agnostic and includes ambient listening tools. These are designed to unobtrusively capture and analyse conversations in real time. This allows healthcare professionals to focus all of their attention on patient interactions while the system automatically documents clinical notes. \u003c/p\u003e\n\n\n\n\u003cp\u003eCanary’s platform can analyse speech data within seconds to identify behavioural and cognitive changes earlier than current clinical screening methods, and before noticeable symptoms present themselves, for invisible illnesses like anxiety, depression, and dementia. There are a wide range of applications for this within the healthcare industry, including evaluating callers to helplines, conducting ambient clinical listening, remote patient monitoring, and annual wellness checks. \u003ca href=\"https://springwise.com/innovation/health-wellbeing/ai-powered-voice-biomarkers-for-mental-health/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cfigure data-image-nozoom=\"true\"\u003e\u003ca href=\"https://springwise.com/innovation/health-wellbeing/eye-tracking-provides-insights-into-a-patients-cognitive-state/\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"698\" src=\"https://springwise.com/wp-content/uploads/2024/10/innovationhealth-wellbeingeye-tracking-provides-insights-into-a-patients-cognitive-state.jpg\" alt=\"\" srcset=\"https://springwise.com/wp-content/uploads/2024/10/innovationhealth-wellbeingeye-tracking-provides-insights-into-a-patients-cognitive-state.jpg 1500w, https://springwise.com/wp-content/uploads/2024/10/innovationhealth-wellbeingeye-tracking-provides-insights-into-a-patients-cognitive-state-300x140.jpg 300w, https://springwise.com/wp-content/uploads/2024/10/innovationhealth-wellbeingeye-tracking-provides-insights-into-a-patients-cognitive-state-768x357.jpg 768w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003ePhoto source \u003ca href=\"https://www.canva.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e© Marc Schulte from Pexels via Canva.com\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003ch4\u003e\u003ca href=\"https://springwise.com/innovation/health-wellbeing/eye-tracking-provides-insights-into-a-patients-cognitive-state/\"\u003e\u003cstrong\u003eMonitoring patients via eye-tracking in neuropsychology\u003c/strong\u003e\u003c/a\u003e\u003c/h4\u003e\n\n\n\n\u003cp\u003eAustrian startup SOMAREALITY is seeking to digitise care in order to provide continuous monitoring of a patient’s neuropsychological health. Co-founder Adrian Brodesser told Springwise that “SOMAREALITY is the first company that enables real-time insights into the cognitive state of the user without the need for an EEG. [electroencephalogram].” This reduces the cost of diagnosis and monitoring while improving accessibility.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe company has developed digital cognitive biomarkers, based on eye movement, that are tracked and analysed by virtual or augmented reality headsets and smartphones. The eye-tracking technology allows care teams to capture a much broader range of time in their analysis of a patient’s health, and by digitising the data, the startup’s approach makes it much easier to monitor conditions over extended periods.\u003c/p\u003e\n\n\n\n\u003cp\u003eWith much of neuropsychology still reliant on pen-and-paper analysis and record keeping, SOMAREALITY sees digitisation as a way to provide more objective measurements as well as ones that are more easily replicable. And providing the technology via smartphone helps care teams provide care to underserved communities in remote locations. Treatments can also be provided digitally and tailored explicitly to the cognitive load and stress individuals are experiencing at the time they seek care. \u003ca href=\"https://springwise.com/innovation/health-wellbeing/eye-tracking-provides-insights-into-a-patients-cognitive-state/\"\u003e\u003cstrong\u003eRead more\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eCompiled by: Matthew Hempstead\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eMental health is a complex issue, and those in need of urgent help can find information about the services available on the \u003c/em\u003e\u003ca href=\"https://unitedgmh.org/mental-health-support\"\u003e\u003cem\u003eUnited for Global Mental Health website\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-10-09T08:02:36Z",
  "modifiedTime": "2024-10-09T08:02:39Z"
}
