{
  "id": "f4e3139f-51fe-4238-9c9b-516ee3780ff0",
  "title": "Baidu delivers new LLMs ERNIE 4.5 and ERNIE X1 undercutting DeepSeek, OpenAI on cost — but they’re not open source (yet)",
  "link": "https://venturebeat.com/ai/baidu-delivers-new-llms-ernie-4-5-and-ernie-x1-undercutting-deepseek-openai-on-cost-but-theyre-not-open-source-yet/",
  "description": "Baidu has also announced plans to integrate ERNIE 4.5 and ERNIE X1 into its broader ecosystem, including Baidu Search and the Wenxiaoyan app.",
  "author": "Carl Franzen",
  "published": "Mon, 17 Mar 2025 22:48:01 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "AI, ML and Deep Learning",
    "Baidu",
    "category-/Computers \u0026 Electronics/Software",
    "chatbots",
    "Conversational AI",
    "customer service",
    "ERNIE",
    "NLP",
    "reasoning",
    "reasoning AI",
    "reasoning models"
  ],
  "byline": "Carl Franzen",
  "length": 7019,
  "excerpt": "Baidu has also announced plans to integrate ERNIE 4.5 and ERNIE X1 into its broader ecosystem, including Baidu Search and the Wenxiaoyan app.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "March 17, 2025 3:48 PM Credit: VentureBeat made with Midjourney Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More Over the weekend, Chinese web search giant Baidu announced the launch of two new AI models, ERNIE 4.5 and ERNIE X1, a multimodal language model and reasoning model, respectively. Baidu claims they offer state-of-the-art performance on a variety of metrics, besting DeepSeek’s non-reasoning V3 and OpenAI’s GPT-4.5 (how do you like the close name match Baidu chose as well?) on several third-party benchmark tests such as the C-Eval (assessing Chinese LLM performance on knowledge and reasoning across 52 subjects), CMMLU (massive multitask language understanding in Chinese), and GSM8K (math word problems). It also claims to undercut the cost of both fellow Chinese wunderkind’s DeepSeek’s R1 reasoning model with ERNIE X1 by 50% and US AI juggernaut OpenAI’s GPT-4.5 with ERNIE 4.5 by 99%, respectively. Yet both have some important limitations, including a lack of open source licensing in the former case (which DeepSeek R1 offers) and a far reduced context compared to the latter (8,000 tokens instead of 128,000, frankly an astonishingly low amount in this age of million-token-plus context windows. Tokens are how a large AI model represents information, with more meaning more information. A 128,000-token window is akin to a 250-page novel). As X user @claudeglass noted in a post, the small context window makes it perhaps only suitable for customer service chatbots. Baidu posted on X that it did plan to make the ERNIE 4.5 model family open source on June 30th, 2025. Baidu has enabled access to the models through its application programming interface (API) and Chinese-language chatbot rival to ChatGPT, known as “ERNIE Bot” — it answers questions, generates text, produces creative writing, and interacts conversationally with users — and made ERNIE Bot free to access. ERNIE 4.5: A new generation of multimodal AI ERNIE 4.5 is Baidu’s latest foundation model, designed as a native multimodal system capable of processing and understanding text, images, audio, and video, and is a clear competitor to OpenAI’s GPT-4.5 model released back in February 2025. The model has been optimized for better comprehension, generation, reasoning, and memory. Enhancements include improved hallucination prevention, logical reasoning, and coding capabilities. According to Baidu, ERNIE 4.5 outperforms GPT-4.5 in multiple benchmarks while maintaining a significantly lower cost. The model’s advancements stem from several key technologies, including FlashMask Dynamic Attention Masking, Heterogeneous Multimodal Mixture-of-Experts, and Self-feedback Enhanced Post-Training. ERNIE X1 introduces advanced deep-thinking reasoning capabilities, emphasizing understanding, planning, reflection, and evolution. Unlike standard multimodal AI models, ERNIE X1 is specifically designed for complex reasoning and tool use, enabling it to perform tasks such as advanced search, document-based Q\u0026A, AI-generated image interpretation, code execution, and web page analysis. The model supports a range of tools, including Baidu’s academic search, business information search, and franchise research tools. Its development is based on Progressive Reinforcement Learning, End-to-End Training integrating Chains of Thought and Action, and a Unified Multi-Faceted Reward System. Access and API availability Users can now access both ERNIE 4.5 and ERNIE X1 via the official ERNIE Bot website. For enterprise users and developers, ERNIE 4.5 is now available through Baidu AI Cloud’s Qianfan platform via API access. ERNIE X1 is expected to be available soon. Pricing for API Access: ERNIE 4.5: Input: $0.55 USD per 1 million tokens Output: $2.2 per 1M tokens ERNIE X1: Input: $0.28 per 1M tokens Output: $1.1 per 1M tokens Compare that to: GPT-4.5, which has a noticeably astonishingly high price through the OpenAI API of: Input: $75.00 per 1M tokens Output: $150.00 per 1M tokens DeepSeek R1 Input: $0.55 per 1M tokens Output: $2.19 per 1M tokens Baidu has also announced plans to integrate ERNIE 4.5 and ERNIE X1 into its broader ecosystem, including Baidu Search and the Wenxiaoyan app. Considerations for enterprise decision-makers For CIOs, CTOs, IT leaders, and DevOps teams, the launch of ERNIE 4.5 and ERNIE X1 presents both opportunities and considerations: Performance vs. Cost – With pricing significantly lower than competing models, organizations evaluating AI solutions may see cost savings by integrating ERNIE models via API. However, further benchmarking and real-world testing may be necessary to assess performance for specific business applications. Multimodal and Reasoning Capabilities – The ability to process and understand text, images, audio, and video could be valuable for businesses in industries such as customer support, content generation, legal tech, and finance. Tool Integration – ERNIE X1’s ability to work with tools like advanced search, document-based Q\u0026A, and code interpretation could provide automation and efficiency gains in enterprise environments. Ecosystem and Localization – As Baidu’s AI models are optimized for Chinese-language processing and regional knowledge, enterprises working in China or targeting Chinese-speaking markets may find ERNIE models more effective than global alternatives. Licensing and Data Privacy – While Baidu has indicated that GPT-4.5 will be made open source later this summer, June 30, 2025, that’s still three months away, so enterprises should at least wait until that time to assess whether it’s worth deploying locally or on US-hosted cloud services. Enterprise users should review Baidu’s policies regarding data privacy, compliance, and model usage before integrating these AI solutions. AI expansion and future outlook As AI development accelerates in 2025, Baidu is positioning itself as a leader in multimodal and reasoning-based AI technologies. The company plans to continue investing in artificial intelligence, data centers, and cloud infrastructure to enhance the capabilities of its foundation models. By offering a combination of powerful performance and lower costs, Baidu’s latest AI models aim to provide businesses and individual users with more accessible and advanced AI tools. For more details, visit ERNIE Bot’s official website. Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/03/cfr0z3n_a_childrens_TV_muppet_character_working_as_a_software_d_7cc54baf-eac3-43dc-91cd-2de0eec21b8f.png?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2025-03-17T22:48:01+00:00\" datetime=\"2025-03-17T22:48:01+00:00\"\u003eMarch 17, 2025 3:48 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"400\" height=\"224\" src=\"https://venturebeat.com/wp-content/uploads/2025/03/cfr0z3n_a_childrens_TV_muppet_character_working_as_a_software_d_7cc54baf-eac3-43dc-91cd-2de0eec21b8f.png?w=400\" alt=\"A yellowish muppet with shaggy hair and glasses types on a computer in a darkened room with a switchboard beside them\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCredit: VentureBeat made with Midjourney\u003c/span\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. \u003ca href=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\" data-type=\"link\" data-id=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\"\u003eLearn More\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003eOver the weekend, Chinese web search giant Baidu\u003ca href=\"https://www.prnewswire.com/news-releases/baidu-unveils-ernie-4-5-and-reasoning-model-ernie-x1--makes-ernie-bot-free-ahead-of-schedule-302402490.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e announced the launch of two new AI models, ERNIE 4.5 and ERNIE X1\u003c/a\u003e, a multimodal language model and reasoning model, respectively. \u003c/p\u003e\n\n\n\n\u003cp\u003eBaidu claims they offer state-of-the-art performance on a variety of metrics, besting DeepSeek’s non-reasoning V3 and OpenAI’s GPT-4.5 (how do you like the close name match Baidu chose as well?) on several third-party benchmark tests such as the \u003ca href=\"https://aclanthology.org/2024.findings-acl.671.pdf\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eC-Eval\u003c/a\u003e (assessing Chinese LLM performance on knowledge and reasoning across 52 subjects), \u003ca href=\"https://arxiv.org/html/2306.09212v2\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCMMLU\u003c/a\u003e (massive multitask language understanding in Chinese), and\u003ca href=\"https://paperswithcode.com/dataset/gsm8k\"\u003e GSM8K \u003c/a\u003e(math word problems).\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1602\" height=\"808\" src=\"https://venturebeat.com/wp-content/uploads/2025/03/GmLaSBGbcAACDqq.jpg?w=800\" alt=\"\" srcset=\"https://venturebeat.com/wp-content/uploads/2025/03/GmLaSBGbcAACDqq.jpg 1602w, https://venturebeat.com/wp-content/uploads/2025/03/GmLaSBGbcAACDqq.jpg?resize=300,151 300w, https://venturebeat.com/wp-content/uploads/2025/03/GmLaSBGbcAACDqq.jpg?resize=768,387 768w, https://venturebeat.com/wp-content/uploads/2025/03/GmLaSBGbcAACDqq.jpg?resize=800,403 800w, https://venturebeat.com/wp-content/uploads/2025/03/GmLaSBGbcAACDqq.jpg?resize=1536,775 1536w, https://venturebeat.com/wp-content/uploads/2025/03/GmLaSBGbcAACDqq.jpg?resize=100,50 100w, https://venturebeat.com/wp-content/uploads/2025/03/GmLaSBGbcAACDqq.jpg?resize=400,202 400w, https://venturebeat.com/wp-content/uploads/2025/03/GmLaSBGbcAACDqq.jpg?resize=750,378 750w, https://venturebeat.com/wp-content/uploads/2025/03/GmLaSBGbcAACDqq.jpg?resize=578,292 578w, https://venturebeat.com/wp-content/uploads/2025/03/GmLaSBGbcAACDqq.jpg?resize=930,469 930w\" sizes=\"(max-width: 1602px) 100vw, 1602px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIt also claims to undercut the cost of both fellow Chinese wunderkind’s \u003ca href=\"https://venturebeat.com/ai/open-source-deepseek-r1-uses-pure-reinforcement-learning-to-match-openai-o1-at-95-less-cost/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDeepSeek’s R1 reasoning model\u003c/a\u003e with ERNIE X1 by 50% and US AI juggernaut \u003ca href=\"https://venturebeat.com/ai/openai-releases-gpt-4-5/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eOpenAI’s GPT-4.5\u003c/a\u003e with ERNIE 4.5 by 99%,  respectively.\u003c/p\u003e\n\n\n\n\u003cp\u003eYet both have some important limitations, including a lack of open source licensing in the former case (which DeepSeek R1 offers) and a far reduced context compared to the latter (8,000 tokens instead of 128,000, frankly an astonishingly low amount in this age of million-token-plus context windows. Tokens are how a large AI model represents information, with more meaning more information. A 128,000-token window is akin to a 250-page novel).\u003c/p\u003e\n\n\n\n\u003cp\u003eAs\u003ca href=\"https://x.com/claudeglass/status/1901268736423932121\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e X user @claudeglass\u003c/a\u003e noted in a post, the small context window makes it perhaps only suitable for customer service chatbots. \u003c/p\u003e\n\n\n\n\u003cp\u003eBaidu \u003ca href=\"https://x.com/Baidu_Inc/status/1890292032318652719\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eposted on X \u003c/a\u003ethat it did plan to make the ERNIE 4.5 model family open source on June 30th, 2025.\u003c/p\u003e\n\n\n\n\u003cp\u003eBaidu has enabled access to the models through its application programming interface (API) and Chinese-language chatbot rival to ChatGPT, known as “\u003ca href=\"https://yiyan.baidu.com/\"\u003eERNIE Bot\u003c/a\u003e” — it answers questions, generates text, produces creative writing, and interacts conversationally with users — and made ERNIE Bot free to access. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-ernie-4-5-a-new-generation-of-multimodal-ai\"\u003eERNIE 4.5: A new generation of multimodal AI\u003c/h2\u003e\n\n\n\n\u003cp\u003eERNIE 4.5 is Baidu’s latest foundation model, designed as a native multimodal system capable of processing and understanding text, images, audio, and video, and is a clear competitor to\u003ca href=\"https://venturebeat.com/ai/openai-releases-gpt-4-5/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e OpenAI’s GPT-4.5 model released back in February 2025\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe model has been optimized for better comprehension, generation, reasoning, and memory. Enhancements include improved hallucination prevention, logical reasoning, and coding capabilities.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to Baidu, ERNIE 4.5 outperforms GPT-4.5 in multiple benchmarks while maintaining a significantly lower cost.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe model’s advancements stem from several key technologies, including FlashMask Dynamic Attention Masking, Heterogeneous Multimodal Mixture-of-Experts, and Self-feedback Enhanced Post-Training.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eERNIE X1 introduces advanced deep-thinking reasoning capabilities, emphasizing understanding, planning, reflection, and evolution. \u003c/p\u003e\n\n\n\n\u003cp\u003eUnlike standard multimodal AI models, ERNIE X1 is specifically designed for complex reasoning and tool use, enabling it to perform tasks such as advanced search, document-based Q\u0026amp;A, AI-generated image interpretation, code execution, and web page analysis.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe model supports a range of tools, including Baidu’s academic search, business information search, and franchise research tools. Its development is based on Progressive Reinforcement Learning, End-to-End Training integrating Chains of Thought and Action, and a Unified Multi-Faceted Reward System.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-access-and-api-availability\"\u003eAccess and API availability\u003c/h2\u003e\n\n\n\n\u003cp\u003eUsers can now access both ERNIE 4.5 and ERNIE X1 via the official ERNIE Bot website.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor enterprise users and developers, ERNIE 4.5 is now available through\u003ca href=\"https://login.bce.baidu.com/new-reg\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e Baidu AI Cloud’s Qianfan \u003c/a\u003eplatform via API access. ERNIE X1 is expected to be available soon.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-pricing-for-api-access\"\u003e\u003cstrong\u003ePricing for API Access:\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eERNIE 4.5:\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eInput: $0.55 USD per 1 million tokens\u003c/li\u003e\n\n\n\n\u003cli\u003eOutput: $2.2 per 1M tokens\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eERNIE X1:\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eInput: $0.28 per 1M tokens\u003c/li\u003e\n\n\n\n\u003cli\u003eOutput: $1.1 per 1M tokens\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eCompare that to:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eGPT-4.5\u003c/strong\u003e, which has a noticeably\u003ca href=\"https://venturebeat.com/ai/gpt-4-5-for-enterprise-do-its-accuracy-and-knowledge-justify-the-cost/\"\u003e astonishingly high price through the OpenAI API \u003c/a\u003eof:\n\u003cul\u003e\n\u003cli\u003eInput: $75.00 per 1M tokens\u003c/li\u003e\n\n\n\n\u003cli\u003eOutput: $150.00 per 1M tokens \u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eDeepSeek R1\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eInput: $0.55 per 1M tokens\u003c/li\u003e\n\n\n\n\u003cli\u003eOutput: $2.19 per 1M tokens\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eBaidu has also announced plans to integrate ERNIE 4.5 and ERNIE X1 into its broader ecosystem, including Baidu Search and the Wenxiaoyan app.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-considerations-for-enterprise-decision-makers\"\u003eConsiderations for enterprise decision-makers\u003c/h2\u003e\n\n\n\n\u003cp\u003eFor CIOs, CTOs, IT leaders, and DevOps teams, the launch of ERNIE 4.5 and ERNIE X1 presents both opportunities and considerations:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003ePerformance vs. Cost\u003c/strong\u003e – With pricing significantly lower than competing models, organizations evaluating AI solutions may see cost savings by integrating ERNIE models via API. However, further benchmarking and real-world testing may be necessary to assess performance for specific business applications.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eMultimodal and Reasoning Capabilities\u003c/strong\u003e – The ability to process and understand text, images, audio, and video could be valuable for businesses in industries such as customer support, content generation, legal tech, and finance.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eTool Integration\u003c/strong\u003e – ERNIE X1’s ability to work with tools like advanced search, document-based Q\u0026amp;A, and code interpretation could provide automation and efficiency gains in enterprise environments.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eEcosystem and Localization\u003c/strong\u003e – As Baidu’s AI models are optimized for Chinese-language processing and regional knowledge, enterprises working in China or targeting Chinese-speaking markets may find ERNIE models more effective than global alternatives.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eLicensing and Data Privacy\u003c/strong\u003e – While Baidu has indicated that GPT-4.5 will be made open source later this summer, June 30, 2025, that’s still three months away, so enterprises should at least wait until that time to assess whether it’s worth deploying locally or on US-hosted cloud services. Enterprise users should review Baidu’s policies regarding data privacy, compliance, and model usage before integrating these AI solutions.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2 id=\"h-ai-expansion-and-future-outlook\"\u003eAI expansion and future outlook\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs AI development accelerates in 2025, Baidu is positioning itself as a leader in multimodal and reasoning-based AI technologies. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe company plans to continue investing in artificial intelligence, data centers, and cloud infrastructure to enhance the capabilities of its foundation models.\u003c/p\u003e\n\n\n\n\u003cp\u003eBy offering a combination of powerful performance and lower costs, Baidu’s latest AI models aim to provide businesses and individual users with more accessible and advanced AI tools.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor more details, visit \u003ca href=\"https://yiyan.baidu.com/\"\u003eERNIE Bot’s official website\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-17T22:48:01Z",
  "modifiedTime": "2025-03-17T22:49:07Z"
}
