{
  "id": "faccda1b-212e-4223-9ccc-7b64b65b4e2a",
  "title": "Lotte Group taps Arbitrum for Web3 entertainment experiences",
  "link": "https://venturebeat.com/games/lotte-group-taps-arbitrum-for-web3-entertainment-experiences/",
  "description": "Lotte Group, a big five conglomerate in South Korea, said at CES 2025 that it has picked the Arbitrum blockchain for its Lotte Caliverse.",
  "author": "Dean Takahashi",
  "published": "Tue, 07 Jan 2025 20:00:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "GamesBeat",
    "Gaming Business",
    "Arbitrum",
    "blockchain",
    "blockchain games",
    "category-/Games",
    "Lotte Group",
    "web3 gaming"
  ],
  "byline": "Dean Takahashi",
  "length": 4583,
  "excerpt": "Lotte Group, a big five conglomerate in South Korea, said at CES 2025 that it has picked the Arbitrum blockchain for its Lotte Caliverse.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "January 7, 2025 12:00 PM Lotte is tapping the Arbitrum blockchain for its Lotte Caliverse.Image Credit: Lotte Lotte Group, a big five conglomerate in South Korea, said at CES 2025 that it has picked the Arbitrum blockchain for its Lotte Caliverse. The Lotte Caliverse will be an AI-driven 3D entertainment experience on the blockchain. Arbitrum has been a popular choice as a Layer 2 Ethereum blockchain because of its flexibility, and this deal will bring a number of brands to a metaverse-like experience. With over 90 businesses in retail, chemicals, hotels, financial services, food, and more, Lotte Caliverse features brands such as Givenchy, MCM, L’Occitane, fresh, 7-Eleven, and Tomorrowland, alongside its subsidiary brands such as Lotte Duty-Free, Lotte HiMart, and Lotte Cinema. A next-generation virtual world enabled by Epic Games’ Unreal Engine 5, Lotte Caliverse is offering users a first-of-its-kind entertainment experience. Users can shop at digital stores such as Givenchy and MCM and receive items in the real world, attend K-Pop and Electronic music concerts featuring superstars like NMIXX and DJ ALOK, and enjoy music stages developed with Tomorrowland, one of the world’s largest electronic dance music festivals. Users can also dive into various games, from dance battles with friends to the newly announced “Caliverse: Invasion” where they fend off aliens. In the future, users will be able to create their own games on the platform.  “Together with the most trusted blockchain Arbitrum, we are excited to take our first steps into the world of blockchain with Lotte Caliverse, where we will leverage Lotte’s successful history in retail to offer exceptional products and services to over 40 million people,” said Kima Kim, CEO of Caliverse, in a statement. “Our vision is to shape the future of retail and entertainment experiences for users, by combining the best elements of real-life interactions with new opportunities onchain. The recipiency of the largest grant to date for Arbitrum marks the first step in building out a sustainable creator economy that features next-gen commerce, UGC, gaming, and entertainment.” Lotte and Arbitrum want to push the boundaries of the virtual world experience with Lotte Caliverse. At CES, Lotte Caliverse revealed its latest 3D technologies, including an app that enables users to experience 3D visuals without the need for glasses. Additionally, real-time 3D Chroma Key AI technology delivers immersive gameplay in Lotte Caliverse. In 2024, Arbitrum’s Gaming ecosystem saw a 72% year-over-year growth, hosting 119 game titles and 23 gaming-focused proprietary Orbit chains. By joining Arbitrum’s vast ecosystem, Lotte Caliverse stands to benefit tremendously from the network effects. Lotte’s Orgin City in the Caliverse. “Arbitrum’s blockchain is the ideal home ground for Lotte Caliverse, delivering industry-leading 250ms block times that ensure high-quality performance within virtual worlds and gaming experiences,” said Steven Goldfeder, CEO at Offchain Labs, the developers of Arbitrum technology, in a statement. “With Arbitrum now powering Lotte Caliverse, in-game transactions will be seamlessly integrated on-chain and will eliminate transaction latency, providing users with a smooth, consumer-friendly experience that sets a new standard for Arbitrum-based interactions in virtual worlds.” “We are pleased to announce our new alliance with Lotte, a leading cross-border company in Korea and Japan. Their bold decision to integrate blockchain technology into Lotte Caliverse showcases their commitment to innovation, and we are proud that they have chosen Arbitrum to drive this next phase of their journey,” said John Park, Head of Korea at The Arbitrum Foundation. Last month, Arbitrum established an alliance with gaming giant Ubisoft to streamline the gaming experiences within the Web3 ecosystem. This alliance with Lotte adds to this momentum, uniting one of Asia’s largest conglomerates with Arbitrum’s blockchain infrastructure.  Users can start exploring Lotte Caliverse today by downloading the game at https://caliverse.io/. The 3D film and app features are set to launch in the first half of 2025. Lotte Group was founded in 1948, with its headquarters in both Japan and South Korea. It operates in 30 countries. GB Daily Stay in the know! Get the latest news in your inbox daily Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/01/lotte-Orgin-city5.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2025-01-07T20:00:00+00:00\" datetime=\"2025-01-07T20:00:00+00:00\"\u003eJanuary 7, 2025 12:00 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"422\" src=\"https://venturebeat.com/wp-content/uploads/2025/01/lotte-Orgin-city5.jpg?w=750\" alt=\"Lotte is tapping the Arbitrum blockchain for its Lotte Caliverse.\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eLotte is tapping the Arbitrum blockchain for its Lotte Caliverse.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eImage Credit: Lotte\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003ca href=\"https://www.lotte.co.kr/\"\u003eLotte Group\u003c/a\u003e, a big five conglomerate in South Korea, said at \u003ca href=\"https://venturebeat.com/ai/ces-2025-tips-and-tricks-a-guide-to-techs-biggest-trade-show/\"\u003eCES 2025\u003c/a\u003e that it has picked the Arbitrum blockchain for its \u003ca href=\"https://www.caliverse.co.kr/\"\u003eLotte Caliverse\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Lotte Caliverse will be an AI-driven 3D entertainment experience on the blockchain. Arbitrum has been a \u003ca href=\"https://l2beat.com/scaling/summary\"\u003epopular choice as a Layer 2 Ethereum blockchain\u003c/a\u003e because of its flexibility, and this deal will bring a number of brands to a metaverse-like experience.\u003c/p\u003e\n\n\n\n\u003cp\u003eWith over 90 businesses in retail, chemicals, hotels, financial services, food, and more, Lotte Caliverse features brands such as Givenchy, MCM, L’Occitane, fresh, 7-Eleven, and Tomorrowland, alongside its subsidiary brands such as Lotte Duty-Free, Lotte HiMart, and Lotte Cinema.\u003c/p\u003e\n\n\n\n\u003cp\u003eA next-generation virtual world enabled by Epic Games’ Unreal Engine 5, Lotte Caliverse is offering users a first-of-its-kind entertainment experience.\u003c/p\u003e\n\n\n\n\u003cp\u003eUsers can shop at digital stores such as Givenchy and MCM and receive items in the real world, attend K-Pop and Electronic music concerts featuring superstars like NMIXX and DJ ALOK, and enjoy music stages developed with Tomorrowland, one of the world’s largest electronic dance music festivals. Users can also dive into various games, from dance battles with friends to the newly announced “Caliverse: Invasion” where they fend off aliens. In the future, users will be able to create their own games on the platform. \u003c/p\u003e\n\n\n\n\u003cp\u003e“Together with the most trusted blockchain Arbitrum, we are excited to take our first steps into the world of blockchain with Lotte Caliverse, where we will leverage Lotte’s successful history in retail to offer exceptional products and services to over 40 million people,”  said Kima Kim, CEO of Caliverse, in a statement. “Our vision is to shape the future of retail and entertainment experiences for users, by combining the best elements of real-life interactions with new opportunities onchain. The recipiency of the largest grant to date for Arbitrum marks the first step in building out a sustainable creator economy that features next-gen commerce, UGC, gaming, and entertainment.”\u003c/p\u003e\n\n\n\n\u003cp\u003eLotte and Arbitrum want to push the boundaries of the virtual world experience with Lotte Caliverse. At CES, Lotte Caliverse revealed its latest 3D technologies, including an app that enables users to experience 3D visuals without the need for glasses. Additionally, real-time 3D Chroma Key AI technology delivers immersive gameplay in Lotte Caliverse.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn 2024, Arbitrum’s Gaming ecosystem saw a 72% year-over-year growth, hosting 119 game titles and 23 gaming-focused proprietary Orbit chains. By joining Arbitrum’s vast ecosystem, Lotte Caliverse stands to benefit tremendously from the network effects.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1200\" height=\"675\" src=\"https://venturebeat.com/wp-content/uploads/2025/01/lotte-Orgin-city6.jpg?w=800\" alt=\"\" srcset=\"https://venturebeat.com/wp-content/uploads/2025/01/lotte-Orgin-city6.jpg 1200w, https://venturebeat.com/wp-content/uploads/2025/01/lotte-Orgin-city6.jpg?resize=300,169 300w, https://venturebeat.com/wp-content/uploads/2025/01/lotte-Orgin-city6.jpg?resize=768,432 768w, https://venturebeat.com/wp-content/uploads/2025/01/lotte-Orgin-city6.jpg?resize=800,450 800w, https://venturebeat.com/wp-content/uploads/2025/01/lotte-Orgin-city6.jpg?resize=400,225 400w, https://venturebeat.com/wp-content/uploads/2025/01/lotte-Orgin-city6.jpg?resize=750,422 750w, https://venturebeat.com/wp-content/uploads/2025/01/lotte-Orgin-city6.jpg?resize=578,325 578w, https://venturebeat.com/wp-content/uploads/2025/01/lotte-Orgin-city6.jpg?resize=930,523 930w\" sizes=\"(max-width: 1200px) 100vw, 1200px\"/\u003e\u003cfigcaption\u003eLotte’s Orgin City in the Caliverse.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e“Arbitrum’s blockchain is the ideal home ground for Lotte Caliverse, delivering industry-leading 250ms block times that ensure high-quality performance within virtual worlds and gaming experiences,” said \u003ca href=\"https://www.linkedin.com/in/sgoldfed/\"\u003eSteven Goldfeder\u003c/a\u003e, CEO at \u003ca href=\"https://www.offchainlabs.com/\"\u003eOffchain Labs\u003c/a\u003e, the developers of Arbitrum technology, in a statement. “With Arbitrum now powering Lotte Caliverse, in-game transactions will be seamlessly integrated on-chain and will eliminate transaction latency, providing users with a smooth, consumer-friendly experience that sets a new standard for Arbitrum-based interactions in virtual worlds.”\u003c/p\u003e\n\n\n\n\u003cp\u003e“We are pleased to announce our new alliance with Lotte, a leading cross-border company in Korea and Japan. Their bold decision to integrate blockchain technology into Lotte Caliverse showcases their commitment to innovation, and we are proud that they have chosen Arbitrum to drive this next phase of their journey,” said John Park, Head of Korea at The Arbitrum Foundation.\u003c/p\u003e\n\n\n\n\u003cp\u003eLast month, Arbitrum established an alliance with gaming giant Ubisoft to streamline the gaming experiences within the Web3 ecosystem. This alliance with Lotte adds to this momentum, uniting one of Asia’s largest conglomerates with Arbitrum’s blockchain infrastructure. \u003c/p\u003e\n\n\n\n\u003cp\u003eUsers can start exploring Lotte Caliverse today by downloading the game at \u003ca href=\"https://caliverse.io/\"\u003ehttps://caliverse.io/\u003c/a\u003e. The 3D film and app features are set to launch in the first half of 2025. Lotte Group was founded in 1948, with its headquarters in both Japan and South Korea. It operates in 30 countries.\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2663995\"\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eGB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eStay in the know! Get the latest news in your inbox daily\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-07T20:00:00Z",
  "modifiedTime": "2025-01-02T21:51:55Z"
}
