{
  "id": "ff20ca9e-69fa-4dd2-8a36-2f680071c89b",
  "title": "Security Clearances at the Speed of Startups",
  "link": "https://steveblank.com/2024/08/13/security-clearances-at-the-speed-of-startups/",
  "description": "Imagine you got a job offer from a company but weren’t allowed to start work – or get paid – for almost a year. And if you can’t pass a security clearance your offer is rescinded. Or you get offered an internship but can’t work on the most interesting part of the project. Sounds like […]",
  "author": "steve blank",
  "published": "Tue, 13 Aug 2024 13:00:40 +0000",
  "source": "https://steveblank.com/feed/",
  "categories": [
    "National Security"
  ],
  "byline": "",
  "length": 5026,
  "excerpt": "Imagine you got a job offer from a company but weren’t allowed to start work – or get paid – for almost a year. And if you can’t pass a security clearance your offer is rescinded. Or you get …",
  "siteName": "Steve Blank",
  "favicon": "https://s0.wp.com/i/webclip.png",
  "text": "Imagine you got a job offer from a company but weren’t allowed to start work – or get paid – for almost a year. And if you can’t pass a security clearance your offer is rescinded. Or you get offered an internship but can’t work on the most interesting part of the project. Sounds like a nonstarter. Well that’s the current process if you want to work for companies or government agencies that work on classified programs. One Silicon Valley company, Palantir, is trying to change that and shorten the time between getting hired and doing productive work. Here’s why and how. Over the last five years more of my students have understood that Russia’s brutal war in Ukraine and strategic competition with the People’s Republic of China mean that the world is no longer a stable and safe place. This has convinced many of them to work on national security problems in defense startups. However, many of those companies and government agencies require you to work on projects with sensitive information the government wants to protect. These are called classified programs. To get hired, and to work on them, you need to first pass a government security clearance. (A security clearance is how the government learns whether you are trustworthy enough to keep secrets and not damage national security.) For jobs at most defense startups/contractors or national security agencies, instead of starting work with your offer letter, you’d instead receive a “conditional” job offer – that’s a fancy way to say, “we want you to work here, but you need to wait 3 to 9 months without pay until you start, and if you can’t pass the security clearance we won’t hire you.” That’s a pretty high bar for students who have lots of other options for where to work. Types of Security Clearances The time it takes for the clearance process depends on the thoroughness and how deeply the government investigates your background. That’s directly related to how classified will be the work you will be doing. The three primary levels of classification (from least to greatest) are Confidential, Secret, and Top Secret. The type and depth of background investigations to get a security clearance depends on what level of classified information you will be working with. For example, if you just need access to Confidential or Secret material they would do a National Agency Check with Law and Credit (NACLC). The government will look at the FBI’s criminal history repository, do a credit check, and a check with your local law enforcement agencies. This can take a relatively short time (~3 months). On the other hand if you’re going to work on a Top Secret/SCI project, this requires a more extensive (and much longer ~6-9 months) background check called a Single Scope Background Investigation (SSBI). Some types of clearances also require you to take a polygraph (lie-detector) test. How Does the Government “Clear” you? The National Background Investigation Services (NBIS) is the government agency that will investigate your background. They will ask about your: Drugs and Alcohol (hard drugs, addiction, chronic drinking, etc.) Criminal conduct (felonies..) Financial stability (they’ll run a Credit Bureau Report) How you’ve used IT systems (e.g. have you hacked any?) United States allegiance Foreign influence (do you own property overseas? Foreign investments, etc.) Psychological conditions and personal behavior. Travel History (have you lived or gone to China, Russia, Iran, North Korea, Syria, etc.) Plus, they will talk to your friends, relatives, current and ex-significant others, etc. to learn more about you Palantir’s Accelerated Student Clearance Plan Palantir wants their interns and new hires to hit the ground running and work on the toughest and most interesting government problems from day one. However, these types of problems require having a security clearance. The problem is that today, all companies start an application for a security clearance the day you show up for work. Palantir’s idea? If you get an internship or full-time offer from Palantir while you’re still in school, they will immediately employ you as a contractor. This will let them start your security clearance process while in school before you show up for work. That means you will be cleared ~9 months later in time for your first day on the job. Think of this like a college early admissions program. (If you’re interning, Palantir will hold your clearance for you if you come back to Palantir the following year.) Why Do This? Obviously this is a long-term strategic investment in Palantir’s college talent, but it also affects the entire defense ecosystem – to create a broader team of America’s best engineers who are able to support our country’s most critical missions. And they are encouraging other Defense Tech companies to implement a similar program. I think it’s a great idea. Now what are the other innovative ideas Silicon Valley can do to attract a national security workforce? Filed under: National Security |",
  "image": "https://steveblank.com/wp-content/uploads/2024/08/DALLÂ·E-2024-08-11-13.38.57-A-person-anxiously-waiting-to-receive-a-Top-Secret-security-clearance-depicted-in-a-surreal-environment-filled-with-numerous-obstacles.-The-person-is-150x150.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\t\t\t\t\t\u003cp\u003eImagine you got a job offer from a company but weren’t allowed to start work – or get paid – for almost a year. And if you can’t pass a security clearance your offer is rescinded. Or you get offered an internship but can’t work on the most interesting part of the project. Sounds like a nonstarter. Well that’s the current process if you want to work for companies or government agencies that work on \u003ca href=\"https://en.wikipedia.org/wiki/Classified_information\" target=\"_blank\" rel=\"noopener\"\u003eclassified\u003c/a\u003e programs.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eOne Silicon Valley company, \u003ca href=\"https://www.palantir.com/\"\u003ePalantir\u003c/a\u003e, is trying to change that and shorten the time between getting hired and doing productive work. Here’s why and how.\u003c/p\u003e\n\u003cp\u003eOver the last five years more of my students have understood that Russia’s brutal war in Ukraine and strategic competition with the People’s Republic of China mean that the world is no longer a stable and safe place. This has convinced many of them to work on national security problems in defense startups.\u003c/p\u003e\n\u003cp\u003eHowever, many of those companies and government agencies require you to work on projects with sensitive information the government wants to protect. These are called \u003ca href=\"https://en.wikipedia.org/wiki/Classified_information\"\u003eclassified \u003c/a\u003eprograms. To get hired, and to work on them, you need to first pass a government security clearance. (A security clearance is how the government learns whether you are trustworthy enough to keep secrets and not damage national security.)\u003c/p\u003e\n\u003cp\u003eFor jobs at most defense startups/contractors or national security agencies, instead of starting work with your offer letter, you’d instead receive a “conditional” job offer – that’s a fancy way to say, “we want you to work here, but you need to wait 3 to 9 months without pay until you start, and if you can’t pass the security clearance we won’t hire you.” That’s a pretty high bar for students who have lots of other options for where to work.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTypes of Security Clearances\u003cbr/\u003e\n\u003c/strong\u003eThe time it takes for the clearance process depends on the thoroughness and how deeply the government investigates your background. That’s directly related to how classified will be the work you will be doing. The three primary levels of classification (from least to greatest) are Confidential, Secret, and Top Secret. \u003ca href=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/08/DALL·E-2024-08-11-13.38.57-A-person-anxiously-waiting-to-receive-a-Top-Secret-security-clearance-depicted-in-a-surreal-environment-filled-with-numerous-obstacles.-The-person-is.webp?ssl=1\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" data-attachment-id=\"31399\" data-permalink=\"https://steveblank.com/2024/08/13/security-clearances-at-the-speed-of-startups/dall%c2%b7e-2024-08-11-13-38-57-a-person-anxiously-waiting-to-receive-a-top-secret-security-clearance-depicted-in-a-surreal-environment-filled-with-numerous-obstacles-the-person-is/\" data-orig-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/08/DALL·E-2024-08-11-13.38.57-A-person-anxiously-waiting-to-receive-a-Top-Secret-security-clearance-depicted-in-a-surreal-environment-filled-with-numerous-obstacles.-The-person-is.webp?fit=1024%2C1024\u0026amp;ssl=1\" data-orig-size=\"1024,1024\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"DALL·E 2024-08-11 13.38.57 – A person anxiously waiting to receive a Top Secret security clearance, depicted in a surreal environment filled with numerous obstacles. The person is\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/08/DALL·E-2024-08-11-13.38.57-A-person-anxiously-waiting-to-receive-a-Top-Secret-security-clearance-depicted-in-a-surreal-environment-filled-with-numerous-obstacles.-The-person-is.webp?fit=300%2C300\u0026amp;ssl=1\" data-large-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/08/DALL·E-2024-08-11-13.38.57-A-person-anxiously-waiting-to-receive-a-Top-Secret-security-clearance-depicted-in-a-surreal-environment-filled-with-numerous-obstacles.-The-person-is.webp?fit=468%2C468\u0026amp;ssl=1\" tabindex=\"0\" role=\"button\" src=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/08/DALL·E-2024-08-11-13.38.57-A-person-anxiously-waiting-to-receive-a-Top-Secret-security-clearance-depicted-in-a-surreal-environment-filled-with-numerous-obstacles.-The-person-is.webp?resize=150%2C150\u0026amp;ssl=1\" alt=\"\" width=\"150\" height=\"150\" srcset=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2024/08/DALL·E-2024-08-11-13.38.57-A-person-anxiously-waiting-to-receive-a-Top-Secret-security-clearance-depicted-in-a-surreal-environment-filled-with-numerous-obstacles.-The-person-is.webp?resize=150%2C150\u0026amp;ssl=1 150w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/08/DALL·E-2024-08-11-13.38.57-A-person-anxiously-waiting-to-receive-a-Top-Secret-security-clearance-depicted-in-a-surreal-environment-filled-with-numerous-obstacles.-The-person-is.webp?resize=300%2C300\u0026amp;ssl=1 300w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/08/DALL·E-2024-08-11-13.38.57-A-person-anxiously-waiting-to-receive-a-Top-Secret-security-clearance-depicted-in-a-surreal-environment-filled-with-numerous-obstacles.-The-person-is.webp?resize=768%2C768\u0026amp;ssl=1 768w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/08/DALL·E-2024-08-11-13.38.57-A-person-anxiously-waiting-to-receive-a-Top-Secret-security-clearance-depicted-in-a-surreal-environment-filled-with-numerous-obstacles.-The-person-is.webp?w=1024\u0026amp;ssl=1 1024w, https://i0.wp.com/steveblank.com/wp-content/uploads/2024/08/DALL·E-2024-08-11-13.38.57-A-person-anxiously-waiting-to-receive-a-Top-Secret-security-clearance-depicted-in-a-surreal-environment-filled-with-numerous-obstacles.-The-person-is.webp?w=936\u0026amp;ssl=1 936w\" sizes=\"(max-width: 150px) 100vw, 150px\"/\u003e\u003c/a\u003eThe type and depth of background investigations to get a security clearance depends on what level of classified information you will be working with. For example, if you just need access to Confidential or Secret material they would do a \u003ca href=\"https://www.ekentech.com/national-agency-check-with-law-and-credit\"\u003eNational Agency Check with Law and Credit (NACLC).\u003c/a\u003e The government will look at the FBI’s criminal history repository, do a credit check, and a check with your local law enforcement agencies. This can take a relatively short time (~3 months).\u003c/p\u003e\n\u003cp\u003eOn the other hand if you’re going to work on a \u003ca href=\"https://en.wikipedia.org/wiki/Sensitive_compartmented_information\"\u003eTop Secret/SCI\u003c/a\u003e project, this requires a more extensive (and much longer ~6-9 months) background check called a \u003ca href=\"https://acqnotes.com/acqnote/careerfields/single-scope-background-investigation\"\u003eSingle Scope Background Investigation\u003c/a\u003e (SSBI). Some types of clearances also require you to take a polygraph (lie-detector) test.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow Does the Government “Clear” you?\u003cbr/\u003e\n\u003c/strong\u003eThe \u003ca href=\"https://www.dcsa.mil/About/\"\u003eNational Background Investigation Services\u003c/a\u003e (NBIS) is the government agency that will investigate your background. They will ask about your:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDrugs and Alcohol (hard drugs, addiction, chronic drinking, etc.)\u003c/li\u003e\n\u003cli\u003eCriminal conduct (felonies..)\u003c/li\u003e\n\u003cli\u003eFinancial stability (they’ll run a Credit Bureau Report)\u003c/li\u003e\n\u003cli\u003eHow you’ve used IT systems (e.g. have you hacked any?)\u003c/li\u003e\n\u003cli\u003eUnited States allegiance\u003c/li\u003e\n\u003cli\u003eForeign influence (do you own property overseas? Foreign investments, etc.)\u003c/li\u003e\n\u003cli\u003ePsychological conditions and personal behavior.\u003c/li\u003e\n\u003cli\u003eTravel History (have you lived or gone to China, Russia, Iran, North Korea, Syria, etc.)\u003c/li\u003e\n\u003cli\u003ePlus, they will talk to your friends, relatives, current and ex-significant others, etc. to learn more about you\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePalantir’s Accelerated Student Clearance Plan\u003cbr/\u003e\n\u003c/strong\u003ePalantir wants their interns and new hires to hit the ground running and work on the toughest and most interesting government problems from day one. However, these types of problems require having a security clearance. The problem is that today, all companies start an application for a security clearance the day you show up for work.\u003c/p\u003e\n\u003cp\u003ePalantir’s idea? If you get an internship or full-time offer from Palantir \u003cem\u003ewhile you’re still in school\u003c/em\u003e, they will immediately employ you as a contractor. This will let them start your security clearance process while in school \u003cem\u003ebefore\u003c/em\u003e you show up for work. That means you will be cleared ~9 months later in time for your first day on the job. Think of this like a college early admissions program. (If you’re interning, Palantir will hold your clearance for you if you come back to Palantir the following year.)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy Do This?\u003cbr/\u003e\n\u003c/strong\u003eObviously this is a long-term strategic investment in Palantir’s college talent, but it also affects the entire defense ecosystem – to create a broader team of America’s best engineers who are able to support our country’s most critical missions. And they are encouraging other Defense Tech companies to implement a similar program.\u003c/p\u003e\n\u003cp\u003eI think it’s a great idea.\u003c/p\u003e\n\u003cp\u003eNow what are the other innovative ideas Silicon Valley can do to attract a national security workforce?\u003c/p\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\tFiled under: \u003ca href=\"https://steveblank.com/category/national-security/\" rel=\"category tag\"\u003eNational Security\u003c/a\u003e |\t\t\t\t\t\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-08-13T13:00:40Z",
  "modifiedTime": "2024-08-16T06:23:33Z"
}
