[
  {
    "id": "e90550a2-6ddc-43b0-aaca-14ab2ed9d115",
    "title": "Believe It or Not, This Is the It-Girl Shorts Trend of Summer 2025",
    "link": "https://www.whowhatwear.com/fashion/celebrity-style/boxer-shorts-trend-emily-ratajkowski",
    "description": "Confirmed by Emily Ratajkowski and Hailey Bieber.",
    "author": "Allyson Payer",
    "published": "Mon, 09 Jun 2025 23:28:12 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/DxpCEaBFMEvyUKcB8x4jzU.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Celebrity Style",
      "Fashion",
      "Celebrity"
    ]
  },
  {
    "id": "d0d4abbb-aac2-432c-ab3b-4828edcef003",
    "title": "A Closer Look: Gracie Lawrence's Tony Awards Ensemble Hits the Spot",
    "link": "https://www.whowhatwear.com/fashion/celebrity/gracie-lawrence-tony-awards-2025",
    "description": "An exclusive photo diary with the rising stage star!",
    "author": "Jessica Baker",
    "published": "Mon, 09 Jun 2025 23:10:56 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/mptZv6zSeUH5iPKmvHZXSn.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Celebrity",
      "Fashion"
    ]
  },
  {
    "id": "1b812f9f-e225-4488-953c-3ad6a422e28c",
    "title": "Lea Michele Put a Modern Twist on the Tuxedo With Her Tonys Awards Look",
    "link": "https://www.elle.com/fashion/celebrity-style/a65010517/lea-michele-getting-ready-diary-tony-awards-2025/",
    "description": "The actress graced the Radio City ceremony in custom Michael Kors.",
    "author": "",
    "published": "Mon, 09 Jun 2025 22:51:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "194f214b-2dfc-4b6c-bf59-f2931e6bde3d",
    "title": "Louis Vuitton Expands Its Iconic Vivienne Collection",
    "link": "https://www.elle.com/fashion/jewelry/g65011850/best-jewelry-launches-june-2025/",
    "description": "",
    "author": "",
    "published": "Mon, 09 Jun 2025 22:06:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "29371d5f-9509-407b-8a1b-131b0f433ac7",
    "title": "Skintight leggings or baggy joggers? What your gymwear says about you – and the world",
    "link": "https://www.theguardian.com/fashion/2025/jun/08/skintight-leggings-or-baggy-joggers-what-your-gymwear-says-about-you-and-the-world",
    "description": "Social media will tell you that all millennials dress one way to work out, while gen Z dresses another. The truth is more complex and far more interestingAround me, a group of women in skintight gym sets are side planking. Some are wearing full-coverage unitards, others leave slices of midriff bare. No one is wearing a baggy T-shirt from 2008 with a naked Rufus Wainwright on it, and hardened flecks of damp-proof paint. Except me.If TikTok is to be believed, my gym-mates must be millennials, born between the early 1980s and the mid-1990s; gen Z would find such skin-tightness a bit retro, or basic, or even “jurassic fitness”. Another generational schism has opened online – to add to socks, jeans and boundaries – this time over what millennials and gen Z are wearing to work out in. Tight-on-tight outfits supposedly single you out as a millennial – it is “giving middle school”, said one gen Z user witheringly – while gen Z prefers something baggier. Looking around me at pilates and in the park, though, I suspect some of the women wearing a second, seal-like skin are younger than 30. And here I am, days after turning 40 – squarely a millennial – wearing an enormous T-shirt. It is a muddled picture. Continue reading...",
    "author": "Ellie Violet Bramley",
    "published": "Sun, 08 Jun 2025 15:00:37 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Fashion",
      "Life and style",
      "Fitness",
      "Women"
    ]
  },
  {
    "id": "716214fd-a947-4a7e-8ab2-e06f09006d15",
    "title": "Rodeo drive: Beyoncé UK tour spurs cowboy fashion craze",
    "link": "https://www.theguardian.com/fashion/2025/jun/07/rodeo-drive-beyonce-uk-tour-kicks-off-cowboy-fashion-craze",
    "description": "Singer’s western-inspired Cowboy Carter tour is reminder of pop culture’s sway over shopping behaviourRhinestones, cowboy hats and a whole lot of denim; not a hen party entourage, a Glastonbury fit or a Nashville rodeo, but the queues outside Tottenham Hotspur Stadium this week, as Beyoncé kicked off her UK tour. And, seemingly, a new national dress code.Since the release of the Cowboy Carter album, Beyoncé fans have been quick to adopt the rancher style, sparking a surge in interest for western-inspired fashion. On Vinted, searches for “western” are up by 16% year on year this month, with “rodeo” up 13%. Meanwhile, denim searches have risen 8%. Continue reading...",
    "author": "Mabel Banfield-Nwachi",
    "published": "Sat, 07 Jun 2025 09:28:39 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Fashion",
      "Beyoncé",
      "Music",
      "Culture",
      "Life and style",
      "Pop and rock",
      "Country",
      "UK news"
    ]
  },
  {
    "id": "ff871e4d-03fc-4cfb-8db9-5c1dad4f6a99",
    "title": "Agentry PR Fall 2025 Internship Program - New York, NY",
    "link": "https://fashionista.com/2025/06/agentry-pr-fall-2025-internship-program-new-york-ny",
    "description": "Agentry PR is a full service marketing communications agency. We specialize within the fashion, lifestyle and entertainment sectors across all facets of marketing and public relations, from brand strategy and media outreach to events, sponsorships and VIP relations. Agentry currently houses and ...Continue reading",
    "author": "Winnie Liu",
    "published": "Mon, 09 Jun 2025 16:32:53 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MTk2NDEzNDQ2MDM0NTY0NTk0/agentry-pr-black-.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Job Listings",
      "Careers",
      "NYC Job Listings",
      "How To Make It",
      "Sponsored Content",
      "internships",
      "NYC",
      "agentry pr",
      "Network"
    ]
  },
  {
    "id": "1742e579-fcf1-45af-b9ec-72413c5c2f92",
    "title": "Must Read: Rachel Zoe Returns to Reality TV, L'Oréal Group Acquires Medik8",
    "link": "https://fashionista.com/2025/06/rachel-zoe-reality-tv-return-rhobh",
    "description": "These are the stories making headlines in fashion on Monday. Rachel Zoe is making her Hollywood comeback as she joins the Season 15 cast for \"The Real Housewives of Beverly Hills\" (RHOBH). She returns to reality TV more than a decade after ending her show, \"The Rachel Zoe Project.\" \"I've been ...Continue reading",
    "author": "Janelle Sessoms",
    "published": "Mon, 09 Jun 2025 16:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE1NDk4NjE1ODYxMjkwNTE1/rachel-zoe.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Acquisitions",
      "Shein",
      "Circular Design",
      "Network",
      "Chanel",
      "Real Housewives of Beverly Hills",
      "Loreal",
      "Recycling",
      "Rachel Zoe",
      "News"
    ]
  },
  {
    "id": "bca09fc9-1ddb-47dc-8433-098c24f56373",
    "title": "Tony Awards Unforgettable Looks: Cole Escola, Nicole Scherzinger, and More",
    "link": "https://www.nytimes.com/2025/06/09/style/tony-awards-fashion-red-carpet.html",
    "description": "Sequins and velvet and shorts, oh my!",
    "author": "The Styles Desk",
    "published": "Mon, 09 Jun 2025 14:05:36 +0000",
    "image": "https://static01.nyt.com/images/2025/06/09/multimedia/09TONYS-MOSTSTYLISH-top-lvgh/09TONYS-MOSTSTYLISH-top-lvgh-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Tony Awards (Theater Awards)",
      "Fashion and Apparel",
      "Theater",
      "Clooney, George",
      "Cravalho, Auli'i (2000- )",
      "Erivo, Cynthia",
      "Escola, Cole",
      "Groff, Jonathan",
      "McDonald, Audra",
      "Odom, Leslie Jr",
      "Paulson, Sarah",
      "Scherzinger, Nicole",
      "Trensch, Taylor"
    ]
  },
  {
    "id": "adfba1df-52b2-4b50-aa74-3fc8142aad88",
    "title": "Is It OK for Your Kids to ‘Rot’ all Summer?",
    "link": "https://www.nytimes.com/2025/06/08/style/summer-camp-kids-do-nothing.html",
    "description": "Some parents are choosing to forgo high-intensity camps and activities for their children in favor of weeks of unplanned time. Call it “kid rotting.”",
    "author": "Hannah Seligson",
    "published": "Sun, 08 Jun 2025 09:01:58 +0000",
    "image": "https://static01.nyt.com/images/2025/06/08/multimedia/08KID-ROTTING-lfwt/08KID-ROTTING-lfwt-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Summer Camps",
      "Children and Childhood",
      "Parenting",
      "Summer (Season)",
      "Travel and Vacations",
      "Child Care",
      "Prices (Fares, Fees and Rates)",
      "New York City",
      "Families and Family Life"
    ]
  },
  {
    "id": "68c8fbab-b48a-4482-96d9-d97eed0fac4b",
    "title": "The Second Kate Moss x Zara Collab Is The Ultimate Festival Wardrobe",
    "link": "https://www.refinery29.com/en-us/zara-kate-moss-collaboration?utm_source=feed\u0026utm_medium=rss",
    "description": "Right in time for festival season, the fashion icon herself, Kate Moss, is collaborating with Zara (who is celebrating 50 years) for second time on The Festival Collection. Following the success of the supermodel’s first Studio 54-inspired collaboration in 2024, these new rock ’n’ roll styles reminiscent of her Glastonbury days are sure to excite everyone.Moss, who designed the collection with long-time stylist Katy England, was inspired by “some of her most favorite festival pieces, including styles from thrift stores of small-town America to the most elevated boutiques of Paris and Milan,” according to a press release. Think: sparkly mini dresses, embroidered vests, biker boots, and stacked bangles.Speaking on these limited-edition pieces, Moss says: “Nothing matches the feeling of finding a one-off piece. Just wow. The piece that only you own.” And while others may cart up the same item from the collection as you, the nostalgic designs feel exclusive and help you stand out from the crowd thanks to the supermodel’s inimitable style.The womenswear collection — which is modeled by Moss’ equally cool daughter, Lila Moss — features everything from flowy blouses and lace matching sets to androgynous silk suits and go-go boots, with prices ranging from $25 to $400. Meanwhile, the menswear collection was designed by Primal Scream frontman Bobby Gillespie — Moss’ friend and England’s husband. Moss spoke about Gillespie’s influence on her own collection, explaining: “I expected it to be more about wafty dresses. But it’s a bit tougher than that. That’s because all the masculine energy was coming in from Bobby doing his collection at the same time […] We ended up going somewhere quite unexpected that I didn’t think we would.”As you plan your festival outfits, shop the collection online and in select stores today. Whether it’s a statement belt or moto jacket, Kate Moss x Zara promises to bring your ’90s off-duty supermodel dreams to life. Shop Zara x Kate Moss collaboration Like what you see? How about some more R29 goodness, right here?Zara Rings In 50 Years With a Supermodel CampaignThe Best Festival Outfits For Every Summer ConcertInside Our Summer Carts: Editor Fashion Must-Haves",
    "author": "Ebony-Renee Baker",
    "published": "Mon, 09 Jun 2025 13:52:16 +0000",
    "image": "https://www.refinery29.com/images/11901900.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "09ded937-8e57-4d34-b779-5b7dbe06db1a",
    "title": "The 22 Best Matching Sweatsuit \u0026 Lounge Sets To Live In Year-Round",
    "link": "https://www.refinery29.com/en-us/best-matching-sweatsuits-womens?utm_source=feed\u0026utm_medium=rss",
    "description": "As much as we love diving headfirst into the latest fashion trends, there’s no denying the magnetic pull of a matching sweatsuit or lounge set. They’re cozy, they’re comfy, they’re cute — and, when made with quality and care, they’re built to last. Plus, the versatility. Toeing the line between sporty athleisure and polished co-ords, sweatsuits are the ultimate shortcut to looking casual yet put-together. Throw one on when you can't be bothered to style an outfit. Or default to your favorite when tackling a week’s worth of chores in a few hours. Working remotely and need to feel slightly more “dressed” than your pajamas? Problem solved. And on travel days? Sweat sets are an MVP for curling up on chilly flights. Bonus: You can break up a set and wear each piece separately, unlocking endless mix-and-match potential for those moments when you actually want to plan an outfit.If you’re ready to retire those ratty, holey sweats that have seen you through college and countless days under your duvet (no judgment — we’ve all got that pair), consider yourself covered. Ahead, discover 22 top-quality, stylish sweatsuit sets from retailers we love and trust. Whether you’re looking for lightweight short sets and breathable cotton co-ords for warm weather or weighty and more structured layers for indoor hibernation mode, you’ll find your new go-to right here.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.EdiktedGirly bows and butter yellow?  We couldn’t click “add to cart” fast enough.edikted Bonney Bow Oversize Hoodie, $, available at Nordstromedikted Bonney Bow Detail Sweatpants, $, available at NordstromAerieAdd Bermuda shorts to your loungewear rotation with this ultra-airy summer set.Aerie OFFLINE Keep It 100 Terry Full Zip Hoodie, $, available at AerieAerie OFFLINE Keep It 100 Terry Foldover Long Short, $, available at AerieH\u0026MYou just can’t beat a melange gray sweatsuit in rotation, any time of year.H\u0026M 2-piece Sweatsuit, $, available at H\u0026MAritziaOf course, everyone's favorite shop for wardrobe basics has hoodies that \"hoodie\" better than most in existence. The Cozy Fleece fabric is like wearing a cloud, and this sun-faded pink? Summer perfection.Aritzia Cozy Sweatfleece Mega Zip Hoodie, $, available at AritziaAritzia Cozy Sweatfleece Perfect Hi-rise Mini Short, $, available at AritziaLululemonA Lululemon set for travel just makes sense. The plush fleece, roomy fit, and pockets make it practical yet undeniably cozy on early-morning flights — no wonder these are an internet sensation. Plus, the pants come in short, regular, and tall sizes, making the set even more versatile. Lululemon Scuba Mid-Rise Oversized Jogger Regular, $, available at LululemonLululemon Scuba Oversized Full-Zip Hoodie, $, available at LululemonRhone Another dreamy-soft fabric that’s somehow both crazy lightweight and warm — seriously, how?Rhone DreamGlow Half Zip, $, available at NordstromRhone DreamGlow Joggers, $, available at NordstromEverlaneGreenify your sweatsuit situation for spring in these bright coordinates from Everlane, crafted from lightweight cotton jersey.Everlane The Off-Duty Long-Sleeve Tee, $, available at EverlaneEverlane The Off-Duty Short, $, available at EverlaneFree-estWe’re long-time fans of Free People’s lounge and activewear offerings (especially FP Movement and Free-est), and this sweater knit set is a standout. Available in 12 colors, from easy neutrals to rich jewel tones, it’s perfect for everything from at-home happy hour to beach days.free-est Solar Sweater Set, $, available at Free PeopleZaraBring the bubble-hem trend to your downtime with this red-hot hoodie and mini-skirt set.Zara Oversized Lapel Cropped Sweatshirt, $, available at ZaraZara Balloon Mini Skirt, $, available at ZaraSplendidFound: your ultimate set for seaside days.Splendid Zip Up Stripe Hoodie, $, available at ShopbopSplendid Stripe Terry Shorts, $, available at ShopbopNegativeIf you haven’t tried Negative’s ready-to-wear, it’s time. Their layering tees are perfection, but when it comes to matching sweats, this ballet pink waffle set is choice. It even comes with a coordinating bra.Negative Waffle Knit Pullover, $, available at NordstromNegative Waffle Knit Jogger, $, available at NordstromNegative Waffle Knit Lounge Bralette, $, available at NordtromDressed In LalaWear your emotions on your matching sleeves… literally.Dressed In LaLa Lots of Feelings Checkerboard Sweater \u0026 Pants Set, $, available at NordstromDaily Practice by AnthropologieAnthropologie's label Daily Practice delivers casual loungewear with an elevated, everyday feel. This set caught our eye for its eyelet and mesh details — playful touches that also make it feel extra breathable for hot days.Daily Practice Rhythmic Lace Mesh Hooded Sweatshirt, $, available at AnthropologieDaily Practice Rhythmic Lace Mesh Sweatpants, $, available at AnthropologiePetal \u0026 PupConsider this your ultimate plane-to-poolside set.Petal and Pup Sunny Knit Shirt \u0026 Shorts Set, $, available at NordstromGapReaders have been loving Gap’s sweats of late, and these coordinates in coral-y pink make everything from WFH sessions to grocery runs and travel days a little brighter. Gap French Terry Wide-Leg Rolled-Hem Sweatpants, $, available at GapGap French Terry Oversized Crop Hoodie, $, available at GapAloAlo is best for its fashion-forward range of yoga attire and workout sets, but the sweatsuits are equally on point. Refinery 29 fashion director Irina Grechko swears by this set (which she has in gray and white) for peak cozy vibes. This new mint green is next on her list for summer.Alo Accolade Crew Neck Pullover, $, available at AloAlo Accolade Short, $, available at AloAviator NationWe love a summer stripe, especially in zippy neon.Aviator Nation 5 Stripe Relaxed Zip Hoodie, $, available at ShopbopAviator Nation 5 Stripe Sweatpants, $, available at ShopbopAbercrombie \u0026 FitchEveryone loves Abercrombie’s jeans, but its activewear and loungewear deserve a shoutout. This boatneck sweatshirt is just the thing for your next hot girl walk when paired with the coordinated joggers.Abercrombie and Fitch Sunday Slash Top, $, available at Abercrombie and FitchAbercrombie and Fitch Essential Sunday Sweatpant, $, available at Abercrombie and FitchMangoChannel those Y2K vibes with this pretty sea green velour set — ideal for summer.Mango Velour Sweatshirt with Soft Touch, $, available at MangoMango Soft-Touch Velour Pants, $, available at MangoOld NavyThis aqua shorts set is screaming beachside lounging, whether that’s your reality or a daydream.Old Navy SoComfy Graphic Sweatshirt, $, available at Old NavyOld Navy Extra High-Waisted SoComfy Sweat Shorts, $, available at Old NavyPangaiaPangaia brings bold colors and sustainable materials to your downtime style. If you’re a color lover, this peachy set is a so-fun and eco-friendly take on loungewear.Pangaia 365 Midweight Hoodie, $, available at PangaiaPangaia 365 Midweight Track Pants, $, available at PangaiaSpanxSlip into this classic navy sweatsuit, where the ultra-soft and airy fabric feels like a gentle cloud against your skin.SPANX AirEssentials Half Zip, $, available at SPANXSPANX AirEssentials Wide Leg Pant, $, available at SPANXJenni KayneJenni Kayne — a.k.a. everyone's favorite luxury knitwear designer —  brings the same softness to the label’s matching sweat sets. This one is the definition of low-key luxury.Jenni Kayne Saturday Sweatshirt, $, available at Jenni KayneJenni Kayne Saturday Sweatpant, $, available at Jenni KaynePerfectDD This one’s for the full-busted girls. Alice Kim launched PerfectDD after struggling to find pieces that fit her petite frame and size 32DD breasts. The designs are tailored with extra room at the bust only — no tent-like fits here (IYKYK). Sizes accommodate DD to M cups.Perfectdd Charisse L/S Sweatshirt, $, available at PerfectddPerfectdd Sweat Shorts, $, available at PerfectddLike what you see? How about some more R29 goodness, right here?14 Comfy Sweatpants R29 Editors \u0026 Readers Swear ByBest Free People Summer Co-Ords \u0026 Matching SetsThese Lululemon Pieces Make Perfect Travel Outfits",
    "author": "Esther Newman",
    "published": "Fri, 06 Jun 2025 14:03:46 +0000",
    "image": "https://www.refinery29.com/images/11901562.jpeg?auto=webp\u0026width=3900\u0026height=5980\u0026quality=85\u0026crop=15:23",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "bdc65d83-b42b-4ecb-b644-df84113bd79d",
    "title": "JBW Watches Review: Everything You Need To Know",
    "link": "https://www.fashionbeans.com/article/jbw-watches-review/",
    "description": "When it comes to the subject of wristwatches and ‘Bling,’ at what point is enough, enough? Some might argue you can never have too much and that’s undoubtedly the case with JBW watches. Just Bling Watch, mostly known as JBW, is a watch brand with no qualms about flashing reflective rocks in your face—particularly those … Continue reading JBW Watches Review: Everything You Need To Know →",
    "author": "FashionBeans Team",
    "published": "Sun, 08 Jun 2025 21:07:16 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Men's Watches"
    ]
  },
  {
    "id": "2b6ffaa0-37f7-41c3-9f09-c08b3b6d7f6b",
    "title": "7 Shoes Like Hey Dude – Similar Alternatives For Men 2025",
    "link": "https://www.fashionbeans.com/article/shoes-like-hey-dude/",
    "description": "Whether you’re looking for something more affordable, unique, or just an alternative to those old high school canvas slip ons, there are a lot of shoes like Hey Dude out there. The Italian brand is synonymous with casual slip-on loafer-style shoes made for comfort and functionality, but they aren’t the only option for this type … Continue reading 7 Shoes Like Hey Dude – Similar Alternatives For Men 2025 →",
    "author": "Rachel Cascella",
    "published": "Sun, 08 Jun 2025 11:16:42 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Men's Fashion"
    ]
  },
  {
    "id": "b1143eb4-e08e-4c85-b1be-456da7945afa",
    "title": "Hailey Bieber's Simple Black Bikini Is All the Talk - Shop the Look",
    "link": "https://www.popsugar.com/fashion/see-hailey-bieber-best-bikinis-swimsuits-49135775",
    "description": "Hailey Bieber remains the reigning queen of bikini pics. The 28-year-old has been choosing two-pieces over maillots for years, and her Instagram feed is proof. Bieber tends toward strappy looks with unexpected ties at the center of the bust or rising high on her hips, and she never shies away from a cheeky thongkini moment. When it comes to finishing off her beach or poolside look, Bieber has experimented with everything from body chains and her signature gold hoops to baseball caps, bucket hats, and bangles. She also loves to flaunt layered beaded necklaces and usually opts for a natural makeup look. Her latest bikini moment came all at once, powered by lemon drops and Rhode, which she recently sold to e.l.f. Cosmetics for a cool $1 billion. And she's not slowing down: Bieber just announced the launch of her long-awaited Rhode Glazing Mist, dropping June 24, and the sun-drenched aesthetic of her bikini shots feels like a perfect preview of what's to come. But that's not the only swimsuit on her roster worth talking about. Keep reading to see her looks, and how you can recreate the latest one.",
    "author": "Sarah Wasilak",
    "published": "Mon, 09 Jun 2025 11:57:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/uz4qEN0eos0yK0z-HtN9v2i3MtY/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/06/09/747/n/1922564/da60a44b684712179d83a6.72988354_.png",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Hailey Bieber",
      "Swimwear",
      "Models",
      "Bikinis",
      "Fashion Shopping",
      "Celebrity Style"
    ]
  },
  {
    "id": "fc9db169-f2e9-433a-af2c-46c30f818d6e",
    "title": "Miley Cyrus’s Naked Dress Has Over 50 Crystals - Shop the Trend Here",
    "link": "https://www.popsugar.com/fashion/sheer-trend-49440961",
    "description": "Miley Cyrus is no stranger when it comes to bringing her sartorial A-game and her latest outfit for the visual album, \"Something Beautiful\" rollout is clear proof. From a punk-rock leather ensemble from Chanel to going completely shirtless under a black pinstripe suit, the superstar is in her takeover era. Most recently, the superstar attended the Tribeca Film Festival in her boldest look yet - a naked dress. Brilliantly styled by her longtime stylist, Bradley Kenneth, the singer donned a net dress from Schiaparelli by Daniel Roseberry's spring/summer 2025 collection layered over a nude bodysuit. But it's not just any average sheer dress. The piece that perfectly depicts Cyrus's iconic renaissance, featured crystal embellishments all throughout, a plunging neckline, and a skirt made of off-white fringe fabric. in New York City, she opted for a SS25 Schiaparelli by Daniel Roseberry net dress. The plunging naked dress that was decorated with countless sparkly crystal embellishments. She also wore a matching fringe coat, a cream clutch, and cream pointed-toe heels. And of course, the artist's hair was no matter to gloss over; voluminous curls with a side part. The \"Flowers\" singer's latest outfit also speaks to the resurgence of the naked dress trend. Countless celebrities have rocked the silhouette throughout the years, with stars like Kylie Jenner and Doechii having worn sheer dresses as of late, from the Billboard Women in Music Awards to the Met Gala. And these stars prove the trend has graduated from your average see-through slip to more innovative designs - from cutouts with sheer overlays in full-coverage dresses to see-through catsuits. Of course, we've gathered some of the best sultry styles for every style, shape, and occasion that will help you nail the trend. Whether you're headed to a much-needed girls' night out or gathering looks for your bestie's tropical bachelorette, we have options just for you, even as low as $20. From an unconventional take on the LBD to sheer pants for your warm-weather evening soirées, shop our top sheer finds ahead.",
    "author": "Naomi Parris",
    "published": "Mon, 09 Jun 2025 10:30:14 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/bVZYxN4Sfy1WaU-Lh7gtojac82E/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/06/09/737/n/1922564/1cb34b8e68470eee574f12.44963605_.png",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Met Gala",
      "Fashion Shopping",
      "Fashion Trends",
      "Dresses",
      "Shopping Trends"
    ]
  }
]
