[
  {
    "id": "9953231d-b8d2-40d7-99d7-394a1d0272ba",
    "title": "I've Just Found *the* Denim Trend Parisian Women Are Wearing With Kitten Heels",
    "link": "https://www.whowhatwear.com/fashion/trends/parisian-denim-trend-kitten-heels-nordstrom-anniversary-sale-2025",
    "description": "Did I mention it's on sale?",
    "author": "Josephine Hadjiloucas",
    "published": "Mon, 21 Jul 2025 21:18:21 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/Cq46kzRiEGLHTN65oN8TsS-1280-80.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Trends",
      "Fashion"
    ]
  },
  {
    "id": "54d90d5c-b36e-4a99-9309-bdb69f8f5be8",
    "title": "6 Summer Prints You'll Find Everywhere—From Happier Grocery in NYC to LouLou in Saint-Tropez",
    "link": "https://www.whowhatwear.com/fashion/trends/summer-print-trends",
    "description": "Here's what the fashion set can't get enough of.",
    "author": "Kristen Nichols",
    "published": "Mon, 21 Jul 2025 21:00:00 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/feZYmnXaKAfemaQbQKgQse-1280-80.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Trends",
      "Fashion"
    ]
  },
  {
    "id": "91c09e0a-1c2f-411b-ac9d-571009cb24e9",
    "title": "Only Tracee Ellis Ross Could Bring the South of France to the Streets of New York",
    "link": "https://www.elle.com/fashion/celebrity-style/a65467375/tracee-ellis-ross-jacquemus-street-style-photos/",
    "description": "And in fresh-off-the-runway Jacquemus, too.",
    "author": "",
    "published": "Mon, 21 Jul 2025 21:15:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "64de7879-8b6f-475c-aaa4-2b98e30b4b61",
    "title": "These Summer 2025 Sunglasses Trends Have Some Serious Staying Power",
    "link": "https://www.elle.com/fashion/trend-reports/a65450004/summer-2025-sunglasses-trends/",
    "description": "Seen enough this season? Try these on for size.",
    "author": "",
    "published": "Mon, 21 Jul 2025 20:58:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "e688d214-c380-47d1-9b15-b6f148d333d4",
    "title": "From budget sunnies to the perfect semi-short shorts: 69 summer style updates and hacks",
    "link": "https://www.theguardian.com/thefilter/2025/jul/20/summer-style-fashion-must-haves-and-hacks",
    "description": "Need a classic swimsuit for less than £40? A hat that’s easy to pack? Or the perfect beach-to-bar T-shirt? Make this summer a breeze with our fashion experts’ top tipsThere is a very specific panic around summer dressing – all that flesh on show, for starters. So it always seems strange just how little thought we give to it. Obviously you care what you look like, but think how much time and energy you put into finding the perfect winter coat, or boots to see you through the post-Christmas doldrums. Some of you probably save up, or at least try on a few different styles to see what you like. Compare that to choosing a swimsuit or shorts. How often do you buy something the day before you go on holiday, or even at the airport? You’ll probably spend more time in your coat and boots but still, it’s a bit daft panic-buying some sandals before finding out, mid-hike, that the back strap rubs your heel and they slip off the moment your feet get sweaty.The truth is that aside from the fact that people equate wearing fewer clothes with being cooler – not true! – it’s very hard to know what to wear when the sun comes out. So we are here to help. How about a tank that needs no bra, a swimsuit that doubles as a top, and a quick-dry, no-towel towel? Or a T-shirt for the guys that’s cocktail-approved – and a hat the kids will actually wear? Continue reading...",
    "author": "Jess Cartner-Morley, Melanie Wilkinson, Morwenna Ferrier and Chloe Mac Donnell",
    "published": "Sun, 20 Jul 2025 05:00:42 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Fashion",
      "Life and style",
      "Women's swimwear",
      "Dresses",
      "Women's shoes",
      "Women's shorts",
      "Men's tops",
      "Men's shorts",
      "Accessories",
      "Women's tops",
      "Women's trousers",
      "Hats",
      "Men's trousers"
    ]
  },
  {
    "id": "2d310166-7c1c-4229-a853-5a4d20ff2bd4",
    "title": "‘Rage bait’ or good design? The Row’s £600 sliders are an exquisite provocation",
    "link": "https://www.theguardian.com/fashion/2025/jul/19/rage-bait-good-design-ama-600-sliders-the-row",
    "description": "The foam footwear is selling fast at the high-end store in London but the price remains controversialRounded, cushioned and with a thick strap, foam sliders have been a familiar sight on feet this summer. While they are available for £30 from Adidas or £3.49 on the online marketplace Temu, a high-fashion version is now also on offer. The Ama sliders, in a choice of black, red or white, were launched by the American fashion brand The Row this week. They cost £600.Laura Reilly, the writer of the influential fashion newsletter Magasin, called them “The Row’s latest rage bait”, using the name for posts online designed to provoke anger, and go viral in the process. Continue reading...",
    "author": "Lauren Cochrane",
    "published": "Sat, 19 Jul 2025 07:00:14 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Fashion",
      "UK news",
      "Luxury goods sector",
      "Business",
      "Life and style",
      "Fashion industry"
    ]
  },
  {
    "id": "43aadb25-1a90-4d59-b98f-44699b1438ce",
    "title": "The Trader Joe’s Tote Bags Have Made It to London",
    "link": "https://www.nytimes.com/2025/07/21/style/trader-joes-tote-bags-london.html",
    "description": "The bags from the supermarket chain are becoming increasingly popular, even though the store doesn’t operate in Britain.",
    "author": "Desiree Ibekwe",
    "published": "Mon, 21 Jul 2025 14:57:36 +0000",
    "image": "https://static01.nyt.com/images/2025/07/15/multimedia/ST-TJ-TOTE-LONDON-ltkm/ST-TJ-TOTE-LONDON-ltkm-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Handbags and Purses",
      "Supermarkets and Grocery Stores",
      "Trader Joe's",
      "London (England)"
    ]
  },
  {
    "id": "afd83418-03ce-4b99-8966-9ced4a800586",
    "title": "The Bag of Summer Is a BAB",
    "link": "https://www.nytimes.com/2025/07/21/style/bab-bag-of-summer.html",
    "description": "No longer written off for being “ludicrously capacious,” oversize bags are building up a fan base on social media.",
    "author": "Nicole Stock",
    "published": "Mon, 21 Jul 2025 20:35:11 +0000",
    "image": "",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Handbags and Purses",
      "Social Media",
      "Miu Miu (Fashion Label)",
      "TikTok (ByteDance)",
      "Anthropologie"
    ]
  },
  {
    "id": "cbb0030a-23f7-41ec-971f-2b4a56fe0275",
    "title": "Must Read: Former CaaStle CEO Indicted in $300 Million Fashion Rental Fraud Case, New York City's Garment District Faces Threats",
    "link": "https://fashionista.com/2025/07/christine-hunsicker-caastle-former-ceo-indicted",
    "description": "These are the stories making headlines in fashion on Monday. Christine Hunsicker, former CEO of fashion rental company CaaStle, surrendered to authorities on Friday after the U.S. Attorney's office in Manhattan indicted her on charges of wire fraud, securities fraud, money laundering, making false ...Continue reading",
    "author": "Brooke Frischer",
    "published": "Mon, 21 Jul 2025 16:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE2NDczNDcxMTYzNTczNzc5/christine-hunsicker-caastle-former-ceo-indicted.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Lawsuits",
      "News",
      "greenwashing",
      "Ulta",
      "The Garment District",
      "lawsuit",
      "Target",
      "fraud",
      "B Corp",
      "Network",
      "Wellness",
      "Target ",
      "Garment District"
    ]
  },
  {
    "id": "3f0523c5-14dd-497d-81fd-f50685abf4d8",
    "title": "ICYMI: Meryll Rogge Named Marni Creative Director, Must-See Fashion Documentaries \u0026 Is the Environmental Working Group Legit?",
    "link": "https://fashionista.com/2025/07/fashion-news-you-need-to-know-july-19",
    "description": "In case you missed them, we've rounded up our most popular stories of the week to help you stay in the loop. No need to thank us — just toast a cappuccino in our honor when you're discussing who did what over your cheese danish. Homepage photo: Courtesy of Marni Fashionista's audience includes 1 ...Continue reading",
    "author": "Fashionista",
    "published": "Sat, 19 Jul 2025 12:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE2MzMzMDQ2NjcwOTU5OTgz/meryll_rogge_portrait.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Network",
      "News",
      "ICYMI"
    ]
  },
  {
    "id": "eb7e1e71-aecf-4cad-9746-0c4c3c18995f",
    "title": "The 27 Summer Fashion Must-Haves R29 Editors Swear By",
    "link": "https://www.refinery29.com/en-us/summer-clothes-shoes-accessories-2025?utm_source=feed\u0026utm_medium=rss",
    "description": "As Addison Rae blasts in our headphones, hot dogs sizzle on the grill, sand collects in beach bags, and European vacation plans get finalized, we’re deep in summer mode. And at Refinery29, that means leaning into the good vibes (and hot temps) with fashion that matches the mood.Right now, we’re all about our go-to denim shorts and easy summer dresses, plus heat-wave-ready accessories like comfortable sandals and and baseball caps — the kind that instantly pull a look together. We’ve also included the travel MVPs making it into our packed bags to build the best vacation outfits. Think: Foldable ballet flats, blister-proof socks, water-resistant anklets, and so-fun matching sets. Ahead, find 27 editor-approved pieces we’re wearing on repeat — from reader-favorite brands like Lululemon, Madewell, and Vivaia to new discoveries like Chord, Shezza, and Anonymous Copenhagen.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.For more can't-miss shopping stories delivered straight to your inbox, sign up for our Most Wanted newsletter.Lululemon Court Rival High-Rise Short 3”“I bought these Lululemon shorts last year… and then again this year in more colors because I wear them nonstop. I recently picked up the black with white piping — they’re lightweight, breathable, and technically designed for tennis and running (I do neither). The mesh liner keeps me cool in 95-degree heat, and they work just as well with a comfy T-shirt and they do with a nicer top for work.” — Lisa Dionisio, Newsletter DirectorShop LululemonLululemon Court Rival High-Rise Short 3\", $, available at LululemonOnitsuka Tiger Mexico 66 Sneaker“I’ve wanted these sneakers forever, and I’m so glad they’re finally in my summer shoe rotation. Famously worn by Uma Thurman in Kill Bill, the Mexico 66 silhouette is slim and sexy — and even better in this shiny silver hue. I added yellow hiking laces (a nod to the OG yellow pair), and now they make a statement with every single outfit.” — Alicia Lansom, Culture EditorShop FarfetchOnitsuka Tiger MEXICO 66 Sneakers, $, available at FarfetchPhoto: Courtesy of Alicia Lansom.Tree of Life Peace Angel Dress “I have never felt as pretty — or more myself — than I did in this dress. I truly felt like a fairy princess at a recent wedding, especially when I found a rose garden to twirl about in. It’s from Tree of Life, an Australian brand that creates the ethereal, boho clothes of my dreams. The corset-like cinch hugs my curves beautifully, but is fully adjustable, so it’s super comfortable (perfect for post-dinner bloating or dancing all night). Made of breathable cotton, it kept me cool even on a sweltering day. FYI: My dark purple version is no longer available, but the brand just launched this gorgeous chocolate brown iteration (and more colors are always dropping).” — Esther Newman, Affiliate WriterShop Tree of LifeTree Of Life Peace Angel Dress, $, available at Tree of LifePhoto: Courtesy of Esther Newman.FitFlop Lulu Resin-Buckle Leather Back-Strap Sandals“I'm extremely practical about summer shoes: I want lightweight sandals with real arch support and secure straps, preferably with a little lift. This pair ticks all the boxes. The heavily cushioned midsole weighs next to nothing and keeps my feet comfortable even after a whole day of walking around in the city. The tortoiseshell buckles look polished with some of my dressier outfits, and the slip-resistant outsole has come in handy during sudden British downpours.” — Venus Wong, Senior WriterShop FitFlopLulu Resin-Buckle Leather Back-Strap Sandals, $, available at FitFlopPhoto: Courtesy of Venus Wong.Aerie Good Day Button Down Shirt \u0026 Short“I’ve been living in this matching Aerie set all summer long. The oversized button-down top and elastic-waist shorts don’t cling in the heat —  a major win. The nautical stripes are a vibe, and while it’s my go-to beach coverup, I’ve also worn it to festivals and packed it for trips.” — Victoria Montalti, Associate Fashion WriterShop AerieAerie Good Day Button Down Shirt, $, available at AerieAerie Good Day Short, $, available at AeriePhoto: Courtesy of Victoria Montalti.Ece London The Aphrodite Baroque Pearl Ring“If you want jewelry that looks like it came from a Pirates of the Caribbean treasure chest, put Ece London on your radar. Think molten gold that looks washed ashore, mythological motifs, raw gemstones, and delicate hand-carved details. I picked out this baroque pearl ring to fulfill my fantasy of being a secret, landlocked mermaid (blame the solid diet of The Little Mermaid, H20: Just Add Water, and Aquamarine movies that I grew up on).” — Esther Newman, Affiliate WriterShop Ece LondonEce London The Aphrodite Baroque Pearl Ring, $, available at Ece LondonPhoto: Courtesy of Esther Newman.Farm Rio Off-White Fresh Table Midi Skirt“A scroll past this Farm Rio skirt on Instagram, and I was instantly enchanted, immediately knowing it was the one for my birthday. The picnic-inspired print is joyful and unexpected — a standout in a sea of florals and palms. It’s part of a matching set, but I prefer styling it solo with a bright cotton tee so the print gets all the attention.” — Venus Wong, Senior WriterShop Farm RioFarm Rio Fresh Table Lenzing Ecovero Euroflax Midi Skirt, $, available at Farm RioPhoto: Courtesy of Venus Wong.Vivaia Round-Toe Satin Sneakerina“Charli XCX made me do it. I saw her wearing these blush pink sneakerinas with denim shorts at a festival, and was instantly fixated. They’re super padded, unlike a lot of ballet flats, and actually comfortable. I wear mine with black capris because I’m not as insouciantly cool as Charli, but still feel on point.” — Susan Devaney, Lifestyle DirectorShop VivaiaVivaia Round-Toe Satin Sneakerina, $, available at VivaiaPhoto: Courtesy of Susan Devaney.Summer Away Deia Shorts“Okay, I’m decidedly not a shorts person. And yet — here I am, inching my way out of my comfort zone. And what better gateway than a zany green striped short? The mid-thigh length feels polished enough to dress up, while still delivering carefree summer fun. Also: no chafing (bless). Styled with an oversized button-down and low heels, I’m somehow comfy and feeling myself. A new era.” — Laura Lajiness Kaupke, Contributing Editor Shop Summer AwaySummer Away Deia Shorts, $, available at Summer AwayPhoto: Courtesy of Laura Lajiness.Chord Ivory Bouclé Cap“I have plenty of baseball hats, but I’ve long struggled to find a quality, minimalistic one without a logo that actually fits well. This high-end brand nails the details: luxe hardware, leather strap closure, and, most importantly, a brown sweatband that hides makeup stains. While the brand offers styles in a range of fabrications from cotton to denim, I love this textured bouclé version that I’ve worn nonstop since it arrived.” — Irina Grechko, Fashion DirectorShop ChordChord Ivory Bouclé Cap, $, available at ChordPhoto: Courtesy of Irina Grechko.Anonymous Copenhagen Sessi 40 Hand-Braided Heel“I’ve had a horrific time finding a smart summer shoe. I live in loafers and find the idea of wearing sandals in the city the stuff of nightmares. But the rise of braided ballet flats and kitten heels in my feed felt like a sign. This pair from Anonymous Copenhagen is exactly what I was looking for: buttery-soft leather, a block heel for height without pain, and handcrafted quality (these are by skilled artisans in Portugal and Italy). These are my date-night, special-occasion, and summer-wedding shoes.” — Alicia Lansom, Culture EditorShop Anonymous CopenhagenAnonymous Copenhagen Sessi 40 Hand-Braided, $, available at Anonymous CopenhagenPhoto: Courtesy of Alicia Lansom.\u0026 Other Stories Alpaca-Blend Knit Cardigan \u0026 Nobody’s Child Broderie Anglaise Maxi Skirt“When in doubt, I always go back to this outfit formula: white skirt, red top, red ballet flats. It’s sweet, timeless, and just feels like summer — fresh berries, picnics, classic gingham, and listening to Lana Del Rey on repeat. (Don’t ask me why, but she’s a red-and-white vibe to me.)” — Esther Newman, Affiliate WriterShop Nobody’s Child\u0026 Other Stories Alpaca-Blend Knitted Cardigan, $, available at \u0026 Other StoriesNobody's Child Broderie Anglaise Maxi Skirt, $, available at Nobody's ChildPhoto: Courtesy of Esther Newman.Jenny Bird Dane Anklet \u0026 Dhani Anklet“I wear Jenny Bird jewelry on the regular, and these anklets are my latest obsession. The Dane is like an ankle bangle — sleek, oval-shaped, and water-resistant. The hidden closure is genius. I’ve been pairing it with the chunky chainlink Dhani anklet in the 10-inch sizes for a fresh, stacked look.” — Victoria Montalti, Associate Fashion Writer  Shop Jenny BirdJenny Bird Dane Anklet, $, available at Jenny BirdJenny Bird Dhani Anklet, $, available at Jenny BirdPhoto: Courtesy of Victoria Montalti.Madewell Poplin Smocked Maxi Dress“I’m a dress girl through and through. Correction: I’m a long dress girl. Come summer, the only viable option on the hottest days is a non-clingy cotton style — and this one from Madewell is my ideal. The length? Perfection. The smocking? Skims the body just right without feeling suffocating. And the red? The exact punchy shade I reach for in the summer.” — Laura Lajiness Kaupke, Contributing Editor Shop MadewellMadewell Poplin Smocked Maxi Dress, $, available at MadewellPhoto: Courtesy of Laura Lajiness.Toms x Jamie Mizrahi Alp FWD Slip-On Sneaker“So soft, so comfy, so vibrant. These are the ultimate everyday summer shoes. I usually need time to break this shape in, but these felt perfect from the get-go. The bright purple feels so summery and fun, adding color without being over the top. They look like flower petals and feel just as gentle on my feet.” — Tanyel Mustafa, Senior WriterShop TomsToms x Jamie Mizrahi Alp FWD Slip-On Sneaker, $, available at TOMSPhoto: Courtesy of Tanyel Mustafa.Gap × Dôen Eyelet Top“I was so excited for the second Gap x Dôen collab and shopped early to snag this cotton eyelet top. It’s a signature Dôen silhouette — airy, embroidered, and easy to style with jeans, skirts, or even office trousers. A perfect summer staple.” — Lisa Dionisio, Newsletter DirectorShop GapGap x Dôen Eyelet Top, $, available at GapPhoto: Courtesy of Lisa Dionisio.Vagabond Vivian Pumps “I just can’t hack heels anymore. I’ve become that girl walking barefoot home from events — someone I vowed never to be. But then I wore these Vagabond courts to a wedding and didn’t want to take them off. Yes, I felt short at 5’1”, but these shoes were so cute, it didn’t matter. They work for everything — office, date nights, travel  — and the block-y shape adds edge and polish to any look.” — Kelly Washington, Senior Social EditorShop VagabondVagabond Vivian Pumps, $, available at VagabondPhoto: Courtesy of Kelly Washington.Levi’s High Rise Baggy Linen+Denim Lightweight Shorts“These are easily some of the most comfortable shorts I own — the linen-denim blend is breathable, lightweight, and made for hot days. They’re not stretchy, but the mid-thigh cut and wider hems offer coverage without riding up or chafing. I’ve been reaching for them daily.” — Victoria Montalti, Associate Fashion Writer  Shop Levi’sLevi's High Rise Baggy Linen+Denim Lightweight Shorts, $, available at Levi'sPhoto: Courtesy of Victoria Montalti.Rothy’s The Square Mary Jane“I got these Mary Janes at the end of last summer and they’ve been my go-to for every warm-weather moment since. They’re incredibly comfortable and a must-pack for trips — they bend easily and tuck into any suitcase crevice. Plus: The bright red adds the perfect pop to my otherwise minimal summer looks.” — Irina Grechko, Fashion DirectorShop Rothy’sRothy's The Square Mary Jane, $, available at Rothy'sPhoto: Courtesy of Irina Grechko.Maison de Sabré The Sabrémoji Lime Fruit Charm“I’m a big Maison de Sabré fan — their (sold-out) Little Miss Bad charm lives on my work bag. This lime fruit style is the latest star of my bag charm collection. It’s summery and fun, complements my Kelly green shoulder bag, and is surprisingly functional — it fits an Apple AirTag.”  — Victoria Montalti, Associate Fashion WriterShop Maison de SabréMaison de Sabré The SABRÉMOJI Fruit Charm, $, available at Maison de SabréPhoto: Courtesy of Victoria Montalti.Minka Dink London The Esme Blouse“I’ve been into oversized shirts for ages, but needed a switch-up for summer. This ruched blouse from Minka Dink is fitted in all the right places, has the sweetest sleeve frills, and features mother-of-pearl buttons. While it looks like it could be tight and uncomfortable, the 100% cotton is super breathable — perfect for work or play. (Bonus: It now comes in a lemon yellow).” — Alicia Lansom, Culture EditorShop Minka Dink LondonMinka Dink London The Esme Blouse, $, available at Minka Dink LondonPhoto: Courtesy of Alicia Lansom.Shezza Lace Socks“My Dr. Martens 1461 Bex Oxfords have gathered dust for two years because they destroy my ankles — until now. Shezza socks have built-in heel padding, and they’ve totally changed the game. These lace ones look great with my Docs, ballet flats, and Mary Janes. I also got the black crew socks for Glastonbury — fingers crossed they save my feet from festival miles.” — Esther Newman, Affiliate WriterShop ShezzaShezza Lace Socks, $, available at ShezzaPhoto: Courtesy of Esther Newman.Dr. Scholl's x Favorite Daughter Heartbreak Sandal“Dr. Scholl’s clog sandals were already iconic — now they’re even better, thanks to this new Favorite Daughter collaboration. The croc leather uppers and kitten heel give them a more evening update. I went with the chocolate brown, and I’m obsessed. Paired with a mini skirt, dress, or capris, they make me feel like I stepped out of a ‘90s rom-com or early-aughts episode of Sex and The City.” — Victoria Montalti, Associate Fashion Writer  Shop Dr. Scholl’sDr. Scholl's x Favorite Daughter Heartbreak Sandal, $, available at Dr. Scholl'sPhoto: Courtesy of Victoria Montalti.Paige Dani Short“I’ve been hunting for denim shorts with a flared, A-line silhouette that aren’t uncomfortable — and these are it. The denim is soft and lived-in, making them great for travel, and the contrast stitching and pintuck pleat give off a ’70s vibe I love, especially with a brown leather belt. I’ll be living in these all summer.” — Venus Wong, Senior WriterShop PaigePAIGE Dani Short, $, available at PAIGEPhoto: Courtesy of Venus Wong.Birkenstock Florida Fresh Nubuck Leather Sandals“I live, laugh, love in my Birks. My OG Arizonas have lasted six years, but I wanted a pair that felt a little more refined for everyday wear — enter the Florida Fresh. The slimmer straps and soft sage hue are a perfect match for light denim and summer whites.” — Esther Newman, Affiliate Writer Shop BirkenstockBirkenstock Florida Fresh, $, available at BirkenstockPhoto: Courtesy of Esther Newman.Sach Atelier Hail Belt “Sach Atelier has been flooding my feed lately, and for good reason. This handmade, non-leather belt blends South Asian jewelry traditions with Y2K energy. The mirrored silver threading adds a bold touch to floaty skirts or jeans — I’m deeming it my pop princess concert fit essential. — Alicia Lansom, Culture EditorShop Sach AtelierSach Atelier Hail Belt, $, available at Sach AtelierPhoto: Courtesy of Alicia Lansom.Peachaus Striped Ethical-cotton Pyjama Shorts“These boxer shorts have become my top pick from Peachaus’s lightweight cotton set. I wear them for nearly everything — sleeping, working from home, lounging in the garden, even brunch with a chunky knit and biker boots. I’m already planning to grab a few more colors for summer.” — Esther Newman, Affiliate WriterShop PeachausPeachaus Lomandra Striped Ethical-Cotton Pyjama Shorts, $, available at PeachausPhoto: Courtesy of Esther Newman.Like what you see? How about some more R29 goodness, right here?R29 Editors' Top Nordstrom Anniversary Sale Picks15 Trending June Products Our Readers LovedBest Summer Fashion Picks Under $150",
    "author": "Victoria Montalti",
    "published": "Mon, 21 Jul 2025 18:38:19 +0000",
    "image": "https://www.refinery29.com/images/11919705.jpg?auto=webp\u0026width=2000\u0026height=2667\u0026quality=85\u0026crop=2000:2667",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "c7aa52e0-ae89-4567-9dfa-9e4abfeafe30",
    "title": "Cakes’ TikTok-Famous Nipple Covers Are 30% Off Right Now",
    "link": "https://www.refinery29.com/en-us/cakes-body-review?utm_source=feed\u0026utm_medium=rss",
    "description": "In an ideal world, I’d never wear a strapless bra again. No hate to them, but with summer finally here, I can’t think of a more unappealing undergarment when it comes to tiny-tank-top-and-strappy sundress season — the marks that it leaves on the hot skin, the constricting material, the underboob sweat marks, the constant slipping… As if my phone was listening to my innermost thoughts (I’m not convinced that it isn’t, for the record), my social feeds started to get flooded with ads for Cakes, a brand of nipple covers that has intrigued me since first making rounds on TikTok over a year ago. After first becoming popular for its Grippy Cakes, adhesive-free nipple covers, the brand has more recently unveiled the heat wave-friendly Sticky Cakes, which have a tacky, adhesive layer to offer more support (and peace of mind). Cakes’ nipple covers come in a few different sizes ( “itty bitty” for AAA-A cups, “OG” for B-DD cups, and “+” for DDD cups and up), skin tones (Honey, Caramel, and Cocoa), and shapes (circles and triangles). I’ve had mixed success with nipple covers in the past. While the objective is to create a smooth surface underneath tight and/or sheer clothing, some of them made my breast outline even more pronounced as a result of thicker material or uneven edges, defeating the point entirely. Others made an early exit (this happened during my wedding reception, and I didn’t realize until the after-party — oops!) and fell off. With summer finally here, and strapless bras out until fall, I set out to find out if Cakes, with their $33 price point — which hovers just above many of its competitors — were the real deal. (Although they are on 30% off right now, BTW.) From white tees to bikini tops (yes, bikini tops!) to backless dresses, I put Cakes Grippy Circles, Grippy Triangles, Sticky Circles, and Sticky Triangles, all in the “OG” size and Honey colorway to the test. Ahead, my thoughts. DashDividers_1_500x100 Grippy Cakes Circles, $33 $23.10 First up, I tried the Grippy Cakes Circles. The silicone was smooth and soft, with the contoured shape thickest in the center and gradually thinned out on the exterior. As with any nipple covers, I applied them to clean, dry skin. I probably could’ve sized down in the circles because they nearly covered my entire breast. This is not necessarily a good or bad thing, especially considering that nipples and breasts vary in size and shape, but something to be aware of if your breasts are on the smaller side of the brand’s range. The brand recommends wearing this style under tight clothing to help the Cakes stay in place, but I wore mine under a loosely fitting white T-shirt, and they were not only undetectable as advertised but felt secure all day, even in summer heat. After wearing them for a full day, I gently removed them, rinsed them with warm water, and patted them dry. According to the brand, if you follow these instructions, Grippy Cakes are reusable since they use your body’s heat, not adhesive, to naturally cling onto the skin. (Buying fewer, better things? Here for it.) The circle-shaped “style” was most similar to other nipple covers I’ve tried in the past, but I found that these held up better with sweat and seamlessly blended with my skin (none of those uneven-edge issues I’ve experienced in the past). I would definitely wear these again with a sheer blouse or a plain white tee.  DashDividers_1_500x100 Grippy Cakes Triangles, $33 $23.10 Later that week, I gave the Grippy Triangles, which have an elongated, pointed shape that offers coverage for trickier styles, a try; since they have a sleeker profile, they work for low-cut or V-neck styles that the Circles may have peeked out from. What’s more, Cakes says you can wear these with swimwear (and for working out, but I tend to need more significant support if I’m doing anything more intense than walking). To test this theory, I threw on a triangle bikini and hopped in the pool. I was honestly impressed that the covers stayed in place through swimming and then laying out in the sun; water and sweat didn’t affect the grippiness of the silicone whatsoever.  Would these make it through surfing in Montauk? Probably not. But a little dip and/or playing mermaids is more than fine for these. I probably wouldn’t wear it again under swimwear because I look for styles that already have light padding in them. However, I appreciate having the option for sweat-filled days, and would recommend these for brides who want to dance the night away without worrying about a wardrobe malfunction like mine or, worse, a nip slip. DashDividers_1_500x100 Sticky Cakes Circles \u0026 Triangles, $33 $23.10 Lastly, I tried the new Sticky Cakes, which are nearly identical to their grippy counterparts in look and feel (they come in the same silicone material) but are coated in a thin layer of medical-grade adhesive. I’ll admit, sticky-front bras have been in my wardrobe arsenal for years now, providing light support and lift in backless, strapless designs, but I’m always on the hunt for something better, whether that’s in terms of comfort, performance, or both. (Cakes just released their version, called the Cleavage Bra, which I am eager to try.)  Sticky Cakes are a nice middle ground between going braless and the aforementioned sticky bras. The design has a small divot in the center (called a “nip nook”), so you don’t get adhesive anywhere near the delicate nipple area. When compared to Grippy Cakes, these felt more secure. The adhesive was tacky enough to stay in place (even in 90°F summer heat) but wasn’t so sticky that it hurt to remove it at the end of the day. Per the brand, the sticky versions can be worn at least 10 times with proper care and storage, which involves gently rinsing with warm water, air-drying, and storing in the included pouch. I would save this style for my backless summer dresses on the hottest days of the season or an outdoor summer music festival. DashDividers_1_500x100 Final Thoughts So, is Cakes worth the hype? I’d be lying if I said I wasn’t impressed. The grippy styles are great from a sustainability perspective. To me, the triangle shapes are a game-changer thanks to the way you can rotate them 180° in either direction to make even the trickiest neckline work. I also felt like these were the most seamless, invisible alternative to bras I’ve tried so far. Out of all the combinations I tried, the sticky triangles ended up being the winner in my book, since the shape was a universal fit for any tricky wardrobe situation, and I like having the adhesive as an insurance measure. Bonus: The brand is dedicated to supporting women’s health via Cakes Cares, the brand’s philanthropic arm, which has donated over a million dollars to breast cancer research and support programs. (As the daughter of a breast cancer survivor, I love this.) Now that I’ve got a full wardrobe of Cakes at my disposal, I feel that my search for the perfect nipple cover has ended. From future wedding dance floors to music festivals and other sweaty, bra-unfriendly scenarios, I may never wear bras again — or at least for the summer. Like what you see? How about some more R29 goodness, right here?",
    "author": "Karina Hoshikawa",
    "published": "Mon, 21 Jul 2025 14:45:50 +0000",
    "image": "https://www.refinery29.com/images/11913527.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "a7304652-94b6-46c3-9ef3-024603388524",
    "title": "Amaya Espinal's Muumuu Is More Than Just a Viral \"Love Island USA\" Moment",
    "link": "https://www.popsugar.com/fashion/amaya-espinal-muumuu-dress-love-island-usa-49452354",
    "description": "It's no secret that \"Love Island USA\" is impacting current culture as we know it. While it's far from the first love-centered reality show that we've seen, its popularity is especially referential. The show's foundational concept is unusual alone - being secluded on an island away from the outside world to find the love you've been looking for all your life. Islanders also played a significant role in season seven's massive impact, including Olandria Carthen and Nicolas Vansteenberghe's kiss that caused a massive crash-out at \"Love Island\" watch parties. Another highlight from the show that's still on our minds? Amaya Espinal (aka our sensitive gangster) wearing a muumuu in episode 28. While the New Yorker's bubbly personality and witty candor have given us plenty of meme-worthy moments to reflect on, her muumuu is far from just another piece of clothing that's passed the TikTok viral test. In an interview with the Today show, Espinal revealed that she only had a day to prepare for the show before being flown to Fiji, so she threw a bunch of clothing in a suitcase - including the muumuu she got during a trip to Portugal. \"Bringing that piece back to the villa reminded me of my travels and reminded me of the good days whenever I was having a bad one,\" she says. \"It was more than a dress for sure - it really made me feel grounded.\" @dontask724 just a girl and her moo moo against the world #amaya #amayaloveisland #amayapapaya #loveislandusa #loveisland #usa #fyp #viral ♬ original sound - 𓇼 Apart from the sentimental value it holds for Espinal, the muumuu bears cultural significance that's particularly noteworthy. The comfortable piece can be traced back to the early 19th century, when Christian missionaries in Hawaii influenced native women to wear the silhouette to further cultivate modesty. Hawaiian women adapted a more casual, sleeveless version - the \"holokū\" - for everyday wear, before it was renamed the muumuu. Fast forward to present day, the dress style is still acceptable in Western culture, and often a go-to purchase for vacations, Hawaiian-themed parties like luaus, and more. And of course, celebrities have proudly embraced the muumuu - most recently, Kris Jenner, Oprah Winfrey, and Gayle King were seen wearing them on a Mallorca getaway. Espinal wearing her own speaks to the diversity we need to see more of on reality shows, and is a surefire way to exhibit the fact that modesty is still attractive. During the scene in which she wore it, her partner, Bryan Arenales, complimented her look (despite her labeling it as a \"grandma dress\"). His support proves that you don't always need to show skin to be deemed attractive or desired - especially in the eyes of your romantic partner. While her exact dress isn't available to shop, we found similar picks that evoke the same level of style and confidence: Unique Kaftans Floral Print Long Tunic Dress ($3, originally $10), JaipurCraftandArt Cotton Kaftan ($27, originally $75), and H\u0026M Oversized Kaftan Dress ($75). Naomi Parris is an assistant shopping editor at Popsugar, based in New York. With over eight years of experience and previous roles held on the brand's Beauty and Operations teams, she enjoys telling stories that merge fashion, beauty, and Black culture. Naomi has also lent her skillful pen to Essence Girls United, Elle, Bustle, and Elite Daily. When she's not crafting shopping roundups, high-profile features, beauty op-eds, or trend guides, you can find Naomi behind her blog \"Eli-Nay,\" where she inspires readers through style guides, cultural pieces, and innovative content on her Instagram.",
    "author": "Naomi Parris",
    "published": "Fri, 18 Jul 2025 10:20:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/-s_LZjO5PhLpcRSGwwKrRbGO1aw/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/07/18/733/n/1922564/b82476a5687a7818a4fd93.79569573_.png",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Fashion Shopping",
      "Dresses",
      "TV",
      "Reality TV",
      "Love Island"
    ]
  },
  {
    "id": "ae319a26-4af8-4b7f-ad38-d9215f062898",
    "title": "\"Love Island USA\" Star Iris Kendall Wore These $22 Boy Shorts to Bed Every Night",
    "link": "https://www.popsugar.com/fashion/iris-kendall-shorts-love-island-usa-49452227",
    "description": "Season seven of \"Love Island USA\" may be over, but we're still digesting it all. After all, the show ran every day - except for Wednesdays - since its premiere on June 3, and each nearly two-hour episode showcased some of the worst (and best) of what America's current dating pool has to offer. The series has even left us with a slew of aftermath moments to hold us over until the season's Aug. 25 reunion, from embracing the beauty of being a sensitive gangster like Amaya Espinal to fan-favorite couple Nicolandria trekking to Disneyland. Another item to stoke the post-Love Island obsessive madness? Iris Kendall's boy shorts. After entering the villa as a bombshell in episode nine, the Los Angeles-born star proved to be one of the most enduring islanders, as she diligently explored multiple connections before making it to the final four with partner Jose \"Pepe\" Garcia. Kendall's style is another element we're reflecting on, but not for the reason you think. Naturally, she wore many looks that reflected the carefree California vibe (like bikinis and frilly dresses), but her pajama wardrobe was especially impressive. As islanders got ready for bed each night, fans quickly noticed that Kendall often wore the Skims Soft Smoothing Seamless Boy Short ($22) and the Skims Fits Everybody Lace Short ($24) - and for good reason. Not only are they super lightweight, but they're constructed with high-quality cotton and nylon that provides full coverage and a confidence-boosting silhouette. They even range from size XXS to 4X, making them accessible for all. @megannicklas Give me all of them @SKIMS @Iris Kendall 🤭🧚‍♀️🖤 immediately ordered #skimsboyshorts #loveislandusa #irisandpepe4life ♬ Iris - Goo Goo Dolls To no one's surprise, the affordable bottom has gained TikTok approval, with many users flocking to the Skims website to get the Iris Kendall look for themselves. Between their great quality and budget-friendly price point, purchasing these boy shorts is only right - whether you're a \"Love Island USA\" fan or not. Naomi Parris is an assistant shopping editor at Popsugar, based in New York. With over eight years of experience and previous roles held on the brand's Beauty and Operations teams, she enjoys telling stories that merge fashion, beauty, and Black culture. Naomi has also lent her skillful pen to Essence Girls United, Elle, Bustle, and Elite Daily. When she's not crafting shopping roundups, high-profile features, beauty op-eds, or trend guides, you can find Naomi behind her blog \"Eli-Nay,\" where she inspires readers through style guides, cultural pieces, and innovative content on her Instagram.",
    "author": "Naomi Parris",
    "published": "Thu, 17 Jul 2025 09:55:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/EawmdDVsQKl2L4Dc4CkNLXA0fAs/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/07/17/726/n/1922564/e91259c568792412592d77.93244223_.png",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Fashion Shopping",
      "TV",
      "Reality TV",
      "Pajamas",
      "SKIMS",
      "Love Island"
    ]
  },
  {
    "id": "946788fa-3f86-4cf7-af51-918ac2ee1677",
    "title": "Types of Suits Every Man Should Own 2025",
    "link": "https://www.fashionbeans.com/article/types-of-suit/",
    "description": "There are few guys who don’t aspire to one day own a walk-in wardrobe filled with all the different types of suits, but we’re often in the dark as to how to get there. For the remainder, suits are a necessary evil: an insurance policy for professional and social occasions that you want to spend … Continue reading Types of Suits Every Man Should Own 2025 →",
    "author": "FashionBeans Editors",
    "published": "Mon, 21 Jul 2025 05:38:20 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Men's Style",
      "Editor's Picks",
      "Featured Articles",
      "Instagram Stories",
      "Lists",
      "SEO"
    ]
  },
  {
    "id": "b0615a26-347a-4049-b610-38d6c0291c53",
    "title": "10 Best Roll Top Backpacks for Men Worth Carrying in 2025",
    "link": "https://www.fashionbeans.com/article/best-roll-top-backpack/",
    "description": "There are few things in life that I’m as passionate about as backpacks. I own dozens and spend much of my time hunting down the top gear on the market. If you, too, are searching for the best roll top backpack for men, you’ve come to the right place. Not only have I found the … Continue reading 10 Best Roll Top Backpacks for Men Worth Carrying in 2025 →",
    "author": "Jane Elmets",
    "published": "Sun, 20 Jul 2025 14:57:01 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Men's Fashion"
    ]
  }
]
