[
  {
    "id": "d84de11e-e37c-474b-8199-43f6f00e3287",
    "title": "Question of the Week: What’s The Strangest Thing You’ve Found in a Car?",
    "link": "https://bringatrailer.com/2025/02/19/question-of-the-week-whats-the-strangest-thing-youve-found-in-a-car/",
    "description": "Welcome to the BaT Question of the Week! For those unfamiliar, here are the rules: we ask an automotive-themed question, and the author of our favorite answer from the comments is awarded a $25 credit to the BaT Gear Store. This week’s question is: What’s the strangest thing you’ve found in a car? Last week’s Question of the Week (best in-car object recovery) got us thinking about the doodads, whatchamacallits, and thingamajigs that we’ve found by chance—old personal belongings, strange mystery objects, even living things. Whether it was in a car that you let a friend borrow or from an archaeological exploration of your newest project vehicle, we want to hear about your most peculiar finds!",
    "author": "bringatrailer",
    "published": "Thu, 20 Feb 2025 01:00:55 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/04/Screenshot-2025-02-19-at-3.48.08 PM-08904-e1740008939773.png?fit=940%2C626",
    "source": "https://bringatrailer.com/feed/",
    "categories": [
      "Question of the Week"
    ]
  },
  {
    "id": "1f091519-c641-4e65-a11f-a5f8dff11bd6",
    "title": "104-Mile 2019 Ferrari 488 Spider Force of Nature Series: Earth",
    "link": "https://bringatrailer.com/listing/2019-ferrari-488-spider-16/",
    "description": "This 2019 Ferrari 488 Spider is one of four in a \"Force of Nature\" series, with this Dark Green Metallic example representing \"earth.\" The car's specification involves more than $254k in options and special features, including the Carbon Fiber Exterior and Carbon Fiber Racing packages, a Bianco Dreamline livery, Glossy Verde Bottiglia carbon-fiber interior and exterior trim, Goldrake racing seats, a suspension lift system, a sport exhaust, and a retractable hardtop. Power is provided by a twin-turbocharged 3.9-liter V8 paired with a seven-speed F1 dual-clutch automatic transaxle. The current owner purchased the car in 2024 and it now has 104 miles. This 488 Spider \"Force of Nature\" series is now offered by the seller on behalf of the current owner with a window sticker, manufacturer's literature, service records, a car cover, a clean Carfax report, and a clean Oregon title in the owner's name.",
    "author": "bringatrailer",
    "published": "Thu, 20 Feb 2025 01:00:11 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/09/2019_ferrari_488-spider_dsc04266-39052.jpg?fit=940%2C626",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "7de2f374-45e0-4b17-a891-5d08838b56a2",
    "title": "Tesla sues customers, reporters to silence negative press",
    "link": "https://www.autoblog.com/news/tesla-sues-customers-reporters-to-silence-negative-press",
    "description": "The electric car giant has leveraged lawsuits to suppress criticism, raising concerns about consumer rights.",
    "author": "Elijah Nicholson-Messmer",
    "published": "Thu, 20 Feb 2025 01:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyOTMzMjc4NjAzMTU5MTY4/china-automobile-manufacturing-tesla-us.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Tesla",
      "China",
      "News",
      "tesla",
      "EVs"
    ]
  },
  {
    "id": "1e471604-286c-4139-9613-a97a873b7357",
    "title": "6 vehicles we will miss the most when they leave in 2026",
    "link": "https://www.autoblog.com/news/6-vehicles-we-will-miss-the-most-when-they-leave-in-2026",
    "description": "From an affordable all-wheel drive family sedan to an SUV rocketship, these models will leave a gaping hole in our automotive hearts.",
    "author": "Amos Kwon",
    "published": "Wed, 19 Feb 2025 23:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyOTI4NDU3MjMzOTk5MzY5/2025-porsche-macan.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Audi",
      "718 Cayman",
      "Lexus",
      "porsche",
      "A4",
      "porsche 718",
      "volvo s60 t5",
      "Porsche 718 Boxster",
      "Subaru",
      "Legacy",
      "Subaru",
      "Macan",
      "News",
      "Subaru Legacy",
      "audi",
      "Porsche",
      "Lexus",
      "Volvo",
      "Volvo",
      "lexus rc f",
      "718 Boxster",
      "S60",
      "porsche macan",
      "RC-F"
    ]
  },
  {
    "id": "bbca9785-22b5-4bab-a6c9-ba1fb3062035",
    "title": "BMW CE 02 road test, review",
    "link": "https://www.autocarindia.com/bike-reviews/bmw-ce-02-road-test-review-434534#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "The BMW CE 02 represents an innovative leap, targeting younger, eco-conscious riders who might overlook traditional BMW motorcycles. In India, it appeals to a niche audience with higher disposable incomes, valuing style and badge value over practicality. While its price may seem steep, the CE 02 offers a compelling case, particularly when compared to its more expensive sibling. Love it or hate it, the CE 02’s design is undeniably catchy. Neither a bike nor a scooter, BMW dubs it an “e-parkourer” meant for fun, short-distance commuting. Practicality, however, takes a backseat with no storage or additional seating space, making its heavy charger or a pillion inconvenient to carry. Upon first glance, the rider footpegs seem like an afterthought and feel out of place in the otherwise cohesive design. The rider footpegs look like a bit of an afterthought on the CE 02. With minimal bodywork, a low stance and a futuristic aesthetic, the CE 02 captures attention from a diverse range of onlookers. During my time with it, teenagers, adults, and even senior citizens frequently enquired about it.  A stylish single-piece seat that looks and feels like an ironing board. The bike’s low 745mm seat height and light 142kg weight make it approachable for beginners, but the bench-like seat limits comfort as it is best suited for solo riders. Additionally, the low-mounted tail-light is poorly positioned, making it less visible to tailgaters. A rather cute face and an LED headlamp with good illumination. On the features front, the CE 02 comes equipped with LED lighting, a 3.5-inch TFT display, keyless start, two riding modes, a reverse feature, adjustable levers, a Type-C charging socket and Bluetooth connectivity.  Extremely crisp micro TFT that is both easy to read and use. Our test unit included the Highline package, an optional upgrade costing Rs 50,000. This adds features like a fast charger, additional switchgear, a smartphone holder, an extra riding mode called “Flash”, a tri-coloured seat, heated grips, a gold-finished fork and some graphics.  The charger cover is rather simple-looking and feels basic to use. The Highline package is worth considering for a more enriched experience overall. Additionally, the accessory comfort seat, priced at Rs 12,000, is also recommended due to the limited cushioning of the standard seat. Besides this, if you buy the standard version and wish to add the fast charger, it will cost you Rs 70,000, which makes the Highline package a no-brainer.   The CE 02 offers three riding modes: Flow, Surf and Flash. Flow combines high regenerative braking with a linear throttle response, Surf disables regen for a freer ride, and Flash delivers maximum regen with a sharp throttle response. There’s an additional Battery Saver mode that requires manual activation via the menu, while a Low Power mode automatically engages at alow charge. Surf mode proved ideal for my highway commutes to work, offering effortless coasting. Riding the CE 02 in Mumbai was a joy, thanks to its ample torque and quick acceleration. In our tests, the CE 02 accelerates quicker to 80kph than most 160cc motorcycles, aligning closer to a fast sub-160cc or a slower 200cc bike. Its lightweight build enhances its agility and pace, especially in city conditions, and the traction control ensures confidence on loose surfaces. The claimed 108km range holds up well for regular commutes, and the fast charger tops up the battery in about three and a half hours.   While the brakes offer excellent feedback, the lack of dual-channel ABS is a drawback since the rear wheel is prone to locking under aggressive braking. This is especially so when paired with the CE 02’s strong regenerative braking, which reduced how much I found myself using the brakes. The single-sided swingarm looks quite cool and gets a lot of attention. It is lightweight and has a low centre of gravity, which makes it highly manoeuvrable and enjoyable for city commutes. The suspension provides decent comfort at moderate speeds but struggles over potholes or bumps, often unsettling the rider. Ground clearance seems decent, but BMW would not share the exact figure with us. The fork is non-adjustable, and the rear shock is preload adjustable.  The low-mounted tail-light is hidden from tailgaters or tall SUVs. The Michelin City Grip 2 tyres deliver reliable traction overall despite varying riding styles. The CE 02 is an otherwise comfortable little commuter, but its thin and minimally padded seat becomes a pain after about an hour. The riding posture is upright, with wide bars allowing for better control.   This is by no means a practical purchase. Despite being made at TVS’ plant in Hosur, at Rs 4.99 lakh for the Highline package-equipped CE 02, it is an expensive proposition. Then again, it is the most affordable BMW EV and offers a blend of bold design, high-quality construction and engaging performance.  A rather charming little machine that tugs on your heartstrings and yanks on your wallet. Its quirky styling may not appeal to everyone, but it undeniably turns heads. For those well-heeled few who can afford this and are looking for an easy, stylish and completely left-field city-centric two-wheeler with superb badge value, the CE 02 promises a unique and fun experience.",
    "author": "Gavin Rodrigues",
    "published": "Mon, 17 Feb 2025 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250211123615_12.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "ab2d9f68-c104-4cd3-a978-c36c787407bc",
    "title": "Ather Rizta long term review, 1,200km report",
    "link": "https://www.autocarindia.com/bike-long-termer/ather-rizta-long-term-review-1200km-report-434554#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "In the build-up to the Rizta’s launch, Ather had released some very bold advertisements showcasing how big the scooter’s seat would be, featuring a prominent Indian professional wrestler. Naturally, I initially took all of that with a grain of salt, but now that I’ve actually used the Rizta extensively with a pillion aboard, I can confirm this is a really spacious and comfortable seat. Pillions of all shapes and sizes have sat behind me, and even the taller and heftier ones were comfortable. The backrest (standard on the Z variants) also goes some way in keeping the passenger comfortable. The well-padded seat is one of the most spacious units around, backrest keeps the pillion comfy. With just the rider aboard, the Rizta’s ride can feel a little stiff, although it’s never uncomfortable. However, when you’re carrying a passenger, this setup pays dividends and shields you from all but the worst bumps Mumbai has to offer. That said, the Rizta’s suspension is a bit of a double-edged sword, but we’ll come to the bad bits later on. As anyone who has ever ridden with a pillion will tell you, if your vehicle has a less-than-ideal throttle response, it’s going to be unpleasant, especially in stop-and-go traffic, where you need to give minute inputs almost constantly. What I absolutely love about the Rizta is its crisp and direct throttle response, which allows you to modulate the throttle very precisely in stop-and-go traffic without causing any unwanted herky-jerkiness. Accelerator response feels well-tuned in both modes, is precise and direct. What isn’t nice in our pothole-littered city, though, is the stiff front fork. It thuds over every single bump, and the big ones, especially, make their presence felt with a rather rude jolt to the rider’s hands. The 450X-derived front fork is too stiff, which hampers overall comfort over bumps. Another problem is that when you’re making a lock-to-lock U-turn, the Rizta’s handlebar fouls your knees. On a scooter with so much space in most other regards, the lack of it in this area stands out like a sore thumb. Ather has repurposed a lot of what was on the sporty 450 here, which is why these downsides have also transferred over to the Rizta. Lock-to-lock U-turns require taller riders to move their knees out of the way. But in the grand scheme of things, these are two issues I can look past, given how light the Rizta is on my pocket and, otherwise, how well it handles the daily grind in general. And since the Rizta and the 450 are quite closely related under their distinctly different skins, there are also some strong points – like the crisp handling – that I’m thoroughly enjoying. Also See: Ather Rizta long term review, 700km report",
    "author": "Dinshaw Magol",
    "published": "Sat, 15 Feb 2025 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250212040330_A1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "fdd2d5e8-446f-4b3a-bad0-8f6bc2671bc7",
    "title": "2025 BYD Sealion 7 video review",
    "link": "https://www.autocarindia.com/car-video-reviews/2025-byd-sealion-7-video-review-434587#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also see:  2025 BYD Sealion 7 review: Tech laden luxury electric SUV",
    "author": "Jay Patil",
    "published": "Mon, 17 Feb 2025 09:10:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250217091406_autocarindiacom.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "a04a4060-e235-4967-a273-2b8489ce7118",
    "title": "2025 BYD Sealion 7 review: Tech laden luxury electric SUV",
    "link": "https://www.autocarindia.com/car-reviews/2025-byd-sealion-7-review-tech-laden-luxury-electric-suv-434585#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "With the BYD Sealion 7, the Chinese brand has truly cemented its position as a high-end EV maker in the Indian marketplace.  Its first two offerings, the e6 (now evolved into the eMax 7) and the Atto 3, took a while to gain traction for various reasons, while the Seal sedan was the first sign that this was a brand intent on upsetting the established order. The Sealion 7 is the Seal’s crossover counterpart, and though the two share some similarities, there are tangible improvements in key areas that give the newer model a much broader appeal. BYD Sealion 7 exterior design 170mm ground clearance For one, it’s an SUV, and that fact in and of itself will endear it to many more buyers, but the more practical consideration is ground clearance, which is now up to 170mm from the Seal’s 145mm.  That aside, though, it’s not a traditional SUV in its proportions, which lean heavily towards the coupe SUV or crossover end of the spectrum.  2.9-metre wheelbase At 4.8 metres long with a 2.9-metre wheelbase, it’s not a small car, but its sloping roof and tightly skinned curves make it appear a lot more compact than it actually is. To these eyes, though it uses an evolved version of the Seal’s design language, dubbed ‘Ocean X’, the proportions aren’t quite as appealing as the sedan’s, particularly its taller nose, which carries a lot of visual bulk. 19- and 20-inch wheels This is offset somewhat by the generous use of contrast black trim, particularly around the large wheel arches that house 19-inch wheels (20-inchers on the AWD version) and a huge diffuser that’s cut into the rear bumper. BYD Sealion 7 interior space and comfort The Sealion 7’s interior design is not as characterful as the Seal’s, with a conventional-looking rectangular central console and a horizontal and flat dashboard, which does at least integrate some interesting ambient lighting elements. 15.6-inch rotating touchscreen The digital driver’s display is incorporated into that flat panel, and making a return is the signature rotating touchscreen, which stretches the tape at 15.6 inches across.  What impresses the most, once again, is the cabin quality and fit and finish, which are truly on par with the best luxury brands and, in certain areas, surpass them. Quality as good as luxury cars There’s soft-touch material on even the lower half of the dashboard, and you have to scratch around the footwell to find a rough plastic bit. Panel fit is tight across the board, save for a few ill-fitting panels on the door, and though pretty straightforward in its design, the cabin is not without a few quirks, like the door ‘handles’, which are more like lift-up flaps.  Comfortable seats with generous cushioning The front seats are supremely comfortable (and ventilated), with a nice mix of firm and soft cushioning in just the right places. The rear seats feature similar cushioning and can be reclined quite significantly, but more significant is the amount of space on offer, particularly legroom, thanks to the long wheelbase. Big glass area gives a spacious feeling You’re seated quite low relative to the window line, but there’s a large glass area that gives a good sense of airiness; window blinds would have helped, though. BYD Sealion 7 features and safety Large fixed glass roof with sunshade Speaking of glass, a huge fixed glass panel stretches the length and width of the roof, but unlike in the Seal, you get a powered roller blind to block out the sun on really hot days. Another small but helpful change is that the AC vents are regular, manually controlled in the Sealion, and not electronically adjusted like in the Seal.   Driver's display is cluttered The screens, as before, are extremely slick with high-resolution graphics; however, the driver’s display features an extremely cluttered layout with far too much information thrown at you, which is distracting. There is a heads-up display, too, and while it’s high in resolution, it, too, places far too much data in your field of view. The touchscreen, thankfully, has an improved UI, but we wish BYD hadn’t stuffed so many basic functions into it. BYD Sealion 7 feature highlights  The Sealion 7 is very well-equipped, with the likes of wireless smartphone integration, a punchy 12-speaker Dynaudio music system, powered and ventilated front seats, automatic headlamps and wipers, a gesture-controlled powered tailgate, dynamic ambient lighting, dual-zone climate control, a ventilated wireless phone charger, and more. 11 airbags, Level 2 ADAS On the safety front, there are 11 airbags, including one between the front seats and two for the rear side bolsters as well.  There’s also ADAS with Level 2 autonomous driving, one of the clearest 360-degree cameras around, and a driver attention monitor that’s way too sensitive, given the sheer number of distractions in the touchscreen alone. BYD Sealion 7 battery, range and charging Unlike the Seal, the Sealion 7 just gets a single battery option – the larger 82.56kWh pack that uses BYD’s standard-setting Blade Cell LFP technology. Up to 567km range  However, with two powertrain options, there are two sets of range figures as well – 567km (NEDC) for the single-motor version and 542km for the more powerful (and 100kg heavier) dual-motor variant. BYD cars, in our experience, come close to their claimed range figures, and though we weren’t able to do a full range test on this short drive, our mixed driving conditions still yielded an equivalent range of close to 500km on the single-motor version.   7kW wallbox charger provided On a DC fast charger, the battery can be charged at speeds up to an impressive 150kW, while on an AC fast charger, it can do 11kW. But disappointingly, the home wallbox charger BYD supplies maxes out at just 7kW, which is slow for such a large battery. The Sealion 7, like other BYD models, features a vehicle-to-load (VTL) function that lets you charge other devices, such as speakers, electric stoves, lamps and camping gear, off the car’s battery. BYD Sealion 7 driving impressions We were able to spend some time with both versions of the Sealion 7, and there are some clear distinctions in the driving experience.  Dual-motor version makes 530hp The AWD dual-motor version packs a substantial 530hp and 690Nm, allowing for a 0-100kph sprint in just 4.5 seconds, a figure we were able to achieve and verify on our VBOX testing gear. You can feel that performance advantage instantly and in any drive mode, but as you drive it longer, what you appreciate more is how tidily the AWD version puts down its power.  The RWD has ‘only’ 310hp and 380Nm, but in everyday driving, these outputs feel more than ample for a luxury car of this size. Smooth, progressive power delivery At low and medium speeds, both versions serve up a smooth and progressive power delivery, much unlike the flat or spiky shot of acceleration we are used to from most electric cars, which is welcome. However, once you get into triple-digit speeds, while the powertrain itself is silent (no artificially generated sound here), you start to hear more of the outside world, particularly at the rear, as while the front windows are double-glazed for better insulation, the rear ones are not. BYD Sealion 7: Acceleration from restSpeed (kph)Time (seconds)200.81401.60602.38803.291004.50 Not as sporty as the Seal sedan The Sealion 7 makes no pretence of being a sporty handler. Where the low-slung Seal sedan feels sharp and agile going around a corner at speed, the SUV rolls quite a bit, and you instantly feel the weight and higher centre of gravity. This is not a bad thing, of course, as it only serves to elucidate the Sealion’s positioning as a comfortable luxury car and not a sports model, although its ultra-responsive and quick steering is somewhat at odds with this philosophy.   Composed and comfortable ride The ride has a slight firmness to it, something we usually expect from a European car, but on balance, this is better suited to managing the 2.3-tonne mass than an outright soft suspension setup. A slight spoilsport is the wheels, which tend to register a ‘thump’ as they go over bumps – something that’s more pronounced with the 20-inch set that comes on the dual-motor version. 2025 BYD Sealion 7 price and verdict The BYD Sealion 7 is the perfect answer for those buyers who were intrigued by the prospect of the Seal but stayed away because of the ground clearance or sedan form factor.    Reasons to buy a BYD Sealion 7 It brings back what we loved – most notably the plush, well-put-together cabin, which genuinely feels right on par with a European luxury car. BYD’s powertrain expertise shows in the smoothness and sophistication of the power delivery and how keenly the Blade Cell LFP battery clings on to every electron, maximising the range. There’s a lot of tech in the Sealion 7, be it for infotainment, safety or everyday comfort and convenience, and while all of it is useful, we wish some of it was presented in a more user-friendly manner. BYD Sealion 7 price and rivals At a price of Rs 48.90 lakh to Rs 54.90 lakh (ex-showroom, India), the BYD Sealion 7 confidently wades into the crowded space of electric cars in India, armed with the latest tech and know-how.  Similarly priced crossovers include the BMW iX1 LWB, Kia EV6, Volvo C40 Recharge and Mercedes-Benz EQA, of which the Kia comes closest in size and specs.  BYD’s sales and service network is small compared to these established brands, but it is growing, as is the ready availability of cars. As for the product itself, on first impressions at least, it’s one of the best of its kind at the price, and a premium electric car buyer should definitely have it on their shortlist. Also see:    BYD plans new local manufacturing facility in India   BYD Denza N9, Bao 3 designs patented in India",
    "author": "Gavin D'Souza",
    "published": "Mon, 17 Feb 2025 09:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250216012223_BYD_Sealion_7_Front_Quarter_Tracking.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "31b6399c-149a-474d-890f-40c0f1c63dbd",
    "title": "See The New BMW 2 Series Gran Coupe From All Angles",
    "link": "https://www.bmwblog.com/2025/02/19/bmw-2-series-gran-coupe-fire-red-f74/",
    "description": "The old 2 Series Gran Coupe was far from being one of the most exciting BMWs in the lineup. The “F74” picks up where the “F44” left off since it probably won’t wow you either.... First published by https://www.bmwblog.com",
    "author": "Adrian Padeanu",
    "published": "Wed, 19 Feb 2025 23:38:18 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/02/bmw-220-gran-coupe-fire-red-07-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "2 Series",
      "2 Series Gran Coupe",
      "F74",
      "Fire Red"
    ]
  },
  {
    "id": "7fda4ed4-2efc-4b14-8f17-230c3a71c44a",
    "title": "New BMW iX xDrive60 Shows Its Illuminated Grille",
    "link": "https://www.bmwblog.com/2025/02/19/bmw-ix-xdrive60-illuminated-grille/",
    "description": "The iX is considered the ugly duckling of BMW’s ever-growing SUV lineup. We genuinely think some people will have a change of heart now that the Life Cycle Impulse is officially out. The recently launched... First published by https://www.bmwblog.com",
    "author": "Adrian Padeanu",
    "published": "Wed, 19 Feb 2025 23:25:47 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/02/bmw-ix-xdrive60-frozen-pure-grey-10-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "iX",
      "2026 BMW iX",
      "BMW iX 60",
      "Frozen Pure Grey",
      "iX facelift",
      "iX LCI",
      "iX xDrive60"
    ]
  },
  {
    "id": "3d51e614-4cad-4c72-9a35-dca5883d8c75",
    "title": "Kia PV5 revealed: brand's first van is radical VW ID Buzz rival",
    "link": "https://www.autocar.co.uk/car-news/new-cars/kia-pv5-revealed-brands-first-van-radical-vw-id-buzz-rival",
    "description": "PV5 is targeting a relatively low starting price of €35k (equivalent to £29k) First in a line of 'Platform Beyond Vehicles' gets futuristic looks and MPV variant; more derivatives to come The Kia PV5 has been unveiled as the brand’s first van, conceived as a futuristic rival to the Volkswagen ID Buzz. The first in a new line of models dubbed Platform Beyond Vehicles (PBVs), it will be followed by a larger PV7 due in two years, aimed squarely at the venerable Ford Transit and Geely-owned brand Farizon's SV. It has been developed from the ground-up as an electric van rather than using an adapted combustion-engine platform, as is the case with the Ford E-Transit Custom. Technical details have yet to be confirmed, but the PV5 concept shown in 2024 used a modified version of the E-GMP platform that underpins a number of the brand’s electric SUVs. It mirrors the entry-level Kia EV3 in featuring a single front-mounted electric motor and electricals running at 400V, rather than the higher 800V used by the upmarket EV6 and EV9. It’s therefore expected to offer the same 201bhp and 209lb ft motor as the EV3, which allows the crossover to dispatch the 0-62mph sprint in 7.6sec. Performance will undoubtedly differ in the van, however, especially once fully laden. The EV3 is also offered with batteries measuring 58.3kWh and 81.4kWh, yielding 270 or 375 miles of range, respectively; this, also, would be limited in a larger and heavier van. Although the PV5 has been unveiled in passenger and cargo van forms, Kia said that it will show yet more variants at its upcoming EV Day (on 27 February) event. The nature of the van’s skateboard-style EV platform means that it can effectively wear any ‘hat’ that Kia desires, and the concept was previously shown in both pick-up and rugged Volkswagen California-style camper van forms. What should remain consistent between each variant is the front end, which remains true to the concept. Angular LED daytime running lights are positioned high on its rakish nose, while the main-beam headlights are set into the lower bumper. The interior’s design has yet to be shown in full, but the exterior images released by Kia reveal split instrument and infotainment display screens – a key difference from the brand’s cars, which typically use a combined fascia. The cargo area, meanwhile, is set to feature a novel rail system on its floor and ceiling to allow for items such as cabinets and seats to be added or removed with greater ease.  Kia has yet to announce how many people the PV5 will seat, but the similarly proportioned ID Buzz is offered in five-, six- and seven-seat configurations. Such accessories will be offered as part of a wider PBV ecosystem, which will also comprise software solutions for jobs such as fleet management. Kia previously said the PV5 would target a starting price of just €35,000 (£29,000) in Europe, suggesting it will open in the low-to-mid £30,000s in the UK. The production van will make its debut here at the Commercial Vehicle show in Birmingham, which opens on 29 April. Deliveries are expected to begin around October.",
    "author": "",
    "published": "Wed, 19 Feb 2025 23:31:19 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/kia-pv5-passenger-front-quarter.jpg?itok=VgC8gDx0",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "10c51a1b-2675-453b-9b81-eac12cd072bc",
    "title": "Gordon Murray Group announces new Special Vehicles arm",
    "link": "https://www.autocar.co.uk/car-news/new-cars/gordon-murray-group-announces-new-special-vehicles-arm",
    "description": "Launch of more hardcore T50S clears the way for new bespoke commissions New division will focus on one-off models, plus highly-customised examples of the T50 and T33 The Gordon Murray Group has launched a new Special Vehicles division to accommodate demand for bespoke models. The company said the new division will operate independently of Gordon Murray Automotive, with its own engineering staff. Its cars will range from limited-edition variations of the T50 and T33 supercars to one-off productions built on a new platform. It will also run a heritage operation whose remit will include building new examples of classic Murray-built models (presumably including the Light Car Company Rocket) to their original specifications. In addition, it will build “reimagined” classics with modern specifications, implying a similar approach to Boreham Motor Works’ new Ford Escort RS. Gordon Murray said his company has been inundated with demand for one-off versions of the T50 but “always resisted these requests” to focus on the launch of it and then the T33. “Now, as we have grown the business and team, we have established separate design and engineering departments for [Gordon Murray Special Vehicles],\" he continued. \"It’s the perfect time to extend our offering to special vehicles.” Murray added that the Special Vehicles division’s work exists \"outside of the current GMA product and platform plan”. Its first bespoke car is earmarked to be revealed this year. The new division adds an important string to the group's bow as it looks to scale up production and establish itself as a luxury brand in the same breath as marques such as Bentley, Ferrari and Lamborghini. Bespoke operations have been crucial profit-spinners for such brands in recent years. Indeed, Rolls-Royce recently announced that 2024 had been a record year for its customisation offering, claiming that the value of bespoke content in its cars increased by 10%. It has in turn invested £300 million in its Goodwood factory, of which a significant portion is devoted to improving its capacity for bespoke cars and coachbuilding.",
    "author": "",
    "published": "Wed, 19 Feb 2025 17:01:38 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/gordon-murray-t50s-niki-lauda-goodwood-front-quarter.jpg?itok=D3L2q5V9",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "d8154e20-dd37-4eb1-b641-fa34e55689e2",
    "title": "MG Windsor BaaS scheme chosen by 15 percent of buyers",
    "link": "https://www.autocarindia.com/marketplace-news/mg-windsor-baas-scheme-chosen-by-15-percent-of-buyers-434617#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "The MG Windsor has reached a new production milestone; MG Motor India has announced today that it has produced 15,000 units of the EV at its Halol plant. The brand has also revealed that just 15 percent of MG Windsor buyers have opted for the Battery as a Service (BaaS) scheme, and that the brand receives approximately 200 bookings a day for the EV, prompting an increase in production. MG Windsor BaaS sales MG Windsor buyers prefer to buy the EV outright than opt for battery rental scheme That just 15 percent of Windsor buyers choose the BaaS scheme indicates a clear preference to buy the model outright. The table below shows that with the recent hike in Windsor prices, there is a uniform Rs 4 lakh difference between the total ex-showroom price and how much those who opt for the battery rental scheme would pay upfront. However, it should be noted that there has been a corresponding increase in the cost of renting the battery as well, from Rs 3.5 per km to Rs 3.9 per km. MG Windsor prices, ex-showroom, IndiaVariantWithout BaasWith BaaSBattery rentalExciteRs 14 lakhRs 9.99 lakhRs 3.9/kmExclusiveRs 15 lakhRs 10.99 lakhRs 3.9/kmEssenceRs 16 lakhRs 11.99 lakhRs 3.9/km Buyers could find MG BaaS scheme complicated Among the reasons why buyers could be opting to buy the Windsor outright rather than selecting the battery rental option is that the BaaS scheme can seem complicated to understand. As our MG Windsor battery rental feature explained, BaaS is essentially is a finance scheme backed by specific third-party financiers, and each has their own terms and conditions. Resale of an MG Windsor bought via the BaaS programme also becomes more complicated. The brand does offer a buyback scheme, with a value of up to 60 percent of the car, under its MG Shield plan to alleviate some of the concerns regarding selling a used Windsor. It should be noted that depending on one’s usage, the BaaS scheme may be beneficial as customers can choose their preferred package. There are various options for different periods, such as a 3-year, or 5-year or 8-year plans. Top-spec MG Windsor Essence trim accounts for 80 percent of bookings IMAGE SOURCE Along with confirming that the brand receives about 200 bookings for the Windsor every day, MG Motor India has also said that about 80 percent of bookings are for the top-spec Essence variant, which is priced at Rs 16 lakh. The entry-level Windsor Excite and mid-spec Exclusive variants, together, account for 20 percent of bookings. Sales of the Windsor have been helping MG Motor India significantly as, in the first three months of being on sale, the EV already accounted for 49 percent of the brand’s total. In fact, by the end of December, MG Windsor wholesales had crossed the 10,000 unit mark. Demand for the MG Windsor has prompted plans to increase production capacity at the company’s plant in Halol, Gujarat. Biju Balendran, deputy MD, JSW MG Motor India, said that they are increasing the capacity to meet rising demand, and confirmed, “We are undertaking certain facility modifications to ensure readiness for new products under MG Select, which is due for launch in the first half of this year. Hence, we anticipate a production slowdown during the month of February, which may temporarily affect our wholesales during this period.” The company will soon announce prices for the first MG Select model, the Cyberster, and then will launch the M9 MPV, by March.   All prices, ex-showroom, India Also see: Tata Nexon EV vs MG Windsor: performance compared MG Windsor EV real world range tested, explained MG Astor 1.3-litre turbo-petrol engine axed",
    "author": "Rivan RS",
    "published": "Wed, 19 Feb 2025 18:55:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250219064301_MG_Windsor_front_static.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "26fe1551-b79e-4b4d-a0d7-aca28f6fda1c",
    "title": "Bharat NCAP 2.0 in development, will test ADAS features",
    "link": "https://www.autocarindia.com/industry/bharat-ncap-20-in-development-will-test-adas-features-434614#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "The development of Bharat NCAP 2.0 is officially underway at the Automotive Research Association of India (ARAI). The confirmation comes from Ujjwala Karle, deputy director and head of ARAI’s Technology Group. “We are working towards creating this new version [of Bharat NCAP], with work already in progress,” Karle stated at the second iteration of the ADAS Show in Bengaluru. The key challenge lies in adapting these features for Indian use cases: ARAI official Hyundai, Tata, Honda and Mahindra are among those offering more affordable cars with ADAS Bharat NCAP 2.0 ADAS testing explained As the next evolution of India’s automotive safety assessment programme, Bharat NCAP 2.0 will expand its testing capabilities to Advanced Driver Assistance Systems (ADAS), with these features becoming more commonplace in newer models. Companies such as Hyundai, Kia, MG, Tata Motors, Honda and Mahindra currently offer some of the most affordable cars equipped with ADAS features, and this list is only set to grow over time. ADAS tuning needs to be improved for India, says ARAI ADAS is an umbrella term encompassing intelligent vehicle features designed to aid drivers; these include lane-keep assist, adaptive cruise control, automatic emergency braking, and more. Currently, ADAS features up to Level 2 autonomy are offered in India. However, Karle noted that the key challenge with ADAS systems “lies in adapting these features” for Indian use cases. “We don’t want these systems to exist merely for the sake of availability, only to be switched off when actually needed. Instead, they should be fine-tuned to suit Indian driving conditions and user expectations,” she added. What is Bharat NCAP? Formulated by ARAI and rolled out in April 2023, the Bharat New Car Assessment Program (NCAP) follows the Global NCAP standards and grades passenger vehicles based on their crash-test performance. The initiative also improves the export potential of vehicles manufactured by Indian carmakers. So far, 14 cars, including the Skoda Kylaq, Mahindra XUV 9e, Mahindra BE 6, Hyundai Tucson and Citroen Basalt, have been tested by Bharat NCAP. Also see: Mahindra XEV 9e secures 5-star Bharat NCAP safety rating Skoda Kylaq gets 5-star Bharat NCAP rating",
    "author": "Viraaj Bhatnagar",
    "published": "Wed, 19 Feb 2025 18:02:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250219050506_IMG_5791.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "30b99fd9-51a2-418c-b357-789d1c15c255",
    "title": "Event Report: 5 Customs from the Las Vegas One Motorcycle Show",
    "link": "https://www.bikeexif.com/2025-vegas-one-motorcycle-show",
    "description": "It’s hard to believe, but it’s been 15 years since the first One Motorcycle Show was held back in 2010, and 2025 holds a special significance. This year, One combined forces with the AIMExpo to hold an additional event in Las Vegas alongside AIM, providing a unique opportunity to see two completely different sides of the industry. Started by the one-and-only Thor Drake, The One Show has always been unique in its quest to celebrate weird, rare, custom, classic and unconventional bikes, and we wondered if the event would hit as hard outside the context of Portland. With a list of 43 confirmed builders and countless additional motorcycles on hand, our concerns were quelled and the event expected to draw more than 9,000 attendees daily.…",
    "author": "Alfonso Paca",
    "published": "Wed, 19 Feb 2025 20:30:44 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/02/one-moto-show-vegas-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "Motorcycle Show",
      "BSA motorcycles",
      "Harley-Davidson",
      "Honda motorcycles"
    ]
  },
  {
    "id": "9e86e96a-cdc6-439e-950d-3d97a7ca0ad8",
    "title": "What Happens in Vegas: Must-See Motorcycles from the 2025 AIMExpo",
    "link": "https://www.bikeexif.com/motorcycles-from-the-2025-aimexpo",
    "description": "The American International Motorcycle Expo might not be the first place you’d expect to find us, as the event has a whole lot more to do with what’s on dealer floors than the custom scene. That’s not the whole story though, because besides rubbing elbows with industry partners and parts manufacturers, we also had a host of factory concept bikes and customs to hunt down. See, the big OEs are well aware that modified bikes bring big attention, and partnerships with reputable builders are one of the most effective ways to drum up excitement for their current offerings. And when you have the backing of corporate bucks, big things are possible. The AIMExpo isn’t open to the public, just industry members and press, so we flashed our credentials and got to hiking around the Las Vegas Convention Center.…",
    "author": "Alfonso Paca",
    "published": "Tue, 18 Feb 2025 17:00:35 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/02/aimexpo-25-bikes-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "Motorcycle Show",
      "Harley Pan America",
      "Moto Morini",
      "Royal Enfield"
    ]
  },
  {
    "id": "e7932c37-d97b-4329-a834-d163094faf0f",
    "title": "Rivian R1 Lineup Gains 850 HP California Dune Edition",
    "link": "https://www.carscoops.com/2025/02/rivian-r1-lineup-gains-850-hp-california-dune-edition/",
    "description": "The desert-themed models starts at $99,900 and are available to order today",
    "author": "Michael Gauthier",
    "published": "Thu, 20 Feb 2025 00:34:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/02/Rivian-Dune-Editions-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Electric Vehicles",
      "Prices",
      "Rivian",
      "Rivian R1S",
      "Rivian R1T"
    ]
  },
  {
    "id": "11c56f69-02b5-42da-8342-91d7aa636bdb",
    "title": "Kia’s Road-Ready PV5 Looks Just Like Last Year’s Concept",
    "link": "https://www.carscoops.com/2025/02/kias-road-ready-pv5-looks-just-like-last-years-concept/",
    "description": "Pricing details for the Kia PV5 will be announced closer to its market arrival",
    "author": "Brad Anderson",
    "published": "Thu, 20 Feb 2025 00:23:35 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/02/Kia-PV5-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Electric Vehicles",
      "Kia",
      "Kia PV5",
      "New Cars"
    ]
  },
  {
    "id": "9682960d-1c5e-42ac-81f5-c6f10635e466",
    "title": "Review: New “3D Cars – Inside Out” Blender Course",
    "link": "https://www.carbodydesign.com/2024/09/review-new-3d-cars-inside-out-blender-course/",
    "description": "The new training course by CGMasters explains advanced SubD (subdivision surfaces) modeling techniques for creating car 3D models in Blender with high quality surfaces.",
    "author": "Marco Traverso",
    "published": "Sun, 22 Sep 2024 07:47:04 +0000",
    "image": "http://www.carbodydesign.com/media/2023/07/3D-Cars-Blender-Course-Julietta-H6-Concept-3D-Model-04-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "_Cover Stories (Sticky)",
      "_Featured Articles",
      "_Sponsored Article",
      "3D Tutorials",
      "Blender Tutorials",
      "Car 3D Modeling Tutorials",
      "Car Rendering Tutorials",
      "Cover Stories",
      "3D",
      "Blender"
    ]
  },
  {
    "id": "7ee4b49d-73b2-4677-8053-7f1e99f68c8d",
    "title": "Stellantis launches annual Drive for Design contest",
    "link": "https://www.carbodydesign.com/2024/03/stellantis-launches-annual-drive-for-design-contest/",
    "description": "Stellantis has launched the new edition of its Drive for Design Contest for US high school students. The deadline is April 12, 2024 and the top prize is an internship at Ram Truck design studio.",
    "author": "Car Body Design",
    "published": "Mon, 11 Mar 2024 09:45:27 +0000",
    "image": "http://www.carbodydesign.com/media/2024/03/Stellantis-Drive-for-Design-Contest-Poster-02-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Car Design Competitions",
      "Dodge",
      "Drive for Design Contest",
      "Stellantis"
    ]
  },
  {
    "id": "52212041-428b-4388-b3b2-e0d5119098dc",
    "title": "2025 Jeep Wrangler 4xe Backcountry Is a Tech-Focused Off-Roader",
    "link": "https://www.caranddriver.com/news/a63845865/2025-jeep-wrangler-4xe-backcountry-details/",
    "description": "The limited-edition plug-in-hybrid Wrangler trim builds on the 4xe Sahara, adding new tech features and off-road accessories.",
    "author": "",
    "published": "Wed, 19 Feb 2025 23:19:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "181141fd-9495-4321-91ba-1219d33d0e9d",
    "title": "2026 Volvo XC60 Hybrid",
    "link": "https://www.caranddriver.com/volvo/xc60-hybrid-2026",
    "description": "Review, Pricing, and Specs",
    "author": "",
    "published": "Wed, 19 Feb 2025 21:49:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "453df76a-84bc-468b-a6a4-cad9f30aee38",
    "title": "Acura's Previous Attempts At Hybrids Were An Underpowered Compact, An Efficient Luxury Sedan And An SUV That Handled Like A Car",
    "link": "https://www.jalopnik.com/1794005/acura-ev-hybrid-plans-previous-attempts-history/",
    "description": "Amid uncertainty in the EV market, Acura might be making hybrids again, so we're taking a look back at its three previous efforts",
    "author": "Lawrence Hodge",
    "published": "Wed, 19 Feb 2025 22:25:26 +0000",
    "image": "https://www.jalopnik.com/img/gallery/acuras-previous-attempts-at-hybrids-were-an-underpowered-compact-an-efficient-luxury-sedan-and-an-suv-that-handled-like-a-car/l-intro-1739984356.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News",
      "EVs and Hybrids"
    ]
  },
  {
    "id": "500226ee-f361-453b-8897-857d6b1f22be",
    "title": "Trump Insists He's A King After Former 'Real World' Cast Member Tells NYC Congestion Relief Pricing Must End",
    "link": "https://www.jalopnik.com/1794557/us-dot-ends-tolling-approval-nyc-trump-long-live-king-statement/",
    "description": "The former reality star who now runs the Department of Transportation is trying to kill NYC's congestion charges on Trump's orders",
    "author": "Collin Woodard",
    "published": "Wed, 19 Feb 2025 21:49:16 +0000",
    "image": "https://www.jalopnik.com/img/gallery/trump-insists-hes-a-king-after-former-real-world-cast-member-tells-nyc-congestion-relief-pricing-must-end/l-intro-1740000899.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "5eb65be4-73be-40f9-96e4-71efda8964bf",
    "title": "Daniel Arsham’s Eroded Porsche 911: A Petrolhead’s Encounter With Art",
    "link": "https://www.speedhunters.com/2025/02/daniel-arsham-eroded-porsche-911/",
    "description": "Yet there it was: Daniel Arsham’s Blue Calcite Eroded Porsche 911 sculpture. Known for his ‘future relics’, the New York-based artist had created a vision of time and decay, cast in fibreglass, steel, and minerals. At first glance, the 1980 Porsche 911 SCs unmistakable lines are all there. But then, you notice Arsham’s signature touches. Sections of […] The post Daniel Arsham’s Eroded Porsche 911: A Petrolhead’s Encounter With Art appeared first on Speedhunters.",
    "author": "Vladimir Ljadov",
    "published": "Tue, 18 Feb 2025 06:30:48 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "911",
      "Andy Warhol",
      "contemporary art",
      "Daniel Arsham",
      "Jeff Koons",
      "Keith Harring",
      "London",
      "Moco Museum",
      "modern art",
      "pop art",
      "Porsche",
      "Porsche 911"
    ]
  },
  {
    "id": "9c0690b6-98b4-4b14-a278-e817f56d0320",
    "title": "5+7 = V12: A Custom BMW Super Saloon",
    "link": "https://www.speedhunters.com/2025/02/5-plus-7-equals-v12-a-custom-bmw-super-saloon/",
    "description": "My dream collection wouldn’t be complete without a Lamborghini Miura SV, a Mercedes-Benz SL70 AMG and an Alpina B12 Coupé. I’d also have a Mercedes-AMG S65 as a daily and a Ferrari Enzo to abuse on track. Though I think the most achievable ‘dream’ V12 of mine is an older Aston Martin DBS, in black, […] The post 5+7 = V12: A Custom BMW Super Saloon appeared first on Speedhunters.",
    "author": "Mario Christou",
    "published": "Sat, 15 Feb 2025 06:30:01 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Car Features",
      "Content",
      "5-Series",
      "BMW",
      "E34",
      "E38",
      "europe",
      "Lithuania",
      "M73",
      "M73B54",
      "v12"
    ]
  },
  {
    "id": "22eafd20-2abc-4f4b-9603-bd5dd3c64287",
    "title": "Ferrari at a Crossroads: Cavallino Classic '25",
    "link": "",
    "description": "The Breakers really shouldn’t exist. Not in its current artful form anyway. Built in 1896 as a wooden retreat for America’s elite, it was a beacon of wealth and exclusivity, until a kitchen fire consumed it in 1903.The owners rebuilt bigger, and grander, determined to make it even more opulent. But again in 1925, disaster struck, this time from something as trivial as an electric curling iron left on in a guest room. The flames ripped through the wooden structure, reducing it to embers once more.  Rather than admit defeat, the owners made sure it would never happen again. Inspired by the great Renaissance palaces of Italy, they rebuilt The Breakers in fire-proof stone, and marble. They wanted its legacy to last for generations.  That same spirit of preservation of legacy, reinvention, of perseverance, makes it the perfect stage for a sold out crowd Cavallino Classic, where Ferrari’s past and present meet in a curated display of mechanical art and automotive obsession.  Walking through the resort and then stepping out onto the 13th hole, it’s clear: this isn’t just another car show. The event was the biggest ever for organizers despite the layout itself reflecting a tight and quite exclusive capacity for cars. The lauded 250 GTO, of course stood commandingly, quietly, at the peak of the display.  The meticulously curated lineup of Ferrari’s greatest hits, F40s, Enzos, LaFerraris, formed the next tier, blue-chip collectibles that define generational milestones. Beyond that, the broader field of concours entrants stretched across the 13th green.  It’s easy to assume that Cavallino is just a playground for the ultra-rich, and it absolutely is, but that’s a lazy and pretty myopic take. Yes, these cars are enormously valuable. Yes, the event is very exclusive. But what stands out beyond the wealth, is the obsession. Talk to the attendees, and you realize just how deep the passion runs. These aren’t absentee collectors. They’re historians, archivists, curators of the Ferrari’s DNA. They don’t just know their car’s production numbers, they know who ordered it, and when. Where it’s been, how it was optioned, and what color thread was used in the interior stitching. Many of the participants care. Deeply. Cavallino isn’t just a concours; it’s a gathering of true believers. Dare to say, these are some absolutely ultimate car nerds. The Cavallino Classic isn’t just about \"owning\" a Ferrari. That’s why the judging process at at the event is taken so seriously. 70 out of 104 cars registered for judging this weekend achieved a 97 out of 100, earning them a best of show accolade.  Winning here isn’t just a physical trophy, it’s validation, and a stamp of approval from some of the most ruthless and knowledgeable judges on the planet. Ferrari historians, restorers, and experts are flown in from the U.S. and Europe, all working under the strict rules of the IAC/PFA, which, for the uninitiated, is the International Advisory Committee for the Preservation of the Ferrari Automobile. Basically, if you’re restoring a Ferrari and want it done right, these are the people you don’t want to disappoint. If they're happy. You're happy. Passing muster here adds weight to a car’s history, increases its value, and cements its place in Ferrari lore. A platinum award means that a panel of the world’s most discerning judges has picked your car apart and deemed it worthy.  In addition to well versed judges, Enzo Mattioli Ferrari, a direct descendant of the legendary Enzo Ferrari, partner and president of Cavallino Classic, and grandson of Piero Ferrari, attended the event. This added serious weight to not only the awards given, but the event itself.  “I strongly believe in the Cavallino project, and for this reason, I am excited to participate in its development and growth, not just with financial investment, but with strategic involvement,” said Enzo Mattioli Ferrari upon being named President of Cavallino. On display are cars both new and old. As of late, Ferrari’s latest hypercars, like the F80, the 12Cilindri, or even the Purosangue, don’t have that same immediate recognition outside the die-hard enthusiast circle as some of the legends of the past. Ferrari has leaned into hyper-exclusivity, and while that strengthens its brand prestige, it’s also pulling it further out of reach for the next generation. The F80, the current flagship is one of those cars. Batted about a bit in the media, it certainly doesn’t get justice it deserves. Photos don't do the trick. In person, it’s commanding, aggressive, a statement piece of design and engineering. But was it the standout of the councours? Maybe. Maybe not. It had a presence, no doubt. A modern Ferrari halo car always does, but was it the gravitational center of the event? People will wax on, telling you its not like the F40. “THAT was an instant icon” people usually opine. “Every kid with a bedroom wall had that poster! Something is missing.” Nostalgia is murky, and the truth is a little more nuanced. Upon its release in 1987, the Ferrari F40 received a mix of acclaim and criticism. It performed, but it was brutish, especially compared to its competition. It wasn’t yet on a pedestal. It had to earn it. And it would. Eventually. But it took decades to become the untouchable legend it is today. Whether the F80, or any other modern hypercar for that matter can achieve such heights is uncertain.    The Cavallino Classic is a crossroads, connecting Ferrari’s past, the stuff of legend, to whatever comes next. The show definitely captures Ferrari, and it's culture at a crucial point in time. Some of these cars will matter forever, some might never make it to the kind of legendary status we're used to seeing for some models. Right now, it is tough to know what’s to come, but at least we know the heritage is safe in the hands of everyone that came out to celebrate the legend that is Ferrari at Cavallino. Photos: Rafael Martin Continue...",
    "author": "",
    "published": "Tue, 18 Feb 2025 15:35:10 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2025/02/04111300/33-e1738726085897.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "5f0afb64-d1aa-48f8-8acc-a3cedb932f10",
    "title": "Evolution of an Icon: The MZR 240z",
    "link": "",
    "description": "﻿ The Datsun 240Z was never the problem. It was the solution. The answer to a world where European sports cars carried steep price tags and Japanese cars were still thought of as nothing more than basic transportation. For years, Japanese cars in America were what students drove to class, what families bought when they were new, when money was tight, or what commuters relied on when fuel prices spiked. They were appliances, used for economy, and durability. It’s easy to look back on them now as more than products of their time. But they weren’t. They filled parking lots at office buildings and grocery stores, racked up hundreds of thousands of miles on city roads, and lived out their lives as forgettable hand-me-downs, passed from one generation to the next until they rusted into the ground. They were not the cars enthusiasts dreamed about, not the machines people pinned on their walls or took out on Sunday after church for a little exercise. Today we love the quirky, endearing nature of the classic Japanese econobox, but back then? It was a tool.  The Z was one of the cars that changed everything. It was Japan’s bold declaration, a machine shaped by the same relentless craftsmanship and discipline that defined the country’s post-war industrial rise. It embodied the Japanese philosophy of kaizen, continuous improvement.  The Z was beautiful, with the long nose of a Ferrari, and an inline-six that, despite its modest origins (and with some SU carburetors installed), could sing when you need it to. In 1970, it was fast enough, with a chassis that felt nimble, eager, and alive in a way most Americans had never experienced in something that did not wear a European badge. It was still affordable, but it was no longer just transportation. It was undeniably a sports car. But time does not stand still. Roads get wider. And for better or worse, cars get faster, stop better, turn sharper, and expectations shift. The Z’s magic is still there, but modern traffic, modern brakes, and modern speed put it in a different context. It still thrives on momentum and chassis respect. But, time marches on. The engineers at Nissan did not create the perfect Z, they created the best one they could for the money, theirs, and yours. So, as is often the case as we make engine noises in our garage over winter, pontificating on what we can modify, and how things could be better. The question is not whether the Z is still great as it was, it is how much better could it be? For Rahail Tariq, the Z had been lurking in his subconscious, a shape that had stuck with him from flipping through magazine pages. When he finally got his first 240Z, his first classic car, it was white, with black sills and a set of 260Z wheels that he did not even know were incorrect at the time. He bought it online in 2005, not as an expert but as someone drawn to its presence, and it’s silhouette. That car, with all its patina and imperfections, was the seed that eventually grew into MZR Roadsports.   Rahail’s connection to cars ran deeper than just his own discoveries. His father, a technician in the 1970s, was always bringing home interesting machinery, M5s, Mini Coopers, Daimlers, even an E-Type Jaguar. Growing up around those cars, seeing the way his father worked on them, improved them, and understood them, gave him an appreciation for cars as something alive, something that could always be made better. The Z was just the first car where Rahail realized that he was the one who would have to push it forward. In the UK, where classic Japanese sports cars did not have the same deep-rooted restoration culture as Porsches or E-Types, Rahail found himself frustrated. Nobody was building the Z the way he envisioned it. No one was taking it to its logical next step, not just restoring but refining, improving. That search led him to Martin Ryland, a Datsun expert who eventually became his collaborator and helped shape the vision of MZR. Restomods are sometimes frowned upon, seen as tampering with an icon, but consider this. Given the opportunity, is it possible Nissan would have never left the Z as it was? If the company had continued refining it with an unlimited budget, what would it have looked like? A lighter chassis, a more rigid structure, and an engine with sharper response and a little more urgency. That is exactly what MZR is doing, finishing what the original engineers, given enough time, could have done, maybe even would have done, but did not. Their Evolution models, built with bespoke carbon-fiber bodywork, are not just about chasing numbers. Yes, the RB 3.4L DOHC straight-six delivers over 300 horsepower, and yes, the six-speed manual brings precision to every shift, but the real magic is in how it all comes together. It is a 240Z honed and distilled, shaped by the same kaizen philosophy that defined its creation, an ongoing pursuit of refinement, balance, and purpose. The 240Z never needed saving, it was never the problem after all. But it deserved to be honored, not just looked at through the lens of nostalgia. It was built to be driven, and MZR has made sure that it still begs to be. Continue...",
    "author": "",
    "published": "Fri, 14 Feb 2025 12:04:49 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2025/02/12075145/18.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "84e2fb69-ba21-43a9-b09e-320d0bf98779",
    "title": "Stellantis Suggests Not Waiting Around For Imported French Models",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/stellantis-suggests-not-waiting-around-for-imported-french-models-44512156?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "When PSA Group purchased Fiat Chrysler Motors (FCA) to create Stellantis, one of the first proclamations pertained to bringing historically French automotive brands back to North America. But that apparently isn’t on the table anymore.",
    "author": "Matt Posky",
    "published": "Wed, 19 Feb 2025 23:30:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/02/19/15511/stellantis-suggests-not-waiting-around-for-imported-french-models.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  },
  {
    "id": "054720f6-285d-4cd9-8ebb-4cc2707ef9c3",
    "title": "QOTD: Have You Been the Victim of Auto Theft?",
    "link": "https://www.thetruthaboutcars.com/cars/question-of-the-day/qotd-have-you-been-the-victim-of-auto-theft-44512162?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Ford will make some F-150 owners partially whole again if their truck gets stolen.",
    "author": "Tim Healey",
    "published": "Wed, 19 Feb 2025 23:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/02/19/17471/qotd-have-you-been-the-victim-of-auto-theft.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Question of the Day"
    ]
  }
]
