[
  {
    "id": "51f3be08-3bef-49bc-8669-339079519207",
    "title": "2021 McLaren Elva",
    "link": "https://bringatrailer.com/listing/2021-mclaren-elva-3/",
    "description": "This 2021 McLaren Elva is the 45th example built out of a planned production run of 149 and was delivered new to the selling dealer. The car was sold to its first owner in June 2021 before it was reacquired by the selling dealer in 2022. The windshield-free carbon-fiber body is finished in Norello Red, while power is provided by a 4.0-liter DOHC V8 with two twin-scroll turbochargers and dry-sump lubrication. Additional features include a seven-speed dual-clutch automatic transmission, an Active Air Management System, ProActive Chassis Control II, the Stealth Pack, deployable roll-over protection, electro-hydraulic steering, carbon-ceramic brakes, staggered-dimension super-lightweight forged wheels, a suspension lift system, a quad-outlet exhaust system, Pure White interior accents, and carbon-fiber seats trimmed in black and white leather with red piping and contrast stitching. This McLaren Elva has 681 miles and is now offered in Bellevue, Washington, with a window sticker, clean Carfax report, and a manufacturer's certificate of origin.",
    "author": "bringatrailer",
    "published": "Fri, 02 May 2025 00:15:14 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/03/2021_mclaren_elva_7Q6A2003_4k-39729-scaled.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "a83705ce-7161-4a89-ac48-1a7d626defb6",
    "title": "6.0L-Powered 1967 Iso Rivolta IR 300 6-Speed",
    "link": "https://bringatrailer.com/listing/1967-iso-rivolta-ir-300/",
    "description": "This 1967 Iso Rivolta IR 300 is one of 797 examples built between 1962 and 1970 and is said to have been delivered new in the US. It underwent a multi-year build after 2015 that included the installation of a 6.0-liter L76 V8 and Tremec TR-6060 six-speed manual transmission, a repaint in Grigio Silverstone, and an interior re-trim in Paloma Cork leather upholstery. A Heidts Superide II independent front coilover suspension was installed along with a custom Jaguar-style de Dion rear axle with adjustable shocks, and additional equipment includes an aluminum radiator, power-assisted rack-and-pinion steering, a MagnaFlow muffler, power-assisted four-wheel disc brakes with inboard rear units and a Wilwood billet master cylinder, 15″ Campagnolo alloy wheels with Borrani center-lock hubs, power windows, a VintageAir HVAC system, remote power locks, a B\u0026M shifter, an Alpine stereo, and a wood dash panel. The car was listed on BaT in February 2024 and later purchased by the current owner. This modified IR 300 is now offered on dealer consignment in Scottsdale, Arizona, with factory literature, refurbishment photos and records, and a clean Michigan title.",
    "author": "bringatrailer",
    "published": "Fri, 02 May 2025 00:00:12 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/04/Web-50472-67-Iso-3-70955.jpg?fit=940%2C529",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "48d03fe8-d869-4f5b-a338-0c528385b264",
    "title": "Porsche Panamera Turbo E-Hybrid and Turbo S E-Hybrid",
    "link": "https://www.autocar.co.uk/car-review/porsche/panamera-turbo-e-hybrid-turbo-s-e-hybrid",
    "description": "Top-level performance Panameras pack in versatile PHEV V8 powertrains and innovative suspension technology to broaden their appeal Porsche’s top-of-the-line Panamera has landed in the UK in its latest, third-generation or ‘976’ form.Lording it over a pair of other V8-powered hot Panameras (leaving the V6 and V6 PHEV models, with which we deal in our regular Panamera review, to one side), the Porsche Panamera Turbo S E-Hybrid becomes quite the potent proposition in all sorts of ways: technically, as a performance option or simply as a luxury electrified GT. And it comes at quite the price.The 493bhp pure-V8 GTS will cost you £132k before options; the 671bhp Turbo E-Hybrid £152k; and the Turbo S E-Hybrid a whisker over £175k. Our test car came to rest at an all-up £194k, even without Porsche’s carbonfibre-intensive aero kit.But Porsche actually delivers quite a lot on the top-of-the-line version for those who would be ordering a fully stocked vehicle anyway, and there’s fully 772bhp, 0-62mph in 2.9sec and up to 52 miles of electric-only range to tempt you.So just how generous should your budget be for the ultimate Porsche fast four-door? Read on to find out.",
    "author": "",
    "published": "Thu, 1 May 2025 16:57:36 +0100",
    "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/porsche-panamera-turbo-s-e-hybrid-front-tracking_0630.jpg?itok=V2mJcCRs",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "0f1f2c59-3888-422a-8663-2aa2909be10c",
    "title": "Leapmotor C10: £36k electric SUV gains extra power and range",
    "link": "https://www.autocar.co.uk/car-news/new-cars/leapmotor-c10-%C2%A336k-electric-suv-gains-extra-power-and-range",
    "description": "Leapmotor C10 currently offers 263 miles of range and 84kW charging Chinese EV brand’s Skoda Enyaq rival is updated in its home market, bringing 800V electricals The Leapmotor C10 has been updated in China, gaining more range, extra power and an upgraded infotainment system. Chief among the updates is a switch from 400V electricals to a more powerful 800V system. Leapmotor has yet to confirm specifics, but this should bring a significant increase in the car’s maximum charging speed – currently capped at 84kW, behind the 100kW or greater offered by many rivals. Meanwhile, it has uprated the rear-mounted electric motor from 215bhp to 295bhp, cutting its 0-62mph sprint time from 7.5sec to 5.9sec. The reworked C10 also gets a new LFP battery pack with 5kWh more capacity (74.9kWh total), boosting its range from 329 miles to 376 on the Chinese CLTC test cycle. Leapmotor has yet to publish figures for the new C10’s performance from Europe’s WLTP range test, but given that it currently stands at 261 miles, the new C10 is expected to nudge the 300-mile mark. The range-extender EV powertrain of the C10 REEV is unchanged, according to Chinese media reports. Both versions’ infotainment systems now run on a more powerful Qualcomm Snapdragon 8295P processor and their arrays of ADAS sensors now include a lidar. The C10's design remains the same as before, but the fully electric car can be had in a new purple paint colour.  Leapmotor has yet to announce when the revised C10 will land in British showrooms, but it comes as the Stellantis-backed brand positions itself for rapid global expansion. Having already launched the C10, C10 REEV and T03 city car, it will soon follow that with the B10 crossover, a Volkswagen Golf-sized hatchback named the B05 and a Renault 4 rival named the A10. That will be joined with an entry-level model – possibly priced below £20,000 – dubbed A05.",
    "author": "",
    "published": "Thu, 1 May 2025 15:39:11 +0100",
    "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/leapmotor-c10-2025-front-quarter-tracking.jpg?itok=unIjwzZO",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "106ebbcc-186b-4cdc-8f18-86e535b2f7bc",
    "title": "The Top 5 Things I Love—and Don’t Love—About the New BMW M5 (G90)",
    "link": "https://www.bmwblog.com/2025/05/01/bmw-m5-g90-review-pros-cons/",
    "description": "Spending time behind the wheel of the all-new 2025 BMW M5 (G90) is a deeply layered experience—one that combines hybrid performance, executive comfort, and BMW’s ongoing pursuit of technological innovation. But no car is perfect,... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Thu, 01 May 2025 14:51:24 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/04/2025-bmw-m5-g90-electric-range-test-01-830x467.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "BMW M5",
      "2025 BMW M5",
      "G90 M5"
    ]
  },
  {
    "id": "a809a0ae-526a-44e0-ae51-c1e1d7d1156c",
    "title": "BMW i2 Arrives in 2030 as a Four-Door EV: Sources",
    "link": "https://www.bmwblog.com/2025/05/01/2023-bmw-i2-four-door-electric-coupe/",
    "description": "BMW is planning a brand-new electric car called the i2, expected to arrive in 2030. But unlike the current 2 Series Coupe, which is a sporty two-door car, the new i2 is rumored to be... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Thu, 01 May 2025 13:49:39 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/02/bmw-gen6-motors-03-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "2 Series",
      "Rumors",
      "BMW i2",
      "NB8"
    ]
  },
  {
    "id": "de7ea673-5978-4cf3-b77a-fc1b645de1a9",
    "title": "Sales Of This Subaru Soared 86% Last Month",
    "link": "https://www.carscoops.com/2025/05/sales-of-this-subaru-soared-86-last-month/",
    "description": "While crossovers are king, a car saw the biggest increase in sales last month",
    "author": "Michael Gauthier",
    "published": "Fri, 02 May 2025 00:30:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/05/24MY_BRZ_-7-copy-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Sales",
      "Subaru"
    ]
  },
  {
    "id": "3fb100bb-a0ac-46ac-9442-ccfd7cff16da",
    "title": "Dodge Black Ghost Sale Proves Some Challengers Are More Valuable Than Others",
    "link": "https://www.carscoops.com/2025/05/dodge-black-ghost-sale-proves-some-challengers-are-more-valuable-than-others/",
    "description": "The muscle car sold for a premium over its original sticker price, though prices have dropped significantly from all-time highs",
    "author": "Brad Anderson",
    "published": "Thu, 01 May 2025 23:51:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/05/2022_dodge_challenger-srt-hellcat-widebodyf-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Auction",
      "Deals",
      "Dodge",
      "Dodge Challenger",
      "Galleries",
      "Used Cars"
    ]
  },
  {
    "id": "7a2ee789-6c3d-4a24-acba-9c34aec1c6a0",
    "title": "WKND Special: A Yamaha XT600 street tracker from Porto",
    "link": "https://www.bikeexif.com/yamaha-xt600-street-tracker",
    "description": "Every custom motorcycle builder has a horror story (or many) about having to fix someone else’s mistakes. Sergio Almeida is no exception. When he got his hands on this Yamaha XT600, it was a far cry from the slick street tracker you’re looking at here. “The bike was already far from stock,” says Sergio, who operates as WKND Customs out of Porto, Portugal. “It had an upside-down fork swap, a set of supermoto wheels, and a mix of random parts, including a sportbike mudguard and a dual-headlight front fairing. It had already gone through a second engine, after blowing the first—clear signs of a rough past that showed throughout the bike.” Sergio had two mammoth tasks in front of him. First, he had to undo the work already done.…",
    "author": "Wesley Reyneke",
    "published": "Wed, 30 Apr 2025 22:57:12 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/04/fb-16.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "Street Tracker",
      "Yamaha XT 600"
    ]
  },
  {
    "id": "90a681e8-b773-49a5-ab66-d6ea99a21817",
    "title": "Classic, Contemporary, Custom: Exploring The Ducati Scrambler Lineage",
    "link": "https://www.bikeexif.com/ducati-scrambler-motorcycle-lineage",
    "description": "In 1962, Kennedy was in the White House, Ray Charles was singing “I Can’t Stop Loving You” on the radio, and the Italian motorcycle company known for its high-performance racing machines premiered an on/off-road motorcycle for the American market. The Ducati Scrambler wasn’t the fastest bike on the track or gnarliest in the dirt, but it was fun, and in the age of Camelot, that was enough. Classic | 1969 Ducati 350 Scrambler Air-cooled, four-stroke, single-cylinder, SOHC 336 cc | 24 hp | 291 lbs | 5-speed The Scrambler was the brainchild of Joseph Berliner, president of the Berliner Motor Corporation. Founded in 1951 and located in Hasbrouck Heights, NJ, Berliner Motor Corporation was the U.S. importer of Ducati, Moto Guzzi, J.…",
    "author": "Iron and Air",
    "published": "Mon, 28 Apr 2025 17:33:25 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/04/ducati-scrambler-history-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Classic Motorcycles",
      "Custom Motorcycles",
      "Analog Motorcycles",
      "Ducati",
      "Ducati Scrambler",
      "Iron \u0026 Air"
    ]
  },
  {
    "id": "0d30c00f-a0a0-4fbb-ade2-c6a11a22d3af",
    "title": "KTM 390 Adventure X video review",
    "link": "https://www.autocarindia.com/bike-video-reviews/ktm-390-adventure-x-video-review-435173#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Also See: 2025 KTM 390 Adventure review: Second time’s the charm",
    "author": "Rishaad Mody",
    "published": "Thu, 24 Apr 2025 11:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250424110020_YT.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "50a750fb-fada-4ba8-9002-0f09e4ca0060",
    "title": "Alpinestars Supertech M10 helmet review",
    "link": "https://www.autocarindia.com/bike-reviews/alpinestars-supertech-m10-helmet-review-435181#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "When you’re late to the game, the best way to make an entry is with innovation. That’s exactly what Alpinestars did when they got into the motorcycle helmet market with the SM10 about six years ago. Having recently moved to this helmet after retiring my Leat GPX 5.5 (another innovative product), there’s a lot of out-of-the-box thinking that I’ve appreciated. The M10's snap-fit peak mechanism is convenient. For starters, I love the way the peak fit flush with the shell. The safety advantage is that the smooth interface leaves no edges or fasteners to catch on the ground in the fall, but the big benefit to me is the unique snap-fit fastening mechanism. There are no screws involved, and you can just pull the peak off or snap it back into place, which is a huge convenience if you regularly travel with the helmet. The downside of this design is that the peak position is not adjustable. The M10's liner has speaker cutouts. Other nice touches include speaker pockets and a three-way adjustable headband that can slightly adjust the angle at which the helmet sits on your head. There are grooves in the inner EPS liner for you to neatly route a drinks tube from a hydration bladder. Astars has also extended the EPS liner down below the cutout of the outer shell in the collarbone area. This is to reduce the chance of common injuries when the helmet hits the collarbone in a crash. Like many off-road helmets, this one also uses a variation of the MIPS (Multi-Directional Impact Protection System) technology. This enables a small amount of rotational slip between the outer shell and the inner liner, which is supposed to reduce the chances of concussion and other brain/neck injuries. The shell is constructed in a tri-composite material that uses carbon fibre, carbon composite and aramid fibres. Weighing in at 1,180gm, this would have been considered in the middle ground a few years ago, but it is now quite light with today’s stricter safety standards.   There are a huge number of vents all over the helmet (I counted 28!), and as you’d expect, the airflow is superb. The vision port is also very large, which means you should be able to fit a big pair of goggles without any issues. The comfort padding is fully removable and washable, and it uses an interesting fastening system, where you first align the buttons and then slide them into place. It works well once you figure it out. The M10's liner has exceptional ventilation. With a head circumference of 56.5cm, I’m in the no man’s land between sizes S and M. I went with the S that I usually use with other brands, but I find it a bit too tight. Astars has 5mm thinner accessory cheek pads that I’m keen to try, but I suspect it might have been smarter to go for the M size (which uses a larger shell) and then opt for the 5mm thicker accessory cheek pads if necessary. Just another reminder of why you must always try before you buy. Priced between USD 650 and USD 800, this helmet is on par with the competition from top rival brands. The M10 ships with a spare peak and a bag that’s spacious enough to hold a pair of goggles and even a jersey and pants set without the armour. While the helmet does feel very well-made, there is still a small margin to be gained in terms of ultimate quality and plushness when compared to something like an Arai. But in pure performance terms, this helmet is superb, and it can justify its price. Where: www.alpinestars.com Price: Rs 65,000 Also See: Alpinestars A10 V2 Full Chest Protector review Leatt GPX 5.5 helmet review",
    "author": "Rishaad Mody",
    "published": "Thu, 24 Apr 2025 07:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250423051945_A1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "e2b881cc-94b2-4ed5-a226-bed66d4e1b4c",
    "title": "Does A Roof Box Hurt Your Car's Performance?",
    "link": "https://www.jalopnik.com/1848704/roof-box-impact-mpg-performance-range/",
    "description": "Nobody likes taking the roof box off their car, but laziness could be costing you more than you'd expect.",
    "author": "Brad Brownell",
    "published": "Thu, 01 May 2025 21:25:00 +0000",
    "image": "https://www.jalopnik.com/img/gallery/does-a-roof-box-hurt-your-cars-efficiency/l-intro-1746119351.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News",
      "Tesla",
      "Jalopnik Explains"
    ]
  },
  {
    "id": "2994f368-0047-43f1-aebf-ff21121ecc36",
    "title": "I Rode A Four-Cylinder Motorcycle And Now I'm Ruined For Twins",
    "link": "https://www.jalopnik.com/1848449/four-cylinder-motorcycle-riding-experience/",
    "description": "Loud, uncomfortable, and yet somehow impossible to forget.",
    "author": "Amber DaSilva",
    "published": "Thu, 01 May 2025 20:25:00 +0000",
    "image": "https://www.jalopnik.com/img/gallery/i-rode-a-four-cylinder-motorcycle-and-now-im-ruined-for-twins/l-intro-1746108406.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News",
      "Motorcycles"
    ]
  },
  {
    "id": "5ed552be-ed21-407e-856f-39cd25f7cc52",
    "title": "2025 Defender Octa India video review",
    "link": "https://www.autocarindia.com/car-video-reviews/2025-defender-octa-india-video-review-435242#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also See: Mercedes G Class Electric video review",
    "author": "Hormazd Sorabjee",
    "published": "Wed, 30 Apr 2025 19:18:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250430071149_Kia Carens facelift.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "c4627c3c-bbdd-464f-9bbf-ffb6fb433396",
    "title": "2025 Volkswagen Tiguan R-Line video review",
    "link": "https://www.autocarindia.com/car-video-reviews/2025-volkswagen-tiguan-r-line-video-review-435223#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also See: 2025 Skoda Kodiaq video review",
    "author": "Jay Patil",
    "published": "Tue, 29 Apr 2025 11:49:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250429114747_Tata Altroz  _1_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "157c4b15-2dea-47b8-b0b0-7a284337289d",
    "title": "Chery New Journeo Concept",
    "link": "https://www.carbodydesign.com/2025/03/chery-new-journeo-concept/",
    "description": "The Chery New Journeo Concept is a futuristic multi-purpose vehicle developed at the Chery Advanced Design Center Europe in Raunheim, Germany and presented at the 2024 Guangzhou Motor Show.",
    "author": "Car Body Design",
    "published": "Tue, 04 Mar 2025 14:25:20 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/Chery-New-Journeo-Fulwin-Jinyun-SMPV-Concept-Design-Sketch-Render-13-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Concept Cars",
      "Cover Stories",
      "Chery",
      "Chery New Journeo Concept"
    ]
  },
  {
    "id": "fcf7abd2-c9af-4d7e-94c2-575dc4797ac9",
    "title": "MG announces MGS5 new EV SUV",
    "link": "https://www.carbodydesign.com/2025/03/mg-announces-mgs5-new-ev-suv/",
    "description": "MG Motor UK has confirmed the MGS5 EV, an all-electric SUV debuting this Spring. Built on the modular scalable platform (MSP), it will focus on performance, efficiency, and interior space.",
    "author": "Car Body Design",
    "published": "Mon, 03 Mar 2025 17:26:28 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/MG-MGS5-EV-SUV-Preview-01-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Production Cars",
      "MG"
    ]
  },
  {
    "id": "c15874a3-5744-4b08-b0a9-e766854d5547",
    "title": "2025 Ferrari Roma",
    "link": "https://www.caranddriver.com/ferrari/roma",
    "description": "Review, Pricing, and Specs",
    "author": "",
    "published": "Thu, 01 May 2025 20:26:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "7facf907-4acb-4c52-ad7f-d9ae96f142c0",
    "title": "View Photos of the 1990 Nissan 300ZX Turbo",
    "link": "https://www.caranddriver.com/photos/g64341151/1990-nissan-300zx-turbo-archive-test-gallery/",
    "description": "1990 Nissan 300ZX Turbo exterior and interior photos.",
    "author": "",
    "published": "Thu, 01 May 2025 19:00:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "c4ca3843-71c8-4a98-8ee4-60361eb1466d",
    "title": "Tariffs Have Automakers Totally Scrapping 2025 Finance Outlooks",
    "link": "https://www.autoblog.com/news/tariffs-have-automakers-totally-scrapping-2025-finance-outlooks",
    "description": "We already know tariffs have automakers reeling, but it’s becoming even more apparent that the auto industry is headed for uncharted waters. Some automakers — namely GM, Mercedes-Benz, and Stellantis — have all released independent statements that essentially boil down to “it’s impossible to see ...",
    "author": "Steven Paul",
    "published": "Thu, 01 May 2025 20:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODkzNjgz/mercedes-benz-ecampus-in-stuttgart.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "GM",
      "Stellantis",
      "Mercedes-benz",
      "News",
      "Sedan"
    ]
  },
  {
    "id": "b8d37760-5671-4f28-87aa-bef9d0d0aed2",
    "title": "Toyota bZ3X Is Actually Selling Extremely Well - In China",
    "link": "https://www.autoblog.com/news/toyota-bz3x-is-actually-selling-extremely-well-in-china",
    "description": "The car is barely one month old and Toyota has already delivered 10,000 units",
    "author": "Nate Swanner",
    "published": "Thu, 01 May 2025 18:59:59 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MDg5NDg5ODM3NTAwMjYw/toyota-bz3x.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "News",
      "Crossover",
      "Toyota",
      "Electric",
      "bZ3X"
    ]
  },
  {
    "id": "8ae21001-d199-4ca1-b407-740ebadc50b8",
    "title": "Iowa Passes Bill Shielding Racetracks From Noise Complaints",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/iowa-passes-bill-shielding-racetracks-from-noise-complaints-44513641?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Iowa has passed a bill that prohibits people from issuing formal complaints about nearby racetracks. House Bill 645 is designed to protect racing venues from being subject to legal actions pertaining to noise and nuisance claims.",
    "author": "Matt Posky",
    "published": "Thu, 01 May 2025 21:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/05/01/14551/post.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  },
  {
    "id": "c5a46025-c479-463c-9904-eb6ef373831d",
    "title": "Typhoon: The Ultimate Aquatic All-Terrain Beast",
    "link": "https://www.thetruthaboutcars.com/cars/typhoon-the-ultimate-aquatic-all-terrain-beast-44513635?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "The Typhoon by Shadow Six Racing is a high-performance fusion of an all-terrain vehicle and a watercraft, designed for motorsports enthusiasts and defense applications. Dubbed the “first aquatic utility vehicle ever,” this 2,365-pound machine accommodates up to three passengers and is built with aerospace-grade titanium and carbon fiber for durability and lightweight performance.",
    "author": "Your Future Machine | TTAC Creator",
    "published": "Thu, 01 May 2025 18:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/05/01/11153/post.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": null
  },
  {
    "id": "dcf2855f-fe33-4d8a-a817-f5a659b41b60",
    "title": "727hp Aston Martin DBX S revealed as new range-topping variant",
    "link": "https://www.autocarindia.com/car-news/727hp-aston-martin-dbx-s-revealed-as-new-range-topping-variant-435244#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "The Aston Martin DBX SUV has received a new range-topping S variant that takes peak power output to 727hp, making it the most powerful non-electrified SUV, more than even the 725hp Ferrari Purosangue. This is also the first time Aston martin has applied the S badge on an SUV which typically has been used on its range of high-performance supercars. DBX S is powered by 727hp, 4.0-litre twin turbo V8 Gets new weight saving measures over the DBX 707 9-speed automatic gearbox has been tuned for more aggressive shifts Aston Martin DBX S engine and specs 0-200kph sprint time shaved by 0.3 seconds The new DBX S produces 20hp more than the aptly named DBX 707 with 707hp. It retains the same 4.0-litre twin-turbocharged V8 engine, but it has been reworked with larger compressor wheel diameters taken from the Valhalla. It has also been tuned for more “urgency” at the top end of the rev counter. The result is that 0-200kph now comes up in 0.3 seconds lesser, although the 0-100kph sprint time of 3.3 seconds has remain unchanged from DBX 707. The torque output of 900Nm has also remained unchanged. There’s also a new exhaust system that makes the V8 louder, the steering ratio is now 4 percent quicker and the turning circle has been trimmed by nearly half a metre. The variable all-wheel drive system and 9-speed wet-clutch automatic gearbox has been carried over from the DBX 707, although Aston Martin says the change-up points for the gearbox have been reworked to account for the wider rev range, and the downshifts in Sport and Sport+ modes are more aggressive. Aston Martin DBX S weight saving measures 47kg lighter than the DBX 707 The new DBX S doesn’t just come with a boost in power output, but it also sheds a significant 47kg of the DBX 707’s weight. This has been achieved with an optional carbon fibre roof that forgoes roof rails, and alone accounts for 18kg of the weight saved, apart from also helping lower the centre of gravity. There are also optional 23-inch magnesium wheels, which are 19kg lighter than the standard aluminium versions, and an optional polycarbonate honeycomb grille. The end result is a total kerb weight of 2198kg, which still isn’t particularly light weight by any measure. Aston Martin DBX S design and interior  Looks meaner, gets bespoke interior There are also a number of styling changes which include a new black grille design inspired by the DBS 770 Ultimate, a new front splitter, a reworked diffuser at the rear, and new side sills that help channel airflow around the side of the car. At the back, the twin exhausts tips on each side are now vertically stacked as opposed to the horizontal arrangement on the 707. Inside, there is a bespoke S design with a herringbone pattern on the seats and this is extended to the headlining if the carbon fibre roof is selected. Alcantara upholstery is standard, while semi-aniline leather and red seatbelts are optional. An optional 23-speaker Bowers \u0026 Wilkins set-up is also offered. Aston Martin DBX S rivals The Aston Martin DBX S rivals the likes of the Ferrari Purosangue, Lamborghini Urus and the Porsche Cayenne Turbo. As already mentioned, it is more powerful than the naturally aspirated 6.5-litre, V12-powered Ferrari, but still leaves it short of rivals that use electrified powertrains, such as the 739hp Cayenne Turbo E-Hybrid or the 800hp Urus SE. Also See: Lamborghini Temerario launched at Rs 6 crore New Mercedes AMG GT 63, GT Pro India launch on June 27",
    "author": "Saptarshi Mondal",
    "published": "Thu, 1 May 2025 17:41:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250501054040_2.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "551dcadd-318b-46cb-b28c-f22d2e634794",
    "title": "Kia Carens facelift to be called Clavis",
    "link": "https://www.autocarindia.com/car-news/kia-carens-facelift-to-be-called-clavis-435243#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Kia India has confirmed that the upcoming Carens facelift will be called Clavis. Kia earlier said that the updated Carens will get a new suffix in its name, and be sold alongside the current MPV with a more premium positioning, similar to how Maruti has positioned the Ertiga and XL6. The Kia Clavis launch is slated for May 8, 2025.  Kia confirmed the 'Clavis' name today alongside a teaser video Kia Clavis will feature redesigned headlights and new connected tail-lights New Clavis may share its engine and gearbox options with the Carens Kia Clavis exterior details New three-pod headlights A Clavis teaser video was released today, showcasing the MPV with a new face, slimmer grille and redesigned headlights, which look in line with newer Kia cars. Though not much was revealed in the video, we expect the Clavis to get a new design for the dual-tone alloy wheels and the bumpers, as well as connected tail-lights (seen in a spy shot from before). Kia Clavis interior features expectations ADAS, 360-degree camera setup likely The current Carens is the only Kia model in India to not feature an ADAS suite, but the Clavis teaser showing a collision warning on the digital cluster suggests the updated MPV could finally get some level of autonomous tech. Apart from that, the Clavis top model may also add a 360-degree camera setup. Minor changes to the dashboard, switches, toggles and buttons are likely as well. Kia Clavis powertrain options May borrow Carens' petrol and diesel engines Image used for representation. The new Clavis is expected to share its powertrains with the current Kia Carens. These comprise three 1.5-litre engines: naturally-aspirated (NA) petrol (115hp, 144Nm), turbo-petrol (160hp, 253Nm) and diesel (116hp, 250Nm). The NA petrol engine comes only with a manual gearbox, while the turbo-petrol motor can be paired with either an iMT (clutchless manual) or DCT. Meanwhile, the diesel engine is offered with manual and torque converter automatic options. To know about the Kia Clavis price expectations and rivals, click here. Also see: Kia Carens petrol accounts for 58 percent of total sales Kia Seltos hybrid confirmed at brand’s 2025 Investor Day",
    "author": "Uday Singh",
    "published": "Thu, 1 May 2025 14:47:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250501090105_The recently launched Kia Syros is the brand_s second offering in the sub_4 metre SUV segment. _32_.png",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "219984da-26c2-422e-b46e-6b83dc6adfb9",
    "title": "A How-To Guide To ITBs With Project NSX",
    "link": "https://www.speedhunters.com/2025/04/guide-itbs-project-nsx/",
    "description": "What do we love so much about naturally aspirated engines? Perhaps the musicality, or the responsiveness, or the combination of both that creates an emotionally rewarding experience with every stab at the throttle pedal. Well, whatever underpins that appeal, I can say for sure that nothing turns it up to 11 quite like a set of […] The post A How-To Guide To ITBs With Project NSX appeared first on Speedhunters.",
    "author": "Blake Jones",
    "published": "Tue, 08 Apr 2025 23:31:04 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Australia",
      "honda",
      "individual throttle bodies",
      "ITB",
      "ITBs",
      "NA1",
      "NSX",
      "project car",
      "Project Cars",
      "Project NSX",
      "Speedhunters Project Car"
    ]
  },
  {
    "id": "787c847e-4a36-4fcd-96f0-ccad28f628ae",
    "title": "3 Days At The World’s Most Luxurious Race Track",
    "link": "https://www.speedhunters.com/2025/04/3-days-worlds-luxurious-race-track/",
    "description": "That’s what Cornes \u0026 Co did here in Japan, and with that, we’re left with The Magarigawa Club. The Magarigawa Club is not hot off the press news, it’s actually been open for a little over 18 months now, but since it’s doors have opened, I had yet to have the chance to visit and see what […] The post 3 Days At The World’s Most Luxurious Race Track appeared first on Speedhunters.",
    "author": "Alec Pender",
    "published": "Sat, 05 Apr 2025 04:39:05 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Circuit",
      "honda",
      "japan",
      "Manthey",
      "Porsche"
    ]
  }
]
