[
  {
    "id": "b45a0256-5b06-44d9-8998-a4011f08792a",
    "title": "480-Mile 2007 Ferrari F430 Spider 6-Speed at No Reserve",
    "link": "https://bringatrailer.com/listing/2007-ferrari-f430-spider-72/",
    "description": "This 2007 Ferrari F430 Spider was first delivered to Ferrari of Newport Beach in California, and it was specified with approximately $207k in options, some of which include hand-stitched Schedoni leather upholstery, Scuderia Ferrari fender shields, Daytona-style seats, carbon-fiber engine bay and cabin trim, and carbon-ceramic brakes with yellow-finished calipers. It has 480 miles following registration history in California and Florida, and it has spent most of its time in a collection. The car is finished in Giallo Modena and is powered by a 4.3-liter DOHC V8 paired with a six-speed manual transaxle. Additional equipment includes a black convertible soft top, 19\" split-spoke alloy wheels, an electronically controlled limited-slip differential, front and rear parking sensors, and automatic climate control. This F430 Spider is now offered in California by the selling dealer at no reserve with a window sticker, service records, a clean Carfax report, and a clean Florida title.",
    "author": "bringatrailer",
    "published": "Thu, 31 Oct 2024 00:00:05 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/10/2007_ferrari_f430-spider_t7__7973-61975.jpg?fit=940%2C626",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "11673fab-5157-4881-9def-ef536b15b2aa",
    "title": "2018 McLaren 720S Coupe",
    "link": "https://bringatrailer.com/listing/2018-mclaren-720s-coupe-11/",
    "description": "This 2018 McLaren 720S coupe has 7k miles and was optioned from the factory with the Exterior Carbon Fiber Pack 1, the Stealth Pack, and a sport exhaust system. It is finished in Glacier White over black leather upholstery and is powered by a twin-turbocharged 4.0-liter V8 mated to a seven-speed dual-clutch transaxle. The car is further equipped with a 360-degree Park Assist, a vehicle-lift system, an active rear spoiler, carbon-ceramic brakes, 19\" and 20\" Stealth-finished split-spoke wheels, dihedral soft close doors, and a 12-speaker Bowers \u0026 Wilkins audio system linked with a touchscreen infotainment system. This 720S was acquired by the selling dealer in 2024 and is now offered with a digital reproduction window sticker, a clean Carfax report, and a clean Florida title.",
    "author": "bringatrailer",
    "published": "Wed, 30 Oct 2024 23:55:04 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/10/2018_mclaren_720s-coupe_51-1-95459.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "c677d2cb-0767-4c9e-9a0b-75e4020bc8eb",
    "title": "Renault Embleme due in 2028 as first of radical new EV family",
    "link": "https://www.autocar.co.uk/car-news/new-cars/renault-embleme-due-2028-first-radical-new-ev-family",
    "description": "Renault Emblème concept shown at the Paris motor show is our first look at the next-gen EVs Renault's next EVs aim to slash battery costs by 50%, reduce charge stops to 15 minutes and achieve 5.2mpkWh Renault will introduce a new generation of electric cars from 2028, promising such drastic improvements in efficiency, charging, sustainability and functionality that they will effectively \"catch up two generations in one\". One year on from its foundation, the Renault Group's Ampere EV division is well advanced with development on the cars that will take Renault into the next decade, outlining plans to slash battery costs by 50% in the next three years, boost rolling efficiency to 5.2mpkWh and cut charging times to as little as 15 minutes. The technological developments will be accompanied by a whole new approach to exterior and interior design. The new Renault Emblème concept, revealed at the Paris motor show last month, gives strong clues as to what to expect from these upcoming EVs, with sleek, aerodynamically optimised bodywork, a futuristic minimalist interior and a radical powertrain that uniquely combines a hydrogen fuel cell with a battery-electric powertrain. Renault CEO Luca de Meo went as far as to strongly hint that a subtly evolved evolution of the Emblème will be among the first of these cars to arrive, saying: “Maybe you think it is just a concept or a vision, but if you know me a little, you know that whenever I put something on a stage, I tend to do it in the end.” Notably, Renault’s last three high-profile concepts – the 4, 5 and Scenic EVs – have all made production relatively unaltered. Notably, de Meo suggested that the production version of the Emblème will ride on a “next-generation, revolutionary C-segment platform”, suggesting it will be technically unrelated to the Ampr platform-based 4, 5, Mégane and Scenic on sale today. Continuing to invest heavily in Renault’s upcoming EVs is important, he said – even amid slowing growth in European EV uptake – because “EV is the future\", \"no matter the short-term bumps and hurdles”. “People are expressing concerns about the EV market plateauing,” de Meo added, “and don’t count on me to say that everything is fine: there are obviously huge challenges, and I think Europe must fix them urgently. But I also think it's important that we put the focus back on the big future. And I would say from a long-term perspective, in fact, EV is the future, or at least it's a very big part of the future.” The EV market, he said, “is where growth is going to happen for the automotive industry in Europe”, while “the rest of the market will be flat or potentially declining” - justifying the decision to spin off Ampere from Renault a year ago. Already, de Meo said, there is “scientifically no doubt” that an EV has a lower carbon footprint than an ICE alternative from cradle to grave, and Ampere’s development efforts mean Renault’s EVs will have a 70% smaller carbon footprint than their ICE counterparts by 2030. Furthermore, he said that EVs are already cheaper than ICE cars from a total cost of ownership perspective and suggested that work to increase battery energy density, reduce production costs and make cars more efficient overall will help to further widen that disparity. New battery tech Among the most significant technical developments for Renault’s new-generation EVs will be the introduction of much more energy-dense battery packs, which it said will combine \"the energy density of nickel-manganese-cobalt [NMC chemistry], the cost and safety of lithium-iron-phosphate [LFP chemistry] and less than 15-minute charges\". Chemistry currently accounts for 60-75% of a battery’s cost, Renault said, which is the main factor in their price premium compared with ICE alternatives and the key incentive to invest in new types of cell that can reduce the cost to consumer. From 2026, Renault will swap its mainstream EV batteries from NMC to LFP, which it says will reduce costs by 20% while having no impact on range. Ampere has worked with Renault’s EV platform developers to design a new cell-to-pack battery arrangement to compensate for the inherent reduced efficiency of LFP compared with NMC, so the cost reduction won't be accompanied by any drop in energy output. The company will boost that cost reduction to 50% (compared with today) by 2028, with the introduction of a new chemistry that combines a cobalt-free cathode with a silicon anode, which it says gives the energy density of NMC at the cost – and with the safety credentials – of LFP. An added benefit, it said, is that this chemistry allows for much quicker (15-minute) charging times. Then, within the next decade, Ampere will look to double the energy density of its NMC packs by replacing the silicon anode with a lithium metal alternative - a composition that it refers to as the “building block” for solid state technology, which Renault plans to have in a production car within the next decade. Alliance partner Nissan notably has confirmed plans to sell a solid-state EV from 2028, but when pressed for details about whether Renault could match that timeline, Ampere’s head of cell chemistry development, Mohamed Taggougui, would only say that the company was “talking to” its Japanese counterparts. Renault’s engineers highlighted that 25-40% of the cost of a battery pertains to integration costs – by which they mean the casing and the way it's mounted into the chassis – and halving that cost by 2028 is also key to Ampere’s plans. Crucial developments here include the adoption of a new cell-to-pack battery design that maximises usable capacity, and work is in progress to adopt a cell-to-chassis arrangement in upcoming EVs, further increasing efficiency. Cutting carbon footprint At the heart of Renault’s electrification strategy is a push to dramatically reduce the carbon footprint of both its cars and its global operations. That ambition is symbolised by the Emblème concept, which is projected to have a total lifecycle (15 years or 200,000km) carbon footprint of just five tonnes, compared with the circa-50 tonnes emitted by a petrol-engined, current-generation Captur. Making the Captur electric would only solve “half this problem”, claimed sustainability boss Cléa Martinet, because of the impact of sourcing battery materials and the huge array of other components used throughout the car. Martinet said that achieving net-zero in vehicle production is contingent on sourcing low-carbon energy, optimising the efficiency of battery factories and procuring battery materials with as small an impact as possible - all goals that Renault is attaching to the roll-out of its next-generation EVs. Using recycled aluminium for battery casings and making steel bodywork panels – \"one of the most resistant and demanding components of the car\" – by combining iron ore with hydrogen in an electric furnace will also be crucial steps towards achieving that goal. Asked by Autocar how Ampere will work to lower the carbon footprint of its wider supply network, Martinet said: \"That's part of our logistics decarbonisation strategy. We have an objective to reduce it by 20% by 2030. \"What's really crucial here is that 75% of our tier-one suppliers are located in a 300km radius, because this is an automotive industry neurologic centre we're in at the moment,\" referring to the region around Renault's ElectriCity EV production hub in northern France. \"It's helpful for an EV car maker to have this very strong localisation in Europe,\" she said, adding that it will be especially helpful when the EU's new carbon border adjustment mechanism – which taxes the import of several key car-building materials – comes into effect.",
    "author": "",
    "published": "Wed, 30 Oct 2024 16:45:53 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/renault-embleme-paris-2024-front-quarter.jpg?itok=QaKNgtOC",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "e09824bf-6ddf-4ff1-afc3-3da6f4a2ed68",
    "title": "Nissan primes Renault Twingo twin for Europe",
    "link": "https://www.autocar.co.uk/car-news/new-cars/nissan-primes-renault-twingo-twin-europe",
    "description": "Key reasons for collaboration are the reduced costs and faster pace brought by shared underpinnings Japanese manufacturer is in talks with Renault EV division Ampere about producing a new A-segment car Nissan is in the early stages of developing an electric city car for Europe, twinned with the upcoming Renault Twingo EV. The Japanese firm has begun talks with Alliance partner Renault’s Ampere EV division about the development of an ‘A-segment’ EV based on the Ampr Small platform that underpins the forthcoming Twingo (as well as the larger Renault 4 and 5). In a televised address to media at Ampere’s ElectriCity production hub in northern France, Nissan CEO Makoto Uchida revealed that the company has plans to re-enter the European city car segment for the first time in more than a decade, using underpinnings supplied by its French partner. Nissan is already poised to reveal an electric successor to the Micra supermini on the Ampr Small platform. This is “on track” for launch in 2025, said Uchida, adding that he wants to maintain “the positive momentum” of the two firms’ technical collaboration with a second model. He offered no details as to what this new model might look like, when it could arrive or how much it might cost but emphasised that a key reason for collaborating with Ampere is the reduced development costs and timelines that come from using a pre-developed platform. “Through this partnership, we aim to optimise our European market coverage. With Ampere, we are targeting a very short development time, which means that we can deliver this new vehicle at the best time for the market.” Speed is already a core tenet of Ampere’s development programmes: it took the Twingo from conception to sign-off in just nine weeks and aims to have it in production within just two years from that point, in a bid to match the fast-paced development cycles of Chinese competitors. Renault has already committed to bringing the Twingo to market for less than £17,000 (although a UK launch remains unconfirmed), with a cruising efficiency of 6.2mpkWh and 75% fewer carbon emissions over its lifecycle than today’s city cars. Uchida said: “We are aiming for a smart car for the drivers of tomorrow that will be good for customers, for us and for Ampere. \"This car will deliver the convenience and advanced functionality that customers experience but in a small size and at an attractive and affordable price.” He acknowledged that the talks are at an early stage but said the move “does represent an expansion of our co-operation in different vehicle segments\" and \"shows the strengths of our alliance and our shared desire innovate for customers”. Nissan hasn't sold a car below the Micra in Europe since axing the Pixo more than a decade ago and in the intervening years has ramped up its focus on crossovers and EVs. Next year, it will relaunch the Leaf as a crossover, and by the end of the decade it will offer electric alternatives to the big-selling Juke and Qashqai - all three cars built in Sunderland.",
    "author": "",
    "published": "Wed, 30 Oct 2024 16:45:53 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/nissan-ampere-a-segment-car-teaser.jpg?itok=xoRHVMN8",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "ce732e74-f4e2-417c-a46a-f9c87c0c89b6",
    "title": "BMW UK’s i5, i7, and MINI Cooper SE Take Top Electric Honors",
    "link": "https://www.bmwblog.com/2024/10/30/bmw-group-uk-what-car-electric-car-awards-2024/",
    "description": "BMW Group UK took home three awards at the What Car? Electric Car Awards, highlighting a strong performance across estate, luxury, and small car categories. In the estate segment, the BMW i5 Touring was named... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Wed, 30 Oct 2024 22:57:51 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/07/BMW-i5-Touring-89-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "News",
      "i5 Touring",
      "i7",
      "Mini Cooper SE"
    ]
  },
  {
    "id": "e52f8ac8-169f-4e14-b6cf-e6fddafc4dea",
    "title": "BMW Brings First Lithium Battery Production to Mexico in San Luis Potosí Expansion",
    "link": "https://www.bmwblog.com/2024/10/30/bmw-lithium-battery-production-mexico-san-luis-potosi/",
    "description": "During a press event at the San Luis Potosi plant in Mexico, BMW confirmed that it will begin pre-series battery production by the end of 2025. In order to reach the deadline, the German automaker... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Wed, 30 Oct 2024 18:45:15 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/10/bmw-san-luis-potosi-59-830x623.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "News",
      "BMW Mexico",
      "san luis potosi"
    ]
  },
  {
    "id": "9d05ef04-e986-4b19-9dca-eb15c619def9",
    "title": "How to build a Harley Sportster street tracker, the Mule way",
    "link": "https://www.bikeexif.com/sportster-street-tracker-mule",
    "description": "Like most skilled craftsmen, Richard ‘Mule’ Pollock can turn his hand to myriad custom motorcycle build styles. But there’s one particular type of bike that sits closest to the center of his wheelhouse; the street tracker. Mule has extensive experience building and racing flat track bikes, and he knows just how to repackage them for street use. So if you’re looking for a Harley Sportster street tracker with a nostalgic American flat track racing vibe, specced for spirited road use, he’ll deliver it with his eyes closed. That was pretty much the brief for Mule’s latest project—with a few special considerations added to the mix. “The customer wanted a Mule-style street tracker with a motor that wasn’t too wacky or high-strung,” the Idaho-based one-man band tells us.…",
    "author": "Wesley Reyneke",
    "published": "Tue, 29 Oct 2024 19:16:07 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/10/sportster-street-tracker-mule-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "Harley-Davidson",
      "Harley-Davidson Sportster",
      "Mule Motorcycles",
      "Street Tracker"
    ]
  },
  {
    "id": "22e6d922-c7f6-46da-9893-a69b41e6f5b6",
    "title": "Beach Brick: The Wagon You Can’t Help but be Seen In",
    "link": "https://www.bikeexif.com/land-rover-series-2a",
    "description": "This 1971 Land Rover Series IIA is a hot-for-yore millennial’s wet dream, nestled between an imagined, carefree, ‘things were just better’ past and a fantastic present where a 20-something can afford one of these fashionable Brit-boxes. It’s a revisionist history and rose-tinted present we can play along with. This go-everywhere auto comes to us by way of the folks at Cool \u0026 Vintage of Lisbon, Portugal. It’s a simple name, and a simple idea: essentially, a used car garage — but cooler and vintagier. Their model isn’t just to buy, build, and trade on the classic car market; they’ve committed to documenting and creating a lifestyle around their endeavor by taking the autos, using them, and highlighting their potential producing beautiful video and photographic content in the process.…",
    "author": "Iron and Air",
    "published": "Mon, 28 Oct 2024 17:00:13 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/10/land-rover-series-2a-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Featured Lifestyle",
      "Iron \u0026 Air"
    ]
  },
  {
    "id": "69541614-a630-4d6e-ac15-f46648632d91",
    "title": "2025 Audi SQ7 brings serious performance upgrades — but is it enough to surpass the updated Q7 and its predecessor?",
    "link": "https://www.autoblog.com/news/2025-audi-sq7-update",
    "description": "The 2025 Audi SQ7 adds subtle refinements, including LED upgrades and red seat belts, yet it’s the 500-hp twin-turbo V8 that truly defines this family friendly SUV.",
    "author": "Gabriel Ionica",
    "published": "Thu, 31 Oct 2024 00:49:37 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEwMzU5MzE1NDQwMTQ5NzA4/2025-audi-sq7-exterior.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "News",
      "audi sq7",
      "audi",
      "Audi"
    ]
  },
  {
    "id": "ef33b721-c391-4b32-bc1d-3886fd3a03f3",
    "title": "Exclusive photos of the 2025 Audi SQ7",
    "link": "https://www.autoblog.com/news/exclusive-photos-of-the-2025-audi-sq7",
    "description": "Kyle Edward, Autoblog’s senior editor, captures the 2025 Audi SQ7 through his lens.",
    "author": "Kyle Edward",
    "published": "Thu, 31 Oct 2024 00:35:18 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEwMzU5MzE1NDQwMDg0NTU4/2025-audi-sq7.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "audi",
      "News",
      "audi sq7"
    ]
  },
  {
    "id": "197f3941-5240-4d23-a36d-abf5a0587e9c",
    "title": "NYPD Faces Backlash Over Car Chases After Fatal Cyclist Crash",
    "link": "https://www.carscoops.com/2024/10/nypd-faces-backlash-over-car-chases-after-fatal-accident-involving-cyclist/",
    "description": "A cyclist recently died as the result of a police chase and community members want safer streets",
    "author": "Stephen Rivers",
    "published": "Thu, 31 Oct 2024 01:02:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/10/N72HOEDXkbs-HD-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "NYPD",
      "Offbeat News",
      "Police",
      "Reports",
      "Safety",
      "USA",
      "Video"
    ]
  },
  {
    "id": "f25aa0d6-cdb1-45c8-a81e-656b82bdb094",
    "title": "Custuning Has Created Three Wild Bodykits For The Tesla Model 3, Y And S",
    "link": "https://www.carscoops.com/2024/10/custuning-has-created-three-wild-bodykits-for-the-tesla-model-3-model-y-and-model-s/",
    "description": "All three bodykits from the Taiwanese firm are named after Greek gods",
    "author": "Brad Anderson",
    "published": "Thu, 31 Oct 2024 00:23:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/10/Tesla-Custuning-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Electric Vehicles",
      "SEMA Show",
      "Tesla",
      "Tesla Model 3",
      "Tesla Model S",
      "Tesla Model Y",
      "Tuning"
    ]
  },
  {
    "id": "5344959d-187f-43fd-8394-d456471ff895",
    "title": "Hero Xpulse 200 4V Pro review: Mountain goat",
    "link": "https://www.autocarindia.com/bike-reviews/hero-xpulse-200-4v-pro-review-mountain-goat-433138#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Hero’s Xpulse 200 4V has been updated, and it’s offered in two variants: Standard and Pro. As the name suggests, the Pro is essentially the erstwhile Rally Edition, and it’s the more extreme version of an already capable off-road motorcycle. It is also available with a set of optional Maxxisknobbies that you see on our test bike. Hero has given the Xpulse 200 4V Pro some new features this year, and I took this motorcycle out in its natural habitat to find out what it’s like. You now also get three switchable ABS modes. Hero has made some noticeable changes to the 2024 Xpulse range, which includes new reinforced knuckle guards, new switchgear, revised footpeg position, a new projector LED headlamp, a USB charging socket and ABS modes. The all-new headlamp is significantly brighter and incorporates an all-new Daytime Running Lamp design, making the Xpulse appear slightly more upmarket. New switchgear feels better to use. Unique to the Xpulse Pro is a new rally-styled windshield that is 60mm taller than before. The rally visor deflects wind well on the road. All in all, the new changes are a welcome addition and will improve the overall usability of this motorcycle. As before, the Pro variant towers over everything else on the road and stands tall while looking purposeful. Its size is deceptive, and many onlookers assume it is a motorcycle with a much larger capacity. An efficient motor that could use some more power. The Xpulse continues to be powered by a 199cc, oil-cooled motor that produces 19hp at 8,500rpm and 17.35Nm at 6,500rpm. What has improved is that with its OBD2 update, the engine now needs to be serviced every 6,000km instead of the 3,000km. Due to its easy power delivery, this motor continues to perform adequately, and is a boon to use for inexperienced off-road riders. At 161kg, the Pro variant is only 2kg heavier than its standard counterpart, which isn’t too bad given all the added hardware. Allows upto 25 clicks of rebound damping adjustment While the knobby tyres provided excellent grip, the engine lacked the power to overcome it. So sliding this motorcycle was not as easy as it is on ADVs that sit in a higher segment. What helps its case is that you will never find yourself running out of grip, and the Xpulse Pro keeps its cool even when climbing up sections with loose surfaces. While I still wish for more power, I have also come to enjoy its underpowered and calm nature on such tricky trails. Maxxistyres cost Rs 16,000 extra. The Xpulse Pro is a challenge to ride on the tarmac if you choose the Maxxistyres – they are road legal, but are also zero-compromise knobbies built for off-road. Grip itself is fine, but the tyres feel scary when the bike is leaned over and they also make a loud, constant droning noise. The tyres also get unsettled over road irregularities and expansion joints can change the bike’s course at any given moment. On the normal Ceats, the bike would be much nicer, but you’ll still need to live with the very tall seat height – we’ll get back to that. Fork compression damping can be easily adjusted. However, when they hit the dirt, these tyres come into their elements and provide an incredible amount of grip. Compression and rebound damping can be dialled in on the adjustable fork, and the owner’s manual has multiple setting recommendations for various riding situations and these settings are a good starting point from where you can tweak the set-up to your liking. My biggest challenge was the 891mm seat height, which can take getting used to and initially be a little daunting. Mind you, this is with the stock seat and going for the optional rally style bench seat will take that number above 920mm. The Xpulse 200 4V Pro compels you to find your nearest trail. The added height makes the motorcycle feel sluggish and more top-heavy, and this is where the humble engine’s limits become more apparent. However, in time, I’ve gradually gotten more comfortable with its size, and wrestling it off-road has become easier as you go. What has helped is the new footpeg positioning along with the handlebar risers that allow riders to get a better grip and find a more suitable position while standing. Tall ride height towers you over everything else on the road. Hero’s Xpulse 200 4V is a competent machine, and the Pro variant makes it even more unstoppable. That being said, it takes a certain skill level to get the most out of this bike. The suspension is best suited for high-speed off-roading. Shorter, or lesser skilled riders might be better off with the standard Xpulse for slower-speed trails. Either way, the updated features do a great job of uplifting the overall experience. The Xpulse 200 4V Pro is in its element out in the mud. It is worth noting that all of the above-mentioned additions have come at a mild price bump of Rs 3,000, which sounds like a sweet deal. All in all, the Xpulse 200 4V Pro is an excellent alternative to the standard variant and costs Rs 8,000 more, which, given its credentials, sounds too good to be true. The Pro variant is an easy recommendation for anyone skilled enough to dive deeper into the off-road genre of motorcycling. Also see: 2024 Yezdi Adventure review: Incremental changes",
    "author": "Gavin Rodrigues",
    "published": "Mon, 28 Oct 2024 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241008054104_2.png",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "2f62f7b0-1fc2-4c99-a19e-ad292526194b",
    "title": "Viaterra Holeshot Pro gloves review",
    "link": "https://www.autocarindia.com/bike-reviews/viaterra-holeshot-pro-gloves-review-433298#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Viaterra’s Holeshot Pro is a sporty glove that offers a hybrid between race looks, good protection and street-friendly comfort. From a distance, these look a lot like a sporty, track-oriented glove, especially if you go for one of the coloured versions, like the blue ones here. But take a closer look and you’ll see that a significant portion uses a mesh construction for better breathability. The top of the thumb and the first three fingers are all mesh, with some soft rubber protectors. The pinky finger gets a leather panel sewn onto the mesh to protect against abrasion, as this is a common impact area in a crash. The top of the glove around the knuckle area is all leather, and there’s another patch of leather above the wrist as well. The entire palm is leather and there’s a high-grip panel below the fingers. All the leather used is perforated for better breathability. Carbon fibre protector for the ulna is nice at this price point. Protection levels aren’t as high as those of a full-gauntlet race glove, but they’re good nevertheless. You’ll get Knox scaphoid armour for the palms, as well as some armour for the ulna bone on the outside of your wrist. For street gloves, this is more than sufficient, but you won’t find things like a bridged pinky finger or externally stitched seams here, although Viaterra offers those in its top Grid 3 full-gauntlet glove. The Holeshot Pro gloves have touchscreen-sensitive leather patches on the thumb and index finger. The tops of the fingers also get reflective elements to improve nighttime visibility. The wrist closure is secured by a single velcro strap, and they’re easy to get on and off. The overall fit is on the snug side, especially in the knuckle region. The gloves break in over time, but the fit is sporty; if you want something more relaxed, you’ll want to look elsewhere. I like the balance of sportiness and usability the Holsehot Pro packs in for life in the city, and the price is worth what you’re getting. Where: viaterragear.com Price: Rs 4,299 Also See: Viaterra Holeshot gloves review Viaterra Munro custom fit pants review",
    "author": "Rishaad Mody",
    "published": "Sun, 27 Oct 2024 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241022040501_H1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "a4452fd0-1777-4e2c-8603-c84f481d5a99",
    "title": "Hyundai Ioniq 9 Teased As A Super Aerodynamic Three-Row Electric SUV",
    "link": "https://jalopnik.com/hyundai-ioniq-9-teased-as-a-super-aerodynamic-three-row-1851685460",
    "description": "Hyundai revealed the Seven concept back in 2021, a large three-row electric SUV that it promised would be revealed in production form in 2024. Well, now we’re almost done with 2024, and that day is almost here. Hyundai released the first teaser for its new Ioniq 9 that will be debuting next month (it was gonna be…Read more...",
    "author": "Daniel Golson",
    "published": "Wed, 30 Oct 2024 19:50:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/ef46b5a95897390939a719a9688d09c4.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "ioniq",
      "kia ev9",
      "sedans",
      "hyundai motor group",
      "hyundai ioniq 6",
      "hyundai electric global modular platform",
      "hyundai ioniq 5",
      "hyundai motor",
      "hyundai motor company",
      "la auto show"
    ]
  },
  {
    "id": "81feccd3-d1a6-45e9-8d57-afe309c0f6f8",
    "title": "Average New Car Is Now $20,000 More Expensive Than The Average Used Car",
    "link": "https://jalopnik.com/average-new-car-is-now-20-000-more-expensive-than-the-1851685585",
    "description": "It’s no secret that the pandemic threw a wrench into a whole lot of people’s car-buying plans. Things have largely recovered, and prices aren’t as crazy as they used to be, but if car buyers haven’t been keeping a close eye on the market, they could definitely still be in for a shock the next time they walk into a…Read more...",
    "author": "Collin Woodard",
    "published": "Wed, 30 Oct 2024 19:05:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/aefa89bbc0e0d6ece8513d8ab39bd372.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "used car",
      "edmunds",
      "ivan drury",
      "business finance",
      "car ownership"
    ]
  },
  {
    "id": "6e9bf68e-a735-4fcf-909d-006a0d6fef98",
    "title": "Review: New “3D Cars – Inside Out” Blender Course",
    "link": "https://www.carbodydesign.com/2024/09/review-new-3d-cars-inside-out-blender-course/",
    "description": "The new training course by CGMasters explains advanced SubD (subdivision surfaces) modeling techniques for creating car 3D models in Blender with high quality surfaces.",
    "author": "Marco Traverso",
    "published": "Sun, 22 Sep 2024 07:47:04 +0000",
    "image": "http://www.carbodydesign.com/media/2023/07/3D-Cars-Blender-Course-Julietta-H6-Concept-3D-Model-04-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "_Cover Stories (Sticky)",
      "_Featured Articles",
      "_Sponsored Article",
      "3D Tutorials",
      "Blender Tutorials",
      "Car 3D Modeling Tutorials",
      "Car Rendering Tutorials",
      "Cover Stories",
      "3D",
      "Blender"
    ]
  },
  {
    "id": "2f9936bb-4fc9-4587-afcd-e70bd90b3f09",
    "title": "Stellantis launches annual Drive for Design contest",
    "link": "https://www.carbodydesign.com/2024/03/stellantis-launches-annual-drive-for-design-contest/",
    "description": "Stellantis has launched the new edition of its Drive for Design Contest for US high school students. The deadline is April 12, 2024 and the top prize is an internship at Ram Truck design studio.",
    "author": "Car Body Design",
    "published": "Mon, 11 Mar 2024 09:45:27 +0000",
    "image": "http://www.carbodydesign.com/media/2024/03/Stellantis-Drive-for-Design-Contest-Poster-02-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Car Design Competitions",
      "Dodge",
      "Drive for Design Contest",
      "Stellantis"
    ]
  },
  {
    "id": "27dbc0a1-e0bc-4ff0-ac19-3e79c3b4b4b1",
    "title": "2025 Audi RS 3 video review",
    "link": "https://www.autocarindia.com/car-video-reviews/2025-audi-rs-3-video-review-433364#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also see:  Audi RS3 facelift revealed",
    "author": "Jay Patil",
    "published": "Tue, 29 Oct 2024 12:30:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241029120606_Websiteimages .jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "33e33909-abb7-4cb6-8ce2-7df0849e7c06",
    "title": "Mercedes CLE review: Breezy cruiser",
    "link": "https://www.autocarindia.com/car-reviews/mercedes-cle-review-breezy-cruiser-433185#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Mercedes-Benz is on an onslaught in India and wants to leave no segment empty. After EVs, coupe-SUVs, and even sedans, it is now the turn of a convertible. And no, unlike the previous ones (E 53 cabriolet and SL 55), this one does not carry an AMG badge. The CLE 300 is a cabriolet that is far from the usual gung-ho AMG models, and instead, is a convertible for those who want to take it easy. It’s more about style and the feeling of the wind in your hair than about lap times and cornering. Mercedes CLE: design The CLE’s calling card is its top down laid-back character.  In terms of design, there is a faint resemblance to the C-Class, but that’s all it is. Up close, the CLE is very different. The India-spec gets the AMG line treatment as standard, which adds a layer of sportiness to the design. As a result, the only chrome bits on the face are the studded grille and the strip on the front lip. The digital LED headlamps are wider and sharper, the bonnet features two muscular power lines, and the bumpers are sportier with piano black accents. Over to the side, you can tell it’s closer to a C-Class in dimension, thanks to the identical wheelbase. However, it trumps the C in terms of length and width. There is a prominent strip of chrome on the window line, the A-pillars, and the door handles. What also look the part are the sleek 19-inch wheels. A lot of the design will come down to your choice of colour combination. The soft-top can be had in a subtle black shade, but if you want a bit more pop, you can choose a shade of red as well for the roof. At the rear, the LED tail-lamps get a connecting element, and sporty bumpers incorporate the trapezoidal chrome exhaust tips that, like on all modern Mercs, aren’t actually connected to the exhaust system. With the top down, you need to get used to the attention. With the top down, it’s hard to miss the CLE. The long bonnet, raked windshield, sharp wheels and a stunning stance make it a looker. But even with the top up, it’s not like you’ll pass it over as just another Merc. The lines and form factor are properly unique and with the right colour combination, it will stand out. Mercedes CLE: interior Neck warmer acts as a scarf in chilly conditions. The interior of the CLE 300 is quite close to the C-Class when it comes to the dashboard design and layout. The AC vents, 12.3-inch instrument cluster and the 11.9-inch touchscreen are a straight lift, but on the CLE, the touchscreen gets a tilt function to reduce glare, especially when the top is down. Also, like with the soft top on the outside, you can opt for a bold upholstery choice for the interior to add a bit more drama. Wind deflector ensures your hairstyle is unfazed after a drive. There are more exclusive bits in the form of a wind deflector that pops out over the top of the windshield and ensures the airflow isn’t ruining your hairdo. There are vents in the front headrests that channel warm air onto the front passengers’ necks, acting as a virtual scarf in chilly weather. While that may be appreciated up north, the rest of the country is likely to keep it switched off. In terms of comfort, the seats are excellent with the right amount of cushioning and support – long distance drives will be effortless. They also get seat kinetics, along with heating and ventilation, which adds to the overall comfort. The CLE is a 2+2, but space in the back is best suited for children or short drives for adults under six feet. The backrest is upright, underthigh support is near absent and knee room is tight as well. Getting in and out, though, is extremely easy with the top folded away. Spare wheel eats into the already low boot space. What may also pose a challenge for long trips is the lack of boot space. With the soft top down, there isn’t much room; there’s space only for soft bags. Add a spare wheel, which in our conditions is handy, and you’re left with very little space.  Mercedes CLE: performance Relaxed is the one-word description for how the CLE drives. It is laid back, restrained, and perfect for a quiet cruise. With the top up, cabin insulation is excellent and does a great job of muting a lot of ambient chaos of the city. The soft top has multiple layers of sound deadening, which helps keep out the excessive road and wind noise. It can be opened in just 20 seconds at speeds of up to 60kph. The 258hp, 2.0-litre turbo-petrol is creamy smooth and has dollops of torque that come in gradually. The 258hp, 2.0-litre turbo-petrol is creamy smooth and has dollops of torque that come in gradually. Instead of lunging ahead each time you flex your right foot, the CLE glides and picks up pace gradually. Though it gets more eager when you change the mode from Comfort to Sport, it still remains close to its character as a Mercedes-Benz rather than an AMG. What adds some zest to the performance is a 48V mild-hybrid system, which provides a bit over 20hp under hard acceleration. Still, nothing about it makes you want to corner hard or drive enthusiastically, and it urges you to cruise and enjoy the top-down experience. At high revs, there is a faint rasp of the exhaust, but nothing more. 0-100kph takes 6.7 seconds and the 9-speed automatic works very well via the paddleshifters. Mercedes CLE: ride, handling Maneuvering the CLE is easy, and despite the heft gained in Sport mode, it remains light on its feet.  Being a long-distance cruiser, the suspension on the CLE is tuned for bad roads. It is soft and supple, and hence, despite the 19-inch wheels, ride comfort is very good. There is no adaptive suspension, so changing the modes won’t change the ride, but the stock setup works very well for our road conditions. One miss would be a nose-lift function as ground clearance is something to worry about, especially with a full load. Handling is effortless with a light steering. Maneuvering the CLE is easy, and despite the heft gained in Sport mode, it remains light on its feet. The 4MATIC all-wheel drive system offers good grip and control in bends, should you end up driving it enthusiastically.   Mercedes CLE: price, verdict At Rs 1.1 crore (ex-showroom, India), the CLE 300 is pricey. However, it has no direct rival as of now. The BMW Z4, at Rs 90.90 lakh, is cheaper and gets more power, but it’s a totally different experience thanks to its sportier character. While the Rs 1.3 crore Mercedes-AMG E 53 cabriolet is a full Rs 20 lakh more – and very good – it isn’t as relaxing as the CLE 300. The CLE 300 is comfy and luxurious enough to use as a daily driver, but can change its character quickly. What the CLE 300 offers is a car that is comfy and luxurious enough to use as a daily driver, but can change its character in 20 seconds and offer a completely different experience. It sits in a sweet spot with no direct competition, and if a smooth, relaxing convertible is what you want, this will be a nice choice. Also see: New Mercedes E-Class review: Has the best gotten better?",
    "author": "Jay Patil",
    "published": "Tue, 29 Oct 2024 09:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241014014637_5 _1_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "7433722d-844a-479d-a4d5-49a111f4dc52",
    "title": "Column: A deep dive into how AI is changing the auto industry",
    "link": "https://www.autonews.com/commentary/how-ai-impacting-auto-industry",
    "description": "We've all learned a lot about generative artificial intelligence, its predecessors and machine learning in the last year and a half. It continues to pervade the automotive industry.",
    "author": "Jamie Butters",
    "published": "Sun, 20 Oct 2024 13:00:01 EDT",
    "image": "",
    "source": "http://feeds.feedburner.com/autonews/AutomakerNews",
    "categories": null
  },
  {
    "id": "bc74f115-25cb-4d27-8475-3a0516d3496e",
    "title": "BMW recalls almost 700,000 cars in China on fire safety risk",
    "link": "https://www.autonews.com/china/bmw-recalls-almost-700000-cars-china-fire-risk",
    "description": "BMW AG is recalling nearly 700,000 vehicles in China due to coolant pump defects.",
    "author": "",
    "published": "Fri, 18 Oct 2024 13:04:28 EDT",
    "image": "",
    "source": "http://feeds.feedburner.com/autonews/AutomakerNews",
    "categories": null
  },
  {
    "id": "0ab9b78f-191e-4d8d-8088-e4b38b68016b",
    "title": "Ford Bronco sales slide unconcerning to dealers after 2 years of markups",
    "link": "https://www.autonews.com/sales/ford-bronco-sales-down-16-year-dealers-arent-worried",
    "description": "U.S. sales of the Bronco SUV are down 16 percent this year, but dealers and analysts say it's a function of supply and demand finally normalizing. Accessories and other add-ons remain lucrative.",
    "author": "Michael Martinez",
    "published": "Wed, 23 Oct 2024 13:56:54 EDT",
    "image": "",
    "source": "http://feeds.feedburner.com/autonews/EditorsPicks",
    "categories": null
  },
  {
    "id": "85b07e7a-7225-491f-a0b7-f01b3257b0a5",
    "title": "BMW U.S. boss bets on another record sales year despite Q3 slump",
    "link": "https://www.autonews.com/sales/bmw-us-boss-expects-record-sales-2024-despite-rough-q3",
    "description": "A recall-related stop-sale in the third quarter flipped BMW brand's 3.1 percent first-half sales increase into a 0.2 percent decline after nine months.",
    "author": "Urvaksh Karkaria",
    "published": "Wed, 23 Oct 2024 10:49:35 EDT",
    "image": "",
    "source": "http://feeds.feedburner.com/autonews/EditorsPicks",
    "categories": null
  },
  {
    "id": "e51e55e6-4803-41e5-9e56-6d3bf7c4c430",
    "title": "The Ferrari Testarossa returned to its Paris roots for its 40th anniversary",
    "link": "",
    "description": "Celebrating 40 years at the original Lido nightclub The Ferrari Testarossa had a bit of a family reunion this past week thanks to the team at Real Art on Wheels. On October 2nd, 1984, the Testarossa was unveiled at the Lido nightclub at the Champs Élysées in Paris. To celebrate 40 years of the next best 80s Ferrari icon - the Countach still has my heart. The first and third Testarossas ever produced were brought back to that same location for the first time in two decades. Both cars were reportedly in immaculate condition as they were raised on a pedestal in the middle of the stage. Reminiscent of the way the Testarossa was first unveiled to the public all those years ago. Continue...",
    "author": "",
    "published": "Wed, 23 Oct 2024 16:16:56 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/10/23071807/12-Real-Art-on-Wheels-TR40-scaled-e1729693007454-1.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "7bfde7ad-3f46-4d8e-a37e-72e5d7c3f908",
    "title": "Enzo Mattioli Ferrari invests in Cavallino Inc.",
    "link": "",
    "description": "Continue...",
    "author": "",
    "published": "Wed, 23 Oct 2024 13:41:20 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/10/22092649/Palm-Beach-Cavallino-Classic-3-scaled-e1729614597284.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "686777b3-f99d-433a-a3d8-e1a2b7b0c154",
    "title": "Pedro Acosta: We need to take risks to fight Ducati",
    "link": "https://www.autocarindia.com/motor-sports-news/pedro-acosta-we-need-to-take-risks-to-fight-ducati-433381#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "GasGas rookie Pedro Acosta has emerged as the unexpected star of the 2024 MotoGP season. Given his title-winning form in Moto2 and Moto3, expectations for his rookie MotoGP season were always going to be high. But few expected him to be the fastest KTM RC16 rider this year, often outperforming experienced riders like Brad Binder and Jack Miller. The 20-year-old attributes much of his success to the Red Bull Rookies Cup – the MotoGP feeder series that he won in 2020. Eurosport India recently premiered a six-part documentary series, called Born Racers, chronicling motorcycle racing’s young talents as they try to prove their worth in the Rookies Cup. So, we caught up with Acosta at the Thai GP to learn more about why this series played a pivotal role in his career, his approach to racing in MotoGP, and more. Firstly, congratulations on what has been a stellar rookie season for you. What would you consider your strengths as a rider, and what areas do you feel you still need to work on? I’m quite strong at braking, but I still need to work a little bit more in the corners and be a little more smooth, because this is where I normally suffer at tracks like Assen and Silverstone. But we are working on that. The team and other people around are also helping me to understand how to achieve this. We are getting better. We’re nearing the end of the season. Do you think you’ll get your first MotoGP win this year? We hope! We have tracks that we can say are good for us, like here in Buriram or Malaysia, where we had the winter test. Also Valencia was good for us last season; we saw that Brad (Binder) and Jack (Miller) were quite competitive [over there].   You were chasing your breakthrough win in Japan when you crashed out. Does something like that change the way you approach races in terms of how much risk you’re willing to take? Or is it worth taking the risk to beat the Ducatis? I think [my] approach has to be the same. [Japan] was the moment when were close to winning a race and I think we need to stay in this direction because it’s the one that is working for us. [As for beating the Ducatis], there’s no other way. At the end, we need to take risks to be closer to them and then we can fight. For this, we need to know where the limit is, but always try to be quite close. What are the RC16’s strengths and weaknesses compared to the Ducati GP24? We are quite strong at braking, that’s easy to see. We need to improve qualifying, that’s for sure, because now Practice and Q2 are the two most important sessions in MotoGP. We need to try to be a little bit more in front to fight for victories.  You’ve been quite open about the fact that you wouldn’t be racing if it wasn’t for the Red Bull Rookies Cup. How pivotal was this series in your road to MotoGP? At the end, Rookies Cup was everything for my career. My family didn’t have the money to afford my racing and the Rookies Cup was the most affordable way and offered similar opportunities to everyone to enter the [MotoGP] championship. Also, having Red Bull and KTM behind you, if you have a good championship in the Rookies Cup, it opens many doors having these two partners behind you. Also see: Bagnaia wins Thai GP to slash Martin’s lead",
    "author": "Unnatee Gidithuri",
    "published": "Wed, 30 Oct 2024 16:38:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241030043707_Pedro_Acosta_MotoGP.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "f892c249-b012-4e96-b2a0-6c7dfb0e293e",
    "title": "Tata Nexon with panoramic sunroof priced from Rs 13.60 lakh",
    "link": "https://www.autocarindia.com/car-news/tata-nexon-with-panoramic-sunroof-priced-from-rs-1360-lakh-433380#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Tata Motors has silently introduced a panoramic sunroof-equipped Nexon on more trims, not too long after bringing the feature to the CNG model. The petrol and diesel-powered Tata Nexon now gets a panoramic sunroof on the top-spec Fearless + PS trim, while the Nexon CNG now has it in the higher-spec Creative + PS trim. Nexon with panoramic sunroof is priced from Rs 13.60 lakh to 15.60 lakh Nexon CNG with panoramic sunroof is priced from Rs 12.80 lakh to 14.60 lakh Nexon and XUV 3XO are the only compact SUVs with a sunroof Tata Nexon with panoramic sunroof price, variants Tata Nexon with panoramic sunroof variant-wise prices, ex-showroom, India (in Rs, lakh)Petrol-MTPetrol-DCTDiesel-MTDiesel-AMTFearless + PS13.6014.8015.0015.60 As mentioned above, Tata Motors offers the feature in the top-spec Fearless + PS trim, which is available with petrol-MT, petrol-DCT, diesel-MT, and diesel-AMT powertrain options. The variants equipped with the full-size sunroof also get an 8-speaker JBL sound system, and cost about Rs 1.3 lakh more than the next trim in the Nexon range, the Fearless DT, which misses out on both these bits of equipment. Compared to the only other compact SUV available with a panoramic sunroof, the Mahindra XUV 3XO – which gets this feature in the top-spec AX7 and AX7 L trims (Rs 12.49 lakh-15.49 lakh), the Nexon costs about Rs 11,000-Rs 1.11 lakh more, depending on the variant. It should be noted that a standard sunroof is on offer with the Nexon Pure S trim, which is priced from Rs 10 lakh onwards. Tata Nexon CNG with panoramic sunroof price, variants Tata Nexon CNG with panoramic sunroof variant-wise prices, ex-showroom, India (in Rs, lakh)VariantPriceCreative + PS12.80Creative + PS DT13.00Fearless + PS DT 14.60 The Nexon CNG was brought out just a month ago, and at launch, it came with a panoramic sunroof in just the top-spec Fearless + S trim. Now, the feature is Rs 1.8 lakh more approachable as it is available in the Creative + PS and Creative + PS DT trims. Tata’s compact SUV is the only model right now to offer a CNG power along with a panoramic sunroof. Also see: Tata Nexon CNG review: iCNG on the cake Mahindra XUV 3XO vs Tata Nexon comparison video Tata Nexon secures 5-star rating in BNCAP crash tests",
    "author": "Rivan RS",
    "published": "Wed, 30 Oct 2024 16:25:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241030042518_Tata_Nexon_showroom.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "131bf611-482f-4cfe-b337-cb2f61479c39",
    "title": "It’s The Little Things That Matter",
    "link": "https://www.speedhunters.com/2024/10/little-things-matter/",
    "description": "It’s All In The Details: Experimenting With Macro Car Photography was a breath of fresh air for me. Seeing a colleague approach our world from a different perspective was not only fun to read, but it also featured beautiful photography. Click on the link above and dive into that article – it offers a change of […] The post It’s The Little Things That Matter appeared first on Speedhunters.",
    "author": "Mario Christou",
    "published": "Wed, 30 Oct 2024 16:00:54 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "details",
      "Photography",
      "UK"
    ]
  },
  {
    "id": "745a9f67-909d-4c5c-9551-e1f5ebe44418",
    "title": "Building Beyond Approval: A Simple Yet Extreme RX-7",
    "link": "https://www.speedhunters.com/2024/10/a-simple-yet-extreme-rx7/",
    "description": "Sometimes, you get lucky, stumbling upon a long-horned cow enjoying a dust bath in South Sudan or a family of baby bears frolicking in a forest, completely oblivious to the camera. I try to like as many of those posts as possible to keep the algorithm privy to my tastes in mindless joy. On the […] The post Building Beyond Approval: A Simple Yet Extreme RX-7 appeared first on Speedhunters.",
    "author": "Toby Thyer",
    "published": "Tue, 29 Oct 2024 16:00:24 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Car Features",
      "Content",
      "13b",
      "japan",
      "knight sports",
      "mazda",
      "Rotary",
      "rx-7",
      "rx7",
      "TCP Magic"
    ]
  },
  {
    "id": "a8373367-90cd-4a02-98a5-593e8febdb8f",
    "title": "QOTD: Do You Want a Kia Tasman?",
    "link": "https://www.thetruthaboutcars.com/cars/question-of-the-day/qotd-do-you-want-a-kia-tasman-44510029?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "It certainly looks like the Kia Tasman isn't coming to the North American market. Does this bum you out?",
    "author": "Tim Healey",
    "published": "Wed, 30 Oct 2024 22:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/10/30/085034/s-2025-kia-tasman-every-photo.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Question of the Day"
    ]
  },
  {
    "id": "bd9bb423-6d77-4010-8e3a-e6b474d706a2",
    "title": "Used Car of the Day: 2004 Saab 9-3 Aero Convertible",
    "link": "https://www.thetruthaboutcars.com/cars/used-car-of-the-day/used-car-of-the-day-2004-saab-9-3-aero-convertible-44510026?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Today I bring you a sweet Swede in this 2004 Saab 9-3 Aero convertible.",
    "author": "Tim Healey",
    "published": "Wed, 30 Oct 2024 20:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/10/30/15484/used-car-of-the-day-2004-saab-9-3-aero-convertible.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Used Car of the Day"
    ]
  },
  {
    "id": "de3db349-f805-4782-8518-c6dee44cb54b",
    "title": "Xiaomi SU7 Ultra Prototype Laps the Nürburgring in 6:46.87 Minutes",
    "link": "https://www.caranddriver.com/news/a62766049/xiaomi-su7-ultra-prototype-nurburgring-lap-time/",
    "description": "The Chinese sports sedan's run doesn't qualify as a production-car record, but it's very impressive for a company that just started making cars.",
    "author": "",
    "published": "Wed, 30 Oct 2024 21:35:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "288eb5e0-a672-46fe-aaed-88df2c4d7b20",
    "title": "The Jaguar C-X75 Is Finally a Fully Finished, Street-Legal Supercar",
    "link": "https://www.caranddriver.com/news/a62765643/jaguar-c-x75-callum-road-legal-details/",
    "description": "Ian Callum, the C-X75's original designer, transformed a Spectre stunt car into a luxurious, roadgoing supercar over a decade after the original concept's debut.",
    "author": "",
    "published": "Wed, 30 Oct 2024 20:12:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  }
]
