[
  {
    "id": "43982c52-4ff3-4ff3-a328-05d7ae2bcc2e",
    "title": "1965 Porsche 356 Emory Special Cabriolet",
    "link": "https://bringatrailer.com/listing/1965-porsche-356c-50/",
    "description": "This 1965 Porsche 356C began its life as a coupe and was rebuilt and modified as an Emory Special cabriolet by Emory Motorsports before being delivered to the prior owner in February 2024 and acquired by the seller's father on BaT in June 2024. Power is provided by a 2.6-liter Emory-Rothsport flat-four that combines Porsche 911 internals and bespoke components housed in a custom-cast case and features electronic fuel injection with individual throttle bodies, twin-spark coil-on-plug ignition, and dry-sump lubrication. Finished in Tropical Green Metallic over Vine Green leather, the car’s bodywork incorporates a lowered removable hardtop, increased windshield rake, deleted bumpers, rolled rocker panels, and a louvered decklid. Additional equipment includes a Type 901 five-speed manual transaxle, four-wheel ventilated disc brakes, PEP adjustable shock absorbers, a 911-style rear suspension setup, 16” billet aluminum wheels, a custom 15-gallon aluminum fuel tank, custom reclining seats, a MOMO steering wheel, and electric air conditioning. This Emory Special cabriolet is now offered in Frisco, Texas by the seller on behalf of the current owner with a detachable black convertible top, a tonneau cover, an Emory shift knob, a spare fuel cap, and a clean Montana title in the name of the owner's LLC.",
    "author": "bringatrailer",
    "published": "Sat, 19 Apr 2025 00:00:12 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/04/1965_porsche_356c_005-10889.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "3dc209e5-1d6f-4d6b-9d0d-66d7cbbca31d",
    "title": "60-Mile 2024 Ferrari 812 Competizione",
    "link": "https://bringatrailer.com/listing/2024-ferrari-812-competizione-coupe/",
    "description": "This 2024 Ferrari 812 is one of a planned 999 Competizione coupes produced, and it was ordered by the current owner through Ferrari's Tailor Made program in New York. Now showing 60 miles, the car is finished in Nerotto Lucido with Bianco Sanae stripes that extend over the hood and door tops over a black Alcantara-trimmed cockpit that features large-sized racing seats upholstered in Blu Jeans Aunde fabric. Power comes from a 6.5-liter F140 HB V12 mated to a seven-speed F1 dual-clutch automatic transaxle and Ferrari’s E-Diff limited-slip differential. Equipment includes a front-axle lift system, four-wheel steering, carbon-ceramic brakes, 20″ forged racing wheels finished in matte black, adaptive front lights, airbrushed Scuderia Ferrari fender shields, a body-color engine cover, a backup camera, and carbon-fiber exterior and interior trim. Additional interior appointments include a Hi-Fi sound system, a passenger-side display, and aluminum pedals and footrests. This 812 Competizione is now offered on dealer consignment with a window sticker, a Ferrari Classiche yellow book, factory literature, a battery tender, a car cover, a clean Carfax report, and an Arizona title.",
    "author": "bringatrailer",
    "published": "Fri, 18 Apr 2025 23:50:11 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/03/2024_ferrari_812-competizione-coupe_A07I5896-06556-scaled.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "29568f7b-4ed0-4158-bc47-34415f7073ba",
    "title": "BMW XM",
    "link": "https://www.autocar.co.uk/car-review/bmw/xm",
    "description": "Does only the second-ever bespoke M car leave us excited about the future, or longing for the past? The BMW XM is the division’s first bespoke car since the mid-engined M1 of 1978 and one that M CEO Frank van Meel says offers the best of X and the best of M. Hence the name.This is also M’s very first hybrid, giving a heady 644bhp and 590lb ft. A low-slung 29.5kWh battery grants an electric-only range of 55 miles. It feeds a 148bhp electric motor integrated into the ZF-built eight-speed automatic gearbox. The rest of the output comes from M’s phenomenally strong ‘S68’ twin-turbocharged 4.4-litre V8, with up to 738bhp in the full fat XM Label Red. The XM, then, outshines even the Aston Martin DBX 707 – an SUV so monstrously over-endowed that they put the figure in its name.",
    "author": "",
    "published": "Fri, 18 Apr 2025 08:31:53 +0100",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/bmw-xm-2023-001-tracking-front.jpg?itok=ylyrNAFb",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "bb360832-4f65-4c67-9dd6-2d1f01c4f59e",
    "title": "Driving the rattiest Ferrari on the road",
    "link": "https://www.autocar.co.uk/car-news/features/driving-rattiest-ferrari-road",
    "description": "The 'Ratarossa' was bought from California for just £16,000 Yes, you can buy a flat-12, gaited-manual Ferrari for less than £20,000. Should you? That's a different story... Fortunately, the interior handle and door card on the driver’s side of Scott Chivers’ left-hook Testarossa spider is secure. Pull the handle on the passenger side and it comes off. I am driving Ratarossa, a Ferrari Testarossa well-known by the internet. The car derives its name from the ‘recycled automotive transport’ exemplified by rusty Type 2 VWs and is the ultimate expression of Scott’s philosophy. Its grey body is rough. The engine cover is barely secure, it’s been hit hard with the lowering stick. But the car’s original flat-12 engine and five-speed manual ‘box remain. Scott bought it from a chap in California who was intending to restore it, but just never got round to it. All in - car, shipping, taxes - this Testarossa cost just £16,000. It’s an amazing thing. And quite intimidating to get into. Nevertheless I make it into the driver’s seat, wearing the stringbacks Scott thinks are total Don Johnson.  I’m about to turn the ignition key but, first, let us pray. Down on my right is the famous Ferrari gate. I can’t wait. Reverse is down and forward; first, straight back. Better get those two right. I fire up the flat-12.  There’s a cacophony of mechanical gnashing and a delicious intake howl when you dare to blip the throttle. No wonder Scott’s elderly neighbour complained to the council. The pedal box is for Formula 1 drivers in Sparco slippers. I’m wearing motorcycle boots. I practise telling my B from my A. C, the clutch, weighs a ton. So do the front wheels. I can barely operate the steering. Pulling away is surprisingly smooth. First to second gear and beyond is a deliberate operation, although there is some spring bias to help tee the selector for each slot.  There’s no lag or hesitancy as the engine accepts the next cog. The temperature looks good and the blue smoke on start-up has cleared. Given that its body has been stiffened with the equivalent of a garden gate, the Ratarossa feels surprisingly taut, at least at 40mph.  The brakes are firm but progressive too. The steering has lightened up but it’s not what you’d call quick. You have to wind on the lock nice and early to avoid ploughing straight on. And is that petrol I can smell? “A small leak,” explains my co-pilot. Whatever its niggles, the Ratarossa is wonderful and unique. The looks of fellow drivers alone tell you that.",
    "author": "",
    "published": "Fri, 18 Apr 2025 08:29:58 +0100",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/ratarossa_2018_ll_334.jpg?itok=iHtMq4Tc",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "bd38ab81-a64d-4f07-8f39-69e76bd6cca4",
    "title": "The Surprising Science Behind BMW's 'Emotional' EV Sounds",
    "link": "https://www.autoblog.com/news/the-surprising-science-behind-bmws-emotional-ev-sounds",
    "description": "BMW’s Neue Klasse vehicles are set to be a massive leap forward in interior and exterior design, and a landmark moment in the company’s push toward full electrification. This “new class” of vehicles may also evoke a new emotion from drivers. BMW has enlisted a team of sound engineers to curate how ...",
    "author": "Nate Swanner",
    "published": "Sat, 19 Apr 2025 00:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODkwMjUw/bmw-hypersonx-making.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "bmw",
      "Luxury",
      "Sedan",
      "News"
    ]
  },
  {
    "id": "a719ccc6-334b-4e11-bb11-73d9a30f904f",
    "title": "Volkswagen Freezes Prices Through May to Ease Tariff Concerns",
    "link": "https://www.autoblog.com/news/volkswagen-freezes-prices-through-may-to-ease-tariff-concerns",
    "description": "Volkswagen has confirmed it will not raise prices on its vehicles in the U.S. through the end of May, joining a growing list of automakers looking to reassure shoppers spooked by potential tariffs. The move comes as the industry faces growing uncertainty following the Trump administration’s new 25% ...",
    "author": "Elijah Nicholson-Messmer",
    "published": "Fri, 18 Apr 2025 22:30:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjExNTM4NDQzNjgxOTMyODM1/vehicles-drive-past-a-volkswagen-dealership-in--lower-saxony-hanover.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "News",
      "Volkswagen"
    ]
  },
  {
    "id": "b26583ed-a531-4593-b8cc-eb719b9b2de4",
    "title": "Kawasaki Ninja 1100SX review: smooth all-rounder",
    "link": "https://www.autocarindia.com/bike-reviews/kawasaki-ninja-1100sx-review-smooth-all-rounder-435126#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Ever since it came out back in 2011, the erstwhile Kawasaki Ninja 1000SX has been one of the most well-rounded sport touring packages. Fast forward to 2025, and while this breed is sadly all but extinct, Kawasaki has determinedly stuck to its guns and brought out the new Ninja 1100SX. Kawasaki Ninja 1100SX changes for 2025 Most of the changes have happened under the largely familiar skin Kawasaki has chosen to focus only on updating the internals, and the main change comes in the form of this new 1,099cc four-cylinder motor, which was birthed by stroking out the erstwhile 1,043cc powerplant by an additional 3mm. However, since this engine complies with Euro 5+ norms, peak output figures are slightly different. Save for the new paint and graphics, the Ninja 1100SX is visually identical to the older 1000. With 136 ponies on tap, the 1100 is down 6hp compared to the 1000, although with 113Nm of torque available, it does have 2Nm more. And since this is a sensible sport tourer and not a headbanging supersport, Kawasaki has wisely given this mill taller 5th and 6th gear ratios. However, to ensure acceleration is not humdrum, the final drive gearing is slightly shorter, courtesy of the one-tooth-larger rear sprocket.  The TFT display is crisp and the UI is uncomplicated. Other changes include an improved, butter-smooth bidirectional quickshifter (which works literally from just above idle!), a 10mm-larger rear disc brake (which should come in handy because this bike will likely be ridden with luggage and/or a pillion), and a USB-C charger near the left-hand switch cube.  Charging port's housing could have been executed in a neater, sleeker manner. Kawasaki Ninja 1100SX performance, ride comfort It is both supremely comfortable and blazingly fast As evident from these pictures, the Ninja 1100SX is visually identical to the 1000, save for the stealthy black paint job and green graphics. This is the only colour you can buy it in, as the green paint is currently exclusive to the higher SE variant, which is not sold here. Generously padded seats keep you cosseted. All of the above-mentioned changes aren’t very drastic, and the impact they’ve had on the riding experience isn’t landmark either. But who’s complaining about that? The Ninja 1000SX was a smooth, comfortable, and polished sport tourer to begin with, and this 1100 carries forward all its strong points (save for one, which we’ll address later). It can be both blazingly quick and amazingly mellow when needed. Over the 750-odd kilometres I clocked on the Ninja, never once did I miss the six ponies it has relinquished to Euro5+ (unlike those pesky spec-sheet warriors). There’s no other way to say this – 136hp is a LOT of power. And since the midrange has been bolstered, in the 3,000-7,000rpm zone, you could argue that this is a more effortlessly quick bike than before. On that topic, you’d better have your wits about you before whacking the throttle open because the Ninja will catapult you toward the horizon with surprisingly calm yet undeniable ferocity. All the while, the motor was belting out a smooth inline-four scream, but what I enjoyed more was the intake howl every time I twisted the accelerator. Kawasaki Ninja 1100SX handling Given the right inputs, this 238kg bike can handle very well And even in the city, the Ninja 1100 is perfectly composed, and you can just as easily commute as you can travel from Mumbai to Manali on it. The only trouble within city limits is that the mirrors stick out a little too much, and even for 5’11 me, reaching them in my natural riding position isn’t possible. The 135mm of ground clearance available is on the lower side, but you can make do if you exercise a little caution. Wide-set mirrors demand caution when filtering. But can this Ninja slice through a corner properly? 238kg is a lot, let’s make no bones about it, but once you adapt your riding style to the Ninja’s heft, you’ll be able to go just as fast as your friend who’s on the ZX-10R (on the road, at least) without any of the agony of having to sit like a gargoyle. So, is this the perfect road-going superbike for India? In a word, yes. It’s tantalisingly fast, fabulously comfortable, and superbly capable. Kawasaki Ninja 1100SX price and verdict Its an accomplished machine but its no longer the VFM big-bike it once was The only caveat is that, at Rs 13.49 lakh, the big Ninja is no longer the VFM big-bike proposition it once was. Not long ago, the BS4 ZX6R and the 1000SX were priced almost on par. Today, the price difference between the BS6 ZX6R and the 1100SX is nearly Rs 2 lakh! Generously padded seats keep you cosseted. The fact remains that this is still a wonderfully sweet and capable machine (and the only one of its kind in this class), so if your pocket permits, I’d recommend you make a trip to your nearest Kawasaki showroom. I know I would if I could. Also See: Kawasaki Ninja 1100SX video review",
    "author": "Dinshaw Magol",
    "published": "Fri, 18 Apr 2025 08:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250417033803_Kawasaki Ninja 1100SX corner shot.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "7beddc31-e9cd-42d1-8021-97b40ed90da9",
    "title": "2025 Suzuki Access road test, review",
    "link": "https://www.autocarindia.com/bike-reviews/2025-suzuki-access-road-test-review-435051#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "You are probably already familiar with the Suzuki Access 125 because it is a common sight on our roads. Ever since its launch in India in 2007, the Access has been an extremely popular choice in the 125cc scooter category because it offers a practical, efficient and ultra-reliable scooter experience combined with zippy performance for a decent price. In nearly two decades, this is only the second major update the Access has received. So, what has Suzuki changed? Catering to this end of the Indian scooter market is tricky because traditional consumers identify with the established body style that is prevalent, but, at the same time, the company needs to keep its product fresh against its rivals. Which is why Suzuki has not strayed very far from the previous Access’ design ethos. The underseat storage space has grown by 2.6 litres to 24.4 litres. Park the old and new scooters side by side, and the 2025 model looks just new enough to differentiate itself but not so much that the average consumer will mistake it for anything else. We think the Access manages to cut a pleasing figure with its neo-retro aesthetic, and this shade of sea green only helps things further. It has two front cubbies now, but their opening is rather narrow. While not much is new in terms of features and technology, the 2025 Access has improved upon its predecessor in the storage capacity. The boot measures 24.4 litres (up from 21.8), and this scooter now has two slim cubbies on the front apron. Do bear in mind that these cubbies have a rather slender opening, and you cannot fit a 1-litre water bottle like you could in the previous scooter’s single cubby.   The Suzuki Access is very much a family scooter, but unlike most of its rivals, it never feels dull to ride. And its fun character doesn’t come at the expense of any sacrifice in practicality or handling. True to its family-scooter roots, the Access has a plush suspension setup, which never feels out of sorts unless you turn up the wick to the point where seldom any staid rider will venture. Neutral ergos, a spacious seat and balanced suspension keep you comfy. For 2025, Suzuki has given the Access a new frame and heavily reworked the engine – we will address the chassis first and the motor a little later. To be perfectly frank, ride this 2025 model and a previous-gen scooter back to back, and you will be hard-pressed to tell the difference – we actually did just that, so you can take our word for it. That’s really no bad thing because the 106kg Access feels light in traffic (despite its weight having gone up by 2 kilos) and is manageable for riders of all sizes, both attributes expected of a family scooter. Seat has grown slightly longer, and cushioning is on the firmer side. However, for all that has changed, we would have liked to see a 12-inch rear wheel on the Access with this update. Because it still rides on an archaic 10-inch unit (just like it did way back in 2007), at higher speeds and while going through turns, the Access doesn’t feel as stable as its Indian rivals that use 12-inch wheels at both ends (think TVS Jupiter 125 and Hero Destini 125).   That small gripe aside, we are happy to report that the Access retains its zippy, playful demeanour. And a big part of that is down to the tried and tested 124cc engine. This mill is energetic right from the get-go. Even if you’re holding a steady 70kph on the highway, if you open the throttle, there’s still enough left in reserve to manage a reasonably quick and effortless overtaking. Heavily revised engine retains its pep and turbine-smooth character. By and large, Japanese engines are known to have two major USPs: refinement and reliability. As for the former, the most vibration is actually felt only when you are at a standstill, as is typical for scooters. It disappears as soon as you get moving. In fact, it is so smooth that even at an indicated 90kph, there is absolutely no buzz either in the floorboard or the handlebar. Disc brake is reserved for the top two variants and has sufficient bite. In our tests, the new Access was quicker than the BS6 version in roll-on acceleration as well as the sprint to 80kph, which is impressive considering it is a little heavier now and has to comply with stricter emissions norms. Moreover, along with its energetic performance, the Access continues to have great fuel efficiency. In fact, these numbers could have been even better if the Access had start/stop tech like the Burgman, but you can’t opt for that feature here.   The 2025 Access has stuck to the same formula as its predecessor but with minor refinements all across. While it doesn’t have any one standout feature, it blends frugality, practicality and comfort with a dash of zippiness wonderfully. Another important factor to consider is that Suzukis are generally light on the pocket to purchase as well as run, which now brings us to the price. Round chrome mirrors look nice, but the field of view isn’t the best. With prices ranging from Rs 81,700 to Rs 93,300, the new Access is Rs 1,000-1,500 more expensive than the outgoing model. It is also nearly on par with competitors in pricing. The aforementioned factors are why the Access has achieved such widespread success. Even today, if you’re in the market for a new 125cc scooter, the Access remains a really compelling option. Also See: 2025 Suzuki Access video review",
    "author": "Dinshaw Magol",
    "published": "Mon, 14 Apr 2025 07:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250410024414_1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "01cd1f2e-a803-4771-a60e-46ff7608b922",
    "title": "2025 Volvo XC90 review - A different flavour of luxury SUV",
    "link": "https://www.autocarindia.com/car-reviews/2025-volvo-xc90-review-a-different-flavour-of-luxury-suv-435117#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "If there’s a model that symbolises ‘age is just a number’, it’s the Volvo XC90. Now in its tenth year, the broad-shouldered Swede has managed to disguise its vintage rather well. Subtle tweaks over the years have helped, but this 2025 update is a clear ‘facelift’ in the truer sense. 2025 Volvo XC90 facelift exterior design and engineering   Revised grille and headlights help refresh styling Most of the design updates can be seen on the leading end of the XC90 facelift. Styling sees a refresh with most of the changes concentrated up front. The focal point is the flatter and wider grille with Volvo’s iron mark logo now flanked by slanted streaks. Slim new headlights (still home to the Thor’s hammer LED light signature) flow out of the grille, and there’s a tidied-up bumper section with fewer but more pronounced lines. In profile, though, the new look 20-inch wheels are your only giveaway of this being the 2025 model. Tail-end styling, too, has just been breathed upon with redone tail-lights. Still, you’ll like what you see. The XC90 is clean-cut and traditionally upright in its stance, and many will like it for just that. 2025 Volvo XC90 facelift interior space and comfort Cabin is plush and feels airy. Third row useable too but access is poor Middle seat set a touch low. Space is great. Middle-seat passengers will like the space on offer but could find the seat slightly low-set. The XC90 retains a third row of seats as a USP. Unfortunately, access to them remains awkward via a small passage between the door aperture and the middle-row seat. What’s nice is that there’s usable space aft of the third row for soft bags, and should you need more room, rows two and three can be folded flat to form a huge load bed. 2025 Volvo XC90 facelift features and safety   Larger 11.2-inch touchscreen is big feature update The 11.2-inch touchscreen takes centre stage on redone dash. More has changed on the inside. The dashboard has been redone with more horizontal surfaces and larger AC vents, but it’s the larger 11.2-inch touchscreen that your eyes will lock on to. The new screen is vertically oriented like the older 9-inch unit was, but its larger size makes it almost look like an iPad tacked on to the dash. Infotainment system powered by brand-new software The unit runs a new-gen Android system and features large tiles to give quick access to oft-used functions. It does require a shorter learning curve than say, a BMW system, but more physical shortcuts for the climate control system would be welcome. Also, the need to plug in a phone to use Apple CarPlay is not very 2025. XC90 facelift comes with loaded feature list The XC90 does pack in much else too. There’s generous use of Nappa leather, digital dials (it’s limited to just two layouts), heads-up display, four-zone climate control, an onboard air purifier, a crisp 360-degree camera, panoramic sunroof, and a sensational 19-speaker Bowers and Wilkins audio system. The shapely front seats offer great support and the experience is upped with ventilation and massage functions that are standard for India. The safety suite includes a laundry list of features, including radar and camera-based advanced driver assistance systems (ADAS). 2025 Volvo XC90 facelift performance and refinement 2-litre turbo-petrol engine delivers 250hp and 360Nm It’s brisk, but you can tell the 2.0-litre engine is working hard. As before, India gets the XC90 with the ‘B5’ powertrain. That’s Volvo-speak for a 2.0-litre, four-cylinder, turbocharged petrol unit with support from a 48V mild-hybrid system. Peak power is 250hp and max torque is 360Nm. The engine delivers sufficient go for average city driving and highway duties, and the 7.94 second 0-100kph time isn’t shabby either. Thing is, the Volvo simply doesn’t offer the reserve of power that rivals’ (think BMW X5, Mercedes-Benz GLE, and Audi Q7) 3.0-litre six-cylinder petrol units do. You can sense the Volvo’s engine working harder, and you hear more of it as well. The eight-speed auto gearbox is also not the smoothest around. 2025 Volvo XC90 facelift ride comfort and handling Suspension feels firm for our roads. There’s more road noise than warranted too.  The Volvo also trails rivals in how effectively it cocoons you from the outside world. There’s more road noise, and there’s a firmness to the air suspension that comes through on anything less than perfectly paved surfaces. Suspension and steering modes help fine-tune the experience but don’t manage to transform the XC90 into the sportiest or comfiest of the large SUVs. 2025 Volvo XC90 facelift price and verdict Pricing at par with larger-hearted rivals hurts XC90’s case The XC90 facelift carries a Rs 1.03 crore asking price. Priced at Rs 1.03 crore (ex-showroom), the XC90 is pricier than some rivals. Buyers who associate a big SUV with big power will not find the right match in the XC90, whose engine remains a chink in its armour. However, buyers not hung up on power might see the Volvo in a different light. After all, the XC90’s strong design, inviting interior and long list of features, do tick many of the other boxes of interest. Also see: Volvo EX60 seen for the first time before 2026 debut Volvo XC60 facelift revealed",
    "author": "Nikhil Bhatia",
    "published": "Fri, 18 Apr 2025 14:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250416054752_Volvo_XC90_Front_Quarter_Tracking.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "6dfb5351-e90e-494f-b019-30c56bb747e2",
    "title": "2025 Skoda Kodiaq video review",
    "link": "https://www.autocarindia.com/car-video-reviews/2025-skoda-kodiaq-video-review-435124#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also See: 2025 Skoda Kodiaq review: Big 7 seat Skoda SUV for big money",
    "author": "Nikhil Bhatia",
    "published": "Thu, 17 Apr 2025 11:21:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250417112119_Tiguan R LIne.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "ce8a3b35-f5d8-454b-96e3-8ec57f73a76a",
    "title": "Hamilton sceptical about F1 cooling vest: “Racing needs to be tough”",
    "link": "https://www.autocarindia.com/motor-sports-news/hamilton-sceptical-about-f1-cooling-vest-racing-needs-to-be-tough-435140#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "F1’s new cooling vest made a rather inconspicuous race debut at last weekend’s Bahrain GP, with Mercedes’ George Russell having used it during the race. However, Ferrari driver Lewis Hamilton has expressed scepticism about the device, stating that he would “avoid it”. Cooling vest not mandatory for 2025 season System introduced to avoid repeat of 2023 Qatar GP F1 cooling vest: How does it work? The cooling vest incorporates 50 metres of tubes through which cooled fluid is circulated. The FIA had originally planned to make its use mandatory when ambient temperatures cross 30.5C, in a bid to avoid a repeat of the 2023 Qatar GP where several drivers were affected by the extreme heat. Logan Sargeant had to withdraw from the race after suffering a heatstroke, while Lance Stroll even briefly passed out. However, the vest is still optional in 2025, with several drivers expressing concerns about the device being uncomfortable in the tight confines of the cockpit. Given the added weight that comes with wearing the vest, any drivers who opt to not use it need to carry an extra 5kg of ballast to avoid gaining any advantage. Russell used the cooling vest during Bahrain GP qualifying and race Hamilton appeared to be surprised when told that Russell used the vest during the Bahrain GP enroute to a second-place finish. “Oh really? I’d be surprised if he did, because you have to add five kilos to the car for it and no one else would,” Hamilton responded while speaking to media, including Autocar India, at the Saudi Arabian GP. It is understood that Mercedes was able to compensate for the added weight by adjusting the ballast that it normally uses. However, Hamilton has maintained that he’d much rather focus on preparing better before the race. “I’ve only had maybe two races in my career where it’s been like Malaysia. Our first year at Malaysia, the drinks machine didn’t work. So, I was just dehydrated at the end of the race. And Singapore last year was pretty brutal. But I love that,” the seven-time world champion said. “We’re supposed to be the highest of the highest in terms of athletes and it needs to be tough. If anything, the cars today are easier to drive than when I started in Formula 1 and they’re a lot heavier. I don’t want to use it if I can avoid it. For me, I want to look at how I can prepare better, how I can use the cooling vest before, how I can pre-cool my body, how to make sure I’m hydrated. That’s a part of the whole process.” Hamilton added, “I do understand that it’s tough and we don’t want drivers passing out when we go to Qatar, where I think [we had] one race that was extremely hot for the drivers, which I actually crashed out [of], so I didn’t get to do it. I think that it’s good that they’ve got the technology in there, but for me, it’s not what I want to see in my car.” Also see: F1 2025: Piastri takes commanding Bahrain GP win to join title fight",
    "author": "Unnatee Gidithuri",
    "published": "Fri, 18 Apr 2025 13:12:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250418011224_Hamilton_Saudi_Arabian_GP.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "587af055-f858-405c-9739-8cc4c9792148",
    "title": "TVS Apache RR 310 launched with OBD2B compliance at Rs 2.78 lakh",
    "link": "https://www.autocarindia.com/bike-news/tvs-apache-rr-310-launched-with-obd2b-compliance-at-rs-278-lakh-435139#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "TVS has updated its flagship, the Apache RR 310 sportbike, to meet the latest OBD2B emission norms. In the process, the RR 310 has gained a few features such as launch control, cornering drag torque control, sequential turn indicators and new 8-spoke alloy wheels derived from its sibling, the RTR 310. Prices start at Rs 2.78 lakh (ex-showroom, India) for the latest Apache RR 310.  Apache RR 310 is mechanically identical to before Sepang Blue race replica colour inspired by TVS Asia OMC racebike Prices hiked by Rs 3,000 across the board TVS Apache RR 310 gains new features along with OBD2B compliance Some new electronics, new wheels and colours part of the update The TVS Apache RR 310 continues to be powered by the same 312cc single-cylinder liquid-cooled engine, making the exact same 38hp and 29Nm torque as before. A 6-speed gearbox with a slip/assist clutch is on offer, along with a bidirectional quickshifter. As part of this update, TVS has now plonked the same alloy wheels onto the RR 310 as were first seen on the RTR 310. The company has also added some new electronic rider aids, such as launch control and cornering drag torque control, to the bike as standard now. Aside from these changes, the RR 310 is identical to the previous model. With this update, the TVS Apache RR 310 range has become dearer by Rs 3,000 and starts at Rs 2.78 lakh for the base red bike without the quickshifter. Optioning the slick bidirectional quickshifter is a steep jump to Rs 2.95 lakh, and if you choose the Bomber Grey colour, then you have to pony up Rs 3 lakh. Additionally, the company offers you BTO (built-to-order) packages that you can pick and choose from: the Dynamic pack costs Rs 18,000, and the Dynamic Pro pack is an extra Rs 16,000. TVS has also leveraged its racing background in the Asia One Make Championship series and introduced a neat-looking Sepang Blue shade on the RR 310 for an additional Rs 10,000. So, a fully decked-out Apache RR 310 will cost well above the Rs 3 lakh threshold.  All prices ex-showroom, India Also See: Feature: TVS Apache RR310 ARRC race bike ridden – World class",
    "author": "Dinshaw Magol",
    "published": "Fri, 18 Apr 2025 10:08:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250418100806_TVS Apache RR 310 sepang blue front three quarter static right.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "739ca664-cec1-479e-9e74-6be624ce8d7a",
    "title": "This Might Be The Worst Chevy SSR In Existence",
    "link": "https://www.jalopnik.com/1837724/worst-chevy-ssr-for-sale-auction/",
    "description": "I cannot for the life of me tell you what the previous owner(s) did to this poor purple 2004 Chevy SSR, but it wasn't good.",
    "author": "Andy Kalmowitz",
    "published": "Fri, 18 Apr 2025 21:25:00 +0000",
    "image": "https://www.jalopnik.com/img/gallery/this-might-be-the-worst-chevy-ssr-in-existence/l-intro-1744993833.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "Found For Sale"
    ]
  },
  {
    "id": "5a713fc5-1ec7-424a-8ea1-271c2fb46d7f",
    "title": "The New York Auto Show's Tuner Dungeon Has Better Supras, Zs, And 911s Than The Automakers Upstairs",
    "link": "https://www.jalopnik.com/1837505/new-york-auto-show-tuner-dungeon-supras-z-911s/",
    "description": "The best cars at the New York Auto Show are the furthest from stock - all those modified and personalized machines locked away in the Tuner Dungeon downstairs.",
    "author": "Amber DaSilva",
    "published": "Fri, 18 Apr 2025 20:25:00 +0000",
    "image": "https://www.jalopnik.com/img/gallery/the-new-york-auto-shows-tuner-dungeon-has-better-supras-zs-and-911s-than-the-automakers-upstairs/l-intro-1744979660.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "New York Auto Show"
    ]
  },
  {
    "id": "c1744990-9206-40c7-8571-1217a299080d",
    "title": "BMW Evaluates IMSA GTP Future as RLL Contract Nears 2026 Expiry",
    "link": "https://www.bmwblog.com/2025/04/18/bmw-evaluating-gtp-team-switch-imsa-2026/",
    "description": "BMW is currently evaluating a potential change in its IMSA GTP service provider for the 2026 season, with long-time partner Rahal Letterman Lanigan Racing (RLL) at the center of the discussion. Its top-tier LMDh program... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Fri, 18 Apr 2025 16:44:33 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/04/bmw-m-hybrid-v8-imsa-long-beach-01-830x554.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "Racing",
      "BMW M Hybrid V8",
      "BMW RLL",
      "Rahal Letterman Racing",
      "RLL"
    ]
  },
  {
    "id": "8b4f9790-d4b3-445a-ac81-1068f1812461",
    "title": "1-Of-50 BMW 3.0 CSL Shows Up For Sale, Costs Seven Figures",
    "link": "https://www.bmwblog.com/2025/04/18/bmw-csl-for-sale-seven-figures/",
    "description": "At €250,000, the M3 GTR Strassenversion holds the official title of the most expensive new car ever sold by BMW in Germany. However, we firmly believe the road-legal version of the V8-powered M3 E46 race... First published by https://www.bmwblog.com",
    "author": "Adrian Padeanu",
    "published": "Fri, 18 Apr 2025 11:47:54 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2023/05/bmw-3.0-csl-2023-31-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "BMW M4",
      "3.0 CSL"
    ]
  },
  {
    "id": "b6972446-3eea-46db-84cf-2a88affbc843",
    "title": "Bull Ring: A taurine Triumph Bonneville scrambler from Spain",
    "link": "https://www.bikeexif.com/triumph-bonneville-scrambler-tamarit",
    "description": "The Spanish workshop Tamarit Motorcycles has been in business for a decade, focusing almost exclusively on Triumph modern classics. So they know the Triumph Bonneville inside out—and they know how to transform it into just about anything. Tamarit Motorcycles has used this experience to build a stacked catalog of bolt-on Triumph parts and a handful of made-to-order customs. But what they relish most are the opportunities to build one-off specials, like this vivid Triumph Bonneville scrambler. Numbered 142 and nicknamed ‘Bull Ring,’ the 2006-model carbureted Triumph Bonneville was commissioned by a returning client. Tamarit had previously built a Triumph Thruxton café racer for him, but this time, he wanted a street scrambler. Some details—like the mono-shock conversion and under-seat exhaust—were carried over from the previous project, but this is no copycat.…",
    "author": "Wesley Reyneke",
    "published": "Thu, 17 Apr 2025 22:18:10 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/04/triumph-bonneville-scrambler-tamarit.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "Scramblers",
      "Tamarit Motorcycles",
      "Triumph Bonneville",
      "Triumph Scrambler"
    ]
  },
  {
    "id": "63ef614b-27fc-42ff-8555-42767de7251f",
    "title": "Loud and Rowdy: STG Tracker scrambles the Yamaha XV920R",
    "link": "https://www.bikeexif.com/yamaha-xv920r-stg-tracker",
    "description": "Of all the Yamaha XV models released over the years, not one could be accused of being pretty. And yet, custom motorcycle builders have been putting their spin on the maligned Virago (and its variants) for longer than Bike EXIF has been around. One workshop that knows how to turn a sow’s ear into a purse; STG Tracker. Run by Marcelo Obarrio and Germán Karp, the Argentinian outfit is versatile and seldom builds the same thing twice. So they didn’t blink when a client asked them to turn his 1981 Yamaha XV920R into a scrambler. The XV920R was Yamaha’s attempt at turning their awkward cruiser into a standard-type motorcycle with sports touring aspirations. Highlights included a taller stance, rear-mounted foot pegs, and an enclosed chain drive.…",
    "author": "Wesley Reyneke",
    "published": "Wed, 16 Apr 2025 22:06:35 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/04/fb-9.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "Scramblers",
      "STG Tracker",
      "Yamaha motorcycles",
      "Yamaha Virago"
    ]
  },
  {
    "id": "7be867c9-7917-4fc8-9351-e16df264f3c7",
    "title": "Chery New Journeo Concept",
    "link": "https://www.carbodydesign.com/2025/03/chery-new-journeo-concept/",
    "description": "The Chery New Journeo Concept is a futuristic multi-purpose vehicle developed at the Chery Advanced Design Center Europe in Raunheim, Germany and presented at the 2024 Guangzhou Motor Show.",
    "author": "Car Body Design",
    "published": "Tue, 04 Mar 2025 14:25:20 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/Chery-New-Journeo-Fulwin-Jinyun-SMPV-Concept-Design-Sketch-Render-13-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Concept Cars",
      "Cover Stories",
      "Chery",
      "Chery New Journeo Concept"
    ]
  },
  {
    "id": "5da430ba-de73-46a9-a6b8-8bc53b116296",
    "title": "MG announces MGS5 new EV SUV",
    "link": "https://www.carbodydesign.com/2025/03/mg-announces-mgs5-new-ev-suv/",
    "description": "MG Motor UK has confirmed the MGS5 EV, an all-electric SUV debuting this Spring. Built on the modular scalable platform (MSP), it will focus on performance, efficiency, and interior space.",
    "author": "Car Body Design",
    "published": "Mon, 03 Mar 2025 17:26:28 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/MG-MGS5-EV-SUV-Preview-01-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Production Cars",
      "MG"
    ]
  },
  {
    "id": "e7f2c0ea-e220-4dd6-a6b6-f219c53cde62",
    "title": "Which Mainstream Cars Were Actually Cool?",
    "link": "https://www.carscoops.com/2025/04/what-are-the-coolest-mainstream-cars/",
    "description": "Cool affordable cars have largely given way to boring trucks and SUVs",
    "author": "Michael Gauthier",
    "published": "Sat, 19 Apr 2025 00:30:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/04/2314123432141324-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "QOTD"
    ]
  },
  {
    "id": "dd66b579-6af5-49a0-9027-705c898b53e4",
    "title": "Someone Wants To Sell This Suzuki Jimny For Twice What They Paid In 2023",
    "link": "https://www.carscoops.com/2025/04/someone-wants-to-sell-a-suzuki-jimny-turbo-for-twice-what-they-paid-in-2023/",
    "description": "The off-roader has a five-speed manual transmission and a dual-range transfer case",
    "author": "Brad Anderson",
    "published": "Fri, 18 Apr 2025 23:53:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/04/321432132412341-1-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Suzuki",
      "Suzuki Jimny",
      "USA",
      "Used Cars"
    ]
  },
  {
    "id": "7f00dc5d-3256-4f29-b821-821f1c345efc",
    "title": "Subaru Could Revive the STI Badge—But Not on the Car You're Thinking",
    "link": "https://www.caranddriver.com/news/a64524495/subaru-sti-badge-possible-evival-details/",
    "description": "Subaru's European boss says he wants to bring sportiness back to the brand, but to do so, he'll need to embrace electrification.",
    "author": "",
    "published": "Fri, 18 Apr 2025 20:20:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "050eba71-d9dd-4d0a-876a-96518e9b4f2e",
    "title": "New North American Maserati Boss: We Need to Help U.S. Buyers Understand Our Brand",
    "link": "https://www.caranddriver.com/news/a64515916/maserati-north-american-turnaround-strategy-detailed/",
    "description": "He's presiding over a turnaround plan that will include driver experiences, auto shows, and a campaign to make sure everybody realizes how affordable an entry-level Maserati can be.",
    "author": "",
    "published": "Fri, 18 Apr 2025 19:51:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "3776d8d4-31d5-4969-b2ec-1a5f0c239e1c",
    "title": "A How-To Guide To ITBs With Project NSX",
    "link": "https://www.speedhunters.com/2025/04/guide-itbs-project-nsx/",
    "description": "What do we love so much about naturally aspirated engines? Perhaps the musicality, or the responsiveness, or the combination of both that creates an emotionally rewarding experience with every stab at the throttle pedal. Well, whatever underpins that appeal, I can say for sure that nothing turns it up to 11 quite like a set of […] The post A How-To Guide To ITBs With Project NSX appeared first on Speedhunters.",
    "author": "Blake Jones",
    "published": "Tue, 08 Apr 2025 23:31:04 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Australia",
      "honda",
      "individual throttle bodies",
      "ITB",
      "ITBs",
      "NA1",
      "NSX",
      "project car",
      "Project Cars",
      "Project NSX",
      "Speedhunters Project Car"
    ]
  },
  {
    "id": "a53dd527-13a3-4911-a9d9-f8360ecb8bc7",
    "title": "3 Days At The World’s Most Luxurious Race Track",
    "link": "https://www.speedhunters.com/2025/04/3-days-worlds-luxurious-race-track/",
    "description": "That’s what Cornes \u0026 Co did here in Japan, and with that, we’re left with The Magarigawa Club. The Magarigawa Club is not hot off the press news, it’s actually been open for a little over 18 months now, but since it’s doors have opened, I had yet to have the chance to visit and see what […] The post 3 Days At The World’s Most Luxurious Race Track appeared first on Speedhunters.",
    "author": "Alec Pender",
    "published": "Sat, 05 Apr 2025 04:39:05 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Circuit",
      "honda",
      "japan",
      "Manthey",
      "Porsche"
    ]
  },
  {
    "id": "3f19c74f-b789-43bc-802c-2aca7b6f1912",
    "title": "QOTD: Is An Electrified Subaru WRX STI Sacrilege?",
    "link": "https://www.thetruthaboutcars.com/cars/question-of-the-day/qotd-is-an-electrified-subaru-wrx-sti-sacrilege-44513413?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "It appears that the reason the Subaru WRX STI is no longer available has to do with European emissions regulations . So, perhaps to get the STI back, it will need to be electrified?",
    "author": "Tim Healey",
    "published": "Fri, 18 Apr 2025 22:30:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/04/18/17061/qotd-is-an-electrified-subaru-wrx-sti-sacrilege.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Question of the Day"
    ]
  },
  {
    "id": "99e88e2c-5a81-4a00-9e49-2c85aa8beb7d",
    "title": "2025 New York Auto Show Recap: Hanging On By The Hudson",
    "link": "https://www.thetruthaboutcars.com/cars/features/2025-new-york-auto-show-recap-hanging-on-by-the-hudson-44513392?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "The press days of the 2025 New York International Auto Show are in the books.",
    "author": "Tim Healey",
    "published": "Fri, 18 Apr 2025 21:30:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/04/18/16351/2025-new-york-auto-show-recap-hanging-on-by-the-hudson.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Features"
    ]
  }
]
