[
  {
    "id": "5f655088-3ee0-49b6-8700-baef7bb5a2de",
    "title": "2014 Pagani Huayra Tempesta",
    "link": "https://bringatrailer.com/listing/2014-pagani-huayra-tempesta/",
    "description": "This 2014 Pagani Huayra is #78 of 100 coupes built between 2011 and 2018 and is a US-specification example that was delivered new to British Motor Car Distributors in San Francisco, California. It was purchased by the current owner in 2017 and is said to have been returned to Pagani in 2018 for fitment of the Tempesta package, which added a titanium exhaust system, Öhlins coilovers, staggered-diameter wheels, and a revised front splitter, underbody panels, and rear diffuser constructed from carbon fiber. Featuring a carbon-titanium monocoque wrapped in silver-painted carbon-fiber bodywork, the car is powered by a 6.0-liter Mercedes-AMG M158 V12 that features twin turbochargers and dry-sump lubrication. Additional features include an Xtrac transverse seven-speed automated manual transaxle with a single clutch as well as pushrod-operated adjustable suspension, carbon-ceramic brakes with red-painted calipers, active aerodynamics, black leather upholstery, an aluminum gearshift mechanism with exposed linkage, a Sonus faber sound system, and a touchscreen infotainment system. A 10-year service performed by Prestige Imports of North Miami Beach, Florida, was completed in November 2024, and it included the installation of replacement oxygen sensors and a rear bonnet gas spring as well as fluid services. Now showing 5k miles, this Tempesta-spec Huayra is offered on dealer consignment in Jupiter, Florida, with fitted luggage, a Huayra-shaped key, service records, a clean Carfax report, and a clean Montana title.",
    "author": "bringatrailer",
    "published": "Thu, 12 Dec 2024 01:00:07 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/09/2014_pagani_huayra-tempesta_IMG_5557-69264-scaled.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "474188e6-ac56-4400-a260-faaf001aa3c8",
    "title": "Modified 2019 Chevrolet Corvette ZR1 Coupe 3ZR ZTK",
    "link": "https://bringatrailer.com/listing/2019-chevrolet-corvette-zr1-coupe-102/",
    "description": "This 2019 Chevrolet Corvette ZR1 coupe was purchased new in April 2018 and subsequently modified by Vengeance Racing of Cumming, Georgia. It was used in drag and road racing competitions, and an overhaul completed in 2022 included the replacement of the supercharged 6.2-liter LT5 V8, eight-speed automatic gearbox, and electronic limited-slip differential. Modifications include a ported supercharger and cylinder heads, a high-performance camshaft, revised engine tuning, Kooks long-tube headers, and an off-road X-pipe. Finished in Sebring Orange Tintcoat over Jet Black leather with orange stitching, the car also has Carbon Flash 19\" and 20\" 10-spoke wheels, carbon-ceramic brakes, a rear wing, power-adjustable GT bucket a back-up camera, navigation, a head-up display, and a Bose sound system. The seller purchased the car in 2023 and has since added approximately 500 of the 13k miles. This modified C7 ZR1 is now offered with a window sticker, the owner's manual, service records, spare parts, a car cover, and a clean Texas title in the seller's name.",
    "author": "bringatrailer",
    "published": "Thu, 12 Dec 2024 00:57:07 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/11/2019_chevrolet_corvette-zr1-coupe_2019_chevrolet_corvette-zr1-coupe_1b39a2e0-24f3-4d54-881a-960c5c283fd9-xvi791-35081-35082-scaled.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "77bc796f-a2d1-4c17-b6c9-2831b150a5b5",
    "title": "EVs still don't do well in winter. What's the solution?",
    "link": "https://www.autoblog.com/news/evs-still-dont-do-well-in-winter-whats-the-solution",
    "description": "The liquid part of lithium-ion batteries hits EV charging and range hard in the colder months. The good news is that companies are working on fixing that.",
    "author": "Gabriel Ionica",
    "published": "Thu, 12 Dec 2024 00:30:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjExMjY4MDg1NjkxMTk3Mzk5/range-rover-electric-charging-in-the-snow.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "lithium ion batteries",
      "winter",
      "News",
      "solid-state battery",
      "EVs"
    ]
  },
  {
    "id": "da3b2d8b-3e0b-4c31-a7fe-32cf3cf0f478",
    "title": "2026 Cadillac Vistiq | Specs and price",
    "link": "https://www.autoblog.com/news/2026-cadillac-vistiq-specs-and-price",
    "description": "Positioned between the Lyriq and Escalade, the Vistiq is meant to offer the best of both SUVs at a fitting price",
    "author": "Gabriel Ionica",
    "published": "Wed, 11 Dec 2024 22:30:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MDg5MzMyODAyNTYxODky/2025-cadillac-vistiq.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Vistiq",
      "Cadillac Vistiq",
      "News",
      "Cadillac",
      "Cadillac",
      "2026"
    ]
  },
  {
    "id": "d0a600f8-e813-4a88-b51f-9e727692d198",
    "title": "Aston Martin Valhalla gets a 1,079hp hybrid powertrain",
    "link": "https://www.autocarindia.com/car-news/aston-martin-valhalla-gets-1079hp-hybrid-powertrain-433826#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Aston Martin has finally released the entire spec sheet of its plug-in hybrid supercar. As compared to the model revealed in 2021, the Valhalla features updates to the exterior and interior, and it now generates even more power. In fact, the Valhalla’s torque figure surpasses that of the recently unveiled Vanquish V12 and is higher than any Aston Martin model to date. Valhalla is the first mid-engine series production Aston Martin It is more powerful than the Temerario, Artura and 296 GTB Over 600kg of downforce produced at speeds of 240-350kph Aston Martin Valhalla engine details Powering the Valhalla is a twin-turbocharged 4.0-litre flat-plane-crank V8 paired with three electric motors – two on the front axle and a starter-generator in the bespoke 8-speed dual-clutch auto gearbox. The total combined power output is 1,079hp and a whopping 1,110Nm. The Mercedes-sourced V8 makes 828hp (76.7 percent of the total) by itself, while the three electric motors make 251hp (23.3 percent). For context, the Valhalla’s outputs are higher than other plug-in hybrid supercars like the Lamborghini Temerario (920hp and 800Nm), Ferrari 296 GTB (830hp and 740Nm) and McLaren Artura (680hp and 720Nm). In order to save as much weight as possible, the dual-clutch gearbox does not have a reverse gear, and this function is completely electrically run. The claimed 0-100kph figure is 2.5 seconds, while the top speed of the PHEV is an electronically limited 350kph. An electronic limited-slip differential has also been added to the gearbox to let the ICE and EV motors operate seamlessly. In EV mode, it relies solely on the front electric motors, offering an all-electric range of 14km and a top speed of 140kph. During regular driving, the electric power is distributed across both axles to support the V8 mill’s performance. Aston Martin Valhalla exterior The supercar is built predominantly from carbon fibre, and the Gaydon-based manufacturer says it has put great focus on lightweight construction and advanced aerodynamics. In addition to LED matrix headlights with adaptive functionality and high beam assist, the Valhalla features dihedral doors integrated with a signature aerodynamic vane, channelling airflow to reduce engine and transmission temperatures by up to a claimed 50 percent. Taking some inspiration from the brand’s F1 race car, the Valhalla features a roof snorkel for air intake, behind which sits a pair of exhaust pipes. Rolling on 20-inch wheels at the front and 21-inch at the rear (with a new six-spoke design) and wearing Michelin Pilot Sport Cup tyres, the PHEV supercar boasts an aerodynamic rake, with the rear sitting higher than the front for optimised airflow. The adaptable rear wing and a carbon-fibre diffuser with integrated ducts help the Valhalla produce over 600kg of downforce when travelling at speeds of 240-350kph. Aston Martin Valhalla interior Inside, the Valhalla continues to take cues from the F1 car, boasting a low-slung seating position with carbon fibre seats crafted as a single piece. The two-seater’s cockpit, which is bigger than the Valkyrie’s, provides an ‘Amphitheatre’ effect and is said to create a driver-focused environment. As part of its Human Machine Interface (HMI) bundle, a centrally mounted touchscreen allows EV-specific and ADAS controls. It is also compatible with Android Auto and Apple CarPlay. Other features include a full-digital driver information cluster, dual-zone AC and a rear-view camera. Also see: Aston Martin Vantage Roadster, Vanquish India launch in 2025 Adrian Newey to join Aston Martin F1 team   Aston Martin Valhalla image gallery",
    "author": "Uday Singh",
    "published": "Wed, 11 Dec 2024 18:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241211060341_Aston_Martin_Valhalla_front.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "9f58bb85-bf8a-4042-9867-16ba1a2e1e10",
    "title": "New Toyota Camry launched at Rs 48 lakh",
    "link": "https://www.autocarindia.com/car-news/new-toyota-camry-launched-at-rs-48-lakh-433820#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "The ninth-generation Toyota Camry has been launched in India, priced at Rs 48 lakh (ex-showroom). This latest iteration of Toyota’s premium sedan debuted in international markets over a year ago and continues with a frugal petrol-hybrid powertrain, which is among its highlights. Toyota says deliveries of the new Camry will commence immediately.  New Camry is Rs 1.83 lakh pricier than the outgoing model It is equipped with an ADAS suite for the Indian market It also gets a new 230hp fifth-generation hybrid engine New Toyota Camry price and rivals The new Camry is priced Rs 1.83 lakh higher than its predecessor, which carried a price tag of Rs 46.17 lakh. Still, the luxury sedan costs Rs 6 lakh less than its main rival in India, the Rs 54 lakh Skoda Superb. Going by price, the new Camry can also be seen as an alternative to the likes of the Audi A4, Mercedes C-Class and BMW 3 Series Gran Limousine, which are priced from Rs 46.02 lakh, Rs 54.40 lakh and Rs 60.60 lakh, respectively. New Toyota Camry exterior and platform The ninth-generation Toyota Camry is built on the TNGA-K platform. Its face gets Toyota’s “hammerhead” styling, which features a sharp nose, slim LED headlamps and daytime running lights. A narrow grille almost connects the headlights, the ‘T’ logo has moved up compared to its predecessor, and the bumpers sport an almost Lexus-like anvil shape. A bold new character line along the side, redesigned 18-inch alloys and new C-shaped LED tail-lamps round off the design highlights. New Toyota Camry colour options Toyota offers the nionth-gen Camry in the following exterior colours: Precious Metal, Dark Blue, Cement Grey, Emotional Red, Attitude Black and Platinum White Pearl.  New Toyota Camry interior and features Inside, the new Camry has a revamped dashboard design with a 12.3-inch digital instrument cluster next to a 12.3-inch touchscreen for infotainment duties, offering both wireless Apple CarPlay and Android Auto. It also packs a nine-speaker JBL sound system, a 10-inch head-up display and digital key functionality. The rear seats have reclining function, with controls in a rear centre console. For added comfort, Toyota offers ventilated 10-way powered front seats, three-zone auto climate control and a sunroof with a retractable sunshade. Toyota’s Safety Sense 3.0 suite, which is what the brand calls its autonomous driving assistance system (ADAS), comes as standard. The system features pre-collision assist with pedestrian detection, radar-based cruise control, lane-tracing assist and road-sign assist, along with automatic high beam for better night visibility. Other features include nine airbags, parking sensors front and back and a 360-degree camera. New Toyota Camry engine The new Camry is powered by a 2.5-litre petrol engine paired with Toyota’s fifth-generation Hybrid System (THS 5). This updated setup has a total output of 230hp, which is about 12hp more than the outgoing model. Fuel efficiency has also imp[orved compared to the outgoing model and is now an ARAI-rated 25.49kpl. Like other hybrids in the family, the Camry uses an eCVT gearbox. The brand offers a 8-year/1.6 lakh km warranty on the Camry's battery pack. Toyota has been bringing the Camry to India via the CKD route since it launched the seventh generation here in 2013, and the new model will also be assembled at the brand’s Bidadi plant in Karnataka. Also see: Toyota Innova Hycross prices go up by Rs 36,000 Toyota Supra Final Edition revealed, gets 435hp engine Toyota Celica return confirmed by vice president",
    "author": "Uday Singh",
    "published": "Wed, 11 Dec 2024 14:45:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241211024840_Toyota_Camry_launch_1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "ffb46743-0951-4334-8179-253088238eb6",
    "title": "Royal Enfield Goan Classic 350 video review",
    "link": "https://www.autocarindia.com/bike-video-reviews/royal-enfield-goan-classic-350-video-review-433615#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Also see: RE Goan Classic 350 review: More than just a dressed-up Classic",
    "author": "Dinshaw Magol",
    "published": "Sat, 23 Nov 2024 21:08:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241123090840_1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "a0d6a460-ea40-415a-9867-b63fba62511c",
    "title": "RE Goan Classic 350 review: More than just a dressed-up Classic",
    "link": "https://www.autocarindia.com/bike-reviews/re-goan-classic-350-review-more-than-just-a-dressed-up-classic-433630#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Someone wise recently told me: “A watch tells more than time.” Essentially, this means your watch is an extension of yourself, and different watches fit different people's personas. That saying is actually quite fitting for this bike – the gorgeous Royal Enfield Goan Classic 350. It isn't too different from the Classic 350, but it's targeted at a rather different rider – someone who wants to be unique but doesn't want the compromises that come with this style of bike. RE Goan Classic 350: Design, changes to Classic Design is one of the foremost ways the Goan Classic differs from the standard Classic. Starting at the front, you've got these very retro-looking whitewall tyres, which are found only on a microscopic amount of bikes available on sale today. While the tyres have a retro look, a welcome surprise is that the Goan Classic runs cross-spoke laced wheels, which permit tubeless tyres. The tyres are CEAT’s new Zoom Classic rubber, developed specifically for the Goan Classic. While the front wheel is a 19-incher, like the bike it is based on, the rear wheel is a 16-incher in proper bobber fashion. Then, the Goan Classic trades the Classic's handlebar for tall ape-hanger bars that put your arms almost straight and in line with your shoulders. It also has more forward-set pegs from the Meteor 350, and together, these changes put you in a properly relaxed riding position. The Goan Classic is also the only RE 350 to get the metal switch cubes from the larger 650s. Even the exhaust muffler is new and has a bit of a raspy note to it. You also have a cantilevered rider's seat, which is just 750mm off the ground, making it the second-lowest seat on any Royal Enfield today, after the Super Meteor 650. But my favourite design element is this articulated rear fender that moves with the wheel. The logos and badging on this bike also align with the retro custom aesthetic and add that little bit of extra pizzazz to its design. The Goan Classic’s colour palette is very funky and out there, and those who like to make a statement with their bikes will like the paint options. There are four colours to choose from, but my favourite has to be the Trip Teal (nice naming, RE!). RE Goan Classic 350: Ride and handling, comfort So, how do all these changes affect the riding experience? The short answer is, not much. The Goan Classic feels very similar to the Classic 350, which is a very pleasant feeling, with the only difference being how you're seated. The tall ape hangers work rather well when you're riding, and there's no strain on your arms or shoulders. After a brief accustomization period, I found my rhythm, and I suspect it will be the same for most others. The only small caveat here is that while making a tight U-turn, you need to plan your movements correctly and be a little more mindful of the tall bars. And because of how you're seated on the bike, you'll also bear the brunt of bad roads a little more than the Classic. That said, the Goan Classic is nowhere as uncomfortable as its competitors from Classic Legends. Honestly, aside from the different riding positions, the rest of the riding experience is pretty much identical to the Classic 350. This means it's the same relaxed, comfortable, and smooth yet torquey bike we've come to know and loved over the years. RE Goan Classic: Verdict All in all, the Goan Classic 350 feels like a cut above the rest of the 350s in terms of fit and finish, quality, and uniqueness. This will also be reflected in its price, as it is the most expensive 350cc Royal Enfield. Prices start at Rs 2.35 lakh (ex-showroom, Chennai) and go up to Rs 2.38 lakh (ex-showroom, Chennai), making it Rs 5,000 - Rs 8,000 more expensive than the top Emerald Chrome Classic 350. With the Goan Classic, you're getting a very unique-looking thing with proven fundamentals, a custom bike straight from RE. So, if you're one of the few people who use their watch not just to tell the time but to make a statement, I think the Goan Classic will be right up your alley. Also see: Royal Enfield Goan Classic 350 video review Royal Enfield Goan Classic 350 walkaround video Brixton Cromwell 1200 quick ride: Most affordable 1200cc motorcycle",
    "author": "Dinshaw Magol",
    "published": "Fri, 22 Nov 2024 20:35:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241123022833_1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "2fcc4385-ce26-4923-97f5-e73163170fd5",
    "title": "2024 BMW M4 Competition review: M 4 Madness",
    "link": "https://www.autocarindia.com/car-reviews/2024-bmw-m4-competition-review-m-4-madness-433794#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Picking up the M4 Competition from BMW’s press centre storage facility on the outskirts of Munich initially feels a bit like going through passport control – licence and ID check before we are finally handed the keys. Once inside, walking through the massive parking tower feels surreal; every single BMW you can imagine is here. And probably every Mini and every Rolls, too. Even better, as we walk through, there are M cars in all shapes and sizes. What a place! Finally, we get to our car. Yeah, that nose. The flared nostrils are clearly OTT and shouty, but it doesn’t look quite as odd as it did when it was first revealed. And I like those vents on the bonnet. But can this M4 Competition deliver as characterful a driving experience? Chop-chop, we’re headed to the Austrian border and then into the Alps. Good driving roads beckon. 2024 BMW M4 Competition ride and practicality I open the surprisingly light doors, squeeze in past the big seats, and settle down. BMW has brought the curved display to the M4, and this Competition version gets plenty of other driver-oriented stuff; more on that later. My first priority is getting out of this building, and while most of the drive down resembles a normal parking lot, the last bit is unique. We drive down a steel chute and then straight out into the sunshine. Voilà! Big grille is still a big talking point of the M4. The first few kilometres of city trudge are pretty uneventful. The engine doesn’t feel overeager or spiky, the 8-speed ZF torque converter gearbox is creamy-smooth, and only when I manually intervene do I get a rude burst of power. So the M4 Competition can do the office, school and outstation runs. It has a proper boot, usable back seats and isn’t too difficult to get in and out of either. In fact, driving it in the city feels so undramatic and one-dimensional that it feels bland. No sensations come through to my palms at low speed, no nice elasticity of repose from the accelerator, and certainly no beautifully balanced and confident agility in low-speed corners. It just feels rooted and relaxed. The ride over Munich roads also feels firm; it can be brittle over bad patches, and there is a fair amount of road noise over open-pore surfaces. However, with the adaptive dampers set to Comfort, there’s enough pliancy to make the M4 Competition a very competent long-distance cruiser. Seats are large and very supportive in corners; inner thigh support is not as much of an issue as it is made out to be.   2024 BMW M4 Competition powertrain So, at normal driving speeds, the M4 Competition feels very laid back. I guess I’ll have to stir the pot a bit to get to the good stuff. This should be pretty easy once we turn off to the Autobahn, where on this route, there are plenty of derestricted stretches. But first, it’s time to do a bit of a spec check. Under the hood, the twin-turbo S58 straight-six has been wound up to 530hp – check. Then there’s 650Nm from 2,750rpm to a high 5,730rpm; plenty of torque – check. Forged crank, iron coating sprayed on the internals and two mono-scroll turbos for more boost – check. Near 50:50 front-rear weight distribution – check. And although this is a four-wheel-drive car, there is a rear-wheel-drive mode for those wet, empty parking lots and drift pads. You also get a 10-stage adjustable traction control and an ‘M drift analyser’ that awards points and stars for good drifts. I have to say I like BMW’s on-screen games better than Tesla’s. The M4 Competition, however, is heavy at 1,850kg – the four-wheel-drive hardware contributing to a lot. And yes, you get staggered wheels for greater stability, 19s and 20s at the front and rear, respectively. Stonking twin-turbo engine makes a strong 530hp. Getting to the 120kph speed limit on the restricted parts of the Autobahn brings the M4 Competition somewhat out of its shell. Past 3,000rpm, it begins shedding its Clark Kent suit and flexing its muscles. Often, 120kph comes up so quickly that I get taken by surprise. And hey, BMW, can we at least have fake analogue dials? When it comes to character, BMW’s twin-turbo straight six responds more like a naturally aspirated unit than a turbocharged one. Progression up the rev band is as linear as some atmo sixes, responses are quick, and then, because it has all the extra torque, it just hauls, even from low in the powerband. A delicious combo. 2024 BMW M4 Competition performance When we finally see the grey and white cricket ball-like de-restriction sign, my right foot goes down automatically. The M4 Competition lunges at the horizon – no delay in power delivery, no slack, no lag. And that’s even though the gearbox is in a high gear in manual mode. Even more impressive, the engine keeps pulling harder and harder as the revs climb, and at around 6,000rpm, I realise we are really shifting – the scenery flying past in a blur. Wow, this thing has some real muscle, some real grunt! And like any good BMW unit, it’s thrilled to rev and spin hard. It isn’t explosive or peaky in the mid-range, and sometimes you miss that, but it is smooth, crisp and seriously potent. 200kph is almost a casual stroll up the ’box. And when I really plant my foot, the linear lunge delivers a sledgehammer blow. The claimed 0-100kph is super quick at just 3.5 seconds, which, incidentally, is faster than a Porsche 911 Carrera. Quad exhaust and low-slung roof make it look purposeful. Niggles? It doesn’t sound great, but I like that this is the honest voice of the engine with no synth added. And when you are in a hurry, you do expect a bit more urgency from the gearbox.  2024 BMW M4 Competition handling The real test of an M car, however, comes in the twisties, and here, initially, there’s a bit of disappointment. The steering, tasked with ironing out the push-pull of the four-wheel-drive system, is light and inert, and going to a sportier setting only adds weight. Lean on the M4 Competition, however, and it seems to wake up from its slumber and come alive, the relative four-wheel-drive stodginess and not-inconsiderable weight seemingly melting away. Now, the stiff chassis and aluminium suspension seem to finally limber up, stretch and attack corners with an incredible amount of verve, grip and gymnast-like balance. The harder I turn into corners, the more agile the M4 Competition feels, with the precision from the steering sharpening up superbly. It may not be the most feelsome unit, but it is super sharp, even when all four wheels are loaded up and complaining loudly. Even small movements on the wheel change your line, and that’s exactly what you want. The steering is light and not very M car-like at all. But our drive is too brief, and to really enjoy this car to the fullest, I need more time, better roads, faster corners and more opportunities. That, or a track. Sure, it is heavy; 200kg less would have made it incredible. But the weight is placed down low, and that helps. Also, I must say, the driving position is excellent, especially if you like to sit low. 2024 BMW M4 Competition price and verdict Rs 1.53 crore will buy you an M4 Competition in India. Look at this as just a much more powerful 3 Series Coupé with some go-faster hardware, and it will seem even more expensive, especially if you consider the excellent M340i xDrive at Rs 74.9 lakh. But that’s not quite right. The M4 Competition is a whole category or two up. A serious performance car that delivers a combination of supercar pace and sedan-like practicality, the M4 is the one to go for if you want many disparate cars in one. Let’s not forget it gets a back seat and boot, comes with a stonking 530hp engine, more performance than some supercars, and on the right road, delivers a driving experience that’s agile, accurate and as adjustable as some of the best sports cars around. And that makes it stand out. Also see: BMW car prices to increase from January 2025 2024 BMW M2 launched at Rs 1.03 crore, gets more power Next-gen BMW M3 to get both ICE and EV powertrains",
    "author": "Shapur Kotwal",
    "published": "Mon, 9 Dec 2024 08:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241209102343_2024_BMW_m4_facelift_front_tracking.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "ad33c244-165c-40c4-8c3f-bd61cde58dbd",
    "title": "Audi A6 e-tron Sportback video review",
    "link": "https://www.autocarindia.com/car-video-reviews/audi-a6-e-tron-sportback-video-review-433752#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also see: Audi A6 e-tron Sportback review: Chill pill",
    "author": "Nikhil Bhatia",
    "published": "Tue, 3 Dec 2024 19:19:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241203072033_Audi_A5_e_tron_sportback_video_review.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "35d64f9a-3de5-48ee-b1cf-2e67c6bef283",
    "title": "Why Is Installing A Helmet Comm Still This Much Of A Pain?",
    "link": "https://jalopnik.com/why-is-installing-a-helmet-comm-still-this-much-of-a-pa-1851718939",
    "description": "I love motorcycle comms systems. I’ve had a Cardo PackTalk Edge for a while now, and a PackTalk Black before that — for as long as I’ve seriously ridden bikes, I’ve had a comm unit. I love having music in my helmet, I love the ability to make phone calls, I love being able to hear my turn-by-turn directions when I’m…Read more...",
    "author": "Amber DaSilva",
    "published": "Wed, 11 Dec 2024 20:48:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/12c4ca4cf37706443757e1c2775028dd.png",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "arai",
      "hospitality recreation",
      "sena",
      "shoei",
      "agv",
      "helmets"
    ]
  },
  {
    "id": "f02e85ae-9300-48f0-ab15-3c19e2074e8a",
    "title": "GM Killed Off Cruise With A Slack Message",
    "link": "https://jalopnik.com/gm-killed-off-cruise-with-a-slack-message-1851719030",
    "description": "There are a lot of shitty ways to find out the project you’ve been working on for months or years has been scrapped, but few seem as inhuman as a Slack notification. That’s exactly how Cruise CEO Marc Whitten let his team know all of their work was for naught. Earlier this week, he posted a message in the company’s…Read more...",
    "author": "Andy Kalmowitz",
    "published": "Wed, 11 Dec 2024 20:41:04 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/a88b68ffa57f1470b8c9865a54b61d11.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "cruise",
      "slack",
      "robotics",
      "uber",
      "robotaxi",
      "self driving car",
      "mo elshenawy",
      "marc whitten",
      "craig glidden",
      "techcrunch"
    ]
  },
  {
    "id": "6ea8a22b-3e85-4b85-9a73-a641e2a95666",
    "title": "Who is McLaren Automotive's new owner CYVN?",
    "link": "https://www.autocar.co.uk/car-news/business-corporate/who-mclaren-automotives-new-owner-cyvn",
    "description": "This Abu Dhabi investment institution holds the key to unlock McLaren’s long-promised electric SUV After finalising the purchase of McLaren’s sports car arm, CYVN Holdings can now be talked about in the same breath as Tata Motors, BMW and the Volkswagen Group when listing foreign firms that are investing in blue-chip British automotive brands. Unlike its peers, however, CYVN doesn’t exactly trigger the same name recognition. The deal was announced on 9 November in Abu Dhabi following McLaren Racing’s dramatic win at the country’s Formula 1 race at the weekend, sealing the constructors’ championship at the same time. Luxury automotive analyst Secret Supercar Owner described it as \"the ultimate example of win on Sunday, sell on Monday” . CYVN (pronounced ‘sigh-vin’, at least within McLaren) is an investment institution majority owned by the Abu Dhabi government and set up in 2022 “to support innovators and expanding businesses in the mobility sector”, according to its website. The site is otherwise silent on future aims, containing no links, just 44 words and an 'info@' email address. Our requests for information have so far gone unanswered. However, as with the Bahraini wealth fund Mumtalakat that sold McLaren Automotive, CYVN is another Gulf-state fund set up to spread oil riches into new ventures, here focused on automotive. CYVN’s biggest investment so far is a combined $2.9 billion (£2.3bn) into Chinese premium electric brand Nio, giving it ownership of a fifth of the company and two seats on the board. Perhaps more relevant to the UK is CYVN’s purchase last year of Gordon Murray Technologies (GMT), the EV arm of the supercar designer’s UK business.  GMT is heavily involved in the birth of another CYVN brand, Forseven, the UK-based luxury EV start-up led by former JLR head of engineering Nick Collins that’s busy hoovering British automotive talent for its Midlands operations. No purchase price has been given for either GMT or McLaren Automotive, but it’s clear CYVN has deep pockets when it comes to achieving Forseven’s stated goal of “permanently transforming the luxury automotive landscape”.  Forseven recently brought on board former Lotus chief commercial officer Mike Johnstone, former Fisker chief technology officer David King and former head of the Volkswagen Group’s next-gen EV platform development, Christoph Meyer.  Meanwhile, former McLaren Automotive CEO Mike Flewitt has listed himself on Linkedin as managing director of both Forseven and Gordon Murray Technologies. How this plays out remains to be seen but already CYVN has an advantage over former McLaren Automotive owner Mumtalakat. McLaren Automotive wouldn’t talk about CYVN’s plans, but the presence of Flewitt suggests the new owner is preparing to link its British operations and invest in the electric platform that McLaren needs to progress with its plan to go electric with its first SUV, a project that had stalled under Mumtalakat for cost reasons. The first major sign that CYVN is going to play an active role in its investments was Nio’s announcement in October that it would establish sales in the Middle East and North Africa in partnership with CYVN.  The United Arab Emirates (of which Abu Dhabi is part) was chosen as the launch market. Nio also announced a new R\u0026D centre in Abu Dhabi focused on autonomous driving and artificial intelligence. In using its investments to kick-start the region as an EV tech hub, CYVN is following a path trodden by what could be seen as its main regional rival, Saudi Arabia’s PIF (Public Investment Fund), another equity fund stuffed with oil wealth looking for a new home. PIF’s most high-profile automotive investment is a majority stake in US EV brand Lucid, which is now essentially being bank-rolled by the fund on its long journey to profitability. The company has even opened a factory to assemble cars in Saudi Arabia, albeit at small scale to start with. PIF also owns a fifth of Aston Martin. As we expect to happen with McLaren Automotive and Forseven, PIF has used its influence to pair up Aston Martin with Lucid technology in the development of Aston’s first EV, now due in 2026.  Other PIF mobility investments via its Tasaru Mobility fund include a $100 million (£79m) stake in Mate Rimac’s new robotaxi operation Verne, as well as European supplier Benteler’s Holon autonomous taxi enterprise. Mumtalakat’s ownership of McLaren Automotive was soured by the brand’s persistent lack of profitability, partly triggered by the Covid crisis. As more of a passive investor, it wasn’t prepared to invest the money that CEO Michael Leiters needed for the next big spending push. However, CYVN looks likely to take a more proactive role that makes use of overlapping investments, hopefully unlocking the new, more profitable segments the brand needs to carry on building sports cars before – just maybe – hitting the heights of profitability enjoyed by Ferrari and more recently Lamborghini.",
    "author": "",
    "published": "Wed, 11 Dec 2024 10:11:10 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/mclaren-artura-spider-front-quarter.jpg?itok=sRl0Cehu",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "20e50487-9757-4cb3-b712-05d11334d232",
    "title": "Geely launches Ford E-Transit Custom rival in the UK",
    "link": "https://www.autocar.co.uk/car-news/new-cars/geely-launches-ford-e-transit-custom-rival-uk",
    "description": "SV (Supervan) is based on a platform designed specifically for electric vans Farizon Supervan will be offered with three bodies and two batteries, with ranges of up to 225 miles Geely’s commercial vehicles arm, Farizon, will soon enter the UK market with a rival for the Ford E-Transit Custom and the Vauxhall Vivaro Electric. Named the Farizon SV (Supervan), it is based on an architecture designed specifically for electric vehicles, with batteries mounted under the floor of the cargo bay. It will be offered in three body lengths and heights: the smallest version measures 4.99m long and 1.98m tall; the middle-rung version is 5.49m long and 2.18m tall; and the range-topper is 5.95m long and 2.5m tall. For reference, the E-Transit Custom is offered in one height (1.97m tall) and two lengths (5.05m and 5.45m). The Supervan’s payload capacities will range from 1100kg to 1300kg, and the cargo bay’s volume measures from 6.9 cubic metres to 13 cubic metres. Two batteries will be available at launch, with capacities of 67kWh and 83kWh. The latter is claimed to give a range of 225 miles between charges. A third, 106kWh battery pack is on the way to extend that figure. Inside, the Supervan offers seating for three and two displays: a small dashboard-mounted unit for instrumentation and a larger central infotainment toucshcreen.  Farizon has yet to detail any further bodystyles or variants of the Supervan that are bound for the UK, but in China, it is also available as a seven- and nine-seat minibus, and as a camper van. Prices have yet to be announced, but it’s expected to undercut the E-Transit Custom (£44,899, excluding VAT) and the Vivaro Electric (£51,715, including VAT). It will be sold by Saudi Arabia-based Jameel Motors, with deliveries starting in mid-2025.",
    "author": "",
    "published": "Wed, 11 Dec 2024 09:44:15 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/farizon-sv-front-quarter.jpg?itok=nPnpPYlf",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "0f11b05c-de5f-4380-97bb-4a0d4d962ffb",
    "title": "The First-Ever Electric BMW M3: Teased by BMW M",
    "link": "https://www.bmwblog.com/2024/12/11/bmw-m3-electric-neue-klasse-prototype-preview/",
    "description": "BMW M is ramping up excitement for its electric future with a sneak peek at what seems to be the all-electric Neue Klasse M3. Following teasers of the driving dynamics of their electric M3 test... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Wed, 11 Dec 2024 21:09:32 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/12/bmw-m3-electric-prototype-00-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "BMW M3",
      "M3 Electric",
      "M3 EV",
      "ZA0"
    ]
  },
  {
    "id": "e9e6fab0-6891-4b9a-b3ba-67d6bdff70b2",
    "title": "The 1988 BMW Supercar That Never Happened",
    "link": "https://www.bmwblog.com/2024/12/11/1988-bmw-m188-supercar-that-never-happened/",
    "description": "There will always be secrets the BMW enthusiast will never know. For an automaker with such an illustrious history, we can only imagine how many cars were left on the proverbial cutting room floor. In... First published by https://www.bmwblog.com",
    "author": "Adrian Padeanu",
    "published": "Wed, 11 Dec 2024 20:43:23 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/12/bmw-m1-design-sketches-01-830x541.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "Concepts",
      "BMW Supercar",
      "M188"
    ]
  },
  {
    "id": "15e57436-b765-4a7e-b92e-12b44c764a96",
    "title": "BMW M Teases A Hot Neue Klasse M3 EV",
    "link": "https://www.carscoops.com/2024/12/bmw-m-teases-a-hot-neue-klasse-ev/",
    "description": "The prototype is expected to preview a new electric M3, possibly named i3 M",
    "author": "Michael Gauthier",
    "published": "Thu, 12 Dec 2024 00:50:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/12/bmw-hp-bev-prototypwerfdc-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "BMW",
      "BMW M",
      "BMW M3",
      "BMW Scoops",
      "Electric Vehicles",
      "Scoops"
    ]
  },
  {
    "id": "c0e39064-da09-4c8d-b561-2462263b2ced",
    "title": "Tesla Sued After Woman Claims Locking Flaw Let Attacker Enter Model Y",
    "link": "https://www.carscoops.com/2024/12/woman-sues-tesla-over-allegedly-faulty-door-locks-that-allowed-her-to-be-assaulted/",
    "description": "The woman says that she locked the car from the inside with her Tesla app but an assailant was still able to open the door",
    "author": "Stephen Rivers",
    "published": "Wed, 11 Dec 2024 23:30:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/12/Supercharger_81-copy-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Electric Vehicles",
      "Lawsuit",
      "Offbeat News",
      "Reports",
      "Safety",
      "Tesla",
      "Tesla Model Y"
    ]
  },
  {
    "id": "f9709827-01d1-4fec-aed7-de442eec1b81",
    "title": "B-Road Bomber: A 70s-style Ducati Monster M900 racer by 46Works",
    "link": "https://www.bikeexif.com/ducati-monster-46works",
    "description": "On the first weekend of December each year, the Pacifico Yokohama convention center is filled to the brim with highly imaginative machines for the Yokohama Hot Rod Custom Show. There’s a whole lot going on—from crazy engineering to retina-searing paint jobs. But one Japanese custom builder stands out for entirely different reasons. Shiro Nakajima, otherwise known as 46Works, wows year after year with his tastefully restrained racing-inspired customs. A trained engineer and former boss of the Japanese restomod powerhouse Ritmo Sereno, Nakajima-san has a knack for combining Japanese craftsmanship with European style. That philosophy is on full display in this stylish Ducati Monster M900 racer. Shiro built the Ducati on commission, with an open brief that left every decision up to him—including the choice of donor bike.…",
    "author": "Wesley Reyneke",
    "published": "Wed, 11 Dec 2024 21:05:46 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/12/ducati-monster-46works-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "46Works",
      "Cafe racers",
      "Ducati",
      "Ducati cafe racer",
      "Ducati Monster"
    ]
  },
  {
    "id": "578b8a21-771f-4e3a-a028-25f1fc24cc40",
    "title": "Engineered to Climb: A Harley Street 750 Rises up from Down Under",
    "link": "https://www.bikeexif.com/engineered-to-slide-harley-street-750",
    "description": "Occasionally you get the call. You spend all your free time in your backyard or garage, mostly for the love of it, and then one of the big guys notices what you’ve been up to. Harley-Davidson Australia noticed Nigel Petrie. They called to ask him to have some fun on their dime, and that he did. Nigel is the mind behind Engineered To Slide, a custom auto and motorcycle garage from Down Under. He’s been headdown and neck-deep in projects of all sorts since 2010. As a builder, Nigel is always challenging himself from one project to the next, whether it’s a drifting Toyota pickup, a landspeed KTM, or this Harley-Davidson hillclimber. After some historical and technical research, he got to work transforming a bone-stock Street 750 into the modern hill climber Harley-Davidson was asking for.…",
    "author": "Iron and Air",
    "published": "Mon, 09 Dec 2024 17:00:36 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/12/petrie-harley-street-750-2.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Featured Bikes",
      "Harley-Davidson Street",
      "Iron \u0026 Air"
    ]
  },
  {
    "id": "70ef9958-7c35-401c-8ad3-76612b0454bc",
    "title": "Review: New “3D Cars – Inside Out” Blender Course",
    "link": "https://www.carbodydesign.com/2024/09/review-new-3d-cars-inside-out-blender-course/",
    "description": "The new training course by CGMasters explains advanced SubD (subdivision surfaces) modeling techniques for creating car 3D models in Blender with high quality surfaces.",
    "author": "Marco Traverso",
    "published": "Sun, 22 Sep 2024 07:47:04 +0000",
    "image": "http://www.carbodydesign.com/media/2023/07/3D-Cars-Blender-Course-Julietta-H6-Concept-3D-Model-04-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "_Cover Stories (Sticky)",
      "_Featured Articles",
      "_Sponsored Article",
      "3D Tutorials",
      "Blender Tutorials",
      "Car 3D Modeling Tutorials",
      "Car Rendering Tutorials",
      "Cover Stories",
      "3D",
      "Blender"
    ]
  },
  {
    "id": "da48fb12-2bf0-4a64-b6ad-68942f6026ee",
    "title": "Stellantis launches annual Drive for Design contest",
    "link": "https://www.carbodydesign.com/2024/03/stellantis-launches-annual-drive-for-design-contest/",
    "description": "Stellantis has launched the new edition of its Drive for Design Contest for US high school students. The deadline is April 12, 2024 and the top prize is an internship at Ram Truck design studio.",
    "author": "Car Body Design",
    "published": "Mon, 11 Mar 2024 09:45:27 +0000",
    "image": "http://www.carbodydesign.com/media/2024/03/Stellantis-Drive-for-Design-Contest-Poster-02-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Car Design Competitions",
      "Dodge",
      "Drive for Design Contest",
      "Stellantis"
    ]
  },
  {
    "id": "40419906-3242-4b95-9468-a9ef6618352d",
    "title": "Fantastic Ferraris Headline Bernie Ecclestone’s Amazing F1 Collection Sale",
    "link": "",
    "description": "Former Formula 1 supremo Bernie Ecclestone is selling 69 of his finest racing cars from what is believed to be the most valuable Grand Prix and F1 collection in the world, including a range of incredible Ferraris that span from legendary drivers Alberto Ascari to Michael Schumacher. The sale of The Ecclestone Grand Prix Collection is being overseen by UK-based performance car specialist Tom Hartley Jr via private treaty sale rather than auction. That means we’ll never know what they sell for. Continue...",
    "author": "",
    "published": "Wed, 11 Dec 2024 22:13:20 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/12/10082150/image2-1-e1733847775166.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "89854bf0-188a-4f08-82e8-fa2cf79e51c0",
    "title": "Richard and his Bug - A story of two old souls",
    "link": "",
    "description": "To keep a car running, change its oil every 3000 miles,” says 76-year-old Richard. His advice is nothing new, especially for anybody who owns an old Volkswagen, and he has applied this saying to his 1983 Volkswagen Beetle, which has served him for over 20 years. Some 20 years ago, Richard got a call from a friend saying that there was a Beetle for sale not too far away from him. He decided to take a look, and the moment he saw the Bug, he instantly fell in love with it. Continue...",
    "author": "",
    "published": "Wed, 27 Nov 2024 16:00:23 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/11/21055627/2-1-e1732197456402.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "5b202318-7035-4f8a-9991-5d34a85051be",
    "title": "Some Infiniti Dealers to Merge with Nissan Stores to Save Money",
    "link": "https://www.caranddriver.com/news/a63162866/infiniti-dealers-merging-nissan-stores-save-money/",
    "description": "A Nissan spokesperson confirmed the consolidation plans but declined to provide exact numbers.",
    "author": "",
    "published": "Wed, 11 Dec 2024 22:45:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "a8704f73-6643-482c-8b85-08efc9188887",
    "title": "Take Your Christmas Tree for a Safe Ride Home on Top of Your Car",
    "link": "https://www.caranddriver.com/news/a42144191/christmas-tree-on-car-right-wrong-ways/",
    "description": "Across the country, people are strapping Christmas trees to their car roofs. Here's how to be among those who are doing it right.",
    "author": "",
    "published": "Wed, 11 Dec 2024 21:14:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "5b7afad9-3c6e-4423-8589-7d03bd1bffbc",
    "title": "The Golden Age Of Touring Cars At Essen Motor Show 2024",
    "link": "https://www.speedhunters.com/2024/12/the-golden-age-of-touring-cars-at-essen-motor-show-2024/",
    "description": "Affordable budgets, close racing, and fan engagement – that’s all a race series can wish for, and luckily, motorsport seems to be in a healthy place right now. Let’s be honest, though; we’re still a long way from the iconic stature of the Group A era in the Deutsche Tourenwagen Meisterschaft (DTM). Launched in 1986 […] The post The Golden Age Of Touring Cars At Essen Motor Show 2024 appeared first on Speedhunters.",
    "author": "Mario Christou",
    "published": "Wed, 11 Dec 2024 17:00:30 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Event Coverage",
      "Deutsche Tourenwagen Meisterschaft",
      "dtm",
      "Essen Motor Show",
      "Essen Motor Show 2024",
      "europe",
      "Germany",
      "Touring Car",
      "Touring Cars"
    ]
  },
  {
    "id": "8c89fa9e-3055-4b0c-9b8e-8dc68a10c354",
    "title": "Three Of The Best NFS Most Wanted M3 GTR Tributes",
    "link": "https://www.speedhunters.com/2024/12/three-of-the-best-nfs-most-wanted-m3-gtr-tributes/",
    "description": "Naturally, there was a fairly mixed response. And it quickly became apparent that the answers we received were heavily influenced by what era you grew up in and which title was released during that time. Racing games, especially those played in our younger years before owning a car, massively shaped our interest in specific car […] The post Three Of The Best NFS Most Wanted M3 GTR Tributes appeared first on Speedhunters.",
    "author": "TheSpeedhunters",
    "published": "Tue, 10 Dec 2024 15:17:46 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "BMW",
      "e46",
      "gaming",
      "gtr",
      "M3",
      "M3 GTR",
      "Most Wanted",
      "Need for Speed",
      "Need for Speed Most Wanted",
      "Need for Speed Unbound",
      "NFS",
      "Razor",
      "replica"
    ]
  },
  {
    "id": "920bdbec-046f-43b1-8884-a51ef58fac98",
    "title": "Used Car of the Day: 1989 Provan Tiger GT",
    "link": "https://www.thetruthaboutcars.com/cars/used-car-of-the-day/used-car-of-the-day-1989-provan-tiger-gt-44510761?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Today we have a UCOTD that's quite unique -- a 1989 Provan Tiger GT built on the Astro van chassis.",
    "author": "Tim Healey",
    "published": "Wed, 11 Dec 2024 21:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/12/11/15371/used-car-of-the-day-1989-provan-tiger-gt.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Used Car of the Day"
    ]
  },
  {
    "id": "9eaa375e-64a3-48a0-b702-8cbc934ed25b",
    "title": "Tesla Cybercab to Use Remote Backup Drivers",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/tesla-cybercab-to-use-remote-backup-drivers-44510758?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Whether you believe autonomous driving is a sham designed to sell people on the latest products, a covert way to strip motorists of their own autonomy, or a legitimate breakthrough that’s poised to permanently change how we use the automobile, the technology is gradually becoming more widespread. Tesla, which showcased its Cybercabs earlier this year, intends on fielding fully autonomous vehicles that can whisk people around without need of physical controls. But the relevant technologies aren’t yet bulletproof, requiring the company to hire remote backup operators who can take over whenever the system encounters blind spots. The Tesla Cybercab will be at least partially dependent on safety drivers piloting the vehicles when needed.",
    "author": "Matt Posky",
    "published": "Wed, 11 Dec 2024 19:57:59 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/12/11/13301/tesla-cybercab-to-use-remote-backup-drivers.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  }
]
