[
  {
    "id": "446eda15-5b3a-4f4c-a5e0-3f540434b0a5",
    "title": "2019 Aston Martin Vanquish Zagato Shooting Brake",
    "link": "https://bringatrailer.com/listing/2019-aston-martin-vanquish-zagato-shooting-brake-4/",
    "description": "This 2019 Aston Martin Vanquish Zagato Shooting Brake is #26 of 99 examples produced and is said to be one of 11 imported to the US. Finished in Scorching Black over two-tone Pure Black and Sahara Tan leather, the car is powered by a 5.9-liter AM29 V12 linked to an eight-speed automatic transaxle and a limited-slip differential. Optional equipment includes a carbon-fiber rear cargo floor and shift paddles as well as a One-77 steering wheel, and the car is further equipped with carbon-fiber exterior trim, swan doors, 20\" five-spoke alloy wheels, an active damping system, and front and rear parking sensors. Inside, the cabin features heated and ventilated seats, rear parcel shelves, a Bang \u0026 Olufsen sound system, and an infotainment system with a pop-up display. The car was previously sold on BaT in June 2024 and was acquired by the current owner in 2025. This Zagato Shooting brake now has 3,500 miles and is offered on dealer consignment in New Jersey with a window sticker, the owner's manual, an Aston Martin-branded umbrella, a glass Emotion Control Unit (ECU) key fob, a car cover, and a clean Montana title.",
    "author": "bringatrailer",
    "published": "Mon, 24 Mar 2025 00:00:02 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/03/2019_aston-martin_vanquish-zagato-shooting-brake_a2-08925.jpg?fit=940%2C626",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "fc30962d-c7f4-4c7f-bb62-1bd08a62130e",
    "title": "1988 Porsche 911 Turbo Coupe",
    "link": "https://bringatrailer.com/listing/1988-porsche-911-turbo-coupe-26/",
    "description": "This 1988 Porsche 911 Turbo coupe has remained registered in California from new through the current owner's purchase in 2016 from its original owner, and its turbocharged 3.3-liter flat-six and a four-speed manual transaxle have since been rebuilt. Finished in black over Silver Grey leather upholstery, the car is equipped with 16\" Fuchs alloy wheels, a limited-slip differential, four-wheel cross-drilled and ventilated disc brakes, a sunroof, a rear spoiler, power-adjustable seats, a Kenwood head unit, and air conditioning. This 930 Turbo coupe is offered on dealer consignment with a clean Carfax report and a clean California title.",
    "author": "bringatrailer",
    "published": "Sun, 23 Mar 2025 22:00:06 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/03/1988_porsche_911-turbo-coupe_edits-9450-83152.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "46447bf1-4811-4877-97bf-f5471f2b047c",
    "title": "Elon Musk Has a Plan to Curb Tesla Store Car Vandals - But There’s a Catch",
    "link": "https://www.autoblog.com/news/elon-musk-has-a-plan-to-curb-tesla-store-car-vandals-but-theres-a-catch",
    "description": "If you've kept up with Tesla news, you've undoubtedly seen the wave of vandalism against both dealership and privately owned cars. Tesla has fought back against recent acts of vandalism toward its inventories by enabling Sentry Mode on all of its showroom vehicles. When active, Sentry mode uses a ...",
    "author": "Cody Carlson",
    "published": "Mon, 24 Mar 2025 00:13:15 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwODg0NDEx/tesla-showroom.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Tesla",
      "News"
    ]
  },
  {
    "id": "88632fc2-8b6a-4c98-914e-d3d7e2f08b91",
    "title": "Tesla Insurance Rates Could Rise as Anti-Musk-Driven Vandalism Spreads",
    "link": "https://www.autoblog.com/news/tesla-insurance-rates-could-rise-as-anti-musk-driven-vandalism-spreads",
    "description": "For years, Tesla has been one of the most expensive car brands to insure, but a new trend may send rates soaring even higher. Increasing incidents of vandalism targeting Tesla vehicles have insurers bracing for a surge in claims, which could mean higher premiums or even outright blacklisting for ...",
    "author": "Elijah Nicholson-Messmer",
    "published": "Sun, 23 Mar 2025 18:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5NDk1NDM5OTQ1MjQ1ODY1/tesla-co-founder-and-ceo-elon-musk-verbally-reacts-in-front-of-the-tesla-cybertruck-with-broken-windows-following-a-demonstration-that-did-not-go-as-planned-on-november-21-2019-at-tesla-design-center-.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Tesla",
      "News"
    ]
  },
  {
    "id": "c963c6fa-388c-43e3-9ae8-fe91ee267532",
    "title": "Rolls-Royce Spectre",
    "link": "https://www.autocar.co.uk/car-review/rolls-royce/spectre",
    "description": "Rolls-Royce fights the habit of 120 years and launches its first electric car  The Rolls-Royce Spectre is the super-luxury car company’s first electric vehicle. But if you think electric cars are a modern phenomenon, remember that when company founders Charles Rolls and Henry Royce met, electric cars were very much in vogue. In 1899 the world’s fastest car was electric, central London was abuzz with electric carriages and in 1900 a third of all cars in the US were electric.One of the first briefs for Rolls-Royce cars was, in fact, to produce a combustion-engined vehicle that would be as quiet, smooth and easy to use as an electric one, without the charging and range limitations that kept EVs for ‘town carriage’ use.Over the following century Rolls-Royce virtually perfected the art, with its very latest V12s from today’s Phantom and Ghost being some of the world’s quietest, smoothest and most compelling luxury powerplants.But with the world once more ready for EVs, in 2023 Rolls-Royce launched the Spectre, a super-luxury coupé and its first EV, which it followed in 2025 with the Black Badge edition for more “subversive” customers who want a bit of additional edge. Not only is it electric, but the Black Badge edition is also the most powerful car Rolls-Royce has ever made.At the time of writing, we’ve fully road tested a regular Spectre in the UK, including a set of performance and economy figures, weights and measurements, and more briefly driven a Black Badge edition overseas.The range at a glanceModelsPowerFromGhost563bhp£278,055Cullinan563bhp£312,855Spectre577bhp£332,055Phantom563bhp£417,255Rolls-Royce would tell you that deals with ‘uniquely commissioned’ models rather than having a range, but there are two Spectre models: the regular car (not that it would refer to it in such prosaic terms) and the Black Badge edition.It’s interesting to see where the car slots in to Rolls’ wider line-up. Filling the space left by the Phantom coupé, it is priced above both the Ghost saloon and Rolls-Royce Cullinan SUV (although both the Ghost and Phantom are offered as EWB), with power to trump its range-mates.",
    "author": "",
    "published": "Mon, 24 Mar 2025 09:00:00 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/rolls-royce-spectre-black-badge-2025-review-front-tracking-09689_1.jpg?itok=4gb8mIvA",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "e2120af4-2654-466a-a1b4-4d6e72ae0454",
    "title": "How car interiors are sparking new levels of creativity",
    "link": "https://www.autocar.co.uk/car-news/features/how-car-interiors-are-sparking-new-levels-creativity",
    "description": "BMW's Neue Klasse concept previewed a bold new direction for its future cabins The electric age has spawned lounge-like interior designs that are redefining how cars look and feel inside After decades of ubiquitous grey, black and cream interiors, car makers are finally experimenting with more adventurous combinations of colours and materials. The new Fiat Grande Panda pairs a blue dashboard and seat upholstery with yellow mood lighting; Mini is stitching bold, brightly coloured patterns into the Aceman’s dashboard and door linings; and Volvo is using recycled plastic from discarded PVC windows for some of its interior materials paired with recycled fishing nets for floor mats in its EX30. As we usher in, at long last, an era of more adventurous and innovative and uplifting cabin design, here are the developments and trends that will shape your next car’s cockpit. Adventurous contrasts Tesla popularised the trend for dark and light contrasts, but the interior of the Lexus LF-ZL SUV concept shows us what’s possible when designers go to town on pairing opposites. As well as coupling grey, light brown and off-white, Lexus has combined materials with very different textures, including ribbed door panels and shag carpet. This is a step too far for widespread application, but more daring use of contrasting colours and materials is coming imminently. Purple Genesis went all in on gothic tones for its Neolun SUV concept, but the trend for dark purple is expected to translate in more subtle ways to more mainstream vehicles over the next year or so. Sunshine tones The colour of 2024, Apricot Crush (according to trend analysis firm WGSN), has been used liberally in the BMW Vision Neue Klasse X concept’s cabin (above). Urangoo Samba, head of colour at WGSN, says the tone “speaks to today’s consumers who seek light and positivity”. Similar warm colours are set to make their way to production this year on details such as seatbelts, cubbyholes and mood lighting, as previewed inside the Skoda Epiq concept. Blended tones Audi’s Activesphere concept’s upholstery and door fabric transition seamlessly from black to red, creating a moody, high-end atmosphere. Such tonal gradients are on the verge of going mainstream, having been spotted in Nissan’s 2023 Hyper Adventure concept and the new Mini Countryman. The decision to focus on either contrasts or seamless transitions could become an important differentiating factor between brands in the future. Customisation 3D printing has made production of intricately detailed objects and more customisation commercially viable. Renault, for example, is using it on a range of colourful storage bins in its new 5 E-Tech. With owners looking to stamp their personality onto their cars, increased customisation of interior details is becoming a hot trend. Smart Surfaces Car makers are experimenting with smart surfaces to create simpler, less cluttered environments. Smart materials appear plain but contain hidden technology that comes alive when desired. The BMW i Vision Dee concept’s woven dash doubles as a control panel and projects infotainment onto the windscreen. Smart surfaces are likely to be commonplace inside high-end interiors by the end of the decade, transforming them into boutique spaces for work or relaxation. by Aysar Ghassan",
    "author": "",
    "published": "Sun, 23 Mar 2025 09:00:45 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/images/car-reviews/first-drives/legacy/bmw_vision_neue_klasse_x_concept_2.jpg?itok=sTCmg2jA",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "61737e54-eb7f-4cbe-9c23-8ddd214c5535",
    "title": "Tennis, Torque, and Thermal Thrills: Indian Wells Through BMW Lens",
    "link": "https://www.bmwblog.com/2025/03/23/bmw-indian-wells-bnp-paribas-open/",
    "description": "They call Indian Wells “Tennis Paradise” and honestly, it lives up to the name. But before I even got to the tournament, my weekend in Palm Springs had already started on a high note—behind the... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Sun, 23 Mar 2025 20:17:28 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2025/03/2025-bmw-m5-california-01-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "Lifestyle",
      "bmw-performance-center",
      "Indian Wells"
    ]
  },
  {
    "id": "ee911e97-ec3d-4d30-a19c-0dcfbfb75a36",
    "title": "BMW’s Original ‘Neue Klasse’: Taming the Tiger",
    "link": "https://www.bmwblog.com/2025/03/23/bmws-original-neue-klasse/",
    "description": "The German middle class was ready for the BMW 1500 when it debuted at the Frankfurt Motor Show in 1961. Orders poured in by the thousands, and BMW soon realized they had a tiger by... First published by https://www.bmwblog.com",
    "author": "Hugo Becker",
    "published": "Sun, 23 Mar 2025 18:10:46 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/01/bmw-1500-neue-klasse-11-830x528.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "Interesting",
      "BMW 1600",
      "BMW 1602",
      "BMW 1800",
      "bmw 2002",
      "Neue Klasse"
    ]
  },
  {
    "id": "330f3963-06aa-44a6-be76-d866f861f0f8",
    "title": "Speed Read: A neo-punk Yamaha XSR700 from Lisbon and more",
    "link": "https://www.bikeexif.com/custom-motorcycle-news-march-23-2025",
    "description": "We’ve cast our net wide this week to bring you four very different motorcycles from four different countries. Portugal offers up a Yamaha XSR700 street scrambler, Canada sends us a tasty Honda CB750 restomod, and Italy shows off the new Ducati Panigale V4 Tricolore Italia. Finally, we ogle an as-new 1991 Bimota TESI 1D 904 SR from New York, USA. Yamaha XSR700 by Unik Edition Deeply embedded in Lisbon’s buzzing custom motorcycle scene, Loek Janssen has a bike for every occasion—including a KTM 450 EXC-F in supermoto trim and a 1981 BMW R100 street scrambler. He’s just added this Yamaha XSR700 to his stable, to make sure all his bases are covered. Loek’s vision for the XSR was to have a bike he could scoot around the city with daily, and point down the occasional fire road whenever the craving hits.…",
    "author": "Wesley Reyneke",
    "published": "Sun, 23 Mar 2025 19:09:26 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/03/custom-motorcycle-news-225.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Latest Motorcycle News",
      "Honda CB750",
      "Restomod",
      "Scramblers",
      "Unik Edition",
      "Yamaha motorcycles",
      "Yamaha XSR700"
    ]
  },
  {
    "id": "ff73a0ee-e604-496e-a38d-d7bce42f3cb7",
    "title": "The very best of the 2025 Speed and Crafts custom bike show in Taiwan",
    "link": "https://www.bikeexif.com/2025-speed-and-crafts-custom-bike-show",
    "description": "The brainchild of Rough Crafts frontman Winston Yeh, the Speed and Crafts custom bike show ran for the second time earlier this month. Showcasing the best that Taiwan has to offer, the event brought together a slew of local and international judges to preside over the 47 custom motorcycles present. Supported by Shoei, Alpinestars, Harley-Davidson, Breitling Taiwan, SYM, and Madness, Speed and Crafts is as much a custom motorcycle championship as it is a bike show. As one of the leading lights of the Taiwanese custom scene, the man has a passion for elevating the culture and spurring his peers on. While roughly 5,000 visitors crammed through the doors of the SongShan Cultural and Creative Park in Taipei’s Xinyi District, Winston and his team of judges had the arduous task of picking the best bikes.…",
    "author": "Ben Pilatti",
    "published": "Sat, 22 Mar 2025 16:38:16 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/03/2025-speed-and-crafts-custom-bike-show-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Motorcycle Show",
      "Harley-Davidson",
      "Rough Crafts"
    ]
  },
  {
    "id": "fe596ee6-8213-41ac-8a7e-72b2ac2155c6",
    "title": "Ford SUV Unleashes Its Inner Bigfoot, Crushes Jaguar F-Type",
    "link": "https://www.carscoops.com/2025/03/ford-suv-unleashes-its-inner-bigfoot-crushes-jaguar-f-type/",
    "description": "Photos of the aftermath reveal the extent of the damage, suggesting the Jag might well be a write-off",
    "author": "Thanos Pappas",
    "published": "Mon, 24 Mar 2025 01:02:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/03/ewrqwreqfdscvx-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Accidents",
      "Ford",
      "Ford Everest",
      "Ford Videos",
      "Jaguar",
      "Jaguar F-Type",
      "Jaguar Videos",
      "Offbeat News",
      "SUV",
      "Video"
    ]
  },
  {
    "id": "c988ae6c-8e79-4667-bf3a-8d90f3927306",
    "title": "Tesla Owners Are Selling Their Cars In Record Numbers Over Musk’s Politics",
    "link": "https://www.carscoops.com/2025/03/tesla-owners-are-ditching-their-cars-in-record-numbers/",
    "description": "The number of Tesla trade-ins has surged in the past year, likely fueled by Elon Musk's controversial involvement in politics and the Trump administration",
    "author": "Michael Gauthier",
    "published": "Sun, 23 Mar 2025 23:23:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/03/weqrqwerrwqwerqfdcsx-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Electric Vehicles",
      "Elon Musk",
      "Reports",
      "Study",
      "Tesla",
      "USA",
      "Used Cars"
    ]
  },
  {
    "id": "af3637f3-1860-4cfe-9261-30ef02ecdfcc",
    "title": "Hero Xpulse 210 video review",
    "link": "https://www.autocarindia.com/bike-video-reviews/hero-xpulse-210-video-review-434914#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Also see: Hero Xpulse 210 review: Worth the upgrade?",
    "author": "Gavin Rodrigues",
    "published": "Sat, 22 Mar 2025 12:14:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250322121905_autocarindiacom.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "008a4dc8-30bd-4c67-b594-7ebfa021eac1",
    "title": "Hero Xpulse 210 review: Worth the upgrade?",
    "link": "https://www.autocarindia.com/bike-reviews/hero-xpulse-210-review-worth-the-upgrade-434903#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Hero’s Xpulse has long been the go-to motorcycle for riders looking for an accessible, affordable, and reasonably capable dual-sport. Hero MotoCorp now takes things a step further with the all-new Xpulse 210—a motorcycle the company says has been designed from the ground up to enhance both its highway cruising capability and off-road performance. Developed with input from Dakar rally riders, the Xpulse 210 marks a significant leap forward.  Hero Xpulse 210 design, features and ergonomics The design isn't a drastic change to the original The updated design of the Xpulse 210 has been showcased at both EICMA and Bharat Mobility. While not a drastic departure from its predecessor, it represents an evolution rather than a revolution. The Xpulse 200 straddled the line between a dual-sport and a commuter, but the 210 finds a better balance between dual-sport and ADV. The Xpulse 210 looks like a mini Africa Twin in this shade of Azure Blue. Swinging a leg over the Xpulse 210 feels familiar to the 200, as Hero has refined rather than overhauled the formula. The 210 features an offset handlebar, offering improved adjustability and reach. Additionally, Hero also sells an optional handlebar riser that allows for more height adjustments. Ergonomics are now noticeably better than before One of the key complaints with the Xpulse 200 and 200 4V was the forward-set footpeg positioning, which Hero addressed in a 2024 update. The Xpulse 210 builds on this by offering adjustable footpeg and pedal heights, further improving ergonomics. Footpegs now feel better suited for the intended purpose of this motorcycle. The new seat provides better cushioning for both rider and pillion while featuring a slimmer front section to aid shorter riders in reaching the ground. This is good because seat height has gone up from 825mm to 830mm. Seat now offers better comfort for both rider and pillion The result of all these changes is that the standing ergonomics have also improved significantly and the Xpulse 210 provides a more commanding stance. In fact, I found the standing ergonomics better on this Xpulse 210 than the all-new KTM 390 Adventure. New rear rack boasts a better design than before There has also been an improvement to the luggage mounting points with a new rear rack that is not only bigger than the one on the Xpulse 200s but also makes for a better recovery point should you need to pick the bike back up after a fall.  A nice addition that increases the number of recovery points Additionally, Hero has also added a bar near the headlamp which serves as yet another recovery point in case you find yourself in some muck and need some assistance to get out. There is also a slimmer and better-looking high-mounted exhaust and a new metal bash plate that certainly appears more durable than the one found on the  Xpulse 200s. New TFT feels a lot more premium and is quite legible Build quality has also improved, with better fit and finish. The 4.2-inch TFT display is a welcome upgrade, offering Bluetooth connectivity, navigation, and phone controls. The tactile switchgear adds to the premium feel, though the matte-finish screen reduces legibility under direct sunlight. Hero Xpulse 210 suspension, frame and brakes The Xpulse 210 has better ride quality and composure than its predecessor Beyond design improvements, the Xpulse 210 features an all-new frame and updated suspension. The front fork has been upgraded from 37mm to 41mm, increasing stiffness for better control and precision. The rear features a new progressive-linked monoshock, providing compliance over small bumps while stiffening for larger impacts. Compared to the Xpulse 200, the ride feels smoother and more predictable, improving both road and off-road stability. Suspension now feels more planted around corners The latest iteration is more stable around corners and offers a better balance between road and offroad ride quality. All in all this new setup doesn’t let the motorcycle squat or dive nearly as much as the Xpulse 200s. In fact, I’m going to go as far as to say this suspension setup is perhaps one of the nicest ones I’ve experienced from an Indian manufacturer, second only to the Royal Enfield Himalayan. There is a noticable improvement in overall handling The company says the new double-cradle frame has been chosen not only for better stress distribution but also to protect the engine from below, especially during hard landings from jumps. It now also gets a 35mm longer wheelbase, bringing it closer to a 450cc MX bike and has resulted in a 40mm increase in overall length, adding to its stability. Despite gaining nearly 10kg in weight, the Xpulse 210 feels lighter and more agile than its predecessor. Braking performance is familiar for the most part The Xpulse 210 gets the same 276mm disc at the front and 220mm disc at the rear as the Xpulse 200s. As a result, braking performance remains largely the same but feels noticeably better perhaps due to the better Eurogrip tyres and reduction in brake dive. This motorcycle now gets dual-channel ABS and also has three ABS modes (Road, Trail, Off-road) that allow you to turn off ABS selectively and can be done on the move.   Hero Xpulse 210 road and off-road performance The new 210cc engine is shared with the Karizma XMR The new 210cc engine offers an additional 5hp and 3Nm over the previous version. Though these gains may seem modest, they translate to a noticeably improved riding experience. The motor feels more responsive, particularly in the low and mid-range compared to the Karizma thanks to an increase in teeth at the rear sprocket and new cams, making inclines more manageable without constant downshifts. Motor feels more tractable and sounds better than before Highway cruising speeds too have seen an improvement with the motorcycle now cruising effortlessly between 80-100kph, while triple-digit cruising or overtakes will require a bit more effort. This makes it slightly better for long-distance travel and is yet another step to improve its all-rounder credentials.  Motor now cruises comfortably at higher speeds The sound from the new exhaust is a lot nicer and doesn’t pack the same commuter undertone as the Xpulse 200s. The motor overall feels a lot more engaging now both on and off-road greatly improving over the previous iterations shortcomings. New exhaust looks and sounds much better than before The cooling system has also been redesigned for better thermal management. However, by the end of my ride, the Xpulse 210 went into limp mode and the motorcycle wouldn’t rev beyond 6,500rpm. The company claims this was due to an increase in coolant temperature, although there was no warning sign or indication of it on the TFT. Upon inquiring with other journalists it would seem this issue was only limited to our unit. Hero Xpulse 210 verdict and price Xpulse 210 offers great value in the dual-sport space The Xpulse 210 is a significant leap forward, addressing the shortcomings of its predecessor while staying true to the core values of simplicity, affordability, and durability. At a reasonable Rs 23,000 - Rs 33,000 premium over the Xpulse 200 4V, it offers enhanced capabilities and a more refined riding experience. It’s a bike built to take on the unknown and is now more refined, beginner-friendly and feels more premium improving its overall appeal. For those of you who don't think this is capable enough, Hero has plans to launch a rally variant sometime in the future. Redesigned rear is fresh and an improvment over the Xpulse 200s All is not gold and this motorcycle has a limited dealer network. Hero has announced that this motorcycle will be available only at their Premia dealerships which currently sit at about 65 across the nation.  A proper mountain goat that is quite friendly to ride This number pales in comparison to Hero's existing dealer network and will make this motorcycle quite inaccessible for the majority out there, at least for the time being. However, for those of you located around a Premia dealership and on the lookout for a well-rounded affordable dual-sport, the Xpulse 210 makes quite a compelling case for itself. Also see: Hero Xpulse 200 4V Pro review: Mountain goat",
    "author": "Gavin Rodrigues",
    "published": "Sat, 22 Mar 2025 11:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250321124245_10.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "5ae42db4-f8b7-4158-a53c-66bd41940c90",
    "title": "BMW iX long term review, 2,500km report",
    "link": "https://www.autocarindia.com/car-long-termer/bmw-ix-long-term-review-2500km-report-434889#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Between our long-term i7 and iX, it was the latter that everyone was after, but I still managed to hang on to the iX for over a month, and what an interesting month it was! Living with a large car as your daily driver in Mumbai is challenging. Every time I couldn’t squeeze through a narrow gap in traffic or find a parking space long enough, I missed having a smaller car. But beyond that, it proved its mettle. When the iX xDrive50 replaced the xDrive40 in BMW’s range, it got air springs as standard. The previous car’s coil springs delivered a superb ride, but the air springs offer an even greater degree of flexibility at both ends of the ride spectrum. The softer end is what I called on most often for tackling Mumbai’s minty-fresh dug-up roads. The ride was very good, and I have to add, without wallow, too, given, of course, the relatively low speeds the chaotic city roads allowed for. The spare tyre in the boot limits space; the parcel screen needs to be removed to stack more bags. The other bit I loved was the powertrain. The xDrive50 saw power go up from 326hp to a massive 523hp, with torque rising from 630Nm to 765Nm. This increase in power has not corroded the powertrain’s modularity, though. Stay away from Sport mode, and the car is quite relaxed to drive; and should you find that miraculous open stretch, power is a quick prod of the accelerator away. During a few long stints stuck in traffic, the comfy cabin was a nice space to be in. My daughter thought the rear seats were spot on for comfort, and my wife thought it was just superb, but I felt the backrest was a tad upright. The glass roof that can switch from translucent to transparent at the press of a button was also a big hit with friends. However, given that it lacks a fabric screen, I would like to see how it performs in keeping the heat out in peak summers. Right now, in Mumbai, we’re enjoying cooler days with lows in the early 20s, and before you Delhi folk laugh, let me assure you that is cool for anyone from here. The crystal-cut iDrive dial looks super, but at certain angles, it dazzles you with reflected sunlight. On to bits I didn’t like, the steering wheel is one. Perhaps it is a small matter, but it never felt right to me. After completing a turn, I like to let the wheel naturally return to the centre, and when it does that, the irregular, hexagonal shape of the wheel feels very odd while running through my palms. Another small irritant is the crystal iDrive dial. It looks lovely, as do other glassy bits like the seat-adjustment buttons, but the dial and the surrounding gloss panel reflect light very harshly at certain angles. Every morning, when headed to work, a particular stretch of road would always have the sun glinting straight at me. Besides these niggles, a bigger matter was the spare tyre in the boot. Picking up my son and his friends at the train station, we had to remove the parcel screen to fit in three large suitcases, and you have to be mindful not to load it above the head restraints. With the parcel screen in place, you’ll be able to fit only one big bag and perhaps a smaller carry-on. Handy mobile holder has a neat slot below, allowing you to pass a wire through to the USBs below. Back to the changes on the iX xDrive50, the biggest one is the larger 111.5kWh battery, up from 76.6kWh – a massive jump. And while I didn’t stretch that range out on a long drive, the benefit was not having to charge it often. In our instrumented real-world range test, we got a range of 504km (city and highway). This meant that with my usage, all within Mumbai city limits, I was charging it every two weeks with an indicated range of about 530km. So, all in all, it’s been a nice, comfy and easy-on-the-pocket month spent with the iX. I never thought I’d say that of a BMW. Given the handy spaces all around, the glovebox is oddly small and impractical to use. Also see: BMW iX xDrive50 review: More power, more range, more features BMW iX facelift revealed with more power, improved range New BMW iX3 design previewed by Neue Klasse X prototype",
    "author": "Sergius Barretto",
    "published": "Sun, 23 Mar 2025 08:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250320120030_BMW_iX_long_term_review_rear_static.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "dcbe7452-9237-43ab-84cb-fccbc18b2dc7",
    "title": "2025 BMW X3 review: The most complete X3 yet",
    "link": "https://www.autocarindia.com/car-reviews/2025-bmw-x3-review-the-most-complete-x3-yet-434904#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Over three generations, the BMW X3 cemented its reputation as the most fun to drive among the midsize luxury SUVs. This fourth-generation model changes tack by putting the focus on comfort. More chill, slightly less thrill, if you will. That’s not a bad thing because the end result is the most rounded X3 yet and one that should be of great interest to buyers in India. 2025 BMW X3 exterior design Styling is not as polarising as past few BMWs Unlike the latest lot of Bimmers that seem styled to polarise, the new X3 will find readier acceptance from many quarters. There’s a link to older X3s in the long bonnet stance and upward sweep of the glasshouse, but the tight skinning devoid of too many cuts and creases is new-age BMW. The X3 looks well-defined and muscular without relying on overt cues to establish it as such. Illuminated grille is standard on new X3 Not to say that the X3 doesn’t have its shouty bits. The iconic kidney grille occupies significant real estate on the nose, and for added effect, it features diagonally arranged bars and glows, too. The LED outline for the grille might seem kitsch, but it does give BMWs an unmistakable light signature. The headlamps, which slickly sweep back with the bonnet line, are also home to cool blue detailing. Notably, India gets the X3 only in the M Sport guise. Edgy detailing for the flush set front bumper, sporty 19-inch rims and a diffuser-like panel at the back do their bit to up the show value. Illuminated surround for kidney grille: a distinctive light signature on new BMWs. The latest X3 positions the rear number plate down on the bumper, a treatment we had seen on the X3’s coupe cousin, the X4, which, interestingly, isn’t due for replacement. Chunky tail-lights that taper as they move inwards (no light bar business here) give the X3 its distinctive tail end, and what will also grab your attention are the roof spoiler and wind deflectors that line the rear windscreen. X3 is longer, wider and taller than Mercedes-Benz GLC and Audi Q5 The latest X3 might not look so, but it has grown a crucial few millimetres in every dimension. It’s now marginally longer, wider and taller than its German compatriots, though the Mercedes-Benz GLC has a slightly longer wheelbase. Under the skin, the X3 continues on BMW’s rear-biased CLAR platform, but the suspension and steering have been redone for enhanced comfort. Also new is the footwear. The latest X3 dumps run-flat tyres for standard tubeless ones. More on this in a bit. 2025 BMW X3 interior Lighting has been used to great effect in the X3. Cabin feels open and airy. The X3’s doors can be locked/unlocked with the standard key, a tap of an NFC card or a transferable ‘digital key’ on your mobile phone. In either case, your first points of contact are the concealed door handles that are good for aero but don’t feel quite as nice to hold as grab-type handles would. You will, however, appreciate how easy the X3 is to get into and the general ambience inside. Yes, there are familiar BMW aggregates, such as the sloping dash and the curved display, but the interior stylists have done well to give the X3’s cabin a flavour of its own. Ambient lighting used to great effect You’ll see the X3’s interior in its best light at night. The ambient lighting package comprises a light bar on the dash, an illuminated surround for the centre console and lit panels on the front doors. The effect is really cool, and what’s also nice is how the lighting is used to communicate warnings and alerts, such as a door opening. Adding distinction to the X3’s cabin is the material of choice for the dashtop and door panels. Made from recycled polyester, it’s a break from traditional materials, but its knitted texture could be a task to keep clean in our dusty conditions. Knitted material on dashboard made from recycled polyester. Interestingly, leather wrapping for the chunky M Sport steering wheel aside, the rest of the cabin is made from manmade materials. While the leather-like upholstery is convincing, many plastics lower down aren’t in line with the X3’s price. Even the island-like panels on the front doors with haptic controllers for side air vent flow and lock/unlock buttons look better than they are to use. Simply put, the cabin is not as opulent as the GLC’s. 2025 BMW X3 features Feature highlights includes largest in segment panoramic glass roof Panoramic glass roof gets full-length mesh cover. Where the X3 goes the distance is its equipment. Headlining the features list is the largest-in-class panoramic glass roof. The vibrant 12.3-inch digital dials come complemented by a nicely executed head-up display, while the 14.9-inch centre touchscreen is also your display for the crisp 360-degree cameras and augmented reality navigation (it only works with the on-board maps). However, as we’ve said before, the centre screen packs in too much content, and the need to rely on the screen for basic functions like blower speed settings is an unnecessary distraction. BMW’s latest OS 9 does allow greater customisation to put frequently used functions as widgets, but it only helps so much. Of the other items, the 750W Harman Kardon sound system is particularly nice. 2025 BMW X3 comfort and space Sporty front seats pack in ventilation and side bolster adjust Front-seat comfort gets a big thumbs up. The seats are well-cushioned and contoured and offer a good degree of fine-tuning with electric lumbar and side-bolstering adjust, as well as manual thigh-support extension.  There’s front-seat ventilation, too. Rear seat is comfy but best for two occupants There’s ample legroom at the back. Seat is comfy, but backrest angle is fixed. Rear-seat passengers, however, will have to contend with fixed seating. The backrest recline is missed, particularly since the seatback feels a touch upright. On the whole, though, the seating position is comfy, with ample thigh support and kneeroom. A fold-down armrest, a dedicated zone for climate control, manual sunblinds, and an iPad mount (available as an accessory) up the experience at the back. Tall occupants will find the headroom just adequate, while the high centre tunnel eats into middle passenger foot space. Spare tyre gets dedicated compartment below luggage area 570-litre boot is well-shaped. Spare tyre now sits in dedicated bay under floor. The X3 offers loads of storage for small items. The open bay at the base of the dash is home to a wireless charger and two cup holders; there’s a handy box between the front seats, and the door pockets are usefully large. You will have to stuff items into the small glove box, though. The space for larger items has seen a big upgrade with this generation of X3. What helps greatly is a dedicated area for the space-saver spare tyre under the boot floor (the last X3 carried its spare within the boot), so you get a well-shaped 570-litre luggage bay. The 40:20:40 split seats give the flexibility to transport oddly shaped items or open up more luggage capacity. 2025 BMW X3 engines and gearboxes Petrol and diesel engines assisted by 48V mild-hybrid systems The diesel engine beats the petrol unit in terms of output. Like the last X3, the new model can be had with a 2.0-litre, four-cylinder turbo-petrol engine or a 2.0-litre four-cylinder turbo-diesel. The thing is, the petrol engine is no longer offered in high-strung 252hp and 350Nm ‘30i’ form but in a milder ‘20’ tune, which brings power and torque down to 190hp and 310Nm. The figures are well shy of what rival petrol models offer, which is a shame. Perhaps BMW is saving the hot X3 M50 with its sonorous straight-six for ardent petrolheads. The 20d diesel featured here is more convincing if you aren’t spooked by the government’s anti-diesel stance, that is. Its 197hp and 400Nm figures are par for the course for this class of SUV, and there’s also the helping hand of a 48V mild-hybrid system that chips in with 11hp and 25Nm under hard load. The other number of interest? 17.6kpl official fuel economy. X3 diesel’s official fuel economy figure is 17.6kpl It’s an engine that’s easy to warm up to. Refinement is particularly impressive, and at average city speeds, you’ll not hear much from the engine bay. Even when pushed, the engine doesn’t sound coarse or strained. Also likeable is the build of power. There’s ready power when you need it and a sustained pull should you find the road to really press down hard on the accelerator. What is missed is that spike in the mid-range, which made BMW’s older diesels particularly exciting. Sadly, that’s the case with all modern diesels calibrated to comply with stringent emission norms. X3 diesel does 0-100kph acceleration run in 7.4 seconds That said, the new X3 diesel’s 7.4 seconds 0-100kph time makes it quicker than the last-gen X3 diesel (8.65 seconds to 100kph) as well as the new Mercedes GLC 220d, which does the 0-100kph dash in 7.8 seconds. The BMW has a slight edge in kickdown acceleration, too. As always, the 8-speed automatic transmission plays its supporting role really well, effortlessly shuffling through the gears depending on your requirements. You really won’t find yourself reaching for the paddles to get the most out of the engine or gearbox. When you do want a quick burst of power, a long pull on the left paddle shifter will engage the Sport mode for 10 seconds. 2025 BMW X3 ride and handling Adaptive suspension is standard fit The diesel engine is very refined even when pushed hard. If there’s one area in which the X3 has taken the biggest stride, it’s ride comfort. The new X3 feels pliant at low speeds, whereas the last one felt jiggly, and while there is some body movement over undulations, ride comfort has improved to the extent it could just be class-best. Adaptive suspension that varies damping force depending on drive conditions is standard, and it also gives drivers the option to toggle between Comfort and Sport settings. Sport mode does tighten things up and helps keep body control in check at faster speeds. Suspension setup aside, a key ingredient in this change of character is the move away from hard sidewall run-flat tyres to more absorbent tubeless ones. The added ‘give’ allows the X3 to do a better job of filtering shocks from the surface below. New X3 switches from run-flats to regular tubeless tyres. The new X3 changes direction smoothly and effortlessly without feeling quite as pointy as its predecessor, 50:50 weight distribution and rear-biased all-wheel drive notwithstanding. There’s good connect at the steering at all times, and the planted feel means you can confidently carry high speeds. Braking power is good, too. Camera and radar-based ADAS features are included The X3 also packs in radar and camera-based ADAS functions. Adaptive cruise control, lane-keep assist and auto braking worked well enough on well-marked roads but are best thought of as an added safety net rather than features to rely completely on.    2025 BMW X3 price and verdict The new X3 range starts at Rs 75.8 lakh (ex-showroom, India) for the petrol, while this diesel comes in at Rs 77.8 lakh. Pricing is at par with the Mercedes GLC, which is currently the midsize luxury SUV to beat. The latest X3 does a lot of things right. It’s got the right look, it’s got the wow elements inside, and it’s rather nice to drive, too. However, it’s the upped comfort levels that really open it up to a wider buyer base. By retaining most of what we’ve liked about X3s thus far and addressing its biggest weaknesses, BMW has come up with an X3 that’s more complete than it ever was. The one to buy? We’ll have to bring the field of rivals to give the answer but the X3 sure is in the fight for the top spot. Also see: New BMW iX3 design previewed by Neue Klasse X prototype New BMW X3 vs rivals: price, specification comparison",
    "author": "Nikhil Bhatia",
    "published": "Fri, 21 Mar 2025 16:21:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250321041105_BMW_X3_Cornering_1_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "5e27d855-2666-45e8-9482-b44b8267f645",
    "title": "You Can Put Diesel Motor Oil In Your Classic Car, But Check This First",
    "link": "https://www.jalopnik.com/1816225/diesel-motor-oil-in-gas-powered-classic-car/",
    "description": "If your classic car has a catalytic converter, you run the risk of ruining said cat with a high-zinc oil",
    "author": "Jason Marker",
    "published": "Sun, 23 Mar 2025 16:25:00 +0000",
    "image": "https://www.jalopnik.com/img/gallery/you-can-put-diesel-motor-oil-in-your-classic-car-but-check-this-first/l-intro-1742577809.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "Jalopnik Explains",
      "Wrenching"
    ]
  },
  {
    "id": "a63bdc40-fbf7-42ca-a034-eb1ae583c4fe",
    "title": "Here's What Can Happen If You Use The Wrong Transmission Fluid",
    "link": "https://www.jalopnik.com/1815609/transmission-fluid-wrong-type-what-happens/",
    "description": "Mixing up your transmission fluids is bad news, and the symptoms mimic those of a dying transmission",
    "author": "Jason Marker",
    "published": "Sun, 23 Mar 2025 15:25:00 +0000",
    "image": "https://www.jalopnik.com/img/gallery/heres-what-can-happen-if-you-use-the-wrong-transmission-fluid/l-intro-1742492705.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "Jalopnik Explains",
      "Wrenching"
    ]
  },
  {
    "id": "f0a01f4c-716f-4fde-8ac0-28e9cd28e598",
    "title": "2025 Aston Martin Vanquish launched at Rs 8.85 crore",
    "link": "https://www.autocarindia.com/car-news/2025-aston-martin-vanquish-launched-at-rs-885-crore-434888#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "The third-gen Aston Martin Vanquish has been launched in India with prices starting at Rs 8.85 crore, ex-showroom, before options. The new Aston Martin GT gets comprehensive updates both inside and out, and boasts the highest top speed of any series production car in the brand's history. Vanquish is Aston Martin’s flagship offering Replaces the DBS Superleggera Rivals the Ferrari 12Cilindri 2025 Aston Martin Vanquish engine specs 2025 Vanquish’s V12 engine has redesigned cylinder heads and new intake and exhaust ports. 345kph top speed A 5.2-litre twin-turbo V12 engine powers the Vanquish and, interestingly, it's not paired to a hybrid system. With 835hp and 1,000Nm (highest for the nameplate) and an 8-speed transmission sending power to the rear, 0-100kph takes 3.3 seconds and the top speed of the new Aston Martin is 345kph. Check out the table below for a performance comparison between the new model and the DBS Superleggera Aston Martin VANQUISH VS DBS Superleggera ENGINE SPECS ComparisonVanquishDBS SuperleggeraEngine5.2-litre twin-turbocharged V125.2-litre twin-turbocharged V12Power835hp725hpTorque1000Nm900Nm0-100kph3.3 seconds3.4Top speed345kph339kph 2025 Aston Martin Vanquish design All-new front bumper, fender and grille design. The signature vaned grille has grown in size and feeds more air to the V12. Additionally, two fin-shaped bonnet scoops help in channelling the air. As for the illumination bits, the front boasts of  Vantage-like sweptback LED headlights, while the rear ones form a unique pattern. The latest Vanquish Grand Tourer retains its two-door coupe silhouette; however, it is longer now as the distance between the A-pillar and the front wheel has been extended. The carbon-fibre side strake on the fenders has also become larger and blends well with the doors and the new 21-inch forged wheels wear bespoke Pirelli tyres. That being said, the bulky rear wheel arch and the sloping roofline look are similar to the second-generation Vanquish. 'Shield' with the Aston Martin lettering. The Vanquish features quad exhaust tips and an aggressive-looking diffuser with central and outer blades for stability at high speeds. With the new car, Aston Martin has also added a width-wide ‘Shield’ panel, which bridges the tail-lights and can be had in either body colour, gloss black or carbon-fibre finish. 2025 Aston Martin Vanquish interior and features Physical switches and buttons are retained. Compared to the previous model, the two-seater’s interior has been completely redesigned and looks similar to the current crop of Aston Martins. Its 10.25-inch touchscreen gets Apple CarPlay (wireless) and Android Auto (wired), and a similar-sized driver’s display runs on Aston Martin’s new software stack. What has not changed are the physical controls for audio and climate control, as well as the gearbox’s manual mode button.  Most of the cabin is finished in Alcantara and the seats feature a new quilted design. The Vanquish also offers a fixed glass roof (for the first time) but buyers can opt for a carbon fibre one too. A 1,170-watt, 15-speaker Bowers and Wilkins sound system is also offered. Also, see: New Aston Martin Vanquish revealed as 835hp V12 flagship Ferrari 12Cilindri India price starts at Rs 8.5 crore",
    "author": "Uday Singh",
    "published": "Sat, 22 Mar 2025 13:44:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250322075536_Aston_Martin_Vanquish _1_.png",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "52c34f64-55b7-4c3c-95b2-c3bf3663b1d1",
    "title": "Royal Enfield 650 twin based one-off vintage bike revealed",
    "link": "https://www.autocarindia.com/bike-news/royal-enfield-650-twin-based-one-off-vintage-bike-revealed-434910#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Royal Enfield Project Delta is a union of vintage design with modern engineering. The brand has teamed up with ‘Purpose Built Moto’ to create a custom Super Meteor 650 inspired by the 1940s-50s era of motorcycling as well as the Super Meteor 700 and the Flying Flea from World War II. Royal Enfield Project Delta features a hardtail-style frame This prototype features hand-shifted gears and solid-mounted bars. It features modern 650cc parallel twin with 1940s styling Project Delta Super Meteor 650 based one-off vintage motorcycle Project Delta is a reimagining of the Royal Enfield Super Meteor 650, drawing inspiration from the vintage motorcycling era of the 1940s and 1950s. This custom build by ‘Purpose Built Moto’ showcases a fusion of modern engineering and classic aesthetics. The motorcycle’s frame has been extensively modified to echo vintage hardtail styling, while incorporating modern updates such as an in-frame oil cooler and a monoshock conversion. The handcrafted girder fork and spoked wheels, 23-inch front and 19-inch rear contribute to the period-correct look. The brand claims that the slim peanut tank takes inspiration from the 1952 Super Meteor 700. The hand-shifted gears, solid-mounted bars, and girder fork are a hark back to the bikes of the 1940s. Project Delta features a bespoke paintwork of black, gold, and cherry red that is Art Nouveau-inspired. The Project Delta is a modern day iteration of a pre-world war II bike hence, it features the same 648cc, air and oil cooled, parallel twin motor producing 47hp and 52Nm.  Even though Project Delta looks like a great collector’s piece, It’s a prototype and will not see the light of day ever. Although it’s interesting to see manufacturers go the extra mile with special prototypes. Also see: Royal Enfield sets up Flying Flea brand for EVs",
    "author": "Autocar India News Desk",
    "published": "Sat, 22 Mar 2025 07:00:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20250321062512_Project Delta Side profile_1_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "3de69677-fb20-467f-82fa-b211cd6ff115",
    "title": "Six-Pack of Porsche 911s Is up for Auction",
    "link": "https://www.caranddriver.com/news/a64261706/six-pack-of-porsche-911s-is-up-for-auction/",
    "description": "Bulk buying can be fun. At an upcoming auction, RM Sotheby's proposes a set of six 991.2-generation 911s, mostly GT3s.",
    "author": "",
    "published": "Sun, 23 Mar 2025 18:00:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "ff3aaa62-3400-4e3e-b28f-63130b50a09d",
    "title": "2000 Toyota WiLL Vi on Bring a Trailer Has All the Weirdness",
    "link": "https://www.caranddriver.com/news/a64246021/2000-toyota-will-vi-bring-a-trailer-auction/",
    "description": "The Japan-market subcompact was a play for Gen Z.",
    "author": "",
    "published": "Sun, 23 Mar 2025 15:00:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "506fbb92-74de-4a5c-913f-a6242ea87a80",
    "title": "Kei \u0026 Mighty: Exploring Japan’s WAZUKA Microcar Museum",
    "link": "https://www.speedhunters.com/2025/03/exploring-japans-wazuka-microcar-museum/",
    "description": "That might sound like a lot, but it manages some 82 million vehicles in some of the world’s most densely populated cities daily. As a country, it should be at a perpetual standstill. Yet, ever since the 1950s, the Japanese have held a tiny little ace up their sleeves… Kei-jidõsha, or ‘kei car’ as it’s […] The post Kei \u0026 Mighty: Exploring Japan’s WAZUKA Microcar Museum appeared first on Speedhunters.",
    "author": "Mark Riccioni",
    "published": "Fri, 14 Mar 2025 16:00:13 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "BUBU",
      "BUBU Shuttle-50",
      "Collection",
      "japan",
      "Kei",
      "Kei-car",
      "micro car",
      "microcar",
      "Museum",
      "WAZUKA Microcar Museum"
    ]
  },
  {
    "id": "f985b085-fa94-4ae4-a0f5-bded916ab10d",
    "title": "10-Year Throwback: For The Love Of Rotary",
    "link": "https://www.speedhunters.com/2025/03/10-year-throwback-for-the-love-of-rotary/",
    "description": "But finally, after the stars recently aligned, I managed to get the cool guys at Car Shop Glow (CSG) to bring their time attacking Mazda to a quiet location away from the hustle and bustle of Tokyo’s daily chaos. I can remember the first time I laid eyes on this RX-7 – it was probably […] The post 10-Year Throwback: For The Love Of Rotary appeared first on Speedhunters.",
    "author": "TheSpeedhunters",
    "published": "Thu, 13 Mar 2025 16:00:00 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Car Features",
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "13b",
      "Car Shop Glow",
      "CSG",
      "FD3S",
      "japan",
      "mazda",
      "Rotary",
      "rx-7",
      "rx7",
      "Throwback",
      "time-attack",
      "Zest Racing"
    ]
  },
  {
    "id": "5b80fbec-aff0-456d-9683-e575a44c37bb",
    "title": "QOTD: What Do You Look For In A Family Car?",
    "link": "https://www.thetruthaboutcars.com/cars/question-of-the-day/qotd-what-do-you-look-for-in-a-family-car-44512831?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Today's podcast was all about family cars . I want to ask you, the car shopper, what do you look for in a family vehicle?",
    "author": "Tim Healey",
    "published": "Fri, 21 Mar 2025 22:06:22 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/03/21/18041/qotd-what-do-you-look-for-in-a-family-car.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Question of the Day"
    ]
  },
  {
    "id": "5c97f301-fb02-40fb-a6d7-5325d65e0493",
    "title": "These Are the 2025 Best Cars for Families",
    "link": "https://www.thetruthaboutcars.com/cars/podcasts/these-are-the-2025-best-cars-for-families-44512825?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "For this week's podcast, we're talking about family cars. Maybe you've even shopped for one of these .",
    "author": "Tim Healey",
    "published": "Fri, 21 Mar 2025 21:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/03/21/16461/these-are-the-2025-best-cars-for-families.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Podcasts"
    ]
  },
  {
    "id": "b7ecf161-16c7-430b-a701-a9ac60ff94ff",
    "title": "Daytona Vice",
    "link": "",
    "description": "If you replace every trim piece, every nut and bolt of a car, is it still the same car? This concept, (but swap car parts for nails, shiplap, and strakes) was first explored by the ancient Greek philosopher Plutarch, who opined on what became known as the Ship of Theseus paradox. In ancient writings he described how the Athenians preserved Theseus' ship by replacing its sacred wooden bits piece by piece, keeping it afloat perpetually. Theseus himself was a hero who valiantly and selflessly slew a Minotaur and navigated a twisting Labyrinth to save his people. His ship was not just a vessel, it was a symbol of triumph, endurance, and Athenian moxy. As its planks aged and were replaced, the Athenians were not merely maintaining a ship, they were keeping Theseus' legacy alive. And so the ages old debate began: if every part is replaced, does the identity remain? The question has lingered for centuries, not because it demands an answer, but because there isn’t one. The Athenians didn’t preserve Theseus’ ship because it was just a vibey cool looking boat. They preserved it because it meant something, because it was a vessel for a story too important to be lost. Theseus had moved beyond his life into folklore legend. For an automotive enthusiast, the Ferrari Daytona carries that same weight. It's one of our legends. For some, it is akin to an automotive sacred cow.  Either way, its fair to say that everyone can admit it is more than just another Ferrari. It is a machine born from victory and rebellion. It’s from an era of excess, flair, and audacity that would never come again. To erase imperfections, as we often do when things are over-restored beyond what they ever were, often means we erase the proof that the car had ever lived its own story. Machines, when used, aren’t just a sum of their parts. They carry history, wear, and the quiet fingerprints of every mile traveled. A Ferrari Daytona Spyder, already steeped in myth, should feel like a portal back to the moment it first rolled onto the streets. But what happens when every inch of it is refreshed, repainted, and reimagined?  That’s the battle at the heart of Camillo Mekacher-Vogel’s Ferrari Daytona Spyder. A Fly Yellow, one of one European spec Daytona, delivered new to a royal family in the Middle East before vanishing into obscurity. When it resurfaced decades later, its fate teetered on a knife’s edge. The easy path, the one so many owners take, would have been a flawless by the book restoration. Every imperfection erased, every part refreshed to be better than new. But Camillo saw something else. This car didn’t need to be perfect. It needed to be real. So began the fool’s errand against the inevitable, time, a fight not to restore but to preserve. \"We really wanted to maintain every possible original component,\" Camillo explained. \"Even the smallest details, like the original dashboard, are becoming increasingly rare in a world where everything gets over-restored.\" The safe option would have been just to replace any original component that was slightly blemished, but we wanted to keep the car as honest as possible. The judges at Cavallino understood that.\" The battle lines were clear. The engine bay, instead of being refinished into a glossy, factory fresh display, was carefully cleaned piece by piece. If someone in fifty years wants to know what an original Ferrari engine looked like, there will be very few left to show them. The dashboard, typically one of the first casualties in a restoration, remained intact, with every fragile, factory flaw left untouched. And where others would have swapped out components for pristine replacements, Camillo and team chose the harder road, keeping what was there, even if it wasn’t perfect. The car’s revival took months of careful work, bouncing between continents, its original wheels flying back and forth across the Atlantic to be properly restored in Italy, while Camillo flew between Milan and Wisconsin, where Motion Products carefully pieced the Daytona back together. Time was against them. The plan was to unveil the car at Cavallino Classic, the most prestigious Ferrari concours in the world. \"We immediately had this dream of presenting it at Cavallino,\" Camillo recalled, \"but at the same time, you have to respect an event like that and do your very best to present the car properly. We knew it was a risk, but we also knew it was the right thing to do.\" Would they understand the point? Would they see the car not as flawed, but as honest? \"\"People went wild over it,\" Camillo recalled. \"The fact that this car had been used, had been driven, had lived, it made it stand out even more among all the flawless restorations. It was a labor of love. We had the right people, the right vision, and the right car. Seeing it recognized that way, after all the effort we put into keeping it real, that was everything.\" Camillo Mekacher-Vogel’s Daytona didn’t just win. It dominated. Platinum Award, the concours equivalent of a heavyweight belt. The highest honor, certifying its authenticity and excellence. Best in Class for Ferrari Spiders. Beating flawless, fully restored examples. Gentlemen’s Choice, meaning some well dressed guys with no socks just really really liked it. A win not by technicality, but by sheer presence. The noble fight had been validated. It was never about winning outright. It was about taking a swing, about proving that some things are worth the fight even if you know time is waiting in the shadows. Every car, no matter how well kept, will need something replaced. Bolts tarnish. Leather cracks. Gas tanks rust from the inside out. But that is not death. That is maintenance. It's the cost of use. If we're passionate enough about something, as human beings we are in a unique position to be able see, and fight the entropic fade of everything we create.    But... maybe the real takeaway is that the Daytona, like any great car, isn't just valuable because of what it is, but because of what it represents. A defiance of time. Whether it is a multi million dollar Daytona or a beat up wagon on a road trip with your daughter, the real worth of a car is in the stories it collects, the people it carries, the roads it has seen, and the moments it endures. If you drink a bottle of great wine, you’ll enjoy it, but it fades into memory. (especially if you drink the whole bottle) A car, if kept alive, does more than just exist. It becomes a time machine, a vessel for memory, holding onto the stories, the people, and the moments that made it matter. Continue...",
    "author": "",
    "published": "Fri, 21 Mar 2025 11:01:36 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2025/03/20184020/Petrolicious-DaytonaVice-7.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "d1dae029-782b-4bcc-9ed9-b2e3642f58e2",
    "title": "Ferdi Porsche on F.A.T., Porsche, and Finding the next F1 Phenom",
    "link": "",
    "description": "http://youtube.com/watch?v=7SaiVW3QfZc Photography: Rosario Liberti  In the early 1950s, a group of thrill-seekers in Zell am See, Austria, transformed their frozen lake into a playground of horsepower and daring. The inaugural Professor Ferdinand Porsche Memorial Race in 1952 saw skiers clinging to motorcycles, skijoring at breakneck speeds over the ice. This audacious blend of motorsport and winter sport marked the birth of a tradition that would see Porsche 356s and 550 Spyders sliding gracefully across the glistening surface, captivating thousands of spectators annually. The races continued until 1974, when a tragic accident halted the event, casting a shadow over the icy spectacle. Fast forward to 2019, and the frozen silence was broken by the roar of engines once more. Ferdi Porsche, great-grandson of the legendary Ferdinand Porsche, alongside his college friend Vinzenz Greger, resurrected the ice race, rebranding it under the F.A.T. International banner. This revival not only honored the legacy of the original races but also injected a modern flair, attracting a new generation of motorsport enthusiasts to the icy tracks of Zell am See. ​ To explore the history, evolution, and future of the F.A.T. Ice Race, as well as its impact on the automotive world, we sat down with Ferdi Porsche. In this conversation, he shares insights on reviving the event, Porsche’s enduring family spirit, the role of design in his vision, and his thoughts on the next generation of motorsport talent. Ferdi on F.A.T. and its Future Petrolicious:  Tell us a little bit about the FAT Ice race, and why its back? Ferdi Porsche: The ice race started in Selamsee in the 50s, and I honestly think it was an enthusiast event or race, basically. I think they saw that they had a frozen lake and decided to drive some cars around.  I found out about it because my dad bought a car that used to race on the frozen lake and it came with the spike tires and it still had the super long studs in there and I asked him what what it was because it was kind of forgotten already, the ice racing. I had the idea of bringing it back when I was in my architecture studies.  I was looking for something fun to do by the side and so this came at a perfect time. In 2019, we had the first ice race in Zell again. Then we did it twice before COVID. And when COVID hit, I was thinking, Okay, how do I, how do I take this to the next level? And how do I expand it from just one event? And that's when I found F.A.T. International and decided to revive the brand. Petrolicious: What does F.A.T. Stand for? F.A.T. used to stand for Francais Allemand Transit. It was a French German logistics company. And now it just stands for FAT It just literally describes the energy and the vibe of everything that we do basically. Funnily enough the first ice race kind of introduced that without the brand FAT being there. Petrolicious: What are the stars of this years F.A.T. Race? Ferdi: The stars of the show of the 25 Ice Race are probably the F.A.T. cars. Since F.A.T. was a sponsor in the 80s, 90s, and early 2000s for all the great cars, Ferraris, Porsches, Mercedes, everything, they naturally take center stage. We brought this tradition back and are now sponsoring cars again. We have the 963 that raced at Le Mans last year here. Sadly, it is not driving because it is not high up enough, but we also have the Dakar cars, the ones that work better on the ice. We have a bunch of WRC cars, so we really have an amazing array of cars this year. That was always the idea of Ice Race, being open to any brand and any manufacturer. I think this year we have 22 different car brands in the race. Petrolicious: What is your favorite Porsche model on the ice this year? Ferdi: That's a difficult question. There's so many different, there's so many cool Porsches that I can't really decide for one. It changes over time. Sometimes I'm more towards the super old stuff, 550s obviously, also because of the history and the connection to ice racing. But obviously I love the Dakar, a sick car, and just the vibe also matches that somehow. It's hard to decide. Petrolicious: What are your long term plans for F.A.T. Ferdi: With F.A.T., we do a bunch of things. We're a young team, and the idea is to do stuff that we like, stuff that we enjoy, because we believe that when we like it, other people will like it too. Obviously, we have the event side of things. Last year, we brought it to Aspen, and I’m looking at where I can bring it next apart from Zell. But we're also looking into the summer. We have our \"Hot on Top\" at Großglockner with Mankei, where we do car meets every month during the summer. The idea is to do stuff that we think is fun. So you can expect F.A.T. to be all around the world many times. Petrolicious: So not just ice? Ferdi: I think F.A.T. works on every terrain. Basically, it got famous through Le Mans. Proper racing on tarmac is where it was kind of born, and it's still happening today with the 963 that we have in Le Mans, but also with the karting league for the kids. So F.A.T. works on every terrain, but its spirit is kind of born from ice racing because it's somewhat more about fun than speed. Petrolicious: As an Architect, how does your design sensibilities influence what you do? Ferdi: I think studying architecture kind of gives you a great opportunity to look at a blank piece of paper and then come up with stuff. So I think that obviously plays into F.A.T. I know what I can and what I can't do. I'm not a graphic designer, but I like paying attention to all of that stuff. And I think the devil and the beauty is in the detail. So that's why everything that we do with F.A.T. is always very detail focused. Obviously, it's sometimes festival and wild, and you can never fully plan an event that happens on a frozen airfield. Everything just is a bit wabi-sabi sometimes, but I think that's also kind of the beauty of it. Petrolicious: Where do you place yourself in within Porsche today? Are you involved with the brand at all in decision making? Ferdi: I think Porsche still has this kind of family business vibe, even though it's obviously a big company now. We build a lot of cars these days, and so many people work for Porsche, but it still has this energy of being a family brand. Obviously, I have a lot of love for the brand and want to see it thrive. Whenever I can give my two cents on something, I do, but I'm not involved in the day-to-day business. Petrolicious: What advice would you give to a young person with limited resources who wants to get into ice racing or racing in general? Ferdi: It depends on how young you are, but I think you should start in the F.A.T. Karting League. It’s the most meritocratic and a cheaper way to get into racing without losing any of the skill-building opportunities. I would advise any young person to start there and see if they have talent. From there, you can work your way through our completely meritocratic system and fight your way into F4 with us. And if you're looking to buy a car, I think what's cool about the car world is that it's very open. It doesn’t really matter if you buy a $20,000 car, a $10,000 car, if you have no car at all, or a $10 million car. In the end, everybody sits together, has a burger, and is the same because they all share the same passion for cars. Petrolicious: Please tell us more about the karting school. Ferdi: Coming from what we do with F.A.T. and the energy we wanted to bring, it was inspired by all the car events I went to as a kid, many of which felt somewhat stuck up and catered to an older crowd. I wanted to do something a bit more rebellious in that space. When I met [Renowned Formula 1 engineer] Rob Smedley and heard about the karting league and what he has done, building these karts that try to change the whole system by making it more approachable for everybody, it felt like the perfect match. That is why we teamed up and are now bringing it to the whole world. This year, we are bringing it to the U.S. for the first time. In the coming years, we are expanding to Asia and the Middle East. The goal is really to create a platform for everybody to start racing. Obviously, it still comes at a certain price, so it is not yet for everybody, but that is how democratization works. You start at some point and then you try to push it down and down. Petrolicious: So you're on the hunt for a Formula 1 driver then? Ferdi: Yes, we're looking for the first female F1 driver. Petrolicious: Mind if I give you a few rapid fire this or that questions? Ferdi: Lets do it. Petrolicious: Lewis at Ferrari or Mercedes?Ferdi: Lewis at Mercedes. Petrolicious: Stuttgart or Maranello?Ferdi: Stuttgart. Petrolicious: Racing in the desert or racing on the ice?Ferdi: Racing on the ice. Petrolicious: 962 or 917?Ferdi: 962. Petrolicious: Turbo or naturally aspirated?Ferdi: Naturally aspirated. Petrolicious: ST or GT3 Touring?Ferdi: ST. Petrolicious: Gravel or tarmac?Ferdi: Gravel. Many thanks to Ferdi Porsche for sitting down with us for a chat. We'll follow up soon on the noble efforts at F.A.T. Karting with a full story. Continue...",
    "author": "",
    "published": "Wed, 19 Mar 2025 11:00:13 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2025/03/18114307/IMGL3350-Edit.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "a768f986-e289-4024-9f64-e999bca3010b",
    "title": "Chery New Journeo Concept",
    "link": "https://www.carbodydesign.com/2025/03/chery-new-journeo-concept/",
    "description": "The Chery New Journeo Concept is a futuristic multi-purpose vehicle developed at the Chery Advanced Design Center Europe in Raunheim, Germany and presented at the 2024 Guangzhou Motor Show.",
    "author": "Car Body Design",
    "published": "Tue, 04 Mar 2025 14:25:20 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/Chery-New-Journeo-Fulwin-Jinyun-SMPV-Concept-Design-Sketch-Render-13-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Concept Cars",
      "Cover Stories",
      "Chery",
      "Chery New Journeo Concept"
    ]
  },
  {
    "id": "da1f337a-149e-4ff1-b489-3a29e7c5ac07",
    "title": "MG announces MGS5 new EV SUV",
    "link": "https://www.carbodydesign.com/2025/03/mg-announces-mgs5-new-ev-suv/",
    "description": "MG Motor UK has confirmed the MGS5 EV, an all-electric SUV debuting this Spring. Built on the modular scalable platform (MSP), it will focus on performance, efficiency, and interior space.",
    "author": "Car Body Design",
    "published": "Mon, 03 Mar 2025 17:26:28 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/MG-MGS5-EV-SUV-Preview-01-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Production Cars",
      "MG"
    ]
  }
]
