[
  {
    "id": "90199b63-b4f6-4a93-bc7f-00f16379025d",
    "title": "BaT Auctions Presents: Prewar Favorites from the McMullen Collection",
    "link": "https://bringatrailer.com/2024/11/25/bat-auctions-presents-prewar-favorites-from-the-mcmullen-collection/",
    "description": "This exciting group of seven prewar vehicles comes to us from the collection of the late John McMullen. McMullen, who passed earlier this year at the age of 96, was an avid collector of American classics, and focused heavily on the prewar era. At its peak, his collection numbered over 140 cars and filled several buildings on his Michigan property. Through the 2000s, the collection was whittled down to a small group of cherished vehicles, from which this group comes. Selling dealer plasticdr is representing the cars on offer, which range from staples like a Model T \"doctor's coupe\" to more obscure and specialized specimens such as a 1920 Millburn Electric and an Ahrens-Fox M-X-4 fire truck.",
    "author": "bringatrailer",
    "published": "Tue, 26 Nov 2024 00:55:39 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/12/TLD_9147-71491-scaled-e1732571525480.jpg?fit=940%2C626",
    "source": "https://bringatrailer.com/feed/",
    "categories": [
      "American",
      "Collections",
      "Prewar"
    ]
  },
  {
    "id": "85b71f43-4d90-4f9f-9a1b-9ef2324e9e38",
    "title": "45-Years-Family-Owned 1951 Allard J2 w/Ardun V8 Display",
    "link": "https://bringatrailer.com/listing/1951-allard-j2-4/",
    "description": "This right-hand-drive 1951 Allard J2 was delivered new to New Zealand with special instructions that it was required for race car driver George Smith, who would campaign the car in the early 1950s. It would then be owned by private individuals and held in various collections before it was acquired by the seller’s father in 1979 as an incomplete project. A subsequent refurbishment circa 1980 involved repairing and repainting the alloy bodywork, re-trimming the seats in gray cloth, and installing a 331ci Cadillac V8 equipped with a triple-carburetor setup. The car was then campaigned in vintage racing events in the US, Australia, and New Zealand, and a Toyota-sourced five-speed manual transmission was installed following an accident in the 2000s. Equipment includes a louvered hood, a luggage rack, driving lights, 15” wire wheels, a de Dion rear end, and four-wheel disc brakes with inboard-mounted rears as well as a removable roll bar, soft top, and side skirts. A non-running Ford flathead V8 equipped with Ardun overhead-valve cylinder heads is included in the sale. This Allard J2 and display engine are now offered in New Zealand by the seller on behalf of the owner with a 2006 FIA Historic Vehicle Identity Form certificate, a SOVREN registration form, historical documents, magazines featuring the car, a tonneau cover, an aero screen, and New Zealand registration.",
    "author": "bringatrailer",
    "published": "Tue, 26 Nov 2024 00:20:12 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2024/11/1951_allard_j2_img_7855-91946.jpg?fit=940%2C627",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "b1942634-c1f8-4582-ad53-4062caa0e17f",
    "title": "Royal Enfield Goan Classic 350 video review",
    "link": "https://www.autocarindia.com/bike-video-reviews/royal-enfield-goan-classic-350-video-review-433615#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Also see: RE Goan Classic 350 review: More than just a dressed-up Classic",
    "author": "Dinshaw Magol",
    "published": "Sat, 23 Nov 2024 21:08:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241123090840_1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "87d01c3a-cd15-4dba-a55b-d3eaec3025f6",
    "title": "RE Goan Classic 350 review: More than just a dressed-up Classic",
    "link": "https://www.autocarindia.com/bike-reviews/re-goan-classic-350-review-more-than-just-a-dressed-up-classic-433630#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Someone wise recently told me: “A watch tells more than time.” Essentially, this means your watch is an extension of yourself, and different watches fit different people's personas. That saying is actually quite fitting for this bike – the gorgeous Royal Enfield Goan Classic 350. It isn't too different from the Classic 350, but it's targeted at a rather different rider – someone who wants to be unique but doesn't want the compromises that come with this style of bike. RE Goan Classic 350: Design, changes to Classic Design is one of the foremost ways the Goan Classic differs from the standard Classic. Starting at the front, you've got these very retro-looking whitewall tyres, which are found only on a microscopic amount of bikes available on sale today. While the tyres have a retro look, a welcome surprise is that the Goan Classic runs cross-spoke laced wheels, which permit tubeless tyres. The tyres are CEAT’s new Zoom Classic rubber, developed specifically for the Goan Classic. While the front wheel is a 19-incher, like the bike it is based on, the rear wheel is a 16-incher in proper bobber fashion. Then, the Goan Classic trades the Classic's handlebar for tall ape-hanger bars that put your arms almost straight and in line with your shoulders. It also has more forward-set pegs from the Meteor 350, and together, these changes put you in a properly relaxed riding position. The Goan Classic is also the only RE 350 to get the metal switch cubes from the larger 650s. Even the exhaust muffler is new and has a bit of a raspy note to it. You also have a cantilevered rider's seat, which is just 750mm off the ground, making it the second-lowest seat on any Royal Enfield today, after the Super Meteor 650. But my favourite design element is this articulated rear fender that moves with the wheel. The logos and badging on this bike also align with the retro custom aesthetic and add that little bit of extra pizzazz to its design. The Goan Classic’s colour palette is very funky and out there, and those who like to make a statement with their bikes will like the paint options. There are four colours to choose from, but my favourite has to be the Trip Teal (nice naming, RE!). RE Goan Classic 350: Ride and handling, comfort So, how do all these changes affect the riding experience? The short answer is, not much. The Goan Classic feels very similar to the Classic 350, which is a very pleasant feeling, with the only difference being how you're seated. The tall ape hangers work rather well when you're riding, and there's no strain on your arms or shoulders. After a brief accustomization period, I found my rhythm, and I suspect it will be the same for most others. The only small caveat here is that while making a tight U-turn, you need to plan your movements correctly and be a little more mindful of the tall bars. And because of how you're seated on the bike, you'll also bear the brunt of bad roads a little more than the Classic. That said, the Goan Classic is nowhere as uncomfortable as its competitors from Classic Legends. Honestly, aside from the different riding positions, the rest of the riding experience is pretty much identical to the Classic 350. This means it's the same relaxed, comfortable, and smooth yet torquey bike we've come to know and loved over the years. RE Goan Classic: Verdict All in all, the Goan Classic 350 feels like a cut above the rest of the 350s in terms of fit and finish, quality, and uniqueness. This will also be reflected in its price, as it is the most expensive 350cc Royal Enfield. Prices start at Rs 2.35 lakh (ex-showroom, Chennai) and go up to Rs 2.38 lakh (ex-showroom, Chennai), making it Rs 5,000 - Rs 8,000 more expensive than the top Emerald Chrome Classic 350. With the Goan Classic, you're getting a very unique-looking thing with proven fundamentals, a custom bike straight from RE. So, if you're one of the few people who use their watch not just to tell the time but to make a statement, I think the Goan Classic will be right up your alley. Also see: Royal Enfield Goan Classic 350 video review Royal Enfield Goan Classic 350 walkaround video Brixton Cromwell 1200 quick ride: Most affordable 1200cc motorcycle",
    "author": "Dinshaw Magol",
    "published": "Fri, 22 Nov 2024 20:35:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241123022833_1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "67dab560-baf0-42bd-b3be-507bf7e353f8",
    "title": "Which states have the best—and worst—roads in the United States?",
    "link": "https://www.autoblog.com/news/which-states-have-the-best-and-worst-roads-in-the-united-states",
    "description": "U.S. road quality isn’t what it once was, but that can vary drastically from state to state. We crunched the numbers to see how they compare.",
    "author": "Elijah Nicholson-Messmer",
    "published": "Mon, 25 Nov 2024 23:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEwODg1NTMwNTM4MjIzNDQx/indiana-to-land-88-billion-from-infrastructure-bill.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "News",
      "roads"
    ]
  },
  {
    "id": "c3414bb3-a533-46b5-add9-ae86bdb49d92",
    "title": "Ram’s first electric truck delayed until 2025",
    "link": "https://www.autoblog.com/news/rams-first-electric-truck-delayed-until-2025",
    "description": "Stellantis claims the all-electric Ram 1500 REV will outperform every other full-size truck, but now the EV has been delayed to the first half of 2025.",
    "author": "Joseph Pudlewski",
    "published": "Mon, 25 Nov 2024 22:00:21 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjEwOTQ1NTc5MjgxNDI2NDA5/2025-ram-rev-1500.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Dodge",
      "Ram 1500 REV",
      "1500 REV",
      "News",
      "2025",
      "Ram"
    ]
  },
  {
    "id": "eb0470a4-3fce-41a6-90f8-03e0b66b1d66",
    "title": "Maserati Grecale video review",
    "link": "https://www.autocarindia.com/car-video-reviews/maserati-grecale-video-review-433661#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also See: Lotus Emira India video review",
    "author": "Nikhil Bhatia",
    "published": "Mon, 25 Nov 2024 18:47:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241125064647_Untitled design _69_.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "fb23f2a7-fc40-4203-bc52-40c40b0b2940",
    "title": "Thar Roxx vs Jimny vs Gurkha 5 door comparison",
    "link": "https://www.autocarindia.com/car-comparison-reviews/mahindra-thar-roxx-vs-maruti-jimny-vs-force-gurkha-5-door-comparison-433637#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "You may have seen enough of the Mahindra Thar Roxx, Force Gurkha 5-door and Maruti Suzuki Jimny during our Off-road Day feature, so I’ll keep the introductions short. The Thar Roxx is more than just a longer, 5-door version of the Thar because it’s built on a new chassis, packs in more tech and has a few added off-road tricks up its wheel arches, too. Force’s Gurkha 5-door adds length, doors and practicality to the Gurkha 3-door we know and love, and it also debuts a more powerful engine. The plucky Maruti Suzuki Jimny hasn’t changed in any way, shape or form since its launch last year but promises a very different experience to the others. First order of business? To judge the trio for what they are – off-roaders. Thar Roxx vs Jimny vs Gurkha 5 door off road performance  The three tick the off-roader essentials checklist with tough ladder-frame constructions and low range. The Jimny is the only one to use solid axles at both front and rear, promising greater articulation, while the Thar Roxx and Gurkha 5-door use a combo of solid axles at the back and comfort-biased independent front suspensions. The Jimny is the odd one out in terms of footwear, running highway-terrain tyres, while the Thar Roxx and Gurkha come shod with standard-fit all-terrain tyres. An on-paper comparison will tell you that it’s the Thar Roxx with the best approach angle, the Jimny with the best departure angle and the Gurkha with the best ramp breakover angle and water-wading ability. The Roxx is great off-road and feels as able as the Thar 3-door; Off-road info is a cool touch; Rear diff can be locked by button. But what are they really like in the rough? It’s 4-Low and over to our favourite off-road playground – Learn Offroad at Pali, Maharashtra. The Thar Roxx is quick to dismiss any doubts about its off-road ability being compromised by the wheelbase extension versus the three-door Thar’s. The Roxx is doing the same obstacles and with a higher degree of convenience, thanks to its move to an easier-to-twirl electric power steering. It’s the easiest of the three off-roaders to manoeuvre, too, as we learn. Roxx 4x4 with automatic transmissions promises to be even more so thanks to what Mahindra calls ‘Intelli-turn’ that independently brakes the inner wheels to reduce the turning radius on slippery surfaces. The other major upgrade to the Roxx is a button-operated electronic rear differential lock (the Thar uses a mechanical-locking rear diff) that helps prep the Mahindra for an obstacle in advance. It does its job, enabling the Roxx to claw its way out of trouble without any of the mid-obstacle snappiness of the 3-door’s auto-locking unit. A point to note about the Thar Roxx 4x4 manual featured here is that clutch modulation isn’t very smooth. Gurkha is hardcore, but its height and weight can be intimidating; Front and rear diff locks only on Gurkha; Only Gurkha gets shift-on-the-fly 4x4. Next up is the Force Gurkha 5-door. You sit high off the ground, which means great visibility on trails, but the first-floor seating also accentuates side angles and descents, and this can be unnerving. Also, there’s no escaping the sensation that there’s a lot of SUV around you. It exhibits the most weight transfer over articulations, too, but the longer wheelbase does help the Gurkha 5-door feel more grounded than its sibling. Unique to the Gurkha are its front and rear mechanical-locking differentials. With the rear diff locked, the Gurkha finds grip when there’s seemingly little of it, while the front diff lock is your ally in the most extreme situations. But while the diff locks unlock new abilities, they don’t always work. Calling them to action requires a firm pull of the levers, and even then, you’re not quite sure if they’ve engaged. There were also times when we couldn’t unlock the diffs; it’s an irritant in trying conditions when you need your vehicle to be on your side. The Gurkha feels the most mechanical and old-school of the three, and I’m sure everyone will accept that. 4x4 aside, Jimny’s small size and light weight are a boon off-road; H/T tyres are surprisingly good off-road; Jimny gets 4x4 but no diff locks. It’s actually the Jimny with the fewest off-road frills – no off-road modes or differential locks. However, it champions the cause of small and light is right. The Jimny’s size puts you at ease in the rough, and there’s comfort in knowing a helping hand (or two) is enough to get the lightweight Jimny out of a sticky situation. You will have to work the Jimny’s engine the hardest to keep momentum but stick to the right line out, and the plucky Suzuki will scrabble its way through the tricky stuff. On a side note, the Jimny’s manual gearbox needs a firm push, and the clutch isn’t the easiest to modulate. A Jimny with an automatic transmission delivers a far nicer experience.  The learnings at Learn Offroad are that the Jimny is the least intimidating, the Gurkha feels the rawest, and the Roxx strikes a great balance between ability and sophistication. Thar Roxx vs Jimny vs Gurkha 5 door exterior and features Five-door off-roaders they may be but there’s the compact Jimny on one side and the significantly larger Thar Roxx and Gurkha 5-door on the other. The Jimny is the shortest, narrowest and lowest among the three. It rides on small 15-inch wheels and almost looks like a miniature in the company of the other two. It’s not the one to give you an ego boost if that’s what you want from your off-roader. The Roxx is the longest in overall length and wheelbase and looks the business, particularly in top-spec form that has 19-inch rims. That Jeep Wrangler vibe is unmissable, too. Over to the desi G, the Force Gurkha, which, at over two metres tall, looks the most substantial. Its 18-inch rims help balance the shape, while the snorkel, windshield bar, roof rack and rear ladder make it look ever-ready for adventure. Roxx feels most upmarket inside. Opt for mocha upholstery if you intend to go off-roading; Digital dials look snazzy but not user-friendly; Thar Roxx offers the most room for luggage. The three offer very different experiences inside. It’s a climb into the Thar Roxx’s cabin. However, the Roxx immediately impresses with what is the most upmarket interior here. The overall material quality is the best here, and the large touchscreen and digital dials also do their bit to up the ambience inside. The touchscreen is nice to use and packs in off-road data screens, too, but all features weren’t functional on our test car. Also, the menus on the digital dials are cumbersome to navigate. The Thar in top-spec AX7 guise goes the distance with features such as a powered driver’s seat, ventilated front seats, 360-degree camera, wireless phone charger, electronic parking brake, and even ADAS, which I’ll get to in a bit. Seat comfort is fine, and the high driving position gives a good view of the world outside. However, there’s not enough foot room on manual gearbox versions, and the pedal covers also worked themselves loose over our time with the Roxx. Tall Gurkha gives the best view of the outside. Its dash is basic, and the quality is not befitting of a Rs 18 lakh SUV; Digital screen among few frills in the Gurkha; Third row gives flexibility but limits luggage room. You’ll need to trek your way up into the Gurkha’s high-set cabin, but the effort rewards you with a commanding driving position. The front seats will also accommodate the largest of individuals with ease. The Gurkha feels airiest, at least up front, with a sizeable space between the front seats. That said, the Gurkha also feels the most basic inside, and overall fit and finish are a few notches down as compared to its rivals – frankly, it’s not in keeping with the Force’s price tag. Features-wise, the Gurkha packs in a digital instruments cluster and a 9-inch touchscreen that’s big but basic. There’s no auto climate control either. Jimny feels compact inside. Its dash is functional and goes with the off-roader vibe; Orange backlit dials are a link to the Gypsy; You can fit a weekend’s luggage into the Jimny. Access to the Jimny’s front seats is the easiest. The front seats are comfy, but you sit close to your co-driver; it really feels like a small vehicle. And because you don’t sit all that high, you don’t get the same view out as you do in the other off-roaders, though I’d still rate visibility to be good. The dashboard is functional, and the material quality is decent. Maruti’s 9-inch touchscreen is good to use, but the reverse camera could do with more pixels. Thar Roxx vs Jimny vs Gurkha 5 door interior and practicality Now, on to the back seats. The Thar’s rear door handles are vertically oriented, and you will need to use the footboard and hand grips to pull yourself in. Once in, you’ll be more than satisfied with the space and comfort on offer. There’s enough knee room for six-footers, the seat is wide enough to host three passengers, and there’s also the option to adjust the backrest angle. Then, there’s the panoramic sunroof that does its bit to enhance the rear seat experience, particularly on a day of fine weather. Jimny feels the smallest, but its rear seat is adequate for two average-sized adults. The Maruti Jimny sits lowest to the ground, and that helps when getting in, but do note that the rear door aperture isn’t all that big. Unsurprisingly, the Jimny feels the smallest inside and is actually certified only as a four-seater – seating for just two at the back. Even so, larger-framed individuals will be sitting shoulder to shoulder. A pair of average-sized adults will find space adequate, though.  The Gurkha once again calls for the most effort to get into. Once inside, you’ll be a bit surprised because, for a vehicle so large, it’s not all that roomy. The knee room is limited, and it doesn’t help that the seat can’t be slid back to make more space. But the Gurkha has one thing that the other two off-roaders don’t – a third row of seats. It adds seating flexibility but isn’t without compromise. Access to the third row is only via the tailgate, which isn’t easy, and while the front-facing seats are comfy, the wheel well eats into the foot room. The large Gurkha is surprisingly tight on legroom. Getting in requires the most effort, too. Also, fitting luggage in the limited space available blocks access to the third row. There’s a luggage rack on the roof as an alternative, but we’d advise against using it as it’ll only worsen the Gurkha’s top-heavy dynamics. The Jimny’s tailgate swivels open to reveal reasonable luggage room, while the Thar Roxx’s two-part tailgate gives access to the most accommodating luggage area. The Jimny and Thar also give the option to fold the second row to make more space for luggage. Roxx offers the comfiest rear seat; its panoramic sunroof lifts the ambience.   Thar Roxx vs Jimny vs Gurkha 5 door engine and gearbox It’s the Thar Roxx that offers the widest variety of engines and gearboxes. There are petrol and diesel mills, each with manual and auto gearbox options. However, those looking specifically for 4x4 will be restricted to the diesel manual or auto. There’s no petrol 4x4 Roxx, at least for the moment. Featured here is the Roxx diesel 4x4 manual. The Gurkha 5-door is yours in a single diesel-manual avatar, but it runs the latest iteration of Force’s Mercedes-derived 2.6-litre diesel engine, which ups power and torque to 140hp and 320Nm, respectively. The Jimny, on the other hand, is a petrol-only model, though you have the option of a 5-speed manual or a 4-speed torque converter automatic. Jimny’s dull 1.5 petrol engine lacks punch for highway drives. What are they like to drive on the road? Let’s go in the order of engine power. First up, the Jimny, whose 1.5-litre naturally aspirated petrol engine makes a humdrum 105hp and 134Nm. The Maruti manages low-speed urban settings and off-road environments adequately well, but it’s when you take the Jimny out onto the open road that you’ll experience its weakness. It doesn’t have any punch, it’s slow to rev, and when you need to overtake in a hurry, well, you’ll have to either downshift or flatten your foot on the accelerator pedal and wait patiently. The clunky 5-speed manual gearbox doesn’t make frustrated downshifts any more enjoyable. Moving on to the Gurkha, the first thing to talk about is, of course, the updated engine; 140hp is not a massive figure for a vehicle of this size and weight, but it sure beats the 90hp the Gurkha was launched with. The new iteration of the engine feels a lot readier with its power delivery. It doesn’t have that commercial vehicle vibe that the older Gurkha engine had. It also revs a bit more, with ‘bit’ being the operative word, because, by 3,000-3,500rpm, the engine is done with its best. Engine aside, even the gearbox doesn’t like to be rushed. The gearbox has a long throw, so you’ll have to extend a bit, particularly for first and second gear, and gear shifts need a bit of effort. Strong diesel engine makes Thar Roxx most enjoyable to drive. The Roxx’s performance stands out, particularly in this company. Mahindra’s mHawk 2.2-litre diesel engine in this 152hp and 330Nm state of tune feels the most powerful, the punchiest and even the sportiest. The unit feels alert at low speeds, it’s got plenty to give in the mid-range, and it also revs quite quickly for a diesel. Its power and grunt do so much to uplift the driving experience. Helping here is the six-speed gearbox that’s really nice to use. Clutch modulation, as mentioned, needs care at low speeds, though. Thar Roxx vs Jimny vs Gurkha 5 door ride and handling Typically, the steering doesn’t get mentioned in the list of highlights on an off-roader, but things are different on the Thar Roxx. Its new-gen electric power steering is leagues ahead of the units on the Jimny and Gurkha. The steering is light at low speeds yet gives you the confidence that you need at high speeds. Even the turning circle is rather nice forwhat is a pretty substantial vehicle. On the flip side, the Roxx can’t hide its ladder-frame underpinnings. It’s unfazed by big potholes, but out cruising, the ride remains busy.    It’s the Jimny with the best ride comfort. Low-speed rides are nice and absorbent; even at higher speeds, it feels quite planted. Of course, the fact that the Jimny sits relatively low to the ground makes a big, big difference here. All’s not perfect, though. You’ll have to work with the slow-geared steering (it needs more lock than you’d expect) and the unusually large turning circle that takes away from the dinky Jimny’s ease-of-use quotient. The added power helps, but Gurkha is happiest on a gentle cruise. The Gurkha feels the largest from behind the wheel. Its high centre of gravity will force you, pun intended, to go easy, especially on a winding road. As for ride comfort, the Gurkha feels at home on bombed-out sections of roads, but there is some steering kickback, and you’ll also feel judders coming through the body. However, for the size of the potholes that the Gurkha can flatten, ride comfort can be described as cushy. What the Gurkha needs is uprated braking. The front-disc and rear-drum setup doesn’t feel strong enough. Thar Roxx vs Jimny vs Gurkha 5 door safety features None of the three have a Global NCAP or Bharat NCAP safety rating yet. In terms of standard safety features, the Gurkha offers just the basics, such as dual airbags, ABS and rear parking sensors, but it handily packs a tyre pressure monitor. The Jimny and Thar each get six airbags as standard, electronic stability control, hill descent control, hill hold control and ISOFIX child seat mounts. The Thar’s higher-spec versions add front parking sensors, a tyre pressure monitor, a 360-degree camera and rear disc brakes. Its range-topping variants go a few steps further with segment-first camera and radar-based ADAS. There’s auto emergency braking, lane keep assist and high beam assist. Auto gearbox versions even feature adaptive cruise control with stop-and-go. The features are a great additional safety net and make the Thar Roxx feel more complete than the other two. Thar Roxx vs Jimny vs Gurkha 5 door price and verdict The Gurkha 5-door has a substantial road presence, and Force’s updated engine brings a noticeable performance upgrade. However, the Gurkha still makes for a very committed choice. It’s great off-road in the right hands, but the package as a whole just feels way too raw for something that costs Rs 18 lakh (ex-showroom). A three-year/1.5 lakh kilometre standard warranty and four free services sweeten the deal to some extent. The Jimny is the most affordable of these 4x4 off-roaders. Prices start at Rs 12.74 lakh for the Zeta manual and top off at Rs 14.79 lakh for the Alpha automatic. Push for deals and discounts, and you could save upwards of Rs 2 lakh on the listed prices. Judged purely as an off-roader, the Jimny impresses. It’s an unintimidating, scrappy little thing that’ll put a smile on your face in the wild. The thing is, the Jimny isn’t quite as nice as everyday transport. The small cabin and unexciting engine are to blame. There’s also the matter that the Jimny just doesn’t have the road presence many want from their off-roader. In this comparison, it’s the Thar Roxx that ticks more of the boxes of interest. It’s got the right look and the right image, and that’s a great starting point. The tough demeanour is backed by genuine ability off-road, a polished on-road driving experience and enough thrills and comfort to make the Roxx feel like an all-rounder. It makes the most convincing case as the only vehicle in the family, and that’s why it’s the one we’d readily recommend. Prices for the Roxx 4x4 variants start at Rs 18.79 lakh and go up to Rs 22.49 lakh for the fully loaded automatic version. The Thar Roxx is the most expensive model here, but pricing is actually tempting once you factor in all that the Mahindra packs in. PS: Not to end on a bummer, but if you’re interested in a Roxx, you’re quite late: 1.76 lakh people booked one within 60 minutes of bookings opening! Also see: Thar Roxx vs Jimny vs Gurkha 5-Door comparison video Off-road Day 2024 video: Thar Roxx, Gurkha 5 Door, Jimny and more Mahindra Thar Roxx secures 5 star Bharat NCAP safety rating",
    "author": "Nikhil Bhatia",
    "published": "Sat, 23 Nov 2024 07:30:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241122045144_Mahindra_Thar_Roxx_vs_Maruti_Jimny_vs_Force_Gurkha_5_door_front.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "b4fc275c-3567-4a30-8fa6-191b3f0f4132",
    "title": "Half of Russia's Airbus A320/321neo Fleet Grounded Due To Lack Of Engine Parts",
    "link": "https://jalopnik.com/half-of-russias-airbus-a320-321neo-fleet-grounded-due-t-1851707855",
    "description": "Turbine jet-powered airplanes are the highest maintenance vehicles on the planes, so being cut off from the necessary firehose of spare parts will have consequences. Currently, half of the Airbus A320neo and 321neo planes in Russia can’t fly due to maintenance issues. Most of the grounded aircraft desperately need new…Read more...",
    "author": "Ryan Erik King",
    "published": "Mon, 25 Nov 2024 21:06:50 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/349c56adf84216c6cce51b444c60fc11.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "airbus",
      "airbus a320",
      "competition between airbus and boeing",
      "indigo fleet",
      "airbus a320 family",
      "turkish airlines fleet",
      "s7 airlines",
      "boeing",
      "airbus a320neo family",
      "disaster accident",
      "comac",
      "the airbus",
      "airliner",
      "latam airlines"
    ]
  },
  {
    "id": "6c29b57b-98c9-49dd-b31b-d64e09e48f3f",
    "title": "2026 Kia EV9 GT Has Legit Sporty Bucket Seats That Remind Me Of '80s Recaros",
    "link": "https://jalopnik.com/2026-kia-ev9-gt-has-legit-sporty-bucket-seats-that-remi-1851707752",
    "description": "Last week at the Los Angeles Auto Show, the most impressive seats I sat in weren’t in a sports car or a super-luxury sedan, but in an electric three-row crossover. Kia debuted the new EV9 GT at the show, a 501-horsepower performance version of its excellent family hauler, and the seats in all three rows are simply…Read more...",
    "author": "Daniel Golson",
    "published": "Mon, 25 Nov 2024 20:45:00 GMT",
    "image": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/a289a4a7b9b4432a0f2822c0d486a6c3.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "kia ev9",
      "ev9",
      "recaro",
      "la auto show"
    ]
  },
  {
    "id": "23173f62-082b-4513-a2ad-531c000d0b51",
    "title": "Bentley Flying Spur Speed",
    "link": "https://www.autocar.co.uk/car-review/bentley/flying-spur-speed",
    "description": "Can new drivetrain lift Crewe’s super-saloon to even greater heights? The best saloon in the world? That's the question posed by the new Bentley Flying Spur Speed after the adoption of a new hybridised V8 engine.This allows for greater efficiency to be added to the car's repertoire, on top of all of the other qualities that have made it great.The introduction of the new V8 drivetrain has come about following the demise of the W12 engine due to emissions regulations. That V8 has already made a stellar debut in the Bentley Continental GT Speed.It now lifts straight into the Flying Spur and this Speed launch variant, and aims to replicate both the famed torque of the old 6.0-litre W12 unit and perhaps more pertinently the refinement and lack of stress it operated under.",
    "author": "",
    "published": "Tue, 26 Nov 2024 00:01:23 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/bentley-flying-spur-review-2024-01-front-tracking.jpg?itok=mTsRusq0",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "4016555b-5784-4683-a7f0-bf76f57c0d9f",
    "title": "Used Volvo XC90 2015 - present review",
    "link": "https://www.autocar.co.uk/car-review/volvo/xc90-2015-present",
    "description": "It has big boots to fill and talented rivals to face. Is it up to the task? Plush, mature and packed full of usable technology, the second-generation Volvo XC90 arrived as a serious statement of intent back in 2015, delivering performance, practicality, style and efficiency in a way that made it the definitive all-rounder in a segment brimming with talent.But it also landed at a tricky time for Volvo: the firm was still trying to find its feet after a takeover by Chinese car giant Geely, and any successor to the original XC90 needed to hit the ground running as the seven-seater had grown into one of the brand’s best-selling models.Volvo didn’t hold back. The XC90 got an all-new platform, complete redesign, electronic overhaul and revamped line of engines, accompanied by an upmarket interior in a bid to outdo the likes of the BMW X5, Land Rover Discovery and Audi Q7.The effort paid off, to such an extent that it’s still on sale today – albeit following some chunky updates over the past few years. But while the starting price for the latest version is a heady £64,000, you can grab yourself an early car for as little as £14,000.When we first road tested the XC90, we were impressed by its 222bhp four-cylinder turbo diesel.While it was down 500cc over the old five-pot, the oil-burner had more than enough gusto and was at the front of the class for throttle response.Acceleration was helped by the XC90 being leaner than cars like the Land Rover Discovery 4, which was 274kg heavier.We felt the performance was a little at odds with the slightly sluggish gearbox, though.In the main, it was easy to get along with, but when you asked for more oomph, the eight-speed gearbox was a little slow to respond. The ride was a mixed bag too. The standard car was by no means uncomfortable: it was just stiffly sprung for a Volvo – a side effect of which was that it could carve corners like the more dynamically inclined BMW X5.With air springs fitted, the XC90 was far more settled at higher speeds and soaked up lumps and bumps around town more confidently – more in keeping with the character you would expect.There was also the T6, a four-cylinder petrol that made 316bhp, and the tax-busting T8 plug-in hybrid, which had 401bhp, a 0-62mph time of 5.9sec and an EV-only range of 24 miles.If you don’t need the financial benefits of a plug-in, a diesel will deliver more than enough punch – especially the later 232bhp PowerPulse D5 – and reasonable fuel economy. You can expect around 36mpg.Volvo rolled out the subtlest of facelifts in 2019, adjusting the engine line-up in the process. The D5 was replaced by the 232bhp B5 and the T6 was dropped for the 247bhp B5P, both mild hybrids.Step inside and you were met with a cabin that was superbly crafted, well configured and easy to use, yet it was also plush and stayed true to Volvo’s minimalist Scandi-cool vibe.Pleasingly, the central 9.0in touchscreen was simple to operate, and a selection of physical buttons for some of the secondary controls meant the XC90 scored well in terms of usability.The rear of the cabin was impressively spacious, and the car’s boxy silhouette meant that third-row passengers had more than enough head room.Throw in the XC90’s huge, 775-litre boot and endless cubbyholes, and it made for a highly compelling large SUV.As premium seven-seaters go, the second-generation XC90 is right up there with the best, and now that the new model is on its way, you should be able to grab this crackerjack all-rounder for a reasonable price.",
    "author": "",
    "published": "Mon, 25 Nov 2024 12:01:19 +0000",
    "image": "https://www.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/xc90-rt_1_1.jpg?itok=9jgZd40F",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "4716fd75-d9d3-474f-b650-e55d34295454",
    "title": "BMW Integrates Hydrogen Technology Into Production Logistics",
    "link": "https://www.bmwblog.com/2024/11/25/bmw-hydrogen-logistics-plant-regensburg-2026/",
    "description": "BMW continues its exploration of hydrogen as a key component of its sustainability strategy, expanding its applications both in production processes and future vehicle development. While the company plans to introduce hydrogen-powered production cars in... First published by https://www.bmwblog.com",
    "author": "Horatiu Boeriu",
    "published": "Mon, 25 Nov 2024 20:40:22 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/11/hydrogen-power-bmw-logistics-fleet-01-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "News",
      "hydrogen",
      "Regensburg plant"
    ]
  },
  {
    "id": "117a22d4-25bb-49b1-91f1-85149ef760ff",
    "title": "ALPINA XD3 In-Depth Review: Saying Goodbye to Diesel Excellence",
    "link": "https://www.bmwblog.com/2024/11/25/alpina-xd3-review-performance-diesel-suvs-test-drive/",
    "description": "Saying goodbye is a common thing these days in an ever-changing automotive world, where the transition to a new way of motoring is forcing us to change and see some of the most iconic creations... First published by https://www.bmwblog.com",
    "author": "Marc Rutten",
    "published": "Mon, 25 Nov 2024 19:26:20 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/11/alpina-xd3-review-test-drive-26-830x467.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "ALPINA",
      "Test Drives",
      "Alpina D3"
    ]
  },
  {
    "id": "ccfdcee0-ba4d-4113-b320-5c7aad4d5628",
    "title": "The Scrappier: A Squeaky-Clean Supermoto from Woolie’s Workshop",
    "link": "https://www.bikeexif.com/dues-ex-machina-ktm-scrappier",
    "description": "Naked, supermoto, streetfigher, café racer, super-naked — whatever you want to call it (we’re leaning toward super-naked) — this 2008 KTM RC8 that recently rolled out of Deus Ex Machina’s garage is stark, uncompromising, and muscular. Where the stock RC8 is a fully faired superbike, albeit with some snarling angular character, it’s a race bike through and through. It’s more of a fencer — a scorekeeper, so to speak. “The Scrappier,” as our featured bike is known, is a cage fighter — less about the numbers and more about the experience. When the bike landed in the shop, the intention of Michael “Woolie” Woolaway, Deus’ in-house builder, was to turn this track-ready superbike into a ’roided out supermoto with Deus’ unique custom flavor.…",
    "author": "Iron and Air",
    "published": "Mon, 25 Nov 2024 17:00:38 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/11/dues-scrappier-ktm-2.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Featured Bikes",
      "Iron \u0026 Air",
      "KTM"
    ]
  },
  {
    "id": "9ef4b24c-c310-4588-bef6-40d06a35d0db",
    "title": "Speed Read: A Harley Pan America scrambler and more",
    "link": "https://www.bikeexif.com/custom-motorcycle-news-november-24-2024",
    "description": "The two custom motorcycles that headline this week’s edition of Speed Read couldn’t be more different. One is a Harley Pan America with wild scrambler styling, the other is a classic Triumph TR6R Tiger bobber. The second half of our round-up covers new mid-sized releases from European OEMs; the BMW F 900 R and F 900 XR, and the KTM 790 Adventure. Harley-Davidson Pan America by Black Cycles This wild creation is the result of a dirt bike guy named Josh walking into a Harley dealership and leaving with a 2022 Harley-Davidson Pan America. Despite what literally every motorcycle manufacturer’s marketing department will tell you, an adventure bike is really not a dirt bike. Josh quickly realized this, but had a plan to remedy this situation: take the Pan Am to Noel Muller of Black Cycles Australia and let him work his magic.…",
    "author": "Ben Pilatti",
    "published": "Sun, 24 Nov 2024 17:16:22 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2024/11/2025-bmw-f-900-r-1.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Latest Motorcycle News",
      "Bobber motorcycles",
      "Harley-Davidson",
      "Scramblers",
      "Triumph Bobber",
      "Triumph motorcycles"
    ]
  },
  {
    "id": "4f1674ad-3b52-483c-9fe8-ff4e262f4cbd",
    "title": "Review: New “3D Cars – Inside Out” Blender Course",
    "link": "https://www.carbodydesign.com/2024/09/review-new-3d-cars-inside-out-blender-course/",
    "description": "The new training course by CGMasters explains advanced SubD (subdivision surfaces) modeling techniques for creating car 3D models in Blender with high quality surfaces.",
    "author": "Marco Traverso",
    "published": "Sun, 22 Sep 2024 07:47:04 +0000",
    "image": "http://www.carbodydesign.com/media/2023/07/3D-Cars-Blender-Course-Julietta-H6-Concept-3D-Model-04-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "_Cover Stories (Sticky)",
      "_Featured Articles",
      "_Sponsored Article",
      "3D Tutorials",
      "Blender Tutorials",
      "Car 3D Modeling Tutorials",
      "Car Rendering Tutorials",
      "Cover Stories",
      "3D",
      "Blender"
    ]
  },
  {
    "id": "d8edaa68-da71-437a-a16f-488098f74482",
    "title": "Stellantis launches annual Drive for Design contest",
    "link": "https://www.carbodydesign.com/2024/03/stellantis-launches-annual-drive-for-design-contest/",
    "description": "Stellantis has launched the new edition of its Drive for Design Contest for US high school students. The deadline is April 12, 2024 and the top prize is an internship at Ram Truck design studio.",
    "author": "Car Body Design",
    "published": "Mon, 11 Mar 2024 09:45:27 +0000",
    "image": "http://www.carbodydesign.com/media/2024/03/Stellantis-Drive-for-Design-Contest-Poster-02-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Car Design Competitions",
      "Dodge",
      "Drive for Design Contest",
      "Stellantis"
    ]
  },
  {
    "id": "9a7d6bd3-d2ba-494e-87f2-4de74ab74002",
    "title": "Watch An Alfa Romeo 33 Stradale Sing Its Way To 207 MPH",
    "link": "https://www.carscoops.com/2024/11/watch-an-alfa-romeo-33-stradale-sing-its-way-to-207-mph/",
    "description": "Alfa Romeo is wrapping up testing of their latest supercar, ahead of deliveries next month",
    "author": "Michael Gauthier",
    "published": "Tue, 26 Nov 2024 00:50:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/11/Alfa-Romeo-33-Stradale-Prototype.gif",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Alfa Romeo",
      "Alfa Romeo 33 Stradale",
      "Alfa Romeo Videos",
      "Video"
    ]
  },
  {
    "id": "b78ea212-bfa0-4234-908a-f6a7e033b823",
    "title": "California To Reinstate EV Rebates If Trump Scraps Tax Credit, Just Not For Tesla",
    "link": "https://www.carscoops.com/2024/11/california-to-reinstate-ev-rebates-if-trump-scraps-tax-credit-just-not-for-tesla/",
    "description": "Elon Musk has described Tesla's potential exclusion from the rebate program as \"insane\"",
    "author": "Brad Anderson",
    "published": "Tue, 26 Nov 2024 00:11:12 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2024/11/5tg3fr4cdfrt-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "California",
      "Donald Trump",
      "Electric Vehicles",
      "Elon Musk",
      "Tesla",
      "USA"
    ]
  },
  {
    "id": "98c27409-abc1-4e1c-9693-f9953eb1e386",
    "title": "View Interior Photos of the 2025 Bentley Flying Spur Speed",
    "link": "https://www.caranddriver.com/photos/g62988583/2025-bentley-flying-spur-speed-drive-interior-gallery/",
    "description": "2025 Bentley Flying Spur Speed interior photos.",
    "author": "",
    "published": "Tue, 26 Nov 2024 00:01:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "62741fdd-b4c1-43b2-b442-2472dad21fb3",
    "title": "2025 Bentley Flying Spur Speed Is Where High-Luxe Meets Hi-Po",
    "link": "https://www.caranddriver.com/reviews/a62978582/2025-bentley-flying-spur-speed-drive/",
    "description": "The Flying Spur's 771-hp plug-in-hybrid powertrain offers hustle when you want it and silent EV motoring when you don't.",
    "author": "",
    "published": "Tue, 26 Nov 2024 00:01:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "e6a85e78-61e8-4b3f-9f61-f1a78ff5ccf7",
    "title": "Briggs Cunningham \u0026 Denise McLuggage's 1956 Jaguar XK140",
    "link": "",
    "description": "Photography by: Johnathan Rothman (@thejohnrothman) 1956 Jaguar XK140 Convertible Raced in period by Briggs Cunningham and Denise McLuggage Location: California, USA Country of original delivery: USA Chassis/VIN: S818207 Mileage: 76,025 miles Colour: Red Original colour of delivery: Carmine Red Price: Call for Price The car As part of its Private Sales initiative, Petrolicious is proud to offer a unique collector-grade Jaguar. The Jaguar XK140 represented the epitome of front-mounted 6-cylinder Jaguars in the mid-1950s. This particular example is without a doubt the most storied one in the United States of America, as it was raced and campaigned by two of the most prolific personalities in the American racing world. The car was first campaigned by renowned Briss Cunningham, who was indisputably one of the most pivotal figures in postwar sports car racing, making a profound impact as a driver, team owner, and constructor. Briggs then proceeded to donate his XK140 to Denise McLuggage, an American auto racing driver, journalist, author and photographer. She pioneered gender equality in motorsports and journalism in the U.S., and was among the very first women taking part in professional automotive racing. Her racing achievements included winning the grand touring category at Sebring in a Ferrari 250 GT in 1961, and a class win in the Monte Carlo Rally in a Ford Falcon in 1964. She also participated in the Nürburgring 1000 km sports car race. This car's past is in fact so fascinating that it recently enabled it to earn a very coveted spot in the Motorsports Hall of Fame of America (MSHFA), where it resided in 2022 alongside other giants of the racing world. What's perhaps even more remarkable, is that the car presents in unaltered condition. It's been kept 'as-is' by its 4 owners (Briggs Cunningham, Denise McLuggage, and 2 other owners, including the present one), and is showing a splendid amount of patina. Everything about this car is original and has remained untouched over the last 58 years - the chassis, body panels, engine, transmission, suspension, wheels, seats, dashboard materials, and more, are all original. And, magically, 58 years later, it still elegantly runs and drives. Continue...",
    "author": "",
    "published": "Fri, 22 Nov 2024 17:37:00 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/10/10114104/DSCF5856.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "3953b1a3-5e28-47cc-b522-c83a910ecc75",
    "title": "2011 RUF RT Roadster | 1-of-1 RUF Coach Build",
    "link": "",
    "description": "2011 RUF RT Roadster Location: Miami, Florida Original delivery: USA Chassis/VIN: - Mileage: 6,900 miles Price: Call for Price   The Car | 1 of 1 RUF RT Roadster With a reputation for creating the pinnacle of bespoke performance sports cars, RUF can sometimes afford the luxury of creating one-off coach-built vehicles for close family friends and special clientele. The one-of-one RUF RT Roadster was the result of a unique idea presented by such a client to produce a true B-pillar Targa that hadn’t been available from Porsche from the 993 until the 991. This meant engineering a new body based on a 2011 997.2 chassis to create a Targa that would seamlessly combine nostalgia with the exhilarating driving feel RUF is so well known for. The team wanted to pay homage to the very first Targas produced which were famous for their ability to fully remove the rear window to provide a ‘soft window’ Targa experience. The RT Roadster reimagines the iconic rear quarter panel openings that feed the intercoolers, breathing cold air into the twin-turbo 3.8-liter flat-six that produces 650 horsepower delivered to all four wheels through a PDK transmission. Underneath rests a special RUF-tuned suspension and carbon ceramic brakes on all four corners. Finished in a truly bespoke Chromaflair satin paint, the lines of this RT Roadster flow as the paint transitions through its various layers of flake and its undertones are exposed. The interior is finished in contrasting red leather with silver stitching, extended carbon fiber accents, and painted Chromaflair satin interior trim, showcasing RUF's meticulous attention to detail. Factory options include phone connectivity, foldable carbon bucket seats, color-matching hard top panels, matching red leather luggage belts on the rear parcel shelf, and center lock wheels. The RT Roadster was unveiled at Rennsport VI in 2018 and subsequently featured in a MotorTrend article. It has been privately enjoyed by its original owner since then before being offered for sale to the general public. Continue...",
    "author": "",
    "published": "Tue, 12 Nov 2024 16:10:38 +0000",
    "image": "https://d2dsc1gf0t80gb.cloudfront.net/wp-content/uploads/2024/11/11091134/DSC05124-scaled.jpg",
    "source": "https://petrolicious.com/feed",
    "categories": null
  },
  {
    "id": "34df6bfe-75d2-4061-be43-391dd2ae89db",
    "title": "A Day Out In London With Two Theon Design Porsche 964s",
    "link": "https://www.speedhunters.com/2024/11/a-day-out-in-london-with-two-theon-design-porsche-964s/",
    "description": "So, when I planned a visit into England’s capital city, I expected nothing less than what Theon Design brought out for the day. Air-cooled Porsches are experiencing a renaissance. Restomods have become so widespread that it’s easy to feel overwhelmed, yet creating a standout piece requires not just skill but real dedication. Theon Design is […] The post A Day Out In London With Two Theon Design Porsche 964s appeared first on Speedhunters.",
    "author": "Jathu Thillai",
    "published": "Mon, 25 Nov 2024 18:00:35 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Car Features",
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "911",
      "964",
      "i am the speedhunter",
      "iamthespeedhunter",
      "iats",
      "London",
      "Porsche",
      "Restomod",
      "Theon Design",
      "UK"
    ]
  },
  {
    "id": "c1c29f1b-d00d-41a7-ad40-e10e0af847fb",
    "title": "The Ferrari 296 GTB, Done Two Ways",
    "link": "https://www.speedhunters.com/2024/11/ferrari-296-gtb-done-2-ways/",
    "description": "I remember the initial negativity against the idea of a twin-turbo V6, but to me, it felt like a perfect fit for the more entry-level vibe of the car. Plus, it links back to the Dino and the V6 engine powering that baby Ferrari that wasn’t even badged as one. The Dino was criticized when new, […] The post The Ferrari 296 GTB, Done Two Ways appeared first on Speedhunters.",
    "author": "Dino Dalle Carbonare",
    "published": "Sun, 24 Nov 2024 20:00:28 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Car Features",
      "Content",
      "296 GTB",
      "296GTB",
      "BBS",
      "Ferrari",
      "HRE Wheels",
      "indonesia",
      "Jakarta",
      "novitec",
      "Supercar"
    ]
  },
  {
    "id": "ba24f56e-7f7d-4fa9-b0cc-bae3ac937bb6",
    "title": "QOTD: Are You Ready For the Return of the Toyota Celica?",
    "link": "https://www.thetruthaboutcars.com/cars/question-of-the-day/qotd-are-you-ready-for-the-return-of-the-toyota-celica-44510485?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "It looks like the Toyota Celica may return .",
    "author": "Tim Healey",
    "published": "Mon, 25 Nov 2024 23:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/11/04/18003/toyota-pays-homage-to-celica-gt-four-at-sema.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Question of the Day"
    ]
  },
  {
    "id": "7e71eb83-e83a-4989-8588-41ba2ec24270",
    "title": "Used Car of the Day: 1986 Volkswagen Scirocco",
    "link": "https://www.thetruthaboutcars.com/cars/used-car-of-the-day/used-car-of-the-day-1986-volkswagen-scirocco-44510479?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Today we have a weird one in this 1986 Volkswagen Scirocco.",
    "author": "Tim Healey",
    "published": "Mon, 25 Nov 2024 21:30:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2024/11/25/16061/used-car-of-the-day-1986-volkswagen-scirocco.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Used Car of the Day"
    ]
  },
  {
    "id": "0a371d06-8a72-4fb7-89d5-58faf994ed8a",
    "title": "Kia India exports one lakh CKD vehicles",
    "link": "https://www.autocarindia.com/industry/kia-india-exports-one-lakh-ckd-vehicles-433659#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Kia India has exported one lakh made-in-India CKD kits of its vehicles to international markets since June 2020, from its only plant in India, located in Anantapur, Andhra Pradesh. India accounts for 50 percent of Kia’s global CKD exports Kia aims to export 38,000 CKD kits from India this year Syros compact SUV will be the next Kia model to be made at India plant Kia India plans to export 38,000 CKD kits this year India accounts for 50 percent of Kia’s global CKD exports. In 2024, Kia India expects to export over 38,000 CKD units to markets such as Uzbekistan, Ecuador, and Vietnam. The company’s exports primarily include the Seltos, Sonet, and Carens, which are heavily localised in India. Kia aims to expand its made-in-India CKD exports to newer markets like the Middle East and Africa, with plans to double export volumes by 2030. Kia India’s Anantapur plant has a manufacturing capacity of 3,00,000 units annually. In addition to exporting CKD kits abroad, the plant supplies vehicles to the domestic market and exports fully built units to select countries. The plant began trial production in early 2019, with the Seltos rolling out for series production in the same year. More recently, the local assembly of the flagship Carnival MPV has also started here with imported kits.  Kia India will introduce the Syros compact SUV in the coming months. Just like the Sonet, Carens, and Seltos, India is likely to serve as a mother plant for the Syros as well. The Syros will go on sale with an ICE powertrain first, followed by an EV a little later. Additionally, there are plans to introduce the Carens facelift and the Carens EV next year, which will be Kia’s first mainstream EV for the Indian market. Also See: Kia EV6 GT to get 650hp powertrain from Hyundai Ioniq 5 N Mahindra BE 6e, XEV 9e prices to be revealed on November 26",
    "author": "Akbar Merchant",
    "published": "Mon, 25 Nov 2024 19:02:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241125071134_Kia_India_line_up_1.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "9be2397a-da39-4301-bc15-aeca88e821ed",
    "title": "Kia Syros panoramic sunroof confirmed",
    "link": "https://www.autocarindia.com/car-news/kia-syros-panoramic-sunroof-confirmed-433658#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Ahead of its debut in the coming months, Kia India has dropped yet another teaser of the Syros compact SUV, this time confirming a panoramic sunroof. The Kia Syros will have a more premium positioning than the Sonet, and will pack in several other premium features such as ventilated and powered front seats, drive modes, traction modes, leatherette upholstery and a Bose audio system. Kia Syros will have a design inspired by EV9 and Carnival Will likely be offered with both ICE and electric powertrains Launch expected in early 2025 Kia Syros: what do we know so far As we've reported earlier, the new Syros will differentiate itself from other compact SUVs by having a greater focus on rear-seat space and comfort. It features a boxy design with a flat roof and an upright rear, in order to liberate maximum cabin space. There are talks of the Syros having more interior room than the Sonet, and in a league similar to the Seltos, despite measuring under 4 metres. Teaser images from Kia have suggested design details that resemble the flagship EV9. It sports a rather unique silhouette with a clamshell bonnet that sharply swoops down to a tall and upright nose. A distinctive feature is the window line that rises up with a sharp kink for the rear quarter glass area. The break in the window line at the B-pillar, finished in body colour, is reminiscent of the Skoda Yeti. There are no details on the powertrain front yet, but sources have previously said it will get both ICE and electric powertrain options. Kia will likely launch it with the internal combustion engines first, and the EV version will arrive later. Both versions will be based on the same platform and will be offered in front-wheel drive guise. The upcoming compact SUV will be positioned above the existing crop of the sub-4m SUVs, like the Hyundai Venue, Kia Sonet, Maruti Brezza and the recently launched Skoda Kylaq. Although there’s no confirmation on this yet, Kia could showcase the Syros in production-spec at the upcoming Bharat Mobility Show in January 2025. Also See: Kia EV6 GT to get 650hp powertrain from Hyundai Ioniq 5 N Mahindra BE 6e, XEV 9e prices to be revealed on November 26",
    "author": "Saptarshi Mondal",
    "published": "Mon, 25 Nov 2024 17:30:00 +1000",
    "image": "https://cdni.autocarindia.com/ExtraImages/20241125052937_Syros Sunroof Teaser.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  }
]
