{
  "id": "07b87437-a071-4534-aa34-1a20766e1e9d",
  "title": "Yet another iPhone 17 Pro case leak shows off camera bar design",
  "link": "https://appleinsider.com/articles/25/04/19/yet-another-iphone-17-pro-case-leak-shows-off-camera-bar-design?utm_medium=rss",
  "description": "A new post from leaker Majin Bu shows off iPhone 17 Pro's camera bar yet again in possible case marketing material.Alleged photo of the case colors for the iPhone 17 Pro - image credit: Majin BuThe new photos from Bu show the iPhone 17 Pro in marketing material for an unknown company's cases. The pictures show the elongated and long-rumored \"camera bar\" type design for the back, that places the cameras on the left side, while the flash and LiDAR sensor move to the opposite side.The colors shown in the photos posted by Bu suggest case colors of off-white, light blue, light green, a light purple, and a charcoal gray. In one photo, the camera bar is shown in a dark gray, but most images show the camera bar as white — suggesting Apple will keep the color choices for the 17 Pro models themselves the same as the iPhone 16 Pro. Rumor Score: 🤯 Likely Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Charles Martin",
  "published": "Sat, 19 Apr 2025 20:46:06 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Charles Martin",
  "length": 1743,
  "excerpt": "A new post from leaker Majin Bu shows off iPhone 17 Pro's camera bar yet again in possible case marketing material.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "A new post from leaker Majin Bu shows off iPhone 17 Pro's camera bar yet again in possible case marketing material. The new photos from Bu show the iPhone 17 Pro in marketing material for an unknown company's cases. The pictures show the elongated and long-rumored \"camera bar\" type design for the back, that places the cameras on the left side, while the flash and LiDAR sensor move to the opposite side. The colors shown in the photos posted by Bu suggest case colors of off-white, light blue, light green, a light purple, and a charcoal gray. In one photo, the camera bar is shown in a dark gray, but most images show the camera bar as white — suggesting Apple will keep the color choices for the 17 Pro models themselves the same as the iPhone 16 Pro. This new report comes after several previous claims from rival leaker Sonny Dickson, who offered photos of the supposed cases in March and earlier in April. The new leak from Bu looks much more like typical case promotional photos. In March, Bu showed off a series of metal plates for the iPhone 17 Pro Max that are likely to be used by case makers. This also illustrated the move of the flash and Lidar sensor to the right side of the back of the iPhone. An alleged promotional shot of the iPhone 17 Pro covers — image credit: Majin BuOther rumors surrounding the iPhone 17 lineup have included claims of new vapor chamber cooling, as well as claims of a RAM upgrade. Bu has a mixed track record, but does often get details that turn out to be correct. However, Bu also claimed that the iPhone 15 would get two front-facing cameras, which turned out to be false. This rumor is rated likely due to the increasing number of images showing the camera bar in cases from various sources.",
  "image": "https://photos5.appleinsider.com/gallery/63365-131674-iPhone-17-Pro-cases-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eA new post from leaker Majin Bu shows off \u003ca href=\"https://appleinsider.com/inside/iphone-17\" title=\"iPhone 17\" data-kpt=\"1\"\u003eiPhone 17 Pro\u0026#39;s\u003c/a\u003e camera bar yet again in possible case marketing material.\n\u003c/p\u003e\u003cp\u003eThe new photos \u003ca href=\"https://x.com/MajinBuOfficial/status/1913586805225533606\"\u003efrom Bu\u003c/a\u003e show the iPhone 17 Pro in marketing material for an unknown company\u0026#39;s cases.  The pictures show the elongated and long-rumored \u003ca href=\"https://appleinsider.com/articles/25/04/09/leaked-iphone-17-pro-case-again-shows-enlarged-camera-bump\"\u003e\u0026#34;camera bar\u0026#34;\u003c/a\u003e type design for the back, that places the cameras on the left side, while the flash and LiDAR sensor move to the opposite side.\n\u003c/p\u003e\u003cp\u003eThe colors shown in the photos posted by Bu suggest case colors of off-white, light blue, light green, a light purple, and a charcoal gray. In one photo, the camera bar is shown in a dark gray, but most images show the camera bar as white —  suggesting Apple will keep the color choices for the 17 Pro models themselves the same as the iPhone 16 Pro.\n\u003c/p\u003e\u003cp\u003eThis new report comes after several \u003ca href=\"https://appleinsider.com/articles/25/03/20/iphone-17-pro-dummies-show-where-glass-ends-and-metal-begins\"\u003eprevious claims\u003c/a\u003e from rival leaker Sonny Dickson, who offered photos of the supposed cases \u003ca href=\"https://appleinsider.com/articles/25/03/19/leaked-iphone-17-air-case-back-up-camera-bar-claims\"\u003ein March\u003c/a\u003e and earlier \u003ca href=\"https://appleinsider.com/articles/25/04/09/leaked-iphone-17-pro-case-again-shows-enlarged-camera-bump\"\u003ein April\u003c/a\u003e. The new leak from Bu looks much more like typical case promotional photos.\n\u003c/p\u003e\u003cp\u003eIn March, Bu \u003ca href=\"https://appleinsider.com/articles/25/03/13/an-iphone-17-pro-max-metal-frame-image-leak-is-more-about-cases\"\u003eshowed off\u003c/a\u003e a series of metal plates for the iPhone 17 Pro Max that are likely to be used by case makers. This also illustrated the move of the flash and Lidar sensor to the right side of the back of the iPhone.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/63365-131675-Case-colors-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/63365-131675-Case-colors-xl.jpg\" alt=\"Four smartphones with triple-camera setups, each in different colored cases: cream, light blue, dark gray, and lavender, arranged floating against a light gray background.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eAn alleged promotional shot of the iPhone 17 Pro covers —  image credit: Majin Bu\u003c/span\u003e\u003c/p\u003e\u003cp\u003eOther rumors surrounding the iPhone 17 lineup have included claims of new \u003ca href=\"https://appleinsider.com/articles/25/03/12/iphone-17-pro-set-to-get-advanced-vapor-chamber-cooling\"\u003evapor chamber cooling\u003c/a\u003e, as well as claims of a \u003ca href=\"https://appleinsider.com/articles/25/02/27/analyst-repeats-12gb-ram-rumor-for-iphone-17-pro-models-which-may-at-least-be-half-correct\"\u003eRAM upgrade\u003c/a\u003e.\n\u003c/p\u003e\u003cp\u003eBu has a mixed track record, but does often get details that turn out to be correct. However, Bu also claimed that the \u003ca href=\"https://appleinsider.com/inside/iphone-15\" title=\"iPhone 15\" data-kpt=\"1\"\u003eiPhone 15\u003c/a\u003e would get \u003ca href=\"https://appleinsider.com/articles/22/09/26/iphone-15-ultra-rumored-to-have-two-front-cameras-and-usb-c\"\u003etwo front-facing cameras\u003c/a\u003e, which turned out to be false.\n\u003c/p\u003e\u003cp\u003eThis rumor is rated likely due to the increasing number of images showing the camera bar in cases from various sources.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-19T20:46:06Z",
  "modifiedTime": null
}
