{
  "id": "0fd1c0e8-1308-4f89-81e3-5e7472bd46aa",
  "title": "macOS Sequoia is available today",
  "link": "https://www.apple.com/newsroom/2024/09/macos-sequoia-is-available-today/",
  "description": "",
  "author": "Apple Newsroom",
  "published": "2024-09-16T17:01:10.916Z",
  "source": "https://www.apple.com/newsroom/rss-feed.rss",
  "categories": [
    "UPDATE"
  ],
  "byline": "",
  "length": 15511,
  "excerpt": "macOS Sequoia, the latest version of the world’s most advanced desktop operating system, is available today as a free software update for Mac.",
  "siteName": "Apple Newsroom",
  "favicon": "",
  "text": "opens in new window UPDATE September 16, 2024 macOS Sequoia is available today, bringing iPhone Mirroring, Apple Intelligence, and more to Mac macOS Sequoia now features iPhone Mirroring; new updates to Safari, video conferencing, and more; and starting next month, will mark the arrival of Apple Intelligence on Mac. macOS Sequoia, the latest version of the world’s most advanced desktop operating system, is available today as a free software update for Mac. macOS Sequoia brings exciting new features, including iPhone Mirroring, which expands Continuity by enabling access to and control of iPhone directly from macOS; big updates to Safari; a new Passwords app; and more. Starting next month, macOS Sequoia will introduce Apple Intelligence,1 the personal intelligence system that combines the power of generative models with personal context to deliver intelligence that is incredibly useful and relevant while protecting users’ privacy and security. Here’s a look at the top features Mac users can experience when they update to macOS Sequoia. iPhone Mirroring Working across iPhone and Mac gets even easier with the newest Continuity feature in macOS Sequoia — iPhone Mirroring. Users can now access and engage with their iPhone right from their Mac. Custom wallpaper and app icons appear just like on iPhone. With iPhone Mirroring, users can also swipe between pages on the Home Screen; launch and browse favorite apps; and review and respond to iPhone notifications directly from their Mac. And iPhone remains locked the whole time, so nobody else can access or see what the user is doing. It also works great with StandBy, so users can continue to get information at a glance on their iPhone as they use iPhone Mirroring. With iPhone Mirroring, users can now fully access and engage with their iPhone right from Mac while iPhone remains locked nearby. More Surfing Power in Safari Safari is the world’s fastest browser,2 and it’s even easier to discover new information on the web with the new Highlights feature. Powered by machine learning, Highlights automatically surfaces directions for a location, summaries of articles, or quick links to learn more about people, music, movies, and TV shows. A redesigned Reader allows users to read articles more quickly with a streamlined view, a summary, and a table of contents, and a new Viewer helps users put videos front and center while still giving them full access to system playback controls. With Distraction Control, users can hide items on a webpage that they may find disruptive to their browsing. A highlight showing directions to a hotel displayed on MacBook Pro. A web article displayed in Reader mode. Highlights in Safari make it even easier to discover information on the web, quickly pulling up relevant information about a site. A redesigned Reader delivers a streamlined view of an article, a summary, and a table of contents for longer articles. Easier Window Tiling New ways to arrange windows let users stay organized with the layout that works best for them. By simply dragging a window to the edge of the screen, macOS Sequoia automatically suggests a tiled position on the user’s desktop. Users can release a window right into place, quickly arrange tiles side by side, or place them in corners to keep even more apps in view. And new keyboard and menu shortcuts help organize tiles even faster. Easier window tiling lets users quickly drag windows into key areas on their screen to effortlessly arrange them into side-by-side tiles, or place them into corners to keep even more apps in view. A New Passwords App An all-new Passwords app makes it even easier to access passwords, passkeys, Wi-Fi passwords, and other credentials all in one convenient place on Mac. The Passwords app is backed by incredibly secure end-to-end encryption. It works great with Safari, and seamlessly syncs between all of a user’s Apple devices and Windows with the iCloud for Windows app. A new Passwords app makes it even easier to access passwords and organize credentials all in one place. Video Conferencing Updates During video calls in FaceTime or third-party apps like Webex, users can apply beautiful built-in backgrounds, including a variety of color gradients or shots of the scenery in and around locations like Apple Park in Cupertino, California. They can even upload their own photos to use as a background, And with Apple’s industry-leading segmentation, users will look their best on every call. With presenter preview, users can now see what they’re about to share before sharing it with apps like FaceTime and Zoom. Users can select beautiful built-in backgrounds, while Apple’s industry-leading segmentation technology helps them look their best while video conferencing with macOS Sequoia. Coming Soon: Apple Intelligence Apple Intelligence will transform what users can do with Mac, delivering intelligence that is incredibly useful and relevant to them, while protecting their privacy and keeping them in control of their data. Apple Intelligence will be available on Macs with an M-series chip, harnessing the power of Apple silicon and the Neural Engine to understand and create language and images; take action across apps; and draw from personal context to simplify and accelerate everyday tasks. Writing Tools help rewrite, proofread, and summarize text. Siri becomes more natural, flexible, and deeply integrated into the system experience, and with richer language-understanding capabilities, Siri can follow along when users stumble over their words. Siri can also maintain context from one request to the next. Mac users can type to Siri and fluidly switch between text and voice to accelerate everyday tasks. In addition, with Siri’s extensive product knowledge, users can now get answers to thousands of questions about the features and settings on Mac. With many of the Apple Intelligence models running entirely on device, as well as the introduction of Private Cloud Compute — which extends the privacy and security of Apple devices into the cloud to unlock even more intelligence — Apple Intelligence introduces an extraordinary step forward for privacy in artificial intelligence. Additional Features In macOS Sequoia, there are many more unique and useful features added to users’ favorite Mac apps. Messages In Messages, users can now schedule messages to send later. Text messages can also come to life with unique text effects that visually amplify words or emoji with animations like “explode,” “ripple,” and “nod,” and users can even tap back with any emoji or sticker they want. Notes In the Notes app, users can now record audio and receive a live transcription, making it incredibly easy to capture every detail of a lecture, meeting, or conversation, and Apple Intelligence will automatically generate a summary. Math Notes also comes to macOS Sequoia, enabling users to instantly solve an expression or math problem simply by typing it into the Notes app on Mac. Maps In the Maps app, outdoor enthusiasts gain access to stunning topographic maps and a selection of thousands of hikes available across U.S. national parks. Additionally, users can now easily create custom walking and hiking routes with just a few clicks. A conversation in Messages showing the send later feature. A custom hiking route displayed in Apple Maps. macOS Sequoia lets users schedule text messages to send later in the Messages app. For those looking for new adventures, Apple Maps offers thousands of hikes across U.S. national parks, and users can also create custom hikes and walking routes. For a comprehensive list of everything that’s new in macOS Sequoia, visit apple.com/macos/macos-sequoia. macOS Sequoia is a free software update that is available starting today. For more information, visit apple.com/macos/macos-sequoia. Some features may not be available in all regions or in all languages. Apple Intelligence will be available as a free software update. The first set of Apple Intelligence features will be available in beta next month as part of iOS 18.1, iPadOS 18.1, and macOS Sequoia 15.1, with more features rolling out in the months to come. It will be available on iPhone 16, iPhone 16 Plus, iPhone 16 Pro, iPhone 16 Pro Max, iPhone 15 Pro, iPhone 15 Pro Max, and iPad and Mac with M1 and later, with device and Siri language set to U.S. English. Later this year, Apple Intelligence will add support for localized English in Australia, Canada, New Zealand, South Africa, and the U.K. Over the course of the next year, Apple Intelligence will expand to more platforms and languages, like Chinese, English (India), English (Singapore), French, German, Italian, Japanese, Korean, Portuguese, Spanish, Vietnamese, and others. Testing was conducted by Apple in August 2024. See apple.com/safari for more information.",
  "image": "https://www.apple.com/newsroom/images/2024/09/macos-sequoia-is-available-today/tile/Apple-macOS-Sequoia-hero-lp.jpg.og.jpg?202410091650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\n\n\n\t\n    \n\n\n\n\n\n\n\n \n\u003cnav id=\"ac-localnav\" lang=\"en-US\" role=\"navigation\" aria-label=\"Newsroom\" data-analytics-region=\"local nav\" data-sticky=\"\"\u003e\n\t\n    \n    \n        \n\n\n\n\n    \n    \n    \n\t\n\t\n\n\u003c/nav\u003e\n\n\n\n\n\n\u003cmain id=\"main\" role=\"main\"\u003e \n\n\n\n\n\u003cspan id=\"opens-in-new-window\"\u003eopens in new window\u003c/span\u003e\n\u003csection\u003e\n\u003carticle data-analytics-activitymap-region-id=\"article\"\u003e\n\n\n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n\n\n\n    \n\n\n\n\n\n    \u003cdiv\u003e\n        \n\t\t\n        \u003cdiv\u003e\n                    \n                    \n                        \u003cspan\u003eUPDATE\u003c/span\u003e\n                    \n                    \n                        \u003cspan\u003eSeptember 16, 2024\u003c/span\u003e\n                    \n                    \n                \u003c/div\u003e\n\n        \u003cdiv\u003e\n                \n                \n                \n                    \u003ch2\u003e\n                        \n    \n        macOS Sequoia is available today, bringing iPhone Mirroring, Apple Intelligence, and more to Mac\n    \n\n                    \u003c/h2\u003e\n                \n            \u003c/div\u003e\n\n        \n\n        \n            \n    \n    \n    \n    \n    \n\n        \n\n    \u003c/div\u003e\n\n\n\n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n  \n    \n    \n    \n    \n      \u003cfigure aria-label=\"Media, iPhone Mirroring on MacBook Air, Safari Highlights on iMac, and Writing Tools on MacBook Pro. \"\u003e\n        \u003cdiv\u003e\n             \n              \n              \u003cdiv\u003e\n                macOS Sequoia now features iPhone Mirroring; new updates to Safari, video conferencing, and more; and starting next month, will mark the arrival of Apple Intelligence on Mac.\n              \u003c/div\u003e\n            \n            \n            \n            \n            \u003ca href=\"https://www.apple.com/newsroom/images/2024/09/macos-sequoia-is-available-today/article/Apple-macOS-Sequoia-hero.zip\" download=\"\" data-analytics-title=\"download image - Apple-macOS-Sequoia-hero_big\" aria-label=\"Download media, iPhone Mirroring on MacBook Air, Safari Highlights on iMac, and Writing Tools on MacBook Pro. \"\u003e\u003c/a\u003e\n          \u003c/div\u003e\n      \u003c/figure\u003e\n    \n  \n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003cdiv\u003e\u003ca href=\"https://www.apple.com/macos/macos-sequoia/\" target=\"_blank\"\u003emacOS Sequoia\u003c/a\u003e, the latest version of the world’s most advanced desktop operating system, is available today as a free software update for Mac. macOS Sequoia brings exciting new features, including iPhone Mirroring, which expands Continuity by enabling access to and control of iPhone directly from macOS; big updates to Safari; a new Passwords app; and more. Starting next month, macOS Sequoia will introduce Apple Intelligence,\u003csup\u003e1\u003c/sup\u003e the personal intelligence system that combines the power of generative models with personal context to deliver intelligence that is incredibly useful and relevant while protecting users’ privacy and security.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eHere’s a look at the top features Mac users can experience when they update to macOS Sequoia.\n\u003c/div\u003e\n                 \n             \n                 \u003ch2\u003e\u003cstrong\u003eiPhone Mirroring\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eWorking across iPhone and Mac gets even easier with the newest Continuity feature in macOS Sequoia — iPhone Mirroring. Users can now access and engage with their iPhone right from their Mac. Custom wallpaper and app icons appear just like on iPhone. With iPhone Mirroring, users can also swipe between pages on the Home Screen; launch and browse favorite apps; and review and respond to iPhone notifications directly from their Mac. And iPhone remains locked the whole time, so nobody else can access or see what the user is doing. It also works great with StandBy, so users can continue to get information at a glance on their iPhone as they use iPhone Mirroring.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n\n\n  \n    \n    \n    \n    \n      \u003cfigure aria-label=\"Media, An iPhone Home Screen displayed on MacBook Pro.\"\u003e\n        \u003cdiv\u003e\n             \n              \n              \u003cdiv\u003e\n                With iPhone Mirroring, users can now fully access and engage with their iPhone right from Mac while iPhone remains locked nearby.\n              \u003c/div\u003e\n            \n            \n            \n            \n            \u003ca href=\"https://www.apple.com/newsroom/images/2024/09/macos-sequoia-is-available-today/article/Apple-macOS-Sequoia-iPhone-Mirroring.zip\" download=\"\" data-analytics-title=\"download image - Apple-macOS-Sequoia-iPhone-Mirroring_big\" aria-label=\"Download media, An iPhone Home Screen displayed on MacBook Pro.\"\u003e\u003c/a\u003e\n          \u003c/div\u003e\n      \u003c/figure\u003e\n    \n  \n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003eMore Surfing Power in Safari\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eSafari is the world’s fastest browser,\u003csup\u003e2\u003c/sup\u003e and it’s even easier to discover new information on the web with the new Highlights feature. Powered by machine learning, Highlights automatically surfaces directions for a location, summaries of articles, or quick links to learn more about people, music, movies, and TV shows. A redesigned Reader allows users to read articles more quickly with a streamlined view, a summary, and a table of contents, and a new Viewer helps users put videos front and center while still giving them full access to system playback controls. With Distraction Control, users can hide items on a webpage that they may find disruptive to their browsing.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n    \n    \n        \n        \n        \n            \u003cdiv role=\"group\" aria-label=\"gallery\" data-component-list=\"MixinGallery\" id=\"safari-updates\"\u003e\n            \u003cnav role=\"presentation\"\u003e\n                \u003cul role=\"tablist\"\u003e\n                    \n                        \u003cli role=\"presentation\"\u003e\n                            \u003ca id=\"gallery-dotnav-984949e56a050c36552daef221aceec0\" href=\"#gallery-984949e56a050c36552daef221aceec0\" data-ac-gallery-trigger=\"gallery-984949e56a050c36552daef221aceec0\"\u003e\u003cspan\u003eA highlight showing directions to a hotel displayed on MacBook Pro.\u003c/span\u003e\u003c/a\u003e\n                        \u003c/li\u003e\n                    \n                        \u003cli role=\"presentation\"\u003e\n                            \u003ca id=\"gallery-dotnav-a0613d60c531e8d56682ee733d992532\" href=\"#gallery-a0613d60c531e8d56682ee733d992532\" data-ac-gallery-trigger=\"gallery-a0613d60c531e8d56682ee733d992532\"\u003e\u003cspan\u003eA web article displayed in Reader mode.\u003c/span\u003e\u003c/a\u003e\n                        \u003c/li\u003e\n                    \n                \u003c/ul\u003e\n            \u003c/nav\u003e\n            \u003cdiv\u003e\n                \n                    \n                        \n                        \u003cdiv id=\"gallery-984949e56a050c36552daef221aceec0\" aria-labelledby=\"gallery-dotnav-984949e56a050c36552daef221aceec0\" data-gallery-item=\"\"\u003e\n                            \u003cfigure role=\"presentation\" data-analytics-activitymap-region-id=\"Gallery:highlights\"\u003e\n                                \n                                \u003cdiv\u003e\n                                    \u003cdiv\u003eHighlights in Safari make it even easier to discover information on the web, quickly pulling up relevant information about a site.\u003c/div\u003e\n                                    \n                                    \n                                    \u003ca href=\"https://www.apple.com/newsroom/images/2024/09/macos-sequoia-is-available-today/article/Apple-macOS-Sequoia-Safari-Highlights.zip\" download=\"\" data-analytics-title=\"download image - Apple-macOS-Sequoia-Safari-Highlights_big\" aria-label=\"Download media, A highlight showing directions to a hotel displayed on MacBook Pro.\"\u003e\u003c/a\u003e\n                                \u003c/div\u003e\n                            \u003c/figure\u003e\n                        \u003c/div\u003e\n                        \n                    \n                \n                    \n                        \n                        \u003cdiv id=\"gallery-a0613d60c531e8d56682ee733d992532\" aria-labelledby=\"gallery-dotnav-a0613d60c531e8d56682ee733d992532\" data-gallery-item=\"\"\u003e\n                            \u003cfigure role=\"presentation\" data-analytics-activitymap-region-id=\"Gallery:reader\"\u003e\n                                \n                                \u003cdiv\u003e\n                                    \u003cdiv\u003eA redesigned Reader delivers a streamlined view of an article, a summary, and a table of contents for longer articles.\u003c/div\u003e\n                                    \n                                    \n                                    \u003ca href=\"https://www.apple.com/newsroom/images/2024/09/macos-sequoia-is-available-today/article/Apple-macOS-Sequoia-Safari-Reader.zip\" download=\"\" data-analytics-title=\"download image - Apple-macOS-Sequoia-Safari-Reader_big\" aria-label=\"Download media, A web article displayed in Reader mode.\"\u003e\u003c/a\u003e\n                                \u003c/div\u003e\n                            \u003c/figure\u003e\n                        \u003c/div\u003e\n                        \n                    \n                \n            \u003c/div\u003e\n            \n                \n                \n                \u003cnav role=\"presentation\"\u003e\n                    \n                        \u003cul\u003e\n                            \u003cli\u003e\n                                \n                            \u003c/li\u003e\n                            \u003cli\u003e\n                                \n                            \u003c/li\u003e\n                        \u003c/ul\u003e\n                    \n                \u003c/nav\u003e\n            \n        \u003c/div\u003e\n    \n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003eEasier Window Tiling\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eNew ways to arrange windows let users stay organized with the layout that works best for them. By simply dragging a window to the edge of the screen, macOS Sequoia automatically suggests a tiled position on the user’s desktop. Users can release a window right into place, quickly arrange tiles side by side, or place them in corners to keep even more apps in view. And new keyboard and menu shortcuts help organize tiles even faster.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n\n\n  \n    \n    \n    \n    \n      \u003cfigure aria-label=\"Media, Three tiles of app windows displayed on MacBook Pro.\"\u003e\n        \u003cdiv\u003e\n             \n              \n              \u003cdiv\u003e\n                Easier window tiling lets users quickly drag windows into key areas on their screen to effortlessly arrange them into side-by-side tiles, or place them into corners to keep even more apps in view.\n              \u003c/div\u003e\n            \n            \n            \n            \n            \u003ca href=\"https://www.apple.com/newsroom/images/2024/09/macos-sequoia-is-available-today/article/Apple-macOS-Sequoia-window-tiling.zip\" download=\"\" data-analytics-title=\"download image - Apple-macOS-Sequoia-window-tiling_big\" aria-label=\"Download media, Three tiles of app windows displayed on MacBook Pro.\"\u003e\u003c/a\u003e\n          \u003c/div\u003e\n      \u003c/figure\u003e\n    \n  \n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003eA New Passwords App\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eAn all-new Passwords app makes it even easier to access passwords, passkeys, Wi-Fi passwords, and other credentials all in one convenient place on Mac. The Passwords app is backed by incredibly secure end-to-end encryption. It works great with Safari, and seamlessly syncs between all of a user’s Apple devices and Windows with the iCloud for Windows app.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n\n\n  \n    \n    \n    \n    \n      \u003cfigure aria-label=\"Media, The new Passwords app in macOS Sequoia.\"\u003e\n        \u003cdiv\u003e\n             \n              \n              \u003cdiv\u003e\n                A new Passwords app makes it even easier to access passwords and organize credentials all in one place.\n              \u003c/div\u003e\n            \n            \n            \n            \n            \u003ca href=\"https://www.apple.com/newsroom/images/2024/09/macos-sequoia-is-available-today/article/Apple-macOS-Sequoia-Passwords-app.zip\" download=\"\" data-analytics-title=\"download image - Apple-macOS-Sequoia-Passwords-app_big\" aria-label=\"Download media, The new Passwords app in macOS Sequoia.\"\u003e\u003c/a\u003e\n          \u003c/div\u003e\n      \u003c/figure\u003e\n    \n  \n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003eVideo Conferencing Updates\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eDuring video calls in FaceTime or third-party apps like Webex, users can apply beautiful built-in backgrounds, including a variety of color gradients or shots of the scenery in and around locations like Apple Park in Cupertino, California. They can even upload their own photos to use as a background, And with Apple’s industry-leading segmentation, users will look their best on every call. With presenter preview, users can now see what they’re about to share before sharing it with apps like FaceTime and Zoom.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n\n\n  \n    \n    \n    \n    \n      \u003cfigure aria-label=\"Media, A FaceTime session with a selected background in macOS Sequoia.\"\u003e\n        \u003cdiv\u003e\n             \n              \n              \u003cdiv\u003e\n                Users can select beautiful built-in backgrounds, while Apple’s industry-leading segmentation technology helps them look their best while video conferencing with macOS Sequoia.\n              \u003c/div\u003e\n            \n            \n            \n            \n            \u003ca href=\"https://www.apple.com/newsroom/images/2024/09/macos-sequoia-is-available-today/article/Apple-macOS-Sequoia-video-conferencing-backgrounds.zip\" download=\"\" data-analytics-title=\"download image - Apple-macOS-Sequoia-video-conferencing-backgrounds_big\" aria-label=\"Download media, A FaceTime session with a selected background in macOS Sequoia.\"\u003e\u003c/a\u003e\n          \u003c/div\u003e\n      \u003c/figure\u003e\n    \n  \n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003eComing Soon: Apple Intelligence\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003e\u003ca href=\"https://www.apple.com/newsroom/2024/09/apple-intelligence-comes-to-iphone-ipad-and-mac-starting-next-month/\" target=\"_blank\"\u003eApple Intelligence\u003c/a\u003e will transform what users can do with Mac, delivering intelligence that is incredibly useful and relevant to them, while protecting their privacy and keeping them in control of their data. Apple Intelligence will be available on Macs with an M-series chip, harnessing the power of Apple silicon and the Neural Engine to understand and create language and images; take action across apps; and draw from personal context to simplify and accelerate everyday tasks. Writing Tools help rewrite, proofread, and summarize text. Siri becomes more natural, flexible, and deeply integrated into the system experience, and with richer language-understanding capabilities, Siri can follow along when users stumble over their words. Siri can also maintain context from one request to the next. Mac users can type to Siri and fluidly switch between text and voice to accelerate everyday tasks. In addition, with Siri’s extensive product knowledge, users can now get answers to thousands of questions about the features and settings on Mac. With many of the Apple Intelligence models running entirely on device, as well as the introduction of Private Cloud Compute — which extends the privacy and security of Apple devices into the cloud to unlock even more intelligence — Apple Intelligence introduces an extraordinary step forward for privacy in artificial intelligence.\n\u003c/div\u003e\n                 \n             \n                 \u003ch2\u003e\u003cstrong\u003eAdditional Features\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eIn macOS Sequoia, there are many more unique and useful features added to users’ favorite Mac apps.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003eMessages\u003c/strong\u003e\u003cbr/\u003e\n\nIn Messages, users can now schedule messages to send later. Text messages can also come to life with unique text effects that visually amplify words or emoji with animations like “explode,” “ripple,” and “nod,” and users can even tap back with any emoji or sticker they want.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003eNotes\u003c/strong\u003e\u003cbr/\u003e\n\nIn the\u003cstrong\u003e \u003c/strong\u003eNotes app, users can now record audio and receive a live transcription, making it incredibly easy to capture every detail of a lecture, meeting, or conversation, and Apple Intelligence will automatically generate a summary. Math Notes also comes to macOS Sequoia, enabling users to instantly solve an expression or math problem simply by typing it into the Notes app on Mac.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003eMaps\u003c/strong\u003e\u003cbr/\u003e\n\nIn the Maps app, outdoor enthusiasts gain access to stunning topographic maps and a selection of thousands of hikes available across U.S. national parks. Additionally, users can now easily create custom walking and hiking routes with just a few clicks.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n    \n    \n        \n        \n        \n            \u003cdiv role=\"group\" aria-label=\"gallery\" data-component-list=\"MixinGallery\" id=\"apple-intelligence\"\u003e\n            \u003cnav role=\"presentation\"\u003e\n                \u003cul role=\"tablist\"\u003e\n                    \n                        \u003cli role=\"presentation\"\u003e\n                            \u003ca id=\"gallery-dotnav-96c64d8473a704d0f7508748c4f90395\" href=\"#gallery-96c64d8473a704d0f7508748c4f90395\" data-ac-gallery-trigger=\"gallery-96c64d8473a704d0f7508748c4f90395\"\u003e\u003cspan\u003eA conversation in Messages showing the send later feature.\u003c/span\u003e\u003c/a\u003e\n                        \u003c/li\u003e\n                    \n                        \u003cli role=\"presentation\"\u003e\n                            \u003ca id=\"gallery-dotnav-34bf9e8fc581bcd1497ffa6bd09c44d6\" href=\"#gallery-34bf9e8fc581bcd1497ffa6bd09c44d6\" data-ac-gallery-trigger=\"gallery-34bf9e8fc581bcd1497ffa6bd09c44d6\"\u003e\u003cspan\u003eA custom hiking route displayed in Apple Maps.\u003c/span\u003e\u003c/a\u003e\n                        \u003c/li\u003e\n                    \n                \u003c/ul\u003e\n            \u003c/nav\u003e\n            \u003cdiv\u003e\n                \n                    \n                        \n                        \u003cdiv id=\"gallery-96c64d8473a704d0f7508748c4f90395\" aria-labelledby=\"gallery-dotnav-96c64d8473a704d0f7508748c4f90395\" data-gallery-item=\"\"\u003e\n                            \u003cfigure role=\"presentation\" data-analytics-activitymap-region-id=\"Gallery:messages\"\u003e\n                                \n                                \u003cdiv\u003e\n                                    \u003cdiv\u003emacOS Sequoia lets users schedule text messages to send later in the Messages app.\u003c/div\u003e\n                                    \n                                    \n                                    \u003ca href=\"https://www.apple.com/newsroom/images/2024/09/macos-sequoia-is-available-today/article/Apple-macOS-Sequoia-Messages-Send-Later.zip\" download=\"\" data-analytics-title=\"download image - Apple-macOS-Sequoia-Messages-Send-Later_big\" aria-label=\"Download media, A conversation in Messages showing the send later feature.\"\u003e\u003c/a\u003e\n                                \u003c/div\u003e\n                            \u003c/figure\u003e\n                        \u003c/div\u003e\n                        \n                    \n                \n                    \n                        \n                        \u003cdiv id=\"gallery-34bf9e8fc581bcd1497ffa6bd09c44d6\" aria-labelledby=\"gallery-dotnav-34bf9e8fc581bcd1497ffa6bd09c44d6\" data-gallery-item=\"\"\u003e\n                            \u003cfigure role=\"presentation\" data-analytics-activitymap-region-id=\"Gallery:maps\"\u003e\n                                \n                                \u003cdiv\u003e\n                                    \u003cdiv\u003eFor those looking for new adventures, Apple Maps offers thousands of hikes across U.S. national parks, and users can also create custom hikes and walking routes.\u003c/div\u003e\n                                    \n                                    \n                                    \u003ca href=\"https://www.apple.com/newsroom/images/2024/09/macos-sequoia-is-available-today/article/Apple-macOS-Sequoia-Apple-Maps-topographic.zip\" download=\"\" data-analytics-title=\"download image - Apple-macOS-Sequoia-Apple-Maps-topographic_big\" aria-label=\"Download media, A custom hiking route displayed in Apple Maps.\"\u003e\u003c/a\u003e\n                                \u003c/div\u003e\n                            \u003c/figure\u003e\n                        \u003c/div\u003e\n                        \n                    \n                \n            \u003c/div\u003e\n            \n                \n                \n                \u003cnav role=\"presentation\"\u003e\n                    \n                        \u003cul\u003e\n                            \u003cli\u003e\n                                \n                            \u003c/li\u003e\n                            \u003cli\u003e\n                                \n                            \u003c/li\u003e\n                        \u003c/ul\u003e\n                    \n                \u003c/nav\u003e\n            \n        \u003c/div\u003e\n    \n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003eFor a comprehensive list of everything that’s new in macOS Sequoia, visit \u003ca href=\"https://www.apple.com/macos/macos-sequoia/\" target=\"_blank\"\u003eapple.com/macos/macos-sequoia\u003c/a\u003e.\n\u003c/div\u003e\n \n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003emacOS Sequoia is a free software update that is available starting today. For more information, visit \u003ca href=\"https://www.apple.com/macos/macos-sequoia/\" target=\"_blank\"\u003eapple.com/macos/macos-sequoia\u003c/a\u003e. Some features may not be available in all regions or in all languages.\n\u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n    \n    \n        \n    \n\n\n    \n    \n    \n\n\n\n    \n    \n    \n\n\n\n\n\n    \n    \n    \u003cdiv\u003e\n            \u003col\u003e\n\u003cli\u003eApple Intelligence will be available as a free software update. The first set of Apple Intelligence features will be available in beta next month as part of iOS 18.1, iPadOS 18.1, and macOS Sequoia 15.1, with more features rolling out in the months to come. It will be available on iPhone 16, iPhone 16 Plus, iPhone 16 Pro, iPhone 16 Pro Max, iPhone 15 Pro, iPhone 15 Pro Max, and iPad and Mac with M1 and later, with device and Siri language set to U.S. English. Later this year, Apple Intelligence will add support for localized English in Australia, Canada, New Zealand, South Africa, and the U.K. Over the course of the next year, Apple Intelligence will expand to more platforms and languages, like Chinese, English (India), English (Singapore), French, German, Italian, Japanese, Korean, Portuguese, Spanish, Vietnamese, and others.\u003c/li\u003e\n\u003cli\u003eTesting was conducted by Apple in August 2024. See \u003ca href=\"https://www.apple.com/safari/\" target=\"_blank\"\u003eapple.com/safari\u003c/a\u003e for more information.\u003c/li\u003e\n\u003c/ol\u003e\n\n        \u003c/div\u003e\n\n\n\n    \n    \n    \n\n\n\n\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\n\n\u003c/article\u003e\n\n\n\n\u003c/section\u003e\n\u003c/main\u003e\n\n\n\t\n\n\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": null,
  "modifiedTime": null
}
