{
  "id": "1e6a9ea4-9c85-47c3-bbe1-aee6e0869020",
  "title": "‘In Defeat: Defiance’",
  "link": "https://www.thebulwark.com/p/what-will-trumps-win-mean",
  "description": "",
  "author": "John Gruber",
  "published": "2024-11-06T21:44:54Z",
  "source": "https://daringfireball.net/feeds/main",
  "categories": null,
  "byline": "William Kristol, Andrew Egger",
  "length": 9044,
  "excerpt": "What happened and what comes next.",
  "siteName": "The Bulwark",
  "favicon": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9304d804-0372-498e-b7b1-b09155c9840a%2Fapple-touch-icon-1024x1024.png",
  "text": "Well, here we go again. Happy Wednesday.Donald Trump points to supporters with Melania Trump during an election night event at the Palm Beach Convention Center on November 06, 2024 in West Palm Beach, Florida. (Photo by Chip Somodevilla / Getty Images.)by William KristolThe American people have made a disastrous choice. And they have done so decisively, and with their eyes wide open.Donald J. Trump will be our next president, elected with a majority of the popular vote, likely winning both more votes and more states than he did in his two previous elections. After everything—after his chaotic presidency, after January 6th, after the last year in which the mask was increasingly off, and no attempt was made to hide the extremism of the agenda or the ugliness of the appeal—the American people liked what they saw. At a minimum, they were willing to accept what they saw.And Trump was running against a competent candidate who ran a good campaign to the center and bested him in a debate, with a strong economy. Yet Trump prevailed, pulling off one of the most remarkable comebacks in American political history. Trump boasted last night, “We’ve achieved the most incredible political thing,” and he’s not altogether wrong.Certainly, even before he once again assumes the reins of power, Trump has cemented his status as the most consequential American politician of this century.And when he assumes the reins of power, he’ll start off as a powerful and emboldened president. He’ll have extraordinary momentum from his victory. He’ll be able to claim a mandate for an agenda that the public has approved. He’ll have willing apparatchiks and politicians at his disposal, under the guidance of JD Vance and Elon Musk and Tucker Carlson and Stephen Miller, eager to help him advance that agenda. He’ll have a compliant Republican majority in the Senate. And it looks as if Republicans may narrowly hold the House.It’s hard to imagine a worse outcome.If you think, as I do, that Trump’s agenda could do great damage to the country and to the world, if you think of deportations of immigrants at home and the betrayal of brave Ukrainians abroad and you shudder, if you think that turning our health policy over to Robert Kennedy Jr. will cause real harm, you’re right to feel real foreboding for the future.And of course there is no guarantee that the American people will turn against Trump and his agenda. They knew fully well who it was they were choosing this time. Their support may well be more stubborn than one would like. It certainly has been over the last four years.So: We can lament our situation. We can analyze how we got here. We can try to learn lessons from what has happened. We have to do all these things.But we can’t only do those things. As Churchill put it: “In Defeat: Defiance.” We’ll have to keep our nerve and our principles against all the pressure to abandon them. We’ll have to fight politically and to resist lawfully. We’ll have to do our best to limit the damage from Trump. And we’ll have to lay the groundwork for future recovery.To do all this, we’ll have to constitute a strong opposition and a loyal opposition, loyal to the Declaration and the Constitution, loyal to the past achievements and future promise of this nation, loyal to what America has been and should be.And we’ll have to have the fortitude to say, ‘Yes, at times a majority of the American people can be wrong.’ That they were wrong on November 5, 2024. That vox populi is not vox Dei.I’ve sometimes quoted John McCain’s wonderful comment, something he used to say with deadpan irony: It’s always darkest . . . before it turns pitch black.But the real McCain was cheerful about life and hopeful about America.So as I write this before dawn Wednesday morning, and as I contemplate the dark and difficult period ahead, I’ll instead invoke, as he would in this circumstance, the original sentiment that he was using as his foil. As the mid-nineteenth century Irish writer Samuel Lover remarked:There is a beautiful saying amongst the Irish peasantry to inspire hope under adverse circumstances: “Remember,” they say, “that the darkest hour of all, is the hour before day.”“Hope under adverse circumstances.” That’s what we need. Hope followed by thought and action, all to help bring about a new day for a great nation which has, for now, made a terrible mistake.by Andrew EggerDonald Trump will return to power with a popular-majority mandate. What remains to be seen is how big an impediment, if at all, the Congress will be.A few Senate races remain too close to call, but Republicans have already locked up 52 seats, and seem poised to pick up at least one more. Trump won’t have any trouble here: 52 was the number of Republicans he needed to neutralize frequent internal opposition from moderate Sens. Susan Collins and Lisa Murkowski. His priorities—at least those which Republicans can pass through the filibuster-dodging budget reconciliation process—will pass in the Senate, and he’ll have little trouble confirming the cabinet of lickspittles he desires. His federal criminal cases are already a thing of the past.Meanwhile, control of the House of Representatives is still technically up in the air. But signs seem to point to yet another Republican majority, clocking in somewhere between tiny and small. The current tiny Republican majority, of course, spent the last two years in perpetual internal bickering and chaos. But that was because Republicans currently have no policy consensus on a number of major issues. What they do have a consensus on is doing Trump’s bidding.Trump remains the most polarizing and controversial politician of our age. But what was most remarkable last night is how little that registered with voters. In fact, it may have helped. As we noted yesterday, incumbents around the world have been swept out of power over the last two years thanks to voter anger over global unrest and post-pandemic shocks to the economy. America may have weathered these shocks better than anyone else, but it didn’t matter. Americans followed suit anyway.Democrats are left demoralized, their political coalitions shattered by a man they once thought was the last gasp of a dying strategy—running up the numbers with the white working class—without a clear sense of how they must course-correct. The knives are coming out already.But the hard truth, after as staggering a loss as this, is that there may never have been a path for Harris. Biden was too unpopular and got out of the race way too late. And Harris found herself trapped. She needed to run away from Biden to escape the voters’ wrath at his term. But she also needed to run toward him as her only defense against Republican charges that she was too far to the left: After all, that was how she’d positioned herself in 2020 before she joined his ticket. In a polarized, doom-and-gloom electorate, both moves likely cost her more voters than they gained her.This wasn’t the race she asked for—to be the last person standing to mount a furious defense against the rising tide of Trump’s lawless populism. The campaign she waged, given the circumstances, was likely the strongest anyone in her position could have mustered. In the end, how well or poorly she piloted her campaign just didn’t matter. Trump was blessed in 2016 to run against one of the weakest Democratic candidates ever put forward; this year, he was blessed to run against the woman left holding the bag, however stoically, for a president who had proven incapable of holding it himself.ShareTHE ABORTION-BALLOT OUTER LIMITS: Even abortion access—one of Democrats’ strongest issues over the last two years—ran into a wall for the first time at the polls last night. Until yesterday, no state referendum in the wake of Dobbs had failed to deliver increased access. Last night, Missouri and Arizona enshrined a right to abortion in their state constitutions. But similar efforts failed in Florida—thanks to a 60-percent threshold for constitutional amendments the effort could not surmount—and in South Dakota, a ruby-red state with a libertarian streak in ballot measures.WHERE’S GEORGE SOROS WHEN YOU NEED HIM?: Are we allowed a couple little laughs amid the blackness? First, it sure is remarkable how Democrats—four years after supposedly conjuring millions of fraudulent Biden ballots in the dead of night to sweep Donald Trump out of power—completely failed to do the same this cycle. Our dastardly elites who can steal elections at will really dropped the ball!And second: It remains very funny that—as of now! Knock on wood!—Arizona’s Kari Lake seems to be the Republican senate candidate who is underperforming the hardest. Trump may have swept Republicans back to their strongest position in decades, but Lake has proven that, for people not named Donald Trump, actually trying to be Trump remains a dead end.ShareEDITOR’S NOTE, November 6, 2024: An earlier version of this newsletter referred to the budget reconciliation process as ballot reconciliation. Two different things!",
  "image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F08b86b7d-8fda-44d5-b9f0-e674d167371f_4811x3207.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv dir=\"auto\"\u003e\u003cp\u003e\u003cspan\u003eWell, here we go again. \u003c/span\u003e\u003cem\u003e\u003cstrong\u003eHappy Wednesday.\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003ca target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F08b86b7d-8fda-44d5-b9f0-e674d167371f_4811x3207.jpeg\" data-component-name=\"Image2ToDOM\" rel=\"\"\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F08b86b7d-8fda-44d5-b9f0-e674d167371f_4811x3207.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F08b86b7d-8fda-44d5-b9f0-e674d167371f_4811x3207.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F08b86b7d-8fda-44d5-b9f0-e674d167371f_4811x3207.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F08b86b7d-8fda-44d5-b9f0-e674d167371f_4811x3207.jpeg 1456w\" sizes=\"100vw\"/\u003e\u003cimg src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F08b86b7d-8fda-44d5-b9f0-e674d167371f_4811x3207.jpeg\" width=\"1456\" height=\"971\" data-attrs=\"{\u0026#34;src\u0026#34;:\u0026#34;https://substack-post-media.s3.amazonaws.com/public/images/08b86b7d-8fda-44d5-b9f0-e674d167371f_4811x3207.jpeg\u0026#34;,\u0026#34;srcNoWatermark\u0026#34;:null,\u0026#34;fullscreen\u0026#34;:null,\u0026#34;imageSize\u0026#34;:null,\u0026#34;height\u0026#34;:971,\u0026#34;width\u0026#34;:1456,\u0026#34;resizeWidth\u0026#34;:null,\u0026#34;bytes\u0026#34;:7194600,\u0026#34;alt\u0026#34;:null,\u0026#34;title\u0026#34;:null,\u0026#34;type\u0026#34;:\u0026#34;image/jpeg\u0026#34;,\u0026#34;href\u0026#34;:null,\u0026#34;belowTheFold\u0026#34;:false,\u0026#34;topImage\u0026#34;:true,\u0026#34;internalRedirect\u0026#34;:null,\u0026#34;isProcessing\u0026#34;:false}\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F08b86b7d-8fda-44d5-b9f0-e674d167371f_4811x3207.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F08b86b7d-8fda-44d5-b9f0-e674d167371f_4811x3207.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F08b86b7d-8fda-44d5-b9f0-e674d167371f_4811x3207.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F08b86b7d-8fda-44d5-b9f0-e674d167371f_4811x3207.jpeg 1456w\" sizes=\"100vw\" fetchpriority=\"high\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003c/a\u003e\u003cfigcaption\u003eDonald Trump points to supporters with Melania Trump during an election night event at the Palm Beach Convention Center on November 06, 2024 in West Palm Beach, Florida. (Photo by Chip Somodevilla / Getty Images.)\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003cem\u003eby William Kristol\u003c/em\u003e\u003c/p\u003e\u003cp\u003eThe American people have made a disastrous choice. And they have done so decisively, and with their eyes wide open.\u003c/p\u003e\u003cp\u003eDonald J. Trump will be our next president, elected with a majority of the popular vote, likely winning both more votes and more states than he did in his two previous elections. After everything—after his chaotic presidency, after January 6th, after the last year in which the mask was increasingly off, and no attempt was made to hide the extremism of the agenda or the ugliness of the appeal—the American people liked what they saw. At a minimum, they were willing to accept what they saw.\u003c/p\u003e\u003cp\u003eAnd Trump was running against a competent candidate who ran a good campaign to the center and bested him in a debate, with a strong economy. Yet Trump prevailed, pulling off one of the most remarkable comebacks in American political history. Trump boasted last night, “We’ve achieved the most incredible political thing,” and he’s not altogether wrong.\u003c/p\u003e\u003cp\u003eCertainly, even before he once again assumes the reins of power, Trump has cemented his status as the most consequential American politician of this century.\u003c/p\u003e\u003cp\u003eAnd when he assumes the reins of power, he’ll start off as a powerful and emboldened president. He’ll have extraordinary momentum from his victory. He’ll be able to claim a mandate for an agenda that the public has approved. He’ll have willing apparatchiks and politicians at his disposal, under the guidance of JD Vance and Elon Musk and Tucker Carlson and Stephen Miller, eager to help him advance that agenda. He’ll have a compliant Republican majority in the Senate. And it looks as if Republicans may narrowly hold the House.\u003c/p\u003e\u003cp\u003eIt’s hard to imagine a worse outcome.\u003c/p\u003e\u003cp\u003eIf you think, as I do, that Trump’s agenda could do great damage to the country and to the world, if you think of deportations of immigrants at home and the betrayal of brave Ukrainians abroad and you shudder, if you think that turning our health policy over to Robert Kennedy Jr. will cause real harm, you’re right to feel real foreboding for the future.\u003c/p\u003e\u003cp\u003eAnd of course there is no guarantee that the American people will turn against Trump and his agenda. They knew fully well who it was they were choosing this time. Their support may well be more stubborn than one would like. It certainly has been over the last four years.\u003c/p\u003e\u003cp\u003eSo: We can lament our situation. We can analyze how we got here. We can try to learn lessons from what has happened. We have to do all these things.\u003c/p\u003e\u003cp\u003eBut we can’t only do those things. As Churchill put it: “In Defeat: Defiance.” We’ll have to keep our nerve and our principles against all the pressure to abandon them. We’ll have to fight politically and to resist lawfully. We’ll have to do our best to limit the damage from Trump. And we’ll have to lay the groundwork for future recovery.\u003c/p\u003e\u003cp\u003eTo do all this, we’ll have to constitute a strong opposition and a loyal opposition, loyal to the Declaration and the Constitution, loyal to the past achievements and future promise of this nation, loyal to what America has been and should be.\u003c/p\u003e\u003cp\u003eAnd we’ll have to have the fortitude to say, ‘Yes, at times a majority of the American people can be wrong.’ That they were wrong on November 5, 2024. That vox populi is not vox Dei.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eI’ve sometimes quoted John McCain’s wonderful comment, something he used to say with deadpan irony: \u003c/span\u003e\u003cem\u003eIt’s always darkest . . . before it turns pitch black\u003c/em\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eBut the real McCain was cheerful about life and hopeful about America.\u003c/p\u003e\u003cp\u003eSo as I write this before dawn Wednesday morning, and as I contemplate the dark and difficult period ahead, I’ll instead invoke, as he would in this circumstance, the original sentiment that he was using as his foil. As the mid-nineteenth century Irish writer Samuel Lover remarked:\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003eThere is a beautiful saying amongst the Irish peasantry to inspire hope under adverse circumstances: “Remember,” they say, “that the darkest hour of all, is the hour before day.”\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e“Hope under adverse circumstances.” That’s what we need. Hope followed by thought and action, all to help bring about a new day for a great nation which has, for now, made a terrible mistake.\u003c/p\u003e\u003cp\u003e\u003cem\u003eby Andrew Egger\u003c/em\u003e\u003c/p\u003e\u003cp\u003eDonald Trump will return to power with a popular-majority mandate. What remains to be seen is how big an impediment, if at all, the Congress will be.\u003c/p\u003e\u003cp\u003eA few Senate races remain too close to call, but Republicans have already locked up 52 seats, and seem poised to pick up at least one more. Trump won’t have any trouble here: 52 was the number of Republicans he needed to neutralize frequent internal opposition from moderate Sens. Susan Collins and Lisa Murkowski. His priorities—at least those which Republicans can pass through the filibuster-dodging budget reconciliation process—will pass in the Senate, and he’ll have little trouble confirming the cabinet of lickspittles he desires. His federal criminal cases are already a thing of the past.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMeanwhile, control of the House of Representatives is still technically up in the air. But signs seem to point to yet another Republican majority, clocking in somewhere between tiny and small. The current tiny Republican majority, of course, spent the last two years in perpetual internal bickering and chaos. But that was because Republicans currently have no policy consensus on a number of major issues. What they \u003c/span\u003e\u003cem\u003edo \u003c/em\u003e\u003cspan\u003ehave a consensus on is doing Trump’s bidding.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eTrump remains the most polarizing and controversial politician of our age. But what was most remarkable last night is how little that registered with voters. In fact, it may have helped. As we noted yesterday, incumbents around the world have been swept out of power over the last two years thanks to voter anger over global unrest and post-pandemic shocks to the economy. America may have weathered these shocks \u003c/span\u003e\u003ca href=\"https://www.brookings.edu/articles/the-us-recovery-from-covid-19-in-international-comparison/#:~:text=As%20the%20economy%20continues%20to,of%20its%20G10%20peer%20countries.\" rel=\"\"\u003ebetter than anyone else\u003c/a\u003e\u003cspan\u003e, but it didn’t matter. Americans followed suit anyway.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eDemocrats are left demoralized, their political coalitions shattered by a man they once thought was the last gasp of a dying strategy—running up the numbers with the white working class—without a clear sense of how they must course-correct. The knives are coming out already.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBut the hard truth, after as staggering a loss as this, is that there may \u003c/span\u003e\u003cem\u003enever \u003c/em\u003e\u003cspan\u003ehave been a path for Harris. Biden was too unpopular and got out of the race way too late. And Harris found herself trapped. She needed to run away from Biden to escape the voters’ wrath at his term. But she also needed to run \u003c/span\u003e\u003cem\u003etoward \u003c/em\u003e\u003cspan\u003ehim as her only defense against Republican charges that she was too far to the left: After all, that was how she’d positioned herself in 2020 before she joined his ticket. In a polarized, doom-and-gloom electorate, both moves likely cost her more voters than they gained her.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThis wasn’t the race she asked for—to be the last person standing to mount a furious defense against the rising tide of Trump’s lawless populism. The campaign she waged, given the circumstances, was likely the strongest anyone in her position could have mustered. In the end, how well or poorly she piloted her campaign just didn’t matter. Trump was blessed in 2016 to run against one of the weakest Democratic candidates ever put forward; this year, he was blessed to run against the woman left holding the bag, however stoically, for a president who had proven incapable of holding it himself.\u003c/p\u003e\u003cp data-attrs=\"{\u0026#34;url\u0026#34;:\u0026#34;https://www.thebulwark.com/p/what-will-trumps-win-mean?utm_source=substack\u0026amp;utm_medium=email\u0026amp;utm_content=share\u0026amp;action=share\u0026#34;,\u0026#34;text\u0026#34;:\u0026#34;Share\u0026#34;,\u0026#34;action\u0026#34;:null,\u0026#34;class\u0026#34;:null}\" data-component-name=\"ButtonCreateButton\"\u003e\u003ca href=\"https://www.thebulwark.com/p/what-will-trumps-win-mean?utm_source=substack\u0026amp;utm_medium=email\u0026amp;utm_content=share\u0026amp;action=share\" rel=\"\"\u003e\u003cspan\u003eShare\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTHE ABORTION-BALLOT OUTER LIMITS: \u003c/strong\u003e\u003cspan\u003eEven abortion access—one of Democrats’ strongest issues over the last two years—ran into a wall for the first time at the polls last night. Until yesterday, no state referendum in the wake of \u003c/span\u003e\u003cem\u003eDobbs\u003c/em\u003e\u003cspan\u003e had failed to deliver increased access. Last night, Missouri and Arizona enshrined a right to abortion in their state constitutions. But similar efforts failed in Florida—thanks to a 60-percent threshold for constitutional amendments the effort could not surmount—and in South Dakota, a ruby-red state with a libertarian streak in ballot measures.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWHERE’S GEORGE SOROS WHEN YOU NEED HIM?: \u003c/strong\u003e\u003cspan\u003eAre we allowed a couple little laughs amid the blackness? First, it sure is remarkable how Democrats—four years after supposedly conjuring millions of fraudulent Biden ballots in the dead of night to sweep Donald Trump out of power—completely failed to do the same this cycle. Our dastardly elites who can steal elections at will really dropped the ball!\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAnd second: It remains very funny that—as of now! Knock on wood!—Arizona’s Kari Lake seems to be the Republican senate candidate who is underperforming the hardest. Trump may have swept Republicans back to their strongest position in decades, but Lake has proven that, for people not named Donald Trump, actually trying to \u003c/span\u003e\u003cem\u003ebe \u003c/em\u003e\u003cspan\u003eTrump remains a dead end.\u003c/span\u003e\u003c/p\u003e\u003cp data-attrs=\"{\u0026#34;url\u0026#34;:\u0026#34;https://www.thebulwark.com/p/what-will-trumps-win-mean?utm_source=substack\u0026amp;utm_medium=email\u0026amp;utm_content=share\u0026amp;action=share\u0026#34;,\u0026#34;text\u0026#34;:\u0026#34;Share\u0026#34;,\u0026#34;action\u0026#34;:null,\u0026#34;class\u0026#34;:null}\" data-component-name=\"ButtonCreateButton\"\u003e\u003ca href=\"https://www.thebulwark.com/p/what-will-trumps-win-mean?utm_source=substack\u0026amp;utm_medium=email\u0026amp;utm_content=share\u0026amp;action=share\" rel=\"\"\u003e\u003cspan\u003eShare\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEDITOR’S NOTE\u003c/strong\u003e\u003cspan\u003e, November 6, 2024: An earlier version of this newsletter referred to the \u003c/span\u003e\u003cem\u003ebudget reconciliation process \u003c/em\u003e\u003cspan\u003eas \u003c/span\u003e\u003cem\u003eballot reconciliation\u003c/em\u003e\u003cspan\u003e. Two different things!\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-11-06T14:30:01Z",
  "modifiedTime": null
}
