{
  "id": "1fcebf65-1282-41eb-8186-eb4205ce4678",
  "title": "The App Store prevented more than $9 billion in fraudulent transactions",
  "link": "https://www.apple.com/newsroom/2025/05/the-app-store-prevented-more-than-9-billion-usd-in-fraudulent-transactions/",
  "description": "",
  "author": "Apple Newsroom",
  "published": "2025-05-27T12:58:53.072Z",
  "source": "https://www.apple.com/newsroom/rss-feed.rss",
  "categories": [
    "UPDATE"
  ],
  "byline": "",
  "length": 12118,
  "excerpt": "In the last five years, the App Store has protected users by preventing over $9 billion in fraudulent transactions, including over $2 billion in 2024.",
  "siteName": "Apple Newsroom",
  "favicon": "",
  "text": "opens in new window The App Store prevented more than $9 billion in fraudulent transactions over the last five years In 2024 alone, Apple stopped over $2 billion in potentially fraudulent transactions and blocked nearly 2 million risky app submissions from reaching users Since launching in 2008, the App Store has been a safe and trusted place for users and a vibrant marketplace for developers to grow their businesses around the world. In the last five years, the App Store has protected users by preventing over $9 billion in fraudulent transactions, including over $2 billion in 2024 alone, according to Apple’s annual App Store fraud analysis. This reflects the App Store’s continued investment in fostering the most secure experience for users while providing developers with tools and resources, including a powerful commerce system that helps customers transact safely and securely in 175 regions around the globe. With an average of more than 813 million visitors a week, the App Store is a trusted destination for users to download their favorite apps and discover new ones. Preserving the App Store’s safe and secure marketplace requires constant vigilance, as bad actors continue to evolve their tactics in an attempt to defraud users. These threats range from deceptive apps designed to steal personal information, to fraudulent payment schemes that attempt to exploit users. Apple employs a comprehensive approach to combating fraud on the App Store, with teams across the company working to detect, investigate, and prevent malicious activity before it can reach users. Account Fraud Apple’s strong antifraud infrastructure helps ensure that malicious developer and customer accounts are swiftly flagged and eliminated. In 2024, Apple terminated more than 146,000 developer accounts over fraud concerns and rejected an additional 139,000 developer enrollments, preventing bad actors from submitting their apps to the App Store in the first place. Apple also rejected over 711 million customer account creations and deactivated nearly 129 million customer accounts last year, blocking these risky and malicious accounts from carrying out nefarious activity. That includes spamming or manipulating ratings and reviews, charts, and search results that risk compromising the integrity of the App Store. This commitment to safety extends beyond the App Store, as Apple works to prevent risky software distributed by pirate storefronts from reaching users. In 2024, Apple detected and blocked over 10,000 illegitimate apps on pirate storefronts, which include malware, pornography apps, gambling apps, and pirated versions of legitimate apps from the App Store. By restricting these storefronts, Apple also protects developers from having their apps cloned, altered, or weaponized for spreading malicious software. Over the past month, Apple has also stopped nearly 4.6 million attempts to install or launch apps distributed illicitly outside the App Store or approved third-party marketplaces. App Review Before any app makes its way onto the App Store, it is vetted by a member of Apple’s App Review team, all of whom are deeply familiar with the App Review Guidelines, and focused on ensuring apps meet Apple’s standards for quality and safety. On average, this team reviews nearly 150,000 app submissions each week, helping bring new apps and updates to the App Store. Last year, App Review helped more than 220,000 developers publish their first app on the App Store. App Review involves both human review and automated processes to detect and take action on apps that are suspected to be potentially harmful to users. With over 7.7 million App Store submissions reviewed in 2024, more than 1.9 million were rejected for failing to meet Apple’s standards for security, reliability, and user experience, including for privacy violations or fraud concerns. Malicious actors are known to employ a variety of tactics in their attempts to circumvent App Review’s safeguards and sneak bad apps onto the App Store with the intention of defrauding users. App Review rejects any potentially malicious apps it identifies during review, and the team’s investigation into one fraudulent app often results in the takedown of several others linked to the same problematic developer. In 2024, App Review removed more than 37,000 apps for fraudulent activity. Other common tactics used by fraudulent developers can include concealing hidden features and functionality in their code, which are only enabled after the app passes App Review. Apple monitors for such behavior, and in 2024, rejected over 43,000 app submissions for containing hidden or undocumented features. App Review also takes action against a number of apps that attempt to trick or scam users, and in 2024, rejected over 320,000 submissions that copied other apps, were found to be spam, or otherwise misled users. These bad actors can also attempt to deceive users by disguising potentially risky software as seemingly innocuous apps. Last year, App Review removed over 17,000 apps for bait-and-switch maneuvers such as these, as part of its ongoing efforts to routinely monitor and take action against problematic apps. Apps that attempt to access users’ personal data without their permission or knowledge are also prohibited from the App Store. In 2024, App Review rejected 400,000 app submissions for privacy violations. Discovery Fraud Apple takes swift action against apps that attempt to cheat the system and boost their ranking on the App Store, such as by using bots or paid services to artificially inflate download numbers or post fake five-star reviews. In 2024, Apple processed over 1.2 billion ratings and reviews and took significant action to combat fraud, removing more than 143 million fraudulent ratings and reviews from the App Store. In the same year, Apple also removed more than 7,400 apps from App Store charts and nearly 9,500 deceptive apps from appearing in App Store search results. These actions in turn benefit developers who are in good standing, leveling the playing field and allowing them a fair chance to thrive on the App Store. Payment and Credit Card Fraud Apple is diligent in its mission to protect users from scam and payment threats, and in 2024, protected users by preventing more than $2 billion in fraudulent transactions. Apple also takes credit card fraud extremely seriously and remains committed to protecting users from such. For example, when consumers make a purchase with Apple Pay, it uses a device-specific number and unique transaction code so a card number is never stored on a consumer’s device or on Apple servers. Additionally, credit and debit card numbers are never shared with developers, thus eliminating another risk factor in the payment transaction process. Last year, Apple identified nearly 4.7 million stolen credit cards and banned over 1.6 million accounts from transacting again. In addition to its antifraud measures, Apple also equips developers with access to world-class payment technologies. Examples of these include Apple Pay and StoreKit, which are used by over 420,000 apps to provide users with a safe, secure way to make purchases on the App Store. Developers leveraging StoreKit can take advantage of Apple’s in-app purchase system, which provides users with much more than a way to purchase subscriptions and digital add-ons. In-app purchase on the App Store offers users a secure and trusted environment designed to protect privacy, prevent fraud, and make managing purchases simple. With built-in tools to view, modify, or cancel subscriptions; purchase history; and support for refunds, users stay in control every step of the way. Every transaction is authenticated with a user’s Apple ID, backed by an industry-leading fraud protection engine, and handled with end-to-end encryption. Keeping Users Safe Apple will continue to build on its commitment to provide users with the safest and most secure experience on the App Store, which includes empowering them with resources to get help and report suspected fraud. Learn more about staying safe on the App Store at support.apple.com/en-us/122712. Stay up to date with the latest articles from Apple Newsroom.",
  "image": "https://www.apple.com/newsroom/images/2025/05/the-app-store-prevented-more-than-9-billion-usd-in-fraudulent-transactions/tile/Apple-App-Store-fraud-prevention-hero-lp.jpg.og.jpg?202505271259",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\n\n\n\t\n    \n\n\n\n\n\n\n\n \n\u003cnav id=\"ac-localnav\" lang=\"en-US\" role=\"navigation\" aria-label=\"Newsroom\" data-analytics-region=\"local nav\" data-sticky=\"\"\u003e\n\t\n    \n    \n        \n\n\n\n\n    \n    \n    \n\t\n\t\n\n\u003c/nav\u003e\n\n\n\n\n\n\u003cmain id=\"main\" role=\"main\"\u003e \n\n\n\n\n\u003cspan id=\"opens-in-new-window\"\u003eopens in new window\u003c/span\u003e\n\u003csection\u003e\n\u003carticle data-analytics-activitymap-region-id=\"article\"\u003e\n\n\n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n\n\n\n    \n\n\n\n\n\n    \u003cdiv\u003e\n        \n\t\t\n        \n\n        \u003cdiv\u003e\n                \n                \n                \n                    \u003ch2\u003e\n                        \n    \n        The App Store prevented more than $9 billion in fraudulent transactions over the last five years\n    \n\n                    \u003c/h2\u003e\n                \n            \u003c/div\u003e\n\n        \u003cdiv\u003e\n                \n                \n                    In 2024 alone, Apple stopped over $2 billion in potentially fraudulent transactions and blocked nearly 2 million risky app submissions from reaching users\n                \n            \u003c/div\u003e\n\n        \n            \n    \n    \n    \n    \n    \n\n        \n\n    \u003c/div\u003e\n\n\n\n\n\n\n\n    \n    \n    \n\n\n    \n    \n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003cdiv\u003eSince launching in 2008, the App Store has been a safe and trusted place for users and a vibrant marketplace for developers to grow their businesses around the world. In the last five years, the App Store has protected users by preventing over $9 billion in fraudulent transactions, including over $2 billion in 2024 alone, according to Apple’s annual App Store fraud analysis. This reflects the App Store’s continued investment in fostering the most secure experience for users while providing developers with tools and resources, including a powerful commerce system that helps customers transact safely and securely in 175 regions around the globe. With an average of more than 813 million visitors a week, the App Store is a trusted destination for users to download their favorite apps and discover new ones.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003ePreserving the App Store’s safe and secure marketplace requires constant vigilance, as bad actors continue to evolve their tactics in an attempt to defraud users. These threats range from deceptive apps designed to steal personal information, to fraudulent payment schemes that attempt to exploit users. Apple employs a comprehensive approach to combating fraud on the App Store, with teams across the company working to detect, investigate, and prevent malicious activity before it can reach users.\n\u003c/div\u003e\n                 \n             \n                 \u003ch2\u003e\u003cstrong\u003eAccount Fraud\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eApple’s strong antifraud infrastructure helps ensure that malicious developer and customer accounts are swiftly flagged and eliminated. In 2024, Apple terminated more than 146,000 developer accounts over fraud concerns and rejected an additional 139,000 developer enrollments, preventing bad actors from submitting their apps to the App Store in the first place.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eApple also rejected over 711 million customer account creations and deactivated nearly 129 million customer accounts last year, blocking these risky and malicious accounts from carrying out nefarious activity. That includes spamming or manipulating ratings and reviews, charts, and search results that risk compromising the integrity of the App Store.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eThis commitment to safety extends beyond the App Store, as Apple works to prevent risky software distributed by pirate storefronts from reaching users. In 2024, Apple detected and blocked over 10,000 illegitimate apps on pirate storefronts, which include malware, pornography apps, gambling apps, and pirated versions of legitimate apps from the App Store. By restricting these storefronts, Apple also protects developers from having their apps cloned, altered, or weaponized for spreading malicious software.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eOver the past month, Apple has also stopped nearly 4.6 million attempts to install or launch apps distributed illicitly outside the App Store or approved third-party marketplaces.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n    \n        \n        \n        \n        \n            \u003cfigure aria-label=\"Media, An infographic titled “Protecting App Store Users: Account Fraud in 2024” contains the following stats: 1) Over 146,000 developer accounts terminated over fraud concerns; 2) Over 139,000 fraudulent developer enrollments rejected; 3) Over 711 million potentially fraudulent customer account creations rejected; 4) Nearly 4.6 million attempts to install or launch apps distributed illicitly outside the App Store or approved third-party marketplaces stopped.\"\u003e\n                \u003cdiv\u003e\n                        \n                         \n                            \n                        \n                        \n                        \n                        \u003ca href=\"https://www.apple.com/newsroom/images/2025/05/the-app-store-prevented-more-than-9-billion-usd-in-fraudulent-transactions/article/Apple-App-Store-fraud-prevention-account-fraud-infographic.zip\" download=\"\" data-analytics-title=\"download image - Apple-App-Store-fraud-prevention-account-fraud-infographic_inline\" aria-label=\"Download media, An infographic titled “Protecting App Store Users: Account Fraud in 2024” contains the following stats: 1) Over 146,000 developer accounts terminated over fraud concerns; 2) Over 139,000 fraudulent developer enrollments rejected; 3) Over 711 million potentially fraudulent customer account creations rejected; 4) Nearly 4.6 million attempts to install or launch apps distributed illicitly outside the App Store or approved third-party marketplaces stopped.\"\u003e\u003c/a\u003e\n                    \u003c/div\u003e\n            \u003c/figure\u003e\n        \n    \n\n\n\n\n\n\n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003eApp Review\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eBefore any app makes its way onto the App Store, it is vetted by a member of Apple’s App Review team, all of whom are deeply familiar with the App Review Guidelines, and focused on ensuring apps meet Apple’s standards for quality and safety. On average, this team reviews nearly 150,000 app submissions each week, helping bring new apps and updates to the App Store. Last year, App Review helped more than 220,000 developers publish their first app on the App Store.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eApp Review involves both human review and automated processes to detect and take action on apps that are suspected to be potentially harmful to users. With over 7.7 million App Store submissions reviewed in 2024, more than 1.9 million were rejected for failing to meet Apple’s standards for security, reliability, and user experience, including for privacy violations or fraud concerns.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eMalicious actors are known to employ a variety of tactics in their attempts to circumvent App Review’s safeguards and sneak bad apps onto the App Store with the intention of defrauding users. App Review rejects any potentially malicious apps it identifies during review, and the team’s investigation into one fraudulent app often results in the takedown of several others linked to the same problematic developer. In 2024, App Review removed more than 37,000 apps for fraudulent activity.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n    \n        \n        \n        \n        \n            \u003cfigure aria-label=\"Media, An App Review illustration shows a broom sweeping up problematic apps.\"\u003e\n                \u003cdiv\u003e\n                        \n                         \n                            \n                        \n                        \n                        \n                        \u003ca href=\"https://www.apple.com/newsroom/images/2025/05/the-app-store-prevented-more-than-9-billion-usd-in-fraudulent-transactions/article/Apple-App-Store-fraud-prevention-App-Review.zip\" download=\"\" data-analytics-title=\"download image - Apple-App-Store-fraud-prevention-App-Review_inline\" aria-label=\"Download media, An App Review illustration shows a broom sweeping up problematic apps.\"\u003e\u003c/a\u003e\n                    \u003c/div\u003e\n            \u003c/figure\u003e\n        \n    \n\n\n\n\n\n\n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003cdiv\u003eOther common tactics used by fraudulent developers can include concealing hidden features and functionality in their code, which are only enabled after the app passes App Review. Apple monitors for such behavior, and in 2024, rejected over 43,000 app submissions for containing hidden or undocumented features. App Review also takes action against a number of apps that attempt to trick or scam users, and in 2024, rejected over 320,000 submissions that copied other apps, were found to be spam, or otherwise misled users.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eThese bad actors can also attempt to deceive users by disguising potentially risky software as seemingly innocuous apps. Last year, App Review removed over 17,000 apps for bait-and-switch maneuvers such as these, as part of its ongoing efforts to routinely monitor and take action against problematic apps.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eApps that attempt to access users’ personal data without their permission or knowledge are also prohibited from the App Store. In 2024, App Review rejected 400,000 app submissions for privacy violations.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n    \n        \n        \n        \n        \n            \u003cfigure aria-label=\"Media, An infographic titled “Protecting App Store Users: App Review in 2024” contains the following stats: 1) Over 7.7 million App Store submissions reviewed; 2) Over 1.9 million app submissions rejected for failing to meet Apple’s standards; 3) Over 400,000 app submissions rejected for privacy violations; 4) Over 320,000 app submissions rejected for spam, copycats, or misleading users.\"\u003e\n                \u003cdiv\u003e\n                        \n                         \n                            \n                        \n                        \n                        \n                        \u003ca href=\"https://www.apple.com/newsroom/images/2025/05/the-app-store-prevented-more-than-9-billion-usd-in-fraudulent-transactions/article/Apple-App-Store-fraud-prevention-App-Review-infographic.zip\" download=\"\" data-analytics-title=\"download image - Apple-App-Store-fraud-prevention-App-Review-infographic_inline\" aria-label=\"Download media, An infographic titled “Protecting App Store Users: App Review in 2024” contains the following stats: 1) Over 7.7 million App Store submissions reviewed; 2) Over 1.9 million app submissions rejected for failing to meet Apple’s standards; 3) Over 400,000 app submissions rejected for privacy violations; 4) Over 320,000 app submissions rejected for spam, copycats, or misleading users.\"\u003e\u003c/a\u003e\n                    \u003c/div\u003e\n            \u003c/figure\u003e\n        \n    \n\n\n\n\n\n\n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003eDiscovery Fraud\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eApple takes swift action against apps that attempt to cheat the system and boost their ranking on the App Store, such as by using bots or paid services to artificially inflate download numbers or post fake five-star reviews.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eIn 2024, Apple processed over 1.2 billion ratings and reviews and took significant action to combat fraud, removing more than 143 million fraudulent ratings and reviews from the App Store. In the same year, Apple also removed more than 7,400 apps from App Store charts and nearly 9,500 deceptive apps from appearing in App Store search results. These actions in turn benefit developers who are in good standing, leveling the playing field and allowing them a fair chance to thrive on the App Store.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n    \n        \n        \n        \n        \n            \u003cfigure aria-label=\"Media, An infographic titled “Protecting App Store Users: Discovery Fraud in 2024” contains the following stats: 1) Over 1.2 billion ratings and reviews processed; 2) Over 143 million fraudulent ratings and reviews removed; 3) Over 7,400 potentially fraudulent apps removed from App Store charts; 4) Nearly 9,500 deceptive apps removed from App Store search results.\"\u003e\n                \u003cdiv\u003e\n                        \n                         \n                            \n                        \n                        \n                        \n                        \u003ca href=\"https://www.apple.com/newsroom/images/2025/05/the-app-store-prevented-more-than-9-billion-usd-in-fraudulent-transactions/article/Apple-App-Store-fraud-prevention-discovery-fraud-infographic.zip\" download=\"\" data-analytics-title=\"download image - Apple-App-Store-fraud-prevention-discovery-fraud-infographic_inline\" aria-label=\"Download media, An infographic titled “Protecting App Store Users: Discovery Fraud in 2024” contains the following stats: 1) Over 1.2 billion ratings and reviews processed; 2) Over 143 million fraudulent ratings and reviews removed; 3) Over 7,400 potentially fraudulent apps removed from App Store charts; 4) Nearly 9,500 deceptive apps removed from App Store search results.\"\u003e\u003c/a\u003e\n                    \u003c/div\u003e\n            \u003c/figure\u003e\n        \n    \n\n\n\n\n\n\n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003ePayment and Credit Card Fraud\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eApple is diligent in its mission to protect users from scam and payment threats, and in 2024, protected users by preventing more than $2 billion in fraudulent transactions.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eApple also takes credit card fraud extremely seriously and remains committed to protecting users from such. For example, when consumers make a purchase with Apple Pay, it uses a device-specific number and unique transaction code so a card number is never stored on a consumer’s device or on Apple servers. Additionally, credit and debit card numbers are never shared with developers, thus eliminating another risk factor in the payment transaction process. Last year, Apple identified nearly 4.7 million stolen credit cards and banned over 1.6 million accounts from transacting again.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eIn addition to its antifraud measures, Apple also equips developers with access to world-class payment technologies. Examples of these include Apple Pay and StoreKit, which are used by over 420,000 apps to provide users with a safe, secure way to make purchases on the App Store.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eDevelopers leveraging StoreKit can take advantage of Apple’s in-app purchase system, which provides users with much more than a way to purchase subscriptions and digital add-ons. In-app purchase on the App Store offers users a secure and trusted environment designed to protect privacy, prevent fraud, and make managing purchases simple. With built-in tools to view, modify, or cancel subscriptions; purchase history; and support for refunds, users stay in control every step of the way. Every transaction is authenticated with a user’s Apple ID, backed by an industry-leading fraud protection engine, and handled with end-to-end encryption.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n    \n        \n        \n        \n        \n            \u003cfigure aria-label=\"Media, An infographic titled “Protecting App Store Users: Payment and Credit Card Fraud in 2024” contains the following stats: 1) Over $2 billion in potentially fraudulent transactions prevented; 2) Over 4.7 million stolen credit cards prevented from being used; 3) Over 1.6 million accounts banned from transacting again.\"\u003e\n                \u003cdiv\u003e\n                        \n                         \n                            \n                        \n                        \n                        \n                        \u003ca href=\"https://www.apple.com/newsroom/images/2025/05/the-app-store-prevented-more-than-9-billion-usd-in-fraudulent-transactions/article/Apple-App-Store-fraud-prevention-payment-and-credit-card-fraud-infographic.zip\" download=\"\" data-analytics-title=\"download image - Apple-App-Store-fraud-prevention-payment-and-credit-card-fraud-infographic_inline\" aria-label=\"Download media, An infographic titled “Protecting App Store Users: Payment and Credit Card Fraud in 2024” contains the following stats: 1) Over $2 billion in potentially fraudulent transactions prevented; 2) Over 4.7 million stolen credit cards prevented from being used; 3) Over 1.6 million accounts banned from transacting again.\"\u003e\u003c/a\u003e\n                    \u003c/div\u003e\n            \u003c/figure\u003e\n        \n    \n\n\n\n\n\n\n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003ch2\u003e\u003cstrong\u003eKeeping Users Safe\u003c/strong\u003e\n\u003c/h2\u003e\n                 \n             \n                 \u003cdiv\u003eApple will continue to build on its commitment to provide users with the safest and most secure experience on the App Store, which includes empowering them with resources to get help and report suspected fraud. Learn more about staying safe on the App Store at \u003ca href=\"https://support.apple.com/en-us/122712\" target=\"_blank\"\u003esupport.apple.com/en-us/122712\u003c/a\u003e.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n    \n    \n        \n    \n\n\n    \n    \n    \n\n\n\n    \n    \n    \n\n\n\n\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\n\n\u003c/article\u003e\n\n\n\n\u003c/section\u003e\n\u003c/main\u003e\n\n\n\n\u003cdiv\u003e\n            Stay up to date with the latest articles from Apple Newsroom.\n        \u003c/div\u003e\n\t\n\n\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": null,
  "modifiedTime": null
}
