{
  "id": "222b36a0-84ec-4f09-9985-a80ff01f0b22",
  "title": "Apple quietly added ‘Inactivity Reboot’ in iOS 18.1 to safeguard a lost or stolen iPhone",
  "link": "https://www.macworld.com/article/2518717/apple-quietly-added-inactivity-reboot-in-ios-18-1-to-safeguard-a-lost-or-stolen-iphone.html",
  "description": "Macworld According to security researchers, Apple has quietly added a new feature in iOS 18.1 that makes your iPhone harder to crack. 404 Media reported that iPhones stored by police in evidence were rebooting themselves, and it turns out it’s all due to a new Inactivity Reboot feature shipping in iOS 18.1. First reported by security researcher Jiska Classen, this new feature reboots your iPhone if it has gone unused for at least four days. This puts your iPhone into its “Before First Unlock” state. This is the state your iPhone is in after being restarted, which requires you to enter your PIN or password before you can use Face ID or Touch ID. The devices used by law enforcement and bad actors alike to crack their way into locked iPhones have a much harder time penetrating the device when in this state. The “After First Unlock” state, in which Face ID or Touch ID is active, is easier to crack. This means that if your iPhone is either stolen or confiscated, it can’t simply be kept plugged in for weeks or months until it can be broken into. Or at least, that doing so will be much harder. While this may be frustrating for law enforcement storing iPhones in evidence, it also seriously raises the bar for thieves and criminals, which is the whole point. If you haven’t used your iPhone in four days, typing in your passcode is hardly a big inconvenience, but entering the state in which you have to do so is a big annoyance for anyone looking to break into your device.",
  "author": "",
  "published": "Tue, 12 Nov 2024 21:53:07 +0000",
  "source": "https://www.macworld.com/index.rss",
  "categories": [
    "iPhone"
  ],
  "byline": "Author: Jason Cross, Senior Editor, Macworld",
  "length": 1828,
  "excerpt": "If your iPhone goes unused for 4 days it will reboot itself, making it harder to forcibly unlock.",
  "siteName": "Macworld",
  "favicon": "https://www.macworld.com/wp-content/uploads/2021/03/cropped-macworld-favicon.png?w=192",
  "text": "Image: Foundry According to security researchers, Apple has quietly added a new feature in iOS 18.1 that makes your iPhone harder to crack. 404 Media reported that iPhones stored by police in evidence were rebooting themselves, and it turns out it’s all due to a new Inactivity Reboot feature shipping in iOS 18.1. First reported by security researcher Jiska Classen, this new feature reboots your iPhone if it has gone unused for at least four days. This puts your iPhone into its “Before First Unlock” state. This is the state your iPhone is in after being restarted, which requires you to enter your PIN or password before you can use Face ID or Touch ID. The devices used by law enforcement and bad actors alike to crack their way into locked iPhones have a much harder time penetrating the device when in this state. The “After First Unlock” state, in which Face ID or Touch ID is active, is easier to crack. This means that if your iPhone is either stolen or confiscated, it can’t simply be kept plugged in for weeks or months until it can be broken into. Or at least, that doing so will be much harder. While this may be frustrating for law enforcement storing iPhones in evidence, it also seriously raises the bar for thieves and criminals, which is the whole point. If you haven’t used your iPhone in four days, typing in your passcode is hardly a big inconvenience, but entering the state in which you have to do so is a big annoyance for anyone looking to break into your device. Jason has written about technology for more than 25 years - first in the gaming press, then focusing on enthusiast PCs and general technology. He enjoys learning how complicated technology works and explaining it in a way anyone can understand.",
  "image": "https://www.macworld.com/wp-content/uploads/2024/11/iphone-13-lock-screen.jpg?quality=50\u0026strip=all\u0026w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-2518717\"\u003e\n\t\n\n\t\n\n\t\u003cdiv\u003e\n\t\t\t\t\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cimg width=\"1024\" height=\"683\" src=\"https://www.macworld.com/wp-content/uploads/2024/11/iphone-13-lock-screen.jpg?quality=50\u0026amp;strip=all\u0026amp;w=1024\" alt=\"iPhone 13 lock screen\" data-hero=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.macworld.com/wp-content/uploads/2024/11/iphone-13-lock-screen.jpg?quality=50\u0026amp;strip=all 1500w, https://www.macworld.com/wp-content/uploads/2024/11/iphone-13-lock-screen.jpg?resize=300%2C200\u0026amp;quality=50\u0026amp;strip=all 300w, https://www.macworld.com/wp-content/uploads/2024/11/iphone-13-lock-screen.jpg?resize=768%2C512\u0026amp;quality=50\u0026amp;strip=all 768w, https://www.macworld.com/wp-content/uploads/2024/11/iphone-13-lock-screen.jpg?resize=1200%2C800\u0026amp;quality=50\u0026amp;strip=all 1200w, https://www.macworld.com/wp-content/uploads/2024/11/iphone-13-lock-screen.jpg?resize=1240%2C826\u0026amp;quality=50\u0026amp;strip=all 1240w, https://www.macworld.com/wp-content/uploads/2024/11/iphone-13-lock-screen.jpg?resize=150%2C100\u0026amp;quality=50\u0026amp;strip=all 150w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eImage: Foundry\u003c/span\u003e\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\n\t\t\t\t\t\n\u003cdiv id=\"link_wrapped_content\"\u003e\n\n\n\n\n\u003cp\u003eAccording to security researchers, Apple has quietly added a new feature in iOS 18.1 that makes your iPhone harder to crack.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://go.skimresources.com?id=111346X1569486\u0026amp;xs=1\u0026amp;url=https://www.404media.co/apple-quietly-introduced-iphone-reboot-code-which-is-locking-out-cops/\u0026amp;xcust=1-1-2518717-1-0-0\u0026amp;sref=https://www.macworld.com/article/2518717/apple-quietly-added-inactivity-reboot-in-ios-18-1-to-safeguard-a-lost-or-stolen-iphone.html\" rel=\"nofollow\" data-subtag=\"1-1-2518717-1-0-0\" data-domain-name=\"404media\"\u003e404 Media\u003c/a\u003e reported that iPhones stored by police in evidence were rebooting themselves, and it turns out it’s all due to a new Inactivity Reboot feature shipping in iOS 18.1. First reported by security researcher \u003ca href=\"https://go.skimresources.com?id=111346X1569486\u0026amp;xs=1\u0026amp;url=https://chaos.social/@jiska/113447894119816217\u0026amp;xcust=1-1-2518717-1-0-0\u0026amp;sref=https://www.macworld.com/article/2518717/apple-quietly-added-inactivity-reboot-in-ios-18-1-to-safeguard-a-lost-or-stolen-iphone.html\" rel=\"nofollow\" data-subtag=\"1-1-2518717-1-0-0\" data-domain-name=\"chaos\"\u003eJiska Classen\u003c/a\u003e, this new feature reboots your iPhone if it has gone unused for at least four days. \u003c/p\u003e\n\n\n\n\u003cp\u003eThis puts your iPhone into its “Before First Unlock” state. This is the state your iPhone is in after being restarted, which requires you to enter your PIN or password before you can use Face ID or Touch ID.  The devices used by law enforcement and bad actors alike to crack their way into locked iPhones have a much harder time penetrating the device when in this state. The “After First Unlock” state, in which Face ID or Touch ID is active, is easier to crack.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis means that if your iPhone is either stolen or confiscated, it can’t simply be kept plugged in for weeks or months until it can be broken into. Or at least, that doing so will be much harder.\u003c/p\u003e\n\n\t\t\n\t\t\t\n\t\t\t\n\n\n\u003cp\u003eWhile this may be frustrating for law enforcement storing iPhones in evidence, it also seriously raises the bar for thieves and criminals, which is the whole point. If you haven’t used your iPhone in four days, typing in your passcode is hardly a big inconvenience, but entering the state in which you have to do so is a big annoyance for anyone looking to break into your device.\u003c/p\u003e\n\n\u003c/div\u003e\n\t\t\u003cdiv data-ga=\"article-footer-author\"\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://www.macworld.com/wp-content/uploads/2024/11/author_photo_Jason-Cross_1654577117-36.jpeg?quality=50\u0026amp;strip=all\u0026amp;w=150\u0026amp;h=150\u0026amp;crop=1\" height=\"125\" width=\"125\"/\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003eJason has written about technology for more than 25 years - first in the gaming press, then focusing on enthusiast PCs and general technology. He enjoys learning how complicated technology works and explaining it in a way anyone can understand.\u003c/p\u003e\n\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
