{
  "id": "334cc7f3-9380-4049-b39e-c629249aac29",
  "title": "Alleged iOS 19 leak reveals completely redesigned Camera app",
  "link": "https://9to5mac.com/2025/01/17/ios-19-leak-camera-app/",
  "description": "A new rumor today suggests that the Camera app will get a dramatic overhaul as part of iOS 19 this year. In a video on YouTube, Jon Prosser reveals that the new Camera app in iOS 19 will feature a design that “mirrors the design ethos from visionOS.” more…",
  "author": "Chance Miller",
  "published": "Fri, 17 Jan 2025 22:20:17 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Chance Miller",
  "length": 2838,
  "excerpt": "A new rumor today suggests that the Camera app will get a dramatic overhaul as part of iOS 19 this...",
  "siteName": "9to5Mac",
  "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=192",
  "text": "Screenshot A new rumor today suggests that the Camera app will get a dramatic overhaul as part of iOS 19 this year. In a video on YouTube, Jon Prosser reveals that the new Camera app in iOS 19 will feature a design that “mirrors the design ethos from visionOS.” Prosser says he saw the redesigned Camera app from iOS 19 in action. To protect his source, however, he can’t share that video. Instead, he recreated it from scratch to give us an idea of what to expect from the redesign. You can check out Prosser’s full video below for a closer look at the alleged new iOS 19 design for the Camera app. The video shows how Apple has consolidated controls at the bottom of the interface into two toggles for “Photo” and “Video.” Within each menu, you can switch between different modes, adjust settings like exposure, and more. At the top of the interface, you have quick access to controls for things like Live Photos and flash, as well as settings for resolution and frame rate. There’s also still a dedicated button for jumping into your photos library. 9to5Mac’s Take One thing I really like about this redesign is that the camera viewfinder takes up much more of the visual interface. Currently, the Camera app is cluttered with controls and settings that can intrude on the actual process of taking a picture or video. You obviously need quick access to those controls, but this new iOS 19 design would suggest that Apple has crafted a design that keeps the most-used settings easily accessible while simultaneously removing some of the clutter. The design of this alleged iOS 19 leak is clearly inspired by visionOS and some of the translucent design paradigms that Apple introduced with Apple Vision Pro. Whether or not this design language spills out into other parts of iOS 19 remains to be seen. Last year, a sketchy rumor suggested iOS 18 would feature a new design inspired by visionOS. That ultimately didn’t come to fruition. I’d treat this rumor with caution for the time being. We are still five months away from Apple announcing iOS 19, so there is plenty of time for Apple’s plans to change. It’s also possible that this is a design Apple is testing internally but won’t actually see the light of day. What do you think of this proposed redesign to the Camera app in iOS 19? Let us know down in the comments. For more details on what to expect from iOS 19, check out our full guide. My favorite iPhone accessories: Meross Smart Garage Door Opener with HomeKit Anker Nano Power Bank with built-in USB-C cable Satechi 3-in-1 Foldable Charging Station Twelve South Plugbug: 4-port fast charger with Find My Backbone One Mobile Controller for iPhone Add 9to5Mac to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/01/ios-19-photos-app-leak.jpg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"771\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios-19-photos-app-leak.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/01/ios-19-photos-app-leak.jpg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/01/ios-19-photos-app-leak.jpg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/01/ios-19-photos-app-leak.jpg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/01/ios-19-photos-app-leak.jpg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\t\t\t\u003cfigcaption\u003e\n\t\t\t\tScreenshot\t\t\t\u003c/figcaption\u003e\n\t\t\t\u003c/figure\u003e\n\n\u003cp\u003eA new rumor today suggests that the Camera app will get a dramatic overhaul as part of \u003ca href=\"https://9to5mac.com/2025/01/07/ios-19-features-release-date/\"\u003eiOS 19\u003c/a\u003e this year. In a \u003ca href=\"https://www.youtube.com/watch?v=HaP_q9W3AQE\"\u003evideo on YouTube\u003c/a\u003e, Jon Prosser reveals that the new Camera app in iOS 19 will feature a design that “mirrors the design ethos from visionOS.”\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eProsser says he saw the redesigned Camera app from iOS 19 in action. To protect his source, however, he can’t share that video. Instead, he recreated it from scratch to give us an idea of what to expect from the redesign.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can check out Prosser’s full video below for a closer look at the alleged new iOS 19 design for the Camera app. The video shows how Apple has consolidated controls at the bottom of the interface into two toggles for “Photo” and “Video.” Within each menu, you can switch between different modes, adjust settings like exposure, and more.\u003c/p\u003e\n\n\n\n\u003cp\u003eAt the top of the interface, you have quick access to controls for things like Live Photos and flash, as well as settings for resolution and frame rate. There’s also still a dedicated button for jumping into your photos library.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-9to5mac-s-take\"\u003e9to5Mac’s Take\u003c/h2\u003e\n\n\n\n\u003cp\u003eOne thing I really like about this redesign is that the camera viewfinder takes up much more of the visual interface. Currently, the Camera app is cluttered with controls and settings that can intrude on the actual process of taking a picture or video. You obviously \u003cem\u003eneed\u003c/em\u003e quick access to those controls, but this new iOS 19 design would suggest that Apple has crafted a design that keeps the most-used settings easily accessible while simultaneously removing some of the clutter.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe design of this alleged iOS 19 leak is clearly inspired by visionOS and some of the translucent design paradigms that Apple introduced with Apple Vision Pro. Whether or not this design language spills out into other parts of iOS 19 remains to be seen.\u003c/p\u003e\n\n\n\n\u003cp\u003eLast year, a \u003ca href=\"https://9to5mac.com/2024/02/09/rumor-ios-18-interface-visionos/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003esketchy rumor suggested\u003c/a\u003e iOS 18 would feature a new design inspired by visionOS. That ultimately didn’t come to fruition. \u003c/p\u003e\n\n\n\n\u003cp\u003eI’d treat this rumor with caution for the time being. We are still five months away from Apple announcing iOS 19, so there is plenty of time for Apple’s plans to change. It’s also possible that this is a design Apple is testing internally but won’t actually see the light of day.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhat do you think of this proposed redesign to the Camera app in iOS 19? Let us know down in the comments. For more details on what to expect from iOS 19, \u003ca href=\"https://9to5mac.com/2025/01/07/ios-19-features-release-date/\"\u003echeck out our full guide\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe id=\"post-youtube-video-1\" title=\"Here\u0026#39;s your first look at iOS 19\" width=\"500\" height=\"281\" data-src=\"https://www.youtube.com/embed/HaP_q9W3AQE?feature=oembed\u0026amp;rel=0\u0026amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMy favorite iPhone accessories\u003c/strong\u003e: \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.amazon.com/dp/B084Z5QZR2?ref=t_ac_view_request_product_image\u0026amp;campaignId=amzn1.campaign.29E876PGN2PH8\u0026amp;linkCode=tr1\u0026amp;tag=android067-20\u0026amp;linkId=amzn1.campaign.29E876PGN2PH8_1735918509720\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMeross Smart Garage Door Opener with HomeKit\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://geni.us/Bu8JCe5\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAnker Nano Power Bank with built-in USB-C cable\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://geni.us/B7zoDt\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSatechi 3-in-1 Foldable Charging Station\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://geni.us/IjAn\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eTwelve South Plugbug: 4-port fast charger with Find My\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://geni.us/mrf91\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBackbone One Mobile Controller for iPhone\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Mac to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-17T22:20:17Z",
  "modifiedTime": "2025-01-17T22:20:19Z"
}
