{
  "id": "3b02dfa8-60bc-488f-b923-ed4ede9ff51b",
  "title": "How to use Starlink with iPhone \u0026 how to disable it if you don't want it",
  "link": "https://appleinsider.com/inside/iphone-16/tips/how-to-use-starlink-with-iphone-how-to-disable-it-if-you-dont-want-it?utm_medium=rss",
  "description": "Starlink satellites now work with iPhone, but the change has caused confusion and concern. Here's what the feature means, how it works, and how you can disable it if you so choose.Starlink satellites are now supported on iPhoneThe recent iOS 18.3 update contained a number of new features for iPhone users. We saw new Unity wallpapers, improvements to Visual Intelligence to recognize plants and animals, and plenty of bug fixes.But there was one change in this update that got a fair bit of attention — support for Starlink satellites. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Andrew O'Hara",
  "published": "Sat, 08 Feb 2025 18:57:52 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Andrew O'Hara",
  "length": 4662,
  "excerpt": "Starlink satellites now work with iPhone, but the change has caused confusion and concern. Here's what the feature means, how it works, and how you can disable it if you so choose.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Starlink satellites now work with iPhone, but the change has caused confusion and concern. Here's what the feature means, how it works, and how you can disable it if you so choose. The recent iOS 18.3 update contained a number of new features for iPhone users. We saw new Unity wallpapers, improvements to Visual Intelligence to recognize plants and animals, and plenty of bug fixes. But there was one change in this update that got a fair bit of attention — support for Starlink satellites. Subscribe to AppleInsider on YouTubeSubscribe to AppleInsider on YouTubeThere's been a lot of misconceptions about what changed here. What Starlink support means for iPhone usersSatellite support works on all flavors of iPhone 14, iPhone 15, and iPhone 16. It's been around for a few years, but Starlink support specifically is new. iOS 18.3 brought plenty of new features and fixesEssentially, select users can rely on Starlink satellites when outside of cellular range. Great for off the grid situations, as well as emergencies. The satellites connect via the band 25 1900MHz spectrum, which has been supported on the iPhone. The way this works differs from Apple's existing satellite support we've seen for a while. Apple already offers Emergency SOS, Find My support, roadside assistance, and messages via satellite with those supported models. These all use that satellite connectivity when outside of cell connection to send limited texts or receive assistance. It works well with a big caveat - you must be in visible range of the satellite. Starlink versus GlobalstarApple partnered with Globalstar for its satellite feature It was founded, in part, by Qualcomm and is now owned 20% by Apple itself. Satellite support is great for emergencies. Source: PexelsApple says you must have a clear view of the sky and the horizon to use its satellite features. Plus, hlls, mountains, trees, and other foliage can interfere or slow it down the data. Again, you have to actually hold your iPhone towards the sky without anything blocking your view for the satellite to connect and work. Not exactly convenient, but still comes in clutch in an emergency. Trying to connect to satellites can be tough in certain locationsComparably, Starlink has many more satellites available to connect to. This allows a bit more freedom when connecting. For example, you can leave your iPhone in your pocket or bag and still connect to the satellites to receive messages. Your iPhone automatically switches to this when cell range is gone, keeping you connected. That's already more convenient than the emergency-centric offerings Apple directly touts. Right now, this Starlink satellite connectivity is for sending messages, though it is reportedly set to expand to phone calls and data in the future. That could be huge. Apple didn't partner with StarlinkLet's be perfectly clear about this. This is a partnership between T-Mobile and Starlink. Apple did not partner with Starlink. Apple didn't even mention this in the release notes to iOS 18.3. It isn't an iPhone feature, but a T-Mobile network feature. It first rolled out in beta with select Samsung devices, then surprisingly added iPhones to the list of compatible devices. At the moment, this feature is limited to US-based T-Mobile users who have been accepted into the beta. Starlink support means your iPhone can stay in your pocket and still connect, with voice and data coming in the futureThat means it's not available on all iPhones. Not even all T-Mobile iPhones, at least not yet. How to disable Starlink support on iPhoneWe won't get into the discussion on Starlink owner, Elon Musk. Whether you like him or loathe him, the iOS 18.3 update brings many benefits, including security updates. Testing satellite support with the built-in demoWhile we understand people's hesitancy to update, for fear of giving Musk access to data, the fear is unfounded. Starlink support can quickly be disabled or reenabled in the future. How to disable Starlink satellite support on iPhoneIf your carrier doesn't yet have their own satellite option, you won't see this listed in your settings. Open the Settings app on your iPhone after updating to iOS 18.3 Visit Cellular \u003e T-Mobile (or other carriers if added in the future) Toggle off satellite supportThis isn't a permanent kill switch and certainly no reason to stop upgrading or downgrade devices. Starlink has access to the same data that any other ISP has access to, assuming the traffic goes through their domain name servers. If it doesn't, then they don't know a thing. We'll leave it to you on what makes the most sense, but at least you're armed with all the data.",
  "image": "https://photos5.appleinsider.com/gallery/62568-129736-Satellite-Demo-Connecting-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eStarlink satellites now work with \u003ca href=\"https://appleinsider.com/inside/iphone\" title=\"iPhone\" data-kpt=\"1\"\u003eiPhone\u003c/a\u003e, but the change has caused confusion and concern. Here\u0026#39;s what the feature means, how it works, and how you can disable it if you so choose.\n\u003c/p\u003e\u003cp\u003eThe recent iOS 18.3 update \u003ca href=\"https://appleinsider.com/articles/25/01/27/ios-183-arrives-with-visual-intelligence-update-notification-summary-changes\"\u003econtained a number\u003c/a\u003e of new features for iPhone users. We saw new Unity wallpapers, improvements to Visual Intelligence to recognize plants and animals, and plenty of bug fixes.\n\u003c/p\u003e\u003cp\u003eBut there was one change in this update that got a fair bit of attention —  support for Starlink satellites.\n\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ciframe src=\"https://www.youtube.com/embed/uOeAdSZ6WNs\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" loading=\"lazy\"\u003e\u003c/iframe\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.youtube.com/c/appleinsider?sub_confirmation=1\"\u003eSubscribe to AppleInsider on YouTube\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.youtube.com/c/appleinsider?sub_confirmation=1\"\u003eSubscribe to AppleInsider on YouTube\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThere\u0026#39;s been a lot of misconceptions about what changed here.\n\u003c/p\u003e\u003ch2 data-anchor=\"what-starlink-support-means-for-iphone-users\" id=\"what-starlink-support-means-for-iphone-users\"\u003eWhat Starlink support means for iPhone users\u003c/h2\u003e\u003cp\u003eSatellite support works on all flavors of \u003ca href=\"https://appleinsider.com/inside/iphone-14\" title=\"iPhone 14\" data-kpt=\"1\"\u003eiPhone 14\u003c/a\u003e, iPhone 15, and \u003ca href=\"https://appleinsider.com/inside/iphone-16\" title=\"iPhone 16\" data-kpt=\"1\"\u003eiPhone 16\u003c/a\u003e. It\u0026#39;s been around for a few years, but Starlink support specifically is new.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62568-129734-iOS-183-Update-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62568-129734-iOS-183-Update-xl.jpg\" alt=\"Smartphone on table shows iOS software update screen. A plant, notebook, and smartwatch are nearby.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eiOS 18.3 brought plenty of new features and fixes\u003c/span\u003e\u003c/p\u003e\u003cp\u003eEssentially, select users can rely on Starlink satellites when outside of cellular range. Great for off the grid situations, as well as emergencies.\n\u003c/p\u003e\u003cp\u003eThe satellites connect via the band 25 1900MHz spectrum, which has been supported on the iPhone. The way this works differs from Apple\u0026#39;s existing satellite support we\u0026#39;ve seen for a while.\n\u003c/p\u003e\u003cp\u003eApple already offers Emergency SOS, \u003ca href=\"https://appleinsider.com/inside/find-my\" title=\"Find My\" data-kpt=\"1\"\u003eFind My\u003c/a\u003e support, roadside assistance, and messages via satellite with those supported models.\n\u003c/p\u003e\u003cp\u003eThese all use that satellite connectivity when outside of cell connection to send limited texts or receive assistance. It works well with a big caveat - you must be in visible range of the satellite.\n\u003c/p\u003e\u003ch2 data-anchor=\"starlink-versus-globalstar\" id=\"starlink-versus-globalstar\"\u003eStarlink versus Globalstar\u003c/h2\u003e\u003cp\u003eApple partnered with Globalstar for its satellite feature It was founded, in part, by Qualcomm and is now owned 20% by Apple itself.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62568-129738-Satellite-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62568-129738-Satellite-xl.jpg\" alt=\"Satellite orbiting above a blue ocean and rugged, sandy coastline, showing intricate natural terrain patterns.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eSatellite support is great for emergencies. Source: Pexels\u003c/span\u003e\u003c/p\u003e\u003cp\u003eApple says you must have a clear view of the sky and the horizon to use its satellite features. Plus, hlls, mountains, trees, and other foliage can interfere or slow it down the data.\n\u003c/p\u003e\u003cp\u003eAgain, you have to actually hold your iPhone towards the sky without anything blocking your view for the satellite to connect and work. Not exactly convenient, but still comes in clutch in an emergency.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62568-129733-Connecting-to-satellite-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62568-129733-Connecting-to-satellite-xl.jpg\" alt=\"Man with curly hair and a beard holds a smartphone, looking upwards with a thoughtful expression. Background is a blurred outdoor scene.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eTrying to connect to satellites can be tough in certain locations\u003c/span\u003e\u003c/p\u003e\u003cp\u003eComparably, Starlink has many more satellites available to connect to. This allows a bit more freedom when connecting.\n\u003c/p\u003e\u003cp\u003eFor example, you can leave your iPhone in your pocket or bag and still connect to the satellites to receive messages. Your iPhone automatically switches to this when cell range is gone, keeping you connected.\n\u003c/p\u003e\u003cp\u003eThat\u0026#39;s already more convenient than the emergency-centric offerings Apple directly touts.\n\u003c/p\u003e\u003cp\u003eRight now, this Starlink satellite connectivity is for sending messages, though it is reportedly set to expand to phone calls and data in the future.\n\u003c/p\u003e\u003cp\u003eThat could be huge.\n\u003c/p\u003e\u003ch2 data-anchor=\"apple-didnt-partner-with-starlink\" id=\"apple-didnt-partner-with-starlink\"\u003eApple didn\u0026#39;t partner with Starlink\u003c/h2\u003e\u003cp\u003eLet\u0026#39;s be perfectly clear about this. \n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThis is a partnership between T-Mobile and Starlink. Apple did not partner with Starlink.\u003c/strong\u003e \n\u003c/p\u003e\u003cp\u003eApple didn\u0026#39;t even mention this in the release notes to iOS 18.3. It isn\u0026#39;t an iPhone feature, but a T-Mobile network feature.\n\u003c/p\u003e\u003cp\u003eIt first rolled out in beta with select Samsung devices, then surprisingly added iPhones to the list of compatible devices. At the moment, this feature is limited to US-based T-Mobile users who have been accepted into the beta.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62568-129735-iPhone-in-pocket-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62568-129735-iPhone-in-pocket-xl.jpg\" alt=\"Person wearing a gray shirt and jeans placing a smartphone with three cameras into a pocket while wearing a metal watch.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eStarlink support means your iPhone can stay in your pocket and still connect, with voice and data coming in the future\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThat means it\u0026#39;s not available on all iPhones. Not even all T-Mobile iPhones, at least not yet.\n\u003c/p\u003e\u003ch2 data-anchor=\"how-to-disable-starlink-support-on-iphone\" id=\"how-to-disable-starlink-support-on-iphone\"\u003eHow to disable Starlink support on iPhone\u003c/h2\u003e\u003cp\u003eWe won\u0026#39;t get into the discussion on Starlink owner, Elon Musk. Whether you like him or loathe him, the iOS 18.3 update brings many benefits, including security updates.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62568-129737-Satellite-Demo-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62568-129737-Satellite-Demo-xl.jpg\" alt=\"A hand holding a smartphone displaying satellite connection options, including emergency SOS and messaging apps, with a background map of the Earth.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eTesting satellite support with the built-in demo\u003c/span\u003e\u003c/p\u003e\u003cp\u003eWhile we understand people\u0026#39;s hesitancy to update, for fear of giving Musk access to data, the fear is unfounded. Starlink support can quickly be disabled or reenabled in the future.\n\u003c/p\u003e\u003ch2 data-anchor=\"how-to-disable-starlink-satellite-support-on-iphone\" id=\"how-to-disable-starlink-satellite-support-on-iphone\"\u003eHow to disable Starlink satellite support on iPhone\u003c/h2\u003e\u003cp\u003eIf your carrier doesn\u0026#39;t yet have their own satellite option, you won\u0026#39;t see this listed in your settings.\n\u003c/p\u003e\u003cul\u003e\u003cli\u003eOpen the \u003cstrong\u003eSettings\u003c/strong\u003e app on your iPhone after updating to iOS 18.3\u003c/li\u003e\n\u003cli\u003eVisit Cellular \u0026gt; T-Mobile (or other carriers if added in the future)\u003c/li\u003e\n\u003cli\u003eToggle off satellite support\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThis isn\u0026#39;t a permanent kill switch and certainly no reason to stop upgrading or downgrade devices. Starlink has access to the same data that any other ISP has access to, assuming the traffic goes through their domain name servers.\n\u003c/p\u003e\u003cp\u003eIf it doesn\u0026#39;t, then they don\u0026#39;t know a thing.\n\u003c/p\u003e\u003cp\u003eWe\u0026#39;ll leave it to you on what makes the most sense, but at least you\u0026#39;re armed with all the data.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-02-08T18:57:52Z",
  "modifiedTime": null
}
