{
  "id": "4137a4e7-3d54-4b0b-a199-f7602e902671",
  "title": "iOS 26 code hints at the imminent release of 2nd-gen AirTag",
  "link": "https://www.macworld.com/article/2808381/ios-26-code-hints-at-the-imminent-release-of-2nd-gen-airtag.html",
  "description": "Macworld It’s been a long time since Apple introduced the first and only AirTag. Apple’s item-tracking accessory hasn’t been updated since 2021, but it looks like we’ll be seeing a new model soon. After many rumors about AirTag 2 coming sometime this year, the recently released iOS 26 beta presents evidence that Apple is indeed gearing up to launch a new generation of AirTag. Based on the iOS 26 code seen by Macworld, Apple has made under-the-hood changes to how the system manages AirTags. For instance, the company has been working on improving the Bluetooth communication between Apple devices and the item tracker, which will certainly make using the accessory more reliable. New battery-related features are also in the works. As these features don’t seem to be enabled for the current AirTag, it’s not a stretch to assume that they’re meant for a new version of AirTag. Macworld has also learned that iOS 26 will make greater use of Extended Precision Finding technology, first introduced with the second generation of Apple’s ultra-wideband chip, which is available in the iPhone 15 and later. Devices with this technology can be found with Precision Finding up to 60 meters away. Meanwhile, AirTags can only be found with Precision Finding when they’re less than 15 meters away. According to Bloomberg’s Mark Gurman, the 2nd-generation AirTag (codenamed B589) will have extended ultra wideband range, so this would explain the changes Apple has been working on for iOS 26. A few weeks ago, Macworld reported that Apple had quietly stopped selling the AirTag Loop, one of its original accessories for the item tracker. The move presumably comes as the company is planning an imminent launch of AirTag 2.  Each AirTag costs $29, but you might want to wait a bit longer to buy a new one, since there’s a high chance Apple will announce the AirTag 2 along with the iPhone 17 lineup in September.",
  "author": "",
  "published": "Mon, 09 Jun 2025 23:42:19 +0000",
  "source": "https://www.macworld.com/index.rss",
  "categories": [
    "iPhone"
  ],
  "byline": "Author: Filipe Esposito",
  "length": 2298,
  "excerpt": "Evidence found in iOS 26 suggests there's a new Apple tracker coming soon.",
  "siteName": "Macworld",
  "favicon": "https://www.macworld.com/wp-content/uploads/2021/03/cropped-macworld-favicon.png?w=192",
  "text": "Image: Apple It’s been a long time since Apple introduced the first and only AirTag. Apple’s item-tracking accessory hasn’t been updated since 2021, but it looks like we’ll be seeing a new model soon. After many rumors about AirTag 2 coming sometime this year, the recently released iOS 26 beta presents evidence that Apple is indeed gearing up to launch a new generation of AirTag. Based on the iOS 26 code seen by Macworld, Apple has made under-the-hood changes to how the system manages AirTags. For instance, the company has been working on improving the Bluetooth communication between Apple devices and the item tracker, which will certainly make using the accessory more reliable. New battery-related features are also in the works. As these features don’t seem to be enabled for the current AirTag, it’s not a stretch to assume that they’re meant for a new version of AirTag. Macworld has also learned that iOS 26 will make greater use of Extended Precision Finding technology, first introduced with the second generation of Apple’s ultra-wideband chip, which is available in the iPhone 15 and later. Devices with this technology can be found with Precision Finding up to 60 meters away. Meanwhile, AirTags can only be found with Precision Finding when they’re less than 15 meters away. According to Bloomberg’s Mark Gurman, the 2nd-generation AirTag (codenamed B589) will have extended ultra wideband range, so this would explain the changes Apple has been working on for iOS 26. A few weeks ago, Macworld reported that Apple had quietly stopped selling the AirTag Loop, one of its original accessories for the item tracker. The move presumably comes as the company is planning an imminent launch of AirTag 2.  Each AirTag costs $29, but you might want to wait a bit longer to buy a new one, since there’s a high chance Apple will announce the AirTag 2 along with the iPhone 17 lineup in September. Filipe Espósito is a Brazilian journalist who has been covering tech for over 10 years, and has become known for publishing exclusive reports on Apple's plans – such as the launch of the first titanium Apple Watch. He has worked for 9to5Mac and also co-hosts the tech podcast “A Fonte” in Brazil.",
  "image": "https://www.macworld.com/wp-content/uploads/2025/06/4296081_original.jpg?quality=50\u0026strip=all\u0026w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-2808381\"\u003e\n\t\n\n\t\n\n\t\u003cdiv\u003e\n\t\t\t\t\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cimg width=\"1024\" height=\"512\" src=\"https://www.macworld.com/wp-content/uploads/2025/06/4296081_original.jpg?quality=50\u0026amp;strip=all\u0026amp;w=1024\" alt=\"Airtag\" data-hero=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.macworld.com/wp-content/uploads/2025/06/4296081_original.jpg?quality=50\u0026amp;strip=all 1600w, https://www.macworld.com/wp-content/uploads/2025/06/4296081_original.jpg?resize=300%2C150\u0026amp;quality=50\u0026amp;strip=all 300w, https://www.macworld.com/wp-content/uploads/2025/06/4296081_original.jpg?resize=768%2C384\u0026amp;quality=50\u0026amp;strip=all 768w, https://www.macworld.com/wp-content/uploads/2025/06/4296081_original.jpg?resize=1200%2C600\u0026amp;quality=50\u0026amp;strip=all 1200w, https://www.macworld.com/wp-content/uploads/2025/06/4296081_original.jpg?resize=1536%2C768\u0026amp;quality=50\u0026amp;strip=all 1536w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eImage: Apple\u003c/span\u003e\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\n\t\t\t\t\t\n\u003cdiv id=\"link_wrapped_content\"\u003e\n\n\n\n\n\u003cp\u003eIt’s been a long time since Apple introduced the \u003ca href=\"https://www.macworld.com/article/346345/apple-airtag-review.html\" data-type=\"link\" data-id=\"https://www.macworld.com/article/346345/apple-airtag-review.html\"\u003efirst and only AirTag\u003c/a\u003e. Apple’s item-tracking accessory hasn’t been updated since 2021, but it looks like we’ll be seeing a new model soon. After many rumors about AirTag 2 coming sometime this year, the recently released iOS 26 beta presents evidence that Apple is indeed gearing up to launch a new generation of AirTag.\u003c/p\u003e\n\n\n\n\u003cp\u003eBased on the iOS 26 code seen by Macworld, Apple has made under-the-hood changes to how the system manages AirTags. For instance, the company has been working on improving the Bluetooth communication between Apple devices and the item tracker, which will certainly make using the accessory more reliable. New battery-related features are also in the works.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs these features don’t seem to be enabled for the current AirTag, it’s not a stretch to assume that they’re meant for a new version of AirTag.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eMacworld\u003c/em\u003e has also learned that iOS 26 will make greater use of Extended Precision Finding technology, first introduced with the second generation of Apple’s ultra-wideband chip, which is available in the iPhone 15 and later. Devices with this technology can be found with Precision Finding up to 60 meters away. Meanwhile, AirTags can only be found with Precision Finding when they’re less than 15 meters away.\u003c/p\u003e\n\n\t\t\n\t\t\t\n\t\t\t\n\n\n\u003cp\u003eAccording to \u003ca href=\"https://www.macworld.com/article/2523902/a-new-airtag-is-coming-next-year-with-enhanced-privacy-security-features.html\" data-type=\"link\" data-id=\"https://www.macworld.com/article/2523902/a-new-airtag-is-coming-next-year-with-enhanced-privacy-security-features.html\"\u003eBloomberg’s Mark Gurman\u003c/a\u003e, the 2nd-generation AirTag (codenamed B589) will have extended ultra wideband range, so this would explain the changes Apple has been working on for iOS 26. A few weeks ago, \u003ca href=\"https://www.macworld.com/article/2783309/apple-quietly-stops-selling-one-of-its-original-airtag-accessories-as-new-model-looms.html\" data-type=\"link\" data-id=\"https://www.macworld.com/article/2783309/apple-quietly-stops-selling-one-of-its-original-airtag-accessories-as-new-model-looms.html\"\u003eMacworld reported\u003c/a\u003e that Apple had quietly stopped selling the AirTag Loop, one of its original accessories for the item tracker. The move presumably comes as the company is planning an imminent launch of AirTag 2. \u003c/p\u003e\n\n\n\n\u003cp\u003eEach AirTag costs $29, but you might want to wait a bit longer to buy a new one, since there’s a high chance Apple will announce the AirTag 2 along with the iPhone 17 lineup in September.\u003c/p\u003e\n\n\u003c/div\u003e\n\t\t\u003cdiv data-ga=\"article-footer-author\"\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://www.macworld.com/wp-content/uploads/2025/06/author_photo_Filipe-Esposito_1745845436-4.jpeg?quality=50\u0026amp;strip=all\u0026amp;w=150\u0026amp;h=150\u0026amp;crop=1\" height=\"125\" width=\"125\"/\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003eFilipe Espósito is a Brazilian journalist who has been covering tech for over 10 years, and has become known for publishing exclusive reports on Apple\u0026#39;s plans – such as the launch of the first titanium Apple Watch. He has worked for 9to5Mac and also co-hosts the tech podcast “A Fonte” in Brazil.\u003c/p\u003e\n\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
