{
  "id": "448ddca7-6a1c-49ae-a944-687d39bf2704",
  "title": "Lux Reveals Plans for Halide Mark III",
  "link": "https://www.macstories.net/linked/lux-reveals-plans-for-halide-mark-iii/",
  "description": "Yesterday, the team at Lux announced that they are working on the next major release of their pro camera app, Halide, which will be dubbed Halide Mark III. The next iteration of Halide, which Lux hopes to release in 2025 will focus on three areas: Color Grades: Like Kino, their App Store iPhone App of […]",
  "author": "John Voorhees",
  "published": "Tue, 24 Dec 2024 13:00:34 +0000",
  "source": "https://www.macstories.net/feed",
  "categories": [
    "Linked",
    "apps",
    "camera",
    "Halide",
    "iOS",
    "Kino",
    "Lux",
    "photography"
  ],
  "byline": "",
  "length": 1525,
  "excerpt": "Yesterday, the team at Lux announced that they are working on the next major release of their pro camera app, Halide, which will be dubbed Halide Mark III. The next iteration of Halide, which Lux hopes to release in 2025 will focus on three areas: Color Grades: Like Kino, their App Store iPhone App of",
  "siteName": "",
  "favicon": "https://www.macstories.net/app/themes/macstories4/images/apple-touch-icon-152x152-precomposed.png",
  "text": "Yesterday, the team at Lux announced that they are working on the next major release of their pro camera app, Halide, which will be dubbed Halide Mark III. The next iteration of Halide, which Lux hopes to release in 2025 will focus on three areas: Color Grades: Like Kino, their App Store iPhone App of the Year for shooting video, Lux plans to add custom color grading to Halide. HDR: Lux is developing its own implementation of High Dynamic Range that will give Halide’s photos “a thoughtful and nuanced HDR look.” Redesign: Although Lux has not revealed any details, Halide will be redesigned, which should include a focus on color grading. In addition to upcoming features, Lux announced a new community Discord for Halide and Kino, to collect feedback from customers and to allow them to share their interest in photography. The Discord and social media will also be where users can participate in the Halide and Kino 52-Week Challenge: Every week you’ll get a photography challenge on our Discord. We’ll also include resources to help with the challenge — like app-specific tips. The challenge will be shared there and on our social media. Once you’ve got your shot, you can share your shots and see what the rest of the community came up with. I love both Halide and Kino, and I’m intrigued by Lux’s new approach to development. Running a community can be challenging, but I expect the feedback Lux gets from users will be invaluable, as they work on the next big update to one of the App Store’s best camera apps.",
  "image": "https://56243e3f6f46fe44a301-deabeb5f3878e3553d0b065ea974f9bf.ssl.cf1.rackcdn.com/256px.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"content\"\u003e\n\n    \n\n    \u003cdiv\u003e\n                        \u003cp id=\"p1\"\u003eYesterday, the team at Lux announced that they are working on the next major release of their pro camera app, \u003ca href=\"https://apps.apple.com/us/app/halide-mark-ii-pro-camera/id885697368\" rel=\"noopener noreferrer\"\u003eHalide\u003c/a\u003e, which will be dubbed Halide Mark III. The next iteration of Halide, which Lux hopes to release in 2025 will focus on three areas:\u003c/p\u003e\n\u003cul id=\"ul2\"\u003e\u003cli\u003eColor Grades: Like \u003ca href=\"https://apps.apple.com/us/app/kino-pro-video-camera/id6472380172\" rel=\"noopener noreferrer\"\u003eKino\u003c/a\u003e, their \u003ca href=\"https://www.macstories.net/news/apple-announces-the-2024-app-store-awards/\" rel=\"noopener noreferrer\"\u003eApp Store iPhone App of the Year\u003c/a\u003e for shooting video, Lux plans to add custom color grading to Halide.\u003c/li\u003e\n\u003cli\u003eHDR: Lux is developing its own implementation of High Dynamic Range that will give Halide’s photos “a thoughtful and nuanced HDR look.”\u003c/li\u003e\n\u003cli\u003eRedesign: Although Lux has not revealed any details, Halide will be redesigned, which should include a focus on color grading.\u003c/li\u003e\n\u003c/ul\u003e\u003cp id=\"p3\"\u003eIn addition to upcoming features, Lux announced a new \u003ca href=\"https://discord.gg/cGjhm26X\" rel=\"noopener noreferrer\"\u003ecommunity Discord for Halide and Kino\u003c/a\u003e, to collect feedback from customers and to allow them to share their interest in photography. The Discord and social media will also be where users can participate in the \u003ca href=\"https://www.lux.camera/the-road-to-halide-mark-3/\" rel=\"noopener noreferrer\"\u003eHalide and Kino 52-Week Challenge\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote id=\"blockquote4\"\u003e\u003cp\u003e\n  Every week you’ll get a photography challenge on our Discord. We’ll also include resources to help with the challenge — like app-specific tips. The challenge will be shared there and on our social media. Once you’ve got your shot, you can share your shots and see what the rest of the community came up with.\n\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp id=\"p5\"\u003eI love both \u003ca href=\"https://www.macstories.net/news/manual-camera-app-halide-introduces-process-zero-a-new-unprocessed-image-capture-mode/\" rel=\"noopener noreferrer\"\u003eHalide\u003c/a\u003e and \u003ca href=\"https://www.macstories.net/news/kino-1-2-adds-camera-control-support-and-higher-resolution-and-frame-rate-recording/\" rel=\"noopener noreferrer\"\u003eKino\u003c/a\u003e, and I’m intrigued by Lux’s new approach to development. Running a community can be challenging, but I expect the feedback Lux gets from users will be invaluable, as they work on the next big update to one of the App Store’s best camera apps.\u003c/p\u003e\n            \u003c/div\u003e\n\n    \n        \n\n    \n    \n    \n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-24T13:00:34-05:00",
  "modifiedTime": null
}
