{
  "id": "4ba6cb56-14dc-431d-898a-f43ad1b6f165",
  "title": "Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)",
  "link": "https://www.macrumors.com/2021/09/21/deals-apple-pencil-macbook-air/",
  "description": "Today we're tracking a pair of deals, one on the Apple Pencil 2 and one on the 2020 M1 MacBook Air. These sales include the current best price online for the Apple Pencil 2, and an all-time low price on the MacBook Air. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. Apple Pencil 2 Firstly, Woot has the Apple Pencil 2 for $109.99, down from $129.00. This sale isn't the lowest price we've ever tracked on this accessory, as it's been down to $99.00 in previous sales earlier this year, but it's still a solid second-best deal if you're looking to purchase an Apple Pencil 2 this week. $19 OFFApple Pencil 2 for $109.99 The Apple Pencil 2 is compatible with the new iPad mini 6, but not the new 10.2-inch iPad. For that tablet, only the original Apple Pencil is supported. MacBook Air Amazon today has the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Space Gray and Silver. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. While the Gold option won't be available until around October 1, you can still purchase a Gold MacBook Air today at this discounted price ahead of the delayed shipping date. $149 OFFM1 MacBook Air (512GB) for $1,099.99 The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook.Related Roundup: Apple DealsThis article, \"Deals: Get the Apple Pencil 2 for $109.99 ($19 Off) and 512GB M1 MacBook Air for $1,099.99 ($149 Off)\" first appeared on MacRumors.comDiscuss this article in our forums",
  "author": "Mitchel Broussard",
  "published": "Tue, 21 Sep 2021 10:51:07 PDT",
  "source": "http://feeds.macrumors.com/MacRumors-Mac",
  "categories": [
    "Deals"
  ],
  "byline": "Mitchel Broussard",
  "length": 6273,
  "excerpt": "Today we're tracking a pair of deals, one on the Apple Pencil 2 and one on the 2020 M1 MacBook Air. These sales include the current best price...",
  "siteName": "MacRumors",
  "favicon": "https://images.macrumors.com/images-new/favicon-32x32.png",
  "text": "Today we're tracking a pair of deals, one on the Apple Pencil 2 and one on the 2020 M1 MacBook Air. These sales include the current best price online for the Apple Pencil 2, and an all-time low price on the MacBook Air. Note: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. Apple Pencil 2 Firstly, Woot has the Apple Pencil 2 for $109.99, down from $129.00. This sale isn't the lowest price we've ever tracked on this accessory, as it's been down to $99.00 in previous sales earlier this year, but it's still a solid second-best deal if you're looking to purchase an Apple Pencil 2 this week. The Apple Pencil 2 is compatible with the new iPad mini 6, but not the new 10.2-inch iPad. For that tablet, only the original Apple Pencil is supported. MacBook Air Amazon today has the 512GB M1 MacBook Air for $1,099.99, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it's available in Space Gray and Silver. You'll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order. While the Gold option won't be available until around October 1, you can still purchase a Gold MacBook Air today at this discounted price ahead of the delayed shipping date. The 256GB model is on sale as well, available for $849.99, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we've ever tracked for the 256GB MacBook Air, so if you're willing to wait a few weeks, it's worth locking in this price while it's available. You can find even more discounts on other MacBooks by visiting our Best Deals guide for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you're shopping for a new Apple notebook. Popular StoriesiPhone 17 Pro Launching Later This Year With These 12 New FeaturesWhile the iPhone 17 Pro and iPhone 17 Pro Max are not expected to launch until September, there are already plenty of rumors about the devices. Below, we recap key changes rumored for the iPhone 17 Pro models as of April 2025: Aluminum frame: iPhone 17 Pro models are rumored to have an aluminum frame, whereas the iPhone 15 Pro and iPhone 16 Pro models have a titanium frame, and the iPhone ...10 Products Still Coming From Apple in 2025Friday April 11, 2025 4:14 pm PDT by Juli CloverApple may have updated several iPads and Macs late last year and early this year, but there are still multiple new devices that we're looking forward to seeing in 2025. Most will come in September or October, but there could be a few surprises before then. We've rounded up a list of everything that we're still waiting to see from Apple in 2025. iPhone 17, 17 Air, and 17 Pro - We get...Apple's 20th Anniversary iPhone May Finally Go All ScreenTuesday April 15, 2025 6:31 am PDT by Tim HardwickApple is preparing a \"bold\" new iPhone Pro model for the iPhone's 20th anniversary in 2027, according to Bloomberg's Mark Gurman. As part of what's being described as a \"major shake-up,\" Apple is said to be developing a design that makes more extensive use of glass – and this could point directly to the display itself. Here's the case for Apple releasing a truly all-screen iPhone with no...Foldable iPhone Resolutions Leak With Under-Screen Camera TippedMonday April 14, 2025 3:12 am PDT by Tim HardwickApple's upcoming foldable iPhone (or \"iPhone Fold\") will feature two screens as part of its book-style design, and a Chinese leaker claims to know the resolutions for both of them. According to the Weibo-based account Digital Chat Station, the inner display, which is approximately 7.76 inches, will use a 2,713 x 1,920 resolution and feature \"under-screen camera technology.\" Meanwhile, the...iPadOS 19 Will Be 'More Like macOS' in Three WaysA common complaint about the iPad Pro is that the iPadOS software platform fails to fully take advantage of the device's powerful hardware. That could soon change. Bloomberg's Mark Gurman today said that iPadOS 19 will be \"more like macOS.\" Gurman said that iPadOS 19 will be \"more like a Mac\" in three ways:Improved productivity Improved multitasking Improved app window management...Vision Pro 2 Rumored to Have Two Key Advantages Over Current ModelApple is working on a new version of the Vision Pro with two key advantages over the current model, according to Bloomberg's Mark Gurman. Specifically, in his Power On newsletter today, Gurman said Apple is developing a new headset that is both lighter and less expensive than the current Vision Pro, which starts at $3,499 in the U.S. and weighs up to 1.5 pounds. Gurman said Apple is also...iOS 19 Will Add These New Features to Your iPhoneThe first iOS 19 beta is less than two months away, and there are already a handful of new features that are expected with the update. Apple should release the first iOS 19 beta to developers immediately following the WWDC 2025 keynote, which is scheduled for Monday, June 9. Following beta testing, the update should be released to the general public in September. Below, we recap the key...An Apple Store in the UK is Permanently Closing Later This YearApple has confirmed that it will be permanently closing its retail store in the heart of Bristol, England, and there is no replacement in sight. Apple Bristol in 2023 Apple Bristol will be closing its doors on Saturday, August 9, due to redevelopment plans at the Cabot Circus Shopping Centre, and the adjacent Bristol Shopping Quarter. According to news reports, and a building application, the ...Waiting for the Perfect MacBook Pro? 2026 Might Be the YearThursday April 10, 2025 4:19 am PDT by Tim HardwickApple in October 2024 overhauled its 14-inch and 16-inch MacBook Pro models, adding M4, M4 Pro, and M4 Max chips, Thunderbolt 5 ports on higher-end models, display changes, and more. That's quite a lot of updates in one go, but if you think this means a further major refresh for the MacBook Pro is now several years away, think again. Bloomberg's Mark Gurman has said he expects only a small...",
  "image": "https://images.macrumors.com/t/oqL79BMGV0dHS7nMZsXJDHgnEo8=/1600x/article-new/2021/09/sept-21-deals.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv role=\"main\" id=\"maincontent\"\u003e\u003carticle expanded=\"true\"\u003e\u003cdiv data-io-article-url=\"/2021/09/21/deals-apple-pencil-macbook-air/\"\u003e\u003cp\u003eToday we\u0026#39;re tracking a pair of deals, \u003ca rel=\"sponsored\" href=\"https://www.anrdoezrs.net/click-462641-13142085?url=https%3A%2F%2Fcomputers.woot.com%2Foffers%2Fapple-pencil-2nd-generation-6\"\u003eone on the Apple Pencil 2\u003c/a\u003e and \u003ca rel=\"sponsored\" href=\"https://buy.geni.us/Proxy.ashx?TSID=3088\u0026amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB08N5R2GQW%3Ftag%3Dmacrumors-20%26th%3D1%26geniuslink%3Dtrue\"\u003eone on the 2020 M1 MacBook Air\u003c/a\u003e. These sales include the current best price online for the Apple Pencil 2, and an all-time low price on the MacBook Air.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://images.macrumors.com/t/RasY6IouDyjH52pp0berT9NTuvA=/400x0/article-new/2021/09/sept-21-deals.jpg?lossy\" srcset=\"https://images.macrumors.com/t/RasY6IouDyjH52pp0berT9NTuvA=/400x0/article-new/2021/09/sept-21-deals.jpg?lossy 400w,https://images.macrumors.com/t/Cui8sFYrOVbvcQ5XzX4GnB9elcg=/800x0/article-new/2021/09/sept-21-deals.jpg?lossy 800w,https://images.macrumors.com/t/QTIv2F-Kk7gRYLlgTnKB57QGNDc=/1600x0/article-new/2021/09/sept-21-deals.jpg 1600w,https://images.macrumors.com/t/uE_eOoMig8sZz7dHL3iQ5Po4gAo=/2500x0/filters:no_upscale()/article-new/2021/09/sept-21-deals.jpg 2500w\" sizes=\"(max-width: 900px) 100vw, 697px\" alt=\"sept 21 deals\" width=\"1600\" height=\"900\"/\u003e\u003cem\u003e\u003csmall\u003eNote: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.\u003c/small\u003e\u003c/em\u003e\u003cbr/\u003e\n\u003c/p\u003e\n\u003ch2\u003eApple Pencil 2\u003c/h2\u003e\n\u003cp\u003eFirstly, Woot has the Apple Pencil 2 for \u003ca rel=\"sponsored\" href=\"https://www.anrdoezrs.net/click-462641-13142085?url=https%3A%2F%2Fcomputers.woot.com%2Foffers%2Fapple-pencil-2nd-generation-6\"\u003e\u003cstrong\u003e$109.99\u003c/strong\u003e\u003c/a\u003e, down from $129.00. This sale isn\u0026#39;t the lowest price we\u0026#39;ve ever tracked on this accessory, as it\u0026#39;s been down to $99.00 in previous sales earlier this year, but it\u0026#39;s still a solid second-best deal if you\u0026#39;re looking to purchase an Apple Pencil 2 this week.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://images.macrumors.com/t/wiVRU7YJsDwW9ZZ1YZye2DNCBM0=/400x0/article-new/2021/09/ipad-mini-apple-pencil-green.jpg?lossy\" srcset=\"https://images.macrumors.com/t/wiVRU7YJsDwW9ZZ1YZye2DNCBM0=/400x0/article-new/2021/09/ipad-mini-apple-pencil-green.jpg?lossy 400w,https://images.macrumors.com/t/BG8HqNImusv0K75DNCFFN5YaM68=/800x0/article-new/2021/09/ipad-mini-apple-pencil-green.jpg?lossy 800w,https://images.macrumors.com/t/-Qg7dorqs96OGLI0om4vXKdAZVQ=/1600x0/article-new/2021/09/ipad-mini-apple-pencil-green.jpg 1600w,https://images.macrumors.com/t/5ieH3Y7AFd2cMvONxFmy0_MPkOw=/2500x0/filters:no_upscale()/article-new/2021/09/ipad-mini-apple-pencil-green.jpg 2500w\" sizes=\"(max-width: 900px) 100vw, 697px\" alt=\"ipad mini apple pencil green\" width=\"1600\" height=\"900\" data-old-src=\"https://images.macrumors.com/images-new/1x1.trans.gif\" data-src=\"https://images.macrumors.com/t/wiVRU7YJsDwW9ZZ1YZye2DNCBM0=/400x0/article-new/2021/09/ipad-mini-apple-pencil-green.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/wiVRU7YJsDwW9ZZ1YZye2DNCBM0=/400x0/article-new/2021/09/ipad-mini-apple-pencil-green.jpg?lossy 400w,https://images.macrumors.com/t/BG8HqNImusv0K75DNCFFN5YaM68=/800x0/article-new/2021/09/ipad-mini-apple-pencil-green.jpg?lossy 800w,https://images.macrumors.com/t/-Qg7dorqs96OGLI0om4vXKdAZVQ=/1600x0/article-new/2021/09/ipad-mini-apple-pencil-green.jpg 1600w,https://images.macrumors.com/t/5ieH3Y7AFd2cMvONxFmy0_MPkOw=/2500x0/filters:no_upscale()/article-new/2021/09/ipad-mini-apple-pencil-green.jpg 2500w\"/\u003e\u003cbr/\u003e\u003c/p\u003e\n\u003cp\u003eThe Apple Pencil 2 is compatible with the new iPad mini 6, but not the new 10.2-inch iPad. For that tablet, only the original Apple Pencil is supported.\u003cbr/\u003e\n\u003c/p\u003e\n\u003ch2\u003eMacBook Air\u003c/h2\u003e\n\u003cp\u003eAmazon today has the 512GB M1 MacBook Air for \u003ca rel=\"sponsored\" href=\"https://buy.geni.us/Proxy.ashx?TSID=3088\u0026amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB08N5R2GQW%3Ftag%3Dmacrumors-20%26th%3D1%26geniuslink%3Dtrue\"\u003e\u003cstrong\u003e$1,099.99\u003c/strong\u003e\u003c/a\u003e, down from $1,249.00. This is a match of the all-time low price on this model of the 2020 MacBook Air, and it\u0026#39;s available in Space Gray and Silver.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://images.macrumors.com/t/-Syno-JzWYeQZ2-MS1Bf7Vx9cvI=/400x0/article-new/2021/04/macbook-air-deals.jpg?lossy\" srcset=\"https://images.macrumors.com/t/-Syno-JzWYeQZ2-MS1Bf7Vx9cvI=/400x0/article-new/2021/04/macbook-air-deals.jpg?lossy 400w,https://images.macrumors.com/t/K0aDXrJhDYmcsM5dsMYhO23MLxo=/800x0/article-new/2021/04/macbook-air-deals.jpg?lossy 800w,https://images.macrumors.com/t/BNjM-RjcmVeGK4nvQG5buw8GXSQ=/1600x0/article-new/2021/04/macbook-air-deals.jpg 1600w,https://images.macrumors.com/t/FP6PIrD5W934MeDN0XePBDH7MWM=/2500x0/filters:no_upscale()/article-new/2021/04/macbook-air-deals.jpg 2500w\" sizes=\"(max-width: 900px) 100vw, 697px\" alt=\"macbook air deals\" width=\"2500\" height=\"1406\" data-old-src=\"https://images.macrumors.com/images-new/1x1.trans.gif\" data-src=\"https://images.macrumors.com/t/-Syno-JzWYeQZ2-MS1Bf7Vx9cvI=/400x0/article-new/2021/04/macbook-air-deals.jpg?lossy\" data-srcset=\"https://images.macrumors.com/t/-Syno-JzWYeQZ2-MS1Bf7Vx9cvI=/400x0/article-new/2021/04/macbook-air-deals.jpg?lossy 400w,https://images.macrumors.com/t/K0aDXrJhDYmcsM5dsMYhO23MLxo=/800x0/article-new/2021/04/macbook-air-deals.jpg?lossy 800w,https://images.macrumors.com/t/BNjM-RjcmVeGK4nvQG5buw8GXSQ=/1600x0/article-new/2021/04/macbook-air-deals.jpg 1600w,https://images.macrumors.com/t/FP6PIrD5W934MeDN0XePBDH7MWM=/2500x0/filters:no_upscale()/article-new/2021/04/macbook-air-deals.jpg 2500w\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou\u0026#39;ll see this sale price reflected on the checkout screen, once an automatic coupon is applied to your order\u003c/strong\u003e. While the Gold option won\u0026#39;t be available until around October 1, you can still purchase a Gold MacBook Air today at this discounted price ahead of the delayed shipping date.\u003c/p\u003e\n\n\u003cp\u003eThe 256GB model is on sale as well, available for \u003ca rel=\"sponsored\" href=\"https://buy.geni.us/Proxy.ashx?TSID=3088\u0026amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB08N5LNQCX%3Ftag%3Dmacrumors-20%26linkCode%3Dogi%26th%3D1\"\u003e\u003cstrong\u003e$849.99\u003c/strong\u003e\u003c/a\u003e, down from $999.00. All three colors are discounted for this model, but none are in stock today. This is still the lowest price we\u0026#39;ve ever tracked for the 256GB MacBook Air, so if you\u0026#39;re willing to wait a few weeks, it\u0026#39;s worth locking in this price while it\u0026#39;s available.\u003c/p\u003e\n\u003cp\u003eYou can find even more discounts on other MacBooks by visiting our \u003ca href=\"https://www.macrumors.com/guide/macbook-pro-air-deals/\"\u003eBest Deals guide\u003c/a\u003e for MacBook Pro and MacBook Air. In this guide we track the steepest discounts for the newest MacBook models every week, so be sure to bookmark it and check back often if you\u0026#39;re shopping for a new Apple notebook.\u003c/p\u003e\n\u003c/div\u003e\u003c/article\u003e\u003cp\u003e\u003ch2\u003ePopular Stories\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/04/13/iphone-17-pro-rumored-new-features/\"\u003eiPhone 17 Pro Launching Later This Year With These 12 New Features\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eWhile the iPhone 17 Pro and iPhone 17 Pro Max are not expected to launch until September, there are already plenty of rumors about the devices.\nBelow, we recap key changes rumored for the iPhone 17 Pro models as of April 2025:\nAluminum frame: iPhone 17 Pro models are rumored to have an aluminum frame, whereas the iPhone 15 Pro and iPhone 16 Pro models have a titanium frame, and the iPhone ...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/04/11/10-apple-products-2025-launch/\"\u003e10 Products Still Coming From Apple in 2025\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eFriday April 11, 2025 4:14 pm PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple may have updated several iPads and Macs late last year and early this year, but there are still multiple new devices that we\u0026#39;re looking forward to seeing in 2025. Most will come in September or October, but there could be a few surprises before then.\nWe\u0026#39;ve rounded up a list of everything that we\u0026#39;re still waiting to see from Apple in 2025.\n\n \tiPhone 17, 17 Air, and 17 Pro - We get...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/04/15/20th-anniversary-iphone-truly-all-screen-model/\"\u003eApple\u0026#39;s 20th Anniversary iPhone May Finally Go All Screen\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eTuesday April 15, 2025 6:31 am PDT by \u003ca href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\"\u003eTim Hardwick\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple is preparing a \u0026#34;bold\u0026#34; new iPhone Pro model for the iPhone\u0026#39;s 20th anniversary in 2027, according to Bloomberg\u0026#39;s Mark Gurman. As part of what\u0026#39;s being described as a \u0026#34;major shake-up,\u0026#34; Apple is said to be developing a design that makes more extensive use of glass – and this could point directly to the display itself.\nHere\u0026#39;s the case for Apple releasing a truly all-screen iPhone with no...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/04/14/iphone-fold-display-resolutions-cameras/\"\u003eFoldable iPhone Resolutions Leak With Under-Screen Camera Tipped\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eMonday April 14, 2025 3:12 am PDT by \u003ca href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\"\u003eTim Hardwick\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple\u0026#39;s upcoming foldable iPhone (or \u0026#34;iPhone Fold\u0026#34;) will feature two screens as part of its book-style design, and a Chinese leaker claims to know the resolutions for both of them.\nAccording to the Weibo-based account Digital Chat Station, the inner display, which is approximately 7.76 inches, will use a 2,713 x 1,920 resolution and feature \u0026#34;under-screen camera technology.\u0026#34; Meanwhile, the...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/04/13/ipados-19-more-like-macos/\"\u003eiPadOS 19 Will Be \u0026#39;More Like macOS\u0026#39; in Three Ways\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eA common complaint about the iPad Pro is that the iPadOS software platform fails to fully take advantage of the device\u0026#39;s powerful hardware.\nThat could soon change.\nBloomberg\u0026#39;s Mark Gurman today said that iPadOS 19 will be \u0026#34;more like macOS.\u0026#34;\nGurman said that iPadOS 19 will be \u0026#34;more like a Mac\u0026#34; in three ways:Improved productivity\nImproved multitasking\nImproved app window management...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/04/13/vision-pro-2-two-rumored-upgrades/\"\u003eVision Pro 2 Rumored to Have Two Key Advantages Over Current Model\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eApple is working on a new version of the Vision Pro with two key advantages over the current model, according to Bloomberg\u0026#39;s Mark Gurman.\nSpecifically, in his Power On newsletter today, Gurman said Apple is developing a new headset that is both lighter and less expensive than the current Vision Pro, which starts at $3,499 in the U.S. and weighs up to 1.5 pounds.\nGurman said Apple is also...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/04/15/ios-19-will-add-these-new-features/\"\u003eiOS 19 Will Add These New Features to Your iPhone\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eThe first iOS 19 beta is less than two months away, and there are already a handful of new features that are expected with the update.\nApple should release the first iOS 19 beta to developers immediately following the WWDC 2025 keynote, which is scheduled for Monday, June 9. Following beta testing, the update should be released to the general public in September.\nBelow, we recap the key...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/04/14/apple-bristol-permanently-closing/\"\u003eAn Apple Store in the UK is Permanently Closing Later This Year\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eApple has confirmed that it will be permanently closing its retail store in the heart of Bristol, England, and there is no replacement in sight.\nApple Bristol in 2023 \nApple Bristol will be closing its doors on Saturday, August 9, due to redevelopment plans at the Cabot Circus Shopping Centre, and the adjacent Bristol Shopping Quarter. According to news reports, and a building application, the ...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2025/04/10/2026-perfect-macbook-pro-rumors/\"\u003eWaiting for the Perfect MacBook Pro? 2026 Might Be the Year\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eThursday April 10, 2025 4:19 am PDT by \u003ca href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\"\u003eTim Hardwick\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple in October 2024 overhauled its 14-inch and 16-inch MacBook Pro models, adding M4, M4 Pro, and M4 Max chips, Thunderbolt 5 ports on higher-end models, display changes, and more. That\u0026#39;s quite a lot of updates in one go, but if you think this means a further major refresh for the MacBook Pro is now several years away, think again.\nBloomberg\u0026#39;s Mark Gurman has said he expects only a small...\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2021-09-21T10:51:07-07:00",
  "modifiedTime": null
}
