{
  "id": "5015e7ab-0066-42c0-b850-778be4c8cbb9",
  "title": "∞ The Dalrymple Report: Alexa+, Charging, and iOS 26",
  "link": "https://www.loopinsight.com/2025/06/27/the-dalrymple-report-alexa-charging-and-ios-26/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-dalrymple-report-alexa-charging-and-ios-26",
  "description": "Dave got a new speaker assistant for his home... and it's powered by Alexa. We talk about how much better Alexa is than Siri and even throw in some comments about Gemini, Google's AI assistant (spoiler, it's better than Siri too). We also talk about charging one device off of anotherfor instance, charging your AirPods using your phone. And we look at some of the new features of Apple's new OSes. Follow this podcast Show Notes: Charge AirPods (or Even an iPhone) With Your iPhone iOS 26 Brings New Functionality to HomePod A few iOS 26 Best and Hidden Features iPhone Users Upset About Apple Promoting F1 Movie With Wallet App Notification Shows and movies we're watching Anatomy of a Scandal, Netflix Sally, Disney+",
  "author": "Jim Dalrymple",
  "published": "Fri, 27 Jun 2025 17:41:20 +0000",
  "source": "https://www.loopinsight.com/feed",
  "categories": [
    "Uncategorized"
  ],
  "byline": "Written by Jim Dalrymple",
  "length": 808,
  "excerpt": "Written by Jim Dalrymple",
  "siteName": "",
  "favicon": "",
  "text": "Posted on Friday, June 27th, 2025 at 10:41 am. PTWritten by Jim DalrympleDave got a new speaker assistant for his home… and it’s powered by Alexa. We talk about how much better Alexa is than Siri and even throw in some comments about Gemini, Google’s AI assistant (spoiler, it’s better than Siri too). We also talk about charging one device off of another for instance, charging your AirPods using your phone. And we look at some of the new features of Apple’s new OSes.Follow this podcastShow Notes: Charge AirPods (or Even an iPhone) With Your iPhone iOS 26 Brings New Functionality to HomePod A few iOS 26 Best and Hidden Features iPhone Users Upset About Apple Promoting F1 Movie With Wallet App NotificationShows and movies we’re watching Anatomy of a Scandal, Netflix Sally, Disney+Comments are closed.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\" role=\"main\"\u003e\u003carticle id=\"post-110721\"\u003e\u003cheader\u003e \u003ctime datetime=\"2025-06-27T10:41:20-07:00\" pubdate=\"\"\u003ePosted on Friday, June 27th, 2025 at 10:41 am. PT\u003c/time\u003e\u003cp\u003eWritten by \u003ca href=\"https://www.loopinsight.com/author/jim-dalrymple/\" title=\"Posts by Jim Dalrymple\" rel=\"author\"\u003eJim Dalrymple\u003c/a\u003e\u003c/p\u003e\u003c/header\u003e\u003cdiv\u003e\u003cp\u003eDave got a new speaker assistant for his home… and it’s powered by Alexa. We talk about how much better Alexa is than Siri and even throw in some comments about Gemini, Google’s AI assistant (spoiler, it’s better than Siri too). We also talk about charging one device off of another for instance, charging your AirPods using your phone. And we look at some of the new features of Apple’s new OSes.\u003c/p\u003e\u003cp\u003e\u003ca href=\"http://loopu.in/1KsW16v\"\u003eFollow this podcast\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eShow Notes:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e \u003cli\u003e\u003cp\u003e\u003ca href=\"https://www.macrumors.com/how-to/charge-other-devices-with-iphone-ipad/\"\u003eCharge AirPods (or Even an iPhone) With Your iPhone\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003ca href=\"https://www.macrumors.com/2025/06/25/ios-26-homepod-apple-music/\"\u003eiOS 26 Brings New Functionality to HomePod\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003ca href=\"https://www.macrumors.com/2025/06/23/ios-26-best-and-hidden-features/\"\u003eA few iOS 26 Best and Hidden Features\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp\u003e\u003ca href=\"https://www.macrumors.com/2025/06/24/apple-wallet-notification-f1-movie-ad/\"\u003eiPhone Users Upset About Apple Promoting F1 Movie With Wallet App Notification\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eShows and movies we’re watching\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e \u003cli\u003eAnatomy of a Scandal, Netflix\u003c/li\u003e \u003cli\u003eSally, Disney+\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eComments are closed.\u003c/p\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
