{
  "id": "5656dca7-a093-4a60-bc50-75cd407bb7c3",
  "title": "Apple says Brazil antitrust ruling 'drastically threatens' user privacy in appeal",
  "link": "https://appleinsider.com/articles/24/12/06/apple-says-brazil-antitrust-ruling-drastically-threatens-user-privacy-in-appeal?utm_medium=rss",
  "description": "Apple has issued an appeal following the decision of an antitrust regulator in Brazil, which requires the company to enable sideloading or face daily fines.Apple has appealed the ruling of Brazilian regulator CADE.In 2022, an antitrust complaint against Apple was filed with the Brazilian regulator CADE, short for Conselho Administrativo de Defesa Economica. The complaint argued that Apple forced developers into using its own payment system. Following an investigation into the company, a ruling was issued against Apple in November 2024.CADE gave Apple 20 days to lift restrictions on in-app payment methods and steering customers to external websites. If Apple fails to comply, it could face a fine of R$250,000, or roughly $43,000 per day. Now, Apple has filed an appeal, calling the ruling \"arbitrary\" and saying that it \"drastically threatens\" user privacy and security. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Marko Zivkovic",
  "published": "Fri, 06 Dec 2024 00:28:58 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Marko Zivkovic",
  "length": 2749,
  "excerpt": "Apple has issued an appeal following the decision of an antitrust regulator in Brazil, which requires the company to enable sideloading or face daily fines.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Apple has appealed the ruling of Brazilian regulator CADE. Apple has issued an appeal following the decision of an antitrust regulator in Brazil, which requires the company to enable sideloading or face daily fines. In 2022, an antitrust complaint against Apple was filed with the Brazilian regulator CADE, short for Conselho Administrativo de Defesa Economica. The complaint argued that Apple forced developers into using its own payment system. Following an investigation into the company, a ruling was issued against Apple in November 2024. CADE gave Apple 20 days to lift restrictions on in-app payment methods and steering customers to external websites. If Apple fails to comply, it could face a fine of R$250,000, or roughly $43,000 per day. Now, Apple has filed an appeal, calling the ruling \"arbitrary\" and saying that it \"drastically threatens\" user privacy and security. A report from TeleSintese, discovered by 9to5mac on Thursday is in Portuguese, meaning that the statements provided here are translations. Apple explained that it would be impossible to comply with the decision within the set timeframe of 20 days, saying that it would need more time to implement \"complex technical changes\" that would ensure compliance. The company also reportedly stated that the ruling was \"not urgent in any way\" as the App Store business model has remained largely unchanged for a number of years. This is obviously not the first time Apple's App Store policies have come under fire. In the United States, Apple was involved in a high-profile lawsuit against Epic Games, who ultimately lost the case. In the European Union, however, Apple was forced into enabling third-party app marketplaces and developing an all-new commission system for the region. In 2021, the UK's Competition and Markets Authority (CMA) launched an investigation into the iOS App Store due to allegations that it was used to restrict competition. In August of 2024, however, the CMA closed its investigation before reaching a definitive conclusion, explaining that it had more important matters to deal with. Similarly, in June of 2023, the Japanese government proposed a new law that aims to force third-party app markets onto Apple and Google. A year later, in 2024, the law was approved by the country's parliament and is expected to take effect in 2025. The iPhone maker could theoretically re-purpose its existing alternative app marketplace model for use in other regions, which would likely satisfy local regulators and consumers alike. The Brazilian regulator has yet to respond to the company's latest appeal, though, so the future of the case remains uncertain.",
  "image": "https://photos5.appleinsider.com/gallery/61961-128346-52560-104989-app-store-xl-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-hero\" aria-labelledby=\"hero-cap\" role=\"figure\"\u003e\n                          \u003cp id=\"hero-cap\" title=\"Apple has appealed the ruling of Brazilian regulator CADE.\"\u003eApple has appealed the ruling of Brazilian regulator CADE.\u003c/p\u003e\n                                    \u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61961-128346-52560-104989-app-store-xl-xl.jpg\"\u003e\n              \u003cimg fetchpriority=\"high\" src=\"https://photos5.appleinsider.com/gallery/61961-128346-52560-104989-app-store-xl-xl.jpg\" alt=\"\"/\u003e\n            \u003c/a\u003e\n                      \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cp\u003eApple has issued an appeal following the decision of an antitrust regulator in Brazil, which requires the company to enable sideloading or face daily fines.\n\u003c/p\u003e\u003cp\u003eIn 2022, an antitrust complaint against Apple was filed with the Brazilian regulator CADE, short for Conselho Administrativo de Defesa Economica. The complaint argued that Apple forced developers into using its own payment system. Following an \u003ca href=\"https://appleinsider.com/articles/23/01/19/brazil-watchdog-investigates-apple-over-app-store-payment-rules\"\u003e investigation\u003c/a\u003e into the company, a ruling \u003ca href=\"https://appleinsider.com/articles/24/11/26/brazils-antitrust-regulator-is-set-to-fine-apple-if-in-app-purchase-restrictions-arent-lifted\"\u003ewas issued\u003c/a\u003e against Apple in November 2024.\n\u003c/p\u003e\u003cp\u003eCADE gave Apple 20 days to lift restrictions on in-app payment methods and steering customers to external websites. If Apple fails to comply, it could face a fine of R$250,000, or roughly $43,000 per day. Now, Apple has filed an appeal, calling the ruling \u0026#34;arbitrary\u0026#34; and saying that it \u0026#34;drastically threatens\u0026#34; user privacy and security.\n\u003c/p\u003e\u003cp\u003eA \u003ca href=\"https://telesintese.com.br/apple-recorre-ao-tribunal-do-cade-contra-abertura-de-sistema/\"\u003ereport\u003c/a\u003e from \u003cem\u003eTeleSintese\u003c/em\u003e, \u003ca href=\"https://9to5mac.com/2024/12/05/apple-brazilian-regulator-appeal/\"\u003ediscovered\u003c/a\u003e by \u003cem\u003e9to5mac\u003c/em\u003e on Thursday is in Portuguese, meaning that the statements provided here are translations. Apple explained that it would be impossible to comply with the decision within the set timeframe of 20 days, saying that it would need more time to implement \u0026#34;complex technical changes\u0026#34; that would ensure compliance. \n\u003c/p\u003e\u003cp\u003eThe company also reportedly stated that the ruling was \u0026#34;not urgent in any way\u0026#34; as the \u003ca href=\"https://appleinsider.com/inside/app-store\" title=\"App Store\" data-kpt=\"1\"\u003eApp Store\u003c/a\u003e business model has remained largely unchanged for a number of years.\n\u003c/p\u003e\u003cp\u003eThis is obviously not the first time Apple\u0026#39;s App Store policies have \u003ca href=\"https://appleinsider.com/articles/24/01/16/apples-app-store-anti-steering-rules-are-gone-but-the-replacement-isnt-much-better\"\u003ecome under fire.\u003c/a\u003e In the United States, Apple was involved in a high-profile \u003ca href=\"https://appleinsider.com/articles/20/08/23/apple-versus-epic-games-fortnite-app-store-saga----the-story-so-far\"\u003elawsuit\u003c/a\u003e against Epic Games, who ultimately lost the case. In the European Union, however, Apple was forced into enabling third-party app marketplaces and developing an all-new \u003ca href=\"https://appleinsider.com/articles/24/08/08/apple-bows-to-eu-pressure-over-anti-steering-practices\"\u003ecommission system\u003c/a\u003e for the region.\n\u003c/p\u003e\u003cp\u003eIn 2021, the UK\u0026#39;s Competition and Markets Authority (CMA) \u003ca href=\"https://appleinsider.com/articles/21/03/04/uk-launching-investigation-of-apple-app-store-after-anti-competition-complaints\"\u003elaunched\u003c/a\u003e an investigation into the \u003ca href=\"https://appleinsider.com/inside/ios\" title=\"iOS\" data-kpt=\"1\"\u003eiOS\u003c/a\u003e App Store due to allegations that it was used to restrict competition. In August of 2024, however, the CMA \u003ca href=\"https://appleinsider.com/articles/24/08/21/uk-drops-app-store-investigation-says-it-has-better-things-to-do\"\u003eclosed its investigation\u003c/a\u003e before reaching a definitive conclusion, explaining that it had more important matters to deal with.\n\u003c/p\u003e\u003cp\u003eSimilarly, in June of 2023, the Japanese government \u003ca href=\"https://appleinsider.com/articles/23/06/16/japan-law-will-require-apple-to-allow-alternate-iphone-app-stores\"\u003eproposed\u003c/a\u003e a new law that aims to force third-party app markets onto Apple and Google. A year later, in 2024, the law was \u003ca href=\"https://appleinsider.com/articles/24/06/12/japans-parliament-has-approved-a-law-that-will-force-third-party-app-stores-on-apple-google\"\u003eapproved\u003c/a\u003e by the country\u0026#39;s parliament and is expected to take effect in 2025.\n\u003c/p\u003e\u003cp\u003eThe \u003ca href=\"https://appleinsider.com/inside/iphone\" title=\"iPhone\" data-kpt=\"1\"\u003eiPhone\u003c/a\u003e maker could theoretically re-purpose its existing alternative app marketplace model for use in other regions, which would likely satisfy local regulators and consumers alike. The Brazilian regulator has yet to respond to the company\u0026#39;s latest appeal, though, so the future of the case remains uncertain.\u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-06T00:28:58Z",
  "modifiedTime": null
}
