{
  "id": "593d4ae3-ae0a-408e-aa49-e9f06451cc0a",
  "title": "An App Store First: Delta Adds Patreon Link for Purchase and Perks",
  "link": "https://www.macstories.net/news/an-app-store-first-delta-adds-patreon-link-for-purchase-and-perks/",
  "description": "Delta, the MacStories Selects App of the Year, received an important update today that allows users of the game emulator to support its development via Patreon from inside the app. Existing patrons can connect their Patreon accounts from Delta’s settings, too, allowing them to access perks like alternative app icons and experimental features. This is […]",
  "author": "John Voorhees",
  "published": "Tue, 17 Dec 2024 18:56:49 +0000",
  "source": "https://www.macstories.net/feed",
  "categories": [
    "news",
    "app store",
    "Delta",
    "regulation"
  ],
  "byline": "John Voorhees",
  "length": 4613,
  "excerpt": "Delta, the MacStories Selects App of the Year, received an important update today that allows users of the game emulator to support its development via Patreon from inside the app. Existing patrons can connect their Patreon accounts from Delta’s settings, too, allowing them to access perks like alternative app icons and experimental features. This is",
  "siteName": "",
  "favicon": "https://www.macstories.net/app/themes/macstories4/images/apple-touch-icon-152x152-precomposed.png",
  "text": "Delta, the MacStories Selects App of the Year, received an important update today that allows users of the game emulator to support its development via Patreon from inside the app. Existing patrons can connect their Patreon accounts from Delta’s settings, too, allowing them to access perks like alternative app icons and experimental features. This is a big deal that goes beyond the new features for Delta supporters. According to the app’s developer, Riley Testut, Delta is the first app he’s aware of in the U.S. App Store to include an in-app link that allows users to make purchases outside the App Store using Apple’s External Purchase Link Entitlement that was introduced in January. I’m not aware of any other app that’s used the External Purchase Link Entitlement in the U.S. either, but even if there is one, Delta is certainly the highest-profile app to do so. The practical effect of today’s Delta update is that it now has a new Patreon section in its settings. Existing supporters can select ‘Connect Patreon Account…,’ which takes you through a Patreon sign-in flow. Once you’re signed in, patron-only features are unlocked, and the Patreon settings section transforms into a button to unlink your account if you need to. For Delta users who aren’t already patrons, there’s a link labeled ‘Buy for $3 at altstore.io/patreon.’ After tapping through a full-screen warning from Apple that you’re about to embark on a dangerous adventure to the World Wide Web, you’ll see Delta’s three membership tiers, which cost $3, $5, and $10 per month and offer different benefits at each tier. To get the link outside the App Store approved, the Delta team also had to offer In-App Purchase versions of their subscriptions, which they priced at $10, $15, and $30 per month to encourage people to use Patreon. In addition to supporting Delta’s continued development, becoming a Patreon subscriber includes perks like alternative app icons by Louie Mantia, Sebastiaan de With, Ben McCarthy, and Sean Fletcher, which are all wonderful. Patrons also have access to a new Nintendo DS online multiplayer feature and other experimental features contributed by third parties to Delta’s open-source project. For all users, today’s update adds dark versions of the app’s primary icons and a Resume button for quickly jumping back into a paused game, too. As someone who already supports Delta, I find the convenience of being able to sign in from the app’s settings and access patron features fantastic. However, I’m even more pleased to see that new users can sign up to become patrons from inside Delta now. It’s been quite a year for Delta. As Federico aptly put it in our Selects story last week: In the 15 years I’ve been covering indie apps on MacStories, I don’t recall a single example of an app that had the same political, economic, and cultural impact that Delta did in 2024. Delta is a symbol of perseverance in the face of hostility from Apple’s older App Store guidelines, an example of the fact that competition in app marketplaces is the rising tide that lifts all boats, and, ultimately, just a really good app that lets people have fun and rediscover their most precious gaming memories in order to relive them today. That perseverance continues to pay off. With a single link in its settings, Delta continues to lead the way – this time, for developers who want to offer customers options outside the App Store. Delta is available to download for free from the App Store (it will never stop feeling good to finally write that) with alternative icons and experimental features offered as part of a Patreon subscription or In-App Purchase that’s accessible from the app’s settings. Access Extra Content and PerksFounded in 2015, Club MacStories has delivered exclusive content every week for nearly a decade. What started with weekly and monthly email newsletters has blossomed into a family of memberships designed every MacStories fan. Learn more here and from our Club FAQs. Club MacStories: Weekly and monthly newsletters via email and the web that are brimming with apps, tips, automation workflows, longform writing, early access to the MacStories Unwind podcast, periodic giveaways, and more; Club MacStories+: Everything that Club MacStories offers, plus an active Discord community, advanced search and custom RSS features for exploring the Club’s entire back catalog, bonus columns, and dozens of app discounts; Club Premier: All of the above and AppStories+, an extended version of our flagship podcast that’s delivered early, ad-free, and in high-bitrate audio.",
  "image": "https://cdn.macstories.net/tuesday-17-dec-2024-07-14-39-1734437689855.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \n\u003cp id=\"p2\"\u003e\u003ca href=\"https://apps.apple.com/us/app/delta-game-emulator/id1048524688\" rel=\"noopener noreferrer\"\u003eDelta\u003c/a\u003e, the \u003ca href=\"https://www.macstories.net/stories/macstories-selects-2024-recognizing-the-best-apps-of-the-year/#app-of-the-year\" rel=\"noopener noreferrer\"\u003eMacStories Selects App of the Year\u003c/a\u003e, received an important update today that allows users of the game emulator to support its development via Patreon from inside the app. Existing patrons can connect their Patreon accounts from Delta’s settings, too, allowing them to access perks like alternative app icons and experimental features.\u003c/p\u003e\n\u003cp id=\"p3\"\u003eThis is a big deal that goes beyond the new features for Delta supporters. According to the app’s developer, Riley Testut, Delta is the first app he’s aware of in the U.S. App Store to include an in-app link that allows users to make purchases outside the App Store using Apple’s \u003ca href=\"https://developer.apple.com/support/storekit-external-entitlement-us/\" rel=\"noopener noreferrer\"\u003eExternal Purchase Link Entitlement\u003c/a\u003e that was \u003ca href=\"https://developer.apple.com/news/?id=plt8qzea\" rel=\"noopener noreferrer\"\u003eintroduced in January\u003c/a\u003e. I’m not aware of any other app that’s used the External Purchase Link Entitlement in the U.S. either, but even if there is one, Delta is certainly the highest-profile app to do so.\u003c/p\u003e\n\n\u003cp id=\"p5\"\u003eThe practical effect of today’s Delta update is that it now has a new Patreon section in its settings. Existing supporters can select ‘Connect Patreon Account…,’ which takes you through a Patreon sign-in flow. Once you’re signed in, patron-only features are unlocked, and the Patreon settings section transforms into a button to unlink your account if you need to.\u003c/p\u003e\n\u003cp id=\"p6\"\u003eFor Delta users who aren’t already patrons, there’s a link labeled ‘Buy for $3 at altstore.io/patreon.’ After tapping through a full-screen warning from Apple that you’re about to embark on a dangerous adventure to the World Wide Web, you’ll see Delta’s three membership tiers, which cost $3, $5, and $10 per month and offer different benefits at each tier. To get the link outside the App Store approved, the Delta team also had to offer In-App Purchase versions of their subscriptions, which they priced at $10, $15, and $30 per month to encourage people to use Patreon.\u003c/p\u003e\n\n\u003cp id=\"p8\"\u003eIn addition to supporting Delta’s continued development, becoming a Patreon subscriber includes perks like alternative app icons by Louie Mantia, Sebastiaan de With, Ben McCarthy, and Sean Fletcher, which are all wonderful. Patrons also have access to a new Nintendo DS online multiplayer feature and other experimental features contributed by third parties to Delta’s open-source project. For all users, today’s update adds dark versions of the app’s primary icons and a Resume button for quickly jumping back into a paused game, too.\u003c/p\u003e\n\u003cp id=\"p9\"\u003eAs someone who already supports Delta, I find the convenience of being able to sign in from the app’s settings and access patron features fantastic. However, I’m even more pleased to see that new users can sign up to become patrons from inside Delta now.\u003c/p\u003e\n\u003cp id=\"p10\"\u003eIt’s been quite a year for Delta. As Federico aptly put it in \u003ca href=\"https://www.macstories.net/stories/macstories-selects-2024-recognizing-the-best-apps-of-the-year/#app-of-the-year\" rel=\"noopener noreferrer\"\u003eour Selects story last week\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote id=\"blockquote11\"\u003e\u003cp\u003e\n  In the 15 years I’ve been covering indie apps on MacStories, I don’t recall a single example of an app that had the same political, economic, and cultural impact that Delta did in 2024. Delta is a symbol of perseverance in the face of hostility from Apple’s older App Store guidelines, an example of the fact that competition in app marketplaces is the rising tide that lifts all boats, and, ultimately, just a \u003cem\u003ereally good app\u003c/em\u003e that lets people have fun and rediscover their most precious gaming memories in order to relive them today.\n\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp id=\"p12\"\u003eThat perseverance continues to pay off. With a single link in its settings, Delta continues to lead the way – this time, for developers who want to offer customers options outside the App Store.\u003c/p\u003e\n\u003cp id=\"p13\"\u003eDelta \u003ca href=\"https://apps.apple.com/us/app/delta-game-emulator/id1048524688\" rel=\"noopener noreferrer\"\u003eis available to download for free from the App Store\u003c/a\u003e (it will never stop feeling good to finally write that) with alternative icons and experimental features offered as part of a Patreon subscription or In-App Purchase that’s accessible from the app’s settings.\u003c/p\u003e\n            \u003c/div\u003e\u003cdiv\u003e\n            \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://www.macstories.net/app/themes/macstories4/images/logo-shape-gold.svg\" alt=\"Club MacStories\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003eAccess Extra Content and Perks\u003c/h3\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003eFounded in 2015, \u003ca href=\"https://club.macstories.net/plans?utm_source=ms\u0026amp;utm_medium=web-inline\" rel=\"noopener noreferrer\"\u003eClub MacStories\u003c/a\u003e has delivered exclusive content every week for nearly a decade.\u003c/p\u003e\n\u003cp\u003eWhat started with weekly and monthly email newsletters has blossomed into \u003ca href=\"https://club.macstories.net/plans?utm_source=ms\u0026amp;utm_medium=web-inline\" rel=\"noopener noreferrer\"\u003ea family of memberships\u003c/a\u003e designed every MacStories fan.\u003c/p\u003e\n\u003cp\u003eLearn more \u003ca href=\"https://club.macstories.net/plans?utm_source=ms\u0026amp;utm_medium=web-inline\" rel=\"noopener noreferrer\"\u003ehere\u003c/a\u003e and from our \u003ca href=\"https://club.macstories.net/faq\" rel=\"noopener noreferrer\"\u003eClub FAQs\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://club.macstories.net/plans/club\" rel=\"noopener noreferrer\"\u003eClub MacStories\u003c/a\u003e\u003c/strong\u003e: Weekly and monthly newsletters via email and the web that are brimming with apps, tips, automation workflows, longform writing, early access to the \u003ca href=\"https://www.macstories.net/unwind/\" rel=\"noopener noreferrer\"\u003eMacStories Unwind podcast\u003c/a\u003e, periodic giveaways, and more;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://club.macstories.net/plans/plus\" rel=\"noopener noreferrer\"\u003eClub MacStories+\u003c/a\u003e\u003c/strong\u003e: Everything that Club MacStories offers, plus an active Discord community, advanced search and custom RSS features for exploring the Club’s entire back catalog, bonus columns, and dozens of app discounts;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://club.macstories.net/plans/premier\" rel=\"noopener noreferrer\"\u003eClub Premier\u003c/a\u003e\u003c/strong\u003e: All of the above \u003cem\u003eand\u003c/em\u003e AppStories+, an extended version of our flagship podcast that’s delivered early, ad-free, and in high-bitrate audio.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-17T18:56:49-05:00",
  "modifiedTime": null
}
