{
  "id": "63f25bbf-e668-4ec4-8a41-208dc245f768",
  "title": "Why your external drive isn’t showing up on Mac and how to get a Mac to recognise it",
  "link": "https://www.macworld.com/article/671697/how-to-find-an-external-drive-thats-not-showing-up-on-a-mac.html",
  "description": "Macworld Normally when you plug in an external hard drive to your Mac’s USB port you will see it appear on the desktop. You can also see it in a Finder window in the left column under Locations (or Devices in older versions of macOS). If the drive is not showing up on your Mac chances are it has not been formatted correctly, has been corrupted, or is faulty. Alternatively, you may have set a password for the drive that you need to enter before it will connect. We show you how to work out whether the reason the external drive is not mounting on your Mac up is due to a problem with the drive itself, the cable or the port, and how to resolve the problem and access data on your drive. PROMOTIONEaseUS | Check and manage hard drives on Mac Why the hard drive is not showing up on your Mac? How to get it fixed quickly? No worries. EaseUS Partition Master for Mac comes in. To check and find hard drives both internal and external, it scans the devices, gives a clear overview, and diagnoses what happens to your disks. In addition to providing a clear result, it also prompts and guides you to take the next step, quickly solving your disk problem, like disk formatting, creating a boot disk, and converting the disk to be initialized. Now 25% OFF by using code: MACWORLD25. Free Trial Buy and Save 25% This article assumes you have an external drive that should connect to your Mac via the USB-A, USB-C, or a Thunderbolt port. If you have a NAS drive that connects over the network then you should read our article about connecting to a NAS drive. Why is your hard drive not showing up on Mac? We’ll start by trying to identify the reason why your hard drive isn’t showing up on the Mac before explaining what you need to do to find the hard drive on your Mac. If you can identify the cause your should be able to fix the problem that is stopping your external drive from opening on your Mac. Damaged cable, port or insufficient power The first port of call is always to check that it’s plugged in, but we are sure you have done that. The problem might be with the cable. One of the main reasons why drives fail to mount is if the drive isn’t receiving enough power. If the drive is powered via a USB-A cable you need to check that adequate power is being delivered to the drive. Very old Macs may require a USB power cable, a cable that splits into two USB connectors that need to both be plugged into your Mac, in order to deliver enough power to the drive. Similarly, make sure that the drive doesn’t have an external power supply it should be using. On the subject of cables, make sure that it’s not at fault. Try using a different cable with the drive to see if that fixes the problem. Similarly, if you are using a USB port on a hub check that’s not what’s causing the problem. Also check that the port on your Mac isn’t the problem. Try using a different port. Or if you only have one port, plug another device in and see if that works. The next step is to try plugging the drive into another Mac. If it also fails to mount there you will know that there is a problem with the drive while if it does mount then the problem is with your Mac. Problem preferences Hopefully, there is a really easy fix to get the hard drive to mount on your desktop. Try the following to make sure your Mac is set to show mounted drives on the desktop.  Open the Finder. Click on Finder in the menu at the top of your screen.  Click on Settings (Preferences in older macOS versions). Click on General. Make sure that there is a tick beside External disks.  If it was already set up so that the external drive would appear on the desktop then continue to follow the steps below. Password protections You can protect a drive with a password when you initially start using it, so check to see if the reason your drive isn’t mounting is that a password request box has popped up and you didn’t notice it. Sometimes the password popup takes a few minutes to appear as well, so it helps to be patient. Foundry The drive is formatted for a PC It is possible that the drive has been formatted using a file system that your Mac cannot read. Windows PCs use NTFS or ExFAT file formats. Mac computers before Sierra used the HFS+ file format. In High Sierra, Apple introduced a new file system called Apple File System (APFS). There is an old FAT32 format can be read by Window and Mac computers, but has limitation on what files can be stored. An easy way to find out if this is the problem would be to check on a PC. If the drive mounts on the PC it’s likely that you have discovered what the problem is: the drive is formatted for PCs and can’t be read by your Mac. To make sure your drive can be read by Macs and PCs you need to format it using exFAT or the older FAT32. We’ll explain how to do that below. It’s a corrupted or faulty drive If none of the above were the reason why you couldn’t see the external drive on your Mac, perhaps the drive is faulty. If it is, you can use Apple’s Disk Utility program to access the disk and potentially fix whatever is causing the issue. We’ll discuss how to do that below. We’ll also look at ways you can stop a drive failing in the future. How fix an external drive that won’t show up on a Mac If none of the above solved your problem, it is likely the drive is either formatted incorrectly or damaged. Depending on the reason why you can’t see the drive, here is what you need to do to get it working. How to reformat a drive so you can see it on a Mac Hopefully, the drive is fine, but the format is wrong. It is possible that the hard drive has been formatted using a different file system (i.e. on a Windows PC). In that case, if you need to access the data on the drive you’ll need to connect the drive to a Windows PC that does recognize it and copy the data before moving on to the next step because the process will involve reformatting the drive and deleting everything on i). To make sure your drive can be read by Macs and PCs you need to format it using exFAT or the older FAT32. If you want to format the drive to just be used on a Mac you can use the HFS+ or Apple File System (APFS) file formats. Having got the data of the drive via a PC you can reformat the drive so that you can add the data again. Here’s how to reformat your drive so it can be read by a Mac or a PC. Open Disk Utility (as per the steps above). If you don’t require the data on the hard drive, select the disk and click Erase. Before Disk Utility starts to erase the disk it will pick a format for you. You can change this if you click on the Formatting options. Choose your format, ExFAT if you want to make sure it’s compatible with PC and Mac, otherwise, Mac OS Extended (Journaled) is probably the best option.  Click on Erase and wait for your Mac to erase and then reformat the drive. Give the drive a name.  Screenshot Foundry Read more: How to format a drive on a Mac. How to fix the faulty drive with Disk Utility If the various checks above suggest that the disk is faulty then you can use Apple’s Disk Utility program to access the disk and potentially fix whatever is causing the issue. Here’s what to do: Find Disk Utility by opening Spotlight (cmd+Space-bar) and start typing Disk Utility, press enter to open the program. Look in the column on the left to see if the hard drive appears there. If you can see the hard drive in Disk Utility check underneath it for a volume. If it is there click on it and select Mount. If your Mac has already mounted the drive the option Unmount will be displayed instead. (If there is no volume listed your Mac is not able to access the drive. The Mount option will be greyed out.) Your options are First Aid, Erase, and Restore. First Aid will check the disk for errors and then repair the disk if necessary and this is the option to choose. Restore allows you to erase the contents of the drive and replace that with data from somewhere else. Erase deletes all the data stored on the drive. If you need the data on the drive do not choose Erase or Restore! Click the First Aid tab and select Run.  If after running First Aid the Mac finds errors you could fix you may see the option to Repair Disk. If you do, go ahead and run the repairs. Best apps to recover data on a lost drive If your Mac is unable to repair the disk if is likely that the drive is either formatted using a file system that the Mac cannot read, or it is well and truly broken. If it’s the latter we suggest you follow this tutorial about recovering data from a damaged disk. You may also want to consider one of the data recovery apps for Mac we recommend in our round-up of the Best data recovery apps for Macs. Our recommendations include Recoverit from Wondershare, Data Rescue from Prosoft and Stella Data Recovery for Mac. 1. Wondershare Recoverit Price When Reviewed: 1 month/2 Macs: $79.99 (usually $109.99); 1 year/2 Macs: $89.99 (usually $139.99); perpetual license/2 Macs: $139.99 (usually $169.99) Best Prices Today: Retailer Price Wondershare (annual) $89.99 View Deal Price comparison from over 24,000 stores worldwide Product Price Price comparison from Backmarket $89.99 at Wondershare (annual) Read our full Wondershare Recoverit review 2. Data Rescue Price When Reviewed: Standard license: $79 for a 30-day; Professional license: $399 for one year Best Prices Today: Retailer Price Prosoft Engineering (30-day license) $79 View Deal Price comparison from over 24,000 stores worldwide Product Price Price comparison from Backmarket $79 at Prosoft Engineering (30-day license) Read our full Data Rescue review 3. Stellar Data Recovery for Mac Price When Reviewed: Standard edition: $79.99 (currently $69.99) a year, or $129.99 (currently $99.99) for a lifetime license. Professional version: $129.99 (currently $99.99) a year, or $199 (currently $149) for a lifetime license. Premium edition: $209.99 (currently $99.99) a year, or $319 (currently $199) for a lifetime license. Best Prices Today: Retailer Price Stellar Info (annual) $79.99 View Deal Price comparison from over 24,000 stores worldwide Product Price Price comparison from Backmarket $79.99 at Stellar Info (annual) Read our full Stellar Data Recovery for Mac review How to prevent issues with hard drives on a Mac We have final suggestion to make that is more of a guard against this error happening again. Make sure that your external drive doesn’t become damaged in the future by always unmounting the disk properly after using it. Don’t just unplug the USB cable. To unmount your drive you can right-click (control-click) on the icon on the Desktop or in the Finder and choose Eject. Drive issues can occur when the disk is removed without ejecting it properly. Decided there is no hope for your faulty hard drive? We have a round-up of some of the best we’ve seen here: The best Mac hard drives.",
  "author": "",
  "published": "Sun, 26 Jan 2025 08:25:00 +0000",
  "source": "https://www.macworld.com/index.rss",
  "categories": [
    "Cleaning and Data Recovery Software, Mac, Storage"
  ],
  "byline": "Author: Karen Haslam, Managing Editor, Macworld",
  "length": 11149,
  "excerpt": "Here's what to do when you can't access an external drive on your Mac because the USB drive isn't showing up. Plus how to format a drive for Mac and PC.",
  "siteName": "Macworld",
  "favicon": "https://www.macworld.com/wp-content/uploads/2021/03/cropped-macworld-favicon.png?w=192",
  "text": "Normally when you plug in an external hard drive to your Mac’s USB port you will see it appear on the desktop. You can also see it in a Finder window in the left column under Locations (or Devices in older versions of macOS). If the drive is not showing up on your Mac chances are it has not been formatted correctly, has been corrupted, or is faulty. Alternatively, you may have set a password for the drive that you need to enter before it will connect. We show you how to work out whether the reason the external drive is not mounting on your Mac up is due to a problem with the drive itself, the cable or the port, and how to resolve the problem and access data on your drive. PROMOTIONEaseUS | Check and manage hard drives on MacWhy the hard drive is not showing up on your Mac? How to get it fixed quickly? No worries. EaseUS Partition Master for Mac comes in. To check and find hard drives both internal and external, it scans the devices, gives a clear overview, and diagnoses what happens to your disks. In addition to providing a clear result, it also prompts and guides you to take the next step, quickly solving your disk problem, like disk formatting, creating a boot disk, and converting the disk to be initialized. Now 25% OFF by using code: MACWORLD25. Free Trial This article assumes you have an external drive that should connect to your Mac via the USB-A, USB-C, or a Thunderbolt port. If you have a NAS drive that connects over the network then you should read our article about connecting to a NAS drive. Why is your hard drive not showing up on Mac? We’ll start by trying to identify the reason why your hard drive isn’t showing up on the Mac before explaining what you need to do to find the hard drive on your Mac. If you can identify the cause your should be able to fix the problem that is stopping your external drive from opening on your Mac. Damaged cable, port or insufficient power The first port of call is always to check that it’s plugged in, but we are sure you have done that. The problem might be with the cable. One of the main reasons why drives fail to mount is if the drive isn’t receiving enough power. If the drive is powered via a USB-A cable you need to check that adequate power is being delivered to the drive. Very old Macs may require a USB power cable, a cable that splits into two USB connectors that need to both be plugged into your Mac, in order to deliver enough power to the drive. Similarly, make sure that the drive doesn’t have an external power supply it should be using. On the subject of cables, make sure that it’s not at fault. Try using a different cable with the drive to see if that fixes the problem. Similarly, if you are using a USB port on a hub check that’s not what’s causing the problem. Also check that the port on your Mac isn’t the problem. Try using a different port. Or if you only have one port, plug another device in and see if that works. The next step is to try plugging the drive into another Mac. If it also fails to mount there you will know that there is a problem with the drive while if it does mount then the problem is with your Mac. Problem preferences Hopefully, there is a really easy fix to get the hard drive to mount on your desktop. Try the following to make sure your Mac is set to show mounted drives on the desktop.  Open the Finder. Click on Finder in the menu at the top of your screen.  Click on Settings (Preferences in older macOS versions). Click on General. Make sure that there is a tick beside External disks.  If it was already set up so that the external drive would appear on the desktop then continue to follow the steps below. Password protections You can protect a drive with a password when you initially start using it, so check to see if the reason your drive isn’t mounting is that a password request box has popped up and you didn’t notice it. Sometimes the password popup takes a few minutes to appear as well, so it helps to be patient. Foundry The drive is formatted for a PC It is possible that the drive has been formatted using a file system that your Mac cannot read. Windows PCs use NTFS or ExFAT file formats. Mac computers before Sierra used the HFS+ file format. In High Sierra, Apple introduced a new file system called Apple File System (APFS). There is an old FAT32 format can be read by Window and Mac computers, but has limitation on what files can be stored. An easy way to find out if this is the problem would be to check on a PC. If the drive mounts on the PC it’s likely that you have discovered what the problem is: the drive is formatted for PCs and can’t be read by your Mac. To make sure your drive can be read by Macs and PCs you need to format it using exFAT or the older FAT32. We’ll explain how to do that below. It’s a corrupted or faulty drive If none of the above were the reason why you couldn’t see the external drive on your Mac, perhaps the drive is faulty. If it is, you can use Apple’s Disk Utility program to access the disk and potentially fix whatever is causing the issue. We’ll discuss how to do that below. We’ll also look at ways you can stop a drive failing in the future. How fix an external drive that won’t show up on a Mac If none of the above solved your problem, it is likely the drive is either formatted incorrectly or damaged. Depending on the reason why you can’t see the drive, here is what you need to do to get it working. How to reformat a drive so you can see it on a Mac Hopefully, the drive is fine, but the format is wrong. It is possible that the hard drive has been formatted using a different file system (i.e. on a Windows PC). In that case, if you need to access the data on the drive you’ll need to connect the drive to a Windows PC that does recognize it and copy the data before moving on to the next step because the process will involve reformatting the drive and deleting everything on i). To make sure your drive can be read by Macs and PCs you need to format it using exFAT or the older FAT32. If you want to format the drive to just be used on a Mac you can use the HFS+ or Apple File System (APFS) file formats. Having got the data of the drive via a PC you can reformat the drive so that you can add the data again. Here’s how to reformat your drive so it can be read by a Mac or a PC. Open Disk Utility (as per the steps above). If you don’t require the data on the hard drive, select the disk and click Erase. Before Disk Utility starts to erase the disk it will pick a format for you. You can change this if you click on the Formatting options. Choose your format, ExFAT if you want to make sure it’s compatible with PC and Mac, otherwise, Mac OS Extended (Journaled) is probably the best option.  Click on Erase and wait for your Mac to erase and then reformat the drive. Give the drive a name.  Screenshot Foundry Read more: How to format a drive on a Mac. How to fix the faulty drive with Disk Utility If the various checks above suggest that the disk is faulty then you can use Apple’s Disk Utility program to access the disk and potentially fix whatever is causing the issue. Here’s what to do: Find Disk Utility by opening Spotlight (cmd+Space-bar) and start typing Disk Utility, press enter to open the program. Look in the column on the left to see if the hard drive appears there. If you can see the hard drive in Disk Utility check underneath it for a volume. If it is there click on it and select Mount. If your Mac has already mounted the drive the option Unmount will be displayed instead. (If there is no volume listed your Mac is not able to access the drive. The Mount option will be greyed out.) Your options are First Aid, Erase, and Restore. First Aid will check the disk for errors and then repair the disk if necessary and this is the option to choose. Restore allows you to erase the contents of the drive and replace that with data from somewhere else. Erase deletes all the data stored on the drive. If you need the data on the drive do not choose Erase or Restore! Click the First Aid tab and select Run.  If after running First Aid the Mac finds errors you could fix you may see the option to Repair Disk. If you do, go ahead and run the repairs. Best apps to recover data on a lost drive If your Mac is unable to repair the disk if is likely that the drive is either formatted using a file system that the Mac cannot read, or it is well and truly broken. If it’s the latter we suggest you follow this tutorial about recovering data from a damaged disk. You may also want to consider one of the data recovery apps for Mac we recommend in our round-up of the Best data recovery apps for Macs. Our recommendations include Recoverit from Wondershare, Data Rescue from Prosoft and Stella Data Recovery for Mac. Price When Reviewed: 1 month/2 Macs: $79.99 (usually $109.99); 1 year/2 Macs: $89.99 (usually $139.99); perpetual license/2 Macs: $139.99 (usually $169.99) Read our full Wondershare Recoverit review 2. Data Rescue Price When Reviewed: Standard license: $79 for a 30-day; Professional license: $399 for one year Read our full Data Rescue review 3. Stellar Data Recovery for Mac Price When Reviewed: Standard edition: $79.99 (currently $69.99) a year, or $129.99 (currently $99.99) for a lifetime license. Professional version: $129.99 (currently $99.99) a year, or $199 (currently $149) for a lifetime license. Premium edition: $209.99 (currently $99.99) a year, or $319 (currently $199) for a lifetime license. Read our full Stellar Data Recovery for Mac review How to prevent issues with hard drives on a Mac We have final suggestion to make that is more of a guard against this error happening again. Make sure that your external drive doesn’t become damaged in the future by always unmounting the disk properly after using it. Don’t just unplug the USB cable. To unmount your drive you can right-click (control-click) on the icon on the Desktop or in the Finder and choose Eject. Drive issues can occur when the disk is removed without ejecting it properly. Decided there is no hope for your faulty hard drive? We have a round-up of some of the best we’ve seen here: The best Mac hard drives.",
  "image": "https://www.macworld.com/wp-content/uploads/2025/01/macos-14-mac-macbook.png?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"link_wrapped_content\"\u003e\n\n\n\n\n\u003cp\u003eNormally when you plug in an external hard drive to your Mac’s USB port you will see it appear on the desktop. You can also see it in a Finder window in the left column under Locations (or Devices in older versions of macOS). If the drive is not showing up on your Mac chances are it has not been formatted correctly, has been corrupted, or is faulty. Alternatively, you may have set a password for the drive that you need to enter before it will connect.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe show you how to work out whether the reason the external drive is not mounting on your Mac up is due to a problem with the drive itself, the cable or the port, and how to resolve the problem and access data on your drive.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003ePROMOTION\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEaseUS | Check and manage hard drives on Mac\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/11/easeus-partition-master_a5f066.png\" loading=\"lazy\"/\u003e\u003c/p\u003e\u003cp\u003eWhy the hard drive is not showing up on your Mac? How to get it fixed quickly? No worries. EaseUS Partition Master for Mac comes in. To check and find hard drives both internal and external, it scans the devices, gives a clear overview, and diagnoses what happens to your disks. In addition to providing a clear result, it also prompts and guides you to take the next step, quickly solving your disk problem, like disk formatting, creating a boot disk, and converting the disk to be initialized. Now 25% OFF by using code: MACWORLD25.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://down.easeus.com/product/mac_epm?cjdata=idg-foundry\u0026amp;utm_id=6164489\u0026amp;utm_source=commission-junction\u0026amp;utm_medium=IDG+Communications\u0026amp;utm_campaign=100470607\u0026amp;ref=aff_cj\"\u003eFree Trial\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003eThis article assumes you have an external drive that should connect to your Mac via the USB-A, USB-C, or a Thunderbolt port. If you have a NAS drive that connects over the network then you should read our article about \u003ca title=\"Connecting to a NAS drive\" href=\"https://www.macworld.com/article/671869/how-to-set-up-a-nas-drive.html\"\u003econnecting to a NAS drive\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"why-is-your-hard-drive-not-showing-up-on-mac\"\u003eWhy is your hard drive not showing up on Mac? \u003c/h2\u003e\n\n\n\n\u003cp\u003eWe’ll start by trying to identify the reason why your hard drive isn’t showing up on the Mac before explaining what you need to do to find the hard drive on your Mac. If you can identify the cause your should be able to fix the problem that is stopping your external drive from opening on your Mac.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"damaged-cable-port-or-insufficient-power\"\u003eDamaged cable, port or insufficient power\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe first port of call is always to check that it’s plugged in, but we are sure you have done that. The problem might be with the cable.\u003c/p\u003e\n\n\n\n\u003cp\u003eOne of the main reasons why drives fail to mount is if the drive isn’t receiving enough power. If the drive is powered via a USB-A cable you need to check that adequate power is being delivered to the drive. Very old Macs may require a USB power cable, a cable that splits into two USB connectors that need to both be plugged into your Mac, in order to deliver enough power to the drive. Similarly, make sure that the drive doesn’t have an external power supply it should be using.\u003c/p\u003e\n\n\n\u003cdiv\u003e\u003cfigure\u003e\u003cimg decoding=\"async\" src=\"https://images.macworld.co.uk/cmsdata/features/3613422/missing_hard_drive_y_power_cable.jpg\" alt=\"\" loading=\"lazy\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003eOn the subject of cables, make sure that it’s not at fault. Try using a different cable with the drive to see if that fixes the problem. Similarly, if you are using a USB port on a hub check that’s not what’s causing the problem.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlso check that the port on your Mac isn’t the problem. Try using a different port. Or if you only have one port, plug another device in and see if that works.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe next step is to try plugging the drive into another Mac. If it also fails to mount there you will know that there is a problem with the drive while if it does mount then the problem is with your Mac.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"problem-preferences\"\u003eProblem preferences\u003c/h3\u003e\n\n\n\n\u003cp\u003eHopefully, there is a really easy fix to get the hard drive to mount on your desktop. Try the following to make sure your Mac is set to show mounted drives on the desktop. \u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eOpen the Finder.\u003c/li\u003e\n\n\n\n\u003cli\u003eClick on \u003cem\u003eFinder\u003c/em\u003e in the menu at the top of your screen. \u003c/li\u003e\n\n\n\n\u003cli\u003eClick on \u003cem\u003eSettings\u003c/em\u003e (Preferences in older macOS versions).\u003c/li\u003e\n\n\n\n\u003cli\u003eClick on \u003cem\u003eGeneral\u003c/em\u003e.\u003c/li\u003e\n\n\n\n\u003cli\u003eMake sure that there is a tick beside \u003cem\u003eExternal disks\u003c/em\u003e. \u003cimg decoding=\"async\" width=\"489\" height=\"441\" data-original-width=\"489\" data-original-height=\"441\" src=\"https://images.macworld.co.uk/cmsdata/features/3613422/finder_mount_drive_thumb.jpg\" alt=\"finder mount drive\" loading=\"lazy\"/\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eIf it was already set up so that the external drive would appear on the desktop then continue to follow the steps below.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"password-protections\"\u003ePassword protections\u003c/h3\u003e\n\n\n\n\u003cp\u003eYou can protect a drive with a password when you initially start using it, so check to see if the reason your drive isn’t mounting is that a password request box has popped up and you didn’t notice it.\u003c/p\u003e\n\n\n\n\u003cp\u003eSometimes the password popup takes a few minutes to appear as well, so it helps to be patient. \u003c/p\u003e\n\n\n\u003cdiv\u003e\u003cfigure\u003e\u003cimg decoding=\"async\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/03/Password-for-external-drive.jpg?quality=50\u0026amp;strip=all\" alt=\"Backup drive password\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/03/Password-for-external-drive.jpg?quality=50\u0026amp;strip=all 914w, https://b2c-contenthub.com/wp-content/uploads/2024/03/Password-for-external-drive.jpg?resize=300%2C152\u0026amp;quality=50\u0026amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/03/Password-for-external-drive.jpg?resize=768%2C390\u0026amp;quality=50\u0026amp;strip=all 768w\" width=\"914\" height=\"464\" sizes=\"(max-width: 914px) 100vw, 914px\" loading=\"lazy\"/\u003e\u003c/figure\u003e\u003cp\u003eFoundry\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003ch3 id=\"the-drive-is-formatted-for-a-pc\"\u003eThe drive is formatted for a PC\u003c/h3\u003e\n\n\n\n\u003cp\u003eIt is possible that the drive has been formatted using a file system that your Mac cannot read. \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eWindows PCs use NTFS or ExFAT file formats. \u003c/li\u003e\n\n\n\n\u003cli\u003eMac computers before Sierra used the HFS+ file format.\u003c/li\u003e\n\n\n\n\u003cli\u003eIn High Sierra, Apple introduced a new file system called Apple File System (APFS). \u003c/li\u003e\n\n\n\n\u003cli\u003eThere is an old FAT32 format can be read by Window and Mac computers, but has limitation on what files can be stored.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eAn easy way to find out if this is the problem would be to check on a PC. If the drive mounts on the PC it’s likely that you have discovered what the problem is: the drive is formatted for PCs and can’t be read by your Mac. \u003cimg decoding=\"async\" width=\"800\" height=\"400\" src=\"https://images.macworld.co.uk/cmsdata/features/3613422/not_readable.png\" alt=\"\" loading=\"lazy\"/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eTo make sure your drive can be read by Macs and PCs you need to format it using exFAT or the older FAT32. We’ll explain how to do that below.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"its-a-corrupted-or-faulty-drive\"\u003eIt’s a corrupted or faulty drive\u003c/h3\u003e\n\n\n\n\u003cp\u003eIf none of the above were the reason why you couldn’t see the external drive on your Mac, perhaps the drive is faulty. If it is, you can use Apple’s Disk Utility program to access the disk and potentially fix whatever is causing the issue. We’ll discuss how to do that below. We’ll also look at ways you can stop a drive failing in the future. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"how-fix-an-external-drive-that-wont-show-up-on-a-mac\"\u003eHow fix an external drive that won’t show up on a Mac\u003c/h2\u003e\n\n\n\n\u003cp\u003eIf none of the above solved your problem, it is likely the drive is either formatted incorrectly or damaged. \u003c/p\u003e\n\n\n\n\u003cp\u003eDepending on the reason why you can’t see the drive, here is what you need to do to get it working. \u003c/p\u003e\n\n\n\n\u003ch3 id=\"how-to-reformat-a-drive-so-you-can-see-it-on-a-mac\"\u003eHow to reformat a drive so you can see it on a Mac \u003c/h3\u003e\n\n\n\n\u003cp\u003eHopefully, the drive is fine, but the format is wrong. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt is possible that the hard drive has been formatted using a different file system (i.e. on a Windows PC). In that case, if you need to access the data on the drive you’ll need to connect the drive to a Windows PC that does recognize it and copy the data before moving on to the next step because the process will involve reformatting the drive and deleting everything on i).\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eTo make sure your drive can be read by Macs and PCs you need to format it using \u003cstrong\u003eexFAT\u003c/strong\u003e or the older \u003cstrong\u003eFAT32\u003c/strong\u003e. \u003c/li\u003e\n\n\n\n\u003cli\u003eIf you want to format the drive to just be used on a Mac you can use the\u003cstrong\u003e HFS+ \u003c/strong\u003eor \u003cstrong\u003eApple File System (APFS)\u003c/strong\u003e file formats.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eHaving got the data of the drive via a PC you can reformat the drive so that you can add the data again. Here’s how to reformat your drive so it can be read by a Mac or a PC.\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eOpen Disk Utility (as per the steps above).\u003c/li\u003e\n\n\n\n\u003cli\u003eIf you don’t require the data on the hard drive, select the disk and click \u003cem\u003eErase\u003c/em\u003e.\u003c/li\u003e\n\n\n\n\u003cli\u003eBefore Disk Utility starts to erase the disk it will pick a format for you. You can change this if you click on the Formatting options. Choose your format, ExFAT if you want to make sure it’s compatible with PC and Mac, otherwise, Mac OS Extended (Journaled) is probably the best option. \u003c/li\u003e\n\n\n\n\u003cli\u003eClick on \u003cem\u003eErase\u003c/em\u003e and wait for your Mac to erase and then reformat the drive.\u003c/li\u003e\n\n\n\n\u003cli\u003eGive the drive a name. \u003c/li\u003e\n\u003c/ol\u003e\n\n\n\u003cdiv\u003e\u003cfigure\u003e\u003cimg decoding=\"async\" src=\"https://b2c-contenthub.com/wp-content/uploads/2025/01/FORMAT-extrenal-drive-on-mac.jpg?quality=50\u0026amp;strip=all\u0026amp;w=1200\" alt=\"How to format external drive on mac\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2025/01/FORMAT-extrenal-drive-on-mac.jpg?quality=50\u0026amp;strip=all 1216w, https://b2c-contenthub.com/wp-content/uploads/2025/01/FORMAT-extrenal-drive-on-mac.jpg?resize=300%2C144\u0026amp;quality=50\u0026amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2025/01/FORMAT-extrenal-drive-on-mac.jpg?resize=768%2C368\u0026amp;quality=50\u0026amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2025/01/FORMAT-extrenal-drive-on-mac.jpg?resize=1200%2C575\u0026amp;quality=50\u0026amp;strip=all 1200w\" width=\"1200\" height=\"575\" sizes=\"(max-width: 1200px) 100vw, 1200px\" loading=\"lazy\"/\u003e\u003cfigcaption\u003e\u003cp\u003eScreenshot\u003c/p\u003e\n\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eFoundry\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003eRead more: \u003ca href=\"https://www.macworld.com/article/671300/how-to-format-a-drive-on-a-mac.html\"\u003eHow to format a drive on a Mac\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003ch3 id=\"how-to-fix-the-faulty-drive-with-disk-utility\"\u003eHow to fix the faulty drive with Disk Utility \u003c/h3\u003e\n\n\n\n\u003cp\u003eIf the various checks above suggest that the disk is faulty then you can use Apple’s \u003ca title=\"Disk Utility\" href=\"https://www.macworld.com/article/671967/how-to-use-disk-utility-on-a-mac.html\"\u003eDisk Utility\u003c/a\u003e program to access the disk and potentially fix whatever is causing the issue. Here’s what to do:\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eFind Disk Utility by opening Spotlight (cmd+Space-bar) and start typing \u003cem\u003eDisk Utility\u003c/em\u003e, press enter to open the program.\u003c/li\u003e\n\n\n\n\u003cli\u003eLook in the column on the left to see if the hard drive appears there.\u003c/li\u003e\n\n\n\n\u003cli\u003eIf you can see the hard drive in Disk Utility check underneath it for a volume. If it is there click on it and select \u003cem\u003eMount\u003c/em\u003e. If your Mac has already mounted the drive the option Unmount will be displayed instead. (If there is no volume listed your Mac is not able to access the drive. The Mount option will be greyed out.)\u003cimg decoding=\"async\" width=\"1212\" height=\"583\" data-original-width=\"1212\" data-original-height=\"583\" src=\"https://images.macworld.co.uk/cmsdata/features/3613422/disk_utility_thumb.jpg\" alt=\"Disk Utility Mount Hard Drive\" loading=\"lazy\"/\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eYour options are First Aid, Erase, and Restore. First Aid will check the disk for errors and then repair the disk if necessary and this is the option to choose. Restore allows you to erase the contents of the drive and replace that with data from somewhere else. Erase deletes all the data stored on the drive. If you need the data on the drive do not choose Erase or Restore!\u003c/li\u003e\n\n\n\n\u003cli\u003eClick the \u003cem\u003eFirst Aid\u003c/em\u003e tab and select \u003cem\u003eRun\u003c/em\u003e. \u003cimg decoding=\"async\" width=\"1212\" height=\"583\" data-original-width=\"1212\" data-original-height=\"583\" src=\"https://images.macworld.co.uk/cmsdata/features/3613422/first_aid_run_mac_thumb.jpg\" alt=\"Run First Aid Mac\" loading=\"lazy\"/\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eIf after running First Aid the Mac finds errors you could fix you may see the option to Repair Disk. If you do, go ahead and run the repairs.\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003ch2 id=\"best-apps-to-recover-data-on-a-lost-drive\"\u003eBest apps to recover data on a lost drive\u003c/h2\u003e\n\n\n\n\u003cp\u003eIf your Mac is unable to repair the disk if is likely that the drive is either formatted using a file system that the Mac cannot read, or it is well and truly broken. If it’s the latter we suggest you follow this tutorial about \u003ca title=\"How to recover data from a damaged disk\" href=\"https://www.macworld.com/article/671334/how-to-recover-data-from-damaged-mac-or-external-drive.html\"\u003erecovering data from a damaged disk\u003c/a\u003e. You may also want to consider one of the data recovery apps for Mac we recommend in our round-up of the \u003ca title=\"Best data recovery apps for Macs\" href=\"https://www.macworld.com/article/668874/best-data-recovery-apps-for-mac.html\"\u003eBest data recovery apps for Macs\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eOur recommendations include \u003ca href=\"https://www.kqzyfj.com/click-100470607-11552742?sid=1-3-671697-1-0-0-0-0\u0026amp;url=https://recoverit.wondershare.com/data-recovery-mac.html\" rel=\"nofollow\" data-subtag=\"1-3-671697-1-0-0-0-0\" data-domain-name=\"wondershare\" target=\"_blank\"\u003eRecoverit\u003c/a\u003e from Wondershare, \u003ca href=\"https://go.skimresources.com?id=111346X1569486\u0026amp;xs=1\u0026amp;url=https://www.prosofteng.com/mac-data-recovery\u0026amp;xcust=1-3-671697-1-0-0-0-0\u0026amp;sref=https://www.macworld.com/article/671697/how-to-find-an-external-drive-thats-not-showing-up-on-a-mac.html\" rel=\"nofollow\" data-subtag=\"1-3-671697-1-0-0-0-0\" data-domain-name=\"prosofteng\" target=\"_blank\"\u003eData Rescue\u003c/a\u003e from Prosoft and \u003ca href=\"https://www.kqzyfj.com/click-8752386-15285597?sid=1-3-671697-1-0-0-0-0\u0026amp;url=https://www.stellarinfo.com/free-mac-data-recovery.php\" rel=\"nofollow\" data-subtag=\"1-3-671697-1-0-0-0-0\" data-domain-name=\"stellarinfo\" target=\"_blank\"\u003eStella Data Recovery for Mac\u003c/a\u003e.  \u003c/p\u003e\n\n\n\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1366\" height=\"768\" alt=\"Wondershare Recoverit\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/12/Recoverit-Review.jpg?quality=50\u0026amp;strip=all\" loading=\"lazy\" sizes=\"1366\"/\u003e\u003c/figure\u003e\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cspan\u003e\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003cspan\u003e\n\t\t\t\t\t\t\t\t\t1 month/2 Macs: $79.99 (usually $109.99); 1 year/2 Macs: $89.99 (usually $139.99); perpetual license/2 Macs: $139.99 (usually $169.99)\t\t\t\t\t\t\t\t\t\u003c/span\u003e\n\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t\u003ca href=\"https://www.macworld.com/article/2551852/wondershare-recoverit-review-an-excellent-mac-data-recovery-package.html\" score=\"4.5\"\u003e\n\t\t\t\t\t\tWondershare Recoverit review \t\t\t\t\t\u003c/a\u003e\n\t\t\t\t\t\t\t\t\u003c/p\u003e\u003c/div\u003e\n\t\t\t\t\t\t\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\t\u003ch2 data-p_name=\"2.  Data Rescue\" id=\"2-data-rescue\"\u003e\n\t\t\t\t\t\t\t2.  Data Rescue\t\t\t\t\t\t\u003c/h2\u003e\n\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\u003cfigure\u003e\u003cimg decoding=\"async\" alt=\"Data Rescue\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/07/Data-Rescue-Mac-review.jpg?quality=50\u0026amp;strip=all\" loading=\"lazy\"/\u003e\u003c/figure\u003e\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cspan\u003e\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003cspan\u003e\n\t\t\t\t\t\t\t\t\tStandard license: $79 for a 30-day; Professional license: $399 for one year\t\t\t\t\t\t\t\t\t\u003c/span\u003e\n\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t\u003ca href=\"https://www.macworld.com/article/206241/data-rescue-6-review.html\" score=\"4\"\u003e\n\t\t\t\t\t\tData Rescue review \t\t\t\t\t\u003c/a\u003e\n\t\t\t\t\t\t\t\t\u003c/p\u003e\u003c/div\u003e\n\t\t\t\t\t\t\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\t\u003ch2 data-p_name=\"3.  Stellar Data Recovery for Mac\" id=\"3-stellar-data-recovery-for-mac\"\u003e\n\t\t\t\t\t\t\t3.  Stellar Data Recovery for Mac\t\t\t\t\t\t\u003c/h2\u003e\n\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\u003cfigure\u003e\u003cimg decoding=\"async\" alt=\"Stellar Data Recovery for Mac\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/09/Stellar-Data-Recovery-for-Mac-review.jpg?quality=50\u0026amp;strip=all\" loading=\"lazy\"/\u003e\u003c/figure\u003e\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cspan\u003e\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003cspan\u003e\n\t\t\t\t\t\t\t\t\tStandard edition: $79.99 (currently $69.99) a year, or $129.99 (currently $99.99) for a lifetime license. Professional version: $129.99 (currently $99.99) a year, or $199 (currently $149) for a lifetime license. Premium edition: $209.99 (currently $99.99) a year, or $319 (currently $199) for a lifetime license.\t\t\t\t\t\t\t\t\t\u003c/span\u003e\n\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t\u003ca href=\"https://www.macworld.com/article/2445111/stellar-data-recovery-for-mac-review.html\" score=\"4\"\u003e\n\t\t\t\t\t\tStellar Data Recovery for Mac review \t\t\t\t\t\u003c/a\u003e\n\t\t\t\t\t\t\t\t\u003c/p\u003e\u003c/div\u003e\n\t\t\t\t\t\u003c/div\u003e\n\n\t\t\n\n\n\u003ch3 id=\"how-to-prevent-issues-with-hard-drives-on-a-mac\"\u003eHow to prevent issues with hard drives on a Mac\u003c/h3\u003e\n\n\n\n\u003cp\u003eWe have final suggestion to make that is more of a guard against this error happening again.\u003c/p\u003e\n\n\n\n\u003cp\u003eMake sure that your external drive doesn’t become damaged in the future by always unmounting the disk properly after using it. Don’t just unplug the USB cable. \u003c/p\u003e\n\n\n\n\u003cp\u003eTo unmount your drive you can right-click (control-click) on the icon on the Desktop or in the Finder and choose \u003cem\u003eEject\u003c/em\u003e. Drive issues can occur when the disk is removed without ejecting it properly.\u003c/p\u003e\n\n\n\n\u003cp\u003eDecided there is no hope for your faulty hard drive? We have a round-up of some of the best we’ve seen here:  \u003ca title=\"The best Mac hard drive\" href=\"https://www.macworld.com/article/668430/best-external-hard-drive-for-mac.html\"\u003eThe best Mac hard drives\u003c/a\u003e.\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": null,
  "modifiedTime": null
}
