{
  "id": "653a9c39-f3c8-4f72-b5a9-dc77789aee2e",
  "title": "Here’s how Apple Intelligence keeps privacy in mind versus the competition",
  "link": "https://9to5mac.com/2025/07/20/heres-how-apple-intelligence-keeps-privacy-in-mind-versus-the-competition/",
  "description": "Artificial intelligence has obviously been the industry craze for the past couple years. While large language models are incredibly capable, they’ve always come with a bit of a compromise: privacy. Ultimately, you’re still using a model hosted in the cloud, and all of your conversations are stored on some server. Apple’s always had privacy at the core of its products – so in the months leading up to the debut of Apple’s AI features, many people wondered: how would Apple handle it? Today, we delve into exactly how. more…",
  "author": "Michael Burkhardt",
  "published": "Sun, 20 Jul 2025 23:10:43 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Michael Burkhardt",
  "length": 4766,
  "excerpt": "Artificial intelligence has obviously been the industry craze for the past couple years. While large language models are incredibly capable,...",
  "siteName": "9to5Mac",
  "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=192",
  "text": "Artificial intelligence has obviously been the industry craze for the past couple years. While large language models are incredibly capable, they’ve always come with a bit of a compromise: privacy. Ultimately, you’re still using a model hosted in the cloud, and all of your conversations are stored on some server. Apple’s always had privacy at the core of its products – so in the months leading up to the debut of Apple’s AI features, many people wondered: how would Apple handle it? Today, we delve into exactly how. 9to5Mac is brought to you by Incogni: Protect your personal info from prying eyes. With Incogni, you can scrub your deeply sensitive information from data brokers across the web, including people search sites. Incogni limits your phone number, address, email, SSN, and more from circulating. Fight back against unwanted data brokers with a 30-day money back guarantee. On-device models This one is a bit obvious, but Apple Intelligence features are powered by on-device models. That’s why there’s such a strict device requirement. You can only utilize Apple Intelligence if you have an iPhone 15 Pro or iPhone 16 model. On the iPad and Mac side, it’s a bit more lenient, with all M1 devices being supported. Either way, that device requirement isn’t strict for no reason, it’s because running large language models on device requires a lot of power and a lot of memory. To be specific, it requires 8GB of unified memory, which Apple only begun shipping on the iPhone 15 Pro. With on device models, any requests you make don’t leave your phone. Granted, not every Apple Intelligence request will run on-device. Apple also has private cloud compute for heavier requests, which I’ll explain in a bit. That said, for the most part, current Apple Intelligence features lean heavily on the chipset in your device, such as Notification summaries and Genmoji. This keeps your requests and personal information local. Apple’s also expanded the capabilities of on device models this year at WWDC25, allowing developers to implement features using Apple’s on device models, otherwise known as Apple Foundational Models. This’ll potentially deter developers from using providers like OpenAI or Google Gemini for passing your private user data to, though there is the major fact that Apple Intelligence is only available on a small number of devices. Private Cloud Compute As alluded to earlier, Apple also has a cloud solution for handling Apple Intelligence requests. It wasn’t in action a ton during iOS 18, but it’s being utilized a fair bit more with iOS 26. For example, you can now use Siri Shortcuts to send prompts to Apple models, including cloud models. Apple has an incredibly detailed blog post on how Private Cloud Compute keeps your user information private. In short, the system is built to not retain information – and you can verify that. On top of building the system in such a way that user data wouldn’t be accessible by Apple or an attacker, Apple wanted to release the software images for Private Cloud Compute, allowing independent researchers to verify Apple’s claims. You can learn more about Apple’s Private Cloud Compute and how it works in our post here. It’s a rather interesting system, and is certainly industry-leading for server-based AI privacy. ChatGPT Integration Last but not least, Apple has a special deal with OpenAI to ensure that Apple user data isn’t retained by OpenAI, and that Apple user requests aren’t utilized in training data for future models. There’s also the fact that requests are never sent to ChatGPT without the user providing permission. Last month, The New York Times sued OpenAI, and the court demanded that OpenAI needs to retain ChatGPT user data indefinitely. Traditionally, OpenAI deletes this data from its systems within 30 days. Some people have wondered if that impacts Apple users, but rest assured, OpenAI has stated that business customers utilizing Zero Data Retention APIs aren’t impacted, because OpenAI wouldn’t have stored that data at any point. Given this fact, using ChatGPT through Siri is technically the most private way of accessing those models – highlighting Apple’s underlying commitment to user privacy, even in the age of AI. My favorite Apple accessory recommendations: Anker MagSafe 2-in-1 Wireless Charging Stand with Qi2 Aulumu Vegan Leather MagSafe Case for iPhone 16 MOFT Magnetic Wallet Stand, fits up to 3 cards AirTag 4-pack (on sale for 20% off!) SanDisk Extreme 2TB USB-C SSD, up to 1050MB/s AirPods Pro 2 (USB-C) Follow Michael: X/Twitter, Bluesky, Instagram Add 9to5Mac to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/07/apple-intelligence-fi-logo.jpg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"800\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2024/07/apple-intelligence-fi-logo.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"Apple Intelligence logo\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/07/apple-intelligence-fi-logo.jpg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/07/apple-intelligence-fi-logo.jpg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/07/apple-intelligence-fi-logo.jpg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/07/apple-intelligence-fi-logo.jpg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/figure\u003e\n\n\u003cp\u003eArtificial intelligence has obviously been the \u003ca href=\"https://9to5mac.com/2025/04/11/chatgpt-was-the-worlds-most-downloaded-app-last-month/\"\u003eindustry craze\u003c/a\u003e for the past couple years. While large language models are incredibly capable, they’ve always come with a bit of a compromise: privacy. Ultimately, you’re still using a model hosted in the cloud, and all of your conversations are stored on some server. \u003c/p\u003e\n\n\n\n\u003cp\u003eApple’s always had privacy at the core of its products – so in the months leading up to the debut of Apple’s AI features, many people wondered: how would Apple handle it? Today, we delve into exactly how.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bit.ly/4jPfdAS\"\u003e\u003cimg src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/05/750x150_banner_9to5mac_ej-v2.png\" alt=\"\" width=\"750\" height=\"150\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://bit.ly/4jPfdAS\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e9to5Mac is brought to you by Incogni:\u003c/a\u003e\u003c/strong\u003e \u003cem\u003eProtect your personal info from prying eyes. With \u003ca href=\"https://bit.ly/4jPfdAS\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eIncogni\u003c/a\u003e, you can scrub your deeply sensitive information from data brokers across the web, including people search sites. Incogni limits your phone number, address, email, SSN, and more from circulating. Fight back against unwanted data brokers with a \u003ca href=\"https://bit.ly/4jPfdAS\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e30-day money back guarantee\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\u003ch2 id=\"h-on-device-models\"\u003eOn-device models\u003c/h2\u003e\n\n\n\n\u003cp\u003eThis one is a bit obvious, but Apple Intelligence features are powered by \u003ca href=\"https://9to5mac.com/2024/06/10/apple-ai-apple-intelligence-iphone-ipad-mac/\"\u003eon-device models\u003c/a\u003e. That’s why there’s such a strict device requirement. You can only utilize Apple Intelligence if you have an iPhone 15 Pro or iPhone 16 model. On the iPad and Mac side, it’s a bit more lenient, with all M1 devices being supported.\u003c/p\u003e\n\n\n\n\u003cp\u003eEither way, that device requirement isn’t strict for no reason, it’s because running large language models on device requires a lot of power and a lot of memory. To be specific, it requires 8GB of unified memory, which Apple only begun shipping on the iPhone 15 Pro.\u003c/p\u003e\n\n\n\n\u003cp\u003eWith on device models, any requests you make don’t leave your phone. Granted, not every Apple Intelligence request will run on-device. Apple also has private cloud compute for heavier requests, which I’ll explain in a bit. That said, for the most part, current Apple Intelligence features lean heavily on the chipset in your device, such as Notification summaries and Genmoji. This keeps your requests and personal information local.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" height=\"512\" width=\"1024\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios183-summarize-notifications.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1024\" alt=\"iOS 18.3 Notification Summaries\" srcset=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios183-summarize-notifications.jpg 2000w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios183-summarize-notifications.jpg?resize=155,78 155w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios183-summarize-notifications.jpg?resize=655,328 655w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios183-summarize-notifications.jpg?resize=768,384 768w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios183-summarize-notifications.jpg?resize=1024,512 1024w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios183-summarize-notifications.jpg?resize=1536,768 1536w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios183-summarize-notifications.jpg?resize=350,175 350w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios183-summarize-notifications.jpg?resize=140,70 140w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios183-summarize-notifications.jpg?resize=1600,800 1600w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios183-summarize-notifications.jpg?resize=290,145 290w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/ios183-summarize-notifications.jpg?resize=150,75 150w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eApple’s also\u003ca href=\"https://9to5mac.com/2025/06/09/apple-third-party-developers-apple-intelligence-models/\"\u003e expanded the capabilities\u003c/a\u003e of on device models this year at WWDC25, allowing developers to implement features using Apple’s on device models, otherwise known as Apple Foundational Models. This’ll potentially deter developers from using providers like OpenAI or Google Gemini for passing your private user data to, though there is the major fact that Apple Intelligence is only available on a small number of devices.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-private-cloud-compute\"\u003ePrivate Cloud Compute\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs alluded to earlier, Apple also has a cloud solution for handling Apple Intelligence requests. It \u003ca href=\"https://9to5mac.com/2025/03/17/our-apple-intelligence-privacy-reports-are-empty-how-about-yours-poll/\"\u003ewasn’t in action a ton \u003c/a\u003eduring iOS 18, but it’s being utilized a fair bit more with iOS 26. For example, you can now use Siri Shortcuts to send prompts to Apple models, including cloud models.\u003c/p\u003e\n\n\n\n\u003cp\u003eApple has an incredibly detailed\u003ca href=\"https://security.apple.com/blog/private-cloud-compute/\"\u003e blog post \u003c/a\u003eon how Private Cloud Compute keeps your user information private. In short, the system is built to not retain information – and you can verify that. On top of building the system in such a way that user data wouldn’t be accessible by Apple or an attacker, Apple wanted to release the software images for Private Cloud Compute, allowing independent researchers to verify Apple’s claims.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can learn more about Apple’s Private Cloud Compute and how it works in our post \u003ca href=\"https://9to5mac.com/2024/06/12/apple-intelligence-privacy-guarantees/\"\u003ehere\u003c/a\u003e. It’s a rather interesting system, and is certainly industry-leading for server-based AI privacy.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-chatgpt-integration\"\u003eChatGPT Integration\u003c/h2\u003e\n\n\n\n\u003cp\u003eLast but not least, Apple has a \u003ca href=\"https://openai.com/index/openai-and-apple-announce-partnership/\"\u003especial deal \u003c/a\u003ewith OpenAI to ensure that Apple user data isn’t retained by OpenAI, and that Apple user requests aren’t utilized in training data for future models. There’s also the fact that requests are never sent to ChatGPT without the user providing permission.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" height=\"512\" width=\"1024\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1024\" alt=\"Apple Intelligence ChatGPT iOS 18\" srcset=\"https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg 5360w, https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg?resize=155,78 155w, https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg?resize=655,328 655w, https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg?resize=768,384 768w, https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg?resize=1024,512 1024w, https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg?resize=1536,768 1536w, https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg?resize=2048,1024 2048w, https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg?resize=350,175 350w, https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg?resize=140,70 140w, https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg?resize=1600,800 1600w, https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg?resize=290,145 290w, https://9to5mac.com/wp-content/uploads/sites/6/2024/06/apple-intelligence-chatgpt-ios-18.jpg?resize=150,75 150w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eLast month, The New York Times sued OpenAI, and the court demanded that OpenAI needs to retain ChatGPT user data indefinitely. Traditionally, OpenAI deletes this data from its systems within 30 days.\u003c/p\u003e\n\n\n\n\u003cp\u003eSome people have wondered if that impacts Apple users, but rest assured, \u003ca href=\"https://openai.com/index/response-to-nyt-data-demands/\"\u003eOpenAI has stated\u003c/a\u003e that business customers utilizing Zero Data Retention APIs aren’t impacted, because OpenAI wouldn’t have stored that data at any point.\u003c/p\u003e\n\n\n\n\u003cp\u003eGiven this fact, using ChatGPT through Siri is technically the \u003ca href=\"https://9to5mac.com/2024/10/23/this-is-how-apples-handling-privacy-with-ios-182s-chatgpt-integration/\"\u003emost private way \u003c/a\u003eof accessing those models – highlighting Apple’s underlying commitment to user privacy, even in the age of AI.\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMy favorite Apple accessory recommendations:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/401kHkn\"\u003eAnker MagSafe 2-in-1 Wireless Charging Stand with Qi2\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/45Wfaiq\"\u003eAulumu Vegan Leather MagSafe Case for iPhone 16\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://redirect.viglink.com/?key=0ab71bd42c2ca312a536dac167978a13\u0026amp;u=https%3A%2F%2Famzn.to%2F41h8skw\u0026amp;type=ap\u0026amp;loc=https%3A%2F%2F9to5toys.com%2F2025%2F02%2F13%2Fmoft-magnetic-wallet-stand-apple-iphone-magsafe-wallet-review%2F\u0026amp;ref=https%3A%2F%2Fwww.google.com%2F\"\u003eMOFT Magnetic Wallet Stand, fits up to 3 cards\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/3XCA3tQ\"\u003eAirTag 4-pack (on sale for 20% off!)\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/3DtypE6\"\u003eSanDisk Extreme 2TB USB-C SSD, up to 1050MB/s\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/4jF8DMG\"\u003eAirPods Pro 2 (USB-C)\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eFollow Michael: \u003ca href=\"https://x.com/mbrkhrdt\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eX/Twitter\u003c/a\u003e, \u003ca href=\"https://bsky.app/profile/michaelb.nyc\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBluesky\u003c/a\u003e, \u003ca href=\"https://instagram.com/m.brkhrdt\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eInstagram\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Mac to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cdiv\u003e\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://bit.ly/4es0c5X\"\u003e\u003cimg src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/06/ROBOROCK-750_150.png\" alt=\"\" width=\"750\" height=\"150\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-20T23:10:43Z",
  "modifiedTime": "2025-07-20T23:10:45Z"
}
