{
  "id": "66da7d7c-ca3a-4ff2-8318-7e3abd7cd5b7",
  "title": "Apple stock rebounds again following week of tariff chaos",
  "link": "https://appleinsider.com/articles/25/04/11/apple-stock-rebounds-again-following-week-of-tariff-chaos?utm_medium=rss",
  "description": "Apple's share price is continuing to ride the tariff rollercoaster, with it finishing strong on Friday after a week of turmoil.Apple shares did well on Friday after a rough weekThis week has been a tough one for Apple investors, due to the continued alterations to how the United States applies tariffs against imports from other countries. The stock market doesn't do well with uncertainty, and the various changes dictated by President Trump certainly introduced some.After Thursday's return to a slump, Apple ended that day on $190.42, with pre-market movements resulting in Apple opening at $186.10. While the stock did go down a little to $186.06 early on, it rapidly climbed and reached a high of $199.54 during the day, and ended the session at $198.15. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Malcolm Owen",
  "published": "Fri, 11 Apr 2025 20:12:18 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Malcolm Owen",
  "length": 2679,
  "excerpt": "Apple's share price is continuing to ride the tariff rollercoaster, with it finishing strong on Friday after a week of turmoil.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Apple's share price is continuing to ride the tariff rollercoaster, with it finishing strong on Friday after a week of turmoil. This week has been a tough one for Apple investors, due to the continued alterations to how the United States applies tariffs against imports from other countries. The stock market doesn't do well with uncertainty, and the various changes dictated by President Trump certainly introduced some. After Thursday's return to a slump, Apple ended that day on $190.42, with pre-market movements resulting in Apple opening at $186.10. While the stock did go down a little to $186.06 early on, it rapidly climbed and reached a high of $199.54 during the day, and ended the session at $198.15. The progress on the day brought the market capitalization up to $2.98 trillion dollars, with Apple just shy of the $3 trillion milestone that it previously held. The rest of the markets also saw gains, with the Dow jumping 619 points and the Nasdaq Composite going up 2%. The potential for troubleWhile the reprieve on reciprocal tariffs on Wednesday helped Apple then, today's positive shift was due to just one tariff. Specifically, China. Trump and China have been in a tit-for-tat tariff battle, with each raising their respective tariffs in response to the other's movements. In the most recent exchanges, Trump raised the tariff on Chinese imports to 145%. On Friday, China responded by declaring it would raise its tariff on U.S. goods imports from 84% to 125%. However, China also made it clear that it didn't intend to raise tariffs more, even if the U.S. did so, but it would still enact some form of countermeasures. Let's make a dealFollowing what happened during the rest of the week, you'd be forgiven for speculating that Trump would raise the tariff again. Instead, Trump didn't make a change at all. Instead, White House press secretary Karoline Leavitt said Trump is \"optimistic\" that the U.S. and China could strike a tariff deal, reports Fox Business. \"The president has made it very clear he's open to a deal with China,\" Leavitt told the media. Understandably, this could be a good thing for Apple, as any deal to reduce the China tariff would be beneficial. Since the vast majority of its supply chain is out there, the tariffs can have a major effect on how much an iPhone costs to get into the country. That said, Apple has some workarounds. It has been stockpiling devices in the U.S., and it even has the option to use parts of its supply chain in other bases, such as India, that have lower tariff rates. All Apple really needs is for Trump and China to talk and agree on a tariff deal that's saner than the current situation.",
  "image": "https://photos5.appleinsider.com/gallery/63293-131525-63273-131459-63194-131305-Apple-Stock-xl-xl-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eApple\u0026#39;s share price is continuing to ride the tariff rollercoaster, with it finishing strong on Friday after a week of turmoil. \n\u003c/p\u003e\u003cp\u003eThis week has been a tough one for Apple investors, due to the continued alterations to how the United States applies tariffs against imports from other countries. The stock market doesn\u0026#39;t do well with uncertainty, and the various changes dictated by President Trump certainly introduced some. \n\u003c/p\u003e\u003cp\u003eAfter Thursday\u0026#39;s \u003ca href=\"https://appleinsider.com/articles/25/04/10/aapl-crumble-stock-hit-again-as-white-house-clarifies-145-china-tariff-rate\"\u003ereturn to a slump\u003c/a\u003e, Apple ended that day on $190.42, with pre-market movements resulting in Apple opening at $186.10. While the stock did go down a little to $186.06 early on, it rapidly climbed and reached a high of $199.54 during the day, and ended the session at $198.15. \n\u003c/p\u003e\u003cp\u003eThe progress on the day brought the market capitalization up to $2.98 trillion dollars, with Apple just shy of the $3 trillion milestone that it previously held. \n\u003c/p\u003e\u003cp\u003eThe rest of the markets also saw gains, with the Dow jumping 619 points and the Nasdaq Composite going up 2%. \n\u003c/p\u003e\u003ch2 data-anchor=\"the-potential-for-trouble\" id=\"the-potential-for-trouble\"\u003eThe potential for trouble\u003c/h2\u003e\u003cp\u003eWhile the reprieve on reciprocal tariffs on Wednesday helped Apple then, today\u0026#39;s positive shift was due to just one tariff. Specifically, China. \n\u003c/p\u003e\u003cp\u003eTrump and China have been in a tit-for-tat tariff battle, with each raising their respective tariffs in response to the other\u0026#39;s movements. In the most recent exchanges, Trump raised the tariff on Chinese imports \u003ca href=\"https://appleinsider.com/articles/25/04/10/aapl-crumble-stock-hit-again-as-white-house-clarifies-145-china-tariff-rate/\"\u003eto 145%\u003c/a\u003e. \n\u003c/p\u003e\u003cp\u003eOn Friday, China responded by declaring it would raise its tariff on U.S. goods imports from \u003ca href=\"https://appleinsider.com/articles/25/04/11/china-calls-trumps-trade-war-a-joke-jumps-tariffs-on-us-goods-to-125\"\u003e84% to 125%\u003c/a\u003e. However, China also made it clear that it didn\u0026#39;t intend to raise tariffs more, even if the U.S. did so, but it would still enact some form of countermeasures. \n\u003c/p\u003e\u003ch2 data-anchor=\"lets-make-a-deal\" id=\"lets-make-a-deal\"\u003eLet\u0026#39;s make a deal\u003c/h2\u003e\u003cp\u003eFollowing what happened during the rest of the week, you\u0026#39;d be forgiven for speculating that Trump would raise the tariff again. Instead, Trump didn\u0026#39;t make a change at all. \n\u003c/p\u003e\u003cp\u003eInstead, White House press secretary Karoline Leavitt said Trump is \u0026#34;optimistic\u0026#34; that the U.S. and China could strike a tariff deal, \u003ca href=\"https://www.foxbusiness.com/politics/trump-optimistic-china-make-tariff-deal-white-house-says\"\u003ereports\u003c/a\u003e \u003cem\u003eFox Business\u003c/em\u003e. \u0026#34;The president has made it very clear he\u0026#39;s open to a deal with China,\u0026#34; Leavitt told the media. \n\u003c/p\u003e\u003cp\u003eUnderstandably, this could be a good thing for Apple, as any deal to reduce the China tariff would be beneficial. Since the vast majority of its supply chain is out there, the tariffs can have a major effect on how much an iPhone costs to get into the country. \n\u003c/p\u003e\u003cp\u003eThat said, Apple has some workarounds. It has been \u003ca href=\"https://appleinsider.com/articles/25/04/09/apples-airlifting-imports-to-beat-tariff-deadline-included-macs\"\u003estockpiling devices\u003c/a\u003e in the U.S., and it even has the option to use parts of its supply chain \u003ca href=\"https://appleinsider.com/articles/25/04/07/apple-could-import-more-iphones-from-india-due-to-trumps-tariffs\"\u003ein other bases\u003c/a\u003e, such as India, that have lower tariff rates. \n\u003c/p\u003e\u003cp\u003eAll Apple really needs is for Trump and China to talk and agree on a tariff deal that\u0026#39;s saner than the current situation. \u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-11T20:12:18Z",
  "modifiedTime": null
}
