{
  "id": "6f829a0d-879c-440b-b9b1-fae0fb992914",
  "title": "Apple Opens Up New App Distribution Options in the EU, Along with New and Updated Fees",
  "link": "https://www.macstories.net/news/apple-opens-up-new-app-distribution-options-in-the-eu-along-with-new-and-updated-fees/",
  "description": "To avoid additional fines, Apple is making several new changes to App Store rules in the EU. Today’s changes are a result of an April ruling by the European Commission that levied a €500 million fine against the company and ordered that it “…remove the technical and commercial restrictions on steering and to refrain from […] The post Apple Opens Up New App Distribution Options in the EU, Along with New and Updated Fees first appeared on MacStories.",
  "author": "John Voorhees",
  "published": "Thu, 26 Jun 2025 21:20:30 +0000",
  "source": "https://www.macstories.net/feed",
  "categories": [
    "news",
    "app store",
    "DMA",
    "EU",
    "Legal",
    "regulation"
  ],
  "byline": "John Voorhees",
  "length": 4720,
  "excerpt": "To avoid additional fines, Apple is making several new changes to App Store rules in the EU. Today’s changes are a result of an April ruling by the European Commission that levied a €500 million fine against the company and ordered that it “…remove the technical and commercial restrictions on steering and to refrain from",
  "siteName": "MacStories - Apple news, app reviews, and stories by Federico Viticci and friends.",
  "favicon": "https://www.macstories.net/wp-content/themes/macstories4/images/apple-touch-icon-152x152-precomposed.png",
  "text": "To avoid additional fines, Apple is making several new changes to App Store rules in the EU. Today’s changes are a result of an April ruling by the European Commission that levied a €500 million fine against the company and ordered that it “…remove the technical and commercial restrictions on steering and to refrain from perpetuating the non-compliant conduct in the future….” The changes are complex and wide-ranging, but among the highlights regarding in-app offers are changes that: allow developers to communicate and promote offers for digital goods and services in their apps, which can steer users to the web, an alternative app marketplace, or another app either inside their app via a web view or native code, or outside their app; permit developers to design these offers themselves, which can include pricing and instructions on how to take advantage of the offers outside the app; allow offers to include links to the destination of the developer’s choice; and prohibits developers from making offers outside the App Store using Apple’s In-App Purchase or StoreKit External Link Account entitlement for reader apps on the same OS; require an informational banner in the App Store that shows it offers external purchases. Fees have changed for developers offering external purchases, too, and include: an initial acquisition fee of 2% is charged for sales made within six months of a user’s first unpaid installation of an app; a 5% or 13% store services fee depending on the store services used for any purchases made within 12 months of an app’s download; for apps that offer external purchases, a Core Technology Commission (not Fee) of 5% for purchases made within 12 months of installation will be charged; the Core Technology Fee still exists, until the end of the year, for apps that don’t use the external purchase APIs if their installations exceed one million installations on a rolling 12-month basis; and lower fees for Small Business Program developers. Note, too, that by January 1, 2026, the Core Technology Fee will be replaced by the Core Technology Commission. Also, developers in the EU will be able to offer their apps not only through alternative app marketplaces, where were already available, but also their own websites. To sell an app via a website, you have to be an Apple Developer in good standing for two consecutive years, obtain a €1,000,000 standby letter of credit, and have an app that has more than one million First Annual Installs on iOS and/or iPadOS in the prior calendar year. As you would expect, developers selling outside the App Store are responsible for managing the purchase process, taxes, and customer service, and failing to do so could result in the revocation of API access by Apple. All right, that’s a lot and while I’ve tried to boil it down to the core points, there are a lot of details developers should study carefully and understand before taking the plunge of selling their apps outside the EU App Store. The best place to learn more now is from Apple. Start with the developer announcement, which links to more details about the new rules and relevant legal documents. Apple is also offering 30-minute sessions for EU developers to ask questions and provide feedback. If you’re wondering what Apple thinks of all this, well, it’s not happy. An unnamed spokesperson told CNBC: The European Commission is requiring Apple to make a series of additional changes to the App Store. We disagree with this outcome and plan to appeal. It will be interesting to see how this plays out. The fee structure and rules are complex and will need to be studied closely to evaluate the practical effect of the changes. That said, I’m cautiously optimistic that our readers in the EU will soon have more choice than ever, which I’m glad to see. Access Extra Content and PerksFounded in 2015, Club MacStories has delivered exclusive content every week for nearly a decade. What started with weekly and monthly email newsletters has blossomed into a family of memberships designed every MacStories fan. Learn more here and from our Club FAQs. Club MacStories: Weekly and monthly newsletters via email and the web that are brimming with apps, tips, automation workflows, longform writing, early access to the MacStories Unwind podcast, periodic giveaways, and more; Club MacStories+: Everything that Club MacStories offers, plus an active Discord community, advanced search and custom RSS features for exploring the Club’s entire back catalog, bonus columns, and dozens of app discounts; Club Premier: All of the above and AppStories+, an extended version of our flagship podcast that’s delivered early, ad-free, and in high-bitrate audio.",
  "image": "https://cdn.macstories.net/flag-1745405160644.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \n\u003cp id=\"p2\"\u003eTo avoid additional fines, Apple is making several new changes to App Store rules in the EU. Today’s changes are a result of an April ruling by the European Commission that levied a €500 million fine against the company and \u003ca href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_25_1086\" rel=\"noopener noreferrer\"\u003eordered\u003c/a\u003e that it “…remove the technical and commercial restrictions on steering and to refrain from perpetuating the non-compliant conduct in the future….”\u003c/p\u003e\n\u003cp id=\"p3\"\u003eThe changes are complex and wide-ranging, but \u003ca href=\"https://developer.apple.com/news/?id=awedznci\" rel=\"noopener noreferrer\"\u003eamong the highlights\u003c/a\u003e regarding in-app offers are changes that:\u003c/p\u003e\n\u003cul id=\"ul4\"\u003e\u003cli\u003eallow developers to communicate and promote offers for digital goods and services in their apps, which can steer users to the web, an alternative app marketplace, or another app either inside their app via a web view or native code, or outside their app;\u003c/li\u003e\n\u003cli\u003epermit developers to design these offers themselves, which can include pricing and instructions on how to take advantage of the offers outside the app;\u003c/li\u003e\n\u003cli\u003eallow offers to include links to the destination of the developer’s choice; and\u003c/li\u003e\n\u003cli\u003eprohibits developers from making offers outside the App Store using Apple’s In-App Purchase or StoreKit External Link Account entitlement for reader apps on the same OS;\u003c/li\u003e\n\u003cli\u003erequire an informational banner in the App Store that shows it offers external purchases.\u003c/li\u003e\n\u003c/ul\u003e\u003cp id=\"p5\"\u003e\u003ca href=\"https://developer.apple.com/news/?id=awedznci\" rel=\"noopener noreferrer\"\u003eFees have changed\u003c/a\u003e for developers offering external purchases, too, and include:\u003c/p\u003e\n\u003cul id=\"ul6\"\u003e\u003cli\u003ean initial acquisition fee of 2% is charged for sales made within six months of a user’s first unpaid installation of an app;\u003c/li\u003e\n\u003cli\u003ea 5% or 13% store services fee depending on the store services used for any purchases made within 12 months of an app’s download;\u003c/li\u003e\n\u003cli\u003efor apps that offer external purchases, a Core Technology Commission (not Fee) of 5% for purchases made within 12 months of installation will be charged;\u003c/li\u003e\n\u003cli\u003ethe Core Technology Fee still exists, until the end of the year, for apps that don’t use the external purchase APIs if their installations exceed one million installations on a rolling 12-month basis; and\u003c/li\u003e\n\u003cli\u003elower fees for Small Business Program developers.\u003c/li\u003e\n\u003c/ul\u003e\u003cp id=\"p7\"\u003eNote, too, that by January 1, 2026, the Core Technology Fee will be replaced by the Core Technology Commission.\u003c/p\u003e\n\u003cp id=\"p8\"\u003eAlso, developers in the EU will be able to offer their apps not only through alternative app marketplaces, where were already available, but also their own websites. To sell an app via a website, you have to be an Apple Developer in good standing for two consecutive years, obtain a €1,000,000 standby letter of credit, and have an app that has more than one million First Annual Installs on iOS and/or iPadOS in the prior calendar year. As you would expect, developers selling outside the App Store are responsible for managing the purchase process, taxes, and customer service, and failing to do so could result in the revocation of API access by Apple.\u003c/p\u003e\n\u003cp id=\"p9\"\u003eAll right, that’s a lot and while I’ve tried to boil it down to the core points, there are a lot of details developers should study carefully and understand before taking the plunge of selling their apps outside the EU App Store. The best place to learn more now is from Apple. Start with the developer announcement, which links to more details about the new rules and relevant legal documents. Apple is also offering \u003ca href=\"https://developer.apple.com/events/view/upcoming-events\" rel=\"noopener noreferrer\"\u003e30-minute sessions\u003c/a\u003e for EU developers to ask questions and provide feedback.\u003c/p\u003e\n\u003cp id=\"p10\"\u003eIf you’re wondering what Apple thinks of all this, well, it’s not happy. An unnamed spokesperson \u003ca href=\"https://www.cnbc.com/2025/06/26/apple-eu-500-million-euro-app-store.html\" rel=\"noopener noreferrer\"\u003etold CNBC\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote id=\"blockquote11\"\u003e\u003cp\u003e\n  The European Commission is requiring Apple to make a series of additional changes to the App Store. We disagree with this outcome and plan to appeal.\n\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp id=\"p12\"\u003eIt will be interesting to see how this plays out. The fee structure and rules are complex and will need to be studied closely to evaluate the practical effect of the changes. That said, I’m cautiously optimistic that our readers in the EU will soon have more choice than ever, which I’m glad to see.\u003c/p\u003e\n            \u003c/div\u003e\u003cdiv\u003e\n            \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://www.macstories.net/wp-content/themes/macstories4/images/logo-shape-gold.svg\" alt=\"Club MacStories\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003eAccess Extra Content and Perks\u003c/h3\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003eFounded in 2015, \u003ca href=\"https://club.macstories.net/plans?utm_source=ms\u0026amp;utm_medium=web-inline\" rel=\"noopener noreferrer\"\u003eClub MacStories\u003c/a\u003e has delivered exclusive content every week for nearly a decade.\u003c/p\u003e\n\u003cp\u003eWhat started with weekly and monthly email newsletters has blossomed into \u003ca href=\"https://club.macstories.net/plans?utm_source=ms\u0026amp;utm_medium=web-inline\" rel=\"noopener noreferrer\"\u003ea family of memberships\u003c/a\u003e designed every MacStories fan.\u003c/p\u003e\n\u003cp\u003eLearn more \u003ca href=\"https://club.macstories.net/plans?utm_source=ms\u0026amp;utm_medium=web-inline\" rel=\"noopener noreferrer\"\u003ehere\u003c/a\u003e and from our \u003ca href=\"https://club.macstories.net/faq\" rel=\"noopener noreferrer\"\u003eClub FAQs\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://club.macstories.net/plans/club\" rel=\"noopener noreferrer\"\u003eClub MacStories\u003c/a\u003e\u003c/strong\u003e: Weekly and monthly newsletters via email and the web that are brimming with apps, tips, automation workflows, longform writing, early access to the \u003ca href=\"https://www.macstories.net/unwind/\" rel=\"noopener noreferrer\"\u003eMacStories Unwind podcast\u003c/a\u003e, periodic giveaways, and more;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://club.macstories.net/plans/plus\" rel=\"noopener noreferrer\"\u003eClub MacStories+\u003c/a\u003e\u003c/strong\u003e: Everything that Club MacStories offers, plus an active Discord community, advanced search and custom RSS features for exploring the Club’s entire back catalog, bonus columns, and dozens of app discounts;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://club.macstories.net/plans/premier\" rel=\"noopener noreferrer\"\u003eClub Premier\u003c/a\u003e\u003c/strong\u003e: All of the above \u003cem\u003eand\u003c/em\u003e AppStories+, an extended version of our flagship podcast that’s delivered early, ad-free, and in high-bitrate audio.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-26T17:20:30-04:00",
  "modifiedTime": "2025-06-26T21:23:02Z"
}
