{
  "id": "80d99fad-b135-42d3-85a8-7955df04b44b",
  "title": "Apple Watch with cameras reportedly canceled, but camera-equipped AirPods still on track",
  "link": "https://appleinsider.com/articles/25/05/22/apple-watch-with-cameras-reportedly-canceled-but-camera-equipped-airpods-still-on-track?utm_medium=rss",
  "description": "Plans for an Apple Watch with Visual Intelligence and built-in cameras have been abandoned, but Apple's AirPods could still receive a similar upgrade.Apple has allegedly abandoned its plans for a camera-equipped Apple Watch.The idea of a camera-equipped Apple Watch is anything but new, appearing in Apple's patent applications as far back as 2019. The company has even considered multiple ways of including a camera, such as incorporating it into the Digital Crown or the Apple Watch strap.More recently, in March 2025, a rumor suggested that the Apple Watch would gain cameras for Visual Intelligence features as well as world monitoring by 2027. On Thursday, however, a Bloomberg report revealed that Apple has since given up on the idea, and added that the company was working on smart glasses, set to debut in 2026. Rumor Score: 🤔 Possible Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Marko Zivkovic",
  "published": "Thu, 22 May 2025 21:13:42 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Marko Zivkovic",
  "length": 3674,
  "excerpt": "Plans for an Apple Watch with Visual Intelligence and built-in cameras have been abandoned, but Apple's AirPods could still receive a similar upgrade.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Plans for an Apple Watch with Visual Intelligence and built-in cameras have been abandoned, but Apple's AirPods could still receive a similar upgrade. The idea of a camera-equipped Apple Watch is anything but new, appearing in Apple's patent applications as far back as 2019. The company has even considered multiple ways of including a camera, such as incorporating it into the Digital Crown or the Apple Watch strap. More recently, in March 2025, a rumor suggested that the Apple Watch would gain cameras for Visual Intelligence features as well as world monitoring by 2027. On Thursday, however, a Bloomberg report revealed that Apple has since given up on the idea, and added that the company was working on smart glasses, set to debut in 2026. Previously, Apple was allegedly going to add cameras to the standard Apple Watch and Apple Watch Ultra, with slight differences between the two. Both watch models were set to gain a front-facing lens inside the display, while the Ultra would have had a lens on the side, near the crown and button. The addition of cameras would have allowed for Visual Intelligence features across the Apple Watch lineup. Visual Intelligence is currently available on the iPhone 16 range, as well as the iPhone 15 Pro. It lets users obtain information about their environment through the built-in camera device and Apple Intelligence, a suite of generative AI features. With Visual Intelligence, users can add a calendar event by simply scanning a poster, or they can identify dog breeds with their iPhone camera. The idea of the effort is to use built-in cameras so that AI can see the outside world, which can be used to deliver detailed information that can enhance queries. The same concept would have made its way to the Apple Watch. While it looks like we won't see Visual Intelligence on a smartwatch, camera-equipped AirPods are reportedly still in the works, and they'll likely offer the same functionality. The AirPod cameras could add Visual Intelligence information to the iPhone while still in the user's pocket, for example, or they might help guide users to their destination. Apple has undoubtedly been trying to expand the availability of Apple Intelligence across its different platforms, but it looks like the company has yet to unveil a breakthrough AI product. Apple Intelligence itself has experienced delays, as the advanced Siri features previewed at WWDC 2024 are still not here. Apple likely won't go the route of physical AI-themed products, such as the Rabbit R1.As for dedicated AI-themed devices, it doesn't appear as though Apple has plans to go that route. Throughout 2024 and 2025 alone, many physical AI companion products have outright failed, with the Humane AI Pin and Rabbit R1 being the two most noteworthy examples. The idea of having a third device, which users would carry alongside their iPhone and MacBook Pro, has never really caught on. This more than likely influenced Apple's choice of improving existing product categories with AI instead, as they're unlikely to be phased out anytime soon. With iOS 19, Apple's AI models could become accessible to third-party app developers, which would allow for additional use cases and more AI-infused applications on iPhones. The OS update might also enable live translation features for AirPods. Other companies, meanwhile, such as OpenAI, have decided to pursue physical AI-type devices after all. Specifically, an AI-themed necklace is said to be in the works. The artificial intelligence giant announced it had bought Sam Altman and Jony Ive's AI startup, known simply as \"io,\" for $6.5 billion, but the result of this endeavor remains to be seen.",
  "image": "https://photos5.appleinsider.com/gallery/63718-132568-IMG_2116-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003ePlans for an \u003ca href=\"https://appleinsider.com/inside/apple-watch\" title=\"Apple Watch\" data-kpt=\"1\"\u003eApple Watch\u003c/a\u003e with Visual Intelligence and built-in cameras have been abandoned, but Apple\u0026#39;s AirPods could still receive a similar upgrade.\n\u003c/p\u003e\u003cp\u003eThe idea of a camera-equipped Apple Watch is \u003ca href=\"https://appleinsider.com/articles/21/01/21/future-apple-watch-strap-may-feature-panorama-or-3d-cameras\"\u003eanything but new\u003c/a\u003e, appearing in Apple\u0026#39;s \u003ca href=\"https://appleinsider.com/articles/23/03/23/future-apple-watch-could-get-cameras-for-photography-face-id\"\u003epatent applications\u003c/a\u003e as far back as \u003ca href=\"https://appleinsider.com/articles/19/06/25/apple-watch-could-get-a-camera-on-the-end-of-a-watch-bands-strap\"\u003e2019\u003c/a\u003e. The company has even considered \u003ca href=\"https://appleinsider.com/articles/25/03/20/forget-folding-iphones-apple-wants-a-foldable-apple-watch\"\u003emultiple ways\u003c/a\u003e of \u003ca href=\"https://appleinsider.com/articles/23/03/23/future-apple-watch-could-get-cameras-for-photography-face-id\"\u003eincluding\u003c/a\u003e a camera, such as \u003ca href=\"https://appleinsider.com/articles/20/12/15/future-apple-watch-or-iphone-may-gain-a-camera-thats-completely-hidden-when-not-in-use\"\u003eincorporating it\u003c/a\u003e into the \u003ca href=\"https://appleinsider.com/articles/22/05/31/future-apple-watches-could-have-a-camera-in-the-digital-crown\"\u003eDigital Crown\u003c/a\u003e or the Apple Watch strap.\n\u003c/p\u003e\u003cp\u003eMore recently, in \u003ca href=\"https://appleinsider.com/articles/25/03/23/apple-watch-could-gain-cameras-to-improve-ai-features\"\u003eMarch 2025\u003c/a\u003e, a rumor suggested that the Apple Watch would gain cameras for Visual Intelligence features as well as world monitoring by 2027. On Thursday, however, a \u003cem\u003eBloomberg\u003c/em\u003e report \u003ca href=\"https://www.bloomberg.com/news/articles/2025-05-22/apple-plans-glasses-for-2026-as-part-of-ai-push-nixes-watch-with-camera?embedded-checkout=true\"\u003erevealed\u003c/a\u003e that Apple has since given up on the idea, and added that the company was working on smart glasses, set to \u003ca href=\"https://appleinsider.com/articles/25/05/22/ai-enhanced-apple-glass-smart-glasses-set-for-2026-release\"\u003edebut in 2026\u003c/a\u003e.\n\u003c/p\u003e\u003cp\u003ePreviously, Apple was allegedly going to add cameras to the standard Apple Watch and \u003ca href=\"https://appleinsider.com/inside/apple-watch-ultra\" title=\"Apple Watch Ultra\" data-kpt=\"1\"\u003eApple Watch Ultra\u003c/a\u003e, with slight differences between the two. Both watch models were set to gain a front-facing lens inside the display, while the Ultra would have had a lens on the side, near the crown and button.\n\u003c/p\u003e\u003cp\u003eThe addition of cameras would have allowed for Visual Intelligence features across the Apple Watch lineup. Visual Intelligence is currently available on the \u003ca href=\"https://appleinsider.com/inside/iphone-16\" title=\"iPhone 16\" data-kpt=\"1\"\u003eiPhone 16\u003c/a\u003e range, as well as the \u003ca href=\"https://appleinsider.com/inside/iphone-15-pro\" title=\"iPhone 15 Pro\" data-kpt=\"1\"\u003eiPhone 15 Pro\u003c/a\u003e. It lets users obtain information about their environment through the built-in camera device and \u003ca href=\"https://appleinsider.com/inside/apple-intelligence\" title=\"Apple Intelligence\" data-kpt=\"1\"\u003eApple Intelligence\u003c/a\u003e, a suite of generative AI features.\n\u003c/p\u003e\u003cp\u003eWith \u003ca href=\"https://appleinsider.com/articles/25/01/31/hands-on-visual-intelligence-gets-more-powerful-as-an-underrated-iphone-16-feature\"\u003eVisual Intelligence\u003c/a\u003e, users can add a calendar event by simply scanning a poster, or they can identify dog breeds with their iPhone camera. The idea of the effort is to use built-in cameras so that AI can see the outside world, which can be used to deliver detailed information that can enhance queries. The same concept would have made its way to the Apple Watch.\n\u003c/p\u003e\u003cp\u003eWhile it looks like we won\u0026#39;t see Visual Intelligence on a smartwatch, camera-equipped \u003ca href=\"https://appleinsider.com/inside/airpods\" title=\"AirPods\" data-kpt=\"1\"\u003eAirPods\u003c/a\u003e are reportedly still in the works, and they\u0026#39;ll likely offer \u003ca href=\"https://appleinsider.com/articles/25/05/18/camera-equipped-airpods-coming-in-2026-lighter-airpods-max-in-2027\"\u003ethe same functionality\u003c/a\u003e. The AirPod cameras could add Visual Intelligence information to the \u003ca href=\"https://appleinsider.com/inside/iphone\" title=\"iPhone\" data-kpt=\"1\"\u003eiPhone\u003c/a\u003e while still in the user\u0026#39;s pocket, for example, or they might help guide users to their destination.\n\u003c/p\u003e\u003cp\u003eApple has undoubtedly been trying to expand the availability of Apple Intelligence across its different platforms, but it looks like the company has yet to unveil a breakthrough AI product. Apple Intelligence itself has \u003ca href=\"https://appleinsider.com/articles/25/03/07/apple-confirms-that-apple-intelligence-siri-features-are-taking-longer-than-expected\"\u003eexperienced delays\u003c/a\u003e, as the advanced \u003ca href=\"https://appleinsider.com/inside/siri\" title=\"Siri\" data-kpt=\"1\"\u003eSiri\u003c/a\u003e features previewed at \u003ca href=\"https://appleinsider.com/inside/wwdc\" title=\"WWDC\" data-kpt=\"1\"\u003eWWDC\u003c/a\u003e 2024 are still not here. \n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/63718-132567-59831-122458-59533-121527-IMG_5250-xl-xl-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/63718-132567-59831-122458-59533-121527-IMG_5250-xl-xl-xl.jpg\" alt=\"Orange, square digital alarm clock with rounded edges, black screen displaying 1:09, battery icon at 98%, and a cartoonish airplane and sleepy face graphic.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eApple likely won\u0026#39;t go the route of physical AI-themed products, such as the Rabbit R1.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAs for dedicated AI-themed devices, it doesn\u0026#39;t appear as though Apple has plans to go that route. Throughout 2024 and 2025 alone, many physical AI companion products have outright failed, with the \u003ca href=\"https://appleinsider.com/articles/25/02/19/humanes-ai-pin-is-no-more-and-owners-are-left-with-nothing\"\u003eHumane AI Pin\u003c/a\u003e and \u003ca href=\"https://appleinsider.com/articles/24/05/02/rabbit-r1-isnt-an-iphone-killer-because-its-ai-can-run-on-apple-hardware\"\u003eRabbit R1\u003c/a\u003e being the two most noteworthy examples. The idea of having a third device, which users would carry alongside their iPhone and \u003ca href=\"https://appleinsider.com/inside/macbook-pro\" title=\"MacBook Pro\" data-kpt=\"1\"\u003eMacBook Pro\u003c/a\u003e, has never really caught on. \n\u003c/p\u003e\u003cp\u003eThis more than likely influenced Apple\u0026#39;s choice of improving existing product categories with AI instead, as they\u0026#39;re \u003ca href=\"https://appleinsider.com/articles/24/06/08/why-ai-gadgets-and-wearables-wont-replace-smartphones-anytime-soon\"\u003eunlikely to be phased out\u003c/a\u003e anytime soon. With \u003ca href=\"https://appleinsider.com/inside/ios-19\" title=\"iOS 19\" data-kpt=\"1\"\u003eiOS 19\u003c/a\u003e, Apple\u0026#39;s AI models could \u003ca href=\"https://appleinsider.com/articles/25/05/20/apple-intelligence-set-to-be-opened-up-in-ios-19-to-third-party-developers\"\u003ebecome accessible\u003c/a\u003e to third-party app developers, which would allow for additional use cases and more AI-infused applications on iPhones. The OS update might also enable \u003ca href=\"https://appleinsider.com/articles/25/03/13/your-existing-airpods-could-gain-a-new-live-translation-feature-in-ios-19\"\u003elive translation features\u003c/a\u003e for AirPods.\n\u003c/p\u003e\u003cp\u003eOther companies, meanwhile, such as OpenAI, \u003ca href=\"https://appleinsider.com/articles/25/05/22/tantalizing-details-of-jony-ives-ai-device-leak-after-openai-meeting\"\u003ehave decided\u003c/a\u003e to pursue \u003ca href=\"https://appleinsider.com/articles/25/05/21/openais-65b-bet-on-jony-ive-could-redefine-how-people-interact-with-technology\"\u003ephysical AI-type\u003c/a\u003e devices after all. Specifically, an \u003ca href=\"https://appleinsider.com/articles/25/05/22/openai-jony-ives-ai-necklace-rumored-to-have-ipod-shuffle-form-factor\"\u003eAI-themed necklace\u003c/a\u003e is said to be in the works. The artificial intelligence giant announced it had bought Sam Altman and \u003ca href=\"https://appleinsider.com/inside/jony-ive\" title=\"Jony Ive\" data-kpt=\"1\"\u003eJony Ive\u003c/a\u003e\u0026#39;s AI startup, known simply as \u0026#34;io,\u0026#34; for \u003ca href=\"https://appleinsider.com/articles/25/05/21/openais-65b-bet-on-jony-ive-could-redefine-how-people-interact-with-technology\"\u003e$6.5 billion\u003c/a\u003e, but the result of this endeavor remains to be seen.\n\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-22T21:13:42Z",
  "modifiedTime": null
}
