{
  "id": "8769c805-6668-4afc-9fb9-78e0aa734998",
  "title": "‘Elon Musk Makes Bold Claims About Tesla Robotaxi in Hollywood Backlot’",
  "link": "https://arstechnica.com/cars/2024/10/elon-musk-makes-bold-claims-about-tesla-robotaxi-in-hollywood-backlot/",
  "description": "",
  "author": "John Gruber",
  "published": "2024-10-11T23:00:50Z",
  "source": "https://daringfireball.net/feeds/main",
  "categories": null,
  "byline": "Jonathan M. Gitlin",
  "length": 7759,
  "excerpt": "Tesla regularly makes bold promises it has not kept. Last night, it made many bold promises about autonomous driving and robotics.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Skip to content Tesla dusted off some decade-old ideas about mobility as the future of robotics. Last night, after a wait of roughly an hour after the official start time, Elon Musk spoke to a crowd of Tesla fans and some journalists on a film studio backlot in California to give us an update on the company's much-talked-about pivot to robotics. In an act redolent with symbolism, Musk emerged from a facade built to resemble an actual building, then stepped into an aerodynamically styled two-seater that combined the shape of a Honda CR-Z coupe with the doors from a McLaren supercar. This is the Tesla Cybercab, proving early leaks right. Musk claimed to have \"50 fully autonomous cars here tonight,\" eliciting screams and cheers from the crowd of fans when he announced there were no pedals or steering wheel. The billionaire, who has spent the past couple of years funneling millions of dollars to far-right causes, told the attendees that he didn't want a dark future like his favorite film Blade Runner—\"except maybe that cool duster,\" he said, referring to the jacket of his favorite character. Over the course of his presentation, Musk made many promises, variations of ones he's made many times before. \"Full self driving\" will enter an unsupervised mode that will allow passengers to fall asleep and wake up at their destinations. For people who think the cars are too expensive, they'll be worth five or 10 times as much because owners only use them an average of 10 hours a week. At a time when there's already a focus on low-occupancy vehicles on our overcrowded roads, the concept of a $30,000 two-seater Cybercab with the same footprint as a compact crossover that could carry five is a choice. Credit: Tesla Over time, Musk claimed the operating costs of his Cybercab would be 20 cents per mile, \"and yes you'll be able to buy one,\" he told the crowd to excited shrieks. \"We expect the cost to be below $30,000,\" Musk said, before expounding on a business model where instead of the company owning and operating these allegedly revenue-generating assets itself, they are instead owned by private individuals who each give Tesla its regular cut. This week another four top executives left the company in advance of last night's event, including \"the global vehicle automation and safety policy lead.\" \"It's going to be a glorious future,\" Musk said, albeit not one that applies to families or groups of three or more. Musk claims that Tesla \"expects to start\" fully unsupervised FSD next year on public roads in California and Texas. A recent analysis by an independent testing firm found the current build requires human intervention about once every 13 miles, often on roads it has used before. Only being able to carry two occupants is pretty inefficient when a city bus can carry more than 80 passengers. Credit: Tesla \"Before 2027\" should see the Cybercab, which Musk claims will be built in \"very high volume.\" Tesla-watchers will no doubt remember similar claims about the Model X, Model 3, Model Y, and most recently the Cybertruck, all of which faced lengthy delays as the car maker struggled to build them at scale. Later, Musk treated the audience to a video of an articulated robotic arm with a vacuum cleaner attachment cleaning the two-seat interior of the Cybercab. Whether this will be sold as an aftermarket accessory to Cybercab owners, or if they're supposed to clean out their robotaxis by hand between trips, remains unclear at this time. Musk also debuted another autonomous concept, the Robovan. It's a small bus with no visible wheels, but brightly lit interior room for up to 20 occupants. Musk said little about the Robovan and how it figures into Tesla's future. In 2017 he revealed his dislike for public transport, saying \"it's a pain in the ass\" and that other passengers could be serial killers.  After promising that \"unsupervised FSD\" is coming to all of Tesla's five models—\"now's not the time for nuance,\" Musk told a fan—he showed off a driverless minibus and then a horde of humanoid robots, which apparently leverage the same technology that Tesla says will be ready for autonomous driving with no supervision. These robots—\"your own personal R2-D2,\" he said—will apparently cost less than \"$30,000\" \"long-term,\" Musk claimed, adding that these would be the biggest product of all time, as all 8 billion people on earth would want one, then two, he predicted. This is called Robovan. Credit: Tesla The billionaire then chuckled that there might be a 1-in-5 chance the robots would turn bad. Do you still believe this stuff? For true believers who hear Musk talk but have paid little or no attention to Tesla's actual progress with autonomous driving technology, new car development, production ramping, or robotics, the event will have seemed like something of a success. Clad in a low-collared black leather jacket and looking leaner than he has at times, he spoke confidently, without the audible post-nasal drip that was so evident on many investor calls. \"It will be an age of abundance,\" he said, which is exactly the kind of message that Tesla investors like hearing, now that the company's share price is so decoupled from the actual business of building and selling cars. \"Reading Wall Street analyst reactions to the 'We, Robot' event, the consensus that the event was 'underwhelming' says more about their expectations than the event itself,\" said Ed Niedermeyer, author of Ludicrous: The Unvarnished Story of Tesla Motors. \"You can tell it's unsettling for them watching the fantasy float free of even appearing plausible or real. The fantasy of self-driving Teslas has worked for almost a decade because it felt real, but now just feels like a fantasy. Real things do not happen on movie studio lots. This was a theme park, not an informational event about an emerging technology,\" Niedermeyer told Ars. Those who have paid attention to the details—the years of production hell that accompanied each of Tesla's five models, the repeated claims for a \"coast to coast\" Autopilot drive that haven't materialized in eight years, the regular federal safety investigations and resulting recalls for both Autopilot and FSD (which still can't drive itself in a one-way tunnel), and so on, there is nothing to suggest this latest chapter—couched cleverly under a \"forward-looking statement\" disclaimer—will be any different from the ones we've already read. Jonathan is the Automotive Editor at Ars Technica. He has a BSc and PhD in Pharmacology. In 2014 he decided to indulge his lifelong passion for the car by leaving the National Human Genome Research Institute and launching Ars Technica's automotive coverage. He lives in Washington, DC.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/Eloncab.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"app\"\u003e\n    \u003cp\u003e\u003ca href=\"#main\"\u003e\n  Skip to content\n\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cmain id=\"main\"\u003e\n            \u003carticle data-id=\"2055862\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n      \n\n      \n\n      \u003cp\u003e\n        Tesla dusted off some decade-old ideas about mobility as the future of robotics.\n      \u003c/p\u003e\n\n      \n    \u003c/div\u003e\n\u003c/header\u003e\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \u003cp\u003eLast night, after a wait of roughly an hour after the official start time, Elon Musk spoke to a crowd of Tesla fans and some journalists on a film studio backlot in California to give us an update on the company\u0026#39;s much-talked-about \u003ca href=\"https://arstechnica.com/cars/2024/08/elon-musk-says-tesla-is-an-ai-company-now-heres-how-plausible-that-is/\"\u003epivot to robotics\u003c/a\u003e. In an act redolent with symbolism, Musk emerged from a facade built to resemble an actual building, then stepped into an aerodynamically styled two-seater that combined the shape of a Honda CR-Z coupe with the doors from a McLaren supercar. This is the Tesla Cybercab, proving \u003ca href=\"https://insideevs.com/news/733673/tesla-robotaxi-cybercab-spy-shot/\"\u003eearly leaks\u003c/a\u003e right.\u003c/p\u003e\n\u003cp\u003eMusk claimed to have \u0026#34;50 fully autonomous cars here tonight,\u0026#34; eliciting screams and cheers from the crowd of fans when he announced there were no pedals or steering wheel. The billionaire, \u003ca href=\"https://www.wsj.com/politics/policy/elon-musk-political-donations-stephen-miller-desantis-39464294\"\u003ewho has spent the past couple of years funneling millions\u003c/a\u003e of dollars to far-right causes, told the attendees that he didn\u0026#39;t want a dark future like his favorite film \u003cem\u003eBlade Runner\u003c/em\u003e—\u0026#34;except maybe that cool duster,\u0026#34; he said, referring to the jacket of \u003ca href=\"https://futurism.com/the-byte/elon-musk-main-character-blade-runner\"\u003ehis favorite character\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eOver the course of his presentation, Musk made many promises, variations of ones he\u0026#39;s made many times before. \u0026#34;Full self driving\u0026#34; will enter an unsupervised mode that will allow passengers to fall asleep and wake up at their destinations. For people who think the cars are too expensive, they\u0026#39;ll be worth five or 10 times as much because owners only use them an average of 10 hours a week.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg decoding=\"async\" width=\"2560\" height=\"1440\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_75-scaled.jpg\" alt=\"A rendering of a gold Tesla Cybercab parked outside a building\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_75-scaled.jpg 2560w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_75-300x169.jpg 300w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_75-640x360.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_75-768x432.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_75-1536x864.jpg 1536w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_75-2048x1152.jpg 2048w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_75-384x216.jpg 384w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_75-1152x648.jpg 1152w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_75-980x551.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_75-1440x810.jpg 1440w\" sizes=\"(max-width: 2560px) 100vw, 2560px\"/\u003e\n                  \u003c/p\u003e\n                  \u003cfigcaption\u003e\n          \u003cdiv\u003e\n    \n    \u003cp\u003e\n      At a time when there\u0026#39;s already a focus on low-occupancy vehicles on our overcrowded roads, the concept of a $30,000 two-seater Cybercab with the same footprint as a compact crossover that could carry five is a choice. \n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Tesla\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n        \u003c/figcaption\u003e\n            \u003c/figure\u003e\n\n\u003cp\u003eOver time, Musk claimed the operating costs of his Cybercab would be 20 cents per mile, \u0026#34;and yes you\u0026#39;ll be able to buy one,\u0026#34; he told the crowd to excited shrieks. \u0026#34;We expect the cost to be below $30,000,\u0026#34; Musk said, before expounding on a business model where instead of the company owning and operating these allegedly revenue-generating assets itself, they are instead owned by private individuals who each give Tesla its regular cut. This week another four top executives left the company in advance of last night\u0026#39;s event, \u003ca href=\"https://www.businessinsider.com/elon-musk-loses-4-top-executives-ahead-of-robotaxi-event-2024-10#:~:text=Tesla\u0026#39;s%20director%20of%20public%20policy,that%20he\u0026#39;d%20left%20Tesla.\"\u003eincluding\u003c/a\u003e \u0026#34;the global vehicle automation and safety policy lead.\u0026#34;\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003e\u0026#34;It\u0026#39;s going to be a glorious future,\u0026#34; Musk said, albeit not one that applies to families or groups of three or more.\u003c/p\u003e\n\u003cp\u003eMusk claims that Tesla \u0026#34;expects to start\u0026#34; fully unsupervised FSD next year on public roads in California and Texas. A recent analysis by an independent testing firm \u003ca href=\"https://arstechnica.com/cars/2024/09/tesla-full-self-driving-requires-human-intervention-every-13-miles/\"\u003efound the current build requires human intervention\u003c/a\u003e about once every 13 miles, often on roads it has used before.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg decoding=\"async\" width=\"2560\" height=\"1707\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_95-scaled.jpg\" alt=\"A rendering of the two-seat interior of the Tesla Cybercab\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_95-scaled.jpg 2560w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_95-300x200.jpg 300w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_95-640x427.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_95-768x512.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_95-1536x1024.jpg 1536w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_95-2048x1365.jpg 2048w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_95-980x653.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robotaxi_95-1440x960.jpg 1440w\" sizes=\"(max-width: 2560px) 100vw, 2560px\"/\u003e\n                  \u003c/p\u003e\n                  \u003cfigcaption\u003e\n          \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Only being able to carry two occupants is pretty inefficient when a city bus can carry more than 80 passengers.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Tesla\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n        \u003c/figcaption\u003e\n            \u003c/figure\u003e\n\n\u003cp\u003e\u0026#34;Before 2027\u0026#34; should see the Cybercab, which Musk claims will be built in \u0026#34;very high volume.\u0026#34; Tesla-watchers will no doubt remember similar claims about the Model X, Model 3, Model Y, and most recently the Cybertruck, all of which faced \u003ca href=\"https://arstechnica.com/cars/2018/04/experts-say-tesla-has-repeated-car-industry-mistakes-from-the-1980s/\"\u003elengthy delays as the car maker struggled to build them\u003c/a\u003e at scale. Later, Musk treated the audience to a video of an articulated robotic arm with a vacuum cleaner attachment cleaning the two-seat interior of the Cybercab. Whether this will be sold as an aftermarket accessory to Cybercab owners, or if they\u0026#39;re supposed to clean out their robotaxis by hand between trips, remains unclear at this time.\u003c/p\u003e\n\u003cp\u003eMusk also debuted another autonomous concept, the Robovan. It\u0026#39;s a small bus with no visible wheels, but brightly lit interior room for up to 20 occupants. Musk said little about the Robovan and how it figures into Tesla\u0026#39;s future. In 2017 he \u003ca href=\"https://www.wired.com/story/elon-musk-awkward-dislike-mass-transit/\"\u003erevealed his dislike\u003c/a\u003e for public transport, saying \u0026#34;it\u0026#39;s a pain in the ass\u0026#34; and that other passengers could be serial killers.\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eAfter promising that \u0026#34;unsupervised FSD\u0026#34; is coming to all of Tesla\u0026#39;s five models—\u0026#34;now\u0026#39;s not the time for nuance,\u0026#34; Musk told a fan—he showed off a driverless minibus and then a horde of humanoid robots, which apparently leverage the same technology that Tesla says will be ready for autonomous driving with no supervision. These robots—\u0026#34;your own personal R2-D2,\u0026#34; he said—will apparently cost less than \u0026#34;$30,000\u0026#34; \u0026#34;long-term,\u0026#34; Musk claimed, adding that these would be the biggest product of all time, as all 8 billion people on earth would want one, then two, he predicted.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n        \n        \n        \n        \u003cdiv\u003e\n          \n          \n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg decoding=\"async\" width=\"2560\" height=\"1440\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robovan_73-scaled.jpg\" alt=\"A rendering of a Tesla driverless bus.\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robovan_73-scaled.jpg 2560w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robovan_73-300x169.jpg 300w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robovan_73-640x360.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robovan_73-768x432.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robovan_73-1536x864.jpg 1536w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robovan_73-2048x1152.jpg 2048w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robovan_73-384x216.jpg 384w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robovan_73-1152x648.jpg 1152w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robovan_73-980x551.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/Robovan_73-1440x810.jpg 1440w\" sizes=\"(max-width: 2560px) 100vw, 2560px\"/\u003e\n                  \u003c/p\u003e\n                  \u003cfigcaption\u003e\n          \u003cdiv\u003e\n    \n    \u003cp\u003e\n      This is called Robovan.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Tesla\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n        \u003c/figcaption\u003e\n            \u003c/figure\u003e\n\n\u003cp\u003eThe billionaire then chuckled that there might be a 1-in-5 chance the robots would turn bad.\u003c/p\u003e\n\u003ch2\u003eDo you still believe this stuff?\u003c/h2\u003e\n\u003cp\u003eFor true believers who hear Musk talk but have paid little or no attention to Tesla\u0026#39;s actual progress with autonomous driving technology, new car development, production ramping, or robotics, the event will have seemed like something of a success. Clad in a low-collared black leather jacket and looking leaner than he has at times, he spoke confidently, without the audible post-nasal drip that was so evident on many investor calls. \u0026#34;It will be an age of abundance,\u0026#34; he said, which is exactly the kind of message that Tesla investors like hearing, \u003ca href=\"https://arstechnica.com/cars/2024/08/elon-musk-says-tesla-is-an-ai-company-now-heres-how-plausible-that-is/\"\u003enow that the company\u0026#39;s share price is so decoupled\u003c/a\u003e from the \u003ca href=\"https://arstechnica.com/cars/2024/05/chaos-at-tesla-what-analysts-think-about-elon-musks-cuts-and-layoffs/\"\u003eactual business of building and selling cars\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Reading Wall Street analyst reactions to the \u0026#39;We, Robot\u0026#39; event, the consensus that the event was \u0026#39;underwhelming\u0026#39; says more about their expectations than the event itself,\u0026#34; said Ed Niedermeyer, author of \u003cem\u003eLudicrous: The Unvarnished Story of Tesla Motors\u003c/em\u003e. \u0026#34;You can tell it\u0026#39;s unsettling for them watching the fantasy float free of even appearing plausible or real. The fantasy of self-driving Teslas has worked for almost a decade because it felt real, but now just feels like a fantasy. Real things do not happen on movie studio lots. This was a theme park, not an informational event about an emerging technology,\u0026#34; Niedermeyer told Ars.\u003c/p\u003e\n\u003cp\u003eThose who have paid attention to the details—the years of production hell that accompanied each of Tesla\u0026#39;s five models, the repeated claims for a \u0026#34;coast to coast\u0026#34; Autopilot drive \u003ca href=\"https://arstechnica.com/tech-policy/2024/05/tesla-must-face-fraud-suit-for-claiming-its-cars-could-fully-drive-themselves/\"\u003ethat haven\u0026#39;t materialized in eight years\u003c/a\u003e, the regular federal safety investigations and resulting recalls for both Autopilot and FSD (which \u003ca href=\"https://arstechnica.com/cars/2024/08/autonomous-teslas-still-a-pipe-dream-in-boring-company-tunnels/\"\u003estill can\u0026#39;t drive itself\u003c/a\u003e in a one-way tunnel), and so on, there is nothing to suggest this latest chapter—couched cleverly under a \u0026#34;forward-looking statement\u0026#34; disclaimer—will be any different from the ones we\u0026#39;ve already read.\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\n\n                  \n          \u003cdiv\u003e\n  \u003cdiv\u003e\n          \u003cp\u003e\u003ca href=\"https://arstechnica.com/author/jonathan-m-gitlin/\"\u003e\u003cimg src=\"https://arstechnica.com/wp-content/uploads/2020/09/jonathan-300x450.jpg\" alt=\"Photo of Jonathan M. Gitlin\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\n\n  \u003cdiv\u003e\n    \n\n    \u003cp\u003e\n      Jonathan is the Automotive Editor at Ars Technica. He has a BSc and PhD in Pharmacology. In 2014 he decided to indulge his lifelong passion for the car by leaving the National Human Genome Research Institute and launching Ars Technica\u0026#39;s automotive coverage. He lives in Washington, DC.\n    \u003c/p\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\n\n  \n\n\n  \n\n\n  \n              \u003c/div\u003e\n  \u003c/article\u003e\n\n\n\u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/02/getty-laptop-piracy-768x432.jpg\" alt=\"Listing image for first story in Most Read: 5th Circuit rules ISP should have terminated Internet users accused of piracy\" decoding=\"async\" loading=\"lazy\"/\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n\n\n  \n\n  \u003c/main\u003e\n\n\n\n\n\n\n\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-10-11T13:06:09Z",
  "modifiedTime": "2024-10-11T16:12:54Z"
}
