{
  "id": "8e8b0d67-443e-4506-baa0-408a68e5f1b7",
  "title": "Google updates Gmail for iPhone with Material 3 redesign",
  "link": "https://9to5google.com/2025/01/30/gmail-iphone-material-3-redesign/",
  "description": "Compared to Android, only some of Google’s iOS apps use the latest version of Material Design. Gmail for iPhone and iPad was finally updated with a Material 3 redesign today. more…",
  "author": "9to5Google",
  "published": "Fri, 31 Jan 2025 00:48:47 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Abner Li",
  "length": 2167,
  "excerpt": "Gmail for iPhone and iPad was finally updated with a Material 3 redesign today. Compared to Android, only some of Google’s iOS apps...",
  "siteName": "9to5Google",
  "favicon": "https://9to5google.com/wp-content/uploads/sites/4/2017/03/favicon-bg-none-face-white.png?w=192",
  "text": "Compared to Android, only some of Google’s iOS apps use the latest version of Material Design. Gmail for iPhone and iPad was finally updated with a Material 3 redesign today. On the homepage, the search bar is now pill-shaped instead of a rounded rectangle. The bottom bar, if you have the integrated Google Chat and/or Meet experience enabled, notes your current tab with another pill instead of just filling in or highlighting the icon. Blue is used as the accent color throughout the app, with red being mostly retired. Different shades are used depending on light or dark theme. On Android, Material You takes things a step further and creates a “Dynamic Color” theme based on your phone’s wallpaper. That’s applied across first-party apps and OS elements for a visually cohesive experience. No such mechanism is in place on iOS after all these years. It would have been interesting if Google built an Account-level picker for these platforms (or synced it from Android in the case of the web). Old vs. new The “Compose” floating action button (FAB) becomes a rounded rectangle with a pretty vibrant shade of blue when dark mode is enabled. The hamburger menu/navigation drawer does not appear to have been updated today. When opening an email, you’ll notice that the top-right corner overflow icon goes from three vertical dots to horizontal ones placed in a circle. Google Chat for iOS was also recently updated with Material You, though it already leveraged the floating bottom bar. Other Workspace apps like Drive, Docs, Sheets, Slides, and Meet are unchanged today.  Other first-party apps with Material 3 include Google (Search) app, Maps (bottom bar), Photos, Home, Translate, and Gemini.  Version 6.0.250119 of Gmail for iPhone and iPad with this Material 3 redesign rolled out today via the App Store. More on Gmail: Gmail rolls out redesigned Google Calendar card to Android, iOS What are your Gmail for Android pet peeves? Gmail’s Gemini side panels adds Google Calendar integration Add 9to5Google to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2023/12/gmail-android-2.jpg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"800\" src=\"https://9to5google.com/wp-content/uploads/sites/4/2023/12/gmail-android-2.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"\" srcset=\"https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2023/12/gmail-android-2.jpg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2023/12/gmail-android-2.jpg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2023/12/gmail-android-2.jpg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2023/12/gmail-android-2.jpg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/figure\u003e\n\n\u003cp\u003eCompared to Android, only some of Google’s iOS apps use the latest version of Material Design. Gmail for iPhone and iPad was finally updated with a Material 3 redesign today.\u003c/p\u003e\n\n\n\n\u003cp\u003eOn the homepage, the search bar is now pill-shaped instead of a rounded rectangle. The bottom bar, if you have the integrated Google Chat and/or Meet experience enabled, notes your current tab with another pill instead of just filling in or highlighting the icon. \u003c/p\u003e\n\n\n\n\u003cp\u003eBlue is used as the accent color throughout the app, with red being mostly retired. Different shades are used depending on light or dark theme.\u003c/p\u003e\n\n\n\n\u003cp\u003eOn Android, Material You takes things a step further and creates a “Dynamic Color” theme based on your phone’s wallpaper. That’s applied across first-party apps and OS elements for a visually cohesive experience. No such mechanism is in place on iOS after all these years. It would have been interesting if Google built an Account-level picker for these platforms (or synced it from Android in the case of the web).\u003c/p\u003e\t\n\t\n\n\n\n\u003cp\u003e\u003cem\u003eOld vs. new\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003eThe “Compose” floating action button (FAB) becomes a rounded rectangle with a pretty vibrant shade of blue when dark mode is enabled. The hamburger menu/navigation drawer does not appear to have been updated today.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen opening an email, you’ll notice that the top-right corner overflow icon goes from three vertical dots to horizontal ones placed in a circle. \u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003eGoogle Chat for iOS was also recently updated with Material You, though it already leveraged the \u003ca href=\"https://9to5google.com/2024/01/19/google-chat-bar-overflow/\"\u003efloating bottom bar\u003c/a\u003e. Other Workspace apps like Drive, Docs, Sheets, Slides, and Meet are unchanged today. \u003c/p\u003e\n\n\n\n\u003cp\u003eOther first-party apps with Material 3 include Google (Search) app, \u003ca href=\"https://9to5google.com/2024/12/12/google-maps-teal-color/\"\u003eMaps (bottom bar)\u003c/a\u003e, Photos, Home, Translate, and Gemini. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://apps.apple.com/us/app/gmail-email-by-google/id422689480\"\u003eVersion 6.0.250119\u003c/a\u003e of Gmail for iPhone and iPad with this Material 3 redesign rolled out today via the App Store.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-more-on-gmail\"\u003eMore on Gmail:\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://9to5google.com/2025/01/24/gmail-google-calendar-card/\"\u003eGmail rolls out redesigned Google Calendar card to Android, iOS\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5google.com/2025/01/03/gmail-android-pet-peeves/\"\u003eWhat are your Gmail for Android pet peeves?\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5google.com/2024/11/13/gemini-gmail-google-calendar/\"\u003eGmail’s Gemini side panels adds Google Calendar integration\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBwgKMMqA-Qow-c_gAg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Google to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cdiv\u003e\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://bit.ly/4jF54XN\"\u003e\u003cimg src=\"https://9to5google.com/wp-content/uploads/sites/4/2025/01/Banner-2-dbrand-9to5-dbrand-S25U-ghost-banner.png\" alt=\"\" width=\"1024\" height=\"205\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-31T00:47:52Z",
  "modifiedTime": "2025-01-31T00:59:47Z"
}
