{
  "id": "8f552885-6b93-43e4-986a-e40623158f93",
  "title": "Surprise! EU gets Apple Intelligence after all.",
  "link": "https://www.cultofmac.com/news/eu-apple-intelligence-release-date",
  "description": "Apple launched its AI-powered Apple Intelligence features in the EU on Monday, despite warning earlier that it might not. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
  "author": "Ed Hardy",
  "published": "Mon, 28 Oct 2024 19:52:30 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "News",
    "Apple Intelligence"
  ],
  "byline": "Ed Hardy",
  "length": 2320,
  "excerpt": "Apple launched its AI-powered Apple Intelligence features in the EU on Monday, despite warning earlier that it might not.",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "News Apple Intelligence comes to the EU… slowly. Photo: Apple/Cult of Mac Apple launched its AI-powered Apple Intelligence features in the EU on Monday, despite warning earlier that it might not. In the European Union, the rollout began for Macs, while iPhone and iPad users will have to wait. That’s not true elsewhere. But there’s a significant language limitation for all. Apple Intelligence starts EU rollout Apple Intelligence is the highlight of iOS 18, macOS Sequoia and iPadOS 18, even if the artificial intelligence features didn’t actually appear until the major updates introduced on Monday. Americans started looking forward to the new AI features when Apple unveiled them at its developer conference in early summer. But those in the EU did not. Apple said in June that “regulatory uncertainties brought about by the Digital Markets Act” made it think twice before introducing Apple Intelligence in the European Union. Something got readjusted since then, however. The EU version of Monday’s Apple Intelligence announcement shows CEO Tim Cook changed his mind. It says that AI is accessible in the version of macOS Sequoia 15.1 introduced in the EU. And that’s only the start. “In April, Apple Intelligence features will start to roll out to iPhone and iPad users in the EU,” said the Mac-maker. But Cupertino obliquely warned that not all its AI features will be available in the region while also listing the highlights. It said the launch “will include many of the core features of Apple Intelligence, including Writing Tools, Genmoji, a redesigned Siri with richer language understanding, ChatGPT integration, and more.” Temporary language barrier Plus, in the short term, there’s a language limitation. Currently, AI works only with the Siri language set to U.S. English. Not the U.K. version or the Indian one — the version spoken in the United States. But this is temporary. Apple promises that Apple Intelligence will be available in the versions of English spoken in Australia, Canada, Ireland, New Zealand, South Africa, and the U.K. starting in December. And 2025 will bring a much longer list: Chinese, English (India), English (Singapore), French, German, Italian, Japanese, Korean, Portuguese, Spanish, Vietnamese and more.",
  "image": "https://www.cultofmac.com/wp-content/uploads/2024/10/Apple-Intelligence-EU.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-873206\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/news\" title=\"News\" aria-label=\"News articles\"\u003eNews\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"Surprise! EU gets Apple Intelligence after all.\" src=\"https://www.cultofmac.com/wp-content/uploads/2024/10/Apple-Intelligence-EU-1536x864.jpg\" alt=\"Apple Intelligence in the EU\" data-ratio=\"1.7777777777778\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\tApple Intelligence comes to the EU… slowly. \u003cbr/\u003e\u003cem\u003ePhoto: Apple/Cult of Mac\u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003eApple launched its AI-powered Apple Intelligence features in the EU on Monday, despite warning earlier that it might not.\u003c/p\u003e\n\u003cp\u003eIn the European Union, the rollout began for Macs, while iPhone and iPad users will have to wait. That’s not true elsewhere. But there’s a significant language limitation for all.\u003cspan id=\"more-873206\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003eApple Intelligence starts EU rollout\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://www.cultofmac.com/apple-intelligence\" data-lasso-id=\"1641627220\"\u003eApple Intelligence\u003c/a\u003e is the highlight of iOS 18, macOS Sequoia and iPadOS 18, even if the artificial intelligence features didn’t actually appear until \u003ca href=\"https://www.cultofmac.com/news/ios-18-1-macos-sequoia-15-1-release-date-apple-intelligence\" data-lasso-id=\"1641627221\"\u003ethe major updates introduced on Monday\u003c/a\u003e.\u003c/p\u003e\u003cspan data-ez-ph-id=\"909\"\u003e\u003c/span\u003e\n\u003cp\u003eAmericans started looking forward to the new AI features when Apple unveiled them at its developer conference in early summer. But those in the EU did not. Apple said in June that “regulatory uncertainties brought about by the Digital Markets Act” \u003ca href=\"https://www.cultofmac.com/news/apple-intelligence-europe-eu-no-ai-features-over-dma\" data-lasso-id=\"1641627218\"\u003emade it think twice before\u003c/a\u003e introducing Apple Intelligence in the European Union.\u003c/p\u003e\n\u003cp\u003eSomething got readjusted since then, however. The EU version of Monday’s Apple Intelligence announcement shows CEO Tim Cook changed his mind. It says that \u003ca href=\"https://www.apple.com/gn/newsroom/2024/10/apple-intelligence-is-available-today-on-iphone-ipad-and-mac/\" data-lasso-id=\"1641627219\" target=\"_blank\"\u003eAI is accessible in the version of macOS Sequoia 15.1\u003c/a\u003e introduced in the EU. And that’s only the start. “In April, Apple Intelligence features will start to roll out to iPhone and iPad users in the EU,” said the Mac-maker.\u003c/p\u003e\n\u003cp\u003eBut Cupertino obliquely warned that not all its AI features will be available in the region while also listing the highlights. It said the launch “will include many of the core features of Apple Intelligence, including Writing Tools, Genmoji, a redesigned Siri with richer language understanding, ChatGPT integration, and more.”\u003c/p\u003e\n\u003ch2\u003eTemporary language barrier\u003c/h2\u003e\n\u003cp\u003ePlus, in the short term, there’s a language limitation. Currently, AI works only with the Siri language set to U.S. English. Not the U.K. version or the Indian one — the version spoken in the United States.\u003c/p\u003e\n\u003cp\u003eBut this is temporary. Apple promises that Apple Intelligence will be available in the versions of English spoken in Australia, Canada, Ireland, New Zealand, South Africa, and the U.K. starting in December.\u003c/p\u003e\n\u003cp\u003eAnd 2025 will bring a much longer list: Chinese, English (India), English (Singapore), French, German, Italian, Japanese, Korean, Portuguese, Spanish, Vietnamese and more.        \u003c/p\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-28T19:52:30Z",
  "modifiedTime": "2024-10-28T19:57:40Z"
}
