{
  "id": "9b7b09da-4985-40d9-bd7c-47fe8236d0f7",
  "title": "iPhone 17 Slim probably won't have a telephoto camera",
  "link": "https://appleinsider.com/articles/24/11/22/iphone-17-slim-probably-wont-have-a-telephoto-camera?utm_medium=rss",
  "description": "The rumored iPhone 17 Slim won't have a telephoto camera on the back, with a report insisting it will still be a Pro-level feature in 2025.Renders of what the iPhone 17 Slim could look likeThe iPhone 17 Slim is thought to include quite a few impressive features, but it won't be a Pro-grade device. That means it won't be getting a telephoto camera at all.In a report from TheElec about LG Innotek investing 375.9 billion won ($267.4 million) into new camera module facilities, it discusses the target market for the modules. It reveals that the modules will be destined for the iPhone 17 generation, Apple's 2025 smartphone line. Rumor Score: 🤔 Possible Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Malcolm Owen",
  "published": "Fri, 22 Nov 2024 20:21:31 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Malcolm Owen",
  "length": 1940,
  "excerpt": "The rumored iPhone 17 Slim won't have a telephoto camera on the back, with a report insisting it will still be a Pro-level feature in 2025.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Renders of what the iPhone 17 Slim could look like The rumored iPhone 17 Slim won't have a telephoto camera on the back, with a report insisting it will still be a Pro-level feature in 2025. The iPhone 17 Slim is thought to include quite a few impressive features, but it won't be a Pro-grade device. That means it won't be getting a telephoto camera at all. In a report from TheElec about LG Innotek investing 375.9 billion won ($267.4 million) into new camera module facilities, it discusses the target market for the modules. It reveals that the modules will be destined for the iPhone 17 generation, Apple's 2025 smartphone line. The discussion explains that the cameras in the iPhone 17 will have better specifications. However, the folded zoom of the telephoto lens will only be available in the two Pro models, as usual. If this is true, that means the iPhone 17 generation will get a combo of two lenses for the non-Pro versions, consisting of an ultra-wide lens and a standard wide version. As the rumored iPhone 17 Slim, Fold, or Air is believed to be a non-Pro model, it therefore won't get the telephoto camera. This is somewhat to be expected, given the production challenges behind the Fold. With a thickness of just 6mm, it will be a challenge for Apple to include multiple bulky camera modules in the design. Indeed, it is currently speculated that Apple could include just one camera in the model, because of the space limitations. While one camera could be included, users may not necessarily lose out on having two physical lenses. Since it already uses a crop from a high-resolution wide-angle lens to create a 2x zoom, it could reuse the trick with the one camera in the Fold to fake having two cameras. The iPhone 17 Slim is also expected to have an A19 chip, a 6.6-inch display, and a 24-megapixel front camera.",
  "image": "https://photos5.appleinsider.com/gallery/61840-127985-61783-127882-60523-124517-iPhone-17-Slim---11-xl-xl-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-hero\" aria-labelledby=\"hero-cap\" role=\"figure\"\u003e\n                          \u003cp id=\"hero-cap\" title=\"Renders of what the iPhone 17 Slim could look like\"\u003eRenders of what the iPhone 17 Slim could look like\u003c/p\u003e\n                                    \u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61840-127985-61783-127882-60523-124517-iPhone-17-Slim---11-xl-xl-xl.jpg\"\u003e\n              \u003cimg fetchpriority=\"high\" src=\"https://photos5.appleinsider.com/gallery/61840-127985-61783-127882-60523-124517-iPhone-17-Slim---11-xl-xl-xl.jpg\" alt=\"\"/\u003e\n            \u003c/a\u003e\n                      \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cp\u003eThe rumored \u003ca href=\"https://appleinsider.com/inside/iphone-17\" title=\"iPhone 17\" data-kpt=\"1\"\u003eiPhone 17\u003c/a\u003e Slim won\u0026#39;t have a telephoto camera on the back, with a report insisting it will still be a Pro-level feature in 2025. \n\u003c/p\u003e\u003cp\u003eThe iPhone 17 Slim is thought to include quite a few impressive features, but it won\u0026#39;t be a Pro-grade device. That means it won\u0026#39;t be getting a telephoto camera at all. \n\u003c/p\u003e\u003cp\u003eIn a \u003ca href=\"https://www.thelec.kr/news/articleView.html?idxno=31313\"\u003ereport from\u003c/a\u003e \u003cem\u003eTheElec\u003c/em\u003e about LG Innotek investing 375.9 billion won ($267.4 million) into new camera module facilities, it discusses the target market for the modules. It reveals that the modules will be destined for the iPhone 17 generation, Apple\u0026#39;s 2025 smartphone line. \n\u003c/p\u003e\u003cp\u003eThe discussion explains that the cameras in the iPhone 17 will have better specifications. However, the folded zoom of the telephoto lens will only be available in the two Pro models, as usual. \n\u003c/p\u003e\u003cp\u003eIf this is true, that means the iPhone 17 generation will get a combo of two lenses for the non-Pro versions, consisting of an ultra-wide lens and a standard wide version. As the rumored iPhone 17 Slim, Fold, or Air is believed to be a non-Pro model, it therefore won\u0026#39;t get the telephoto camera. \n\u003c/p\u003e\u003cp\u003eThis is somewhat to be expected, given the production challenges behind the Fold. With a thickness of \u003ca href=\"https://appleinsider.com/articles/24/11/18/iphone-17-air-could-be-apples-thinnest-iphone-yet-with-a-thickness-of-just-6mm\"\u003ejust 6mm\u003c/a\u003e, it will be a challenge for Apple to include multiple bulky camera modules in the design. \n\u003c/p\u003e\u003cp\u003eIndeed, it is currently speculated that Apple could include just one camera in the model, because of the space limitations. \n\u003c/p\u003e\u003cp\u003eWhile one camera could be included, users may not necessarily lose out on having two physical lenses. Since it already uses a crop from a high-resolution wide-angle lens to create a 2x zoom, it could reuse the trick with the one camera in the Fold to fake having two cameras. \n\u003c/p\u003e\u003cp\u003eThe iPhone 17 Slim is also expected to have an A19 chip, a \u003ca href=\"https://appleinsider.com/articles/24/10/18/iphone-17-slim-still-rumored-to-have-a-66-inch-display\"\u003e6.6-inch display\u003c/a\u003e, and a 24-megapixel front camera. \u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-22T20:21:31Z",
  "modifiedTime": null
}
