{
  "id": "9d18221c-3478-4fca-bc6e-650a74f2aa4c",
  "title": "YouTuber shows off hardware hack to replace soldered MacBook storage",
  "link": "https://appleinsider.com/articles/24/10/26/youtuber-shows-off-hardware-hack-to-replace-soldered-macbook-storage?utm_medium=rss",
  "description": "A YouTube video shows off a newly-developed technique to replace the soldered-on storage modules on most modern MacBook Pro and other MacBook models — but the upgrade is impractical and costly to do.Video shows replacement of original soldered storage with PCB that uses the M.2 connector.YouTuber iBoff RCC, based in Malaysia, uses the video to show off a custom-made replacement PCB miniboard with an m.2 connector, which is microsoldered in place of the removed original storage modules. A snap-in component, ordered from iBoff, offers replaceable modules featuring storage in quantities of up to 2TB.The difficult part, which iBoff hopes you will let them do rather than trying it yourself, is to desolder the original storage modules and remove them, then microsolder the replacement PCB miniboard into those sockets. This is referenced, but not shown in detail. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Charles Martin",
  "published": "Sat, 26 Oct 2024 19:39:08 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Charles Martin",
  "length": 2458,
  "excerpt": "A YouTube video shows off a newly-developed technique to replace the soldered-on storage modules on most modern MacBook Pro and other MacBook models — but the upgrade is impractical and costly to do.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Video shows replacement of original soldered storage with PCB that uses the M.2 connector. A YouTube video shows off a newly-developed technique to replace the soldered-on storage modules on most modern MacBook Pro and other MacBook models — but the upgrade is impractical and costly to do. YouTuber iBoff RCC, based in Malaysia, uses the video to show off a custom-made replacement PCB miniboard with an m.2 connector, which is microsoldered in place of the removed original storage modules. A snap-in component, ordered from iBoff, offers replaceable modules featuring storage in quantities of up to 2TB. The difficult part, which iBoff hopes you will let them do rather than trying it yourself, is to desolder the original storage modules and remove them, then microsolder the replacement PCB miniboard into those sockets. This is referenced, but not shown in detail. The video also goes over how the MacBook's battery must be disconnected from the logic board before replacing the storage modules, as it supplies some power even when the MacBook is turned off. Subscribe to AppleInsider on YouTubeSubscribe to AppleInsider on YouTubeAnother difficult step once the upgrade has been completed is re-configuring the MacBook model. Users who want to do the repair themselves will need a second Mac handy to use Apple Configurator to restore the upgraded MacBook. Once the upgrade is completed, however, the new storage modules behave identically to the original built-in storage. The company offers replacement NVMe adapters for various models of MacBooks, and even one for an iMac at modest cost, but the adapters do not include the storage modules. It also offers to do the complicated work for customers, if desired, but at considerable cost — around $1,000, according to a commenter on the YouTube video. While the grand total including shipping is likely still less than the cost of a replacement MacBook Pro, the full-service price will vary greatly based on the level of storage upgrade the user wants. In addition to promoting the company, the iBoff upgrader uses the opportunity to argue that Apple could — if it wanted to — offer MacBooks with user-upgradeable storage slots that could be used to upgrade machines once the AppleCare warranty has expired. Such a move could also make it possible for Apple service providers to offer that option.",
  "image": "https://photos5.appleinsider.com/gallery/61539-127134-cropped-Screenshot-2024-10-26-at-114518-AM-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-hero\" aria-labelledby=\"hero-cap\" role=\"figure\"\u003e\n                          \u003cp id=\"hero-cap\" title=\"Video shows replacement of original soldered storage with PCB that uses the M.2 connector.\"\u003eVideo shows replacement of original soldered storage with PCB that uses the M.2 connector.\u003c/p\u003e\n                                    \u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61539-127134-cropped-Screenshot-2024-10-26-at-114518-AM-xl.jpg\"\u003e\n              \u003cimg fetchpriority=\"high\" src=\"https://photos5.appleinsider.com/gallery/61539-127134-cropped-Screenshot-2024-10-26-at-114518-AM-xl.jpg\" alt=\"\"/\u003e\n            \u003c/a\u003e\n                      \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cp\u003eA YouTube video shows off a newly-developed technique to replace the soldered-on storage modules on most modern \u003ca href=\"https://appleinsider.com/inside/macbook-pro\" title=\"MacBook Pro\" data-kpt=\"1\"\u003eMacBook Pro\u003c/a\u003e and other MacBook models —  but the upgrade is impractical and costly to do.\n\u003c/p\u003e\u003cp\u003eYouTuber iBoff RCC, based in Malaysia, \u003ca href=\"https://www.youtube.com/watch?v=E3N-z-Y8cuw\" title=\"Video of storage upgrade hack for any recent MacBook model\"\u003euses the video\u003c/a\u003e to show off a custom-made replacement PCB miniboard with an m.2 connector, which is microsoldered in place of the removed original storage modules. A snap-in component, ordered from iBoff, offers replaceable modules featuring storage in quantities of up to 2TB.\n\u003c/p\u003e\u003cp\u003eThe difficult part, which iBoff hopes you will let them do rather than trying it yourself, is to desolder the original storage modules and remove them, then microsolder the replacement PCB miniboard into those sockets. This is referenced, but not shown in detail.\n\u003c/p\u003e\u003cp\u003eThe video also goes over how the MacBook\u0026#39;s battery must be disconnected from the logic board before replacing the storage modules, as it supplies some power even when the MacBook is turned off.\n\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ciframe src=\"https://www.youtube.com/embed/E3N-z-Y8cuw\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" loading=\"lazy\"\u003e\u003c/iframe\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.youtube.com/c/appleinsider?sub_confirmation=1\"\u003eSubscribe to AppleInsider on YouTube\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.youtube.com/c/appleinsider?sub_confirmation=1\"\u003eSubscribe to AppleInsider on YouTube\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAnother difficult step once the upgrade has been completed is re-configuring the MacBook model. Users who want to do the repair themselves will need a second Mac handy to use Apple Configurator to restore the upgraded MacBook.\n\u003c/p\u003e\u003cp\u003eOnce the upgrade is completed, however, the new storage modules behave identically to the original built-in storage. The company offers replacement NVMe adapters for various models of MacBooks, and even one for an \u003ca href=\"https://appleinsider.com/inside/imac\" title=\"iMac\" data-kpt=\"1\"\u003eiMac\u003c/a\u003e at modest cost, but the adapters do not include the storage modules.\n\u003c/p\u003e\u003cp\u003eIt also offers to do the complicated work for customers, if desired, but at considerable cost —  around $1,000, according to a commenter on the YouTube video. While the grand total including shipping is likely still less than the cost of a replacement MacBook Pro, the full-service price will vary greatly based on the level of storage upgrade the user wants.\n\u003c/p\u003e\u003cp\u003eIn addition to promoting the company, the iBoff upgrader uses the opportunity to argue that Apple could —   if it wanted to —  offer MacBooks with user-upgradeable storage slots that could be used to upgrade machines once the \u003ca href=\"https://appleinsider.com/inside/applecare\" title=\"AppleCare\" data-kpt=\"1\"\u003eAppleCare\u003c/a\u003e warranty has expired. Such a move could also make it possible for Apple service providers to offer that option.\u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-26T19:39:08Z",
  "modifiedTime": null
}
