{
  "id": "b72d6807-a96a-4bf9-af66-c06995d7fba5",
  "title": "Reminders iOS 26 vs iOS 18: Liquid Glass, Apple Intelligence, and new Lists",
  "link": "https://appleinsider.com/inside/ios-26/vs/reminders-ios-26-vs-ios-18-liquid-glass-apple-intelligence-and-new-lists?utm_medium=rss",
  "description": "Reminders in iOS 26 has a few new smart features with Apple Intelligence, and a restrained visual upgrade over iOS 18. Here's how the two versions compare.Reminders iOS 26 vs Reminders iOS 18 - A visual and smart upgradeThe Reminders app isn't really an app that people think about that can do with some improvements. What Apple has at the moment is already a pretty good tool for making lists and following through with them.With the introduction of iOS 26 at WWDC, Apple made quite a few alterations to the app. While the general structure remains untouched, it has refreshed the appearance as well as made it much smarter. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Malcolm Owen",
  "published": "Wed, 02 Jul 2025 20:04:06 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Malcolm Owen",
  "length": 7611,
  "excerpt": "Reminders in iOS 26 has a few new smart features with Apple Intelligence, and a restrained visual upgrade over iOS 18. Here's how the two versions compare.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Reminders in iOS 26 has a few new smart features with Apple Intelligence, and a restrained visual upgrade over iOS 18. Here's how the two versions compare. The Reminders app isn't really an app that people think about that can do with some improvements. What Apple has at the moment is already a pretty good tool for making lists and following through with them. With the introduction of iOS 26 at WWDC, Apple made quite a few alterations to the app. While the general structure remains untouched, it has refreshed the appearance as well as made it much smarter. Reminders iOS 26 vs Reminders iOS 18 - Main screenThe first screen you see in Reminders is the first hint that there are changes at play for the app. The bones of the layout are identical across iOS 26 and iOS 18, with the main sections at the top and My Lists below, complete with items in each. However, just like other first-party apps, Reminders has been hit by Liquid Glass, Apple's new aesthetic for all of its operating systems. The initial manifestation of this is a change from a small, round, colored icon on a white button for the top five sections to the opposite. Instead, the color-coded segments are filled up with color, while the white is reserved for the representative icons, which makes it quite a bit classier. It's almost as if Apple's communicating that you can touch the entire button, whereas the circular icons almost seemed like smaller buttons on a larger white backdrop, though really the entire thing was the button. There's a little bit more whitespace around the My Lists section, which also makes it a little bit easier to tap each list individually. Reminders iOS 26 vs Reminders iOS 18 - The iOS 18 [left] interface has been tweaked for iOS 26 [right]In iOS 18, the interface included a dots icon in the top right to edit the lists and to load from a template. At the bottom were options to create a new reminder or to add a new list, while a search bar appeared if you pulled down. The iOS 26 approach changes things up, so that a Liquid Glass lozenge in the top right has icons for search as well as to create a new list, and the edit lists/templates button. At the bottom is a single blue button with a plus symbol, which is to create a new reminder. While this is fairly neat in iOS 26, it's less intuitive than before, especially since Apple has switched away from text to ambiguous buttons for new lists and new reminders. Reminders iOS 26 vs Reminders iOS 18 - Reminders and New ListsSetting up a new reminder has changed quite a bit. Most of it is in a restructuring of what is asked of the user to generate the reminder. In iOS 18, tapping New Reminder has boxes for Title and Notes, an option to select the list, and Details. The last one brings up toggles for Date, Time, Location, When Messaging, and Flag, with extra options for Tags, Priority, a URL, and an image that could be added. The iOS 26 update lets you enter in a bit more information than before, with top boxes including Title, Notes, and URL. Toggles are also immediately presented for Date and Time, then a setting for the list itself. Reminders iOS 26 vs Reminders iOS 18 - You can add more data upfront in iOS 26's version. A Details link is also available for the other items, including adding tags, flagging the item, setting priority, then Location and When Messaging for when to remind the user, and adding images. Apple hasn't changed the information requested here, nor the options. But, much like other changes in iOS 26, it's a refinement that lets users add a lot more without necessarily needing to take the extra step to go into Details. In stark contrast is New List, which is the way you add a new list to the collection. While Apple has refined the structure of making a new reminder, the list generation screen remains practically untouched. Even when it's a smart list rather than a standard one, everything in iOS 26 is identical to what's shown in iOS 18, with a little added Liquid Glass spit and polish. Reminders iOS 26 vs Reminders iOS 18 - The method to add a new list is surprisingly untouched. The only differences are a hint of Liquid Glass and the change from \"Done and Cancel\" at the top to a tick and a cross. There are no real changes here. Sometimes, no changes are needed if the function works good enough. Reminders iOS 26 vs Reminders iOS 18 - List views and Apple IntelligenceOpening one of your lists comes up with the usual view of items, which you can quickly add to or tick to say they are done. It's quite similar across iOS 18 and iOS 26, which is to be expected for a list app. The first obvious change is that iOS 18 has a \"New Reminder\" text at the bottom, making it obvious where to tap to add something new. In iOS 26, it's the equally understandable Plus icon in the bottom right. Reminders iOS 26 vs Reminders iOS 18 - Viewing lists and the options for each version are pretty similar, with minor exceptionsIcons in the top right open up the share sheet, as well as more options for the list. Both operating system versions have the same broad list of options, such as to show completed tasks, to select and rearrange reminders, to adjust the list information, to add sections, and to view as columns. In the case of iOS 26, there's the option to \"Auto-Categorize,\" complete with an Apple Intelligence logo. If selected, it will analyze the list and put all of the items into sensible categories. For example, a shopping list could have sections for Dairy, Cleaning Supplies, and Fruits. You can create sections manually, but this seems to be quite robust and makes sensible categories where possible. Reminders iOS 26 vs Reminders iOS 18 - Auto-Categorize in action in iOS 26If you don't like what Apple Intelligence selects for the categories, you can always disable them all with a few taps, return to a full-list view, or make them yourself. This addition is quite helpful, but is especially so for lengthy lists of items or tasks that can be easily categorizable. Not everyone wants to manually sort out a list of 50 shopping list items by category, especially when there's a button that can do it for you. Of course, with Apple Intelligence being a major part of iOS now, it can do more in Reminders. Apple says that Apple Intelligence will be able to suggest tasks to add to lists, grocery items to shopping lists, and other follow-up tasks. It will do so by detecting potential items based on emails and other readable text on the iPhone. This could be handy if you use task lists regularly in your life, or if you feel you really need to, since Apple Intelligence will be nudging you to use Reminders more often. Reminders iOS 26 vs Reminders iOS 18 - Smarter changesThe Reminders app was in a good place in iOS 18, in terms of how it looked and what it could do. As an app for keeping lists and reminding users, it was an excellent app that competed strongly with third-party rivals. Apple's revisions in iOS 26 keep the heart and the vast majority of the app intact. Anyone who uses Reminders in iOS 18 will be immediately at home in iOS 26 and quickly get what they need done. While Apple has made tweaks to make it more productivity-friendly, the inclusion of Apple Intelligence is a big one. Especially since it doesn't overwhelm or replace any features, but adds to the overall experience. From the simple automatic categorization of list items to suggesting additions, these are fairly obvious areas where Apple Intelligence can help out. The real question is to ask where Apple Intelligence can be even more assistive with the app.",
  "image": "https://photos5.appleinsider.com/gallery/64227-133784-remindersios1826header-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eReminders in \u003ca href=\"https://appleinsider.com/inside/ios-26\" title=\"iOS 26\" data-kpt=\"1\"\u003eiOS 26\u003c/a\u003e has a few new smart features with Apple Intelligence, and a restrained visual upgrade over iOS 18. Here\u0026#39;s how the two versions compare.\n\u003c/p\u003e\u003cp\u003eThe Reminders app isn\u0026#39;t really an app that people think about that can do with some improvements. What Apple has at the moment is already a pretty good tool for making lists and following through with them. \n\u003c/p\u003e\u003cp\u003eWith the introduction of iOS 26 at \u003ca href=\"https://appleinsider.com/inside/wwdc\" title=\"WWDC\" data-kpt=\"1\"\u003eWWDC\u003c/a\u003e, Apple made quite a few alterations to the app. While the general structure remains untouched, it has refreshed the appearance as well as made it much smarter. \n\u003c/p\u003e\u003ch2 data-anchor=\"reminders-ios-26-vs-reminders-ios-18--main-screen\" id=\"reminders-ios-26-vs-reminders-ios-18--main-screen\"\u003eReminders iOS 26 vs Reminders iOS 18 - Main screen\u003c/h2\u003e\u003cp\u003eThe first screen you see in Reminders is the first hint that there are changes at play for the app. The bones of the layout are identical across iOS 26 and \u003ca href=\"https://appleinsider.com/inside/ios-18\" title=\"iOS 18\" data-kpt=\"1\"\u003eiOS 18\u003c/a\u003e, with the main sections at the top and My Lists below, complete with items in each. \n\u003c/p\u003e\u003cp\u003eHowever, just like other first-party apps, Reminders has been hit by Liquid Glass, Apple\u0026#39;s new aesthetic for all of its operating systems. \n\u003c/p\u003e\u003cp\u003eThe initial manifestation of this is a change from a small, round, colored icon on a white button for the top five sections to the opposite. Instead, the color-coded segments are filled up with color, while the white is reserved for the representative icons, which makes it quite a bit classier. \n\u003c/p\u003e\u003cp\u003eIt\u0026#39;s almost as if Apple\u0026#39;s communicating that you can touch the entire button, whereas the circular icons almost seemed like smaller buttons on a larger white backdrop, though really the entire thing was the button. \n\u003c/p\u003e\u003cp\u003eThere\u0026#39;s a little bit more whitespace around the My Lists section, which also makes it a little bit easier to tap each list individually. \n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/64227-133785-remindersios2618-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/64227-133785-remindersios2618-xl.jpg\" alt=\"Two smartphone screens display a task management app, showing lists, tasks for today, scheduled tasks, flagged items, and completed tasks with colorful icons and numbers.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eReminders iOS 26 vs Reminders iOS 18 - The iOS 18 [left] interface has been tweaked for iOS 26 [right]\u003c/span\u003e\u003c/p\u003e\u003cp\u003eIn iOS 18, the interface included a dots icon in the top right to edit the lists and to load from a \u003ca href=\"https://appleinsider.com/articles/23/07/26/how-to-use-templates-in-reminders-in-ios-16-and-ios-17\"\u003etemplate\u003c/a\u003e. At the bottom were options to create a new reminder or to add a new list, while a search bar appeared if you pulled down. \n\u003c/p\u003e\u003cp\u003eThe iOS 26 approach changes things up, so that a Liquid Glass lozenge in the top right has icons for search as well as to create a new list, and the edit lists/templates button. At the bottom is a single blue button with a plus symbol, which is to create a new reminder. \n\u003c/p\u003e\u003cp\u003eWhile this is fairly neat in iOS 26, it\u0026#39;s less intuitive than before, especially since Apple has switched away from text to ambiguous buttons for new lists and new reminders. \n\u003c/p\u003e\u003ch2 data-anchor=\"reminders-ios-26-vs-reminders-ios-18--reminders-and-new-lists\" id=\"reminders-ios-26-vs-reminders-ios-18--reminders-and-new-lists\"\u003eReminders iOS 26 vs Reminders iOS 18 - Reminders and New Lists\u003c/h2\u003e\u003cp\u003eSetting up a new reminder has changed quite a bit. Most of it is in a restructuring of what is asked of the user to generate the reminder. \n\u003c/p\u003e\u003cp\u003eIn iOS 18, tapping New Reminder has boxes for Title and Notes, an option to select the list, and Details. The last one brings up toggles for Date, Time, Location, When Messaging, and Flag, with extra options for \u003ca href=\"https://appleinsider.com/articles/21/08/02/how-to-use-tags-in-reminders-ios-15\"\u003eTags\u003c/a\u003e, Priority, a URL, and an image that could be added. \n\u003c/p\u003e\u003cp\u003eThe iOS 26 update lets you enter in a bit more information than before, with top boxes including Title, Notes, and URL. Toggles are also immediately presented for Date and Time, then a setting for the list itself. \n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/64227-133787-newreminder-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/64227-133787-newreminder-xl.jpg\" alt=\"Two smartphone screens showing \u0026#39;New Reminder\u0026#39; interfaces; left screen lists \u0026#39;Find holy grail,\u0026#39; and right screen has \u0026#39;Buy melting candles,\u0026#39; with options for date and time.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eReminders iOS 26 vs Reminders iOS 18 - You can add more data upfront in iOS 26\u0026#39;s version. \u003c/span\u003e\u003c/p\u003e\u003cp\u003eA Details link is also available for the other items, including adding tags, flagging the item, setting priority, then Location and When Messaging for when to remind the user, and adding images. \n\u003c/p\u003e\u003cp\u003eApple hasn\u0026#39;t changed the information requested here, nor the options. But, much like other changes in iOS 26, it\u0026#39;s a refinement that lets users add a lot more without necessarily needing to take the extra step to go into Details. \n\u003c/p\u003e\u003cp\u003eIn stark contrast is New List, which is the way you add a new list to the collection. While Apple has refined the structure of making a new reminder, the list generation screen remains practically untouched. \n\u003c/p\u003e\u003cp\u003eEven when it\u0026#39;s a smart list rather than a standard one, everything in iOS 26 is identical to what\u0026#39;s shown in iOS 18, with a little added Liquid Glass spit and polish. \n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/64227-133786-newlistreminders-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/64227-133786-newlistreminders-xl.jpg\" alt=\"Two smartphone screens display a new list creation interface, showing color options, list type selection, and a keyboard for input.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eReminders iOS 26 vs Reminders iOS 18 - The method to add a new list is surprisingly untouched. \u003c/span\u003e\u003c/p\u003e\u003cp\u003eThe only differences are a hint of Liquid Glass and the change from \u0026#34;Done and Cancel\u0026#34; at the top to a tick and a cross. There are no real changes here. \n\u003c/p\u003e\u003cp\u003eSometimes, no changes are needed if the function works good enough. \n\u003c/p\u003e\u003ch2 data-anchor=\"reminders-ios-26-vs-reminders-ios-18--list-views-and-apple-intelligence\" id=\"reminders-ios-26-vs-reminders-ios-18--list-views-and-apple-intelligence\"\u003eReminders iOS 26 vs Reminders iOS 18 - List views and Apple Intelligence\u003c/h2\u003e\u003cp\u003eOpening one of your lists comes up with the usual view of items, which you can quickly add to or tick to say they are done. It\u0026#39;s quite similar across iOS 18 and iOS 26, which is to be expected for a list app. \n\u003c/p\u003e\u003cp\u003eThe first obvious change is that iOS 18 has a \u0026#34;New Reminder\u0026#34; text at the bottom, making it obvious where to tap to add something new. In iOS 26, it\u0026#39;s the equally understandable Plus icon in the bottom right. \n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/64227-133788-reminderslists1-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/64227-133788-reminderslists1-xl.jpg\" alt=\"Two smartphone screens display a shopping list, featuring items and an options menu with actions such as sorting, adding sections, and deleting the list.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eReminders iOS 26 vs Reminders iOS 18 - Viewing lists and the options for each version are pretty similar, with minor exceptions\u003c/span\u003e\u003c/p\u003e\u003cp\u003eIcons in the top right open up the share sheet, as well as more options for the list. Both operating system versions have the same broad list of options, such as to show completed tasks, to select and rearrange reminders, to adjust the list information, to add sections, and to view as columns. \n\u003c/p\u003e\u003cp\u003eIn the case of iOS 26, there\u0026#39;s the option to \u0026#34;Auto-Categorize,\u0026#34; complete with an \u003ca href=\"https://appleinsider.com/inside/apple-intelligence\" title=\"Apple Intelligence\" data-kpt=\"1\"\u003eApple Intelligence\u003c/a\u003e logo. If selected, it will analyze the list and put all of the items into sensible categories. \n\u003c/p\u003e\u003cp\u003eFor example, a shopping list could have sections for Dairy, Cleaning Supplies, and Fruits. You can create sections manually, but this seems to be quite robust and makes sensible categories where possible. \n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/64227-133789-autocategorizeinaction-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/64227-133789-autocategorizeinaction-xl.jpg\" alt=\"Two smartphone screens display a shopping list app with categories like dairy, drinks, and fruits. Items include milk, cheese, eggs, drink cans, and various fruits.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eReminders iOS 26 vs Reminders iOS 18 - Auto-Categorize in action in iOS 26\u003c/span\u003e\u003c/p\u003e\u003cp\u003eIf you don\u0026#39;t like what Apple Intelligence selects for the categories, you can always disable them all with a few taps, return to a full-list view, or make them yourself. \n\u003c/p\u003e\u003cp\u003eThis addition is quite helpful, but is especially so for lengthy lists of items or tasks that can be easily categorizable. Not everyone wants to manually sort out a list of 50 shopping list items by category, especially when there\u0026#39;s a button that can do it for you. \n\u003c/p\u003e\u003cp\u003eOf course, with Apple Intelligence being a major part of iOS now, it can do more in Reminders. \n\u003c/p\u003e\u003cp\u003eApple says that Apple Intelligence will be able to suggest tasks to add to lists, grocery items to shopping lists, and other follow-up tasks. It will do so by detecting potential items based on emails and other readable text on the \u003ca href=\"https://appleinsider.com/inside/iphone\" title=\"iPhone\" data-kpt=\"1\"\u003eiPhone\u003c/a\u003e. \n\u003c/p\u003e\u003cp\u003eThis could be handy if you use task lists regularly in your life, or if you feel you really need to, since Apple Intelligence will be nudging you to use Reminders more often. \n\u003c/p\u003e\u003ch2 data-anchor=\"reminders-ios-26-vs-reminders-ios-18--smarter-changes\" id=\"reminders-ios-26-vs-reminders-ios-18--smarter-changes\"\u003eReminders iOS 26 vs Reminders iOS 18 - Smarter changes\u003c/h2\u003e\u003cp\u003eThe Reminders app was in a good place in iOS 18, in terms of how it looked and what it could do. As an app for keeping lists and reminding users, it was an excellent app that competed strongly with third-party rivals. \n\u003c/p\u003e\u003cp\u003eApple\u0026#39;s revisions in iOS 26 keep the heart and the vast majority of the app intact. Anyone who uses Reminders in iOS 18 will be immediately at home in iOS 26 and quickly get what they need done. \n\u003c/p\u003e\u003cp\u003eWhile Apple has made tweaks to make it more productivity-friendly, the inclusion of Apple Intelligence is a big one. Especially since it doesn\u0026#39;t overwhelm or replace any features, but adds to the overall experience. \n\u003c/p\u003e\u003cp\u003eFrom the simple automatic categorization of list items to suggesting additions, these are fairly obvious areas where Apple Intelligence can help out. \n\u003c/p\u003e\u003cp\u003eThe real question is to ask where Apple Intelligence can be even more assistive with the app. \u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-07-02T20:04:06Z",
  "modifiedTime": null
}
