{
  "id": "be834f9f-33bb-4e82-afbb-0eca5086aff8",
  "title": "Shape-changing Apple Pencil would work like a paintbrush",
  "link": "https://www.cultofmac.com/news/apple-pencil-paintbrush",
  "description": "Learn about an innovative Apple Pencil paintbrush concept that adjusts shape and stiffness for a more authentic digital painting experience. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
  "author": "Ed Hardy",
  "published": "Fri, 04 Apr 2025 19:35:35 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "News",
    "Apple Pencil",
    "iPad",
    "patents"
  ],
  "byline": "Ed Hardy",
  "length": 2725,
  "excerpt": "Learn about an innovative Apple Pencil paintbrush concept that adjusts shape and stiffness for a more authentic digital painting experience.",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "News What if an Apple Pencil was a paintbrush instead? AI concept: ChatGPT Apple engineers exploring ways to improve the Apple Pencil got a patent for a stylus tip that can change its shape or stiffness. The goal might be to make a paintbrush for an iPad so digital painting feels more like the real thing. It’s a concept the company has looked into for years. Patent explores the future of Apple Pencil Many artists use an Apple Pencil to sketch and draw on an iPad. The stylus offers pressure sensitivity, like a regular pen, to make digital drawing closer to the real thing. But it’s still writing with a thin tip on a hard surface, which feels significantly different from using many other writing implements. Apple engineers appear to be working on the problem. On Thursday, they were awarded a patent entitled “Stylus With Adjustable Features.” In the stilted language traditional for patent filings, the description says, “An input device, such as a stylus, can include adjustment capabilities that changes a size, shape, stiffness, or other characteristics of a portion of the stylus, such as the tip. The size, shape, stiffness, or other characteristics of a tip of the stylus can be altered to mimic characteristics of a particular writing or drawing tool.“ The stated goal is an Apple Pencil that can mimic a range of traditional artists’ tools, including a pen, pencil, chalk and marker. An Apple Pencil as paintbrush, too? The engineers went all the way to thinking about making an Apple Pencil into an Apple Paintbrush. It’s possible to paint with a stylus, too, but that doesn’t mimic the real-world experience at all. A slim, rigid tip feels very little like a wide, flexible paintbrush. But the patent filing specifically mentions making the iPad stylus mimic a paintbrush. They refer to the device being able to take on multiple bristles. And the filing also includes drawings suggesting something of what an Apple Paintbrush might look like. This is what the Apple engineeers envision for a possible Apple Paintbrush.Patent illustrations: Apple This is a product area in which Apple engineers have been working for most of the last decade. Back in 2019, the company got a patent for a “Stylus with multiple inputs” describing a stylus with flexible contact members. In other words, bristles like a paintbrush. How a stylus can be made into a paintbrush isn’t clear. Perhaps an add-on attachment to an future Apple Pencil? All that said, just because Apple is exploring a digital paintbrush doesn’t automatically indicate that it will ever become an actual device. Companies regularly patent ideas that never turn into shipping products.",
  "image": "https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush.jpg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-895744\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/news\" title=\"News\" aria-label=\"News articles\"\u003eNews\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"Shape-changing Apple Pencil would work like a paintbrush\" src=\"https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-1020x680.jpg.webp\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-768x512.jpg.webp 768w, https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-1440x960.jpg.webp 1440w, https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-1020x680.jpg.webp 1020w, https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush.jpg.webp 2040w\" sizes=\"(max-width: 768px) 768px, (max-width: 1020px) 1020px, 2040px\" alt=\"Apple Pencil as paintbrush\" data-ratio=\"1.5\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\tWhat if an Apple Pencil was a paintbrush instead? \u003cbr/\u003e\u003cem\u003eAI concept: ChatGPT\u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003eApple engineers exploring ways to improve the Apple Pencil got a patent for a stylus tip that can change its shape or stiffness. The goal might be to make a paintbrush for an iPad so digital painting feels more like the real thing.\u003c/p\u003e\n\u003cp\u003eIt’s a concept the company has looked into for years.\u003cspan id=\"more-895744\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003ePatent explores the future of Apple Pencil\u003c/h2\u003e\n\u003cp\u003eMany artists use an \u003ca href=\"https://www.cultofmac.com/apple-pencil\" data-lasso-id=\"1641734372\"\u003eApple Pencil\u003c/a\u003e to sketch and draw on an iPad. The stylus offers pressure sensitivity, like a regular pen, to make digital drawing closer to the real thing. But it’s still writing with a thin tip on a hard surface, which feels significantly different from using many other writing implements.\u003c/p\u003e\n\u003cp\u003eApple engineers appear to be working on the problem. On Thursday, they were awarded a patent entitled “\u003ca href=\"https://image-ppubs.uspto.gov/dirsearch-public/print/downloadPdf/20250110588\" data-lasso-id=\"1641734373\" target=\"_blank\"\u003eStylus With Adjustable Features\u003c/a\u003e.”\u003c/p\u003e\n\u003cp\u003eIn the stilted language traditional for patent filings, the description says, “An input device, such as a stylus, can include adjustment capabilities that changes a size, shape, stiffness, or other characteristics of a portion of the stylus, such as the tip. The size, shape, stiffness, or other characteristics of a tip of the stylus can be altered to mimic characteristics of a particular writing or drawing tool.“\u003c/p\u003e\n\u003cp\u003eThe stated goal is an Apple Pencil that can mimic a range of traditional artists’ tools, including a pen, pencil, chalk and marker.\u003c/p\u003e\n\u003ch3\u003eAn Apple Pencil as paintbrush, too?\u003c/h3\u003e\n\u003cp\u003eThe engineers went all the way to thinking about making an Apple Pencil into an Apple Paintbrush. It’s possible to paint with a stylus, too, but that doesn’t mimic the real-world experience at all. A slim, rigid tip feels very little like a wide, flexible paintbrush.\u003c/p\u003e\n\u003cp\u003eBut the patent filing specifically mentions making the iPad stylus mimic a paintbrush. They refer to the device being able to take on multiple bristles. And the filing also includes drawings suggesting something of what an Apple Paintbrush might look like.\u003c/p\u003e\n\u003cfigure id=\"29\" aria-labelledby=\"figcaption_29\"\u003e\u003ca href=\"https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-b.jpg\" data-lasso-id=\"1641734374\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" title=\"Technical drawing of Apple Pencil as paintbrush\" src=\"https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-b-1440x810.jpg\" alt=\"Technical drawing of Apple Pencil as paintbrush\" width=\"780\" height=\"439\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-b-1440x810.jpg.webp 1440w, https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-b-400x225.jpg 400w, https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-b-768x432@2x.jpg.webp 1536w, https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-b-350x197.jpg 350w, https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-b-768x432.jpg.webp 768w, https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-b-1020x573.jpg.webp 1020w, https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-b.jpg.webp 1560w, https://www.cultofmac.com/wp-content/uploads/2025/04/Apple-Pencil-paintbrush-b-400x225@2x.jpg 800w\" sizes=\"(max-width: 780px) 100vw, 780px\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"figcaption_29\"\u003eThis is what the Apple engineeers envision for a possible Apple Paintbrush.\u003cbr/\u003e\u003cspan\u003ePatent illustrations: Apple\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eThis is a product area in which Apple engineers have been working for most of the last decade. Back in 2019, the company got a patent for a “Stylus with multiple inputs” describing \u003ca href=\"https://www.cultofmac.com/news/apple-paintbrush-pencil-patent\" data-lasso-id=\"1641734375\"\u003ea stylus with flexible contact members\u003c/a\u003e. In other words, bristles like a paintbrush.\u003c/p\u003e\n\u003cp\u003eHow a stylus can be made into a paintbrush isn’t clear. Perhaps an add-on attachment to an future Apple Pencil?\u003c/p\u003e\n\u003cp\u003eAll that said, just because Apple is exploring a digital paintbrush doesn’t automatically indicate that it will ever become an actual device. Companies regularly patent ideas that never turn into shipping products.        \u003c/p\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-04T19:35:35Z",
  "modifiedTime": "2025-04-04T19:45:10Z"
}
