{
  "id": "bf76037c-8175-43fb-9101-35d0a7520fe6",
  "title": "Developers and Platforms React as App Store Rules Change in the U.S.",
  "link": "https://www.macstories.net/news/developers-and-platforms-react-as-app-store-rules-change-in-the-u-s/",
  "description": "On Wednesday evening, Judge Yvonne Gonzalez Rodgers held Apple in contempt, ordering, among other things, that it immediately drop the 27% fee it was charging developers who linked users to the web for purchases. As the judge put it: This is an injunction, not a negotiation. There are no do-overs once a party willfully disregards […]",
  "author": "John Voorhees",
  "published": "Fri, 02 May 2025 11:59:49 +0000",
  "source": "https://www.macstories.net/feed",
  "categories": [
    "news",
    "App Review",
    "app store",
    "Epic Games",
    "iOS",
    "litigation",
    "spotify"
  ],
  "byline": "John Voorhees",
  "length": 5275,
  "excerpt": "On Wednesday evening, Judge Yvonne Gonzalez Rodgers held Apple in contempt, ordering, among other things, that it immediately drop the 27% fee it was charging developers who linked users to the web for purchases. As the judge put it: This is an injunction, not a negotiation. There are no do-overs once a party willfully disregards",
  "siteName": "",
  "favicon": "https://www.macstories.net/app/themes/macstories4/images/apple-touch-icon-152x152-precomposed.png",
  "text": "On Wednesday evening, Judge Yvonne Gonzalez Rodgers held Apple in contempt, ordering, among other things, that it immediately drop the 27% fee it was charging developers who linked users to the web for purchases. As the judge put it: This is an injunction, not a negotiation. There are no do-overs once a party willfully disregards a court order. Time is of the essence. The Court will not tolerate further delays. (Contempt Order at pg. 3). As Chance Miller reported at 9to5Mac, those changes are already reflected in Apple’s App Review Guidelines. In an email sent to anyone with a developer account, Apple explained: The App Review Guidelines have been updated for compliance with a United States court decision regarding buttons, external links, and other calls to action in apps. These changes affect apps distributed on the United States storefront of the App Store, and are as follows: 3.1.1: Apps on the United States storefront are not prohibited from including buttons, external links, or other calls to action when allowing users to browse NFT collections owned by others. 3.1.1(a): On the United States storefront, there is no prohibition on an app including buttons, external links, or other calls to action, and no entitlement is required to do so. 3.1.3: The prohibition on encouraging users to use a purchasing method other than in-app purchase does not apply on the United States storefront. 3.1.3(a): The External Link Account entitlement is not required for apps on the United States storefront to include buttons, external links, or other calls to action. (Source: Apple email to developers on May 1, 2025). Notably, the changes affect only the U.S. App Store, further fragmenting App Store rules along geopolitical boundaries which began with regulations in China, South Korea, Japan, the Netherlands, and the EU. Probably the best evidence that Apple’s former rules were restraining competition is the flurry of additional news since Judge Gonzalez Rodgers’ ruling: As I predicted in my story, Patreon has said it will submit an update to its app to allow creators to accept payments outside its iOS app, something that was possible until last summer when Patreon was forced to retrofit its app to account for Apple’s In-App Purchases and payments through its website in what was an inelegant solution that forced creators to either charge more on iOS or absorb Apple’s fees on what are often small monthly payments to begin with. Spotify posted on its blog that it has already submitted an update to its app that will let users see how much a Spotify subscription costs from inside the app and link out to Spotify’s website to upgrade or change their subscription plans. Payment processor Stripe whipped up documentation guiding developers through the process of setting up subscription and digital goods sales outside their apps. Beginning in June, the Epic Games Store will handle payment processing for developers at no cost up to the developers’ first $1 million of revenue. After $1 million of revenue the split will be the existing 88% to developers and 12% to Epic Games. In June, Epic Games will also offer developers the ability to set up their own webshops for ‘out-of-app purchases.’ The webshops will be available to iOS developers in the U.S. and EU and users making purchases in them will get 5% back in Epic Rewards for their purchases. Epic Games has not said how much it will charge developers who set up a webshop. These moves by big players aren’t surprising, and I’m sure we’ll see more companies explore ways to take advantage of Wednesday’s ruling. Over time, though, the more interesting consequence of Wednesday’s ruling will be whether and how it changes the business models of indie developers and other small businesses that offer apps. Access Extra Content and PerksFounded in 2015, Club MacStories has delivered exclusive content every week for nearly a decade. What started with weekly and monthly email newsletters has blossomed into a family of memberships designed every MacStories fan. Learn more here and from our Club FAQs. Club MacStories: Weekly and monthly newsletters via email and the web that are brimming with apps, tips, automation workflows, longform writing, early access to the MacStories Unwind podcast, periodic giveaways, and more; Club MacStories+: Everything that Club MacStories offers, plus an active Discord community, advanced search and custom RSS features for exploring the Club’s entire back catalog, bonus columns, and dozens of app discounts; Club Premier: All of the above and AppStories+, an extended version of our flagship podcast that’s delivered early, ad-free, and in high-bitrate audio. John is MacStories’ Managing Editor, has been writing about Apple and apps since joining the team in 2015, and today, runs the site alongside Federico. John also co-hosts four MacStories podcasts: AppStories, which covers the world of apps, MacStories Unwind, which explores the fun differences between American and Italian culture and recommends media to listeners, Ruminate, a show about the weird web and unusual snacks, and NPC: Next Portable Console, a show about the games we take with us.",
  "image": "https://56243e3f6f46fe44a301-deabeb5f3878e3553d0b065ea974f9bf.ssl.cf1.rackcdn.com/256px.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"content\"\u003e\n\n    \n\n    \u003cdiv\u003e\n                        \u003cp id=\"p1\"\u003eOn Wednesday evening, Judge Yvonne Gonzalez Rodgers \u003ca href=\"https://www.macstories.net/stories/a-breach-of-trust-apple-held-in-contempt-over-app-store-rules/\" rel=\"noopener noreferrer\"\u003eheld Apple in contempt\u003c/a\u003e, ordering, among other things, that it immediately drop the 27% fee it was charging developers who linked users to the web for purchases. \u003ca href=\"https://www.documentcloud.org/documents/25924283-epic-v-apple-contempt-order/\" rel=\"noopener noreferrer\"\u003eAs the judge put it\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote id=\"blockquote2\"\u003e\u003cp\u003e\n  This is an injunction, not a negotiation. There are no do-overs once a party willfully disregards a court order. Time is of the essence. The Court will not tolerate further delays.\n\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp id=\"p3\"\u003e(Contempt Order at pg. 3).\u003c/p\u003e\n\u003cp id=\"p4\"\u003e\u003ca href=\"https://9to5mac.com/2025/05/01/apple-app-store-guidelines-external-links/\" rel=\"noopener noreferrer\"\u003eAs Chance Miller reported at 9to5Mac\u003c/a\u003e, those changes are already reflected in Apple’s \u003ca href=\"https://developer.apple.com/app-store/review/guidelines/\" rel=\"noopener noreferrer\"\u003eApp Review Guidelines\u003c/a\u003e. In an email sent to anyone with a developer account, Apple explained:\u003c/p\u003e\n\u003cblockquote id=\"blockquote5\"\u003e\u003cp\u003e\n  The App Review Guidelines have been updated for compliance with a United States court decision regarding buttons, external links, and other calls to action in apps. These changes affect apps distributed on the United States storefront of the App Store, and are as follows:\u003c/p\u003e\n\u003cul\u003e\u003cli\u003e3.1.1: Apps on the United States storefront are not prohibited from including buttons, external links, or other calls to action when allowing users to browse NFT collections owned by others.\u003c/li\u003e\n\u003cli\u003e3.1.1(a): On the United States storefront, there is no prohibition on an app including buttons, external links, or other calls to action, and no entitlement is required to do so.\u003c/li\u003e\n\u003cli\u003e3.1.3: The prohibition on encouraging users to use a purchasing method other than in-app purchase does not apply on the United States storefront.\u003c/li\u003e\n\u003cli\u003e3.1.3(a): The External Link Account entitlement is not required for apps on the United States storefront to include buttons, external links, or other calls to action.\u003c/li\u003e\n\u003c/ul\u003e\u003c/blockquote\u003e\n\u003cp id=\"p6\"\u003e(Source: Apple email to developers on May 1, 2025).\u003c/p\u003e\n\u003cp id=\"p7\"\u003eNotably, the changes affect only the U.S. App Store, further fragmenting App Store rules along geopolitical boundaries which began with regulations in China, South Korea, Japan, the Netherlands, and the EU.\u003c/p\u003e\n\u003cp id=\"p8\"\u003eProbably the best evidence that Apple’s former rules were restraining competition is the flurry of additional news since Judge Gonzalez Rodgers’ ruling:\u003c/p\u003e\n\u003cul id=\"ul9\"\u003e\u003cli\u003e\u003ca href=\"https://www.macstories.net/stories/a-breach-of-trust-apple-held-in-contempt-over-app-store-rules/\" rel=\"noopener noreferrer\"\u003eAs I predicted\u003c/a\u003e in my story, \u003ca href=\"https://www.theverge.com/news/659754/patreon-update-iphone-ios-app-apple-payment-system-ruling\" rel=\"noopener noreferrer\"\u003ePatreon has said\u003c/a\u003e it will submit an update to its app to allow creators to accept payments outside its iOS app, something that was possible until last summer when \u003ca href=\"https://www.macstories.net/news/patreon-lays-out-how-it-will-deal-with-apples-insistence-that-it-use-app-store-in-app-purchases/\" rel=\"noopener noreferrer\"\u003ePatreon was forced to retrofit its app\u003c/a\u003e to account for Apple’s In-App Purchases and payments through its website in what was an inelegant solution that forced creators to either charge more on iOS or absorb Apple’s fees on what are often small monthly payments to begin with.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://newsroom.spotify.com/2025-05-01/following-landmark-court-ruling-spotify-submits-new-app-update-to-apple-to-benefit-u-s-consumers/\" rel=\"noopener noreferrer\"\u003eSpotify posted on its blog\u003c/a\u003e that it has already submitted an update to its app that will let users see how much a Spotify subscription costs from inside the app and link out to Spotify’s website to upgrade or change their subscription plans.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://docs.stripe.com/mobile/digital-goods\" rel=\"noopener noreferrer\"\u003ePayment processor Stripe whipped up documentation\u003c/a\u003e guiding developers through the process of setting up subscription and digital goods sales outside their apps.\u003c/li\u003e\n\u003cli\u003eBeginning in June, \u003ca href=\"https://store.epicgames.com/en-US/news/new-epic-games-store-webshops-and-revenue-share-update\" rel=\"noopener noreferrer\"\u003ethe Epic Games Store will handle payment processing for developers at no cost\u003c/a\u003e up to the developers’ first $1 million of revenue. After $1 million of revenue the split will be the existing 88% to developers and 12% to Epic Games. In June, Epic Games will also offer developers the ability to set up their own webshops for ‘out-of-app purchases.’ The webshops will be available to iOS developers in the U.S. and EU and users making purchases in them will get 5% back in Epic Rewards for their purchases. Epic Games has not said how much it will charge developers who set up a webshop.\u003c/li\u003e\n\u003c/ul\u003e\u003cp id=\"p10\"\u003eThese moves by big players aren’t surprising, and I’m sure we’ll see more companies explore ways to take advantage of Wednesday’s ruling. Over time, though, the more interesting consequence of Wednesday’s ruling will be whether and how it changes the business models of indie developers and other small businesses that offer apps.\u003c/p\u003e\n            \u003c/div\u003e\n\n    \n        \n\n    \n    \n            \u003cdiv\u003e\n            \u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://www.macstories.net/app/themes/macstories4/images/logo-shape-gold.svg\" alt=\"Club MacStories\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003eAccess Extra Content and Perks\u003c/h3\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003eFounded in 2015, \u003ca href=\"https://club.macstories.net/plans?utm_source=ms\u0026amp;utm_medium=web-inline\" rel=\"noopener noreferrer\"\u003eClub MacStories\u003c/a\u003e has delivered exclusive content every week for nearly a decade.\u003c/p\u003e\n\u003cp\u003eWhat started with weekly and monthly email newsletters has blossomed into \u003ca href=\"https://club.macstories.net/plans?utm_source=ms\u0026amp;utm_medium=web-inline\" rel=\"noopener noreferrer\"\u003ea family of memberships\u003c/a\u003e designed every MacStories fan.\u003c/p\u003e\n\u003cp\u003eLearn more \u003ca href=\"https://club.macstories.net/plans?utm_source=ms\u0026amp;utm_medium=web-inline\" rel=\"noopener noreferrer\"\u003ehere\u003c/a\u003e and from our \u003ca href=\"https://club.macstories.net/faq\" rel=\"noopener noreferrer\"\u003eClub FAQs\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://club.macstories.net/plans/club\" rel=\"noopener noreferrer\"\u003eClub MacStories\u003c/a\u003e\u003c/strong\u003e: Weekly and monthly newsletters via email and the web that are brimming with apps, tips, automation workflows, longform writing, early access to the \u003ca href=\"https://www.macstories.net/unwind/\" rel=\"noopener noreferrer\"\u003eMacStories Unwind podcast\u003c/a\u003e, periodic giveaways, and more;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://club.macstories.net/plans/plus\" rel=\"noopener noreferrer\"\u003eClub MacStories+\u003c/a\u003e\u003c/strong\u003e: Everything that Club MacStories offers, plus an active Discord community, advanced search and custom RSS features for exploring the Club’s entire back catalog, bonus columns, and dozens of app discounts;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://club.macstories.net/plans/premier\" rel=\"noopener noreferrer\"\u003eClub Premier\u003c/a\u003e\u003c/strong\u003e: All of the above \u003cem\u003eand\u003c/em\u003e AppStories+, an extended version of our flagship podcast that’s delivered early, ad-free, and in high-bitrate audio.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e        \u003c/div\u003e\n    \n\u003c/article\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://www.gravatar.com/avatar/5a1475dcd87638ed2f250b6213881115?d=404\u0026amp;s=250\" alt=\"\"/\u003e\n    \u003c/p\u003e\n    \u003cdiv\u003e\u003cp\u003eJohn is MacStories’ Managing Editor, has been writing about Apple and apps since joining the team in 2015, and today, runs the site alongside Federico.\u003c/p\u003e\n\u003cp\u003eJohn also co-hosts four MacStories podcasts: \u003ca href=\"https://appstories.net\" rel=\"noopener noreferrer\"\u003eAppStories\u003c/a\u003e, which covers the world of apps, \u003ca href=\"https://podcasts.apple.com/us/podcast/macstories-unwind/id1510451759\" rel=\"noopener noreferrer\"\u003eMacStories Unwind\u003c/a\u003e, which explores the fun differences between American and Italian culture and recommends media to listeners, \u003ca href=\"https://podcasts.apple.com/us/podcast/ruminate-podcast/id1033235350\" rel=\"noopener noreferrer\"\u003eRuminate\u003c/a\u003e, a show about the weird web and unusual snacks, and \u003ca href=\"https://itunes.apple.com/us/podcast/id1749770019\" rel=\"noopener noreferrer\"\u003eNPC: Next Portable Console\u003c/a\u003e, a show about the games we take with us.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-02T11:59:49-04:00",
  "modifiedTime": null
}
