{
  "id": "c3e2dafa-e467-4799-b91c-963acee5df1f",
  "title": "Stage 2 of the Apple Intelligence Rollout Begins, With Developer Betas of iOS 18.2 and MacOS 15.2 Sequoia",
  "link": "https://www.macrumors.com/2024/10/23/apple-releases-ios-18-2/",
  "description": "",
  "author": "John Gruber",
  "published": "2024-10-23T19:52:53Z",
  "source": "https://daringfireball.net/feeds/main",
  "categories": null,
  "byline": "Juli Clover",
  "length": 10268,
  "excerpt": "Apple today seeded the first betas of upcoming iOS 18.2, iPadOS 18.2, and macOS Sequoia 15.2 updates to developers for testing purposes. The betas...",
  "siteName": "MacRumors",
  "favicon": "https://images.macrumors.com/images-new/favicon-32x32.png",
  "text": "Apple today seeded the first betas of upcoming iOS 18.2, iPadOS 18.2, and macOS Sequoia 15.2 updates to developers for testing purposes. The betas have been released while Apple is still working on iOS 18.1, iPadOS 18.1, and ‌macOS Sequoia‌ 15.1, updates that are set to be released next week. Today's updates introduce the next phase of Apple Intelligence, with Apple previewing new Siri features, image generation tools, and more. Here's what you can expect: Image Playground Image Playground is Apple's image generation app, and it can create images based on prompts. You can enter a description of what you want or use the built-in suggestions and concepts that Apple provides. Apple will suggest costumes, locations, items, and more to add to an image, and these concepts are intelligent and can draw inspiration from a Messages thread or content in the Notes app. There are options to create characters that resemble your friends and family, and you can choose a photo for Image Playground to use as inspiration to create a related image. Elements added to Image Playground creations are previewed, and there is a preview history so you can undo a change and go back to a prior version. While Image Playground is a standalone app, it is also integrated into Messages. Image Playground does not make photorealistic images and is instead limited to animation or illustration styles. Image Wand Image Wand is an Image Playground-related feature that's available in the Notes app on iPad. You can draw a rough sketch with the Apple Pencil or circle a blank space or a key phrase in a note to have Image Wand generate an appropriate image. Genmoji Genmoji are new custom emoji characters that you can create based on descriptions and phrases. Like Image Playground creations, you can base them on your friends and family, with the data pulled from the People album in Photos. You can also make characters using basic elements, and you'll get multiple Genmoji suggestions to choose from. You can create Genmoji using the emoji keyboard. Genmoji are limited to iOS 18.2 and iPadOS 18.2 right now, and will be coming to ‌macOS Sequoia‌ later. Siri ChatGPT Integration ‌Siri‌ can integrate with ChatGPT for certain requests, but only with user approval. If ‌Siri‌ is unable to provide an answer to a query, ‌Siri‌ will hand the request over to ChatGPT. ChatGPT's answer will then be provided by ‌Siri‌. ChatGPT can be used to create content from scratch, including text and images. No account is required to use ChatGPT integration, and Apple and OpenAI do not store requests. Visual Intelligence iPhone 16 users have access to Visual Intelligence, a feature that provides information about what's around you. If you open the camera and point it at a restaurant, for example, you'll see opening hours and reviews. Some other Visual Intelligence capabilities include reading text out loud, detecting phone numbers and addresses to add them to Contacts, copying text, and summarizing text. There is an option to search Google for where to buy a specific item that you see, and you can also point the camera at something and then get more information about it from ChatGPT. Apple plans to expand this feature to include more functionality over time. Writing Tools Apple is enhancing the Writing Tools feature to add an option to make more open-ended changes. In iOS 18.1 and its sister updates, Writing Tools can only be used to change the tone to friendly, professional, and a more simplified version. In iOS 18.2, you can describe the tone or content change that you want to make, such as adding more action words, or turning an email into a poem. More Languages Apple Intelligence supports localized English in Australia, Canada, New Zealand, South Africa, and the UK in addition to U.S. English. Developer Tools The new betas include developer APIs for adding Writing Tools, Genmoji, and Image Playground into third-party apps. Waiting List If you've already been testing Apple Intelligence and are opted in, you will have access to Writing Tools, ChatGPT integration, and Visual Intelligence automatically. There is a secondary waiting list for early access to use Genmoji, Image Playground, and Image Wand. You can sign up to get access in Image Playground or in the areas where you access Genmoji or Image Wand. When you request access, you are added to a wait list for all three capabilities and you'll get a notification when the features are available for you to use. Availability and Compatibility As of right now, the betas are limited to developers who have a device capable of Apple Intelligence, but there will likely be a public beta coming in the not too distant future. Apple is still working on refining the new Apple Intelligence tools, and the company warns that Genmoji, Image Wand, and Image Playground can sometimes give you results you weren't expecting. Apple is collecting feedback on these experiences and will refine them over time. The feedback received will help Apple determine when the image generation features will be more widely available for beta testing and when they'll see an eventual public launch. Apple Intelligence in iOS 18.2 requires an iPhone 15 Pro or ‌iPhone 16‌ model, while iPadOS 18.2 and ‌macOS Sequoia‌ 15.2 require an ‌iPad‌ or Mac with an A17 Pro or M-series chip. Popular Stories18 New Things Your iPhone Can Do in iOS 18.1Monday October 21, 2024 1:44 am PDT by Tim HardwickApple is expected to release iOS 18.1 on Monday, October 28, bringing the first set of Apple Intelligence features to iPhone 15 Pro and iPhone 16 models. This update marks the first significant step forward in Apple's AI integration, offering a new Siri contextually-aware experience and a range of additional capabilities powered by on-device machine learning and large language models. There are a ...Tim Cook Admits Truth About Vision Pro Following Lackluster SalesThe Wall Street Journal's Ben Cohen this summer interviewed Apple CEO Tim Cook about the Vision Pro, innovation, Apple Intelligence, and more. Image Credit: Vanity Fair Cook admitted that the Vision Pro headset is not a mass-market product due to its high price. \"At $3,500, it's not a mass-market product,\" said Cook. \"Right now, it's an early-adopter product. People who want to have...Apple Releases New AirPods Pro, AirPods, and AirPods Max FirmwareTuesday October 22, 2024 11:39 am PDT by Juli CloverApple today released a new firmware update for the original AirPods Pro, the AirPods 2, the AirPods 3, and the Lightning version of the AirPods Max headphones. The new firmware is version 6F21, up from the prior 6A326 firmware that these devices were previously running. There is no word on what's included in the firmware, but given that these are all older models, it is likely that the new...Report: Apple May Stop Producing Vision Pro by the End of 2024Apple has abruptly reduced production of the Vision Pro headset and could stop making the current version of the device completely by the end of 2024, The Information reports. Citing multiple people \"directly involved\" in making components for the headset, the report says that the scaling back of production began in the early summer. This indicates that Apple now has a sufficient number of...5 Reasons to Get Excited About the New Mac MiniWednesday October 23, 2024 6:55 am PDT by Tim HardwickApple's Mac mini has long been a powerhouse in a compact form, offering impressive performance in a small package. With rumors swirling about a completely overhauled new model that is likely just days away from being announced, anticipation is building for what Apple has in store. From enhanced connectivity to major hardware upgrades, the upcoming Mac mini promises to bring significant...Gurman: 'M4 Mac Launch' is 'Next Week'Tuesday October 22, 2024 10:29 am PDT by Joe RossignolJust a few hours after claiming that the first Macs with M4 chips are launching \"very soon,\" Bloomberg's Mark Gurman has followed up with a slightly more specific timeframe. In his latest social media post today, he said an \"M4 Mac launch\" is on Apple's schedule for next week, but he did not mention a specific day. A concept of a smaller Mac mini with front-facing USB-C ports \"Busy week for...Gurman: New MacBook Pro, iMac, and Mac Mini Models With M4 Chips Launching 'Very Soon'Tuesday October 22, 2024 7:11 am PDT by Joe RossignolApple is planning to launch its first Macs with the M4 series of chips \"very soon,\" according to Bloomberg's Mark Gurman. In a social media post today, Gurman said these Macs will include new MacBook Pro, iMac, and Mac mini models specifically. He continues to expect the next Mac mini to feature a \"revamped\" design, in line with his previous reporting that said the new model will be nearly...Apple Confirms AirPods Pro 2 Hearing Features Launching in iOS 18.1 Next WeekApple will release iOS 18.1 next week, introducing a suite of advanced hearing health capabilities to the AirPods Pro 2 and the first Apple Intelligence features. The timing of the update was confirmed by reviewers who were given early access to the AirPods Pro 2's new hearing health features, which are now known to be included in the update. The update will include three core features:...Apple Working on New Magic Mouse 2, Magic Trackpad 2 and Magic KeyboardMonday October 21, 2024 10:59 am PDT by Juli CloverApple may soon release new versions of the Magic Mouse, Magic Keyboard, and Magic Trackpad, according to code found in the iOS 18.1 release candidate by MacRumors contributor Aaron Perris. There are references to a new Magic Mouse 2, Magic Trackpad 2, and several Magic Keyboards, which would include versions with Touch ID and number pads, as well as models without. While there is no...WhatsApp for iOS Gets New Home Screen Widget for Chats, Camera UpdatesMonday October 21, 2024 2:37 pm PDT by Juli CloverPopular messaging app WhatsApp was today updated to add a new Home Screen widget that's specific to chats. The widget is available on the iPhone after updating to version 24.21.81, which came out this afternoon. After updating the widget can be added to the Home Screen using the Edit interface. Users can choose from Recents, Favorites, Pinned, or Frequently Contacted to get quick access to...",
  "image": "https://images.macrumors.com/t/u419F9T-2zXWL5Hkvaw4AqK7ZBg=/2500x/article-new/2024/10/Generic-iOS-18.2-Feature-Real-Mock.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv role=\"main\" id=\"maincontent\"\u003e\u003carticle expanded=\"true\"\u003e\u003cdiv data-io-article-url=\"/2024/10/23/apple-releases-ios-18-2/\"\u003e\u003cp\u003eApple today seeded the first betas of upcoming iOS 18.2, iPadOS 18.2, and \u003ca href=\"https://www.macrumors.com/roundup/macos-sequoia/\"\u003emacOS Sequoia\u003c/a\u003e 15.2 updates to developers for testing purposes. The betas have been released while Apple is still working on iOS 18.1, iPadOS 18.1, and ‌macOS Sequoia‌ 15.1, updates that are set to be released next week.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://images.macrumors.com/t/tzETODq7KNrZYCGWkx_aoCkzk_o=/400x0/article-new/2024/10/Generic-iOS-18.2-Feature-Real-Mock.jpg?lossy\" srcset=\"https://images.macrumors.com/t/tzETODq7KNrZYCGWkx_aoCkzk_o=/400x0/article-new/2024/10/Generic-iOS-18.2-Feature-Real-Mock.jpg?lossy 400w,https://images.macrumors.com/t/5OsIqUpWu93lFsEG4RIrmA0H0YQ=/800x0/article-new/2024/10/Generic-iOS-18.2-Feature-Real-Mock.jpg?lossy 800w,https://images.macrumors.com/t/5otUp46DJsXojvGqbTZKHikEAJI=/1600x0/article-new/2024/10/Generic-iOS-18.2-Feature-Real-Mock.jpg 1600w,https://images.macrumors.com/t/Xos_7Mi_cFhDSB3O-ybFtHaKg08=/2500x0/filters:no_upscale()/article-new/2024/10/Generic-iOS-18.2-Feature-Real-Mock.jpg 2500w\" sizes=\"(max-width: 900px) 100vw, 697px\" alt=\"Generic iOS 18\" width=\"2500\" height=\"1406\"/\u003e\u003cbr/\u003eToday\u0026#39;s updates introduce the next phase of Apple Intelligence, with Apple previewing new \u003ca href=\"https://www.macrumors.com/guide/siri/\"\u003eSiri\u003c/a\u003e features, image generation tools, and more. Here\u0026#39;s what you can expect:\u003cbr/\u003e\n\u003c/p\u003e\n\u003ch2\u003eImage Playground\u003c/h2\u003e\n\u003cp\u003eImage Playground is Apple\u0026#39;s image generation app, and it can create images based on prompts. You can enter a description of what you want or use the built-in suggestions and concepts that Apple provides. Apple will suggest costumes, locations, items, and more to add to an image, and these concepts are intelligent and can draw inspiration from a Messages thread or content in the Notes app.\u003c/p\u003e\n\u003cp\u003eThere are options to create characters that resemble your friends and family, and you can choose a photo for Image Playground to use as inspiration to create a related image. Elements added to Image Playground creations are previewed, and there is a preview history so you can undo a change and go back to a prior version.\u003c/p\u003e\n\u003cp\u003eWhile Image Playground is a standalone app, it is also integrated into Messages. Image Playground does not make photorealistic images and is instead limited to animation or illustration styles.\u003cbr/\u003e\n\u003c/p\u003e\n\u003ch2\u003eImage Wand\u003c/h2\u003e\n\u003cp\u003eImage Wand is an Image Playground-related feature that\u0026#39;s available in the Notes app on \u003ca href=\"https://www.macrumors.com/roundup/ipad/\"\u003eiPad\u003c/a\u003e. You can draw a rough sketch with the \u003ca href=\"https://www.macrumors.com/guide/apple-pencil/\"\u003eApple Pencil\u003c/a\u003e or circle a blank space or a key phrase in a note to have Image Wand generate an appropriate image.\u003cbr/\u003e\n\u003c/p\u003e\n\u003ch2\u003eGenmoji\u003c/h2\u003e\n\u003cp\u003eGenmoji are new custom emoji characters that you can create based on descriptions and phrases. Like Image Playground creations, you can base them on your friends and family, with the data pulled from the People album in \u003ca href=\"https://www.macrumors.com/guide/photos/\"\u003ePhotos\u003c/a\u003e. You can also make characters using basic elements, and you\u0026#39;ll get multiple Genmoji suggestions to choose from. You can create Genmoji using the emoji keyboard.\u003c/p\u003e\n\u003cp\u003eGenmoji are limited to iOS 18.2 and iPadOS 18.2 right now, and will be coming to ‌macOS Sequoia‌ later.\u003cbr/\u003e\n\u003c/p\u003e\n\u003ch2\u003eSiri ChatGPT Integration\u003c/h2\u003e\n\u003cp\u003e‌Siri‌ can integrate with ChatGPT for certain requests, but only with user approval. If ‌Siri‌ is unable to provide an answer to a query, ‌Siri‌ will hand the request over to ChatGPT. ChatGPT\u0026#39;s answer will then be provided by ‌Siri‌.\u003c/p\u003e\n\u003cp\u003eChatGPT can be used to create content from scratch, including text and images. No account is required to use ChatGPT integration, and Apple and OpenAI do not store requests.\u003cbr/\u003e\n\u003c/p\u003e\n\u003ch2\u003eVisual Intelligence\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://www.macrumors.com/roundup/iphone-16/\"\u003eiPhone 16\u003c/a\u003e users have access to Visual Intelligence, a feature that provides information about what\u0026#39;s around you. If you open the camera and point it at a restaurant, for example, you\u0026#39;ll see opening hours and reviews.\u003c/p\u003e\n\u003cp\u003eSome other Visual Intelligence capabilities include reading text out loud, detecting phone numbers and addresses to add them to Contacts, copying text, and summarizing text. There is an option to search Google for where to buy a specific item that you see, and you can also point the camera at something and then get more information about it from ChatGPT.\u003c/p\u003e\n\u003cp\u003eApple plans to expand this feature to include more functionality over time.\u003cbr/\u003e\n\u003c/p\u003e\n\u003ch2\u003eWriting Tools\u003c/h2\u003e\n\u003cp\u003eApple is enhancing the Writing Tools feature to add an option to make more open-ended changes. In iOS 18.1 and its sister updates, Writing Tools can only be used to change the tone to friendly, professional, and a more simplified version. In iOS 18.2, you can describe the tone or content change that you want to make, such as adding more action words, or turning an email into a poem.\u003cbr/\u003e\n\u003c/p\u003e\n\u003ch2\u003eMore Languages\u003c/h2\u003e\n\u003cp\u003eApple Intelligence supports localized English in Australia, Canada, New Zealand, South Africa, and the UK in addition to U.S. English.\u003cbr/\u003e\n\u003c/p\u003e\n\u003ch2\u003eDeveloper Tools\u003c/h2\u003e\n\u003cp\u003eThe new betas include developer APIs for adding Writing Tools, Genmoji, and Image Playground into third-party apps.\u003cbr/\u003e\n\u003c/p\u003e\n\u003ch2\u003eWaiting List\u003c/h2\u003e\n\u003cp\u003eIf you\u0026#39;ve already been testing Apple Intelligence and are opted in, you will have access to Writing Tools, ChatGPT integration, and Visual Intelligence automatically.\u003c/p\u003e\n\u003cp\u003eThere is a secondary waiting list for early access to use Genmoji, Image Playground, and Image Wand. You can sign up to get access in Image Playground or in the areas where you access Genmoji or Image Wand.\u003c/p\u003e\n\u003cp\u003eWhen you request access, you are added to a wait list for all three capabilities and you\u0026#39;ll get a notification when the features are available for you to use.\u003cbr/\u003e\n\u003c/p\u003e\n\u003ch2\u003eAvailability and Compatibility\u003c/h2\u003e\n\u003cp\u003eAs of right now, the betas are limited to developers who have a device capable of Apple Intelligence, but there will likely be a public beta coming in the not too distant future. Apple is still working on refining the new Apple Intelligence tools, and the company warns that Genmoji, Image Wand, and Image Playground can sometimes give you results you weren\u0026#39;t expecting. Apple is collecting feedback on these experiences and will refine them over time.\u003c/p\u003e\n\u003cp\u003eThe feedback received will help Apple determine when the image generation features will be more widely available for beta testing and when they\u0026#39;ll see an eventual public launch.\u003c/p\u003e\n\u003cp\u003eApple Intelligence in iOS 18.2 requires an \u003ca href=\"https://www.macrumors.com/roundup/iphone-15/\"\u003eiPhone 15\u003c/a\u003e Pro or ‌iPhone 16‌ model, while iPadOS 18.2 and ‌macOS Sequoia‌ 15.2 require an ‌iPad‌ or Mac with an A17 Pro or M-series chip.\u003c/p\u003e\n\u003c/div\u003e\u003c/article\u003e\u003cp\u003e\u003ch2\u003ePopular Stories\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/21/18-new-things-your-iphone-can-do-ios-18-1/\"\u003e18 New Things Your iPhone Can Do in iOS 18.1\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eMonday October 21, 2024 1:44 am PDT by \u003ca href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\"\u003eTim Hardwick\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple is expected to release iOS 18.1 on Monday, October 28, bringing the first set of Apple Intelligence features to iPhone 15 Pro and iPhone 16 models. This update marks the first significant step forward in Apple\u0026#39;s AI integration, offering a new Siri contextually-aware experience and a range of additional capabilities powered by on-device machine learning and large language models. There are a ...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/21/tim-cook-admits-truth-about-vision-pro/\"\u003eTim Cook Admits Truth About Vision Pro Following Lackluster Sales\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eThe Wall Street Journal\u0026#39;s Ben Cohen this summer interviewed Apple CEO Tim Cook about the Vision Pro, innovation, Apple Intelligence, and more. Image Credit: Vanity Fair Cook admitted that the Vision Pro headset is not a mass-market product due to its high price. \u0026#34;At $3,500, it\u0026#39;s not a mass-market product,\u0026#34; said Cook. \u0026#34;Right now, it\u0026#39;s an early-adopter product. People who want to have...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/22/apple-releases-airpods-firmware-6f21/\"\u003eApple Releases New AirPods Pro, AirPods, and AirPods Max Firmware\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eTuesday October 22, 2024 11:39 am PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple today released a new firmware update for the original AirPods Pro, the AirPods 2, the AirPods 3, and the Lightning version of the AirPods Max headphones. The new firmware is version 6F21, up from the prior 6A326 firmware that these devices were previously running. There is no word on what\u0026#39;s included in the firmware, but given that these are all older models, it is likely that the new...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/23/apple-may-stop-producing-vision-pro-by-end-of-2024/\"\u003eReport: Apple May Stop Producing Vision Pro by the End of 2024\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eApple has abruptly reduced production of the Vision Pro headset and could stop making the current version of the device completely by the end of 2024, The Information reports. Citing multiple people \u0026#34;directly involved\u0026#34; in making components for the headset, the report says that the scaling back of production began in the early summer. This indicates that Apple now has a sufficient number of...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/23/5-reasons-get-excited-upcoming-mac-mini/\"\u003e5 Reasons to Get Excited About the New Mac Mini\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eWednesday October 23, 2024 6:55 am PDT by \u003ca href=\"https://www.macrumors.com/author/tim-hardwick/\" rel=\"author\"\u003eTim Hardwick\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple\u0026#39;s Mac mini has long been a powerhouse in a compact form, offering impressive performance in a small package. With rumors swirling about a completely overhauled new model that is likely just days away from being announced, anticipation is building for what Apple has in store. From enhanced connectivity to major hardware upgrades, the upcoming Mac mini promises to bring significant...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/22/m4-mac-launch-timing-rumors/\"\u003eGurman: \u0026#39;M4 Mac Launch\u0026#39; is \u0026#39;Next Week\u0026#39;\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eTuesday October 22, 2024 10:29 am PDT by \u003ca href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\"\u003eJoe Rossignol\u003c/a\u003e\u003c/p\u003e\u003cp\u003eJust a few hours after claiming that the first Macs with M4 chips are launching \u0026#34;very soon,\u0026#34; Bloomberg\u0026#39;s Mark Gurman has followed up with a slightly more specific timeframe. In his latest social media post today, he said an \u0026#34;M4 Mac launch\u0026#34; is on Apple\u0026#39;s schedule for next week, but he did not mention a specific day. A concept of a smaller Mac mini with front-facing USB-C ports \u0026#34;Busy week for...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/22/gurman-says-m4-macs-launch-very-soon/\"\u003eGurman: New MacBook Pro, iMac, and Mac Mini Models With M4 Chips Launching \u0026#39;Very Soon\u0026#39;\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eTuesday October 22, 2024 7:11 am PDT by \u003ca href=\"https://www.macrumors.com/author/joe-rossignol/\" rel=\"author\"\u003eJoe Rossignol\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple is planning to launch its first Macs with the M4 series of chips \u0026#34;very soon,\u0026#34; according to Bloomberg\u0026#39;s Mark Gurman. In a social media post today, Gurman said these Macs will include new MacBook Pro, iMac, and Mac mini models specifically. He continues to expect the next Mac mini to feature a \u0026#34;revamped\u0026#34; design, in line with his previous reporting that said the new model will be nearly...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/21/airpods-pro-hearing-features-launching-in-ios-18-1/\"\u003eApple Confirms AirPods Pro 2 Hearing Features Launching in iOS 18.1 Next Week\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eApple will release iOS 18.1 next week, introducing a suite of advanced hearing health capabilities to the AirPods Pro 2 and the first Apple Intelligence features. The timing of the update was confirmed by reviewers who were given early access to the AirPods Pro 2\u0026#39;s new hearing health features, which are now known to be included in the update. The update will include three core features:...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/21/apple-new-magic-mouse-trackpad-keyboard/\"\u003eApple Working on New Magic Mouse 2, Magic Trackpad 2 and Magic Keyboard\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eMonday October 21, 2024 10:59 am PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003eApple may soon release new versions of the Magic Mouse, Magic Keyboard, and Magic Trackpad, according to code found in the iOS 18.1 release candidate by MacRumors contributor Aaron Perris. There are references to a new Magic Mouse 2, Magic Trackpad 2, and several Magic Keyboards, which would include versions with Touch ID and number pads, as well as models without. While there is no...\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.macrumors.com/2024/10/21/whatsapp-ios-home-screen-widget/\"\u003eWhatsApp for iOS Gets New Home Screen Widget for Chats, Camera Updates\u003c/a\u003e\u003c/h3\u003e\u003cp\u003eMonday October 21, 2024 2:37 pm PDT by \u003ca href=\"https://www.macrumors.com/author/juli-clover/\" rel=\"author\"\u003eJuli Clover\u003c/a\u003e\u003c/p\u003e\u003cp\u003ePopular messaging app WhatsApp was today updated to add a new Home Screen widget that\u0026#39;s specific to chats. The widget is available on the iPhone after updating to version 24.21.81, which came out this afternoon. After updating the widget can be added to the Home Screen using the Edit interface. Users can choose from Recents, Favorites, Pinned, or Frequently Contacted to get quick access to...\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-10-23T13:06:22Z",
  "modifiedTime": null
}
