{
  "id": "c8a30c2d-8301-43ea-b187-837512d55ce8",
  "title": "Apple Intelligence features expand to new languages and regions today",
  "link": "https://www.apple.com/newsroom/2025/03/apple-intelligence-features-expand-to-new-languages-and-regions-today/",
  "description": "",
  "author": "Apple Newsroom",
  "published": "2025-03-31T17:00:02.818Z",
  "source": "https://www.apple.com/newsroom/rss-feed.rss",
  "categories": [
    "UPDATE"
  ],
  "byline": "",
  "length": 3186,
  "excerpt": "Apple Intelligence is expanding to even more people around the world.",
  "siteName": "Apple Newsroom",
  "favicon": "",
  "text": "QUICK READ March 31, 2025 Apple Intelligence features expand to new languages and regions today In addition, an initial set of Apple Intelligence features is now available on Apple Vision Pro in U.S. English Apple Intelligence, the personal intelligence system that delivers helpful and relevant intelligence while taking an extraordinary step forward for privacy in AI, is expanding to even more people around the world. Starting today, with the availability of iOS 18.4, iPadOS 18.4, and macOS Sequoia 15.4, Apple Intelligence features are now available in many new languages, including French, German, Italian, Portuguese (Brazil), Spanish, Japanese, Korean, and Chinese (simplified) — as well as localized English for Singapore and India — and are accessible in nearly all regions around the world. In addition, iPhone and iPad users in the EU have access to Apple Intelligence features for the first time, and Apple Intelligence expands to a new platform with an initial set of features available in U.S. English with Apple Vision Pro — helping users communicate, collaborate, and express themselves in entirely new ways. Now, Vision Pro users can proofread, rewrite, and summarize text using Writing Tools; compose text from scratch using ChatGPT in Writing Tools; explore new ways to express themselves visually with Image Playground; create the perfect emoji for any conversation with Genmoji; and much more. This release also comes with additional Apple Intelligence features, including Priority Notifications to help users stay on top of time-sensitive communications, the ability to create a memory movie on Mac by simply typing a description, and an added Sketch style in Image Playground that creates academic and highly detailed sketches. Apple Intelligence marks an extraordinary step forward for privacy in AI and is designed to protect users’ privacy at every step. It starts with on-device processing, and for requests that require access to larger models, Private Cloud Compute extends the privacy and security of iPhone into the cloud to unlock even more intelligence. Stay up to date with the latest articles from Apple Newsroom.",
  "image": "https://www.apple.com/newsroom/images/logos/quick-reads-logos/Apple-Intelligence.jpg.og.jpg?202503312215",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\n\n\n\n\n\t\n    \n\n\n\n\n\n\n\n\u003cnav id=\"ac-localnav\" lang=\"en-US\" role=\"navigation\" aria-label=\"Newsroom\" data-analytics-region=\"local nav\" data-sticky=\"\"\u003e\n    \n    \n    \n        \n\n\n\n\n    \n    \n    \n\t\n\t\n\n\u003c/nav\u003e\n\n\n\n\n\n\n\n\u003cmain id=\"main\" role=\"main\"\u003e\n    \n    \u003cdiv\u003e\n        \u003carticle data-analytics-activitymap-region-id=\"quickread\"\u003e\n            \n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n\n\n\n    \n\n\n\n\n\n    \u003cdiv\u003e\n        \u003cdiv\u003e\n            \n            \u003cimg srcset=\"https://www.apple.com/newsroom/images/logos/quick-reads-logos/Apple-Intelligence.jpg.square_social.jpg, https://www.apple.com/newsroom/images/logos/quick-reads-logos/Apple-Intelligence.jpg.square_social.jpg 2x\" src=\"https://www.apple.com/newsroom/images/logos/quick-reads-logos/Apple-Intelligence.jpg.square_social.jpg\" alt=\"The logo for Apple Intelligence.\"/\u003e\n        \u003c/div\u003e\n\t\t\n        \u003cdiv\u003e\n                    \n                        \u003cspan\u003eQUICK READ\u003c/span\u003e\n                    \n                    \n                    \n                        \u003cspan\u003eMarch 31, 2025\u003c/span\u003e\n                    \n                    \n                \u003c/div\u003e\n\n        \u003cdiv\u003e\n                \n                \n                \n                    \u003ch2\u003e\n                        \n    \n        Apple Intelligence features expand to new languages and regions today\n    \n\n                    \u003c/h2\u003e\n                \n            \u003c/div\u003e\n\n        \u003cdiv\u003e\n                \n                \n                    In addition, an initial set of Apple Intelligence features is now available on Apple Vision Pro in U.S. English\n                \n            \u003c/div\u003e\n\n        \n            \n    \n    \n    \n    \n    \n\n        \n\n    \u003c/div\u003e\n\n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n        \u003cdiv\u003e\n             \n                 \u003cdiv\u003eApple Intelligence, the personal intelligence system that delivers helpful and relevant intelligence while taking an extraordinary step forward for privacy in AI, is expanding to even more people around the world. Starting today, with the availability of iOS 18.4, iPadOS 18.4, and macOS Sequoia 15.4, Apple Intelligence features are now available in many new languages, including French, German, Italian, Portuguese (Brazil), Spanish, Japanese, Korean, and Chinese (simplified) — as well as localized English for Singapore and India — and are accessible in nearly all regions around the world.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eIn addition, iPhone and iPad users in the EU have access to Apple Intelligence features for the first time, and Apple Intelligence expands to a new platform with an initial set of features available in U.S. English with Apple Vision Pro — helping users communicate, collaborate, and express themselves in entirely new ways. Now, Vision Pro users can proofread, rewrite, and summarize text using Writing Tools; compose text from scratch using ChatGPT in Writing Tools; explore new ways to express themselves visually with Image Playground; create the perfect emoji for any conversation with Genmoji; and much more.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eThis release also comes with additional Apple Intelligence features, including Priority Notifications to help users stay on top of time-sensitive communications, the ability to create a memory movie on Mac by simply typing a description, and an added Sketch style in Image Playground that creates academic and highly detailed sketches.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eApple Intelligence marks an extraordinary step forward for privacy in AI and is designed to protect users’ privacy at every step. It starts with on-device processing, and for requests that require access to larger models, Private Cloud Compute extends the privacy and security of iPhone into the cloud to unlock even more intelligence.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n            \u003csection data-analytics-activitymap-region-id=\"quickread accordion\" data-component-list=\"Accordion\"\u003e\n                \u003cul data-accordion=\"\" role=\"list\"\u003e\n                    \n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n\n\n    \n    \n    \u003cli data-accordion-item=\"accordion-item-0\"\u003e\n        \n        \n            \u003ch2\u003e\n                \n    \n\n            \u003c/h2\u003e\n        \n        \n    \u003c/li\u003e\n\n\n\n\n\n                \u003c/ul\u003e\n            \u003c/section\u003e\n        \u003c/article\u003e\n\n    \u003c/div\u003e\n    \n\n\n\u003c/main\u003e\n\n\n\n\n\n\u003cdiv\u003e\n            Stay up to date with the latest articles from Apple Newsroom.\n        \u003c/div\u003e\n\t\n\n\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
