{
  "id": "cfa7c612-ac61-49b7-ae2a-a00dac76f984",
  "title": "Remove serious security threats to Mac, iPhone and more with new OS updates",
  "link": "https://www.cultofmac.com/news/mac-iphone-security-threats-ios-18-1-1-macos-sequoia",
  "description": "Apple released iOS 18.1.1, iPadOS 18.1.1, macOS Sequoia 15.1.1 and visionOS 2.1.1 to deal with security threats to Macs, iPhones, etc. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
  "author": "Ed Hardy",
  "published": "Tue, 19 Nov 2024 21:25:31 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "News",
    "Top Stories",
    "iOS 18",
    "iPadOS 18",
    "macOS Sequoia"
  ],
  "byline": "Ed Hardy",
  "length": 2118,
  "excerpt": "Apple released iOS 18.1.1, iPadOS 18.1.1, macOS Sequoia 15.1.1 and visionOS 2.1.1 to deal with security threats to Macs, iPhones, etc.",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "NewsTop Stories macOS Sequoia 15.1.1 takes care of some Mac security threats. Photo: Apple/Pixabay/Pexels Apple released iOS 18.1.1, iPadOS 18.1.1, macOS Sequoia 15.1.1 and visionOS 2.1.1 on Tuesday. The updates deal with serious security threats that bad actors apparently already exploited on older Macs. Apple recommends the updates for all users. Apple struggles endlessly with hackers. Our iPhones and Macs are full of credit card numbers, passwords and other valuable data that criminals could turn into cash … if they can gain access to the info. Apple works hard to make the software on its devices safe from hackers. When new security problems arise, Apple issues patches for its operating systems to close them. When recent problems with WebKit and JavaScriptCore turned up, Apple prepared the software updates released today. And the risk from these isn’t theoretical. The description for each notes, “Apple is aware of a report that this issue may have been actively exploited on Intel-based Mac systems.” The necessary fixes are included in iOS 18.1.1, iPadOS 18.1.1, macOS Sequoia 15.1.1 and visionOS 2.1.1. The release notes for the OS patches say simply, “This update provides important security fixes and is recommended for all users.” This means they contain no other features.  They’re pure security patches. The next Apple operating systems with additional capabilities — iOS 18.2, iPadOS 18.2 and macOS Sequoia 15.2 — should arrive in early December. How to install these patches iPhone and iPad users can install iOS 18.1.1 and iPadOS iOS 18.1.1 directly by opening the Settings app and going to General \u003e Software Update. Alternatively, you can update your devices by connecting them to a Mac (or to a PC running iTunes). To download the macOS Sequoia update, go to the Apple menu  \u003e About This Mac. Then click Software Update. Alternatively, you can install the new version from the App Store. (Note: At the time of this writing, Apple had not yet updated the version of macOS in the App Store. But it should happen soon.)",
  "image": "https://www.cultofmac.com/wp-content/uploads/2024/03/MacBook-Pro-bug.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-875615\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/news\" title=\"News\" aria-label=\"News articles\"\u003eNews\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cultofmac.com/top-stories\" title=\"Top Stories\" aria-label=\"Top Stories articles\"\u003eTop Stories\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"Remove serious security threats to Mac, iPhone and more with new OS updates\" src=\"https://www.cultofmac.com/wp-content/uploads/2024/03/MacBook-Pro-bug-1536x864.jpg\" alt=\"macOS bug fixed\" data-ratio=\"1.7777777777778\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\tmacOS Sequoia 15.1.1 takes care of some Mac security threats. \u003cbr/\u003e\u003cem\u003ePhoto: Apple/Pixabay/\u003ca href=\"https://www.pexels.com/photo/brown-8-legged-insect-on-black-surface-35804/\"\u003ePexels\u003c/a\u003e\u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003eApple released iOS 18.1.1, iPadOS 18.1.1, macOS Sequoia 15.1.1 and visionOS 2.1.1 on Tuesday. The updates deal with serious security threats that bad actors apparently already exploited on older Macs.\u003c/p\u003e\n\u003cp\u003eApple recommends the updates for all users.\u003cspan id=\"more-875615\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003eApple struggles endlessly with hackers. Our iPhones and Macs are full of credit card numbers, passwords and other valuable data that criminals could turn into cash … if they can gain access to the info. Apple works hard to make the software on its devices safe from hackers. When new security problems arise, Apple issues patches for its operating systems to close them.\u003c/p\u003e\n\u003cp\u003eWhen recent problems with WebKit and JavaScriptCore turned up, Apple prepared the software updates released today. And the risk from these isn’t theoretical. The \u003ca href=\"https://support.apple.com/en-us/121753\" data-lasso-id=\"1641642281\" target=\"_blank\"\u003edescription for each\u003c/a\u003e notes, “Apple is aware of a report that this issue may have been actively exploited on Intel-based Mac systems.”\u003c/p\u003e\u003cspan data-ez-ph-id=\"909\"\u003e\u003c/span\u003e\n\u003cp\u003eThe necessary fixes are included in iOS 18.1.1, iPadOS 18.1.1, macOS Sequoia 15.1.1 and visionOS 2.1.1. The release notes for the OS patches say simply, “This update provides important security fixes and is recommended for all users.”\u003c/p\u003e\n\u003cp\u003eThis means they contain no other features.  They’re pure security patches. The next Apple operating systems with additional capabilities — \u003ca href=\"https://www.cultofmac.com/how-to/apple-intelligence-ios-18-2\" data-lasso-id=\"1641642283\"\u003eiOS 18.2, iPadOS 18.2 and macOS Sequoia 15.2\u003c/a\u003e — should \u003ca href=\"https://www.cultofmac.com/news/ios-18-2-release-early-december\" data-lasso-id=\"1641642284\"\u003earrive in early December\u003c/a\u003e.\u003c/p\u003e\n\u003ch3\u003eHow to install these patches\u003c/h3\u003e\n\u003cp\u003eiPhone and iPad users can install iOS 18.1.1 and iPadOS iOS 18.1.1 directly by opening the \u003cstrong\u003eSettings \u003c/strong\u003eapp and going to \u003cstrong\u003eGeneral\u003c/strong\u003e \u0026gt; \u003cstrong\u003eSoftware Update\u003c/strong\u003e. Alternatively, you can update your devices by connecting them to a Mac (or to a PC running iTunes).\u003c/p\u003e\n\u003cp\u003eTo download the macOS Sequoia update, go to the Apple menu  \u0026gt; \u003cstrong\u003eAbout This Mac\u003c/strong\u003e. Then click \u003cstrong\u003eSoftware Update\u003c/strong\u003e. Alternatively, you can install the new version from \u003ca href=\"https://apps.apple.com/us/app/macos-sequoia/id6596773750?mt=12\" target=\"_blank\" rel=\"noopener\" data-lasso-id=\"1641642282\"\u003ethe App Store\u003c/a\u003e. (Note: At the time of this writing, Apple had not yet updated the version of macOS in the App Store. But it should happen soon.)        \u003c/p\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-19T21:25:31Z",
  "modifiedTime": "2024-11-19T23:09:51Z"
}
