{
  "id": "0481d693-8299-4042-8855-fecd54ab9a02",
  "title": "OpenAI releases o3-mini as its 'most cost-efficient model' in reasoning series",
  "link": "https://www.gsmarena.com/openai_o3_mini_released-news-66347.php",
  "description": "The OpenAI o3-mini, previewed in December 2024, has been released by OpenAI as its \"most cost-efficient model\" in its reasoning series. The o3-mini's strength lies in science, math, and coding, and it's optimized for STEM reasoning. OpenAI says that o3-mini provides a specialized alternative for tech domains that require speed and precision, and with medium reasoning efforts, it matches the o1's performance in science, math, and coding while delivering faster responses. The company also said that o3-mini was 24% faster than o1-mini in A/B testing, with an average response time of 7.7s...",
  "author": "",
  "published": "Sat, 01 Feb 2025 19:50:02 +0100",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Sagar",
  "length": 1854,
  "excerpt": "It is OpenAI's first reasoning model that's available to ChatGPT's free users. The OpenAI o3-mini, previewed in December 2024, has been released by OpenAI...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "The OpenAI o3-mini, previewed in December 2024, has been released by OpenAI as its \"most cost-efficient model\" in its reasoning series. The o3-mini's strength lies in science, math, and coding, and it's optimized for STEM reasoning. OpenAI says that o3-mini provides a specialized alternative for tech domains that require speed and precision, and with medium reasoning efforts, it matches the o1's performance in science, math, and coding while delivering faster responses. The company also said that o3-mini was 24% faster than o1-mini in A/B testing, with an average response time of 7.7s compared to o1-mini's 10.16s. The o3-mini is OpenAI's first small reasoning model supporting highly requested developer features, including function calling, developer messages, and Structured Outputs. Additionally, it will support streaming, and developers will have the option to choose from three reasoning efforts - low, medium, and high. o3-mini will also work with search to find up-to-date answers with links to relevant sources on the web. The o3-mini is already available to ChatGPT Plus, Team, and Pro subscribers. It can be selected from the model picker, where it will replace the o1-mini. All paid users will have the option to choose \"o3-mini-high\" in the model picker if they are willing to trade response time for higher intelligence. ChatGPT Pro users will have unlimited access to both o3-mini and o3-mini-high, while Plus and Team users will get a higher rate limit - up from 50 messages/day with o1-mini to 150 messages/day with the o3-mini. ChatGPT's free users not having any subscription can try o3-mini by selecting \"Reason\" in the message composer or by regenerating a response, making o3-mini OpenAI's first reasoning model that's available to free users in ChatGPT. It's also available in Microsoft's Azure OpenAI Service. Source",
  "image": "https://fdn.gsmarena.com/imgroot/news/25/01/openai-o3-mini-official/-952x498w6/gsmarena_001.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eThe OpenAI o3-mini, previewed in December 2024, has been released by OpenAI as its \u0026#34;most cost-efficient model\u0026#34; in its reasoning series. The o3-mini\u0026#39;s strength lies in science, math, and coding, and it\u0026#39;s optimized for STEM reasoning.\u003c/p\u003e\n\n\u003cp\u003eOpenAI says that o3-mini provides a specialized alternative for tech domains that require speed and precision, and with medium reasoning efforts, it matches the o1\u0026#39;s performance in science, math, and coding while delivering faster responses. The company also said that o3-mini was 24% faster than o1-mini in A/B testing, with an average response time of 7.7s compared to o1-mini\u0026#39;s 10.16s.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"900\" src=\"https://fdn.gsmarena.com/imgroot/news/25/01/openai-o3-mini-official/inline/-1200/gsmarena_001.jpg\" alt=\"OpenAI releases o3-mini as its \u0026#39;most cost-efficient model\u0026#39; in reasoning series\"/\u003e\u003c/p\u003e\u003cp\u003eThe o3-mini is OpenAI\u0026#39;s first small reasoning model supporting highly requested developer features, including function calling, developer messages, and Structured Outputs. Additionally, it will support streaming, and developers will have the option to choose from three reasoning efforts - low, medium, and high. o3-mini will also work with search to find up-to-date answers with links to relevant sources on the web.\u003c/p\u003e\n\n\u003cp\u003eThe o3-mini is already available to ChatGPT Plus, Team, and Pro subscribers. It can be selected from the model picker, where it will replace the o1-mini. All paid users will have the option to choose \u0026#34;o3-mini-high\u0026#34; in the model picker if they are willing to trade response time for higher intelligence.\u003c/p\u003e\n\n\u003cp\u003eChatGPT Pro users will have unlimited access to both o3-mini and o3-mini-high, while Plus and Team users will get a higher rate limit - up from 50 messages/day with o1-mini to 150 messages/day with the o3-mini.\u003c/p\u003e\n\n\u003cp\u003eChatGPT\u0026#39;s free users not having any subscription can try o3-mini by selecting \u0026#34;Reason\u0026#34; in the message composer or by regenerating a response, making o3-mini OpenAI\u0026#39;s first reasoning model that\u0026#39;s available to free users in ChatGPT. It\u0026#39;s also \u003ca href=\"https://azure.microsoft.com/en-us/blog/announcing-the-availability-of-the-o3-mini-reasoning-model-in-microsoft-azure-openai-service\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eavailable\u003c/a\u003e in Microsoft\u0026#39;s Azure OpenAI Service.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://openai.com/index/openai-o3-mini\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSource\u003c/a\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-01T19:50:02+01:00",
  "modifiedTime": null
}
