{
  "id": "1f904f4d-16fa-408c-95fc-3f77053d2035",
  "title": "Apple to keep the periscope telephoto camera exclusive to the iPhone Pro models next year",
  "link": "https://www.gsmarena.com/apple_iphone_17_pro_models_periscope_camera-news-65466.php",
  "description": "Apple unveiled the iPhone 16, iPhone 16 Plus, iPhone 16 Pro, and iPhone 16 Pro Max in September, with only the Pro versions featuring periscope telephoto cameras. And if you were expecting next year's non-Pro iPhone 17 models to sport periscope units, that's not happening. The word comes from South Korean publication The Elec, which claims the periscope telephoto camera will remain exclusive to the Pro models in next year's lineup, even though LG Innotek - that makes iPhone camera modules - is investing in new facilities, possibly for the upgraded iPhone 17 series camera...",
  "author": "",
  "published": "Sat, 23 Nov 2024 23:00:02 +0100",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Sagar",
  "length": 1015,
  "excerpt": "This year's Pro models feature periscope telephoto cameras with 5x optical zoom. Apple unveiled the iPhone 16, iPhone 16 Plus, iPhone 16 Pro, and iPhone 16...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "Apple unveiled the iPhone 16, iPhone 16 Plus, iPhone 16 Pro, and iPhone 16 Pro Max in September, with only the Pro versions featuring periscope telephoto cameras. And if you were expecting next year's non-Pro iPhone 17 models to sport periscope units, that's not happening. The word comes from South Korean publication The Elec, which claims the periscope telephoto camera will remain exclusive to the Pro models in next year's lineup, even though LG Innotek - that makes iPhone camera modules - is investing in new facilities, possibly for the upgraded iPhone 17 series camera modules. Apple iPhone 16 Pro MaxThe iPhone 17 series is expected to include four models - iPhone 17, iPhone 17 Air (or Slim; whatever it will be called), iPhone 17 Pro, and iPhone 17 Pro Max. Since the periscope cameras on the iPhone 16 Pro and Pro Max have 5x optical zoom, you can expect next year's Pro version to offer at least 5x optical zoom, but you won't get that with the iPhone 17 and iPhone 17 Air/Slim. Source (in Korean)",
  "image": "https://fdn.gsmarena.com/imgroot/news/24/11/apple-iphone-17-pro-model-periscope-camera/-952x498w6/gsmarena_001.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eApple unveiled the \u003ca href=\"https://www.gsmarena.com/apple_iphone_16-13317.php\"\u003eiPhone 16\u003c/a\u003e, \u003ca href=\"https://www.gsmarena.com/apple_iphone_16_plus-13316.php\"\u003eiPhone 16 Plus\u003c/a\u003e, \u003ca href=\"https://www.gsmarena.com/apple_iphone_16_pro-13315.php\"\u003eiPhone 16 Pro\u003c/a\u003e, and \u003ca href=\"https://www.gsmarena.com/apple_iphone_16_pro_max-13123.php\"\u003eiPhone 16 Pro Max\u003c/a\u003e in September, with only the Pro versions featuring periscope telephoto cameras. And if you were expecting next year\u0026#39;s non-Pro iPhone 17 models to sport periscope units, that\u0026#39;s not happening.\u003c/p\u003e\n\n\u003cp\u003eThe word comes from South Korean publication \u003ci\u003eThe Elec\u003c/i\u003e, which claims the periscope telephoto camera will remain exclusive to the Pro models in next year\u0026#39;s lineup, even though LG Innotek - that makes iPhone camera modules - is investing in new facilities, possibly for the upgraded iPhone 17 series camera modules.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"799\" alt=\"Apple iPhone 16 Pro Max\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/apple-iphone-17-pro-model-periscope-camera/inline/-1200w5/gsmarena_001.jpg\"/\u003e\n\u003cspan\u003e\u003cstrong\u003eApple iPhone 16 Pro Max\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThe iPhone 17 series is expected to include four models - iPhone 17, iPhone 17 Air (or Slim; whatever it will be called), iPhone 17 Pro, and iPhone 17 Pro Max. Since the periscope cameras on the iPhone 16 Pro and Pro Max have 5x optical zoom, you can expect next year\u0026#39;s Pro version to offer at least 5x optical zoom, but you won\u0026#39;t get that with the iPhone 17 and iPhone 17 Air/Slim.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://www.thelec.kr/news/articleView.html?idxno=31313\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSource\u003c/a\u003e (\u003ci\u003ein Korean\u003c/i\u003e)\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-23T23:00:02+01:00",
  "modifiedTime": null
}
