{
  "id": "292dbd4c-303f-45ee-9158-03d2b2d4d499",
  "title": "Android’s Theft Protection and Remote Lock Start Rolling Out",
  "link": "https://www.droid-life.com/2024/10/07/androids-theft-protection-and-remote-lock-start-rolling-out/",
  "description": "Back at Google I/O, Google announced a big set of security features called Theft Protection that would be coming soon to Android. They didn’t say at the time exactly when we’d see these features, but like with the new Google Photos AI search, folks started noticing a rollout over the weekend. The new Android Theft … Continued Read the original post: Android’s Theft Protection and Remote Lock Start Rolling Out",
  "author": "Kellen",
  "published": "Mon, 07 Oct 2024 23:06:00 +0000",
  "source": "https://www.droid-life.com/feed",
  "categories": [
    "Featured",
    "News",
    "Android Theft Protection",
    "Google"
  ],
  "byline": "Kellen",
  "length": 2819,
  "excerpt": "Back at Google I/O, Google announced a big set of security features called Theft Protection that would be coming soon to Android. They didn’t say at the time exactly when we’d see these features, but like with the new Google Photos AI search, folks started noticing a rollout over the weekend...",
  "siteName": "Droid Life",
  "favicon": "https://www.droid-life.com/favicon-512x512.png",
  "text": "Android’s Theft Protection and Remote Lock Start Rolling Out We may earn a commission when you click links to retailers and purchase goods. More info. Back at Google I/O, Google announced a big set of security features called Theft Protection that would be coming soon to Android. They didn’t say at the time exactly when we’d see these features, but like with the new Google Photos AI search, folks started noticing a rollout over the weekend. The new Android Theft Protection is made up of a Theft Detection Lock, Offline Device Lock, and a Remote Lock. The point, as each name suggests, is to give you a set of tools that can quickly lock down your device if it is stolen. From using AI to automatically detect theft or recognizing that it has been offline and should be locked just in case, all of this is a new level of protection on Android. On phone, Google describes Theft Protection as using “built-in safeguards to protect your personal data if your device is stolen.” They then breakdown each of its 3 features and previously described them as follows: Theft Detection Lock: The screen will lock if this setting detects that someone took your device and ran away “Theft Detection Lock is a powerful new feature that uses Google AI to sense if someone snatches your phone from your hand and tries to run, bike or drive away. If a common motion associated with theft is detected, your phone screen quickly locks – which helps keep thieves from easily accessing your data.” Offline Device Lock: The screen will lock shortly after your device goes offline to help protect your data “If a thief tries to disconnect your phone for prolonged periods of time, Offline Device Lock automatically locks your screen to help protect your data even when your device is off the grid. Android can also recognize other signs that your device may be in the wrong hands. For example, it will lock your device screen when excessive failed authentication attempts are made.” Remote Lock:If your device is stolen, you can lock its screen with just a phone number at android.com/lock “You’ll be able to lock the screen of your phone with just your phone number and a quick security challenge using any device. This buys you time to recover your account details and access additional helpful options in Find My Device, including sending a full factory reset command to completely wipe the device.” Once they hit your device, they will likely be turned off, so if this stuff sounds like it might come in handy, you’ll need to go looking for it. To find these settings, you’ll head into Settings and search for “Theft protection.” You could also find them in the Google section of settings under “Personal \u0026 device safety,” but searching is going to get you there the fastest.",
  "image": "https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-Remote-Lock-2-1200x628-cropped.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n        \u003cmain\u003e\n                      \n            \n                       \u003carticle\u003e\n  \u003cheader\u003e\n    \u003ch2\u003eAndroid’s Theft Protection and Remote Lock Start Rolling Out\u003c/h2\u003e\n    \n    \n\n\n  \u003c/header\u003e\n\t\n      \u003cp\u003e\u003cimg width=\"980\" height=\"653\" src=\"https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-Remote-Lock-2-980x653.jpg\" alt=\"Android Theft Protection - Remote Lock\" decoding=\"async\" data-object-fit=\"cover\" fetchpriority=\"high\" srcset=\"https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-Remote-Lock-2-980x653.jpg 980w, https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-Remote-Lock-2-270x180.jpg 270w, https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-Remote-Lock-2-768x512.jpg 768w, https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-Remote-Lock-2-1536x1024.jpg 1536w, https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-Remote-Lock-2-1366x911.jpg 1366w, https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-Remote-Lock-2.jpg 1800w\" sizes=\"(max-width: 980px) 100vw, 980px\" data-wp-pid=\"304613\"/\u003e\n\u003c/p\u003e\n    \n\u003cp\u003eWe may earn a commission when you click links to retailers and purchase goods. \u003ca href=\"https://www.droid-life.com/privacy-policy/\" target=\"_blank\"\u003eMore info.\u003c/a\u003e\u003c/p\u003e\n  \n    \u003cdiv data-sticky-container=\"\"\u003e\n        \u003cp\u003eBack at Google I/O, Google \u003ca href=\"https://www.droid-life.com/2024/05/15/google-to-deploy-new-theft-protection-features-for-android/\"\u003eannounced a big set of security features\u003c/a\u003e called Theft Protection that would be coming soon to Android. They didn’t say at the time exactly when we’d see these features, but like with the \u003ca href=\"https://www.droid-life.com/2024/10/07/google-photos-gets-ask-photos-ai-search-feature/\"\u003enew Google Photos AI search\u003c/a\u003e, folks started noticing a rollout over the weekend.\u003c/p\u003e\n\u003cp\u003eThe new Android Theft Protection is made up of a Theft Detection Lock, Offline Device Lock, and a Remote Lock. The point, as each name suggests, is to give you a set of tools that can quickly lock down your device if it is stolen. From using AI to automatically detect theft or recognizing that it has been offline and should be locked just in case, all of this is a new level of protection on Android.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.droid-life.com/2024/10/07/androids-theft-protection-and-remote-lock-start-rolling-out/android-theft-protection/\" rel=\"attachment wp-att-304611\" data-slb-active=\"1\" data-slb-asset=\"2084704023\" data-slb-internal=\"304611\" data-slb-group=\"304609\"\u003e\u003cimg decoding=\"async\" src=\"https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-980x915.jpg\" alt=\"Android Theft Protection - Remote Lock\" width=\"980\" height=\"915\" data-wp-pid=\"304611\" srcset=\"https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-980x915.jpg 980w, https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-270x252.jpg 270w, https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-768x717.jpg 768w, https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection-1366x1275.jpg 1366w, https://www.droid-life.com/wp-content/uploads/2024/10/Android-Theft-Protection.jpg 1500w\" sizes=\"(max-width: 980px) 100vw, 980px\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eOn phone, Google describes Theft Protection as using “built-in safeguards to protect your personal data if your device is stolen.” They then breakdown each of its 3 features and previously \u003ca href=\"https://blog.google/products/android/android-theft-protection/\"\u003edescribed\u003c/a\u003e them as follows:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eTheft Detection Lock\u003c/strong\u003e: The screen will lock if this setting detects that someone took your device and ran away\n\u003cul\u003e\n\u003cli\u003e“Theft Detection Lock is a powerful new feature that uses Google AI to sense if someone snatches your phone from your hand and tries to run, bike or drive away. If a common motion associated with theft is detected, your phone screen quickly locks – which helps keep thieves from easily accessing your data.”\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eOffline Device Lock\u003c/strong\u003e: The screen will lock shortly after your device goes offline to help protect your data\n\u003cul\u003e\n\u003cli\u003e“If a thief tries to disconnect your phone for prolonged periods of time, Offline Device Lock automatically locks your screen to help protect your data even when your device is off the grid. Android can also recognize other signs that your device may be in the wrong hands. For example, it will lock your device screen when excessive failed authentication attempts are made.”\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eRemote Lock\u003c/strong\u003e:If your device is stolen, you can lock its screen with just a phone number at \u003cem\u003eandroid.com/lock\u003c/em\u003e\n\u003cul\u003e\n\u003cli\u003e“You’ll be able to lock the screen of your phone with just your phone number and a quick security challenge using any device. This buys you time to recover your account details and access additional helpful options in Find My Device, including sending a full factory reset command to completely wipe the device.”\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOnce they hit your device, they will likely be turned off, so if this stuff sounds like it might come in handy, you’ll need to go looking for it. To find these settings, you’ll head into Settings and search for “Theft protection.” You could also find them in the Google section of settings under “Personal \u0026amp; device safety,” but searching is going to get you there the fastest.\u003c/p\u003e\n      \u003c/div\u003e\n\u003c/article\u003e\n\n\n  \n\n\t\n\n\n        \n                    \n          \n          \n        \u003c/main\u003e\n      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-07T23:06:00Z",
  "modifiedTime": "2024-10-07T23:06:02Z"
}
