{
  "id": "32062f2b-147f-4f4d-b871-afba68098a28",
  "title": "vivo details OriginOS 5: faster, more efficient, AI features on the go, at home and in the car",
  "link": "https://www.gsmarena.com/vivo_details_originos_5_faster_more_efficient_ai_features_on_the_go_at_home_and_in_the_car-news-64868.php",
  "description": "vivo and iQOO are due to start rolling out Android 15 beta to select phones soon (mid-October is the official timeline) and today vivo did a formal introduction of OriginOS 5, the new version of its OS that is based on the latest Android version. It promises improvements across the board, from 15% faster application startup and 30% faster app switching time to reducing CPU power consumption by 26%. The new system also intelligently allocates GPU and RAM resources to keep the foreground app running as smoothly as possible. OriginOS 5 will let you customize the lockscreen by adding...",
  "author": "",
  "published": "Thu, 10 Oct 2024 11:35:01 +0200",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Peter",
  "length": 3166,
  "excerpt": "The Little V assistant will organize the photos from your trip, handle a call in another language for you, come up with helpful suggestions and more.",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "vivo and iQOO are due to start rolling out Android 15 beta to select phones soon (mid-October is the official timeline) and today vivo did a formal introduction of OriginOS 5, the new version of its OS that is based on the latest Android version. It promises improvements across the board, from 15% faster application startup and 30% faster app switching time to reducing CPU power consumption by 26%. The new system also intelligently allocates GPU and RAM resources to keep the foreground app running as smoothly as possible. OriginOS 5 will let you customize the lockscreen by adding controls and widgets. The company also updated the design language of the user interface to have more consistent layouts and appearance. And it shouldn’t surprise you that AI is a highlight of this update. It’s all centered around the “Blue Heart Little V assistant”. vivo has launched its own version of “circle to search”, which brings up Little V with search results and recommendations based on what you circled. You can create virtual clipboards with photos, videos, published articles, links and more. Little V will organize those into “memory fragments” based on your activities and travels to preserve important moments. As for your personal photos and videos, it will organize them into highlight reels, complete with music and even lyrics that match the mood of the reel. There is a new Dynamic Island style UI that pops up cards at the top of the screen when you copy a piece of content – the context-sensitive AI will automatically associate that content with relevant activities. You can also use drag and drop to add more. Similar cards will be dynamically refreshed to offer relevant information based on time and location. The unified Settings page will help you get all of these smart features under control. Little V will help you write and re-write messages, of course. It can even handle calls for you in several languages – when the call is done, it will provide you with a summary in the Atom Notes app. It can break down another communication barrier – it can interpret sign language and communicate using a virtual human avatar. Little V can also help visually impaired users with their daily needs. Little V can be your navigator too as it connects to your car’s infotainment system. It can help you answer calls and messages. As above, it can handle the call all by itself and just give you a summary. You can also talk to it and ask it questions about the messages you’ve received. OriginOS 5 is gaining support for the Matter protocol, which will allow it to orchestrate your smart home. You will be able to quickly check the status of and control things like air conditioners, lights and other smart gadgets by pulling down the control center. Finally, Little V is available for Windows, Mac and as an online version, allowing you to smoothly transition from using it on your phone to using it on your computer. OriginOS 5 is coming to recent flagships in the vivo X and iQOO series. Updates will continue with older models into 2025. Follow the Source link for the official timeline for OriginOS's rollout in China. Source (in Chinese)",
  "image": "https://fdn.gsmarena.com/imgroot/news/24/10/originos-5-unveiled/-952x498w6/gsmarena_000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003evivo and iQOO are due to start rolling out Android 15 beta to select phones soon (mid-October is the official timeline) and today vivo did a formal introduction of OriginOS 5, the new version of its OS that is based on the latest Android version.\u003c/p\u003e\n\n\u003cp\u003eIt promises improvements across the board, from 15% faster application startup and 30% faster app switching time to reducing CPU power consumption by 26%. The new system also intelligently allocates GPU and RAM resources to keep the foreground app running as smoothly as possible.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"508\" src=\"https://fdn.gsmarena.com/imgroot/news/24/10/originos-5-unveiled/inline/-1200/gsmarena_001.jpg\" alt=\"vivo details OriginOS 5: faster, more efficient, AI features on the go, at home and in the car\"/\u003e\u003c/p\u003e\u003cp\u003eOriginOS 5 will let you customize the lockscreen by adding controls and widgets. The company also updated the design language of the user interface to have more consistent layouts and appearance.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"474\" src=\"https://fdn.gsmarena.com/imgroot/news/24/10/originos-5-unveiled/inline/-1200/gsmarena_002.jpg\" alt=\"vivo details OriginOS 5: faster, more efficient, AI features on the go, at home and in the car\"/\u003e\u003c/p\u003e\u003cp\u003eAnd it shouldn’t surprise you that AI is a highlight of this update. It’s all centered around the “Blue Heart Little V assistant”. vivo has launched its own version of “circle to search”, which brings up Little V with search results and recommendations based on what you circled.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"660\" src=\"https://fdn.gsmarena.com/imgroot/news/24/10/originos-5-unveiled/inline/-1200/gsmarena_003.jpg\" alt=\"vivo details OriginOS 5: faster, more efficient, AI features on the go, at home and in the car\"/\u003e\u003c/p\u003e\u003cp\u003eYou can create virtual clipboards with photos, videos, published articles, links and more. Little V will organize those into “memory fragments” based on your activities and travels to preserve important moments.\u003c/p\u003e\n\n\u003cp\u003eAs for your personal photos and videos, it will organize them into highlight reels, complete with music and even lyrics that match the mood of the reel.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"471\" src=\"https://fdn.gsmarena.com/imgroot/news/24/10/originos-5-unveiled/inline/-1200/gsmarena_004.jpg\" alt=\"vivo details OriginOS 5: faster, more efficient, AI features on the go, at home and in the car\"/\u003e\u003c/p\u003e\u003cp\u003eThere is a new Dynamic Island style UI that pops up cards at the top of the screen when you copy a piece of content – the context-sensitive AI will automatically associate that content with relevant activities. You can also use drag and drop to add more.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"713\" src=\"https://fdn.gsmarena.com/imgroot/news/24/10/originos-5-unveiled/inline/-1200/gsmarena_005.jpg\" alt=\"vivo details OriginOS 5: faster, more efficient, AI features on the go, at home and in the car\"/\u003e\u003c/p\u003e\u003cp\u003eSimilar cards will be dynamically refreshed to offer relevant information based on time and location. The unified Settings page will help you get all of these smart features under control.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"313\" src=\"https://fdn.gsmarena.com/imgroot/news/24/10/originos-5-unveiled/inline/-1200/gsmarena_006.jpg\" alt=\"vivo details OriginOS 5: faster, more efficient, AI features on the go, at home and in the car\"/\u003e\u003c/p\u003e\u003cp\u003eLittle V will help you write and re-write messages, of course. It can even handle calls for you in several languages – when the call is done, it will provide you with a summary in the Atom Notes app.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"606\" src=\"https://fdn.gsmarena.com/imgroot/news/24/10/originos-5-unveiled/inline/-1200/gsmarena_007.jpg\" alt=\"vivo details OriginOS 5: faster, more efficient, AI features on the go, at home and in the car\"/\u003e\u003c/p\u003e\u003cp\u003eIt can break down another communication barrier – it can interpret sign language and communicate using a virtual human avatar. Little V can also help visually impaired users with their daily needs.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"719\" src=\"https://fdn.gsmarena.com/imgroot/news/24/10/originos-5-unveiled/inline/-1200/gsmarena_008.jpg\" alt=\"vivo details OriginOS 5: faster, more efficient, AI features on the go, at home and in the car\"/\u003e\u003c/p\u003e\u003cp\u003eLittle V can be your navigator too as it connects to your car’s infotainment system. It can help you answer calls and messages. As above, it can handle the call all by itself and just give you a summary. You can also talk to it and ask it questions about the messages you’ve received.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"638\" src=\"https://fdn.gsmarena.com/imgroot/news/24/10/originos-5-unveiled/inline/-1200/gsmarena_009.jpg\" alt=\"vivo details OriginOS 5: faster, more efficient, AI features on the go, at home and in the car\"/\u003e\u003c/p\u003e\u003cp\u003eOriginOS 5 is gaining support for the Matter protocol, which will allow it to orchestrate your smart home. You will be able to quickly check the status of and control things like air conditioners, lights and other smart gadgets by pulling down the control center.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"738\" src=\"https://fdn.gsmarena.com/imgroot/news/24/10/originos-5-unveiled/inline/-1200/gsmarena_010.jpg\" alt=\"vivo details OriginOS 5: faster, more efficient, AI features on the go, at home and in the car\"/\u003e\u003c/p\u003e\u003cp\u003eFinally, Little V is available for Windows, Mac and as an online version, allowing you to smoothly transition from using it on your phone to using it on your computer.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"744\" src=\"https://fdn.gsmarena.com/imgroot/news/24/10/originos-5-unveiled/inline/-1200/gsmarena_011.jpg\" alt=\"vivo details OriginOS 5: faster, more efficient, AI features on the go, at home and in the car\"/\u003e\u003c/p\u003e\u003cp\u003eOriginOS 5 is coming to recent flagships in the vivo X and iQOO series. Updates will continue with older models into 2025. Follow the Source link for the official timeline for OriginOS\u0026#39;s rollout in China.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://www.vivo.com.cn/originos\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSource\u003c/a\u003e (in Chinese)\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-10T11:35:01+02:00",
  "modifiedTime": null
}
