{
  "id": "3f352996-3e75-4bb9-a299-363ba90f6a55",
  "title": "Samsung Galaxy Z Flip7 leaks in CAD-based renders",
  "link": "https://www.gsmarena.com/samsung_galaxy_z_flip7_leaks_in_cadbased_renders-news-66731.php",
  "description": "Yesterday we saw the first set of leaked renders depicting the upcoming Samsung Galaxy Z Fold7, and today the Galaxy Z Flip7 has received the exact same treatment. Like the Fold7's, these are also CAD-based, so minor details could still be different with the final product, but they do give us a very good idea of what to expect, design-wise, from Samsung's next flagship flip-style foldable. The source of the renders claims the Flip7 will measure 166.6 x 75.2 x 6.9 mm when unfolded (9.1 mm thick with the camera bumps). This means the device will be ever so slightly taller, much wider,...",
  "author": "",
  "published": "Wed, 26 Feb 2025 23:59:02 +0100",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Vlad",
  "length": 1586,
  "excerpt": "It will be slightly bigger than its predecessor. Yesterday we saw the first set of leaked renders depicting the upcoming Samsung Galaxy Z Fold7, and today...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "Yesterday we saw the first set of leaked renders depicting the upcoming Samsung Galaxy Z Fold7, and today the Galaxy Z Flip7 has received the exact same treatment. Like the Fold7's, these are also CAD-based, so minor details could still be different with the final product, but they do give us a very good idea of what to expect, design-wise, from Samsung's next flagship flip-style foldable. The source of the renders claims the Flip7 will measure 166.6 x 75.2 x 6.9 mm when unfolded (9.1 mm thick with the camera bumps). This means the device will be ever so slightly taller, much wider, and the same thickness as its predecessor. The added size is there to accommodate larger screens - 6.8\" on the inside and 3.6\" on the outside. The Flip7 will still have just two main cameras, a 50 MP main one and a 12 MP ultrawide. Apparently we could be getting upgraded sensors compared to the Flip6, even though the resolutions are the same. The Flip7 might be powered by the Exynos 2500 SoC, depending on how much the yields improve. If not, it will go with the Snapdragon 8 Elite, though it's not clear if it will use the seven-core version. RAM will be 12GB and storage options will be 256GB and 512GB. Pricing is expected to remain the same as last year when the Flip6 launched, which is a good thing since we're not seeing a hike, but a not-so-great thing considering how we've been waiting for foldable smartphone prices to go down for years and yet they never have to any considerable extent. Finally, some good news: the crease will be less visible than it is on the Flip6. Source",
  "image": "https://fdn.gsmarena.com/imgroot/news/25/02/samsung-galaxy-z-flip7-leaked-renders/-952x498w6/gsmarena_000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eYesterday we saw the first set of \u003ca href=\"https://www.gsmarena.com/samsung_galaxy_z_fold7_renders_show_a_thinner_device-news-66687.php\"\u003eleaked renders depicting the upcoming Samsung Galaxy Z Fold7\u003c/a\u003e, and today the \u003ca href=\"https://www.gsmarena.com/samsung_galaxy_z_flip7_and_galaxy_z_fold7_pricing_revealed-news-66288.php\"\u003eGalaxy Z Flip7\u003c/a\u003e has received the exact same treatment. Like the Fold7\u0026#39;s, these are also CAD-based, so minor details could still be different with the final product, but they do give us a very good idea of what to expect, design-wise, from Samsung\u0026#39;s next flagship flip-style foldable.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"675\" src=\"https://fdn.gsmarena.com/imgroot/news/25/02/samsung-galaxy-z-flip7-leaked-renders/inline/-1200/gsmarena_001.jpg\" alt=\"Samsung Galaxy Z Flip7 leaks in CAD-based renders\"/\u003e\u003c/p\u003e\u003cp\u003eThe source of the renders claims the Flip7 will measure 166.6 x 75.2 x 6.9 mm when unfolded (9.1 mm thick with the camera bumps). This means the device will be ever so slightly taller, much wider, and the same thickness as \u003ca href=\"https://www.gsmarena.com/samsung_galaxy_z_flip6-13192.php\"\u003eits predecessor\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"675\" src=\"https://fdn.gsmarena.com/imgroot/news/25/02/samsung-galaxy-z-flip7-leaked-renders/inline/-1200/gsmarena_002.jpg\" alt=\"Samsung Galaxy Z Flip7 leaks in CAD-based renders\"/\u003e\u003c/p\u003e\u003cp\u003eThe added size is there to accommodate larger screens - 6.8\u0026#34; on the inside and 3.6\u0026#34; on the outside. The Flip7 will still have just two main cameras, a 50 MP main one and a 12 MP ultrawide. Apparently we could be getting upgraded sensors compared to the Flip6, even though the resolutions are the same.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"675\" src=\"https://fdn.gsmarena.com/imgroot/news/25/02/samsung-galaxy-z-flip7-leaked-renders/inline/-1200/gsmarena_003.jpg\" alt=\"Samsung Galaxy Z Flip7 leaks in CAD-based renders\"/\u003e\u003c/p\u003e\u003cp\u003eThe Flip7 might be powered by the \u003ca href=\"https://www.gsmarena.com/galaxy_z_flip7_again_rumored_to_be_samsungs_first_exynospowered_foldable-news-65879.php\"\u003eExynos 2500 SoC\u003c/a\u003e, depending on how much the yields improve. If not, it will go with the Snapdragon 8 Elite, though it\u0026#39;s not clear if it will use the \u003ca href=\"https://www.gsmarena.com/theres_a_snapdragon_8_elite_version_with_just_seven_cpu_cores_now-news-66148.php\"\u003eseven-core version\u003c/a\u003e. RAM will be 12GB and storage options will be 256GB and 512GB.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"675\" src=\"https://fdn.gsmarena.com/imgroot/news/25/02/samsung-galaxy-z-flip7-leaked-renders/inline/-1200/gsmarena_004.jpg\" alt=\"Samsung Galaxy Z Flip7 leaks in CAD-based renders\"/\u003e\u003c/p\u003e\u003cp\u003ePricing is expected to remain the same as last year when the Flip6 launched, which is a good thing since we\u0026#39;re not seeing a hike, but a not-so-great thing considering how we\u0026#39;ve been waiting for foldable smartphone prices to go down for years and yet they never have to any considerable extent. Finally, some good news: the crease will be less visible than it is on the Flip6.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://www.androidheadlines.com/samsung-galaxy-z-flip-7-leak\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSource\u003c/a\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-02-26T23:59:02+01:00",
  "modifiedTime": null
}
