{
  "id": "49cc0c8e-89da-4289-bf34-10f34a3e7c7b",
  "title": "Space Cadet Pinball, of Windows Fame, Now on Android!",
  "link": "https://www.droid-life.com/2025/05/19/space-cadet-pinball-of-windows-fame-now-on-android/",
  "description": "It was many years ago when I would hang out inside of a RadioShack in Oakland, CA, waiting for my mom to get off from work. While I was loitering inside the store, I would play Space Cadet Pinball on the store’s demo computer. The employees were kind enough to let me play for many … Continued Read the original post: Space Cadet Pinball, of Windows Fame, Now on Android!",
  "author": "Tim",
  "published": "Mon, 19 May 2025 21:47:55 +0000",
  "source": "https://www.droid-life.com/feed",
  "categories": [
    "Games",
    "News",
    "Android",
    "Android Games"
  ],
  "byline": "Tim",
  "length": 1514,
  "excerpt": "It was many years ago when I would hang out inside of a RadioShack in Oakland, CA, waiting for my mom to get off from work. While I was loitering inside the store, I would play Space Cadet Pinball on the store’s demo computer. The employees were kind enough to let me play for many hours, but in...",
  "siteName": "Droid Life",
  "favicon": "https://www.droid-life.com/favicon-512x512.png",
  "text": "Space Cadet Pinball, of Windows Fame, Now on Android! May 19, 2025 We may earn a commission when you click links to retailers and purchase goods. More info. It was many years ago when I would hang out inside of a RadioShack in Oakland, CA, waiting for my mom to get off from work. While I was loitering inside the store, I would play Space Cadet Pinball on the store’s demo computer. The employees were kind enough to let me play for many hours, but in exchange they asked that I restocked some shelves and swept the floors. They basically had an unpaid, underage employee, but I didn’t care — I was having fun. Now, in 2025, I can relive those glory days right on my Android phone. Space Cadet Pinball has been ported to Android in all of its original glory. This isn’t some hopped up new version. This is the OG, originally coming preinstalled on Windows machines back in the day. The game apparently has a pretty cool history which I was unaware of. You can read more about it on the title’s Wiki page. Features Brand new portrait mode Support for 18 languages Google Play Leaderboard 100% free, no ads Less than 5MB download It’s totally free with no ads, plus there are leaderboards powered by Google Play. As of right now, the porter hasn’t allowed for the game’s cheats, but that could be in the works. This is going to be a perfect time suck the next time I’m stuck on a flight or on the toilet. Thank you to those who made it happen. // reddit",
  "image": "https://www.droid-life.com/wp-content/uploads/2025/05/Space-Cadet-Pinball-1200x628-cropped.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n        \u003cmain\u003e\n                      \n            \n                       \u003carticle\u003e\n  \u003cheader\u003e\n    \u003ch2\u003eSpace Cadet Pinball, of Windows Fame, Now on Android!\u003c/h2\u003e\n    \u003cp\u003e\n  \u003ctime datetime=\"2025-05-19T21:47:55+00:00\"\u003eMay 19, 2025\u003c/time\u003e\n        \n  \u003c/p\u003e\n    \n\n\n  \u003c/header\u003e\n\t\n      \u003cp\u003e\u003cimg width=\"980\" height=\"653\" src=\"https://www.droid-life.com/wp-content/uploads/2025/05/Space-Cadet-Pinball-980x653.jpg\" alt=\"\" decoding=\"async\" data-object-fit=\"cover\" fetchpriority=\"high\" srcset=\"https://www.droid-life.com/wp-content/uploads/2025/05/Space-Cadet-Pinball-980x653.jpg 980w, https://www.droid-life.com/wp-content/uploads/2025/05/Space-Cadet-Pinball-270x180.jpg 270w, https://www.droid-life.com/wp-content/uploads/2025/05/Space-Cadet-Pinball-768x512.jpg 768w, https://www.droid-life.com/wp-content/uploads/2025/05/Space-Cadet-Pinball-1536x1024.jpg 1536w, https://www.droid-life.com/wp-content/uploads/2025/05/Space-Cadet-Pinball-1366x911.jpg 1366w, https://www.droid-life.com/wp-content/uploads/2025/05/Space-Cadet-Pinball.jpg 1800w\" sizes=\"(max-width: 980px) 100vw, 980px\" data-wp-pid=\"308684\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20980%20653\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"/wp-content/uploads/2025/05/Space-Cadet-Pinball-980x653.jpg 980w, /wp-content/uploads/2025/05/Space-Cadet-Pinball-270x180.jpg 270w, /wp-content/uploads/2025/05/Space-Cadet-Pinball-768x512.jpg 768w, /wp-content/uploads/2025/05/Space-Cadet-Pinball-1536x1024.jpg 1536w, /wp-content/uploads/2025/05/Space-Cadet-Pinball-1366x911.jpg 1366w, /wp-content/uploads/2025/05/Space-Cadet-Pinball.jpg 1800w\" data-lazy-src=\"/wp-content/uploads/2025/05/Space-Cadet-Pinball-980x653.jpg\"/\u003e\n\u003c/p\u003e\n    \n\u003cp\u003eWe may earn a commission when you click links to retailers and purchase goods. \u003ca href=\"https://www.droid-life.com/privacy-policy/\" target=\"_blank\"\u003eMore info.\u003c/a\u003e\u003c/p\u003e\n  \n    \u003cdiv data-sticky-container=\"\"\u003e\n        \u003cp\u003eIt was many years ago when I would hang out inside of a RadioShack in Oakland, CA, waiting for my mom to get off from work. While I was loitering inside the store, I would play \u003cstrong\u003eSpace Cadet Pinball\u003c/strong\u003e on the store’s demo computer. The employees were kind enough to let me play for many hours, but in exchange they asked that I restocked some shelves and swept the floors. They basically had an unpaid, underage employee, but I didn’t care — I was having fun. Now, in 2025, I can relive those glory days right on my Android phone.\u003c/p\u003e\n\u003cp\u003eSpace Cadet Pinball has been ported to Android in all of its original glory. This isn’t some hopped up new version. This is the OG, originally coming preinstalled on Windows machines back in the day. The game apparently has a pretty cool history which I was unaware of. You can read more about it on the \u003ca href=\"https://en.wikipedia.org/wiki/Full_Tilt!_Pinball\" target=\"_blank\" rel=\"noopener\"\u003etitle’s Wiki page\u003c/a\u003e.\u003c/p\u003e\n\u003ch3\u003eFeatures\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eBrand new portrait mode\u003c/li\u003e\n\u003cli\u003eSupport for 18 languages\u003c/li\u003e\n\u003cli\u003eGoogle Play Leaderboard\u003c/li\u003e\n\u003cli\u003e100% free, no ads\u003c/li\u003e\n\u003cli\u003eLess than 5MB download\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIt’s totally free with no ads, plus there are leaderboards powered by Google Play. As of right now, the porter hasn’t allowed for the game’s cheats, but that could be in the works.\u003c/p\u003e\n\u003cp\u003eThis is going to be a perfect time suck the next time I’m stuck on a flight or on the toilet. Thank you to those who made it happen.\u003c/p\u003e\n\u003cp\u003e// \u003ca href=\"https://www.reddit.com/r/Android/comments/1kql66u/space_cadet_pinball/\" target=\"_blank\" rel=\"noopener\"\u003ereddit\u003c/a\u003e\u003c/p\u003e\n      \u003c/div\u003e\n\u003c/article\u003e\n\n\n  \n\n\t\n\n\n        \n                    \n          \n          \n        \u003c/main\u003e\n      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-05-19T21:47:55Z",
  "modifiedTime": "2025-05-19T21:47:55Z"
}
