{
  "id": "8cd9f9a5-c22d-495e-8228-3c462ef541e6",
  "title": "Android Will Soon Restart your Phone If It’s Locked for 3 Consecutive Days",
  "link": "https://www.droid-life.com/2025/04/15/android-will-soon-restart-your-phone-if-its-locked-for-3-consecutive-days/",
  "description": "As a part of the latest version of Google Play Services that started arriving yesterday, Google is preparing to introduce a new security feature that could be super handy if your phone is lost or stolen. A “future optional security feature” will automatically restart your device if it sits locked for 3 consecutive days. In … Continued Read the original post: Android Will Soon Restart your Phone If It’s Locked for 3 Consecutive Days",
  "author": "Kellen",
  "published": "Tue, 15 Apr 2025 22:26:38 +0000",
  "source": "https://www.droid-life.com/feed",
  "categories": [
    "News",
    "Android",
    "Security"
  ],
  "byline": "Kellen",
  "length": 2865,
  "excerpt": "As a part of the latest version of Google Play Services that started arriving yesterday, Google is preparing to introduce a new security feature that could be super handy if your phone is lost or stolen. A “future optional security feature” will automatically restart your device if it sits...",
  "siteName": "Droid Life",
  "favicon": "https://www.droid-life.com/favicon-512x512.png",
  "text": "We may earn a commission when you click links to retailers and purchase goods. More info. As a part of the latest version of Google Play Services that started arriving yesterday, Google is preparing to introduce a new security feature that could be super handy if your phone is lost or stolen. A “future optional security feature” will automatically restart your device if it sits locked for 3 consecutive days. In the changelog for Google Play Services v25.14, Google says it is introducing this feature, although they do refer to it as “future optional.” So it isn’t here yet, but this new update to Play Services must be preparing Android devices for its arrival. Anyways, the details are scarce here, but the simple description from Google is pretty self explanatory. Essentially, if your device were to sit around for 3 consecutive days (72 hours), Android would recognize that and then automatically restart it. Why, you ask? Because restarting adds a further level of security. By restarting, your Android phone flips to a Before First Unlock state that has mostly signed you out of your phone. To get everything active again, you would have to unlock your device (like with a pattern or PIN). So the thought here is that if your phone is sitting idle and locked for 3 days in a row, it might be worth it to have it the security upped, thus the automatic restart to a more secure state. Again, Google only added this note to the changelog for April’s Google System Releases Notes page yesterday and is calling it optional and something that may still be introduced in the future. If it shows up, let us know and then we’ll let everyone else know. Here’s the rest of the changelog: Device Connectivity [Phone] With this feature, receivers get a preview of content before they accept a Quick Share transfer. [Auto, Phone, TV, Wear] We’ve fixed issues with device connections-related services to improve your overall experience. Location \u0026 Context [Phone] Updating on-device location history settings page to support Google Material expressive components. Security \u0026 Privacy [Phone] Enables a future optional security feature, which will automatically restart your device if locked for 3 consecutive days. System Management [Auto, PC, Phone, TV, Wear] Updates to system management services that improve Stability. [Auto] With this new feature, Location Time Zone Provider (LTZP) is now available. [Auto, PC, Phone, TV, Wear] With this feature, you’ll find an updated UI for the Usage and diagnostics screen. Utilities [Phone] With this feature, it’s easier to set up your new device and transfer data from your old device. [Phone] Bug fixes for Utilities related services. Wallet [Phone] New developer features for Google and third party app developers to support Digital Wallet \u0026 Payments related processes in their apps. // Google",
  "image": "https://www.droid-life.com/wp-content/uploads/2024/08/Android-Bugdroid-1-1200x628-cropped.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-rocket-location-hash=\"87f24370291d5e7aae344f3a23c1ecc5\"\u003e\n        \u003cmain data-rocket-location-hash=\"0d590a76a0a5f51b5f37b736681854b5\"\u003e\n                      \n            \n                       \u003carticle\u003e\n  \u003cheader\u003e\n    \n    \n    \n\n\n  \u003c/header\u003e\n\t\n      \u003cp\u003e\u003cimg width=\"980\" height=\"653\" src=\"https://www.droid-life.com/wp-content/uploads/2024/08/Android-Bugdroid-1-980x653.jpg\" alt=\"Android - Bugdroid\" decoding=\"async\" data-object-fit=\"cover\" fetchpriority=\"high\" srcset=\"https://www.droid-life.com/wp-content/uploads/2024/08/Android-Bugdroid-1-980x653.jpg 980w, https://www.droid-life.com/wp-content/uploads/2024/08/Android-Bugdroid-1-270x180.jpg 270w, https://www.droid-life.com/wp-content/uploads/2024/08/Android-Bugdroid-1-768x512.jpg 768w, https://www.droid-life.com/wp-content/uploads/2024/08/Android-Bugdroid-1-1536x1024.jpg 1536w, https://www.droid-life.com/wp-content/uploads/2024/08/Android-Bugdroid-1-1366x911.jpg 1366w, https://www.droid-life.com/wp-content/uploads/2024/08/Android-Bugdroid-1.jpg 1800w\" sizes=\"(max-width: 980px) 100vw, 980px\" data-wp-pid=\"303377\"/\u003e\n\u003c/p\u003e\n    \n\u003cp\u003eWe may earn a commission when you click links to retailers and purchase goods. \u003ca href=\"https://www.droid-life.com/privacy-policy/\" target=\"_blank\"\u003eMore info.\u003c/a\u003e\u003c/p\u003e\n  \n    \u003cdiv data-sticky-container=\"\"\u003e\n        \u003cp\u003eAs a part of the latest version of Google Play Services that started arriving yesterday, Google is preparing to introduce a new security feature that could be super handy if your phone is lost or stolen. A “future optional security feature” will automatically restart your device if it sits locked for 3 consecutive days.\u003c/p\u003e\n\u003cp\u003eIn the changelog for \u003cstrong\u003eGoogle Play Services v25.14\u003c/strong\u003e, Google says it is introducing this feature, although they do refer to it as “future optional.” So it isn’t here yet, but this new update to Play Services must be preparing Android devices for its arrival.\u003c/p\u003e\n\u003cp\u003eAnyways, the details are scarce here, but the simple description from Google is pretty self explanatory. Essentially, if your device were to sit around for 3 consecutive days (72 hours), Android would recognize that and then automatically restart it.\u003c/p\u003e\n\u003cp\u003eWhy, you ask? Because restarting adds a further level of security. By restarting, your Android phone flips to a Before First Unlock state that has mostly signed you out of your phone. To get everything active again, you would have to unlock your device (like with a pattern or PIN). So the thought here is that if your phone is sitting idle and locked for 3 days in a row, it might be worth it to have it the security \u003cem\u003eupped\u003c/em\u003e, thus the automatic restart to a more secure state.\u003c/p\u003e\n\u003cp\u003eAgain, Google only added this note to the changelog for April’s Google System Releases Notes page yesterday and is calling it optional and something that may still be introduced in the future. If it shows up, let us know and then we’ll let everyone else know.\u003c/p\u003e\n\u003cp\u003eHere’s the rest of the changelog:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e\u003cstrong\u003eDevice Connectivity\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e[Phone] With this feature, receivers get a preview of content before they accept a Quick Share transfer.\u003c/li\u003e\n\u003cli data-outlined=\"false\"\u003e[Auto, Phone, TV, Wear] We’ve fixed issues with device connections-related services to improve your overall experience.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eLocation \u0026amp; Context\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e[Phone] Updating on-device location history settings page to support Google Material expressive components.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSecurity \u0026amp; Privacy\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e[Phone] Enables a future optional security feature, which will automatically restart your device if locked for 3 consecutive days.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong data-outlined=\"false\"\u003eSystem Management\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli data-outlined=\"false\"\u003e[Auto, PC, Phone, TV, Wear] Updates to system management services that improve Stability.\u003c/li\u003e\n\u003cli data-outlined=\"false\"\u003e[Auto] With this new feature, Location Time Zone Provider (LTZP) is now available.\u003c/li\u003e\n\u003cli data-outlined=\"false\"\u003e[Auto, PC, Phone, TV, Wear] With this feature, you’ll find an updated UI for the Usage and diagnostics screen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong data-outlined=\"false\"\u003eUtilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e[Phone] With this feature, it’s easier to set up your new device and transfer data from your old device.\u003c/li\u003e\n\u003cli\u003e[Phone] Bug fixes for Utilities related services.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWallet\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e[Phone] New developer features for Google and third party app developers to support Digital Wallet \u0026amp; Payments related processes in their apps.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e// \u003ca href=\"https://support.google.com/product-documentation/answer/14343500?hl=en\u0026amp;ref_topic=11273470\u0026amp;sjid=7541414567696638085-NC#:~:text=Enables%20a%20future%20optional%20security%20feature%2C%20which%20will%20automatically%20restart%20your%20device%20if%20locked%20for%203%20consecutive%20days.\"\u003eGoogle\u003c/a\u003e\u003c/p\u003e\n      \u003c/div\u003e\n\u003c/article\u003e\n\n\n  \n\n\t\n\n\n        \n                    \n          \n          \n        \u003c/main\u003e\n      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-15T22:26:38Z",
  "modifiedTime": "2025-04-15T22:26:38Z"
}
