{
  "id": "92c95b55-53c5-436b-b11d-a73f5d5dbb39",
  "title": "Yes, Samsung, We Want the Qi2 Magnets Built Into the Phone",
  "link": "https://www.droid-life.com/2025/07/15/yes-samsung-we-want-the-qi2-magnets-built-into-the-phone/",
  "description": "If you can believe it, the year was 2020 that Apple introduced its MagSafe tech for phones, starting with the iPhone 12. That new edition of MagSafe for phones brought built-in magnets to devices that could be attached to wireless chargers and other accessories, like wallets. The magnetic connection to accessories was all possible without … Continued Read the original post: Yes, Samsung, We Want the Qi2 Magnets Built Into the Phone",
  "author": "Kellen",
  "published": "Tue, 15 Jul 2025 20:45:14 +0000",
  "source": "https://www.droid-life.com/feed",
  "categories": [
    "Featured",
    "News",
    "Opinion",
    "Qi2",
    "Samsung"
  ],
  "byline": "Kellen",
  "length": 3958,
  "excerpt": "If you can believe it, the year was 2020 that Apple introduced its MagSafe tech for phones, starting with the iPhone 12. That new edition of MagSafe for phones brought built-in magnets to devices that could be attached to wireless chargers and other accessories, like wallets. The magnetic...",
  "siteName": "Droid Life",
  "favicon": "https://www.droid-life.com/favicon-512x512.png",
  "text": "If you can believe it, the year was 2020 that Apple introduced its MagSafe tech for phones, starting with the iPhone 12. That new edition of MagSafe for phones brought built-in magnets to devices that could be attached to wireless chargers and other accessories, like wallets. The magnetic connection to accessories was all possible without the need for a case, but Apple did introduce MagSafe cases alongside the phone and has since for those who need phone protection and still want to take advantage of magnets. Apple’s MagSafe tech has spawned thousands of accessories from top brands since it was first introduced 5 years ago. It has without a doubt been one of the top phone or tech feature introductions in recent memory. In fact, it became such a big piece of the tech industry so quickly that the Wireless Power Consortium (WPC) and its partners likely begged Apple to let them make it a part of their new Qi2 charging standard, which happened. At the end of 2023, the WPC announced that its Qi2 standard was ready and that the iPhone 15 line would be the first to receive certification. We then started counting the days that passed in hopes of someone from the Android side of the world taking a stab at Qi2. Unfortunately, we’re mid-way through 2025 and none of the top Android phone makers (Samsung, Google, OnePlus, etc.) have taken on Qi2, at least in the form that truly matters. Instead, Samsung first helped usher in the era of “Qi2 Ready” with the Galaxy S25 series, a certification that made a device meet enough technical requirements to accept the “Qi2” brand only without going all in. And by not going all in, they had to leave out something, right? What would that be? The magnets. The most important part of Apple’s MagSafe and Qi2, the magical magnets, were not needed within devices if they wanted to be “Qi2 Ready.” The WPC was allowing companies like Samsung to release cases with magnets that could be attached to devices and then approve them as “Qi2 Ready.” It seemed like the exact move Qi2 was meant to avoid – confusion. Because with Qi2 and “Qi2 Ready,” we now already have two types of Qi2. There’s the true version that Apple uses, with magnets built into a phone and then this “Ready” version that lets phonemakers off the hook from taking the time to follow the hardware lead Apple started 5 years ago. While a case that’s approved for Qi2 does allow Qi2 functionality, there’s this whole thing about it requiring a case in order to work. Not all of us use cases. Not all of us want to spend the money for a case that has met the standard of “Qi2 Ready” and likely carries a larger price tag. Some of us might use a case without a backside and would like the phone to have magnets within. Or maybe a case needs to be removed and the magnets might still be handy, for whatever your situation may be. You get the point. Qi2 was supposed to mean magnets built-in and then the WPC caved (at least in my mind), allowing for a work-around. I bring this up today because Samsung has reportedly introduced a survey through their Samsung Members app that specifically asks for feedback on this situation. The survey asks folks if they would “prefer to have magnets built into the phone even if it made the phone thicker?” I’ll go ahead and answer that for everyone: YES. WE WANT THE MAGNETS IN THE PHONE, SAMSUNG. The survey actually breaks out the answers some to let people say if they’d rather the device not become thicker or if they’d be OK with some added thickness. Two of the answers suggest it could only add 0.3 or 0.5mm of thickness, which is basically nothing. Like, if that’s all that was holding you back Samsung…good lord. It’s hard to know what this survey means in terms of Samsung taking the idea seriously or not. This late in the game, I’d guess this doesn’t mean a Galaxy S26 will have magnets built into the device. Maybe it’ll mean the Galaxy Z Fold 8 or Galaxy S27 sees it. Those both seem so far away.",
  "image": "https://www.droid-life.com/wp-content/uploads/2025/07/Samsung-Qi2-Apple-MagSafe-1-1200x628-cropped.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n        \u003cp\u003eIf you can believe it, the year was 2020 that Apple introduced its MagSafe tech for phones, starting with the iPhone 12. That new edition of MagSafe for phones brought built-in magnets to devices that could be attached to wireless chargers and other accessories, like wallets. The magnetic connection to accessories was all possible without the need for a case, but Apple did introduce MagSafe cases alongside the phone and has since for those who need phone protection and still want to take advantage of magnets.\u003c/p\u003e\n\u003cp\u003eApple’s MagSafe tech has spawned thousands of accessories from top brands since it was first introduced 5 years ago. It has without a doubt been one of the top phone or tech feature introductions in recent memory. In fact, it became such a big piece of the tech industry so quickly that the Wireless Power Consortium (WPC) and its partners likely begged Apple to let them make it a part of their new Qi2 charging standard, which happened.\u003c/p\u003e\n\u003cp\u003eAt the end of 2023, the WPC \u003ca href=\"https://www.droid-life.com/2023/11/15/qi2-wireless-charging-is-ready-and-the-pixel-9-could-have-it/\"\u003eannounced that its Qi2 standard was ready\u003c/a\u003e and that the iPhone 15 line would be the first to receive certification. We then started counting the days that passed in hopes of someone from the Android side of the world taking a stab at Qi2. Unfortunately, we’re mid-way through 2025 and none of the top Android phone makers (Samsung, Google, OnePlus, etc.) have taken on Qi2, at least in the form that truly matters.\u003c/p\u003e\n\u003cp\u003eInstead, \u003ca href=\"https://www.droid-life.com/2025/01/27/galaxy-s25-gets-qi2-1-support-even-without-built-in-magnets/\"\u003eSamsung first helped usher\u003c/a\u003e in the era of “Qi2 Ready” with the Galaxy S25 series, a certification that made a device meet enough technical requirements to accept the “Qi2” brand only without going all in. And by not going all in, they had to leave out something, right? What would that be? The magnets. The most important part of Apple’s MagSafe and Qi2, the magical magnets, were not needed within devices if they wanted to be “Qi2 Ready.”\u003c/p\u003e\n\u003cp\u003eThe WPC was allowing companies like Samsung to release cases with magnets that could be attached to devices and then approve them as “Qi2 Ready.” It seemed like the exact move Qi2 was meant to avoid – confusion. Because with Qi2 and “Qi2 Ready,” we now already have two types of Qi2. There’s the true version that Apple uses, with magnets built into a phone and then this “Ready” version that lets phonemakers off the hook from taking the time to follow the hardware lead Apple started 5 years ago.\u003c/p\u003e\n\u003cp\u003eWhile a case that’s approved for Qi2 does allow Qi2 functionality, there’s this whole thing about it requiring a case in order to work. Not all of us use cases. Not all of us want to spend the money for a case that has met the standard of “Qi2 Ready” and likely carries a larger price tag. Some of us \u003ca href=\"https://www.droid-life.com/2025/01/21/this-arc-pulse-for-pixel-9-pro-is-my-new-favorite-case-accessory/\"\u003emight use a case without a backside\u003c/a\u003e and would like the phone to have magnets within. Or maybe a case needs to be removed and the magnets might still be handy, for whatever your situation may be. You get the point. Qi2 was supposed to mean \u003cem\u003emagnets built-in\u003c/em\u003e and then the WPC caved (at least in my mind), allowing for a work-around.\u003c/p\u003e\n\u003cp\u003eI bring this up today because Samsung has \u003ca href=\"https://sammyguru.com/samsungs-survey-hints-at-built-in-qi2-magnets-in-future-phones/\"\u003ereportedly\u003c/a\u003e introduced a survey through their Samsung Members app that specifically asks for feedback on this situation. The survey asks folks if they would “prefer to have magnets built into the phone even if it made the phone thicker?” I’ll go ahead and answer that for everyone:\u003c/p\u003e\n\u003ch2\u003eYES. WE WANT THE MAGNETS IN THE PHONE, SAMSUNG.\u003c/h2\u003e\n\u003cp\u003eThe survey actually breaks out the answers some to let people say if they’d rather the device not become thicker or if they’d be OK with some added thickness. Two of the answers suggest it could only add 0.3 or 0.5mm of thickness, which is basically nothing. Like, if that’s all that was holding you back Samsung…good lord.\u003c/p\u003e\n\u003cp\u003eIt’s hard to know what this survey means in terms of Samsung taking the idea seriously or not. This late in the game, I’d guess this doesn’t mean a Galaxy S26 will have magnets built into the device. Maybe it’ll mean the Galaxy Z Fold 8 or Galaxy S27 sees it. Those both seem so far away.\u003c/p\u003e\n      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-07-15T20:45:14Z",
  "modifiedTime": "2025-07-15T20:45:14Z"
}
