{
  "id": "99abd22c-fbe3-495e-b433-dabb90215744",
  "title": "Google Maps is not interested in your Gulf of America complaints",
  "link": "https://www.androidauthority.com/google-maps-gulf-of-america-review-removal-3526126/",
  "description": "Google Maps won't let you post negative reviews about the Gulf of America.",
  "author": "Ryan McNeal",
  "published": "Thu, 13 Feb 2025 22:24:30 +0000",
  "source": "https://www.androidauthority.com/feed",
  "categories": [
    "News",
    "Google",
    "Google Maps"
  ],
  "byline": "Ryan McNeal",
  "length": 3557,
  "excerpt": "Google has admitted it is taking down negative reviews and turned off reporting related to the Gulf of Mexico's name change.",
  "siteName": "Android Authority",
  "favicon": "https://www.androidauthority.com/pwa/apple-touch-icon.png",
  "text": "Joe Maring / Android AuthorityTL;DR Google has admitted to removing negative user reviews after changing the Gulf of Mexico to the Gulf of America. It is also preventing users from suggesting edits or reporting inaccuracies. It appears mislabeling reports and reviews are triggering Google Maps’ “real-time abuse” protocol. A few days ago, Google officially renamed the Gulf of Mexico to the Gulf of America on Google Maps. As expected, this sudden name change was met with a wave of criticism, which has led to an influx of negative reviews and reports of mislabeling. Google is now removing negative reviews and is preventing users from submitting reports related to the change.According to Forbes, Google has admitted to removing negative reviews about the recent renaming of the body of water in question. The tech giant has also turned off the ability to suggest edits or report inaccuracies. It appears Google sees these actions as violating its existing Maps policy against fake content.“We regularly put protections on places during times when we anticipate an uptick of contributions that are off-topic or unrelated to someone’s direct experience with the place,” a Google spokesperson told the publication. The outlet was then directed to this 2023 blog post which discusses “real-time abuse” and the protections it implements: Our systems are constantly monitoring for unusual patterns in contributed content. When we detect suspicious activity, we act quickly and may implement protections to prevent further abuse. This can include everything from taking down policy-violating content to temporarily disabling new contributions. For example, earlier this year we saw a sudden spike in 1-star reviews on a local bar in Missouri. To stop the abuse, we disabled the rating function temporarily on the place so that the bar’s rating would not be further affected. Meanwhile, we also removed policy-violating reviews and investigated the accounts that left the reviews. Google recently explained on social media that it relies on official government sources when deciding how to depict a location’s name. For locations in the US, the company says it draws data from the Geographic Names Information System (GNIS). The GNIS was updated to include the Gulf of America following an executive order from President Donald Trump. We’ve received a few questions about naming within Google Maps. We have a longstanding practice of applying name changes when they have been updated in official government sources. As a result, mentions of the Gulf of Mexico now technically fall under the category of “fake content” for Maps in the US. Given the recent surge in reports, it appears the real-time abuse protocol is being triggered.Only users in the US see the body of water labeled as the Gulf of America. It’s still known as the Gulf of Mexico in Mexico. Meanwhile, the rest of the world now sees both names labeled as “Gulf of Mexico (Gulf of America).” This has not satisfied the President of Mexico Claudia Sheinbaum.As reported by Reuters, President Sheinbaum has urged Google to reconsider the name change or potentially face a civil lawsuit from the country. President Sheinbaum argues that the Gulf of Mexico has long been recognized internationally. “If necessary we will file a civil suit,” Sheinbaum stated. “Our legal area is already looking into what that would mean, but we hope that (Google) reconsiders.”Got a tip? Talk to us! Email our staff at news@androidauthority.com. You can stay anonymous or get credit for the info, it's your choice.",
  "image": "https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-scaled.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource sizes=\"(min-width: 64rem) 51.25rem, 80vw\" srcset=\"https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-scaled.jpeg.webp 2560w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-64w-36h.jpeg.webp 64w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-1000w-563h.jpeg.webp 1000w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-1920w-1080h.jpeg.webp 1920w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-1536w-864h.jpeg.webp 1536w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-675w-380h.jpeg.webp 675w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-300w-170h.jpeg.webp 300w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-1280w-720h.jpeg.webp 1280w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-840w-472h.jpeg.webp 840w\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" loading=\"eager\" sizes=\"(min-width: 64rem) 51.25rem, 80vw\" title=\"gulf of america google maps hero\" srcset=\"https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-scaled.jpeg 2560w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-64w-36h.jpeg 64w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-1000w-563h.jpeg 1000w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-1920w-1080h.jpeg 1920w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-1536w-864h.jpeg 1536w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-675w-380h.jpeg 675w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-300w-170h.jpeg 300w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-1280w-720h.jpeg 1280w, https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-840w-472h.jpeg 840w\" alt=\"Gulf of America name change on the Google Maps app.\" src=\"https://www.androidauthority.com/wp-content/uploads/2025/02/gulf-of-america-google-maps-hero-scaled.jpeg\"/\u003e\u003c/picture\u003e\u003cdiv\u003e\u003cp\u003eJoe Maring / Android Authority\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-container-type=\"content\"\u003e\u003cp\u003eTL;DR\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGoogle has admitted to removing negative user reviews after changing the Gulf of Mexico to the Gulf of America.\u003c/li\u003e\n\u003cli\u003eIt is also preventing users from suggesting edits or reporting inaccuracies.\u003c/li\u003e\n\u003cli\u003eIt appears mislabeling reports and reviews are triggering Google Maps’ “real-time abuse” protocol.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\u003cp\u003eA few days ago, Google officially \u003ca href=\"https://www.androidauthority.com/google-maps-gulf-of-america-name-change-3524991/\"\u003erenamed\u003c/a\u003e the Gulf of Mexico to the Gulf of America on Google Maps. As expected, this sudden name change was met with a wave of criticism, which has led to an influx of negative reviews and reports of mislabeling. Google is now removing negative reviews and is preventing users from submitting reports related to the change.\u003c/p\u003e\u003cp\u003eAccording to \u003ca href=\"https://www.forbes.com/sites/dimitarmixmihov/2025/02/13/google-maps-admits-deleting-critical-gulf-of-america-reviews/\" target=\"_blank\"\u003e\u003cem\u003eForbes\u003c/em\u003e\u003c/a\u003e, Google has admitted to removing negative reviews about the recent renaming of the body of water in question. The tech giant has also turned off the ability to suggest edits or report inaccuracies. It appears Google sees these actions as violating its existing \u003ca href=\"https://www.androidauthority.com/current-location-google-maps-3100375/\"\u003eMaps\u003c/a\u003e policy against fake content.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e“We regularly put protections on places during times when we anticipate an uptick of contributions that are off-topic or unrelated to someone’s direct experience with the place,” a Google spokesperson told the publication. The outlet was then directed to this 2023 \u003ca href=\"https://blog.google/products/maps/how-google-maps-protects-against-fake-content/\" target=\"_blank\"\u003eblog post\u003c/a\u003e which discusses “real-time abuse” and the protections it implements:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eOur systems are constantly monitoring for unusual patterns in contributed content. When we detect suspicious activity, we act quickly and may implement protections to prevent further abuse. This can include everything from taking down policy-violating content to temporarily disabling new contributions. For example, earlier this year we saw a sudden spike in 1-star reviews on a local bar in Missouri. To stop the abuse, we disabled the rating function temporarily on the place so that the bar’s rating would not be further affected. Meanwhile, we also removed policy-violating reviews and investigated the accounts that left the reviews.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eGoogle recently \u003ca href=\"https://x.com/NewsFromGoogle/status/1884012692048166951?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1884012692048166951%7Ctwgr%5E6ef91f60897f09931ddfe8349994f0a8d076ce4a%7Ctwcon%5Es1_\u0026amp;ref_url=https%3A%2F%2Fembedly.forbes.com%2Fwidgets%2Fmedia.html%3Ftype%3Dtext2Fhtmlkey%3D3ce26dc7e3454db5820ba084d28b4935schema%3Dtwitterurl%3Dhttps3A%2F%2Fx.com%2FNewsFromGoogle%2Fstatus%2F18840126920481669513Fref_src3Dtwsrc255Etfw257Ctwcamp255Etweetembed257Ctwterm255E1884012692048166951257Ctwgr255E1a91b93e19bfba92479b8b26a74664a3b579ba8b257Ctwcon255Es1_26ref_url3Dhttps253A252F252Fembedly.forbes.com252Fwidgets252Fmedia.html253Ftype253Dtext2Fhtmlkey253D3ce26dc7e3454db5820ba084d28b4935schema253Dtwitterurl253Dhttps3A252F252Fx.com252FNewsFromGoogle252Fstatus252F1884012692048166951image253Dimage%3D\" target=\"_blank\"\u003eexplained\u003c/a\u003e on social media that it relies on official government sources when deciding how to depict a location’s name. For locations in the US, the \u003ca href=\"https://x.com/NewsFromGoogle/status/1884012751246475394\" target=\"_blank\"\u003ecompany says\u003c/a\u003e it draws data from the Geographic Names Information System (GNIS). The GNIS was updated to include the Gulf of America following an executive order from President Donald Trump.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cblockquote\u003e\n\u003cp\u003eWe’ve received a few questions about naming within Google Maps. We have a longstanding practice of applying name changes when they have been updated in official government sources.\u003c/p\u003e\n\u003c/blockquote\u003e\u003c/div\u003e\u003cp\u003eAs a result, mentions of the Gulf of Mexico now technically fall under the category of “fake content” for Maps in the US. Given the recent surge in reports, it appears the real-time abuse protocol is being triggered.\u003c/p\u003e\u003cp\u003eOnly users in the US see the body of water labeled as the Gulf of America. It’s still known as the Gulf of Mexico in Mexico. Meanwhile, the rest of the world now sees both names labeled as “Gulf of Mexico (Gulf of America).” This has not satisfied the President of Mexico Claudia Sheinbaum.\u003c/p\u003e\u003cp\u003eAs reported by \u003ca href=\"https://www.reuters.com/world/americas/mexico-could-file-suit-against-google-gulf-mexico-name-change-president-says-2025-02-13/\" target=\"_blank\"\u003e\u003cem\u003eReuters\u003c/em\u003e\u003c/a\u003e, President Sheinbaum has urged Google to reconsider the name change or potentially face a civil lawsuit from the country. President Sheinbaum argues that the Gulf of Mexico has long been recognized internationally. “If necessary we will file a civil suit,” Sheinbaum stated. “Our legal area is already looking into what that would mean, but we hope that (Google) reconsiders.”\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eGot a tip? Talk to us!\u003c/strong\u003e Email our staff at \u003ca href=\"mailto:news@androidauthority.com\" rel=\"noopener noreferrer\" data-stringify-link=\"mailto:tips@androidauthority.com\" data-sk=\"tooltip_parent\" aria-haspopup=\"menu\"\u003enews@androidauthority.com\u003c/a\u003e. You can stay anonymous or get credit for the info, it\u0026#39;s your choice.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-13T22:24:30Z",
  "modifiedTime": "2025-02-13T22:29:04Z"
}
