{
  "id": "99c5b3b9-fe48-41ce-86ad-9e7f446d78c3",
  "title": "Pebble’s Return is Now Official, Albeit under a Different Name",
  "link": "https://phandroid.com/2025/03/18/pebbles-return-is-now-official-albeit-under-a-different-name/",
  "description": "The new models start shipping in July and December. The post Pebble’s Return is Now Official, Albeit under a Different Name appeared first on Phandroid.",
  "author": "Mike Viray",
  "published": "Tue, 18 Mar 2025 22:01:11 +0000",
  "source": "http://feeds2.feedburner.com/AndroidPhoneFans",
  "categories": [
    "Devices",
    "Wearables",
    "core 2 duo",
    "core time 2",
    "Pebble"
  ],
  "byline": "Mike Viray",
  "length": 1700,
  "excerpt": "The new models start shipping in July and December.",
  "siteName": "Phandroid",
  "favicon": "",
  "text": "A while back, veteran smartwatch brand Pebble announced that it was preparing to make a return to the tech scene with new hardware, following an announcement from founder Eric Migicovsky. With that in mind, it looks like a new line of Pebble line of watches is now official, albeit under different branding this time. READ: Could We See a Pebble Comeback Soon? Operating under the brand “Core Devices,” Migicovsky is transparent about the framework behind the new watches, which are named the “Core 2 Duo” and “Core Time 2.” Running on the now open-source PebbleOS platform, the new watches feature a design that’s very reminiscent of older Pebble models. Part of Migicovsky’s official announcement reads: My new company (Core Devices) and I are proud to introduce two new watches that closely follow the original Pebble DNA. If you had a Pebble and loved it, or missed your chance 10 years ago but heard about it since, we think you will really enjoy these new devices. As for hardware, the Core 2 Duo features a 1.2″ black/white e-paper screen, a polycarbonate frame available in black or white, as well as a barometer and compass. Meanwhile, the Core Time 2 is a bit more feature-packed with a 1.5-inch 64 color e-paper touch screen, a metal frame, as well as a heart rate monitor. READ: The Xiaomi Smart Band 9 Pro Packs a Premium Design and Impressive Battery Life Additionally, both watches come with up to 30-day battery life and IPX8 water resistance, step and sleep tracking for health monitoring, a built-in microphone and speaker, as well as access to over 10,000 watch faces and apps. The Core 2 Duo starts shipping in July for $149, while the Core Time 2 will ship in December for $225.",
  "image": "https://phandroid.com/wp-content/uploads/2025/03/core-device-watches-3.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                                                \u003cp\u003eA while back, veteran smartwatch brand Pebble announced that it was \u003ca href=\"https://phandroid.com/2025/01/28/could-we-see-a-pebble-comeback-soon/\"\u003epreparing to make a return\u003c/a\u003e to the tech scene with new hardware, following an announcement from founder Eric Migicovsky. With that in mind, it looks like \u003ca href=\"https://ericmigi.com/blog/introducing-two-new-pebbleos-watches\"\u003ea new line of Pebble line of watches is now official\u003c/a\u003e, albeit \u003ca href=\"https://store.repebble.com/\"\u003eunder different branding\u003c/a\u003e this time.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://howl.link/uk0u5bd6vpq62\"\u003e\u003cimg src=\"https://phandroid.com/wp-content/uploads/2025/02/Galaxy-S25-Ultra-1.png\" alt=\"Galaxy S25 Ultra deal\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eREAD: \u003ca href=\"https://phandroid.com/2025/01/28/could-we-see-a-pebble-comeback-soon/\"\u003eCould We See a Pebble Comeback Soon?\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOperating under the brand “Core Devices,” Migicovsky is transparent about the framework behind the new watches, which are named the “Core 2 Duo” and “Core Time 2.” Running on the now open-source PebbleOS platform, the new watches feature a design that’s very reminiscent of older Pebble models. Part of Migicovsky’s official announcement reads:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eMy new company (Core Devices) and I are proud to introduce two new watches that closely follow the original Pebble DNA. If you had a Pebble and loved it, or missed your chance 10 years ago but heard about it since, we think you will really enjoy these new devices.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://phandroid.com/wp-content/uploads/2025/03/core-device-watches-1.png\" alt=\"\" width=\"1800\" height=\"1200\" srcset=\"https://phandroid.com/wp-content/uploads/2025/03/core-device-watches-1.png 1800w, https://phandroid.com/wp-content/uploads/2025/03/core-device-watches-1-350x233.png 350w, https://phandroid.com/wp-content/uploads/2025/03/core-device-watches-1-640x427.png 640w, https://phandroid.com/wp-content/uploads/2025/03/core-device-watches-1-768x512.png 768w, https://phandroid.com/wp-content/uploads/2025/03/core-device-watches-1-1536x1024.png 1536w\" sizes=\"(max-width: 1800px) 100vw, 1800px\"/\u003e\u003c/p\u003e\n\u003cp\u003eAs for hardware, the Core 2 Duo features a 1.2″ black/white e-paper screen, a polycarbonate frame available in black or white, as well as a barometer and compass. Meanwhile, the Core Time 2 is a bit more feature-packed with a 1.5-inch 64 color e-paper touch screen, a metal frame, as well as a heart rate monitor.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eREAD: \u003ca href=\"https://phandroid.com/2025/03/02/the-xiaomi-smart-band-9-pro-packs-a-premium-design-and-impressive-battery-life/\" aria-label=\"“The Xiaomi Smart Band 9 Pro Packs a Premium Design and Impressive Battery Life” (Edit)\"\u003eThe Xiaomi Smart Band 9 Pro Packs a Premium Design and Impressive Battery Life\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAdditionally, both watches come with up to 30-day battery life and IPX8 water resistance, step and sleep tracking for health monitoring, a built-in microphone and speaker, as well as access to over 10,000 watch faces and apps. The Core 2 Duo starts shipping in July for $149, while the Core Time 2 will ship in December for $225.\u003c/p\u003e\n\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-18T22:01:11Z",
  "modifiedTime": "2025-03-18T23:40:08Z"
}
