{
  "id": "bb64ef31-320e-439d-b911-24cbed99fe03",
  "title": "Redmi K80 Ultra specs leak",
  "link": "https://www.gsmarena.com/redmi_k80_ultra_specs_leak-news-66017.php",
  "description": "Redmi launched the K80 and K80 Pro in November, and the Xiaomi sub-brand is now busy working on the top of the line K80 Ultra. According to prolific Chinese leaker Digital Chat Station, the K80 Ultra will be powered by the upcoming MediaTek Dimensity 9400+ SoC. It will have a \"1.5K\" resolution flat screen with extremely narrow bezels, an embedded ultrasonic in-display fingerprint sensor, a metal frame, and a battery that will be at least 6,500 mAh. Redmi K80 Pro Those are some nice high-end specs for sure, and the K80 Ultra is also said to be IP68 certified for dust and water...",
  "author": "",
  "published": "Thu, 09 Jan 2025 02:02:01 +0100",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Vlad",
  "length": 1110,
  "excerpt": "The phone should arrive later this year. Redmi launched the K80 and K80 Pro in November, and the Xiaomi sub-brand is now busy working on the top of the...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "Redmi launched the K80 and K80 Pro in November, and the Xiaomi sub-brand is now busy working on the top of the line K80 Ultra. According to prolific Chinese leaker Digital Chat Station, the K80 Ultra will be powered by the upcoming MediaTek Dimensity 9400+ SoC. It will have a \"1.5K\" resolution flat screen with extremely narrow bezels, an embedded ultrasonic in-display fingerprint sensor, a metal frame, and a battery that will be at least 6,500 mAh. Redmi K80 ProThose are some nice high-end specs for sure, and the K80 Ultra is also said to be IP68 certified for dust and water resistance. It's still unclear when the K80 Ultra might become official. In case you're wondering why the K80 Ultra has a lower-resolution screen than the K80 Pro, we don't know but the K70 Ultra and K70 Pro played the exact same game last time around. And the rumored chipset tracks too - the K70 Ultra had the Dimensity 9300+, while the K70 Pro went with the Snapdragon 8 Gen 3 (the latest at the time). The K80 Pro uses the Snapdragon 8 Elite, so this all seems to make sense from the perspective of Redmi's stable. Via",
  "image": "https://fdn.gsmarena.com/imgroot/news/25/01/redmi-k80-ultra-specs-leak/-952x498w6/gsmarena_000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eRedmi launched the \u003ca href=\"https://www.gsmarena.com/xiaomi_redmi_k80-13525.php\"\u003eK80\u003c/a\u003e and \u003ca href=\"https://www.gsmarena.com/xiaomi_redmi_k80_pro-13524.php\"\u003eK80 Pro\u003c/a\u003e in November, and the Xiaomi sub-brand is now busy working on the top of the line K80 Ultra. According to prolific Chinese leaker Digital Chat Station, the K80 Ultra will be powered by the upcoming MediaTek Dimensity 9400+ SoC.\u003c/p\u003e\n\n\u003cp\u003eIt will have a \u0026#34;1.5K\u0026#34; resolution flat screen with extremely narrow bezels, an embedded ultrasonic in-display fingerprint sensor, a metal frame, and a battery that will be at least 6,500 mAh.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"910\" alt=\"Redmi K80 Pro\" src=\"https://fdn.gsmarena.com/imgroot/news/25/01/redmi-k80-ultra-specs-leak/inline/-1200/gsmarena_001.jpg\"/\u003e\n\u003cspan\u003e\u003cstrong\u003eRedmi K80 Pro\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThose are some nice high-end specs for sure, and the K80 Ultra is also said to be IP68 certified for dust and water resistance. It\u0026#39;s still unclear when the K80 Ultra might become official.\u003c/p\u003e\n\n\u003cp\u003eIn case you\u0026#39;re wondering why the K80 Ultra has a lower-resolution screen than the K80 Pro, we don\u0026#39;t know but the \u003ca href=\"https://www.gsmarena.com/xiaomi_redmi_k70_ultra-13215.php\"\u003eK70 Ultra\u003c/a\u003e and \u003ca href=\"https://www.gsmarena.com/xiaomi_redmi_k70_pro-12714.php\"\u003eK70 Pro\u003c/a\u003e played the exact same game last time around.\u003c/p\u003e\n\n\u003cp\u003eAnd the rumored chipset tracks too - the K70 Ultra had the Dimensity 9300+, while the K70 Pro went with the Snapdragon 8 Gen 3 (the latest at the time). The K80 Pro uses the Snapdragon 8 Elite, so this all seems to make sense from the perspective of Redmi\u0026#39;s stable.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://www.gizmochina.com/2025/01/08/redmi-k80-ultra-specifications-leaked-hints-at-significant-battery-upgrade/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eVia\u003c/a\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-09T02:02:01+01:00",
  "modifiedTime": null
}
