{
  "id": "cdf7c20e-8854-41da-8e2f-5dc108aae480",
  "title": "OnePlus 13 screen details leak",
  "link": "https://www.gsmarena.com/oneplus_13_screen_details_leak-news-64860.php",
  "description": "The OnePlus 13 will be a top of the line flagship device, based on many previous rumors. Its screen will be of the highest quality, and today some new details about it have been leaked in China. The OnePlus 13 will use the BOE X2 panel. It will have \"2K\" resolution, a 120 Hz refresh rate, and is of course LTPO. The OnePlus 13 will also embed an ultrasonic fingerprint sensor in the display, which should result in faster and more accurate unlocks. OnePlus 12 The display will be gently curved on all sides, as is the latest trend among Chinese smartphone makers. Additionally, the...",
  "author": "",
  "published": "Thu, 10 Oct 2024 01:59:02 +0200",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Vlad",
  "length": 1092,
  "excerpt": "It will be a premium part, that's for sure. The OnePlus 13 will be a top of the line flagship device, based on many previous rumors. Its screen will be of...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "The OnePlus 13 will be a top of the line flagship device, based on many previous rumors. Its screen will be of the highest quality, and today some new details about it have been leaked in China. The OnePlus 13 will use the BOE X2 panel. It will have \"2K\" resolution, a 120 Hz refresh rate, and is of course LTPO. The OnePlus 13 will also embed an ultrasonic fingerprint sensor in the display, which should result in faster and more accurate unlocks. OnePlus 12The display will be gently curved on all sides, as is the latest trend among Chinese smartphone makers. Additionally, the source of this rumor says we should expect greatly improved brightness compared to the OnePlus 12, and much better eye protection. The OnePlus 13 will be powered by Qualcomm's Snapdragon 8 Gen 4 chipset, due to be unveiled later this month, which is also when the handset itself will become official. This will be paired with insane amounts of RAM. The device will also support magnetic wireless charging of its 6,000 mAh battery that will charge at 100W via cables and 50W wirelessly. Source (in Chinese)",
  "image": "https://fdn.gsmarena.com/imgroot/news/24/10/oneplus-13-screen/-952x498w6/gsmarena_002.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eThe OnePlus 13 will be a top of the line flagship device, based on many previous rumors. Its screen will be of the highest quality, and today some new details about it have been leaked in China.\u003c/p\u003e\n\n\u003cp\u003eThe OnePlus 13 will use the BOE X2 panel. It will have \u0026#34;2K\u0026#34; resolution, a 120 Hz refresh rate, and is of course LTPO. The OnePlus 13 will also embed an ultrasonic fingerprint sensor in the display, which should result in faster and more accurate unlocks.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"799\" alt=\"OnePlus 12\" src=\"https://fdn.gsmarena.com/imgroot/news/24/10/oneplus-13-screen/-1200w5/gsmarena_001.jpg\"/\u003e\n\u003cspan\u003e\u003cstrong\u003eOnePlus 12\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThe display will be gently curved on all sides, as is the latest trend among Chinese smartphone makers. Additionally, the source of this rumor says we should expect greatly improved brightness compared to the \u003ca href=\"https://www.gsmarena.com/oneplus_12-12725.php\"\u003eOnePlus 12\u003c/a\u003e, and much better eye protection.\u003c/p\u003e\n\n\u003cp\u003eThe OnePlus 13 will be \u003ca href=\"https://www.gsmarena.com/oneplus_13_appears_in_qualcomms_latest_teaser_video-news-64834.php\"\u003epowered by Qualcomm\u0026#39;s Snapdragon 8 Gen 4 chipset\u003c/a\u003e, due to be unveiled later this month, which is also when the handset itself \u003ca href=\"https://www.gsmarena.com/oneplus_13_confirmed_to_arrive_in_october-news-64447.php\"\u003ewill become official\u003c/a\u003e. This will be paired with \u003ca href=\"https://www.gsmarena.com/oneplus_13_to_have_an_insane_amount_of_memory-news-64614.php\"\u003einsane amounts of RAM\u003c/a\u003e. The device will also \u003ca href=\"https://www.gsmarena.com/oneplus_13_will_support_magnetic_wireless_charging_exec_confirms-news-64824.php\"\u003esupport magnetic wireless charging\u003c/a\u003e of its 6,000 mAh battery that will charge at 100W via cables and 50W wirelessly.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://m.weibo.cn/detail/5087588140712183\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSource\u003c/a\u003e (in Chinese)\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-10-10T01:59:02+02:00",
  "modifiedTime": null
}
