{
  "id": "e9bd0731-1231-49eb-86d2-2821bd66bb28",
  "title": "How I balance Siri and Google Assistant for the best of both worlds",
  "link": "https://www.androidpolice.com/siri-google-assistant-balance/",
  "description": "Love Android and iPhone together",
  "author": "Irene Okpanachi",
  "published": "Sun, 29 Dec 2024 21:11:50 GMT",
  "source": "http://feeds.feedburner.com/AndroidPolice",
  "categories": [
    "Apple vs Android",
    "siri",
    "Google Assistant",
    "Best Reads",
    "Operating Systems",
    "Apple vs Android",
    "siri",
    "Google Assistant",
    "Android Police's Best Reads"
  ],
  "byline": "Irene Okpanachi",
  "length": 6580,
  "excerpt": "Love Android and iPhone together",
  "siteName": "Android Police",
  "favicon": "https://www.androidpolice.com/public/build/images/favicon-240x240.51546dee.png",
  "text": "Consumerism loves rivalry, and nothing proves it more than the endless Android versus iPhone debate. It's fueled by flashy ads, clever marketing, and the constant temptation to upgrade. Both brands want you to pick a side and lock yourself into their ecosystem for life. It's working. Maybe you're guilty of scoffing when someone pulls out their Android to snap pictures at a party or thought an iPhone user was stuck up when holding their overpriced status symbol. It's part of a game in which you didn't realize you were playing a role. For some of us, it's interesting to sit on the sidelines. Why must we choose which phone is best when we can enjoy the best of both worlds? For me, I find a balance for a wholesome experience. Here's how I do it with Google Assistant and Siri. Related Does it make sense to carry both an Android and an iPhone? It's an expensive idea, but could fragmented tech demand it? What balancing Google Assistant and Siri means Siri rests my hands, but Google Assistant is smarter When most people think about balance, they picture an equal or perfect split. That isn't quite it. It's allocating your resources in the right ratio that gets the job done. In this case, it's understanding when Siri or Google Assistant is the best fit for a task. Both are among the most popular virtual assistants, each with many strengths. When you have two phones, a short attention span, and too much data to handle, you want a way to divide and conquer. The iPhone 11 isn't my primary phone, but it's easier to handle all communications with Siri in one place. It's an indispensable piece of Apple's ecosystem, and it keeps things simple. It's responsive when I need it because I can't get used to iOS's gesture-based navigation system. At least with Android, you can choose if you'd rather have buttons. Siri offers a way to bypass that. I use my voice to set reminders, make calls, and send quick texts across WhatsApp, iMessage, and other apps. On the other hand, Google's solution is the more expansive helper. I use my Realme 12+ 5G as my work phone, for typing and drafting on the go, and for gaming. It is messy with tasks, and there's a lot of information to manage. I often need a reliable source to make contributions in moments like that. Being integrated with Gemini, Google Assistant gives real-time and updated information across the system. I tested it on my iOS 18 and Android 14 phones several times. One of those times, I asked Siri and Google Assistant what the latest version of Android is. Siri responded with Android 13, adding that the most stable version is Android 9. Google Assistant correctly said Android 15. Both virtual assistants can mix up information. Still, you want the one that's closest to accurate most of the time. Siri tends to pull web results from the internet to answer queries. Because it doesn't always provide direct answers, you must decide the answer based on those results. Meanwhile, Google Assistant answers based on its knowledge base and taps into Gemini AI to provide more contextually relevant responses. Google Assistant takes me home, but Siri is versatile To each strength is a shortcoming In navigation, I prefer asking Google Assistant to open Google Maps and give me directions rather than dealing with Siri. When I say, \"Hey Google, take me home,\" it opens the map to get me on my way. Even while driving, I can get directions, check live traffic conditions, adjust my route, and use offline maps. I can't trust Siri to do all that because it can direct you to places far off from where you intended, sometimes on another continent, if you aren't careful. It's annoying when Siri doesn't prioritize nearby options like Google Maps. However, it works with third-party apps, including Google Maps, Waze, and Pandora. You can launch your preferred navigation map using a command. This feature was introduced in 2019 on iOS 13. It's useful for anyone who likes using Google Maps on their iPhone. With iOS 18, it sounds even more natural. Siri is customizable, and you can adjust how fast it talks to suit your listening style. If you prefer not to hear the voice, turn it off. You're limited to the preset voices on Android and can't do much about anything else. I also love that there's no linearity to how you can control Siri on the iPhone. One way I experiment is with Siri Shortcuts. Occasionally, I program my phone to text a contact automatically when it detects my arrival at a location on Apple Maps. However, there may be a delay. I have a separate shortcut with preset messages for moments like that. When I say, \"Hey Siri, [shortcut name],\" it brings up the text so that I can press send. Other times, I use shortcuts to play a specific playlist on Apple Music. Related How to make Google Maps the default navigation app on your iPhone Getting lost with Apple Maps? You can set Google Maps as the default on your iPhone in seconds Who is more responsive? Because you need an assistant that actually listens I've heard people say Google Assistant is more responsive, but it isn't always easy to say. Both assistants can be wonky. There are moments when Google Assistant refuses to respond, misinterprets my commands, or doesn't perform the action I want. At the same time, Siri doesn't understand the request or context. Both have their moments of greatness and their fair share of frustrating glitches. If it feels like Google Assistant hears you more, it's because Google has an advantage in data and computing resources. Unlike Apple, which is more privacy-focused and limits the amount of user data it collects, Google can access more data pools that we contribute to improve its voice recognition models. Plus, its Tensor chips are tailored for any on-device AI and machine learning function. Even with Apple's ARM-based M1 and M2 chips, they don't have the same scale of infrastructure to match Google in training models and improving voice recognition. Make the most of Android and Apple You don't have to choose between Siri and Google Assistant. Both ecosystems are designed with your preferences in mind, not necessarily for competition. Siri is the way to go if your priorities are simplicity, privacy, and a tight connection with your Apple devices. If you want broader search capabilities, superior integration with Google services, and a smarter assistant for complex queries, use Google Assistant. You can even combine both. The trick is to look beyond the basics and create smarter workflows for yourself.",
  "image": "https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/12/siri-and-google-assistant-logos.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eConsumerism loves rivalry, and nothing proves it more than the endless Android versus iPhone debate. It\u0026#39;s fueled by flashy ads, clever marketing, and the constant temptation to upgrade. Both brands want you to pick a side and lock yourself into their ecosystem for life. It\u0026#39;s working. Maybe you\u0026#39;re guilty of scoffing when someone pulls out their Android to snap pictures at a party or thought an iPhone user was stuck up when holding their overpriced status symbol.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eIt\u0026#39;s part of a game in which you didn\u0026#39;t realize you were playing a role. For some of us, it\u0026#39;s interesting to sit on the sidelines. Why must we choose \u003ca href=\"https://www.androidpolice.com/best-camera-phone/\" target=\"_blank\"\u003ewhich phone is best\u003c/a\u003e when we can enjoy the best of both worlds? For me, I find a balance for a wholesome experience. Here\u0026#39;s how I do it with Google Assistant and Siri.\u003c/p\u003e\n\n\n\u003cdiv data-include-community-rating=\"false\" id=\"cf98-4852-b1d14b36d787\" data-nosnippet=\"\"\u003e\u003ca href=\"https://www.androidpolice.com/does-it-make-sense-to-carry-android-and-iphone/\"\u003e\u003cdiv data-img-url=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/11/both-android-and-iphone.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\u003cfigure\u003e\u003cpicture\u003e\u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/11/both-android-and-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\" srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/11/both-android-and-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\"/\u003e\u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/11/both-android-and-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\" srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/11/both-android-and-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\"/\u003e\u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/11/both-android-and-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\" srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/11/both-android-and-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\"/\u003e\u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/11/both-android-and-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\" srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/11/both-android-and-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\"/\u003e\u003cimg width=\"3200\" height=\"1800\" loading=\"lazy\" decoding=\"async\" alt=\"An iPhone 16 and Pixel 9 facing opposite directions.\" data-img-url=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/11/both-android-and-iphone.jpg\" src=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/11/both-android-and-iphone.jpg\"/\u003e \u003c/picture\u003e \u003c/figure\u003e \u003c/div\u003e \u003c/a\u003e\u003cp\u003e\u003cspan data-field=\"label\"\u003eRelated\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch5\u003e\u003ca href=\"https://www.androidpolice.com/does-it-make-sense-to-carry-android-and-iphone/\" title=\"Does it make sense to carry both an Android and an iPhone?\" target=\"_blank\"\u003e Does it make sense to carry both an Android and an iPhone? \u003c/a\u003e \u003c/h5\u003e\u003cp\u003eIt\u0026#39;s an expensive idea, but could fragmented tech demand it?\u003c/p\u003e \u003c/div\u003e \u003c/div\u003e\n\n\n\u003ch2 id=\"what-balancing-google-assistant-and-siri-means\"\u003e What balancing Google Assistant and Siri means \u003c/h2\u003e\n\u003ch3 id=\"siri-rests-my-hands-but-google-assistant-is-smarter\"\u003e Siri rests my hands, but Google Assistant is smarter \u003c/h3\u003e\n\u003cp\u003eWhen most people think about balance, they picture an equal or perfect split. That isn\u0026#39;t quite it. It\u0026#39;s allocating your resources in the right ratio that gets the job done. In this case, it\u0026#39;s understanding when Siri or Google Assistant is the best fit for a task. Both are among the most popular virtual assistants, each with many strengths.\u003c/p\u003e\n\n\u003cp\u003eWhen you have two phones, a short attention span, and too much data to handle, you want a way to divide and conquer. The iPhone 11 isn\u0026#39;t my primary phone, but it\u0026#39;s easier to handle all communications with Siri in one place. It\u0026#39;s an indispensable piece of Apple\u0026#39;s ecosystem, and it keeps things simple. It\u0026#39;s responsive when I need it because I can\u0026#39;t get used to iOS\u0026#39;s gesture-based navigation system. At least with Android, you can choose if you\u0026#39;d rather have buttons.\u003c/p\u003e\n\n\n\u003cp\u003eSiri offers a way to bypass that. I use my voice to set reminders, make calls, and send quick texts across WhatsApp, iMessage, and other apps. On the other hand, Google\u0026#39;s solution is the more expansive helper. I use my Realme 12+ 5G as my work phone, for typing and drafting on the go, and for gaming. It is messy with tasks, and there\u0026#39;s a lot of information to manage. I often need a reliable source to make contributions in moments like that.\u003c/p\u003e\n\n\u003cp\u003eBeing integrated with Gemini, Google Assistant gives real-time and updated information across the system. I tested it on my iOS 18 and Android 14 phones several times. One of those times, I asked Siri and Google Assistant what the latest version of Android is. Siri responded with Android 13, adding that the most stable version is Android 9. Google Assistant correctly said Android 15.\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003eBoth virtual assistants can mix up information. Still, you want the one that\u0026#39;s closest to accurate most of the time. Siri tends to pull web results from the internet to answer queries. Because it doesn\u0026#39;t always provide direct answers, you must decide the answer based on those results. Meanwhile, Google Assistant answers based on its knowledge base and taps into Gemini AI to provide more contextually relevant responses.\u003c/p\u003e\n\n\n\n\n\n\n\u003ch2 id=\"google-assistant-takes-me-home-but-siri-is-versatile\"\u003e Google Assistant takes me home, but Siri is versatile \u003c/h2\u003e\n\u003ch3 id=\"to-each-strength-is-a-shortcoming\"\u003e To each strength is a shortcoming \u003c/h3\u003e\n\u003cp\u003eIn navigation, I prefer asking Google Assistant to open Google Maps and give me directions rather than dealing with Siri. When I say, \u0026#34;Hey Google, take me home,\u0026#34; it opens the map to get me on my way. Even while driving, I can get directions, check live traffic conditions, adjust my route, and \u003ca href=\"https://www.androidpolice.com/how-to-download-google-maps-offline/\" target=\"_blank\"\u003euse offline maps\u003c/a\u003e. I can\u0026#39;t trust Siri to do all that because it can direct you to places far off from where you intended, sometimes on another continent, if you aren\u0026#39;t careful.\u003c/p\u003e\n\n\u003cp\u003eIt\u0026#39;s annoying when Siri doesn\u0026#39;t prioritize nearby options like Google Maps. However, it works with third-party apps, including Google Maps, Waze, and Pandora. You can launch your preferred navigation map using a command. This feature was introduced in 2019 on iOS 13. It\u0026#39;s useful for anyone who likes using Google Maps on their iPhone. With iOS 18, it sounds even more natural.\u003c/p\u003e\n\n\n\n\n\u003cp\u003eSiri is customizable, and you can adjust how fast it talks to suit your listening style. If you prefer not to hear the voice, turn it off. You\u0026#39;re limited to the \u003ca href=\"https://www.androidpolice.com/how-to-change-voice-google-assistant/\" target=\"_blank\"\u003epreset voices on Android\u003c/a\u003e and can\u0026#39;t do much about anything else. I also love that there\u0026#39;s no linearity to how you can control Siri on the iPhone. One way I experiment is with Siri Shortcuts.\u003c/p\u003e\n\n\u003cp\u003eOccasionally, I program my phone to text a contact automatically when it detects my arrival at a location on Apple Maps. However, there may be a delay. I have a separate shortcut with preset messages for moments like that. When I say, \u0026#34;Hey Siri, [shortcut name],\u0026#34; it brings up the text so that I can press send. Other times, I use shortcuts to play a specific playlist on Apple Music.\u003c/p\u003e\n\n\n\n\n\u003cdiv data-include-community-rating=\"false\" id=\"dbb4-47c3-a18a7749ece4\" data-nosnippet=\"\"\u003e\u003ca href=\"https://www.androidpolice.com/make-google-maps-app-default-iphone/\"\u003e\u003cdiv data-img-url=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/11/how-to-make-google-maps-the-default-navigation-app-on-your-iphone.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\u003cfigure\u003e\u003cpicture\u003e\u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/11/how-to-make-google-maps-the-default-navigation-app-on-your-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\" srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/11/how-to-make-google-maps-the-default-navigation-app-on-your-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\"/\u003e\u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/11/how-to-make-google-maps-the-default-navigation-app-on-your-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\" srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/11/how-to-make-google-maps-the-default-navigation-app-on-your-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\"/\u003e\u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/11/how-to-make-google-maps-the-default-navigation-app-on-your-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\" srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/11/how-to-make-google-maps-the-default-navigation-app-on-your-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\"/\u003e\u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/11/how-to-make-google-maps-the-default-navigation-app-on-your-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\" srcset=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/11/how-to-make-google-maps-the-default-navigation-app-on-your-iphone.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\"/\u003e\u003cimg width=\"2560\" height=\"1440\" loading=\"lazy\" decoding=\"async\" alt=\"The Google Maps app open on an iPhone\" data-img-url=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/11/how-to-make-google-maps-the-default-navigation-app-on-your-iphone.jpg\" src=\"https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/11/how-to-make-google-maps-the-default-navigation-app-on-your-iphone.jpg\"/\u003e \u003c/picture\u003e \u003c/figure\u003e \u003c/div\u003e \u003c/a\u003e\u003cp\u003e\u003cspan data-field=\"label\"\u003eRelated\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch5\u003e\u003ca href=\"https://www.androidpolice.com/make-google-maps-app-default-iphone/\" title=\"How to make Google Maps the default navigation app on your iPhone\" target=\"_blank\"\u003e How to make Google Maps the default navigation app on your iPhone \u003c/a\u003e \u003c/h5\u003e\u003cp\u003eGetting lost with Apple Maps? You can set Google Maps as the default on your iPhone in seconds\u003c/p\u003e \u003c/div\u003e \u003c/div\u003e\n\n\n\n\u003ch2 id=\"who-is-more-responsive\"\u003e Who is more responsive? \u003c/h2\u003e\n\u003ch3 id=\"because-you-need-an-assistant-that-actually-listens\"\u003e Because you need an assistant that actually listens \u003c/h3\u003e\n\u003cp\u003eI\u0026#39;ve heard people say Google Assistant is more responsive, but it isn\u0026#39;t always easy to say. Both assistants can be wonky. There are moments when Google Assistant refuses to respond, misinterprets my commands, or doesn\u0026#39;t perform the action I want. At the same time, Siri doesn\u0026#39;t understand the request or context.\u003c/p\u003e\n\n\u003cp\u003eBoth have their moments of greatness and their fair share of frustrating glitches. If it feels like Google Assistant hears you more, it\u0026#39;s because Google has an advantage in data and computing resources. Unlike Apple, which is more privacy-focused and limits the amount of user data it collects, Google can access more data pools that we contribute to improve its voice recognition models.\u003c/p\u003e\n\n\n\n\n\u003cp\u003ePlus, \u003ca href=\"https://blog.google/technology/ai/on-device-processing/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eits Tensor chips\u003c/a\u003e are tailored for any on-device AI and machine learning function. Even with Apple\u0026#39;s ARM-based M1 and M2 chips, they don\u0026#39;t have the same scale of infrastructure to match Google in training models and improving voice recognition.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"make-the-most-of-android-and-apple\"\u003e Make the most of Android and Apple \u003c/h2\u003e\n\u003cp\u003eYou don\u0026#39;t have to choose between Siri and Google Assistant. Both ecosystems are designed with your preferences in mind, not necessarily for competition. Siri is the way to go if your priorities are simplicity, privacy, and a tight connection with your Apple devices. If you want broader search capabilities, superior integration with Google services, and a smarter assistant for complex queries, \u003ca href=\"https://www.androidpolice.com/how-to-use-google-assistant/\" target=\"_blank\"\u003euse Google Assistant\u003c/a\u003e. You can even combine both. The trick is to look beyond the basics and create smarter workflows for yourself.\u003c/p\u003e\n\n \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-29T21:11:50Z",
  "modifiedTime": "2024-12-29T21:11:50Z"
}
