{
  "id": "eae5b032-5dc4-493c-83b0-fadf464fd8e1",
  "title": "iPadOS 19 to get macOS-style menu bar, iOS 19 to have external display support",
  "link": "https://www.gsmarena.com/ipados_19_to_get_macosstyle_menu_bar_ios_19_to_have_external_display_support-news-67533.php",
  "description": "Apple is expected to unveil iOS 19 and iPadOS 19 at its annual WorldWide Developers Conference (WWDC) in June, and we've already heard rumors that these versions of its mobile operating systems will feature the most changes in years, with UI elements reminiscent of Apple's visionOS. Today a new rumor claims iPadOS 19 will get a macOS-style menu bar at the top when you use your iPad with Apple's Magic Keyboard. Thus the experience will be much more laptop-like (or, specifically, MacBook-like). There will also be Storage Manager 2.0, an enhanced multitasking experience that...",
  "author": "",
  "published": "Fri, 25 Apr 2025 02:02:01 +0200",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Vlad",
  "length": 1079,
  "excerpt": "Once again it seems like iOS 19 and iPadOS 19 will have the most changes and new features in years. Apple is expected to unveil iOS 19 and iPadOS 19 at its...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "Apple is expected to unveil iOS 19 and iPadOS 19 at its annual WorldWide Developers Conference (WWDC) in June, and we've already heard rumors that these versions of its mobile operating systems will feature the most changes in years, with UI elements reminiscent of Apple's visionOS. Today a new rumor claims iPadOS 19 will get a macOS-style menu bar at the top when you use your iPad with Apple's Magic Keyboard. Thus the experience will be much more laptop-like (or, specifically, MacBook-like). There will also be Storage Manager 2.0, an enhanced multitasking experience that automatically activates when the keyboard is attached. This should make managing apps and windows \"smoother and more productive than ever\", the source of this leak says. iOS 19 will add support for external displays for iPhones with a USB-C port, and this will offer up a Stage Manager-like UI. It won't be a full desktop mode, but will let you extend your screen space onto a display or TV. There may be some limitations in resolution and/or the number of apps displayed at the same time. Source",
  "image": "https://fdn.gsmarena.com/imgroot/news/25/04/ipados-19-macos-like-ui-ios-19-usb-c-display-out/-952x498w6/gsmarena_000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eApple is expected to unveil iOS 19 and iPadOS 19 at its annual WorldWide Developers Conference (WWDC) in June, and we\u0026#39;ve already heard rumors that these versions of its mobile operating systems will \u003ca href=\"https://www.gsmarena.com/apple_to_bring_major_revamp_across_ios_ipados_and_macos-news-66887.php\"\u003efeature the most changes in years\u003c/a\u003e, with UI elements reminiscent of Apple\u0026#39;s visionOS.\u003c/p\u003e\n\n\u003cp\u003eToday a new rumor claims iPadOS 19 will get a macOS-style menu bar at the top when you use your iPad with Apple\u0026#39;s Magic Keyboard. Thus the experience will be much more laptop-like (or, specifically, MacBook-like).\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"750\" src=\"https://fdn.gsmarena.com/imgroot/news/25/04/ipados-19-macos-like-ui-ios-19-usb-c-display-out/inline/-1200/gsmarena_001.jpg\" alt=\"iPadOS 19 to get macOS-style menu bar, iOS 19 to have external display support\"/\u003e\u003c/p\u003e\u003cp\u003eThere will also be Storage Manager 2.0, an enhanced multitasking experience that automatically activates when the keyboard is attached. This should make managing apps and windows \u0026#34;smoother and more productive than ever\u0026#34;, the source of this leak says.\u003c/p\u003e\n\n\u003cp\u003eiOS 19 will add support for external displays for iPhones with a USB-C port, and this will offer up a Stage Manager-like UI. It won\u0026#39;t be a full desktop mode, but will let you extend your screen space onto a display or TV. There may be some limitations in resolution and/or the number of apps displayed at the same time.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://majinbuofficial.com/ipados-19-and-ios-19-new-features/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSource\u003c/a\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-25T02:02:01+02:00",
  "modifiedTime": null
}
