{
  "id": "f20604de-6131-4647-9ff7-d3213405d581",
  "title": "Galaxy S22 may feature 25W charging while siblings to get 45W support",
  "link": "https://androidcommunity.com/galaxy-s22-may-feature-25w-charging-while-siblings-to-get-45w-support-20220201/",
  "description": "Samsung Galaxy S22 series is slated to arrive on February 9, 2022, in the virtual Galaxy Unpacked Event, and already much has been seen of the flagship devices in leaks and rumors. So far, we know enough about what the Galaxy S22, S22 Plus, and S22 Ultra will look like, and their respective specifications. A […]",
  "author": "Bharat Bhushan",
  "published": "Tue, 01 Feb 2022 14:50:00 +0000",
  "source": "https://androidcommunity.com/feed/",
  "categories": [
    "Archive",
    "Android",
    "Phones",
    "Samsung"
  ],
  "byline": "Bharat Bhushan",
  "length": 1820,
  "excerpt": "",
  "siteName": "Android Community",
  "favicon": "https://androidcommunity.com/images/ac_favicon.png",
  "text": "Samsung Galaxy S22 series is slated to arrive on February 9, 2022, in the virtual Galaxy Unpacked Event, and already much has been seen of the flagship devices in leaks and rumors. So far, we know enough about what the Galaxy S22, S22 Plus, and S22 Ultra will look like, and their respective specifications. A new finding by DEMKO certification has revealed the charging speeds of the respective devices, and the vanilla Galaxy S22 doesn’t spell much hope, to be honest. Denmark’s trusted certification organization has qualified the Galaxy S22 to have 25W charging speed, which is like snail’s pace in the current times – especially for a flagship device! If this will turn out to be true, then Galaxy S22 will not see any incremental change from the predecessor and would be able to charge its supposed 3,700mAh battery in around 70 minutes or even higher. On the other hand, S22 Plus and S22 Ultra are speculated to feature 45W fast charging support, which will not hurt as much as in the case of the vanilla model. That’s because fast charging speeds of 55W, 65W and even 120W have more or less become a norm for premium flagship and budget flagship devices in the Android ecosystem courtesy other manufacturers like OPPO, Vivo, Xiaomi, and OnePlus. If that alone wasn’t a big disappointment for users who want to own the cheapest Galaxy S22 device in the series, there’s one more thing to consider. The phones will most likely ship without the charger in the box, again this time, so you’ll have to buy one separately. Dutch website Nieuwe Mobiel has posted images showing the upcoming flagship devices being charged with the respective charging speeds clearly mentioned. Now that the flagship series is more than likely to show up at the Unpacked Event, things will be crystal clear, once and for all real soon.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003e\u003cimg width=\"696\" height=\"392\" src=\"https://androidcommunity.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-Ultra-leak_img2-696x392.jpg\" srcset=\"https://androidcommunity.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-Ultra-leak_img2-696x392.jpg 696w, https://androidcommunity.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-Ultra-leak_img2-768x432.jpg 768w, https://androidcommunity.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-Ultra-leak_img2-1068x601.jpg 1068w, https://androidcommunity.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-Ultra-leak_img2-747x420.jpg 747w, https://androidcommunity.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-Ultra-leak_img2.jpg 1280w\" sizes=\"(max-width: 696px) 100vw, 696px\" alt=\"\" title=\"Samsung-Galaxy-S22-Ultra-leak_img2\"/\u003e\u003c/p\u003e\n            \u003cp\u003eSamsung Galaxy S22 series is slated to arrive on February 9, 2022, in the virtual Galaxy Unpacked Event, and already much has been seen of the flagship devices in leaks and rumors. So far, we \u003ca href=\"https://androidcommunity.com/samsung-galaxy-s22-things-we-know-so-far-20220126/\"\u003eknow enough\u003c/a\u003e about what the Galaxy S22, S22 Plus, and S22 Ultra will look like, and their respective specifications. A new finding by DEMKO certification has revealed the charging speeds of the respective devices, and the vanilla Galaxy S22 doesn’t spell much hope, to be honest.\u003c/p\u003e\n\n\n\u003cp\u003eDenmark’s trusted certification organization has qualified the Galaxy S22 to have 25W charging speed, which is like snail’s pace in the current times – especially for a flagship device! If this will turn out to be true, then Galaxy S22 will not see any incremental change from the predecessor and would be able to charge its supposed 3,700mAh battery in around 70 minutes or even higher.\u003c/p\u003e\n\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://androidcommunity.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-charging-speed.jpg\" alt=\"\" width=\"1280\" height=\"720\" srcset=\"https://androidcommunity.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-charging-speed.jpg 1280w, https://androidcommunity.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-charging-speed-768x432.jpg 768w, https://androidcommunity.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-charging-speed-696x392.jpg 696w, https://androidcommunity.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-charging-speed-1068x601.jpg 1068w, https://androidcommunity.com/wp-content/uploads/2022/02/Samsung-Galaxy-S22-charging-speed-747x420.jpg 747w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\u003c/p\u003e\n\u003cp\u003eOn the other hand, S22 Plus and S22 Ultra are speculated to feature 45W fast charging support, which will not hurt as much as in the case of the vanilla model. That’s because fast charging speeds of 55W, 65W and even 120W have more or less become a norm for premium flagship and budget flagship devices in the Android ecosystem courtesy other manufacturers like OPPO, Vivo, Xiaomi, and OnePlus.\u003c/p\u003e\n\u003cp\u003eIf that alone wasn’t a big disappointment for users who want to own the cheapest Galaxy S22 device in the series, there’s one more thing to consider. The phones will most likely ship without the charger in the box, again this time, so you’ll have to buy one separately.\u003c/p\u003e\n\u003cp\u003eDutch website \u003ca href=\"https://www.nieuwemobiel.nl/011437/18159/Exclusief-Samsung-Galaxy-S22-krijgt-slechts-25W-snelladen.html\" target=\"_blank\" rel=\"noopener\"\u003eNieuwe Mobiel\u003c/a\u003e has posted images showing the upcoming flagship devices being charged with the respective charging speeds clearly mentioned. Now that the flagship series is more than likely to show up at the Unpacked Event, things will be crystal clear, once and for all real soon.\u003c/p\u003e\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2022-02-01T14:50:00-06:00",
  "modifiedTime": null
}
