{
  "id": "face80e8-3e8f-48e2-8642-361f71db5ae1",
  "title": "Sony LinkBuds Open review",
  "link": "https://www.gsmarena.com/sony_linkbuds_open_review-news-65363.php",
  "description": "The LinkBuds Open, also known as the WF-L910, are the second generation version of the original Sony LinkBuds. These are fairly unique, open-ear style earbuds which take the open-ear concept to a new level by literally having a hole in the middle of the earbuds for ambient sound to pass through. The second generation model has an updated design, new driver, second generation audio processor, Spatial Audio with head tracking, and longer battery life. Priced at $200, these earbuds still cost a pretty penny. Let’s see if they are good enough. Design The design of the LinkBuds...",
  "author": "",
  "published": "Sun, 17 Nov 2024 22:03:01 +0100",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Prasad",
  "length": 16492,
  "excerpt": "These are fairly unique, open-ear style earbuds which take the open-ear concept to a new level. The LinkBuds Open, also known as the WF-L910, are the...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "The LinkBuds Open, also known as the WF-L910, are the second generation version of the original Sony LinkBuds. These are fairly unique, open-ear style earbuds which take the open-ear concept to a new level by literally having a hole in the middle of the earbuds for ambient sound to pass through. The second generation model has an updated design, new driver, second generation audio processor, Spatial Audio with head tracking, and longer battery life. Priced at $200, these earbuds still cost a pretty penny. Let’s see if they are good enough. Design The design of the LinkBuds Open is the star of the show. The earbuds have an unconventional dual pod design that they share with their predecessors. Unlike most other earbuds that have the driver and the electronics in a single shell, the LinkBuds Open need to have two distinct pods since one of them has a hole right through it. Sony has altered the design of the earbuds in several ways over the LinkBuds. The units are now 2mm shorter in length as a result of the smaller driver module. The back of the earbuds that houses the electronics now has a rubber cover around it, which also features supports to secure the earbuds in your ears. The rubber covers are removable and you can swap them out for different colored ones. There aren’t different sizes available so this is truly one-size-fits-all. Turn the earbuds and you get to see the driver arrangement. Unlike other earbuds that are located deeper inside the shell and have their sound piped through a port pointed directly towards the inner ear, the LinkBuds Open driver is ring-shaped and outputs through a dotted ring directly in front of it. This also means the driver doesn’t fire directly into your inner ear but rather into a wall on the side, and the sound then eventually makes its way in. That might sound weird but that’s how we hear most sounds naturally. The LinkBuds Open don’t have any external buttons on touch targets. Instead, you have to tap the area just in front of your ears. This also means the gestures are simplified on the LinkBuds Open as you can only tap and not tap and hold as on other earbuds. There is also no single tap gesture available and the minimum is two taps, which also limits the range of gestures you can assign. In terms of build quality, the LinkBuds Open feel well-made. Most of the outside is covered in the rubber cover, which feels intentional in order to protect the earbuds when they inevitably fall out of your ears. The earbuds don’t go too deep in your ears so they also generally stay cleaner than in-ear models. Lastly, the earbuds are IPX4 certified for splash resistance. Moving on to the case, the LinkBuds Open have a new design compared to the original model. The case is smaller with a shape that looks like two pebbles stacked on top of each other. The white model has a glossy finish and marbled pattern on top, which is a bit hard to see. The lid now closes magnetically instead of with a latch and the earbuds also stay in place magnetically. As with the previous model, the case does not support wireless charging. The LinkBuds Open are available in three colors, white, black, and a limited edition violet, which is made in collaboration with Olivia Rodrigo. This variant also enables a different color theme in the Sony app along with two exclusive EQ presets. Comfort Comfort can be a divisive topic with earbuds due to the differences in people’s ear shapes and sizes. However, one thing in-ear style earbuds assure the user is that the earbuds won’t fall out, even if they might not be very comfortable. However, with open-ear style earbuds, the question is not just of comfort but also whether or not the earbuds actually stay in your ears. With the LinkBuds Open, I can unfortunately say that they simply do not stay in my ears. I’ve looked at all of Sony’s promotional material as well as the manual on how to wear them and have come to the conclusion that my ears simply aren’t the required shape or size to hold these earbuds the way they are designed to be. At first, this was hard to swallow, as I’ve never had issues with older style open-ear earbuds (or earphones as we used to call them). Even the original AirPods, which many people struggled with, fit like custom made IEMs in my ears. As such, the LinkBuds Open being completely unable to fit my ears was a bit of a shock. I cannot overstate how futile it was trying to wear these earbuds; I may as well be trying to make them stay in place on a completely flat wall. They fall out as soon as I let go. If you look at Sony’s promotional material, you will see people with ear cavities large enough to house the two pods of these earbuds fully within their concha and also have antihelix curves that perfectly grip on to the rubber support tip. My ears aren’t big enough for this to happen so I simply cannot wear the LinkBuds Open the way they are intended. The solution for me was to shove the driver portion of the earbuds deeper into the ear, which then caused the upper portion to fit better. This had repercussions on the sound quality but at least I could wear the earbuds outside without having to worry about them falling out. As such, there is no point discussing comfort for me. I’m sure it’s great (or not) if I could wear them the way they were intended but the way I ended up wearing them caused discomfort after a few minutes as there were too many hard plastic bits inside my ears where they aren’t supposed to be. All I can say is that unless you have large ears, I wouldn’t bother looking at these at all. Software and features The LinkBuds Open pair with the Sony Connect app, available on iOS and Android. The app has gotten quite a bit bloated over the years with one too many features that most people will just ignore (assuming they even download it) and still has one of the longest, most annoying setup process with seemingly countless steps and screens you have to go through before you can reach the main menu. The app will automatically edit itself and show only those features which are available for your paired earbuds. The LinkBuds Open, despite being premium earbuds, support fewer features than most of Sony’s other premium models, so the app is relatively cleaner. Sony Sound Connect app The meat and potatoes of the app remains the audio settings, where you can access the EQ presets along with a manual EQ. There is also a Find Your Equalizer option, which lets you pick your preferred sound by playing different EQ presets and letting you pick the one you like the best. There’s also an interesting Background Music Effect feature, which emulates the effect of sound playing in different rooms; the default is Cafe, where it sounds like you’re listening to music playing from a cafe speakers but there are also options to switch to other rooms. Sound settings The LinkBuds Open also support Android’s Spatial Audio with head tracking, which works with select devices. There’s also Sony’s 360 Reality Audio feature, which is even more gimmicky as it’s only available in a handful of services, and not compatible with Dolby Atmos used by Apple Music. There’s also a new Auto Play feature, which lets you configure things like your music app and favorite music in advance and then the earbuds will automatically start playing when you wear them without having to interact with the phone. System settings Other features include Sony’s DSEE upscaling, which really only works with low bitrate content, multi-device pairing, adaptive volume control, which automatically adjusts volume based on ambient noise, Head Gesture for accepting or rejecting calls by shaking your head up/down or sideways, and auto power off. The LinkBuds Open support SBC, AAC, and LC3 codecs. LC3 is available in Bluetooth LE mode only. For that, you need to enable it from the app and then unpair and repair the earbuds with your phone. Assuming your phone supports Bluetooth LE Audio (very few phones do), then it should play using LC3. You have to repeat all of that to go back to SBC/AAC. Also, a bunch of features including multi-device pairing are disabled when using Bluetooth LE. Playback controls Finally, you can also update firmware through the app. Sony’s update process is rather slow but also not something you have to deal with often. Our review unit was on the latest 1.2.0 update. Performance Audio quality Testing the audio quality on the LinkBuds Open was an exercise in frustration. I could have shoved them all the way in to stay in place and called it a day but that isn’t how they are meant to be worn nor do they sound right this way. So I constantly had to hold or adjust them until they stayed in the optimal position inside my ears and just stop moving altogether so they don’t fall out. This was necessary to ensure the sound quality analysis below was accurate as if worn by someone to whom the earbuds actually fit. The audio quality of the LinkBuds Open was disappointing but not in a way that was surprising. The design of these earbuds presents some very real challenges and it’s clear not all of them could be overcome even on this second generation product. Starting with by far the biggest flaw, there is no real bass to speak of. Open-ear earbuds don’t have the luxury of a tightly controlled space with a finite volume of air that in-ears have so the bass response always leaves a lot to be desired. On top of that, the LinkBuds Open don’t make things easy for themselves with a ring-shaped driver. While it’s impressive that such a thing even exists, at the end of the day, the driver is a small circular ribbon barely a couple of millimeters in thickness (the 11mm figure only applies to the outer diameter of the ring). Physics will tell you that isn’t enough surface to move air with sufficient force, so even by open-ear standards the bass on the LinkBuds Open was going to be weak. And it is. You essentially don’t hear anything below the upper bass frequencies and the bass frequencies you do hear sound hollow with a strange, wooden timbre. There is no rumble, thump, or punch to the low-end. Actually, there is no low-end. The lower-mids have been boosted to compensate, which gives them a slightly boomy quality that makes male voices overly deep-sounding. The rest of the mids, however, are quite alright. In fact, the mids really are the star of the show here, as they are quite prominent in the mix. The mid and upper mid-range sounds good with a reasonably natural timbre that makes voices and instruments sound authentic. Leading into the treble, the LinkBuds Open once again start losing energy. It’s not clear if this is a driver thing again or just the default tuning but the upper treble frequencies don’t have a lot of sparkle or air to them, which makes them sound blunted. However, the lower treble range is well fleshed-out, so the sound is still somewhat on the bright side when coupled with the boisterous mids. The overall tuning is thus a bit of an inverted v-shaped, with a good, strong mid-range and trailing off at both ends. This works well enough on some genres, where the lack of a low-end wasn’t as badly felt. For example, a lot of older pop doesn’t always have the most the most deep, thumping bass and as such can sound just fine on the LinkBuds Open, especially since it also tends to be on the brighter side that compensates for the lack of treble extension. On the other hand, genres that specialize in bass just sound awful, as if you are listening to damaged drivers. Unfortunately, you don’t really need to listen to such music to notice this as the bass deficit on the LinkBuds Open goes so high up the frequency range that a large majority of the music sounds incomplete on these earbuds. On top of that, the drivers are also not the most resolving, so the sound is a bit soft and lacking fine detail. The earbuds also don’t get particularly loud, which is odd for open-air design but may just be a limitation of this driver design. As such, it’s not uncommon to find yourself near, if not at, the maximum volume often. I also did not find the spatial characteristics of these earbuds particularly noteworthy. Being inside your ears, they do block more of your ear canal than an open-back pair of headphones and with the driver being so closed to the ears, there’s only so much it can fool your ears that you are listening to a pair of speakers. While there is a slightly better sense of space than some other earbuds, I have heard similar or better from some other in-ear models. Microphone The LinkBuds Open have average microphone performance. The sound is soft and on the quieter side so you might need to speak up a bit. The sound is still fairly natural-sounding without any notable digital processing artifacts. In noisy environments, the LinkBuds Open do a good job of suppressing background noise and keeping your voice audible. The sound does get even more soft, however, but people should still be able to understand you if you speak up a bit. Noise cancellation The LinkBuds Open have no active or passive noise cancellation as that would be missing the point. They also don’t have a transparency mode as the sound is supposed to go through the hole they made just for that purpose. The earbuds let most, if not all, of the ambient noise in. However, I did not find this effect to be notably better than your average AirPods style open-ear earbuds. It’s worth remembering that although the LinkBuds Open do have a hole in them, the hole doesn’t necessarily align perfectly with your ear canal. I tried blocking it on one of the earbuds and while there was a small difference, I wouldn’t say it was super noticeable. When out and about, it’s hard not to get distracted by literally every single sound happening around you. But since this is by design, there’s no point complaining about it. It’s just that I can’t find a good enough justification for this that standard AirPods-style open-ear earbuds or even transparency mode on in-ear models cannot achieve. Latency The LinkBuds Open have good latency performance. When paired with a PC, the earbuds had low enough latency to not be noticeable while watching videos and are usable for casual gaming. Connectivity The LinkBuds Open had good overall connectivity performance. However, there seemed to be an issue with either this unit or the firmware where adjusting volume caused a noticeable popping noise, and it could be repeated with multiple different paired devices. Also, every time you hit pause, the left earbud stops a split second later, which is quite noticeable. Battery Life The LinkBuds Open have a claimed 8 hours of battery life for continuous operation. The battery life test was still ongoing at the time of writing but should be completed soon and the text here will be updated. Sony earbuds always hit and usually exceed their claims so it’s not something to be concerned about. Conclusion The Sony LinkBuds Open are priced at $200 but were down to $180 at the time of writing. As a proof of concept, the LinkBuds Open is undeniably cool. An earbud that has a hole right through the speaker so you can hear everything around you? You have to admit, that sounds pretty damn cool. But as an actual product, the LinkBuds Open fails to make the jump from a good concept to a good product. The one-size-fits-all design is one-size for sure but does not fit all. The speaker holes also had to come at the cost of audio quality, which is mediocre for a $200 pair of earbuds. So the earphones either don’t fit you at all or they fit but don’t sound very good. Sony’s solution to letting you hear ambient sounds is strangely analog in a world of digital alternatives. Drilling a hole through your speakers sounds like something people would have done before the invention of transparency modes. But we do have transparency modes now that are almost as good as not having anything in your ears. Not to mention you can still buy standard AirPods-style open-ear earbuds, which are often quite cheap these days and are almost as good at letting ambient sound in. So, I’m sorry but I don’t get it. I don’t get who this product is for and why should they or anyone else deal with its many limitations for such little gain. Even if Sony manages to iron out all the issues in the subsequent iteration, it will still have to answer the first question and I’m afraid there is no good answer.",
  "image": "https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/-952x498w6/gsmarena_000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eThe LinkBuds Open, also known as the WF-L910, are the second generation version of the original Sony LinkBuds. These are fairly unique, open-ear style earbuds which take the open-ear concept to a new level by literally having a hole in the middle of the earbuds for ambient sound to pass through.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_001.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eThe second generation model has an updated design, new driver, second generation audio processor, Spatial Audio with head tracking, and longer battery life. Priced at $200, these earbuds still cost a pretty penny. Let’s see if they are good enough.\u003c/p\u003e\n\n\u003ch3\u003eDesign\u003c/h3\u003e\n\n\u003cp\u003eThe design of the LinkBuds Open is the star of the show. The earbuds have an unconventional dual pod design that they share with their predecessors. Unlike most other earbuds that have the driver and the electronics in a single shell, the LinkBuds Open need to have two distinct pods since one of them has a hole right through it.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"801\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_002.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eSony has altered the design of the earbuds in several ways over the LinkBuds. The units are now 2mm shorter in length as a result of the smaller driver module. The back of the earbuds that houses the electronics now has a rubber cover around it, which also features supports to secure the earbuds in your ears. The rubber covers are removable and you can swap them out for different colored ones. There aren’t different sizes available so this is truly one-size-fits-all.\u003c/p\u003e\n\n\u003cp\u003eTurn the earbuds and you get to see the driver arrangement. Unlike other earbuds that are located deeper inside the shell and have their sound piped through a port pointed directly towards the inner ear, the LinkBuds Open driver is ring-shaped and outputs through a dotted ring directly in front of it. This also means the driver doesn’t fire directly into your inner ear but rather into a wall on the side, and the sound then eventually makes its way in. That might sound weird but that’s how we hear most sounds naturally.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_003.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eThe LinkBuds Open don’t have any external buttons on touch targets. Instead, you have to tap the area just in front of your ears. This also means the gestures are simplified on the LinkBuds Open as you can only tap and not tap and hold as on other earbuds. There is also no single tap gesture available and the minimum is two taps, which also limits the range of gestures you can assign.\u003c/p\u003e\n\n\u003cp\u003eIn terms of build quality, the LinkBuds Open feel well-made. Most of the outside is covered in the rubber cover, which feels intentional in order to protect the earbuds when they inevitably fall out of your ears. The earbuds don’t go too deep in your ears so they also generally stay cleaner than in-ear models. Lastly, the earbuds are IPX4 certified for splash resistance.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_004.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eMoving on to the case, the LinkBuds Open have a new design compared to the original model. The case is smaller with a shape that looks like two pebbles stacked on top of each other. The white model has a glossy finish and marbled pattern on top, which is a bit hard to see. The lid now closes magnetically instead of with a latch and the earbuds also stay in place magnetically. As with the previous model, the case does not support wireless charging.\u003c/p\u003e\n\n\u003cp\u003eThe LinkBuds Open are available in three colors, white, black, and a limited edition violet, which is made in collaboration with Olivia Rodrigo. This variant also enables a different color theme in the Sony app along with two exclusive EQ presets.\u003c/p\u003e\n\n\u003ch3\u003eComfort\u003c/h3\u003e\n\n\u003cp\u003eComfort can be a divisive topic with earbuds due to the differences in people’s ear shapes and sizes. However, one thing in-ear style earbuds assure the user is that the earbuds won’t fall out, even if they might not be very comfortable. However, with open-ear style earbuds, the question is not just of comfort but also whether or not the earbuds actually stay in your ears.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_005.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eWith the LinkBuds Open, I can unfortunately say that they simply do not stay in my ears. I’ve looked at all of Sony’s promotional material as well as the manual on how to wear them and have come to the conclusion that my ears simply aren’t the required shape or size to hold these earbuds the way they are designed to be.\u003c/p\u003e\n\n\u003cp\u003eAt first, this was hard to swallow, as I’ve never had issues with older style open-ear earbuds (or earphones as we used to call them). Even the original AirPods, which many people struggled with, fit like custom made IEMs in my ears.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_006.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eAs such, the LinkBuds Open being completely unable to fit my ears was a bit of a shock. I cannot overstate how futile it was trying to wear these earbuds; I may as well be trying to make them stay in place on a completely flat wall. They fall out as soon as I let go.\u003c/p\u003e\n\n\u003cp\u003eIf you look at Sony’s promotional material, you will see people with ear cavities large enough to house the two pods of these earbuds fully within their concha and also have antihelix curves that perfectly grip on to the rubber support tip. My ears aren’t big enough for this to happen so I simply cannot wear the LinkBuds Open the way they are intended.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_007.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eThe solution for me was to shove the driver portion of the earbuds deeper into the ear, which then caused the upper portion to fit better. This had repercussions on the sound quality but at least I could wear the earbuds outside without having to worry about them falling out.\u003c/p\u003e\n\n\u003cp\u003eAs such, there is no point discussing comfort for me. I’m sure it’s great (or not) if I could wear them the way they were intended but the way I ended up wearing them caused discomfort after a few minutes as there were too many hard plastic bits inside my ears where they aren’t supposed to be. All I can say is that unless you have large ears, I wouldn’t bother looking at these at all.\u003c/p\u003e\n\n\u003ch3\u003eSoftware and features\u003c/h3\u003e\n\n\u003cp\u003eThe LinkBuds Open pair with the Sony Connect app, available on iOS and Android. The app has gotten quite a bit bloated over the years with one too many features that most people will just ignore (assuming they even download it) and still has one of the longest, most annoying setup process with seemingly countless steps and screens you have to go through before you can reach the main menu.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_008.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eThe app will automatically edit itself and show only those features which are available for your paired earbuds. The LinkBuds Open, despite being premium earbuds, support fewer features than most of Sony’s other premium models, so the app is relatively cleaner.\u003c/p\u003e\n\n\n\u003cp\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/24/11/sony-linkbuds-open-review/inline/-1200x900mw5/gsmarena_009.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"Sony Sound Connect app\" width=\"215\" height=\"466\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-215/gsmarena_009.jpg\"/\u003e\u003c/a\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/24/11/sony-linkbuds-open-review/inline/-1200x900mw5/gsmarena_010.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"Sony Sound Connect app\" width=\"215\" height=\"466\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-215/gsmarena_010.jpg\"/\u003e\u003c/a\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/24/11/sony-linkbuds-open-review/inline/-1200x900mw5/gsmarena_011.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"Sony Sound Connect app\" width=\"215\" height=\"466\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-215/gsmarena_011.jpg\"/\u003e\u003c/a\u003e\n\u003cbr/\u003e\u003cspan\u003e\u003cstrong\u003eSony Sound Connect app\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\u003cp\u003eThe meat and potatoes of the app remains the audio settings, where you can access the EQ presets along with a manual EQ. There is also a Find Your Equalizer option, which lets you pick your preferred sound by playing different EQ presets and letting you pick the one you like the best. There’s also an interesting Background Music Effect feature, which emulates the effect of sound playing in different rooms; the default is Cafe, where it sounds like you’re listening to music playing from a cafe speakers but there are also options to switch to other rooms.\u003c/p\u003e\n\n\n\u003cp\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/24/11/sony-linkbuds-open-review/inline/-1200x900mw5/gsmarena_012.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"Sound settings\" width=\"215\" height=\"466\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-215/gsmarena_012.jpg\"/\u003e\u003c/a\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/24/11/sony-linkbuds-open-review/inline/-1200x900mw5/gsmarena_013.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"Sound settings\" width=\"215\" height=\"466\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-215/gsmarena_013.jpg\"/\u003e\u003c/a\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/24/11/sony-linkbuds-open-review/inline/-1200x900mw5/gsmarena_014.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"Sound settings\" width=\"215\" height=\"466\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-215/gsmarena_014.jpg\"/\u003e\u003c/a\u003e\n\u003cbr/\u003e\u003cspan\u003e\u003cstrong\u003eSound settings\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\u003cp\u003eThe LinkBuds Open also support Android’s Spatial Audio with head tracking, which works with select devices. There’s also Sony’s 360 Reality Audio feature, which is even more gimmicky as it’s only available in a handful of services, and not compatible with Dolby Atmos used by Apple Music.\u003c/p\u003e\n\n\u003cp\u003eThere’s also a new Auto Play feature, which lets you configure things like your music app and favorite music in advance and then the earbuds will automatically start playing when you wear them without having to interact with the phone.\u003c/p\u003e\n\n\n\u003cp\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/24/11/sony-linkbuds-open-review/inline/-1200x900mw5/gsmarena_015.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"System settings\" width=\"215\" height=\"466\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-215/gsmarena_015.jpg\"/\u003e\u003c/a\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/24/11/sony-linkbuds-open-review/inline/-1200x900mw5/gsmarena_016.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"System settings\" width=\"215\" height=\"466\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-215/gsmarena_016.jpg\"/\u003e\u003c/a\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/24/11/sony-linkbuds-open-review/inline/-1200x900mw5/gsmarena_017.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"System settings\" width=\"215\" height=\"466\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-215/gsmarena_017.jpg\"/\u003e\u003c/a\u003e\n\u003cbr/\u003e\u003cspan\u003e\u003cstrong\u003eSystem settings\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\u003cp\u003eOther features include Sony’s DSEE upscaling, which really only works with low bitrate content, multi-device pairing, adaptive volume control, which automatically adjusts volume based on ambient noise, Head Gesture for accepting or rejecting calls by shaking your head up/down or sideways, and auto power off.\u003c/p\u003e\n\n\u003cp\u003eThe LinkBuds Open support SBC, AAC, and LC3 codecs. LC3 is available in Bluetooth LE mode only. For that, you need to enable it from the app and then unpair and repair the earbuds with your phone. Assuming your phone supports Bluetooth LE Audio (very few phones do), then it should play using LC3. You have to repeat all of that to go back to SBC/AAC. Also, a bunch of features including multi-device pairing are disabled when using Bluetooth LE.\u003c/p\u003e\n\n\n\u003cp\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/24/11/sony-linkbuds-open-review/inline/-1200x900mw5/gsmarena_018.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"Playback controls\" width=\"215\" height=\"466\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-215/gsmarena_018.jpg\"/\u003e\u003c/a\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/24/11/sony-linkbuds-open-review/inline/-1200x900mw5/gsmarena_019.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"Playback controls\" width=\"215\" height=\"466\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-215/gsmarena_019.jpg\"/\u003e\u003c/a\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/24/11/sony-linkbuds-open-review/inline/-1200x900mw5/gsmarena_020.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"Playback controls\" width=\"215\" height=\"466\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-215/gsmarena_020.jpg\"/\u003e\u003c/a\u003e\n\u003cbr/\u003e\u003cspan\u003e\u003cstrong\u003ePlayback controls\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\u003cp\u003eFinally, you can also update firmware through the app. Sony’s update process is rather slow but also not something you have to deal with often. Our review unit was on the latest 1.2.0 update.\u003c/p\u003e\n\n\u003ch3\u003ePerformance\u003c/h3\u003e\n\n\u003cp\u003e\u003cb\u003eAudio quality\u003c/b\u003e\u003c/p\u003e\n\n\u003cp\u003eTesting the audio quality on the LinkBuds Open was an exercise in frustration. I could have shoved them all the way in to stay in place and called it a day but that isn’t how they are meant to be worn nor do they sound right this way. So I constantly had to hold or adjust them until they stayed in the optimal position inside my ears and just stop moving altogether so they don’t fall out. This was necessary to ensure the sound quality analysis below was accurate as if worn by someone to whom the earbuds actually fit.\u003c/p\u003e\n\n\u003cp\u003eThe audio quality of the LinkBuds Open was disappointing but not in a way that was surprising. The design of these earbuds presents some very real challenges and it’s clear not all of them could be overcome even on this second generation product.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_021.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eStarting with by far the biggest flaw, there is no real bass to speak of. Open-ear earbuds don’t have the luxury of a tightly controlled space with a finite volume of air that in-ears have so the bass response always leaves a lot to be desired. On top of that, the LinkBuds Open don’t make things easy for themselves with a ring-shaped driver. While it’s impressive that such a thing even exists, at the end of the day, the driver is a small circular ribbon barely a couple of millimeters in thickness (the 11mm figure only applies to the outer diameter of the ring). Physics will tell you that isn’t enough surface to move air with sufficient force, so even by open-ear standards the bass on the LinkBuds Open was going to be weak.\u003c/p\u003e\n\n\u003cp\u003eAnd it is. You essentially don’t hear anything below the upper bass frequencies and the bass frequencies you do hear sound hollow with a strange, wooden timbre. There is no rumble, thump, or punch to the low-end. Actually, there is no low-end.\u003c/p\u003e\n\n\u003cp\u003eThe lower-mids have been boosted to compensate, which gives them a slightly boomy quality that makes male voices overly deep-sounding. The rest of the mids, however, are quite alright. In fact, the mids really are the star of the show here, as they are quite prominent in the mix. The mid and upper mid-range sounds good with a reasonably natural timbre that makes voices and instruments sound authentic.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_022.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eLeading into the treble, the LinkBuds Open once again start losing energy. It’s not clear if this is a driver thing again or just the default tuning but the upper treble frequencies don’t have a lot of sparkle or air to them, which makes them sound blunted. However, the lower treble range is well fleshed-out, so the sound is still somewhat on the bright side when coupled with the boisterous mids.\u003c/p\u003e\n\n\u003cp\u003eThe overall tuning is thus a bit of an inverted v-shaped, with a good, strong mid-range and trailing off at both ends. This works well enough on some genres, where the lack of a low-end wasn’t as badly felt. For example, a lot of older pop doesn’t always have the most the most deep, thumping bass and as such can sound just fine on the LinkBuds Open, especially since it also tends to be on the brighter side that compensates for the lack of treble extension.\u003c/p\u003e\n\n\u003cp\u003eOn the other hand, genres that specialize in bass just sound awful, as if you are listening to damaged drivers. Unfortunately, you don’t really need to listen to such music to notice this as the bass deficit on the LinkBuds Open goes so high up the frequency range that a large majority of the music sounds incomplete on these earbuds.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_023.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eOn top of that, the drivers are also not the most resolving, so the sound is a bit soft and lacking fine detail. The earbuds also don’t get particularly loud, which is odd for open-air design but may just be a limitation of this driver design. As such, it’s not uncommon to find yourself near, if not at, the maximum volume often.\u003c/p\u003e\n\n\u003cp\u003eI also did not find the spatial characteristics of these earbuds particularly noteworthy. Being inside your ears, they do block more of your ear canal than an open-back pair of headphones and with the driver being so closed to the ears, there’s only so much it can fool your ears that you are listening to a pair of speakers. While there is a slightly better sense of space than some other earbuds, I have heard similar or better from some other in-ear models.\u003c/p\u003e\n\n\u003cp\u003e\u003cb\u003eMicrophone\u003c/b\u003e\u003c/p\u003e\n\n\u003cp\u003eThe LinkBuds Open have average microphone performance. The sound is soft and on the quieter side so you might need to speak up a bit. The sound is still fairly natural-sounding without any notable digital processing artifacts.\u003c/p\u003e\n\n\u003cp\u003eIn noisy environments, the LinkBuds Open do a good job of suppressing background noise and keeping your voice audible. The sound does get even more soft, however, but people should still be able to understand you if you speak up a bit.\u003c/p\u003e\n\n\u003cp\u003e\u003cb\u003eNoise cancellation\u003c/b\u003e\u003c/p\u003e\n\n\u003cp\u003eThe LinkBuds Open have no active or passive noise cancellation as that would be missing the point. They also don’t have a transparency mode as the sound is supposed to go through the hole they made just for that purpose.\u003c/p\u003e\n\n\u003cp\u003eThe earbuds let most, if not all, of the ambient noise in. However, I did not find this effect to be notably better than your average AirPods style open-ear earbuds. It’s worth remembering that although the LinkBuds Open do have a hole in them, the hole doesn’t necessarily align perfectly with your ear canal. I tried blocking it on one of the earbuds and while there was a small difference, I wouldn’t say it was super noticeable.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_024.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eWhen out and about, it’s hard not to get distracted by literally every single sound happening around you. But since this is by design, there’s no point complaining about it. It’s just that I can’t find a good enough justification for this that standard AirPods-style open-ear earbuds or even transparency mode on in-ear models cannot achieve.\u003c/p\u003e\n\n\u003cp\u003e\u003cb\u003eLatency\u003c/b\u003e\u003c/p\u003e\n\n\u003cp\u003eThe LinkBuds Open have good latency performance. When paired with a PC, the earbuds had low enough latency to not be noticeable while watching videos and are usable for casual gaming.\u003c/p\u003e\n\n\u003cp\u003e\u003cb\u003eConnectivity\u003c/b\u003e\u003c/p\u003e\n\n\u003cp\u003eThe LinkBuds Open had good overall connectivity performance. However, there seemed to be an issue with either this unit or the firmware where adjusting volume caused a noticeable popping noise, and it could be repeated with multiple different paired devices. Also, every time you hit pause, the left earbud stops a split second later, which is quite noticeable.\u003c/p\u003e\n\n\u003ch3\u003eBattery Life\u003c/h3\u003e\n\n\u003cp\u003eThe LinkBuds Open have a claimed 8 hours of battery life for continuous operation. The battery life test was still ongoing at the time of writing but should be completed soon and the text here will be updated. Sony earbuds always hit and usually exceed their claims so it’s not something to be concerned about.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_025.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003ch3\u003eConclusion\u003c/h3\u003e\n\n\u003cp\u003eThe Sony LinkBuds Open are priced at $200 but were down to $180 at the time of writing.\u003c/p\u003e\n\n\u003cp\u003eAs a proof of concept, the LinkBuds Open is undeniably cool. An earbud that has a hole right through the speaker so you can hear everything around you? You have to admit, that sounds pretty damn cool. But as an actual product, the LinkBuds Open fails to make the jump from a good concept to a good product.\u003c/p\u003e\n\n\u003cp\u003eThe one-size-fits-all design is one-size for sure but does not fit all. The speaker holes also had to come at the cost of audio quality, which is mediocre for a $200 pair of earbuds. So the earphones either don’t fit you at all or they fit but don’t sound very good.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"802\" src=\"https://fdn.gsmarena.com/imgroot/news/24/11/sony-linkbuds-open-review/inline/-1200w5/gsmarena_026.jpg\" alt=\"Sony LinkBuds Open review\"/\u003e\u003c/p\u003e\u003cp\u003eSony’s solution to letting you hear ambient sounds is strangely analog in a world of digital alternatives. Drilling a hole through your speakers sounds like something people would have done before the invention of transparency modes. But we do have transparency modes now that are almost as good as not having anything in your ears. Not to mention you can still buy standard AirPods-style open-ear earbuds, which are often quite cheap these days and are almost as good at letting ambient sound in.\u003c/p\u003e\n\n\u003cp\u003eSo, I’m sorry but I don’t get it. I don’t get who this product is for and why should they or anyone else deal with its many limitations for such little gain. Even if Sony manages to iron out all the issues in the subsequent iteration, it will still have to answer the first question and I’m afraid there is no good answer.\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": "2024-11-17T22:03:01+01:00",
  "modifiedTime": null
}
