[
  {
    "id": "c19d2c79-ac72-4831-8345-70bd3f81914b",
    "title": "Nordstrom's Spring Sale Is on, and I'm Shocked These 14 Beauty Products Are Still in Stock",
    "link": "https://www.whowhatwear.com/beauty/nordstrom-spring-sale-best-beauty-picks",
    "description": "Going, going…",
    "author": "",
    "published": "Mon, 17 Mar 2025 19:59:33 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/Hcn6YRbQ6Dn7nq96trtjg9.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Beauty"
    ]
  },
  {
    "id": "293c8af7-8644-4311-83e6-25f338a1e808",
    "title": "Spotted on the Streets of L.A.: The Chicest Shoe Trend to Wear With Black Trousers",
    "link": "https://www.whowhatwear.com/fashion/celebrity-style/kaia-gerber-kendall-jenner-black-pants-ballet-flats-outfits",
    "description": "Sorry, sneakers—it's not your time.",
    "author": "",
    "published": "Mon, 17 Mar 2025 17:16:31 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/3PoMnGFsuXG3UgtzTvLhgY.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Celebrity Style",
      "Fashion",
      "Celebrity"
    ]
  },
  {
    "id": "2b0415bf-4796-4887-9c67-4c23fd771b1e",
    "title": "The Best Spring/Summer 2025 Fashion Campaigns",
    "link": "https://www.elle.com/fashion/g62383774/best-spring-summer-2025-fashion-campaigns/",
    "description": "",
    "author": "",
    "published": "Mon, 17 Mar 2025 21:50:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "3ab259cd-33fd-4a04-b2d1-02e2dc2558cb",
    "title": "The 2025 Latin American Fashion Awards Are Now Accepting Submissions﻿",
    "link": "https://www.elle.com/fashion/a64206618/latin-american-fashion-awards-2025-submissions-open/",
    "description": "",
    "author": "",
    "published": "Mon, 17 Mar 2025 18:43:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "d37244d1-df02-4135-b47e-2df064e5a91c",
    "title": "Jonathan Anderson to leave Loewe as fashion houses’ creative upheaval continues",
    "link": "https://www.theguardian.com/fashion/2025/mar/17/jonathan-anderson-to-leave-loewe-as-fashion-houses-creative-upheaval-continues",
    "description": "Designer’s departure comes days after announcement that Demna is to join Gucci from BalenciagaA dizzying round of designer musical chairs in the fashion industry has picked up pace with the announcement that Jonathan Anderson is exiting Loewe.The 40-year-old designer from Magherafelt, Northern Ireland, transformed Loewe during his 11-year tenure from a sleepy Spanish handbag house into the hottest ticket of Paris fashion week. Continue reading...",
    "author": "Jess Cartner-Morley",
    "published": "Mon, 17 Mar 2025 12:13:30 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Fashion",
      "Gucci",
      "Balenciaga",
      "World news"
    ]
  },
  {
    "id": "3f88c9c6-eaa4-4830-a29a-7ddf0015318f",
    "title": "‘Financial microaggressions’: why ‘pink tariffs’ hurt women more than men",
    "link": "https://www.theguardian.com/us-news/2025/mar/17/pink-tariff-tax-women-clothes",
    "description": "Women’s goods are taxed at a higher rate than men’s, an invisible bias that is estimated to cost women $2.5bn a yearMany shoppers know about the so-called pink tax – a needless markup on products marketed to women, even if those products are essentially the same, just cheaper, when sold to men. Personal care items such as razors, deodorants and shampoo fall into this category. But shoppers may be less aware of “pink tariffs”, or taxes on imported goods labeled as “women’s items”.Pink tariffs are one reason women’s clothing tends to cost more than men’s at the checkout counter, and why some women might buy sweatpants or oversized sweaters technically made for “men” – it could save them some cash. Continue reading...",
    "author": "Alaina Demopoulos",
    "published": "Mon, 17 Mar 2025 11:00:26 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Trump tariffs",
      "Gender",
      "US taxation",
      "Manufacturing sector",
      "Consumer spending",
      "Women",
      "Fashion",
      "US news"
    ]
  },
  {
    "id": "714ddd04-ab53-4b69-80e7-378acc1b6bb3",
    "title": "Must Read: Plus-Size Representation Nearly Disappeared From the Fall 2025 Runways, Forever 21 Files for Bankruptcy Again",
    "link": "https://fashionista.com/2025/03/fall-2025-runway-size-inclusivity-report",
    "description": "These are the stories making headlines in fashion on Monday. Despite designers turning to \"curvaceous silhouettes\" for inspiration for their Fall 2025 collections, \"you had to look hard to find curvy models\" on the runways, writes Maliha Shoaib for Vogue Business, which released its ...Continue reading",
    "author": "Steph Saltzman",
    "published": "Mon, 17 Mar 2025 16:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjEzNTQ5NTc3Njg3NTQxNTk3/fall-2025-runway-diversity.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Network",
      "News",
      "runway diversity",
      "Inclusive Sizing",
      "Inclusivity",
      "Forever 21",
      "retail"
    ]
  },
  {
    "id": "cfe0962b-68bb-4b27-b151-98c36d1dbdfd",
    "title": "Rael: A Skin- and Period-Care Brand Rooted in South Korean Traditions",
    "link": "https://fashionista.com/2025/03/rael-skin-care-wellness-brand",
    "description": "Brand Bio is Fashionista's guide to the best independent fashion and beauty brands — a resource for retailers, job seekers, B2B companies and consumers alike. If you'd like your brand to be featured, fill out this form. RaelHeadquarters: Los Angeles, CAE-commerce: getrael.comSocial Media: Instagram ...Continue reading",
    "author": "Fashionista",
    "published": "Mon, 17 Mar 2025 15:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjEzNDgzODI4NDQ5MTI2MjM3/rael-skin-care.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Indie Beauty",
      "k-beauty",
      "Brand Bio Wellness",
      "Rael",
      "Brand Bio Beauty",
      "Brand Bio",
      "Wellness",
      "Network",
      "Brand Bio Skin Care",
      "Beauty",
      "Shopping"
    ]
  },
  {
    "id": "215e73f0-d009-4a36-b279-b6cba9dd910c",
    "title": "Should I Wear High-Rise or Low-Rise Jeans?",
    "link": "https://www.nytimes.com/2025/03/17/fashion/jeans-high-low-rise.html",
    "description": "In the current moment, it can seem as if anything goes. Our critic explains how to solve the riddle of which cut of jeans is right for you.",
    "author": "Vanessa Friedman",
    "published": "Mon, 17 Mar 2025 09:02:40 +0000",
    "image": "https://static01.nyt.com/images/2025/03/17/multimedia/17ASK-VANESSA-ctkg/17ASK-VANESSA-ctkg-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Fashion and Apparel",
      "Content Type: Service"
    ]
  },
  {
    "id": "77de89fb-72cf-4168-b837-3d8f093254f8",
    "title": "Millennials and Gen Z Are Fighting Again. This Time About Gym Clothes.",
    "link": "https://www.nytimes.com/2025/03/17/style/gym-wear-fitness-fashion-trends.html",
    "description": "Are you team tight-on-tight or tight-on-baggy?",
    "author": "Madison Malone Kircher",
    "published": "Mon, 17 Mar 2025 18:47:17 +0000",
    "image": "",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Generation Z",
      "Millennial Generation",
      "Fashion and Apparel",
      "Social Media",
      "TikTok (ByteDance)"
    ]
  },
  {
    "id": "be84af2c-d645-4dd5-aa94-fb51aea7e29e",
    "title": "8 Best Flannel Lined Jeans To Keep You Warm In 2025",
    "link": "https://www.fashionbeans.com/article/best-flannel-lined-jeans/",
    "description": "There’s nothing like the toasty durability of the best flannel-lined jeans when you’re out in the cold. Hard work is a man’s right, but there’s no need to suffer through below freezing temps in a standard pair of jeans, no matter their thickness. Leave the bulky layers at home and nestle into the built-in warmth … Continue reading 8 Best Flannel Lined Jeans To Keep You Warm In 2025 →",
    "author": "FashionBeans Team",
    "published": "Sun, 16 Mar 2025 17:09:59 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Men's Fashion"
    ]
  },
  {
    "id": "13f0bd89-bb04-4122-b07d-cf3fc9086902",
    "title": "Dress Code: UVU",
    "link": "https://www.fashionbeans.com/article/uvu/",
    "description": "",
    "author": "FashionBeans Editors",
    "published": "Sun, 16 Mar 2025 14:22:36 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Dress Code"
    ]
  },
  {
    "id": "8141c7e5-5462-49d4-aed2-4bf13e9d88a4",
    "title": "Refinery29 Loves: Everything To See \u0026 Shop In March",
    "link": "https://www.refinery29.com/en-us/fashion-beauty-news-march?utm_source=feed\u0026utm_medium=rss",
    "description": "Welcome to Refinery29 Loves, the monthly news bulletin where you’ll find our editor-approved lineup of the best to shop and see in fashion and beauty right now. Both awards season and Fashion Month have ended, which means leaving red carpet glam, eye-catching street style, and show-stopping runway looks in the rearview mirror. But, as the old cliché goes, when one door closes, another must open — and that’s certainly true in the world of fashion and beauty. As spring weather approaches, nudging us out of our winter cocoons, a new crop of trends, buzzy campaigns, and launches are also emerging in the sunlight. Sabrina Carpenter is helping debut new Prada Beauty products, Refinery29-favorite brand Aligne is making its foray into bridal, and Glow Recipe is furthering its stronghold on the skincare-meets-makeup category with its latest cheek tints — and that’s just the start. Keep scrolling to discover more of the new fashion and beauty launches we’re excited about this month.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.Aligne Introduces Bridal Capsule Collection The British brand known for its collarless blazers is set to walk down the aisle with the launch of its debut bridal capsule collection. Designed to be versatile, bold, and tradition-skewing, the line is made up of four pieces that can be worn during or beyond wedding celebrations: a satin mini dress with bows on the shoulders, a peplum top with ribbon detailing, a satin mini dress with puff sleeves, and, of course, a tailored satin blazer that ties at the front. Prices start at $165. Shop now at Aligne Aligne Ivy Puff Sleeve Satin Mini Dress, $, available at AligneNew Fenty x Puma Collection Rihanna’s latest Fenty x Puma collection is here — and it’s impossible to miss. The eye-catching, neon-hued line features two shoe styles: a new take on the classic Avanti LS sneakers and the Cat Cleat Jelly sandals, available in highlighter yellow and orange shades. Also on offer is the lime green mini Fenty x Puma Pocket Bag that can double as a crossbody, making it perfect for running errands or low-effort, essentials-only beach days. Prices range from $75 to $120.   Shop now at Puma Fenty x Puma Cat Cleat Jelly, $, available at PUMAStarface Launches Skincare Starface changed the game when it launched its fun, irreverent, and effective star-shaped pimple patches. Now, it’s looking beyond spot treatments and expanding into skincare. The line boasts two salicylic acid-forward, acne-fighting products: a gentle foaming cleanser formulated for sensitive and breakout-prone skin and a lightweight, soothing, oil-free moisturizer that also contains shine-minimizing niacinamide and hydrating hyaluronic acid. Both are available now for $15.99 each.Shop now at Starface Starface Sal Acid Skincare Duo, $, available at StarfaceNordstrom Launches New Shoes With Reformation Reformation just dropped its spring shoe collection, and some of the It Girl-coveted styles are available exclusively at Nordstrom. Part of Nordstrom’s monthly “Make Room for Shoes” campaign — which pairs the retailer with popular shoe names like Birkenstock, Larroudé, and Sperry — the collection includes an array of ballet flats (including a covetable sheer pair with delicate floral embroidery), flat sandals, and versatile heels. Shop now at NordstromReformation Bethany Ballet Flat, $, available at NordstromRebecca Vallance Launches Denim CollectionRebecca Vallance is taking her ultra-glam occasionwear aesthetic and eye for sharp tailoring to a brand-new category. The Australian designer’s eponymous brand has just dropped its first-ever collection of denim, and it includes 15 pieces for a range of occasions — think high-waisted straight-leg jeans, cinched dresses, oversized jackets with cocoon sleeves, and a denim blazer. “Denim has always been a staple in everyday wardrobes, and I wanted to create pieces that can be seamlessly integrated into our customers’ existing collections while still offering the signature sophistication and elevated style that they expect from the brand,” Vallance said in a press release. Prices range from $285 to $570. Shop now at Rebecca Vallance Rebecca Vallance Dylan Mini Dress, $, available at Rebecca VallanceRebecca Vallance Gisele Flare Jean, $, available at Rebecca VallanceGlow Recipe Watermelon Glow Niacinamide Dewy FlushThe skincare-meets-makeup trend continues to grow strong thanks to Glow Recipe’s latest twist on its bestselling Dew Drops. Enter: Watermelon Glow Niacinamide Dewy Flush. The tinted cheek serum combines the rosiness of a soft blush with skin-boosting ingredients, like brightening and smoothing niacinamide and calming centella asiatica to hydrate skin, refine the appearance of pores, and impart a natural flush. Available in two shades — peachy Watermelon Flush and warmer Berry Flush — the formula is also buildable, so you can opt for a dewy and sheer look or a more pigmented finish. Shop now at Glow RecipeGlow Recipe Watermelon Glow Niacinamide Dewy Flush, $, available at SephoraJ.Crew’s Spring Catalog After relaunching it last year, J.Crew is back with the latest edition of its beloved catalog. This time around, the focus is on all things spring style and the American brand’s latest additions to its signature preppy, timeless offerings. Other than new pieces, inside you’ll find model Liya Kebede — 16 years after Kebede first appeared in a J.Crew catalog — and her daughter Raee, intimate snapshots of New York families, and so much more. J.Crew Barn Jacket, $, available at J.CrewJ.Crew Étienne Oversized Shirt, $, available at J.CrewJ.Crew Gwen Knee-Length Slip Skirt, $, available at J.CrewJ.Crew Driving Loafers, $, available at J.CrewJ.Crew Étienne Cropped Button-Up Shirt, $, available at J.CrewGU x Undercover Fresh off of debuting its latest collection at Paris Fashion Week, Undercover designer Jun Takahashi has once again collaborated with the Uniqlo sister brand GU. “Silent/noise” — Undercover’s slogan that nods to embracing the discomfort — was the starting point for every piece, which the team has interpreted with playful, convertible designs that can be worn and styled in several different ways. The line’s first drop features playful takes on GU’s wardrobe staples — think relaxed trousers and blazers and T-shirts with signature Undercover motifs illustrated by Takahashi, like the “Noise Burger” character. GU x Undercover collection is available now, with prices ranging from $5.99 to $69.99; a second drop is expected next month. Shop now at GUGU x Undercover Broadcloth Shirt, $, available at GUGU x Undercover Deck Shoes, $, available at GUK18 AstroLift Reparative Volume Spray Fed up with using multiple products in your hair care routine? Try K18’s AstroLift Reparative Volume Spray, which promises to amp up volume, hold curls and waves in place (without making your hair crunchy), and repair and reverse damage on your strands. Simply spray through wet, dry, or towel-dried lengths for bouncier, thicker, fuller-looking hair that lasts. Shop now at K18 K18 AstroLift Reparative Volume Spray, $, available at K18Cuyana’s New Paloma Tote Cuyana’s dove-shaped Paloma bag has long been a fan favorite: it has sold out twice and has even been spotted on the shoulder of Meghan Markle. Now the minimalist brand is expanding the collection with the Paloma Tote. The new bag is inspired by the silhouette of the OG, and is made with the same Italian double-faced leather that softens as it ages — but now comes with more room, plus extra exterior and interior zip pockets. Shop now at Cuyana Cuyana Paloma Tote, $, available at CuyanaZara x Style Not Com When Beka Gvishiani, founder of the mega-popular fashion Instagram account Style Not Com, was approached by Zara, he started the conversation by saying: “Let’s talk about fashion.” That phrase is now at the heart of the resulting Zara x Style Not Com collection, which takes the account’s signature cobalt blue hue and bold white text and splashes them across a variety of apparel. Get meta with pieces like a baseball cap with the text “No, I’m not selling my hat,” a reference to Gvishiani’s signature hat; a hoodie emblazoned with “This is a hoodie without an idea;” or a T-shirt that says, “Life is a fashion week with some normal days in between.” Prices range from $10.90 to $69.90. Shop now at Zara Zara x Style Not Com T-Shirt, $, available at ZaraPrada Beauty Pradascope Lash Extending Volume Mascara How do you launch a new product in a way that will make a splash? Well, if you’re Prada Beauty, you tap Sabrina Carpenter for the campaign. That’s how the Pradascope Lash Extending Volume Mascara was introduced to the world. Inspired by the brand’s durable Re-Nylon material, the buildable, clump-free product instantly and noticeably lifts and lengthens lashes for up to 24 hours. The mascara is also formulated with a hyaluronic acid complex to nourish lashes, while the 180° brush features nylon fiber bristles for easy application and definition. Shop this month at Prada Prada Pradascope Lash Lengthening Eye Mascara, $, available at PradaNew Hoops at Jenny Bird A new season approaching is the perfect time to refresh your jewelry collection, if you ask us. It seems like the team at the popular jewelry brand Jenny Bird agrees — they spent the last month dropping new hoop earring styles. Highlights include the Mega Faye Knocker hybrids, the high-shine Mini Tomes, miniature versions of the brand’s bestselling Florence stacked hoops, and the chunky — yet still lightweight! — Gemma Hoops, all of which are available in gold and silver finishes.Shop now at Jenny Bird Jenny Bird Gemma Hoop Earrings, $, available at Jenny BirdMother x La DoubleJ  California cool and Italian flair are coming together in the just-dropped Mother x La DoubleJ capsule collection. The 30-piece line brings La DoubeJ’s maximalist, ’70s-style prints to Mother’s effortless denim pieces, such as the Half-Pipe Ankle barrel jeans that are covered in illustrated dragonflies, a denim jacket with an embroidered tapestry of a goddess on the back, and a pair of flares with wave details at the hems. The collection isn’t all about denim either; also discover graphic tees, boho blouses, and flowy kaftans. Prices range from $130 to $1,290. Shop now at Mother and La DoubleJ La DoubleJ x Mother The Tomcat Roller, $, available at MotherLa DoubleJ x Mother The Sinful, $, available at MotherLike what you see? How about some more R29 goodness, right here?Refinery29 Loves: Everything To See \u0026 Shop In FebWinter Fashion Must-Haves R29 Editors Are WearingR29 Editors Try Rhode's New Lip Pencils",
    "author": "Patricia Karounos",
    "published": "Mon, 17 Mar 2025 19:33:42 +0000",
    "image": "https://www.refinery29.com/images/11862559.jpg?auto=webp\u0026width=960\u0026height=1440\u0026quality=85\u0026crop=2:3",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "3cae1998-c488-4c4d-b0a1-ae0ad21c5d24",
    "title": "The 6 Best Spring Jacket \u0026 Coat Trends To Refresh Your Closet",
    "link": "https://www.refinery29.com/en-us/jacket-coat-trends-spring-2025?utm_source=feed\u0026utm_medium=rss",
    "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. As we pack away puffer jackets and faux-fur coats, it’s time to refresh our closets with spring-ready alternatives. It’s not consistently warm yet, so transitional styles are key for chilly or rainy spring days. Unsurprisingly, some of the biggest spring 2025 outerwear trends are fresh spins on fall 2024 favorites. Think barn jackets (in lighter fabrics), capes (on trench coats), vests (tied up with bows), and denim jackets (with bold barrel sleeves).Other styles worth keeping on your radar? Quilted jackets for a touch of classic, cottage-core charm and, on the opposite end of the spectrum, retro track jackets with so-sporty vibes. No matter your personal style, there’s an outerwear trend below to complement (and elevate) it.Read on for spring outfit inspiration and to start carting up your favorite pieces before the post-spring-cleaning shopping frenzy hits. DashDividers_1_500x100 Barrel-Sleeve Denim Jackets Ever since barrel-leg jeans shot to popularity in 2024 — cementing themselves as must-have denim — their unique curved shape has migrated upward. Enter: the barrel-sleeve denim jacket. The balloon-like sleeves, often paired with dropped shoulders, bring a fresh dimension to a forever staple. From oversized trucker styles to fitted, lady-like silhouettes, there’s a wash and shape for every denim lover. DashDividers_1_500x100 Quilted Jackets Shoppers have been searching for “spring quilted jackets” lately, and we see why: they’re the ultimate in-between-season layer. Typically boxy with roomy patch pockets, these lightly padded jackets offer plenty of layering potential. But thanks to their cropped, collarless silhouettes, they’re just as warm-weather-friendly too. Keep it sleek in solids and satins, or go playful with floral prints and trending hues like butter yellow. DashDividers_1_500x100 Cape Trench Coats From scarf coats to cape jackets, outerwear has been in its evolving era, and the cape trench coat is the latest twist on a classic. The biggest iterations right now? Capes on cropped trenches and sleeveless poncho styles. Look out for water-resistant fabrics (think nylon) and details like detachable scarves or hoods — because April showers are imminent. DashDividers_1_500x100 Sporty Track Jackets Yes, we called it — sporty style is a major fashion trend in 2025, and now’s the time to hop on board. One of the easiest ways to work the aesthetic into your wardrobe (besides through your spring sneakers) is with outerwear. While varsity jackets, windbreakers, and anoraks all fit the bill, a retro track jacket is the move. Picture high-collar zip-ups, bold color-blocking, and contrast piping for maximum throwback appeal. DashDividers_1_500x100 Tie-Front Jackets \u0026 Vests Bows just won’t quit, but who’s complaining? This season, the romantic detail is showing up in the form of functional bow tie closures on jackets and vests — both of which are super transitional. You’ll also spot them combined with other key trends, like quilting and denim, making it easier than ever to check multiple style boxes at once. DashDividers_1_500x100 Barn Jackets If you haven’t yet hopped on the barn jacket train, consider this your boarding call. This workwear-inspired staple made a high-fashion resurgence in fall 2024, and now it’s reemerging in lightweight fabrics like cotton and canvas for spring. With wind-shielding collars, oversized pockets, and an air of rugged utility, these jackets bring a touch of the fisherman aesthetic to your seasonal lineup. Like what you see? How about some more R29 goodness, right here?These 6 Spring Sneaker Trends Will Be EverywhereR29 Editors Reveal Their Spring Fashion Must-HavesThese Are The Biggest Denim Trends For 2025",
    "author": "Victoria Montalti",
    "published": "Fri, 14 Mar 2025 14:59:28 +0000",
    "image": "https://www.refinery29.com/images/11867219.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "2c93bc14-4cba-456e-82e8-e1d4c1b31fd1",
    "title": "I Tested Meghan Markle's Go-To Tote and It's Now My Wardrobe Staple",
    "link": "https://www.popsugar.com/fashion/cuyana-easy-tote-editor-review-48904560",
    "description": "Tiny handbags, be damned - this season is all about bold totes that are big enough to carry your entire life in. And as someone whose closet is chock-full of clutches, crossbody bags, and a number of other compact purse styles, I have very mixed feelings about the trend. But if there was ever a handbag that might sway my loyalties, I knew it would be the Cuyana Easy Tote ($268) - a standout piece from the luxury, ethical brand behind some of today's most polished fashion essentials. In all truth: I've had my eye on Cuyana's chic tote offerings for a while now (thank Meghan Markle for that!). So naturally, when I heard that Cuyana was planning to do a major makeover on its handbag and tote stock, my interest was immediately piqued. After all, this was the same brand beloved and religiously worn by celebrities like Jessica Alba and Angelina Jolie. Any collection revamp would have to rival some of the designer's cult-favorite styles like the (now defunct) Classic Structured Leather Tote, all while still staying true to Cuyana's reputation for timeless elegance. Fortunately, I was lucky enough to take Cuyana's popular bag style, the Easy Tote, for a test-drive before the product's debut. I'll admit: even as a fan of the brand, I was wary about whether the style could live up to the hype of the luxe designer's other, more staple bags. But so far, Cuyana's new Easy Tote has managed to do the impossible - make a tote believer out of even the most adamant mini-bag loyalist: me. The bag has been my greatest accessory companion over the past few weeks - and I have an inkling it will continue to be my go-to long after, too. Read on for my honest review of Cuyana's Easy Tote style. About the Cuyana Easy Tote The Cuyana Easy Tote is available to shop in two styles: a classic, horizontal Easy Tote and a Cuyana Tall Easy Tote ($268). The Easy Tote comes in eight different colors, including cappuccino (my bag of choice), caramel, black, and stone. The style is also available in a handful of fresh, seasonal colorways that include daffodil yellow, indigo, and ecru. This particular style is Leather Working Group (LWG)-certified, which affirms that the bag's leather is tanned in an environmentally responsible way. What I Like About the Cuyana Easy Tote Even upon first wear, you can tell the tote is built to last - a theme that's consistent with most all of Cuyana's product inventory. The bag is crafted from a lightweight, pebbled Italian leather that's designed to soften with each wear - making it a chic and comfortable style that's perfect for the long haul. The tote is also astonishingly lightweight - so much so that Cuyana has even marketed it as being the brand's \"lightest bag ever.\" As someone who has had some time to take the product for a spin, I can confirm: it really does live up to the airy hype. I'm notorious for carrying a lot of stuff with me wherever I go - whether it's to the gym, airport, office, and beyond, I always have plenty of my own daily essentials in tow. As a result, I've historically had to rely on bulky, heavy, and downright inconvenient totes to keep all of my handbag must haves organized. But thanks to Cuyana's Easy Tote, I get the space of a deep and chunky tote, all without any of the hassle or added weight. I suspect this is in part due to the tote's minimal design, which avoids cliché bag buffers like synthetic lining or bulky hardware. More than anything, I just love the timeless elegance of Cuyana's Easy Tote. The relaxed style boasts more of a squishy, breathable feel that's simple, stylish, and, best of all, subtle. Statement handbags and purses might be popular nowadays, but like most trends, it's difficult to predict whether they'll remain relevant in the next season. With the muted design of the Cuyana Easy Tote, I have no doubt that the bag will be a sophisticated and polished staple in my closet for years to come. What's Worth Noting The tote features a double-handbag design, which aims to create a more streamlined look, allowing users to easily switch between carrying the bag by hand or by shoulder. Initially, I was concerned that the shorter straps might look cluttered or even feel suffocating on my arm when I opted to hold the bag on my shoulder. Fortunately, the straps are flexible and can easily be pushed down into the tote when needed, all without causing damage or creases. While I wasn't immediately sold on the strap design, I've come to see the appeal - especially since it's like getting two bags in one. Another thing to note are the minimal storage compartments. The tote features a single, large hanging wall pocket on the interior, which is the perfect size for holding your phone, cardholder, or go-to lipstick or any other valuables you might need on hand. Personally, I don't mind that the bag has only one storage pocket - when it comes to totes, the simpler the design, the better. That being said, if you are someone who relies on having more structure or organized spaces in your bag, it's certainly something to be aware of and maybe it's worth purchasing a handbag organizer to go with it. Who Is the Cuyana Easy Tote Best For? Some people mark the beginning of a new chapter in their life with a fresh hairstyle or other grown-up investment. Others celebrate it by splurging on a new Cuyana handbag. I, like so many other fans of the luxury brand, prefer the latter - which is why I'd say this Cuyana tote is perfect for anyone looking for a timeless bag they can take anywhere and carry through any season. The deep style boasts plenty of interior space that's capable of holding everything from a school binder and work laptop to a reusable water bottle, wallet or cardholder, travel beauty bag, staple pair of sunnies, and so much more (even all at once!). Whether you're a grad student looking for a chic bag for school, a corporate worker in need of a practical tote to carry to and from the office, or just someone hoping to add a more relaxed style to your wardrobe, the Easy Tote encompasses the ideal, go-anywhere bag that will help you feel polished and supported in any season. Where Is This Cuyana Tote Available? The Cuyana Easy Tote is available to shop exclusively at the brand's website. Rating: Kyley Warren (she/her) is an award-winning writer and editor with more than four years of experience in the publishing space. She previously worked as an assistant editor on PS Shopping and is an expert on all things related to shopping and fashion. Before joining PS, Kyley worked with Entertainment Tonight as a style commerce writer, and her byline has appeared in publications globally.",
    "author": "Kyley Warren",
    "published": "Mon, 17 Mar 2025 15:00:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/nW0ftd58tm2FhLdcjVB_mt0Cdww/0x183:3024x3207/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2022/07/31/078/n/1922564/dec35c2362e72413337379.70078529_.jpg",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Product Reviews",
      "Fashion Shopping",
      "Shopping",
      "Cuyana",
      "Bags",
      "Direct to Consumer"
    ]
  },
  {
    "id": "81800795-abd7-4f9c-8241-13874e4222e5",
    "title": "An Honest Review of Free People's Bestselling Amber One-Piece Swimsuit",
    "link": "https://www.popsugar.com/fashion/free-people-amber-one-piece-swimsuit-review-49129241",
    "description": "Image Source: PS Photography / Kyley Warren The moment temperatures land above 70 degrees, you'll find me in a swimsuit. Growing up in Arizona, I can recall spending countless summers sprawled out on a pool float and conjuring up any excuse to be in the water as often as possible - trust me, it's basically the only way to survive back-to-back months of 115-degree temperatures. While I might not get to spend as much time poolside as I'd prefer these days (because, adulting), I still try to stock up on as many different types of bikinis and one-pieces as possible, that way I'm prepared for whatever the summer months may bring - including a weekend beach trip or two. Naturally, you can imagine my excitement after discovering that Free People's Free-est swimsuit line with pieces that prioritize style, functionality, and sustainability. Free People was kind enough to send me a sample from the collection in order to get a feel for the collection's unique materials, patterns, and fits. I chose to test out the Free-est Amber One-Piece Swimsuit ($168) in a limited-edition print. While my exact pattern is no longer available, they do offer various prints each season like the Free-est Amber Printed One-Piece Swimsuit ($178). The second I slipped the piece on, I knew I'd just found my go-to swimsuit for the season. What I Like About the Free-est Amber One-Piece Swimsuit As someone with a larger bust, it's been a struggle trying to find a sexy bathing suit that flatters my body and curves but still manages to keep everything tucked in and feeling secure - this is especially the case with one-piece bathing suits. The styles are either too plunging or too conservative, with seemingly no middle ground, thus forcing me to invest in different one-pieces for different occasions - like a high-neck swimsuit for sporty beach dates and a strapless one-piece for tanning. This FB Beach swimsuit is the first style I've ever owned that I feel comfortable and supported enough to wear for it all. The one-piece bathing suit is made from a recycled polyamide and elastane material that has just enough stretch to move around in but is still formfitting enough that it hugs the body and keeps me feeling secure. While the style has a plunging neckline and open-back design, it also comes fitted with adjustable shoulder straps and a tie back, so I can tweak the piece's fit as needed. The one-piece's high-leg silhouette completes the style with a leg-baring design that's so perfect for tanning or any occasion where you want to show a little extra skin. I also love that this Free People piece is made from eco-conscious, recycled fibers, so it's a style I can feel good about wearing. What's Worth Noting About the Free-est Amber One-Piece Swimsuit While this bathing suit's upper coverage is great, it is a bit skimpier toward the bottom and has a tendency to fit more like a thong bathing suit - somewhat unintentionally, too. I am typically a medium in bathing suits and opted for a similar size with this one-piece style. Unlike other Free People swimsuits, namely the Free-est Pamela One-Piece Swimsuit ($148), which has a thong-like design, this piece appeared to have a more traditional fit with enough material to provide plenty of backside coverage. But despite the product photos on the model, this bathing suit actually does ride up quite a bit in the crotch area. While not uncomfortable, it certainly shows a bit more skin on the hips than I was expecting, and if you're looking for a piece with ample coverage all around, I might recommend another FP Beach style like this Free-est Heidi Surf One-Piece Swimsuit ($198). Who Is the Free-est Amber One-Piece Swimsuit Best For? Whether you're an avid tanner in need of a skin-baring bathing suit, a sports enthusiast obsessed with competing outside (but less keen on wearing tons of layers in the heat), or just a water-lover who's committed to spending as much time by the ocean and lake as possible, this sporty one-piece is great for anyone looking to invest in a comfortable swimsuit that's secure, sustainable, and, of course, incredibly stylish. Where Is the Free-est Amber One-Piece Swimsuit Available? This one-piece swimsuit is available to shop exclusively at Free People. Additional Details While my version features a burgundy floral print, the Amber One-Piece comes in several fun colorways, including stone, lime green, black, and orchid pink. This swimsuit is available to shop in US women's sizes XS through XL, and it's recommended that shoppers reference Free People's size guide to find their perfect fit. This one-piece, along with all of the other styles in the collection, are made with eco-conscious fibers that include recyclable and degradable materials. These thoughtful designs are a small part of Free People's larger mission to promote more circularity in fashion and reduce the brand's carbon footprint. Rating: Kyley Warren (she/her) is an award-winning writer and editor with more than four years of experience in the publishing space. She previously worked as an assistant editor on PS Shopping and is an expert on all things related to shopping and fashion. Before joining PS, Kyley worked with Entertainment Tonight as a style commerce writer, and her byline has appeared in publications globally.",
    "author": "Kyley Warren",
    "published": "Sat, 15 Mar 2025 06:35:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/m0TLfAhz3L40DH2XCfpyd04WGRw/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/03/15/599/n/1922564/41442a4b67d57f5448f539.17280788_.jpg",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Product Reviews",
      "Fashion Shopping",
      "Free People",
      "Shopping",
      "One-Piece Swimsuits"
    ]
  }
]
