[
  {
    "id": "9c164435-3eea-479a-917f-d5c27fc9c26f",
    "title": "Put Down the Black Flip-Flops—These Are the Simple Flat Sandals Celebs Are Wearing With Summer's #1 Skirt Trend",
    "link": "https://www.whowhatwear.com/fashion/celebrity-style/tan-flat-sandals-lace-trim-skirt-outfit-jennifer-lawrence",
    "description": "I'm inspired!",
    "author": "Natalie Munro",
    "published": "Tue, 08 Jul 2025 22:54:14 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/yZoKxM55yUodNHVUZCv2K3.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Celebrity Style",
      "Fashion",
      "Celebrity"
    ]
  },
  {
    "id": "51695042-2353-4212-aa4f-1a67fbfe82c1",
    "title": "Sabrina! Charli! Rihanna! These Celeb-Inspired Nail Colors Are Too Good to Pass Up for Prime Day",
    "link": "https://www.whowhatwear.com/beauty/nails/celeb-inspired-nail-polish-amazon-prime-day-deals",
    "description": "Celebrity shades, sale rack prices.",
    "author": "Alyssa Brascia",
    "published": "Tue, 08 Jul 2025 22:37:12 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/D9q5cYZvVSrL8ABKAHACdW.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Nails",
      "Beauty"
    ]
  },
  {
    "id": "75ef880c-98f3-412a-a7c1-ff5338093a67",
    "title": "The Chicest Swimsuit Deals to Shop for Amazon Prime Day",
    "link": "https://www.elle.com/fashion/shopping/g65171228/amazon-swimsuits-on-sale-prime-day-2025/",
    "description": "Including editor-favorite styles from cult brands like Vitamin A and Ulla Johnson.",
    "author": "",
    "published": "Tue, 08 Jul 2025 22:42:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "ef6be6f6-b1ef-4690-aaa4-18e18a85b8b3",
    "title": "The Best Apple Deals to Shop for Amazon Prime Day",
    "link": "https://www.elle.com/fashion/shopping/g65104566/best-amazon-prime-day-apple-deals-2025/",
    "description": "From iPads to AirPods, these discounts are too good to miss.",
    "author": "",
    "published": "Tue, 08 Jul 2025 22:23:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "a8a67e00-81bb-4a6e-a614-4d283f933e70",
    "title": "Chanel and JW Anderson show their resistance to global luxury downturn",
    "link": "https://www.theguardian.com/fashion/2025/jul/08/chanel-jw-anderson-paris-fashion-week-resistance-global-luxury-downturn",
    "description": "Chanel’s Paris show harked back to brand’s first boutique, while JW Anderson pivots to lifestyle and homewaresThere was no designer to take a bow after Chanel in Paris, but the creative director, Matthieu Blazy – whose first show will take place in October – had already been at the sketchbook. “It is not his collection – but it is not happening without him either,” said Bruno Pavlovsky, the president of fashion at Chanel, before the show. “You will see his touch.”Inside the Grand Palais sat fashion’s favourite popstars, Lorde and Gracie Abrams, alongside the outgoing American Vogue editor Anna Wintour. But instead of Karl Lagerfeld’s elaborate Warholian sets, the show space had been transformed into a salon based on Chanel’s first boutique, with butterscotch carpets and floor-to-ceiling mirrors. Continue reading...",
    "author": "Morwenna Ferrier",
    "published": "Tue, 08 Jul 2025 14:16:36 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Chanel",
      "Paris fashion week",
      "Fashion industry",
      "Fashion",
      "Retail industry",
      "Paris",
      "Fashion weeks",
      "France",
      "Life and style"
    ]
  },
  {
    "id": "2805328d-0a71-4ad6-a323-239a5be6887a",
    "title": "The fisherman aesthetic: anglercore is everywhere – but does it suit me?",
    "link": "https://www.theguardian.com/fashion/2025/jul/08/the-fisherman-aesthetic-anglercore-is-everywhere-but-does-it-suit-me",
    "description": "Waders you could wear to a gallery opening, vests cropped weirdly short and laden with pockets. I tried the biggest trend in fashion to find out why so many non-fishers are wearing itIt was, in the end, a fashion trend awaiting better weather. Now that summer is here, the “fisherman aesthetic”, long heralded as one of the key looks for 2025, has finally arrived. Or has it? Standing on the beach at Hastings, with a stiff wind blowing into my face, I am adding one layer of fishing gear on top of another while holding my fisherman’s hat on my head, gently overheating under a hazy sky.I’m not sure this is what Vogue had in mind when it predicted that “the menswear customer will take to water, embracing the ‘fisherman aesthetic’” earlier this year. I can’t see anyone else on the beach embracing it. Then again, I can’t see anyone else on the beach. Continue reading...",
    "author": "Tim Dowling",
    "published": "Tue, 08 Jul 2025 04:00:27 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Men's fashion",
      "Fashion",
      "Life and style",
      "Fishing"
    ]
  },
  {
    "id": "c0d77525-546e-40ba-8583-665c384fa249",
    "title": "Celebrity Stylist Molly Dickson Is Seeking Fall 2025 Styling Interns In Los Angeles",
    "link": "https://fashionista.com/2025/07/celebrity-stylist-molly-dickson-is-seeking-fall-2025-styling-interns-in-los-angeles",
    "description": "Celebrity-stylist Molly Dickson is seeking interns for Fall 2025. Estimated start date September 1, 2025.Candidates must be responsible, proactive, motivated, detail-oriented and eager to learn about the styling world. This is a fast-paced and dynamic position, applicants must be able to stay ...Continue reading",
    "author": "Winnie Liu",
    "published": "Tue, 08 Jul 2025 20:11:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE1NjY0ODAyNjQxNDg3Mzc5/pexels-tkirkgoz-18699670.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "How To Make It",
      "Job Listings",
      "Molly Dickson",
      "Network",
      "internships",
      "Sponsored Content",
      "LA Job Listings",
      "Careers"
    ]
  },
  {
    "id": "db075ab1-56b4-4f75-aa9c-20e83dfe3c47",
    "title": "Circolo Showroom Is Seeking A Showroom Intern In New York, NY",
    "link": "https://fashionista.com/2025/07/circolo-showroom-is-seeking-a-showroom-intern-in-new-york-ny",
    "description": "INTERNSHIP OPPORTUNITY Circolo Showroom Company information: The Circolo Showroom is a multi-label European showroom in Tribeca that focuses on women’s contemporary apparel and accessories collections. Our client base consists of major department stores and top boutiques around the country. The ...Continue reading",
    "author": "Winnie Liu",
    "published": "Tue, 08 Jul 2025 18:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MTk5NjU2NjYwOTMzODEzODg4/circolo-olarte-foussard.png",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Careers",
      "Olarte Foussard Showroom",
      "NYC",
      "NYC Job Listings",
      "Job Listings",
      "How To Make It",
      "Circolo Showroom",
      "Network",
      "internships"
    ]
  },
  {
    "id": "45738fc4-a6dd-45b2-b7ee-e55151331991",
    "title": "Jimmy Choo Scents That Turn Heads All Day, Every Day",
    "link": "https://www.fashionbeans.com/article/jimmy-choo-scents/",
    "description": "Typically, men’s cologne sports the fragrance of the earthy outdoors, the deep blue sea, or has that overwhelming (and sometimes off-putting) masculine scent. Rarely you’ll find a warm, fruity aroma that’s light and inviting, while still evoking your natural ruggedness. That’s where Jimmy Choo fragrances come in. They’re formulated to have a modern and fresh … Continue reading Jimmy Choo Scents That Turn Heads All Day, Every Day →",
    "author": "Joe Niehaus",
    "published": "Tue, 08 Jul 2025 18:19:35 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Men's Grooming"
    ]
  },
  {
    "id": "b8704c20-891e-41a5-b167-c9fd11b181dd",
    "title": "Jean Paul Gaultier Fragrances Guys Can’t Stop Spritzing",
    "link": "https://www.fashionbeans.com/article/jean-paul-gaultier-fragrances/",
    "description": "Finding the perfect cologne these days can be difficult when such a wide variety of scents are available to us. Jean Paul Gaultier, renowned for its exceptional range of colognes, offers some of the best colognes for men, from the invigorating to the deeply sensual. Each scent, a masterpiece, caters to diverse preferences, ensuring there’s … Continue reading Jean Paul Gaultier Fragrances Guys Can’t Stop Spritzing →",
    "author": "FashionBeans Editors",
    "published": "Tue, 08 Jul 2025 18:15:22 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Men's Grooming"
    ]
  },
  {
    "id": "7368a366-13ee-45f2-8b16-168a48b902d2",
    "title": "6 Handbag Trends That Will Have Your Summer Style In A Bag",
    "link": "https://www.refinery29.com/en-us/handbag-trends-summer-2025?utm_source=feed\u0026utm_medium=rss",
    "description": "There are two types of handbag shoppers out there. Some who never turn down the chance to tote around a “ludicrously capacious” carryall with main character energy. Others who would rather sling a minimalist, no-fuss mini style that oozes timelessness. Regardless of which camp you sit in, a new wave of summer handbag trends is hitting the scene, sure to capture the hearts of minimalists and maximalists alike.  If you’re someone who fancies a novelty style à la Carrie Bradshaw or still riding the high of a Cowboy Carter summer, fringe styles will be in heavy rotation this season. Coming in everything from leather and suede to beaded materials, the look is nothing short of fun. On the opposite end of the sartorial spectrum are retro doctor bags, which were inescapable on the spring/summer 2025 runways. However, designers didn’t fully reinvent the wheel, instead making small yet noticeable tweaks to freshen up the silhouette, such as leaning into of-the-moment hues (hello, butter yellow) and details like metal adornments. And we’d be remiss if we didn’t bring up the canvas bag renaissance. Once a go-to for lazy days at the beach or groceries, the cotton carryall is now, dare we say, luxe.  Below, dive into the summer 2025 handbag trends set to ascend this season, as well as our favorite silhouettes on the market. 2025 Summer Handbag Trend: Belt It Does your bag need a belt wrapped around it? Probably as much as Carrie needed one with her low-waist skirt. But does the accent instantly transform even the simplest of styles? Absolutely. And no, this isn’t exactly a novel concept — Hermès pioneered the look in 1984 with its coveted Birkin bag. Lately, however, more and more designers are jumping aboard the belted bag train. On the runways, mega-houses like Prada, Proenza Schouler, and Ferragamo put their stamp on the silhouette, solidifying it as one to keep on lock this summer.  2025 Summer Handbag Trend: Doctor  Luxury labels came down with the doctor bag fever. Popularized during the Victorian era, the silhouette — inspired by the briefcases physicians carried their medical supplies in on house calls — populated the catwalks at shows like Louis Vuitton, Miu Miu, and Hermès. Practical and polished, these silhouettes will see you through everything on deck this summer, from in-person work days to weekend jaunts. The 2025 way to sport a doctor bag, according to the runways? Nestled in the crook of your arm, rather than held by the handles.  2025 Summer Handbag Trend: Canvas  Designers seem hell-bent on turning the trusty canvas bag into a high-style item — and we’re onboard. Take, for instance, Gabriela Hearst’s version, which boasted a sleek black leather trim and shiny gold clasp. In a similar realm, Proenza Schouler debuted a bucket style, also detailed with a leather trim. Meanwhile, Tibi and L.L. Bean’s “reimagined” Boat and Tote bag sold out twice over the last year. You needn’t shell out hundreds of dollars on the look, though. Simply dig up your L.L. Bean canvas bag from the early 2010s (if you were lucky enough to hold onto it, that is) or get one emblazoned with the name of your favorite store or restaurant from your neighborhood spot.  2025 Summer Handbag Trend: Raffia Raffia bags for summer? That may not necessarily sound groundbreaking, given the material has been a vacation staple for decades. However, when it comes to the latest spring/summer 2025 styles, there’s a lot to gush over, with silhouettes ranging from vacation bags to evening clutches. Bottega Veneta designed a clutch with braided and croc-embossed leather details; Chloé stamped a circular silhouette with its moniker; meanwhile, The Row debuted a punchy emerald green tote in the warm-weather appropriate fabric.  2025 Summer Handbag Trend: Fringe When you think of a fringe bag, your mind may wander to the festival grounds at Coachella. Not so fast. Sure, the style is certainly primed for a concert in the desert, but designers’ new versions are more refined than ever before. Gucci presented an olive green leather bag with a cascade of fabric, while Fendi showed a dreamy blue carryall featuring fringe on the sides. There’s also something so satisfying about a fringe tote swaying back and forth as you waltz down the street, no? 2025 Summer Handbag Trend: East-West  Believe it or not, east-west bags have yet to wane in popularity. The nostalgic silhouette — an elongated horizontal shape — set the internet ablaze in early 2024 and has remained a red-hot look ever since. This summer, expect to see the fashion pack carrying fresh, unexpected iterations, such as textured, studded, and two-tone styles, all of which made their way down the runways at Bottega Veneta, Jil Sander, and Miu Miu. Like what you see? How about some more R29 goodness, right here?These Are The Biggest Fashion Trends Of The SummerThese Are The 7 Biggest Shoe Trends Of The SummerTasty Summer 2025 Color Trends: Pistachio \u0026 Cherry",
    "author": "Kelsey Stewart",
    "published": "Tue, 08 Jul 2025 18:13:46 +0000",
    "image": "https://www.refinery29.com/images/11914556.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "c1f3eb59-2967-4ea5-b23f-5af73b732cf2",
    "title": "Nordstrom’s Anniversary Sale Is Here Early: 25 Summer Dresses To Shop",
    "link": "https://www.refinery29.com/en-us/best-nordstrom-anniversary-sale-dresses?utm_source=feed\u0026utm_medium=rss",
    "description": "We’re fully embracing summer… and all the seasonal sales (from Fourth of July fashion deals to Lululemon’s Summer Scores event), so of course we’re ready to jump on Nordstrom’s Anniversary Sale. The reader-favorite retailer’s annual sale officially starts on July 12, but Nordy Club members get early access starting today — featuring covetable styles at major discounts (and they don’t stay in stock for long). Now’s your chance to preview Refinery29 editors’ favorite picks to help you build a wishlist and add said favorites to cart ASAP. To help you focus on truly killer summer fashion finds, we've curated the best summer dresses from Nordstrom’s sale section.  This year, Nordstrom's dress sale has you covered for every occasion — from casual days and vacations to work and beach weddings — with styles as low as $34. Expect denim dresses, wedding-ready looks, sweet milkmaid silhouettes, and summer-to-fall options that do the most (in a good way).Alongside Nordstrom’s own brands like Zella and Open Edit, you’ll find other favorites like Farm Rio, L’Agence, and Steve Madden in the mix. Dive in and refresh your summer wardrobe with these can’t-miss deals and bestsellers from the Nordstrom Anniversary Sale.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.For more can't-miss shopping stories delivered straight to your inbox, sign up for our Most Wanted newsletter.Farm Rio Luang Long Sleeve Maxi DressFarm Rio Luang Long Sleeve Maxi Dress, $, available at NordstromOpen Edit Bateau Neck Sleeveless MinidressOpen Edit Bateau Neck Sleeveless Minidress, $, available at NordstromAllSaints Brea Orchid Print Asymmetric DressAllSaints Brea Orchid Print Asymmetric Dress, $, available at NordstromZella Effortless Square Neck Midi DressZella Effortless Square Neck Midi Dress, $, available at NordstromChelsea28 Flutter Sleeve Faux Wrap Midi DressChelsea28 Flutter Sleeve Faux Wrap Midi Dress, $, available at NordstromNordstrom Shirred Cap Sleeve A-Line DressNordstrom Shirred Cap Sleeve A-Line Dress, $, available at NordstromHope \u0026 Henry Organic Button Front Midi DressHope \u0026 Henry Organic Button Front Midi Dress, $, available at NordstromEn Saison Houndstooth Pleated Skater DressEn Saison Houndstooth Pleated Skater Dress, $, available at NordstromAvec Les Filles Belted Bustier Denim DressAvec Les Filles Belted Bustier Denim Dress, $, available at NordstromJulia Jordan Flutter Sleeve Pleated Midi DressJulia Jordan Flutter Sleeve Pleated Midi Dress, $, available at NordstromHalogen Brandy Street Stripe Pleated Belted Midi DressHalogen Brandy Street Stripe Pleated Belted Midi Dress, $, available at NordstromMax Mara Virgin Flounce Hem Sleeveless DressMax Mara Virgin Flounce Hem Sleeveless Dress, $, available at NordstromL'Agence Akiya Floral Satin Maxi DressL'Agence Akiya Floral Satin Maxi Dress, $, available at NordstromFrame The Striped Sailor Organic Cotton Midi DressFrame The Striped Sailor Organic Cotton Midi Dress, $, available at NordstromSam Edelman Floral Print Sleeveless DressSam Edelman Floral Print Sleeveless Dress, $, available at NordstromCinq à Sept Lucilla ShirtdressCinq à Sept Lucilla Shirtdress, $, available at NordstromRails Westlake Maxi Overall DressRails Westlake Maxi Overall Dress, $, available at NordstromSocialite Long Sleeve Tiered Ruffle MinidressSocialite Long Sleeve Tiered Ruffle Minidress, $, available at NordstromVince Camuto Floral Print Sleeveless Maxi DressVince Camuto Floral Print Sleeveless Maxi Dress, $, available at NordstromSteve Madden Archie Bow Ruched DressSteve Madden Archie Bow Ruched Dress, $, available at NordstromTahari ASL Abstract Print Pleated Belted DressTahari ASL Abstract Print Pleated Belted Dress, $, available at NordstromNordstrom Tie Front Cotton NightgownNordstrom Tie Front Cotton Nightgown, $, available at NordstromZoe and Claire Sleeveless Denim A-Line Midi DressZoe and Claire Sleeveless Denim A-Line Midi Dress, $, available at NordstromLafayette 148 New York Stripe Lantern Sleeve ShirtdressLafayette 148 New York Stripe Lantern Sleeve Shirtdress, $, available at NordstromMaggy London Print Sleeveless Asymmetric Ruched Midi DressMaggy London Print Sleeveless Asymmetric Ruched Midi Dress, $, available at NordstromSocialite Stripe Sleeveless Midi DressWhether you’ll be swimming in clear blue waters this summer or not, get into the spirit with a watercolor striped dress that looks inspired by the Mediterranean Sea.Shop NordstromSocialite Stripe Sleeveless Midi Dress, $, available at NordstromChelsea28 Plus Size Print Ruffle Sleeve Midi DressAttend your summer soirées in a chic black cocktail dress that can go from day to night and from one event to another. Shop NordstromChelsea28 Plus Size Print Ruffle Sleeve Midi Dress, $, available at NordstromBeyond Yoga Ease Into It Midi Tank DressSlip into an effortless buttery-soft tank dress to run your daily errands or stroll through a weekend farmers market.Shop NordstromBeyond Yoga Ease Into It Midi Tank Dress, $, available at NordstromSam Edelman Protea Long Sleeve Satin Wrap DressThis wrap dress has a floral print that can feel very summery when styled with slingback heels or very autumnal when paired with knee-high boots.Shop NordstromSam Edelman Protea Long Sleeve Satin Wrap Dress, $, available at NordstromFrench Connection Ruth Whisper A-Line MinidressEvery closet needs a little black dress as chic and versatile as this one. We especially love the sweetheart neckline to show off statement necklaces. Shop NordstromFrench Connection Ruth Whisper A-Line Minidress, $, available at NordstromNocturne Cut-Out Midi DressTake on the summer’s naked dress trend in an elevated  nude frock that you can wear to formal parties or casual weddings.Shop NordstromNocturne Cut-Out Midi Dress, $, available at NordstromLost + Wander Celestial Glow Metallic Stripe DressWhether you have a dinner party or a daytime wedding approaching, the elegant lace and subtle metallic pinstripes on this dress are perfect for either.Shop NordstromLost + Wander Celestial Glow Metallic Stripe Dress, $, available at NordstromTopshop Stripe Long Sleeve Satin ShirtdressIn addition to having a white button-down shirt, we also think it’s worth owning a striped button-down dress for the office.Shop NordstromTopshop Stripe Long Sleeve Satin Shirtdress, $, available at NordstromMadewell Floral Print V-Neck Cupro Blend Midi DressYet another versatile black summer dress from yet another reader-favorite brand Madewell. Grab this lightweight maxi dress while it’s 35% off.Shop NordstromMadewell Floral Print V-Neck Cupro Blend Midi Dress, $, available at NordstromPistola Nina Long Sleeve Denim ShirtdressIf there’s one denim trend to hop on this year, it’s a denim dress. It’s a great style to channel the summer’s Western fashion trend.Shop NordstromPistola Nina Long Sleeve Denim Shirtdress, $, available at NordstromBillabong Dream All Day Floral Midi DressIf you’re into whimsical puff-sleeve dresses or milkmaid dresses, you’ll want to check out Nordstrom’s selection of floral Billabong dresses.Shop NordstromBillabong Dream All Day Floral Midi Dress, $, available at NordstromCaslon Plus Size Long Sleeve Chambray Belted ShirtdressWe found you a shirt dress and a denim dress (see previous slides), but you can get the best of both worlds with this flowy denim-like belted dress for all your summer brunches and barbecues. Shop NordstromCaslon Plus Size Long Sleeve Chambray Belted Shirtdress, $, available at NordstromAll in Favor Floral Print Bow Strap SundressA sundress that you can wear anywhere, from a backyard barbeque to a first date to a day of sightseeing. Shop NordstromAll In Favor Floral Print Bow Strap Sundress, $, available at NordstromHalogen Cowl Neck Satin SlipdressIn need of a formal wedding guest dress? You can find plenty of options at Nordstrom, including this style, which — best part! — comes in well under $100.Shop NordstromHalogen Cowl Neck Satin Slipdress, $, available at NordstromGood American Shine Scoop Back Rib Maxi Sweater DressGrab a figure-hugging maxi dress that can easily transition from the summer to the fall. Bonus: It comes in sizes XS to 4X (while supplies last, of course!).Shop NordstromGood American Shine Scoop Back Rib Maxi Sweater Dress, $, available at NordstromMaggy London Ruched Asymmetric Hem Midi DressFrom the office to a dinner party, this dress can easily work for both with its cowl neck, ruching, and hazy print. Shop NordstromMaggy London Ruched Asymmetric Hem Midi Dress, $, available at NordstromLafayette 148 New York Floral Print Silk Belted ShirtdressIf you’re looking to treat yourself, we recommend this vintage-inspired shirt dress.Shop NordstromLafayette 148 New York Floral Print Silk Belted Shirtdress, $, available at NordstromAllSaints Hadley Butterfly Print Cowl Neck Satin SlipdressSlink into a dressy slip dress for all your summer parties and girls’ night outs. Dress it up with heels and jewelry or down with white sneakers and a denim jacket.Shop NordstromAllSaints Hadley Butterfly Print Cowl Neck Satin Slipdress, $, available at NordstromBoss Destena Tweed Sheath DressGet down to business in a tweed mini dress that’s chic, professional, and versatile (meaning this style can also transition into the fall!).Shop NordstromBoss Destena Tweed Sheath Dress, $, available at NordstromVince Camuto Plus Size Printed Long Sleeve Belted DressThis flowy printed dress can go from day to night. It can also easily transition from summer to fall, giving you the best bang for your buck.Shop NordstromVince Camuto Plus Size Printed Long Sleeve Belted Dress, $, available at NordstromVince Nouveau Magnolia Long Sleeve Satin ShirtdressSlip into a polished satin shirtdress for your summer (and fall) dinner parties.Shop NordstromVince Nouveau Magnolia Long Sleeve Satin Shirtdress, $, available at NordstromCeCe Floral Print Midi DressFlorals? For summer? Yes! Whether you have a garden party or bridal shower brunch coming up, a sweet floral and ruffle dress will be perfect.Shop NordstromCeCe Floral Print Midi Dress, $, available at NordstromCiebon Plus Size Josette Beltled Midi ShirtdressA shirt dress is a great option to wear to the office, especially during the hot summer when you need something flowy and easy. We love the utility-inspired details of this style.Shop NordstromCiebon Plus Size Josette Beltled Midi Shirtdress, $, available at NordstromLike what you see? How about some more R29 goodness, right here?21 Best Sellers From Nordstrom's Big SaleR29 Editors' Top Nordstrom Anniversary Sale Picks29 Amazon Best-Sellers To Snap Up During Prime Day",
    "author": "Vivien Lee",
    "published": "Tue, 08 Jul 2025 16:22:38 +0000",
    "image": "https://www.refinery29.com/images/11913869.jpg?auto=webp\u0026width=\u0026height=\u0026quality=85",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "7d176739-79b5-4e71-9ab6-565cee4d8333",
    "title": "Gary Shteyngart Believes in Living the Good Life",
    "link": "https://www.nytimes.com/2025/07/08/style/gary-shteyngart-book-vera-or-faith.html",
    "description": "Mr. Shteyngart was once told he might be. With his sixth novel, “Vera, or Faith,” out now, he’s spent the last few years spending it well.",
    "author": "Alexander Nazaryan",
    "published": "Tue, 08 Jul 2025 15:44:57 +0000",
    "image": "https://static01.nyt.com/images/2025/07/07/multimedia/ST-GARY-SHTEYNGART-01-wzmt/ST-GARY-SHTEYNGART-01-wzmt-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Books and Literature",
      "Writing and Writers",
      "Russian-Americans",
      "Watches and Clocks",
      "Armoury, The (Manhattan, NY, Retailer)",
      "Borgo (Manhattan, NY, Restaurant)",
      "Shteyngart, Gary",
      "Rushdie, Salman"
    ]
  },
  {
    "id": "ccf9265a-5107-4934-976b-00a90db9db82",
    "title": "What Is Fibermaxxing? A TikTok Trend Encourages Fiber Consumption.",
    "link": "https://www.nytimes.com/2025/07/08/style/fibermaxxing-tiktok-trend.html",
    "description": "A familiar concept gets some Gen Z branding, and unlike other trends, experts are encouraging it.",
    "author": "Nicole Stock",
    "published": "Tue, 08 Jul 2025 20:20:09 +0000",
    "image": "https://static01.nyt.com/images/2025/07/08/multimedia/08ST-FIBERMAXXING-wjfz/08ST-FIBERMAXXING-wjfz-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Fiber (Dietary)",
      "Diet and Nutrition",
      "Social Media",
      "TikTok (ByteDance)"
    ]
  },
  {
    "id": "dda92fc0-ff26-45b9-bc29-d03ccfad8ce4",
    "title": "Ariana Madix's \"Love Island USA\" Hooded Maxi Dress Is an Optical Illusion",
    "link": "https://www.popsugar.com/fashion/ariana-madix-love-island-usa-outfits-49448496",
    "description": "Ariana Madix's sartorial sense first captured our hearts during her time on Bravo's \"Vanderpump Rules.\" From the revenge dress shared all over social media to her go-to designer handbag, we knew she was a style star since her debut back in season two. Since then, she's become a bona fide fashion darling as the impeccably-dressed host of \"Love Island USA.\" The actress and restaurateur, who just celebrated her 40th birthday, says her TV hosting outfits are like her \"children\" - and, given the effort and talent that goes into choosing each one, the analogy fits. This season, Madix's looks are the talk of the \"Love Island USA\" universe, from a LaQuan Smith pink ab cutout gown that's currently trending on TikTok to a red minidress that feels like a nod to her \"Vanderpump Rules\" reunion days. And there are plenty of outfits and glam moments to come from her time in Fiji. Working closely with stylist Emily Men with assistance from Karissa Loveday, Madix chooses summer-ready outfits that exude main-character energy, perfect to recreate if you're hosting a birthday dinner or even attending a fancy party. Whether she's strutting in a gown covered in colorful paillettes or posing in a glittering metallic low-rise skirt, she ensures all eyes are on her with every outfit change. Ahead, check out Ariana Madix's best \"Love Island USA\" looks from season seven - and shop available and inspired pieces in time for your next event.",
    "author": "Jessica Andrews",
    "published": "Tue, 08 Jul 2025 16:30:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/q7sgGhG0fGPRpXZLT5C12wNxYw4/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/07/07/029/n/1922564/6b1cc489686c5b7c514b58.35325706_.jpg",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Fashion Shopping",
      "Shopping",
      "TV",
      "Ariana Madix",
      "Love Island"
    ]
  },
  {
    "id": "161cf947-f71c-4490-aa36-68b0907578ce",
    "title": "24 Editor-Loved Amazon Prime Day 2025 Fashion Deals, Including Kendall Jenner's $9 Tank",
    "link": "https://www.popsugar.com/fashion/amazon-prime-day-fashion-deals-49212950",
    "description": "Fashion connoisseurs, rejoice. Amazon Prime Day is officially here. From now through July 11, shoppers can take advantage of some of the year's biggest deals - including markdowns on bestselling styles like handbags, leggings, everyday sneakers, and more. As shopping experts, we're essentially always tuned into Amazon's best deals and markdowns - from savings on cult-favorite beauty products to price drops on Amazon's most coveted home essentials and discounts on top-rated wellness products. And of course, we curated a guide to the best Prime Day fashion to help you better sort through all the madness. FYI: these fashion deals are going fast, so you'll want to keep your credit card handy and act quickly. Our Favorite Amazon Prime Day Fashion Deals to Shop Kendall Jenner's favorite tank top: Hanes Ecosmart Cotton Tank at $9, originally $11 Affordable leggings to motivate you to work out: Satina High Waisted Leggings at $15, originally $18 A bestselling comfy bralette: Calvin Klein Wireless Bralette at $16, originally $30 The perfect summer dress: Amazon The Drop Kimi Ruffled-Shoulder Smocked Midi Dress at $35, originally $70 The loungewear set of all loungewear sets: Tanming 2-Piece Outfit at $40, originally $50 Popular Levi's jeans for less than $50: Levi's Ribcage Straight Ankle Jeans at $48, originally $80 Keep scrolling to shop our top Prime Day sale picks, and be sure to sign up for Amazon Prime so that you don't miss a moment of the action. Looking for more deals? Check out PS's editor-curated Prime Day sale picks and subscribe to our newsletter for more shopping recommendations. Update on July 8, 2025 at 5:40PM ET: Updated prices and checked stock for all products.",
    "author": "Kyley Warren",
    "published": "Tue, 08 Jul 2025 14:50:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/4__n60QZtk9DUrkrGB5czNymda0/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/07/08/516/n/1922564/18c820b1686cffe47e3020.70709780_.png",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Sales",
      "Prime Day",
      "Fashion Shopping",
      "Amazon",
      "Affordable Shopping"
    ]
  }
]
