{
  "id": "00b04a72-1538-4455-becf-62fb2cc1dc7f",
  "title": "Google Just Launched an AI-Powered Duolingo Alternative",
  "link": "https://lifehacker.com/tech/google-launches-an-ai-powered-duolingo-alternative?utm_medium=RSS",
  "description": "But does it have a cute animal mascot? (No.)",
  "author": "Jake Peterson",
  "published": "Wed, 30 Apr 2025 21:00:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Internet"
  ],
  "byline": "Jake Peterson",
  "length": 6774,
  "excerpt": "But does it have a cute animal mascot? (No.)",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "But does it have a cute animal mascot? (No.) Credit: Lifehacker Thanks to some smart (and aggressive) marketing, Duolingo has cemented itself as one of the most popular language learning apps in the world. That said, it isn't without competition: There are plenty of alternatives to consider, and if you're peeved about Duolingo's plans to phase out its contract workers in favor of using AI, you might be looking into them. There's now a new competitor for Duo's crown, but it certainly isn't a replacement for the AI-averse. It's also far from an underdog, considering the service comes from none other than Google. Yesterday, the company announced a new AI-powered language learning experience it calls Little Language Lessons. It isn't an app, rather an experiment in Google Labs that offers small doses of lessons and immersion for a handful of different languages. Here's how Google's Little Language Lessons currently work.Using Google's Duolingo alternative To start, head to Google Labs' Little Language Lessons site, and sign in with your Google Account. You'll need to agree to a pop-up that warns you that the feature is an early experiment that uses generative AI, and might not always be accurate—a hallmark flaw of AI tools in general.Google is offering 22 language options (including regional dialects for specific languages). Those include:ArabicChinese (China) Chinese (Hong Kong)Chinese (Taiwan)English (AU)English (UK)English (US)French (Canada) French (France)GermanGreekHebrewHindiItalianJapaneseKoreanPortuguese (Brazil)Portuguese (Portugal)RussianSpanish (Latin America)Spanish (Spain)TurkishOnce you're in, there are three different types of lessons to try—or \"experiments,\" as Google calls them. \"Experiment no. 001\" is \"Tiny Lesson,\" which assists you with words, phrases, and grammar for any situation you can dream up. You choose the language, then type a \"purpose or theme\" into the provided text field. If you can't think of anything, you can use one of the auto-generated themes Google provides, like \"taking a taxi,\" \"scuba diving\" or \"going on a first date.\" (Or taking a taxi to scuba dive on your first date.)I went with Portuguese (Portugal) and \"taking a taxi.\" I hit Generate, and Tiny Lesson offered me three categories to work from: Vocabulary, which lists different words I might use (\"o táxi\" for \"the taxi\" or \"o taxista\" for \"the taxi driver\"); Phrases, such as \"Pode chamar um táxi, por favor?\" for \"Can you call a taxi, please?\"; and Tips, like explaining how to use \"ter que\" to express that I need to go somewhere. Any Portuguese words and phrases have a speaker option to click to hear the proper pronunciation. \"Experiment no. 002\" is \"Slang Hang,\" which aims to teach you slang and expressions from the regions that speak the language you're learning. For fun, I asked it to run with U.S. English for this one. Slang Hang generates a story between two people, and, following a short premise, generates a conversation between them to demonstrate how they might naturally speak to one another. Expressions and slang are underlined, and, again, you can click the speaker icon to hear them spoken out loud. What do you think so far? One side of the conversation is generated at a time, and you press the space bar to move on to the next person's sentence. If you want a new story altogether, you can hit the refresh icon, or click the X to exit entirely. (Slang Hang is currently missing support for Arabic, Greek, Hebrew, Hindi, Italian, Japanese, Korean, Portuguese (Portugal), and Turkish.) Credit: Lifehacker Finally, there's \"Experiment no. 003,\" or \"Word Cam.\" This feature lets you take and share a photo with the web app to learn how to talk about your surroundings. This works best on a smartphone or tablet, since otherwise you'll only have your computer's front-facing camera to work with. Once you grant access to your camera, snap a photo of your surroundings. Word Cam then analyzes the image, highlights specific elements, and labels them with words in the target language. For example, I took a photo of the street corner, and Word Cam labeled the car as \"o carro,\" the grass as \"a relva,\" and the bush as \"arbusto.\" You can tap each word to pull up a full page about the word in question, as well as examples of how you might use it in different sentences and scenarios.Can Little Language Lessons compete with Duolingo?Little Language Lessons is a neat idea, and I'm looking forward to experimenting with it further. Will this take a bite out of Duolingo? I doubt it. But it does offer a more casual and personal approach to language learning, as opposed to Duolingo's more structured lessons. I like that I can choose what I want to learn more about, especially as, in my view, language acquisition is most effective when you're learning words and phrases you actively use on a daily basis. The main concern is learning the wrong words, which could be an issue if the AI decides to hallucinate an incorrect translation. That's where human intervention would come in handy: If lessons were generated by people and fact-checkers, you'd feel a bit more at ease with accepting the information at face value. With these lessons, however, I feel I have to double-check everything it tells me. Jake Peterson Senior Technology Editor Jake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film \u0026 TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut. Read Jake's full bio",
  "image": "https://lifehacker.com/imagery/articles/01JT3ZG59FNYE5C66T8QJHPGJ2/hero-image.fill.size_1200x675.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n                            \u003cdiv data-ga-module=\"content-header\" aria-label=\"Content Header\"\u003e\n        \n        \n                    \u003cp\u003eBut does it have a cute animal mascot? (No.)\u003c/p\u003e\n            \u003c/div\u003e\n            \n            \u003csection data-ga-module=\"content-body\"\u003e\n                            \n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JT3ZG59FNYE5C66T8QJHPGJ2/hero-image.fill.size_1248x702.v1746044922.png\" alt=\"little language lessons\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01JT3ZG59FNYE5C66T8QJHPGJ2/hero-image.fill.size_400x225.v1746044922.png 400w, https://lifehacker.com/imagery/articles/01JT3ZG59FNYE5C66T8QJHPGJ2/hero-image.fill.size_800x450.v1746044922.png 800w, https://lifehacker.com/imagery/articles/01JT3ZG59FNYE5C66T8QJHPGJ2/hero-image.fill.size_1248x702.v1746044922.png 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\n                        \u003cp\u003e\u003cspan\u003eCredit: Lifehacker\u003c/span\u003e\n                            \u003c/p\u003e\n            \n    \n    \u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eThanks to some smart (and aggressive) marketing, Duolingo has cemented itself as one of the most popular language learning apps in the world. That said, it isn\u0026#39;t without competition: \u003ca href=\"https://www.cnet.com/tech/services-and-software/best-language-learning-apps/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eThere are plenty of alternatives to consider\u003c/a\u003e, and if you\u0026#39;re peeved about \u003ca href=\"https://lifehacker.com/tech/mango-languages-alternative-to-ai-first-duolingo\" target=\"_blank\"\u003eDuolingo\u0026#39;s plans to phase out its contract workers in favor of using AI\u003c/a\u003e, you might be looking into them. \u003c/p\u003e\u003cp\u003eThere\u0026#39;s now a new competitor for Duo\u0026#39;s crown, but it certainly isn\u0026#39;t a replacement for the AI-averse. It\u0026#39;s also far from an underdog, considering the service comes from none other than Google. Yesterday, the company announced a new AI-powered language learning experience it calls \u003ca href=\"https://blog.google/outreach-initiatives/education/little-language-lessons/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eLittle Language Lessons\u003c/a\u003e. It isn\u0026#39;t an app, rather an experiment in Google Labs that offers small doses of lessons and immersion for a handful of different languages. \u003c/p\u003e\u003cp\u003eHere\u0026#39;s how Google\u0026#39;s Little Language Lessons currently work.\u003c/p\u003e\u003ch2 id=\"using-googles-duolingo-alternative\"\u003eUsing Google\u0026#39;s Duolingo alternative \u003c/h2\u003e\u003cp\u003eTo start, head to \u003ca href=\"https://labs.google/lll/en\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eGoogle Labs\u0026#39; Little Language Lessons site\u003c/a\u003e, and sign in with your Google Account. You\u0026#39;ll need to agree to a pop-up that warns you that the feature is an early experiment that uses generative AI, and might not always be accurate—\u003ca href=\"https://lifehacker.com/how-to-tell-when-an-artificial-intelligence-is-hallucin-1850280001\" target=\"_blank\"\u003ea hallmark flaw of AI tools in general\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eGoogle is offering 22 language options (including regional dialects for specific languages). Those include:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eArabic\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eChinese (China) \u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eChinese (Hong Kong)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eChinese (Taiwan)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eEnglish (AU)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eEnglish (UK)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eEnglish (US)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eFrench (Canada) \u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eFrench (France)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eGerman\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eGreek\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eHebrew\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eHindi\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eItalian\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eJapanese\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eKorean\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003ePortuguese (Brazil)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003ePortuguese (Portugal)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eRussian\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eSpanish (Latin America)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eSpanish (Spain)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eTurkish\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eOnce you\u0026#39;re in, there are three different types of lessons to try—or \u0026#34;experiments,\u0026#34; as Google calls them. \u0026#34;Experiment no. 001\u0026#34; is \u0026#34;Tiny Lesson,\u0026#34; which assists you with words, phrases, and grammar for any situation you can dream up. You choose the language, then type a \u0026#34;purpose or theme\u0026#34; into the provided text field. If you can\u0026#39;t think of anything, you can use one of the auto-generated themes Google provides, like \u0026#34;taking a taxi,\u0026#34; \u0026#34;scuba diving\u0026#34; or \u0026#34;going on a first date.\u0026#34; (Or taking a taxi to scuba dive on your first date.)\u003c/p\u003e\u003cp\u003eI went with Portuguese (Portugal) and \u0026#34;taking a taxi.\u0026#34; I hit \u003cstrong\u003eGenerate\u003c/strong\u003e, and Tiny Lesson offered me three categories to work from: Vocabulary, which lists different words I might use (\u0026#34;o táxi\u0026#34; for \u0026#34;the taxi\u0026#34; or \u0026#34;o taxista\u0026#34; for \u0026#34;the taxi driver\u0026#34;); Phrases, such as \u0026#34;Pode chamar um táxi, por favor?\u0026#34; for \u0026#34;Can you call a taxi, please?\u0026#34;; and Tips, like explaining how to use \u0026#34;ter que\u0026#34; to express that I need to go somewhere. Any Portuguese words and phrases have a speaker option to click to hear the proper pronunciation. \u003c/p\u003e\u003cp\u003e\u0026#34;Experiment no. 002\u0026#34; is \u0026#34;Slang Hang,\u0026#34; which aims to teach you slang and expressions from the regions that speak the language you\u0026#39;re learning. For fun, I asked it to run with U.S. English for this one. Slang Hang generates a story between two people, and, following a short premise, generates a conversation between them to demonstrate how they might naturally speak to one another. Expressions and slang are underlined, and, again, you can click the speaker icon to hear them spoken out loud.  \u003c/p\u003e\u003cdiv data-ga-click=\"\" data-ga-template=\"News\" data-ga-module=\"openweb_widget\" data-ga-element=\"openweb_scroll\" data-ga-item=\"openweb_scroll_midpage\" x-cloak=\"\" x-data=\"{ commentsCount: null, hasComments: false }\" x-init=\"commentsCount = await window.openweb.getMessagesCount(01JT3ZG59FNYE5C66T8QJHPGJ2);\n     hasComments = commentsCount !== null \u0026amp;\u0026amp; commentsCount \u0026gt; 0\"\u003e\n            \n\n            \u003cp\u003e\u003cspan\u003e\n                What do you think so far?\n                \n            \u003c/span\u003e\n        \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eOne side of the conversation is generated at a time, and you press the space bar to move on to the next person\u0026#39;s sentence. If you want a new story altogether, you can hit the refresh icon, or click the X to exit entirely. (Slang Hang is currently missing support for Arabic, Greek, Hebrew, Hindi, Italian, Japanese, Korean, Portuguese (Portugal), and Turkish.)\u003c/p\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01JT3ZG59FNYE5C66T8QJHPGJ2/images-1.fill.size_2000x1125.v1746038952.jpg\" alt=\"Slang Hang in action\" width=\"2000\" height=\"1125\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01JT3ZG59FNYE5C66T8QJHPGJ2/images-1.fill.size_800x450.v1746038952.jpg 800w, https://lifehacker.com/imagery/articles/01JT3ZG59FNYE5C66T8QJHPGJ2/images-1.fill.size_1400x787.v1746038952.jpg 1400w, https://lifehacker.com/imagery/articles/01JT3ZG59FNYE5C66T8QJHPGJ2/images-1.fill.size_2000x1125.v1746038952.jpg 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003e\u003c/span\u003e\n                                        \u003cspan\u003eCredit: Lifehacker\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003cp\u003eFinally, there\u0026#39;s \u0026#34;Experiment no. 003,\u0026#34; or \u0026#34;Word Cam.\u0026#34; This feature lets you take and share a photo with the web app to learn how to talk about your surroundings. This works best on a smartphone or tablet, since otherwise you\u0026#39;ll only have your computer\u0026#39;s front-facing camera to work with. \u003c/p\u003e\u003cp\u003eOnce you grant access to your camera, snap a photo of your surroundings. Word Cam then analyzes the image, highlights specific elements, and labels them with words in the target language. For example, I took a photo of the street corner, and Word Cam labeled the car as \u0026#34;o carro,\u0026#34; the grass as \u0026#34;a relva,\u0026#34; and the bush as \u0026#34;arbusto.\u0026#34; You can tap each word to pull up a full page about the word in question, as well as examples of how you might use it in different sentences and scenarios.\u003c/p\u003e\u003ch2 id=\"can-little-language-lessons-compete-with-duolingo\"\u003eCan Little Language Lessons compete with Duolingo?\u003c/h2\u003e\u003cp\u003eLittle Language Lessons is a neat idea, and I\u0026#39;m looking forward to experimenting with it further. Will this take a bite out of Duolingo? I doubt it. But it does offer a more casual and personal approach to language learning, as opposed to Duolingo\u0026#39;s more structured lessons. I like that I can choose what I want to learn more about, especially as, in my view, language acquisition is most effective when you\u0026#39;re learning words and phrases you actively use on a daily basis. \u003c/p\u003e\u003cp\u003eThe main concern is learning the wrong words, which could be an issue if the AI decides to hallucinate an incorrect translation. That\u0026#39;s where human intervention would come in handy: If lessons were generated by people and fact-checkers, you\u0026#39;d feel a bit more at ease with accepting the information at face value. With these lessons, however, I feel I have to double-check everything it tells me.\u003c/p\u003e\n    \u003c/article\u003e\n\n    \n                        \u003cdiv\u003e\n                \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/authors/01HF2FBCM600PS5NXSJXJA1AKJ/image.fill.size_150x150.v1704301306.png\" alt=\"artist rendition of Jake Peterson\" width=\"150\" height=\"150\" loading=\"lazy\"/\u003e\n                                            \u003c/p\u003e\n                \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003cp\u003eJake Peterson\u003c/p\u003e\n                                    \u003cp\u003eSenior Technology Editor\u003c/p\u003e\n                                \u003cdiv\u003e\n                                            \u003cp\u003eJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film \u0026amp; TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the \u003ca href=\"https://lifehacker.com/tech/living-with-ai\" target=\"_blank\"\u003ebest uses of AI in your daily life\u003c/a\u003e to \u003ca href=\"https://lifehacker.com/okay-which-macbook-should-you-buy-1849330413\" target=\"_blank\"\u003ewhich MacBook to buy\u003c/a\u003e. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\u003c/p\u003e\n                                    \u003c/div\u003e\n                \u003cp\u003e\u003ca href=\"https://lifehacker.com/author/jakepeterson\"\u003eRead Jake\u0026#39;s full bio\u003c/a\u003e\u003c/p\u003e\u003cul\u003e\n                                                                                                                            \u003cli\u003e\n                                \u003ca href=\"https://lifehacker.com/cdn-cgi/l/email-protection#6802180d1c0d1a1b07062804010e0d00090b030d1a460b0705\" title=\"Send an Email (Opens in a new tab)\" aria-label=\"Send Jake an email\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-envelope\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                            \u003c/ul\u003e\n                            \u003c/div\u003e\n        \u003c/div\u003e\n                \u003cdiv\u003e\n                                            \n                        \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"1\" data-ga-label=\"Here\u0026#39;s What\u0026#39;s New in the Latest Nintendo Switch Update\" href=\"https://lifehacker.com/tech/heres-whats-new-in-the-latest-nintendo-switch-update\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JT3RYSNPK6MCRXKWARJMF65K/hero-image.fill.size_75x75.v1746034394.jpg\" alt=\"person playing nintendo switch\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                    \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"2\" data-ga-label=\"Update Your Old LG Phone While You Still Can\" href=\"https://lifehacker.com/tech/update-your-old-lg-phone-asap\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JT1DPR7HRKCGMFAF92H4THTG/hero-image.fill.size_75x75.v1745954572.jpg\" alt=\"lg wing swiveled out\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                                        \u003c/div\u003e\n            \u003c/div\u003e\n            \n    \n    \n\n    \n                    \u003c/section\u003e\n\n                            \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-04-30T21:00:00Z",
  "modifiedTime": "2025-04-30T21:00:00Z"
}
