{
  "id": "01e34a1c-babd-4a52-9bb2-5dfc8e16e7ee",
  "title": "Two Baltic Sea communications cables have been knocked offline",
  "link": "https://www.engadget.com/computing/two-baltic-sea-communications-cables-have-been-knocked-offline-214130723.html?src=rss",
  "description": "Two undersea communications cables in the Baltic Sea have been knocked offline, and at least one appears to have been physically cut. CNN received confirmation from a local telecom company that a cable between Lithuania and Sweden was cut on Sunday morning. A second cable, about 60 to 65 miles from the first, routes communications between Finland and Germany. The cause of that outage has yet to be determined, but officials suspect “intentional damage.” The outages follow a September warning from the US about an increased risk of Russian “sabotage” of undersea cables. That came after a joint investigation from public broadcasters from Sweden, Denmark, Norway and Finland that Russia had deployed a fleet of spy ships in Nordic waters. They were reportedly part of a program designed to sabotage the cables (and wind farms). This doesn’t leave the European nations entirely without online communications, as data is typically routed through multiple cables to avoid overreliance on a single one. Cinia, the state-controlled Finnish company that oversees the second cable, said it wasn’t yet determined what caused the outage since they haven’t yet physically inspected it. However, the sudden outage reportedly suggests it, too, was cut by an outside force. The foreign ministers of Finland and Germany released a joint statement on Monday. “We are deeply concerned about the severed undersea cable connecting Finland and Germany in the Baltic Sea,” they wrote. “The fact that such an incident immediately raises suspicions of intentional damage speaks volumes about the volatility of our times. A thorough investigation is underway. Our European security is not only under threat from Russia‘s war of aggression against Ukraine, but also from hybrid warfare by malicious actors. Safeguarding our shared critical infrastructure is vital to our security and the resilience of our societies.” The Lithuania-Sweden cable, which handles about a third of Lithuania’s internet capacity, is expected to be repaired “over the next few weeks,” and weather could determine the precise timing.This article originally appeared on Engadget at https://www.engadget.com/computing/two-baltic-sea-communications-cables-have-been-knocked-offline-214130723.html?src=rss",
  "author": "Will Shanklin",
  "published": "Mon, 18 Nov 2024 21:41:30 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Politics \u0026 Government",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Will Shanklin"
  ],
  "byline": "Will Shanklin",
  "length": 2083,
  "excerpt": "Two undersea cables in the Baltic Sea were cut, with at least one physically damaged. A cable between Lithuania and Sweden was cut on Sunday morning. The...",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "Two undersea communications cables in the Baltic Sea have been knocked offline, and at least one appears to have been physically cut. CNN received confirmation from a local telecom company that a cable between Lithuania and Sweden was cut on Sunday morning. A second cable, about 60 to 65 miles from the first, routes communications between Finland and Germany. The cause of that outage has yet to be determined, but officials suspect “intentional damage.”The outages follow a September warning from the US about an increased risk of Russian “sabotage” of undersea cables. That came after a joint investigation from public broadcasters from Sweden, Denmark, Norway and Finland that Russia had deployed a fleet of spy ships in Nordic waters. They were reportedly part of a program designed to sabotage the cables (and wind farms).This doesn’t leave the European nations entirely without online communications, as data is typically routed through multiple cables to avoid overreliance on a single one.Cinia, the state-controlled Finnish company that oversees the second cable, said it wasn’t yet determined what caused the outage since they haven’t yet physically inspected it. However, the sudden outage reportedly suggests it, too, was cut by an outside force.The foreign ministers of Finland and Germany released a joint statement on Monday. “We are deeply concerned about the severed undersea cable connecting Finland and Germany in the Baltic Sea,” they wrote. “The fact that such an incident immediately raises suspicions of intentional damage speaks volumes about the volatility of our times. A thorough investigation is underway. Our European security is not only under threat from Russia‘s war of aggression against Ukraine, but also from hybrid warfare by malicious actors. Safeguarding our shared critical infrastructure is vital to our security and the resilience of our societies.”The Lithuania-Sweden cable, which handles about a third of Lithuania’s internet capacity, is expected to be repaired “over the next few weeks,” and weather could determine the precise timing.",
  "image": "https://s.yimg.com/ny/api/res/1.2/EMnkmmMKQzrqumYv8OBuXg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-10/bf81b740-a5f3-11ef-b6cf-cdb975739920",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eTwo undersea communications cables in the Baltic Sea have been knocked offline, and at least one appears to have been physically cut. \u003cem\u003eCNN\u003c/em\u003e \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1\" href=\"https://www.cnn.com/2024/11/18/europe/undersea-cable-disrupted-germany-finland-intl/index.html\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:received confirmation;elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1;itc:0;sec:content-canvas\"\u003ereceived confirmation\u003c/a\u003e from a local telecom company that a cable between Lithuania and Sweden was cut on Sunday morning. A second cable, about 60 to 65 miles from the first, routes communications between Finland and Germany. The cause of that outage has yet to be determined, but officials suspect “intentional damage.”\u003c/p\u003e\u003cp\u003eThe outages follow a \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1\" href=\"https://www.cnn.com/2024/09/06/politics/us-sees-increasing-risk-of-russian-sabotage-undersea-cables/index.html\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:September warning;elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1;itc:0;sec:content-canvas\"\u003eSeptember warning\u003c/a\u003e from the US about an increased risk of Russian “sabotage” of undersea cables. That came after a \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1\" href=\"https://www.cnn.com/2023/04/19/europe/russia-spy-ships-nordic-waters-intl/index.html\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:joint investigation;elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1;itc:0;sec:content-canvas\"\u003ejoint investigation\u003c/a\u003e from public broadcasters from Sweden, Denmark, Norway and Finland that Russia had deployed a fleet of spy ships in Nordic waters. They were reportedly part of a program designed to sabotage the cables (and wind farms).\u003c/p\u003e\u003cp\u003eThis doesn’t leave the European nations entirely without online communications, as data is typically routed through multiple cables to avoid overreliance on a single one.\u003c/p\u003e\u003cp\u003eCinia, the state-controlled Finnish company that oversees the second cable, said it wasn’t yet determined what caused the outage since they haven’t yet physically inspected it. However, the sudden outage reportedly suggests it, too, was cut by an outside force.\u003c/p\u003e\u003cp\u003eThe foreign ministers of Finland and Germany released a \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1\" href=\"https://www.auswaertiges-amt.de/en/newsroom/news/-/2685132\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:joint statement;elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1;itc:0;sec:content-canvas\"\u003ejoint statement\u003c/a\u003e on Monday. “We are deeply concerned about the severed undersea cable connecting Finland and Germany in the Baltic Sea,” they wrote. “The fact that such an incident immediately raises suspicions of intentional damage speaks volumes about the volatility of our times. A thorough investigation is underway. Our European security is not only under threat from Russia‘s war of aggression against Ukraine, but also from hybrid warfare by malicious actors. Safeguarding our shared critical infrastructure is vital to our security and the resilience of our societies.”\u003c/p\u003e\u003cp\u003eThe Lithuania-Sweden cable, which handles about a third of Lithuania’s internet capacity, is expected to be repaired “over the next few weeks,” and weather could determine the precise timing.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-18T21:41:30Z",
  "modifiedTime": null
}
