{
  "id": "08a3976d-ea48-412c-81f9-ac64f0b1537b",
  "title": "Trump has thrown a wrench into a national EV charging program",
  "link": "https://arstechnica.com/tech-policy/2025/02/trump-has-thrown-a-wrench-into-a-national-ev-charging-program/",
  "description": "Electric charging projects have been thrown into chaos by the administration's directive.",
  "author": "Lee Hedgepeth, Aman Azhar, Jake Bolster, Lisa Sorg, Sarah Mattalian, Inside Climate News",
  "published": "Sat, 15 Feb 2025 12:07:10 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Cars",
    "Policy",
    "electric car charging stations",
    "electrify america",
    "EVs",
    "syndication",
    "trump administration"
  ],
  "byline": "Inside Climate News",
  "length": 23661,
  "excerpt": "Electric charging projects have been thrown into chaos by the administration’s directive.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Electric charging projects have been thrown into chaos by the administration's directive. A row of happy EVs charge with no drama, no phone calls to the support line, and no one shuffling spots. Credit: Roberto Baldwin This article originally appeared on Inside Climate News, a nonprofit, non-partisan news organization that covers climate, energy and the environment. Sign up for their newsletter here. For now, Priester’s will have to stick to its famous pecans in Fort Payne, Alabama. But maybe not for long. Priester’s Pecans, an Alabama staple, is one of more than half a dozen sites across the state slated to receive millions of dollars in federal funding to expand access to chargers for electric vehicles. Across the country, the National Electric Vehicle Infrastructure (NEVI) program, part of the 2021 Infrastructure Investment and Jobs Act signed into law under then-President Joe Biden, is set to provide $5 billion to states for projects that expand the nation’s EV charging infrastructure. But in a February 6 letter, a Trump administration official notified state directors of transportation that, effectively, they can’t spend it. The Federal Highway Administration rescinded guidance on the funds, which had been allocated by Congress, and “is also immediately suspending the approval of all State Electric Vehicle Infrastructure Deployment plans for all fiscal years,” the letter said. “Therefore, effective immediately, no new obligations may occur under the NEVI Formula Program until the updated final NEVI Formula Program Guidance is issued and new State plans are submitted and approved.” POLITICO reported on Wednesday that a DOT spokesman said in an email that states were free to use a small portion of the funding—about $400 million—because that was money the states had already “obligated,” or awarded to subcontractors. But that would still leave close to 90 percent of the funding up in the air. Even before the administration had issued its letter, some Republican-led states, including Alabama, had already announced pauses to their states’ implementation of the national EV charging program. “In response to Unleashing American Energy, one of several Executive Orders that President Trump signed on January 20, 2025, the Alabama Department of Economic and Community Affairs has paused the National Electric Vehicle Infrastructure (NEVI) Program as of January 28, 2025,” the Alabama agency responsible for implementing NEVI posted on its website. “In addition, for applications for funding that were originally due on March 17, 2025, ADECA has closed the application window until further notice.” Despite the announcement by the Trump administration, however, legal experts and those familiar with the electric charging program at issue say the president does not have the power to permanently nix the NEVI program. “NEVI funding was appropriated by Congress as part of the bipartisan infrastructure law, and it cannot be canceled by the executive branch,” said Elizabeth Turnbull, director of policy and regulatory affairs at the Alliance for Transportation Electrification, a trade group for the electric vehicle industry. “It’s not clear that the secretary of transportation has the authority to revoke states’ NEVI plans, and it’s quite clear that the executive branch lacks the authority to withhold the funding for any sustained period. So, we expect recent executive branch actions to be successfully challenged in court.” Even under the most aggressive arguments for a strong executive branch, the Supreme Court has stated clearly that the Constitution gives Congress the sole authority to appropriate and legislate. Lawmakers, too, have weighed in on the legality of the Trump administration’s NEVI directive, saying officials acted with “blatant disregard for the law.” In a letter to administration officials, Democratic members of the Senate Committee on Environment and Public Works urged the Department of Transportation to retract its February 6 letter and “implement the law according to your responsibilities.” The Democrats’ letter also asked for responses to questions about the legal basis for the action and for information about the involvement of individuals associated with Elon Musk’s so-called “Department of Government Efficiency.” DOGE is not an official department, and multiple reports show that Musk’s team has been dismantling parts or all of some federal agencies. Tesla, Musk’s electric vehicle company, currently has the largest network of fast chargers in the country. It’s not yet clear if any new policies on NEVI, or the pause on building out a more robust network for all EV drivers, could benefit Tesla. The Department of Transportation, the Federal Highway Administration’s parent agency, did not respond to a request for comment. With or without NEVI, the move toward the electrification of transportation is inevitable, experts say. But they warn that although the administration’s pause of the program will likely be reversed by the courts, even a temporary delay in EV charging infrastructure can harm the nation’s ability to quickly and efficiently transition to electric vehicles. And the Trump administration ignored an earlier court order to lift a broad freeze on federal funds, a federal judge ruled this week. Meanwhile, Trump’s NEVI freeze has sown confusion across the country, with EV stakeholders and state governments scrambling to figure out what the funding pause will mean and how to respond. Beyond Alabama, interviews across the country found officials in deep red Wyoming contemplating a possible return of funds, while those in progressive states like Illinois and Maryland remain firmly committed to the EV buildout, with or without federal funding. In purple North Carolina, officials are in limbo, having already spent some NEVI funds, but not sure how to proceed with the next round of projects. Alabama In Alabama, officials had already announced plans to fund more than a dozen chargers at sites across the state along interstates and major highways, including installing two dual-port chargers at eight Love’s Travel Stops and another at Priester’s Pecans off I-65 in Fort Deposit. At the time, state officials, including Republican Gov. Kay Ivey, praised the funding. “Having strategic electric vehicle charging stations across Alabama not only benefits EV drivers, but it also benefits those companies that produce electric vehicles, including many of them right here in Alabama, resulting in more high-paying jobs for Alabamians,” Ivey said when the funding allocation was announced in July 2024. “This latest round of projects will provide added assurance that Alabamians and travelers to our state who choose electric vehicles can travel those highways and know a charging station is within a reliable distance on their routes.” In total, Alabama was set to receive $79 million in funding through the program, including $2.4 million to expand training programs for the installation, testing, operation, and maintenance of EVs and EV chargers at Bevill State Community College in the central part of the state. The college did not respond to a request for comment on whether the money had been disbursed to the institution before the announced pause. In an email exchange this week, a spokesperson for the Alabama Department of Economic and Community Affairs confirmed what the agency had posted to its website in the wake of Trump’s inauguration—that the state would pause NEVI projects and await further guidance from the Trump administration. Even with a pause, however, stakeholders in Alabama and across the country have expressed a commitment to continuing the expansion of electric vehicle charging infrastructure. For its part, Love’s Travel Stops, a 42-state chain that had been set to receive more than $5.8 million in funding for EV chargers in Alabama alone, said it will continue to roll out electric chargers at locations nationwide. “Love’s remains committed to meeting customers’ needs regardless of fuel type and believes a robust electric vehicle charging network is a part of that,” Kim Okafor, general manager of zero emissions for Love's, said in an emailed statement. “Love’s will continue to monitor related executive orders and subsequent changes in law to determine the next steps. This includes the Alabama Department of Transportation’s Electric Vehicle charging plan timelines.” The state of Alabama, meanwhile, has its own EV charger program apart from NEVI that has already funded millions of dollars worth of charging infrastructure. In January, even after its announced pause of NEVI implementation, the Alabama Department of Economic and Community Affairs announced the awarding of six grants totaling $2.26 million from state funds for the construction of EV chargers in Huntsville, Hoover, Tuscaloosa, and Mobile. “The installation of electric vehicle charging stations at places like hotels are investments that can attract customers and add to local economies,” ADECA Director Kenneth Boswell said at the time. North Carolina In North Carolina, the full buildout of the state’s electric charging network under NEVI is in limbo just four months after the NC Department of Transportation announced the initial recipients of the funds. NC DOT spokesman Jamie Kritzer said that based on the federal government’s directive, the agency is continuing with awarded projects but “pausing” the next round of requests for proposals, as well as future phases of the buildout. If that pause were to become permanent, the state would be forced to abandon $103 million in federal infrastructure money that would have paid for an additional 41 stations to be built as part of Phase 1. Last September the state announced it had awarded nearly $6 million to six companies to build nine public charging stations. Locations include shopping centers, travel plazas, and restaurants, most of them in economically disadvantaged communities. NEVI requires EV charging stations in the first phase to be installed every 50 miles along the federally approved alternative fuel corridors, and that they be within one mile of those routes. The state has also prioritized Direct Current Fast Charging (DCFC) stations, which can charge a vehicle to 80 percent in 20 to 30 minutes. The NEVI program is structured to reimburse private companies for up to 80 percent of the cost to construct and operate electric vehicle charging stations for five years, after which the charging stations will continue to operate without government support, according to the state DOT. The state estimated it would have taken two to three years to finish Phase 1. Under Phase 2, the state would award federal funds to build community-level electric vehicle charging stations, farther from the major highways, including in disadvantaged communities. That is particularly important in North Carolina, which has the second-largest rural population in the US in terms of percentage. A third of the state’s residents live in rural areas, which are underserved by electric vehicle charging stations. There are already more than 1,700 public electric charging stations and 4,850 ports in North Carolina, according to the US Department of Energy’s Alternative Fuels Data Center. But they aren’t evenly dispersed throughout the state. Alleghany and Ashe counties, in the western mountains, have just one charging station each. Vickie Atkinson, who lives in the country between Chapel Hill and Pittsboro in central North Carolina, drives a plug-in hybrid Ford Escape, which is powered by an electric engine or gas, unlike full electric models, which have no gas option. Plug-in hybrids typically have fully electric ranges of 35 to 40 miles. “I try to drive on battery whenever possible,” Atkinson said. But she’s frustrated that she can’t drive from her home to downtown Siler City and back—a 60-mile round trip—without resorting to the gas engine. There are two chargers on the outskirts along US 64—only one of them is a fast charger—but none downtown. “I really hope the chargers are installed,” Atkinson said. “I fear they won’t and I find that very frustrating.” Former Gov. Roy Cooper, a Democrat, advocated for wider adoption of electric vehicles and infrastructure. In a 2018 executive order, Cooper established a benchmark of 80,000 registered zero-emission vehicles in the state by 2025. North Carolina met that goal. State DOT registration data shows there were 81,658 electric vehicles and 24,457 plug-in hybrids as of September, the latest figures available. Cooper issued a subsequent executive order in 2022 that set a more aggressive goal: 1.2 million registered electric vehicles by 2030. At the current pace of electric vehicle adoption, it’s unlikely the state will achieve that benchmark. The electric vehicle industry is an economic driver in North Carolina. Toyota just opened a $13.9 billion battery plant in the small town of Liberty and says it will create about 5,100 new jobs. The company is scheduled to begin shipping batteries in April. Natron Energy is building a plant in Edgecombe County, east of Raleigh, to manufacture sodium-ion batteries for electric vehicles. Experts say they are cheaper and environmentally superior to lithium-ion batteries and less likely to catch fire, although they store less energy. The global company Kempower opened its first North American factory in Durham, where it builds charging infrastructure. Jed Routh, its vice president of markets and products for North America, said that while “the rapidly shifting market is difficult to forecast and interest in electric vehicles may slow at times over the next four years, we don’t expect it to go away. We believe that the industry will remain strong and Kempower remains committed to define, produce, and improve EV charging infrastructure throughout North America.” North Carolina does have a separate funding source for electric charging stations that is protected from the Trump administration’s program cuts and cancellations. The state received $92 million from Volkswagen, part of the EPA’s multi-billion-dollar national settlement in 2016 with the car company, which had installed software in some of its diesel cars to cheat on emissions tests. The Department of Environmental Quality used the settlement money to pay for 994 EV charging ports at 318 sites in North Carolina. The agency expects to add more charging stations with $1.8 million in unspent settlement funds. Electrify America was created by the Volkswagen Group of America to implement a $2 billion portion of the settlement. It required the car company to invest in electric charging infrastructure and in the promotion of electric and plug-in hybrid vehicles. Electrify America operates 20 charging NEVI-compliant, high-speed stations in North Carolina, using the settlement money. However, the funding pause could affect the company because it works with potential site developers and small businesses to comply with the NEVI requirements. The company is still reviewing the details in the federal memo, company spokeswoman Tara Geiger said. “Electrify America continues to engage with stakeholders to understand developments impacting the National Electric Vehicle Infrastructure program,” Geiger wrote in an email. “We remain committed to growing our coast-to-coast Hyper-Fast network to support transportation electrification.” Wyoming In Wyoming, Doug McGee, a state Department of Transportation spokesperson, said the agency is taking a wait and see approach to NEVI moving forward, and is not ruling out a return of funding. About half a dozen people at the department handle NEVI along with other daily responsibilities, McGee said, and it will be easy for them to put NEVI on hold while they await further instruction. The department was in the process of soliciting proposals for EV charging stations and has not yet spent any money under NEVI. “There was very little to pause,” McGee said. Across 6,800 miles of highway in Wyoming, there are 110 public EV charging stations, making the state’s EV infrastructure the third-smallest in the country, ahead of charging networks in only North Dakota and Alaska. Illinois More progressive states, including Illinois, have explicitly said they will redouble their efforts to support the expansion of EV charging infrastructure in the wake of the Trump administration’s NEVI pause. The state of Illinois has said it remains committed to the goal of helping consumers and the public sector transition to EVs in 2025 through state funding sources, even if some NEVI projects are halted. Commonwealth Edison Co. (ComEd), the largest electric utility in Illinois and the primary electric provider in Chicago, also announced a $100 million rebate program on Feb. 6 at the Chicago Auto Show, funds that are currently available to boost EV adoption throughout the state. The funds are for residential EV charger and installation costs, all-electric fleet vehicles, and charging infrastructure in both the public and private sectors. According to Cristina Botero, senior manager for beneficial electrification at ComEd, the rebate is part of a total investment of $231 million from ComEd as part of its Beneficial Electrification plan programs to promote electrification and EV adoption. While the $231 million won’t be impacted by the Trump administration’s order, other EV projects funded by NEVI are halted. In 2022, for example, $148 million from NEVI was set to be disbursed in Illinois over the course of five years, focusing on Direct Current Fast Charging to fulfill the requirement to build charging stations every 50 miles, according to the Illinois Department of Transportation. “We are still in the process of reviewing the impacts of last week’s order and evaluating next steps going forward,” said Maria Castaneda, spokesperson at IDOT, in an emailed statement. The NEVI funds were also set to help achieve Gov. J.B. Pritzker’s goal to have 1 million EVs on Illinois roads by 2030. Officials estimated that at least 10,000 EV charging stations are needed in order to achieve this 2030 goal. Last fall, there were 1,200 charging stations open to the public. In January, Illinois was awarded federal funds totaling $114 million from the US Department of Transportation to build 14 truck charging hubs, adding to the statewide charging infrastructure. According to Brian Urbaszewski, director of environmental health programs for the Respiratory Health Association, most of that funding is either frozen or at risk. However, programs like the recent ComEd rebate will not be impacted. “This is at the state level and not dictated by federal policy,” Botero said. Maryland In Maryland, state officials are trying to assess the fallout and find alternative ways to keep EV infrastructure efforts alive. The outcome hinges on new federal guidance and potential legal battles over the suspension. Maryland is allocated $63 million over five years under NEVI. The Maryland Department of Transportation (MDOT) launched the first $12.1 million round last summer to build 126 fast-charging ports at 22 sites across many of the state’s counties. At least some are expected to be operational by late 2025. In December, MDOT issued a new call for proposals for building up to 29 additional highway charging stations, expecting stable federal support. At the time, senior MDOT officials told Inside Climate News they were confident in the program’s security since it was authorized under law. But Trump’s funding pause has upended those plans. “The Maryland Department of Transportation is moving forward with its obligated NEVI funding and is awaiting new guidance from the U.S. Department of Transportation to advance future funding rounds,” said Carter Elliott, a spokesperson for Gov. Wes Moore, in an emailed statement. The Moore administration reaffirmed its commitment to EV expansion, calling charging essential to reducing consumer costs and cutting climate pollution. “Gov. Moore is committed to making the state more competitive by pressing forward with the administration’s strategy to deliver charging infrastructure for clean cars to drivers across the state,” the statement added. In written comments, an MDOT spokesperson said the agency is determining its options for future funding needs and solicitations. Katherine García, director of the Sierra Club’s Clean Transportation for All program, said that freezing the EV charging funds was an unsound and illegal move by the Trump administration. “This is an attack on bipartisan funding that Congress approved years ago and is driving investment and innovation in every state,” she said. She said that the NEVI program is helping the US build out the infrastructure needed to support the transition to vehicles that don’t pollute the air. The Sierra Club’s Josh Stebbins lamented the slow pace of the EV charger buildout across the state. “We are not sure when Maryland's NEVI chargers will be operational,” he said. “States must move faster and accelerate the installation of NEVI stations. It has been frustratingly slow, and the public needs to see a return on its investment.” Maryland EV ambitions are high stakes. Transportation remains the state’s largest source of greenhouse gas emissions, and public officials and advocates see EV adoption as critical to meet its net-zero carbon goal by 2045. NEVI is also a key plank of the state’s broader Zero Emission Vehicle Infrastructure Planning initiative, designed to accelerate the transition away from fossil fuels. What happens next As litigation is brought over the Trump administration’s pause on NEVI funds, experts like Turnbull of the Alliance for Transportation Electrification believe the United States remains, despite this bump, on the road toward electrification. “We are not shifting into reverse,” Turnbull said. “The EV market will continue to grow across all market segments driven by market innovation and consumer demand, both within the United States and globally. By pretending the EV transition doesn’t exist, this administration risks the US’s global competitiveness, national security, and economic growth.” 249 Comments",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/02/0227_EZ_flagship_charging_1250-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n            \u003carticle data-id=\"2076399\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \n\n      \n\n      \u003cp\u003e\n        Electric charging projects have been thrown into chaos by the administration\u0026#39;s directive.\n      \u003c/p\u003e\n\n      \n    \u003c/div\u003e\n\n    \u003cdiv\u003e\n    \n    \u003cp\u003e\n      A row of happy EVs charge with no drama, no phone calls to the support line, and no one shuffling spots.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Roberto Baldwin\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n  \u003c/div\u003e\n\u003c/header\u003e\n\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \n\u003cp\u003e\u003cem\u003eThis article originally appeared on \u003c/em\u003e\u003ca href=\"https://insideclimatenews.org/news/13022025/trump-national-ev-charging-program/\"\u003e\u003cem\u003eInside Climate News\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, a nonprofit, non-partisan news organization that covers climate, energy and the environment. Sign up for their newsletter \u003c/em\u003e\u003ca href=\"https://insideclimatenews.org/newsletter/\"\u003e\u003cem\u003ehere\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eFor now, Priester’s will have to stick to its famous pecans in Fort Payne, Alabama. But maybe not for long.\u003c/p\u003e\n\u003cp\u003ePriester’s Pecans, an Alabama staple, is one of more than half a dozen sites across the state slated to receive millions of dollars in federal funding to expand access to chargers for electric vehicles.\u003c/p\u003e\n\u003cp\u003eAcross the country, the National Electric Vehicle Infrastructure (NEVI) program, part of the 2021 Infrastructure Investment and Jobs Act signed into law under then-President Joe Biden, is set to provide $5 billion to states for projects that expand the nation’s EV charging infrastructure.\u003c/p\u003e\n\u003cp\u003eBut in a \u003ca href=\"https://www.fhwa.dot.gov/environment/nevi/resources/state-plan-approval-suspension.pdf\" target=\"_blank\" rel=\"noopener\"\u003eFebruary 6 letter\u003c/a\u003e, a Trump administration official notified state directors of transportation that, effectively, they can’t spend it. The Federal Highway Administration rescinded guidance on the funds, which had been allocated by Congress, and “is also immediately suspending the approval of all State Electric Vehicle Infrastructure Deployment plans for all fiscal years,” the letter said.\u003c/p\u003e\n\u003cp\u003e“Therefore, effective immediately, no new obligations may occur under the NEVI Formula Program until the updated final NEVI Formula Program Guidance is issued and new State plans are submitted and approved.”\u003c/p\u003e\n\u003cp\u003ePOLITICO \u003ca href=\"https://subscriber.politicopro.com/article/2025/02/states-can-keep-spending-400m-in-obligated-charger-funds-dot-says-00203917\" target=\"_blank\" rel=\"noopener\"\u003ereported\u003c/a\u003e on Wednesday that a DOT spokesman said in an email that states were free to use a small portion of the funding—about $400 million—because that was money the states had already “obligated,” or awarded to subcontractors. But that would still leave close to 90 percent of the funding up in the air.\u003c/p\u003e\n\u003cp\u003eEven before the administration had issued its letter, some Republican-led states, including Alabama, had already announced pauses to their states’ implementation of the national EV charging program.\u003c/p\u003e\n\u003cp\u003e“In response to Unleashing American Energy, one of several Executive Orders that President Trump signed on January 20, 2025, the Alabama Department of Economic and Community Affairs has paused the National Electric Vehicle Infrastructure (NEVI) Program as of January 28, 2025,” the Alabama agency responsible for implementing NEVI posted on its website. “In addition, for applications for funding that were originally due on March 17, 2025, ADECA has closed the application window until further notice.”\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eDespite the announcement by the Trump administration, however, legal experts and those familiar with the electric charging program at issue say the president does not have the power to permanently nix the NEVI program.\u003c/p\u003e\n\u003cp\u003e“NEVI funding was appropriated by Congress as part of the bipartisan infrastructure law, and it cannot be canceled by the executive branch,” said Elizabeth Turnbull, director of policy and regulatory affairs at the Alliance for Transportation Electrification, a trade group for the electric vehicle industry. “It’s not clear that the secretary of transportation has the authority to revoke states’ NEVI plans, and it’s quite clear that the executive branch lacks the authority to withhold the funding for any sustained period. So, we expect recent executive branch actions to be successfully challenged in court.”\u003c/p\u003e\n\u003cp\u003eEven under the most aggressive arguments for a strong executive branch, the Supreme Court has stated clearly that the Constitution gives Congress the sole authority to appropriate and legislate.\u003c/p\u003e\n\u003cp\u003eLawmakers, too, have weighed in on the legality of the Trump administration’s NEVI directive, saying officials acted with \u003ca href=\"https://www.epw.senate.gov/public/_cache/files/b/f/bfb99545-ceba-42ed-80ac-3cdda7855020/012D9694373E7500106BBE8799AA29B0DECA07811DB44E6F295D9CC181E3D401.2.11.25-dot-nevi-funding.pdf\" target=\"_blank\" rel=\"noopener\"\u003e“blatant disregard for the law.”\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eIn a letter to administration officials, Democratic members of the Senate Committee on Environment and Public Works urged the Department of Transportation to retract its February 6 letter and “implement the law according to your responsibilities.”\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"597\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/02/estimated-federal-spending-on-ev-chargers-nbsp--640x597.png\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/02/estimated-federal-spending-on-ev-chargers-nbsp--640x597.png 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/02/estimated-federal-spending-on-ev-chargers-nbsp--1024x955.png 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/02/estimated-federal-spending-on-ev-chargers-nbsp--768x716.png 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/02/estimated-federal-spending-on-ev-chargers-nbsp--980x914.png 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/02/estimated-federal-spending-on-ev-chargers-nbsp-.png 1220w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eThe Democrats’ letter also asked for responses to questions about the legal basis for the action and for information about the involvement of individuals associated with Elon Musk’s so-called “Department of Government Efficiency.” DOGE is not an official department, and multiple reports show that Musk’s team has been \u003ca href=\"https://abcnews.go.com/Politics/elon-musks-government-dismantling-fight-stop/story?id=118576033\" target=\"_blank\" rel=\"noopener\"\u003edismantling\u003c/a\u003e parts or all of \u003ca href=\"https://apnews.com/article/trump-musk-usaid-c0c7799be0b2fa7cad4c806565985fe2\" target=\"_blank\" rel=\"noopener\"\u003esome federal agencies\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eTesla, Musk’s electric vehicle company, currently has the largest network of fast chargers in the country. It’s not yet clear if any new policies on NEVI, or the pause on building out a more robust network for all EV drivers, could benefit Tesla.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThe Department of Transportation, the Federal Highway Administration’s parent agency, did not respond to a request for comment.\u003c/p\u003e\n\u003cp\u003eWith or without NEVI, the move toward the electrification of transportation is inevitable, experts say. But they warn that although the administration’s pause of the program will likely be reversed by the courts, even a temporary delay in EV charging infrastructure can harm the nation’s ability to quickly and efficiently transition to electric vehicles. And the Trump administration ignored an earlier court order to lift a broad freeze on federal funds, a \u003ca href=\"https://www.bbc.com/news/articles/c07kr292k8go\" target=\"_blank\" rel=\"noopener\"\u003efederal judge ruled this week\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eMeanwhile, Trump’s NEVI freeze has sown confusion across the country, with EV stakeholders and state governments scrambling to figure out what the funding pause will mean and how to respond.\u003c/p\u003e\n\u003cp\u003eBeyond Alabama, interviews across the country found officials in deep red Wyoming contemplating a possible return of funds, while those in progressive states like Illinois and Maryland remain firmly committed to the EV buildout, with or without federal funding. In purple North Carolina, officials are in limbo, having already spent some NEVI funds, but not sure how to proceed with the next round of projects.\u003c/p\u003e\n\n\u003ch2\u003eAlabama\u003c/h2\u003e\n\u003cp\u003eIn Alabama, officials had already announced plans to fund more than a dozen chargers at sites across the state along interstates and major highways, including installing two dual-port chargers at eight Love’s Travel Stops and another at Priester’s Pecans off I-65 in Fort Deposit.\u003c/p\u003e\n\u003cp\u003eAt the time, state officials, including Republican Gov. Kay Ivey, praised the funding.\u003c/p\u003e\n\u003cp\u003e“Having strategic electric vehicle charging stations across Alabama not only benefits EV drivers, but it also benefits those companies that produce electric vehicles, including many of them right here in Alabama, resulting in more high-paying jobs for Alabamians,” Ivey said when the funding allocation was announced in July 2024. “This latest round of projects will provide added assurance that Alabamians and travelers to our state who choose electric vehicles can travel those highways and know a charging station is within a reliable distance on their routes.”\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eIn total, Alabama was set to receive $79 million in funding through the program, including $2.4 million to expand training programs for the installation, testing, operation, and maintenance of EVs and EV chargers at Bevill State Community College in the central part of the state. The college did not respond to a request for comment on whether the money had been disbursed to the institution before the announced pause.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"726\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/02/Screenshot-2025-02-14-at-15-36-19-Ala.AlternateFuelCorridors700px.png-PNG-Image-700-%C3%97-821-pixels-640x726.png\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/02/Screenshot-2025-02-14-at-15-36-19-Ala.AlternateFuelCorridors700px.png-PNG-Image-700-×-821-pixels-640x726.png 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/02/Screenshot-2025-02-14-at-15-36-19-Ala.AlternateFuelCorridors700px.png-PNG-Image-700-×-821-pixels.png 700w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eIn an email exchange this week, a spokesperson for the Alabama Department of Economic and Community Affairs confirmed what the agency had posted to its website in the wake of Trump’s inauguration—that the state would pause NEVI projects and await further guidance from the Trump administration.\u003c/p\u003e\n\u003cp\u003eEven with a pause, however, stakeholders in Alabama and across the country have expressed a commitment to continuing the expansion of electric vehicle charging infrastructure.\u003c/p\u003e\n\u003cp\u003eFor its part, Love’s Travel Stops, a 42-state chain that had been set to receive more than $5.8 million in funding for EV chargers in Alabama alone, said it will continue to roll out electric chargers at locations nationwide.\u003c/p\u003e\n\u003cp\u003e“Love’s remains committed to meeting customers’ needs regardless of fuel type and believes a robust electric vehicle charging network is a part of that,” Kim Okafor, general manager of zero emissions for Love\u0026#39;s, said in an emailed statement. “Love’s will continue to monitor related executive orders and subsequent changes in law to determine the next steps. This includes the Alabama Department of Transportation’s Electric Vehicle charging plan timelines.”\u003c/p\u003e\n\u003cp\u003eThe state of Alabama, meanwhile, has its own EV charger program apart from NEVI that has already funded millions of dollars worth of charging infrastructure.\u003c/p\u003e\n\u003cp\u003eIn January, even after its announced pause of NEVI implementation, the Alabama Department of Economic and Community Affairs announced the awarding of six grants totaling $2.26 million from state funds for the construction of EV chargers in Huntsville, Hoover, Tuscaloosa, and Mobile.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003e“The installation of electric vehicle charging stations at places like hotels are investments that can attract customers and add to local economies,” ADECA Director Kenneth Boswell said at the time.\u003c/p\u003e\n\n\u003ch2\u003eNorth Carolina\u003c/h2\u003e\n\u003cp\u003eIn North Carolina, the full buildout of the state’s electric charging network under NEVI is in limbo just four months after the NC Department of Transportation announced the initial recipients of the funds.\u003c/p\u003e\n\u003cp\u003eNC DOT spokesman Jamie Kritzer said that based on the federal government’s directive, the agency is continuing with awarded projects but “pausing” the next round of requests for proposals, as well as future phases of the buildout.\u003c/p\u003e\n\u003cp\u003eIf that pause were to become permanent, the state would be forced to abandon $103 million in federal infrastructure money that would have paid for an additional 41 stations to be built as part of Phase 1.\u003c/p\u003e\n\u003cp\u003eLast September the state announced it had \u003ca href=\"https://www.ncdot.gov/news/press-releases/Pages/2024/2024-09-11-cooper-announces-first-awards-electric-vehicle-charging-program.aspx\" target=\"_blank\" rel=\"noopener\"\u003eawarded nearly $6 million \u003c/a\u003eto six companies to build nine public charging stations. Locations include shopping centers, travel plazas, and restaurants, most of them in economically disadvantaged communities.\u003c/p\u003e\n\u003cp\u003eNEVI requires EV charging stations in the first phase to be installed every 50 miles along the federally \u003ca href=\"https://www.ncdot.gov/initiatives-policies/environmental/climate-change/Documents/alternative-fuel-corridors.pdf%23search=alternative%20fuel%20corridors\" target=\"_blank\" rel=\"noopener\"\u003eapproved alternative fuel corridors\u003c/a\u003e, and that they be within one mile of those routes. The state has also prioritized Direct Current Fast Charging (DCFC) stations, which can charge a vehicle to 80 percent in 20 to 30 minutes.\u003c/p\u003e\n\u003cp\u003eThe NEVI program is structured to reimburse private companies for up to 80 percent of the cost to construct and operate electric vehicle charging stations for five years, after which the charging stations will continue to operate without government support, according to the state DOT.\u003c/p\u003e\n\u003cp\u003eThe state estimated it would have taken two to three years to finish Phase 1.\u003c/p\u003e\n\u003cp\u003eUnder Phase 2, the state would award federal funds to build community-level electric vehicle charging stations, farther from the major highways, including in disadvantaged communities.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThat is particularly important in North Carolina, which has the \u003ca href=\"https://carolinademography.cpc.unc.edu/2023/05/30/15-things-we-learned-from-the-new-2020-census-data/\" target=\"_blank\" rel=\"noopener\"\u003esecond-largest rural population\u003c/a\u003e in the US in terms of percentage. A third of the state’s residents live in rural areas, which are underserved by electric vehicle charging stations.\u003c/p\u003e\n\u003cp\u003eThere are already more than 1,700 public electric charging stations and 4,850 ports in North Carolina, according to the\u003ca href=\"https://afdc.energy.gov/stations/states\" target=\"_blank\" rel=\"noopener\"\u003e US Department of Energy’s Alternative Fuels Data Center\u003c/a\u003e. But they aren’t evenly dispersed throughout the state. Alleghany and Ashe counties, in the western mountains, have just one charging station each.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"333\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/02/Screenshot-2025-02-14-at-15-38-24-NCAlternateFuelCorridors750px.png-PNG-Image-750-%C3%97-413-pixels-640x333.png\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/02/Screenshot-2025-02-14-at-15-38-24-NCAlternateFuelCorridors750px.png-PNG-Image-750-×-413-pixels-640x333.png 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/02/Screenshot-2025-02-14-at-15-38-24-NCAlternateFuelCorridors750px.png-PNG-Image-750-×-413-pixels.png 750w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eVickie Atkinson, who lives in the country between Chapel Hill and Pittsboro in central North Carolina, drives a plug-in hybrid Ford Escape, which is powered by an electric engine or gas, unlike full electric models, which have no gas option. Plug-in hybrids typically have fully electric ranges of 35 to 40 miles.\u003c/p\u003e\n\u003cp\u003e“I try to drive on battery whenever possible,” Atkinson said. But she’s frustrated that she can’t drive from her home to downtown Siler City and back—a 60-mile round trip—without resorting to the gas engine. There are two chargers on the outskirts along US 64—only one of them is a fast charger—but none downtown.\u003c/p\u003e\n\u003cp\u003e“I really hope the chargers are installed,” Atkinson said. “I fear they won’t and I find that very frustrating.”\u003c/p\u003e\n\u003cp\u003eFormer Gov. Roy Cooper, a Democrat, advocated for wider adoption of electric vehicles and infrastructure. In a 2018 executive order, Cooper established a benchmark of 80,000 registered zero-emission vehicles in the state by 2025.\u003c/p\u003e\n\u003cp\u003eNorth Carolina met that goal. State DOT registration data shows there were 81,658 electric vehicles and 24,457 plug-in hybrids as of September, the latest figures available.\u003c/p\u003e\n\u003cp\u003eCooper issued a subsequent executive order in 2022 that set a more aggressive goal: 1.2 million registered electric vehicles by 2030. At the current pace of electric vehicle adoption, it’s unlikely the state will achieve that benchmark.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThe electric vehicle industry is an economic driver in North Carolina. Toyota just opened a $13.9 billion battery plant in the small town of Liberty and says it will create about 5,100 new jobs. The company is scheduled to begin shipping batteries in April.\u003c/p\u003e\n\u003cp\u003eNatron Energy is building a plant in Edgecombe County, east of Raleigh, to manufacture sodium-ion batteries for electric vehicles. Experts say they are cheaper and environmentally superior to lithium-ion batteries and less likely to catch fire, \u003ca href=\"https://www.technologyreview.com/2023/05/09/1072738/this-abundant-material-could-unlock-cheaper-batteries-for-evs/\" target=\"_blank\" rel=\"noopener\"\u003ealthough they store less energy\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe global company \u003ca href=\"https://kempower.com/news/kempower-grand-opening-in-durham-north-carolina/\" target=\"_blank\" rel=\"noopener\"\u003eKempower\u003c/a\u003e opened its first North American factory in Durham, where it builds charging infrastructure. Jed Routh, its vice president of markets and products for North America, said that while “the rapidly shifting market is difficult to forecast and interest in electric vehicles may slow at times over the next four years, we don’t expect it to go away. We believe that the industry will remain strong and Kempower remains committed to define, produce, and improve EV charging infrastructure throughout North America.”\u003c/p\u003e\n\u003cp\u003eNorth Carolina does have a separate funding source for electric charging stations that is protected from the Trump administration’s program cuts and cancellations. The state received $92 million from Volkswagen, part of the EPA’s multi-billion-dollar national settlement in 2016 with the car company, which had installed software in some of its diesel cars to cheat on emissions tests.\u003c/p\u003e\n\u003cp\u003eThe Department of Environmental Quality used the settlement money to pay for 994 EV charging ports at 318 sites in North Carolina. The agency expects to add more charging stations with $1.8 million in unspent settlement funds.\u003c/p\u003e\n\u003cp\u003eElectrify America was created by the Volkswagen Group of America to implement a $2 billion portion of the settlement. It required the car company to invest in electric charging infrastructure and in the promotion of electric and plug-in hybrid vehicles.\u003c/p\u003e\n\u003cp\u003eElectrify America operates 20 charging NEVI-compliant, high-speed stations in North Carolina, using the settlement money. However, the funding pause could affect the company because it works with potential site developers and small businesses to comply with the NEVI requirements.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThe company is still reviewing the details in the federal memo, company spokeswoman Tara Geiger said.\u003c/p\u003e\n\u003cp\u003e“Electrify America continues to engage with stakeholders to understand developments impacting the National Electric Vehicle Infrastructure program,” Geiger wrote in an email. “We remain committed to growing our coast-to-coast Hyper-Fast network to support transportation electrification.”\u003c/p\u003e\n\n\u003ch2\u003eWyoming\u003c/h2\u003e\n\u003cp\u003eIn Wyoming, Doug McGee, a state Department of Transportation spokesperson, said the agency is taking a wait and see approach to NEVI moving forward, and is not ruling out a return of funding. About half a dozen people at the department handle NEVI along with other daily responsibilities, McGee said, and it will be easy for them to put NEVI on hold while they await further instruction.\u003c/p\u003e\n\u003cp\u003eThe department was in the process of soliciting proposals for EV charging stations and has not yet spent any money under NEVI. “There was very little to pause,” McGee said.\u003c/p\u003e\n\u003cp\u003eAcross 6,800 miles of highway in Wyoming, there are 110 public EV charging stations, making the state’s EV infrastructure the third-smallest in the country, ahead of charging networks in only North Dakota and Alaska.\u003c/p\u003e\n\u003ch2\u003eIllinois\u003c/h2\u003e\n\u003cp\u003eMore progressive states, including Illinois, have explicitly said they will redouble their efforts to support the expansion of EV charging infrastructure in the wake of the Trump administration’s NEVI pause.\u003c/p\u003e\n\u003cp\u003eThe state of Illinois has said it remains committed to the goal of helping consumers and the public sector transition to EVs in 2025 through state funding sources, even if some NEVI projects are halted.\u003c/p\u003e\n\u003cp\u003eCommonwealth Edison Co. (ComEd), the largest electric utility in Illinois and the primary electric provider in Chicago, also \u003ca href=\"https://www.comed.com/news/news-releases/2025-02-06\" target=\"_blank\" rel=\"noopener\"\u003eannounced a $100 million rebate program\u003c/a\u003e on Feb. 6 at the Chicago Auto Show, funds that are currently available to boost EV adoption throughout the state.\u003c/p\u003e\n\u003cp\u003eThe funds are for residential EV charger and installation costs, all-electric fleet vehicles, and charging infrastructure in both the public and private sectors.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eAccording to Cristina Botero, senior manager for beneficial electrification at ComEd, the rebate is part of a total investment of $231 million from ComEd as part of its Beneficial Electrification plan programs to promote electrification and EV adoption.\u003c/p\u003e\n\u003cp\u003eWhile the $231 million won’t be impacted by the Trump administration’s order, other EV projects funded by NEVI are halted. In 2022, for example, $148 million from NEVI was set to be disbursed in Illinois over the course of five years, focusing on Direct Current Fast Charging to fulfill the requirement to build charging stations every 50 miles, \u003ca href=\"https://idot.illinois.gov/transportation-system/environment/drive-electric.html\" target=\"_blank\" rel=\"noopener\"\u003eaccording to the Illinois Department of Transportation.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e“We are still in the process of reviewing the impacts of last week’s order and evaluating next steps going forward,” said Maria Castaneda, spokesperson at IDOT, in an emailed statement.\u003c/p\u003e\n\u003cp\u003eThe NEVI funds were also set to help achieve Gov. J.B. Pritzker’s goal to have 1 million EVs on Illinois roads by 2030. Officials estimated that at least 10,000 EV charging stations are needed in order to achieve this 2030 goal. Last fall, there were 1,200 charging stations open to the public.\u003c/p\u003e\n\u003cp\u003eIn January, \u003ca href=\"https://gov-pritzker-newsroom.prezly.com/gov-pritzker-announces-new-electric-vehicle-charging-wins-for-illinois\" target=\"_blank\" rel=\"noopener\"\u003eIllinois was awarded\u003c/a\u003e federal funds totaling $114 million from the US Department of Transportation to build 14 truck charging hubs, adding to the statewide charging infrastructure.\u003c/p\u003e\n\u003cp\u003eAccording to Brian Urbaszewski, director of environmental health programs for the Respiratory Health Association, most of that funding is either frozen or at risk.\u003c/p\u003e\n\u003cp\u003eHowever, programs like the recent ComEd rebate will not be impacted. “This is at the state level and not dictated by federal policy,” Botero said.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eMaryland\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eIn Maryland, state officials are trying to assess the fallout and find alternative ways to keep EV infrastructure efforts alive. The outcome hinges on new federal guidance and potential legal battles over the suspension.\u003c/p\u003e\n\u003cp\u003eMaryland is allocated $63 million over five years under NEVI. The Maryland Department of Transportation (MDOT) launched the first $12.1 million round last summer to build 126 fast-charging ports at 22 sites across many of the state’s counties. At least some are expected to be operational by late 2025.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n\n        \n        \u003cdiv\u003e\n          \n          \n\u003cp\u003eIn December, MDOT issued a new call for proposals for building up to 29 additional highway charging stations, expecting stable federal support. At the time, senior MDOT officials \u003ca href=\"https://insideclimatenews.org/news/19122024/maryland-ev-charging-federal-grants/\"\u003etold\u003c/a\u003e Inside Climate News they were confident in the program’s security since it was authorized under law.\u003c/p\u003e\n\u003cp\u003eBut Trump’s funding pause has upended those plans.\u003c/p\u003e\n\u003cp\u003e“The Maryland Department of Transportation is moving forward with its obligated NEVI funding and is awaiting new guidance from the U.S. Department of Transportation to advance future funding rounds,” said Carter Elliott, a spokesperson for Gov. Wes Moore, in an emailed statement.\u003c/p\u003e\n\u003cp\u003eThe Moore administration reaffirmed its commitment to EV expansion, calling charging essential to reducing consumer costs and cutting climate pollution. “Gov. Moore is committed to making the state more competitive by pressing forward with the administration’s strategy to deliver charging infrastructure for clean cars to drivers across the state,” the statement added.\u003c/p\u003e\n\u003cp\u003eIn written comments, an MDOT spokesperson said the agency is determining its options for future funding needs and solicitations.\u003c/p\u003e\n\u003cp\u003eKatherine García, director of the Sierra Club’s Clean Transportation for All program, said that freezing the EV charging funds was an unsound and illegal move by the Trump administration. “This is an attack on bipartisan funding that Congress approved years ago and is driving investment and innovation in every state,” she said.\u003c/p\u003e\n\u003cp\u003eShe said that the NEVI program is helping the US build out the infrastructure needed to support the transition to vehicles that don’t pollute the air.\u003c/p\u003e\n\u003cp\u003eThe Sierra Club’s Josh Stebbins lamented the slow pace of the EV charger buildout across the state. “We are not sure when Maryland\u0026#39;s NEVI chargers will be operational,” he said. “States must move faster and accelerate the installation of NEVI stations. It has been frustratingly slow, and the public needs to see a return on its investment.”\u003c/p\u003e\n\u003cp\u003eMaryland EV ambitions are high stakes. Transportation remains the state’s largest source of greenhouse gas emissions, and public officials and advocates see EV adoption as critical to meet its net-zero carbon goal by 2045. NEVI is also a key plank of the state’s broader Zero Emission Vehicle Infrastructure Planning initiative, designed to accelerate the transition away from fossil fuels.\u003c/p\u003e\n\u003ch2\u003eWhat happens next\u003c/h2\u003e\n\u003cp\u003eAs litigation is brought over the Trump administration’s pause on NEVI funds, experts like Turnbull of the Alliance for Transportation Electrification believe the United States remains, despite this bump, on the road toward electrification.\u003c/p\u003e\n\u003cp\u003e“We are not shifting into reverse,” Turnbull said. “The EV market will continue to grow across all market segments driven by market innovation and consumer demand, both within the United States and globally. By pretending the EV transition doesn’t exist, this administration risks the US’s global competitiveness, national security, and economic growth.”\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\n\n                  \n          \n\n\n\n\n\n\n  \u003cdiv\u003e\n          \u003cp\u003e\u003ca href=\"https://arstechnica.com/author/insideclimatenews/\"\u003e\u003cimg src=\"https://arstechnica.com/wp-content/uploads/2022/09/inside-climate-news-logo.jpeg\" alt=\"Photo of Inside Climate News\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\n\n\n  \u003cp\u003e\n    \u003ca href=\"https://arstechnica.com/tech-policy/2025/02/trump-has-thrown-a-wrench-into-a-national-ev-charging-program/#comments\" title=\"249 comments\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 80 80\"\u003e\u003cdefs\u003e\u003cclipPath id=\"bubble-zero_svg__a\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"bubble-zero_svg__b\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#bubble-zero_svg__a)\"\u003e\u003cg fill=\"currentColor\" clip-path=\"url(#bubble-zero_svg__b)\"\u003e\u003cpath d=\"M80 40c0 22.09-17.91 40-40 40S0 62.09 0 40 17.91 0 40 0s40 17.91 40 40\"\u003e\u003c/path\u003e\u003cpath d=\"M40 40 .59 76.58C-.67 77.84.22 80 2.01 80H40z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n    249 Comments\n  \u003c/a\u003e\n      \u003c/p\u003e\n              \u003c/div\u003e\n  \u003c/article\u003e\n\n\n  \n\n\n  \n\n\n  \u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003ca href=\"https://arstechnica.com/gaming/2025/02/the-diablo-hackers-that-debunked-a-record-speedrun/\"\u003e\n              \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/02/diablo-debunk-768x432.jpg\" alt=\"Listing image for first story in Most Read: How Diablo hackers uncovered a speedrun scandal\" decoding=\"async\" loading=\"lazy\"/\u003e\n            \u003c/a\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n\n\n  \n\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "25 min read",
  "publishedTime": "2025-02-15T12:07:10Z",
  "modifiedTime": "2025-02-15T00:05:43Z"
}
