{
  "id": "0d73cf30-b00d-43af-b070-a8948ba15fc2",
  "title": "De-extinction company provides a progress report on thylacine efforts",
  "link": "https://arstechnica.com/science/2024/10/effort-to-bring-back-the-tasmanian-tiger-builds-steam/",
  "description": "Stem cell editing, complete genome, and cane toad resistance mark necessary steps.",
  "author": "John Timmer",
  "published": "Tue, 22 Oct 2024 23:13:12 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Science",
    "Biology",
    "de-extinction",
    "dunnart",
    "evolution",
    "Genetics",
    "Genomics",
    "marsupials",
    "thylacine"
  ],
  "byline": "John Timmer",
  "length": 8619,
  "excerpt": "Stem cell editing, complete genome, and cane toad resistance mark necessary steps.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Stem cell editing, complete genome, and cane toad resistance mark necessary steps. Colossal, the company founded to try to restore the mammoth to the Arctic tundra, has also decided to tackle a number of other species that have gone extinct relatively recently: the dodo and the thylacine. Because of significant differences in biology, not the least of which is the generation time of Proboscideans, these other efforts may reach many critical milestones well in advance of the work on mammoths. Late last week, Colossal released a progress report on the work involved in resurrecting the thylacine, also known as the Tasmanian tiger, which went extinct when the last known survivor died in a zoo in 1936. Marsupial biology has some features that may make de-extinction somewhat easier, but we have far less sophisticated ways of manipulating it compared to the technology we've developed for working with the stem cells and reproduction of placental mammals. But, based on these new announcements, the technology available for working with marsupials is expanding rapidly. Cane toad resistance Colossal has branched out from its original de-extinction mission to include efforts to keep species from ever needing its services. In the case of marsupial predators, the de-extinction effort is incorporating work that will benefit existing marsupial predators: generating resistance to the toxins found on the cane toad, an invasive species that has spread widely across Australia. The primary threat from cane toads comes from bufotoxins, a group of related, complicated chemicals that bind to a protein found on the surface of cells called ATP1A1, which helps control the traffic of ions across the cell membrane. Andrew Pask, who is leading Colossal's marsupial efforts, told Ars that animals in the cane toad's native range in Africa share a mutation in ATP1A1 that greatly reduces bufotoxin binding. Now, the team has engineered that change into the genome of a marsupial stem cell line and showed that it boosted resistance by a factor of over 6,000. (A manuscript describing some of this work is available.) For the de-extinction process, the goal would be to ensure that the thylacine could survive in the presence of the cane toad. But Colossal has branched out into a conservation effort, called the Colossal foundation, that aims to keep threatened species from needing its services in the future. As part of that effort, the research team has generated stem cell lines from a surviving Australian carnivore, the quoll, which has become officially endangered largely due to cane toad ingestion. The goal is to ultimately engineer can toad resistance into the quoll stem cells and get the gene circulating with the wild population, allowing them to survive contact with their invasive neighbors. Key changes Meanwhile, that edit and more has been going on in stem cells derived from the fat-tailed dunnart, the closest living relative of the thylacine. Pask's team is announcing that they've made over 300 distinct edits in its genome. Ben Lamm, Colossal's CEO, told Ars that they've worked out ways of doing more edits at once without off-target effects (where editing occurs in the wrong location) and have been doing multiple rounds of editing in a single cell line. What those edits are has been the product of several efforts. To begin with, Colossal has obtained a nearly complete genome sequence from a thylacine sample that was preserved in ethanol a bit over a century ago. According to Pask, this sample contains both the short fragments typical of older DNA samples (typically just a few hundred base pairs long), but also some DNA molecules that were above 10,000 bases long. This allowed them to do both short- and long-read sequencing, leaving them with just 45 gaps in the total genome sequence, which the team expects to close shortly. This is exceptionally complete for an extinct species and can help provide a greater degree of confidence that the team has identified all the DNA differences between the thylacine and its closest living relatives. The same sample also provided something that's almost impossible to get from extinct species: messenger RNA molecules, the products of active genes. By analyzing these molecules in specific tissues (the sample was limited to the animal's head), we can get a picture of what genes were active in the adult animal. \"By looking in the adult tissues it can inform us about the expression of olfactory receptors and its sense of smell, taste receptors and its sense of taste, eye gene expression can inform us about its vision spectrum, and brain samples can inform us about brain function,\" Pask said. The team has also identified a set of genes that may be involved in craniofacial development by reasoning that the similarity between a thylacine's head and that of a wolf might be due to some similar genetic changes. So they looked for regions where dogs, wolves, and thylacines have picked up a large number of changes, suggesting that evolution may be selecting for something new. They've identified multiple “Thylacine Wolf Accelerated Regions” or TWARs, which were all segments of DNA that controlled the activity of nearby genes. They started by confirming that these could drive gene activity in bone cells. They then chose three TWARs from the thylacine genome and swapped them into the equivalent locations in the mouse genome. They did cause differences in craniofacial development, despite the roughly 150 million years separating the different lineages. Unfortunately, the details of this work haven't been published yet. Ex utero? The final thing the company announced was that it was working on getting dunnart embryos to develop outside of the womb. Marsupials are born at a point that's roughly only halfway through normal mouse development—all the organs are in place, but haven't matured—and finish developing in their mother's pouch. Rather than working with surrogate dunnart parents for a much larger thylacine, Pask's team is considering trying to get them to develop to birth in an artificial uterus. And they say they're making progress, getting dunnart embryos to get about two-thirds of the way through a normal pregnancy. At this point, they've got immature neural cells and have started forming the cells that will go on to form muscles and the vertebrae. But many critical events need to happen in the remaining one-third of the pregnancy, and Colossal isn't ready to talk about what goes wrong to stop development here. And when asked about how the embryos were kept during their earlier development, Lamm said, \"We are not sharing much about this at this time.\" It's a bit frustrating that more details on this work aren't available. It's nice to know that progress is being made on a very risky project, but one of the better ways to reduce risk is to have other labs validate the things you're doing along the way. Some of this information, such as the DNA segments involved in craniofacial development, would be of general interest to developmental biologists. Hopefully, over time, the company will continue to submit some of its work to peer-reviewed journals. In the meantime, the clear indications of progress suggest that some of the unique features of the marsupials—relatively rapid generation times, accessible reproductive system, and many similarities to well-studied placental mammals—are helping this project move ahead at a reasonably rapid clip. That's not a guarantee it'll get all the way to something resembling a thylacine. But if it doesn't, then it will at least help us understand why de-extinction doesn't work sooner than work on the mammoth will. John is Ars Technica's science editor. He has a Bachelor of Arts in Biochemistry from Columbia University, and a Ph.D. in Molecular and Cell Biology from the University of California, Berkeley. When physically separated from his keyboard, he tends to seek out a bicycle, or a scenic location for communing with his hiking boots.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/GettyImages-629464499.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n            \u003carticle data-id=\"2057864\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \n\n      \n\n      \u003cp\u003e\n        Stem cell editing, complete genome, and cane toad resistance mark necessary steps.\n      \u003c/p\u003e\n\n      \n    \u003c/div\u003e\n\n          \u003cdiv\u003e\n        \u003cp\u003e\u003cimg width=\"1000\" height=\"1000\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/10/GettyImages-629464499-1000x1000-1729635923.jpg\" alt=\"Image of a dog-sized animal with stripes near its hind limbs.\" loading=\"eager\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2024/10/GettyImages-629464499-1000x1000-1729635923.jpg 1000w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/GettyImages-629464499-150x150-1729635922.jpg 150w, https://cdn.arstechnica.net/wp-content/uploads/2024/10/GettyImages-629464499-500x500-1729635923.jpg 500w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"/\u003e\n        \u003c/p\u003e\n        \n      \u003c/div\u003e\n      \u003c/div\u003e\n\u003c/header\u003e\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \n\u003cp\u003eColossal, the company founded to try to \u003ca href=\"https://arstechnica.com/science/2024/03/de-extinction-company-manages-to-generate-first-elephant-stem-cells/\"\u003erestore the mammoth\u003c/a\u003e to the Arctic tundra, has also decided to tackle a number of other species that have gone extinct relatively recently: \u003ca href=\"https://arstechnica.com/science/2023/01/the-next-de-extinction-target-the-dodo/\"\u003ethe dodo\u003c/a\u003e and \u003ca href=\"https://arstechnica.com/science/2022/08/de-extinction-company-sets-its-next-first-target-the-thylacine/#page-2\"\u003ethe thylacine\u003c/a\u003e. Because of significant differences in biology, not the least of which is the generation time of Proboscideans, these other efforts may reach many critical milestones well in advance of the work on mammoths.\u003c/p\u003e\n\u003cp\u003eLate last week, Colossal released a progress report on the work involved in resurrecting the thylacine, also known as the Tasmanian tiger, which went extinct when the last known survivor died in a zoo in 1936. Marsupial biology has some features that may make de-extinction somewhat easier, but we have far less sophisticated ways of manipulating it compared to the technology we\u0026#39;ve developed for working with the stem cells and reproduction of placental mammals. But, based on these new announcements, the technology available for working with marsupials is expanding rapidly.\u003c/p\u003e\n\u003ch2\u003eCane toad resistance\u003c/h2\u003e\n\u003cp\u003eColossal has branched out from its original de-extinction mission to include efforts to keep species from ever needing its services. In the case of marsupial predators, the de-extinction effort is incorporating work that will benefit existing marsupial predators: generating resistance to the toxins found on the cane toad, an invasive species that has spread widely across Australia.\u003c/p\u003e\n\u003cp\u003eThe primary threat from cane toads comes from \u003ca href=\"https://en.wikipedia.org/wiki/Bufotoxin\"\u003ebufotoxins\u003c/a\u003e, a group of related, complicated chemicals that bind to a protein found on the surface of cells called ATP1A1, which helps control the traffic of ions across the cell membrane. Andrew Pask, who is leading Colossal\u0026#39;s marsupial efforts, told Ars that animals in the cane toad\u0026#39;s native range in Africa share a mutation in ATP1A1 that greatly reduces bufotoxin binding. Now, the team has engineered that change into the genome of a marsupial stem cell line and showed that it boosted resistance by a factor of over 6,000. (A manuscript describing some of this work \u003ca href=\"https://www.biorxiv.org/content/10.1101/2024.05.07.591791v1\"\u003eis available\u003c/a\u003e.)\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eFor the de-extinction process, the goal would be to ensure that the thylacine could survive in the presence of the cane toad. But Colossal has branched out into a conservation effort, called the Colossal foundation, that aims to keep threatened species from needing its services in the future. As part of that effort, the research team has generated stem cell lines from a surviving Australian carnivore, \u003ca href=\"https://en.wikipedia.org/wiki/Quoll\"\u003ethe quoll\u003c/a\u003e, which has become officially endangered largely due to cane toad ingestion. The goal is to ultimately engineer can toad resistance into the quoll stem cells and get the gene circulating with the wild population, allowing them to survive contact with their invasive neighbors.\u003c/p\u003e\n\u003ch2\u003eKey changes\u003c/h2\u003e\n\u003cp\u003eMeanwhile, that edit and more has been going on in stem cells derived from the \u003ca href=\"https://en.wikipedia.org/wiki/Fat-tailed_dunnart\"\u003efat-tailed dunnart\u003c/a\u003e, the closest living relative of the thylacine. Pask\u0026#39;s team is announcing that they\u0026#39;ve made over 300 distinct edits in its genome. Ben Lamm, Colossal\u0026#39;s CEO, told Ars that they\u0026#39;ve worked out ways of doing more edits at once without off-target effects (where editing occurs in the wrong location) and have been doing multiple rounds of editing in a single cell line.\u003c/p\u003e\n\u003cp\u003eWhat those edits are has been the product of several efforts. To begin with, Colossal has obtained a nearly complete genome sequence from a thylacine sample that was preserved in ethanol a bit over a century ago. According to Pask, this sample contains both the short fragments typical of older DNA samples (typically just a few hundred base pairs long), but also some DNA molecules that were above 10,000 bases long. This allowed them to do both short- and long-read sequencing, leaving them with just 45 gaps in the total genome sequence, which the team expects to close shortly.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThis is exceptionally complete for an extinct species and can help provide a greater degree of confidence that the team has identified all the DNA differences between the thylacine and its closest living relatives.\u003c/p\u003e\n\n\u003cp\u003eThe same sample also provided something that\u0026#39;s almost impossible to get from extinct species: messenger RNA molecules, the products of active genes. By analyzing these molecules in specific tissues (the sample was limited to the animal\u0026#39;s head), we can get a picture of what genes were active in the adult animal. \u0026#34;By looking in the adult tissues it can inform us about the expression of olfactory receptors and its sense of smell, taste receptors and its sense of taste, eye gene expression can inform us about its vision spectrum, and brain samples can inform us about brain function,\u0026#34; Pask said.\u003c/p\u003e\n\u003cp\u003eThe team has also identified a set of genes that may be involved in craniofacial development by reasoning that the similarity between a thylacine\u0026#39;s head and that of a wolf might be due to some similar genetic changes. So they looked for regions where dogs, wolves, and thylacines have picked up a large number of changes, suggesting that evolution may be selecting for something new. They\u0026#39;ve identified multiple “Thylacine Wolf Accelerated Regions” or TWARs, which were all segments of DNA that controlled the activity of nearby genes.\u003c/p\u003e\n\u003cp\u003eThey started by confirming that these could drive gene activity in bone cells. They then chose three TWARs from the thylacine genome and swapped them into the equivalent locations in the mouse genome. They did cause differences in craniofacial development, despite the roughly 150 million years separating the different lineages. Unfortunately, the details of this work haven\u0026#39;t been published yet.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n\n        \n        \u003cdiv\u003e\n          \n          \n\u003ch2\u003eEx utero?\u003c/h2\u003e\n\u003cp\u003eThe final thing the company announced was that it was working on getting dunnart embryos to develop outside of the womb. Marsupials are born at a point that\u0026#39;s roughly only halfway through normal mouse development—all the organs are in place, but haven\u0026#39;t matured—and finish developing in their mother\u0026#39;s pouch. Rather than working with surrogate dunnart parents for a much larger thylacine, Pask\u0026#39;s team is considering trying to get them to develop to birth in an artificial uterus. And they say they\u0026#39;re making progress, getting dunnart embryos to get about two-thirds of the way through a normal pregnancy.\u003c/p\u003e\n\u003cp\u003eAt this point, they\u0026#39;ve got immature neural cells and have started forming the cells that will go on to form muscles and the vertebrae. But many critical events need to happen in the remaining one-third of the pregnancy, and Colossal isn\u0026#39;t ready to talk about what goes wrong to stop development here. And when asked about how the embryos were kept during their earlier development, Lamm said, \u0026#34;We are not sharing much about this at this time.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s a bit frustrating that more details on this work aren\u0026#39;t available. It\u0026#39;s nice to know that progress is being made on a very risky project, but one of the better ways to reduce risk is to have other labs validate the things you\u0026#39;re doing along the way. Some of this information, such as the DNA segments involved in craniofacial development, would be of general interest to developmental biologists. Hopefully, over time, the company will continue to submit some of its work to peer-reviewed journals.\u003c/p\u003e\n\u003cp\u003eIn the meantime, the clear indications of progress suggest that some of the unique features of the marsupials—relatively rapid generation times, accessible reproductive system, and many similarities to well-studied placental mammals—are helping this project move ahead at a reasonably rapid clip. That\u0026#39;s not a guarantee it\u0026#39;ll get all the way to something resembling a thylacine. But if it doesn\u0026#39;t, then it will at least help us understand why de-extinction doesn\u0026#39;t work sooner than work on the mammoth will.\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\n\n                  \n          \u003cdiv\u003e\n  \u003cdiv\u003e\n          \u003cp\u003e\u003ca href=\"https://arstechnica.com/author/john-timmer/\"\u003e\u003cimg src=\"https://arstechnica.com/wp-content/uploads/2016/05/j.timmer-5.jpg\" alt=\"Photo of John Timmer\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\n\n  \u003cdiv\u003e\n    \n\n    \u003cp\u003e\n      John is Ars Technica\u0026#39;s science editor. He has a Bachelor of Arts in Biochemistry from Columbia University, and a Ph.D. in Molecular and Cell Biology from the University of California, Berkeley. When physically separated from his keyboard, he tends to seek out a bicycle, or a scenic location for communing with his hiking boots.\n\n    \u003c/p\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\n\n  \n\n\n  \n\n\n  \n              \u003c/div\u003e\n  \u003c/article\u003e\n\n\n\u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/10/GettyImages-845006454-768x432.jpg\" alt=\"Listing image for first story in Most Read: ByteDance intern fired for planting malicious code in AI models\" decoding=\"async\" loading=\"lazy\"/\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n\n\n  \n\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-10-22T23:13:12Z",
  "modifiedTime": "2024-10-22T23:28:12Z"
}
