{
  "id": "16b0b09a-981a-4f75-bc54-73971f0e5a72",
  "title": "Amazon Rocket Launch for Its Starlink Satellite Service Rival: How to Watch Tonight",
  "link": "https://www.cnet.com/science/space/amazon-rocket-launch-for-its-starlink-satellite-service-rival-how-to-watch-tonight/#ftag=CAD590a51e",
  "description": "Project Kuiper is planning to take a major step forward tonight with its first full-scale satellite launch.",
  "author": "Omar Gallaga",
  "published": "Thu, 10 Apr 2025 00:05:41 +0000",
  "source": "https://www.cnet.com/rss/news/",
  "categories": null,
  "byline": "Omar Gallaga",
  "length": 3935,
  "excerpt": "The weather hampers Project Kuiper's launch, and no new date has been scheduled for its first full-scale satellite launch.",
  "siteName": "CNET",
  "favicon": "https://www.cnet.com/favicon-480.png",
  "text": "Why You Can Trust CNET Our expert, award-winning staff selects the products we cover and rigorously researches and tests our top picks. If you buy through our links, we may get a commission. Reviews ethics statement The weather hampers Project Kuiper's launch, and no new date has been scheduled for its first full-scale satellite launch. Amazon will soon launch 27 low-Earth orbit satellites as part of its Project Kuiper. The original launch window was set for Wednesday between 7 and 9 p.m. ET (4 to 6 p.m. PT), but poor weather forced the rocket launch to be scrubbed for the day.\"Weather is observed and forecast NO GO for liftoff within the remaining launch window at Cape Canaveral this evening, according to Launch Weather Officer Brian Belson,\" United Launch Alliance said in its live updates Wednesday night. \"The stubborn cumulus clouds and persistent winds make liftoff not possible within the available window.\"There's no word yet on when it'll be rescheduled, but there's a mission page for updates on the launch and plans to livestream the takeoff. You can watch the rocket launch live on that page or YouTube.The launch mission, KA-01 or Kuiper Atlas 1, will be on a United Launch Alliance Atlas V rocket and will take place at Cape Canaveral Space Force Station.It'll be a big step forward for the project, which Amazon announced in 2019 with promises of a $10 billion investment. Now the company is poised to enter the race to provide satellite internet service, a space currently dominated by SpaceX's Starlink, which has about 7,000 satellites. Amazon's plans call for 3,200 satellites to be deployed over 80 launches. The company intends to provide internet service with this technology later this year.More competition will improve internet servicesThe literal space race, which includes Starlink, Amazon and other companies such as Viasat, Hughesnet, Eutelsat and China's SpaceSail, could mean more internet service availability in far-flung and rural areas with limited broadband options. Though Starlink is the leader in space, some of these other companies are continuing to launch satellites and working to deploy high-speed internet in more markets, such as Brazil. With more players in the market, that could mean faster and cheaper internet in more areas, although whether that actually bears out for consumers remains to be seen.Mahdi Eslamimehr, executive vice president at Quandary Peak Research and adjunct professor at the Department of Computer Science at USC, said Amazon is well poised to compete with Starlink. \"Amazon has made extensive launch agreements with major providers such as ULA, Arianespace, Blue Origin, and even SpaceX itself, positioning Kuiper as a major challenger due to its expansive infrastructure and significant resources.\"He said, \"While Starlink currently enjoys clear market leadership, it faces increasing competition from well-capitalized and strategically agile competitors, specifically from China,  suggesting the market will become considerably more competitive in the near future.\"So far, Eslamimehr said, Amazon's satellite efforts have been promising and successful, at least in the prototype stages. The company has also been testing Amazon Web Services in space. \"These developments collectively underscore Amazon's robust entry into the satellite internet market and reflect positive early momentum in its overall space strategy.\"Beyond how it fares against Starlink and other companies, the Amazon satellite launches are significant in other ways. Eslamimehr said, \"Project Kuiper isn't just about competition; it's positioned as a critical step toward closing the global digital divide, promising to deliver high-speed internet to underserved communities worldwide.\"Correction, April 4: An earlier version of this story misspelled the name of the USC professor and Quandary Peak Research executive vice president. His name is Mahdi Eslamimehr.",
  "image": "https://www.cnet.com/a/img/resize/474b7af17ed6c2904b09b8fa37f52a077e9675dd/hub/2025/04/03/4e188021-124e-491f-83ea-b567fdae63e8/assets-aboutamazon.jpg?auto=webp\u0026fit=crop\u0026height=675\u0026width=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://www.cnet.com/a/neutron/images/logos/cnet-short.png\" alt=\"CNET logo\"/\u003e \u003cspan\u003eWhy You Can Trust CNET\u003c/span\u003e  \u003c/p\u003e \u003cp\u003e\u003cspan\u003eOur expert, award-winning staff selects the products we cover and rigorously researches and tests our top picks. If you buy through our links, we may get a commission.\u003c/span\u003e \u003cspan\u003e\u003ca href=\"https://www.cnet.com/tech/how-we-test-products-and-services/\"\u003eReviews ethics statement\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e \u003c/div\u003e   \u003cdiv\u003e \u003cp\u003e\n    The weather hampers Project Kuiper\u0026#39;s launch, and no new date has been scheduled for its first full-scale satellite launch.\n  \u003c/p\u003e \u003c/div\u003e \u003c/div\u003e\u003cdiv id=\"article-0c6ec487-60dc-44c3-8844-5a95caefb2f4\"\u003e\u003carticle\u003e\u003cp\u003eAmazon will soon launch \u003cspan\u003e\u003ca href=\"https://www.aboutamazon.com/news/innovation-at-amazon/project-kuiper-satellite-internet-first-launch\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\" section=\"transformed-regular-link\" data-location=\"BODY\"\u003e27 low-Earth orbit satellites\u003c/a\u003e\u003c/span\u003e as part of its \u003ca href=\"https://www.cnet.com/home/internet/amazons-project-kuiper-promised-to-be-a-big-starlink-competitor-when-will-it-be-available/\" target=\"_self\"\u003eProject Kuiper\u003c/a\u003e. The original launch window was set for Wednesday between 7 and 9 p.m. ET (4 to 6 p.m. PT), but poor weather forced the rocket launch to be scrubbed for the day.\u003c/p\u003e\u003cp\u003e\u0026#34;Weather is observed and forecast NO GO for liftoff within the remaining launch window at Cape Canaveral this evening, according to Launch Weather Officer Brian Belson,\u0026#34; United Launch Alliance said in its live updates Wednesday night. \u0026#34;The stubborn cumulus clouds and persistent winds make liftoff not possible within the available window.\u0026#34;\u003c/p\u003e\u003cp\u003eThere\u0026#39;s no word yet on when it\u0026#39;ll be rescheduled, but there\u0026#39;s a \u003ca href=\"https://www.ulalaunch.com/missions/next-launch/atlas-v-kuiper-1#link={%22role%22:%22standard%22,%22href%22:%22https://www.ulalaunch.com/missions/next-launch/atlas-v-kuiper-1%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22mission page for updates%22}\" target=\"_blank\" rel=\"noopener nofollow\" title=\"(opens in a new window)\"\u003emission page for updates\u003c/a\u003e on the launch and plans to livestream the takeoff. You can watch the rocket launch live on that page or \u003ca href=\"https://youtu.be/G8XsTzF90sQ\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003eYouTube\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe launch mission, KA-01 or Kuiper Atlas 1, will be on a United Launch Alliance Atlas V rocket and will take place at Cape Canaveral Space Force Station.\u003c/p\u003e\u003cp\u003eIt\u0026#39;ll be a big step forward for the project, which Amazon announced in 2019 with promises of a \u003ca href=\"https://www.cnet.com/science/project-kuiper-amazon-is-planning-a-massive-satellite-project-to-bring-internet-access-to-millions/\" target=\"_self\"\u003e$10 billion investment\u003c/a\u003e. Now the company is poised to enter the race to provide \u003ca href=\"https://www.cnet.com/home/internet/features/inside-the-rise-of-7000-starlink-satellites-and-their-inevitable-downfall/\" target=\"_self\"\u003esatellite internet service\u003c/a\u003e, a space currently dominated by SpaceX\u0026#39;s \u003ca href=\"https://www.cnet.com/home/internet/starlink-internet-review/\" target=\"_self\"\u003eStarlink\u003c/a\u003e, which has about \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/home/internet/features/inside-the-rise-of-7000-starlink-satellites-and-their-inevitable-downfall/\" rel=\"\"\u003e\u003cspan\u003e7,000 satellites\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e. Amazon\u0026#39;s plans call for 3,200 satellites to be deployed over 80 launches. The company intends to provide \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/home/internet/best-internet-providers/\" rel=\"\"\u003e\u003cspan\u003einternet service\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e with this technology later this year.\u003c/p\u003e\u003ch2\u003eMore competition will improve internet services\u003cbr/\u003e\u003c/h2\u003e\u003cp\u003eThe literal space race, which includes Starlink, Amazon and other companies such as \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/home/internet/viasat-internet-review/\" rel=\"\"\u003e\u003cspan\u003eViasat\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e, \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/home/internet/hughesnet-internet-review/\" rel=\"\"\u003e\u003cspan\u003eHughesnet\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e, Eutelsat and China\u0026#39;s SpaceSail, could mean more internet service availability in far-flung and rural areas with limited broadband options. Though Starlink is the leader in space, some of these other companies are continuing to launch satellites and working to deploy high-speed internet in more markets, such as Brazil. With more players in the market, that could mean faster and \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/home/internet/best-cheap-internet/\" rel=\"\"\u003e\u003cspan\u003echeaper internet\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e in more areas, although whether that actually bears out for consumers remains to be seen.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://quandarypeak.com/software-experts/mahdi-eslamimehr/\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003eMahdi Eslamimehr\u003c/a\u003e, executive vice president at Quandary Peak Research and adjunct professor at the Department of Computer Science at USC, said Amazon is well poised to compete with Starlink. \u0026#34;Amazon has made extensive launch agreements with major providers such as ULA, Arianespace, Blue Origin, and even SpaceX itself, positioning Kuiper as a major challenger due to its expansive infrastructure and significant resources.\u0026#34;\u003c/p\u003e\u003cp\u003eHe said, \u0026#34;While Starlink currently enjoys clear market leadership, it faces increasing competition from well-capitalized and strategically agile competitors, specifically from China,  suggesting the market will become considerably more competitive in the near future.\u0026#34;\u003c/p\u003e\u003cp\u003eSo far, Eslamimehr said, Amazon\u0026#39;s satellite efforts have been promising and successful, at least in the prototype stages. The company has also been testing Amazon Web Services in space. \u0026#34;These developments collectively underscore Amazon\u0026#39;s robust entry into the satellite internet market and reflect positive early momentum in its overall space strategy.\u0026#34;\u003c/p\u003e\u003cp\u003eBeyond how it fares against Starlink and other companies, the Amazon satellite launches are significant in other ways. Eslamimehr said, \u0026#34;Project Kuiper isn\u0026#39;t just about competition; it\u0026#39;s positioned as a critical step toward closing the global digital divide, promising to deliver high-speed internet to underserved communities worldwide.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCorrection, April 4:\u003c/strong\u003e An earlier version of this story misspelled the name of the USC professor and Quandary Peak Research executive vice president. His name is Mahdi Eslamimehr.\u003c/p\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-10T00:55:00Z",
  "modifiedTime": null
}
