{
  "id": "188fd66b-0fda-476c-ac69-671a241cdae0",
  "title": "Jon Bernthal’s Punisher Will Hit the Big Screen in ‘Spider-Man: Brand New Day’",
  "link": "https://gizmodo.com/jon-bernthal-punisher-spider-man-brand-new-day-marvel-mcu-2000618531",
  "description": "The character was most recently seen in Disney+ series 'Daredevil: Born Again.'",
  "author": "Cheryl Eddy",
  "published": "Fri, 20 Jun 2025 22:30:34 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Movies",
    "Jon Bernthal",
    "Punisher",
    "Spider-Man: Brand New Day",
    "The Punisher"
  ],
  "byline": "Cheryl Eddy",
  "length": 1479,
  "excerpt": "The character was most recently seen in Disney+ series 'Daredevil: Born Again.'",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Spider-Man: Brand New Day is starting to take shape at last with a key bit of casting news. Destin Daniel Cretton’s summer 2026 release—the fourth entry in the series centered around Tom Holland’s Spider-Man—has just added Jon Bernthal’s Punisher into the mix. The Hollywood Reporter shared the news, and notes filming is set to begin this summer in England. Bernthal’s character addition is some of the first news fans can grasp onto, as the rest of Brand New Day hasn’t shaken many plot details loose. We know Zendaya will be back as MJ, as will Jacob Batalan as Ned, but considering that mass memory wipe at the end of 2021’s Spider-Man: No Way Home—Peter Parker’s sacrifice to preserve the fragile multiverse—it’s unclear how much they’ll factor into the story. We also don’t know which villains might pop up, or how the Punisher will fit into all of this. THR suggests the character could signal No Way Home will take a more “grounded” approach, but there’s no telling what plans Marvel has for him or Spider-Man, for that matter. The title obviously suggests a clean slate and a new start, so anything could theoretically be possible. What are your thoughts on the Punisher teaming up with Spidey? Spider-Man: Brand New Day thwips into theaters July 31, 2026. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/06/marvelpunisher-1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003e\u003cem\u003eSpider-Man: Brand New Day\u003c/em\u003e is starting to take shape at last with a key bit of casting news. Destin Daniel Cretton’s summer 2026 release—the fourth entry in the series centered around Tom Holland’s Spider-Man—has just added Jon Bernthal’s Punisher into the mix.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.hollywoodreporter.com/movies/movie-news/spider-man-brand-new-day-jon-bernthal-1236296073/\"\u003eThe Hollywood Reporter\u003c/a\u003e shared the news, and notes filming is set to begin this summer in England.\u003c/p\u003e \u003cp\u003eBernthal’s character addition is some of the first news fans can grasp onto, as the rest of \u003cem\u003eBrand New Day\u003c/em\u003e hasn’t shaken many plot details loose. We know Zendaya will be back as MJ, as will Jacob Batalan as Ned, but considering that mass memory wipe at the end of 2021’s \u003cem\u003eSpider-Man: No Way Home\u003c/em\u003e—Peter Parker’s sacrifice to preserve the fragile multiverse—it’s unclear how much they’ll factor into the story.\u003c/p\u003e\n\n \u003cp\u003eWe also don’t know which villains might pop up, or how the Punisher will fit into all of this. THR suggests the character could signal \u003cem\u003eNo Way Home\u003c/em\u003e will take a more “grounded” approach, but there’s no telling what plans Marvel has for him or Spider-Man, for that matter. The title obviously suggests a clean slate and a new start, so anything could theoretically be possible.\u003c/p\u003e \u003cp\u003eWhat are your thoughts on the Punisher teaming up with Spidey? \u003cem\u003eSpider-Man: Brand New Day\u003c/em\u003e thwips into theaters July 31, 2026.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-06-20T22:30:34Z",
  "modifiedTime": "2025-06-20T22:43:28Z"
}
