{
  "id": "1924ef65-faf4-4fcf-8f0e-28126fcb0d2e",
  "title": "Michelle Yeoh’s spy team assembles in Star Trek: Section 31’s official trailer",
  "link": "https://www.theverge.com/2024/12/7/24315722/star-trek-section-31-official-movie-trailer-michelle-yeoh-paramount-plus-streaming",
  "description": "",
  "author": "Wes Davis",
  "published": "2024-12-07T16:16:17-05:00",
  "source": "https://www.theverge.com/rss/index.xml",
  "categories": null,
  "byline": "Wes Davis",
  "length": 992,
  "excerpt": "Yeoh’s Emperor Philippa Georgiou leaves a luxurious space station to face “a threat unlike anything Starfleet’s ever seen.”",
  "siteName": "The Verge",
  "favicon": "https://www.theverge.com/icons/android_chrome_512x512.png",
  "text": "There’s a lot of Star Trek: Discovery in the official trailer for the Star Trek: Section 31 movie that Paramount Plus just released — big drama, explosions, and some looming threat that’s “unlike anything that Starfleet’s ever seen.” The trailer shows off a little more of the film, with moody corridors, some sort of electrified space ball, and brief looks at the spaceships that the show will feature. It also devotes more time to characters besides Michelle Yeoh’s Emperor Philippa Georgiou — namely Omari Hardwick’s Alok Sahar and Kacey Rohl’s future Enterprise C captain, Rachel Garrett. It’s still a mystery what trouble Emperor Philippa is leading her team into, though.Philippa will work with a team that also includes a pointy-eared alien named Fuzz (Sven Ruygrok), an empath named Melle (Humberly Gonzalez), the exoskeleton-wearing Zeph (Rob Kazinsky), and a Chameloid shapeshifter named Quasi (Sam Richardson). Star Trek: Section 31 starts streaming January 24th on Paramount Plus.",
  "image": "https://cdn.vox-cdn.com/thumbor/PZzN3vj4QCmbeMm7iYumG7Xc6DE=/0x0:1827x1264/1200x628/filters:focal(988x384:989x385)/cdn.vox-cdn.com/uploads/chorus_asset/file/25778921/Screenshot_2024_12_07_at_3.06.55_PM.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"zephr-anchor\"\u003e\u003cp\u003eThere’s a lot of \u003cem\u003eStar Trek: Discovery\u003c/em\u003e in the official trailer for the \u003cem\u003eStar Trek: Section 31 \u003c/em\u003emovie that Paramount Plus just released — big drama, explosions, and some looming threat that’s “unlike anything that Starfleet’s ever seen.” \u003c/p\u003e\u003cp\u003eThe trailer shows off a little more of the film, with moody corridors, some sort of electrified space ball, and brief looks at the spaceships that the show will feature. It also devotes more time to characters besides Michelle Yeoh’s Emperor Philippa Georgiou — namely Omari Hardwick’s Alok Sahar and Kacey Rohl’s future Enterprise C captain, Rachel Garrett. It’s still a mystery what trouble Emperor Philippa is leading her team into, though.\u003c/p\u003e\u003cp\u003ePhilippa will \u003ca href=\"https://www.startrek.com/news/meet-the-star-trek-section-31-crew\"\u003ework with a team\u003c/a\u003e that also includes a pointy-eared alien named Fuzz (Sven Ruygrok), an empath named Melle (Humberly Gonzalez), the exoskeleton-wearing Zeph (Rob Kazinsky), and a Chameloid shapeshifter named Quasi (Sam Richardson). \u003cem\u003eStar Trek: Section 31\u003c/em\u003e starts streaming January 24th on Paramount Plus.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-07T21:16:16.811Z",
  "modifiedTime": "2024-12-07T21:16:16.811Z"
}
