{
  "id": "1a7c3ad9-8538-4ca2-abed-5c4f827bea12",
  "title": "Best Internet Providers in Santa Fe, New Mexico",
  "link": "https://www.cnet.com/home/internet/best-internet-providers-in-santa-fe-nm/#ftag=CAD590a51e",
  "description": "Find the best internet provider for you in Santa Fe with help from CNET’s broadband experts. Here's everything you need to know before picking a plan.",
  "author": "Joe Supan",
  "published": "Sun, 29 Dec 2024 00:00:00 +0000",
  "source": "https://www.cnet.com/rss/news/",
  "categories": null,
  "byline": "Joe Supan",
  "length": 10581,
  "excerpt": "Find the best internet provider for you in Santa Fe with help from CNET’s broadband experts. Here's everything you need to know before picking a plan.",
  "siteName": "CNET",
  "favicon": "https://www.cnet.com/favicon-480.png",
  "text": "What is the best internet provider in Santa Fe?Residents of Santa Fe, New Mexico have a few options when it comes to internet service. After reviewing available providers in the region, CNET’s broadband experts picked Xfinity as the best internet provider in Santa Fe -- with both the fastest and cheapest plans in the city. The plans start at $20 a month for 150 megabits per second and go up to $80 for the 1,200Mbps plan. It’s available almost everywhere but be prepared for your monthly bill to spike once you hit your second or third year of service. If you don’t want to worry about those kinds of headaches, T-Mobile guarantees your price won’t increase as long as you maintain service, but its speeds might not be enough for households with a lot of devices using the internet at once. NMSurf is a step down from Xfinity and T-Mobile, but it still provides better value than satellite or DSL service from CenturyLink.Best internet in Santa Fe, New MexicoSanta Fe internet providers compared Provider Internet technologyMonthly price rangeSpeed rangeMonthly equipment costsData capContractCNET review score CenturyLink Read full review DSL$55Up to 100Mbps$15 (optional)NoneNone6.7NMSurf Fixed wireless$60-$105100-400Mbps$10-$15None1-2 years (optional)NA T-Mobile Home Internet Read full review Fixed wireless$50-$70 ($40-$50 with eligible mobile plans)72-245MbpsNoneNoneNone7.4 Verizon 5G Home Internet Read full review Fixed wireless$50-$70 ($35-$45 for eligible Verizon Wireless customers)85-1,000MbpsNoneNoneNone7.2 Xfinity Read full review Cable$20-$80150-1,200Mbps$15 (waived on most plans)Unlimited with Xfinity equipmentOptional7 Show more (1 item) Source: CNET analysis of provider dataOther available internet providers in Santa FeCenturyLink: CenturyLink only offers DSL plans in Santa Fe, which is considered a slower type of connection. Speeds go up to 100Mbps, which is a decent option for smaller households, but can be much lower depending on your address. I’d still recommend going with NMSurf if you can’t get Xfinity or T-Mobile, but CenturyLink is a significant step up from the satellite providers. Satellite internet: Typically reserved for rural areas without any other options, satellite providers like HughesNet and Viasat offer service everywhere in Santa Fe, but there’s not much to recommend about them. They’re more expensive than the other options, and slow speeds and data caps make things like streaming and video conferencing difficult. Starlink is a faster option with unlimited data, but it’s $120 a month with an upfront equipment cost of $499 that's discounted to $299 right now.Verizon 5G Home Internet: If it was more widely available, Verizon would easily be one of our top picks in Santa Fe. It offers some of the fastest speeds in the city at reasonable prices, but it’s currently only available to 9% of households. Cheap internet options in Santa FeThere are four internet plans available in Santa Fe for $50 a month or less. That’s less than nearby cities like Albuquerque and Colorado Springs. Xfinity’s Connect is currently the cheapest plan you'll find at just $20 per month, but when you factor in the $15 monthly equipment the 300Mbps Connect More plan is the same price.What’s the cheapest internet plan in Santa Fe? Provider Starting priceMax download speedMonthly equipment fee Xfinity Connect Read full review $20150Mbps$15 Xfinity Connect More Read full review $35300MbpsNone T-Mobile Home Internet Read full review $50 ($40 with eligible mobile plans)245MbpsNone Verizon 5G Home Internet Read full review $50 ($35 with eligible mobile plans)300MbpsNone Show more (0 item) Source: CNET analysis of provider dataHow to find internet deals and promotions in Santa FeThe best internet deals and the top promotions in Santa Fe depend on what discounts are available during that time. Most deals are short-lived, but we look frequently for the latest offers.  How many members of your household use the internet? Santa Fe internet providers such as Xfinity may offer lower introductory pricing or streaming add-ons for a limited time. Many, including T-Mobile and NMSurf, run the same standard pricing year-round. For a more extensive list of deals, check out our guide to the best internet deals. How fast is Santa Fe broadband?Santa Fe residents don’t have as many options for high-speed internet plans as other cities of its size. Only Xfinity and Verizon offer gig speeds, and the latter is only available to about 1 in 10 residents. Most houses can make do with much less than 1,000Mbps of download speed, although 40Mbps of upload speed may still be limiting for houses with multiple people videoconferencing or online gaming.Fastest internet plans in Santa Fe Provider Starting priceMax download speedMax upload speedData capConnection type Xfinity Gigabit Extra Read full review $801,200Mbps40MbpsNoneNone Xfinity Gigabit Read full review $651,000Mbps20MbpsNoneNone Verizon 5G Home Plus Internet Read full review $70 ($45 with qualifying Verizon 5G mobile plans)1,000Mbps75MbpsNoneFixed wireless Show more (0 item) Source: CNET analysis of provider dataWhat’s a good internet speed?Most internet connection plans can now handle basic productivity and communication tasks. If you're looking for an internet plan that can accommodate videoconferencing, streaming video or gaming, you'll have a better experience with a more robust connection. Here's an overview of the recommended minimum download speeds for various applications, according to the FCC. Note that these are only guidelines and that internet speed, service and performance vary by connection type, provider and address.For more information, refer to our guide on how much internet speed you really need.0 to 5Mbps allows you to tackle the basics: browsing the internet, sending and receiving email and streaming low-quality video.5 to 40Mbps gives you higher-quality video streaming and videoconferencing.40 to 100Mbps should give one user sufficient bandwidth to satisfy the demands of modern telecommuting, video streaming and online gaming. 100 to 500Mbps allows one to two users to engage in high-bandwidth activities like videoconferencing, streaming and online gaming simultaneously. 500 to 1,000Mbps allows three or more users to engage in high-bandwidth activities like videoconferencing, streaming and online gaming simultaneously.How CNET chose the best internet providers in Santa FeInternet service providers are numerous and regional. Unlike the latest smartphone, laptop, router or kitchen tool, it's impractical to personally test every internet service provider in a given city. What's our approach? For starters, we tap into a proprietary database of pricing, availability and speed information that draws from our own historical ISP data, partner data and mapping information from the Federal Communications Commission at FCC.gov. This guide leverages an in-house artificial intelligence tool called RAMP, which is trained on our own writing and uses our database to generate content about specific internet service providers that our writers can use in determining and presenting our picks for a given guide. Check CNET’s AI policy for more information about how our teams use (and don’t use) AI tools. Because our database is not exhaustive, we go to the FCC’s website to check the primary data for ourselves and make sure we’re considering every ISP that provides service in an area. Plans and prices also vary by location, so we input local addresses on provider websites to find the specific options available to residents. We look at sources, including the American Customer Satisfaction Index and J.D. Power, to evaluate how happy customers are with an ISP's service. ISP plans and prices are subject to frequent changes; all information provided is accurate as of the time of our pre-publication fact-check.Once we have this localized information, we ask three main questions: Does the provider offer access to reasonably fast internet speeds? Do customers get decent value for what they're paying? Are customers happy with their service? While the answer to those questions is often layered and complex, the providers who come closest to “yes” on all three are the ones we recommend. When it comes to selecting the cheapest internet service, we look for the plans with the lowest monthly fee, although we also factor in things like price increases, equipment fees and contracts. Choosing the fastest internet service is relatively straightforward. We look at advertised upload and download speeds and also take into account real-world speed data from sources like Ookla and FCC reports. (Disclaimer: Ookla is owned by the same parent company as CNET, Ziff Davis.)To explore our process in more depth, you can visit our How we test ISPs page.What’s the final word on internet providers in Santa Fe?Santa Fe has limited internet options for a city of its size. Xfinity is the best internet provider by a mile -- it offers both the cheapest and fastest plans in the area and customers are generally happy with its service. If you can’t get Xfinity -- or you’re just sick of its post-promo-period price hikes -- T-Mobile is a solid backup option, with speeds up to 245Mbps for a flat $50 a month. NMSurf is a step down from T-Mobile and Xfinity, but the local provider still offers better value than DSL or satellite options. Internet providers in Santa Fe FAQs What is the best internet service provider in Santa Fe? Xfinity is the best internet service provider in Santa Fe, with six cable internet plans with speeds up to 1,200 Mbps and prices ranging from $20 to $80 monthly. Prices increase after one or two years on all plans. T-Mobile's fixed wireless service is also available in Santa Fe, with speeds up to 245 Mbps and for $50 per month with no equipment fees, data caps or contracts.  Is fiber internet available in Santa Fe? Quantum Fiber and NMSurf both offer fiber internet service in Santa Fe, but only 3% of households can currently access it, according to FCC data. Who is the cheapest internet provider in Santa Fe? Xfinity is the cheapest internet provider in Santa Fe, with plans starting at $20 per month for 150Mbps excluding equipment fees.  Which internet provider in Santa Fe offers the fastest plan? Xfinity offers the fastest plan in Santa Fe, with download speeds up to 1,200 Mbps and upload speeds up to 40Mbps. Internet Providers by City Internet Providers and Services Helpful Internet Resources",
  "image": "https://www.cnet.com/a/img/resize/a9d8d5b4d2a7fa70cc2dfd51a77b9e9ac03e0dae/hub/2023/10/03/a52b6d5a-8545-4ca2-9c0a-878879499164/gettyimages-175420387.jpg?auto=webp\u0026fit=crop\u0026height=675\u0026width=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-73ec14c2-4ebf-405a-9a40-b642826f607f\"\u003e \u003cdiv\u003e\u003ch2 id=\"27b34979-f84e-407b-b28e-f71c66bc150a\" data-ng-block=\"{\" id\":\"t975f66aumcvt9l\",\"type\":\"heading\"}\"=\"\"\u003eWhat is the best internet provider in Santa Fe?\u003c/h2\u003e\u003cp\u003eResidents of Santa Fe, New Mexico have a few options when it comes to internet service. After reviewing available providers in the region, CNET’s broadband experts picked \u003ca target=\"_self\" data-id=\"02d5ff64-39f0-4c53-9e3b-d652600a7a0b\" href=\"https://www.cnet.com/home/internet/xfinity-internet-review/\"\u003e\u003cstrong\u003eXfinity\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e as the best internet provider in Santa Fe\u003c/strong\u003e -- with both the fastest and cheapest plans in the city. The plans start at $20 a month for 150 megabits per second and go up to $80 for the 1,200Mbps plan. It’s available almost everywhere but be prepared for your monthly bill to spike once you hit your second or third year of service. \u003c/p\u003e\u003cp\u003eIf you don’t want to worry about those kinds of headaches, \u003ca target=\"_self\" data-id=\"84813f55-152b-496f-a903-efd86bc4745f\" href=\"https://www.cnet.com/home/internet/t-mobile-5g-home-internet-review/\"\u003eT-Mobile\u003c/a\u003e guarantees your price won’t increase as long as you maintain service, but its speeds might not be enough for households with a lot of devices using the internet at once. NMSurf is a step down from Xfinity and T-Mobile, but it still provides better value than satellite or DSL service from \u003ca target=\"_self\" data-id=\"90a44667-18e1-4cce-b79d-350dbf4384ab\" href=\"https://www.cnet.com/home/internet/centurylink-internet-review/\"\u003eCenturyLink\u003c/a\u003e.\u003c/p\u003e\u003ch2 id=\"27b34979-f84e-407b-b28e-f71c66bc150a\" data-ng-block=\"{\" id\":\"l8tzf1af7mc08mq\",\"type\":\"heading\"}\"=\"\"\u003eBest internet in Santa Fe, New Mexico\u003c/h2\u003e\u003cfigure section=\"table\"\u003e\u003ch2 id=\"e9f0266d-d85c-4272-95b5-4a7fb84bb646\"\u003eSanta Fe internet providers compared\u003c/h2\u003e  \u003cdiv tabindex=\"0\"\u003e\u003ctable aria-label=\"Santa Fe internet providers compared\"\u003e \u003ctbody\u003e\u003ctr\u003e\u003cth\u003e\u003cstrong\u003eProvider\u003c/strong\u003e\u003c/th\u003e \u003ctd\u003e\u003cstrong\u003eInternet technology\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eMonthly price range\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eSpeed range\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eMonthly equipment costs\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eData cap\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eContract\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eCNET review score\u003c/strong\u003e\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003cth\u003e \u003cspan\u003eCenturyLink\u003cbr/\u003e\u003c/span\u003e \u003ca href=\"https://www.cnet.com/home/home-internet/centurylink-internet-review/\"\u003eRead full review\u003c/a\u003e\u003c/th\u003e \u003ctd\u003eDSL\u003c/td\u003e\u003ctd\u003e$55\u003c/td\u003e\u003ctd\u003eUp to 100Mbps\u003c/td\u003e\u003ctd\u003e$15 (optional)\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003ctd\u003e6.7\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003cth\u003eNMSurf\u003c/th\u003e \u003ctd\u003eFixed wireless\u003c/td\u003e\u003ctd\u003e$60-$105\u003c/td\u003e\u003ctd\u003e100-400Mbps\u003c/td\u003e\u003ctd\u003e$10-$15\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003ctd\u003e1-2 years (optional)\u003c/td\u003e\u003ctd\u003eNA\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003cth\u003e \u003cspan\u003eT-Mobile Home Internet\u003cbr/\u003e\u003c/span\u003e \u003ca href=\"https://www.cnet.com/home/home-internet/t-mobile-5g-home-internet-review/\"\u003eRead full review\u003c/a\u003e\u003c/th\u003e \u003ctd\u003eFixed wireless\u003c/td\u003e\u003ctd\u003e$50-$70 ($40-$50 with eligible mobile plans)\u003c/td\u003e\u003ctd\u003e72-245Mbps\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003ctd\u003e7.4\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003cth\u003e \u003cspan\u003eVerizon 5G Home Internet\u003cbr/\u003e\u003c/span\u003e \u003ca href=\"https://www.cnet.com/home/home-internet/verizon-internet-review/\"\u003eRead full review\u003c/a\u003e\u003c/th\u003e \u003ctd\u003eFixed wireless\u003c/td\u003e\u003ctd\u003e$50-$70 ($35-$45 for eligible Verizon Wireless customers)\u003c/td\u003e\u003ctd\u003e85-1,000Mbps\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003ctd\u003e7.2\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003cth\u003e \u003cspan\u003eXfinity\u003cbr/\u003e\u003c/span\u003e \u003ca href=\"https://www.cnet.com/home/home-internet/xfinity-internet-review/\"\u003eRead full review\u003c/a\u003e\u003c/th\u003e \u003ctd\u003eCable\u003c/td\u003e\u003ctd\u003e$20-$80\u003c/td\u003e\u003ctd\u003e150-1,200Mbps\u003c/td\u003e\u003ctd\u003e$15 (waived on most plans)\u003c/td\u003e\u003ctd\u003eUnlimited with Xfinity equipment\u003c/td\u003e\u003ctd\u003eOptional\u003c/td\u003e\u003ctd\u003e7\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e \u003c/table\u003e  \u003c/div\u003e \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eShow more (1 item)\u003c/span\u003e\u003c/p\u003e\u003csvg\u003e\u003cuse href=\"#hero-chevron-up\"\u003e\u003c/use\u003e\u003c/svg\u003e\u003c/div\u003e \u003c/figure\u003e\u003cp\u003eSource: CNET analysis of provider data\u003c/p\u003e\u003ch2 id=\"27b34979-f84e-407b-b28e-f71c66bc150a\" data-ng-block=\"{\" id\":\"d7y8lcqzhmafh4p\",\"type\":\"heading\"}\"=\"\"\u003eOther available internet providers in Santa Fe\u003c/h2\u003e\u003cul data-ng-block=\"{\" id\":\"pc44bohqq07fd25\",\"type\":\"unordered-list\"}\"=\"\"\u003e\u003cli\u003e\u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/home/internet/centurylink-internet-review/\"\u003e\u003cstrong\u003eCenturyLink\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e: \u003c/strong\u003eCenturyLink only offers DSL plans in Santa Fe, which is considered a slower type of connection. Speeds go up to 100Mbps, which is a decent option for smaller households, but can be much lower depending on your address. I’d still recommend going with NMSurf if you can’t get Xfinity or T-Mobile, but CenturyLink is a significant step up from the satellite providers. \u003c/li\u003e\u003cli\u003e\u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/home/internet/best-satellite-internet/\"\u003e\u003cstrong\u003eSatellite internet\u003c/strong\u003e\u003c/a\u003e: Typically reserved for rural areas without any other options, satellite providers like \u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/home/internet/hughesnet-vs-viasat/\"\u003eHughesNet and Viasat\u003c/a\u003e offer service everywhere in Santa Fe, but there’s not much to recommend about them. They’re more expensive than the other options, and slow speeds and data caps make things like streaming and video conferencing difficult. \u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/home/internet/starlink-internet-review/\"\u003eStarlink\u003c/a\u003e is a faster option with unlimited data, but it’s $120 a month with an upfront equipment cost of $499 that\u0026#39;s discounted to $299 right now.\u003c/li\u003e\u003cli\u003e\u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/home/internet/verizon-5g-home-internet-review/\"\u003e\u003cstrong\u003eVerizon 5G Home Internet\u003c/strong\u003e\u003c/a\u003e: If it was more widely available, Verizon would easily be one of our top picks in Santa Fe. It offers some of the fastest speeds in the city at reasonable prices, but it’s currently only available to 9% of households. \u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"27b34979-f84e-407b-b28e-f71c66bc150a\" data-ng-block=\"{\" id\":\"ygjiqplw1fvb3iz\",\"type\":\"heading\"}\"=\"\"\u003eCheap internet options in Santa Fe\u003c/h2\u003e\u003cp\u003eThere are four internet plans available in Santa Fe for $50 a month or less. That’s less than nearby cities like \u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/home/internet/best-internet-providers-in-albuquerque-nm/\"\u003eAlbuquerque\u003c/a\u003e and \u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/home/internet/best-internet-providers-in-colorado-springs-co/\"\u003eColorado Springs\u003c/a\u003e. Xfinity’s Connect is currently the cheapest plan you\u0026#39;ll find at just $20 per month, but when you factor in the $15 monthly equipment the 300Mbps Connect More plan is the same price.\u003c/p\u003e\u003cfigure section=\"table\"\u003e\u003ch2 id=\"54e0e6c2-a690-4170-aa82-b9085c4a8b16\"\u003eWhat’s the cheapest internet plan in Santa Fe?\u003c/h2\u003e  \u003cdiv tabindex=\"0\"\u003e\u003ctable aria-label=\"What’s the cheapest internet plan in Santa Fe?\"\u003e \u003ctbody\u003e\u003ctr\u003e\u003cth\u003e\u003cstrong\u003eProvider\u003c/strong\u003e\u003c/th\u003e \u003ctd\u003e\u003cstrong\u003eStarting price\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eMax download speed\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eMonthly equipment fee\u003c/strong\u003e\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003cth\u003e \u003cspan\u003eXfinity Connect\u003cbr/\u003e\u003c/span\u003e \u003ca href=\"https://www.cnet.com/home/home-internet/xfinity-internet-review/\"\u003eRead full review\u003c/a\u003e\u003c/th\u003e \u003ctd\u003e$20\u003c/td\u003e\u003ctd\u003e150Mbps\u003c/td\u003e\u003ctd\u003e$15\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003cth\u003e \u003cspan\u003eXfinity Connect More\u003cbr/\u003e\u003c/span\u003e \u003ca href=\"https://www.cnet.com/home/home-internet/xfinity-internet-review/\"\u003eRead full review\u003c/a\u003e\u003c/th\u003e \u003ctd\u003e$35\u003c/td\u003e\u003ctd\u003e300Mbps\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003cth\u003e \u003cspan\u003eT-Mobile Home Internet\u003cbr/\u003e\u003c/span\u003e \u003ca href=\"https://www.cnet.com/home/home-internet/t-mobile-5g-home-internet-review/\"\u003eRead full review\u003c/a\u003e\u003c/th\u003e \u003ctd\u003e$50 ($40 with eligible mobile plans)\u003c/td\u003e\u003ctd\u003e245Mbps\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003cth\u003e \u003cspan\u003eVerizon 5G Home Internet\u003cbr/\u003e\u003c/span\u003e \u003ca href=\"https://www.cnet.com/home/home-internet/verizon-internet-review/\"\u003eRead full review\u003c/a\u003e\u003c/th\u003e \u003ctd\u003e$50 ($35 with eligible mobile plans)\u003c/td\u003e\u003ctd\u003e300Mbps\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e \u003c/table\u003e  \u003c/div\u003e \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eShow more (0 item)\u003c/span\u003e\u003c/p\u003e\u003csvg\u003e\u003cuse href=\"#hero-chevron-up\"\u003e\u003c/use\u003e\u003c/svg\u003e\u003c/div\u003e \u003c/figure\u003e\u003cp\u003eSource: CNET analysis of provider data\u003c/p\u003e\u003ch2 id=\"27b34979-f84e-407b-b28e-f71c66bc150a\" data-ng-block=\"{\" id\":\"cnsqe9nnfxw529l\",\"type\":\"heading\"}\"=\"\"\u003eHow to find internet deals and promotions in Santa Fe\u003c/h2\u003e\u003cp\u003eThe best internet deals and the top promotions in Santa Fe depend on what discounts are available during that time. Most deals are short-lived, but we look frequently for the latest offers. \u003c/p\u003e\u003cdiv\u003e\u003csvg\u003e\u003cuse xlink:href=\"#close\"\u003e\u003c/use\u003e\u003c/svg\u003e \u003cdiv\u003e \u003cp\u003eHow many members of your household use the internet?\u003c/p\u003e  \u003cul\u003e\u003cli\u003e\u003clabel for=\"people-0\"\u003e \u003c/label\u003e\u003c/li\u003e\u003cli\u003e\u003clabel for=\"people-1\"\u003e \u003c/label\u003e\u003c/li\u003e\u003cli\u003e\u003clabel for=\"people-2\"\u003e \u003c/label\u003e\u003c/li\u003e\u003cli\u003e\u003clabel for=\"people-3\"\u003e \u003c/label\u003e\u003c/li\u003e\u003c/ul\u003e  \u003c/div\u003e\u003c/div\u003e\u003cp\u003eSanta Fe internet providers such as Xfinity may offer lower introductory pricing or streaming add-ons for a limited time. Many, including T-Mobile and NMSurf, run the same standard pricing year-round. \u003c/p\u003e\u003cp\u003eFor a more extensive list of deals, check out our guide to the \u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/deals/best-internet-deals/\"\u003ebest internet deals\u003c/a\u003e. \u003c/p\u003e\u003ch2 id=\"27b34979-f84e-407b-b28e-f71c66bc150a\" data-ng-block=\"{\" id\":\"ddo7js22yoiifyv\",\"type\":\"heading\"}\"=\"\"\u003eHow fast is Santa Fe broadband?\u003c/h2\u003e\u003cp\u003eSanta Fe residents don’t have as many options for high-speed internet plans as other cities of its size. Only Xfinity and Verizon offer gig speeds, and the latter is only available to about 1 in 10 residents. Most houses can make do with much less than 1,000Mbps of download speed, although 40Mbps of upload speed may still be limiting for houses with multiple people videoconferencing or online gaming.\u003c/p\u003e\u003cfigure section=\"table\"\u003e\u003ch2 id=\"26357e5f-c9fc-4a00-9130-4bd7d25a57b3\"\u003eFastest internet plans in Santa Fe\u003c/h2\u003e  \u003cdiv tabindex=\"0\"\u003e\u003ctable aria-label=\"Fastest internet plans in Santa Fe\"\u003e \u003ctbody\u003e\u003ctr\u003e\u003cth\u003e\u003cstrong\u003eProvider\u003c/strong\u003e\u003c/th\u003e \u003ctd\u003e\u003cstrong\u003eStarting price\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eMax download speed\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eMax upload speed\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eData cap\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003eConnection type\u003c/strong\u003e\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003cth\u003e \u003cspan\u003eXfinity Gigabit Extra\u003cbr/\u003e\u003c/span\u003e \u003ca href=\"https://www.cnet.com/home/home-internet/xfinity-internet-review/\"\u003eRead full review\u003c/a\u003e\u003c/th\u003e \u003ctd\u003e$80\u003c/td\u003e\u003ctd\u003e1,200Mbps\u003c/td\u003e\u003ctd\u003e40Mbps\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003cth\u003e \u003cspan\u003eXfinity Gigabit\u003cbr/\u003e\u003c/span\u003e \u003ca href=\"https://www.cnet.com/home/home-internet/xfinity-internet-review/\"\u003eRead full review\u003c/a\u003e\u003c/th\u003e \u003ctd\u003e$65\u003c/td\u003e\u003ctd\u003e1,000Mbps\u003c/td\u003e\u003ctd\u003e20Mbps\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003cth\u003e \u003cspan\u003eVerizon 5G Home Plus Internet\u003cbr/\u003e\u003c/span\u003e \u003ca href=\"https://www.cnet.com/home/home-internet/verizon-internet-review/\"\u003eRead full review\u003c/a\u003e\u003c/th\u003e \u003ctd\u003e$70 ($45 with qualifying Verizon 5G mobile plans)\u003c/td\u003e\u003ctd\u003e1,000Mbps\u003c/td\u003e\u003ctd\u003e75Mbps\u003c/td\u003e\u003ctd\u003eNone\u003c/td\u003e\u003ctd\u003eFixed wireless\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e \u003c/table\u003e  \u003c/div\u003e \u003cdiv\u003e\u003cp\u003e\u003cspan\u003eShow more (0 item)\u003c/span\u003e\u003c/p\u003e\u003csvg\u003e\u003cuse href=\"#hero-chevron-up\"\u003e\u003c/use\u003e\u003c/svg\u003e\u003c/div\u003e \u003c/figure\u003e\u003cp\u003eSource: CNET analysis of provider data\u003c/p\u003e\u003ch2 id=\"27b34979-f84e-407b-b28e-f71c66bc150a\" data-ng-block=\"{\" id\":\"dlnfu8zzyeraznv\",\"type\":\"heading\"}\"=\"\"\u003eWhat’s a good internet speed?\u003c/h2\u003e\u003cp\u003eMost internet connection plans can now handle basic productivity and communication tasks. If you\u0026#39;re looking for an internet plan that can accommodate videoconferencing, streaming video or gaming, you\u0026#39;ll have a better experience with a more robust connection. Here\u0026#39;s an overview of the recommended minimum download speeds for various applications, \u003ca target=\"_blank\" rel=\"noopener nofollow\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.fcc.gov/consumers/guides/broadband-speed-guide\" title=\"(opens in a new window)\"\u003eaccording to the FCC\u003c/a\u003e. Note that these are only guidelines and that internet speed, service and performance vary by connection type, provider and address.\u003c/p\u003e\u003cp\u003eFor more information, refer to our guide on \u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/home/internet/how-much-internet-speed-do-you-really-need/\"\u003ehow much internet speed you really need\u003c/a\u003e.\u003c/p\u003e\u003cul data-ng-block=\"{\" id\":\"ihl7p8ofdvfa2f4\",\"type\":\"unordered-list\"}\"=\"\"\u003e\u003cli\u003e0 to 5Mbps allows you to tackle the basics: browsing the internet, sending and receiving email and streaming low-quality video.\u003c/li\u003e\u003cli\u003e5 to 40Mbps gives you higher-quality video streaming and videoconferencing.\u003c/li\u003e\u003cli\u003e40 to 100Mbps should give one user sufficient bandwidth to satisfy the demands of modern telecommuting, video streaming and online gaming. \u003c/li\u003e\u003cli\u003e100 to 500Mbps allows one to two users to engage in high-bandwidth activities like videoconferencing, streaming and online gaming simultaneously. \u003c/li\u003e\u003cli\u003e500 to 1,000Mbps allows three or more users to engage in high-bandwidth activities like videoconferencing, streaming and online gaming simultaneously.\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"27b34979-f84e-407b-b28e-f71c66bc150a\" data-ng-block=\"{\" id\":\"u2u5q73miridv3b\",\"type\":\"heading\"}\"=\"\"\u003eHow CNET chose the best internet providers in Santa Fe\u003c/h2\u003e\u003cp\u003eInternet service providers are numerous and regional. Unlike the latest \u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/tech/mobile/best-phone/\"\u003esmartphone\u003c/a\u003e, \u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/tech/computing/i-tried-an-ar-laptop-way-ahead-of-its-time/\"\u003elaptop\u003c/a\u003e, \u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/home/internet/best-wi-fi-router/\"\u003erouter\u003c/a\u003e or \u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/home/kitchen-and-household/how-to-use-kitchen-shears/\"\u003ekitchen tool\u003c/a\u003e, it\u0026#39;s impractical to personally test every internet service provider in a given city. What\u0026#39;s our approach? For starters, we tap into a proprietary database of pricing, availability and speed information that draws from our own historical ISP data, partner data and mapping information from the Federal Communications Commission at FCC.gov. \u003c/p\u003e\u003cp\u003eThis guide leverages an in-house artificial intelligence tool called RAMP, which is trained on our own writing and uses our database to generate content about specific internet service providers that our writers can use in determining and presenting our picks for a given guide. Check \u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/ai-policy/\"\u003eCNET’s AI policy\u003c/a\u003e for more information about how our teams use (and don’t use) AI tools. \u003c/p\u003e\u003cp\u003eBecause our database is not exhaustive, we go to the FCC’s website to check the primary data for ourselves and make sure we’re considering every ISP that provides service in an area. Plans and prices also vary by location, so we input local addresses on provider websites to find the specific options available to residents. We look at sources, including the American Customer Satisfaction Index and J.D. Power, to evaluate how happy customers are with an ISP\u0026#39;s service. ISP plans and prices are subject to frequent changes; all information provided is accurate as of the time of our pre-publication fact-check.\u003c/p\u003e\u003cp\u003eOnce we have this localized information, we ask three main questions: \u003c/p\u003e\u003col data-ng-block=\"{\" id\":\"xsqooyz8xgrwfmf\",\"type\":\"ordered-list\"}\"=\"\"\u003e\u003cli\u003eDoes the provider offer access to reasonably fast internet speeds? \u003c/li\u003e\u003cli\u003eDo customers get decent value for what they\u0026#39;re paying? \u003c/li\u003e\u003cli\u003eAre customers happy with their service? \u003c/li\u003e\u003c/ol\u003e\u003cp\u003eWhile the answer to those questions is often layered and complex, the providers who come closest to “yes” on all three are the ones we recommend. When it comes to selecting the cheapest internet service, we look for the plans with the lowest monthly fee, although we also factor in things like price increases, equipment fees and contracts. Choosing the fastest internet service is relatively straightforward. We look at advertised upload and download speeds and also take into account real-world speed data from sources like \u003ca target=\"_blank\" rel=\"noopener nofollow\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.speedtest.net/global-index/united-states#fixed\" title=\"(opens in a new window)\"\u003eOokla\u003c/a\u003e and \u003ca target=\"_blank\" rel=\"noopener nofollow\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.fcc.gov/reports-research/reports/measuring-broadband-america/measuring-fixed-broadband-twelfth-report\" title=\"(opens in a new window)\"\u003eFCC reports\u003c/a\u003e. (Disclaimer: Ookla is owned by the same parent company as CNET, Ziff Davis.)\u003c/p\u003e\u003cp\u003eTo explore our process in more depth, you can visit our \u003ca target=\"_self\" data-id=\"88402575-681c-4350-b2ce-4aec2cd8ffe0\" href=\"https://www.cnet.com/home/internet/how-we-review-internet-service-providers/\"\u003eHow we test ISPs\u003c/a\u003e page.\u003c/p\u003e\u003ch2 id=\"27b34979-f84e-407b-b28e-f71c66bc150a\" data-ng-block=\"{\" id\":\"3783yepl04yaw15\",\"type\":\"heading\"}\"=\"\"\u003eWhat’s the final word on internet providers in Santa Fe?\u003c/h2\u003e\u003cp\u003eSanta Fe has limited internet options for a city of its size. Xfinity is the best internet provider by a mile -- it offers both the cheapest and fastest plans in the area and customers are generally happy with its service. If you can’t get Xfinity -- or you’re just sick of its post-promo-period price hikes -- T-Mobile is a solid backup option, with speeds up to 245Mbps for a flat $50 a month. NMSurf is a step down from T-Mobile and Xfinity, but the local provider still offers better value than DSL or satellite options. \u003c/p\u003e\u003ch2 id=\"27b34979-f84e-407b-b28e-f71c66bc150a\" data-ng-block=\"{\" id\":\"lswzfsn5ybkx1yh\",\"type\":\"heading\"}\"=\"\"\u003eInternet providers in Santa Fe FAQs\u003c/h2\u003e\u003cdiv data-id=\"listicle-77cbac20-20c7-4e12-af1b-a607356c3cf4\" data-cy=\"shortcodeListicle\" data-location=\"LIST\" data-position=\"5\"\u003e\u003cdiv\u003e\u003cp\u003e\n      What is the best internet service provider in Santa Fe?\n    \u003c/p\u003e \u003c/div\u003e \u003cdiv\u003e\u003cp\u003eXfinity is the best internet service provider in Santa Fe, with six cable internet plans with speeds up to 1,200 Mbps and prices ranging from $20 to $80 monthly. Prices increase after one or two years on all plans. T-Mobile\u0026#39;s fixed wireless service is also available in Santa Fe, with speeds up to 245 Mbps and for $50 per month with no equipment fees, data caps or contracts. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-id=\"listicle-b41a051e-10dc-45cc-8e6f-83dcd319b752\" data-cy=\"shortcodeListicle\" data-location=\"LIST\" data-position=\"6\"\u003e\u003cdiv\u003e\u003cp\u003e\n      Is fiber internet available in Santa Fe?\n    \u003c/p\u003e \u003c/div\u003e \u003cdiv\u003e\u003cp\u003eQuantum Fiber and NMSurf both offer fiber internet service in Santa Fe, but only 3% of households can currently access it, \u003ca target=\"_blank\" rel=\"noopener nofollow\" href=\"https://broadbandmap.fcc.gov/area-summary/fixed?version=dec2022\u0026amp;geoid=3570500\u0026amp;type=place\u0026amp;zoom=10.97\u0026amp;vlon=-106.003192\u0026amp;vlat=35.671323\u0026amp;br=r\u0026amp;speed=25_3\u0026amp;tech=3\"\u003eaccording to FCC data\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-id=\"listicle-3a45a814-4e03-4cd9-8202-18d065fd40b9\" data-cy=\"shortcodeListicle\" data-location=\"LIST\" data-position=\"7\"\u003e\u003cdiv\u003e\u003cp\u003e\n      Who is the cheapest internet provider in Santa Fe?\n    \u003c/p\u003e \u003c/div\u003e \u003cdiv\u003e\u003cp\u003eXfinity is the cheapest internet provider in Santa Fe, with plans starting at $20 per month for 150Mbps excluding equipment fees. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-id=\"listicle-3a483370-e7d7-480e-9861-0eb8e403e4c8\" data-cy=\"shortcodeListicle\" data-location=\"LIST\" data-position=\"8\"\u003e\u003cdiv\u003e\u003cp\u003e\n      Which internet provider in Santa Fe offers the fastest plan?\n    \u003c/p\u003e \u003c/div\u003e \u003cdiv\u003e\u003cp\u003eXfinity offers the fastest plan in Santa Fe, with download speeds up to 1,200 Mbps and upload speeds up to 40Mbps.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e \u003cdiv data-cy=\"articleLinkBlock\"\u003e \u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\n      Internet Providers by City\n    \u003c/span\u003e \u003c/p\u003e \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\n      Internet Providers and Services\n    \u003c/span\u003e \u003c/p\u003e \u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\n      Helpful Internet Resources\n    \u003c/span\u003e \u003c/p\u003e \u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-12-29T00:00:00Z",
  "modifiedTime": null
}
