{
  "id": "1d7d0591-5191-4383-b9ac-653d035d4dfd",
  "title": "Google: Were not participating in European fact-checking rules for Search or YouTube",
  "link": "https://mashable.com/article/google-opts-out-eu-disinformation-code-fact-checking",
  "description": "Google is backing away from its commitments under the EU's disinformation code.",
  "author": "",
  "published": "Fri, 17 Jan 2025 21:09:08 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Matt Binder",
  "length": 1987,
  "excerpt": "Big Tech continues to turn away from content moderation.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "After Mark Zuckerberg's big announcement that Meta will no longer fact check, Google is also sending a message to the European Union: The search giant is opting out of a new EU law that requires fact checks.While tech companies might feel emboldened now to make such policy decisions in an attempt to curry favor with President-elect Donald Trump, it's a little different in Google's case — the company has never quite provided fact-checking of its search products or videos on YouTube, which it owns. So, at least as of now, Google isn't rolling back anything, it's just not committing to go any further.A letter from Google’s global affairs president Kent Walker to Renate Nikolay, the European Commission’s content and technology czar, was obtained by Axios and lays out Google's rejection of the EU’s Code of Practice on Disinformation. Mashable Light Speed The code would require that Google develop fact-checking capabilities into its search engine ranking and YouTube algorithms. Signing on to these rules was voluntary as the disinformation code isn't legally binding. However, many social media platforms including Google, Meta, and even Twitter — before Elon Musk's acquisition — previously signed onto the code. As The Verge points out, even prior to the sudden policy changes at Meta, the European Fact-Checking Standards Network found that many of the online platforms that voluntarily signed on were \"reneging on their commitments.\" The code was created before the EU's official content moderation law, the Digital Services Act or DSA, went into effect in 2022. The DSA is legally binding so it will be interesting to see if any of the disinformation code gets implemented under the DSA and what Big Tech companies would do about it when that happens.Google's letter to the European Commission states that the company would \"pull out of all fact-checking commitments in the Code before it becomes a DSA Code of Conduct.\"",
  "image": "https://helios-i.mashable.com/imagery/articles/03eGVjHqexuWbCe0qKNm116/hero-image.fill.size_1200x675.v1737147081.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"article\" data-autopogo=\"\"\u003e\n                                    \u003cp\u003eAfter Mark Zuckerberg\u0026#39;s \u003ca href=\"https://mashable.com/article/meta-ditches-fact-checking-for-community-notes\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003ebig announcement that Meta will no longer fact check\u003c/a\u003e, Google is also sending a message to the European Union: The search giant is opting out of a new EU law that requires fact checks.\u003c/p\u003e\u003cp\u003eWhile tech companies might feel emboldened now to make such policy decisions in an attempt to curry favor with President-elect Donald Trump, it\u0026#39;s a little different in Google\u0026#39;s case — the company has never quite provided fact-checking of its search products or videos on YouTube, which it owns. So, at least as of now, Google isn\u0026#39;t rolling back anything, it\u0026#39;s just not committing to go any further.\u003c/p\u003e\u003cp\u003eA letter from Google’s global affairs president Kent Walker to Renate Nikolay, the European Commission’s content and technology czar, was obtained by \u003ca href=\"https://www.axios.com/2025/01/16/google-fact-check-eu\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eAxios\u003c/u\u003e\u003c/a\u003e and lays out Google\u0026#39;s rejection of the EU’s Code of Practice on Disinformation.\u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"mashablelightspeed\"\u003e\n        \u003cp\u003e\n            Mashable Light Speed\n        \u003c/p\u003e\n        \n        \n    \u003c/section\u003e\n\u003cp\u003eThe code would require that Google develop fact-checking capabilities into its search engine ranking and YouTube algorithms. \u003c/p\u003e\u003cp\u003eSigning on to these rules was voluntary as the disinformation code isn\u0026#39;t legally binding. However, many social media platforms including Google, Meta, and even Twitter — before Elon Musk\u0026#39;s acquisition — previously signed onto the code. As \u003ca href=\"https://www.theverge.com/2025/1/17/24345747/google-eu-dsa-fact-checks-disinformation-code-search-youtube\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eThe Verge\u003c/u\u003e\u003c/a\u003e points out, even prior to the sudden policy changes at Meta, the European Fact-Checking Standards Network \u003ca href=\"https://efcsn.com/news/2024-01-24_cop-review/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003efound\u003c/u\u003e\u003c/a\u003e that many of the online platforms that voluntarily signed on were \u0026#34;reneging on their commitments.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe code was created before the EU\u0026#39;s official content moderation law, the Digital Services Act or DSA, went into effect in 2022. The DSA is legally binding so it will be interesting to see if any of the disinformation code gets implemented under the DSA and what Big Tech companies would do about it when that happens.\u003c/p\u003e\u003cp\u003eGoogle\u0026#39;s letter to the European Commission states that the company would \u0026#34;pull out of all fact-checking commitments in the Code before it becomes a DSA Code of Conduct.\u0026#34;\u003c/p\u003e\n\n                                        \n                    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-17T21:09:08Z",
  "modifiedTime": "2025-01-17T21:09:08Z"
}
