{
  "id": "2cfbfe63-2791-44cf-be99-94b55df7839a",
  "title": "ADL’s report on racist Steam Community posts prompts a letter from Virginia senator",
  "link": "https://www.engadget.com/social-media/adls-report-on-racist-steam-community-posts-prompts-a-letter-from-virginia-senator-214243775.html?src=rss",
  "description": "A damning report from the Anti-Defamation League published Thursday on the “unprecedented” amount of racist and violent content on Steam Community has prompted a US Senator to take action. In a letter spotted by The Verge, Senator Mark Warner (D-VA) asked Valve CEO Gabe Newell how he and his company are addressing the issue. “My concern is elevated by the fact that Steam is the largest single online gaming digital distribution and social networking platform in the world with over 100 million unique user accounts and a user base similar in scale to that of the ‘traditional social media and social network platforms,’” Warner wrote. The senator also cited Steam’s online conduct policy that states users may not “upload or post illegal or inappropriate content [including] [real] or disturbing depictions of violence” or “harass other users or Steam personnel.” “Valve must bring its content moderation practices in line with industry standards or face more intense scrutiny from the federal government for its complicity in allowing hate groups to congregate and engage in activities that undoubtedly puts Americans at risk,” Warner writes. Congress doesn’t have the ability to take action on Valve or any platform except to shine light on the problem through letters and committee hearings. The Supreme Court overturned two state laws in June that prevented government officials from communicating with social media companies about objectionable content.  This also isn’t the first time that Congress has raised concerns with Valve about extremist and racist content created by users or players in one of its products. The Senate Committee on the Judiciary sent a letter to Newell in 2023 to express concerns about players posting and spouting racist language in Valve’s multiplayer online arena game Dota 2. We reached out to Valve for comment. We will update this story if we receive a statement or reactions from Valve.This article originally appeared on Engadget at https://www.engadget.com/social-media/adls-report-on-racist-steam-community-posts-prompts-a-letter-from-virginia-senator-214243775.html?src=rss",
  "author": "Danny Gallagher",
  "published": "Fri, 15 Nov 2024 21:42:46 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Politics \u0026 Government",
    "Media",
    "Government",
    "Arts \u0026 Entertainment",
    "Social \u0026 Online Media",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Danny Gallagher"
  ],
  "byline": "Danny Gallagher",
  "length": 1922,
  "excerpt": "The Democratic Senator wants to know what Valve intends to do to stop anti-Semitic and violent content.",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "A damning report from the Anti-Defamation League published Thursday on the “unprecedented” amount of racist and violent content on Steam Community has prompted a US Senator to take action. In a letter spotted by The Verge, Senator Mark Warner (D-VA) asked Valve CEO Gabe Newell how he and his company are addressing the issue.“My concern is elevated by the fact that Steam is the largest single online gaming digital distribution and social networking platform in the world with over 100 million unique user accounts and a user base similar in scale to that of the ‘traditional social media and social network platforms,’” Warner wrote.The senator also cited Steam’s online conduct policy that states users may not “upload or post illegal or inappropriate content [including] [real] or disturbing depictions of violence” or “harass other users or Steam personnel.”“Valve must bring its content moderation practices in line with industry standards or face more intense scrutiny from the federal government for its complicity in allowing hate groups to congregate and engage in activities that undoubtedly puts Americans at risk,” Warner writes.Congress doesn’t have the ability to take action on Valve or any platform except to shine light on the problem through letters and committee hearings. The Supreme Court overturned two state laws in June that prevented government officials from communicating with social media companies about objectionable content.This also isn’t the first time that Congress has raised concerns with Valve about extremist and racist content created by users or players in one of its products. The Senate Committee on the Judiciary sent a letter to Newell in 2023 to express concerns about players posting and spouting racist language in Valve’s multiplayer online arena game Dota 2.We reached out to Valve for comment. We will update this story if we receive a statement or reactions from Valve.",
  "image": "https://s.yimg.com/ny/api/res/1.2/FIBykKsR6sdS8Gz0WCml0A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-10/f1a1c4a0-a395-11ef-ab7e-73d353e8c8c8",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eA damning report from the \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://www.engadget.com/gaming/adl-report-finds-steam-is-rife-with-racist-posts-and-images-203934592.html\" data-ylk=\"slk:Anti-Defamation League;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eAnti-Defamation League\u003c/a\u003e published Thursday on the “unprecedented” amount of racist and violent content on Steam Community has prompted a US Senator to take action. In a letter spotted by \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://www.theverge.com/2024/11/15/24297364/steam-extremist-content-moderation-us-senator-warner-letter\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:The Verge;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003eThe Verge\u003c/em\u003e\u003c/a\u003e, Senator Mark Warner (D-VA) asked Valve CEO Gabe Newell how he and his company are addressing the issue.\u003c/p\u003e\u003cp\u003e“My concern is elevated by the fact that Steam is the largest single online gaming digital distribution and social networking platform in the world with over 100 million unique user accounts and a user base similar in scale to that of the ‘traditional social media and social network platforms,’” Warner wrote.\u003c/p\u003e\u003cp\u003eThe senator also cited Steam’s online conduct policy that states users may not “upload or post illegal or inappropriate content [including] [real] or disturbing depictions of violence” or “harass other users or Steam personnel.”\u003c/p\u003e\u003cp\u003e“Valve must bring its content moderation practices in line with industry standards or face more intense scrutiny from the federal government for its complicity in allowing hate groups to congregate and engage in activities that undoubtedly puts Americans at risk,” Warner writes.\u003c/p\u003e\u003cp\u003eCongress doesn’t have the ability to take action on Valve or any platform except to shine light on the problem through letters and committee hearings. \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://www.engadget.com/supreme-court-ruling-may-allow-officials-to-coordinate-with-social-platforms-again-144045052.html\" data-ylk=\"slk:The Supreme Court;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eThe Supreme Court\u003c/a\u003e overturned two state laws in June that prevented government officials from communicating with social media companies about objectionable content.\u003c/p\u003e\u003cp\u003eThis also isn’t the first time that Congress has raised concerns with Valve about extremist and racist content created by users or players in one of its products. \u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://www.judiciary.senate.gov/imo/media/doc/2023-03-28%20Letter%20to%20Valve%20re%20policies%20on%20extremist%20content.pdf\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:The Senate Committee on the Judiciary;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eThe Senate Committee on the Judiciary\u003c/a\u003e sent a letter to Newell in 2023 to express concerns about players posting and spouting racist language in Valve’s multiplayer online arena game \u003cem\u003eDota 2\u003c/em\u003e.\u003c/p\u003e\u003cp\u003eWe reached out to Valve for comment. We will update this story if we receive a statement or reactions from Valve.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-15T21:42:46Z",
  "modifiedTime": null
}
