{
  "id": "32482f08-d0f2-4bd8-80de-a14d5a4367b4",
  "title": "Will TikTok 'Go Dark' on Sunday? Its Fate Remains Unclear",
  "link": "https://www.cnet.com/tech/services-and-software/tiktok-takes-its-case-to-the-supreme-court-what-to-know/#ftag=CAD590a51e",
  "description": "On Friday, TikTok said it would vanish, without \"definitive\" word from the Biden White House saying otherwise. The White House called that a stunt. Now Trump says he'll likely issue a reprieve.",
  "author": "Bree Fowler",
  "published": "Sat, 18 Jan 2025 21:27:00 +0000",
  "source": "https://www.cnet.com/rss/news/",
  "categories": null,
  "byline": "Bree Fowler",
  "length": 8770,
  "excerpt": "On Friday, TikTok said it would vanish, without \"definitive\" word from the Biden White House saying otherwise. The White House called that a stunt. Now Trump says he'll likely issue a reprieve.",
  "siteName": "CNET",
  "favicon": "https://www.cnet.com/favicon-480.png",
  "text": "The clock may be running out for TikTok. Or maybe not just yet.A flurry of statements heading into the weekend have made it uncertain just what'll happen with the popular Chinese-owned social media platform come Sunday, when a US ban is set to kick in. Among the possibilities: It could \"go dark.\" It could go dark for just a day. Or it could remain up and running, at least for a while.Most recently, US President-elect Donald Trump, who's set to be sworn in to office on Monday, said Saturday that he'd probably grant TikTok a reprieve of several months. That followed dueling statements from TikTok and the outgoing Biden administration, which had said it would leave enforcement of the ban to the incoming president.TikTok said Friday night that it would \"go dark\" Sunday unless it received clear assurances from government officials that the ban wouldn't be enforced. Statements issued by the White House and the Department of Justice \"failed to provide the necessary clarity and assurance\" to the service providers required to make TikTok available in the US, TikTok said in a statement on X.\"Unless the Biden Administration immediately provides a definitive statement to satisfy the most critical service providers assuring non-enforcement, unfortunately TikTok will be forced to go dark on Jan. 19,\" the company said.On Saturday morning, however, the White House called TikTok's remarks a ploy. The company's statement \"is a stunt,\" White House press secretary Karine Jean-Pierre said in a statement provided to media outlets. \"We see no reason for TikTok or other companies to take actions in the next few days before the Trump Administration takes office on Monday.\"The White House had issued a statement Friday saying Biden's position on TikTok hadn't changed — he still thinks TikTok should remain available to Americans, but under ownership that satisfies the government's national security concerns. \"Given the sheer fact of timing, this administration recognizes that actions to implement the law simply must fall to the next administration,\" the statement said. Jean-Pierre reiterated that position on Saturday, saying, \"TikTok and other companies should take up any concerns\" with the incoming Trump administration.On Saturday, Trump told NBC News that after he takes office he'll \"most likely\" delay the TikTok ban for 90 days. \"If I decide to do that, I'll probably announce it on Monday,\" Trump told the outlet. Such a reprieve is allowed for in the law authorizing the ban.The latest statements from key players come after the US Supreme Court this week rejected TikTok's request to overturn a law passed by Congress and signed by President Joe Biden last year that would effectively ban the app in the US if TikTok's China-based parent company, ByteDance, doesn't sell it to a buyer deemed fit by US officials by Sunday.Earlier Friday, the nation's highest court rejected TikTok's argument that the ban would infringe on the US company's free speech rights, as well as those of its 170 million active US users. Instead, it sided with the government's case that the ban isn't about free speech at all but about ownership and national security.Read more: TikTok Backups: 6 Similar Apps for Your Daily Dose of FunLawmakers in both political parties have long voiced concerns that TikTok could be a threat to national security and could be used by the Chinese government to spy on Americans or spread disinformation to further China's agenda.TikTok continues to deny those accusations. Ahead of votes in Congress earlier this year, TikTok rallied its US users, calling on them to urge their representatives on Capitol Hill to vote down a ban. But the measure ultimately passed by wide margins in both chambers of Congress and was signed by Biden. Watch this: US vs. TikTok: What Happens Next 02:15Trump, who pushed for a ban during his first term, now says he's no longer in favor of one. Ahead of the oral arguments, lawyers for Trump filed an amicus brief in the case. They didn't take a side but instead asked the court to delay the ban to give Trump time to come up with a \"political resolution.\"In a video posted Friday afternoon on TikTok and other social media platforms, TikTok CEO Shou Chew didn't say what TikTok planned to do, or what its American users would see when they opened up their apps after the deadline passed. Instead, he thanked Trump for pledging to work with TikTok to find a solution that will keep the app running in the US.\"We are grateful and pleased to have the support of a president who truly understands our platform — one who has used TikTok to express his own thoughts and perspectives, connecting with the world and generating more than 60 billion views of his content in the process,\" Chew said.So what's next for lawmakers and TikTok? Here's what you need to know.What does the law do?The law is aimed at forcing ByteDance to sell TikTok to a buyer American officials are OK with, as well as guaranteeing that ByteDance no longer has access to US user data or control over the TikTok algorithm that decides what videos American users see. TikTok was given nine months to comply, hence the Jan. 19 deadline, at which point the government could require the removal of its app from US app stores. The president could grant a 90-day extension. Earlier this week, a pair of Senate Democrats announced legislation that would have given TikTok another nine months, but it was blocked by Republicans. TikTok has long said that a sale is not an option. As it said it planned to in its Friday X post, TikTok could effectively chose to \"go dark\" if the ban does go into effect. It's also possible that the app would die a slow death. It wouldn't shut down, but would no longer be available in the Google and Apple app stores and current users wouldn't be able to get software updates, which would eventually make the app too buggy to use. Biden, who signed the bill that established those requirements, remains in office until Inauguration Day on Jan. 20.Read more: TikTok Loves to Give Financial Advice. But Don't Believe Everything You HearWhat's next?After originally calling for a ban during his first presidency, Trump said during the 2024 campaign that he wasn't in favor of one and pledged to \"save TikTok,\" though he didn't specify how he'd do that.During a press conference in December, Trump pointed to the role TikTok played during the election, crediting it with helping him pick up the votes of young people.\"TikTok had an impact, and so we're taking a look at it,\" Trump told the press. \"I have a little bit of a warm spot in my heart. I'll be honest.\"Trump said in March on CNBC's Squawk Box that though he still viewed the app as a danger to national security, he no longer thought it should be banned, saying, \"There are a lot of young kids on TikTok who will go crazy without it.\"Trump added that banning TikTok would only boost the power of Facebook, which he referred to as an \"enemy of the people.\"In September, Trump pledged to \"save TikTok,\" according to an Associated Press report. But during an interview that aired last month on Meet the Press, Trump didn't directly say if or how he'd help TikTok avoid a ban.On the Saturday before the ban was scheduled to kick in, Trump told NBC News that he would \"most likely\" grant TikTok a 90-day extension. \"You know, it's appropriate,\" Trump told the outlet. \"We have to look at it carefully. It's a very big situation.\" Trump said he'd probably announce the extension on Monday, if he decides to go through with it.Who has opposed the TikTok ban?Free speech and digital rights groups, as well as some security experts, have long opposed the idea of a ban, saying that singling out TikTok doesn't do anything to solve the broader problems with social media. Several filed briefs with the high court supporting TikTok.Instead they argue that lawmakers would be better off passing comprehensive digital privacy laws that would protect the personal information of Americans by regulating the ability of all social media companies to collect, share and sell it.Electronic Frontier Foundation Civil Liberties Director David Greene, who co-authored an amicus brief submitted to the court late last month, said the EFF is \"deeply disappointed\" that the court chose to look past the free speech issues in the case and instead focus on the government's \"shaky data privacy concerns.\"  He noted that America's enemies have no shortage of other ways to steal, scrape, or buy Americans' data.\"The ban or forced sale of one social media app will do virtually nothing to protect Americans' data privacy --- only comprehensive consumer privacy legislation can achieve that goal,\" Greene said in an EFF statement.CNET's Edward Moyer contributed to this report.",
  "image": "https://www.cnet.com/a/img/resize/68affe31e2d2a286cdf52b50dd96c4a6311df2c8/hub/2024/04/26/ee212de0-9b7e-4d49-a304-503b4e3a5342/tiktok-ban-congress.jpg?auto=webp\u0026fit=crop\u0026height=675\u0026width=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe clock may be running out for TikTok. Or maybe not just yet.\u003c/p\u003e\u003cp\u003eA flurry of statements heading into the weekend have made it uncertain just what\u0026#39;ll happen with the popular Chinese-owned social media platform come Sunday, when a US ban is set to kick in. Among the possibilities: It could \u0026#34;go dark.\u0026#34; It could go dark for just a day. Or it could remain up and running, at least for a while.\u003c/p\u003e\u003cp\u003eMost recently, US President-elect Donald Trump, who\u0026#39;s set to be sworn in to office on Monday, said Saturday that he\u0026#39;d probably grant TikTok a reprieve of several months. That followed dueling statements from TikTok and the outgoing Biden administration, which had said it would leave enforcement of the ban to the incoming president.\u003c/p\u003e\u003cp\u003eTikTok said Friday night that it would \u0026#34;go dark\u0026#34; Sunday unless it received clear assurances from government officials that the ban wouldn\u0026#39;t be enforced. Statements issued by the White House and the Department of Justice \u0026#34;failed to provide the necessary clarity and assurance\u0026#34; to the service providers required to make TikTok available in the US, TikTok said in a statement on X.\u003c/p\u003e\u003cp\u003e\u0026#34;Unless the Biden Administration immediately provides a definitive statement to satisfy the most critical service providers assuring non-enforcement, unfortunately TikTok will be forced to go dark on Jan. 19,\u0026#34; the company said.\u003c/p\u003e\u003cp\u003eOn Saturday morning, however, the White House called TikTok\u0026#39;s remarks a ploy. The company\u0026#39;s statement \u0026#34;is a stunt,\u0026#34; White House press secretary Karine Jean-Pierre said in a statement provided to media outlets. \u0026#34;We see no reason for TikTok or other companies to take actions in the next few days before the Trump Administration takes office on Monday.\u0026#34;\u003c/p\u003e\u003cp\u003eThe White House had issued a \u003ca href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/17/statement-by-white-house-press-secretary-karine-jean-pierre-regarding-tiktok/#link=%7B%22role%22:%22standard%22,%22href%22:%22https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/17/statement-by-white-house-press-secretary-karine-jean-pierre-regarding-tiktok/%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22issued%20a%20statement%20Friday%22%7D\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003estatement\u003c/a\u003e Friday saying Biden\u0026#39;s position on TikTok hadn\u0026#39;t changed — he still thinks TikTok should remain available to Americans, but under ownership that satisfies the government\u0026#39;s national security concerns. \u0026#34;Given the sheer fact of timing, this administration recognizes that actions to implement the law simply must fall to the next administration,\u0026#34; the statement said. Jean-Pierre reiterated that position on Saturday, saying, \u0026#34;TikTok and  other companies should take up any concerns\u0026#34; with the incoming Trump administration.\u003c/p\u003e\u003cp\u003eOn Saturday, Trump \u003ca href=\"https://www.nbcnews.com/politics/donald-trump/trump-likely-give-tiktok-90-day-extension-avoid-ban-rcna188258\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003etold\u003c/a\u003e NBC News that after he takes office he\u0026#39;ll \u0026#34;most likely\u0026#34; delay the TikTok ban for 90 days. \u0026#34;If I decide to do that, I\u0026#39;ll probably announce it on Monday,\u0026#34; Trump told the outlet. Such a reprieve is allowed for in the law authorizing the ban.\u003c/p\u003e\u003cp\u003eThe latest statements from key players come after the US Supreme Court this week \u003ca href=\"https://www.cnet.com/tech/services-and-software/tiktok-ban-upheld-by-supreme-court-not-swayed-by-first-amendment-claims/#link=%7B%22role%22:%22standard%22,%22href%22:%22https://www.cnet.com/tech/services-and-software/tiktok-ban-upheld-by-supreme-court-not-swayed-by-first-amendment-claims/%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22rejected%20TikTok\u0026#39;s%20request%22%7D\" target=\"_self\"\u003erejected TikTok\u0026#39;s request\u003c/a\u003e to overturn a law passed by Congress and signed by President Joe Biden last year that would \u003ca href=\"https://www.cnet.com/tech/services-and-software/politicians-push-for-tiktok-ban-saying-its-a-threat-to-national-security/#link=%7B%22role%22:%22standard%22,%22href%22:%22https://www.cnet.com/tech/services-and-software/politicians-push-for-tiktok-ban-saying-its-a-threat-to-national-security/%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22effectively%20ban%20the%20app%20in%20the%20US%22%7D\" target=\"_self\"\u003eeffectively ban the app in the US\u003c/a\u003e if TikTok\u0026#39;s China-based parent company, ByteDance, doesn\u0026#39;t sell it to a buyer deemed fit by US officials by Sunday.\u003c/p\u003e\u003cp\u003eEarlier Friday, the nation\u0026#39;s highest court rejected TikTok\u0026#39;s argument that the ban would infringe on the US company\u0026#39;s free speech rights, as well as those of its 170 million active US users. Instead, it sided with the government\u0026#39;s case that the ban isn\u0026#39;t about free speech at all but about \u003ca href=\"https://www.cnet.com/news/social-media/tiktoks-us-supreme-court-arguments-suggest-ban-may-be-upheld/#link=%7B%22role%22:%22standard%22,%22href%22:%22https://www.cnet.com/news/social-media/tiktoks-us-supreme-court-arguments-suggest-ban-may-be-upheld/%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22ownership%20and%20national%20security%22%7D\" target=\"_self\"\u003eownership and national security\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRead more:\u003c/strong\u003e \u003ca href=\"https://www.cnet.com/tech/services-and-software/tiktok-ban-backups-6-similar-apps-for-your-daily-dose-of-fun/#link=%7B%22role%22:%22standard%22,%22href%22:%22https://www.cnet.com/tech/services-and-software/tiktok-ban-backups-6-similar-apps-for-your-daily-dose-of-fun/%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22TikTok%20Backups:%206%20Similar%20Apps%20for%20Your%20Daily%20Dose%20of%20Fun%22%7D\" target=\"_self\"\u003eTikTok Backups: 6 Similar Apps for Your Daily Dose of Fun\u003c/a\u003e\u003c/p\u003e\u003cp\u003eLawmakers in both political parties have long voiced concerns that TikTok could be a threat to national security and could be used by the Chinese government to spy on Americans or spread disinformation to further China\u0026#39;s agenda.\u003c/p\u003e\u003cp\u003eTikTok continues to deny those accusations. Ahead of votes in Congress earlier this year, \u003ca href=\"https://www.nytimes.com/2024/03/07/business/tiktok-phone-calls-congress.html#link=%7B%22role%22:%22standard%22,%22href%22:%22https://www.nytimes.com/2024/03/07/business/tiktok-phone-calls-congress.html%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22TikTok%20rallied%20its%20US%20users%22%7D\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003eTikTok rallied its US users\u003c/a\u003e, calling on them to urge their representatives on Capitol Hill to vote down a ban. But the measure ultimately passed by wide margins in both chambers of Congress and was signed by Biden.\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003csvg\u003e\u003cuse xlink:href=\"#play\"\u003e\u003c/use\u003e\u003c/svg\u003e \u003cfigure\u003e\u003cdiv\u003e\u003cpicture\u003e \u003cimg src=\"\" alt=\"\" height=\"306\" width=\"768\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e \u003c/figure\u003e\u003c/div\u003e \u003cp\u003e\u003cstrong\u003eWatch this:\u003c/strong\u003e US vs. TikTok: What Happens Next\n      \u003c/p\u003e \u003cp\u003e\u003ctime\u003e\u003csvg\u003e\u003cuse xlink:href=\"#play\"\u003e\u003c/use\u003e\u003c/svg\u003e \u003cspan\u003e02:15\u003c/span\u003e\u003c/time\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eTrump, who pushed for a ban during his first term, now says he\u0026#39;s no longer in favor of one. Ahead of the oral arguments, lawyers for Trump \u003ca href=\"https://www.supremecourt.gov/DocketPDF/24/24-656/336151/20241227163400981_2024-12-27%20-%20TikTok%20v.%20Garland%20-%20Amicus%20Brief%20of%20President%20Donald%20J.%20Trump.pdf\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003efiled an amicus brief\u003c/a\u003e in the case. They didn\u0026#39;t take a side but instead asked the court to delay the ban to give Trump time to come up with a \u0026#34;political resolution.\u0026#34;\u003c/p\u003e\u003cp\u003eIn a \u003ca href=\"https://www.tiktok.com/@tiktok/video/7460937381265411370\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003evideo\u003c/a\u003e posted Friday afternoon on TikTok and other social media platforms, TikTok CEO Shou Chew didn\u0026#39;t say what TikTok planned to do, or what its American users would see when they opened up their apps after the deadline passed. Instead, he thanked Trump for pledging to work with TikTok to find a solution that will keep the app running in the US.\u003c/p\u003e\u003cp\u003e\u0026#34;We are grateful and pleased to have the support of a president who truly understands our platform — one who has used TikTok to express his own thoughts and perspectives, connecting with the world and generating more than 60 billion views of his content in the process,\u0026#34; Chew said.\u003c/p\u003e\u003cp\u003eSo what\u0026#39;s next for lawmakers and TikTok? Here\u0026#39;s what you need to know.\u003c/p\u003e\u003ch2\u003eWhat does the law do?\u003c/h2\u003e\u003cp\u003eThe law is aimed at forcing ByteDance to sell TikTok to a buyer American officials are OK with, as well as guaranteeing that ByteDance no longer has access to US user data or control over the TikTok algorithm that decides what videos American users see. \u003c/p\u003e\u003cp\u003eTikTok was given nine months to comply, hence the Jan. 19 deadline, at which point the government could require the removal of its app from US app stores. The president could grant a 90-day extension. Earlier this week, a pair of Senate Democrats announced l\u003ca href=\"https://www.markey.senate.gov/imo/media/doc/extend_the_tiktok_deadline_act.pdf\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003eegislation that would have given TikTok another nine months\u003c/a\u003e, but it was blocked by Republicans. \u003c/p\u003e\u003cp\u003eTikTok has long said that a sale is not an option. As it said it planned to in its Friday X post, TikTok could effectively chose to \u0026#34;go dark\u0026#34; if the ban does go into effect. It\u0026#39;s also possible that the app would die a slow death. It wouldn\u0026#39;t shut down, but would no longer be available in the Google and Apple app stores and current users wouldn\u0026#39;t be able to get software updates, which would eventually make the app too buggy to use. \u003c/p\u003e\u003cp\u003eBiden, who signed the bill that established those requirements, remains in office until Inauguration Day on Jan. 20.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRead more\u003c/strong\u003e: \u003ca href=\"https://www.cnet.com/personal-finance/banking/advice/tiktok-money-tips-could-ruin-your-finances-heres-how-to-spot-bad-advice/\" target=\"_self\"\u003eTikTok Loves to Give Financial Advice. But Don\u0026#39;t Believe Everything You Hear\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eWhat\u0026#39;s next?\u003c/h2\u003e\u003cp\u003eAfter originally calling for a ban during his first presidency, Trump said during the 2024 campaign that he wasn\u0026#39;t in favor of one and pledged to \u0026#34;save TikTok,\u0026#34; though he didn\u0026#39;t specify how he\u0026#39;d do that.\u003c/p\u003e\u003cp\u003eDuring a press conference in December, Trump pointed to the role TikTok played during the election, crediting it with helping him pick up the votes of young people.\u003c/p\u003e\u003cp\u003e\u0026#34;TikTok had an impact, and so we\u0026#39;re taking a look at it,\u0026#34; Trump told the press. \u0026#34;I have a little bit of a warm spot in my heart. I\u0026#39;ll be honest.\u0026#34;\u003c/p\u003e\u003cp\u003eTrump \u003ca href=\"https://www.cnbc.com/2024/03/11/trump-says-a-tiktok-ban-would-empower-meta-slams-facebook-as-enemy-of-the-people.html\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003esaid\u003c/a\u003e in March on CNBC\u0026#39;s Squawk Box that though he still viewed the app as a danger to national security, he no longer thought it should be banned, saying, \u0026#34;There are a lot of young kids on TikTok who will go crazy without it.\u0026#34;\u003c/p\u003e\u003cp\u003eTrump added that banning TikTok would only boost the power of Facebook, which he referred to as an \u0026#34;enemy of the people.\u0026#34;\u003c/p\u003e\u003cp\u003eIn September, Trump pledged to \u0026#34;\u003ca href=\"https://apnews.com/article/trump-tiktok-ban-congress-president-282d8df7b91dce270316509badd39978\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003esave TikTok\u003c/a\u003e,\u0026#34; according to an Associated Press report. But during an \u003ca href=\"https://www.tiktok.com/@nbcnews/video/7446130950444010795\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003einterview that aired last month on Meet the Press\u003c/a\u003e, Trump didn\u0026#39;t directly say if or how he\u0026#39;d help TikTok avoid a ban.\u003c/p\u003e\u003cp\u003eOn the Saturday before the ban was scheduled to kick in, Trump \u003ca href=\"https://www.nbcnews.com/politics/donald-trump/trump-likely-give-tiktok-90-day-extension-avoid-ban-rcna188258\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003etold\u003c/a\u003e NBC News that he would \u0026#34;most likely\u0026#34; grant TikTok a 90-day extension. \u0026#34;You know, it\u0026#39;s appropriate,\u0026#34; Trump told the outlet. \u0026#34;We have to look at it carefully. It\u0026#39;s a very big situation.\u0026#34; Trump said he\u0026#39;d probably announce the extension on Monday, if he decides to go through with it.\u003c/p\u003e\u003ch2\u003eWho has opposed the TikTok ban?\u003c/h2\u003e\u003cp\u003eFree speech and digital rights groups, as well as some security experts, have long opposed the idea of a ban, saying that singling out TikTok doesn\u0026#39;t do anything to solve the broader problems with social media. Several filed briefs with the high court supporting TikTok.\u003c/p\u003e\u003cp\u003eInstead they argue that lawmakers would be better off passing comprehensive digital privacy laws that would protect the personal information of Americans by regulating the ability of all social media companies to collect, share and sell it.\u003c/p\u003e\u003cp\u003eElectronic Frontier Foundation Civil Liberties Director David Greene, who co-authored \u003ca href=\"https://www.supremecourt.gov/DocketPDF/24/24A587/335380/20241217144322392_24A587%20TikTok%20v%20Garland%20Amicus%20Brief%20pdfa.pdf\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003ean amicus brief\u003c/a\u003e submitted to the court late last month, said the EFF is \u0026#34;deeply disappointed\u0026#34; that the court chose to look past the free speech issues in the case and instead focus on the government\u0026#39;s \u0026#34;shaky data privacy concerns.\u0026#34;  \u003c/p\u003e\u003cp\u003eHe noted that America\u0026#39;s enemies have no shortage of other ways to steal, scrape, or buy Americans\u0026#39; data.\u003c/p\u003e\u003cp\u003e\u0026#34;The ban or forced sale of one social media app will do virtually nothing to protect Americans\u0026#39; data privacy --- only comprehensive consumer privacy legislation can achieve that goal,\u0026#34; Greene said in an EFF statement.\u003c/p\u003e\u003cp\u003e\u003cem\u003eCNET\u0026#39;s Edward Moyer contributed to this report.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-01-18T21:27:00Z",
  "modifiedTime": null
}
