{
  "id": "35e7771f-f5a1-488e-9ff2-b433ea10c18e",
  "title": "Instagram Won't Snitch If You Screenshot",
  "link": "https://lifehacker.com/tech/does-instagram-notify-someone-if-you-screenshot",
  "description": "Screenshot with wild abandon, but proceed with caution when sharing and bookmarking.",
  "author": "Lindsey Ellefson",
  "published": "Fri, 13 Dec 2024 00:00:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Mobile Apps"
  ],
  "byline": "Lindsey Ellefson",
  "length": 8100,
  "excerpt": "Screenshot with wild abandon, but proceed with caution when sharing and bookmarking.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "Screenshot with wild abandon, but proceed with caution when sharing and bookmarking. Credit: AngieYeoh/Shutterstock Oh, you’re here because you captured the image of someone’s Instagram Story and want to know if they’ll get a notification about the screenshot, à la Snapchat? First, know you’re safe, babe. Take a deep breath. We’ve all been there. They’re not going to find out if you took a screenshot of their grid post or story, at least not through a notification. Second, there are a few instances where an Instagram user might be made aware that you’re sharing their content, or at least filing it away for later. Here’s everything you need to know about taking screenshots, saving, and sharing in Instagram, so you can lurk in relative peace.Can you screenshot someone's Instagram Story?Let’s get this clear right away: If you screenshot someone’s grid or Story post, they do not get a notification. Ditto for screen recording a video post. It just doesn’t happen. Never has. Please, take it from me, someone who is, for better or worse, extremely good at creeping around on the app: I do it all the time. If any of the people whose content I was saving got a notification about it, I’d know by now. And I’d tell you. Has Instagram ever alerted users to screenshots of their content?That said, there used to be one way people could see if you’d taken a screenshot of something on Instagram. It was minor, but that’s what made it insidious: Up until very recently, if someone sent a photo directly to you via Instagram direct messaging, using the in-DM camera feature, and you took a screenshot of it, they would get a notification. It looked like this:  Credit: @ellefs0n/Instagram To demonstrate how that looked, I asked my recipient to screenshot the first picture I sent and to open and view, but not screenshot, the second. The photos were sent in real time, using the camera icon in the bottom left, next to the typing box. As you can see, a little circle icon (it looks like a camera shutter) appeared next to the first one, which meant a screenshot was taken of it. A photo taken with the regular camera and sent from the camera roll did not produce a screenshot notification. Why am I telling you this? Instagram only recently changed this. As of now, if you screenshot a photo taken with the in-app camera, there is no longer a notification, but if you did so in the past, you should at least know that you gave yourself up. That is, if the sender even noticed that tiny little shutter icon. If Instagram ever changes things back to how they were and this becomes an issue again, I will update here. Other ways to see if people are sharing your Instagram contentTaking screenshots on Instagram is safe, as we've discovered, but there are other ways a person might be able to figure out if you’re disseminating their content or saving it for future review. Technically, you'll still be anonymous, but it could be traced back to you with a little bad luck.If you have a business account, not a personal one, you have access to some additional features that can come in handy if you want to know whether people are sharing your content among themselves. Under your grid posts, you’ll see a button that says “View insights.” Tapping this will bring you to a page that shows how many accounts were reached, how many were engaged, how many people tapped through to see your profile, how many were following you already, and all kinds of other interesting data. You’ll also see, right at the top, a string of four numbers: How many accounts liked it, how many comments it got, how many shares it got, and how many saves it got. Credit: @ellefs0n/Instagram The shares and saves are important here. The rightward facing arrow that looks like a paper plane is your shares. The rectangle with a triangular cutout that looks like a bookmark is your saves. If you check this, you can’t see who is sharing or saving it, but you can get a sense of how many opps (or fans!) you have. Above, see that nine people shared my post and six saved it. What were their intentions? These are the questions that keep me up at night, but alas, I may never uncover the culprits. Bear in mind that if you save or share a post—meaning you send it to someone else via DM, share it to your own Story, or copy the link to send it to someone off-app—if the person has a business profile, they’ll at least know someone did. Depending on the content of the post and how many followers they have, they could narrow it down to you. (To check if someone has a business account, tap their profile. If there’s a descriptor under their name, like Journalist, Blogger, or Public figure, or buttons like “Contact,” they have a business profile.)If you're the one worried someone has shared your post with ill intentions, don't get ahead of yourself. Ask yourself first if you shared your own post to your Story, which would count as a share and increase the number next to that paper plane icon. Speaking of Stories, anyone with a business profile can also see the data related to their Story posts, both when the posts are active in the 24 hours after they are shared and in the Story archive. Next to the eye-shaped icon that indicates viewers, there will be an icon with three rectangles that looks like a bar graph. It reveals how many accounts were reached, how many engaged with the post, how many replies it got, etc. It also reveals shares. Below is an example of a time one of my Stories got 11 shares. I was able to figure out who shared it by looking through the views and taking note of the viewers who were not my followers. Sensing nasty intentions, I blocked the original sharer. If you share someone’s Story in-app, the accounts with whom you share it will appear on the story’s viewership list, which could easily implicate you.  Credit: @ellefs0n/Instagram Does any of this matter? No, we should all launch our phones into the nearest trash can Sabrina van der Woodsen-style and go touch grass. But there are ways people can sniff out whether you’re sharing or saving their Instagram posts, even though they won’t get a notification if you screenshot.  Lindsey Ellefson Features Editor Lindsey Ellefson is Lifehacker’s Features Editor. She currently covers study and productivity hacks, as well as household and digital decluttering, and oversees the freelancers on the sex and relationships beat. She spent most of her pre-Lifehacker career covering media and politics for outlets like Us Weekly, CNN, The Daily Dot, Mashable, Glamour, and InStyle. In recent years, her freelancing has focused on drug use and the overdose crisis, with pieces appearing in Vanity Fair, WIRED, The New Republic, The Daily Beast, and more. Her story for BuzzFeed News won the 2022 American Journalism Online award for Best Debunking of Fake News.In addition to her journalism, Lindsey is a student at the NYU School of Global Public Health, where she is working toward her Master of Public Health and conducting research on media bias in reporting on substance use with the Opioid Policy Institute’s Reporting on Addiction initiative. She is also a Schwinn-certified spin class teacher. She won a 2023 Dunkin’ Donuts contest that earned her a year of free coffee. Lindsey lives in New York, NY. Read Lindsey's full bio",
  "image": "https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/hero-image.fill.size_1200x675.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n                            \u003cdiv data-ga-module=\"content-header\" aria-label=\"Content Header\"\u003e\n        \n        \n                    \u003cp\u003eScreenshot with wild abandon, but proceed with caution when sharing and bookmarking.\u003c/p\u003e\n            \u003c/div\u003e\n            \n            \u003csection data-ga-module=\"content-body\"\u003e\n                            \n                \u003cimg src=\"https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/hero-image.fill.size_1248x702.v1706811457.png\" alt=\"A photograph of someone holding a phone with the Instagram app open\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/hero-image.fill.size_400x225.v1706811457.png 400w, https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/hero-image.fill.size_800x450.v1706811457.png 800w, https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/hero-image.fill.size_1248x702.v1706811457.png 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\n                        \u003cp\u003e\u003cspan\u003eCredit: AngieYeoh/Shutterstock\u003c/span\u003e\n                            \u003c/p\u003e\n            \n    \u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eOh, you’re here because you captured the image of someone’s Instagram Story and want to know if they’ll get a notification about the screenshot, à la Snapchat? First, know you’re safe, babe. Take a deep breath. We’ve all been there. They’re not going to find out if you took a screenshot of their grid post or story, at least not through a notification. Second, there are a few instances where an Instagram user \u003cem\u003emight \u003c/em\u003ebe made aware that you’re sharing their content, or at least filing it away for later. Here’s everything you need to know about taking screenshots, saving, and sharing in Instagram, so you can lurk in relative peace.\u003c/p\u003e\u003ch2 id=\"can-you-screenshot-someones-instagram-story\"\u003eCan you screenshot someone\u0026#39;s Instagram Story?\u003c/h2\u003e\u003cp\u003eLet’s get this clear right away: If you screenshot someone’s grid or Story post, they do not get a notification. Ditto for screen recording a video post. It just doesn’t happen. Never has. Please, take it from me, someone who is, for better or worse, \u003ca href=\"https://lifehacker.com/how-to-creep-on-someones-instagram-stories-anonymously-1848794616\" target=\"_blank\"\u003e\u003cu\u003eextremely good at creeping around on the app\u003c/u\u003e\u003c/a\u003e: I do it all the time. If any of the people whose content I was saving got a notification about it, I’d know by now. And I’d tell you. \u003c/p\u003e\u003ch2 id=\"has-instagram-ever-alerted-users-to-screenshots-of-their-content\"\u003eHas Instagram ever alerted users to screenshots of their content?\u003c/h2\u003e\u003cp\u003eThat said, there used to be \u003cem\u003eone \u003c/em\u003eway people could see if you’d taken a screenshot of something on Instagram. It was minor, but that’s what made it insidious: Up until very recently, if someone sent a photo directly to you via Instagram direct messaging, \u003cem\u003eusing the in-DM camera feature\u003c/em\u003e, and you took a screenshot of it, they would get a notification. It looked like this: \u003c/p\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/images-1.fill.size_2000x1436.v1706809352.png\" alt=\"Screenshots of direct messages in Instagram\" width=\"2000\" height=\"1436\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/images-1.fill.size_800x575.v1706809352.png 800w, https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/images-1.fill.size_1400x1005.v1706809352.png 1400w, https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/images-1.fill.size_2000x1436.v1706809352.png 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003e\u003c/span\u003e\n                                        \u003cspan\u003eCredit: @ellefs0n/Instagram\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003cp\u003eTo demonstrate how that looked, I asked my recipient to screenshot the first picture I sent and to open and view, but not screenshot, the second. The photos were sent in real time, using the camera icon in the bottom left, next to the typing box. As you can see, a little circle icon (it looks like a camera shutter) appeared next to the first one, which meant a screenshot was taken of it. A photo taken with the regular camera and sent from the camera roll did \u003cem\u003enot \u003c/em\u003eproduce a screenshot notification. \u003c/p\u003e\u003cp\u003eWhy am I telling you this? Instagram only recently changed this. As of now, if you screenshot a photo taken with the in-app camera, there is no longer a notification, but if you did so in the past, you should at least know that you gave yourself up. That is, if the sender even noticed that tiny little shutter icon. If Instagram ever changes things back to how they were and this becomes an issue again, I will update here. \u003c/p\u003e\u003ch2 id=\"other-ways-to-see-if-people-are-sharing-your-instagram-content\"\u003eOther ways to see if people are sharing your Instagram content\u003c/h2\u003e\u003cp\u003eTaking screenshots on Instagram is safe, as we\u0026#39;ve discovered, but there are other ways a person might be able to figure out if you’re disseminating their content or saving it for future review. Technically, you\u0026#39;ll still be anonymous, but it could be traced back to you with a little bad luck.\u003c/p\u003e\u003cp\u003eIf you have a business account, not a personal one, you have access to some additional features that can come in handy if you want to know whether people are sharing your content among themselves. Under your grid posts, you’ll see a button that says “View insights.” Tapping this will bring you to a page that shows how many accounts were reached, how many were engaged, how many people tapped through to see your profile, how many were following you already, and all kinds of other interesting data. You’ll \u003cem\u003ealso\u003c/em\u003e see, right at the top, a string of four numbers: How many accounts liked it, how many comments it got, how many shares it got, and how many saves it got. \u003c/p\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/images-2.fill.size_2000x604.v1706809352.png\" alt=\"Likes, comments, shares, and saves in Instagram analytics\" width=\"2000\" height=\"604\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/images-2.fill.size_800x242.v1706809352.png 800w, https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/images-2.fill.size_1400x423.v1706809352.png 1400w, https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/images-2.fill.size_2000x604.v1706809352.png 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003e\u003c/span\u003e\n                                        \u003cspan\u003eCredit: @ellefs0n/Instagram\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003cp\u003eThe shares and saves are important here. The rightward facing arrow that looks like a paper plane is your shares. The rectangle with a triangular cutout that looks like a bookmark is your saves. If you check this, you can’t see \u003cem\u003ewho \u003c/em\u003eis sharing or saving it, but you can get a sense of how many opps (or fans!) you have. Above, see that nine people shared my post and six saved it. What were their intentions? These are the questions that keep me up at night, but alas, I may never uncover the culprits. \u003c/p\u003e\u003cp\u003eBear in mind that if you save or share a post—meaning you send it to someone else via DM, share it to your own Story, or copy the link to send it to someone off-app—if the person has a business profile, they’ll at least know \u003cem\u003esomeone \u003c/em\u003edid. Depending on the content of the post and how many followers they have, they could narrow it down to you. (To check if someone has a business account, tap their profile. If there’s a descriptor under their name, like Journalist, Blogger, or Public figure, or buttons like “Contact,” they have a business profile.)\u003c/p\u003e\u003cp\u003eIf you\u0026#39;re the one worried someone has shared your post with ill intentions, don\u0026#39;t get ahead of yourself. Ask yourself first if you shared your own post to your Story, which would count as a share and increase the number next to that paper plane icon. \u003c/p\u003e\u003cp\u003eSpeaking of Stories, anyone with a business profile can also see the data related to their Story posts, both when the posts are active in the 24 hours after they are shared and in the Story archive. Next to the eye-shaped icon that indicates viewers, there will be an icon with three rectangles that looks like a bar graph. It reveals how many accounts were reached, how many engaged with the post, how many replies it got, etc. It also reveals \u003cem\u003eshares\u003c/em\u003e. Below is an example of a time one of my Stories got 11 shares. I was able to figure out who shared it by looking through the views and taking note of the viewers who were not my followers. Sensing nasty intentions, I blocked the original sharer. If you share someone’s Story in-app, the accounts with whom you share it will appear on the story’s viewership list, which could easily implicate you. \u003c/p\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/images-3.fill.size_2000x1067.v1706809352.png\" alt=\"Story shares on Instagram\" width=\"2000\" height=\"1067\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/images-3.fill.size_800x427.v1706809352.png 800w, https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/images-3.fill.size_1400x747.v1706809352.png 1400w, https://lifehacker.com/imagery/articles/01HNJW7RA7KH13X8AZ419B5D99/images-3.fill.size_2000x1067.v1706809352.png 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003e\u003c/span\u003e\n                                        \u003cspan\u003eCredit: @ellefs0n/Instagram\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003cp\u003eDoes any of this matter? No, we should all launch our phones into the nearest trash can Sabrina van der Woodsen-style and go touch grass. But there \u003cem\u003eare \u003c/em\u003eways people can sniff out whether you’re sharing or saving their Instagram posts, even though they won’t get a notification if you screenshot. \u003c/p\u003e\n    \u003c/article\u003e\n\n    \n                        \u003cdiv\u003e\n                \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/authors/01HF2FBECG2MQ0VEXDZ84N3QW6/image.fill.size_150x150.v1704307087.png\" alt=\"Lindsey Ellefson\" width=\"150\" height=\"150\" loading=\"lazy\"/\u003e\n                                            \u003c/p\u003e\n                \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003cp\u003eLindsey Ellefson\u003c/p\u003e\n                                    \u003cp\u003eFeatures Editor\u003c/p\u003e\n                                \u003cdiv\u003e\n                                            \u003cp\u003eLindsey Ellefson is Lifehacker’s Features Editor. She currently covers study and productivity hacks, as well as household and digital decluttering, and oversees the freelancers on the sex and relationships beat. She spent most of her pre-Lifehacker career covering media and politics for outlets like Us Weekly, CNN, The Daily Dot, Mashable, Glamour, and InStyle. In recent years, her freelancing has focused on drug use and the overdose crisis, with pieces appearing in Vanity Fair, WIRED, The New Republic, The Daily Beast, and more. Her story for BuzzFeed News won the 2022 American Journalism Online award for Best Debunking of Fake News.\u003c/p\u003e\u003cp\u003eIn addition to her journalism, Lindsey is a student at the NYU School of Global Public Health, where she is working toward her Master of Public Health and conducting research on media bias in reporting on substance use with the Opioid Policy Institute’s Reporting on Addiction initiative. She is also a Schwinn-certified spin class teacher. She won a 2023 Dunkin’ Donuts contest that earned her a year of free coffee. Lindsey lives in New York, NY.\u003c/p\u003e\n                                    \u003c/div\u003e\n                \u003cp\u003e\u003ca href=\"https://lifehacker.com/author/lindseyellefson\"\u003eRead Lindsey\u0026#39;s full bio\u003c/a\u003e\u003c/p\u003e\u003cul\u003e\n                                                    \u003cli\u003e\n                                \u003ca href=\"http://facebook.com/ellefs0n\" title=\"Find on Facebook (Opens in a new tab)\" aria-label=\"Visit Lindsey\u0026#39;s Facebook\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-facebook\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                                                            \u003cli\u003e\n                                \u003ca href=\"https://twitter.com/ellefs0n\" title=\"Find on Twitter (Opens in a new tab)\" aria-label=\"Visit Lindsey\u0026#39;s Twitter\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-twitter\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                                                            \u003cli\u003e\n                                \u003ca href=\"https://www.instagram.com/ellefs0n\" title=\"Find on Instagram (Opens in a new tab)\" aria-label=\"Visit Lindsey\u0026#39;s Instagram\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-instagram\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                                                            \u003cli\u003e\n                                \u003ca href=\"https://lifehacker.com/cdn-cgi/l/email-protection#1d717473796e786433787171787b6e72735d71747b78757c7e76786f337e7270\" title=\"Send an Email (Opens in a new tab)\" aria-label=\"Send Lindsey an email\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-envelope\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                            \u003c/ul\u003e\n                            \u003c/div\u003e\n        \u003c/div\u003e\n                \u003cdiv\u003e\n                                            \n                        \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"1\" data-ga-label=\"The ‘Magic Basket’ Method Breaks Decluttering Into Two Manageable Steps\" href=\"https://lifehacker.com/home/how-to-use-the-magic-basket-method-of-decluttering\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JEXSBMD75ZNYC3KM32GHJ497/hero-image.fill.size_75x75.v1734020171.png\" alt=\"three baskets on floor of modern, neutral living room\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                    \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"2\" data-ga-label=\"All the Winter Cleaning and Organization Tasks You Should Tackle Before the New Year\" href=\"https://lifehacker.com/home/your-winter-cleaning-and-organization-checklist\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JEVD2FCEMR6MBMDD36YD4DDK/hero-image.fill.size_75x75.v1733941298.png\" alt=\"A dusty blue cast iron radiator against a blue wall\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                                        \u003c/div\u003e\n            \u003c/div\u003e\n            \n    \n    \n                    \u003c/section\u003e\n\n                            \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-12-13T00:00:00Z",
  "modifiedTime": "2024-12-13T00:00:00Z"
}
