{
  "id": "3a2e1cdc-0786-4a28-b457-c933283b7ca0",
  "title": "US Army Should Ditch Tanks For AI Drones, Says Eric Schmidt",
  "link": "https://news.slashdot.org/story/24/10/31/2030255/us-army-should-ditch-tanks-for-ai-drones-says-eric-schmidt?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "Former Google chief Eric Schmidt thinks the US Army should expunge \"useless\" tanks and replace them with AI-powered drones instead. From a report: Speaking at the Future Investment Initiative in Saudi Arabia this week, he said: \"I read somewhere that the US had thousands and thousands of tanks stored somewhere,\" adding, \"Give them away. Buy a drone instead.\" The former Google supremo's argument is that recent conflicts, such as the war in Ukraine, have demonstrated how \"a $5,000 drone can destroy a $5 million tank.\" In fact, even cheaper drones, similar to those commercially available for consumers, have been shown in footage on social media dropping grenades through the open turret hatch of tanks. Schmidt, who was CEO of Google from 2001 to 2011, then executive chairman to 2015, and executive chairman of Alphabet to 2018, founded White Stork with the aim of supporting Ukraine's war effort. It hopes to achieve this by developing a low-cost drone that can use AI to acquire its target rather than being guided by an operator and can function in environments where GPS jamming is in operation. Notably, Schmidt also served as chair of the US government's National Security Commission on Artificial Intelligence (NSCAI), which advised the President and Congress about national security and defense issues with regard to AI. \"The cost of autonomy is falling so quickly that the drone war, which is the future of conflict, will get rid of eventually tanks, artillery, mortars,\" Schmidt predicted. Read more of this story at Slashdot.",
  "author": "msmash",
  "published": "2024-11-01T00:45:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "ai"
  ],
  "byline": "",
  "length": 1511,
  "excerpt": "Former Google chief Eric Schmidt thinks the US Army should expunge \"useless\" tanks and replace them with AI-powered drones instead. From a report: Speaking at the Future Investment Initiative in Saudi Arabia this week, he said: \"I read somewhere that the US had thousands and thousands of tanks store...",
  "siteName": "",
  "favicon": "",
  "text": "Former Google chief Eric Schmidt thinks the US Army should expunge \"useless\" tanks and replace them with AI-powered drones instead. From a report: Speaking at the Future Investment Initiative in Saudi Arabia this week, he said: \"I read somewhere that the US had thousands and thousands of tanks stored somewhere,\" adding, \"Give them away. Buy a drone instead.\" The former Google supremo's argument is that recent conflicts, such as the war in Ukraine, have demonstrated how \"a $5,000 drone can destroy a $5 million tank.\" In fact, even cheaper drones, similar to those commercially available for consumers, have been shown in footage on social media dropping grenades through the open turret hatch of tanks. Schmidt, who was CEO of Google from 2001 to 2011, then executive chairman to 2015, and executive chairman of Alphabet to 2018, founded White Stork with the aim of supporting Ukraine's war effort. It hopes to achieve this by developing a low-cost drone that can use AI to acquire its target rather than being guided by an operator and can function in environments where GPS jamming is in operation. Notably, Schmidt also served as chair of the US government's National Security Commission on Artificial Intelligence (NSCAI), which advised the President and Congress about national security and defense issues with regard to AI. \"The cost of autonomy is falling so quickly that the drone war, which is the future of conflict, will get rid of eventually tanks, artillery, mortars,\" Schmidt predicted.",
  "image": "https://a.fsdn.com/sd/topics/ai_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-175369955\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tFormer Google chief Eric Schmidt thinks the US Army should expunge \u0026#34;useless\u0026#34; tanks and \u003ca href=\"https://www.theregister.com/2024/10/30/google_ceo_tank_ai_drones/\"\u003ereplace them with AI-powered drones\u003c/a\u003e instead. From a report:\u003ci\u003e Speaking at the Future Investment Initiative in Saudi Arabia this week, he said: \u0026#34;I read somewhere that the US had thousands and thousands of tanks stored somewhere,\u0026#34; adding, \u0026#34;Give them away. Buy a drone instead.\u0026#34; \u003cp\u003e \n\nThe former Google supremo\u0026#39;s argument is that recent conflicts, such as the war in Ukraine, have demonstrated how \u0026#34;a $5,000 drone can destroy a $5 million tank.\u0026#34; In fact, even cheaper drones, similar to those commercially available for consumers, have been shown in footage on social media dropping grenades through the open turret hatch of tanks. Schmidt, who was CEO of Google from 2001 to 2011, then executive chairman to 2015, and executive chairman of Alphabet to 2018, founded White Stork with the aim of supporting Ukraine\u0026#39;s war effort. It hopes to achieve this by developing a low-cost drone that can use AI to acquire its target rather than being guided by an operator and can function in environments where GPS jamming is in operation. \u003c/p\u003e\u003cp\u003e \n\nNotably, Schmidt also served as chair of the US government\u0026#39;s National Security Commission on Artificial Intelligence (NSCAI), which advised the President and Congress about national security and defense issues with regard to AI. \u0026#34;The cost of autonomy is falling so quickly that the drone war, which is the future of conflict, will get rid of eventually tanks, artillery, mortars,\u0026#34; Schmidt predicted.\u003c/p\u003e\u003c/i\u003e\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
