{
  "id": "40bd9f0d-e761-43f1-aabf-8462b29b9abc",
  "title": "A fake Facebook event disguised as a math problem has been one of its top posts for 6 months",
  "link": "https://www.engadget.com/social-media/a-fake-facebook-event-disguised-as-a-math-problem-has-been-one-of-its-top-posts-for-6-months-231852601.html?src=rss",
  "description": "A nearly year-old Facebook event for a \"simple maths competition\" has been one of the most viral posts on the platform for six months. The \"event\" racked up about 51 million views on Facebook during the first quarter of 2025, according to the company's latest report on \"widely viewed content\" on the platform. That would be an impressive stat for any single post, but it's the second quarter in a row in which the \"maths competition\" has nabbed the number two spot on Meta's list of widely viewed content. It also appeared on last quarter's report, during which time it received about 64.3 million views, according to an archived version of the report. So why is a random Facebook event that's not really an event getting more than 100 million views? It would seem to be a repackaging of an old engagement bait tactic. The header image for the event is an image of a piece of paper with the words \"only for genius\" followed by a seemingly simple equation. When shared as a Facebook post, the image is prominently displayed in a way that may look like a normal image post. The image also has some striking similarities to other seemingly simple math equations that have been going viral on Facebook for nearly 15 years. A look at the event page itself shows that hundreds of thousands of people have engaged with the event. More than 800,000 people responded to the supposed July 8, 2024 event. Even now, nearly a year later, the event is seeing regular comments from Facebook users — most of whom are intent on earnestly explaining how the equation should be solved (or arguing with others' interpretation). As Slate noted back in 2013, there's something irresistible about arguing basic arithmetic with strangers on the internet. What is a bit of a mystery is why this post has gone so viral months after it was originally posted. I reached out to the account behind the post, a Nigerian-based creator named Ebuka Peter Ibeh and didn't immediately hear back. The post seems to be far more successful than any other recent posts from Ibeh, who has about 25,000 Facebook followers. In any case, the post offers an interesting window into the kinds of bizarre content and questionable tactics that still regularly goes mega-viral on Facebook. Meta recently said it would crack down on creators sharing spammy posts on Facebook, though it's unclear if this type of engagement bait would fall under the category of content it's explicitly trying to discourage.This article originally appeared on Engadget at https://www.engadget.com/social-media/a-fake-facebook-event-disguised-as-a-math-problem-has-been-one-of-its-top-posts-for-6-months-231852601.html?src=rss",
  "author": "Karissa Bell",
  "published": "Thu, 29 May 2025 23:18:53 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Media",
    "Arts \u0026 Entertainment",
    "Social \u0026 Online Media",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Karissa Bell"
  ],
  "byline": "Karissa Bell",
  "length": 2452,
  "excerpt": "A nearly year-old Facebook event for a \"simple maths competition\" has been one of the most viral posts on the platform for six months.",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "A nearly year-old Facebook event for a \"simple maths competition\" has been one of the most viral posts on the platform for six months. The \"event\" racked up about 51 million views on Facebook during the first quarter of 2025, according to the company's latest report on \"widely viewed content\" on the platform.That would be an impressive stat for any single post, but it's the second quarter in a row in which the \"maths competition\" has nabbed the number two spot on Meta's list of widely viewed content. It also appeared on last quarter's report, during which time it received about 64.3 million views, according to an archived version of the report.So why is a random Facebook event that's not really an event getting more than 100 million views? It would seem to be a repackaging of an old engagement bait tactic. The header image for the event is an image of a piece of paper with the words \"only for genius\" followed by a seemingly simple equation. When shared as a Facebook post, the image is prominently displayed in a way that may look like a normal image post. The image also has some striking similarities to other seemingly simple math equations that have been going viral on Facebook for nearly 15 years.A look at the event page itself shows that hundreds of thousands of people have engaged with the event. More than 800,000 people responded to the supposed July 8, 2024 event. Even now, nearly a year later, the event is seeing regular comments from Facebook users — most of whom are intent on earnestly explaining how the equation should be solved (or arguing with others' interpretation). As Slate noted back in 2013, there's something irresistible about arguing basic arithmetic with strangers on the internet.What is a bit of a mystery is why this post has gone so viral months after it was originally posted. I reached out to the account behind the post, a Nigerian-based creator named Ebuka Peter Ibeh and didn't immediately hear back. The post seems to be far more successful than any other recent posts from Ibeh, who has about 25,000 Facebook followers.In any case, the post offers an interesting window into the kinds of bizarre content and questionable tactics that still regularly goes mega-viral on Facebook. Meta recently said it would crack down on creators sharing spammy posts on Facebook, though it's unclear if this type of engagement bait would fall under the category of content it's explicitly trying to discourage.",
  "image": "https://s.yimg.com/ny/api/res/1.2/41H7SsJqRyLNoNiaJoE.WQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-05/92174120-3cda-11f0-bfff-4af0c5d69bb3",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eA nearly year-old Facebook event for a \u0026#34;simple maths competition\u0026#34; has been one of the most viral posts on the platform for six months. The \u0026#34;event\u0026#34; racked up about 51 million views on Facebook during the first quarter of 2025, according to the company\u0026#39;s \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://transparency.meta.com/data/widely-viewed-content-report/#widely-viewed-posts\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:latest report;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003elatest report\u003c/a\u003e on \u0026#34;widely viewed content\u0026#34; on the platform.\u003c/p\u003e\u003cp\u003eThat would be an impressive stat for any single post, but it\u0026#39;s the second quarter in a row in which the \u0026#34;maths competition\u0026#34; has nabbed the number two spot on Meta\u0026#39;s list of widely viewed content. It also appeared on last quarter\u0026#39;s report, during which time it received about 64.3 million views, according to an archived version of the report.\u003c/p\u003e\u003cp\u003eSo why is a random Facebook event that\u0026#39;s not really an event getting more than 100 million views? It would seem to be a repackaging of an old engagement bait tactic. The header image for the event is an image of a piece of paper with the words \u0026#34;only for genius\u0026#34; followed by a seemingly simple equation. When shared as a Facebook post, the image is prominently displayed in a way that may look like a normal image post. The image also has some striking similarities to other seemingly simple math equations that have been going viral on Facebook \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1\" href=\"https://knowyourmeme.com/memes/48293\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:for nearly 15 years.;elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1;itc:0;sec:content-canvas\"\u003efor nearly 15 years.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eA look at the event page itself shows that hundreds of thousands of people have engaged with the event. More than 800,000 people responded to the supposed July 8, 2024 event. Even now, nearly a year later, the event is seeing regular comments from Facebook users — most of whom are intent on earnestly explaining how the equation should be solved (or arguing with others\u0026#39; interpretation). As \u003cem\u003eSlate \u003c/em\u003enoted back \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1\" href=\"https://slate.com/technology/2013/03/facebook-math-problem-why-pemdas-doesnt-always-give-a-clear-answer.html\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:in 2013;elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1;itc:0;sec:content-canvas\"\u003ein 2013\u003c/a\u003e, there\u0026#39;s something irresistible about arguing basic arithmetic with strangers on the internet.\u003c/p\u003e\u003cp\u003eWhat is a bit of a mystery is why this post has gone so viral months after it was originally posted. I reached out to the account behind the post, a Nigerian-based creator named Ebuka Peter Ibeh and didn\u0026#39;t immediately hear back. The post seems to be far more successful than any other recent posts from Ibeh, who has about 25,000 Facebook followers.\u003c/p\u003e\u003cp\u003eIn any case, the post offers an interesting window into the kinds of bizarre content and questionable tactics that still regularly goes mega-viral on Facebook. Meta recently said it would crack down on creators sharing \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1\" href=\"https://www.engadget.com/social-media/meta-finally-acknowledges-that-facebook-has-a-major-spam-problem-175304372.html\" data-ylk=\"slk:spammy posts;elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1;itc:0;sec:content-canvas\"\u003espammy posts\u003c/a\u003e on Facebook, though it\u0026#39;s unclear if this type of engagement bait would fall under the category of content it\u0026#39;s explicitly trying to discourage.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-29T23:18:53Z",
  "modifiedTime": null
}
