{
  "id": "41b3997e-d990-4af3-9ded-3f41d9116351",
  "title": "People on Ozempic Are Drinking Way Less",
  "link": "https://gizmodo.com/people-on-ozempic-are-drinking-way-less-2000600281",
  "description": "Scientists are continuing to find evidence that GLP-1 medications can temper cravings for alcohol and other drugs.",
  "author": "Ed Cara",
  "published": "Fri, 09 May 2025 22:01:00 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Health",
    "alcohol",
    "GLP-1",
    "Ozempic",
    "Semaglutide"
  ],
  "byline": "Ed Cara",
  "length": 3581,
  "excerpt": "Scientists are continuing to find evidence that GLP-1 medications can temper cravings for alcohol and other drugs.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Ozempic and similar drugs aren’t just for weight loss, more and more research is finding. New data is the latest to show that GLP-1 medications help lower people’s alcohol consumption, too. Scientists in Ireland and Saudi Arabia conducted the study, which involved around 200 patients who were prescribed GLP-1 drugs to manage their obesity. They found that people not only lost weight on the drugs, they also tended to reduce their alcohol intake—by up to two-thirds for those who drank the most beforehand. The findings strengthen the case for GLP-1s as an addiction treatment, the researchers say. Semaglutide (the active ingredient in Ozempic and Wegovy) and similar GLP-1 drugs are far more effective at helping people lose weight than diet and exercise alone. But some scientists have also begun to notice that these drugs may help reduce people’s cravings for things besides food, including potentially harmful drugs like opioids, cocaine, and alcohol. Early studies have started to support these anecdotal observations as well. This new study was prospective, meaning the researchers proactively tracked how people’s alcohol use changed after starting GLP-1 therapy (many past similar studies were retrospective, which only look back in time). The study participants were real-life patients prescribed either semaglutide or liraglutide (an older GLP-1 drug) for weight loss. The participants reported their level of alcohol use before starting the drug, then were asked to come back for follow-up visits three and six months later. Overall, 188 people returned for at least one follow-up visit. And people who drank alcohol reported drinking less on average after starting a GLP-1 drug. This reduction was especially apparent in those who drank the most to begin with: high consumers (defined as drinking over 11 drinks a week) reported a 68% reduction in their alcohol use, from around 23 drinks a week on average to 8 drinks weekly. That level of reduction is comparable to the effectiveness of existing treatments for alcohol use disorder, the study researchers note. “Our results demonstrate a significant reduction in alcohol intake among patients treated with GLP-1 RAs,” they wrote in their paper, which is set to be presented this weekend at the annual European Congress on Obesity. The findings were also published earlier this year in the journal Diabetes, Obesity and Metabolism. The study does have limitations, such as a lack of a control group and a relatively small sample size. There is also still some mystery as how exactly these drugs could affect drug cravings, though it’s suspected that GLP-1 receptors in the brain regulate our response to rewarding and potentially addictive stimuli like alcohol. But the evidence is mounting for GLP-1s having another life as a treatment for substance use disorders. The authors note that there was a weak positive correlation between the amount of weight someone lost and how much less alcohol they consumed—a connection that makes sense, given how rich in calories alcoholic drinks tend to be. So at the very least, these drugs might serve a dual function for people struggling with their weight and their drinking habits at the same time, the authors say. “These findings suggest a potential therapeutic role for GLP-1 RAs in managing co-occurring obesity and alcohol use,” the researchers wrote. Ultimately, it will take randomized and controlled clinical trials to truly know whether semaglutide can become a reliable front-line option for substance use disorders, some of which are already underway.",
  "image": "https://gizmodo.com/app/uploads/2025/05/ice-cube-drink.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eOzempic and similar drugs aren’t just for weight loss, more and more research is finding. New data is the latest to show that GLP-1 medications help lower people’s alcohol consumption, too.\u003c/p\u003e \u003cp\u003eScientists in Ireland and Saudi Arabia conducted the study, which involved around 200 patients who were prescribed GLP-1 drugs to manage their obesity. They found that people not only lost weight on the drugs, they also tended to reduce their alcohol intake—by up to two-thirds for those who drank the most beforehand. The findings strengthen the case for GLP-1s as an addiction treatment, the researchers say.\u003c/p\u003e \u003cp\u003eSemaglutide (the active ingredient in Ozempic and Wegovy) and similar GLP-1 drugs are \u003ca href=\"https://gizmodo.com/semaglutide-tirzepatide-weight-loss-drugs-future-uses-1851116318\"\u003efar more effective\u003c/a\u003e at helping people lose weight than diet and exercise alone. But some scientists have also begun to notice that these drugs may help reduce people’s cravings for things besides food, including potentially harmful drugs like opioids, cocaine, and alcohol. \u003ca href=\"https://gizmodo.com/the-case-for-ozempic-as-a-addiction-treatment-keeps-getting-better-2000513096\"\u003eEarly\u003c/a\u003e \u003ca href=\"https://gizmodo.com/glp-1-drugs-like-ozempic-reduce-cocaine-cravings-case-study-finds-2000565524\"\u003estudies\u003c/a\u003e \u003ca href=\"https://gizmodo.com/losing-weight-with-ozempic-might-also-lighten-your-bar-tab-study-finds-2000530051\"\u003ehave\u003c/a\u003e started to support these anecdotal observations as well.\u003c/p\u003e   \u003cp\u003eThis new study was prospective, meaning the researchers proactively tracked how people’s alcohol use changed after starting GLP-1 therapy (many past similar studies were retrospective, which only look back in time). The study participants were real-life patients prescribed either semaglutide or liraglutide (an older GLP-1 drug) for weight loss. The participants reported their level of alcohol use before starting the drug, then were asked to come back for follow-up visits three and six months later.\u003c/p\u003e\n\n \u003cp\u003eOverall, 188 people returned for at least one follow-up visit. And people who drank alcohol reported drinking less on average after starting a GLP-1 drug. This reduction was especially apparent in those who drank the most to begin with: high consumers (defined as drinking over 11 drinks a week) reported a 68% reduction in their alcohol use, from around 23 drinks a week on average to 8 drinks weekly. That level of reduction is comparable to the effectiveness of existing treatments for alcohol use disorder, the study researchers note.\u003c/p\u003e \u003cp\u003e“Our results demonstrate a significant reduction in alcohol intake among patients treated with GLP-1 RAs,” they wrote in their paper, which is set to be \u003ca href=\"https://www.eurekalert.org/news-releases/1083036\"\u003epresented\u003c/a\u003e this weekend at the annual European Congress on Obesity. The findings were also \u003ca href=\"https://dom-pubs.onlinelibrary.wiley.com/doi/10.1111/dom.16152\"\u003epublished\u003c/a\u003e earlier this year in the journal Diabetes, Obesity and Metabolism.\u003c/p\u003e \u003cp\u003eThe study does have limitations, such as a lack of a control group and a relatively small sample size. There is also still some mystery as how exactly these drugs could affect drug cravings, though it’s suspected that GLP-1 receptors in the brain regulate our response to rewarding and potentially addictive stimuli like alcohol. But the evidence is mounting for GLP-1s having another life as a treatment for substance use disorders.\u003c/p\u003e\n\n   \u003cp\u003eThe authors note that there was a weak positive correlation between the amount of weight someone lost and how much less alcohol they consumed—a connection that makes sense, given how rich in calories alcoholic drinks tend to be. So at the very least, these drugs might serve a dual function for people struggling with their weight and their drinking habits at the same time, the authors say.\u003c/p\u003e \u003cp\u003e“These findings suggest a potential therapeutic role for GLP-1 RAs in managing co-occurring obesity and alcohol use,” the researchers wrote.\u003c/p\u003e\n\n \u003cp\u003eUltimately, it will take randomized and controlled clinical trials to truly know whether semaglutide can become a reliable front-line option for substance use disorders, some of which are \u003ca href=\"https://clinicaltrials.gov/study/NCT06015893?cond=Alcohol%20Use%20Disorder\u0026amp;intr=semaglutide\u0026amp;rank=4\"\u003ealready underway\u003c/a\u003e.\u003c/p\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-09T22:01:00Z",
  "modifiedTime": "2025-05-09T22:01:00Z"
}
