{
  "id": "424b9b35-eb8e-4ba2-b313-5cfdf4c19ed7",
  "title": "Landmark digital declaration from EU ministers ignites calls to cut startup regulation",
  "link": "https://thenextweb.com/news/landmark-digital-declaration-from-eu-ministers-ignites-calls-to-cut-startup-regulation",
  "description": "A coalition of European startups has urged swift action to slash burdensome EU regulations after a landmark declaration from the D9+ group of digitally advanced nations. The declaration stressed the need for “removing barriers” and “simplifying EU rules and procedures.” Ministers from all 13 countries in the D9+ — Belgium, the Czech Republic, Denmark, Estonia, Finland, Ireland, Luxembourg, the Netherlands, Poland, Portugal, Slovenia, Spain, and Sweden — signed the statement. They emphasised the need for a “reviewed digital rulebook” that is “deregulated where possible” and “avoids unnecessary red tape.” A startup group has called for the ministers to back up their…This story continues at The Next Web",
  "author": "Thomas Macaulay",
  "published": "Thu, 27 Mar 2025 21:40:29 +0000",
  "source": "https://thenextweb.com/feed/",
  "categories": [
    "Insider",
    "Startups and technology",
    "Next Featured",
    "Government and policy",
    "Ecosystems"
  ],
  "byline": "Thomas Macaulay",
  "length": 3742,
  "excerpt": "A group of European startups has called for rapid action to slash EU regulations after a landmark declaration from the D9+ countries.",
  "siteName": "TNW | Ecosystems",
  "favicon": "https://next.tnwcdn.com/assets/img/favicon/favicon-194x194.png",
  "text": "A coalition of European startups has urged swift action to slash burdensome EU regulations after a landmark declaration from the D9+ group of digitally advanced nations. The declaration stressed the need for “removing barriers” and “simplifying EU rules and procedures.” Ministers from all 13 countries in the D9+ — Belgium, the Czech Republic, Denmark, Estonia, Finland, Ireland, Luxembourg, the Netherlands, Poland, Portugal, Slovenia, Spain, and Sweden — signed the statement. They emphasised the need for a “reviewed digital rulebook” that is “deregulated where possible” and “avoids unnecessary red tape.” A startup group has called for the ministers to back up their words with actions. The S9+ Coalition — founded to give startups a voice in the policy agenda of the D9+ — warned that Europe’s “excessive and fragmented regulation” has become a self-imposed barrier. “If this declaration is to matter, the next step is clear: D9+ countries must push their colleagues in the [European] Council to simplify, harmonise, and reduce the burden of EU digital regulation — and to make Europe more attractive for investment in innovation,” Peter Kofler, chairman of S9+ member Danish Entrepreneurs, told TNW. The S9+ argues that startups are the foundation of economic growth. The claim is based on solid ground. According to Dealroom.co, just 0.01% of companies create 34% of all economic value — and they all start as startups. Europe, however, has struggled to turn promising companies into big businesses. Not a single EU company started from scratch in the last 50 years has a market capitalisation over €100 billion. In the same period, all six US companies with a valuation above €1 trillion were created. Hopes and fears for EU startups In recent years, Europe has fallen further behind the US in productivity and suffered from a declining share of global tech revenue. The continent’s leading startups now often look overseas to scale. Between 2008 and 2021, almost 30% of European startups valued at over $1 billion relocated their headquarters abroad. The vast majority moved to the US.   Many of their issues in Europe are attributed to stifling regulation. GDPR, for instance, cost small IT companies over 12% of their profits, according to estimates by three Oxford University economists. In a declaration of its own, the S9+ warned that “Europe cannot regulate its way out of stagnation.” The declaration proposes concrete actions to tackle the problem. Among its recommendations are rapidly implementing the 28th regime — a proposed single set of rules for the entire EU — and providing tech-friendly zones, with regulatory “sandboxes” alongside a gradual increase in regulatory requirements. AI regulation is a particular concern for the S9+. The coalition urged the EU to develop a regulatory framework that fosters AI innovation while ensuring fair and open data access. New compliance frameworks, the S9+ stressed, should be restricted to what’s “absolutely necessary” — and only introduced after consulting startups. The S9+ also emphasised the need to focus on emerging companies, rather than prioritising the demands of traditional industry giants. “Startups are not asking for special treatment,” Kofler said. “We are asking for a level playing field — for access to capital, data, infrastructure, and markets. If Europe wants to close its €800 billion investment gap, it won’t happen by giving old subsidies to old players. It will happen by unleashing the capital and ideas that startups already bring.” European startups are the heartbeat of TNW Conference, which takes place on June 19-20 in Amsterdam. Tickets for the event are now on sale. Use the code TNWXMEDIA2025 at the check-out to get 30% off the price tag.",
  "image": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1\u0026fit=1280%2C640\u0026url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2025%2F03%2FUntitled-design-56.jpg\u0026signature=c4ca7b3b8b98d054b136146c8e1dfbde",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-main-content\"\u003e\n                            \u003cp\u003e\u003cspan\u003eA coalition of European startups has urged swift action to slash burdensome EU regulations after a \u003c/span\u003e\u003ca href=\"https://open.overheid.nl/documenten/3584843f-5293-404a-a94b-9f078db4ecbe/file\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003elandmark declaration\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e from the D9+ group of digitally advanced nations.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe declaration stressed the need for “removing barriers” and “simplifying EU rules and procedures.” Ministers from all 13 countries in the D9+ — Belgium, the Czech Republic, Denmark, Estonia, Finland, Ireland, Luxembourg, the Netherlands, Poland, Portugal, Slovenia, Spain, and Sweden — signed the statement.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThey emphasised the need for a “reviewed digital rulebook” that is “deregulated where possible” and “avoids unnecessary red tape.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eA startup group has called for the ministers to back up their words with actions. The \u003c/span\u003e\u003ca href=\"https://s9plus.eu/\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003eS9+ Coalition\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e — founded to give startups a voice in the policy agenda of the D9+ — warned that Europe’s “excessive and fragmented regulation” has become a self-imposed barrier.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“If this declaration is to matter, the next step is clear: D9+ countries must push their colleagues in the [European] Council to simplify, harmonise, and reduce the burden of EU digital regulation — and to make Europe more attractive for investment in innovation,” Peter Kofler, chairman of S9+ member Danish Entrepreneurs, told TNW.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe S9+ argues that startups are the foundation of economic growth. The claim is based on solid ground. According to Dealroom.co, just 0.01% of companies create 34% of all economic value — and they all start as \u003ca href=\"https://thenextweb.com/topic/startups\" target=\"_blank\" rel=\"noopener\"\u003estartups\u003c/a\u003e.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eEurope, however, \u003ca href=\"https://thenextweb.com/news/eu-must-close-innovation-gap-existential-challenge-draghi-report\" target=\"_blank\" rel=\"noopener\"\u003ehas struggled\u003c/a\u003e to turn promising companies into big businesses. Not a single EU company started from scratch in the last 50 years has a market capitalisation over €100 billion. In the same period, all six US companies with a valuation above €1 trillion were created.\u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003eHopes and fears for EU startups\u003c/h2\u003e\n\u003cp\u003e\u003cspan\u003eIn recent years, \u003ca href=\"https://thenextweb.com/topic/europe\" target=\"_blank\" rel=\"noopener\"\u003eEurope\u003c/a\u003e has fallen further behind the US in productivity and suffered from a declining share of global tech revenue. The continent’s leading startups now often look overseas to scale. Between 2008 and 2021, almost 30% of European startups valued at over $1 billion \u003c/span\u003e\u003cspan\u003erelocated\u003c/span\u003e\u003cspan\u003e their headquarters\u003c/span\u003e\u003cspan\u003e abroad. The vast majority moved to the US.  \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eMany of their issues in Europe are attributed to stifling regulation. GDPR, for instance, cost small IT companies over 12% of their profits, \u003c/span\u003e\u003ca href=\"https://oms-www.files.svdcdn.com/production/downloads/Privacy-Regulation-and-Firm-Performance-Giorgio-WP-Upload-2022-1.pdf\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003eaccording to\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e estimates by three Oxford University economists.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIn \u003c/span\u003e\u003ca href=\"https://s9plus.eu/wp-content/uploads/2025/03/S9-DECLARATION.pdf\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003ea declaration\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e of its own, the S9+ warned that “Europe cannot regulate its way out of stagnation.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe declaration proposes concrete actions to tackle the problem. Among its recommendations are rapidly implementing \u003c/span\u003e\u003ca href=\"https://www.reuters.com/markets/europe/commission-wants-one-set-rules-across-eu-innovative-firms-2025-01-21/\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003ethe 28th regime\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e — a proposed single set of rules for the entire EU — and providing tech-friendly zones, with regulatory “sandboxes” alongside a gradual increase in regulatory requirements.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAI regulation is a particular concern for the S9+. The coalition urged the EU to develop a regulatory framework that fosters \u003ca href=\"https://thenextweb.com/topic/artificial-intelligence\" target=\"_blank\" rel=\"noopener\"\u003eAI\u003c/a\u003e innovation while ensuring fair and open data access. New compliance frameworks, the S9+ stressed, should be restricted to what’s “absolutely necessary” — and only introduced after consulting startups.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe S9+ also emphasised the need to focus on emerging companies, rather than prioritising the demands of traditional industry giants.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Startups are not asking for special treatment,” Kofler said. “We are asking for a level playing field — for access to capital, data, infrastructure, and markets. If Europe wants to close its \u003c/span\u003e\u003ca href=\"https://www.politico.eu/article/mario-draghi-report-says-eu-must-spend-twice-as-much-after-wwii/\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003e€800 billion\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e investment gap, it won’t happen by giving old subsidies to old players. It will happen by unleashing the capital and ideas that startups already bring.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eEuropean startups are the heartbeat of \u003ca href=\"https://bit.ly/41IbD3D\" target=\"_blank\" rel=\"nofollow noopener\"\u003eTNW Conference\u003c/a\u003e, which takes place on June 19-20 in Amsterdam. \u003cspan\u003eTickets for the event are \u003c/span\u003e\u003ca href=\"https://bit.ly/4hueZwX\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003enow on sale\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. Use the code TNWXMEDIA2025 at the check-out to get 30% off the price tag.\u003c/span\u003e\u003c/em\u003e\u003c/p\u003e\n                        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-27T21:40:29Z",
  "modifiedTime": "2025-03-28T10:15:28Z"
}
