{
  "id": "46b1919f-1729-4dbc-8f44-2eeab4e1065a",
  "title": "Google says a technical issue caused some users’ Maps Timeline data to be deleted",
  "link": "https://www.engadget.com/apps/google-says-a-technical-issue-caused-some-users-maps-timeline-data-to-be-deleted-214358403.html?src=rss",
  "description": "After weeks of some Google Maps users reporting that their Timelines had been wiped of all the places they’ve visited, as spotted by 9to5Google earlier this month, Google has confirmed that some users’ data was deleted and is, in some cases, unrecoverable. In a statement to The Verge, Google spokesperson Genevieve Park said, “We briefly experienced a technical issue that caused the deletion of Timeline data for some people.” Only users who had backups turned on will be able to restore their Timelines, according to the statement. Google recently switched to on-device storage for Timeline data, and backups don’t appear to be on by default. To enable them, you have to go into Your Timeline in the Maps app and update the settings from the cloud icon there. The incident caused some users to lose years’ worth of location history. And while some who had backups enabled prior to the issue have said they were able to restore their Timeline data, others on Reddit said they weren’t able to get it all back even after importing their backups. This article originally appeared on Engadget at https://www.engadget.com/apps/google-says-a-technical-issue-caused-some-users-maps-timeline-data-to-be-deleted-214358403.html?src=rss",
  "author": "Cheyenne MacDonald",
  "published": "Sun, 23 Mar 2025 21:44:01 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Software",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Cheyenne MacDonald"
  ],
  "byline": "Cheyenne MacDonald",
  "length": 1044,
  "excerpt": "Users began reporting earlier this month that their Timeline data was gone, and Google has now confirmed it was deleted for some.",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "After weeks of some Google Maps users reporting that their Timelines had been wiped of all the places they’ve visited, as spotted by 9to5Google earlier this month, Google has confirmed that some users’ data was deleted and is, in some cases, unrecoverable. In a statement to The Verge, Google spokesperson Genevieve Park said, “We briefly experienced a technical issue that caused the deletion of Timeline data for some people.” Only users who had backups turned on will be able to restore their Timelines, according to the statement.Google recently switched to on-device storage for Timeline data, and backups don’t appear to be on by default. To enable them, you have to go into Your Timeline in the Maps app and update the settings from the cloud icon there. The incident caused some users to lose years’ worth of location history. And while some who had backups enabled prior to the issue have said they were able to restore their Timeline data, others on Reddit said they weren’t able to get it all back even after importing their backups.",
  "image": "https://s.yimg.com/ny/api/res/1.2/OMCEmEUUa7mfr6TSJtoDhA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-03/bf1d1f40-082e-11f0-9b3d-be886c89f124",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eAfter weeks of some Google Maps users reporting that their Timelines had been wiped of all the places they’ve visited, as spotted by \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://9to5google.com/2025/03/07/google-maps-timeline-missing/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:9to5Google;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003e9to5Google\u003c/em\u003e\u003c/a\u003e earlier this month, Google has confirmed that some users’ data was deleted and is, in some cases, unrecoverable. In a statement to \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://www.theverge.com/news/634442/google-maps-timeline-data-deleted-cloud-backup-recovery\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:The Verge;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003e\u003cins\u003eThe Verge\u003c/ins\u003e\u003c/em\u003e\u003c/a\u003e, Google spokesperson Genevieve Park said, “We briefly experienced a technical issue that caused the deletion of Timeline data for some people.” Only users who had backups turned on will be able to restore their Timelines, according to the statement.\u003c/p\u003e\u003cp\u003eGoogle recently \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://www.engadget.com/google-maps-will-let-you-store-your-location-on-your-phone-instead-the-cloud-170041432.html\" data-ylk=\"slk:switched to on-device storage for Timeline;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cins\u003eswitched to on-device storage for Timeline\u003c/ins\u003e\u003c/a\u003e data, and backups don’t appear to be on by default. To enable them, you have to go into Your Timeline in the Maps app and update the settings from the cloud icon there. The incident caused some users to lose years’ worth of location history. And while some who had backups enabled prior to the issue have said they were able to restore their Timeline data, others on \u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://www.reddit.com/r/GooglePixel/comments/1jgs0ur/google_accidentally_deletes_google_maps_timelines/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Reddit;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cins\u003eReddit\u003c/ins\u003e\u003c/a\u003e said they weren’t able to get it all back even after importing their backups.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-23T21:44:01Z",
  "modifiedTime": null
}
