{
  "id": "48541b31-e414-4ffb-97e7-eb1f0b2be53e",
  "title": "Dutch carbon capture startup Skytree opens offices in US, Canada",
  "link": "https://thenextweb.com/news/dutch-carbon-capture-startup-skytree-opens-offices-in-us-canada",
  "description": "Dutch startup Skytree has opened a new HQ in Toronto, Canada and a new office in Nashville, Tennessee, as it looks to cash-in on attractive government incentives for direct carbon capture (DAC) technologies.  Engineer-turned-entrepreneur Max Beaumont founded Skytree in 2014, following his work on DAC for the European Space Agency. Skytree’s technology is based on the carbon scrubbers used aboard the International Space Station, which remove the excess CO2 produced from the breath of astronauts.    Direct air capture DAC machines suck CO2 from the air like a giant vacuum. The CO2 they capture can be buried underground or mineralised into…This story continues at The Next Web",
  "author": "Siôn Geschwindt",
  "published": "Fri, 18 Oct 2024 12:37:12 +0000",
  "source": "https://thenextweb.com/feed/",
  "categories": [
    "Startups and technology",
    "Sustainability"
  ],
  "byline": "Siôn Geschwindt",
  "length": 3510,
  "excerpt": "Dutch startup Skytree looks to North America to cash-in on attractive government incentives for direct carbon capture (DAC) technologies.",
  "siteName": "TNW | Sustainability",
  "favicon": "https://next.tnwcdn.com/assets/img/favicon/favicon-194x194.png",
  "text": "Dutch startup Skytree has opened a new HQ in Toronto, Canada and a new office in Nashville, Tennessee, as it looks to cash-in on attractive government incentives for direct carbon capture (DAC) technologies.  Engineer-turned-entrepreneur Max Beaumont founded Skytree in 2014, following his work on DAC for the European Space Agency. Skytree’s technology is based on the carbon scrubbers used aboard the International Space Station, which remove the excess CO2 produced from the breath of astronauts.    Direct air capture DAC machines suck CO2 from the air like a giant vacuum. The CO2 they capture can be buried underground or mineralised into rock for construction. It can also be used to make anything from cleaner chemicals to sustainable aviation fuel for aircraft.  “Skytree is among only a few companies in the world with DAC units already operating successfully in the field,” said CEO Rob van Straten. “We are eager to offer industry partners a viable, economical pathway to turn atmospheric CO2 into valuable inputs — or to store it safely and indefinitely underground.” The The latest rumblings from the EU tech scene, a story from our wise ol' founder Boris, and some questionable AI art. It's free, every week, in your inbox. Sign up now!Skytree has built two carbon-sucking devices. One, Skytree Cumulus, produces 20kg of CO2 daily. It is targetted at small-scale applications such as vertical farming and cannabis cultivation. Farmers use the gas to boost plant growth.  The other unit, Stratus, is much bigger. It captures up to 1000kg of CO2 per day. Skytree designed Stratus for industrial-scale applications, such as for large greenhouses and green cement plants or for burial underground.    The Stratus units are modular, so they can be stacked together to make one, much larger machine which Skytree calls the “Stratus Hub.” The startup is planning to build one of these hubs at its base in Amsterdam. Once up and running, the company expects the machine to suck up 50,000 tonnes of CO2 per year.  Developed over more than a decade, Skytree said it has achieved level 9 on the technology readiness scale, the highest possible. This means Skytree is poised for full-scale commercial deployment, a rare thing in the budding carbon capture industry. Skytree’s first customers have largely been greenhouses. The company also recently announced plans to install a Stratus unit at the offices of Deep Sky, a fellow DAC company from Canada. Now it’s looking to scale up and into new industries including food and beverage.  Cashing in on climate tech funding    “The US continues to demonstrate growing demand for proven, cost-effective, scalable DAC technology driven by the needs of industry and with the backing by government,” said van Straten.   Skytree said it chose Nashville for its office partly due to its close proximity to its manufacturing partner Scanfil. The Swedish firm will make the Stratus and Cumulus machines at its factory in the nearby city of Atlanta.   Skytree said it chose Toronto for its North American HQ due to the city’s strong climate tech ecosystem and access to talent. In addition to Deep Sky, Skytree already has a partnership with Canadian vertical farming company Fieldless Farms, which uses the captured CO2 to improve the yields from its strawberry plants.   “As part of Toronto’s passionate climate-focused tech community, I am confident that Skytree will make a meaningful impact not only here but across the globe,” said Olivia Chow, Toronto’s mayor.",
  "image": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1\u0026fit=1280%2C640\u0026url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2024%2F10%2Fskytree-carbon-capture.jpg\u0026signature=5573e3633c5487fd6b789a22fd28f000",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-main-content\"\u003e\n                            \u003cp\u003e\u003cspan\u003eDutch \u003ca href=\"https://thenextweb.com/topic/startups\" target=\"_blank\" rel=\"noopener\"\u003estartup\u003c/a\u003e Skytree has opened a new HQ in Toronto, Canada and a new office in Nashville, Tennessee, as it looks to cash-in on attractive government incentives for direct carbon capture (DAC) technologies. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eEngineer-turned-entrepreneur Max Beaumont founded Skytree in 2014, following his work on DAC for the \u003ca href=\"https://thenextweb.com/topic/european-space-agency\" target=\"_blank\" rel=\"noopener\"\u003eEuropean Space Agency\u003c/a\u003e. Skytree’s technology is based on the carbon scrubbers used aboard the International Space Station, which remove the excess CO2 produced from the breath of astronauts.   \u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003eDirect air capture\u003c/h2\u003e\n\u003cp\u003e\u003cspan\u003eDAC machines suck CO2 from the air like a giant vacuum. The CO2 they capture can be buried underground or \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/carbon-removal-startup-paebbl-funding\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003emineralised into rock\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e for construction. It can also be used to make anything from \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/google-backs-danish-startup-again-funding-bacteria-turn-co2-into-valuable-chemicals\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003ecleaner chemicals\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e to \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/uk-startup-saf-plant-oxford-airport-in-quest-for-greener-skies\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003esustainable aviation fuel\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e for aircraft. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Skytree is among only a few companies in the world with DAC units already operating successfully in the field,” said CEO Rob van Straten. “We are eager to offer industry partners a viable, economical pathway to turn atmospheric CO2 into valuable inputs — or to store it safely and indefinitely underground.”\u003c/span\u003e\u003c/p\u003e\n\u003cdiv id=\"hs-embed-tnw\"\u003e\u003cp\u003e\u003cimg src=\"https://s3.eu-west-1.amazonaws.com/tnw.events/hardfork-2018/uploads/visuals/tnw-newsletter.png\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe \u003c/p\u003e\u003cp\u003eThe latest rumblings from the EU tech scene, a story from our wise ol\u0026#39; founder Boris, and some questionable AI art. It\u0026#39;s free, every week, in your inbox. Sign up now!\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eSkytree has built two carbon-sucking devices. One, Skytree Cumulus\u003c/span\u003e\u003cspan\u003e, produces 20kg of CO2 daily. It is targetted at small-scale applications such as vertical farming and cannabis cultivation. Farmers use the gas to boost plant growth.  \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe other unit, Stratus, is much bigger. It captures up to 1000kg of CO2 per day. Skytree designed Stratus for industrial-scale applications, such as for large greenhouses and \u003ca href=\"https://thenextweb.com/news/swedish-startup-cemvision-green-cement-vattenfall\" target=\"_blank\" rel=\"noopener\"\u003egreen cement\u003c/a\u003e plants or for burial underground.   \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe Stratus units are modular, so they can be stacked together to make one, much larger machine which Sk\u003c/span\u003e\u003cspan\u003eytree calls the “\u003c/span\u003e\u003cspan\u003eStratus Hub.” The startup is planning to build one of these hubs at its base in Amsterdam. Once up and running, the company expects the machine to suck up 50,000 tonnes of CO2 per year.\u003c/span\u003e\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eDeveloped over more than a decade, Skytree \u003c/span\u003e\u003cspan\u003esaid it has achieved level 9 on the technology readiness scale, the highest possible. This means Skytree is poised for full-scale commercial deployment, a rare thing in the budding carbon capture industry.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eSkytree’s first customers have largely been greenhouses. The company also recently announced \u003c/span\u003e\u003ca href=\"https://www.skytree.eu/press-room/deep-sky-to-deploy-skytree-dac-unit\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003eplans\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e to install a Stratus unit at the offices of Deep Sky, a fellow DAC company from Canada. Now it’s looking to scale up and into new industries including food and beverage. \u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cb\u003eCashing in on climate tech funding   \u003c/b\u003e\u003c/h2\u003e\n\n\u003cp\u003e\u003cspan\u003e“The US continues to demonstrate growing demand for proven, cost-effective, scalable DAC technology driven by the needs of industry and with the backing by government,” said van Straten.  \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eSkytree said it chose Nashville for its office partly due to its close proximity to its manufacturing partner Scanfil. The Swedish firm will make the Stratus and Cumulus machines at its factory in the nearby city of Atlanta.  \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eSkytree said it chose Toronto for its North American HQ due to the city’s strong climate tech ecosystem and access to talent. In addition to Deep Sky, Skytree already has a partnership with Canadian vertical farming company Fieldless Farms, which uses the captured CO2 to improve the yields from its strawberry plants.  \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“As part of Toronto’s passionate climate-focused tech community, I am confident that Skytree will make a meaningful impact not only here but across the globe,” said Olivia Chow, Toronto’s mayor.\u003c/span\u003e\u003c/p\u003e\n\n                        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-10-18T12:37:12Z",
  "modifiedTime": "2024-10-18T12:37:13Z"
}
