{
  "id": "4a3cd076-e365-41e4-9c97-0b25dc6c1240",
  "title": "You Won’t Need Disney+ to Watch Agatha All Along‘s Behind-the-Scenes Documentary",
  "link": "https://gizmodo.com/agatha-all-along-assembled-where-to-watch-disney-plus-youtube-2000524325",
  "description": "The Marvel series starring Kathryn Hahn as the titular witch will share its \"Assembled\" special on YouTube.",
  "author": "Cheryl Eddy",
  "published": "Wed, 13 Nov 2024 23:30:47 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Television",
    "Agatha All Along",
    "disney",
    "Marvel"
  ],
  "byline": "Cheryl Eddy",
  "length": 2228,
  "excerpt": "The Marvel series starring Kathryn Hahn as the titular witch will share its \"Assembled\" special on YouTube.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Agatha All Along‘s last witches standing headed off on a new journey when the series ended just before Halloween, but before we see what’s next for them (still no season two announcement, for what it’s worth…), it’s time to look back down the Witches’ Road. “Marvel Studios’ Assembled: The Making of Agatha All Along” is the latest behind-the-scenes doc for a Marvel Disney+ series, with an accessible twist: it’ll hit YouTube, so even folks without a Disney+ subscription can check it out. The “Assembled” hits YouTube at 6 p.m. PT tonight: Marvel Entertainment’s YouTube page has a playlist going of “Assembled” specials past, but most don’t make their debut there; the studio also does them for Marvel movies, and the newly released Deadpool \u0026 Wolverine “Assembled” is currently only viewable on Disney+. Premiering the Agatha All Along special on YouTube is a little bit confusing—you have to think most fans have Disney+ already (where the special will presumably also live after it hits YouTube). And fans who haven’t watched the show yet won’t want to view the “Assembled” first, because it’ll no doubt contain spoilers. However, any time you can get some free Disney+ content without signing on a dotted line is something to be celebrated, and hope that it signals Marvel’s continuing excitement about promoting the show. Here’s the Disney+ description for the WandaVision spinoff: “The infamous Agatha Harkness finds herself down and out of power after a suspicious goth Teen helps break her free from a distorted spell. Her interest is piqued when he begs her to take him on the legendary Witches’ Road, a magical gauntlet of trials that, if survived, rewards a witch with what they’re missing. Together, Agatha and this mysterious Teen pull together a desperate coven, and set off down, down, down The Road…” The coven, er, cast includes Kathryn Hahn, Joe Locke, Sasheer Zamata, Ali Ahn, Patti LuPone, and Aubrey Plaza. Will you be assembling in front of YouTube to learn more about Agatha All Along? Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2024/11/Agatha_Assembled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003e\u003cem\u003eAgatha All Along\u003c/em\u003e‘s last witches standing headed off on a new journey \u003ca href=\"https://gizmodo.com/agatha-all-along-finale-recap-marvel-mcu-wiccan-death-2000518864\"\u003ewhen the series ended\u003c/a\u003e just before Halloween, but before we see what’s next for them (still \u003ca href=\"https://gizmodo.com/agatha-all-along-could-potentially-cast-a-spell-for-more-seasons-2000520848\"\u003eno season two announcement\u003c/a\u003e, for what it’s worth…), it’s time to look back down the Witches’ Road. “Marvel Studios’ Assembled: The Making of \u003cem\u003eAgatha All Along\u003c/em\u003e” is the latest \u003ca href=\"https://gizmodo.com/10-things-we-learned-x-men-97-marvel-assembled-disney-1851495326\"\u003ebehind-the-scenes doc\u003c/a\u003e for a Marvel Disney+ series, with an accessible twist: it’ll hit YouTube, so even folks without a Disney+ subscription can check it out.\u003c/p\u003e \u003cp\u003eThe “Assembled” hits YouTube at 6 p.m. PT tonight:\u003c/p\u003e \u003cp\u003e\u003ciframe loading=\"lazy\" title=\"Marvel Studios’ Assembled: The Making of Agatha All Along\" width=\"500\" height=\"281\" src=\"about:blank\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\" data-rocket-lazyload=\"fitvidscompatible\" data-lazy-src=\"https://www.youtube.com/embed/G0LxA8vGSGo?feature=oembed\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\n \u003cp\u003eMarvel Entertainment’s YouTube page has a playlist going of “Assembled” specials past, but most don’t make their debut there; the studio also does them for Marvel movies, and the newly released \u003cem\u003eDeadpool \u0026amp; Wolverine\u003c/em\u003e “Assembled” is currently only viewable on Disney+.\u003c/p\u003e \u003cp\u003ePremiering the \u003cem\u003eAgatha All Along\u003c/em\u003e special on YouTube is a little bit confusing—you have to think most fans have Disney+ already (where the special will presumably also live after it hits YouTube). And fans who haven’t watched the show yet won’t want to view the “Assembled” first, because it’ll no doubt contain spoilers. However, any time you can get some free Disney+ content without signing on a dotted line is something to be celebrated, and hope that it signals Marvel’s continuing excitement about promoting the show.\u003c/p\u003e\n\n \u003cp\u003eHere’s the Disney+ description for the \u003cem\u003eWandaVision\u003c/em\u003e spinoff: “The infamous Agatha Harkness finds herself down and out of power after a suspicious goth Teen helps break her free from a distorted spell. Her interest is piqued when he begs her to take him on the legendary Witches’ Road, a magical gauntlet of trials that, if survived, rewards a witch with what they’re missing. Together, Agatha and this mysterious Teen pull together a desperate coven, and set off down, down, down The Road…”\u003c/p\u003e \u003cp\u003eThe coven, er, cast includes Kathryn Hahn, Joe Locke, Sasheer Zamata, Ali Ahn, Patti LuPone, and Aubrey Plaza. Will you be assembling in front of YouTube to learn more about \u003cem\u003eAgatha All Along\u003c/em\u003e?\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-13T23:30:47Z",
  "modifiedTime": "2024-11-13T23:30:47Z"
}
