{
  "id": "5009085e-d180-4557-8a34-e5ee30f5b3de",
  "title": "Doc of Chucky Digs Into (Nearly) Every Detail About the Child’s Play Series",
  "link": "https://gizmodo.com/doc-of-chucky-digs-into-nearly-every-detail-about-the-childs-play-series-2000518939",
  "description": "Don Mancini, Jennifer Tilly, Brad Dourif, and more horror stars reminisce in Thommy Hutson's five-hour documentary.",
  "author": "Cheryl Eddy",
  "published": "Fri, 01 Nov 2024 00:15:28 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Horror",
    "Child's Play",
    "Chucky",
    "Doc of Chucky",
    "Don Mancini",
    "Jennifer Tilly"
  ],
  "byline": "Cheryl Eddy",
  "length": 6932,
  "excerpt": "Don Mancini, Jennifer Tilly, Brad Dourif, and more horror stars reminisce in Thommy Hutson's five-hour documentary.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Don Mancini, Jennifer Tilly, Brad Dourif, and more horror stars reminisce in Thommy Hutson's five-hour documentary. Chucky came to a sudden end earlier this year—but the TV show’s cancellation surely won’t be a final farewell for either the killer doll or the Child’s Play franchise. While Don Mancini and company cook up Chucky’s next adventure, the film series so far gets an affectionate, exhaustively detailed oral history in Doc of Chucky. Not to be confused with Living With Chucky, which came out last year, Doc of Chucky runs almost five hours—the signature mega-film style of director Thommy Hutson, who’s produced similarly epic takes on the Nightmare on Elm Street and Friday the 13th franchises. If five hours of Chucky feels like overkill—something the possessed Good Guy doll knows a lot about, incidentally—just think of it as a five-part series; it’s structured chronologically so you can hit pause after the discussion of each individual film if you want to. The original Child’s Play, released in 1988, rightfully gets the biggest chunk of screen time, taking up the first 90 minutes or so. Original screenplay author Mancini and producer David Kirschner, a team that went on to become the franchise’s main architects and champions, are the most frequent talking heads, but almost everyone you’d want to hear from shows up to share their memories. That includes Brad Dourif (the voice of Chucky), Alex Vincent (who played the resilient six-year-old Andy Barclay), and special effects whiz Kevin Yagher, who engineered the movie’s remarkable puppets. Tom Holland, who had a not-so-harmonious experience directing Child’s Play, also chimes in, acknowledging the behind-the-scenes troubles but still making it clear he’s glad to be a part of the Child’s Play legacy. Don Mancini. © Courtesy of Michael Perez Entertainment LLC/Shudder That’s a theme that runs throughout Doc of Chucky: everyone interviewed seems thrilled to be associated with the franchise (those that aren’t, of course, presumably declined to participate—sorry to anyone hoping to hear Justin Whalin’s thoughts on Child’s Play 3 or Katherine Heigl’s on Bride of Chucky). Each film gets a similarly structured examination, starting with the Mancini-propelled ideas for what trouble Chucky could get into next, and including the particular style of each film, casting, and fun anecdotes from the set. The interviews guide us through the production (with details on how the dolls were crafted and animated) and post-production (including editing and music) processes, and break down how each entry was received both by critics and fans. With each success, even studio execs reluctant to throw money at a maniacal toy couldn’t deny the hunger for more Child’s Play, though Doc of Chucky also delves into what the failures along the way meant for the series. When the rushed-into-theaters third film proved a disappointment (“I fucked up,” Mancini admits), several years passed before Child’s Play took a more comedic turn with Bride of Chucky, the film that introduced Chucky’s on-and-off paramour Tiffany—as well as fan-favorite performer Jennifer Tilly. The result was artistically fulfilling—”I was able to let my queer freak flag fly,” Mancini recalls with glee, noting how he specifically riffed on romantic-movie tropes for the Hollywood-set tale—and, thanks to veteran Hong Kong director Ronny Yu (a delightful interviewee), it boasted sleekly elevated visuals. The campy Bride paved the way for the even more outrageous Seed of Chucky, which marked Mancini’s directorial debut as well as the introduction of Glen/Glenda, Tiffany and Chucky’s child. Their surprisingly poignant story (“a queer kid’s tense relationship with his macho dad,” per Mancini) forms the backbone of a film inspired by melodrama as well as the work of John Waters—who played a sleazy photographer in Bride, and who pops up in Doc of Chucky to emphasize his love for the Child’s Play series. Jennifer Tilly. © Courtesy of Michael Perez Entertainment LLC/Shudder “Trash cinema is a thing that has value,” Mancini explains, and we completely agree, but Seed of Chucky—which features the infamous Chucky masturbation scene—ultimately didn’t make the desired cultural impact; its tonal shift confused audiences and critics alike. It was also, as various interviewees point out here, ahead of its time, foregrounding a trans character back in 2004. Twenty years later, it’s often cited by fans as their favorite among the series—but at the time, not everyone understood its intentions, nor its nuances. With cult appreciation for Bride and Seed of Chucky yet to come, it took awhile for Chucky to make his inevitable return; as the documentary explores, the two direct-to-video series entries that eventually followed, Curse of Chucky and Cult of Chucky, proved financially successful while also allowing Mancini and company to pivot again, focusing on scares over jokes. In these films, we meet Nica—played by Brad Dourif’s daughter, Fiona Dourif—a wheelchair user who holds her own against Chucky, first in a creepy old house and then a psychiatric hospital. Though Chucky as a character doesn’t get interviewed—understandable, since Doc of Chucky illuminates the immense effort that goes into making him come to life—we do get a good sense of how he’s evolved over the years. He’s not just a diabolical doll with a cackling laugh, though that’ll always be the backbone of his personality. He’s also a father and an occasional almost-romantic, an admirer of other sickos, and has a backstory beyond the voodoo-obsessed killer on the run we meet very briefly at the beginning of Child’s Play. The most important takeaway from Doc of Chucky is how the franchise has become a found family of sorts for its various participants over the years, with Mancini leading the charge. We hear about lasting friendships (and at least one decades-long marriage) that’ve resulted from the Child’s Play series. That sense of community is helped along by the fact that Mancini and Kirschner are fond of working with the same people whenever possible, in particular bringing back actors to either reprise their roles or play completely new characters in future Chucky projects. That includes Chucky, the series—which featured both Dourifs, Tilly, Vincent, and more—but if you’re yearning for more on the dearly departed Syfy/USA horror comedy, you won’t find it here. Neither Chucky nor the “in name only” 2019 cinematic reboot get any mention whatsoever. In the case of the latter, at least, that’s to be expected, and probably for the best. Doc of Chucky streams on Shudder starting tomorrow, November 1. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2024/10/DOC-OF-CHUCKY_topart.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n                  Don Mancini, Jennifer Tilly, Brad Dourif, and more horror stars reminisce in Thommy Hutson\u0026#39;s five-hour documentary.\n                \u003c/p\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003e\u003ca href=\"https://gizmodo.com/chucky-season-3-part-2-review-horror-comedy-no-spoilers-1851383041\"\u003e\u003cem\u003eChucky\u003c/em\u003e\u003c/a\u003e came to a sudden end \u003ca href=\"https://gizmodo.com/chucky-has-been-cancelled-but-don-mancini-says-hell-be-back-2000504710#:~:text=Best%20of%202024-,Chucky%20Has%20Been%20Cancelled%2C%20But%20Don%20Mancini,\u0026#39;He\u0026#39;ll%20Be%20Back\u0026#39;\u0026amp;text=Chucky%20lived%20before%20his%20USA,return%20be%20in%20the%20works%3F\"\u003eearlier this year\u003c/a\u003e—but the TV show’s cancellation surely won’t be a final farewell for either the killer doll or the \u003cem\u003eChild’s Play\u003c/em\u003e franchise. While Don Mancini and company cook up Chucky’s next adventure, the film series so far gets an affectionate, exhaustively detailed oral history in \u003cem\u003eDoc of Chucky\u003c/em\u003e.\u003c/p\u003e\n\n \u003cp\u003eNot to be confused with \u003ca href=\"https://gizmodo.com/living-with-chucky-doc-horror-childs-play-jennifer-till-1850237269\"\u003e\u003cem\u003eLiving With Chucky\u003c/em\u003e\u003c/a\u003e, which came out last year, \u003cem\u003eDoc of Chucky\u003c/em\u003e runs almost five hours—the signature mega-film style of director Thommy Hutson, who’s produced similarly epic takes on the \u003cem\u003eNightmare on Elm Street\u003c/em\u003e and \u003cem\u003eFriday the 13th\u003c/em\u003e franchises.\u003c/p\u003e \u003cp\u003eIf five hours of Chucky feels like overkill—something the possessed Good Guy doll knows a lot about, incidentally—just think of it as a five-part series; it’s structured chronologically so you can hit pause after the discussion of each individual film if you want to.\u003c/p\u003e\n\n \u003cp\u003eThe original \u003cem\u003eChild’s Play\u003c/em\u003e, released in 1988, rightfully gets the biggest chunk of screen time, taking up the first 90 minutes or so. Original screenplay author Mancini and producer David Kirschner, a team that went on to become the franchise’s main architects and champions, are the most frequent talking heads, but almost everyone you’d want to hear from shows up to share their memories.\u003c/p\u003e \u003cp\u003eThat includes Brad Dourif (the voice of Chucky), Alex Vincent (who played the resilient six-year-old Andy Barclay), and special effects whiz Kevin Yagher, who engineered the movie’s remarkable puppets. Tom Holland, who had a not-so-harmonious experience directing \u003cem\u003eChild’s Play\u003c/em\u003e, also chimes in, acknowledging the behind-the-scenes troubles but still making it clear he’s glad to be a part of the \u003cem\u003eChild’s Play\u003c/em\u003e legacy.\u003c/p\u003e\n\n \u003cfigure id=\"attachment_2000519062\" aria-describedby=\"caption-attachment-2000519062\"\u003e\u003cimg decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2024/10/DonMancini.jpg\" alt=\"Don Mancini\" width=\"1500\" height=\"844\" srcset=\"https://gizmodo.com/app/uploads/2024/10/DonMancini.jpg 1500w, https://gizmodo.com/app/uploads/2024/10/DonMancini-300x169.jpg 300w, https://gizmodo.com/app/uploads/2024/10/DonMancini-1024x576.jpg 1024w, https://gizmodo.com/app/uploads/2024/10/DonMancini-768x432.jpg 768w, https://gizmodo.com/app/uploads/2024/10/DonMancini-512x288.jpg 512w, https://gizmodo.com/app/uploads/2024/10/DonMancini-680x383.jpg 680w, https://gizmodo.com/app/uploads/2024/10/DonMancini-896x504.jpg 896w\" sizes=\"(max-width: 1023px) calc(100vw - 2rem), (max-width: 1279px) calc(100vw - 26rem), 680px\"/\u003e\u003cfigcaption id=\"caption-attachment-2000519062\"\u003eDon Mancini. © Courtesy of Michael Perez Entertainment LLC/Shudder\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003eThat’s a theme that runs throughout \u003cem\u003eDoc of Chucky\u003c/em\u003e: everyone interviewed seems thrilled to be associated with the franchise (those that aren’t, of course, presumably declined to participate—sorry to anyone hoping to hear Justin Whalin’s thoughts on \u003cem\u003eChild’s Play 3\u003c/em\u003e or Katherine Heigl’s on \u003cem\u003eBride of Chucky\u003c/em\u003e). Each film gets a similarly structured examination, starting with the Mancini-propelled ideas for what trouble Chucky could get into next, and including the particular style of each film, casting, and fun anecdotes from the set. The interviews guide us through the production (with details on how the dolls were crafted and animated) and post-production (including editing and music) processes, and break down how each entry was received both by critics and fans.\u003c/p\u003e \u003cp\u003eWith each success, even studio execs reluctant to throw money at a maniacal toy couldn’t deny the hunger for more \u003cem\u003eChild’s Play\u003c/em\u003e, though \u003cem\u003eDoc of Chucky\u003c/em\u003e also delves into what the failures along the way meant for the series. When the rushed-into-theaters third film proved a disappointment (“I fucked up,” Mancini admits), several years passed before \u003cem\u003eChild’s Play\u003c/em\u003e took a more comedic turn with \u003cem\u003eBride of Chucky\u003c/em\u003e, the film that introduced Chucky’s on-and-off paramour Tiffany—as well as fan-favorite performer Jennifer Tilly.\u003c/p\u003e\n\n \u003cp\u003eThe result was artistically fulfilling—”I was able to let my queer freak flag fly,” Mancini recalls with glee, noting how he specifically riffed on romantic-movie tropes for the Hollywood-set tale—and, thanks to veteran Hong Kong director Ronny Yu (a delightful interviewee), it boasted sleekly elevated visuals. The campy \u003cem\u003eBride\u003c/em\u003e paved the way for the even more outrageous \u003cem\u003eSeed of Chucky\u003c/em\u003e, which marked Mancini’s directorial debut as well as the introduction of Glen/Glenda, Tiffany and Chucky’s child. Their surprisingly poignant story (“a queer kid’s tense relationship with his macho dad,” per Mancini) forms the backbone of a film inspired by melodrama as well as the work of John Waters—who played a sleazy photographer in \u003cem\u003eBride\u003c/em\u003e, and who pops up in \u003cem\u003eDoc of Chucky\u003c/em\u003e to emphasize his love for the \u003cem\u003eChild’s Play\u003c/em\u003e series.\u003c/p\u003e \u003cfigure id=\"attachment_2000519080\" aria-describedby=\"caption-attachment-2000519080\"\u003e\u003cimg decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2024/10/JenniferTilly.jpg\" alt=\"Jennifertilly\" width=\"1500\" height=\"844\" srcset=\"https://gizmodo.com/app/uploads/2024/10/JenniferTilly.jpg 1500w, https://gizmodo.com/app/uploads/2024/10/JenniferTilly-300x169.jpg 300w, https://gizmodo.com/app/uploads/2024/10/JenniferTilly-1024x576.jpg 1024w, https://gizmodo.com/app/uploads/2024/10/JenniferTilly-768x432.jpg 768w, https://gizmodo.com/app/uploads/2024/10/JenniferTilly-512x288.jpg 512w, https://gizmodo.com/app/uploads/2024/10/JenniferTilly-680x383.jpg 680w, https://gizmodo.com/app/uploads/2024/10/JenniferTilly-896x504.jpg 896w\" sizes=\"(max-width: 1023px) calc(100vw - 2rem), (max-width: 1279px) calc(100vw - 26rem), 680px\"/\u003e\u003cfigcaption id=\"caption-attachment-2000519080\"\u003eJennifer Tilly. © Courtesy of Michael Perez Entertainment LLC/Shudder\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003e“Trash cinema is a thing that has value,” Mancini explains, and we completely agree, but \u003cem\u003eSeed of Chucky\u003c/em\u003e—which features the infamous Chucky masturbation scene—ultimately didn’t make the desired cultural impact; its tonal shift confused audiences and critics alike. It was also, as various interviewees point out here, ahead of its time, foregrounding a trans character back in 2004. Twenty years later, it’s often cited by fans as their favorite among the series—but at the time, not everyone understood its intentions, nor its nuances.\u003c/p\u003e\n\n \u003cp\u003eWith cult appreciation for \u003cem\u003eBride\u003c/em\u003e and \u003cem\u003eSeed of Chucky\u003c/em\u003e yet to come, it took awhile for Chucky to make his inevitable return; as the documentary explores, the two direct-to-video series entries that eventually followed, \u003cem\u003eCurse of Chucky\u003c/em\u003e and \u003cem\u003eCult of Chucky\u003c/em\u003e, proved financially successful while also allowing Mancini and company to pivot again, focusing on scares over jokes. In these films, we meet Nica—played by Brad Dourif’s daughter, Fiona Dourif—a wheelchair user who holds her own against Chucky, first in a creepy old house and then a psychiatric hospital.\u003c/p\u003e \u003cp\u003eThough Chucky as a character doesn’t get interviewed—understandable, since \u003cem\u003eDoc of Chucky\u003c/em\u003e illuminates the immense effort that goes into making him come to life—we do get a good sense of how he’s evolved over the years. He’s not \u003cem\u003ejust\u003c/em\u003e a diabolical doll with a cackling laugh, though that’ll always be the backbone of his personality. He’s also a father and an occasional almost-romantic, an admirer of other sickos, and has a backstory beyond the voodoo-obsessed killer on the run we meet very briefly at the beginning of \u003cem\u003eChild’s Play.\u003c/em\u003e\u003c/p\u003e\n\n \u003cp\u003eThe most important takeaway from \u003cem\u003eDoc of Chucky\u003c/em\u003e is how the franchise has become a found family of sorts for its various participants over the years, with Mancini leading the charge. We hear about lasting friendships (and at least one decades-long marriage) that’ve resulted from the \u003cem\u003eChild’s Play\u003c/em\u003e series. That sense of community is helped along by the fact that Mancini and Kirschner are fond of working with the same people whenever possible, in particular bringing back actors to either reprise their roles or play completely new characters in future Chucky projects.\u003c/p\u003e \u003cp\u003eThat includes \u003cem\u003eChucky\u003c/em\u003e, the series—which featured both Dourifs, Tilly, Vincent, and more—but if you’re yearning for more on the dearly departed Syfy/USA horror comedy, you won’t find it here. Neither \u003cem\u003eChucky\u003c/em\u003e nor the “in name only” 2019 cinematic reboot get any mention whatsoever. In the case of the latter, at least, that’s to be expected, and probably for the best.\u003c/p\u003e\n\n \u003cp\u003e\u003cem\u003eDoc of Chucky\u003c/em\u003e streams on Shudder starting tomorrow, November 1.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-01T00:15:28Z",
  "modifiedTime": "2024-11-01T00:17:55Z"
}
