{
  "id": "514a3164-e6c6-4b89-9160-bc3c2bd7b6bd",
  "title": "Here’s Where Americans Could See the Northern Lights on New Year’s Eve",
  "link": "https://gizmodo.com/heres-where-americans-could-see-the-northern-lights-on-new-years-eve-2000544319",
  "description": "A fresh outburst from the Sun may trigger auroras in parts of the northern United States and Canada.",
  "author": "Isaac Schultz",
  "published": "Mon, 30 Dec 2024 21:51:53 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Space \u0026 Spaceflight",
    "aurora borealis",
    "geomagnetic storms",
    "Northern Lights",
    "Space weather"
  ],
  "byline": "Isaac Schultz",
  "length": 2941,
  "excerpt": "A fresh outburst from the Sun may trigger auroras in parts of the northern United States and Canada.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Seems like the Sun is in a festive mood: A strong geomagnetic storm watch is in place for the next day, increasing the likelihood of auroras—a Northern Lights show—on New Year’s Eve. The National Weather Service’s Space Weather Prediction Center issued a geomagnetic storm watch for December 31, based on a coronal mass ejection—an eruption on the Sun’s surface—that occurred on December 29. The New Year’s Eve storm watch is rated a G3, for a strong storm. According to the SWPC, strong storms can disorient spacecraft and cause problems with GPS and low-frequency radio navigation systems. Auroras are predicted “over many of the northern states and some of the lower Midwest to Oregon,” according to the alert. But don’t let that dishearten you if you’re farther south; space weather experts say that new phone camera technology is capable of picking up the lights even if your eyes cannot see them. So even if the aurora isn’t expected in your area, it doesn’t hurt to try to photograph it. Auroras occur when charged particles from the Sun interact with Earth’s magnetic field, causing gases in our planet’s atmosphere to glow. When solar activity is more extreme—that is, when our host star is flinging material out into space in solar flares—it causes brilliant auroras, sometimes surprisingly close to the equator. The Sun goes through an 11-year solar cycle, at the maximum of which space weather tends to be more intense. There are approximately 200 G3 geomagnetic storms per solar cycle, and the Sun is somewhere around its maximum now, which is why several significant geomagnetic storms occurred this year. In May, Earth felt the strongest geomagnetic storm to hit the planet in 20 years, which sent auroras across skies as far south as Florida and Texas. The SWPC also announced two strong radio blackout events on Monday due to a pair of flares on the Sun. The effects of the flares could include signal loss in high-frequency communication bands on the dayside of Earth, the alert noted, though the associated coronal mass ejection was “determined to not have an Earth-directed component.” Alongside the G3 storm watch is a G1 (or minor) storm watch in place for New Year’s Day, with the possibility of that alert upgrading to a G2 storm watch. Space weather researchers cannot rate the exact levels of geomagnetic disruption until the Sun’s charged particles are within 1 million miles (1.61 million kilometers) from Earth, or about 30-60 minutes from arrival at Earth. “Neither CME is expected to be a direct hit,” according to the storm watch notice, “which also makes forecast of intensity more difficult.” Auroras are best viewed with clear skies away from prominent light sources. In other words, if you’re trying to catch the Earth’s natural light show, it’s best to do so away from the New Year’s Eve artificial light shows. Catch you all in 2025 for another dynamic year under the auspices of our explosive star.",
  "image": "https://gizmodo.com/app/uploads/2024/08/Aurora-on-ISS.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eSeems like the Sun is in a festive mood: A strong geomagnetic storm watch is in place for the next day, increasing the likelihood of auroras—a Northern Lights show—on New Year’s Eve.\u003c/p\u003e \u003cp\u003eThe National Weather Service’s Space Weather Prediction Center issued a \u003ca href=\"https://www.swpc.noaa.gov/news/g3-strong-geomagnetic-storm-watch-31-dec\"\u003egeomagnetic storm watch\u003c/a\u003e for December 31, based on a coronal mass ejection—an eruption on the Sun’s surface—that occurred on December 29. The New Year’s Eve storm watch is rated a G3, for a strong storm. According to the SWPC, strong storms can disorient spacecraft and cause problems with GPS and low-frequency radio navigation systems. Auroras are predicted “over many of the northern states and some of the lower Midwest to Oregon,” according to the alert. But don’t let that dishearten you if you’re farther south; space weather experts \u003ca href=\"https://gizmodo.com/how-scientists-preparing-severe-solar-geomagnetic-storm-1851469148\"\u003esay\u003c/a\u003e that new phone camera technology is capable of picking up the lights even if your eyes cannot see them. So even if the aurora isn’t expected in your area, it doesn’t hurt to try to photograph it.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://spaceplace.nasa.gov/aurora/en/\"\u003eAuroras\u003c/a\u003e occur when charged particles from the Sun interact with Earth’s magnetic field, causing gases in our planet’s atmosphere to glow. When solar activity is more extreme—that is, when our host star is flinging material out into space in solar flares—it causes brilliant auroras, sometimes surprisingly close to the equator.\u003c/p\u003e \u003cp\u003eThe Sun goes through an \u003ca href=\"https://spaceplace.nasa.gov/solar-cycles/en/\"\u003e11-year solar cycle\u003c/a\u003e, at the maximum of which space weather tends to be more intense. There are approximately 200 G3 geomagnetic storms per solar cycle, and the Sun is somewhere around its maximum now, which is why several \u003ca href=\"https://gizmodo.com/how-the-impending-major-geomagnetic-storm-will-impact-earth-and-where-to-see-auroras-2000506776\"\u003esignificant geomagnetic storms\u003c/a\u003e occurred this year. In May, Earth felt the \u003ca href=\"https://gizmodo.com/severe-solar-geomagnetic-solar-storm-watch-1851468637\"\u003estrongest geomagnetic storm\u003c/a\u003e to hit the planet in 20 years, which sent auroras across skies as far south as Florida and Texas.\u003c/p\u003e\n\n \u003cp\u003eThe SWPC also \u003ca href=\"https://www.swpc.noaa.gov/news/pair-r3-strong-hf-radio-blackout-events-30-dec-2024\"\u003eannounced\u003c/a\u003e two strong radio blackout events on Monday due to a pair of flares on the Sun. The effects of the flares could include signal loss in high-frequency communication bands on the dayside of Earth, the alert noted, though the associated coronal mass ejection was “determined to not have an Earth-directed component.”\u003c/p\u003e \u003cp\u003eAlongside the G3 storm watch is a G1 (or minor) storm watch in place for New Year’s Day, with the possibility of that alert upgrading to a G2 storm watch. Space weather researchers cannot rate the exact levels of geomagnetic disruption until the Sun’s charged particles are within 1 million miles (1.61 million kilometers) from Earth, or about 30-60 minutes from arrival at Earth. “Neither CME is expected to be a direct hit,” according to the storm watch notice, “which also makes forecast of intensity more difficult.”\u003c/p\u003e\n\n \u003cp\u003eAuroras are best viewed with clear skies away from prominent light sources. In other words, if you’re trying to catch the Earth’s natural light show, it’s best to do so away from the New Year’s Eve artificial light shows. Catch you all in 2025 for another dynamic year under the auspices of our explosive star.\u003c/p\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-30T21:51:53Z",
  "modifiedTime": "2024-12-30T21:51:53Z"
}
