{
  "id": "5543b8d6-ac6e-4956-9b73-2c73d6fe3afd",
  "title": "TECH5 is bringing the ‘Champions League of Technology’ back to Europe",
  "link": "https://thenextweb.com/news/tech5-is-bringing-the-champions-league-of-technology-back-to-europe",
  "description": "A new season of the “Champions League of Tech” has begun with the return of TECH5 — Europe’s hottest scaleup contest. Over the next five months, TECH5 will showcase the continent’s future stars. The competition comes to a climax on June 19-20, when the 2025 winners are announced on the main stage of TNW Conference. Applications for the tournament opened this week. Promising scaleups from across the continent have been invited to submit their entries here. A range of prizes are at stake, from media coverage to VIP passes to TNW Conference. Companies need to act fast though — the…This story continues at The Next Web",
  "author": "Thomas Macaulay",
  "published": "Wed, 22 Jan 2025 17:24:21 +0000",
  "source": "https://thenextweb.com/feed/",
  "categories": [
    "Insider",
    "Startups and technology",
    "Next Featured",
    "Government and policy",
    "Ecosystems",
    "Investors and funding"
  ],
  "byline": "Thomas Macaulay",
  "length": 4377,
  "excerpt": "TECH5 has relaunched the “Champions League of Tech.” Applications for Europe’s hottest scaleup contest are now open.",
  "siteName": "TNW | Ecosystems",
  "favicon": "https://next.tnwcdn.com/assets/img/favicon/favicon-194x194.png",
  "text": "A new season of the “Champions League of Tech” has begun with the return of TECH5 — Europe’s hottest scaleup contest. Over the next five months, TECH5 will showcase the continent’s future stars. The competition comes to a climax on June 19-20, when the 2025 winners are announced on the main stage of TNW Conference. Applications for the tournament opened this week. Promising scaleups from across the continent have been invited to submit their entries here. A range of prizes are at stake, from media coverage to VIP passes to TNW Conference. Companies need to act fast though — the application window slams shut on February 28. The selected participants will join an illustrious list of TECH5 graduates. Among the previous winners are Starling Bank, Wise, Too Good To Go, Picnic, and Tier — and a host of other industry leaders. The 💜 of EU techThe latest rumblings from the EU tech scene, a story from our wise ol' founder Boris, and some questionable AI art. It's free, every week, in your inbox. Sign up now! A total of 588 companies are TECH5 alumni. Since entering the contest, they’ve experienced tremendous success. Revolut, for instance, went on to become Europe’s most valuable private tech firm. Deliveroo, meanwhile, enjoyed the biggest flotation on the London Stock Exchange for a decade. Collectively, TECH5 finalists have raised over €10bn. Arbo Robotics, a pioneer in automotive radar, is one of many winners that have attracted big investments. Just this month, Arbo announced plans to raise a fresh $29mn through a stock offering — which would bring its total funding to an estimated $251mn. Shlomit Hacohen, Arbo’s Chief Marketing Officer, credited TECH5 with accelerating the company’s rise. “Being named a top five company in TNW’s TECH5 review back in 2019 provided us with valuable exposure in Europe and the US during the early stages of our growth,” she said. “TNW’s TECH5 is exceptional at identifying companies with the potential for market success. Since the competition, Arbe has gone public and has established itself as the leading developer of radar technology in the automotive industry.” This year’s nominees will enter a revamped competition. Like the Champions League of football, the tournament rules have been tweaked to improve the results. The contenders will be evaluated on upgraded criteria. Alongside company and team growth, the judges will now assess a new metric: impact. The change aligns with broader trends in the ecosystem. TECH5 in 2025 Across the tech sector, growth alone is no longer perceived as the sole marker of success. Companies are now increasingly judged by their impacts and solutions to big problems. That’s not only wishful thinking — just look at the strategic shifts of businesses, investors, and policymakers. A blend of economic instability, environmental concerns, and socially conscious consumption has fueled support for tech with real-world impacts. Major funds are now flowing towards scaleups that address important issues. Last year, research firm Brainy Insights estimated that the impact investing market will grow from $3 trillion to $7.78 trillion by 2033. Government regulations are encouraging the momentum. The EU has taken a global lead in the charge, introducing new rules that push sustainable innovation in everything from AI to EVs. TECH5 plans to stimulate the ​​progress further. Yeni Joseph, TNW’s Head of Ecosystem Strategy \u0026 Partnerships, expects this year’s edition to deliver a powerful boost. “For TNW, identifying and showcasing Europe’s fastest-growing and most impactful scaleups is at the core of our mission to drive innovation and foster connections in the tech ecosystem,” she said.  “By spotlighting these companies, we not only celebrate their success but also create opportunities for collaboration, investment, and growth that fuel the future of technology in Europe.” The spotlight will shine on a range of locations. For this year’s edition, TECH5 is covering scaleups in the following regions: Benelux: Belgium, Netherlands, Luxembourg UK \u0026 Ireland Nordics: Denmark, Finland, Iceland, Norway, Sweden DACH: Germany, Austria, Switzerland Southern Europe: Andorra, Cyprus, Greece, Italy, Malta, Portugal, Spain France Baltic States: Estonia, Latvia, Lithuania Want to represent your region and show your vision to the world? Then apply to enter TECH5 via this link.",
  "image": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1\u0026fit=1280%2C640\u0026url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2025%2F01%2FUntitled-design-9.jpg\u0026signature=bf9917a72bdb0807301d04bdef14620d",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-main-content\"\u003e\n                            \u003cp\u003e\u003cspan\u003eA new season of the “Champions League of Tech” has begun with the return of \u003c/span\u003e\u003ca href=\"https://thenextweb.com/conference/tech5\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eTECH5\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e — Europe’s hottest scaleup contest.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eOver the next five months, TECH5 will showcase the continent’s future stars. The competition comes to a climax on June 19-20, when the 2025 winners are announced on the main stage of \u003ca href=\"https://thenextweb.com/topic/tnw-conference\" target=\"_blank\" rel=\"noopener\"\u003eTNW Conference\u003c/a\u003e.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eApplications for the tournament opened this week. Promising scaleups from across the continent have been invited to submit their entries \u003c/span\u003e\u003ca href=\"https://share-eu1.hsforms.com/1yH7-KHUsSZKqbFCs2x8tZA47gef\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003ehere\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eA range of prizes are at stake, from media coverage to VIP passes to TNW Conference. Companies need to act fast though — the application window slams shut on February 28.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe selected participants will join an illustrious list of TECH5 graduates. Among the previous winners are Starling Bank, Wise, \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/too-good-to-go-is-europes-hottest-startup-wins-tech5-competition-2019\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eToo Good To Go\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, Picnic, and Tier — and a host of other industry leaders. \u003c/span\u003e\u003c/p\u003e\u003cdiv id=\"hs-embed-tnw\"\u003e\u003cp\u003e\u003cimg src=\"https://s3.eu-west-1.amazonaws.com/tnw.events/hardfork-2018/uploads/visuals/tnw-newsletter.png\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe 💜 of EU tech\u003c/p\u003e\u003cp\u003eThe latest rumblings from the EU tech scene, a story from our wise ol\u0026#39; founder Boris, and some questionable AI art. It\u0026#39;s free, every week, in your inbox. Sign up now!\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\u003cp\u003e\u003cspan\u003eA total of 588 companies are TECH5 alumni. Since entering the contest, they’ve experienced tremendous success. Revolut, for instance, went on to become Europe’s \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/revolut-valuation-europes-most-valuable-private-tech-company-2024\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003emost valuable\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e private tech firm. Deliveroo, meanwhile, enjoyed the \u003c/span\u003e\u003cspan\u003ebiggest flotation\u003c/span\u003e\u003cspan\u003e on the London Stock Exchange for a decade. Collectively, TECH5 finalists have raised over €10bn.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eArbo Robotics, a pioneer in automotive radar, is one of many winners that have attracted big investments. Just this month, Arbo announced plans to raise a fresh $29mn through a stock offering — which would bring its total funding to an \u003c/span\u003e\u003cspan\u003eestimated $251mn\u003c/span\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eShlomit Hacohen, Arbo’s Chief Marketing Officer, credited TECH5 with accelerating the company’s rise.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Being named a top five company in TNW’s TECH5 review back in 2019 provided us with valuable exposure in Europe and the US during the early stages of our growth,” she said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“TNW’s TECH5 is exceptional at identifying companies with the potential for market success. Since the competition, Arbe has gone public and has established itself as the leading developer of radar technology in the automotive industry.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThis year’s nominees will enter a revamped competition. Like the Champions League of football, the tournament rules have been tweaked to improve the results.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe contenders will be evaluated on upgraded criteria. Alongside company and team growth, the judges will now assess a new metric: impact. The change aligns with broader trends in the ecosystem.\u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003eTECH5 in 2025\u003c/h2\u003e\n\u003cp\u003e\u003cspan\u003eAcross the tech sector, growth alone is no longer perceived as the sole marker of success. Companies are now increasingly judged by their impacts and solutions to big problems. That’s not only wishful thinking — just look at the strategic shifts of businesses, investors, and policymakers.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eA blend of economic instability, environmental concerns, and socially conscious consumption has fueled support for tech with real-world impacts.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eMajor funds are now flowing towards scaleups that address important issues. Last year, research firm Brainy Insights \u003c/span\u003e\u003ca href=\"https://finance.yahoo.com/news/impact-investing-market-size-worth-230000781.html\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003eestimated\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e that the impact investing market will grow from $3 trillion to $7.78 trillion by 2033.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eGovernment regulations are encouraging the momentum. The EU has taken a global lead in the charge, introducing new rules that push sustainable innovation in everything from \u003ca href=\"https://thenextweb.com/news/eu-adopts-ai-act-artificial-intelligence-rules\" target=\"_blank\" rel=\"noopener\"\u003eAI\u003c/a\u003e to EVs.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eTECH5 plans to stimulate the ​​progress further. Yeni Joseph, TNW’s \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/tnw-appoints-startup-ecosystems-head-yeni-joseph\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eHead of Ecosystem Strategy \u0026amp; Partnerships\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, expects this year’s edition to deliver a powerful boost.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“For TNW, identifying and showcasing Europe’s fastest-growing and most impactful scaleups is at the core of our mission to drive innovation and foster connections in the tech ecosystem,” she said. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“By spotlighting these companies, we not only celebrate their success but also create opportunities for collaboration, investment, and growth that fuel the future of technology in Europe.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe spotlight will shine on a range of locations. For this year’s edition, TECH5 is covering scaleups in the following regions:\u003c/span\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\u003cspan\u003eBenelux: Belgium, Netherlands, Luxembourg\u003c/span\u003e\u003c/li\u003e\n\u003cli aria-level=\"1\"\u003e\u003cspan\u003eUK \u0026amp; Ireland\u003c/span\u003e\u003c/li\u003e\n\u003cli aria-level=\"1\"\u003e\u003cspan\u003eNordics: Denmark, Finland, Iceland, Norway, Sweden\u003c/span\u003e\u003c/li\u003e\n\u003cli aria-level=\"1\"\u003e\u003cspan\u003eDACH: Germany, \u003c/span\u003e\u003cspan\u003eAustria\u003c/span\u003e\u003cspan\u003e, \u003c/span\u003e\u003cspan\u003eSwitzerland\u003c/span\u003e\u003c/li\u003e\n\u003cli aria-level=\"1\"\u003e\u003cspan\u003eSouthern Europe: Andorra, Cyprus, Greece, Italy, Malta, Portugal, Spain\u003c/span\u003e\u003c/li\u003e\n\u003cli aria-level=\"1\"\u003e\u003cspan\u003eFrance\u003c/span\u003e\u003c/li\u003e\n\u003cli aria-level=\"1\"\u003e\u003cspan\u003eBaltic States: Estonia, Latvia, Lithuania\u003c/span\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cspan\u003eWant to represent your region and show your vision to the world? Then apply to enter TECH5 via \u003c/span\u003e\u003ca href=\"https://share-eu1.hsforms.com/1yH7-KHUsSZKqbFCs2x8tZA47gef\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003ethis link\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\n                        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-22T17:24:21Z",
  "modifiedTime": "2025-01-22T17:28:59Z"
}
