{
  "id": "5b78c5d6-b639-49a6-8379-fd5a6d376e8f",
  "title": "Bluesky is having a moment... on Threads",
  "link": "https://www.engadget.com/social-media/bluesky-is-having-a-moment-on-threads-222404971.html?src=rss",
  "description": "Bluesky seems to have a bold new strategy to entice potential new users: posting on Threads. The rival social media service joined Threads amid a surge in complaints from users who are increasingly frustrated with Meta’s policies. While complaints about Meta’s policies aren’t a new topic, they’ve gained new prominence over the last week amid complaints about the surge in engagement bait on the platform, as well as Threads’ sometimes inexplicable content moderation decisions. Meta exec Adam Mosseri, who runs the Threads app, has said the company is looking into both issues. But in the meantime, there’s been an increase in discussions about Bluesky, the decentralized service that has a very different philosophy when it comes to algorithms and moderation. On Wednesday, Bluesky created an account on Threads, and promptly began pitching itself as an alternative platform for those frustrated with Meta. The strategy seems to be having an effect. “Bluesky” has been a trending topic on Threads for two days in a row and, at the time of this writing “Bluesky vs Meta moderation” was trending on the platform. “We're not like the other girls... we're not owned by a billionaire,” Bluesky wrote in a post Thursday. “Your social experience should be yours to customize, not bent to the whims of whoever the owner of the platform is.” While not the first time Bluesky has lightly trolled a rival (see its X post from earlier this week), the company is seizing on genuine frustration among Threads users. Besides the complaints about blatant engagement bait in their feeds, users have been questioning Meta’s seemingly aggressive moderation tactics on Threads. The company already throttles political content on the app, has taken a heavy handed approach to moderation of the service, according to many users. A number of people have reported having posts actioned by Meta for using the word “cracker” or “saltines,” as The Verge points out. Social media consultant Matt Navarra shared that he was penalized for sharing a BBC article about the viral “goodbye Meta AI” hoax on his Threads account. Bluesky, on the other hand, has taken a much more flexible approach to content moderation. It puts most decisions in the hands of users, who are able to decide what kind of content they want to see or not, and allows users to run their own moderation services. “We're always doing baseline moderation, meaning that we are providing you with a default moderated experience when you come in [to Bluesky],” Bluesky CEO jay Graber told Engadget earlier this year. “And then on top of that, you can customize things.” Whether the new attention on Bluesky will result in a significant number of departures to the service is so far unclear. Bluesky currently has about 10.8 million users, according to a dashboard tracking its growth, And while it’s not clear how many new people arrived in the last couple days, it suggests there’s been a bit of a surge over the past month as Bluesky previously grew to about 8.8 million users immediately following the shutdown of X in Brazil last month.This article originally appeared on Engadget at https://www.engadget.com/social-media/bluesky-is-having-a-moment-on-threads-222404971.html?src=rss",
  "author": "Karissa Bell",
  "published": "Thu, 10 Oct 2024 22:24:04 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Social \u0026 Online Media",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Karissa Bell"
  ],
  "byline": "Karissa Bell",
  "length": 3074,
  "excerpt": "Bluesky seems to have a bold new strategy to entice potential new users: posting on Threads.",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "Bluesky seems to have a bold new strategy to entice potential new users: posting on Threads. The rival social media service joined Threads amid a surge in complaints from users who are increasingly frustrated with Meta’s policies.While complaints about Meta’s policies aren’t a new topic, they’ve gained new prominence over the last week amid complaints about the surge in engagement bait on the platform, as well as Threads’ sometimes inexplicable content moderation decisions. Meta exec Adam Mosseri, who runs the Threads app, has said the company is looking into both issues. But in the meantime, there’s been an increase in discussions about Bluesky, the decentralized service that has a very different philosophy when it comes to algorithms and moderation.On Wednesday, Bluesky created an account on Threads, and promptly began pitching itself as an alternative platform for those frustrated with Meta. The strategy seems to be having an effect. “Bluesky” has been a trending topic on Threads for two days in a row and, at the time of this writing “Bluesky vs Meta moderation” was trending on the platform.“We're not like the other girls... we're not owned by a billionaire,” Bluesky wrote in a post Thursday. “Your social experience should be yours to customize, not bent to the whims of whoever the owner of the platform is.”While not the first time Bluesky has lightly trolled a rival (see its X post from earlier this week), the company is seizing on genuine frustration among Threads users. Besides the complaints about blatant engagement bait in their feeds, users have been questioning Meta’s seemingly aggressive moderation tactics on Threads. The company already throttles political content on the app, has taken a heavy handed approach to moderation of the service, according to many users. A number of people have reported having posts actioned by Meta for using the word “cracker” or “saltines,” as The Verge points out. Social media consultant Matt Navarra shared that he was penalized for sharing a BBC article about the viral “goodbye Meta AI” hoax on his Threads account.Bluesky, on the other hand, has taken a much more flexible approach to content moderation. It puts most decisions in the hands of users, who are able to decide what kind of content they want to see or not, and allows users to run their own moderation services. “We're always doing baseline moderation, meaning that we are providing you with a default moderated experience when you come in [to Bluesky],” Bluesky CEO jay Graber told Engadget earlier this year. “And then on top of that, you can customize things.”Whether the new attention on Bluesky will result in a significant number of departures to the service is so far unclear. Bluesky currently has about 10.8 million users, according to a dashboard tracking its growth, And while it’s not clear how many new people arrived in the last couple days, it suggests there’s been a bit of a surge over the past month as Bluesky previously grew to about 8.8 million users immediately following the shutdown of X in Brazil last month.",
  "image": "https://s.yimg.com/ny/api/res/1.2/.FrZTpJwDAhtdziAgN8o5Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MzA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-10/ced30300-8755-11ef-befe-637d6a9cbbe7",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eBluesky seems to have a bold new strategy to entice potential new users: posting on Threads. The rival social media service joined Threads amid a surge in complaints from users who are increasingly frustrated with Meta’s policies.\u003c/p\u003e\u003cp\u003eWhile complaints about Meta’s policies aren’t a new topic, they’ve gained new prominence over the last week amid complaints about the surge in \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1\" href=\"https://www.engadget.com/social-media/meta-is-working-to-fix-threads-engagement-bait-problem-173135011.html\" data-ylk=\"slk:engagement bait;elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003eengagement bait\u003c/ins\u003e\u003c/a\u003e on the platform, as well as Threads’ sometimes inexplicable \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1\" href=\"https://www.theverge.com/2024/10/9/24266096/instagram-threads-moderation-account-post-deleted-limited\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:content moderation;elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003econtent moderation\u003c/ins\u003e\u003c/a\u003e decisions. Meta exec Adam Mosseri, who runs the Threads app, has said the company is looking into both issues. But in the meantime, there’s been an increase in discussions about Bluesky, the decentralized service that has a very different philosophy when it comes to algorithms and moderation.\u003c/p\u003e\u003cp\u003eOn Wednesday, Bluesky \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1\" href=\"https://www.threads.net/@bluesky_social/post/DA6anHYSrUE\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:created an account;elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003ecreated an account\u003c/ins\u003e\u003c/a\u003e on Threads, and promptly began pitching itself as an alternative platform for those frustrated with Meta. The strategy seems to be having an effect. “Bluesky” has been a trending topic on Threads for two days in a row and, at the time of this writing “Bluesky vs Meta moderation” was trending on the platform.\u003c/p\u003e\u003cp\u003e“We\u0026#39;re not like the other girls... we\u0026#39;re not owned by a billionaire,” Bluesky wrote in \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1\" href=\"https://www.threads.net/@bluesky_social/post/DA82FsEvg7T\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:a post;elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003ea post \u003c/ins\u003e\u003c/a\u003eThursday. “Your social experience should be yours to customize, not bent to the whims of whoever the owner of the platform is.”\u003c/p\u003e\u003cp\u003eWhile not the first time Bluesky has lightly trolled a rival (see its \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:5;pos:1\" href=\"https://twitter.com/bluesky/status/1843344017477775542\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:X post;elm:context_link;elmt:doNotAffiliate;cpos:5;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003eX post\u003c/ins\u003e\u003c/a\u003e from earlier this week), the company is seizing on genuine frustration among Threads users. Besides the complaints about blatant engagement bait in their feeds, users have been questioning Meta’s seemingly aggressive moderation tactics on Threads. The company already throttles \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:6;pos:1\" href=\"https://www.engadget.com/instagram-and-threads-will-no-longer-recommend-political-content-180521125.html\" data-ylk=\"slk:political content;elm:context_link;elmt:doNotAffiliate;cpos:6;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003epolitical content\u003c/ins\u003e\u003c/a\u003e on the app, has taken a heavy handed approach to moderation of the service, according to many users. A number of people have reported having posts \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:7;pos:1\" href=\"https://www.threads.net/@aburridavanilla/post/DA9HqDDy-cw\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:actioned;elm:context_link;elmt:doNotAffiliate;cpos:7;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003eactioned\u003c/ins\u003e\u003c/a\u003e by Meta for \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:8;pos:1\" href=\"https://www.threads.net/@cult_papa/post/DA4gpN5xeaE\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:using;elm:context_link;elmt:doNotAffiliate;cpos:8;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003eusing\u003c/ins\u003e\u003c/a\u003e the word “cracker” or “saltines,” as \u003cem\u003eThe Verge\u003c/em\u003e \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:9;pos:1\" href=\"https://www.theverge.com/2024/10/9/24266096/instagram-threads-moderation-account-post-deleted-limited\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:points out;elm:context_link;elmt:doNotAffiliate;cpos:9;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003epoints out\u003c/ins\u003e\u003c/a\u003e. Social media consultant Matt Navarra \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:10;pos:1\" href=\"https://www.threads.net/@mattnavarra/post/DA34meVukmY\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:shared;elm:context_link;elmt:doNotAffiliate;cpos:10;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003eshared\u003c/ins\u003e\u003c/a\u003e that he was penalized for sharing a BBC article about the viral “goodbye Meta AI” hoax on his Threads account.\u003c/p\u003e\u003cp\u003eBluesky, on the other hand, has taken a much more flexible approach to content moderation. It puts most decisions in the hands of users, who are able to decide what kind of content they want to see or not, and allows users to run their own \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:11;pos:1\" href=\"https://www.engadget.com/bluesky-will-let-users-run-their-own-moderation-services-230017647.html\" data-ylk=\"slk:moderation services;elm:context_link;elmt:doNotAffiliate;cpos:11;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003emoderation services\u003c/ins\u003e\u003c/a\u003e. “We\u0026#39;re always doing baseline moderation, meaning that we are providing you with a default moderated experience when you come in [to Bluesky],” Bluesky CEO jay Graber told Engadget earlier this year. “And then on top of that, you can customize things.”\u003c/p\u003e\u003cp\u003eWhether the new attention on Bluesky will result in a significant number of departures to the service is so far unclear. Bluesky currently has about \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:12;pos:1\" href=\"https://bsky.jazco.dev/stats\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:10.8 million users;elm:context_link;elmt:doNotAffiliate;cpos:12;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003e10.8 million users\u003c/ins\u003e\u003c/a\u003e, according to a dashboard tracking its growth, And while it’s not clear how many new people arrived in the last couple days, it suggests there’s been a bit of a surge over the past month as Bluesky previously grew to about 8.8 million users immediately following the shutdown of X in Brazil \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:13;pos:1\" href=\"https://www.engadget.com/social-media/bluesky-added-over-2-million-brazilian-users-after-brazil-banned-elon-musks-x-140032042.html\" data-ylk=\"slk:last month;elm:context_link;elmt:doNotAffiliate;cpos:13;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003elast month\u003c/ins\u003e\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-10T22:24:04Z",
  "modifiedTime": null
}
