{
  "id": "5b7b1751-8a2b-47d1-b2ff-5590ae9d620e",
  "title": "Windows 11's Big 2024 Update Leaves Behind 9GB of Undeletable Files",
  "link": "https://tech.slashdot.org/story/24/10/10/1834205/windows-11s-big-2024-update-leaves-behind-9gb-of-undeletable-files?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "smooth wombat writes: The Windows 11 24H2 update has had a host of issues associated with it including disappearing mouse cursors and blue screens related to Intel drivers. Now comes word that the new update leaves behind over 8 GB of undeletable cache files. According to Windows Latest, attempts to delete the cache via the Control Panel are unsuccessful. Although you can select the cache for deletion and initiate the deletion process, the cache remains. Various other methods to remove the Windows update cache failed, too. It only cleared after a clean Windows installation altogether. Read more of this story at Slashdot.",
  "author": "msmash",
  "published": "2024-10-10T19:20:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "windows"
  ],
  "byline": "",
  "length": 594,
  "excerpt": "smooth wombat writes: The Windows 11 24H2 update has had a host of issues associated with it including disappearing mouse cursors and blue screens related to Intel drivers. Now comes word that the new update leaves behind over 8 GB of undeletable cache files. According to Windows Latest, attempts...",
  "siteName": "",
  "favicon": "",
  "text": "smooth wombat writes: The Windows 11 24H2 update has had a host of issues associated with it including disappearing mouse cursors and blue screens related to Intel drivers. Now comes word that the new update leaves behind over 8 GB of undeletable cache files. According to Windows Latest, attempts to delete the cache via the Control Panel are unsuccessful. Although you can select the cache for deletion and initiate the deletion process, the cache remains. Various other methods to remove the Windows update cache failed, too. It only cleared after a clean Windows installation altogether.",
  "image": "https://a.fsdn.com/sd/topics/windows_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-175228751\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\u003ca href=\"https://tech.slashdot.org/~smooth+wombat\"\u003esmooth wombat\u003c/a\u003e writes: \u003ci\u003eThe \u003ca href=\"https://tech.slashdot.org/story/24/10/01/1834231/windows-11-24h2-the-biggest-update-in-two-years-starts-rolling-out\"\u003eWindows 11 24H2 update\u003c/a\u003e has had a host of issues associated with it including \u003ca href=\"https://www.pcworld.com/article/2481724/windows-11-2024-update-makes-your-mouse-cursor-disappear-heres-what-to-do.html\"\u003edisappearing mouse cursors\u003c/a\u003e and blue screens related to \u003ca href=\"https://www.pcworld.com/article/2476013/uh-oh-windows-11-2024-update-is-blue-screening-heres-what-to-do.html\"\u003eIntel drivers\u003c/a\u003e.  Now comes word that the new update leaves behind over 8 GB of \u003ca href=\"https://www.pcworld.com/article/2485897/windows-11s-big-2024-update-leaves-behind-9gb-of-undeletable-files.html\"\u003eundeletable cache files\u003c/a\u003e.\u003cp\u003e \n\nAccording to Windows Latest, attempts to delete the cache via the Control Panel are unsuccessful. Although you can select the cache for deletion and initiate the deletion process, the cache remains. Various other methods to remove the Windows update cache failed, too. It only cleared after a clean Windows installation altogether.\u003c/p\u003e\u003c/i\u003e\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
