{
  "id": "5dfefda5-55ae-44be-bdc5-39051c307ea9",
  "title": "What to Expect From Samsung's Galaxy S25 Unpacked Stream",
  "link": "https://lifehacker.com/tech/samsungs-galaxy-s25-unpacked-stream-rumors?utm_medium=RSS",
  "description": "Samsung's next Galaxy Unpacked is less than a week away.",
  "author": "Michelle Ehrhardt",
  "published": "Tue, 21 Jan 2025 23:00:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Tech"
  ],
  "byline": "Michelle Ehrhardt",
  "length": 5530,
  "excerpt": "Samsung's next Galaxy Unpacked is less than a week away.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "Credit: Samsung Another year, another Samsung Galaxy Unpacked. The Android giant has gotten into a habit of hosting at least two of these events per year, one for foldables and one for pretty much everything else. With the foldables having gotten center stage last time, it’s likely time for the rest of its products, including the Samsung Galaxy S25 series, to get its turn. While only those under NDA know for sure what we’ll see, here’s what we’re expecting to see when the next Samsung Galaxy Unpacked streams on January 22 at 1 PM ET.How to stream Samsung Galaxy Unpacked (and reserve your phone)There's a number of ways to watch January 22's Samsung Galaxy Unpacked. Samsung would surely appreciate it if you watched through its site, but assuming you're like me, you'll probably prefer to watch on Samsung's YouTube channel, where the event will stream simultaneously. I've also embedded the stream below. Note that at least visiting Samsung's site ahead of the stream does give you a bit of a bonus, as you can actually already place a reservation for whatever new phones will be announced during the event. Doing so will net a $50 Samsung store credit when you actually check out with your pre-order (assuming you pre-order using the same email you reserved with). While you're at it, you can also sign up to win a $5,000 store credit at the same time, and this one doesn't require a purchase if you end up winning.Samsung Galaxy S25, S25+, and S25 UltraSamsung likes to kick off each year by announcing its latest non-folding phones, and there’s no reason to expect this year to be different. Typically, this means a standard variant, a larger screen “plus” size, and a more powerful “ultra” version. Given that Samsung has already registered three new model numbers with the FCC (thanks, 91Mobiles), that’s what we can expect this year, too (prior leaks had pointed at a \"slim\" model, although there's no FCC listing for it yet).As for specs, that’s where it gets a bit interesting. The biggest tidbit from the FCC leaks is potential support for 45W fast charging, although Android Headlines claims to have pictures of the devices themselves. These show a move to rounded corners and thinner bezels, but the rest of the design looks largely untouched.As for internals, leakers are expecting all S25 models to use the Qualcomm Snapdragon 8 Elite chip, which was revealed in October and stated to be coming to Samsung products. This tracks with prior Galaxy devices, which also used the same chip across all models, although details have differed from region to region before. Now, said regional differences are said to not be in play.The Snapdragon 8 Elite promises improvements anywhere from 35 to 62% depending on the task at hand, with the biggest improvement being to web browsing—key for a mobile phone.Samsung phones are also known for their cameras, although both Android Headlines and popular leaker Ice Universe claim only the Galaxy S25 Ultra will see an improvement here, and only to its ultra-wide lens, which will go from 12MP to 50MP.Screens are unlikely to change from their current OLED setup, and as for software, the phones are set to use Samsung’s One UI 7, which is already in beta and runs over Android 15. Also expect a bunch of AI-centric announcements, although solid leaks have yet to emerge there.There’s also potential accessory news on the horizon, as the Wireless Power Consortium has said that Samsung will support Qi2 wireless charging on its new phones. According to leaker chunvn8888, that doesn’t mean it’ll have built-in magnets (which Qi2 supports), but Samsung will sell a case with a built-in magnetic ring.Galaxy Ring 2News on the Galaxy Ring 2 is a bit less clear, but hit-or-miss Taiwanese publication DigiTimes says Samsung might tease it during the event. The publication is expecting two additional sizes, updated sensors, and new AI features, but given that the first model launched in July, it’ll likely be some time until you can buy a follow up. However, Korean leaker Lanzuk says Samsung might launch the wearable a bit earlier than expected.Samsung AR and XRFinally, it’s possible we’ll hear more about Samsung’s augmented and extended reality initiatives. Samsung has previously announced an Android-based extended reality headset alongside Google called Project Moohan, so it’s possible the company might demo it during Unpacked, but don’t expect it to be available right away. Google is still seeding developers with software and equipment for the new platform, although the company does say it expects Moohan to start selling by the end of the year.On that note, also don’t expect to see anything substantive regarding Samsung’s previously confirmed AR glasses. DigiTimes says the glasses will look fairly unassuming, but given that they’ll also rely on Google tech, they’re probably still in the oven as well. Michelle Ehrhardt Associate Tech Editor Michelle Ehrhardt is Lifehacker's Associate Tech Editor. She has been writing about tech and pop culture since 2014 and has edited for outlets including Gizmodo and Tom's Hardware. Read Michelle's full bio",
  "image": "https://lifehacker.com/imagery/articles/01JHRKAKNZ470Y9F5ZV8Y9ZS4K/hero-image.fill.size_1200x675.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection data-ga-module=\"content-body\"\u003e\n                            \n                \u003cimg src=\"https://lifehacker.com/imagery/articles/01JHRKAKNZ470Y9F5ZV8Y9ZS4K/hero-image.fill.size_1248x702.v1737066462.webp\" alt=\"Galaxy Unpacked Banner\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01JHRKAKNZ470Y9F5ZV8Y9ZS4K/hero-image.fill.size_400x225.v1737066462.webp 400w, https://lifehacker.com/imagery/articles/01JHRKAKNZ470Y9F5ZV8Y9ZS4K/hero-image.fill.size_800x450.v1737066462.webp 800w, https://lifehacker.com/imagery/articles/01JHRKAKNZ470Y9F5ZV8Y9ZS4K/hero-image.fill.size_1248x702.v1737066462.webp 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\n                        \u003cp\u003e\u003cspan\u003eCredit: Samsung\u003c/span\u003e\n                            \u003c/p\u003e\n            \n    \u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eAnother year, another Samsung Galaxy Unpacked. The Android giant has gotten into a habit of hosting at least two of these events per year, one for foldables and one for pretty much everything else. With the foldables having \u003ca href=\"https://lifehacker.com/tech/samsung-galaxy-z-fold-6-z-flip-6-have-arrived\" target=\"_blank\"\u003e\u003cu\u003egotten center stage last time\u003c/u\u003e\u003c/a\u003e, it’s likely time for the rest of its products, including the Samsung Galaxy S25 series, to get its turn. While only those under NDA know for sure what we’ll see, here’s what we’re expecting to see when the next Samsung Galaxy Unpacked streams on January 22 at 1 PM ET.\u003c/p\u003e\u003ch2 id=\"how-to-stream-samsung-galaxy-unpacked-and-reserve-your-phone\"\u003eHow to stream Samsung Galaxy Unpacked (and reserve your phone)\u003c/h2\u003e\u003cp\u003eThere\u0026#39;s a number of ways to watch January 22\u0026#39;s Samsung Galaxy Unpacked. Samsung would surely appreciate it if you watched \u003ca href=\"https://www.samsung.com/us/smartphones/the-next-galaxy/reserve/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ethrough its site\u003c/a\u003e, but assuming you\u0026#39;re like me, you\u0026#39;ll probably prefer to watch on Samsung\u0026#39;s \u003ca href=\"https://www.youtube.com/watch?v=HinL5jCy_oI\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eYouTube channel\u003c/a\u003e, where the event will stream simultaneously. I\u0026#39;ve also embedded the stream below.\u003c/p\u003e\n\n\n\u003cp\u003eNote that at least visiting Samsung\u0026#39;s site ahead of the stream does give you a bit of a bonus, as you can actually already place a reservation for whatever new phones will be announced during the event. Doing so will net a $50 Samsung store credit when you actually check out with your pre-order (assuming you pre-order using the same email you reserved with). While you\u0026#39;re at it, you can also sign up to win a $5,000 store credit at the same time, and this one doesn\u0026#39;t require a purchase if you end up winning.\u003c/p\u003e\u003ch2 id=\"samsung-galaxy-s25-s25-and-s25-ultra\"\u003eSamsung Galaxy S25, S25+, and S25 Ultra\u003c/h2\u003e\u003cp\u003eSamsung likes to kick off each year by announcing its latest non-folding phones, and there’s no reason to expect this year to be different. Typically, this means a standard variant, a larger screen “plus” size, and a more powerful “ultra” version. Given that Samsung has already registered three new model numbers with the FCC (thanks, \u003ca href=\"https://www.91mobiles.com/hub/samsung-galaxy-s25-series-fcc-certification/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003e91Mobiles\u003c/u\u003e\u003c/a\u003e), that’s what we can expect this year, too (\u003ca href=\"https://www.zdnet.com/article/the-samsung-galaxy-s25-slim-may-steal-the-show-at-unpacked-even-if-it-doesnt-release/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eprior leaks\u003c/a\u003e had pointed at a \u0026#34;slim\u0026#34; model, although there\u0026#39;s no FCC listing for it yet).\u003c/p\u003e\u003cp\u003eAs for specs, that’s where it gets a bit interesting. The biggest tidbit from the FCC leaks is potential support for 45W fast charging, although \u003ca href=\"https://www.androidheadlines.com/samsung-galaxy-s25-series-design\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003eAndroid Headlines\u003c/u\u003e\u003c/a\u003e claims to have pictures of the devices themselves. These show a move to rounded corners and thinner bezels, but the rest of the design looks largely untouched.\u003c/p\u003e\u003cp\u003eAs for internals, leakers are expecting all S25 models to use the Qualcomm Snapdragon 8 Elite chip, which was \u003ca href=\"https://www.qualcomm.com/news/releases/2024/10/qualcomm-unveils-snapdragon-8-elite-with-the-world-s-fastest-mob\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003erevealed in October\u003c/u\u003e\u003c/a\u003e and stated to be coming to Samsung products. This tracks with prior Galaxy devices, which also used the same chip across all models, although details have differed from region to region before. Now, said regional differences are said to \u003ca href=\"https://x.com/UniverseIce/status/1856677902869516626\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003enot be in play\u003c/u\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe Snapdragon 8 Elite promises improvements anywhere from 35 to 62% depending on the task at hand, with the biggest improvement being to web browsing—key for a mobile phone.\u003c/p\u003e\u003cp\u003eSamsung phones are also known for their cameras, although both \u003ca href=\"https://www.androidheadlines.com/2024/12/galaxy-s25-ultras-camera-sensors.html\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003eAndroid Headlines\u003c/u\u003e\u003c/a\u003e and popular leaker \u003ca href=\"https://x.com/UniverseIce/status/1833100800941519242\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003eIce Universe\u003c/u\u003e\u003c/a\u003e claim only the Galaxy S25 Ultra will see an improvement here, and only to its ultra-wide lens, which will go from 12MP to 50MP.\u003c/p\u003e\u003cp\u003eScreens are unlikely to change from their current OLED setup, and as for software, the phones are set to use Samsung’s \u003ca href=\"https://me.pcmag.com/en/mobile/27409/samsung-introduces-one-ui-7-beta-program-with-advanced-security-features\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003eOne UI 7\u003c/u\u003e\u003c/a\u003e, which is already in beta and runs over Android 15. Also expect a bunch of AI-centric announcements, although solid leaks have yet to emerge there.\u003c/p\u003e\u003cp\u003eThere’s also potential accessory news on the horizon, as the \u003ca href=\"https://www.businesswire.com/news/home/20250106397777/en/Qi2%E2%80%99s-Wireless-Charging-Benefits-Spurring-Continued-Expansion\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003eWireless Power Consortium\u003c/u\u003e\u003c/a\u003e has said that Samsung will support Qi2 wireless charging on its new phones. According to leaker \u003ca href=\"https://x.com/chunvn8888/status/1868996832376099265\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003echunvn8888\u003c/u\u003e\u003c/a\u003e, that doesn’t mean it’ll have built-in magnets (which Qi2 supports), but Samsung will sell a case with a built-in magnetic ring.\u003c/p\u003e\u003ch2 id=\"galaxy-ring-2\"\u003eGalaxy Ring 2\u003c/h2\u003e\u003cp\u003eNews on the \u003ca href=\"https://www.digitimes.com/news/a20241225PD216/samsung-galaxy-ar-smart-glasses-2025.html\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003eGalaxy Ring 2\u003c/u\u003e\u003c/a\u003e is a bit less clear, but hit-or-miss Taiwanese publication DigiTimes says Samsung might tease it during the event. The publication is expecting two additional sizes, updated sensors, and new AI features, but given that the first model launched in July, it’ll likely be some time until you can buy a follow up. However, \u003ca href=\"https://blog.naver.com/yeux1122/223648855900\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003eKorean leaker Lanzuk\u003c/u\u003e\u003c/a\u003e says Samsung might launch the wearable a bit earlier than expected.\u003c/p\u003e\u003ch2 id=\"samsung-ar-and-xr\"\u003eSamsung AR and XR\u003c/h2\u003e\u003cp\u003eFinally, it’s possible we’ll hear more about Samsung’s augmented and extended reality initiatives. Samsung has previously announced an Android-based extended reality headset alongside Google called \u003ca href=\"https://news.samsung.com/global/unlock-the-infinite-possibilities-of-xr-with-galaxy-ai\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003eProject Moohan\u003c/u\u003e\u003c/a\u003e, so it’s possible the company might demo it during Unpacked, but don’t expect it to be available right away. Google is \u003ca href=\"https://blog.google/products/android/android-xr/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003estill seeding developers\u003c/u\u003e\u003c/a\u003e with software and equipment for the new platform, although the company does say it expects Moohan to start selling by the end of the year.\u003c/p\u003e\u003cp\u003eOn that note, also don’t expect to see anything substantive regarding Samsung’s \u003ca href=\"https://www.engadget.com/samsung-extended-reality-xr-vr-ar-devices-181919030.html\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003epreviously confirmed AR glasses\u003c/u\u003e\u003c/a\u003e. DigiTimes says the glasses will look fairly unassuming, but given that they’ll also rely on Google tech, they’re probably still in the oven as well.\u003c/p\u003e\n    \u003c/article\u003e\n\n    \n                        \u003cdiv\u003e\n                \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/authors/01HVP4EYVCH3SGKVV831SNXRPT/image.fill.size_150x150.v1713361091.jpg\" alt=\"Michelle Ehrhardt\" width=\"150\" height=\"150\" loading=\"lazy\"/\u003e\n                                            \u003c/p\u003e\n                \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003cp\u003eMichelle Ehrhardt\u003c/p\u003e\n                                    \u003cp\u003eAssociate Tech Editor\u003c/p\u003e\n                                \u003cdiv\u003e\n                                            \u003cp\u003eMichelle Ehrhardt is Lifehacker\u0026#39;s Associate Tech Editor. She has been writing about tech and pop culture since 2014 and has edited for outlets including Gizmodo and Tom\u0026#39;s Hardware.\u003c/p\u003e\n                                    \u003c/div\u003e\n                \u003cp\u003e\u003ca href=\"https://lifehacker.com/author/michelle-ehrhardt\"\u003eRead Michelle\u0026#39;s full bio\u003c/a\u003e\u003c/p\u003e\u003cul\u003e\n                                                                            \u003cli\u003e\n                                \u003ca href=\"https://twitter.com/@ChelleEhrhardt\" title=\"Find on Twitter (Opens in a new tab)\" aria-label=\"Visit Michelle\u0026#39;s Twitter\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-twitter\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                                                                                    \u003cli\u003e\n                                \u003ca href=\"https://lifehacker.com/cdn-cgi/l/email-protection#a0cdc9c3c8c5ccccc58ec5c8d2c8c1d2c4d4e0dac9c6c6c4c1d6c9d38ec3cfcd\" title=\"Send an Email (Opens in a new tab)\" aria-label=\"Send Michelle an email\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-envelope\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                            \u003c/ul\u003e\n                            \u003c/div\u003e\n        \u003c/div\u003e\n                \u003cdiv\u003e\n                                            \n                        \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"1\" data-ga-label=\"Bluesky and X Just Launched TikTok-Style Video Feeds\" href=\"https://lifehacker.com/tech/x-and-bluesky-new-tiktok-style-video-feeds\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JJ59ES3PCEMQWQ9KCSC5R391/hero-image.fill.size_75x75.v1737492567.png\" alt=\"X and Bluesky video feeds\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                    \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"2\" data-ga-label=\"Apple\u0026#39;s Latest iOS Beta Quietly Kills AI News Notifications\" href=\"https://lifehacker.com/tech/apples-latest-ios-beta-quietly-kills-ai-news-notifications\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JHTZHX2Z9NP8AHDF8KPEYJG0/hero-image.fill.size_75x75.v1737147432.png\" alt=\"Notification Summaries not working on news apps\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                                        \u003c/div\u003e\n            \u003c/div\u003e\n            \n    \n    \n                    \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-21T23:00:00Z",
  "modifiedTime": "2025-01-21T23:00:00Z"
}
