{
  "id": "5f5399ba-2fd8-46eb-aca7-1fc2a7b18614",
  "title": "Tinder To Require Facial Recognition Check For New Users In California",
  "link": "https://yro.slashdot.org/story/25/07/01/2112208/tinder-to-require-facial-recognition-check-for-new-users-in-california?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "An anonymous reader quotes a report from Axios: Tinder is mandating new users in California verify their profiles using facial recognition technology starting Monday, executives exclusively tell Axios. The move aims to reduce impersonation and is part of Tinder parent Match Group's broader effort to improve trust and safety amid ongoing user frustration. The Face Check feature prompts users to take a short video selfie during onboarding. The biometric face scan, powered by FaceTec, then confirms the person is real and present and whether their face matches their profile photos. It also checks if the face is used across multiple accounts. If the criteria are met, the user receives a photo verified badge on their profile. The selfie video is then deleted. Tinder stores a non-reversible, encrypted face map to detect duplicate profiles in the future. Face Check is separate from Tinder's ID Check, which uses a government-issued ID to verify age and identity. \"We see this as one part of a set of identity assurance options that are available to users,\" Match Group's head of trust and safety Yoel Roth says. \"Face Check ... is really meant to be about confirming that this person is a real, live person and not a bot or a spoofed account.\" \"Even if in the short term, it has the effect of potentially reducing some top-line user metrics, we think it's the right thing to do for the business,\" Rascoff said. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2025-07-02T00:02:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "privacy"
  ],
  "byline": "",
  "length": 1417,
  "excerpt": "An anonymous reader quotes a report from Axios: Tinder is mandating new users in California verify their profiles using facial recognition technology starting Monday, executives exclusively tell Axios. The move aims to reduce impersonation and is part of Tinder parent Match Group's broader effort to...",
  "siteName": "",
  "favicon": "",
  "text": "An anonymous reader quotes a report from Axios: Tinder is mandating new users in California verify their profiles using facial recognition technology starting Monday, executives exclusively tell Axios. The move aims to reduce impersonation and is part of Tinder parent Match Group's broader effort to improve trust and safety amid ongoing user frustration. The Face Check feature prompts users to take a short video selfie during onboarding. The biometric face scan, powered by FaceTec, then confirms the person is real and present and whether their face matches their profile photos. It also checks if the face is used across multiple accounts. If the criteria are met, the user receives a photo verified badge on their profile. The selfie video is then deleted. Tinder stores a non-reversible, encrypted face map to detect duplicate profiles in the future. Face Check is separate from Tinder's ID Check, which uses a government-issued ID to verify age and identity. \"We see this as one part of a set of identity assurance options that are available to users,\" Match Group's head of trust and safety Yoel Roth says. \"Face Check ... is really meant to be about confirming that this person is a real, live person and not a bot or a spoofed account.\" \"Even if in the short term, it has the effect of potentially reducing some top-line user metrics, we think it's the right thing to do for the business,\" Rascoff said.",
  "image": "https://a.fsdn.com/sd/topics/privacy_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-178247324\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tAn anonymous reader quotes a report from Axios: \u003ci\u003eTinder is mandating new users in California \u003ca href=\"https://www.axios.com/2025/06/30/tinder-face-check-safety\"\u003everify their profiles using facial recognition technology\u003c/a\u003e starting Monday, executives exclusively tell Axios. The move aims to reduce impersonation and is part of Tinder parent Match Group\u0026#39;s broader effort to improve trust and safety amid ongoing user frustration. The Face Check feature prompts users to take a short video selfie during onboarding. The biometric face scan, powered by FaceTec, then confirms the person is real and present and whether their face matches their profile photos. It also checks if the face is used across multiple accounts. If the criteria are met, the user receives a photo verified badge on their profile. The selfie video is then deleted. Tinder stores a non-reversible, encrypted face map to detect duplicate profiles in the future.\n\u003cp\u003e \nFace Check is separate from Tinder\u0026#39;s \u003ca href=\"https://www.help.tinder.com/hc/en-us/articles/19868368795917-ID-Photo-Verification\"\u003eID Check\u003c/a\u003e, which uses a government-issued ID to verify age and identity. \u0026#34;We see this as one part of a set of identity assurance options that are available to users,\u0026#34; Match Group\u0026#39;s head of trust and safety Yoel Roth says. \u0026#34;Face Check ... is really meant to be about confirming that this person is a real, live person and not a bot or a spoofed account.\u0026#34; \u0026#34;Even if in the short term, it has the effect of potentially reducing some top-line user metrics, we think it\u0026#39;s the right thing to do for the business,\u0026#34; Rascoff said.\u003c/p\u003e\u003c/i\u003e\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
