{
  "id": "609aaba2-ab2c-4c75-9436-4411298f6afe",
  "title": "Marvel Is Letting Its Villains Be Haters Again",
  "link": "https://gizmodo.com/marvel-is-letting-its-villains-be-haters-again-2000572188",
  "description": "Daredevil: Born Again and Your Friendly Neighborhood Spider-Man gave us bad guys who are jerks first, and it's a great change of pace.",
  "author": "Justin Carter",
  "published": "Wed, 16 Apr 2025 21:20:49 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Television",
    "Daredevil",
    "Daredevil: Born Again",
    "Marvel",
    "MCU",
    "Your Friendly Neighborhood Spider-Man"
  ],
  "byline": "Justin Carter",
  "length": 5617,
  "excerpt": "Daredevil: Born Again and Your Friendly Neighborhood Spider-Man gave us bad guys who are jerks first, and it's a great change of pace.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "The just-ended Daredevil: Born Again focuses on Matt Murdock’s ongoing clash with the Kingpin, but it’s another major rogue that sets things in motion. Minutes into the pilot, Wilson Bethel’s Bullseye shows up, kills Foggy with a single gunshot, and proceeds to wreak havoc inside of Josie’s Bar. When he’s not throwing a lot of knives at Daredevil, he’s throwing knives into civilians, knocking them out with cue balls to the skull, or just punching them in the stomach. Many of these could’ve been easily bypassed while still keeping Daredevil on his toes, but among his many skills and traits, ol’ Bullseye is vindictive and such a hater. To be a Marvel fan is to have mixed feelings about the MCU’s villain output. For every Killmonger or Vulture, you’ve got a Cassandra Nova, Iron Monger, or whatever Kang was teed up to be. After a certain point, the baddies stopped being simple foils for the good guys and became saddled with attempts at being topical or thematically relevant in some respect. This can work, but too often it’s left projects feeling scattered or confused. For many, the most recent example will be Captain America: Brave New World’s Leader and Red Hulk, but there’s also the Skrulls, Thanos, and Falcon \u0026 the Winter Soldier’s double dose of John Walker and Karli Morgenthau. This is a problem that goes beyond a single franchise—it might extend to all blockbuster action movies in the last 20 years—but Marvel’s been the worst at it for sure. And yet, the current slate of MCU projects has featured some memorable haters among their ranks. Much of this has come from TV: both Daredevil shows have avoided this in part by just letting Bullseye, Kingpin, and Fisk’s wife Vanessa be some of the most evil, mean people in all of New York. All three are victims to one degree or another, but both the original Daredevil and Born Again have stopped short of making them overly sympathetic or trying to distance them from their previously bad actions. The Fisk who loves Vanessa like she’s the only woman in the world is the same man who locked her lover in a cage, decapitated a man with a car door, and crushed another man’s head with his bare hands. Vanessa, who loves her husband just as much, viewed his years-long departure as a betrayal on par with her father cheating on her mother—yet she still orchestrated Foggy’s death and shot her lover dead like it was nothing. © Marvel Studios The same is true of Ben Poindexter, aka Bullseye, maybe the most broken person in Daredevil’s assortment of characters. Yes, he’s forever wedded to those two as they deploy him like an attack dog, which sometimes ends with him getting thrown off a building or his spine broken. But he likes what he does and has fun messing with Matt, either by wearing his costume or throwing anything in the room at him when they fight—how can the guy not get a kick out of this when he can kill a fly with a paper clip or toss a gun at someone’s head without looking? These contrasts help make these characters compelling while also keeping them true to themselves as they test Matt’s resolve and patience. Outside of Born Again, Marvel’s found another successful hater villain in Your Friendly Neighborhood Spider-Man’s take on Scorpion. For whatever reason—maybe he’s not as visually dynamic as other heavy hitters—he hasn’t been given his own spotlight like Spider-Man’s A-list baddies Doctor Octopus, Green Goblin, or Venom. Over the past decade, Mac Gargan has come part of a larger set; Insomniac’s Spider-Man games made him part of the Sinister Six (and later paired him with Rhino), and his one live-action appearance in Spider-Man: Homecoming seemed ready to continue that trend in a hypothetical sequel. Friendly Neighborhood’s solution? Individualize the two most well-known incarnations but make them equally formidable. Gargan is introduced in the show as the leader of an emerging gang called the Scorpions making trouble for the One-Tenth, and his eventual successor Carmilla Black as his second-in-command. There’s not much nuance to them, but they make up for it in presence. Carmilla’s introduced as a problem Lonnie and the One-Tenth will have to deal with eventually, but she pales in comparison to Gargan, who’s not just a hater, but a complete demon. A scary guy is even scarier in an armored suit with a stinger tail, and he kills and terrorizes the city like he’s finally found his calling in life. In Gargan, the show’s creative team channels the same energy Homecoming did with its shovel talk scene between Peter and Vulture. Friendly Neighborhood seems to have a bright future ahead of it, and with luck, Gargan and Black will pop up every now and then to put Peter and any other potential heroes through their paces. Now all we need is for that energy to extend over to the movies. Captain America: Brave New World took some steps in that direction with Giancarlo Esposito’s Sidewinder, who just wants to kill Sam, whether he gets paid or not. Their beef and subsequent brawls are enough to make you wish that was just the whole movie, and speaks to what makes hero/villain rivalries engaging when done well. Such a personal, ongoing fight is more interesting than a villain who thinks they’re a hero or working toward some grand plan set to pay off years later, and it’s something the MCU’s conveyor belt of projects could stand to have more of, regardless of the medium. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/04/bullseye-born-again.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eThe just-ended \u003ca href=\"https://gizmodo.com/daredevil-born-again-season-1-review-marvel-disney-plus-2000571195\"\u003e\u003cem\u003eDaredevil: Born Again\u003c/em\u003e\u003c/a\u003e focuses on Matt Murdock’s ongoing clash with the Kingpin, but it’s another major rogue that sets things in motion. Minutes into the pilot, Wilson Bethel’s Bullseye shows up, \u003ca href=\"https://gizmodo.com/daredevil-born-again-foggy-death-468-easter-egg-comics-marvel-2000572595\"\u003ekills Foggy\u003c/a\u003e with a single gunshot, and proceeds to wreak havoc inside of Josie’s Bar. When he’s not throwing a \u003cem\u003elot \u003c/em\u003eof knives at Daredevil, he’s throwing knives into civilians, knocking them out with cue balls to the skull, or just punching them in the stomach. Many of these could’ve been easily bypassed while still keeping Daredevil on his toes, but among his many skills and traits, ol’ Bullseye is vindictive and such a hater.\u003c/p\u003e \u003cp\u003eTo be a Marvel fan is to have mixed feelings about the MCU’s villain output. For every Killmonger or Vulture, you’ve got a Cassandra Nova, Iron Monger, or whatever \u003ca href=\"https://gizmodo.com/marvel-avengers-kang-dynasty-name-change-jonathan-major-1851274375\"\u003eKang\u003c/a\u003e was teed up to be. After a certain point, the baddies stopped being simple foils for the good guys and became saddled with attempts at being topical or thematically relevant in some respect. This can work, but too often it’s left projects feeling scattered or confused. For many, the most recent example will be \u003cem\u003eCaptain America: Brave New World’s \u003c/em\u003eLeader and Red Hulk, but there’s also the Skrulls, Thanos, and \u003cem\u003eFalcon \u0026amp; the Winter Soldier’s \u003c/em\u003edouble dose of \u003ca href=\"https://gizmodo.com/the-falcon-and-the-winter-soldiers-head-writer-explains-1846781760\"\u003eJohn Walker\u003c/a\u003e and Karli Morgenthau. This is a problem that goes beyond a single franchise—it might extend to all blockbuster action movies in the last 20 years—but Marvel’s been the worst at it for sure.\u003c/p\u003e \u003cp\u003eAnd yet, the current slate of MCU projects has featured some memorable haters among their ranks. Much of this has come from TV: both \u003cem\u003eDaredevil \u003c/em\u003eshows have avoided this in part by just letting Bullseye, Kingpin, and Fisk’s wife Vanessa be some of the most evil, mean people in all of New York. All three are victims to one degree or another, but both the original \u003cem\u003eDaredevil\u003c/em\u003e and \u003cem\u003eBorn Again \u003c/em\u003ehave stopped short of making them overly sympathetic or trying to distance them from their previously bad actions.\u003c/p\u003e\n\n \u003cp\u003eThe Fisk who loves Vanessa like she’s the only woman in the world is the same man who locked her lover in a cage, decapitated a man with a car door, and \u003ca href=\"https://gizmodo.com/heres-how-that-gnarly-daredevil-born-again-death-happened-2000590163\"\u003ecrushed another man’s head\u003c/a\u003e with his bare hands. Vanessa, who loves her husband just as much, viewed his years-long departure as a betrayal on par with her father cheating on her mother—yet she still orchestrated Foggy’s death and shot her lover dead like it was nothing.\u003c/p\u003e \u003cfigure id=\"attachment_2000572196\" aria-describedby=\"caption-attachment-2000572196\"\u003e\u003cimg decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2025/03/bullseye.jpg\" alt=\"Bullseye\" width=\"1092\" height=\"614\" srcset=\"https://gizmodo.com/app/uploads/2025/03/bullseye.jpg 1092w, https://gizmodo.com/app/uploads/2025/03/bullseye-300x169.jpg 300w, https://gizmodo.com/app/uploads/2025/03/bullseye-1024x576.jpg 1024w, https://gizmodo.com/app/uploads/2025/03/bullseye-768x432.jpg 768w, https://gizmodo.com/app/uploads/2025/03/bullseye-512x288.jpg 512w, https://gizmodo.com/app/uploads/2025/03/bullseye-680x382.jpg 680w, https://gizmodo.com/app/uploads/2025/03/bullseye-896x504.jpg 896w\" sizes=\"(max-width: 1023px) calc(100vw - 2rem), (max-width: 1279px) calc(100vw - 26rem), 680px\"/\u003e\u003cfigcaption id=\"caption-attachment-2000572196\"\u003e© Marvel Studios\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003eThe same is true of Ben Poindexter, aka Bullseye, maybe the most broken person in \u003cem\u003eDaredevil’s \u003c/em\u003eassortment of characters. Yes, he’s forever wedded to those two as they deploy him like an attack dog, which sometimes ends with him getting thrown off a building or his spine broken. But he likes what he does and has fun messing with Matt, either by wearing his costume or throwing anything in the room at him when they fight—how can the guy not get a kick out of this when he can kill a fly with a paper clip or toss a gun at someone’s head without looking? These contrasts help make these characters compelling while also keeping them true to themselves as they test Matt’s resolve and patience.\u003c/p\u003e \u003cp\u003eOutside of \u003cem\u003eBorn Again, \u003c/em\u003eMarvel’s found another successful hater villain in \u003cem\u003e\u003ca href=\"https://gizmodo.com/6-things-we-liked-and-4-we-didnt-about-your-friendly-neighborhood-spider-man-2000565111\"\u003eYour Friendly Neighborhood Spider-Man’s\u003c/a\u003e \u003c/em\u003etake on Scorpion. For whatever reason—maybe he’s not as visually dynamic as other heavy hitters—he hasn’t been given his own spotlight like Spider-Man’s A-list baddies Doctor Octopus, Green Goblin, or Venom. Over the past decade, Mac Gargan has come part of a larger set; Insomniac’s \u003cem\u003eSpider-Man \u003c/em\u003egames made him part of the Sinister Six (and later paired him with Rhino), and his one live-action appearance in \u003ca href=\"https://www.youtube.com/watch?v=QPfcuqzH0So\"\u003e\u003cem\u003eSpider-Man: Homecoming\u003c/em\u003e\u003c/a\u003e seemed ready to continue that trend in a hypothetical sequel. \u003cem\u003eFriendly Neighborhood’s \u003c/em\u003esolution? Individualize the two most well-known incarnations but make them equally formidable.\u003c/p\u003e\n\n \u003cp\u003eGargan is introduced in the show as the leader of an emerging gang called the Scorpions making trouble for the One-Tenth, and his eventual successor Carmilla Black as his second-in-command. There’s not much nuance to them, but they make up for it in presence. Carmilla’s introduced as a problem Lonnie and the One-Tenth will have to deal with eventually, but she pales in comparison to Gargan, who’s not just a hater, but a complete \u003cem\u003edemon\u003c/em\u003e.\u003c/p\u003e \u003cp\u003eA scary guy is even scarier in an armored suit with a stinger tail, and he kills and terrorizes the city like he’s finally found his calling in life. In Gargan, the show’s creative team channels the same energy \u003cem\u003eHomecoming \u003c/em\u003edid with its shovel talk scene between \u003ca href=\"https://www.youtube.com/watch?v=fB5HTcFhCso\"\u003ePeter and Vulture\u003c/a\u003e. \u003cem\u003eFriendly Neighborhood \u003c/em\u003eseems to have a bright future ahead of it, and with luck, Gargan and Black will pop up every now and then to put Peter and any other potential heroes through their paces.\u003c/p\u003e\n\n \u003cp\u003e\u003ciframe loading=\"lazy\" title=\"Your Friendly Neighborhood Spider-Man | Spider-Man vs Scorpion | Clip 4K\" width=\"500\" height=\"281\" src=\"about:blank\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\" data-rocket-lazyload=\"fitvidscompatible\" data-lazy-src=\"https://www.youtube.com/embed/YTDULNCv-ro?feature=oembed\"\u003e\u003c/iframe\u003e\u003c/p\u003e \u003cp\u003eNow all we need is for that energy to extend over to the movies. \u003cem\u003eCaptain America: Brave New World \u003c/em\u003etook some steps in that direction with Giancarlo Esposito’s Sidewinder, who just wants to kill Sam, whether he gets paid or not. Their beef and subsequent brawls are enough to make you wish that was just the whole movie, and speaks to what makes hero/villain rivalries engaging when done well. Such a personal, ongoing fight is more interesting than a villain who thinks they’re a hero or working toward some grand plan set to pay off years later, and it’s something the MCU’s conveyor belt of projects could stand to have more of, regardless of the medium.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-04-16T21:20:49Z",
  "modifiedTime": "2025-04-16T21:20:49Z"
}
