{
  "id": "6a64d646-6fd1-4bcf-b06a-e26df7b50821",
  "title": "FIFA cozies up to EA rival Konami for soccer esports",
  "link": "https://www.engadget.com/gaming/fifa-cozies-up-to-ea-rival-konami-for-soccer-esports-185538485.html?src=rss",
  "description": "FIFA didn't exactly get out of the video game business after parting ways with EA. Soccer’s governing body has teamed up with Konami to host two editions of the FIFAe World Cup on the console and mobile versions of eFootball later this year. Qualifying for both tournaments starts today, with FIFAe world champs (one each on mobile and console) to be crowned later this year. Eighteen FIFA member associations are taking part, namely those in Argentina, Brazil, Costa Rica, England, France, India, Indonesia, Japan, Korea Republic, Malaysia, Morocco, Netherlands, Poland, Portugal, Saudi Arabia, Spain, Thailand and Türkiye. They were selected based on previous performances of esports competitors from those countries as well as the eFootball player base in each. FIFA is bringing eFootball into its esports fold alongside Rocket League (car soccer) and Football Manager (soccer management). It's too early to tell whether Konami's title will become FIFA's official licensed partner for major soccer games and adopt the governing body's name. Still, it seems clear that FIFA and Konami are on positive terms and this could be a step toward a larger partnership. Hey, both even use that silly \"e\" branding. While EA Sports FC is far and away the most popular soccer sim series around, eFootball is the closest thing it has to a true competitor. It had a peak concurrent Steam player count of 17,610 over the last 24 hours, compared with 98,400 for EA Sports FC 25.This article originally appeared on Engadget at https://www.engadget.com/gaming/fifa-cozies-up-to-ea-rival-konami-for-soccer-esports-185538485.html?src=rss",
  "author": "Kris Holt",
  "published": "Thu, 10 Oct 2024 18:55:38 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Sports \u0026 Recreation",
    "Soccer",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Kris Holt"
  ],
  "byline": "Kris Holt",
  "length": 1461,
  "excerpt": "FIFA and Konami have teamed up to host two editions of the FIFAe World Cup esports tournament in eFootball.",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "FIFA didn't exactly get out of the video game business after parting ways with EA. Soccer’s governing body has teamed up with Konami to host two editions of the FIFAe World Cup on the console and mobile versions of eFootball later this year.Qualifying for both tournaments starts today, with FIFAe world champs (one each on mobile and console) to be crowned later this year. Eighteen FIFA member associations are taking part, namely those in Argentina, Brazil, Costa Rica, England, France, India, Indonesia, Japan, Korea Republic, Malaysia, Morocco, Netherlands, Poland, Portugal, Saudi Arabia, Spain, Thailand and Türkiye. They were selected based on previous performances of esports competitors from those countries as well as the eFootball player base in each.FIFA is bringing eFootball into its esports fold alongside Rocket League (car soccer) and Football Manager (soccer management). It's too early to tell whether Konami's title will become FIFA's official licensed partner for major soccer games and adopt the governing body's name. Still, it seems clear that FIFA and Konami are on positive terms and this could be a step toward a larger partnership. Hey, both even use that silly \"e\" branding.While EA Sports FC is far and away the most popular soccer sim series around, eFootball is the closest thing it has to a true competitor. It had a peak concurrent Steam player count of 17,610 over the last 24 hours, compared with 98,400 for EA Sports FC 25.",
  "image": "https://s.yimg.com/ny/api/res/1.2/zX7cYNEGaC1Rb.uzwZDx5Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-10/2cb62b40-8734-11ef-a9fd-1211dfec3948",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eFIFA didn\u0026#39;t exactly get out of the video game business after \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://www.engadget.com/fifa-23-ea-sports-fc-branding-170729395.html\" data-ylk=\"slk:parting ways with EA;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cins\u003eparting ways with EA\u003c/ins\u003e\u003c/a\u003e. Soccer’s governing body has teamed up with Konami to host two editions of the FIFAe World Cup on the console and mobile versions of \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://www.engadget.com/pro-evolution-soccer-efootball-104633019.html\" data-ylk=\"slk:eFootball;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003e\u003cins\u003eeFootball\u003c/ins\u003e\u003c/em\u003e\u003c/a\u003e later this year.\u003c/p\u003e\u003cp\u003eQualifying for both tournaments starts today, with FIFAe world champs (one each on mobile and console) to be crowned later this year. Eighteen FIFA member associations are taking part, namely those in Argentina, Brazil, Costa Rica, England, France, India, Indonesia, Japan, Korea Republic, Malaysia, Morocco, Netherlands, Poland, Portugal, Saudi Arabia, Spain, Thailand and Türkiye. They were selected based on previous performances of esports competitors from those countries as well as the \u003cem\u003eeFootball \u003c/em\u003eplayer base in each.\u003c/p\u003e\u003cp\u003eFIFA is bringing \u003cem\u003eeFootball \u003c/em\u003einto its esports fold alongside \u003cem\u003eRocket League \u003c/em\u003e(car soccer) and Football Manager (soccer management). It\u0026#39;s too early to tell whether Konami\u0026#39;s title will become FIFA\u0026#39;s official licensed partner for major soccer games and adopt the governing body\u0026#39;s name. Still, it seems clear that FIFA and Konami are on positive terms and this could be a step toward a larger partnership. Hey, both even use that silly \u0026#34;e\u0026#34; branding.\u003c/p\u003e\u003cp\u003eWhile EA Sports FC is far and away the most popular soccer sim series around, \u003cem\u003eeFootball \u003c/em\u003eis the closest thing it has to a true competitor. It had a peak concurrent Steam player count of 17,610 over the last 24 hours, compared with 98,400 for \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://www.engadget.com/ea-sports-fc-25-brings-womens-soccer-to-the-career-modes-for-the-first-time-160013124.html\" data-ylk=\"slk:EA Sports FC 25;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003eEA Sports FC 25\u003c/em\u003e\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-10-10T18:55:38Z",
  "modifiedTime": null
}
