{
  "id": "6deb76d7-9de6-4777-83ee-14e4c622b715",
  "title": "Alex Garland Will Write and Direct A24’s ‘Elden Ring’ Live-Action Movie",
  "link": "https://gizmodo.com/alex-garland-will-write-and-direct-a24s-elden-ring-live-action-movie-2000598726",
  "description": "The popular fantasy RPG has long been rumored to be getting a big-screen adaptation—and now we know who's behind it.",
  "author": "Justin Carter",
  "published": "Thu, 22 May 2025 23:29:48 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Movies",
    "A24",
    "Alex Garland",
    "Elden Ring",
    "FromSoftware"
  ],
  "byline": "Justin Carter",
  "length": 1890,
  "excerpt": "The popular fantasy RPG has long been rumored to be getting a big-screen adaptation—and now we know who's behind it.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "The video game adaptation train keeps on a-going, and the next stop is a big-screen take on 2022’s Elden Ring. Alex Garland and A24 are making it happen. Rumors of an adaptation have been swirling around for some time, but now it’s official. According to Deadline, the fantasy RPG published by Bandai Namco Entertainment and developed by FromSoftware will become a feature film courtesy of A24. At the helm is Garland as writer and director; he’s a genre veteran whose credits include Ex Machina and Annihilation, as well as Civil War, Men, and the recent Warfare. He also scripted the upcoming 28 Years Later for director Danny Boyle, the much-anticipated follow-up to the zombie series they created. Last year, game director Hidetaka Miyazaki said he’d be open to a film if the “right partner” was involved, and A24, which is also doing a Death Stranding movie, appears to be it. Elden Ring is based on a story by Game of Thrones creator George R.R. Martin, who’ll be among the feature film’s producers. Set in the Lands Between, Elden Ring tasks players with repairing the titular ring—runes that control reality—and becoming the new Elden Lord to usher in a new age. Uniting the ring requires a lot of horseback and a lot of dying, but by that point, players had become familiar with FromSoftware’s work and eagerly dived in. Ring was a critical hit and one of 2022’s biggest games. After last year’s Shadow of the Erdtree expansion, FromSoftware is returning to the game with Nightreign, a standalone multiplayer-focused spinoff. Both the base Ring and Erdtree are releasing on the Nintendo Switch 2 later in 2025. Expect more news on the Elden Ring movie as it develops. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2024/12/Elden-Ring-Shadow-of-the-Erdtree-Art-1-e1746557727672.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eThe video game \u003ca href=\"https://gizmodo.com/the-split-fiction-movie-has-its-director-and-first-star-2000594323\"\u003eadaptation train\u003c/a\u003e keeps on a-going, and the next stop is a big-screen take on 2022’s \u003ca href=\"https://gizmodo.com/shadow-of-the-erdtree-elden-ring-blessing-buff-update-1851562579\"\u003e\u003cem\u003eElden Ring\u003c/em\u003e\u003c/a\u003e. Alex Garland and A24 are making it happen.\u003c/p\u003e \u003cp\u003eRumors of an adaptation have been swirling around \u003ca href=\"https://gizmodo.com/elden-ring-movie-tv-show-george-r-r-martin-rumors-1851569856\"\u003efor some time\u003c/a\u003e, but now it’s official. According to \u003ca href=\"https://deadline.com/2025/05/elden-ring-alex-garland-directing-a24-movie-1236408999/\"\u003eDeadline\u003c/a\u003e, the fantasy RPG published by Bandai Namco Entertainment and developed by FromSoftware will become a feature film courtesy of A24. At the helm is Garland as writer and director; he’s a genre veteran whose credits include \u003cem\u003eEx Machina\u003c/em\u003e and \u003cem\u003eAnnihilation\u003c/em\u003e, as well as \u003cem\u003eCivil War\u003c/em\u003e, \u003cem\u003eMen\u003c/em\u003e, and the recent \u003cem\u003eWarfare\u003c/em\u003e. He also scripted the upcoming \u003cem\u003e28 Years Later\u003c/em\u003e for director Danny Boyle, the much-anticipated follow-up to the zombie series they created.\u003c/p\u003e \u003cp\u003eLast year, game director \u003ca href=\"https://gizmodo.com/elden-ring-movie-hidetata-miyazaki-erdtree-1851563691\"\u003eHidetaka Miyazaki\u003c/a\u003e said he’d be open to a film if the “right partner” was involved, and A24, which is also doing a \u003ca href=\"https://gizmodo.com/hideo-kojima-company-future-death-stranding-2000504716\"\u003e\u003cem\u003eDeath Stranding \u003c/em\u003emovie\u003c/a\u003e, appears to be it. \u003cem\u003eElden Ring\u003c/em\u003e is based on a story by \u003cem\u003eGame of Thrones\u003c/em\u003e creator George R.R. Martin, who’ll be among the feature film’s producers.\u003c/p\u003e \u003cp\u003eSet in the Lands Between, \u003cem\u003eElden Ring \u003c/em\u003etasks players with repairing the titular ring—runes that control reality—and becoming the new Elden Lord to usher in a new age. Uniting the ring requires a lot of horseback and a lot of dying, but by that point, players had become familiar with FromSoftware’s work and eagerly dived in.\u003c/p\u003e\n\n \u003cp\u003e\u003cem\u003eRing\u003c/em\u003e was a critical hit and one of 2022’s biggest games. After last year’s \u003cem\u003eShadow of the Erdtree \u003c/em\u003eexpansion, FromSoftware is returning to the game with \u003cem\u003eNightreign, \u003c/em\u003ea standalone multiplayer-focused spinoff. Both the base \u003cem\u003eRing \u003c/em\u003eand \u003cem\u003eErdtree \u003c/em\u003eare releasing on the Nintendo Switch 2 later in 2025.\u003c/p\u003e \u003cp\u003eExpect more news on the \u003cem\u003eElden Ring \u003c/em\u003emovie as it develops.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-22T23:29:48Z",
  "modifiedTime": "2025-05-22T23:29:48Z"
}
