{
  "id": "76a02276-a96a-4705-83ec-f8141b031864",
  "title": "Google tests feature to show full recipes in search results",
  "link": "https://www.engadget.com/big-tech/google-tests-feature-to-show-full-recipes-in-search-results-212257585.html?src=rss",
  "description": "It's an experience many of us know all too well: open up a food blogger's recipe only to scroll past a mountain of content you don't care about to actually reach the ingredients and method. Google is trialing a feature that could eliminate this step, even though it's the result of the company's own policies. The Verge noticed a new button on the thumbnails for select recipes called Quick View. This button brings up the complete recipe without leaving the search results page. In their testing, a search for \"chocolate chip cookie recipe\" revealed this Quick View button for the site Preppy Kitchen.  \"We’re always experimenting with different ways to connect our users with high-quality and helpful information,\" Google rep Brianna Duff told Engadget about these Quick View recipes. \"We have partnered with a limited number of creators to begin to explore new recipe experiences on Search that are both helpful for users and drive value to the web ecosystem. We don’t have anything to announce right now.\" While Google does have agreements inked with the participating bloggers, the company declined to reveal any further details about the scope of this testing. It's quite a catch-22 Google has created when it comes to recipes online. Home cooks may find this Quick View feature appealing since so many food blogs front-load their posts with photos and personal stories before actually sharing the recipe. But it was Google's own rules that pushed bloggers toward that approach in the first place, with longer posts generally indexing higher up in search results and thus getting more traffic. (And no offense to the food bloggers of the world, but the only chocolate chip cookie recipe you need is the one on the back of the chocolate chip bag.) While this recipe feature is just an early trial, Google has been rolling out other tools aimed at keeping users on its own webpages and platforms. The AI Overviews in search are one of the latest (and occasionally surreal) ways the company is changing the rules of engagement for web content.This article originally appeared on Engadget at https://www.engadget.com/big-tech/google-tests-feature-to-show-full-recipes-in-search-results-212257585.html?src=rss",
  "author": "Anna Washenko",
  "published": "Thu, 10 Oct 2024 21:22:57 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Food \u0026 Cooking",
    "Social \u0026 Online Media",
    "Consumer Discretionary",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Anna Washenko"
  ],
  "byline": "Anna Washenko",
  "length": 2041,
  "excerpt": "Google's Quick View feature shows full recipes in search results in limited early testing.",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "It's an experience many of us know all too well: open up a food blogger's recipe only to scroll past a mountain of content you don't care about to actually reach the ingredients and method. Google is trialing a feature that could eliminate this step, even though it's the result of the company's own policies.The Verge noticed a new button on the thumbnails for select recipes called Quick View. This button brings up the complete recipe without leaving the search results page. In their testing, a search for \"chocolate chip cookie recipe\" revealed this Quick View button for the site Preppy Kitchen.\"We’re always experimenting with different ways to connect our users with high-quality and helpful information,\" Google rep Brianna Duff told Engadget about these Quick View recipes. \"We have partnered with a limited number of creators to begin to explore new recipe experiences on Search that are both helpful for users and drive value to the web ecosystem. We don’t have anything to announce right now.\" While Google does have agreements inked with the participating bloggers, the company declined to reveal any further details about the scope of this testing.It's quite a catch-22 Google has created when it comes to recipes online. Home cooks may find this Quick View feature appealing since so many food blogs front-load their posts with photos and personal stories before actually sharing the recipe. But it was Google's own rules that pushed bloggers toward that approach in the first place, with longer posts generally indexing higher up in search results and thus getting more traffic. (And no offense to the food bloggers of the world, but the only chocolate chip cookie recipe you need is the one on the back of the chocolate chip bag.)While this recipe feature is just an early trial, Google has been rolling out other tools aimed at keeping users on its own webpages and platforms. The AI Overviews in search are one of the latest (and occasionally surreal) ways the company is changing the rules of engagement for web content.",
  "image": "https://s.yimg.com/ny/api/res/1.2/0yUwUsc3thtYWoq_erySOg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-10/204baf70-874c-11ef-bfbe-038f2d8ebef1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eIt\u0026#39;s an experience many of us know all too well: open up a food blogger\u0026#39;s recipe only to scroll past a mountain of content you don\u0026#39;t care about to actually reach the ingredients and method. Google is trialing a feature that could eliminate this step, even though it\u0026#39;s the result of the company\u0026#39;s own policies.\u003c/p\u003e\u003cp\u003e\u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://www.theverge.com/2024/10/10/24267119/google-search-recipe-blogs-quick-view\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:The Verge;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003e\u003cins\u003eThe Verge\u003c/ins\u003e\u003c/em\u003e\u003c/a\u003e noticed a new button on the thumbnails for select recipes called Quick View. This button brings up the complete recipe without leaving the search results page. In their testing, a search for \u0026#34;chocolate chip cookie recipe\u0026#34; revealed this Quick View button for the site Preppy Kitchen.\u003c/p\u003e\u003cp\u003e\u0026#34;We’re always experimenting with different ways to connect our users with high-quality and helpful information,\u0026#34; Google rep Brianna Duff told Engadget about these Quick View recipes. \u0026#34;We have partnered with a limited number of creators to begin to explore new recipe experiences on Search that are both helpful for users and drive value to the web ecosystem. We don’t have anything to announce right now.\u0026#34; While Google does have agreements inked with the participating bloggers, the company declined to reveal any further details about the scope of this testing.\u003c/p\u003e\u003cp\u003eIt\u0026#39;s quite a catch-22 Google has created when it comes to recipes online. Home cooks may find this Quick View feature appealing since so many food blogs front-load their posts with photos and personal stories before actually sharing the recipe. But it was Google\u0026#39;s own rules that pushed bloggers toward that approach in the first place, with longer posts generally indexing higher up in search results and thus getting more traffic. (And no offense to the food bloggers of the world, but the only chocolate chip cookie recipe you need is the one on the back of the chocolate chip bag.)\u003c/p\u003e\u003cp\u003eWhile this recipe feature is just an early trial, Google has been rolling out other tools aimed at keeping users on its own webpages and platforms. The \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://www.engadget.com/google-search-will-now-show-ai-generated-answers-to-millions-by-default-174512845.html\" data-ylk=\"slk:AI Overviews;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cins\u003eAI Overviews\u003c/ins\u003e\u003c/a\u003e in search are one of the latest (and \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://www.engadget.com/google-is-putting-more-restrictions-on-ai-overviews-after-it-told-people-to-put-glue-on-pizza-011316780.html\" data-ylk=\"slk:occasionally surreal;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cins\u003eoccasionally surreal\u003c/ins\u003e\u003c/a\u003e) ways the company is changing the rules of engagement for web content.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-10T21:22:57Z",
  "modifiedTime": null
}
