{
  "id": "7e78baaa-4252-4b14-b5f7-31bde61d3111",
  "title": "NYC proposes 5 percent raise for rideshare drivers in a bid to appease Uber and Lyft",
  "link": "https://www.engadget.com/transportation/nyc-proposes-5-percent-raise-for-rideshare-drivers-in-a-bid-to-appease-uber-and-lyft-220011937.html?src=rss",
  "description": "New York City's Taxi and Limousine Commission (TLC) have settled on new minimum-wage rules for rideshare drivers, Bloomberg reports. Drivers will receive a five percent raise under the new proposal, a compromise to keep Uber and Lyft from locking drivers out of their apps. The proposal needs to be voted on by the TLC's board of commissioners before it goes into effect, but assuming it does, it'll end months of uncertainty for drivers working in the city. Uber began sporadically locking drivers out of its app in May 2024, preventing them taking rides and earning money. The company was blocking access to its app to avoid having to pay drivers who were working but not actively taking rides. Besides introducing a minimum wage for drivers that started around $18 per hour in 2022, New York also included stipulations in its law that required drivers be paid for the downtime between rides, something Uber and Lyft naturally had a problem with. Bloomberg writes that the TLC initially proposed a 6.1 percent raise in an attempt to disincentivize Uber and Lyft from locking drivers out. The proposal would adjust how driver pay is calculated, in exchange for an upfront raise and a guarantee that drivers are warned before they lose access to a rideshare app. Settling on a five percent raise and a commitment to not raise wages yearly and instead based \"changing industry dynamics,\" is a further capitulation. One that's still not enough for Lyft, apparently. The company told Bloomberg that, \"while these changes are a step in the right direction, we still have concerns that the underlying pay formula will still deprive drivers of earning opportunities, drive up prices for riders and reduce ride availability.\" Uber and Lyft have long had a contentious relationship with city and state governments over driver protections. In comparison to the passing of Prop 22 in California, which reclassified gig workers as contractors after another law did the opposite, even a diminished minimum wage law in New York is better than nothing.This article originally appeared on Engadget at https://www.engadget.com/transportation/nyc-proposes-5-percent-raise-for-rideshare-drivers-in-a-bid-to-appease-uber-and-lyft-220011937.html?src=rss",
  "author": "Ian Carlos Campbell",
  "published": "Fri, 20 Jun 2025 22:00:11 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Business",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Ian Carlos Campbell"
  ],
  "byline": "Ian Carlos Campbell",
  "length": 2035,
  "excerpt": "New York City is proposing a new five percent raise for rideshare drivers in the hopes of disincentivizing Uber and Lyft from blocking drivers from using...",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "New York City's Taxi and Limousine Commission (TLC) have settled on new minimum-wage rules for rideshare drivers, Bloomberg reports. Drivers will receive a five percent raise under the new proposal, a compromise to keep Uber and Lyft from locking drivers out of their apps.The proposal needs to be voted on by the TLC's board of commissioners before it goes into effect, but assuming it does, it'll end months of uncertainty for drivers working in the city. Uber began sporadically locking drivers out of its app in May 2024, preventing them taking rides and earning money. The company was blocking access to its app to avoid having to pay drivers who were working but not actively taking rides. Besides introducing a minimum wage for drivers that started around $18 per hour in 2022, New York also included stipulations in its law that required drivers be paid for the downtime between rides, something Uber and Lyft naturally had a problem with.Bloomberg writes that the TLC initially proposed a 6.1 percent raise in an attempt to disincentivize Uber and Lyft from locking drivers out. The proposal would adjust how driver pay is calculated, in exchange for an upfront raise and a guarantee that drivers are warned before they lose access to a rideshare app. Settling on a five percent raise and a commitment to not raise wages yearly and instead based \"changing industry dynamics,\" is a further capitulation. One that's still not enough for Lyft, apparently. The company told Bloomberg that, \"while these changes are a step in the right direction, we still have concerns that the underlying pay formula will still deprive drivers of earning opportunities, drive up prices for riders and reduce ride availability.\"Uber and Lyft have long had a contentious relationship with city and state governments over driver protections. In comparison to the passing of Prop 22 in California, which reclassified gig workers as contractors after another law did the opposite, even a diminished minimum wage law in New York is better than nothing.",
  "image": "https://s.yimg.com/ny/api/res/1.2/gVlUn8FEIRMVXQz0Va9XIw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-06/896bc720-4e1f-11f0-bbf7-9a7bf400a091",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eNew York City\u0026#39;s Taxi and Limousine Commission (TLC) have settled on new minimum-wage rules for rideshare drivers, \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1\" href=\"https://www.bloomberg.com/news/articles/2025-06-20/nyc-settles-on-smaller-driver-pay-bump-after-uber-lyft-pushback\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Bloomberg reports;elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1;itc:0;sec:content-canvas\"\u003e\u003cem\u003eBloomberg \u003c/em\u003ereports\u003c/a\u003e. Drivers will receive a five percent raise under the new proposal, a compromise to keep Uber and Lyft from locking drivers out of their apps.\u003c/p\u003e\u003cp\u003eThe proposal needs to be voted on by the TLC\u0026#39;s board of commissioners before it goes into effect, but assuming it does, it\u0026#39;ll end months of uncertainty for drivers working in the city. Uber began sporadically \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1\" href=\"https://www.engadget.com/uber-is-locking-new-york-drivers-out-of-its-apps-and-blaming-a-city-pay-rule-204737818.html\" data-ylk=\"slk:locking drivers out of its app;elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1;itc:0;sec:content-canvas\"\u003elocking drivers out of its app\u003c/a\u003e in May 2024, preventing them taking rides and earning money. The company was blocking access to its app to avoid having to pay drivers who were working but not actively taking rides. Besides introducing a minimum wage for drivers that \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1\" href=\"https://www.engadget.com/nyc-gig-drivers-pay-increase-012304976.html\" data-ylk=\"slk:started around $18 per hour;elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1;itc:0;sec:content-canvas\"\u003estarted around $18 per hour\u003c/a\u003e in 2022, New York also included stipulations in its law that required drivers be paid for the downtime between rides, something Uber and Lyft naturally had a problem with.\u003c/p\u003e\u003cp\u003e\u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1\" href=\"https://www.bloomberg.com/news/articles/2025-01-08/nyc-is-trying-to-end-uber-lyft-driver-lockouts-with-a-pay-hike\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Bloomberg writes;elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1;itc:0;sec:content-canvas\"\u003e\u003cem\u003eBloomberg \u003c/em\u003ewrites\u003c/a\u003e that the TLC initially proposed a 6.1 percent raise in an attempt to disincentivize Uber and Lyft from locking drivers out. The proposal would adjust how driver pay is calculated, in exchange for an upfront raise and a guarantee that drivers are warned before they lose access to a rideshare app. Settling on a five percent raise and a commitment to not raise wages yearly and instead based \u0026#34;changing industry dynamics,\u0026#34; is a further capitulation. One that\u0026#39;s still not enough for Lyft, apparently. The company told \u003cem\u003eBloomberg \u003c/em\u003ethat, \u0026#34;while these changes are a step in the right direction, we still have concerns that the underlying pay formula will still deprive drivers of earning opportunities, drive up prices for riders and reduce ride availability.\u0026#34;\u003c/p\u003e\u003cp\u003eUber and Lyft have long had a contentious relationship with city and state governments over driver protections. In comparison to the passing of \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:5;pos:1\" href=\"https://www.engadget.com/california-voters-reaffirm-that-uber-drivers-are-indeed-employees-091216147.html\" data-ylk=\"slk:Prop 22 in California;elm:context_link;elmt:doNotAffiliate;cpos:5;pos:1;itc:0;sec:content-canvas\"\u003eProp 22 in California\u003c/a\u003e, which reclassified gig workers as contractors after \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:6;pos:1\" href=\"https://www.nytimes.com/2019/09/11/technology/california-gig-economy-bill.html\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:another law did the opposite;elm:context_link;elmt:doNotAffiliate;cpos:6;pos:1;itc:0;sec:content-canvas\"\u003eanother law did the opposite\u003c/a\u003e, even a diminished minimum wage law in New York is better than nothing.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-20T22:00:11Z",
  "modifiedTime": null
}
