{
  "id": "88fc0739-c42b-463b-a546-e0a84dfc52cc",
  "title": "The latest Invincible season 3 trailer shows off Mark’s new duds",
  "link": "https://www.theverge.com/2024/12/8/24316383/invincible-season-3-trailer-amazon-prime-video",
  "description": "",
  "author": "Wes Davis",
  "published": "2024-12-08T14:49:34-05:00",
  "source": "https://www.theverge.com/rss/index.xml",
  "categories": null,
  "byline": "Wes Davis",
  "length": 937,
  "excerpt": "Amazon Prime Video released a new action-packed trailer for Invincible season three, showing the return of Mark Grayson, Oliver, GDA director Sinclair, and more.",
  "siteName": "The Verge",
  "favicon": "https://www.theverge.com/icons/android_chrome_512x512.png",
  "text": "Invincible season three is on its way, and Amazon has released a new trailer in which hero Mark Grayson takes on robots, rams a rocket in space, and chastises Oliver. He also gets a new blue suit.“Mark’s speed has increased 65 percent; his endurance, 70 percent; and his strength, 138 percent,” says GDA agent Donald Ferguson (Chris Diamantopoulos), setting up the action-filled trailer. What follows are a Mortal Kombat-style beheading, nuclear explosions, and the promise of drama as Mark (Steven Yeun) tells GDA director Cecil Stedman (Walton Goggins) that he’s quitting. The action will apparently persist all season long, as Invincible creator Robert Kirkman said earlier this year that he wanted every episode of it to “feel like it’s a finale.” And unlike the last season, this one won’t have a midseason break. Three episodes will start streaming on February 6th, 2025, with a new one following every Thursday through March 13th.",
  "image": "https://cdn.vox-cdn.com/thumbor/lh6q4FDFJuAO8r5RR24ZaKFofKs=/0x0:3002x1621/1200x628/filters:focal(1501x811:1502x812)/cdn.vox-cdn.com/uploads/chorus_asset/file/25780218/Screenshot_2024_12_08_at_1.41.40_PM.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"zephr-anchor\"\u003e\u003cp\u003e\u003cem\u003eInvincible \u003c/em\u003eseason three is on its way, and Amazon has \u003ca href=\"https://youtu.be/rbHUhCcSXEM?si=uYVYLDo_w0xcVbHH\"\u003ereleased a new trailer\u003c/a\u003e in which hero Mark Grayson takes on robots, rams a rocket in space, and chastises Oliver. He also gets a new blue suit.\u003c/p\u003e\u003cp\u003e“Mark’s speed has increased 65 percent; his endurance, 70 percent; and his strength, 138 percent,” says GDA agent Donald Ferguson (Chris Diamantopoulos), setting up the action-filled trailer. What follows are a \u003cem\u003eMortal Kombat-\u003c/em\u003estyle beheading, nuclear explosions, and the promise of drama as Mark (Steven Yeun) tells GDA director Cecil Stedman (Walton Goggins) that he’s quitting. \u003c/p\u003e\u003cp\u003eThe action will apparently persist all season long, as \u003cem\u003eInvincible\u003c/em\u003e creator Robert Kirkman \u003ca href=\"https://www.gamesradar.com/invincible-season-3-tease-robert-kirkman/\"\u003esaid earlier this year\u003c/a\u003e that he wanted every episode of it to “feel like it’s a finale.” And unlike the last season, this one \u003ca href=\"https://www.theverge.com/2024/10/15/24270890/invincible-season-3-premiere-date-no-break-amazon\"\u003ewon’t have a midseason break\u003c/a\u003e. Three episodes will start streaming on February 6th, 2025, with a new one following every Thursday through March 13th.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-08T19:49:34.08Z",
  "modifiedTime": "2024-12-08T19:49:34.08Z"
}
