{
  "id": "90db5827-5307-4642-b138-8685f6078f0d",
  "title": "TikTok's 'Hydrogen Water' Trend Is Some of the Silliest Nonsense I've Seen in a While",
  "link": "https://lifehacker.com/health/tiktok-hydrogen-water-trend",
  "description": "The videos about its \"health benefits\" are all hilariously awful sales pitches for a battery-powered water bottle.",
  "author": "Beth Skwarecki",
  "published": "Mon, 14 Oct 2024 21:30:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Body"
  ],
  "byline": "Beth Skwarecki",
  "length": 5919,
  "excerpt": "The videos about its \"health benefits\" are all hilariously awful sales pitches for a battery-powered water bottle.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "We may earn a commission from links on this page. Credit: TikTok The latest trend on TikTok is hyping up the benefits of hydrogen water while attempting to sell you a battery-powered water bottle that produces it. Does hydrogen water really hydrate you better and cure your gut issues? Do those bottles even make hydrogen water? What is hydrogen water? Leaving TikTok aside for the moment, let’s talk about what it means for your water to have hydrogen in it. A water molecule is made of one oxygen atom bound to two hydrogen atoms, hence its chemical formula: H2O. But that’s not the hydrogen they’re talking about. Hydrogen can also be a gas, where two hydrogen molecules are bound to each other. The chemical formula for that is H2. Hydrogen gas is lightweight; it’s also flammable, as famously demonstrated in the Hindenburg disaster. Hydrogen water, also called hydrogenated water, is water that has hydrogen gas bubbled through it. The gas will want to float into the air, so it’s hard to actually keep the hydrogen in the water; leaving it uncapped will allow the gas escape, much like carbon dioxide bubbles float away if you leave a soda uncapped and it goes flat. All this is to say: Hydrogen water is a real thing that can be manufactured. Whether it’s being manufactured appropriately in these TikToks, and whether it’s responsible for any health benefits, is harder to say.What TikTok says about hydrogen waterScrolling through the videos tagged #hydrogenwater feels like watching the classic “sell me this pencil” improv exercise. Each creator shows a bottle that glows blue when you press a button, and each enthuses over it for a different reason. One tells us how good the water tastes. One calls it “sacred water.” One says she expects it to cure her gut-health issues. One says it’s the most “hydrating” type of water. Several of these clips feature all-star huckster Gary Brecka, who claims there are 1,400 human studies on the benefits of hydrogen water. If there are, they’re really well hidden! But more on that in a minute.These videos are all light on the backing for their claims, and heavy on the sales pitch: where to get the bottle with the blue light, how much it costs, why this model is better than that one, and so on. What the science says about hydrogen waterThe few human studies out there are limited in scope and not very conclusive in their results. For example, here’s one on whether hydrogenated water improves how cancer patients feel after radiation. The patients who drank the hydrogenated water reported better quality-of-life scores, but there were no changes in health outcomes such as tumor size. Here’s another showing a small possible effect on blood lipids such as LDL, but it’s a small study and the authors acknowledge several limitations. These studies are great as a starting point for further research, but they don’t constitute proof that hydrogen water is good for you. Note that they don’t measure any health outcomes (like occurrence of disease, rates of death, or anything similarly objective). These studies also say nothing about battery-powered water bottles influencing any of the health outcomes they’re being touted for, like hydration or gut health. That fact is more than enough to dismiss these claims out of hand, but before I close, I’d like to take a closer look at that bottle they’re all trying to sell me.Does the bottle even do what it’s saying? Nearly all of the trending videos are hawking what looks like the same bottle. It appears to be the same design as this one, which is currently available on Amazon for about $30, and going for anywhere between $9 and $50 on TikTok’s “shop” page. This is in contrast to the way hydrogen water was produced in the studies I linked above. In those, participants were given magnesium sticks to drop into their water bottles for about 12 hours. Water reacts with magnesium to produce hydrogen gas and magnesium oxide; that's a pretty straightforward chemical reaction. But the TikTok version uses a water bottle with a button on it. You press the button, a blue light turns on, and tiny bubbles(?) appear in the water. I’m highly skeptical of the claim that this produces any significant amount of hydrogen gas. Supposedly the bottom section of the bottle contains an electrolysis gadget, which uses electricity to separate water molecules into their hydrogen and oxygen components. The hydrogen atoms pair up with each other to make hydrogen gas, and the oxygen molecules pair up to make oxygen gas. Creating a device to do this is a classic science experiment for kids. But is it really happening in that water bottle? First, if it were, it wouldn’t be hydrogen water, but rather hydrogen-and-oxygen water. Since hydrogen water is (sometimes) touted for its antioxidant properties, it would be strange to pair it with oxygen, a literal oxidant. And second, turning the water into gas would result in less water, as the water is converted into gas and the gas—unless tightly capped—floats away. Some of the TikTokers attempt to measure the hydrogen content of the water, but they do so with pH meters, which measure hydrogen ions (not molecular hydrogen in the form of a gas). ORP devices face a similar problem: They don’t actually tell you how much hydrogen is in the water, just its redox potential. Adding to my skepticism, the bottle’s description says you can use it with distilled water. You can’t do electrolysis on distilled water, since you need some salt or other source of ions to entice the water molecules to split apart in the first place. So while I cannot prove that these bottles are bullshit, they sure don’t sound very legit. And while I also cannot prove that hydrogen water has zero health benefits, there sure isn’t anybody out there presenting strong evidence that they do. Save your money and try a TikTok trend that will actually improve your life, like angry cleaning.",
  "image": "https://lifehacker.com/imagery/articles/01JA645H20C8HPHTSVBZDKKK10/hero-image.fill.size_1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection data-ga-module=\"content-body\"\u003e\n\n\u003cp\u003e\nWe may earn a commission from links on this page.\n\u003c/p\u003e\n\u003cimg src=\"https://lifehacker.com/imagery/articles/01JA645H20C8HPHTSVBZDKKK10/hero-image.fill.size_1248x702.v1728930254.jpg\" alt=\"Two guys trying to sell you water bottles, and a page selling lots of water bottles\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01JA645H20C8HPHTSVBZDKKK10/hero-image.fill.size_400x225.v1728930254.jpg 400w, https://lifehacker.com/imagery/articles/01JA645H20C8HPHTSVBZDKKK10/hero-image.fill.size_800x450.v1728930254.jpg 800w, https://lifehacker.com/imagery/articles/01JA645H20C8HPHTSVBZDKKK10/hero-image.fill.size_1248x702.v1728930254.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\n\u003cp\u003e\u003cspan\u003eCredit: TikTok\u003c/span\u003e\n\u003c/p\u003e\n\u003carticle data-autopogo=\"\"\u003e\n\u003chr/\u003e\n\u003cp\u003eThe latest trend on TikTok is hyping up the benefits of hydrogen water while attempting to sell you a battery-powered water bottle that produces it. Does hydrogen water really hydrate you better and cure your gut issues? Do those bottles even \u003cem\u003emake \u003c/em\u003ehydrogen water? \u003c/p\u003e\u003ch2 id=\"what-is-hydrogen-water\"\u003eWhat is hydrogen water? \u003c/h2\u003e\u003cp\u003eLeaving TikTok aside for the moment, let’s talk about what it means for your water to have hydrogen in it. A water molecule is made of one oxygen atom bound to two hydrogen atoms, hence its chemical formula: H\u003csub\u003e2\u003c/sub\u003eO. \u003c/p\u003e\u003cp\u003eBut that’s not the hydrogen they’re talking about. Hydrogen can also be a gas, where two hydrogen molecules are bound to each other. The chemical formula for that is H\u003csub\u003e2\u003c/sub\u003e. Hydrogen gas is lightweight; it’s also flammable, as famously demonstrated in the \u003ca href=\"https://en.wikipedia.org/wiki/Hindenburg_disaster\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003eHindenburg disaster\u003c/u\u003e\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eHydrogen water, also called hydrogenated water, is water that has hydrogen gas bubbled through it. The gas will want to float into the air, so it’s hard to actually \u003cem\u003ekeep\u003c/em\u003e the hydrogen in the water; leaving it uncapped will allow the gas escape, much like carbon dioxide bubbles float away if you leave a soda uncapped and it goes flat. \u003c/p\u003e\u003cp\u003eAll this is to say: Hydrogen water is a real thing that can be manufactured. Whether it’s being manufactured appropriately in these TikToks, and whether it’s responsible for any health benefits, is harder to say.\u003c/p\u003e\u003ch2 id=\"what-tiktok-says-about-hydrogen-water\"\u003eWhat TikTok says about hydrogen water\u003c/h2\u003e\u003cp\u003eScrolling through the videos tagged #hydrogenwater feels like watching the classic “sell me this pencil” improv exercise. Each creator shows a bottle that glows blue when you press a button, and each enthuses over it for a different reason. One tells us how good the water tastes. One calls it “sacred water.” One says she expects it to cure her gut-health issues. One says it’s the most “hydrating” type of water. \u003c/p\u003e\u003cp\u003eSeveral of these clips feature all-star huckster Gary Brecka, who claims there are 1,400 human studies on the benefits of hydrogen water. If there are, they’re really well hidden! But more on that in a minute.\u003c/p\u003e\u003cp\u003eThese videos are all light on the backing for their claims, and heavy on the sales pitch: where to get the bottle with the blue light, how much it costs, why this model is better than that one, and so on. \u003c/p\u003e\u003ch2 id=\"what-the-science-says-about-hydrogen-water\"\u003eWhat the science says about hydrogen water\u003c/h2\u003e\u003cp\u003eThe few human studies out there are limited in scope and not very conclusive in their results. For example, \u003ca href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3231938/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003ehere’s one\u003c/u\u003e\u003c/a\u003e on whether hydrogenated water improves how cancer patients feel after radiation. The patients who drank the hydrogenated water reported better quality-of-life scores, but there were no changes in health outcomes such as tumor size. \u003ca href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3679390/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003eHere’s another\u003c/u\u003e\u003c/a\u003e showing a small possible effect on blood lipids such as LDL, but it’s a small study and the authors acknowledge several limitations. \u003c/p\u003e\u003cp\u003eThese studies are great as a starting point for further research, but they don’t constitute proof that hydrogen water is good for you. Note that they don’t measure any health outcomes (like occurrence of disease, rates of death, or anything similarly objective). \u003c/p\u003e\u003cp\u003eThese studies also say nothing about battery-powered water bottles influencing any of the health outcomes they’re being touted for, like hydration or gut health. That fact is more than enough to dismiss these claims out of hand, but before I close, I’d like to take a closer look at that bottle they’re all trying to sell me.\u003c/p\u003e\u003ch2 id=\"does-the-bottle-even-do-what-its-saying\"\u003eDoes the bottle even do what it’s saying? \u003c/h2\u003e\u003cp\u003eNearly all of the trending videos are hawking what looks like the same bottle. It appears to be the same design as \u003ca href=\"https://zdcs.link/QPbVLD?pageview_type=Standard\u0026amp;template=Explainers\u0026amp;module=content-body\u0026amp;element=offer\u0026amp;item=text-link\u0026amp;element_label=this%20one\u0026amp;short_url=QPbVLD\u0026amp;u=https%3A%2F%2Flifehacker.com%2Fhealth%2Ftiktok-hydrogen-water-trend\" rel=\"nofollow sponsored\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003ethis one\u003c/u\u003e\u003c/a\u003e, which is currently available on Amazon for about $30, and going for anywhere between $9 and $50 on TikTok’s “shop” page. \u003c/p\u003e\u003cp\u003eThis is in contrast to the way hydrogen water was produced in the studies I linked above. In those, participants were given magnesium sticks to drop into their water bottles for about 12 hours. Water reacts with magnesium to produce hydrogen gas and magnesium oxide; that\u0026#39;s a pretty straightforward chemical reaction. But the TikTok version uses a water bottle with a button on it. You press the button, a blue light turns on, and tiny bubbles(?) appear in the water. \u003c/p\u003e\u003cp\u003eI’m highly skeptical of the claim that this produces any significant amount of hydrogen gas. Supposedly the bottom section of the bottle contains an electrolysis gadget, which uses electricity to separate water molecules into their hydrogen and oxygen components. The hydrogen atoms pair up with each other to make hydrogen gas, and the oxygen molecules pair up to make oxygen gas. \u003c/p\u003e\u003cp\u003eCreating a device to do this is a \u003ca href=\"https://www.wikihow.com/Electrolyse-Water\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003eclassic science experiment\u003c/u\u003e\u003c/a\u003e for kids. But is it really happening in that water bottle? First, if it were, it wouldn’t be hydrogen water, but rather hydrogen-and-oxygen water. Since hydrogen water is (sometimes) touted for its antioxidant properties, it would be strange to pair it with oxygen, a literal oxidant. And second, turning the water into gas would result in \u003cem\u003eless water\u003c/em\u003e, as the water is converted into gas and the gas—unless tightly capped—floats away. \u003c/p\u003e\u003cp\u003eSome of the TikTokers attempt to measure the hydrogen content of the water, but they do so with pH meters, which measure hydrogen \u003cem\u003eions\u003c/em\u003e (not molecular hydrogen in the form of a gas). ORP devices face a similar problem: They don’t actually tell you how much hydrogen is in the water, \u003ca href=\"https://blog.orendatech.com/understanding-orp\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003ejust its redox potential\u003c/u\u003e\u003c/a\u003e. Adding to my skepticism, the bottle’s description says you can use it with distilled water. You can’t do electrolysis on distilled water, since you need some salt or other source of ions to entice the water molecules to split apart in the first place. \u003c/p\u003e\u003cp\u003eSo while I cannot prove that these bottles are bullshit, they sure don’t sound very legit. And while I also cannot prove that hydrogen water has zero health benefits, there sure isn’t anybody out there presenting strong evidence that they do. Save your money and try a TikTok trend that will actually improve your life, like \u003ca href=\"https://lifehacker.com/home/harness-the-power-of-tiktoks-angry-cleaning-trend\" target=\"_blank\"\u003e\u003cu\u003eangry cleaning\u003c/u\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003c/article\u003e\n\n\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-14T21:30:00Z",
  "modifiedTime": "2024-10-14T21:30:00Z"
}
