{
  "id": "99afd280-427d-432c-8792-e7891ff25c27",
  "title": "Fidelity Prepares To Unveil Its Own Stablecoin",
  "link": "https://news.slashdot.org/story/25/03/26/2321223/fidelity-prepares-to-unveil-its-own-stablecoin?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "According to the Financial Times, Fidelity Investments is in advanced stages of developing its own stablecoin. Binance reports: The Boston-based financial services giant plans for the token to serve as a form of digital cash, according to the report, which cites two people close to the matter. The token would form part of company's strategy to enter the tokenized government bonds market. Stablecoins are a cryptocurrency whose value is pegged to a real-world asset such as the U.S. dollar or gold. They provide a convenient way for crypto traders to preserve their fiat value without having to cash out of the market. The news emerges just days after Fidelity filed paperwork to register a blockchain-based version of its U.S. dollar money market fund. The company seeks to register an \"OnChain\" share class of its Treasury Digital Fund (FYHXX), which holds cash and U.S. Treasury securities and is available only to Fidelity's hedge fund and institutional clients. A Fidelity stablecoin could fill the role of cash in this fund. The report comes a day after World Liberty Financial, a crypto venture backed by Donald Trump and his family, launched a U.S. dollar-pegged stablecoin called USD1. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2025-03-27T00:50:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "bitcoin"
  ],
  "byline": "",
  "length": 1200,
  "excerpt": "According to the Financial Times, Fidelity Investments is in advanced stages of developing its own stablecoin. Binance reports: The Boston-based financial services giant plans for the token to serve as a form of digital cash, according to the report, which cites two people close to the matter. The ...",
  "siteName": "",
  "favicon": "",
  "text": "According to the Financial Times, Fidelity Investments is in advanced stages of developing its own stablecoin. Binance reports: The Boston-based financial services giant plans for the token to serve as a form of digital cash, according to the report, which cites two people close to the matter. The token would form part of company's strategy to enter the tokenized government bonds market. Stablecoins are a cryptocurrency whose value is pegged to a real-world asset such as the U.S. dollar or gold. They provide a convenient way for crypto traders to preserve their fiat value without having to cash out of the market. The news emerges just days after Fidelity filed paperwork to register a blockchain-based version of its U.S. dollar money market fund. The company seeks to register an \"OnChain\" share class of its Treasury Digital Fund (FYHXX), which holds cash and U.S. Treasury securities and is available only to Fidelity's hedge fund and institutional clients. A Fidelity stablecoin could fill the role of cash in this fund. The report comes a day after World Liberty Financial, a crypto venture backed by Donald Trump and his family, launched a U.S. dollar-pegged stablecoin called USD1.",
  "image": "https://a.fsdn.com/sd/topics/bitcoin_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-176833227\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tAccording to the \u003ca href=\"https://www.ft.com/content/7df7c1d9-9e1f-4de4-8161-1cdb6f4e0e7f\"\u003eFinancial Times\u003c/a\u003e, Fidelity Investments is in advanced stages of \u003ca href=\"https://www.binance.com/en/square/post/22063506325617\"\u003edeveloping its own stablecoin\u003c/a\u003e. Binance reports: \u003ci\u003e The Boston-based financial services giant plans for the token to serve as a form of digital cash, according to the report, which cites two people close to the matter. The token would form part of company\u0026#39;s strategy to enter the tokenized government bonds market. Stablecoins are a cryptocurrency whose value is pegged to a real-world asset such as the U.S. dollar or gold. They provide a convenient way for crypto traders to preserve their fiat value without having to cash out of the market.\n\u003cp\u003e \nThe news emerges just days after Fidelity filed paperwork to register a blockchain-based version of its U.S. dollar money market fund. The company seeks to register an \u0026#34;OnChain\u0026#34; share class of its Treasury Digital Fund (FYHXX), which holds cash and U.S. Treasury securities and is available only to Fidelity\u0026#39;s hedge fund and institutional clients. A Fidelity stablecoin could fill the role of cash in this fund. \u003c/p\u003e\u003c/i\u003e The report comes a day after World Liberty Financial, a crypto venture backed by Donald Trump and his family, \u003ca href=\"https://slashdot.org/story/25/03/25/2045243/trumps-crypto-venture-introduces-a-stabelcoin\"\u003elaunched a U.S. dollar-pegged stablecoin called USD1\u003c/a\u003e.\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
