{
  "id": "9aff034d-b57f-4ae0-8118-ab73f84a3328",
  "title": "NLRB accuses Apple of illegally restricting employee Slack and social media use",
  "link": "https://www.engadget.com/big-tech/nlrb-accuses-apple-of-illegally-restricting-employee-slack-and-social-media-use-200059723.html?src=rss",
  "description": "The National Labor Relations Board has accused Apple of infringing on its employees’ rights to advocate for better working conditions. In a complaint spotted by Reuters, the agency alleges Apple illegally fired an employee who had used Slack to advocate for workplace changes at the company. Separately, the NLRB accuses Apple of forcing another worker to delete a social media post. The case stems from a 2021 complaint filed by #AppleToo co-organizer Janneke Parrish. In October of that year, Apple fired Parrish for allegedly sharing confidential information, a claim she denies. Per the complaint, Parrish used Slack and public social media posts to advocate for permanent remote work. She also shared open letters critical of the tech giant, distributed a pay equity survey, and recounted instances of sexual and racial discrimination at Apple. According to the labor board, Apple’s policies bars employees from creating Slack channels without first obtaining permission from a manager. Instead, workers must direct their workplace concerns to either management or a “People Support” group the company maintains. An example of the type of concerns some employees used Slack to voice can be seen in a 2021 tweet from former Apple employee Ashley Gjøvik. “We look forward to holding Apple accountable at trial for implementing facially unlawful rules and terminating employees for engaging in the core protected activity of calling out gender discrimination and other civil rights violations that permeated the workplace,” Parrish’s lawyer, Laurie Burgess, told Reuters. Apple disputes Parrish's claims. \"We are and have always been deeply committed to creating and maintaining a positive and inclusive workplace. We take all concerns seriously and we thoroughly investigate whenever a concern is raised and, out of respect for the privacy of any individuals involved, we do not discuss specific employee matters,\" an Apple spokesperson told Engadget. \"We strongly disagree with these claims and will continue to share the facts at the hearing.\" Provided Apple does not settle with the agency, an initial hearing is scheduled for February with an administrative judge. The NLRB is looking to force the company to change its policy and reimburse Parrish for the financial hardships she suffered due to her firing. Last week, the NLRB accused Apple of forcing employees to sign illegal and overly broad confidentially, non-disclosure and non-compete agreements. Update 7:09PM ET: Added comment from Apple. This article originally appeared on Engadget at https://www.engadget.com/big-tech/nlrb-accuses-apple-of-illegally-restricting-employee-slack-and-social-media-use-200059723.html?src=rss",
  "author": "Igor Bonifacic",
  "published": "Fri, 11 Oct 2024 20:01:04 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Society \u0026 Culture",
    "Company Legal \u0026 Law Matters",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Igor Bonifacic"
  ],
  "byline": "Igor Bonifacic",
  "length": 2500,
  "excerpt": "In a complaint filed Thursday, the National Labor Relations Board accused Apple of infringing on its employees’ rights to advocate for better working...",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "The National Labor Relations Board has accused Apple of infringing on its employees’ rights to advocate for better working conditions. In a complaint spotted by Reuters, the agency alleges Apple illegally fired an employee who had used Slack to advocate for workplace changes at the company. Separately, the NLRB accuses Apple of forcing another worker to delete a social media post.The case stems from a 2021 complaint filed by #AppleToo co-organizer Janneke Parrish. In October of that year, Apple fired Parrish for allegedly sharing confidential information, a claim she denies. Per the complaint, Parrish used Slack and public social media posts to advocate for permanent remote work.She also shared open letters critical of the tech giant, distributed a pay equity survey, and recounted instances of sexual and racial discrimination at Apple. According to the labor board, Apple’s policies bars employees from creating Slack channels without first obtaining permission from a manager. Instead, workers must direct their workplace concerns to either management or a “People Support” group the company maintains. An example of the type of concerns some employees used Slack to voice can be seen in a 2021 tweet from former Apple employee Ashley Gjøvik.“We look forward to holding Apple accountable at trial for implementing facially unlawful rules and terminating employees for engaging in the core protected activity of calling out gender discrimination and other civil rights violations that permeated the workplace,” Parrish’s lawyer, Laurie Burgess, told Reuters.Apple disputes Parrish's claims. \"We are and have always been deeply committed to creating and maintaining a positive and inclusive workplace. We take all concerns seriously and we thoroughly investigate whenever a concern is raised and, out of respect for the privacy of any individuals involved, we do not discuss specific employee matters,\" an Apple spokesperson told Engadget. \"We strongly disagree with these claims and will continue to share the facts at the hearing.\"Provided Apple does not settle with the agency, an initial hearing is scheduled for February with an administrative judge. The NLRB is looking to force the company to change its policy and reimburse Parrish for the financial hardships she suffered due to her firing. Last week, the NLRB accused Apple of forcing employees to sign illegal and overly broad confidentially, non-disclosure and non-compete agreements.Update 7:09PM ET: Added comment from Apple.",
  "image": "https://s.yimg.com/ny/api/res/1.2/dpvdVCyi1Wv1aC_yJh3Mkw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-10/6b9aeae0-880a-11ef-beff-48182641a8fa",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe National Labor Relations Board has accused Apple of infringing on its employees’ rights to advocate for better working conditions. In a \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://www.nlrb.gov/case/05-RC-352497\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:complaint;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003ecomplaint\u003c/a\u003e spotted by \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://www.reuters.com/technology/apple-accused-restricting-workers-slack-social-media-use-by-us-labor-board-2024-10-11/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Reuters;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003eReuters\u003c/em\u003e\u003c/a\u003e, the agency alleges Apple illegally fired an employee who had used Slack to advocate for workplace changes at the company. Separately, the NLRB accuses Apple of forcing another worker to delete a social media post.\u003c/p\u003e\u003cp\u003eThe case stems from a 2021 complaint filed by \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://www.engadget.com/cher-scarlett-appletoo-leaving-apple-085237633.html\" data-ylk=\"slk:#AppleToo co-organizer Janneke Parrish;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e#AppleToo co-organizer Janneke Parrish\u003c/a\u003e. In October of that year, Apple fired Parrish for allegedly sharing confidential information, a \u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://www.bizjournals.com/bizwomen/news/latest-news/2021/10/appletoo-organizer-didnt-expect-to-be-fired.html\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:claim she denies;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eclaim she denies\u003c/a\u003e. Per the complaint, Parrish used Slack and public social media posts to advocate for permanent remote work.\u003c/p\u003e\u003cp\u003eShe also shared open letters critical of the tech giant, distributed a pay equity survey, and recounted instances of sexual and racial discrimination at Apple. According to the labor board, Apple’s policies bars employees from creating Slack channels without first obtaining permission from a manager. Instead, workers must direct their workplace concerns to either management or a “People Support” group the company maintains. An example of the type of concerns some employees used Slack to voice can be seen in a \u003ca data-i13n=\"cpos:5;pos:1\" href=\"https://x.com/ashleygjovik/status/1426007042477608960\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:2021 tweet;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e2021 tweet\u003c/a\u003e from \u003ca data-i13n=\"cpos:6;pos:1\" href=\"https://www.engadget.com/apple-fires-ashley-gjovik-025858158.html\" data-ylk=\"slk:former Apple employee Ashley Gjøvik;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eformer Apple employee Ashley Gjøvik\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e“We look forward to holding Apple accountable at trial for implementing facially unlawful rules and terminating employees for engaging in the core protected activity of calling out gender discrimination and other civil rights violations that permeated the workplace,” Parrish’s lawyer, Laurie Burgess, told \u003cem\u003eReuters\u003c/em\u003e.\u003c/p\u003e\u003cp\u003eApple disputes Parrish\u0026#39;s claims. \u0026#34;We are and have always been deeply committed to creating and maintaining a positive and inclusive workplace. We take all concerns seriously and we thoroughly investigate whenever a concern is raised and, out of respect for the privacy of any individuals involved, we do not discuss specific employee matters,\u0026#34; an Apple spokesperson told Engadget. \u0026#34;We strongly disagree with these claims and will continue to share the facts at the hearing.\u0026#34;\u003c/p\u003e\u003cp\u003eProvided Apple does not settle with the agency, an initial hearing is scheduled for February with an administrative judge. The NLRB is looking to force the company to change its policy and reimburse Parrish for the financial hardships she suffered due to her firing. Last week, the \u003ca data-i13n=\"cpos:7;pos:1\" href=\"https://www.engadget.com/big-tech/us-labor-board-accuses-apple-of-violating-employees-rights-164643503.html\" data-ylk=\"slk:NLRB accused Apple;cpos:7;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eNLRB accused Apple\u003c/a\u003e of forcing employees to sign illegal and overly broad confidentially, non-disclosure and non-compete agreements.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate 7:09PM ET\u003c/strong\u003e: Added comment from Apple.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-11T20:01:04Z",
  "modifiedTime": null
}
