{
  "id": "9c7e8afd-040b-487f-a4b2-6d543bcc3d7e",
  "title": "619: Master Plan to Take Over the World",
  "link": "https://atp.fm/619",
  "description": "Pre-show: New member special: ATP Insider: Making The Show Become an ATP Member to listen ATP Gift Memberships Follow-up: “Hey, Future Marco” wasn’t discussed on the member’s special (via Martim) Can Marco recognize waveforms? Descript Emo Siri It started before 18.2 (via Dan Mielcarz) She pahks heah cah… sometimes? (via Dave Martin) Immersive video More about the Blackmagic immersive camera (via videoalex) Insta360 Titan Software-based immersive video Depth Anything Immersive video prior art (via James O’Loughlin) Welcome to Light Fields Deep View Video Neural Radiance Fields for View Synthesis (via Joseph Humfre) Demo for the Meta Quest John’s app More on Smart Update and clones from Dave Nanian Unexpected gains in software (via Peter Marks) Why even bother, asks Harvey Simon New Vision Pro content — again! Apple and bootable macOS backups Mike Bombich at Carbon Copy Cloner has thoughts Original blog post from May 2021 Secure boot asr: Apple Software Restore Ask ATP: Does the new Recents item in Finder conflict with Apple’s privacy stance? (via Cira Mazzola) What’s the correct location to save random scripts? (via tuckerk) ~/bin /usr/local/bin Do we use the macOS firewall? (via Saul Sutherland) What are we using for cameras these days? (via Torstein) Fuji X-T5: black recommended for control legibility 27mm pancake (41mm equiv.) 16-50 zoom (24-76mm equiv.): small, light, great quality 16-55 f/2.8 II zoom (24-84mm equiv.): surprisingly small and light for f/2.8, great quality Fuji GFX 100S (old version; this is the current one) 50mm “pancake” (40mm equiv.) Olympus OM-D E-M10 Sony a7 III SEL2470GM2 Sony FE 24-70mm f/2.8 GM II Post-show: Erin’s Volvo XC90 PHEV, ~6 months on Including a detour to discuss professional Christmas light installation Members-only ATP Overtime: The Best \u0026 Worst of 2024 Sponsored by: Members like you! Become a member for ad-free episodes, member specials, and our early-release, unedited “bootleg” feed!",
  "author": "ATP",
  "published": "Thu, 26 Dec 2024 16:02:45 +0000",
  "source": "https://atp.fm/rss",
  "categories": null,
  "byline": "",
  "length": 132,
  "excerpt": "Three nerds discussing tech, Apple, programming, and loosely related matters.",
  "siteName": "",
  "favicon": "https://cdn.atp.fm/images/20231026-favicon-180.png",
  "text": "Three nerds discussing tech, Apple, programming, and loosely related matters. Hosted by Marco Arment, Casey Liss, and John Siracusa.",
  "image": "https://cdn.atp.fm/artwork",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThree nerds discussing tech, Apple, programming, and loosely related matters. Hosted by \u003ca href=\"https://marco.org/\"\u003eMarco Arment\u003c/a\u003e, \u003ca href=\"https://www.caseyliss.com/\"\u003eCasey Liss\u003c/a\u003e, and \u003ca href=\"https://hypercritical.co/\"\u003eJohn Siracusa\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
