{
  "id": "a3583bae-e103-4e3a-a77f-af4645c440a2",
  "title": "As US marks first H5N1 bird flu death, WHO and CDC say risk remains low",
  "link": "https://arstechnica.com/science/2025/01/as-us-marks-first-h5n1-bird-flu-death-who-and-cdc-say-risk-remains-low/",
  "description": "No human-to-human spread identified and no concerning mutations circulating.",
  "author": "Beth Mole",
  "published": "Tue, 07 Jan 2025 23:14:34 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Health",
    "Science",
    "bird flu",
    "birds",
    "cattle",
    "CDC",
    "cows",
    "dairy",
    "flu",
    "H5N1",
    "Infectious disease",
    "Louisiana",
    "WHO"
  ],
  "byline": "Beth Mole",
  "length": 1837,
  "excerpt": "No human-to-human spread identified and no concerning mutations circulating.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "The H5N1 bird flu situation in the US seems more fraught than ever this week as the virus continues to spread swiftly in dairy cattle and birds while sporadically jumping to humans. On Monday, officials in Louisiana announced that the person who had developed the country's first severe H5N1 infection had died of the infection, marking the country's first H5N1 death. Meanwhile, with no signs of H5N1 slowing, seasonal flu is skyrocketing, raising anxiety that the different flu viruses could mingle, swap genetic elements, and generate a yet more dangerous virus strain. But, despite the seemingly fever-pitch of viral activity and fears, a representative for the World Health Organization today noted that risk to the general population remains low—as long as one critical factor remains absent: person-to-person spread. \"We are concerned, of course, but we look at the risk to the general population and, as I said, it still remains low,\" WHO spokesperson Margaret Harris told reporters at a Geneva press briefing Tuesday in response to questions related to the US death. In terms of updating risk assessments, you have to look at how the virus behaved in that patient and if it jumped from one person to another person, which it didn't, Harris explained. \"At the moment, we're not seeing behavior that's changing our risk assessment,\" she added. In a statement on the death late Monday, the US Centers for Disease Control and Prevention emphasized that no human-to-human transmission has been identified in the US. To date, there have been 66 documented human cases of H5N1 infections since the start of 2024. Of those, 40 were linked to exposure to infected dairy cows, 23 were linked to infected poultry, two had no clear source, and one case—the fatal case in Louisiana—was linked to exposure to infected backyard and wild birds.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2014/03/112988956_231faf4c92_o.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                      \n                      \n          \u003cp\u003eThe H5N1 bird flu situation in the US seems more fraught than ever this week as the virus continues to spread swiftly in dairy cattle and birds while sporadically jumping to humans.\u003c/p\u003e\n\u003cp\u003eOn Monday, officials in Louisiana announced that the person who had developed the country\u0026#39;s first severe H5N1 infection had died of the infection, marking the country\u0026#39;s first H5N1 death. Meanwhile, with no signs of H5N1 slowing, \u003ca href=\"https://www.cdc.gov/fluview/surveillance/2024-week-52.html\"\u003eseasonal flu is skyrocketing\u003c/a\u003e, raising anxiety that the different flu viruses could mingle, swap genetic elements, and generate a yet more dangerous virus strain.\u003c/p\u003e\n\u003cp\u003eBut, despite the seemingly fever-pitch of viral activity and fears, a representative for the World Health Organization today noted that risk to the general population remains low—as long as one critical factor remains absent: person-to-person spread.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We are concerned, of course, but we look at the risk to the general population and, as I said, it still remains low,\u0026#34; WHO spokesperson Margaret Harris told reporters at \u003ca href=\"https://www.unognewsroom.org/story/en/2470%20/un-geneva-press-briefing-07-january-2025/0/WjnegYbwZ1\"\u003ea Geneva press briefing Tuesday\u003c/a\u003e in response to questions related to the US death. In terms of updating risk assessments, you have to look at how the virus behaved in that patient and if it jumped from one person to another person, which it didn\u0026#39;t, Harris explained. \u0026#34;At the moment, we\u0026#39;re not seeing behavior that\u0026#39;s changing our risk assessment,\u0026#34; she added.\u003c/p\u003e\n\u003cp\u003eIn a statement on the death late Monday, the US Centers for Disease Control and Prevention emphasized that no human-to-human transmission has been identified in the US. To date, there have been 66 documented human cases of H5N1 infections since the start of 2024. Of those, 40 were linked to exposure to infected dairy cows, 23 were linked to infected poultry, two had no clear source, and one case—the fatal case in Louisiana—was linked to exposure to infected backyard and wild birds.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-07T23:14:34Z",
  "modifiedTime": "2025-01-07T23:40:58Z"
}
