{
  "id": "a38d104e-cc94-4bcb-8e99-22906d7076fb",
  "title": "A Beginner's Guide to Gym Terminology",
  "link": "https://lifehacker.com/beginners-guide-to-gym-terminology?utm_medium=RSS",
  "description": "Supersets, compounds, RPE, and what \"rest\" really means.",
  "author": "Beth Skwarecki",
  "published": "Thu, 13 Feb 2025 22:00:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Fitness"
  ],
  "byline": "Beth Skwarecki",
  "length": 11742,
  "excerpt": "Supersets, compounds, RPE, and what \"rest\" really means.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "Credit: Syda Productions - Shutterstock Every part of life has its lingo, and the gym is no exception. We’ve collected a list of the lifting-related words that most often confuse beginners, so read on to learn what you might be missing. EquipmentBarbellsA barbell is the bar that you load the plates on, either empty (the “empty bar”) or loaded (for example, “a 225 pound barbell”). A standard Olympic-sized barbell is 20 kilograms, or in many American gyms, 45 pounds. (20 kilos is 44 pounds, so it doesn’t really matter which is which.) There are a variety of other barbells that exist, including Olympic women’s bars that weigh 15 kilos, EZ-curl bars with an ergonomic curve to them, and more. We have a guide to all of these here. Cable machineA cable machine has a thin rope, or cable, that connects the weights to a handle through one or more pulleys. Typically you can choose the attachment you'd like to use as a handle, and you may also have the option of moving the pulley to your desired height. Pulldowns, pushdowns, cable flyes, and cable crossovers are a few exercises you can do on a cable machine. Here is a list of even more.Clips or collarsWhen you load weights onto a barbell (or an adjustable dumbbell), it’s handy to have something to hold the weights on there so they don’t slide around. This may be a spring clip, which looks like a clothespin, or a round collar with a latch on it. DumbbellsDumbbells are the smaller hand weights around the gym. They typically come in pairs, and cannot be taken apart. (You can buy adjustable dumbbells for home gyms, though, which have their own teensy little plates on each end.) They are so named because some of the weights historically used for strength training were in the shape of bells (think of a kettlebell, but more...bell-shaped) and since they didn’t make noise, they were silent, or “dumb.” Dumbbells are usually \"fixed,\" with each dumbbell weighing a certain amount, but there are also adjustable dumbbells, popular for home gyms, that let you adjust the weight on the fly.Free weightsFree weights are the barbells and dumbbells in a gym, as opposed to the machines. They are “free” weights because they aren’t attached to anything; you can pick them up and do whatever you want.KettlebellsThese are the round weights with a handle on top. You can use them for most of the same lifts you'd do with a dumbbell (like rows, or overhead presses) but you can also swing them or do more advanced moves like kettlebell snatches.MachinesThe opposite of a free weight would be a machine. There are cable machines, where you hold a handle that is connected via a cable and pulley to a stack of weights; there are other types of selectorized machines, where you put a pin in a stack of weights and then do the exercise in whatever way is indicated on the instructions (for example, you may push or pull a set of handles, or move a pad with your legs). And there are plate-loaded machines, where you take a plate off a rack somewhere in the gym and place it onto the machine yourself. PlatesWeight plates are the heavy, round discs that typically load onto the ends of a barbell. In American gyms, the largest ones are typically 45 pounds. You can brag about your lifts by saying how many full-sized plates are on each end of the bar. One hundred and thirty-five pounds (45 pounds per side, on a 45 pound bar) is a “one plate” lift. Two hundred and twenty-five is “two plates.” Three hundred and fifteen is “three plates,” and so on. Weight lifting basicsCircuitA circuit, sometimes called a giant set, is when you do several exercises (usually three to six) by doing one set of each, then return to the beginning of the list and start over. (It's called a \"circuit\" or \"rounds\" because you keep going through the list in a circular fashion. While these can save time, the goal of circuit training is often to keep your heart rate high, so that you’re getting a bit of a cardio stimulus even though the main focus is weight training. Compound liftA compound lift is one that uses many muscles at the same time. In a squat, for example, your quads (on the front of your thighs) are getting the most work, but your glutes, adductors, hamstrings, and core all do their part. This is in contrast to an isolation lift.FailureIf you do a lift \"to failure,\" that means you cannot physically do another rep. You might do 10 bicep curls, 11, 12, thir—nope, that's it, can't finish the thirteenth rep. You \"went to failure\" on that exercise. It's not necessary to go to failure, but it's a good way to make sure you're really squeezing as much work as you can out of each set. It's also common to stop a few reps before failure—in our example, stopping at 10 reps would have still given you a good workout. Stopping at five would not have been very productive. In bigger lifts, like a squat, you may not want to go to actual, physical failure very often. So you might go until technical failure—in other words, for as many reps as you can while you can maintain good form. Isolation liftAn isolation lift is meant to isolate just one muscle or muscle group. While a squat is a compound lift that works your quads and several other muscles, an example of an isolation lift for the quadriceps would be a leg extension machine. PercentagesSometimes lifting programs tell you to do a set at, say, 80% of your max. This instruction assumes that you know what your maximum, or 1RM, is. So, if you can bench press 100 pounds once, you might be asked to do a set of five reps at 80%, which is 80 pounds. RepsWe don’t usually lift a weight just once; we pick it up and set it down multiple times. Each of those individual lifts is a repetition, or a “rep” for short. You might do eight reps at a time, or 12, or five. Even if you only do one, you might still call it \"a rep,\" because when you’re in the gym for an hour your brain starts to melt a little. “That was a good rep,” you might say after a heavy single. We all know what you mean. RestIf your program asks you to rest between sets, that means you sit down and do nothing. Really. Depending on the exercise, you may rest anywhere from 30 seconds to five minutes. Read my explainer here on how long to rest and why. RPERating of perceived exertion, on a 1-10 scale. A 10 means an all-out lift, you couldn’t have done any more. (If you went to failure, that's a 10.) Nine means you could have done one more rep, but you stopped there. Eight means you could have done two more reps, and so on. For compound lifts like squats, sets are often done at a seven or eight RPE. Nobody bothers to track RPE below a six or so. SetsA group of reps is a set. You might do five sets of three reps, for example. This is usually written as 5x3 (sets x reps), although a few people out there will flip the numbers around. If you’re not sure, ask. SupersetYou can superset two exercises by doing a set of each before resting. This can save time in the gym. Most often, a superset involves two lifts done with opposite or unrelated muscles: you can superset a bench press with a barbell row, or even a squat with an overhead press. Usually you’ll rest for a short time after you do both, and then do them again.WeightliftingWeightlifting doesn't just mean lifting weights—it's the name of a sport contested in the Olympics, where people explosively raise a barbell from the floor to overhead. They'll do it in one movement, called a snatch, or in a two-step process called the clean and jerk. To avoid confusion, this is sometimes called \"Olympic weightlifting\" or, if you're a Crossfitter, \"oly lifting.\" Weightlifters commonly drop their barbells from overhead (intentional or not) and thus need rubbery bumper plates and plenty of space on a platform.Ways of lifting weights1RM, 3RM, 5RMThese are a one rep max, a three rep max, and a five rep max, respectively. (You can substitute any number. Want to find a 6RM? Go for it.) In other words, a 1RM is the maximum weight that you can move for one rep. When somebody asks “how much ya bench?” they are asking for your 1RM. This weight might also be called your “max” or your “best,” as in, “my best bench press is 150 pounds.” The others are “rep maxes.” Maybe you know that you can deadlift 225 pounds for five reps, but that’s it, you know you couldn’t get a sixth at that weight. (Maybe you tried for a sixth and failed.) That’s a 5RM.AMRAPAs many reps as possible. Or, if you’re doing a workout with multiple lifts, it may mean as many rounds (of the whole circuit) as possible. Sometimes either of these may be written AMAP (as many as possible). If you're going to technical failure rather than true failure, I've seen that called \"AMAP (as many as pretty).\"Drop setsWhen you do a set of reps to failure, your muscles haven’t totally given out; they just can’t lift any more of that particular weight. So bodybuilders will sometimes employ drop sets, “dropping” some of the weight to do the exercise again with something lighter. You might use 25-pound dumbbells, then put them back and do a few more reps with 20-pound dumbbells, then grab the 15-pounders, and so on. EMOMEvery minute, on the minute. For a 10-minute EMOM, you’ll start your stopwatch, do the exercise (say, 10 kettlebell swings), and then rest for the remainder of the minute. The quicker you get the lifts done, the more time you have to rest. (If you're doing an exercise every two minutes, that's sometimes written E2MOM.)Forced repsThis is another strategy to keep lifting past failure. Instead of grabbing another weight, ask a spotter to help you lift the last few reps of your set. Let’s say you do as many reps of bench press as you can manage; then your spotter will put their hands on the bar and help you squeeze out a few more reps with their help. Those last few are “forced” reps. NegativesA negative rep of an exercise is where you just do the lowering-down, or eccentric, portion, while using assistance (often a spotter) to reset to the top of the rep. Negative pull-ups (jumping up to the top of the bar, then lowering yourself down) are a good way to build strength to be able to do even more pull-ups. SpottingTo spot somebody on a lift is to stand by, ready to assist if they fail. On bench press, you spot by standing at the head end of the person’s bench. You keep your hands nearby (but not on) the bar. If they can’t complete a rep, you grab the bar and help them safely place it back on the rack. Some lifts, like bench and squats, are commonly spotted. Others, like deadlifts and Olympic lifts, cannot be. Spotting is mainly for safety, but can also be used for forced reps (more on those below).SubmaximalSubmaximal training is work that does not go to failure. Your program might ask you to lift a certain weight until you feel like you have two reps “in the tank.” That means you’d pick a weight you could lift 10 times if you had to, but to follow the instructions you’ll only lift it eight times. Submaximal training can be less fatiguing than taking your lifts to failure. Beth Skwarecki Senior Health Editor Beth Skwarecki is Lifehacker’s Senior Health Editor. She has a bachelor’s degree in biology, has written two books, and is a certified personal trainer. She’s been writing about health, fitness, and science for over a decade, and can front squat 225 pounds. Read Beth's full bio",
  "image": "https://lifehacker.com/imagery/articles/01HF2GZQ0Z4QRJHKEMJ2GN7RFA/hero-image.fill.size_1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection data-ga-module=\"content-body\"\u003e\n                            \n                \u003cimg src=\"https://lifehacker.com/imagery/articles/01HF2GZQ0Z4QRJHKEMJ2GN7RFA/hero-image.fill.size_1248x702.v1699836268.jpg\" alt=\"bros lifting dumbbells in the gym\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01HF2GZQ0Z4QRJHKEMJ2GN7RFA/hero-image.fill.size_400x225.v1699836268.jpg 400w, https://lifehacker.com/imagery/articles/01HF2GZQ0Z4QRJHKEMJ2GN7RFA/hero-image.fill.size_800x450.v1699836268.jpg 800w, https://lifehacker.com/imagery/articles/01HF2GZQ0Z4QRJHKEMJ2GN7RFA/hero-image.fill.size_1248x702.v1699836268.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\n                        \u003cp\u003e\u003cspan\u003eCredit: Syda Productions - Shutterstock\u003c/span\u003e\n                            \u003c/p\u003e\n            \n    \n    \u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eEvery part of life has its lingo, and the gym is no exception. We’ve collected a list of the lifting-related words that most often confuse beginners, so read on to learn what you might be missing. \u003c/p\u003e\u003ch2 id=\"equipment\"\u003eEquipment\u003c/h2\u003e\u003ch3\u003eBarbells\u003c/h3\u003e\u003cp\u003eA barbell is the bar that you load the plates on, either empty (the “empty bar”) or loaded (for example, “a 225 pound barbell”). \u003c/p\u003e\u003cp\u003eA standard Olympic-sized barbell is 20 kilograms, or in many American gyms, 45 pounds. (20 kilos is 44 pounds, so it doesn’t really matter which is which.) There are a variety of other barbells that exist, including Olympic women’s bars that weigh 15 kilos, EZ-curl bars with an ergonomic curve to them, and more. We have \u003ca href=\"https://vitals.lifehacker.com/all-the-different-bars-at-the-gym-explained-1839810094\" target=\"\"\u003ea guide to all of these here\u003c/a\u003e. \u003c/p\u003e\u003ch3\u003eCable machine\u003c/h3\u003e\u003cp\u003eA cable machine has a thin rope, or cable, that connects the weights to a handle through one or more pulleys. Typically you can choose the attachment you\u0026#39;d like to use as a handle, and you may also have the option of moving the pulley to your desired height. Pulldowns, pushdowns, cable flyes, and cable crossovers are a few exercises you can do on a cable machine. \u003ca href=\"https://lifehacker.com/health/best-exercises-you-can-do-with-a-cable-machine\" target=\"_blank\"\u003eHere is a list of even more\u003c/a\u003e.\u003c/p\u003e\u003ch3\u003eClips or collars\u003c/h3\u003e\u003cp\u003eWhen you load weights onto a barbell (or an adjustable dumbbell), it’s handy to have something to hold the weights on there so they don’t slide around. This may be a spring clip, which looks like a clothespin, or a round collar with a latch on it. \u003c/p\u003e\u003ch3\u003eDumbbells\u003c/h3\u003e\u003cp\u003eDumbbells are the smaller hand weights around the gym. They typically come in pairs, and cannot be taken apart. (You can buy adjustable dumbbells for home gyms, though, which have their own teensy little plates on each end.) They are so named because some of the weights \u003ca href=\"https://starkcenter.org/igh_article/igh0306c/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ehistorically\u003c/a\u003e used for strength training were in the shape of bells (think of a kettlebell, but more...bell-shaped) and since they didn’t make noise, they were silent, or “dumb.” Dumbbells are usually \u0026#34;fixed,\u0026#34; with each dumbbell weighing a certain amount, but there are also \u003ca href=\"https://lifehacker.com/health/the-best-adjustable-dumbbell-sets-for-your-home-gym\" target=\"_blank\"\u003eadjustable dumbbells\u003c/a\u003e, popular for home gyms, that let you adjust the weight on the fly.\u003c/p\u003e\u003ch3\u003eFree weights\u003c/h3\u003e\u003cp\u003eFree weights are the barbells and dumbbells in a gym, as opposed to the machines. They are “free” weights because they aren’t attached to anything; you can pick them up and do whatever you want.\u003c/p\u003e\u003ch3\u003eKettlebells\u003c/h3\u003e\u003cp\u003eThese are the round weights with a handle on top. You can use them for most of the same lifts you\u0026#39;d do with a dumbbell (like rows, or overhead presses) but you can also \u003ca href=\"https://lifehacker.com/for-fucks-sake-please-stop-swinging-light-kettlebells-1850344356\" target=\"_blank\"\u003eswing them\u003c/a\u003e or do more advanced moves like kettlebell snatches.\u003c/p\u003e\u003ch3\u003eMachines\u003c/h3\u003e\u003cp\u003eThe opposite of a free weight would be a machine. There are cable machines, where you hold a handle that is connected via a cable and pulley to a stack of weights; there are other types of selectorized machines, where you put a pin in a stack of weights and then do the exercise in whatever way is indicated on the instructions (for example, you may push or pull a set of handles, or move a pad with your legs). And there are plate-loaded machines, where you take a plate off a rack somewhere in the gym and place it onto the machine yourself. \u003c/p\u003e\u003ch3\u003ePlates\u003c/h3\u003e\u003cp\u003eWeight plates are the heavy, round discs that typically load onto the ends of a barbell. In American gyms, the largest ones are typically 45 pounds. \u003c/p\u003e\u003cp\u003eYou can brag about your lifts by saying how many full-sized plates are on each end of the bar. One hundred and thirty-five pounds (45 pounds per side, on a 45 pound bar) is a “one plate” lift. Two hundred and twenty-five is “two plates.” Three hundred and fifteen is “three plates,” and so on. \u003c/p\u003e\u003ch2 id=\"weight-lifting-basics\"\u003eWeight lifting basics\u003c/h2\u003e\u003ch3\u003eCircuit\u003c/h3\u003e\u003cp\u003eA circuit, sometimes called a giant set, is when you do several exercises (usually three to six) by doing one set of each, then return to the beginning of the list and start over. (It\u0026#39;s called a \u0026#34;circuit\u0026#34; or \u0026#34;rounds\u0026#34; because you keep going through the list in a circular fashion. While these can save time, the goal of circuit training is often to keep your heart rate high, so that you’re getting a bit of a cardio stimulus even though the main focus is weight training. \u003c/p\u003e\u003ch3\u003eCompound lift\u003c/h3\u003e\u003cp\u003eA compound lift is one that uses many muscles at the same time. In a squat, for example, your quads (on the front of your thighs) are getting the most work, but your glutes, adductors, hamstrings, and core all do their part. This is in contrast to an isolation lift.\u003c/p\u003e\u003ch3\u003eFailure\u003c/h3\u003e\u003cp\u003eIf you do a lift \u0026#34;to failure,\u0026#34; that means you cannot physically do another rep. You might do 10 bicep curls, 11, 12, thir—nope, that\u0026#39;s it, can\u0026#39;t finish the thirteenth rep. You \u0026#34;went to failure\u0026#34; on that exercise. \u003c/p\u003e\u003cp\u003eIt\u0026#39;s not necessary to go to failure, but it\u0026#39;s a good way to make sure you\u0026#39;re really squeezing as much work as you can out of each set. It\u0026#39;s also common to stop a few reps before failure—in our example, stopping at 10 reps would have still given you a good workout. Stopping at five would not have been very productive. \u003c/p\u003e\u003cp\u003eIn bigger lifts, like a squat, you may not want to go to actual, physical failure very often. So you might go until \u003cem\u003etechnical\u003c/em\u003e failure—in other words, for as many reps as you can while you can maintain good form. \u003c/p\u003e\u003ch3\u003eIsolation lift\u003c/h3\u003e\u003cp\u003eAn isolation lift is meant to isolate just \u003cem\u003eone\u003c/em\u003e muscle or muscle group. While a squat is a compound lift that works your quads and several other muscles, an example of an isolation lift for the quadriceps would be a leg extension machine. \u003c/p\u003e\u003ch3\u003ePercentages\u003c/h3\u003e\u003cp\u003eSometimes lifting programs tell you to do a set at, say, 80% of your max. This instruction assumes that you know what your maximum, or 1RM, is. So, if you can bench press 100 pounds once, you might be asked to do a set of five reps at 80%, which is 80 pounds. \u003c/p\u003e\u003ch3\u003eReps\u003c/h3\u003e\u003cp\u003eWe don’t usually lift a weight just once; we pick it up and set it down multiple times. Each of those individual lifts is a \u003cem\u003erepetition\u003c/em\u003e, or a “rep” for short. You might do eight reps at a time, or 12, or five. Even if you only do one, you might still call it \u0026#34;a rep,\u0026#34; because when you’re in the gym for an hour your brain starts to melt a little. “That was a good rep,” you might say after a heavy single. We all know what you mean. \u003c/p\u003e\u003ch3\u003eRest\u003c/h3\u003e\u003cp\u003eIf your program asks you to rest between sets, that means you sit down and do nothing. Really. Depending on the exercise, you may rest anywhere from 30 seconds to five minutes. \u003ca href=\"https://lifehacker.com/how-long-you-should-rest-between-sets-1850810654\" target=\"_blank\"\u003eRead my explainer here\u003c/a\u003e on how long to rest and why. \u003c/p\u003e\u003ch3\u003eRPE\u003c/h3\u003e\u003cp\u003eRating of perceived exertion, on a 1-10 scale. A 10 means an all-out lift, you couldn’t have done any more. (If you went to failure, that\u0026#39;s a 10.) Nine means you could have done one more rep, but you stopped there. Eight means you could have done two more reps, and so on. For compound lifts like squats, sets are often done at a seven or eight RPE. Nobody bothers to track RPE below a six or so. \u003c/p\u003e\u003ch3\u003eSets\u003c/h3\u003e\u003cp\u003eA group of reps is a set. You might do five sets of three reps, for example. This is usually written as 5x3 (sets x reps), although a few people out there will flip the numbers around. If you’re not sure, ask. \u003c/p\u003e\u003ch3\u003eSuperset\u003c/h3\u003e\u003cp\u003eYou can superset two exercises by doing a set of each before resting. This can save time in the gym. Most often, a superset involves two lifts done with opposite or unrelated muscles: you can superset a bench press with a barbell row, or even a squat with an overhead press. Usually you’ll rest for a short time after you do both, and then do them again.\u003c/p\u003e\u003ch3\u003eWeightlifting\u003c/h3\u003e\u003cp\u003eWeightlifting doesn\u0026#39;t just mean lifting weights—\u003ca href=\"https://lifehacker.com/the-difference-between-weightlifting-and-weight-lifting-1846723548\" target=\"_blank\"\u003eit\u0026#39;s the name of a sport\u003c/a\u003e contested in the Olympics, where people explosively raise a barbell from the floor to overhead. They\u0026#39;ll do it in one movement, called a snatch, or in a two-step process called the clean and jerk. To avoid confusion, this is sometimes called \u0026#34;Olympic weightlifting\u0026#34; or, if you\u0026#39;re a Crossfitter, \u0026#34;oly lifting.\u0026#34; Weightlifters commonly drop their barbells from overhead (intentional or not) and thus need rubbery \u003cstrong\u003ebumper plates\u003c/strong\u003e and plenty of space on a \u003cstrong\u003eplatform\u003c/strong\u003e.\u003c/p\u003e\u003ch2 id=\"ways-of-lifting-weights\"\u003eWays of lifting weights\u003c/h2\u003e\u003ch3\u003e1RM, 3RM, 5RM\u003c/h3\u003e\u003cp\u003eThese are a one rep max, a three rep max, and a five rep max, respectively. (You can substitute any number. Want to find a 6RM? Go for it.) \u003c/p\u003e\u003cp\u003eIn other words, a 1RM is the maximum weight that you can move for one rep. When somebody asks “how much ya bench?” they are asking for your 1RM. This weight might also be called your “max” or your “best,” as in, “my best bench press is 150 pounds.” \u003c/p\u003e\u003cp\u003eThe others are “rep maxes.” Maybe you know that you can deadlift 225 pounds for five reps, but that’s it, you know you couldn’t get a sixth at that weight. (Maybe you tried for a sixth and failed.) That’s a 5RM.\u003c/p\u003e\u003ch3\u003eAMRAP\u003c/h3\u003e\u003cp\u003eAs many reps as possible. Or, if you’re doing a workout with multiple lifts, it may mean as many rounds (of the whole circuit) as possible. Sometimes either of these may be written AMAP (as many as possible). If you\u0026#39;re going to technical failure rather than true failure, I\u0026#39;ve seen that called \u0026#34;AMAP (as many as pretty).\u0026#34;\u003c/p\u003e\u003ch3\u003eDrop sets\u003c/h3\u003e\u003cp\u003eWhen you do a set of reps to failure, your muscles haven’t totally given out; they just can’t lift any more of that particular weight. So bodybuilders will sometimes employ drop sets, “dropping” some of the weight to do the exercise again with something lighter. You might use 25-pound dumbbells, then put them back and do a few more reps with 20-pound dumbbells, then grab the 15-pounders, and so on. \u003c/p\u003e\u003ch3\u003eEMOM\u003c/h3\u003e\u003cp\u003eEvery minute, on the minute. For a 10-minute EMOM, you’ll start your stopwatch, do the exercise (say, 10 kettlebell swings), and then rest for the remainder of the minute. The quicker you get the lifts done, the more time you have to rest. (If you\u0026#39;re doing an exercise every \u003cem\u003etwo\u003c/em\u003e minutes, that\u0026#39;s sometimes written E2MOM.)\u003c/p\u003e\u003ch3\u003eForced reps\u003c/h3\u003e\u003cp\u003eThis is another strategy to keep lifting past failure. Instead of grabbing another weight, ask a spotter to help you lift the last few reps of your set. Let’s say you do as many reps of bench press as you can manage; then your spotter will put their hands on the bar and help you squeeze out a few more reps with their help. Those last few are “forced” reps. \u003c/p\u003e\u003ch3\u003eNegatives\u003c/h3\u003e\u003cp\u003eA negative rep of an exercise is where you just do the lowering-down, or eccentric, portion, while using assistance (often a spotter) to reset to the top of the rep. Negative pull-ups (jumping up to the top of the bar, then lowering yourself down) are a good way to build strength to be able to do even more pull-ups. \u003c/p\u003e\u003ch3\u003eSpotting\u003c/h3\u003e\u003cp\u003eTo \u003ca href=\"https://vitals.lifehacker.com/how-to-ask-someone-to-spot-you-on-the-bench-press-1837201332\" target=\"\"\u003espot somebody on a lift\u003c/a\u003e is to stand by, ready to assist if they fail. On bench press, you spot by standing at the head end of the person’s bench. You keep your hands nearby (but not \u003cem\u003eon\u003c/em\u003e) the bar. If they can’t complete a rep, you grab the bar and help them safely place it back on the rack. \u003c/p\u003e\u003cp\u003eSome lifts, like bench and squats, are commonly spotted. Others, like deadlifts and Olympic lifts, cannot be. Spotting is mainly for safety, but can also be used for forced reps (more on those below).\u003c/p\u003e\u003ch3\u003eSubmaximal\u003c/h3\u003e\u003cp\u003eSubmaximal training is work that does \u003cem\u003enot\u003c/em\u003e go to failure. Your program might ask you to lift a certain weight until you feel like you have two reps “in the tank.” That means you’d pick a weight you could lift 10 times if you had to, but to follow the instructions you’ll only lift it eight times. Submaximal training can be less fatiguing than taking your lifts to failure. \u003c/p\u003e\n    \u003c/article\u003e\n\n    \n                        \u003cdiv\u003e\n                \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/authors/01HF2FBEW6YT2AAW890DNDQ59C/image.fill.size_150x150.v1704301214.png\" alt=\"Illustrated headshot of Beth Skwarecki\" width=\"150\" height=\"150\" loading=\"lazy\"/\u003e\n                                            \u003c/p\u003e\n                \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003cp\u003eBeth Skwarecki\u003c/p\u003e\n                                    \u003cp\u003eSenior Health Editor\u003c/p\u003e\n                                \u003cdiv\u003e\n                                            \u003cp\u003eBeth Skwarecki is Lifehacker’s Senior Health Editor. She has a bachelor’s degree in biology, has written two books, and is a certified personal trainer. She’s been writing about health, fitness, and science for over a decade, and can front squat 225 pounds.\u003c/p\u003e\n                                    \u003c/div\u003e\n                \u003cp\u003e\u003ca href=\"https://lifehacker.com/author/bethskwarecki\"\u003eRead Beth\u0026#39;s full bio\u003c/a\u003e\u003c/p\u003e\u003cul\u003e\n                                                                            \u003cli\u003e\n                                \u003ca href=\"https://twitter.com/bethskw\" title=\"Find on Twitter (Opens in a new tab)\" aria-label=\"Visit Beth\u0026#39;s Twitter\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-twitter\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                                                            \u003cli\u003e\n                                \u003ca href=\"https://www.instagram.com/bethskw\" title=\"Find on Instagram (Opens in a new tab)\" aria-label=\"Visit Beth\u0026#39;s Instagram\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-instagram\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                                                            \u003cli\u003e\n                                \u003ca href=\"https://lifehacker.com/cdn-cgi/l/email-protection#f092958498de839b87918295939b99b09c9996959891939b9582de939f9d\" title=\"Send an Email (Opens in a new tab)\" aria-label=\"Send Beth an email\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-envelope\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                            \u003c/ul\u003e\n                            \u003c/div\u003e\n        \u003c/div\u003e\n                \u003cdiv\u003e\n                                            \n                        \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"1\" data-ga-label=\"How \u0026#39;Sprint Interval Training\u0026#39; Compares to HIIT (and How to Do It)\" href=\"https://lifehacker.com/health/how-to-do-sprint-interval-training\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JKY1E11NEVYF678KCHSZF3CB/hero-image.fill.size_75x75.v1739396363.jpg\" alt=\"man running\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                    \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"2\" data-ga-label=\"The Best Shoes to Wear When You\u0026#39;re Lifting Weights\" href=\"https://lifehacker.com/best-weightlifting-shoes\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01HF2HBPESPQT4DZ8Z6J00K6SS/hero-image.fill.size_75x75.v1739385078.jpg\" alt=\"lifter preparing to lift weights\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                                        \u003c/div\u003e\n            \u003c/div\u003e\n            \n    \n    \n\n    \n                    \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-02-13T22:00:00Z",
  "modifiedTime": "2025-02-13T22:00:00Z"
}
