{
  "id": "af8d88cb-1d5c-4842-9dae-a1e528c33bd6",
  "title": "EPA gives thumbs up to California’s new gas-powered car sale ban",
  "link": "https://www.engadget.com/transportation/epa-gives-thumbs-up-to-californias-new-gas-powered-car-sale-ban-232048688.html?src=rss",
  "description": "The Environmental Protection Agency (EPA) has approved California’s plan to phase out and ban the sale of new gas-powered cars and light trucks by 2035. ABC News reported the EPA gave California the waivers it needed to enact the Advanced Clean Cars II Regulations (ACC II) devised and approved by the California Air Resources Board in 2022. The EPA also approved California’s plan to reduce nitrogen oxide (NOx) emissions from heavy-duty vehicles in order to reduce the amount of smog in the air. The state will require an initial 75 percent reduction in NOx pollution followed by a 90 percent reduction a few years later. The ACC II provides a year-to-year blueprint for phasing out the selling of combustion-engine vehicles. The plan sets a 2026 deadline by which 35 percent of the state’s car sales must be electric vehicles, plug-in hybrids or models with hydrogen fuel cells. Then by 2030, the electric vehicle sale threshold rises to 68 percent before reaching its ultimate 100 percent sale requirement by 2035. Consumers and dealerships will still be able to buy, sell and drive used ICE and hybrid cards until the ACC II. California Air Resources Board chair Liane Randolph estimated the ACC II could lead to a 50 percent drop in pollution by 2040. California Gov. Gavin Newsom hailed the decision and ACC II in a statement as evidence that “California can rise to the challenge of protecting our people by cleaning our air and cutting pollution.”This article originally appeared on Engadget at https://www.engadget.com/transportation/epa-gives-thumbs-up-to-californias-new-gas-powered-car-sale-ban-232048688.html?src=rss",
  "author": "Danny Gallagher",
  "published": "Wed, 18 Dec 2024 23:20:49 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Politics \u0026 Government",
    "Pollution \u0026 Waste",
    "Transportation",
    "Environment",
    "Nature \u0026 Environment",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Danny Gallagher"
  ],
  "byline": "Danny Gallagher",
  "length": 1453,
  "excerpt": "The state of California's also wants to reduce nitrogen oxide emissions that create smog.",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "The Environmental Protection Agency (EPA) has approved California’s plan to phase out and ban the sale of new gas-powered cars and light trucks by 2035. ABC News reported the EPA gave California the waivers it needed to enact the Advanced Clean Cars II Regulations (ACC II) devised and approved by the California Air Resources Board in 2022.The EPA also approved California’s plan to reduce nitrogen oxide (NOx) emissions from heavy-duty vehicles in order to reduce the amount of smog in the air. The state will require an initial 75 percent reduction in NOx pollution followed by a 90 percent reduction a few years later.The ACC II provides a year-to-year blueprint for phasing out the selling of combustion-engine vehicles. The plan sets a 2026 deadline by which 35 percent of the state’s car sales must be electric vehicles, plug-in hybrids or models with hydrogen fuel cells. Then by 2030, the electric vehicle sale threshold rises to 68 percent before reaching its ultimate 100 percent sale requirement by 2035. Consumers and dealerships will still be able to buy, sell and drive used ICE and hybrid cards until the ACC II. California Air Resources Board chair Liane Randolph estimated the ACC II could lead to a 50 percent drop in pollution by 2040.California Gov. Gavin Newsom hailed the decision and ACC II in a statement as evidence that “California can rise to the challenge of protecting our people by cleaning our air and cutting pollution.”",
  "image": "https://s.yimg.com/ny/api/res/1.2/qkbu74BcDTI1bbZhCmP3ww--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03Njk7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-12/8aefb730-bd94-11ef-baff-670ee5180a75",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe Environmental Protection Agency (EPA) has approved California’s plan to phase out and ban the sale of new gas-powered cars and light trucks by 2035. \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://abcnews.go.com/US/epa-allows-california-ban-gas-powered-new-car/story?id=116910026\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:ABC News;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003e\u003cins\u003eABC News\u003c/ins\u003e\u003c/em\u003e\u003c/a\u003e reported the EPA gave California the waivers it needed to enact the \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://www.engadget.com/california-gas-powered-vehicle-sale-ban-2035-161505630.html\" data-ylk=\"slk:Advanced Clean Cars II Regulations (ACC II);cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cins\u003eAdvanced Clean Cars II Regulations (ACC II)\u003c/ins\u003e\u003c/a\u003e devised and approved by the California Air Resources Board in 2022.\u003c/p\u003e\u003cp\u003eThe EPA also approved California’s plan to reduce nitrogen oxide (NOx) emissions from heavy-duty vehicles in order to reduce the amount of smog in the air. The state will require an initial 75 percent reduction in NOx pollution followed by a 90 percent reduction a few years later.\u003c/p\u003e\u003cp\u003eThe ACC II provides a year-to-year blueprint for phasing out the selling of combustion-engine vehicles. The plan sets a 2026 deadline by which 35 percent of the state’s car sales must be electric vehicles, plug-in hybrids or models with hydrogen fuel cells. Then by 2030, the electric vehicle sale threshold rises to 68 percent before reaching its ultimate 100 percent sale requirement by 2035. Consumers and dealerships will still be able to buy, sell and drive used ICE and hybrid cards until the ACC II. California Air Resources Board chair Liane Randolph estimated the ACC II could lead to a 50 percent drop in pollution by 2040.\u003c/p\u003e\u003cp\u003eCalifornia Gov. Gavin Newsom hailed the decision and ACC II in \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://www.gov.ca.gov/2024/12/18/clean-cars-are-here-to-stay-biden-harris-administration-reaffirms-californias-leadership-in-cutting-pollution-and-cleaning-the-air/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:a statement;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cins\u003ea statement\u003c/ins\u003e\u003c/a\u003e as evidence that “California can rise to the challenge of protecting our people by cleaning our air and cutting pollution.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-18T23:20:49Z",
  "modifiedTime": null
}
