{
  "id": "b1b282b3-7813-447f-bf59-586617bc07e0",
  "title": "YouTube Can't Put Pandora's AI Slop Back in the Box",
  "link": "https://news.slashdot.org/story/25/07/10/2327220/youtube-cant-put-pandoras-ai-slop-back-in-the-box?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "Longtime Slashdot reader SonicSpike shares a report from Gizmodo: YouTube is inundated with AI-generated slop, and that's not going to change anytime soon. Instead of cutting down on the total number of slop channels, the platform is planning to update its policies to cut out some of the worst offenders making money off \"spam.\" At the same time, it's still full steam ahead adding tools to make sure your feeds are full of mass-produced brainrot. In an update to its support page posted last week, YouTube said it will modify guidelines for its Partner Program, which lets some creators with enough views make money off their videos. The video platform said it requires YouTubers to create \"original\" and \"authentic\" content, but now it will \"better identify mass-produced and repetitious content.\" The changes will take place on July 15. The company didn't advertise whether this change is related to AI, but the timing can't be overlooked considering how more people are noticing the rampant proliferation of slop content flowing onto the platform every day. The AI \"revolution\" has resulted in a landslide of trash content that has mired most creative platforms. Alphabet-owned YouTube has been especially bad recently, with multiple channels dedicated exclusively to pumping out legions of fake and often misleading videos into the sludge-filled sewer that has become users' YouTube feeds. AI slop has become so prolific it has infected most social media platforms, including Facebook and Instagram. Last month, John Oliver on \"Last Week Tonight\" specifically highlighted several YouTube channels that crafted obviously fake stories made to show White House Press Secretary Karoline Leavitt in a good light. These channels and similar accounts across social media pump out these quick AI-generated videos to make a quick buck off YouTube's Partner Program. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2025-07-11T00:45:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "youtube"
  ],
  "byline": "",
  "length": 1867,
  "excerpt": "Longtime Slashdot reader SonicSpike shares a report from Gizmodo: YouTube is inundated with AI-generated slop, and that's not going to change anytime soon. Instead of cutting down on the total number of slop channels, the platform is planning to update its policies to cut out some of the worst offe...",
  "siteName": "",
  "favicon": "",
  "text": "Longtime Slashdot reader SonicSpike shares a report from Gizmodo: YouTube is inundated with AI-generated slop, and that's not going to change anytime soon. Instead of cutting down on the total number of slop channels, the platform is planning to update its policies to cut out some of the worst offenders making money off \"spam.\" At the same time, it's still full steam ahead adding tools to make sure your feeds are full of mass-produced brainrot. In an update to its support page posted last week, YouTube said it will modify guidelines for its Partner Program, which lets some creators with enough views make money off their videos. The video platform said it requires YouTubers to create \"original\" and \"authentic\" content, but now it will \"better identify mass-produced and repetitious content.\" The changes will take place on July 15. The company didn't advertise whether this change is related to AI, but the timing can't be overlooked considering how more people are noticing the rampant proliferation of slop content flowing onto the platform every day. The AI \"revolution\" has resulted in a landslide of trash content that has mired most creative platforms. Alphabet-owned YouTube has been especially bad recently, with multiple channels dedicated exclusively to pumping out legions of fake and often misleading videos into the sludge-filled sewer that has become users' YouTube feeds. AI slop has become so prolific it has infected most social media platforms, including Facebook and Instagram. Last month, John Oliver on \"Last Week Tonight\" specifically highlighted several YouTube channels that crafted obviously fake stories made to show White House Press Secretary Karoline Leavitt in a good light. These channels and similar accounts across social media pump out these quick AI-generated videos to make a quick buck off YouTube's Partner Program.",
  "image": "https://a.fsdn.com/sd/topics/youtube_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-178330024\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tLongtime Slashdot reader \u003ca href=\"https://news.slashdot.org/~SonicSpike\"\u003eSonicSpike\u003c/a\u003e shares a report from Gizmodo: \u003ci\u003e YouTube is \u003ca href=\"https://gizmodo.com/youtube-cant-put-pandoras-ai-slop-back-in-the-box-2000626819\"\u003einundated with AI-generated slop\u003c/a\u003e, and that\u0026#39;s not going to change anytime soon. Instead of cutting down on the total number of slop channels, the platform is planning to update its policies to cut out some of the worst offenders making money off \u0026#34;spam.\u0026#34; At the same time, it\u0026#39;s still full steam ahead adding tools to make sure your feeds are full of mass-produced brainrot.\n\u003cp\u003e \nIn an update to its \u003ca href=\"https://support.google.com/youtube/answer/10008196?hl=en#zippy=%2Cyoutube-partner-program\"\u003esupport page\u003c/a\u003e posted last week, YouTube said it will modify guidelines for its Partner Program, which lets some creators with enough views make money off their videos. The video platform said it requires YouTubers to create \u0026#34;original\u0026#34; and \u0026#34;authentic\u0026#34; content, but now it will \u0026#34;better identify mass-produced and repetitious content.\u0026#34; The changes will take place on July 15. The company didn\u0026#39;t advertise whether this change is related to AI, but the timing can\u0026#39;t be overlooked considering how more people are noticing the rampant proliferation of slop content flowing onto the platform every day.\n\u003c/p\u003e\u003cp\u003e \nThe AI \u0026#34;revolution\u0026#34; has resulted in a landslide of trash content that has mired most creative platforms. Alphabet-owned YouTube has been especially bad recently, with multiple channels dedicated exclusively to \u003ca href=\"https://x.com/Diesol/status/1925114473544913004\"\u003epumping out\u003c/a\u003e \u003ca href=\"https://x.com/fofrAI/status/1924917797366247719?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1924917797366247719%7Ctwgr%5E338bc98cd93d0b312ada5249e2e3026e0e17b61e%7Ctwcon%5Es1_\u0026amp;ref_url=https%3A%2F%2Fgizmodo.com%2Fgoogle-cant-turn-you-into-a-filmmaker-but-it-can-make-half-assing-it-a-lot-easier-2000605415\"\u003elegions of\u003c/a\u003e \u003ca href=\"https://x.com/HashemGhaili/status/1925332319604257203\"\u003efake and often\u003c/a\u003e \u003ca href=\"https://x.com/PJaccetturo/status/1925464847900352590\"\u003emisleading videos\u003c/a\u003e into the sludge-filled sewer that has become users\u0026#39; YouTube feeds. AI slop has become so prolific it has infected most social media platforms, including Facebook and Instagram. Last month, John Oliver on \u0026#34;Last Week Tonight\u0026#34; specifically \u003ca href=\"https://www.youtube.com/watch?v=TWpg1RmzAbc\"\u003ehighlighted several YouTube channels\u003c/a\u003e that crafted obviously fake stories made to show White House Press Secretary Karoline Leavitt in a good light. These channels and similar accounts across social media pump out these quick AI-generated videos to make a quick buck off YouTube\u0026#39;s Partner Program.\u003c/p\u003e\u003c/i\u003e\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
