{
  "id": "b434fafc-afa9-4e80-bb4d-3c019f5b5b07",
  "title": "Here are 3 science-backed strategies to rein in election anxiety",
  "link": "https://arstechnica.com/security/2024/11/here-are-3-science-backed-strategies-to-rein-in-election-anxiety/",
  "description": "A clinical psychologist offers guidance on how to deal with ramping stress.",
  "author": "Shannon Sauer-Zavala, The Conversation",
  "published": "Sun, 03 Nov 2024 12:05:38 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Health",
    "Security",
    "2024 election",
    "anxieities",
    "anxiety",
    "mental health",
    "syndication"
  ],
  "byline": "The Conversation",
  "length": 2112,
  "excerpt": "A clinical psychologist offers guidance on how to deal with ramping stress.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "In this scenario, I encourage my patients to move past that initial thought of how awful it will be and instead consider exactly how they will respond to the inauguration, the next day, week, month, and so on. Cognitive flexibility allows you to explore how you will cope, even in the face of a negative outcome, helping you feel a bit less out of control. If you’re experiencing a lot of anxiety about the election, try thinking through what you’d do if the undesirable candidate takes office—thoughts like “I’ll donate to causes that are important to me” and “I’ll attend protests.” Choose your actions with intention Another tool for managing your anxiety is to consider whether your behaviors are affecting how you feel. Remember, for instance, the goal of 24-hour news networks is to increase ratings. It’s in their interest to keep you riveted to your screens by making it seem like important announcements are imminent. As a result, it may feel difficult to disconnect and take part in your usual self-care behavior. Try telling yourself, “If something happens, someone will text me,” and go for a walk or, better yet, to bed. Keeping up with healthy habits can help reduce your vulnerability to uncontrolled anxiety. Post-Election Day, you may continue to feel drawn to the news and motivated to show up—whether that means donating, volunteering, or protesting—for a variety of causes you think will be affected by the election results. Many people describe feeling guilty if they say no or disengage, leading them to overcommit and wind up overwhelmed. If this sounds like you, try reminding yourself that taking a break from politics to cook, engage with your family or friends, get some work done, or go to the gym does not mean you don’t care. In fact, keeping up with the activities that fuel you will give you the energy to contribute to important causes more meaningfully. Shannon Sauer-Zavala, Associate Professor of Psychology \u0026 Licensed Clinical Psychologist, University of Kentucky. This article is republished from The Conversation under a Creative Commons license. Read the original article.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/11/GettyImages-1488366966-980x710.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n          \n          \n\u003cp\u003eIn this scenario, I encourage my patients to move past that initial thought of how awful it will be and instead consider exactly how they will respond to the inauguration, the next day, week, month, and so on.\u003c/p\u003e\n\u003cp\u003eCognitive flexibility allows you to explore how you will cope, even in the face of a negative outcome, helping you feel a bit less out of control. If you’re experiencing a lot of anxiety about the election, try thinking through what you’d do if the undesirable candidate takes office—thoughts like “I’ll donate to causes that are important to me” and “I’ll attend protests.”\u003c/p\u003e\n\u003ch2\u003eChoose your actions with intention\u003c/h2\u003e\n\u003cp\u003eAnother tool for managing your anxiety is to consider whether your behaviors are affecting how you feel.\u003c/p\u003e\n\u003cp\u003eRemember, for instance, the goal of 24-hour news networks is to increase ratings. It’s in their interest to keep you riveted to your screens by making it seem like important announcements are imminent. As a result, it may feel difficult to disconnect and take part in your usual self-care behavior.\u003c/p\u003e\n\u003cp\u003eTry telling yourself, “If something happens, someone will text me,” and go for a walk or, better yet, to bed. \u003ca href=\"https://doi.org/10.3389/fpsyg.2024.1296154\"\u003eKeeping up with healthy habits\u003c/a\u003e can help reduce your vulnerability to uncontrolled anxiety.\u003c/p\u003e\n\u003cp\u003ePost-Election Day, you may continue to feel drawn to the news and motivated to show up—whether that means donating, volunteering, or protesting—for a variety of causes you think will be affected by the election results. Many people describe feeling guilty if they say no or disengage, leading them to overcommit and wind up overwhelmed.\u003c/p\u003e\n\u003cp\u003eIf this sounds like you, try reminding yourself that taking a break from politics to cook, engage with your family or friends, get some work done, or go to the gym does not mean you don’t care. In fact, keeping up with the activities that fuel you will give you the energy to contribute to important causes more meaningfully.\u003cimg decoding=\"async\" src=\"https://counter.theconversation.com/content/242717/count.gif?distributor=republish-lightbox-basic\" alt=\"The Conversation\" width=\"1\" height=\"1\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://theconversation.com/profiles/shannon-sauer-zavala-1559636\"\u003eShannon Sauer-Zavala\u003c/a\u003e, Associate Professor of Psychology \u0026amp; Licensed Clinical Psychologist, \u003ca href=\"https://theconversation.com/institutions/university-of-kentucky-1140\"\u003eUniversity of Kentucky\u003c/a\u003e. This article is republished from \u003ca href=\"https://theconversation.com\"\u003eThe Conversation\u003c/a\u003e under a Creative Commons license. Read the \u003ca href=\"https://theconversation.com/election-anxiety-doesnt-need-to-win-here-are-3-science-backed-strategies-from-a-clinical-psychologist-to-rein-in-the-stress-242717\"\u003eoriginal article\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-03T12:05:38Z",
  "modifiedTime": "2024-11-01T22:04:28Z"
}
