{
  "id": "b529de82-ff80-4997-b094-09e274ddd66e",
  "title": "How dairy robots are changing work for cows and farmers",
  "link": "https://spectrum.ieee.org/lely-dairy-robots",
  "description": "Comments",
  "author": "",
  "published": "Tue, 15 Apr 2025 22:26:35 +0000",
  "source": "https://news.ycombinator.com/rss",
  "categories": null,
  "byline": "Evan Ackerman",
  "length": 22185,
  "excerpt": "\u003cp\u003eEveryone’s happier when robots handle milking, feeding, and ear scritching\u003c/p\u003e",
  "siteName": "IEEE Spectrum",
  "favicon": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNjU5NjY0OS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTc4NTc0NjUwNn0.pFbPADvK9fyfasig9FMci3xf6UeB_WJaER5Yea_eRpI/img.png?width=192\u0026height=192",
  "text": "Robots are taking over much of the daily manual labor at dairy farms, including milking, feeding, cleaning, and more. It makes dairy farmers’ lives easier, and makes the cows happier, too. “Mooooo.” This dairy barn is full of cows, as you might expect. Cows are being milked, cows are being fed, cows are being cleaned up after, and a few very happy cows are even getting vigorously scratched behind the ears. “I wonder where the farmer is,” remarks my guide, Jan Jacobs. Jacobs doesn’t seem especially worried, though—the several hundred cows in this barn are being well cared for by a small fleet of fully autonomous robots, and the farmer might not be back for hours. The robots will let him know if anything goes wrong. At one of the milking robots, several cows are lined up, nose to tail, politely waiting their turn. The cows can get milked by robot whenever they like, which typically means more frequently than the twice a day at a traditional dairy farm. Not only is getting milked more often more comfortable for the cows, cows also produce about 10 percent more milk when the milking schedule is completely up to them. “There’s a direct correlation between stress and milk production,” Jacobs says. “Which is nice, because robots make cows happier and therefore, they give more milk, which helps us sell more robots.” Jan Jacobs is the human-robot interaction design lead for Lely, a maker of agricultural machinery. Founded in 1948 in Maassluis, Netherlands, Lely deployed its first Astronaut milking robot in the early 1990s. The company has since developed other robotic systems that assist with cleaning, feeding, and cow comfort, and the Astronaut milking robot is on its fifth generation. Lely is now focused entirely on robots for dairy farms, with around 135,000 of them deployed around the world. Essential Jobs on Dairy FarmsThe weather outside the barn is miserable. It’s late fall in the Netherlands, and a cold rain is gusting in from the sea, which is probably why the cows have quite sensibly decided to stay indoors and why the farmer is still nowhere to be found. Lely requires that dairy farmers who adopt its robots commit to letting their cows move freely between milking, feeding, and resting, as well as inside and outside the barn, at their own pace. “We believe that free cow traffic is a core part of the future of farming,” Jacobs says as we watch one cow stroll away from the milking robot while another takes its place. This is possible only when the farm operates on the cows’ schedule rather than a human’s. A conventional dairy farm relies heavily on human labor. Lely estimates that repetitive daily tasks represent about a third of the average workday of a dairy farmer. In the morning, the cows are milked for the first time. Most dairy cows must be milked at least twice a day or they’ll become uncomfortable, and so the herd will line up on their own. Traditional milking parlors are designed to maximize human milking efficiency. A milking carousel, for instance, slowly rotates cows as they’re milked so that the dairy worker doesn’t have to move between stalls. “We were spending 6 hours a day milking,” explains dairy farmer Josie Rozum, whose 120-cow herd at Takes Dairy Farm uses a pair of Astronaut A5 milking robots. “Now that the robots are handling all of that, we can focus more on animal care and comfort.”Lely An experienced human using well-optimized equipment can attach a milking machine to a cow in just 20 to 30 seconds. The actual milking takes only a few minutes, but with the average small dairy farm in North America providing a home for several hundred cows, milking typically represents a time commitment of 4 to 6 hours per day. There are other jobs that must be done every day at a dairy. Cows are happier with continuous access to food, which means feeding them several times a day. The feed is a mix of roughage (hay), silage (grass), and grain. The cows will eat all of this, but they prefer the grain, and so it’s common to see cows sorting their food by grabbing a mouthful and throwing it up into the air. The lighter roughage and silage flies farther than the grain does, leaving the cow with a pile of the tastier stuff as the rest gets tossed out of reach. This makes “feed pushing” necessary to shove the rest of the feed back within reach of the cow. And of course there’s manure. A dairy cow produces an average of 68 kilograms of manure a day. All that manure has to be collected and the barn floors regularly cleaned. Dairy Industry 4.0 The amount of labor needed to operate a dairy meant that until the early 1900s, most family farms could support only about eight cows. The introduction of the first milking machines, called bucket milkers, helped farmers milk 10 cows per hour instead of 4 by the mid-1920s. Rural electrification furthered dairy automation starting in the 1950s, and since then, both farm size and milk production have increased steadily. In the 1930s, a good dairy cow produced 3,600 kilograms of milk per year. Today, it’s almost 11,000 kilograms, and Lely believes that robots are what will enable small dairy farms to continue to scale sustainably. LelyBut dairy robots are expensive. A milking robot can cost several hundred thousand dollars, plus an additional US $5,000 to $10,000 per year in operating costs. The Astronaut A5, Lely’s latest milking robot, uses a laser-guided robot arm to clean the cow’s udder before attaching teat cups one at a time. While the cow munches on treats, the Astronaut monitors her milk output, collecting data on 32 parameters, including indicators of the quality of the milk and the health of the cow. When milking is complete, the robot cleans the udder again, and the cow is free to leave as the robot steam cleans itself in preparation for the next cow.Lely argues that although the initial cost is higher than that of a traditional milking parlor, the robots pay for themselves over time through higher milk production (due primarily to increased milking frequency) and lower labor costs. Lely’s other robots can also save on labor. The Vector mobile robot handles continuous feeding and feed pushing, and the Discovery Collector is a robotic manure vacuum that keeps the floors clean. At Takes Dairy Farm, Rozum and her family used to spend several hours per day managing food for the cows. “The feeding robot is another amazing piece of the puzzle for our farm that allows us to focus on other things.”Takes Family Farm For most dairy farmers, though, making more money is not the main reason to get a robot, explains Marcia Endres, a professor in the department of animal science at the University of Minnesota. Endres specializes in dairy-cattle management, behavior, and welfare, and studies dairy robot adoption. “When we first started doing research on this about 12 years ago, most of the farms that were installing robots were smaller farms that did not want to hire employees,” Endres says. “They wanted to do the work just with family labor, but they also wanted to have more flexibility with their time. They wanted a better lifestyle.” Flexibility was key for the Takes family, who added Lely robots to their dairy farm in Ely, Iowa, four years ago. “When we had our old milking parlor, everything that we did as a family was always scheduled around milking,” says Josie Rozum, who manages the farm and a creamery along with her parents—Dan and Debbie Takes—and three brothers. “With the robots, we can prioritize our personal life a little bit more—we can spend time together on Christmas morning and know that the cows are still getting milked.” Takes Family Dairy Farm’s 120-cow herd is milked by a pair of Astronaut A5 robots, with a Vector and three Discovery Collectors for feeding and cleaning. “They’ve become a crucial part of the team,” explains Rozum. “It would be challenging for us to find outside help, and the robots keep things running smoothly.” The robots also add sustainability to small dairy farms, and not just in the short term. “Growing up on the farm, we experienced the hard work, and we saw what that commitment did to our parents,” Rozum explains. “It’s a very tough lifestyle. Having the robots take over a little bit of that has made dairy farming more appealing to our generation.” Takes Dairy Farm Of the 25,000 dairy farms in the United States, Endres estimates about 10 percent have robots. This is about a third of the adoption rate in Europe, where farms tend to be smaller, so the cost of implementing the robots is lower. Endres says that over the last five years, she’s seen a shift toward robot adoption at larger farms with over 500 cows, due primarily to labor shortages. “These larger dairies are having difficulty finding employees who want to milk cows—it’s a very tedious job. And the robot is always consistent. The farmers tell me, ‘My robot never calls in sick, and never shows up drunk.’ ” Endres is skeptical of Lely’s claim that its robots are responsible for increased milk production. “There is no research that proves that cows will be more productive just because of robots,” she says. It may be true that farms that add robots do see increased milk production, she adds, but it’s difficult to measure the direct effect that the robots have. “I have many dairies that I work with where they have both a robotic milking system and a conventional milking system, and if they are managing their cows well, there isn’t a lot of difference in milk production.” The Lely Luna cow brush helps to keep cows’ skin healthy. It’s also relaxing and enjoyable, so cows will brush themselves several times a day.Lely The robots do seem to improve the cows’ lives, however. “Welfare is not just productivity and health—it’s also the affective state, the ability to have a more natural life,” Endres says. “Again, it’s hard to measure, but I think that on most of these robot farms, their affective state is improved.” The cows’ relationship with humans changes too, comments Endres. When the cows no longer associate humans with being told where to go and what to do all the time, they’re much more relaxed and friendly toward people they meet. Rozum agrees. “We’ve noticed a tremendous change in our cows’ demeanor. They’re more calm and relaxed, just doing their thing in the barn. They’re much more comfortable when they can choose what to do.” Cows Versus Robots Cows are curious and clever animals, and have the same instinct that humans have when confronted with a new robot: They want to play with it. Because of this, Lely has had to cow-proof its robots, modifying their design and programming so that the machines can function autonomously around cows. Like many mobile robots, Lely’s dairy robots include contact-sensing bumpers that will pause the robot’s motion if it runs into something. On the Vector feeding robot, Lely product engineer René Beltman tells me, they had to add a software option to disable the bumper. “The cows learned that, ‘oh, if I just push the bumper, then the robot will stop and put down more feed in my area for me to eat.’ It was a free buffet. So you don’t want the cows to end up controlling the robot.” Emergency stop buttons had to be relocated so that they couldn’t be pressed by questing cow tongues. There’s also a social component to cow-robot interaction. Within their herd, cows have a well-established hierarchy, and the robots need to work within this hierarchy to do their jobs. For example, a cow won’t move out of the way if it thinks that another cow is lower in the hierarchy than it is, and it will treat a robot the same way. The engineers had to figure out how the Discovery Collector could drive back and forth to vacuum up manure without getting blocked by cows. “In our early tests, we’d use sensors to have the robot stop to avoid running into any of the cows,” explains Jacobs. “But that meant that the robot became the weakest one in the hierarchy, and it would just end up crying in the corner because the cows wouldn’t move for it. So now, it doesn’t stop.” One of the dirtiest jobs on a dairy farm is handled by the Discovery Collector, an autonomous manure vacuum. The robot relies on wheel odometry and ultrasonic sensors for navigation because it’s usually covered in manure.Evan Ackerman “We make the robot drive slower for the first week, when it’s being introduced to a new herd,” adds Beltman. “That gives the cows time to figure out that the robot is at the top of the hierarchy.” Besides maintaining their dominance at the top of the herd, the current generation of Lely robots doesn’t interact much with the cows, but that’s changing, Jacobs tells me. Right now, when a robot is driving through the barn, it makes a beeping sound to let the cows know it’s coming. Lely is looking into how to make these sounds more enjoyable for the cows. “This was a recent revelation for me,” Jacobs says. ”We’re not just designing interactions for humans. The cows are our users, too.” Human-Robot Interaction Last year, Jacobs and researchers from Delft University of Technology, in the Netherlands, presented a paper at the IEEE Human-Robot Interaction (HRI) Conference exploring this concept of robot behavior development on working dairy farms. The researchers visited robotic dairies, interviewed dairy farmers, and held workshops within Lely to establish a robot code of conduct—a guide that Lely’s designers and engineers use when considering how their robots should look, sound, and act, for the benefit of both humans and cows. On the engineering side, this includes practical things like colors and patterns for lights and different types of sounds so that information is communicated consistently across platforms. But there’s much more nuance to making a robot seem “reliable” or “friendly” to the end user, since such things are not only difficult to define but also difficult to implement in a way that’s appropriate for dairy farmers, who prioritize functionality. Jacobs doesn’t want his robots to try to be anyone’s friend—not the cow’s, and not the farmer’s. “The robot is an employee, and it should have a professional relationship,” he says. “So the robot might say ‘Hi,’ but it wouldn’t say, ‘How are you feeling today?’ ” What’s more important is that the robots are trustworthy. For Jacobs, instilling trust is simple: “You cannot gain trust by doing tricks. If your robot is reliable and predictable, people will trust it.” The electrically driven, pneumatically balanced robotic arm that the Lely Astronaut uses to milk cows is designed to withstand accidental (or intentional) kicks.Lely The real challenge, Jacobs explains, is that Lely is largely on its own when it comes to finding the best way of integrating its robots into the daily lives of people who may have never thought they’d have robot employees. “There’s not that much knowledge in the robot world about how to approach these problems,” Jacobs says. “We’re working with almost 20,000 farmers who have a bigger robot workforce than a human workforce. They’re robot managers. And I don’t know that there necessarily are other companies that have a customer base of normal people who have strategic dependence on robots for their livelihood. That is where we are now.” From Dairy Farmers to Robot ManagersWith the additional time and flexibility that the robots enable, some dairy farmers have been able to diversify. On our way back to Lely’s headquarters, we stop at Farm Het Lansingerland, owned by a Lely customer who has added a small restaurant and farm shop to his dairy. Large windows look into the barn so that restaurant patrons can watch the robots at work, caring for the cows that produce the cheese that’s on the menu. A self-guided tour takes you right up next to an Astronaut A5 milking robot, while signs on the floor warn of Vector feeding robots on the move. “This farmer couldn’t expand—this was as many cows as he’s allowed to have here,” Jacobs explains to me over cheese sandwiches. “So, he needs to have additional income streams. That’s why he started these other things. And the robots were essential for that.” The farmer is an early adopter—someone who’s excited about the technology and actively interested in the robots themselves. But most of Lely’s tens of thousands of customers just want a reliable robotic employee, not a science project. “We help the farmer to prepare not just the environment for the robots, but also the mind,” explains Jacobs. “It’s a complete shift in their way of working.” Besides managing the robots, the farmer must also learn to manage the massive amount of data that the robots generate about the cows. “The amount of data we get from the robots is a game changer,” says Rozum. “We can track milk production, health, and cow habits in real time. But it’s overwhelming. You could spend all day just sitting at the computer, looking at data and not get anything else done. It took us probably a year to really learn how to use it.” The most significant advantages to farmers come from using the data for long-term optimization, says the University of Minnesota’s Endres. “In a conventional barn, the cows are treated as a group,” she says. “But the robots are collecting data about individual animals, which lets us manage them as individuals.” By combining data from a milking robot and a feeding robot, for example, farmers can close the loop, correlating when and how the cows are fed with their milk production. Lely is doing its best to simplify this type of decision making, says Jacobs. “You need to understand what the data means, and then you need to present it to the farmer in an actionable way.” A Robotic Dairy Chris Philpot All dairy farms are different, and farms that decide to give robots a try will often start with just one or two. A highly roboticized dairy barn might look something like this illustration, with a team of many different robots working together to keep the cows comfortable and happy. A: One Astronaut A5 robot can milk up to 60 cows. After the Astronaut cleans the teats, a laser sensor guides a robotic arm to attach the teat cups. Milking takes just a few minutes. B: In the feed kitchen, the Vector robot recharges itself while different ingredients are loaded into its hopper and mixed together. Mixtures can be customized for different groups of cows. C: The Vector robot dispenses freshly mixed food in small batches throughout the day. A laser measures the height of leftover food to make sure that the cows are getting the right amounts. D: The Discovery Collector is a mop and vacuum for cow manure. It navigates the barn autonomously and returns to its docking station to remove waste, refill water, and wirelessly recharge. E: As it milks, the Astronaut is collecting a huge amount of data—32 different parameters per teat. If it detects an issue, the farmer is notified, helping to catch health problems early. F: Automated gates control meadow access and will keep a cow inside if she’s due to be milked soon. Cows are identified using RFID collars, which also track their behavior and health. A Sensible Future for Dairy Robots After lunch, we stop by Lely headquarters, where bright red life-size cow statues guard the entrance and all of the conference rooms are dairy themed. We get comfortable in Butter, and I ask Jacobs and Beltman what the future holds for their dairy robots. In the near term, Lely is focused on making its existing robots more capable. Its latest feed-pushing robot is equipped with lidar and stereo cameras, which allow it to autonomously navigate around large farms without needing to follow a metal strip bolted to the ground. A new overhead camera system will leverage AI to recognize individual cows and track their behavior, while also providing farmers with an enormous new dataset that could allow Lely’s systems to help farmers make more nuanced decisions about cow welfare. The potential of AI is what Jacobs seems most excited about, although he’s cautious as well. “With AI, we’re suddenly going to take away an entirely different level of work. So, we’re thinking about doing research into the meaningfulness of work, to make sure that the things that we do with AI are the things that farmers want us to do with AI.” “The idea of AI is very intriguing,” comments Rozum. “I think AI could help to simplify things for farmers. It would be a tool, a resource. But we know our cows best, and a farmer’s judgment has to be there too. There’s just some component of dairy farming that you cannot take the human out of. Robots are not going to be successful on a farm unless you have good farmers.” Lely is aware of this and knows that its robots have to find the right balance between being helpful, and taking over. “We want to make sure not to take away the kinds of interactions that give dairy farmers joy in their work,” says Beltman. “Like feeding calves—every farmer likes to feed the calves.” Lely does sell an automated calf feeder that many dairy farmers buy, which illustrates the point: What’s the best way of designing robots to give humans the flexibility to do the work that they enjoy? “This is where robotics is going,” Jacobs tells me as he gives me a lift to the train station. “As a human, you could have two other humans and six robots, and that’s your company.” Many industries, he says, look to robots with the objective of minimizing human involvement as much as possible so that the robots can generate the maximum amount of value for whoever happens to be in charge. Dairy farms are different. Perhaps that’s because the person buying the robot is the person who most directly benefits from it. But I wonder if the concern over automation of jobs would be mitigated if more companies chose to emphasize the sustainability and joy of work equally with profit. Automation doesn’t have to be zero-sum—if implemented thoughtfully, perhaps robots can make work easier, more efficient, and more fun, too. Jacobs certainly thinks so. “That’s my utopia,” he says. “And we’re working in the right direction.”",
  "image": "https://spectrum.ieee.org/media-library/a-large-red-robot-moves-down-the-aisle-of-a-dairy-barn-dispensing-feed-to-cows-lined-up-to-eat.jpg?id=59849167\u0026width=1200\u0026height=600\u0026coordinates=0%2C15%2C0%2C15",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eRobots are taking over much of the daily manual labor at dairy farms, including milking, feeding, cleaning, and more. It makes dairy farmers’ lives easier, and makes the cows happier, too.\u003c/p\u003e\u003cdiv data-headline=\"How Dairy Robots Are Changing Work for Cows (and Farmers)\"\u003e\u003cp\u003e\u003cem\u003e\n\t\t“Mooooo.”\n\t\t\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThis dairy barn is\u003c/strong\u003e full of cows, as you might expect. \u003ca href=\"https://www.youtube.com/watch?v=g-zYshsAg1E\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eCows are being milked\u003c/a\u003e, \u003ca href=\"https://www.youtube.com/watch?v=wm_Iul30Sx0\" rel=\"noopener noreferrer\" target=\"_blank\"\u003ecows are being fed\u003c/a\u003e, \u003ca href=\"https://www.youtube.com/watch?v=yCJxN_3nnEc\" rel=\"noopener noreferrer\" target=\"_blank\"\u003ecows are being cleaned up after\u003c/a\u003e, and a few very happy cows are even getting \u003ca href=\"https://www.youtube.com/watch?v=vq1j4ImZxcw\" rel=\"noopener noreferrer\" target=\"_blank\"\u003evigorously scratched behind the ears\u003c/a\u003e. “I wonder where the farmer is,” remarks my guide, Jan Jacobs. Jacobs doesn’t seem especially worried, though—the several hundred cows in this barn are being well cared for by a small fleet of fully \u003ca href=\"https://spectrum.ieee.org/tag/autonomous-robots\"\u003eautonomous robots\u003c/a\u003e, and the farmer might not be back for hours. The robots will let him know if anything goes wrong.\n\u003c/p\u003e\u003cp\u003e\n\tAt one of the milking robots, several cows are lined up, nose to tail, politely waiting their turn. The cows can get milked by robot whenever they like, which typically means\n\t\u003ca href=\"https://www.lely.com/us/solutions/organic-grazing/faq/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003e more frequently than the twice a day\u003c/a\u003e at a traditional dairy farm. Not only is getting milked more often more comfortable for the cows, \u003ca href=\"https://www.lely.com/us/solutions/organic-grazing/production/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003ecows also produce about 10 percent more milk\u003c/a\u003e when the milking schedule is completely up to them.\n\u003c/p\u003e\u003cp\u003e\n\t“There’s a direct correlation between stress and milk production,” Jacobs says. “Which is nice, because robots make cows happier and therefore, they give more milk, which helps us sell more robots.”\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.linkedin.com/in/jan-jacobs-59296828/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eJan Jacobs\u003c/a\u003e is the human-robot interaction design lead for \u003ca href=\"https://www.lely.com/us/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eLely\u003c/a\u003e, a maker of agricultural machinery. Founded in 1948 in Maassluis, \u003ca href=\"https://spectrum.ieee.org/tag/netherlands\"\u003eNetherlands\u003c/a\u003e, Lely deployed its first Astronaut milking robot in the early 1990s. The company has since developed other robotic systems that assist with cleaning, feeding, and cow comfort, and the Astronaut milking robot is on its \u003ca href=\"https://www.lely.com/media/lely-centers-files/brochures/published/astronaut_a5_brochure_e_en.pdf\" rel=\"noopener noreferrer\" target=\"_blank\"\u003efifth generation\u003c/a\u003e. Lely is now focused entirely on robots for dairy farms, with around 135,000 of them deployed around the world.\n\u003c/p\u003e\u003ch2\u003eEssential Jobs on Dairy Farms\u003c/h2\u003e\u003cp\u003e\u003cspan\u003eThe weather outside the barn is miserable. It’s late fall in the Netherlands, and a cold rain is gusting in from the sea, which is probably why the cows have quite sensibly decided to stay indoors and why the farmer is still nowhere to be found. Lely requires that dairy farmers who adopt its robots commit to letting their cows move freely between milking, feeding, and resting, as well as inside and outside the barn, at their own pace. “We believe that free cow traffic is a core part of the future of farming,” Jacobs says as we watch one cow stroll away from the milking robot while another takes its place. This is possible only when the farm operates on the cows’ schedule rather than a human’s.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\n\tA conventional dairy farm relies heavily on human labor. Lely estimates that repetitive daily tasks represent about a third of the average workday of a dairy farmer. In the morning, the cows are milked for the first time. Most dairy cows must be milked at least twice a day or they’ll become uncomfortable, and so the herd will line up on their own. Traditional milking parlors are designed to maximize human milking efficiency. A milking carousel, for instance, slowly rotates cows as they’re milked so that the dairy worker doesn’t have to move between stalls.\n\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"Cows entering and exiting a Lely Astronaut milking robot in a modern dairy farm setting.\" data-rm-shortcode-id=\"c207a725fbda29ab8e49e44a3e9aaf98\" data-rm-shortcode-name=\"rebelmouse-image\" data-runner-src=\"https://spectrum.ieee.org/media-library/cows-entering-and-exiting-a-lely-astronaut-milking-robot-in-a-modern-dairy-farm-setting.jpg?id=59764532\u0026amp;width=980\" height=\"2250\" id=\"3fad0\" lazy-loadable=\"true\" src=\"https://spectrum.ieee.org/media-library/cows-entering-and-exiting-a-lely-astronaut-milking-robot-in-a-modern-dairy-farm-setting.jpg?id=59764532\u0026amp;width=980\" width=\"3600\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"Automated cow milking machine in a dairy farm, cow in position being milked.\" data-rm-shortcode-id=\"4e3ab2f9a50553c4dad2c678fb747a85\" data-rm-shortcode-name=\"rebelmouse-image\" data-runner-src=\"https://spectrum.ieee.org/media-library/automated-cow-milking-machine-in-a-dairy-farm-cow-in-position-being-milked.jpg?id=59759842\u0026amp;width=980\" height=\"2438\" id=\"fc35f\" lazy-loadable=\"true\" src=\"https://spectrum.ieee.org/media-library/automated-cow-milking-machine-in-a-dairy-farm-cow-in-position-being-milked.jpg?id=59759842\u0026amp;width=980\" width=\"3900\"/\u003e\u003csmall placeholder=\"Add Photo Caption...\"\u003e“We were spending 6 hours a day milking,” explains dairy farmer Josie Rozum, whose 120-cow herd at Takes Dairy Farm uses a pair of Astronaut A5 milking robots. “Now that the robots are handling all of that, we can focus more on animal care and comfort.”\u003c/small\u003e\u003csmall placeholder=\"add photo credit...\"\u003eLely\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\n\tAn experienced human using well-optimized equipment can attach a milking machine to a cow \n\t\u003ca href=\"https://www.vet.cornell.edu/animal-health-diagnostic-center/programs/quality-milk-production-services/services/parlor-efficiency\" rel=\"noopener noreferrer\" target=\"_blank\"\u003ein just 20 to 30 seconds\u003c/a\u003e. The actual milking takes only a few minutes, but with the average small dairy farm in North America providing a home for \u003ca href=\"https://hoards.com/article-34810-familiar-dairy-industry-trends-continue.html\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eseveral hundred cows\u003c/a\u003e, milking typically represents a time commitment of \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S0022030222003228#fig2\" rel=\"noopener noreferrer\" target=\"_blank\"\u003e4 to 6 hours per day\u003c/a\u003e.\n\u003c/p\u003e\u003cp\u003e\n\tThere are other jobs that must be done every day at a dairy. \n\t\u003ca href=\"https://www.dairyherd.com/news/education/how-often-should-you-push-feed\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eCows are happier with continuous access to food\u003c/a\u003e, which means feeding them several times a day. \u003ca href=\"https://www.americandairy.com/dairy-diary/what-do-dairy-cows-eat/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eThe feed is a mix of roughage (hay), silage (grass), and grain\u003c/a\u003e. The cows will eat all of this, but they prefer the grain, and so it’s common to see cows sorting their food by grabbing a mouthful and throwing it up into the air. The lighter roughage and silage flies farther than the grain does, leaving the cow with a pile of the tastier stuff as the rest gets tossed out of reach. This makes “\u003ca href=\"https://www.dairyherd.com/news/education/how-often-should-you-push-feed\" rel=\"noopener noreferrer\" target=\"_blank\"\u003efeed pushing\u003c/a\u003e” necessary to shove the rest of the feed back within reach of the cow.\n\u003c/p\u003e\u003cp\u003e\n\tAnd of course there’s manure. A dairy cow produces an average of \n\t\u003ca href=\"https://thedairylandinitiative.vetmed.wisc.edu/home/housing-module/adult-cow-housing/manure-management/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003e68 kilograms of manure a day\u003c/a\u003e. All that manure has to be collected and the barn floors regularly cleaned.\n\u003c/p\u003e\u003ch2\u003eDairy \u003ca href=\"https://spectrum.ieee.org/tag/industry-4-0\"\u003eIndustry 4.0\u003c/a\u003e\u003c/h2\u003e\u003cp\u003e\n\tThe amount of labor needed to operate a dairy meant that until the early 1900s, \n\t\u003ca href=\"https://youtu.be/sjmflKg-v2o?t=1049\" rel=\"noopener noreferrer\" target=\"_blank\"\u003emost family farms could support only about eight cows\u003c/a\u003e. The introduction of the first milking machines, called \u003ca href=\"https://www.surgemilker.com/history.html\" rel=\"noopener noreferrer\" target=\"_blank\"\u003ebucket milkers\u003c/a\u003e, helped farmers milk 10 cows per hour instead of 4 by the mid-1920s. \u003ca href=\"https://spectrum.ieee.org/tag/rural-electrification\"\u003eRural electrification\u003c/a\u003e furthered dairy \u003ca href=\"https://spectrum.ieee.org/tag/automation\"\u003eautomation\u003c/a\u003e starting in the 1950s, and since then, both farm size and milk production have increased steadily. In the 1930s, a good dairy cow \u003ca href=\"https://youtu.be/sjmflKg-v2o?t=1631\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eproduced 3,600 kilograms of milk per year\u003c/a\u003e. \u003ca href=\"https://downloads.usda.library.cornell.edu/usda-esmis/files/h989r321c/mg74sh83p/nc582h285/mkpr0225.pdf\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eToday, it’s almost 11,000 kilograms\u003c/a\u003e, and Lely believes that robots are what will enable small dairy farms to continue to scale sustainably.\n\u003c/p\u003e\u003cp\u003e\u003cspan data-rm-shortcode-id=\"3d0c2a865a4f6909e8ce591fab31c88e\"\u003e\u003ciframe frameborder=\"0\" height=\"auto\" type=\"lazy-iframe\" scrolling=\"no\" data-runner-src=\"https://www.youtube.com/embed/g-zYshsAg1E?rel=0\" width=\"100%\"\u003e\u003c/iframe\u003e\u003c/span\u003e\u003csmall placeholder=\"Add Photo Credit...\"\u003eLely\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBut dairy robots are expensive. A milking robot can cost \u003c/span\u003e\u003ca href=\"https://dairy.unl.edu/automatic-milking-systems-good-bad-and-unknown/\" target=\"_blank\"\u003eseveral hundred thousand dollars\u003c/a\u003e\u003cspan\u003e, plus an additional \u003c/span\u003e\u003ca href=\"https://www.lelycentermidatlantic.com/index.php/2022/02/01/how-much-does-it-cost-to-operate-a-lely-robot/\" target=\"_blank\"\u003eUS $5,000 to $10,000 per year in operating costs\u003c/a\u003e\u003cspan\u003e. The Astronaut A5, Lely’s latest milking robot, uses a laser-guided \u003ca href=\"https://spectrum.ieee.org/tag/robot-arm\"\u003erobot arm\u003c/a\u003e to clean the cow’s udder before attaching teat cups one at a time. While the cow munches on treats, the Astronaut monitors her milk output, collecting data on 32 parameters, including indicators of the quality of the milk and the health of the cow. When milking is complete, the robot cleans the udder again, and the cow is free to leave as the robot steam cleans itself in preparation for the next cow.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.lely.com/gb/centers/midlands/what-cost-milking-robot/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eLely argues\u003c/a\u003e that although the initial cost is higher than that of a traditional milking parlor, the robots pay for themselves over time through higher milk production (due primarily to increased milking frequency) and lower labor costs. Lely’s other robots can also save on labor. The Vector mobile robot handles continuous feeding and feed pushing, and the Discovery Collector is a robotic manure vacuum that keeps the floors clean.\n\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"Automated feeding robot is loaded with food by a small overhead crane before it leaves to deliver feed to cows inside a modern barn.\" data-rm-shortcode-id=\"9883c894cc153fca40c2315735e6c5f1\" data-rm-shortcode-name=\"rebelmouse-image\" data-runner-src=\"https://spectrum.ieee.org/media-library/automated-feeding-robot-is-loaded-with-food-by-a-small-overhead-crane-before-it-leaves-to-deliver-feed-to-cows-inside-a-modern-b.jpg?id=59764133\u0026amp;width=980\" height=\"2777\" id=\"eb199\" lazy-loadable=\"true\" src=\"https://spectrum.ieee.org/media-library/automated-feeding-robot-is-loaded-with-food-by-a-small-overhead-crane-before-it-leaves-to-deliver-feed-to-cows-inside-a-modern-b.jpg?id=59764133\u0026amp;width=980\" width=\"4500\"/\u003e\u003csmall placeholder=\"Add Photo Caption...\"\u003eAt Takes Dairy Farm, Rozum and her family used to spend several hours per day managing food for the cows. “The feeding robot is another amazing piece of the puzzle for our farm that allows us to focus on other things.”\u003c/small\u003e\u003csmall placeholder=\"Add Photo Credit...\"\u003eTakes Family Farm\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\n\tFor most dairy farmers, though, making more money is not the main reason to get a robot, explains \n\t\u003ca href=\"https://ansci.umn.edu/people/marcia-endres\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eMarcia Endres\u003c/a\u003e, a professor in the department of animal science at the University of Minnesota. Endres specializes in dairy-cattle management, behavior, and welfare, and studies dairy robot adoption. “When we first started doing research on this about 12 years ago, most of the farms that were installing robots were smaller farms that did not want to hire employees,” Endres says. “They wanted to do the work just with family labor, but they also wanted to have more flexibility with their time. They wanted a better lifestyle.”\n\u003c/p\u003e\u003cp\u003e\n\tFlexibility was key for the Takes family, who \n\t\u003ca href=\"https://youtu.be/vZY8TbBoDd0?t=147\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eadded Lely robots to their dairy farm\u003c/a\u003e in Ely, Iowa, four years ago. “When we had our old milking parlor, everything that we did as a family was always scheduled around milking,” says Josie Rozum, who manages the farm and a creamery along with her parents—Dan and Debbie Takes—and three brothers. “With the robots, we can prioritize our personal life a little bit more—we can spend time together on Christmas morning and know that the cows are still getting milked.”\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.dananddebbies.com/about/the-farm/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eTakes Family Dairy Farm\u003c/a\u003e’s 120-cow herd is milked by a pair of Astronaut A5 robots, with a Vector and three Discovery Collectors for feeding and cleaning. “They’ve become a crucial part of the team,” explains Rozum. “It would be challenging for us to find outside help, and the robots keep things running smoothly.” The robots also add sustainability to small dairy farms, and not just in the short term. “Growing up on the farm, we experienced the hard work, and we saw what that commitment did to our parents,” Rozum explains. “It’s a very tough lifestyle. Having the robots take over a little bit of that has made dairy farming more appealing to our generation.”\n\u003c/p\u003e\u003cp\u003e\u003cspan data-rm-shortcode-id=\"c22f75ac2236f457c18ecd55f872ca53\"\u003e\u003ciframe frameborder=\"0\" height=\"auto\" type=\"lazy-iframe\" scrolling=\"no\" data-runner-src=\"https://www.youtube.com/embed/vZY8TbBoDd0?rel=0\u0026amp;start=147\" width=\"100%\"\u003e\u003c/iframe\u003e\u003c/span\u003e\u003csmall placeholder=\"Add Photo Credit...\"\u003eTakes Dairy Farm\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\n\tOf the 25,000 dairy farms in the \u003ca href=\"https://spectrum.ieee.org/tag/united-states\"\u003eUnited States\u003c/a\u003e, Endres estimates about 10 percent have robots. This is \n\t\u003ca href=\"https://www.gminsights.com/industry-analysis/milking-robots-market\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eabout a third of the adoption rate in Europe\u003c/a\u003e, \u003ca href=\"https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Farms_and_farmland_in_the_European_Union_-_statistics\" rel=\"noopener noreferrer\" target=\"_blank\"\u003ewhere farms tend to be smaller\u003c/a\u003e, so the cost of implementing the robots is lower. Endres says that over the last five years, she’s seen a shift toward robot adoption at larger farms with over 500 cows, due primarily to labor shortages. “These larger dairies are having difficulty finding employees who want to milk cows—it’s a very tedious job. And the robot is always consistent. The farmers tell me, ‘My robot never calls in sick, and never shows up drunk.’ ”\n\u003c/p\u003e\u003cp\u003e\n\tEndres is skeptical of Lely’s claim that its robots are responsible for increased milk production. “There is no research that proves that cows will be more productive just because of robots,” she says. It may be true that farms that add robots do see increased milk production, she adds, but it’s difficult to measure the direct effect that the robots have. “I have many dairies that I work with where they have both a robotic milking system and a conventional milking system, and if they are managing their cows well, there isn’t a lot of difference in milk production.”\n\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"Cow using an automated brush for grooming inside a modern barn.\" data-rm-shortcode-id=\"9106b1e71ad19d377f43b164221e0a40\" data-rm-shortcode-name=\"rebelmouse-image\" data-runner-src=\"https://spectrum.ieee.org/media-library/cow-using-an-automated-brush-for-grooming-inside-a-modern-barn.jpg?id=59759835\u0026amp;width=980\" height=\"3375\" id=\"3f0b4\" lazy-loadable=\"true\" src=\"https://spectrum.ieee.org/media-library/cow-using-an-automated-brush-for-grooming-inside-a-modern-barn.jpg?id=59759835\u0026amp;width=980\" width=\"4500\"/\u003e\u003csmall placeholder=\"Add Photo Caption...\"\u003eThe Lely Luna cow brush helps to keep cows’ skin healthy. It’s also relaxing and enjoyable, so cows will brush themselves several times a day.\u003c/small\u003e\u003csmall placeholder=\"Add Photo Credit...\"\u003eLely\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\n\tThe robots do seem to improve the cows’ lives, however. “Welfare is not just productivity and health—it’s also the affective state, the ability to have a more natural life,” Endres says. “Again, it’s hard to measure, but I think that on most of these robot farms, their affective state is improved.” The cows’ relationship with humans changes too, comments Endres. When the cows no longer associate humans with being told where to go and what to do all the time, they’re \n\t\u003ca href=\"https://youtu.be/sjmflKg-v2o?t=2633\" rel=\"noopener noreferrer\" target=\"_blank\"\u003emuch more relaxed and friendly\u003c/a\u003e toward people they meet. Rozum agrees. “We’ve noticed a tremendous change in our cows’ demeanor. They’re more calm and relaxed, just doing their thing in the barn. They’re much more comfortable when they can choose what to do.”\n\u003c/p\u003e\u003ch2\u003eCows Versus Robots\u003c/h2\u003e\u003cp\u003e\n\tCows are curious and clever \u003ca href=\"https://spectrum.ieee.org/tag/animals\"\u003eanimals\u003c/a\u003e, and have the same instinct that humans have when confronted with a new robot: They want to play with it. Because of this, Lely has had to cow-proof its robots, modifying their design and \u003ca href=\"https://spectrum.ieee.org/tag/programming\"\u003eprogramming\u003c/a\u003e so that the machines can function autonomously around cows. Like many \u003ca href=\"https://spectrum.ieee.org/tag/mobile-robots\"\u003emobile robots\u003c/a\u003e, Lely’s dairy robots include contact-sensing bumpers that will pause the robot’s motion if it runs into something. On the Vector feeding robot, Lely product engineer \n\t\u003ca href=\"https://www.linkedin.com/in/beltman42/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eRené Beltman\u003c/a\u003e tells me, they had to add a software option to disable the bumper. “The cows learned that, ‘oh, if I just push the bumper, then the robot will stop and put down more feed in my area for me to eat.’ It was a free buffet. So you don’t want the cows to end up controlling the robot.” Emergency stop buttons had to be relocated so that they couldn’t be pressed by questing cow tongues.\n\u003c/p\u003e\u003cp\u003e\n\tThere’s also a social component to cow-robot interaction. Within their herd, cows have a well-established hierarchy, and the robots need to work within this hierarchy to do their jobs. For example, a cow won’t move out of the way if it thinks that another cow is lower in the hierarchy than it is, and it will treat a robot the same way. The engineers had to figure out how the Discovery Collector could drive back and forth to vacuum up manure without getting blocked by cows. “In our early tests, we’d use sensors to have the robot stop to avoid running into any of the cows,” explains Jacobs. “But that meant that the robot became the weakest one in the hierarchy, and it would just end up crying in the corner because the cows wouldn’t move for it. So now, it doesn’t stop.”\n\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"Cows resting in pens with a robot cleaning the floor in a modern barn setting.\" data-rm-shortcode-id=\"270244739bf55a596082710523ed2eed\" data-rm-shortcode-name=\"rebelmouse-image\" data-runner-src=\"https://spectrum.ieee.org/media-library/cows-resting-in-pens-with-a-robot-cleaning-the-floor-in-a-modern-barn-setting.jpg?id=59759837\u0026amp;width=980\" height=\"2102\" id=\"c9d2c\" lazy-loadable=\"true\" src=\"https://spectrum.ieee.org/media-library/cows-resting-in-pens-with-a-robot-cleaning-the-floor-in-a-modern-barn-setting.jpg?id=59759837\u0026amp;width=980\" width=\"3363\"/\u003e\u003csmall placeholder=\"Add Photo Caption...\"\u003eOne of the dirtiest jobs on a dairy farm is handled by the Discovery Collector, an autonomous manure vacuum. The robot relies on wheel odometry and \u003ca href=\"https://spectrum.ieee.org/tag/ultrasonic-sensors\"\u003eultrasonic sensors\u003c/a\u003e for navigation because it’s usually covered in manure.\u003c/small\u003e\u003csmall placeholder=\"Add Photo Credit...\"\u003eEvan Ackerman\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\n\t“We make the robot drive slower for the first week, when it’s being introduced to a new herd,” adds Beltman. “That gives the cows time to figure out that the robot is at the top of the hierarchy.”\n\u003c/p\u003e\u003cp\u003e\n\tBesides maintaining their dominance at the top of the herd, the current generation of Lely robots doesn’t interact much with the cows, but that’s changing, Jacobs tells me. Right now, when a robot is driving through the barn, it makes a beeping sound to let the cows know it’s coming. Lely is looking into how to make these sounds more enjoyable for the cows. “This was a recent revelation for me,” Jacobs says. ”We’re not just designing interactions for humans. The cows are our users, too.”\n\u003c/p\u003e\u003ch2\u003eHuman-Robot Interaction\u003c/h2\u003e\u003cp\u003e\n\tLast year, Jacobs and researchers from \u003ca href=\"https://spectrum.ieee.org/tag/delft-university-of-technology\"\u003eDelft University of Technology\u003c/a\u003e, in the Netherlands, \n\t\u003ca href=\"https://ieeexplore.ieee.org/document/10660792\" rel=\"noopener noreferrer\" target=\"_blank\"\u003epresented a paper\u003c/a\u003e at the IEEE Human-Robot Interaction (\u003ca href=\"https://spectrum.ieee.org/tag/hri\"\u003eHRI\u003c/a\u003e) Conference exploring this concept of robot behavior development on working dairy farms. The researchers visited robotic dairies, interviewed dairy farmers, and held workshops within Lely to establish a robot code of conduct—a guide that Lely’s designers and engineers use when considering how their robots should look, sound, and act, for the benefit of both humans and cows. On the engineering side, this includes practical things like colors and patterns for lights and different types of sounds so that information is communicated consistently across platforms.\n\u003c/p\u003e\u003cp\u003e\n\tBut there’s much more nuance to making a robot seem “reliable” or “friendly” to the end user, since such things are not only difficult to define but also difficult to implement in a way that’s appropriate for dairy farmers, who prioritize functionality.\n\u003c/p\u003e\u003cp\u003e\n\tJacobs doesn’t want his robots to try to be anyone’s friend—not the cow’s, and not the farmer’s. “The robot is an employee, and it should have a professional relationship,” he says. “So the robot might say ‘Hi,’ but it wouldn’t say, ‘How are you feeling today?’ ” What’s more important is that the robots are trustworthy. For Jacobs, instilling trust is simple: “You cannot gain trust by doing tricks. If your robot is reliable and predictable, people will trust it.”\n\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"Automated milking machine attached to cow\u0026#39;s udders, with cow standing on a slotted floor.\" data-rm-shortcode-id=\"4bec6c118f690770f5c6ecec2f377e4e\" data-rm-shortcode-name=\"rebelmouse-image\" data-runner-src=\"https://spectrum.ieee.org/media-library/automated-milking-machine-attached-to-cow-s-udders-with-cow-standing-on-a-slotted-floor.jpg?id=59759840\u0026amp;width=980\" height=\"2700\" id=\"cf5f5\" lazy-loadable=\"true\" src=\"https://spectrum.ieee.org/media-library/automated-milking-machine-attached-to-cow-s-udders-with-cow-standing-on-a-slotted-floor.jpg?id=59759840\u0026amp;width=980\" width=\"3600\"/\u003e\u003csmall placeholder=\"Add Photo Caption...\"\u003eThe electrically driven, pneumatically balanced \u003ca href=\"https://spectrum.ieee.org/tag/robotic-arm\"\u003erobotic arm\u003c/a\u003e that the Lely Astronaut uses to milk cows is designed to withstand accidental (or intentional) kicks.\u003c/small\u003e\u003csmall placeholder=\"Add Photo Credit...\"\u003eLely\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\n\tThe real challenge, Jacobs explains, is that Lely is largely on its own when it comes to finding the best way of integrating its robots into the daily lives of people who may have never thought they’d have robot employees. “There’s not that much knowledge in the robot world about how to approach these problems,” Jacobs says. “We’re working with almost 20,000 farmers who have a bigger robot workforce than a human workforce. They’re robot managers. And I don’t know that there necessarily are other companies that have a customer base of normal people who have strategic dependence on robots for their livelihood. That is where we are now.”\n\u003c/p\u003e\u003ch2\u003eFrom Dairy Farmers to Robot Managers\u003c/h2\u003e\u003cp\u003e\u003cspan\u003eWith the additional time and flexibility that the robots enable, some dairy farmers have been able to diversify. On our way back to Lely’s headquarters, we stop at \u003c/span\u003e\u003ca href=\"https://boerderijhetlansingerland.nl/melkveebedrijf/\" target=\"_blank\"\u003eFarm Het Lansingerland\u003c/a\u003e\u003cspan\u003e, owned by a Lely customer who has added a small restaurant and farm shop to his dairy. Large windows look into the barn so that restaurant patrons can watch the robots at work, caring for the cows that produce the cheese that’s on the menu. A self-guided tour takes you right up next to an Astronaut A5 milking robot, while signs on the floor warn of Vector feeding robots on the move. “This farmer couldn’t expand—this was as many cows as he’s allowed to have here,” Jacobs explains to me over cheese sandwiches. “So, he needs to have additional income streams. That’s why he started these other things. And the robots were essential for that.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\n\tThe farmer is an early adopter—someone who’s excited about the technology and actively interested in the robots themselves. But most of Lely’s tens of thousands of customers just want a reliable robotic employee, not a science project. “We help the farmer to prepare not just the environment for the robots, but also the mind,” explains Jacobs. “It’s a complete shift in their way of working.”\n\u003c/p\u003e\u003cp\u003e\n\tBesides managing the robots, the farmer must also learn to manage the massive amount of data that the robots generate about the cows. “The amount of data we get from the robots is a game changer,” says Rozum. “We can track milk production, health, and cow habits in real time. But it’s overwhelming. You could spend all day just sitting at the computer, looking at data and not get anything else done. It took us probably a year to really learn how to use it.”\n\u003c/p\u003e\u003cp\u003e\n\tThe most significant advantages to farmers come from using the data for long-term optimization, says the University of Minnesota’s Endres. “In a conventional barn, the cows are treated as a group,” she says. “But the robots are collecting data about individual animals, which lets us manage them as individuals.” By combining data from a milking robot and a feeding robot, for example, farmers can close the loop, correlating when and how the cows are fed with their milk production. Lely is doing its best to simplify this type of decision making, says Jacobs. “You need to understand what the data means, and then you need to present it to the farmer in an actionable way.”\n\u003c/p\u003e\u003cdiv id=\"rebelltitem1\" data-id=\"1\" data-reload-ads=\"false\" data-is-image=\"True\" data-href=\"https://spectrum.ieee.org/lely-dairy-robots/a-robotic-dairy\" data-basename=\"a-robotic-dairy\" data-post-id=\"2671643574\" data-published-at=\"1743515326\" data-use-pagination=\"False\"\u003e\u003ch3 data-role=\"headline\"\u003e\n            \n                A Robotic Dairy\n            \n            \n        \u003c/h3\u003e\u003cp\u003e\u003cimg id=\"15c0e\" data-rm-shortcode-id=\"523f4b6812182dc0756edd9f83d8e771\" data-rm-shortcode-name=\"rebelmouse-image\" lazy-loadable=\"true\" src=\"https://spectrum.ieee.org/media-library/illustration-of-an-automated-dairy-farm-with-milking-machines-feed-dispensers-and-cows-in-various-areas.png?id=59771554\u0026amp;width=980\" data-runner-src=\"https://spectrum.ieee.org/media-library/illustration-of-an-automated-dairy-farm-with-milking-machines-feed-dispensers-and-cows-in-various-areas.png?id=59771554\u0026amp;width=980\" width=\"3238\" height=\"2134\" alt=\"Illustration of an automated dairy farm with milking machines, feed dispensers, and cows in various areas.\"/\u003e\u003csmall\u003e\u003cp\u003eChris Philpot\u003c/p\u003e\u003c/small\u003e\u003c/p\u003e\u003ch3\u003e\nAll dairy farms are different, and farms that decide to give robots a try will often start with just one or two. A highly roboticized dairy barn might look something like this illustration, with a team of many different robots working together to keep the cows comfortable and happy.\n\u003c/h3\u003e\u003cp\u003e\n\tA: One Astronaut A5 robot can milk up to 60 cows. After the Astronaut cleans the teats, a laser sensor guides a robotic arm to attach the teat cups. Milking takes just a few minutes.\n\u003c/p\u003e\u003cp\u003e\n\tB: In the feed \u003ca href=\"https://spectrum.ieee.org/tag/kitchen\"\u003ekitchen\u003c/a\u003e, the Vector robot recharges itself while different ingredients are loaded into its hopper and mixed together. Mixtures can be customized for different groups of cows.\n\u003c/p\u003e\u003cp\u003e\n\tC: The Vector robot dispenses freshly mixed food in small batches throughout the day. A laser measures the height of leftover food to make sure that the cows are getting the right amounts.\n\u003c/p\u003e\u003cp\u003e\n\tD: The Discovery Collector is a mop and vacuum for cow manure. It navigates the barn autonomously and returns to its docking station to remove waste, refill water, and wirelessly recharge.\u003c/p\u003e\u003cp\u003e\n\tE: As it milks, the Astronaut is collecting a huge amount of data—32 different parameters per teat. If it detects an issue, the farmer is notified, helping to catch health problems early.\u003c/p\u003e\u003cp\u003e\n\tF: Automated gates control meadow access and will keep a cow inside if she’s due to be milked soon. Cows are identified using \u003ca href=\"https://spectrum.ieee.org/tag/rfid\"\u003eRFID\u003c/a\u003e collars, which also track their behavior and health.\n\u003c/p\u003e\u003c/div\u003e\u003ch2\u003eA Sensible Future for Dairy Robots\u003c/h2\u003e\u003cp\u003e\n\tAfter lunch, we stop by Lely headquarters, where bright red life-size cow statues guard the entrance and all of the conference rooms are dairy themed. We get comfortable in Butter, and I ask Jacobs and Beltman what the future holds for their dairy robots.\n\u003c/p\u003e\u003cp\u003e\n\tIn the near term, Lely is focused on making its existing robots more capable. Its latest \n\t\u003ca href=\"https://www.lely.com/us/press/2024/09/10/lely-introduces-autonomous-feed-pushing-robot-for/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003efeed-pushing robot\u003c/a\u003e is equipped with \u003ca href=\"https://spectrum.ieee.org/tag/lidar\"\u003elidar\u003c/a\u003e and \u003ca href=\"https://spectrum.ieee.org/tag/stereo-cameras\"\u003estereo cameras\u003c/a\u003e, which allow it to autonomously navigate around large farms without needing to follow a metal strip bolted to the ground. A new \u003ca href=\"https://www.lely.com/us/press/2024/09/10/lely-zeta-the-start-of-a-new-chapter-in-dairy-farm/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eoverhead camera system\u003c/a\u003e will leverage AI to recognize individual cows and track their behavior, while also providing farmers with an enormous new dataset that could allow Lely’s systems to help farmers make more nuanced decisions about cow welfare. The potential of AI is what Jacobs seems most excited about, although he’s cautious as well. “With AI, we’re suddenly going to take away an entirely different level of work. So, we’re thinking about doing research into the meaningfulness of work, to make sure that the things that we do with AI are the things that farmers \u003cem\u003e\u003cem\u003ewant\u003c/em\u003e\u003c/em\u003e us to do with AI.”\n\u003c/p\u003e\u003cp\u003e\n\t“The idea of AI is very intriguing,” comments Rozum. “I think AI could help to simplify things for farmers. It would be a tool, a resource. But we know our cows best, and a farmer’s judgment has to be there too. There’s just some component of dairy farming that you cannot take the human out of. Robots are not going to be successful on a farm unless you have good farmers.”\n\u003c/p\u003e\u003cp\u003e\n\tLely is aware of this and knows that its robots have to find the right balance between being helpful, and taking over. “We want to make sure not to take away the kinds of interactions that give dairy farmers joy in their work,” says Beltman. “Like feeding calves—every farmer likes to feed the calves.” Lely does sell an \n\t\u003ca href=\"https://www.lely.com/us/solutions/feeding/calm/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eautomated calf feeder\u003c/a\u003e that many dairy farmers buy, which illustrates the point: What’s the best way of designing robots to give humans the flexibility to do the work that they enjoy?\n\u003c/p\u003e\u003cp\u003e\n\t“This is where \u003ca href=\"https://spectrum.ieee.org/topic/robotics/\"\u003erobotics\u003c/a\u003e is going,” Jacobs tells me as he gives me a lift to the train station. “As a human, you could have two other humans and six robots, and that’s your company.” Many industries, he says, look to robots with the objective of minimizing human involvement as much as possible so that the robots can generate the maximum amount of value for whoever happens to be in charge.\n\u003c/p\u003e\u003cp\u003e\n\tDairy farms are different. Perhaps that’s because the person buying the robot is the person who most directly benefits from it. But I wonder if the concern over automation of jobs would be mitigated if more companies chose to emphasize the sustainability and joy of work equally with profit. Automation doesn’t have to be zero-sum—if implemented thoughtfully, perhaps robots can make work easier, more efficient, and more fun, too.\n\u003c/p\u003e\u003cp\u003e\n\tJacobs certainly thinks so. “That’s my utopia,” he says. “And we’re working in the right direction.”\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "24 min read",
  "publishedTime": "2025-04-01T20:00:03Z",
  "modifiedTime": "2025-04-09T19:43:54Z"
}
