{
  "id": "b5e8d9e3-241f-448a-9e59-cde98f0657b8",
  "title": "Research roundup: 7 stories we almost missed",
  "link": "https://arstechnica.com/science/2025/05/research-roundup-ping-pong-bots-the-genetic-key-for-ginger-cats-and-more/",
  "description": "Also: drumming chimpanzees, picking styles of two jazz greats, and an ancient underground city's soundscape",
  "author": "Jennifer Ouellette",
  "published": "Sat, 31 May 2025 21:37:45 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Science",
    "acoustics",
    "Archaeology",
    "architecture",
    "Biology",
    "Physics",
    "primates",
    "Robotics",
    "science"
  ],
  "byline": "Jennifer Ouellette",
  "length": 14194,
  "excerpt": "Also: drumming chimpanzees, picking styles of two jazz greats, and an ancient underground city’s soundscape…",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Also: drumming chimpanzees, picking styles of two jazz greats, and an ancient underground city's soundscape Time lapse photos show a new ping-pong-playing robot performing a top spin. Credit: David Nguyen, Kendrick Cancio and Sangbae Kim It's a regrettable reality that there is never time to cover all the interesting scientific stories we come across each month. In the past, we've featured year-end roundups of cool science stories we (almost) missed. This year, we're experimenting with a monthly collection. May's list includes a nifty experiment to make a predicted effect of special relativity visible; a ping-pong playing robot that can return hits with 88 percent accuracy; and the discovery of the rare genetic mutation that makes orange cats orange, among other highlights. Special relativity made visible Credit: TU Wien Perhaps the most well-known feature of Albert Einstein's special theory of relativity is time dilation and length contraction. In 1959, two physicists predicted another feature of relativistic motion: an object moving near the speed of light should also appear to be rotated. It's not been possible to demonstrate this experimentally, however—until now. Physicists at the Vienna University of Technology figured out how to reproduce this rotational effect in the lab using laser pulses and precision cameras, according to a paper published in the journal Communications Physics. They found their inspiration in art, specifically an earlier collaboration with an artist named Enar de Dios Rodriguez, who collaborated with VUT and the University of Vienna on a project involving ultra-fast photography and slow light. For this latest research, they used objects shaped like a cube and a sphere and moved them around the lab while zapping them with ultrashort laser pulses, recording the flashes with a high-speed camera. Getting the timing just right effectively yields similar results to a light speed of 2 m/s. After photographing the objects many times using this method, the team then combined the still images into a single image. The results: the cube looked twisted and the sphere's North Pole was in a different location—a demonstration of the rotational effect predicted back in 1959. DOI: Communications Physics, 2025. 10.1038/s42005-025-02003-6  (About DOIs). Drumming chimpanzees A chimpanzee feeling the rhythm. Credit: Current Biology/Eleuteri et al., 2025. A chimpanzee feeling the rhythm. Credit: Current Biology/Eleuteri et al., 2025. Chimpanzees are known to \"drum\" on the roots of trees as a means of communication, often combining that action with what are known as \"pant-hoot\" vocalizations (see above video). Scientists have found that the chimps' drumming exhibits key elements of musical rhythm much like humans, according to  a paper published in the journal Current Biology—specifically non-random timing and isochrony. And chimps from different geographical regions have different drumming rhythms. Back in 2022, the same team observed that individual chimps had unique styles of \"buttress drumming,\" which served as a kind of communication, letting others in the same group know their identity, location, and activity. This time around they wanted to know if this was also true of chimps living in different groups and whether their drumming was rhythmic in nature. So they collected video footage of the drumming behavior among 11 chimpanzee communities across six populations in East Africa (Uganda) and West Africa (Ivory Coast), amounting to 371 drumming bouts. Their analysis of the drum patterns confirmed their hypothesis. The western chimps drummed in regularly spaced hits, used faster tempos, and started drumming earlier during their pant-hoot vocalizations. Eastern chimps would alternate between shorter and longer spaced hits. Since this kind of rhythmic percussion is one of the earliest evolved forms of human musical expression and is ubiquitous across cultures, findings such as this could shed light on how our love of rhythm evolved. DOI: Current Biology, 2025. 10.1016/j.cub.2025.04.019  (About DOIs). Distinctive styles of two jazz greats Jazz lovers likely need no introduction to Joe Pass and Wes Montgomery, 20th century guitarists who influenced generations of jazz musicians with their innovative techniques. Montgomery, for instance, didn't use a pick, preferring to pluck the strings with his thumb—a method he developed because he practiced at night after working all day as a machinist and didn't want to wake his children or neighbors. Pass developed his own range of picking techniques, including fingerpicking, hybrid picking, and \"flat picking.\" Chirag Gokani and Preston Wilson, both with Applied Research Laboratories and the University of Texas, Austin, greatly admired both Pass and Montgomery and decided to explore the underlying the acoustics of their distinctive playing, modeling the interactions of the thumb, fingers, and pick with a guitar string. They described their research during a meeting of the Acoustical Society of America in New Orleans, LA. Among their findings: Montgomery achieved his warm tone by playing closer to the bridge and mostly plucking at the string. Pass's rich tone arose from a combination of using a pick and playing closer to the guitar neck. There were also differences in how much a thumb, finger, and pick slip off the string:  use of the thumb (Montgomery) produced more of a \"pluck\" compared to the pick (Pass), which produced more of a \"strike.\" Gokani and Wilson think their model could be used to synthesize digital guitars with a more realistic sound, as well as helping guitarists better emulate Pass and Montgomery. Sounds of an ancient underground city Credit: Sezin Nas Turkey is home to the underground city Derinkuyu, originally carved out inside soft volcanic rock around the 8th century BCE. It was later expanded to include four main ventilation channels (and some 50,000 smaller shafts) serving seven levels, which could be closed off from the inside with a large rolling stone. The city could hold up to 20,000 people and it  was connected to another underground city, Kaymakli, via tunnels. Derinkuyu helped protect Arab Muslims during the Arab-Byzantine wars, served as a refuge from the Ottomans in the 14th century, and as a haven for Armenians escaping persecution in the early 20th century, among other functions. The tunnels were rediscovered in the 1960s and about half of the city has been open to visitors since 2016. The site is naturally of great archaeological interest, but there has been little to no research on the acoustics of the site, particularly the ventilation channels—one of Derinkuyu's most unique features, according to Sezin Nas, an architectural acoustician at Istanbul Galata University in Turkey.  She gave a talk at a meeting of the Acoustical Society of America in New Orleans, LA, about her work on the site's acoustic environment. Nas analyzed a church, a living area, and a kitchen, measuring sound sources and reverberation patterns, among other factors, to create a 3D virtual soundscape. The hope is that a better understanding of this aspect of Derinkuyu could improve the design of future underground urban spaces—as well as one day using her virtual soundscape to enable visitors to experience the sounds of the city themselves. MIT's latest ping-pong robot Robots playing ping-pong have been a thing since the 1980s, of particular interest to scientists because it requires the robot to combine the slow, precise ability to grasp and pick up objects with dynamic, adaptable locomotion. Such robots need high-speed machine vision, fast motors and actuators, precise control, and the ability to make accurate predictions in real time, not to mention being able to develop a game strategy. More recent designs use AI techniques to allow the robots to \"learn\" from prior data to improve their performance. MIT researchers have built their own version of a ping-pong playing robot, incorporating a lightweight design and the ability to precisely return shots. They built on prior work developing the Humanoid, a small bipedal two-armed robot—specifically, modifying the Humanoid's arm by adding an extra degree of freedom to the wrist so the robot could control a ping-pong paddle. They tested their robot by mounting it on a ping-pong table and lobbing 150 balls at it from the other side of the table, capturing the action with high-speed cameras. The new bot can execute three different swing types (loop, drive, and chip) and during the trial runs it returned the ball with impressive accuracy across all three types: 88.4 percent, 89.2 percent, and 87.5 percent, respectively. Subsequent tweaks to theirrystem brought the robot's strike speed up to 19 meters per second (about 42 MPH), close to the 12 to 25 meters per second of advanced human players. The addition of control algorithms gave the robot the ability to aim. The robot still has limited mobility and reach because it has to be fixed to the ping-pong table but the MIT researchers plan to rig it to a gantry or wheeled platform in the future to address that shortcoming. Why orange cats are orange Cat lovers know orange cats are special for more than their unique coloring, but that's the quality that has intrigued scientists for almost a century. Sure, lots of animals have orange, ginger, or yellow hues, like tigers, orangutans, and golden retrievers. But in domestic cats that color is specifically linked to sex. Almost all orange cats are male. Scientists have now identified the genetic mutation responsible and it appears to be unique to cats, according to a paper published in the journal Current Biology. Prior work had narrowed down the region on the X chromosome most likely to contain the relevant mutation. The scientists knew that females usually have just one copy of the mutation and in that case have tortoiseshell (partially orange) coloring, although in rare cases, a female cat will be orange if both X chromosomes have the mutation. Over the last five to ten years, there has been an explosion in genome resources (including complete sequenced genomes) for cats which greatly aided the team's research, along with taking additional DNA samples from cats at spay and neuter clinics. From an initial pool of 51 candidate variants, the scientists narrowed it down to three genes, only one of which was likely to play any role in gene regulation: Arhgap36. It wasn't known to play any role in pigment cells in humans, mice, or non-orange cats. But orange cats are special; their mutation (sex-linked orange) turns on Arhgap36 expression in pigment cells (and only pigment cells), thereby interfering with the molecular pathway that controls coat color in other orange-shaded mammals. The scientists suggest that this is an example of how genes can acquire new functions, thereby enabling species to better adapt and evolve. DOI: Current Biology, 2025. 10.1016/j.cub.2025.03.075  (About DOIs). Not a Roman \"massacre\" after all Credit: Martin Smith In 1936, archaeologists excavating the Iron Age hill fort Maiden Castle in the UK unearthed dozens of human skeletons, all showing signs of lethal injuries to the head and upper body—likely inflicted with weaponry. At the time, this was interpreted as evidence of a pitched battle between the Britons of the local Durotriges tribe and invading Romans. The Romans slaughtered the native inhabitants, thereby bringing a sudden violent end to the Iron Age. At least that's the popular narrative that has prevailed ever since in countless popular articles, books, and documentaries. But a paper published in the Oxford Journal of Archaeology calls that narrative into question. Archaeologists at Bournemouth University have re-analyzed those burials, incorporating radiocarbon dating into their efforts. They concluded that those individuals didn't die in a single brutal battle. Rather, it was Britons killing other Britons over multiple generations between the first century BCE and the first century CE—most likely in periodic localized outbursts of violence in the lead-up to the Roman conquest of Britain. It's possible there are still many human remains waiting to be discovered at the site, which could shed further light on what happened at Maiden Castle. DOI: Oxford Journal of Archaeology, 2025. 10.1111/ojoa.12324  (About DOIs). Jennifer is a senior writer at Ars Technica with a particular focus on where science meets culture, covering everything from physics and related interdisciplinary topics to her favorite films and TV series. Jennifer lives in Baltimore with her spouse, physicist Sean M. Carroll, and their two cats, Ariel and Caliban. 8 Comments",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/pingpong1-1152x648-1748366739.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n            \u003carticle data-id=\"2096968\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \n\n      \n\n      \u003cp\u003e\n        Also: drumming chimpanzees, picking styles of two jazz greats, and an ancient underground city\u0026#39;s soundscape\n      \u003c/p\u003e\n\n      \n    \u003c/div\u003e\n\n    \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Time lapse photos show a new ping-pong-playing robot performing a top spin.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n           David Nguyen, Kendrick Cancio and Sangbae Kim\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n  \u003c/div\u003e\n\u003c/header\u003e\n\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \u003cp\u003eIt\u0026#39;s a regrettable reality that there is never time to cover all the interesting scientific stories we come across each month. In the past, we\u0026#39;ve featured year-end roundups of \u003ca href=\"https://arstechnica.com/science/2024/12/ten-cool-science-stories-we-almost-missed/\"\u003ecool science stories\u003c/a\u003e we (almost) missed. This year, we\u0026#39;re experimenting with a monthly collection. May\u0026#39;s list includes a nifty experiment to make a predicted effect of special relativity visible; a ping-pong playing robot that can return hits with 88 percent accuracy; and the discovery of the rare genetic mutation that makes orange cats orange, among other highlights.\u003c/p\u003e\n\u003ch2\u003eSpecial relativity made visible\u003c/h2\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"427\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Low-Res_TerrellPenrose-640x427.jpg\" alt=\"The Terrell-Penrose-Effect: Fast objects appear rotated\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Low-Res_TerrellPenrose-640x427.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Low-Res_TerrellPenrose.jpg 700w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\u003cspan\u003e\n          Credit:\n\n          \n          TU Wien\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003ePerhaps the most well-known feature of Albert Einstein\u0026#39;s special theory of relativity is time dilation and length contraction. In 1959, two physicists predicted another feature of relativistic motion: an object moving near the speed of light should also appear to be rotated. It\u0026#39;s not been possible to demonstrate this experimentally, however—until now. Physicists at the Vienna University of Technology figured out how to reproduce this rotational effect in the lab using laser pulses and precision cameras, according to \u003ca href=\"https://www.nature.com/articles/s42005-025-02003-6\"\u003ea paper\u003c/a\u003e published in the journal Communications Physics.\u003c/p\u003e\n\u003cp\u003eThey found their inspiration in art, specifically an earlier collaboration with an artist named Enar de Dios Rodriguez, who collaborated with VUT and the University of Vienna on a project involving ultra-fast photography and slow light. For this latest research, they used objects shaped like a cube and a sphere and moved them around the lab while zapping them with ultrashort laser pulses, recording the flashes with a high-speed camera.\u003c/p\u003e\n\u003cp\u003eGetting the timing just right effectively yields similar results to a light speed of 2 m/s. After photographing the objects many times using this method, the team then combined the still images into a single image. The results: the cube looked twisted and the sphere\u0026#39;s North Pole was in a different location—a demonstration of the rotational effect predicted back in 1959.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eDOI: Communications Physics, 2025. \u003ca href=\"http://dx.doi.org/10.1038/s42005-025-02003-6\"\u003e10.1038/s42005-025-02003-6\u003c/a\u003e  (\u003ca href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\"\u003eAbout DOIs\u003c/a\u003e).\u003c/p\u003e\n\u003ch2\u003eDrumming chimpanzees\u003c/h2\u003e\n\u003cfigure\u003e\n  \u003cp\u003e\n    \u003cvideo id=\"video-2096968-1\" width=\"960\" height=\"540\" preload=\"metadata\" controls=\"controls\"\u003e\u003csource type=\"video/mp4\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Chimpanzee-drumming-2-CREDIT-Current-Biology-Eleuteri-et-al.mp4?_=1\"/\u003eA chimpanzee feeling the rhythm. Credit: Current Biology/Eleuteri et al., 2025.\u003c/video\u003e\n  \u003c/p\u003e\n\n  \u003cfigcaption\u003e\n    \u003cspan\u003e\u003c/span\u003e\n    \u003cdiv\u003e\n    \n    \u003cp\u003e\n      A chimpanzee feeling the rhythm. Credit: Current Biology/Eleuteri et al., 2025.\n\n          \u003c/p\u003e\n  \u003c/div\u003e\n  \u003c/figcaption\u003e\n\u003c/figure\u003e\n\n\u003cp\u003eChimpanzees are known to \u0026#34;drum\u0026#34; on the roots of trees as a means of communication, often combining that action with what are known as \u0026#34;pant-hoot\u0026#34; vocalizations (see above video). Scientists have found that the chimps\u0026#39; drumming exhibits key elements of musical rhythm much like humans, according to  \u003ca href=\"https://www.cell.com/current-biology/fulltext/S0960-9822(25)00448-8\"\u003ea paper\u003c/a\u003e published in the journal Current Biology—specifically non-random timing and isochrony. And chimps from different geographical regions have different drumming rhythms.\u003c/p\u003e\n\u003cp\u003eBack in 2022, the same team observed that individual chimps had unique styles of \u0026#34;buttress drumming,\u0026#34; which served as a kind of communication, letting others in the same group know their identity, location, and activity. This time around they wanted to know if this was also true of chimps living in different groups and whether their drumming was rhythmic in nature. So they collected video footage of the drumming behavior among 11 chimpanzee communities across six populations in East Africa (Uganda) and West Africa (Ivory Coast), amounting to 371 drumming bouts.\u003c/p\u003e\n\u003cp\u003eTheir analysis of the drum patterns confirmed their hypothesis. The western chimps drummed in regularly spaced hits, used faster tempos, and started drumming earlier during their pant-hoot vocalizations. Eastern chimps would alternate between shorter and longer spaced hits. Since this kind of rhythmic percussion is one of the earliest evolved forms of human musical expression and is ubiquitous across cultures, findings such as this could shed light on how our love of rhythm evolved.\u003c/p\u003e\n\u003cp\u003eDOI: Current Biology, 2025. \u003ca href=\"http://dx.doi.org/10.1016/j.cub.2025.04.019\"\u003e10.1016/j.cub.2025.04.019\u003c/a\u003e  (\u003ca href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\"\u003eAbout DOIs\u003c/a\u003e).\u003c/p\u003e\n\u003ch2\u003eDistinctive styles of two jazz greats\u003c/h2\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"409\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Figure-1-1.jpg-640x409.webp\" alt=\"Wes Montgomery (left)) and Joe Pass (right) playing guitars\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Figure-1-1.jpg-640x409.webp 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Figure-1-1.jpg-1024x654.webp 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Figure-1-1.jpg-768x491.webp 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Figure-1-1.jpg-980x626.webp 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Figure-1-1.jpg.webp 1080w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eJazz lovers likely need no introduction to Joe Pass and Wes Montgomery, 20th century guitarists who influenced generations of jazz musicians with their innovative techniques. Montgomery, for instance, didn\u0026#39;t use a pick, preferring to pluck the strings with his thumb—a method he developed because he practiced at night after working all day as a machinist and didn\u0026#39;t want to wake his children or neighbors. Pass developed his own range of picking techniques, including fingerpicking, hybrid picking, and \u0026#34;flat picking.\u0026#34;\u003c/p\u003e\n\u003cp\u003eChirag Gokani and Preston Wilson, both with Applied Research Laboratories and the University of Texas, Austin, greatly admired both Pass and Montgomery and decided to explore the underlying the acoustics of their distinctive playing, modeling the interactions of the thumb, fingers, and pick with a guitar string. They \u003ca href=\"https://chiragokani.github.io/research/string/slides/index.html\"\u003edescribed\u003c/a\u003e their research during \u003ca href=\"https://acousticalsociety.org/new-orleans-2025/\"\u003ea meeting\u003c/a\u003e of the Acoustical Society of America in New Orleans, LA.\u003c/p\u003e\n\u003cp\u003eAmong their findings: Montgomery achieved his warm tone by playing closer to the bridge and mostly plucking at the string. Pass\u0026#39;s rich tone arose from a combination of using a pick and playing closer to the guitar neck. There were also differences in how much a thumb, finger, and pick slip off the string:  use of the thumb (Montgomery) produced more of a \u0026#34;pluck\u0026#34; compared to the pick (Pass), which produced more of a \u0026#34;strike.\u0026#34; Gokani and Wilson think their model could be used to synthesize digital guitars with a more realistic sound, as well as helping guitarists better emulate Pass and Montgomery.\u003c/p\u003e\n\u003ch2\u003eSounds of an ancient underground city\u003c/h2\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"366\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Low-Res_ASA-188_3aAAa7_underground-city_fig1.png-640x366.jpeg\" alt=\"A collection of images from the underground tunnels of Derinkuyu.\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Low-Res_ASA-188_3aAAa7_underground-city_fig1.png-640x366.jpeg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Low-Res_ASA-188_3aAAa7_underground-city_fig1.png.jpeg 700w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\u003cspan\u003e\n          Credit:\n\n          \n          Sezin Nas\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eTurkey is home to the underground city \u003ca href=\"https://en.wikipedia.org/wiki/Derinkuyu_underground_city\"\u003eDerinkuyu\u003c/a\u003e, originally carved out inside soft volcanic rock around the 8th century BCE. It was later expanded to include four main ventilation channels (and some 50,000 smaller shafts) serving seven levels, which could be closed off from the inside with a large rolling stone. The city could hold up to 20,000 people and it  was connected to another underground city, Kaymakli, via tunnels. Derinkuyu helped protect Arab Muslims during the Arab-Byzantine wars, served as a refuge from the Ottomans in the 14th century, and as a haven for Armenians escaping persecution in the early 20th century, among other functions.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThe tunnels were rediscovered in the 1960s and about half of the city has been open to visitors since 2016. The site is naturally of great archaeological interest, but there has been little to no research on the acoustics of the site, particularly the ventilation channels—one of Derinkuyu\u0026#39;s most unique features, according to Sezin Nas, an architectural acoustician at Istanbul Galata University in Turkey.  She gave \u003ca href=\"https://acoustics.org/re-creating-the-sounds-of-an-underground-city-asa188/\"\u003ea talk\u003c/a\u003e at \u003ca href=\"https://acousticalsociety.org/new-orleans-2025/\"\u003ea meeting\u003c/a\u003e of the Acoustical Society of America in New Orleans, LA, about her work on the site\u0026#39;s acoustic environment.\u003c/p\u003e\n\u003cp\u003eNas analyzed a church, a living area, and a kitchen, measuring sound sources and reverberation patterns, among other factors, to create a 3D virtual soundscape. The hope is that a better understanding of this aspect of Derinkuyu could improve the design of future underground urban spaces—as well as one day using her virtual soundscape to enable visitors to experience the sounds of the city themselves.\u003c/p\u003e\n\u003ch2\u003eMIT\u0026#39;s latest ping-pong robot\u003c/h2\u003e\n\u003cfigure\u003e\u003cp\u003e\u003ciframe allow=\"fullscreen\" loading=\"lazy\" src=\"https://www.youtube.com/embed/FqyKfi_myLM?start=0\u0026amp;wmode=transparent\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/figure\u003e\n\u003cp\u003eRobots playing ping-pong have been a thing since the 1980s, of particular interest to scientists because it requires the robot to combine the slow, precise ability to grasp and pick up objects with dynamic, adaptable locomotion. Such robots need high-speed machine vision, fast motors and actuators, precise control, and the ability to make accurate predictions in real time, not to mention being able to develop a game strategy. More recent designs use AI techniques to allow the robots to \u0026#34;learn\u0026#34; from prior data to improve their performance.\u003c/p\u003e\n\u003cp\u003eMIT researchers have built their own version of a ping-pong playing robot, incorporating a lightweight design and the ability to precisely return shots. They built on prior work developing the Humanoid, a small bipedal two-armed robot—specifically, modifying the Humanoid\u0026#39;s arm by adding an extra degree of freedom to the wrist so the robot could control a ping-pong paddle. They tested their robot by mounting it on a ping-pong table and lobbing 150 balls at it from the other side of the table, capturing the action with high-speed cameras.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThe new bot can execute three different swing types (loop, drive, and chip) and during the trial runs it returned the ball with impressive accuracy across all three types: 88.4 percent, 89.2 percent, and 87.5 percent, respectively. Subsequent tweaks to theirrystem brought the robot\u0026#39;s strike speed up to 19 meters per second (about 42 MPH), close to the 12 to 25 meters per second of advanced human players. The addition of control algorithms gave the robot the ability to aim. The robot still has limited mobility and reach because it has to be fixed to the ping-pong table but the MIT researchers plan to rig it to a gantry or wheeled platform in the future to address that shortcoming.\u003c/p\u003e\n\u003ch2\u003eWhy orange cats are orange\u003c/h2\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"432\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/orangecat-640x432.jpg\" alt=\"an orange tabby kitten\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/orangecat-640x432.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/orangecat-1024x691.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/orangecat-768x518.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/orangecat-980x662.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/orangecat.jpg 1200w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eCat lovers know orange cats are special for more than their unique coloring, but that\u0026#39;s the quality that has intrigued scientists for almost a century. Sure, lots of animals have orange, ginger, or yellow hues, like tigers, orangutans, and golden retrievers. But in domestic cats that color is specifically linked to sex. Almost all orange cats are male. Scientists have now identified the genetic mutation responsible and it appears to be unique to cats, according to \u003ca href=\"https://www.cell.com/current-biology/fulltext/S0960-9822(25)00391-4\"\u003ea paper\u003c/a\u003e published in the journal Current Biology.\u003c/p\u003e\n\u003cp\u003ePrior work had narrowed down the region on the X chromosome most likely to contain the relevant mutation. The scientists knew that females usually have just one copy of the mutation and in that case have tortoiseshell (partially orange) coloring, although in rare cases, a female cat will be orange if both X chromosomes have the mutation. Over the last five to ten years, there has been an explosion in genome resources (including complete sequenced genomes) for cats which greatly aided the team\u0026#39;s research, along with taking additional DNA samples from cats at spay and neuter clinics.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n\n        \n        \u003cdiv\u003e\n          \n          \n\u003cp\u003eFrom an initial pool of 51 candidate variants, the scientists narrowed it down to three genes, only one of which was likely to play any role in gene regulation: Arhgap36. It wasn\u0026#39;t known to play any role in pigment cells in humans, mice, or non-orange cats. But orange cats are special; their mutation (sex-linked orange) turns on Arhgap36 expression in pigment cells (and only pigment cells), thereby interfering with the molecular pathway that controls coat color in other orange-shaded mammals. The scientists suggest that this is an example of how genes can acquire new functions, thereby enabling species to better adapt and evolve.\u003c/p\u003e\n\u003cp\u003eDOI: Current Biology, 2025. \u003ca href=\"http://dx.doi.org/10.1016/j.cub.2025.03.075\"\u003e10.1016/j.cub.2025.03.075\u003c/a\u003e  (\u003ca href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\"\u003eAbout DOIs\u003c/a\u003e).\u003c/p\u003e\n\u003ch2\u003eNot a Roman \u0026#34;massacre\u0026#34; after all\u003c/h2\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"612\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Low-Res_MC-burials-press-release-1-640x612.jpg\" alt=\"Two of the skeletons excavated by Mortimer Wheeler in the 1930s, dating from the 1st century AD.\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Low-Res_MC-burials-press-release-1-640x612.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Low-Res_MC-burials-press-release-1.jpg 700w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\u003cspan\u003e\n          Credit:\n\n          \n          Martin Smith\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eIn 1936, archaeologists excavating the Iron Age hill fort Maiden Castle in the UK unearthed dozens of human skeletons, all showing signs of lethal injuries to the head and upper body—likely inflicted with weaponry. At the time, this was interpreted as evidence of a pitched battle between the Britons of the local Durotriges tribe and invading Romans. The Romans slaughtered the native inhabitants, thereby bringing a sudden violent end to the Iron Age. At least that\u0026#39;s the popular narrative that has prevailed ever since in countless popular articles, books, and documentaries.\u003c/p\u003e\n\u003cp\u003eBut \u003ca href=\"https://onlinelibrary.wiley.com/doi/10.1111/ojoa.12324\"\u003ea paper\u003c/a\u003e published in the Oxford Journal of Archaeology calls that narrative into question. Archaeologists at Bournemouth University have re-analyzed those burials, incorporating radiocarbon dating into their efforts. They concluded that those individuals didn\u0026#39;t die in a single brutal battle. Rather, it was Britons killing other Britons over multiple generations between the first century BCE and the first century CE—most likely in periodic localized outbursts of violence in the lead-up to the Roman conquest of Britain. It\u0026#39;s possible there are still many human remains waiting to be discovered at the site, which could shed further light on what happened at Maiden Castle.\u003c/p\u003e\n\u003cp\u003eDOI: Oxford Journal of Archaeology, 2025. \u003ca href=\"http://dx.doi.org/10.1111/ojoa.12324\"\u003e10.1111/ojoa.12324\u003c/a\u003e  (\u003ca href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\"\u003eAbout DOIs\u003c/a\u003e).\u003c/p\u003e\n\n\n\n          \n                  \u003c/div\u003e\n\n                  \n          \n\n\n\n\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n          \u003cp\u003e\u003ca href=\"https://arstechnica.com/author/jenniferouellette/\"\u003e\u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/08/arspic300.jpg\" alt=\"Photo of Jennifer Ouellette\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\n\n  \u003cdiv\u003e\n    \n\n    \u003cp\u003e\n      Jennifer is a senior writer at Ars Technica with a particular focus on where science meets culture, covering everything from physics and related interdisciplinary topics to her favorite films and TV series. Jennifer lives in Baltimore with her spouse, physicist Sean M. Carroll, and their two cats, Ariel and Caliban.\n    \u003c/p\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\n\n  \u003cp\u003e\n    \u003ca href=\"https://arstechnica.com/science/2025/05/research-roundup-ping-pong-bots-the-genetic-key-for-ginger-cats-and-more/#comments\" title=\"8 comments\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 80 80\"\u003e\u003cdefs\u003e\u003cclipPath id=\"bubble-zero_svg__a\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"bubble-zero_svg__b\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#bubble-zero_svg__a)\"\u003e\u003cg fill=\"currentColor\" clip-path=\"url(#bubble-zero_svg__b)\"\u003e\u003cpath d=\"M80 40c0 22.09-17.91 40-40 40S0 62.09 0 40 17.91 0 40 0s40 17.91 40 40\"\u003e\u003c/path\u003e\u003cpath d=\"M40 40 .59 76.58C-.67 77.84.22 80 2.01 80H40z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n    8 Comments\n  \u003c/a\u003e\n      \u003c/p\u003e\n              \u003c/div\u003e\n  \u003c/article\u003e\n\n\n  \n\n\n  \n\n\n  \u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003ca href=\"https://arstechnica.com/gadgets/2025/05/amazon-fire-sticks-enable-billions-of-dollars-worth-of-streaming-piracy/\"\u003e\n              \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Amazon-Fire-Stick-768x432-1748636678.jpg\" alt=\"Listing image for first story in Most Read: Amazon Fire Sticks enable “billions of dollars” worth of streaming piracy\" decoding=\"async\" loading=\"lazy\"/\u003e\n            \u003c/a\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n\n\n  \n\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-05-31T21:37:45Z",
  "modifiedTime": "2025-05-31T21:48:31Z"
}
