{
  "id": "b994a9c4-9f02-4b8e-acc5-88d888ad8659",
  "title": "Should Student Loans Borrowers in SAVE Switch to Another Repayment Plan? It's Complicated",
  "link": "https://www.cnet.com/personal-finance/loans/should-student-loans-borrowers-in-save-switch-to-another-repayment-plan-its-complicated/#ftag=CAD590a51e",
  "description": "The Department of Education is encouraging SAVE borrowers to move to the IBR plan, but you should review all your options first.",
  "author": "Courtney Johnston",
  "published": "Sat, 12 Jul 2025 23:37:10 +0000",
  "source": "https://www.cnet.com/rss/news/",
  "categories": null,
  "byline": "Courtney Johnston",
  "length": 8088,
  "excerpt": "The Department of Education is encouraging SAVE borrowers to move to the IBR plan, but you should review all your options first.",
  "siteName": "CNET",
  "favicon": "https://www.cnet.com/favicon-480.png",
  "text": "Interest will restart for SAVE borrowers whose loans remain in a general forbearance on August 1.  Viva Tung / CNETStarting Aug. 1, borrowers enrolled in the Saving on a Valuable Education plan will start accruing interest charges on their loan balances. The trouble is, their payments remain on hold in a general forbearance. Now they're being encouraged to choose a new payment plan or face interest charges.The Department of Education \"urges all borrowers in the SAVE plan to quickly transition to a legally compliant repayment plan -- such as the Income-Based Repayment Plan,\" Secretary of Education Linda McMahon said in a statement in early July.You aren't actually required to switch payment plans right now, though it might make sense in certain scenarios. Ultimately, what you should do depends on your forgiveness options and financial situation.\"It's crucial for borrowers to act based on their own personal situation,\" said Elaine Rubin, a student loan policy expert and director of corporate communications at Edvisors. \"A borrower who chooses to stay in the forbearance or who is waiting for their payment plan application to be processed will have their loan remain in good standing.\"SAVE borrowers have already been through unprecedented policy changes that have left many without a student loan payment for over five years. The SAVE repayment plan was officially shot down by the courts earlier this year, but borrowers' payments are expected to remain on hold until mid-2026 unless an upcoming court decision speeds up the timeline. If you're a borrower enrolled in SAVE and you're not sure what to do next, here's what experts suggest. What should PSLF borrowers enrolled in SAVE do?If you're working toward Public Service Loan Forgiveness and are enrolled in SAVE, you can either stay in forbearance or switch to another repayment plan. \"For borrowers pursuing PSLF this won't mean very much,\" said Betsy Mayotte, president and founder of the Institute of Student Loan Advisors. \"They can still either ride out the forbearance and plan on using what's called buy-back to get the months to count for PSLF purposes or switch plans now to another qualifying plan.\"If you decide to stay in forbearance, you'll be able to claim the months your loans were on hold using a process called PSLF buy-back. This allows you to pay for the months when your loans were in an administrative forbearance, to help you reach 120 on-time payments to receive forgiveness.If you decide to move your loans to another repayment plan, your payments will restart after your application is processed. Application processing is experiencing delays, and experts say not to expect your first payment under the new plan for a month or two, at the soonest.Although your payment may be higher on another income-driven repayment like IBR, this monthly amount would be the same amount you'd be charged when you went to \"buy back\" those months. Either way, you'll pay roughly the same amount.I'm pursuing income-driven repayment forgiveness. What should I do?Although you're not required to switch repayment plans by August, you should review your options to see what the best fit is for your financial situation.\"For those pursuing income-driven plan forgiveness they should strongly consider switching to another income-driven plan,\" said Mayotte. She noted that there's no buy-back option for IDR forgiveness, and the months that your loans are sitting in forgiveness won't count toward your total number of payments. Waiting would drag out your forgiveness timeline.You can look at your other income-driven repayment plan options using the Federal Student Aid loan simulator. When you're ready to switch to a new plan, you can apply to change your IDR on the FSA website.You can also continue to stay in SAVE until the forbearance period ends and you're placed on another repayment plan. You can pay the monthly interest that accrues, but those payments won't count towards forgiveness, Mayonette said.I don't qualify for forgiveness. Should I switch to another repayment plan?If you don't qualify for student loan forgiveness options, you can switch to another IDR or continue to wait out the forbearance. Either way, you should count on making payments again soon -- whether that's a new monthly payment or paying off the interest that accrues each month during the forbearance period.Since there are a few weeks left before interest charges start again, Mayonette suggests making larger lump sum payments while your interest is frozen, if you can. Will all borrowers on SAVE qualify for another IDR plan?SAVE borrowers should qualify for another income-driven repayment plan. However, it's possible you may not right now.\"The 'Big Beautiful Bill' has eliminated the requirement of a partial financial hardship for IBR,\" said Rubin. \"However, the forms and the Loan Simulator have yet to be updated. It may take the department and the servicers some time to update their systems and information.\"In the meantime, look for the most affordable repayment option available, or you can choose to keep your loans in forbearance.Will my payments increase if I move from SAVE to another income-driven repayment plan?Many borrowers should brace for higher monthly payments after moving to a new repayment plan. Although income-driven repayment plans are generally more affordable than the standard repayment plan, SAVE was the most affordable student loan repayment plan to date. Many low-income borrowers had $0 or near $0 payments each month. CNET estimated that a single borrower earning $60,000 a year with $30,000 in student loan debt would have paid approximately $217 on SAVE. Switching to another income-driven repayment plan like IBR could increase their monthly payment by nearly $100.You can use the Federal Student Aid Loan Simulator to estimate what your new monthly payment will look like.If I switch repayment plans, will my payments start in August?If you switch to IBR or another repayment plan, that doesn't mean your first monthly payment will hit in August.\"The US Department of Education still has a backlog in processing the forms to request a change of repayment plan, so they might not have to make payments for a few months until their request to switch repayment plans is processed,\" said Mark Kantrowitz, a financial aid and student loan expert.Still, it's smart to prepare for repayment right away, just in case.I can't afford higher student loan payments. What should I do?Many borrowers will see higher payments on another payment plan, even an income-driven repayment plan like IBR. If you need more time to prepare for repayment, you can also wait to switch repayment plans until the forbearance period ends.\"Borrowers will have the option to stay in the general forbearance, for now,\" said Rubin. \"However, borrowers who decide to stay in the forbearance need to stay informed. The Department has indicated that borrowers will remain in the forbearance until the legal challenges are resolved, or until the student loan servicer can send them a bill for the proper repayment amount.\"If you need more time to prepare for repayment, leaving your loans on hold can give you extra months to plan. During this time, you should consider making interest-payments, if possible, to prevent your account balance from rising.\"There are no prepayment penalties on federal and private student loans, so nothing stops you from making interest-only payments,\" said Kantrowitz. \"You can manually calculate the interest on your loans and make a prepayment in that amount each month.\"While the forbearance period won't last forever, it is currently expected to last until mid-2026. However, an upcoming court case could change that and end forbearance sooner.If you're facing financial distress, you might consider economic hardship deferment, unemployment deferment or general forbearance, said Kantrowitz. But he warned that interest may continue to accrue, which could dig you into a deeper hole. You can reach out to your servicer or review financial hardship options on the FSA website.",
  "image": "https://www.cnet.com/a/img/resize/40f91f1501dfe7dac1f823e963d19d3760b1c1fe/hub/2024/03/31/0542087b-4d30-41e2-ab6e-c62362925df6/fafsa-student-loan-purple.jpg?auto=webp\u0026fit=crop\u0026height=675\u0026width=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource media=\"(max-width: 767px)\" srcset=\"https://www.cnet.com/a/img/resize/bcebce3002b473f9cddd320d64a29368d13bddd2/hub/2024/03/31/0542087b-4d30-41e2-ab6e-c62362925df6/fafsa-student-loan-purple.jpg?auto=webp\u0026amp;fit=crop\u0026amp;height=236\u0026amp;width=420\" alt=\"Student desk on top of a stack of $100 bills\"/\u003e\u003csource media=\"(max-width: 1023px)\" srcset=\"https://www.cnet.com/a/img/resize/1b0eb73c638d21def49c4dc7f7cab2da4121ac9c/hub/2024/03/31/0542087b-4d30-41e2-ab6e-c62362925df6/fafsa-student-loan-purple.jpg?auto=webp\u0026amp;fit=crop\u0026amp;height=362\u0026amp;width=644\" alt=\"Student desk on top of a stack of $100 bills\"/\u003e\u003csource media=\"(max-width: 1440px)\" srcset=\"https://www.cnet.com/a/img/resize/40f91f1501dfe7dac1f823e963d19d3760b1c1fe/hub/2024/03/31/0542087b-4d30-41e2-ab6e-c62362925df6/fafsa-student-loan-purple.jpg?auto=webp\u0026amp;fit=crop\u0026amp;height=675\u0026amp;width=1200\" alt=\"Student desk on top of a stack of $100 bills\"/\u003e \u003cimg src=\"https://www.cnet.com/a/img/resize/40f91f1501dfe7dac1f823e963d19d3760b1c1fe/hub/2024/03/31/0542087b-4d30-41e2-ab6e-c62362925df6/fafsa-student-loan-purple.jpg?auto=webp\u0026amp;fit=crop\u0026amp;height=675\u0026amp;width=1200\" alt=\"Student desk on top of a stack of $100 bills\" height=\"675\" width=\"1200\"/\u003e\u003c/picture\u003e\u003c/div\u003e \u003cfigcaption\u003e\u003cspan\u003e\u003cp\u003eInterest will restart for SAVE borrowers whose loans remain in a general forbearance on August 1. \u003c/p\u003e\u003c/span\u003e \u003cspan\u003eViva Tung / CNET\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eStarting Aug. 1, borrowers enrolled in the \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/personal-finance/loans/student-loan-payments-paused-for-3-million-borrowers-future-save-relief-remains-in-limbo/\" rel=\"\"\u003e\u003cspan\u003eSaving on a Valuable Education plan\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e will start accruing interest charges on their loan balances. The trouble is, their payments remain on hold in a general forbearance. Now they\u0026#39;re being encouraged to choose a new payment plan or \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/personal-finance/loans/student-loan-update-heres-what-save-borrowers-should-do-by-august-1/\" rel=\"\"\u003e\u003cspan\u003eface interest charges\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e.\u003c/p\u003e\u003cp\u003eThe Department of Education \u0026#34;urges all borrowers in the \u003ca href=\"https://www.cnet.com/personal-finance/loans/if-youre-a-student-loan-borrower-enrolled-in-save-make-this-move-now-while-your-payments-remain-paused/\" target=\"_self\"\u003eSAVE plan\u003c/a\u003e to quickly transition to a legally compliant repayment plan -- such as the Income-Based Repayment Plan,\u0026#34; Secretary of Education Linda McMahon said in a statement in early July.\u003c/p\u003e\u003cp\u003eYou aren\u0026#39;t actually required to switch payment plans right now, though it might make sense in certain scenarios. Ultimately, what you should do depends on your forgiveness options and financial situation.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s crucial for borrowers to act based on their own personal situation,\u0026#34; said Elaine Rubin, a student loan policy expert and director of corporate communications at Edvisors. \u0026#34;A borrower who chooses to stay in the forbearance or who is waiting for their payment plan application to be processed will have their loan remain in good standing.\u0026#34;\u003c/p\u003e\u003cp\u003eSAVE borrowers have already been through unprecedented policy changes that have left many without a student loan payment for over five years. The SAVE repayment plan was \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/personal-finance/loans/student-loan-forgiveness-receives-another-blow-whats-next-for-save-borrowers/\" rel=\"\"\u003e\u003cspan\u003eofficially shot down\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e by the courts earlier this year, but borrowers\u0026#39; payments are expected to remain on hold until mid-2026 unless an upcoming court decision speeds up the timeline. \u003c/p\u003e\u003cp\u003eIf you\u0026#39;re a borrower enrolled in SAVE and you\u0026#39;re not sure what to do next, here\u0026#39;s what experts suggest. \u003c/p\u003e\u003ch2\u003eWhat should PSLF borrowers enrolled in SAVE do?\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re working toward \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/personal-finance/loans/more-student-loan-forgiveness-is-on-the-way-for-pslf-borrowers-whats-next-for-debt-relief/\" rel=\"\"\u003e\u003cspan\u003ePublic Service Loan Forgiveness\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e and are enrolled in SAVE, you can either stay in forbearance or\u003ca href=\"https://www.cnet.com/personal-finance/loans/student-loan-repayment-plans-will-last-as-long-as-most-mortgages-how-much-the-new-budget-bill-will-cost-you/\" target=\"_self\"\u003e switch to another repayment plan\u003c/a\u003e. \u003c/p\u003e\u003cp\u003e\u0026#34;For borrowers pursuing PSLF this won\u0026#39;t mean very much,\u0026#34; said Betsy Mayotte, president and founder of the Institute of Student Loan Advisors. \u0026#34;They can still either ride out the forbearance and plan on using what\u0026#39;s called buy-back to get the months to count for PSLF purposes or switch plans now to another qualifying plan.\u0026#34;\u003c/p\u003e\u003cp\u003eIf you decide to stay in forbearance, you\u0026#39;ll be able to claim the months your loans were on hold using a process called\u003ca href=\"https://www.cnet.com/personal-finance/loans/heres-how-to-get-student-loan-forgiveness-sooner-while-save-remains-on-hold/\" target=\"_self\"\u003e PSLF buy-back\u003c/a\u003e. This allows you to pay for the months when your loans were in an administrative forbearance, to help you reach 120 on-time payments to receive forgiveness.\u003c/p\u003e\u003cp\u003eIf you decide to move your loans to another repayment plan, your payments will restart after your application is processed. Application processing is experiencing delays, and experts say not to expect your first payment under the new plan for a month or two, at the soonest.\u003c/p\u003e\u003cp\u003eAlthough your\u003ca href=\"https://www.cnet.com/personal-finance/student-loan-payments-could-skyrocket-for-save-borrowers-heres-how-much-yours-could-rise/\" target=\"_self\"\u003e payment may be higher\u003c/a\u003e on another income-driven repayment like IBR, this monthly amount would be the same amount you\u0026#39;d be charged when you went to \u0026#34;buy back\u0026#34; those months. Either way, you\u0026#39;ll pay roughly the same amount.\u003c/p\u003e\u003ch2\u003eI\u0026#39;m pursuing income-driven repayment forgiveness. What should I do?\u003c/h2\u003e\u003cp\u003eAlthough you\u0026#39;re not required to switch repayment plans by August, you should review your options to see what the best fit is for your financial situation.\u003c/p\u003e\u003cp\u003e\u0026#34;For those pursuing income-driven plan forgiveness they should strongly consider switching to another income-driven plan,\u0026#34; said Mayotte. She noted that there\u0026#39;s no buy-back option for IDR forgiveness, and the months that your loans are sitting in forgiveness won\u0026#39;t count toward your total number of payments. Waiting would drag out your forgiveness timeline.\u003c/p\u003e\u003cp\u003eYou can look at your other income-driven repayment plan options using the\u003ca href=\"https://studentaid.gov/loan-simulator\" target=\"_self\"\u003e Federal Student Aid loan simulator\u003c/a\u003e. When you\u0026#39;re ready to switch to a new plan, you can\u003ca href=\"https://studentaid.gov/idr/\" target=\"_self\"\u003e apply to change your IDR\u003c/a\u003e on the FSA website.\u003c/p\u003e\u003cp\u003eYou can also continue to stay in SAVE until the forbearance period ends and you\u0026#39;re placed on another repayment plan. You can pay the monthly interest that accrues, but those payments won\u0026#39;t count towards forgiveness, Mayonette said.\u003c/p\u003e\u003ch2\u003eI don\u0026#39;t qualify for forgiveness. Should I switch to another repayment plan?\u003c/h2\u003e\u003cp\u003eIf you don\u0026#39;t qualify for \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/personal-finance/loans/whats-going-on-with-your-student-loans-an-expert-answers-your-top-payment-and-forgiveness-questions/\" rel=\"\"\u003e\u003cspan\u003estudent loan forgiveness options\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e, you can switch to another IDR or continue to wait out the forbearance. Either way, you should count on making payments again soon -- whether that\u0026#39;s a new monthly payment or paying off the interest that accrues each month during the forbearance period.\u003c/p\u003e\u003cp\u003eSince there are a few weeks left before interest charges start again, Mayonette suggests making larger lump sum payments while your interest is frozen, if you can. \u003c/p\u003e\u003ch2\u003eWill all borrowers on SAVE qualify for another IDR plan?\u003c/h2\u003e\u003cp\u003eSAVE borrowers should qualify for another income-driven repayment plan. However, it\u0026#39;s possible you may not right now.\u003c/p\u003e\u003cp\u003e\u0026#34;The \u0026#39;Big Beautiful Bill\u0026#39; has eliminated the requirement of a partial financial hardship for IBR,\u0026#34; said Rubin. \u0026#34;However, the forms and the Loan Simulator have yet to be updated. It may take the department and the servicers some time to update their systems and information.\u0026#34;\u003c/p\u003e\u003cp\u003eIn the meantime, look for the most affordable repayment option available, or you can choose to keep your loans in forbearance.\u003c/p\u003e\u003ch2\u003eWill my payments increase if I move from SAVE to another income-driven repayment plan?\u003c/h2\u003e\u003cp\u003eMany borrowers should brace for higher monthly payments after moving to a new repayment plan. Although income-driven repayment plans are generally more affordable than the standard repayment plan, SAVE was the most affordable student loan repayment plan to date. Many low-income borrowers had $0 or near $0 payments each month. \u003c/p\u003e\u003cp\u003eCNET estimated that a single borrower earning $60,000 a year with $30,000 in student loan debt would have paid approximately $217 on SAVE. Switching to another income-driven repayment plan like IBR could\u003ca href=\"https://www.cnet.com/personal-finance/loans/enrolled-in-save-heres-much-could-your-student-loan-payment-could-increase/\" target=\"_self\"\u003e increase their monthly payment\u003c/a\u003e by nearly $100.\u003c/p\u003e\u003cp\u003eYou can use the\u003ca href=\"https://studentaid.gov/loan-simulator\" target=\"_self\"\u003e Federal Student Aid Loan Simulator\u003c/a\u003e to estimate what your new monthly payment will look like.\u003c/p\u003e\u003ch2\u003eIf I switch repayment plans, will my payments start in August?\u003c/h2\u003e\u003cp\u003eIf you switch to IBR or another repayment plan, that doesn\u0026#39;t mean your first monthly payment will hit in August.\u003c/p\u003e\u003cp\u003e\u0026#34;The US Department of Education still has a backlog in processing the forms to request a change of repayment plan, so they might not have to make payments for a few months until their request to switch repayment plans is processed,\u0026#34; said Mark Kantrowitz, a financial aid and student loan expert.\u003c/p\u003e\u003cp\u003eStill, it\u0026#39;s smart to prepare for repayment right away, just in case.\u003c/p\u003e\u003ch2\u003eI can\u0026#39;t afford higher student loan payments. What should I do?\u003c/h2\u003e\u003cp\u003eMany borrowers will see higher payments on another payment plan, even an income-driven repayment plan like IBR. If you need more time to prepare for repayment, you can also wait to switch repayment plans until the forbearance period ends.\u003c/p\u003e\u003cp\u003e\u0026#34;Borrowers will have the option to stay in the general forbearance, for now,\u0026#34; said Rubin. \u0026#34;However, borrowers who decide to stay in the forbearance need to stay informed. The Department has indicated that borrowers will remain in the forbearance until the legal challenges are resolved, or until the student loan servicer can send them a bill for the proper repayment amount.\u0026#34;\u003c/p\u003e\u003cp\u003eIf you need more time to prepare for repayment, leaving your loans on hold can give you extra months to plan. During this time, you should consider making interest-payments, if possible, to prevent your account balance from rising.\u003c/p\u003e\u003cp\u003e\u0026#34;There are no prepayment penalties on federal and private student loans, so nothing stops you from making interest-only payments,\u0026#34; said Kantrowitz. \u0026#34;You can manually calculate the interest on your loans and make a prepayment in that amount each month.\u0026#34;\u003c/p\u003e\u003cp\u003eWhile the forbearance period won\u0026#39;t last forever, it is currently expected to last until mid-2026. However, an upcoming court case could change that and end forbearance sooner.\u003c/p\u003e\u003cp\u003eIf you\u0026#39;re facing financial distress, you might consider economic hardship deferment, unemployment deferment or general forbearance, said Kantrowitz. But he warned that interest may continue to accrue, which could dig you into a deeper hole. \u003c/p\u003e\u003cp\u003eYou can reach out to your servicer or\u003ca href=\"https://studentaid.gov/loan-simulator/hardship/wizard/your-situation/hardship-situation\" target=\"_self\"\u003e review financial hardship options\u003c/a\u003e on the FSA website. \u003c/p\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-07-12T23:37:10Z",
  "modifiedTime": null
}
