{
  "id": "c6662aa9-3010-48c9-9efe-c593e1b18437",
  "title": "‘Night at the Museum’ Franchise Gets Reboot at Disney 20 Years After the First Film",
  "link": "https://gizmodo.com/night-at-the-museum-franchise-gets-reboot-at-disney-20-years-after-the-first-film-2000627202",
  "description": "Maybe Disneyland's long-teased version of the concept will see the light of day as a spin-off.",
  "author": "Sabina Graves",
  "published": "Thu, 10 Jul 2025 00:50:05 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Movies",
    "Ben Stiller",
    "Night at the Museum",
    "Shawn Levy"
  ],
  "byline": "Sabina Graves",
  "length": 2301,
  "excerpt": "Maybe Disneyland's long-teased version of the concept will see the light of day as a spin-off.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Maybe Disneyland's long-teased version of the concept will see the light of day as a spin-off. The Night at the Museum film franchise is getting another go at 20th Century Studios under Disney to mine more historical hijinks. It’s been 20 years (a shocking number, yes) since the release of the first film starring Ben Stiller (Severance) as a museum night watch guard who goes on adventures when the exhibits come to life at night. The concept spawned several sequels, which featured stars like Robin Williams, Owen Wilson, Rami Malek, and Dan Stevens as legendary figures. Deadline reports that the reboot is being produced by 21 Laps’ Dan Levine and Shawn Levy (Deadpool \u0026 Wolverine), who helmed the previous iteration of the franchise. Writer Tripper Clancy (Die Hart) has been tapped as the reboot’s scribe. There’s no word yet if Levy will take the filmmaking reins again, but it was specified that the new movies will take place in a new museum with new characters. It would be fun to see Stiller possibly make a return as a director instead of a star. It’s interesting to note the Disney connection here; over the years while the franchise went on, Disney and Jon Favreau had Magic Kingdom, a similar concept, in the works with Disney Parks as the museum stand-in. It was floated that the ride characters would come to life after dark. But now with both universes in the Mouse House, perhaps the Disneyland version of the concept could become an official spin-off to this planned Night at the Museum reboot. Follow me here: the Imagineering arm of the parks industry, for example, has made historical figures into animatronics and will be adding one based on Walt Disney himself come Disneyland’s 70th birthday, right? So maybe this time around, instead of these figures coming to life because of pure magic, perhaps the figures in the museum exhibits might be animatronics-based. It would be really unhinged to go with that thread and make this some sci-fi fare. Then we’d really want Stiller to come back and direct. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/07/NightattheMuseum-1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n                  Maybe Disneyland\u0026#39;s long-teased version of the concept will see the light of day as a spin-off.\n                \u003c/p\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eThe \u003ca href=\"https://gizmodo.com/night-at-the-museum-3-trailer-is-a-bittersweet-bit-of-m-1657840916\"\u003e\u003cem\u003eNight at the Museum\u003c/em\u003e film franchise\u003c/a\u003e is getting another go at 20th Century Studios under Disney to mine more historical hijinks. It’s been 20 years (a shocking number, yes) since the release of the first film starring \u003ca href=\"https://gizmodo.com/report-ben-stiller-may-bring-the-twilight-zone-back-to-movies-2000612826\"\u003eBen Stiller\u003c/a\u003e \u003cem\u003e(Severance)\u003c/em\u003e as a museum night watch guard who goes on adventures when the exhibits come to life at night. The concept spawned several sequels, which featured stars like Robin Williams, Owen Wilson, Rami Malek, and Dan Stevens as legendary figures.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://deadline.com/2025/07/night-at-the-museum-new-movie-tripper-clancy-21-laps-20th-1236453014/\"\u003eDeadline reports\u003c/a\u003e that the reboot is being produced by 21 Laps’ Dan Levine and Shawn Levy (\u003cem\u003eDeadpool \u0026amp; Wolverine\u003c/em\u003e), who helmed the previous iteration of the franchise. Writer Tripper Clancy \u003cem\u003e(Die Hart)\u003c/em\u003e has been tapped as the reboot’s scribe. There’s no word yet if Levy will take the filmmaking reins again, but it was specified that the new movies will take place in a new museum with new characters. It would be fun to see Stiller possibly make a return as a director instead of a star.\u003c/p\u003e \u003cp\u003eIt’s interesting to note the Disney connection here; over the years while the franchise went on, Disney and Jon Favreau had \u003cem\u003e\u003ca href=\"https://gizmodo.com/disney-theme-park-rides-with-adaptation-plans-movies-tv-1851423666/5\"\u003eMagic Kingdom\u003c/a\u003e\u003c/em\u003e, a similar concept, in the works with Disney Parks as the museum stand-in. It was floated that the ride characters would come to life after dark. But now with both universes in the Mouse House, perhaps the Disneyland version of the concept could become an official spin-off to this planned \u003cem\u003eNight at the Museum \u003c/em\u003ereboot.\u003c/p\u003e\n\n \u003cp\u003eFollow me here: the Imagineering arm of the parks industry, for example, has made historical figures into animatronics and will be adding one based on Walt Disney himself come Disneyland’s 70th birthday, right? So maybe this time around, instead of these figures coming to life because of pure magic, perhaps the figures in the museum exhibits might be animatronics-based. It would be really unhinged to go with that thread and make this some sci-fi fare. Then we’d \u003cem\u003ereally\u003c/em\u003e want Stiller to come back and direct.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-10T00:50:05Z",
  "modifiedTime": "2025-07-10T00:50:05Z"
}
