{
  "id": "c6dea181-6dd2-4d32-907c-21b377dbf026",
  "title": "Here’s Why Microsoft Is Ditching Passwords for New Accounts",
  "link": "https://lifehacker.com/tech/microsoft-is-ditching-passwords-for-new-accounts?utm_medium=RSS",
  "description": "Passwords are disappearing for new sign-ups.",
  "author": "Emily Long",
  "published": "Mon, 05 May 2025 22:30:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Security"
  ],
  "byline": "Emily Long",
  "length": 2295,
  "excerpt": "Passwords are disappearing for new sign-ups.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "Microsoft is taking another big step toward eliminating passwords with a \"passwordless by default\" setting for new accounts. New users will be prompted to set up passkeys when creating their Microsoft logins, leaving passwords behind. The company has had passwordless sign-in options for Windows 11 and Microsoft accounts for several years, and in 2024 expanded passkey support across Windows, Android, and iOS. This is a big change, but not one without reason. In fact, it may make Microsoft accounts more secure, and render many scammers' phishing tactics obsolete. The benefits of passkeysPasskeys are not only easier to use than passwords combined with other forms of two-factor authentication (2FA) like SMS codes and authenticator apps—they're also more secure. Passkeys are cryptographically generated, stored on your device, and encrypted by default, making them immune to phishing and other cyberattacks. Without access to your device, bad actors can't hack your accounts. Instead of creating a complex password, which you then have to securely store (or remember), a device-based passkey allows you to quickly log into your accounts using biometrics like your face or fingerprint, or credentials like your PIN or password. Passkeys are the default on new Microsoft accountsGoing forward, new Microsoft accounts will be \"passwordless by default.\" When you sign up for the first time, you'll be asked to enter your email address and verify it with a one-time code—without any need to create and save a password. Once you enter the one-time code, you'll be prompted to add a passkey using your face, fingerprint, or PIN. The next time you log in, you'll do so with with your chosen passkey. What do you think so far? You can choose to skip passkey setup and return to it later (tap Skip for now on the pop-up). Microsoft will set the \"best available\" passwordless sign-in method for your account as the default, which could be a one-time code or an enabled passkey. Existing Microsoft users can manage passkeys and delete passwords in the Settings app under Accounts \u003e Passkeys. According to Microsoft's announcement detailing the change, the company aims to eventually remove password support completely.",
  "image": "https://lifehacker.com/imagery/articles/01JTGHX3Y7WCDQTFPPAPE4XG80/hero-image.fill.size_1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eMicrosoft is taking another big step toward eliminating passwords with a \u0026#34;passwordless by default\u0026#34; setting for new accounts. New users will be prompted to set up passkeys when creating their Microsoft logins, leaving passwords behind. \u003c/p\u003e\u003cp\u003eThe company has had passwordless sign-in options for Windows 11 and Microsoft accounts for several years, and in 2024 \u003ca href=\"https://lifehacker.com/tech/microsoft-accounts-passkeys-windows-11-android-apple\" target=\"_blank\"\u003eexpanded passkey support\u003c/a\u003e across Windows, Android, and iOS. This is a big change, but not one without reason. In fact, it may make Microsoft accounts more secure, and render many scammers\u0026#39; phishing tactics obsolete. \u003c/p\u003e\u003ch2 id=\"the-benefits-of-passkeys\"\u003eThe benefits of passkeys\u003c/h2\u003e\u003cp\u003ePasskeys are not only easier to use than passwords combined with other forms of two-factor authentication (2FA) like SMS codes and authenticator apps—\u003ca href=\"https://lifehacker.com/embrace-the-passwordless-future-of-passkeys-1850418024\" target=\"_blank\"\u003ethey\u0026#39;re also more secure\u003c/a\u003e. Passkeys are cryptographically generated, stored on your device, and encrypted by default, making them immune to phishing and other cyberattacks. Without access to your device, bad actors can\u0026#39;t hack your accounts. \u003c/p\u003e\u003cp\u003eInstead of creating a complex password, which you then have to securely store (or remember), a device-based passkey allows you to quickly log into your accounts using biometrics like your face or fingerprint, or credentials like your PIN or password. \u003c/p\u003e\u003ch2 id=\"passkeys-are-the-default-on-new-microsoft-accounts\"\u003ePasskeys are the default on new Microsoft accounts\u003c/h2\u003e\u003cp\u003eGoing forward, new Microsoft accounts will be \u0026#34;passwordless by default.\u0026#34; When you sign up for the first time, you\u0026#39;ll be asked to enter your email address and verify it with a one-time code—without any need to create and save a password. Once you enter the one-time code, you\u0026#39;ll be prompted to add a passkey using your face, fingerprint, or PIN. The next time you log in, you\u0026#39;ll do so with with your chosen passkey. \u003c/p\u003e\u003cdiv data-ga-click=\"\" data-ga-template=\"News\" data-ga-module=\"openweb_widget\" data-ga-element=\"openweb_scroll\" data-ga-item=\"openweb_scroll_midpage\" x-cloak=\"\" x-data=\"{ commentsCount: null, hasComments: false }\" x-init=\"commentsCount = await window.openweb.getMessagesCount(01JTGHX3Y7WCDQTFPPAPE4XG80);\n     hasComments = commentsCount !== null \u0026amp;\u0026amp; commentsCount \u0026gt; 0\"\u003e\n            \n\n            \u003cp\u003e\u003cspan\u003e\n                What do you think so far?\n                \n            \u003c/span\u003e\n        \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eYou can choose to skip passkey setup and return to it later (tap \u003cstrong\u003eSkip for now\u003c/strong\u003e on the pop-up). Microsoft will set the \u0026#34;best available\u0026#34; passwordless sign-in method for your account as the default, which could be a one-time code or an enabled passkey. \u003c/p\u003e\u003cp\u003eExisting Microsoft users \u003ca href=\"https://support.microsoft.com/en-us/windows/manage-your-passkeys-in-windows-6a70599a-25e1-4461-86be-d67d1023c69f\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ecan manage passkeys\u003c/a\u003e and delete passwords in the Settings app under \u003cstrong\u003eAccounts \u0026gt; Passkeys\u003c/strong\u003e. According to \u003ca href=\"https://www.microsoft.com/en-us/security/blog/2025/05/01/pushing-passkeys-forward-microsofts-latest-updates-for-simpler-safer-sign-ins/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eMicrosoft\u0026#39;s announcement detailing the change\u003c/a\u003e, the company aims to eventually remove password support completely. \u003c/p\u003e\n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-05T22:30:00Z",
  "modifiedTime": "2025-05-05T22:30:00Z"
}
