{
  "id": "cac30bfa-cd68-4371-8af9-2131cd86d261",
  "title": "Apple Just Added More Frost To Its Liquid Glass Design",
  "link": "https://apple.slashdot.org/story/25/07/07/2243248/apple-just-added-more-frost-to-its-liquid-glass-design?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "Following a week of X and YouTube complaints, Apple has further reduced the transparency of its Liquid Glass design in the latest iOS 26 developer beta, making navigation bars, buttons, and tabs more opaque to improve readability. The Verge reports: \"iOS 26 beta 3 completely nerfs Liquid Glass,\" AppleTrack developer Sam Kohl says in a post on X. \"It looks so much cheaper now and feels like Apple is backtracking on their original vision.\" Others ask Apple to \"stop ruining\" Liquid Glass and call the new design a \"step backwards.\" Some users in the beta found that the transparency level can vary depending on the app they're using. This is still just a developer beta, so it's likely that Apple will continue to make tweaks before it releases iOS 26 to the public in September. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2025-07-08T00:50:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "ios"
  ],
  "byline": "",
  "length": 784,
  "excerpt": "Following a week of X and YouTube complaints, Apple has further reduced the transparency of its Liquid Glass design in the latest iOS 26 developer beta, making navigation bars, buttons, and tabs more opaque to improve readability. The Verge reports: \"iOS 26 beta 3 completely nerfs Liquid Glass,\" Ap...",
  "siteName": "",
  "favicon": "",
  "text": "Following a week of X and YouTube complaints, Apple has further reduced the transparency of its Liquid Glass design in the latest iOS 26 developer beta, making navigation bars, buttons, and tabs more opaque to improve readability. The Verge reports: \"iOS 26 beta 3 completely nerfs Liquid Glass,\" AppleTrack developer Sam Kohl says in a post on X. \"It looks so much cheaper now and feels like Apple is backtracking on their original vision.\" Others ask Apple to \"stop ruining\" Liquid Glass and call the new design a \"step backwards.\" Some users in the beta found that the transparency level can vary depending on the app they're using. This is still just a developer beta, so it's likely that Apple will continue to make tweaks before it releases iOS 26 to the public in September.",
  "image": "https://a.fsdn.com/sd/topics/ios_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-178305668\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tFollowing a week of X and YouTube complaints, Apple has \u003ca href=\"https://www.theverge.com/news/700066/apple-liquid-glass-frosted-ios-26-developer-beta\"\u003efurther reduced the transparency of its Liquid Glass\u003c/a\u003e design in the latest iOS 26 developer beta, making navigation bars, buttons, and tabs more opaque to improve readability. The Verge reports: \u003ci\u003e \u0026#34;iOS 26 beta 3 completely nerfs Liquid Glass,\u0026#34; AppleTrack developer Sam Kohl says in \u003ca href=\"https://x.com/iupdate/status/1942299745105719795\"\u003ea post\u003c/a\u003e on X. \u0026#34;It looks so much cheaper now and feels like Apple is backtracking on their original vision.\u0026#34; Others \u003ca href=\"https://x.com/AnxiousHolly/status/1942303563255890123\"\u003eask Apple\u003c/a\u003e to \u0026#34;stop ruining\u0026#34; Liquid Glass and call the new design a \u0026#34;step backwards.\u0026#34; Some \u003ca href=\"https://x.com/AetherAurelia/status/1942309548271747553\"\u003eusers in\u003c/a\u003e the \u003ca href=\"https://x.com/zollotech/status/1942293509089771929\"\u003ebeta found\u003c/a\u003e that the transparency level can vary depending on the app they\u0026#39;re using.\n\u003cp\u003e \nThis is still just a developer beta, so it\u0026#39;s likely that Apple will continue to make tweaks before it releases iOS 26 to the public in September. \u003c/p\u003e\u003c/i\u003e\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
