{
  "id": "cbd3c9e6-dfd1-47ad-9503-60dd5157123c",
  "title": "Elon Musk targets OpenAI’s for-profit transition in a new filing",
  "link": "https://www.theverge.com/2024/11/30/24309697/elon-musk-openai-lawsuit-for-profit-transition-preliminary-injunction",
  "description": "",
  "author": "Wes Davis",
  "published": "2024-11-30T17:39:45-05:00",
  "source": "https://www.theverge.com/rss/index.xml",
  "categories": null,
  "byline": "Wes Davis",
  "length": 1668,
  "excerpt": "Elon Musk’s attorneys asked for a judge to stop OpenAI from becoming a for-profit entity, alleging that OpenAI has committed antitrust violations with Microsoft.",
  "siteName": "The Verge",
  "favicon": "https://www.theverge.com/icons/android_chrome_512x512.png",
  "text": "In a new motion filed late Friday in his lawsuit against OpenAI, Elon Musk’s attorneys have asked for a preliminary injunction to stop OpenAI from transitioning to a for-profit enterprise, reports TechCrunch. They also asked the judge to forbid the company from continuing alleged practices that they say violate US antitrust laws.Musk’s lawyers claim that because of CEO Sam Altman’s alleged self-dealing, OpenAI “will likely lack sufficient funds to pay damages” if Musk wins the suit. The motion follows reports of OpenAI’s intent to become a for-profit business and that it recently began early talks with regulators to move its structural change forward. As for antitrust claims, Musk’s lawyers allege that OpenAI and Microsoft “told investors not to fund their mutual competitors,” which they say violates the Sherman Act. And they claim that Musk “verified that at least one major investor” that had previously contributed to an xAI funding round has since “declined to invest in xAI.” They also allege that OpenAI benefits from “wrongfully obtained competitively sensitive information” gained through Microsoft connections they insist are effectively prohibited under the Clayton Act. The lawyers claim that “the very reason Microsoft obtained its board seat” — referring to Microsoft VP Dee Templeton’s time as a non-voting board member at OpenAI — “was to coordinate business decisions with OpenAI.” OpenAI spokeswoman Hannah Wong said in a statement emailed to The Verge:Elon’s fourth attempt, which again recycles the same baseless complaints, continues to be utterly without merit.Update November 30th: Added statement from OpenAI spokeswoman Hannah Wong.",
  "image": "https://cdn.vox-cdn.com/thumbor/HqGF1ArOYz6O0wbJa0_NQgCSVKg=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23906797/VRG_Illo_STK022_K_Radtke_Musk_Scales.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eIn a new motion filed late Friday in his lawsuit against OpenAI, Elon Musk’s attorneys have asked for a preliminary injunction to stop OpenAI from transitioning to a for-profit enterprise, \u003ca href=\"https://techcrunch.com/2024/11/30/elon-musk-files-for-injunction-to-halt-openais-transition-to-a-for-profit/?guccounter=2\"\u003ereports \u003cem\u003eTechCrunch\u003c/em\u003e\u003c/a\u003e. They also asked the judge to forbid the company from continuing alleged practices that they say violate US antitrust laws.\u003c/p\u003e\u003cp\u003eMusk’s lawyers claim that because of CEO Sam Altman’s alleged self-dealing, OpenAI “will likely lack sufficient funds to pay damages” if Musk wins the suit. The motion follows reports of OpenAI’s intent to become a for-profit business and that it recently \u003ca href=\"https://www.bloomberg.com/news/articles/2024-11-04/openai-in-talks-with-california-to-become-for-profit-company\"\u003ebegan early talks\u003c/a\u003e with regulators to move its structural change forward. \u003c/p\u003e\u003cp\u003eAs for antitrust claims, Musk’s lawyers allege that OpenAI and Microsoft “told investors not to fund their mutual competitors,” which they say violates the Sherman Act. And they claim that Musk “verified that at least one major investor” that had previously contributed to an xAI funding round has since “declined to invest in xAI.” \u003c/p\u003e\u003cp\u003eThey also allege that OpenAI benefits from “wrongfully obtained competitively sensitive information” gained through Microsoft connections they insist are effectively prohibited under the Clayton Act. The lawyers claim that “the very reason Microsoft obtained its board seat” — referring to Microsoft VP Dee Templeton’s \u003ca href=\"https://www.theverge.com/2024/1/5/24027245/microsofts-observer-has-reportedly-joined-the-openai-board\"\u003etime as a non-voting board member\u003c/a\u003e at OpenAI — “was to coordinate business decisions with OpenAI.” \u003c/p\u003e\u003cp\u003eOpenAI spokeswoman Hannah Wong said in a statement emailed to \u003cem\u003eThe Verge:\u003c/em\u003e\u003c/p\u003e\u003cdiv\u003e\u003cblockquote\u003e\u003cp\u003eElon’s fourth attempt, which again recycles the same baseless complaints, continues to be utterly without merit.\u003c/p\u003e\u003c/blockquote\u003e\u003c/div\u003e\u003cp\u003e\u003cem\u003e\u003cstrong\u003eUpdate November 30th: \u003c/strong\u003eAdded statement from OpenAI spokeswoman Hannah Wong.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-30T22:39:44.058Z",
  "modifiedTime": "2024-11-30T22:39:44.058Z"
}
