{
  "id": "cd7732b9-8059-4289-aa40-4f7b15294d60",
  "title": "Sierra made the games of my childhood. Are they still fun to play?",
  "link": "https://arstechnica.com/gaming/2025/05/sierra-made-the-games-of-my-childhood-are-they-still-fun-to-play/",
  "description": "Get ready for some nostalgia.",
  "author": "Nate Anderson",
  "published": "Sat, 17 May 2025 11:00:08 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Features",
    "Gaming",
    "Sierra On-Line",
    "space quest II"
  ],
  "byline": "Nate Anderson",
  "length": 10500,
  "excerpt": "Get ready for some nostalgia.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Get ready for some nostalgia. My Ars colleagues were kicking back at the Orbital HQ water cooler the other day, and—as gracefully aging gamers are wont to do—they began to reminisce about classic Sierra On-Line adventure games. I was a huge fan of these games in my youth, so I settled in for some hot buttered nostalgia. Would we remember the limited-palette joys of early King's Quest, Space Quest, or Quest for Glory titles? Would we branch out beyond games with \"Quest\" in their titles, seeking rarer fare like Freddy Pharkas: Frontier Pharmacist? What about the gothic stylings of The Colonel's Bequest or the voodoo-curious Gabriel Knight? Nope. The talk was of acorns. [Bleeping] acorns, in fact. The scene in question came from King's Quest III, where our hero Gwydion must acquire some exceptionally desiccated acorns to advance the plot. It sounds simple enough. As one walkthrough puts it, \"Go east one screen and north one screen to the acorn tree. Try picking up acorns until you get some dry ones. Try various spots underneath the tree.\" Easy! And clear! Except it wasn't either one because the game rather notoriously won't always give you the acorns, even when you enter the right command. This led many gamers to believe they were in the wrong spot, when in reality, they just had to keep entering the \"get acorns\" command while moving pixel by pixel around the tree until the game finally supplied them. One of our staffers admitted to having purchased the King's Quest III hint book solely because of this \"puzzle.\" (The hint book, which is now online, says that players should \"move around\" the particular oak tree in question because \"you can only find the right kind of acorns in one spot.\") This wasn't quite the \"fun\" I had remembered from these games, but as I cast my mind back, I dimly recalled similar situations. Space Quest II: Vohaul's Revenge had been my first Sierra title. After my brother and I spent weeks on the game only to die repeatedly in some pitch-dark tunnels, we implored my dad to call Sierra's 1-900 pay hint line. He thought about it. I could see it pained him because he had never before (and never since!) called a 1-900 number. In this case, the call cost a piratical 75 cents for the first minute and 50 cents for each additional minute. After listening to us whine for several days straight, my dad decided that his sanity was worth the fee, and he called. Like the acorn example above, we had known what to do—we had just not done it to the game's rather exacting standards. The key was to use a glowing gem as a light source, which my brother and I had long understood. The problem was the text parser, which demanded that we \"put gem in mouth\" to use the gem's light in the tunnels. There was no other place to put the gem, no other way to hold or attach it. (We tried them all.) No other attempt to use the light of this shining crystal, no matter how clear, well-intentioned, or succinctly expressed, would work. You put the gem in your mouth, or you died in the darkness. Returning from my reveries to the conversation at hand, I caught Ars Senior Editor Lee Hutchinson's cynical remark that these kinds of puzzles were \"the only way to make 2–3 hours of 'game' last for months.\" This seemed rather shocking, almost offensive. How could one say such a thing about the games that colored my memories of childhood? So I decided to replay Space Quest II for the first time in 35 years in an attempt to defend my own past. Big mistake. We're not on Endor anymore, Dorothy. Play it again, Sam In my memory, the Space Quest series was filled with sharply written humor, clever puzzles, and enchanting art. But when I fired up the original version of the game, I found that only one of these was true. The art, despite its blockiness and limited colors, remained charming. As for the gameplay, the puzzles were not so much \"clever\" as \"infuriating,\" \"obvious,\" or (more often) \"rather obscure.\" Finding the glowing gem discussed above requires you to swim into one small spot of a multi-screen river, with no indication in advance that anything of importance is in that exact location. Trying to \"call\" a hunter who has captured you does nothing… until you do it a second time. And the less said about trying to throw a puzzle at a Labian Terror Beast, typing out various word permutations while death bears down upon you, the better. The whole game was also filled with far more no-warning insta-deaths than I had remembered. On the opening screen, for instance, after your janitorial space-broom floats off into the cosmic ether, you can walk your character right off the edge of the orbital space station he is cleaning. The game doesn't stop you; indeed, it kills you and then mocks you for \"an obvious lack of common sense.\" It then calls you a \"wing nut\" with an \"inability to sustain life.\" Game over. The game's third screen, which features nothing more to do than simply walking around, will also kill you in at least two different ways. Walk into the room still wearing your spacesuit and your boss will come over and chew you out. Game over. If you manage to avoid that fate by changing into your indoor uniform first, it's comically easy to tap the wrong arrow key and fall off the room's completely guardrail-free elevator platform. Game over. Do NOT touch any part of this root monster. Get used to it because the game will kill you in so, so many ways: touching any single pixel of a root monster whose branches form a difficult maze; walking into a giant mushroom; stepping over an invisible pit in the ground; getting shot by a guard who zips in on a hovercraft; drowning in an underwater tunnel; getting swiped at by some kind of giant ape; not putting the glowing gem in your mouth; falling into acid; and many more. I used the word \"insta-death\" above, but the game is not even content with this. At one key point late in the game, a giant Aliens-style alien stalks the hallways, and if she finds you, she \"kisses\" you. But then she leaves! You are safe after all! Of course, if you have seen the films, you will recognize that you are not safe, but the game lets you go on for a bit before the alien's baby inevitably bursts from your chest, killing you. Game over. This is why the official hint book suggests that you \"save your game a lot, especially when it seems that you're entering a dangerous area. That way, if you die, you don't have to retrace your steps much.\" Presumably, this was once considered entertaining. When it comes to the humor, most of it is broad. (When you are told to \"say the word,\" you have to say \"the word.\") Sometimes it is condescending. (\"You quickly glance around the room to see if anyone saw you blow it.\") Or it might just be potty jokes. (Plungers, jock straps, toilet paper, alien bathrooms, and fouling one's trousers all make appearances.) My total gameplay time: a few hours. \"By Grabthar's hammer!\" I thought. \"Lee was right!\" When I admitted this to him, Lee told me that he had actually spent time learning to speedrun the Space Quest games during the pandemic. \"According to my notes, a clean run of SQ2 in 'fast' mode—assuming good typing skills—takes about 20 minutes straight-up,\" he said. Yikes. What a fiendish plot! And yet The past was a different time. Computer memory was small, graphics capabilities were low, and computer games had emerged from the \"let them live just long enough to encourage spending another quarter\" arcade model. Mouse adoption took a while; text parsers made sense even though they created plenty of frustration. So yes—some of these games were a few hours of gameplay stretched out with insta-death, obscure puzzles, and the sheer amount of time it took just to walk across the game's various screens. (Seriously, \"walking around\" took a ridiculous amount of the game's playtime, especially when a puzzle made you backtrack three screens, type some command, and then return.) Let's get off this rock. Judged by current standards, the Sierra games are no longer what I would play for fun. All the same, I loved them. They introduced me to the joy of exploring virtual worlds and to the power of evocative artwork. I went into space, into fairy tales, and into the past, and I did so while finding the games' humor humorous and their plotlines compelling. (\"An army of life insurance salesmen?\" I thought at the time. \"Hilarious and brilliant!\") If the games can feel a bit arbitrary or vexing today, my child-self's love of repetition was able to treat them as engaging challenges rather than \"unfair\" design. Replaying Space Quest II, encountering the half-remembered jokes and visual designs, brought back these memories. The novelist Thomas Wolfe knew that you can't go home again, and it was probably inevitable that the game would feel dated to me now. But playing it again did take me back to that time before the Internet, when not even hint lines, insta-death, and EGA graphics could dampen the wonder of the new worlds computers were capable of showing us. Literal bathroom humor. Space Quest II, along with several other Sierra titles, is freely and legally available online at sarien.net—though I found many, many glitches in the implementation. Windows users can buy the entire Space Quest collection through Steam or Good Old Games. There's even a fan remake that runs on macOS, Windows, and Linux. 194 Comments",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/xenon-1152x648-1747426345.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n            \u003carticle data-id=\"2095614\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n      \n\n      \n\n      \u003cp\u003e\n        Get ready for some nostalgia.\n      \u003c/p\u003e\n\n      \n    \u003c/div\u003e\n\u003c/header\u003e\n\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \n\u003cp\u003eMy Ars colleagues were kicking back at the Orbital HQ water cooler the other day, and—as gracefully aging gamers are wont to do—they began to reminisce about classic \u003ca href=\"https://en.wikipedia.org/wiki/Sierra_Entertainment\"\u003eSierra On-Line adventure games\u003c/a\u003e. I was a huge fan of these games in my youth, so I settled in for some hot buttered nostalgia.\u003c/p\u003e\n\u003cp\u003eWould we remember the limited-palette joys of early King\u0026#39;s Quest, Space Quest, or Quest for Glory titles? Would we branch out beyond games with \u0026#34;Quest\u0026#34; in their titles, seeking rarer fare like\u003cem\u003e \u003ca href=\"https://en.wikipedia.org/wiki/Freddy_Pharkas:_Frontier_Pharmacist\"\u003eFreddy Pharkas: Frontier Pharmacist\u003c/a\u003e\u003c/em\u003e? What about the gothic stylings of \u003cem\u003e\u003ca href=\"https://en.wikipedia.org/wiki/The_Colonel%27s_Bequest\"\u003eThe Colonel\u0026#39;s Bequest\u003c/a\u003e\u003c/em\u003e or the voodoo-curious \u003ca href=\"https://en.wikipedia.org/wiki/Gabriel_Knight:_Sins_of_the_Fathers\"\u003e\u003cem\u003eGabriel Knight\u003c/em\u003e\u003c/a\u003e?\u003c/p\u003e\n\u003cp\u003eNope. The talk was of acorns. [Bleeping] acorns, in fact.\u003c/p\u003e\n\u003cp\u003eThe scene in question came from \u003cem\u003eKing\u0026#39;s Quest III\u003c/em\u003e, where our hero Gwydion must acquire some exceptionally desiccated acorns to advance the plot. It sounds simple enough. As one \u003ca href=\"http://www.sierraplanet.net/kqgames/kings-quest-iii/kq3-walkthrough/\"\u003ewalkthrough\u003c/a\u003e puts it, \u0026#34;Go east one screen and north one screen to the acorn tree. Try picking up acorns until you get some dry ones. Try various spots underneath the tree.\u0026#34; Easy! And clear!\u003c/p\u003e\n\u003cp\u003eExcept it wasn\u0026#39;t either one because the game rather notoriously won\u0026#39;t always give you the acorns, even when you enter the right command. This led many gamers to believe they were in the wrong spot, when in reality, \u003cem\u003ethey just had to keep entering the \u0026#34;get acorns\u0026#34; command\u003c/em\u003e while moving pixel by pixel around the tree until the game finally supplied them. One of our staffers admitted to having purchased the \u003cem\u003eKing\u0026#39;s Quest III\u003c/em\u003e hint book solely because of this \u0026#34;puzzle.\u0026#34; (The hint book, which is now online, says that players should \u0026#34;move around\u0026#34; the particular oak tree in question because \u0026#34;you can only find the right kind of acorns in one spot.\u0026#34;)\u003c/p\u003e\n\u003cp\u003eThis wasn\u0026#39;t quite the \u0026#34;fun\u0026#34; I had remembered from these games, but as I cast my mind back, I dimly recalled similar situations. \u003cem\u003eSpace Quest II: Vohaul\u0026#39;s Revenge\u003c/em\u003e had been my first Sierra title. After my brother and I spent weeks on the game only to die repeatedly in some pitch-dark tunnels, we implored my dad to call Sierra\u0026#39;s 1-900 pay hint line. He thought about it. I could see it pained him because he had never before (and never since!) called a 1-900 number. In this case, the call cost a piratical 75 cents for the first minute and 50 cents for each additional minute. After listening to us whine for several days straight, my dad decided that his sanity was worth the fee, and he called.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eLike the acorn example above, we had known what to do—we had just not done it to the game\u0026#39;s rather exacting standards. The key was to use a glowing gem as a light source, which my brother and I had long understood. The problem was the text parser, which demanded that we \u0026#34;put gem in mouth\u0026#34; to use the gem\u0026#39;s light in the tunnels. There was no other place to put the gem, no other way to hold or attach it. (We tried them all.) No other attempt to use the light of this shining crystal, no matter how clear, well-intentioned, or succinctly expressed, would work. You put the gem in your mouth, or you died in the darkness.\u003c/p\u003e\n\u003cp\u003eReturning from my reveries to the conversation at hand, I caught Ars Senior Editor Lee Hutchinson\u0026#39;s cynical remark that these kinds of puzzles were \u0026#34;the only way to make 2–3 hours of \u0026#39;game\u0026#39; last for months.\u0026#34; This seemed rather shocking, almost offensive. How could one say such a thing about the games that colored my memories of childhood?\u003c/p\u003e\n\u003cp\u003eSo I decided to replay \u003cem\u003eSpace Quest II\u003c/em\u003e for the first time in 35 years in an attempt to defend my own past.\u003c/p\u003e\n\u003cp\u003eBig mistake.\u003c/p\u003e\n\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"406\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/shuttle3-640x406.jpg\" alt=\"Space Quest II screenshot.\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/shuttle3-640x406.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/shuttle3-1024x649.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/shuttle3-768x487.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/shuttle3-980x621.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/shuttle3.jpg 1294w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      We\u0026#39;re not on Endor anymore, Dorothy.\n\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003ch2\u003ePlay it again, Sam\u003c/h2\u003e\n\u003cp\u003eIn my memory, the Space Quest series was filled with sharply written humor, clever puzzles, and enchanting art. But when I fired up the original version of the game, I found that only one of these was true. The art, despite its blockiness and limited colors, remained charming.\u003c/p\u003e\n\u003cp\u003eAs for the gameplay, the puzzles were not so much \u0026#34;clever\u0026#34; as \u0026#34;infuriating,\u0026#34; \u0026#34;obvious,\u0026#34; or (more often) \u0026#34;rather obscure.\u0026#34;\u003c/p\u003e\n\u003cp\u003eFinding the glowing gem discussed above requires you to swim into one small spot of a multi-screen river, with no indication in advance that anything of importance is in that exact location. Trying to \u0026#34;call\u0026#34; a hunter who has captured you does nothing… until you do it a second time. And the less said about trying to throw a puzzle at a Labian Terror Beast, typing out various word permutations while death bears down upon you, the better.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThe whole game was also filled with far more no-warning insta-deaths than I had remembered. On the opening screen, for instance, after your janitorial space-broom floats off into the cosmic ether, you can walk your character right off the edge of the orbital space station he is cleaning. The game doesn\u0026#39;t stop you; indeed, it kills you and then mocks you for \u0026#34;an obvious lack of common sense.\u0026#34; It then calls you a \u0026#34;wing nut\u0026#34; with an \u0026#34;inability to sustain life.\u0026#34; Game over.\u003c/p\u003e\n\u003cp\u003eThe game\u0026#39;s third screen, which features nothing more to do than simply walking around, will also kill you in at least two different ways. Walk into the room still wearing your spacesuit and your boss will come over and chew you out. Game over.\u003c/p\u003e\n\u003cp\u003eIf you manage to avoid that fate by changing into your indoor uniform first, it\u0026#39;s comically easy to tap the wrong arrow key and fall off the room\u0026#39;s completely guardrail-free elevator platform. Game over.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"400\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Untitled-4-640x400.jpg\" alt=\"Space Quest II screenshot.\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Untitled-4-640x400.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Untitled-4-1024x641.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Untitled-4-768x481.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Untitled-4-980x613.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Untitled-4.jpg 1288w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Do NOT touch any part of this root monster.\n\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eGet used to it because the game will kill you in so, so many ways: touching any single pixel of a root monster whose branches form a difficult maze; walking into a giant mushroom; stepping over an invisible pit in the ground; getting shot by a guard who zips in on a hovercraft; drowning in an underwater tunnel; getting swiped at by some kind of giant ape; not putting the glowing gem in your mouth; falling into acid; and many more.\u003c/p\u003e\n\u003cp\u003eI used the word \u0026#34;insta-death\u0026#34; above, but the game is not even content with this. At one key point late in the game, a giant \u003cem\u003eAliens\u003c/em\u003e-style alien stalks the hallways, and if she finds you, she \u0026#34;kisses\u0026#34; you. But then she leaves! You are safe after all! Of course, if you have seen the films, you will recognize that you are \u003cem\u003enot\u003c/em\u003e safe, but the game lets you go on for a bit before the alien\u0026#39;s baby inevitably bursts from your chest, killing you. Game over.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThis is why the \u003ca href=\"https://www.spacequest.net/sq2/hintbook/\"\u003eofficial hint book\u003c/a\u003e suggests that you \u0026#34;save your game a lot, especially when it seems that you\u0026#39;re entering a dangerous area. That way, if you die, you don\u0026#39;t have to retrace your steps much.\u0026#34; Presumably, this was once considered entertaining.\u003c/p\u003e\n\u003cp\u003eWhen it comes to the humor, most of it is broad. (When you are told to \u0026#34;say the word,\u0026#34; you have to say \u0026#34;the word.\u0026#34;) Sometimes it is condescending. (\u0026#34;You quickly glance around the room to see if anyone saw you blow it.\u0026#34;) Or it might just be potty jokes. (Plungers, jock straps, toilet paper, alien bathrooms, and fouling one\u0026#39;s trousers all make appearances.)\u003c/p\u003e\n\u003cp\u003eMy total gameplay time: a few hours.\u003c/p\u003e\n\u003cp\u003e\u0026#34;By \u003ca href=\"https://frakipedia.fandom.com/wiki/Grabthar%27s_Hammer\"\u003eGrabthar\u0026#39;s hammer\u003c/a\u003e!\u0026#34; I thought. \u0026#34;Lee was right!\u0026#34;\u003c/p\u003e\n\n\u003cp\u003eWhen I admitted this to him, Lee told me that he had actually spent time learning to speedrun the Space Quest games during the pandemic. \u0026#34;According to my notes, a clean run of SQ2 in \u0026#39;fast\u0026#39; mode—assuming good typing skills—takes about 20 minutes straight-up,\u0026#34; he said. Yikes.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"358\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/vohaul-640x358.jpg\" alt=\"Space Quest II screenshot.\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/vohaul-640x358.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/vohaul-1024x573.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/vohaul-768x430.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/vohaul-384x216.jpg 384w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/vohaul-980x548.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/vohaul.jpg 1248w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      What a fiendish plot!\n\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003ch2\u003eAnd yet\u003c/h2\u003e\n\u003cp\u003eThe past was a different time. Computer memory was small, graphics capabilities were low, and computer games had emerged from the \u0026#34;let them live just long enough to encourage spending another quarter\u0026#34; arcade model. Mouse adoption took a while; text parsers made sense even though they created plenty of frustration. So yes—some of these games were a few hours of gameplay stretched out with insta-death, obscure puzzles, and the sheer amount of time it took just to walk across the game\u0026#39;s various screens. (Seriously, \u0026#34;walking around\u0026#34; took a ridiculous amount of the game\u0026#39;s playtime, especially when a puzzle made you backtrack three screens, type some command, and then return.)\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n\n        \n        \u003cdiv\u003e\n          \n          \n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"398\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/shuttle2-640x398.jpg\" alt=\"Space Quest II screenshot.\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/shuttle2-640x398.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/shuttle2-1024x636.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/shuttle2-768x477.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/shuttle2-980x609.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/shuttle2.jpg 1284w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Let\u0026#39;s get off this rock.\n\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eJudged by current standards, the Sierra games are no longer what I would play for fun.\u003c/p\u003e\n\u003cp\u003eAll the same, I loved them. They introduced me to the joy of exploring virtual worlds and to the power of evocative artwork. I went into space, into fairy tales, and into the past, and I did so while finding the games\u0026#39; humor humorous and their plotlines compelling. (\u0026#34;An army of life insurance salesmen?\u0026#34; I thought at the time. \u0026#34;Hilarious and brilliant!\u0026#34;)\u003c/p\u003e\n\u003cp\u003eIf the games can feel a bit arbitrary or vexing today, my child-self\u0026#39;s love of repetition was able to treat them as engaging challenges rather than \u0026#34;unfair\u0026#34; design.\u003c/p\u003e\n\u003cp\u003eReplaying \u003cem\u003eSpace Quest II\u003c/em\u003e, encountering the half-remembered jokes and visual designs, brought back these memories. The novelist Thomas Wolfe knew that \u003ca href=\"https://en.wikipedia.org/wiki/You_Can\u0026#39;t_Go_Home_Again\"\u003eyou can\u0026#39;t go home again\u003c/a\u003e, and it was probably inevitable that the game would feel dated to me now. But playing it again did take me back to that time before the Internet, when not even hint lines, insta-death, and EGA graphics could dampen the wonder of the new worlds computers were capable of showing us.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"397\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/toilet-640x397.jpg\" alt=\"Space Quest II screenshot.\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/toilet-640x397.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/toilet-1024x635.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/toilet-768x476.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/toilet-980x608.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/toilet.jpg 1280w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Literal bathroom humor.\n\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003e\u003cem\u003eSpace Quest II, along with several other Sierra titles, is freely and legally available online at \u003ca href=\"http://sarien.net/spacequest2\"\u003esarien.net\u003c/a\u003e—though I found many, many glitches in the implementation. Windows users can buy the entire Space Quest collection through \u003ca href=\"https://store.steampowered.com/app/10110/Space_Quest_Collection/\"\u003eSteam\u003c/a\u003e or \u003ca href=\"https://www.gog.com/en/game/space_quest_1_2_3\"\u003eGood Old Games\u003c/a\u003e. There\u0026#39;s even a \u003ca href=\"https://infamousadventures.itch.io/space-quest-ii-vga-remake\"\u003efan remake\u003c/a\u003e that runs on macOS, Windows, and Linux.\u003c/em\u003e\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\n\n                  \n          \n\n\n\n\n\n\n  \u003cdiv\u003e\n          \u003cp\u003e\u003ca href=\"https://arstechnica.com/author/nate-anderson/\"\u003e\u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2016/05/n.anderson-17.jpg\" alt=\"Photo of Nate Anderson\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\n\n\n  \u003cp\u003e\n    \u003ca href=\"https://arstechnica.com/gaming/2025/05/sierra-made-the-games-of-my-childhood-are-they-still-fun-to-play/#comments\" title=\"194 comments\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 80 80\"\u003e\u003cdefs\u003e\u003cclipPath id=\"bubble-zero_svg__a\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"bubble-zero_svg__b\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#bubble-zero_svg__a)\"\u003e\u003cg fill=\"currentColor\" clip-path=\"url(#bubble-zero_svg__b)\"\u003e\u003cpath d=\"M80 40c0 22.09-17.91 40-40 40S0 62.09 0 40 17.91 0 40 0s40 17.91 40 40\"\u003e\u003c/path\u003e\u003cpath d=\"M40 40 .59 76.58C-.67 77.84.22 80 2.01 80H40z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n    194 Comments\n  \u003c/a\u003e\n      \u003c/p\u003e\n              \u003c/div\u003e\n  \u003c/article\u003e\n\n\n  \n\n\n  \n\n\n  \u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003ca href=\"https://arstechnica.com/gaming/2025/05/sierra-made-the-games-of-my-childhood-are-they-still-fun-to-play/\"\u003e\n              \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/xenon-768x432-1747426345.jpg\" alt=\"Listing image for first story in Most Read: Sierra made the games of my childhood. Are they still fun to play?\" decoding=\"async\" loading=\"lazy\"/\u003e\n            \u003c/a\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n\n\n  \n\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2025-05-17T11:00:08Z",
  "modifiedTime": "2025-05-17T15:34:36Z"
}
