{
  "id": "cd8b900f-fbe1-44f9-83e6-eaf650b61381",
  "title": "Telegram Has a New Verification Strategy to Cut Down on Scams",
  "link": "https://lifehacker.com/tech/telegram-has-a-new-verification-strategy-to-cut-down-on-scams",
  "description": "Make sure a chat is verified before believing what you read.",
  "author": "Jake Peterson",
  "published": "Thu, 02 Jan 2025 22:30:29 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Mobile Apps"
  ],
  "byline": "Jake Peterson",
  "length": 7874,
  "excerpt": "Make sure a chat is verified before believing what you read.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "Make sure a chat is verified before believing what you read. Credit: Image courtesy of Telegram Misinformation and scams are an unfortunate reality of the internet in 2024. That \"news\" account might really be pushing falsehoods and lies, while that outreach from \"Google\" likely isn't from the company at all. You really need to be on guard at all times when processing the information that passes through your social feeds, which is why it helps when apps and platforms take action to protect users from untrustworthy sources.Telegram has a new verification systemThat seems to be the motivation behind recent updates from Telegram. The messaging platform has an existing verification system built into the service, where companies and public figures can register themselves with Telegram and receive a blue badge of honor. That way, when you see content from a notable person or an organization, you can rest assured those words being share are actually from that source. Many platforms (but not all) offer this type of service, of course. Even Google is thinking about rolling out badges for search.But Telegram has a new addition to how it conducts verification: Once an organization is verified, it can then apply to become a \"third-party verifier,\" which lets them verify other accounts and chats it deems official, too. These verification badges will differ from the blue checkmarks, and will instead look like blue emojis or icons. Any account or chat verified in this way will have a banner in its profile that explains which third party verified it and why. I'm all for this type of verification process, and hope it catches on. It puts trust in accounts that already have proven their authority to Telegram, and, over time, will help users quickly parse which accounts and chats are legit, and which might be best to avoid. In the future, you might see a post from an account or chat, and since it doesn't have that badge, think twice about the message it's trying to get out.Other new Telegram features Credit: Telegram In addition to third-party verification, Telegram announced a series of other features and changes coming to the platform:Message search filters: When searching, you'll now see an option in the \"Chats\" tab to sort your messages by \"All Chats,\" \"Private Chats,\" \"Group Chats,\" or \"Channels,\" to help you find the messages you're looking for. Folder names gets custom emojis: If you subscribe to Premium, you can add custom emoji to the names of your chat folders. You can even replace the text that would normally appear here with whatever emoji you want.In-app QR code scanner: When using the in-app camera on either iOS or Android, you'll also be able to scan QR codes.Collectible gifts: Telegram \"gifts\" are small tokens of artwork you can share with friends and display on your profile. Now, you can upgrade a gift to make it a \"collectible.\" This will add a new look made by a Telegram artist, as well as a unique background, icon, and number. You can share collectibles with other users, or, if you're so inclined, auction it as an NFT. Right now, 20 gifts can be upgraded to collectibles, with over 1,400 unique appearances. Service message reactions: Service messages are those alerts you get whenever someone joins a group, begins a video call, or sends you a gift. Telegram now lets you react to these alerts, which adds a fun layer to these previously informative-only messages. Jake Peterson Senior Technology Editor Jake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film \u0026 TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut. Read Jake's full bio Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better. Our Mission Our Team Newsletter © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED. Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.",
  "image": "https://lifehacker.com/imagery/articles/01JGMBH1H7N3R6YHGBK43A2EB3/hero-image.fill.size_1200x675.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n                            \u003cdiv data-ga-module=\"content-header\" aria-label=\"Content Header\"\u003e\n        \n        \n                    \u003cp\u003eMake sure a chat is verified before believing what you read.\u003c/p\u003e\n            \u003c/div\u003e\n            \n            \u003csection data-ga-module=\"content-body\"\u003e\n                            \n                \u003cimg src=\"https://lifehacker.com/imagery/articles/01JGMBH1H7N3R6YHGBK43A2EB3/hero-image.fill.size_1248x702.v1735853007.png\" alt=\"telegram third-party verification \" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01JGMBH1H7N3R6YHGBK43A2EB3/hero-image.fill.size_400x225.v1735853007.png 400w, https://lifehacker.com/imagery/articles/01JGMBH1H7N3R6YHGBK43A2EB3/hero-image.fill.size_800x450.v1735853007.png 800w, https://lifehacker.com/imagery/articles/01JGMBH1H7N3R6YHGBK43A2EB3/hero-image.fill.size_1248x702.v1735853007.png 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\n                        \u003cp\u003e\u003cspan\u003eCredit: Image courtesy of Telegram\u003c/span\u003e\n                            \u003c/p\u003e\n            \n    \u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003e\u003ca href=\"https://lifehacker.com/misinformation-and-disinformation-are-not-the-same-thin-1839290006\" target=\"_blank\"\u003eMisinformation\u003c/a\u003e and \u003ca href=\"https://lifehacker.com/money/psychological-tricks-scammers-use-against-you\" target=\"_blank\"\u003escams\u003c/a\u003e are an unfortunate reality of the internet in 2024. That \u0026#34;news\u0026#34; account might really be pushing falsehoods and lies, while that outreach from \u0026#34;Google\u0026#34; \u003ca href=\"https://lifehacker.com/tech/dont-fall-for-this-new-ai-scam\" target=\"_blank\"\u003elikely isn\u0026#39;t from the company at all\u003c/a\u003e. You really need to be on guard at all times when processing the information that passes through your social feeds, which is why it helps when apps and platforms take action to protect users from untrustworthy sources.\u003c/p\u003e\u003ch2 id=\"telegram-has-a-new-verification-system\"\u003eTelegram has a new verification system\u003c/h2\u003e\u003cp\u003eThat seems to be the motivation behind \u003ca href=\"https://telegram.org/blog/collectible-gifts-and-more\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003erecent updates from Telegram\u003c/a\u003e. The messaging platform has an existing verification system built into the service, where companies and public figures can register themselves with Telegram and receive a blue badge of honor. That way, when you see content from a notable person or an organization, you can rest assured those words being share are actually from that source. Many platforms (but \u003ca href=\"https://lifehacker.com/how-to-tell-if-someone-paid-for-their-twitter-verificat-1849767131\" target=\"_blank\"\u003enot all\u003c/a\u003e) offer this type of service, of course. Even Google is \u003ca href=\"https://lifehacker.com/tech/google-testing-verification-badges-for-search\" target=\"_blank\"\u003ethinking about rolling out badges for search\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eBut Telegram has a new addition to how it conducts verification: Once an organization is verified, it can then apply to become a \u0026#34;\u003ca href=\"https://www.theverge.com/2025/1/2/24334132/telegram-third-party-verification-combat-scams\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ethird-party verifier\u003c/a\u003e,\u0026#34; which lets them verify other accounts and chats it deems official, too. These verification badges will differ from the blue checkmarks, and will instead look like blue emojis or icons. Any account or chat verified in this way will have a banner in its profile that explains which third party verified it and why. \u003c/p\u003e\u003cp\u003eI\u0026#39;m all for this type of verification process, and hope it catches on. It puts trust in accounts that already have proven their authority to Telegram, and, over time, will help users quickly parse which accounts and chats are legit, and which might be best to avoid. In the future, you might see a post from an account or chat, and since it doesn\u0026#39;t have that badge, think twice about the message it\u0026#39;s trying to get out.\u003c/p\u003e\u003ch2 id=\"other-new-telegram-features\"\u003eOther new Telegram features\u003c/h2\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01JGMBH1H7N3R6YHGBK43A2EB3/images-1.fill.size_2000x2000.v1735851480.png\" alt=\"telegram message filter\" width=\"2000\" height=\"2000\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01JGMBH1H7N3R6YHGBK43A2EB3/images-1.fill.size_800x800.v1735851480.png 800w, https://lifehacker.com/imagery/articles/01JGMBH1H7N3R6YHGBK43A2EB3/images-1.fill.size_1400x1400.v1735851480.png 1400w, https://lifehacker.com/imagery/articles/01JGMBH1H7N3R6YHGBK43A2EB3/images-1.fill.size_2000x2000.v1735851480.png 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003e\u003c/span\u003e\n                                        \u003cspan\u003eCredit: Telegram\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003cp\u003eIn addition to third-party verification, Telegram announced a series of other features and changes coming to the platform:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eMessage search filters\u003c/strong\u003e: When searching, you\u0026#39;ll now see an option in the \u0026#34;Chats\u0026#34; tab to sort your messages by \u0026#34;All Chats,\u0026#34; \u0026#34;Private Chats,\u0026#34; \u0026#34;Group Chats,\u0026#34; or \u0026#34;Channels,\u0026#34; to help you find the messages you\u0026#39;re looking for. \u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eFolder names gets custom emojis\u003c/strong\u003e: If you subscribe to Premium, you can add custom emoji to the names of your chat folders. You can even replace the text that would normally appear here with whatever emoji you want.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eIn-app QR code scanner\u003c/strong\u003e: When using the in-app camera on either iOS or Android, you\u0026#39;ll also be able to scan QR codes.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eCollectible gifts\u003c/strong\u003e: Telegram \u0026#34;\u003ca href=\"https://telegram.org/blog/gifts-verification-platform\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003egifts\u003c/a\u003e\u0026#34; are small tokens of artwork you can share with friends and display on your profile. Now, you can upgrade a gift to make it a \u0026#34;collectible.\u0026#34; This will add a new look made by a Telegram artist, as well as a unique background, icon, and number. You can share collectibles with other users, or, if you\u0026#39;re so inclined, auction it as an NFT. Right now, 20 gifts can be upgraded to collectibles, with over 1,400 unique appearances. \u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eService message reactions\u003c/strong\u003e: Service messages are those alerts you get whenever someone joins a group, begins a video call, or sends you a gift. Telegram now lets you react to these alerts, which adds a fun layer to these previously informative-only messages.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\n    \u003c/article\u003e\n\n    \n                        \u003cdiv\u003e\n                \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/authors/01HF2FBCM600PS5NXSJXJA1AKJ/image.fill.size_150x150.v1704301306.png\" alt=\"artist rendition of Jake Peterson\" width=\"150\" height=\"150\" loading=\"lazy\"/\u003e\n                                            \u003c/p\u003e\n                \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003cp\u003eJake Peterson\u003c/p\u003e\n                                    \u003cp\u003eSenior Technology Editor\u003c/p\u003e\n                                \u003cdiv\u003e\n                                            \u003cp\u003eJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film \u0026amp; TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the \u003ca href=\"https://lifehacker.com/tech/living-with-ai\" target=\"_blank\"\u003ebest uses of AI in your daily life\u003c/a\u003e to \u003ca href=\"https://lifehacker.com/okay-which-macbook-should-you-buy-1849330413\" target=\"_blank\"\u003ewhich MacBook to buy\u003c/a\u003e. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\u003c/p\u003e\n                                    \u003c/div\u003e\n                \u003cp\u003e\u003ca href=\"https://lifehacker.com/author/jakepeterson\"\u003eRead Jake\u0026#39;s full bio\u003c/a\u003e\u003c/p\u003e\u003cul\u003e\n                                                                            \u003cli\u003e\n                                \u003ca href=\"https://twitter.com/@jakecpeterson\" title=\"Find on Twitter (Opens in a new tab)\" aria-label=\"Visit Jake\u0026#39;s Twitter\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-twitter\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                                                                                    \u003cli\u003e\n                                \u003ca href=\"https://lifehacker.com/cdn-cgi/l/email-protection#ec869c8998899e9f8382ac80858a89848d8f87899ec28f8381\" title=\"Send an Email (Opens in a new tab)\" aria-label=\"Send Jake an email\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-envelope\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                            \u003c/ul\u003e\n                            \u003c/div\u003e\n        \u003c/div\u003e\n                \u003cdiv\u003e\n                                            \n                        \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"1\" data-ga-label=\"The Latest Version of \u0026#39;Doom\u0026#39; Is a CAPTCHA\" href=\"https://lifehacker.com/entertainment/the-latest-version-of-doom-is-a-captcha\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JGM2974Y906476C3NTBK1BH3/hero-image.fill.size_75x75.v1735841939.png\" alt=\"doom CAPTCHA\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                    \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"2\" data-ga-label=\"Here Are All the Carriers That Support RCS on iPhone\" href=\"https://lifehacker.com/tech/all-the-carriers-that-support-rcs-on-iphone\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JFTBJ0NHWBTPG8Q5MQKJPEHG/hero-image.fill.size_75x75.v1734979773.png\" alt=\"iphone and google pixel phones on table next to each other\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                                        \u003c/div\u003e\n            \u003c/div\u003e\n            \n    \n    \n                    \u003c/section\u003e\n\n                            \n                    \u003c/div\u003e\u003cdiv data-ga-module=\"footer-nav\" data-ga-action=\"footer-nav-link\"\u003e\n\n        \n        \u003cdiv role=\"region\" aria-label=\"Our Mission \u0026amp; Social Network\"\u003e\n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-element=\"nav-logo\" data-ga-action=\"nav-logo\" data-ga-item=\"logo\" href=\"https://lifehacker.com\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/images/lifehacker-logo.svg\" alt=\"Lifehacker Logo\" loading=\"lazy\" width=\"256\" height=\"71\"/\u003e\n                \u003c/a\u003e\u003c/p\u003e\u003cp\u003eLifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \u003c/p\u003e\n                \u003cdiv data-ga-element=\"social-link\" data-ga-action=\"social-link\" data-ga-item=\"title\"\u003e\n                    \u003cul\u003e\n                        \u003cli\u003e\u003ca data-ga-click=\"\" data-ga-label=\"$text\" href=\"https://lifehacker.com/our-mission\" aria-label=\"Our Mission\"\u003eOur Mission\u003c/a\u003e\u003c/li\u003e\n                        \u003cli\u003e\u003ca data-ga-click=\"\" data-ga-label=\"$text\" href=\"https://lifehacker.com/our-team\" aria-label=\"Our Team\"\u003eOur Team\u003c/a\u003e\u003c/li\u003e\n                        \u003cli\u003e\u003ca data-ga-click=\"\" data-ga-label=\"$text\" href=\"https://lifehacker.com/newsletters\" aria-label=\"Newsletter\"\u003eNewsletter\u003c/a\u003e\u003c/li\u003e\n                    \u003c/ul\u003e\n                    \u003cul\u003e\n                        \u003cli\u003e\n                            \u003ca data-ga-click=\"\" data-ga-label=\"facebook\" href=\"https://facebook.com/lifehacker\" title=\"(opens in a new window)\" rel=\"noopener\" target=\"_blank\"\u003e\n                                \u003csvg\u003e\n                                    \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-facebook\"\u003e\u003c/use\u003e\n                                \u003c/svg\u003e\n                            \u003c/a\u003e\n                        \u003c/li\u003e\n                        \u003cli\u003e\n                            \u003ca data-ga-click=\"\" data-ga-label=\"twitter\" href=\"https://twitter.com/lifehacker\" title=\"(opens in a new window)\" rel=\"noopener\" target=\"_blank\"\u003e\n                                \u003csvg\u003e\n                                    \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-twitter\"\u003e\u003c/use\u003e\n                                \u003c/svg\u003e\n                            \u003c/a\u003e\n                        \u003c/li\u003e\n                        \u003cli\u003e\n                            \u003ca data-ga-click=\"\" data-ga-label=\"instagram\" href=\"https://instagram.com/lifehackerdotcom\" title=\"(opens in a new window)\" rel=\"noopener\" target=\"_blank\"\u003e\n                                \u003csvg\u003e\n                                    \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-instagram\"\u003e\u003c/use\u003e\n                                \u003c/svg\u003e\n                            \u003c/a\u003e\n                        \u003c/li\u003e\n                        \u003cli\u003e\n                            \u003ca data-ga-click=\"\" data-ga-label=\"youtube\" href=\"https://www.youtube.com/user/lifehacker\" title=\"(opens in a new window)\" rel=\"noopener\" target=\"_blank\"\u003e\n                                \u003csvg\u003e\n                                    \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-youtube\"\u003e\u003c/use\u003e\n                                \u003c/svg\u003e\n                            \u003c/a\u003e\n                        \u003c/li\u003e\n                    \u003c/ul\u003e\n                \u003c/div\u003e\n            \u003c/div\u003e\n\n        \n        \u003cdiv data-ga-element=\"zd-copyright\" data-ga-action=\"zd-copyright\" data-ga-item=\"title\" role=\"region\" aria-label=\"Ziff Davis Copyright\"\u003e\n                \u003cp\u003e© 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. \u003cspan\u003eALL RIGHTS RESERVED.\u003c/span\u003e\u003c/p\u003e\n                \u003cp\u003eLifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee \u003cspan\u003eby that merchant.\u003c/span\u003e\u003c/p\u003e\n            \u003c/div\u003e\n\n        \n        \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-01-02T22:30:29Z",
  "modifiedTime": "2025-01-02T22:31:00Z"
}
