{
  "id": "d2163d7e-63a2-491c-983f-6e8ee6ee2ee7",
  "title": "Walt Disney World Finally Gets a Nighttime Parade This Summer",
  "link": "https://gizmodo.com/walt-disney-world-finally-gets-a-nighttime-parade-this-summer-2000609003",
  "description": "Also at Disney World, spooky season starts early: there's a new Disney Villains show, and tickets to Magic Kingdom's Halloween party are on sale now.",
  "author": "Sabina Graves",
  "published": "Fri, 30 May 2025 23:30:10 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Theme Parks \u0026 Destinations",
    "Disneyland",
    "Disneyland Paris",
    "WALT DISNEY WORLD"
  ],
  "byline": "Sabina Graves",
  "length": 5316,
  "excerpt": "Also at Disney World, spooky season starts early: there's a new Disney Villains show, and tickets to Magic Kingdom's Halloween party are on sale now.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "With summer vacations on the horizon, Disney Experiences are popping off at their bi-coastal theme parks, Disney Cruises, and international destinations. Walt Disney World is getting a nighttime parade featuring new Pixar and Disney Animation Studios favorites, while Mickey Mouse and the Fab Five get dapper outfits to shine along with Starlight. Spooky fun is already beginning with the Disney Villains getting their own show at WDW’s Hollywood Studios and Halloween party tickets going on sale. Over at Disneyland, the 70th anniversary party is in full swing with fun festive foods and more. At Disneyland Paris, the theme park dances the summer away with a new music festival. And Disney Cruises prepares to set sail with the fleet’s newest ship in this week’s theme park news. Walt Disney World – Starlight This summer brings an all-new nighttime parade, Disney Starlight: Dream the Night Away, which will debut July 20, 2025. The Magic Kingdom Park exclusive will bring back nighttime parades to the Walt Disney World resort and will feature classic and new Disney and Pixar fandom faves along the parade route on Main Street. The sparkling floats will light up the night and of course we’re excited to see the updates to Mickey, Minnie, Donald, Goofy, and Daisy’s costumes for the summer premiere. Walt Disney World – Disney Villains: Unfairly Ever After There has been a need for more indoor shows as Walt Disney World’s humid summer gets underway, so why not some chilling tales from the Disney Villains to beat the heat? We’re excited to check out Disney Villains: Unfairly Ever After for a fun musical romp through villain showstoppers and more. Walt Disney World – Mickey’s Not-So-Scary Halloween Party Haunted Mansion’s Butler Broom extends the invitation for what’s sure to be a swinging wake. New this year will be a Mickey Mouse and Minnie Mouse spooky meet and greet at the Town Square Theater. For those of us with little tots, the Storybook Circus will get a “happy haunt” transformation to help the smallest of Disney fans ease into the spirit of the season—since it is Mickey’s Not-So-Scary Halloween after all. Along with popular returning faves, the event will run August 15 to October 31. Tickets here. Disney Imagineering tour of Epcot’s Moana: Journey of Water Delight in one of our favorite walkthrough attractions at Walt Disney World to keep summer visitors cool with Imagineering’s fun-fact filled behind the scenes look at Moana: Journey of Water. Disneyland 70th Food This summer, aside from watching all the nighttime shows and scavenger hunting with the key to Disneyland, we’ll be eating our way through the parks. Our current fave dish is the 70th celebration Mickey Waffles at Schmoozies which are like confetti cake in flavor and have a creamy strawberry center that’s not to be missed. Disneyland France – Disney Music Festival © Disneyland Paris Disneyland Paris makes a debut as a music festival destination from now until September 7 with the Disney Music Festival. The event will combine all genres of music with experiences inspired by Pixar and Disney Animation favorites, with hubs dedicated to various genres of music. That includes a mariachi band with Coco’s Miguel in Frontierland, jazz with Mary Poppins in Town Square, rock n’ roll with Elvis Stitch in Discoveryland, and more characters getting in on the fun. I want to know to know the story of DJ Chip and Dale, who just by the looks of their outfits look like they mean house music business. Disney Cruise – The Disney Destiny The comic book action and fairytale magic of Disney, Pixar, and Marvel heroes and villains will soon take over the Disney Destiny, the newest ship set to embark on ocean adventures in the Disney Cruise Line fleet. The Destiny will begin its trips later this year on November 20 with 4-5 night cruises taking off from the port of Fort Lauderdale to the Bahamas and Western Caribbean. We’re excited for the ship’s epic looking Hercules show and the gorgon battle teased in the image above. Duffy and Friends Celebrate 20 years at Tokyo DisneySea The iconic international bear Duffy and his friends are turning 20. The celebration is hittingTokyo DisneySea for seaside fun this year with special food, entertainment and merch. I hope we get some stateside soon! We need LinaBell and other plushes for those of us collecting. Star Wars BDX Droids on a World Tour – Tokyo Disneyland International Disney fans can meet the Star Wars droids which will be featured in Jon Favreau’s The Mandalorian and Grogu until June 30 at Tokyo Disneyland. Spider-Man themed land breaks ground at Shanghai Disney Resort The Marvel Cinematic (theme park) Universe expands at Shanghai Disneyland with a new Spider-Man inspired land which will host new shows, dining, and attractions. Notably there will be a high-octane coaster that will swing you around on a heroic action encounter with Spidey. Land broke on May 18 for the area which will neighbor the recently opened Zootopia land. Makes sense, the Wonderful World of Disney insects living next to animals and all. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/05/walt-disney-world-starlight.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eWith summer vacations on the horizon, \u003ca href=\"https://gizmodo.com/disneyland-70th-anniversary-preview-highlights-2000603420\"\u003eDisney Experiences\u003c/a\u003e are popping off at their bi-coastal theme parks, Disney Cruises, and \u003ca href=\"https://gizmodo.com/disneylands-70th-anniversary-is-celebrating-an-icon-you-might-never-have-heard-of-2000602599\"\u003einternational destinations\u003c/a\u003e.\u003c/p\u003e \u003cp\u003eWalt Disney World is getting a nighttime parade featuring new Pixar and Disney Animation Studios favorites, while \u003ca href=\"https://gizmodo.com/you-can-now-eat-popcorn-out-of-a-moving-talking-mickey-mouse-at-disneyland-2000601936\"\u003eMickey Mouse\u003c/a\u003e and the Fab Five get dapper outfits to shine along with \u003cem\u003eStarlight\u003c/em\u003e. Spooky fun is already beginning with the Disney Villains getting their own show at WDW’s Hollywood Studios and Halloween party tickets going on sale.\u003c/p\u003e \u003cp\u003eOver at Disneyland, the 70th anniversary party is in full swing with fun festive foods and more. At Disneyland Paris, the theme park dances the summer away with a new music festival. And Disney Cruises prepares to set sail with the fleet’s newest ship in this week’s theme park news.\u003c/p\u003e \u003ch2\u003eWalt Disney World – \u003cem\u003eStarlight\u003c/em\u003e\u003c/h2\u003e   \u003cp\u003eThis summer brings an all-new nighttime parade, \u003ca href=\"https://disneyworld.disney.go.com/entertainment/magic-kingdom/starlight-dream-night-away-parade/\"\u003e\u003cem\u003eDisney Starlight: Dream the Night Away\u003c/em\u003e\u003c/a\u003e, which will debut July 20, 2025. The Magic Kingdom Park exclusive will bring back nighttime parades to the Walt Disney World resort and will feature classic and new Disney and Pixar fandom faves along the parade route on Main Street. The sparkling floats will light up the night and of course we’re excited to see the updates to Mickey, Minnie, Donald, Goofy, and Daisy’s costumes for the summer premiere.\u003c/p\u003e\n\n \u003ch2\u003eWalt Disney World – \u003cem\u003eDisney Villains: Unfairly Ever After\u003c/em\u003e\u003c/h2\u003e   \u003cp\u003eThere has been a need for more indoor shows as Walt Disney World’s humid summer gets underway, so why not some chilling tales from the Disney Villains to beat the heat? We’re excited to check out\u003cem\u003e Disney Villains: Unfairly Ever After\u003c/em\u003e for a fun musical romp through villain showstoppers and more.\u003c/p\u003e \u003ch2\u003eWalt Disney World – Mickey’s Not-So-Scary Halloween Party\u003c/h2\u003e   \u003cp\u003eHaunted Mansion’s Butler Broom extends the invitation for what’s sure to be a swinging wake. New this year will be a Mickey Mouse and Minnie Mouse spooky meet and greet at the Town Square Theater. For those of us with little tots, the Storybook Circus will get a “happy haunt” transformation to help the smallest of Disney fans ease into the spirit of the season—since it is Mickey’s Not-So-Scary Halloween after all. Along with popular returning faves, the event will run August 15 to October 31. Tickets \u003ca href=\"https://disneyworld.disney.go.com/events/mickeys-not-so-scary-halloween-party/purchase/\"\u003ehere\u003c/a\u003e.\u003c/p\u003e \u003ch2\u003eDisney Imagineering tour of Epcot’s \u003cem\u003eMoana: Journey of Water\u003c/em\u003e\u003c/h2\u003e \u003cp\u003e\u003ciframe loading=\"lazy\" title=\"Imagineer Stories at Journey of Water, Inspired by Moana\" width=\"500\" height=\"281\" src=\"about:blank\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\" data-rocket-lazyload=\"fitvidscompatible\" data-lazy-src=\"https://www.youtube.com/embed/PjLH47DPbeI?feature=oembed\"\u003e\u003c/iframe\u003e\u003c/p\u003e \u003cp\u003eDelight in one of our favorite walkthrough attractions at Walt Disney World to keep summer visitors cool with Imagineering’s fun-fact filled behind the scenes look at \u003cem\u003eMoana: Journey of Water.\u003c/em\u003e\u003c/p\u003e\n\n \u003ch2\u003eDisneyland 70th Food\u003c/h2\u003e   \u003cp\u003eThis summer, aside from watching all the nighttime shows and scavenger hunting with the key to Disneyland, we’ll be eating our way through the parks. Our current fave dish is the 70th celebration Mickey Waffles at Schmoozies which are like confetti cake in flavor and have a creamy strawberry center that’s not to be missed.\u003c/p\u003e \u003ch2\u003eDisneyland France – Disney Music Festival\u003c/h2\u003e \u003cfigure id=\"attachment_2000609622\" aria-describedby=\"caption-attachment-2000609622\"\u003e\u003cimg decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2025/05/DJ-Chip-and-Dale-Disney-France-1024x683.jpg\" alt=\"Dj Chip And Dale Disney France\" width=\"1024\" height=\"683\" srcset=\"https://gizmodo.com/app/uploads/2025/05/DJ-Chip-and-Dale-Disney-France-1024x683.jpg 1024w, https://gizmodo.com/app/uploads/2025/05/DJ-Chip-and-Dale-Disney-France-300x200.jpg 300w, https://gizmodo.com/app/uploads/2025/05/DJ-Chip-and-Dale-Disney-France-768x512.jpg 768w, https://gizmodo.com/app/uploads/2025/05/DJ-Chip-and-Dale-Disney-France-336x224.jpg 336w, https://gizmodo.com/app/uploads/2025/05/DJ-Chip-and-Dale-Disney-France-1400x932.jpg 1400w, https://gizmodo.com/app/uploads/2025/05/DJ-Chip-and-Dale-Disney-France-680x453.jpg 680w, https://gizmodo.com/app/uploads/2025/05/DJ-Chip-and-Dale-Disney-France-896x597.jpg 896w, https://gizmodo.com/app/uploads/2025/05/DJ-Chip-and-Dale-Disney-France-1792x1195.jpg 1792w, https://gizmodo.com/app/uploads/2025/05/DJ-Chip-and-Dale-Disney-France.jpg 1920w\" sizes=\"(max-width: 1023px) calc(100vw - 2rem), (max-width: 1279px) calc(100vw - 26rem), 680px\"/\u003e\u003cfigcaption id=\"caption-attachment-2000609622\"\u003e© Disneyland Paris\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003eDisneyland Paris makes a debut as a music festival destination from now until September 7 with the \u003ca href=\"https://www.disneylandparis.com/en-usd/seasons/disney-music-festival\"\u003eDisney Music Festival.\u003c/a\u003e\u003c/p\u003e\n\n \u003cp\u003eThe event will combine all genres of music with experiences inspired by Pixar and Disney Animation favorites, with hubs dedicated to various genres of music. That includes a mariachi band with \u003cem\u003eCoco’s\u003c/em\u003e Miguel in Frontierland, jazz with Mary Poppins in Town Square, rock n’ roll with Elvis Stitch in Discoveryland, and more characters getting in on the fun. I want to know to know the story of DJ Chip and Dale, who just by the looks of their outfits look like they mean house music business.\u003c/p\u003e \u003ch2\u003eDisney Cruise – The Disney \u003cem\u003eDestiny\u003c/em\u003e\u003c/h2\u003e   \u003cp\u003eThe comic book action and fairytale magic of Disney, Pixar, and Marvel heroes and villains will soon take over the \u003ca href=\"https://disneycruise.disney.go.com/ships/destiny/\"\u003eDisney \u003cem\u003eDestiny\u003c/em\u003e\u003c/a\u003e, the newest ship set to embark on ocean adventures in the Disney Cruise Line fleet. The \u003cem\u003eDestiny\u003c/em\u003e will begin its trips later this year on November 20 with 4-5 night cruises taking off from the port of Fort Lauderdale to the Bahamas and Western Caribbean. We’re excited for the ship’s epic looking \u003cem\u003eHercules\u003c/em\u003e show and the gorgon battle teased in the image above.\u003c/p\u003e\n\n \u003ch2\u003eDuffy and Friends Celebrate 20 years at Tokyo DisneySea\u003c/h2\u003e   \u003cp\u003eThe iconic international bear Duffy and his friends are turning 20. The celebration is hittingTokyo DisneySea for seaside fun this year with special food, entertainment and merch. I hope we get some stateside soon! We need LinaBell and other plushes for those of us collecting.\u003c/p\u003e \u003ch2\u003e\u003cem\u003eStar Wars\u003c/em\u003e BDX Droids on a World Tour – Tokyo Disneyland\u003c/h2\u003e   \u003cp\u003eInternational Disney fans can meet the\u003cem\u003e Star Wars\u003c/em\u003e droids which will be featured in Jon Favreau’s \u003cem\u003eThe Mandalorian and Grogu\u003c/em\u003e until June 30 at Tokyo Disneyland.\u003c/p\u003e\n\n \u003ch2\u003eSpider-Man themed land breaks ground at Shanghai Disney Resort\u003c/h2\u003e   \u003cp\u003eThe Marvel Cinematic (theme park) Universe expands at Shanghai Disneyland with a new Spider-Man inspired land which will host new shows, dining, and attractions. Notably there will be a high-octane coaster that will swing you around on a heroic action encounter with Spidey. Land broke on May 18 for the area which will neighbor the recently opened\u003cem\u003e Zootopia\u003c/em\u003e land. Makes sense, the Wonderful World of Disney insects living next to animals and all.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-30T23:30:10Z",
  "modifiedTime": "2025-05-30T23:30:10Z"
}
