{
  "id": "d509e623-72a9-4fc3-90ca-c4ea358a8dad",
  "title": "Satellite powered estimation of global solar potential",
  "link": "https://research.google/blog/satellite-powered-estimation-of-global-solar-potential/",
  "description": "Comments",
  "author": "",
  "published": "Thu, 19 Dec 2024 20:44:46 +0000",
  "source": "https://news.ycombinator.com/rss",
  "categories": null,
  "byline": "",
  "length": 11128,
  "excerpt": "Energy demand is set to increase dramatically in coming years, and residential solar power is poised to play a crucial role in meeting this challenge sustainably. By 2035, solar photovoltaics are projected to generate a staggering 10.7k TWh globally — nearly 28% of the total anticipated demand! As cities grow and the impacts of climate change intensify, the transition to renewable energy sources like solar becomes increasingly urgent. By offering a cleaner alternative to fossil fuels, solar energy empowers individuals and businesses to control their own energy production and reduce their carbon footprint.",
  "siteName": "",
  "favicon": "https://research.google/gr/static/assets/favicon.ico",
  "text": "Energy demand is set to increase dramatically in coming years, and residential solar power is poised to play a crucial role in meeting this challenge sustainably. By 2035, solar photovoltaics are projected to generate a staggering 10.7k TWh globally — nearly 28% of the total anticipated demand! As cities grow and the impacts of climate change intensify, the transition to renewable energy sources like solar becomes increasingly urgent. By offering a cleaner alternative to fossil fuels, solar energy empowers individuals and businesses to control their own energy production and reduce their carbon footprint.Unfortunately, barriers to solar adoption persist, particularly in parts of the Global South where access to financing, technology, and infrastructure is limited. To unlock solar’s potential around the world, a concerted effort is needed from governments, organizations, and researchers to develop accessible and scalable solutions. Assessing the solar viability of a property involves numerous variables, often posing a challenge for homeowners and businesses. The Google Maps Platform (GMP) Solar API simplifies the process of assessing solar potential and designing solar systems by leveraging aerial imagery to provide key insights for rooftops.Today, we're excited to announce an experimental expansion in the coverage of this API in the Global South. By applying machine learning (ML) models to satellite imagery, we can generate digital surface models (DSMs) and roof segmentation maps to enable solar assessments in new areas around the world. The methodology is detailed in our paper “Satellite Sunroof: High-res Digital Surface Models and Roof Segmentation for Global Solar Mapping”, published at the Climate Change and AI workshop at NeurIPS 2024.You can explore this experimental data and contribute to a brighter future by signing up today! Insights from the Solar APIInstallation of residential solar panels is often slow and complicated, especially in emerging markets with limited data. The process typically involves educating homeowners, taking manual measurements, and creating designs and proposals based on scarce information — all before a contract is even signed.To address these challenges, the Solar API was launched in 2023 under Google Maps Platform's Environment APIs. It provides comprehensive building solar data and detailed rooftop imagery by processing aerial imagery, weather, and financial data. Earlier this year, we expanded the Solar API’s reach by applying ML techniques within our processing pipeline, bringing solar insights to millions of additional buildings across the US, Europe, and Japan.This data aims to help:Empower businesses to provide people with personalized solar potential insights and optimized panel layouts.Identify installation locations for potential investments and business growth opportunities.Increase customer conversion rates with less effort and lower costs.Accelerate adoption with remote proposals and quotes.Optimize designs using 3D models for efficient panel layouts.Aid in the development of new incentive programs based on data-driven insights. Expanding globally with satellitesTo address the growing need for solar data in the Global South, we began to explore the application of ML techniques on satellite imagery. Though working with lower-resolution satellite imagery presents new challenges, such as the scarcity of accurate elevation maps, reduced image quality, and distortions from oblique viewing angles, we see this as a significant opportunity to accelerate the growth of solar markets in new regions. Satellite imagery not only offers a pathway to global coverage but also enables more frequent data updates, even in well-mapped areas like the US and Europe, where relying solely on expensive and potentially outdated aerial imagery can be a limitation.This data is currently available to experimental users through the Solar API Expanded Coverage Testing Program, with a number of solar installers already using the data outputs, as shown below. With this expansion, we unlock the use of satellite imagery for solar potential estimation, resulting in 125 million new buildings with Solar API data across 23 countries. This project extends the total potential coverage by 1.9 billion additional buildings around the world, based on currently available satellite imagery. More buildings will become available as satellites continue to capture new areas. Using ML to predict high-quality DSMs and roof segmentsThe solar data generation pipeline requires high-quality DSMs in order to compute planar roof segments for solar panel calculations. However, traditional stereo methods for satellite DSM generation are unreliable because high-resolution (\u003c1 meter) satellite imagery is expensive to capture, often leading to limited views of a given region with significant temporal gaps. Existing roof segmentation techniques are also less accurate on satellite data due to the lower resolution. To address these challenges, we’ve developed new ML models that can generate high-quality nadir (overhead) DSMs and planar roof segment instances from single-view satellite imagery. We employ a two-stage model to produce DSMs and roof segments. The first stage is the base model, which processes off-nadir satellite RGB imagery with the corresponding satellite view angles. We optionally include low-quality photogrammetry-derived relative heightmaps (DSM-DTM) where they are available. These initial input DSMs have limited coverage and are at an insufficient resolution for detailed rooftop calculations. Using a U-Net–style architecture with a Swin Transformer encoder, the base model generates improved height maps and roof segment instances in the off-nadir view. These are then reprojected to a nadir view using geometry-based reprojection.The second stage, the refinement model, further enhances the nadir RGB, DSM and segment instances by filling in gaps and artifacts produced in the reprojection step. The base and refinement models use L1 and Sobel gradient losses for DSM estimation, and affinity mask losses for roof segmentation. Our models are quantitatively evaluated using a variety of metrics, including DSM mean absolute error (MAE), roof pitch error, and roof segment instance intersection over union (IOU). DSM and pitch results are compared to high-quality aerial DSM equivalents. Roof segment labels are obtained in two ways — either computed using graph-cut (GC) on DSM labels, or manually labeled using human annotations.We categorize these results into two groups based on input channels: \"RGB-only\" (global coverage) and \"RGB+DSM\" (limited coverage, only where stereo-based input DSMs are available), which help us understand model performance. These detailed performance metrics were compared across a broad set of countries where higher-quality aerial data is available. We also evaluated end-to-end results from the Solar API pipeline. The results show that while inclusion of low-quality DSMs improves shading predictions, as captured by the building DSM MAE, it doesn’t significantly improve roof segmentation or pitch accuracy, which are more critical for estimating solar potential. Our model's strong performance with RGB-only inputs makes it suitable for application in any region where satellite RGB imagery is available. We observe that the error variation between countries is small, with the exceptions of Chile and the Philippines, which can be attributed to noisy ground-truth data. This suggests that our model can adapt to a variety of regions with varying building styles and sizes, and across complex roof structures. Visualizations Our models generalize well across varying architectural styles and landscapes. In regions with flat rooftops, our DSMs accurately capture obstacles and roof surfaces with a high level of accuracy. In areas with tilted rooftops, the models effectively predict roof ridges, which are important for accurate panel placement. While the DSMs may not capture the intricate details of individual trees, tree height information is available and used for analyzing shading impacts over adjacent rooftops.The figure below compares the predictions of our satellite-based model against the high-quality aerial data that is currently available in the Solar API. The figure below displays the annual solar flux estimated by the Solar API, superimposed on satellite RGB imagery. Looking aheadWhile this expansion significantly increases the availability of solar data, inherent challenges and limitations persist. Factors like input pixel resolution, cloud cover, and occlusion artifacts can influence the output quality.We are actively working on improving the accuracy through ongoing research and user feedback. Future work will also focus on exploring new research directions, such as obstacle detection, roof material detection, and existing solar panel identification. AcknowledgementsWe would like to thank individuals in Google Research, Geo and DeepMind who carried out this work and made the launch possible, including (in alphabetical order): Alex Wilson, Alicia Noel, Ariel Mann, Artem Zholus, Betty Peng, Carl Elkin, Christina Ranalli, Christopher Schmidt, Christopher Van Arsdale, Courtney Maimon, Dana Kurnaiwan, Hedva Uriel, Jenna Hussein, Jordan Raisher, Juliet Rothenberg, Lisa Lovallo Ceppos, Marisa Leung, Mike Tavendale, Nobal Preet Singh, Paul Moniuszko, Peleg Amon, Rajroshan Sawhney, Revati Thatte, Ross Goroshin, Saleem Van Groenou, Sritoma Bhattacharjee, Tuvia Alon, Umangi Jain, Varun Gulshan and Vishal Batchu.",
  "image": "https://storage.googleapis.com/gweb-research2023-media/images/Open_Graph.width-800.format-jpeg.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-gt-publish-date=\"20241212\"\u003e\n                    \n                    \n    \n\n\n\u003cdiv data-gt-id=\"rich_text\" data-gt-component-name=\"\"\u003e\n    \n\n\n\n\n    \u003cp data-block-key=\"ferga\"\u003eEnergy demand is set to \u003ca href=\"https://www.iea.org/reports/world-energy-outlook-2024/executive-summary\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eincrease dramatically in coming years\u003c/a\u003e, and residential solar power is poised to play a crucial role in meeting this challenge sustainably. By 2035, solar \u003ca href=\"https://www.energy.gov/eere/solar/solar-photovoltaic-technology-basics\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ephotovoltaics\u003c/a\u003e are projected to generate a staggering \u003ca href=\"https://www.iea.org/reports/world-energy-outlook-2024/executive-summary\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e10.7k TWh globally\u003c/a\u003e — nearly 28% of the total anticipated demand! As cities grow and the impacts of climate change intensify, the transition to renewable energy sources like solar becomes increasingly urgent. By offering a cleaner alternative to fossil fuels, solar energy empowers \u003ca href=\"https://explore.panda.org/climate/how-to-reduce-your-carbon-footprint#:~:text=If%20you%20can\u0026amp;#x27;t%20change,phone%20power%20banks%2C%20etc\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eindividuals\u003c/a\u003e and \u003ca href=\"https://www.pwc.com/gx/en/issues/esg/the-energy-transition/energy-demand-opportunity.html\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ebusinesses\u003c/a\u003e to control their own energy production and reduce their carbon footprint.\u003c/p\u003e\u003cp data-block-key=\"8eqo9\"\u003eUnfortunately, barriers to solar adoption persist, particularly \u003ca href=\"https://www.smithschool.ox.ac.uk/sites/default/files/2023-12/Rolling-out-renewables-in-the-Global-South-A-developer-perspective.pdf\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ein parts of the Global South\u003c/a\u003e where access to financing, technology, and infrastructure is limited. To unlock solar’s potential around the world, a concerted effort is needed from governments, organizations, and researchers to develop accessible and scalable solutions. Assessing the solar viability of a property involves numerous variables, often posing a challenge for homeowners and businesses. The \u003ca href=\"https://developers.google.com/maps/documentation/solar/overview\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eGoogle Maps Platform (GMP) Solar API\u003c/a\u003e simplifies the process of assessing solar potential and designing solar systems by leveraging aerial imagery to provide key insights for rooftops.\u003c/p\u003e\u003cp data-block-key=\"4o5on\"\u003eToday, we\u0026#39;re excited to announce an \u003ca href=\"https://developers.google.com/maps/documentation/solar/coverage\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eexperimental expansion in the coverage of this API in the Global South\u003c/a\u003e. By applying machine learning (ML) models to satellite imagery, we can generate digital surface models (DSMs) and roof segmentation maps to enable solar assessments in new areas around the world. The methodology is detailed in our paper “\u003ca href=\"https://arxiv.org/abs/2408.14400\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSatellite Sunroof: High-res Digital Surface Models and Roof Segmentation for Global Solar Mapping\u003c/a\u003e”, published at the \u003ca href=\"https://www.climatechange.ai/events/neurips2024\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eClimate Change and AI workshop at NeurIPS 2024\u003c/a\u003e.\u003c/p\u003e\u003cp data-block-key=\"7hcbt\"\u003eYou can explore this experimental data and contribute to a brighter future by \u003ca href=\"https://goo.gle/solar-api-expanded-coverage\" target=\"_blank\" rel=\"noopener noreferrer\"\u003esigning up today\u003c/a\u003e!\u003c/p\u003e\n\u003c/div\u003e\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\u003cdiv data-gt-id=\"rich_text\" data-gt-component-name=\"\"\u003e\n    \n\n\n\n\n    \u003ch2 data-block-key=\"uhkgd\"\u003eInsights from the Solar API\u003c/h2\u003e\u003cp data-block-key=\"dl5rr\"\u003eInstallation of residential solar panels is often slow and complicated, especially in emerging markets with limited data. The process typically involves educating homeowners, taking manual measurements, and creating designs and proposals based on scarce information — all before a contract is even signed.\u003c/p\u003e\u003cp data-block-key=\"5oigh\"\u003eTo address these challenges, the Solar API was \u003ca href=\"https://mapsplatform.google.com/resources/blog/powering-future-our-new-solar-api/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003elaunched in 2023\u003c/a\u003e under \u003ca href=\"https://developers.google.com/maps/environment\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eGoogle Maps Platform\u0026#39;s Environment APIs\u003c/a\u003e. It provides comprehensive \u003ca href=\"https://developers.google.com/maps/documentation/solar/building-insights\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ebuilding solar data\u003c/a\u003e and \u003ca href=\"https://developers.google.com/maps/documentation/solar/data-layers\" target=\"_blank\" rel=\"noopener noreferrer\"\u003edetailed rooftop imagery\u003c/a\u003e by processing aerial imagery, weather, and financial data. Earlier this year, we expanded the Solar API’s reach by applying \u003ca href=\"https://www.climatechange.ai/papers/iclr2023/9\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eML techniques\u003c/a\u003e within our processing pipeline, \u003ca href=\"https://cloud.google.com/blog/products/maps-platform/our-solar-api-now-covers-more-rooftops-worldwide\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ebringing solar insights to millions of additional buildings\u003c/a\u003e across the US, Europe, and Japan.\u003c/p\u003e\u003cp data-block-key=\"415ur\"\u003eThis data aims to help:\u003c/p\u003e\u003cul\u003e\u003cli data-block-key=\"fvi0\"\u003eEmpower businesses to provide people with personalized solar potential insights and optimized panel layouts.\u003c/li\u003e\u003cli data-block-key=\"8hge5\"\u003eIdentify installation locations for potential investments and business growth opportunities.\u003c/li\u003e\u003cli data-block-key=\"fk6g6\"\u003eIncrease customer conversion rates with less effort and lower costs.\u003c/li\u003e\u003cli data-block-key=\"78haa\"\u003eAccelerate adoption with remote proposals and quotes.\u003c/li\u003e\u003cli data-block-key=\"15nt3\"\u003eOptimize designs using 3D models for efficient panel layouts.\u003c/li\u003e\u003cli data-block-key=\"b9uh9\"\u003eAid in the development of new incentive programs based on data-driven insights.\u003c/li\u003e\u003c/ul\u003e\n\u003c/div\u003e\n\n                    \n                    \n    \n\n\n\u003cdiv data-gt-id=\"rich_text\" data-gt-component-name=\"\"\u003e\n    \n\n\n\n\n    \u003ch2 data-block-key=\"uhkgd\"\u003eExpanding globally with satellites\u003c/h2\u003e\u003cp data-block-key=\"611n3\"\u003eTo address the \u003ca href=\"https://www.weforum.org/agenda/2024/05/opportunity-servicing-energy-demand-global-south/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003egrowing need for solar data in the Global South\u003c/a\u003e, we began to explore the application of ML techniques on satellite imagery. Though working with lower-resolution satellite imagery presents new challenges, such as the scarcity of accurate elevation maps, reduced image quality, and distortions from oblique viewing angles, we see this as a significant opportunity to accelerate the growth of solar markets in new regions. Satellite imagery not only offers a pathway to global coverage but also enables more frequent data updates, even in well-mapped areas like the US and Europe, where relying solely on expensive and potentially outdated aerial imagery can be a limitation.\u003c/p\u003e\u003cp data-block-key=\"4me8k\"\u003eThis data is currently available to experimental users through the \u003ca href=\"https://goo.gle/solar-api-expanded-coverage\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSolar API Expanded Coverage Testing Program\u003c/a\u003e, with a number of solar installers already using the data outputs, as shown below.\u003c/p\u003e\n\u003c/div\u003e\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\u003cdiv\u003e\n        \n  \u003cp data-block-key=\"uhkgd\"\u003eWith this expansion, we unlock the use of satellite imagery for solar potential estimation, resulting in 125 million new buildings with Solar API data across 23 countries. This project extends the total potential coverage by 1.9 billion additional buildings around the world, based on currently available satellite imagery. More buildings will become available as satellites continue to capture new areas.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\u003cdiv data-gt-id=\"rich_text\" data-gt-component-name=\"\"\u003e\n    \n\n\n\n\n    \u003ch2 data-block-key=\"uhkgd\"\u003eUsing ML to predict high-quality DSMs and roof segments\u003c/h2\u003e\u003cp data-block-key=\"60qb2\"\u003eThe solar data generation pipeline requires high-quality DSMs in order to compute planar roof segments for solar panel calculations. However, traditional stereo methods for satellite DSM generation are unreliable because high-resolution (\u0026lt;1 meter) satellite imagery is expensive to capture, often leading to limited views of a given region with significant temporal gaps. Existing roof segmentation techniques are also less accurate on satellite data due to the lower resolution. To address these challenges, we’ve developed new ML models that can generate high-quality nadir (overhead) DSMs and planar roof segment instances from single-view satellite imagery.\u003c/p\u003e\n\u003c/div\u003e\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\u003cdiv data-gt-id=\"rich_text\" data-gt-component-name=\"\"\u003e\n    \n\n\n\n\n    \u003cp data-block-key=\"uhkgd\"\u003eWe employ a two-stage model to produce DSMs and roof segments. The first stage is the base model, which processes off-nadir satellite \u003ca href=\"https://en.wikipedia.org/wiki/RGB_color_model\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eRGB\u003c/a\u003e imagery with the corresponding \u003ca href=\"https://www.celestis.com/resources/faq/what-are-the-azimuth-and-elevation-of-a-satellite/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003esatellite view angles\u003c/a\u003e. We optionally include low-quality \u003ca href=\"https://www.cs.cornell.edu/courses/cs664/2008sp/handouts/cs664-10-stereo.pdf\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ephotogrammetry-derived\u003c/a\u003e relative heightmaps (DSM-DTM) where they are available. These initial input DSMs have limited coverage and are at an insufficient resolution for detailed rooftop calculations. Using a \u003ca href=\"https://arxiv.org/abs/1505.04597\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eU-Net\u003c/a\u003e–style architecture with a \u003ca href=\"https://arxiv.org/abs/2103.14030\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSwin Transformer\u003c/a\u003e encoder, the base model generates improved height maps and roof segment instances in the off-nadir view. These are then reprojected to a nadir view using \u003ca href=\"https://arxiv.org/abs/2408.14400\" target=\"_blank\" rel=\"noopener noreferrer\"\u003egeometry-based reprojection\u003c/a\u003e.\u003c/p\u003e\u003cp data-block-key=\"2t64s\"\u003eThe second stage, the refinement model, further enhances the nadir RGB, DSM and segment instances by filling in gaps and artifacts produced in the reprojection step. The base and refinement models use \u003ca href=\"https://en.wikipedia.org/wiki/Mean_absolute_error\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eL1\u003c/a\u003e and \u003ca href=\"https://homepages.inf.ed.ac.uk/rbf/HIPR2/sobel.htm\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSobel gradient\u003c/a\u003e losses for DSM estimation, and \u003ca href=\"https://www.climatechange.ai/papers/iclr2023/9\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eaffinity mask losses\u003c/a\u003e for roof segmentation.\u003c/p\u003e\n\u003c/div\u003e\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\u003cdiv data-gt-id=\"rich_text\" data-gt-component-name=\"\"\u003e\n    \n\n\n\n\n    \u003cp data-block-key=\"yvzd4\"\u003eOur models are quantitatively evaluated using a variety of metrics, including DSM \u003ca href=\"https://en.wikipedia.org/wiki/Mean_absolute_error\" target=\"_blank\" rel=\"noopener noreferrer\"\u003emean absolute error\u003c/a\u003e (MAE), \u003ca href=\"https://www.nachi.org/roof-slope-pitch.htm\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eroof pitch\u003c/a\u003e error, and roof segment instance \u003ca href=\"https://www.v7labs.com/blog/intersection-over-union-guide\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eintersection over union\u003c/a\u003e (IOU). DSM and pitch results are compared to high-quality aerial DSM equivalents. Roof segment labels are obtained in two ways — either computed using \u003ca href=\"https://www.cs.ucf.edu/courses/cap6411/cap6411/spring2006/Lecture11.pdf\" target=\"_blank\" rel=\"noopener noreferrer\"\u003egraph-cut\u003c/a\u003e (GC) on DSM labels, or manually labeled using human annotations.\u003c/p\u003e\u003cp data-block-key=\"8eh5b\"\u003eWe categorize these results into two groups based on input channels: \u0026#34;RGB-only\u0026#34; (global coverage) and \u0026#34;RGB+DSM\u0026#34; (limited coverage, only where stereo-based input DSMs are available), which help us understand model performance. These detailed performance metrics were compared across a broad set of countries where higher-quality aerial data is available. We also evaluated end-to-end results from the Solar API pipeline.\u003c/p\u003e\n\u003c/div\u003e\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\u003cdiv\u003e\n        \n  \u003cp data-block-key=\"yvzd4\"\u003eThe results show that while inclusion of low-quality DSMs improves shading predictions, as captured by the building DSM MAE, it doesn’t significantly improve roof segmentation or pitch accuracy, which are more critical for estimating solar potential. Our model\u0026#39;s strong performance with RGB-only inputs makes it suitable for application in any region where satellite RGB imagery is available.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\u003cdiv\u003e\n        \n  \u003cp data-block-key=\"yvzd4\"\u003eWe observe that the error variation between countries is small, with the exceptions of Chile and the Philippines, which can be attributed to noisy ground-truth data. This suggests that our model can adapt to a variety of regions with varying building styles and sizes, and across complex roof structures.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n                    \n                    \n    \n\n\n\u003cdiv\u003e\n        \n  \u003cp data-gt-id=\"rich_text\" data-gt-component-name=\"\"\u003e\n    \n\n\n\n\n    \u003ch2 data-block-key=\"yvzd4\"\u003eVisualizations\u003c/h2\u003e\n\u003c/p\u003e\n\n    \u003c/div\u003e\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\u003cdiv data-gt-id=\"rich_text\" data-gt-component-name=\"\"\u003e\n    \n\n\n\n\n    \u003cp data-block-key=\"yvzd4\"\u003eOur models generalize well across varying architectural styles and landscapes. In regions with flat rooftops, our DSMs accurately capture obstacles and roof surfaces with a high level of accuracy. In areas with tilted rooftops, the models effectively predict roof ridges, which are important for accurate panel placement. While the DSMs may not capture the intricate details of individual trees, tree height information is available and used for analyzing shading impacts over adjacent rooftops.\u003c/p\u003e\u003cp data-block-key=\"1j1eu\"\u003eThe figure below compares the predictions of our satellite-based model against the high-quality aerial data that is currently available in the Solar API.\u003c/p\u003e\n\u003c/div\u003e\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\u003cdiv\u003e\n        \n  \u003cp data-block-key=\"yvzd4\"\u003eThe figure below displays the annual solar flux estimated by the Solar API, superimposed on satellite RGB imagery.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n                    \n                    \n    \n\n\n\n\n                    \n                    \n    \n\n\n\u003cdiv data-gt-id=\"rich_text\" data-gt-component-name=\"\"\u003e\n    \n\n\n\n\n    \u003ch2 data-block-key=\"yvzd4\"\u003eLooking ahead\u003c/h2\u003e\u003cp data-block-key=\"eitn4\"\u003eWhile this expansion significantly increases the availability of solar data, inherent challenges and limitations persist. Factors like input pixel resolution, cloud cover, and occlusion artifacts can influence the output quality.\u003c/p\u003e\u003cp data-block-key=\"bldo9\"\u003eWe are actively working on improving the accuracy through ongoing research and user feedback. Future work will also focus on exploring new research directions, such as obstacle detection, roof material detection, and existing solar panel identification.\u003c/p\u003e\n\u003c/div\u003e\n\n                    \n                    \n    \n\n\n\u003cdiv data-gt-id=\"rich_text\" data-gt-component-name=\"\"\u003e\n    \n\n\n\n\n    \u003ch2 data-block-key=\"yvzd4\"\u003eAcknowledgements\u003c/h2\u003e\u003cp data-block-key=\"2gr3v\"\u003e\u003ci\u003eWe would like to thank individuals in Google Research, Geo and DeepMind who carried out this work and made the launch possible, including (in alphabetical order): Alex Wilson, Alicia Noel, Ariel Mann, Artem Zholus, Betty Peng, Carl Elkin, Christina Ranalli, Christopher Schmidt, Christopher Van Arsdale, Courtney Maimon, Dana Kurnaiwan, Hedva Uriel, Jenna Hussein, Jordan Raisher, Juliet Rothenberg, Lisa Lovallo Ceppos, Marisa Leung, Mike Tavendale, Nobal Preet Singh, Paul Moniuszko, Peleg Amon, Rajroshan Sawhney, Revati Thatte, Ross Goroshin, Saleem Van Groenou, Sritoma Bhattacharjee, Tuvia Alon, Umangi Jain, Varun Gulshan and Vishal Batchu.\u003c/i\u003e\u003c/p\u003e\n\u003c/div\u003e\n\n                    \n                \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": null,
  "modifiedTime": null
}
