{
  "id": "d7e6e8dd-c437-4bc7-8c5d-005e47f7ec06",
  "title": "Andor‘s Tony Gilroy and Genevieve O’Reilly Break Down Mon Mothma’s Pivotal Dance",
  "link": "https://gizmodo.com/andors-tony-gilroy-and-genevieve-oreilly-break-down-mon-mothmas-pivotal-dance-2000593909",
  "description": "The Star Wars series streams new episodes weekly on Disney+.",
  "author": "Sabina Graves",
  "published": "Thu, 24 Apr 2025 22:00:43 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Television",
    "Andor",
    "Genevieve O’Reilly",
    "Star Wars",
    "Tony Gilroy"
  ],
  "byline": "Sabina Graves",
  "length": 5356,
  "excerpt": "The Star Wars series streams new episodes weekly on Disney+.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "The Star Wars series streams new episodes weekly on Disney+. The first three episodes of Andor season two are finally streaming on Disney+, offering a breakneck blast back into the early days of Star Wars rebellion. During io9’s interview with showrunner Tony Gilroy and star Genevieve O’Reilly, who plays Mon Mothma, the duo broke down the last moments of the third episode of this week’s drop. Gilroy also discussed how framing these pivotal years as three-episode mini-movies came about. Sabina Graves, io9: The initial plan was for Andor to run five seasons, with each season covering a year—but that evolved into these three-episode “movie” arcs. How much of the backstory was provided and developed as you went along? Tony Gilroy: I think when we came up with the idea and started to experiment with it, I originally thought, “Oh my god, well… is it going to work? Is it going to have lots of exposition when we come back?” Where people have to say “Oh since last I saw you…”? I didn’t want to do that, and if you’d asked me in the beginning I would have thought “Oh, I’m going to have to write a huge bible of negative space of all the things that happen in between,” you’ll have to issue these other memos and that’s a whole other month of writing and no, no. I mean in episode four, Adria [Arjona] and Diego [Luna] really needed to know what had happened with the soldier and what the missions had been like. That jump was specific; they needed to know certain things but as we went along there were so few questions. The pickups, the beginning of the episodes where people were and what they were talking about, seemed to be so available that I never had to write a memo about it. I had some conversations about it but I never had to go back in and and do the heavy lifting I thought in the beginning, no. io9: Genevieve, was it really liberating to have that negative space and those broad strokes to find Mon in these formative years in building the rebellion? I found her moment of letting loose in particular in episode three so cathartic. Can you take me behind where you were in having that moment unfold for her? Genevieve O’Reilly: Yeah, I mean those first three episodes go over three days. It’s in her ancestral home, it’s within her family culture. I felt really steeped in her history there and we didn’t—like Tony said, there was there was very little exposition. It’s just: there she is, that’s the practice, that’s the ritual. We understand it implicitly and then moving through those three days of that wedding and the inter-complications of the family relationships with her daughter, with her husband, the in-laws and then having Luthen there—there was so much going on. And as we come to the pointy end of those three episodes you really feel the implications of where she is at that moment, not just with the weight of those familial kind—that rigorous tension of what that wedding was, but then with Luthen being there and coming in with a clear eye in regard to her friend Tay Colma. We know Tay Colma so well from season one, he was such a fierce ally of hers, and so we start season two with him very loose, very tethered, or she sees that in him. It’s like he’s seeing those false gold idols of Davos Sculdun, he’s drinking that in and he wants some of that for himself and that is an implicit threat. Of course she sees the friend, she sees that’s maneuverable, but of course Luthen sees it much clearer—he’s much more brutal in his vision and he calls her on it. He calls her on her romanticism and he kind of really asks her to be honest with herself in regard to what rebellion really takes. He asks her to have that blood on her hands and she tacitly agrees, and so that moment that you’re talking about, that crescendo of movement and culture and celebration, is also a woman just wrestling with her own internal chaos. io9: it’s such a beautiful moment and the dancing and the drinking—Tony, what did you see as the strength and beauty of intercutting that with where everyone else is in that moment of crossroads? Gilroy: My brother John, who’s been with me forever, who’s just the master builder, post-production builder—we built a lot of crescendos. We’ve learned how to build these crescendos in the movies we’ve made over the years and then we did it in season one, the funeral. So this is really going to be a very complicated crescendo, we’re using a piece of electronic dance music which is really unusual. I’m getting to juxtapose Cassian saving the day and Mon Mothma with blood on her hands with Eedy showing up for lunch. I get to do everything all at once. I’m really pleased with the end of three. I’ll say one other thing about about Mon on the dance floor: it does another thing. It binds the audience to her because the only people in that room who know what’s going on are you and her. Everybody else is partying, everybody else is dancing, but you know what she’s into, and so that just creates what it does with the audience. I love how it binds the audience to the characters. Andor is now streaming on Disney+. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/04/mon-mothma-genevieve-oreilly-Tony-Gilroy-Andor-Lucasfilm.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n                  The \u003ci\u003eStar Wars\u003c/i\u003e series streams new episodes weekly on Disney+.\n                \u003c/p\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eThe first three episodes of \u003cem\u003eAndor\u003c/em\u003e season two are finally streaming on Disney+, offering a breakneck blast back into the early days of \u003ca href=\"https://gizmodo.com/star-wars-celebration-japan-hasbro-interview-tariffs-dash-rendar-turgle-2000591971\"\u003e\u003cem\u003eStar Wars\u003c/em\u003e\u003c/a\u003e rebellion.\u003c/p\u003e \u003cp\u003eDuring io9’s interview with showrunner \u003ca href=\"https://gizmodo.com/star-wars-tony-gilroy-andor-interview-season-2-2000573377\"\u003eTony Gilroy\u003c/a\u003e and star Genevieve O’Reilly, who plays Mon Mothma, the duo broke down \u003ca href=\"https://gizmodo.com/andor-season-2-episode-3-mon-mothma-dance-2000589757\"\u003ethe last moments of the third episode\u003c/a\u003e of this week’s drop. Gilroy also discussed how framing these pivotal years as three-episode mini-movies came about.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eSabina Graves, io9: The initial plan was for \u003cem\u003eAndor\u003c/em\u003e to run five seasons, with each season covering a year—but that evolved into these three-episode “movie” arcs. How much of the backstory was provided and developed as you went along?\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eTony Gilroy:\u003c/strong\u003e I think when we came up with the idea and started to experiment with it, I originally thought, “Oh my god, well… is it going to work? Is it going to have lots of exposition when we come back?” Where people have to say “Oh since last I saw you…”? I didn’t want to do that, and if you’d asked me in the beginning I would have thought “Oh, I’m going to have to write a huge bible of negative space of all the things that happen in between,” you’ll have to issue these other memos and that’s a whole other month of writing and\u003cem\u003e no\u003c/em\u003e, \u003cem\u003eno\u003c/em\u003e.\u003c/p\u003e\n\n \u003cp\u003eI mean in episode four, Adria [Arjona] and Diego [Luna] really needed to know what had happened with the soldier and what the missions had been like. That jump was specific; they needed to know certain things but as we went along there were so few questions. The pickups, the beginning of the episodes where people were and what they were talking about, seemed to be so available that I never had to write a memo about it. I had some conversations about it but I never had to go back in and and do the heavy lifting I thought in the beginning, no.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eio9: Genevieve, was it really liberating to have that negative space and those broad strokes to find Mon in these formative years in building the rebellion? I found her moment of letting loose in particular in episode three so cathartic. Can you take me behind where you were in having that moment unfold for her?\u003c/strong\u003e\u003c/p\u003e\n\n \u003cp\u003e\u003cstrong\u003eGenevieve O’Reilly:\u003c/strong\u003e Yeah, I mean those first three episodes go over three days. It’s in her ancestral home, it’s within her family culture. I felt really steeped in her history there and we didn’t—like Tony said, there was there was very little exposition. It’s just: there she is, that’s the practice, that’s the ritual. We understand it implicitly and then moving through those three days of that wedding and the inter-complications of the family relationships with her daughter, with her husband, the in-laws and then having Luthen there—there was so much going on. And as we come to the pointy end of those three episodes you really feel the implications of where she is at that moment, not just with the weight of those familial kind—that rigorous tension of what that wedding was, but then with Luthen being there and coming in with a clear eye in regard to her friend Tay Colma.\u003c/p\u003e \u003cp\u003eWe know Tay Colma so well from season one, he was such a fierce ally of hers, and so we start season two with him very loose, very tethered, or she sees that in him. It’s like he’s seeing those false gold idols of Davos Sculdun, he’s drinking that in and he wants some of that for himself and that is an implicit threat.\u003c/p\u003e\n\n \u003cp\u003eOf course she sees the friend, she sees that’s maneuverable, but of course Luthen sees it much clearer—he’s much more brutal in his vision and he calls her on it. He calls her on her romanticism and he kind of really asks her to be honest with herself in regard to what rebellion really takes. He asks her to have that blood on her hands and she tacitly agrees, and so that moment that you’re talking about, that crescendo of movement and culture and celebration, is also a woman just wrestling with her own internal chaos.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eio9: it’s such a beautiful moment and the dancing and the drinking—Tony, what did you see as the strength and beauty of intercutting that with where everyone else is in that moment of crossroads?\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eGilroy:\u003c/strong\u003e My brother John, who’s been with me forever, who’s just the master builder, post-production builder—we built a lot of crescendos. We’ve learned how to build these crescendos in the movies we’ve made over the years and then we did it in season one, the funeral. So this is really going to be a very complicated crescendo, we’re using a piece of electronic dance music which is really unusual. I’m getting to juxtapose Cassian saving the day and Mon Mothma with blood on her hands with Eedy showing up for lunch. I get to do everything all at once.\u003c/p\u003e\n\n \u003cp\u003eI’m really pleased with the end of three. I’ll say one other thing about about Mon on the dance floor: it does another thing. It binds the audience to her because the only people in that room who know what’s going on are you and her. Everybody else is partying, everybody else is dancing, but you know what she’s into, and so that just creates what it does with the audience. I love how it binds the audience to the characters.\u003c/p\u003e \u003cp\u003e\u003ciframe loading=\"lazy\" title=\"ANDOR Season 2: Creator Tony Gilroy \u0026amp; Genevieve O\u0026#39;Reilly Discuss Events of Episode 3\" width=\"500\" height=\"281\" src=\"about:blank\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\" data-rocket-lazyload=\"fitvidscompatible\" data-lazy-src=\"https://www.youtube.com/embed/JMj2ZjyTnk0?feature=oembed\"\u003e\u003c/iframe\u003e\u003c/p\u003e \u003cp\u003e\u003cem\u003eAndor\u003c/em\u003e is now streaming on Disney+.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-04-24T22:00:43Z",
  "modifiedTime": "2025-04-24T22:00:43Z"
}
