{
  "id": "d99d2b77-8762-49ca-ac4b-c7cb0ebb2d8c",
  "title": "OpenAI’s secret weapon against Nvidia dependence takes shape",
  "link": "https://arstechnica.com/ai/2025/02/openais-secret-weapon-against-nvidia-dependence-takes-shape/",
  "description": "Chatbot maker partners with TSMC to manufacture custom AI chip, with plans for future iterations.",
  "author": "Benj Edwards",
  "published": "Mon, 10 Feb 2025 21:00:33 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "AI",
    "Biz \u0026 IT",
    "AI chips",
    "Broadcom",
    "ChatGPT",
    "chatgtp",
    "china",
    "GPUs",
    "machine learning",
    "NVIDIA",
    "openai",
    "Reuters",
    "Richard Ho",
    "sam altman",
    "Taiwan",
    "TSMC",
    "US government"
  ],
  "byline": "Benj Edwards",
  "length": 1444,
  "excerpt": "Chatbot maker partners with TSMC to manufacture custom AI chip, with plans for future iterations.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "OpenAI is entering the final stages of designing its long-rumored AI processor with the aim of decreasing the company's dependence on Nvidia hardware, according to a Reuters report released Monday. The ChatGPT creator plans to send its chip designs to Taiwan Semiconductor Manufacturing Co. (TSMC) for fabrication within the next few months, but the chip has not yet been formally announced. The OpenAI chip's full capabilities, technical details, and exact timeline are still unknown, but the company reportedly intends to iterate on the design and improve it over time, giving it leverage in negotiations with chip suppliers—and potentially granting the company future independence with a chip design it controls outright. In the past, we've seen other tech companies, such as Microsoft, Amazon, Google, and Meta, create their own AI acceleration chips for reasons that range from cost reduction to relieving shortages of AI chips supplied by Nvidia, which enjoys a near-market monopoly on high-powered GPUs (such as the Blackwell series) for data center use. In October 2023, we covered a report about OpenAI's intention to create its own AI accelerator chips for similar reasons, so OpenAI's custom chip project has been in the works for some time. In early 2024, OpenAI CEO Sam Altman also began spending considerable time traveling around the world trying to raise up to a reported $7 trillion to increase world chip fabrication capacity.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/ai_chip_illustration-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                      \n                      \n          \u003cp\u003eOpenAI is entering the final stages of designing its long-rumored AI processor with the aim of decreasing the company\u0026#39;s dependence on Nvidia hardware, according to a \u003ca href=\"https://www.reuters.com/technology/openai-set-finalize-first-custom-chip-design-this-year-2025-02-10/\"\u003eReuters report\u003c/a\u003e released Monday. The \u003ca href=\"https://arstechnica.com/information-technology/2023/11/chatgpt-was-the-spark-that-lit-the-fire-under-generative-ai-one-year-ago-today/\"\u003eChatGPT\u003c/a\u003e creator plans to send its chip designs to Taiwan Semiconductor Manufacturing Co. (TSMC) for fabrication within the next few months, but the chip has not yet been formally announced.\u003c/p\u003e\n\u003cp\u003eThe OpenAI chip\u0026#39;s full capabilities, technical details, and exact timeline are still unknown, but the company reportedly intends to iterate on the design and improve it over time, giving it leverage in negotiations with chip suppliers—and potentially granting the company future independence with a chip design it controls outright.\u003c/p\u003e\n\u003cp\u003eIn the past, we\u0026#39;ve seen other tech companies, such as \u003ca href=\"https://arstechnica.com/information-technology/2023/11/microsoft-launches-custom-chips-to-accelerate-its-plans-for-ai-domination/\"\u003eMicrosoft\u003c/a\u003e, \u003ca href=\"https://arstechnica.com/ai/2024/11/amazon-ready-to-use-its-own-ai-chips-reduce-its-dependence-on-nvidia/\"\u003eAmazon\u003c/a\u003e, \u003ca href=\"https://fortune.com/2024/04/09/google-building-ai-chips-axion-amin-vahdat-nvidia-h100-intel-gaudi-3/\"\u003eGoogle\u003c/a\u003e, and \u003ca href=\"https://www.reuters.com/technology/meta-debuts-new-generation-ai-chip-2024-04-10/\"\u003eMeta\u003c/a\u003e, create their own AI acceleration chips for reasons that range from cost reduction to relieving shortages of AI chips supplied by Nvidia, which enjoys a \u003ca href=\"https://arstechnica.com/tech-policy/2024/08/nvidias-dominance-puts-ai-industry-in-dire-danger-groups-warn-doj/\"\u003enear-market monopoly\u003c/a\u003e on high-powered GPUs (such as the \u003ca href=\"https://arstechnica.com/information-technology/2024/03/nvidia-unveils-blackwell-b200-the-worlds-most-powerful-chip-designed-for-ai/\"\u003eBlackwell series\u003c/a\u003e) for data center use.\u003c/p\u003e\n\u003cp\u003eIn October 2023, \u003ca href=\"https://arstechnica.com/information-technology/2023/10/openai-may-jump-into-ai-hardware-amid-high-costs-supply-constraints/\"\u003ewe covered a report\u003c/a\u003e about OpenAI\u0026#39;s intention to create its own AI accelerator chips for similar reasons, so OpenAI\u0026#39;s custom chip project has been in the works for some time. In early 2024, OpenAI CEO Sam Altman also began spending considerable time traveling around the world \u003ca href=\"https://arstechnica.com/information-technology/2024/02/report-sam-altman-seeking-trillions-for-ai-chip-fabrication-from-uae-others/\"\u003etrying to raise\u003c/a\u003e up to a reported $7 trillion to increase world chip fabrication capacity.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-02-10T21:00:33Z",
  "modifiedTime": "2025-02-10T21:13:08Z"
}
