{
  "id": "dd70f3ec-16ae-400b-bb67-c8aa4dae9779",
  "title": "Why Some TikTok Users Are Fleeing to RedNote, Another Chinese Social Media App",
  "link": "https://lifehacker.com/tech/what-is-rednote-or-xiaohongshu?utm_medium=RSS",
  "description": "\"Xiaohongshu\" is currently the most popular free app in the U.S.",
  "author": "Jake Peterson",
  "published": "Tue, 14 Jan 2025 22:30:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Mobile Apps"
  ],
  "byline": "Jake Peterson",
  "length": 7337,
  "excerpt": "\"Xiaohongshu\" is currently the most popular free app in the U.S.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "\"Xiaohongshu\" is currently the most popular free app in the U.S. Credit: Robert Way / Shutterstock.com TikTok's future in the United States is looking more uncertain than ever. With a potential ban just days away, angry TikTok users are looking for alternatives—and they're not all turning to American-based platforms like Instagram.Instead, these users, who dub themselves \"TikTok refugees,\" are looking to stick it to the U.S. government, who is trying to ban their favorite app over issues of national security. TikTok's parent company is ByteDance, which is based in China. As such, the TikTok refugees are largely targeting social media platforms that are also run by companies based in China. An app called RedNote is one of the most prominent options getting attention. Perhaps that's an understatement: As of this writing, RedNote is the number one app on both the iOS App Store and Google Play Store.What is RedNote?RedNote's Chinese name is Xiaohongshu, which translates to \"Little Red Book.\" (Also the name of the collection of writings of Chinese political revolutionary Mao Zedong.) It's a popular social media app in its native country, created in 2013 by developer Xingyin Information Technology. It is similar to, but not an exact replica of TikTok. Like TikTok, RedNote hosts short-form videos you can scroll through endlessly. But in addition to videos, the app also lets you create collaborative \"boards,\" and even shop in its in-app marketplace—though I'm not sure what the shipping costs would be to buy used furniture from across the world. At the end of the day, it's a social media experience, one that the U.S. government probably didn't anticipate would play host to disgruntled Americans. Of course, what's drawing the crowds are RedNote's TikTok-like short videos. I downloaded the app to see what the hullabaloo is all about. What data RedNote asks for when you install itAs far as privacy and security goes, the app will scrape your device ID, and developer Xingin can potentially use that to track you across other apps and websites. That's not great, but it's also not unusual: For context, TikTok also tracks your device ID, as well as your email address and phone number—two data points RedNote does not track. RedNote also collects other data points that are linked directly to you, including your purchases, search history, user ID, and contacts. Finally, the app takes a number of data points that are not directly linked to you, including your advertising data, product interaction, coarse location, product interaction, precise location, physical address, name, phone number, photos or videos, audio data, customer support info, user content, crash data, and performance data. It's worth noting again that plenty of apps ask for data points like this, both linked and not linked to your identity. It's your choice what you're comfortable with offering up, and there are always steps to take to prevent certain data from leaking from your device to the app. For example, you can use a VPN to mask your location and device ID, or disable your location settings for the app altogether; create an account through Apple and use Hide My Email to shield your email address from the app; disable photos and videos access for the app, except for specific pictures and clips you choose to share; and block the app from accessing your contacts, if you'd rather find your friends there one-by-one. What it's like using RedNote as an English speakerAs I scroll through the app, it largely looks like TikTok meets the Instagram Explore page. Indeed, RedNote's main feed is called \"Explore,\" a grid layout of different videos you can check out. Tap one, and it plays. Scroll down, and you can watch another video. If you've used a short-form video platform before, you'll get the gist pretty quick. In fact, there's a dedicated \"Trending\" tab, that is your basic short-form video experience. Of course, there are some feature unique to RedNote: Pinch in, and you clear the UI, to focus on the video at hand. Long-press, and you'll find a series of extra options, including \"Auto scroll,\" if scrolling by hand gets to be too much.In most respects, this is a short-form video app that anyone who has watched TikTok, Instagram Reels, or YouTube Shorts can understand quickly—perhaps minus actually reading a lot of the writing in it. Not only is the developer of this app based in China, the primary language of the app itself is reportedly Mandarin, which means most of the discourse on it is not in English. If you, like me, do not know a word of Chinese, you may miss out on things as you scroll through comments and captions in a language you don't understand. Of course, there are ways to translate elements of your display, but you might not have to: Part of the quirk of so many English-speaking American users flooding the app is that the Chinese-speaking users are now posting in English as well. Users from both countries have even been chatting and joking with one another: Chinese-based users are posting in English, saying that they're happy to see Americans, as their jobs as their \"Chinese spies\" will be saved. (Others are asking Americans for help with their English homework.) In general, users from both countries seem to be having a good time getting to know one another. This Tweet is currently unavailable. It might be loading or has been removed. As much buzz as RedNote is getting this week, it's obviously nowhere near as popular as TikTok, even in China: The former has 300 million active users, compared to TikTok's one billion. But should TikTok be banned in the U.S. next week, the app may lose its 170 million American users—at least the ones that don't use workarounds to keep the app alive. It will be interesting to see how RedNote continues to grow, and whether that growth will in turn inspire the U.S. government to try to ban it as well. If the TikTok ban is successful, it's not hard to see a RedNote ban become a reality, too. Jake Peterson Senior Technology Editor Jake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film \u0026 TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut. Read Jake's full bio",
  "image": "https://lifehacker.com/imagery/articles/01JHK2A4M563XSKTS4Z71HFCEP/hero-image.fill.size_1200x675.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n                            \u003cdiv data-ga-module=\"content-header\" aria-label=\"Content Header\"\u003e\n        \n        \n                    \u003cp\u003e\u0026#34;Xiaohongshu\u0026#34; is currently the most popular free app in the U.S.\u003c/p\u003e\n            \u003c/div\u003e\n            \n            \u003csection data-ga-module=\"content-body\"\u003e\n                            \n                \u003cimg src=\"https://lifehacker.com/imagery/articles/01JHK2A4M563XSKTS4Z71HFCEP/hero-image.fill.size_1248x702.v1736892198.png\" alt=\"A closeup of the RedNote/Xiaohongshu brand logo on a building in China\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01JHK2A4M563XSKTS4Z71HFCEP/hero-image.fill.size_400x225.v1736892198.png 400w, https://lifehacker.com/imagery/articles/01JHK2A4M563XSKTS4Z71HFCEP/hero-image.fill.size_800x450.v1736892198.png 800w, https://lifehacker.com/imagery/articles/01JHK2A4M563XSKTS4Z71HFCEP/hero-image.fill.size_1248x702.v1736892198.png 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\n                        \u003cp\u003e\u003cspan\u003eCredit: Robert Way / Shutterstock.com\u003c/span\u003e\n                            \u003c/p\u003e\n            \n    \u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003e\u003ca href=\"https://lifehacker.com/tech/tiktok-isnt-banned-yet\" target=\"_blank\"\u003eTikTok\u0026#39;s future in the United States is looking more uncertain than ever\u003c/a\u003e. With a potential ban just days away, angry TikTok users are looking for alternatives—and they\u0026#39;re not all turning to American-based platforms like Instagram.\u003c/p\u003e\u003cp\u003eInstead, these users, who dub themselves \u0026#34;\u003ca href=\"https://lifehacker.com/entertainment/what-happens-after-tiktok-the-out-of-touch-adults-guide-to-kid-culture\" target=\"_blank\"\u003eTikTok refugees\u003c/a\u003e,\u0026#34; are looking to stick it to the U.S. government, who is trying to ban their favorite app over issues of national security. TikTok\u0026#39;s parent company is ByteDance, which is based in China. As such, the TikTok refugees are largely targeting social media platforms that are also run by companies based in China. \u003c/p\u003e\u003cp\u003eAn app called RedNote is one of the most prominent options getting attention. Perhaps that\u0026#39;s an understatement: As of this writing, RedNote is the number one app on both the iOS App Store and Google Play Store.\u003c/p\u003e\u003ch2 id=\"what-is-rednote\"\u003eWhat is RedNote?\u003c/h2\u003e\u003cp\u003eRedNote\u0026#39;s Chinese name is Xiaohongshu, which translates to \u0026#34;Little Red Book.\u0026#34; (Also \u003ca href=\"https://www.bbc.com/news/magazine-34932800\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ethe name of the collection of writings of Chinese political revolutionary Mao Zedong\u003c/a\u003e.) It\u0026#39;s a popular social media app in its native country, created in 2013 by developer Xingyin Information Technology. It is similar to, but not an exact replica of TikTok. \u003c/p\u003e\u003cp\u003eLike TikTok, RedNote hosts short-form videos you can scroll through endlessly. But in addition to videos, the app also lets you create collaborative \u0026#34;boards,\u0026#34; and even shop in its in-app marketplace—though I\u0026#39;m not sure what the shipping costs would be to buy used furniture from across the world. At the end of the day, it\u0026#39;s a social media experience, one that the U.S. government probably didn\u0026#39;t anticipate would play host to disgruntled Americans. \u003c/p\u003e\u003cp\u003eOf course, what\u0026#39;s drawing the crowds are RedNote\u0026#39;s TikTok-like short videos. I downloaded the app to see what the hullabaloo is all about. \u003c/p\u003e\u003ch2 id=\"what-data-rednote-asks-for-when-you-install-it\"\u003eWhat data RedNote asks for when you install it\u003c/h2\u003e\u003cp\u003eAs far as privacy and security goes, the app will scrape your device ID, and developer Xingin can potentially use that to track you across other apps and websites. That\u0026#39;s not great, but it\u0026#39;s also not unusual: For context, TikTok also tracks your device ID, as well as your email address and phone number—two data points RedNote does not track. RedNote also collects other data points that are linked directly to you, including your purchases, search history, user ID, and contacts. Finally, the app takes a number of data points that are not directly linked to you, including your advertising data, product interaction, coarse location, product interaction, precise location, physical address, name, phone number, photos or videos, audio data, customer support info, user content, crash data, and performance data. \u003c/p\u003e\u003cp\u003eIt\u0026#39;s worth noting again that plenty of apps ask for data points like this, both linked and not linked to your identity. It\u0026#39;s your choice what you\u0026#39;re comfortable with offering up, and there are always steps to take to prevent certain data from leaking from your device to the app. For example, you can use a VPN to mask your location and device ID, or disable your location settings for the app altogether; create an account through Apple and use Hide My Email to shield your email address from the app; disable photos and videos access for the app, except for specific pictures and clips you choose to share; and block the app from accessing your contacts, if you\u0026#39;d rather find your friends there one-by-one. \u003c/p\u003e\u003ch2 id=\"what-its-like-using-rednote-as-an-english-speaker\"\u003eWhat it\u0026#39;s like using RedNote as an English speaker\u003c/h2\u003e\u003cp\u003eAs I scroll through the app, it largely looks like TikTok meets the Instagram Explore page. Indeed, RedNote\u0026#39;s main feed is called \u0026#34;Explore,\u0026#34; a grid layout of different videos you can check out. Tap one, and it plays. Scroll down, and you can watch another video. If you\u0026#39;ve used a short-form video platform before, you\u0026#39;ll get the gist pretty quick. In fact, there\u0026#39;s a dedicated \u0026#34;Trending\u0026#34; tab, that is your basic short-form video experience. Of course, there are some feature unique to RedNote: Pinch in, and you clear the UI, to focus on the video at hand. Long-press, and you\u0026#39;ll find a series of extra options, including \u0026#34;Auto scroll,\u0026#34; if scrolling by hand gets to be too much.\u003c/p\u003e\u003cp\u003eIn most respects, this is a short-form video app that anyone who has watched TikTok, Instagram Reels, or YouTube Shorts can understand quickly—perhaps minus actually reading a lot of the writing in it. Not only is the developer of this app based in China, the primary language of the app itself is reportedly Mandarin, which means most of the discourse on it is not in English. If you, like me, do not know a word of Chinese, you may miss out on things as you scroll through comments and captions in a language you don\u0026#39;t understand. \u003c/p\u003e\u003cp\u003eOf course, there are ways to translate elements of your display, but you might not have to: Part of the quirk of so many English-speaking American users flooding the app is that the Chinese-speaking users are now posting in English as well. Users from both countries have even been chatting and joking with one another: Chinese-based users are posting in English, saying that they\u0026#39;re happy to see Americans, \u003ca href=\"https://x.com/MissGinaDarling/status/1878653687192842562\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eas their jobs as their \u0026#34;Chinese spies\u0026#34; will be saved\u003c/a\u003e. (Others are \u003ca href=\"https://www.twitter.com/MissGinaDarling/status/1878881110664568935\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003easking Americans for help with their English homework\u003c/a\u003e.) In general, users from both countries seem to be having a good time getting to know one another. \u003c/p\u003e\u003cblockquote\u003e\n    \u003ca href=\"https://twitter.com/MissGinaDarling/status/1878881110664568935\" title=\"open in a new window\" target=\"_blank\" rel=\"noopener\"\u003e\n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \u003c/a\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eAs much buzz as RedNote is getting this week, it\u0026#39;s obviously nowhere near as popular as TikTok, even in China: \u003ca href=\"https://techcrunch.com/2025/01/13/xiaohongshu-rednote-chinas-answer-to-instagram-hits-no-1-on-the-app-store-as-tiktok-faces-us-shutdown/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eThe former has 300 million active users\u003c/a\u003e, compared to \u003ca href=\"https://www.nytimes.com/2024/03/15/business/china-tiktok-house-bill.html#:~:text=TikTok%20wields%20wide%20influence%20in,billion%20users%20across%20140%20countries.\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eTikTok\u0026#39;s one \u003cem\u003ebillion\u003c/em\u003e\u003c/a\u003e. But should TikTok be banned in the U.S. next week, the app may lose its 170 million American users—at least the ones that \u003ca href=\"https://lifehacker.com/tech/how-to-use-tiktok-if-its-banned-in-the-us\" target=\"_blank\"\u003edon\u0026#39;t use workarounds to keep the app alive\u003c/a\u003e. It will be interesting to see how RedNote continues to grow, and whether that growth will in turn inspire the U.S. government to try to ban it as well. If the TikTok ban is successful, it\u0026#39;s not hard to see a RedNote ban become a reality, too. \u003c/p\u003e\n    \u003c/article\u003e\n\n    \n                        \u003cdiv\u003e\n                \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/authors/01HF2FBCM600PS5NXSJXJA1AKJ/image.fill.size_150x150.v1704301306.png\" alt=\"artist rendition of Jake Peterson\" width=\"150\" height=\"150\" loading=\"lazy\"/\u003e\n                                            \u003c/p\u003e\n                \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003cp\u003eJake Peterson\u003c/p\u003e\n                                    \u003cp\u003eSenior Technology Editor\u003c/p\u003e\n                                \u003cdiv\u003e\n                                            \u003cp\u003eJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film \u0026amp; TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the \u003ca href=\"https://lifehacker.com/tech/living-with-ai\" target=\"_blank\"\u003ebest uses of AI in your daily life\u003c/a\u003e to \u003ca href=\"https://lifehacker.com/okay-which-macbook-should-you-buy-1849330413\" target=\"_blank\"\u003ewhich MacBook to buy\u003c/a\u003e. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\u003c/p\u003e\n                                    \u003c/div\u003e\n                \u003cp\u003e\u003ca href=\"https://lifehacker.com/author/jakepeterson\"\u003eRead Jake\u0026#39;s full bio\u003c/a\u003e\u003c/p\u003e\u003cul\u003e\n                                                                            \u003cli\u003e\n                                \u003ca href=\"https://twitter.com/@jakecpeterson\" title=\"Find on Twitter (Opens in a new tab)\" aria-label=\"Visit Jake\u0026#39;s Twitter\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-twitter\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                                                                                    \u003cli\u003e\n                                \u003ca href=\"https://lifehacker.com/cdn-cgi/l/email-protection#6a001a0f1e0f181905042a06030c0f020b09010f1844090507\" title=\"Send an Email (Opens in a new tab)\" aria-label=\"Send Jake an email\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-envelope\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                            \u003c/ul\u003e\n                            \u003c/div\u003e\n        \u003c/div\u003e\n                \u003cdiv\u003e\n                                            \n                        \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"1\" data-ga-label=\"Nintendo Music Is My Favorite App for Background Music\" href=\"https://lifehacker.com/tech/nintendo-is-making-its-music-available-via-a-new-app\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JBHH4NBCZAXS1KTDG4GWTYD5/hero-image.fill.size_75x75.v1730388646.jpg\" alt=\"nintendo music\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                    \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"2\" data-ga-label=\"How to Use TikTok in the US, Even When It\u0026#39;s Banned\" href=\"https://lifehacker.com/tech/how-to-use-tiktok-if-its-banned-in-the-us\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JHGEQQNTYV6XCKSCD249Z0XE/hero-image.fill.size_75x75.v1736799333.jpg\" alt=\"TikTok top app in the app store\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                                        \u003c/div\u003e\n            \u003c/div\u003e\n            \n    \n    \n                    \u003c/section\u003e\n\n                            \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-14T22:30:00Z",
  "modifiedTime": "2025-01-14T22:30:00Z"
}
