{
  "id": "e189cacb-1d3a-4fba-aa11-b696ec04d414",
  "title": "629: An Upsetting and Confusing Time to Be Me",
  "link": "https://atp.fm/629",
  "description": "🗣️ New ATP Member Special: ATP Tier List: Corporate Logos Tim Cook teaser History lesson Mac Studio General announcement M3 Ultra announcement M3 Ultra Ars Technica It is 2× M3 Max According to to 🇫🇷 website: no interposer in M4 Max Gurman in April 2024 M4 MacBook Air Announcement iPad 6GB RAM, as was foretold Gurman misssed on this one iPad Air Announcement Audio regression? Post-show: Casey does free labor for Apple John’s computer speakers are dying ☹️ Possible replacement #1: Kanto ORA Possible replacement #2: Kanto ORA4 Members-only ATP Overtime: Siri is falling ever-further behind Next-gen Siri is delayed? (14 February) Apple Intelligence Reaches Make-or-Break Point? (3 March) Siri remains trash Amazon steps up to the AI plate Interview with Panos Panay Sponsored by: DeleteMe: Making it quick, easy and safe to remove your personal data online. Squarespace: Save 10% off your first purchase of a website or domain using code atp. Become a member for ATP Overtime, ad-free episodes, member specials, and our early-release, unedited “bootleg” feed!",
  "author": "ATP",
  "published": "Fri, 07 Mar 2025 16:23:33 +0000",
  "source": "https://atp.fm/rss",
  "categories": null,
  "byline": "",
  "length": 132,
  "excerpt": "Three nerds discussing tech, Apple, programming, and loosely related matters.",
  "siteName": "",
  "favicon": "https://cdn.atp.fm/images/20231026-favicon-180.png",
  "text": "Three nerds discussing tech, Apple, programming, and loosely related matters. Hosted by Marco Arment, Casey Liss, and John Siracusa.",
  "image": "https://cdn.atp.fm/artwork",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThree nerds discussing tech, Apple, programming, and loosely related matters. Hosted by \u003ca href=\"https://marco.org/\"\u003eMarco Arment\u003c/a\u003e, \u003ca href=\"https://www.caseyliss.com/\"\u003eCasey Liss\u003c/a\u003e, and \u003ca href=\"https://hypercritical.co/\"\u003eJohn Siracusa\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
