{
  "id": "f0112b14-db46-4c61-ac37-c1849b287574",
  "title": "Medieval preacher invoked chivalric hero as a meme in sermon",
  "link": "https://arstechnica.com/science/2025/07/medieval-preacher-invoked-chivalric-hero-as-a-meme-in-sermon/",
  "description": "\"This is very early evidence of a preacher weaving pop culture into a sermon to keep his audience hooked.\"",
  "author": "Jennifer Ouellette",
  "published": "Tue, 15 Jul 2025 23:01:03 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Culture",
    "Science",
    "Chaucer",
    "cultural studies",
    "historical archaelogy",
    "History",
    "language history",
    "Literature",
    "medieval literature",
    "textual analysis"
  ],
  "byline": "Jennifer Ouellette",
  "length": 7562,
  "excerpt": "“This is very early evidence of a preacher weaving pop culture into a sermon to keep his audience hooked.”…",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Skip to content \"Some are wolves and some are adders\" \"This is very early evidence of a preacher weaving pop culture into a sermon to keep his audience hooked.\" The book, Peterhouse MS 255, open at the sermon's mention of Wade. Credit: University of Cambridge Medieval poet Geoffrey Chaucer twice made references to an early work featuring a Germanic mythological character named Wade. Only three lines survive, discovered buried in a sermon by a late 19th century scholar. There has been much debate over how to translate those fragments ever since, and whether the long-lost work was a monster-filled epic or a chivalric romance. Two Cambridge University scholars now say those lines have been \"radically misunderstood\" for 130 years, supplying their own translation—and argument in favor of a romance—in a new paper published in the Review of English Studies. We know such a medieval work once existed because it's referenced in other texts, most notably by Chaucer. He alludes to the \"tale of Wade\" in his epic poem Troilus and Criseyde and mentions \"Wade's boat [boot]\" in The Merchant's Tale—part of his masterpiece, The Canterbury Tales. A late 16th century editor of Chaucer's works, Thomas Speght, made a passing remark that Wade's boat was named \"Guingelot,\" and that Wade's \"strange exploits\" were \"long and fabulous,\" but didn't elaborate any further, no doubt assuming the tale was common knowledge and hence not worth retelling. Speght's truncated comment \"has often been called the most exasperating note ever written on Chaucer,\" F.N. Robinson wrote in 1933. So, the full story has been lost to history, although some remnant details have survived. For instance, there are mentions of Wade in an Old English poem, describing him as the son of a king and a \"serpent-legged mermaid.\" The Poetic Edda mentions Wade's son, Wayland, as well as Wayland's brothers Egil and Slagfin. Wade is also briefly referenced in Malory's Morte D'Arthur and a handful of other texts from around the same period. Fun fact: J.R.R. Tolkien based his Middle-earth character Earendil on Wade; Earendil sails across the sky in a magical ship called Wingelot (or Vingilot). In 1896, Cambridge medievalist M.R. James was compiling a catalogue of medieval sermons and noted a passage of English verse in the otherwise Latin text of one such manuscript. (Life imitated art: James was also a writer and had just published a ghost story the year before about a Cambridge antiquarian who discovered a book of rare, long-lost medieval texts.) He consulted a colleague, Israel Gollancz, who specialized in Middle English poetry for a translation: \"Some are elves and some are adders; some are sprites that dwell by waters: there is no man, but Hildebrand only.\" (Folk legends refer to Hidebrande as a giant and Wade's father, who begat him on a mermaid.) So they concluded the lines were from a lost early 13th century romantic poem they called The Song of Wade. But like Speght before them, James and Gollancz offered no further comment. A medieval meme Seb Falk (l) and James Wade (r) check out the manuscript, opened to the sermon. Credit: University of Cambridge To Seb Falk and James Wade, authors of the new paper, it's clear that Wade was a well-known chivalric hero throughout the entire period of Middle English romance, and a likely folk hero. They think of Wade as a kind of medieval meme. \"Romance writers invoke Wade as if he is meant to be recognizable as one of the greatest knights of chivalry,\" they wrote. The same appears to be true of the anonymous pastor who wrote the sermon containing the three-line fragment. “The sermon itself is really interesting,” said Falk. “It’s a creative experiment at a critical moment when preachers were trying to make their sermons more accessible and captivating. Here we have a late-12th century sermon deploying a meme from the hit romantic story of the day. This is very early evidence of a preacher weaving pop culture into a sermon to keep his audience hooked. I once went to a wedding where the vicar, hoping to appeal to an audience who he figured didn’t often go to church, quoted the Black Eyed Peas’ song ‘Where is the Love?’ in an obvious attempt to seem cool. Our medieval preacher was trying something similar to grab attention and sound relevant.” It's the translation of the word \"elves\" that is central to their new analysis. Based on their consideration of the lines in the context of the sermon (dubbed the Humiliamini sermon) as a whole, Falk and Wade believe the correct translation is \"wolves.\" The confusion arose, they suggest, because of a scribe's error while transcribing the sermon: specifically, the letters \"y\" (\"ylves\") and \"w\" became muddled. The sermon focuses on humility, playing up how humans have been debased since Adam and comparing human behaviors to animals: the cunning deceit of the adder, for example, the pride of lions, the gluttony of pigs, or the plundering of wolves. The text of the sermon. Credit: University of Cambridge Falk and Wade think translating the word as \"wolves\" resolves some of the perplexity surrounding Chaucer's references to Wade. The relevant passage in Troilus and Criseyde concerns Pandarus, uncle to Criseyde, who invites his niece to dinner and regales her with songs and the \"tale of Wade,\" in hopes of bringing the lovers together. A chivalric romance would serve this purpose better than a Germanic heroic epic evoking \"the mythological sphere of giants and monsters,\" the authors argue. The new translation makes more sense of the reference in The Merchant's Tale, too, in which an old knight argues for marrying a young woman rather than an older one because the latter are crafty and spin fables. The knight thus marries a much younger woman and ends up cuckolded. \"The tale becomes, effectively, an origin myth for all women knowing 'so muchel craft on Wades boot,'\" the authors wrote. And while they acknowledge that the evidence is circumstantial, Falk and Wade think they've identified the author of the Humiliamini sermon: late medieval writer Alexander Neckam, or perhaps an acolyte imitating his arguments and writing style. Review of English Studies, 2025. DOI: 10.1093/res/hgaf038  (About DOIs). Jennifer is a senior writer at Ars Technica with a particular focus on where science meets culture, covering everything from physics and related interdisciplinary topics to her favorite films and TV series. Jennifer lives in Baltimore with her spouse, physicist Sean M. Carroll, and their two cats, Ariel and Caliban. 4 Comments",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucerTOP-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"app\"\u003e\n    \u003cp\u003e\u003ca href=\"#main\"\u003e\n  Skip to content\n\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cmain id=\"main\"\u003e\n            \u003carticle data-id=\"2105638\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 40\"\u003e\u003cdefs\u003e\u003cclipPath id=\"section-science_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v40H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"section-science_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v40H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#section-science_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#section-science_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M39.6 34.5 28 14.6V4h1.1c.5 0 .9-.4.9-.9V.9c0-.5-.4-.9-.9-.9H10.9c-.5 0-.9.4-.9.9V3c0 .5.4.9.9.9H12v10.6L.4 34.5C-.9 37 .8 40 3.6 40h32.8c2.7 0 4.5-3 3.2-5.5M21.9 13.2c1.7 0 3 1.3 3 3s-1.3 3-3 3-3-1.3-3-3 1.3-3 3-3m-5-6c1.1 0 2 .9 2 2s-.9 2-2 2-2-.9-2-2 .9-2 2-2M4.1 36l6-10.3c.2-.3.5-.5.8-.5H13c-.1-.3-.2-.6-.2-1 0-1.7 1.3-3 3-3s3 1.3 3 3 0 .7-.2 1h4.2c0-1.1.9-2 2-2s2 .9 2 2h2.1c.3 0 .6.2.8.5l6 10.3H4.2Z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n  \u003c/span\u003e\n  \u003cspan\u003e\n    \u0026#34;Some are wolves and some are adders\u0026#34;\n  \u003c/span\u003e\n\u003c/p\u003e\n      \u003c/div\u003e\n\n      \n\n      \u003cp\u003e\n        \u0026#34;This is very early evidence of a preacher weaving pop culture into a sermon to keep his audience hooked.\u0026#34;\n      \u003c/p\u003e\n\n      \n    \u003c/div\u003e\n\n    \u003cdiv\u003e\n    \n    \u003cp\u003e\n      The book, Peterhouse MS 255, open at the sermon\u0026#39;s mention of Wade.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          University of Cambridge\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n  \u003c/div\u003e\n\u003c/header\u003e\n\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \n\u003cp\u003eMedieval poet Geoffrey Chaucer twice made references to an early work featuring a Germanic mythological character named \u003ca href=\"https://en.wikipedia.org/wiki/Wade_(folklore)\"\u003eWade\u003c/a\u003e. Only three lines survive, discovered buried in a sermon by a late 19th century scholar. There has been much debate over how to translate those fragments ever since, and whether the long-lost work was a monster-filled epic or a chivalric romance. Two Cambridge University scholars now say those lines have been \u0026#34;radically misunderstood\u0026#34; for 130 years, supplying their own translation—and argument in favor of a romance—in a new paper published in the Review of English Studies.\u003c/p\u003e\n\u003cp\u003eWe know such a medieval work once existed because it\u0026#39;s referenced in other texts, most notably by Chaucer. He alludes to the \u0026#34;tale of Wade\u0026#34; in his epic poem \u003ca href=\"https://en.wikipedia.org/wiki/Troilus_and_Criseyde\"\u003e\u003cem\u003eTroilus and Criseyde\u003c/em\u003e\u003c/a\u003e and mentions \u0026#34;Wade\u0026#39;s boat [\u003cem\u003eboot\u003c/em\u003e]\u0026#34; in \u003ca href=\"https://en.wikipedia.org/wiki/The_Merchant%27s_Tale\"\u003e\u003cem\u003eThe Merchant\u0026#39;s Tale\u003c/em\u003e\u003c/a\u003e—part of his masterpiece, \u003ca href=\"https://en.wikipedia.org/wiki/The_Canterbury_Tales\"\u003e\u003cem\u003eThe Canterbury Tales\u003c/em\u003e\u003c/a\u003e. A late 16th century editor of Chaucer\u0026#39;s works, \u003ca href=\"https://en.wikipedia.org/wiki/Thomas_Speght\"\u003eThomas Speght\u003c/a\u003e, made a passing remark that Wade\u0026#39;s boat was named \u0026#34;Guingelot,\u0026#34; and that Wade\u0026#39;s \u0026#34;strange exploits\u0026#34; were \u0026#34;long and fabulous,\u0026#34; but didn\u0026#39;t elaborate any further, no doubt assuming the tale was common knowledge and hence not worth retelling. Speght\u0026#39;s truncated comment \u0026#34;has often been called the most exasperating note ever written on Chaucer,\u0026#34; F.N. Robinson wrote in 1933.\u003c/p\u003e\n\u003cp\u003eSo, the full story has been lost to history, although some remnant details have survived. For instance, there are mentions of Wade in an Old English poem, describing him as the son of a king and a \u0026#34;serpent-legged mermaid.\u0026#34; The Poetic Edda mentions Wade\u0026#39;s son, \u003ca href=\"https://en.wikipedia.org/wiki/Wayland_the_Smith\"\u003eWayland\u003c/a\u003e, as well as Wayland\u0026#39;s brothers \u003ca href=\"https://en.wikipedia.org/wiki/Egil,_brother_of_Volund\"\u003eEgil\u003c/a\u003e and Slagfin. Wade is also briefly referenced in Malory\u0026#39;s \u003cem\u003eMorte D\u0026#39;Arthur\u003c/em\u003e and a handful of other texts from around the same period. Fun fact: J.R.R. Tolkien based his Middle-earth character \u003ca href=\"https://en.wikipedia.org/wiki/E%C3%A4rendil_and_Elwing\"\u003eEarendil\u003c/a\u003e on Wade; Earendil sails across the sky in a magical ship called Wingelot (or Vingilot).\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eIn 1896, Cambridge medievalist M.R. James was compiling a catalogue of medieval sermons and noted a passage of English verse in the otherwise Latin text of one such manuscript. (Life imitated art: James was also a writer and had just published a ghost story the year before about a Cambridge antiquarian who discovered a book of rare, long-lost medieval texts.)\u003c/p\u003e\n\u003cp\u003eHe consulted a colleague, Israel Gollancz, who specialized in Middle English poetry for a translation: \u0026#34;Some are elves and some are adders; some are sprites that dwell by waters: there is no man, but \u003ca href=\"https://en.wikipedia.org/wiki/Hildebrand\"\u003eHildebrand\u003c/a\u003e only.\u0026#34; (Folk legends refer to Hidebrande as a giant and Wade\u0026#39;s father, who begat him on a mermaid.) So they concluded the lines were from a lost early 13th century romantic poem they called \u003cem\u003eThe Song of Wade\u003c/em\u003e. But like Speght before them, James and Gollancz offered no further comment.\u003c/p\u003e\n\n\u003ch2\u003eA medieval meme\u003c/h2\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"427\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucer1-640x427.jpg\" alt=\"Seb Falk (l) and James Wade (r) check out the manuscript, opened to the sermon.\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucer1-640x427.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucer1-1024x684.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucer1-768x513.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucer1-980x654.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucer1.jpg 1200w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Seb Falk (l) and James Wade (r) check out the manuscript, opened to the sermon.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          University of Cambridge\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eTo Seb Falk and James Wade, authors of the new paper, it\u0026#39;s clear that Wade was a well-known chivalric hero throughout the entire period of Middle English romance, and a likely folk hero. They think of Wade as a kind of medieval meme. \u0026#34;Romance writers invoke Wade as if he is meant to be recognizable as one of the greatest knights of chivalry,\u0026#34; they wrote. The same appears to be true of the anonymous pastor who wrote the sermon containing the three-line fragment.\u003c/p\u003e\n\u003cp\u003e“The sermon itself is really interesting,” \u003ca href=\"https://www.eurekalert.org/news-releases/1090042?\"\u003esaid Falk\u003c/a\u003e. “It’s a creative experiment at a critical moment when preachers were trying to make their sermons more accessible and captivating. Here we have a late-12th century sermon deploying a meme from the hit romantic story of the day. This is very early evidence of a preacher weaving pop culture into a sermon to keep his audience hooked. I once went to a wedding where the vicar, hoping to appeal to an audience who he figured didn’t often go to church, quoted the Black Eyed Peas’ song ‘Where is the Love?’ in an obvious attempt to seem cool. Our medieval preacher was trying something similar to grab attention and sound relevant.”\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n\n        \n        \u003cdiv\u003e\n          \n          \n\u003cp\u003eIt\u0026#39;s the translation of the word \u0026#34;elves\u0026#34; that is central to their new analysis. Based on their consideration of the lines in the context of the sermon (dubbed the \u003cem\u003eHumiliamini\u003c/em\u003e sermon) as a whole, Falk and Wade believe the correct translation is \u0026#34;wolves.\u0026#34; The confusion arose, they suggest, because of a scribe\u0026#39;s error while transcribing the sermon: specifically, the letters \u0026#34;y\u0026#34; (\u0026#34;ylves\u0026#34;) and \u0026#34;w\u0026#34; became muddled. The sermon focuses on humility, playing up how humans have been debased since Adam and comparing human behaviors to animals: the cunning deceit of the adder, for example, the pride of lions, the gluttony of pigs, or the plundering of wolves.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"640\" height=\"396\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucer2-640x396.jpg\" alt=\"the text of the sermon\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucer2-640x396.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucer2-1024x633.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucer2-768x475.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucer2-980x606.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/chaucer2.jpg 1200w\" sizes=\"auto, (max-width: 640px) 100vw, 640px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      The text of the sermon.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          University of Cambridge\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eFalk and Wade think translating the word as \u0026#34;wolves\u0026#34; resolves some of the perplexity surrounding Chaucer\u0026#39;s references to Wade. The relevant passage in \u003cem\u003eTroilus and Criseyde\u003c/em\u003e concerns Pandarus, uncle to Criseyde, who invites his niece to dinner and regales her with songs and the \u0026#34;tale of Wade,\u0026#34; in hopes of bringing the lovers together. A chivalric romance would serve this purpose better than a Germanic heroic epic evoking \u0026#34;the mythological sphere of giants and monsters,\u0026#34; the authors argue.\u003c/p\u003e\n\u003cp\u003eThe new translation makes more sense of the reference in \u003cem\u003eThe Merchant\u0026#39;s Tale\u003c/em\u003e, too, in which an old knight argues for marrying a young woman rather than an older one because the latter are crafty and spin fables. The knight thus marries a much younger woman and ends up cuckolded. \u0026#34;The tale becomes, effectively, an origin myth for all women knowing \u0026#39;so muchel craft on Wades boot,\u0026#39;\u0026#34; the authors wrote.\u003c/p\u003e\n\u003cp\u003eAnd while they acknowledge that the evidence is circumstantial, Falk and Wade think they\u0026#39;ve identified the author of the \u003cem\u003eHumiliamini\u003c/em\u003e sermon: late medieval writer Alexander Neckam, or perhaps an acolyte imitating his arguments and writing style.\u003c/p\u003e\n\u003cp\u003eReview of English Studies, 2025. DOI: \u003ca href=\"http://dx.doi.org/10.1093/res/hgaf038\"\u003e10.1093/res/hgaf038\u003c/a\u003e  (\u003ca href=\"http://arstechnica.com/science/news/2010/03/dois-and-their-discontents-1.ars\"\u003eAbout DOIs\u003c/a\u003e).\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\n\n                  \n          \n\n\n\n\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n          \u003cp\u003e\u003ca href=\"https://arstechnica.com/author/jenniferouellette/\"\u003e\u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/08/arspic300.jpg\" alt=\"Photo of Jennifer Ouellette\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\n\n  \u003cdiv\u003e\n    \n\n    \u003cp\u003e\n      Jennifer is a senior writer at Ars Technica with a particular focus on where science meets culture, covering everything from physics and related interdisciplinary topics to her favorite films and TV series. Jennifer lives in Baltimore with her spouse, physicist Sean M. Carroll, and their two cats, Ariel and Caliban.\n    \u003c/p\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\n\n  \u003cp\u003e\n    \u003ca href=\"https://arstechnica.com/science/2025/07/medieval-preacher-invoked-chivalric-hero-as-a-meme-in-sermon/#comments\" title=\"4 comments\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 80 80\"\u003e\u003cdefs\u003e\u003cclipPath id=\"bubble-zero_svg__a\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"bubble-zero_svg__b\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#bubble-zero_svg__a)\"\u003e\u003cg fill=\"currentColor\" clip-path=\"url(#bubble-zero_svg__b)\"\u003e\u003cpath d=\"M80 40c0 22.09-17.91 40-40 40S0 62.09 0 40 17.91 0 40 0s40 17.91 40 40\"\u003e\u003c/path\u003e\u003cpath d=\"M40 40 .59 76.58C-.67 77.84.22 80 2.01 80H40z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n    4 Comments\n  \u003c/a\u003e\n      \u003c/p\u003e\n              \u003c/div\u003e\n  \u003c/article\u003e\n\n\n  \n\n\n  \n\n\n  \u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003ca href=\"https://arstechnica.com/tech-policy/2025/07/two-guys-hated-using-comcast-so-they-built-their-own-fiber-isp/\"\u003e\n              \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/07/prime-one-sam-alex-768x432-1752266029.jpg\" alt=\"Listing image for first story in Most Read: Two guys hated using Comcast, so they built their own fiber ISP\" decoding=\"async\" loading=\"lazy\"/\u003e\n            \u003c/a\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n  \u003c/main\u003e\n\n\n\n\n\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-07-15T23:01:03Z",
  "modifiedTime": "2025-07-15T20:14:45Z"
}
