{
  "id": "f1b45450-9132-411d-a4a5-59e53a234f68",
  "title": "Bridge to Nowhere",
  "link": "https://depth-first.com/articles/2024/05/24/bridge-to-nowhere/",
  "description": "Comments",
  "author": "",
  "published": "Wed, 09 Oct 2024 11:39:54 +0000",
  "source": "https://news.ycombinator.com/rss",
  "categories": null,
  "byline": "By Richard L. Apodaca",
  "length": 7602,
  "excerpt": "Taking a closer look at the opening act of a glioblastoma diagnosis.",
  "siteName": "",
  "favicon": "https://depth-first.com/images/favicon.png",
  "text": "2024-05-24T23:15:00Z On March 24, 2023 I was laying in a hospital bed for the first time in my life. I'd just been told that a team was being assembled for my upcoming brain surgery. I don't remember being asked if I wanted one. Rather, I was told that I would have one and that it would happen soon. The previous day I'd been shown an MRI of my brain. It revealed a tumor in my right parietal lobe. The thing was huge — about the size of a tennis ball. But I'd been told little else. I was told it could be malignant or it could be benign. That's where the surgery came in. Some kind of surgery was needed to obtain a tissue sample and through tests run on it learn some basic facts. Two options were presented: (1) a biopsy only; or (2) a surgery to remove the tumor with pathology to be performed on the removed tissue. Option (2) was recommended because it would remove the tumor and provide a sample for further characterization. What bothered me was the glaring absence of Option (3), which was to do nothing. I could simply get out of bed, pack my stuff together, walk out of the hospital, and never come back. Every decision I'd ever faced had an Option (3). Not being presented with it left me feeling railroaded. So I asked, \"What happens if I just skip surgery?\" The doctor assigned to my case responded without hesitation and with certainty. \"There is no 'no surgery.' You'll be dead in three months.\" In hindsight, this response should have set off alarm bells. If surgery was needed to determine what kind of tumor I had, why was the good doctor so certain of my prognosis if I declined surgery? I'd later find out that suspicion of glioblastoma is something that hospital staff hold close to the vest. Clearly the good doctor suspected glioblastoma but opted not to share that crucial information with their patient. But more than this I would come to learn that that I'd fallen into a trap of my own making. I'd assumed that surgery would allow me to return to the life I'd known before entering the Emergency Room. I wrongly viewed my choice as: refuse surgery and die in three months or have surgery and get on with the life I knew. Even with the risks that brain surgery must carry, the answer was clear. This may seem like a minor point, but it's quite important. The doctor never told me I could go back to the life I knew after surgery. I'd conjured that idea out of ignorance and fear. Today I'd know better. In particular I'd know to ask basic follow-up questions. One would be: \"You've given me a life expectancy without surgery. What's my life expectancy with surgery?\" Another would be \"What's likely to happen after a successful surgery?\" I'm not sure whether I would have chosen differently, but the choice would have been much better-informed. If the doctor were being honest, they might have said something like: \"Life expectancy after surgery depends on the kind of tumor. If it's glioblastoma, as I suspect but won't know for sure until pathology comes back, median survival is 12-18 months. If not, longer survival times are to be expected. As for post-surgery treatment, if you have glioblastoma you can expect a course of chemoradiotherapy as well as physical and cognitive therapy. Your recovery time would vary based on several factors, but would be measured in months. There is no remission for this kind of cancer. You'd always have it, it's extremely aggressive, and there is no cure. For these reasons glioblastoma is a terminal diagnosis.\" That's the kind of response that would allow someone like me to weigh the options properly. The kind of tumor I was suspected of having was going to kill me with or without surgery. Surgery might buy a year and change if I were lucky. But that's only if I underwent post-surgery treatment. My next questions would address that topic. From there I'm sure there would have been more questions. And that's the point. None of this back-and-forth would be compatible with getting me into surgery quickly. My medical report does state that a conversation like the one I would have wanted did take place — but right before my surgery. I don't remember having that conversation at all, nor did my family, who was with me in the hospital, witness it. And if the doctor were being completely candid, they would have told me that the recommended option, surgery to remove the tumor (\"resection\"), was a bridge to nowhere. Calling glioblastoma resection a \"bridge to nowhere\" might seem harsh. But before drawing that conclusion, consider how Wikipedia defines the term: A bridge to nowhere is a bridge where one or both ends are broken, incomplete, or unconnected to any roads. A glioblastoma resection is a bridge to nowhere in the sense that the post-surgery side is incomplete. One could argue that there are roads over there, but for the most part they themselves lead nowhere. If they did, glioblastoma would not be a terminal diagnosis and patients like me could actually return to their previous lives. I think the \"bridge to nowhere\" tag accurately describes what glioblastoma patients face with resection. The far end of the bridge is at best incomplete. What awaits patients going through the trauma of diagnosis and the decision to proceed with surgery are a broken standard of care and a hodgepodge of treatments that may work well enough to stave off death for a time, but which are far too ineffective to cure. There's a reason medical professionals beat the clinical trial drum so hard when glioblastoma patients are in earshot: they know that resection is a bridge to nowhere but can't bring themselves to speak so frankly. Clinical trials are the construction crew on the other side of the bridge to nowhere. See, something's going on over there! Surgery can buy time, but it can not yet change the outcome, which is death within months. Regardless of the treatment, glioblastoma is not the kind of cancer you beat. It's the kind of cancer that kills you. Along the way to certain death you'll experience varying degrees of suffering. If the mess at the far end of the resection bridge were plainly laid out for patients thinking of hopping onto the onramp anyway, that would be one thing. The decision could then be made with a clear understanding of the cost and benefits. But that's not what happened to me. According to the National Brain Tumor Society about 15,000 Americans will find themselves in the same boat I was in back in March 2023. They'll be laying in a hospital bed after speeding through the ER unimpeded. Then they'll be told there's something in their brain that must be surgically removed immediately. But they won't be told exactly what that surgery can buy. And they most definitely won't be told the probable cost. In case it's not clear, I'm not even talking about money, but rather suffering and anguish. The thousands of unfortunate souls each year who will go on to be diagnosed with glioblastoma deserve far better treatment in the first few days of the ordeal than my experience suggests they currently get. They deserve the truth — all of it. They deserve to be treated as capable adults. They don't need to be coddled as if the unvarnished truth will destroy their will to live. They don't deserve baseless praise for next-generation sequencing or the vaporware of personalized medicine. By all means, add the necessary verbiage about uncertainty and what's not known. But whatever you do, don't hide the basic facts. The current dismal state-of-the-art care means that for the vast majority of patients diagnosed with glioblastoma, surgery is a bridge to nowhere.",
  "image": "http://depth-first.com/images/posts/20240524/summary.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003carticle\u003e\n      \u003cheader\u003e\n        \n        \n          \u003ctime datetime=\"2024-05-24T23:15:00Z\"\u003e2024-05-24T23:15:00Z\u003c/time\u003e\n      \u003c/header\u003e\n      \u003cp\u003eOn March 24, 2023 I was laying in a hospital bed for the first time in my life. I\u0026#39;d just been told that a team was being assembled for my upcoming brain surgery. I don\u0026#39;t remember being asked if I wanted one. Rather, I was \u003cem\u003etold\u003c/em\u003e that I would have one and that it would happen soon.\u003c/p\u003e\n\u003cp\u003eThe previous day I\u0026#39;d been shown an MRI of my brain. It revealed \u003ca href=\"https://depth-first.com/articles/2023/05/27/the-scary-stuff/\"\u003ea tumor in my right parietal lobe\u003c/a\u003e. The thing was \u003cem\u003ehuge\u003c/em\u003e — about the size of a tennis ball.\u003c/p\u003e\n\u003cp\u003eBut I\u0026#39;d been told little else. I was told it could be malignant or it could be benign. That\u0026#39;s where the surgery came in. Some kind of surgery was needed to obtain a tissue sample and through tests run on it learn some basic facts. Two options were presented: (1) a biopsy only; or (2) a surgery to remove the tumor with pathology to be performed on the removed tissue. Option (2) was recommended because it would remove the tumor and provide a sample for further characterization.\u003c/p\u003e\n\u003cp\u003eWhat bothered me was the glaring absence of Option (3), which was to do nothing. I could simply get out of bed, pack my stuff together, walk out of the hospital, and never come back. Every decision I\u0026#39;d ever faced had an Option (3). Not being presented with it left me feeling railroaded.\u003c/p\u003e\n\u003cp\u003eSo I asked, \u0026#34;What happens if I just skip surgery?\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe doctor assigned to my case \u003ca href=\"https://depth-first.com/articles/2023/05/29/youll-be-dead-in-three-months-without-brain-surgery/\"\u003eresponded without hesitation and with certainty\u003c/a\u003e. \u0026#34;There is no \u0026#39;no surgery.\u0026#39; You\u0026#39;ll be dead in three months.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn hindsight, this response should have set off alarm bells. If surgery was needed to determine what kind of tumor I had, why was the good doctor so certain of my prognosis if I declined surgery? I\u0026#39;d later find out that suspicion of glioblastoma is something that hospital staff \u003ca href=\"https://depth-first.com/articles/2023/06/06/the-g-word/\"\u003ehold close to the vest\u003c/a\u003e. Clearly the good doctor suspected glioblastoma but opted not to share that crucial information with their patient.\u003c/p\u003e\n\u003cp\u003eBut more than this I would come to learn that that I\u0026#39;d fallen into a trap of my own making. I\u0026#39;d assumed that surgery would allow me to return to the life I\u0026#39;d known before entering the Emergency Room. I wrongly viewed my choice as: refuse surgery and die in three months or have surgery and get on with the life I knew. Even with the risks that brain surgery must carry, the answer was clear.\u003c/p\u003e\n\u003cp\u003eThis may seem like a minor point, but it\u0026#39;s quite important. The doctor never told me I could go back to the life I knew after surgery. I\u0026#39;d conjured that idea out of ignorance and fear.\u003c/p\u003e\n\u003cp\u003eToday I\u0026#39;d know better. In particular I\u0026#39;d know to ask basic follow-up questions. One would be: \u0026#34;You\u0026#39;ve given me a life expectancy without surgery. What\u0026#39;s my life expectancy with surgery?\u0026#34; Another would be \u0026#34;What\u0026#39;s likely to happen after a successful surgery?\u0026#34;\u003c/p\u003e\n\u003cp\u003eI\u0026#39;m not sure whether I would have chosen differently, but the choice would have been much better-informed.\u003c/p\u003e\n\u003cp\u003eIf the doctor were being honest, they might have said something like: \u0026#34;Life expectancy after surgery depends on the kind of tumor. If it\u0026#39;s glioblastoma, as I suspect but won\u0026#39;t know for sure until pathology comes back, median survival is 12-18 months. If not, longer survival times are to be expected. As for post-surgery treatment, if you have glioblastoma you can expect a course of chemoradiotherapy as well as physical and cognitive therapy. Your recovery time would vary based on several factors, but would be measured in months. There is no remission for this kind of cancer. You\u0026#39;d always have it, it\u0026#39;s extremely aggressive, and there is no cure. For these reasons glioblastoma is a terminal diagnosis.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThat\u0026#39;s the kind of response that would allow someone like me to weigh the options properly. The kind of tumor I was suspected of having was going to kill me with or without surgery. Surgery might buy a year and change if I were lucky. But that\u0026#39;s only if I underwent post-surgery treatment. My next questions would address that topic. From there I\u0026#39;m sure there would have been more questions.\u003c/p\u003e\n\u003cp\u003eAnd that\u0026#39;s the point. None of this back-and-forth would be compatible with getting me into surgery quickly. My medical report does state that a conversation like the one I would have wanted did take place — but right before my surgery. I don\u0026#39;t remember having that conversation at all, nor did my family, who was with me in the hospital, witness it.\u003c/p\u003e\n\u003cp\u003eAnd if the doctor were being completely candid, they would have told me that the recommended option, surgery to remove the tumor (\u0026#34;resection\u0026#34;), was a bridge to nowhere.\u003c/p\u003e\n\u003cp\u003eCalling glioblastoma resection a \u0026#34;bridge to nowhere\u0026#34; might seem harsh. But before drawing that conclusion, consider how \u003ca href=\"https://en.wikipedia.org/wiki/Bridge_to_nowhere\"\u003eWikipedia defines the term\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n  \u003cp\u003eA bridge to nowhere is a bridge where one or both ends are broken, incomplete, or unconnected to any roads.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eA glioblastoma resection is a bridge to nowhere in the sense that the post-surgery side is incomplete. One could argue that there are roads over there, but for the most part they themselves lead nowhere. If they did, glioblastoma would not be a terminal diagnosis and patients like me could actually return to their previous lives.\u003c/p\u003e\n\u003cp\u003eI think the \u0026#34;bridge to nowhere\u0026#34; tag accurately describes what glioblastoma patients face with resection. The far end of the bridge is at best incomplete. What awaits patients going through the trauma of diagnosis and the decision to proceed with surgery are a \u003ca href=\"https://depth-first.com/articles/2023/07/10/glioblastomas-dismal-standard-of-care-the-stupp-protocol/\"\u003ebroken standard of care\u003c/a\u003e and a hodgepodge of treatments that may work well enough to stave off death for a time, but which are far too ineffective to cure. There\u0026#39;s a reason medical professionals beat the clinical trial drum so hard when glioblastoma patients are in earshot: they know that resection is a bridge to nowhere but can\u0026#39;t bring themselves to speak so frankly. Clinical trials are the construction crew on the other side of the bridge to nowhere. See, something\u0026#39;s going on over there!\u003c/p\u003e\n\u003cp\u003eSurgery can buy time, but it can not yet change the outcome, which is death within months. Regardless of the treatment, glioblastoma is not the kind of cancer you beat. It\u0026#39;s the kind of cancer that kills you. Along the way to certain death you\u0026#39;ll experience varying degrees of suffering.\u003c/p\u003e\n\u003cp\u003eIf the mess at the far end of the resection bridge were plainly laid out for patients thinking of hopping onto the onramp anyway, that would be one thing. The decision could then be made with a clear understanding of the cost and benefits.\u003c/p\u003e\n\u003cp\u003eBut that\u0026#39;s not what happened to me. According to the \u003ca href=\"https://braintumor.org/events/glioblastoma-awareness-day/about-glioblastoma/\"\u003eNational Brain Tumor Society\u003c/a\u003e about 15,000 Americans will find themselves in the same boat I was in back in March 2023. They\u0026#39;ll be laying in a hospital bed after speeding through the ER unimpeded. Then they\u0026#39;ll be told there\u0026#39;s something in their brain that must be surgically removed immediately. But they won\u0026#39;t be told exactly what that surgery can buy. And they most definitely won\u0026#39;t be told the probable cost. In case it\u0026#39;s not clear, I\u0026#39;m not even talking about money, but rather suffering and anguish.\u003c/p\u003e\n\u003cp\u003eThe thousands of unfortunate souls each year who will go on to be diagnosed with glioblastoma deserve far better treatment in the first few days of the ordeal than my experience suggests they currently get. They deserve the truth — all of it. They deserve to be treated as capable adults. They don\u0026#39;t need to be coddled as if the unvarnished truth will destroy their will to live. They don\u0026#39;t deserve baseless praise for next-generation sequencing or the vaporware of personalized medicine. By all means, add the necessary verbiage about uncertainty and what\u0026#39;s not known. But whatever you do, don\u0026#39;t hide the basic facts. The current dismal state-of-the-art care means that for the vast majority of patients diagnosed with glioblastoma, surgery is a bridge to nowhere.\u003c/p\u003e\n    \u003c/article\u003e\n\n      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": null,
  "modifiedTime": null
}
