{
  "id": "2feed2cb-f171-48db-a845-3ee3923967a7",
  "title": "Hallelujah! M4 MacBook Air fully supports 2 external displays",
  "link": "https://www.cultofmac.com/news/m4-macbook-air-displays",
  "description": "The M4 MacBook Air breaks through a previous limitation on external displays, allowing for enhanced multi-screen setups for users. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
  "author": "Ed Hardy",
  "published": "Wed, 05 Mar 2025 21:01:14 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "News",
    "M4 chip",
    "MacBook Air"
  ],
  "byline": "Ed Hardy",
  "length": 2545,
  "excerpt": "The M4 MacBook Air breaks through a previous limitation on external displays, allowing for enhanced multi-screen setups for users.",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "News The M4 MacBook Air can drive more than one external display. Photo: Apple Users of the just-revealed M4 MacBook Air can connect two external screens to the notebook while also using the built-in display. In other words, the new Air breaks through a limitation that’s bothered many users since the debut of Apple silicon in 2020. It also brings this $999 model closer to parity with the M4 MacBook Pro, which starts at $1,599. M4 MacBook Air lets users view 3 displays at once MacBook Air is a consumer-oriented product. It’s designed to let users shop or scroll social media or maybe work on their homework. In Apple’s opinion, more than one external screen wasn’t a priority for this group. Those who want to set up some kind of “command center” with multiple external monitors could opt instead for a MacBook Pro — with Pro standing for “professional.” But that policy seems to have changed. Apple’s announcement on Wednesday of the M4 MacBook Air says, “It also offers support for up to two external displays in addition to the built-in display.” The tech specs for the new computer go into more detail. They state that it “simultaneously supports full native resolution on the built-in display at 1 billion colors and up to two external displays with up to 6K resolution at 60Hz.” The M4 MacBook Air sports a pair of USB-C ports with Thunderbolt 4. Two external monitors would occupy both of these (of course), but the notebook also has a MagSafe port for charging, as necessary. A years-long limitation Back in the days of the 2019 MacBook Air, it was possible to connect two external displays while also using the laptop’s built-in one. But that computer ran on an Intel processor, and the debut of the Apple M1 chip the next year brought support for multiple external monitors in the MacBook Air to an end. And as years went by and the M2 and M3 chips appeared in successive MacBook Air models, only two screens in total were ever supported in the consumer-oriented laptop. That said, the M3-based model does offer a trick: closing the laptop’s clamshell to shut off the internal display allows two external ones to be used. But still, only two screens. Just so there’s no confusion, Apple notebooks running more powerful Pro and Max chips can handle more screens. Up to four. But that didn’t help the Air. Which means, at this point, out of the recent MacBook Air lineup, only the M4 model can handle two external screens while the built-in display stays active.",
  "image": "https://www.cultofmac.com/wp-content/uploads/2025/03/Apple-MacBook-Air-multitasking-and-multidisplay-250305-1440x810.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-892106\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/news\" title=\"News\" aria-label=\"News articles\"\u003eNews\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"Hallelujah! M4 MacBook Air fully supports 2 external displays\" src=\"https://www.cultofmac.com/wp-content/uploads/2025/03/Apple-MacBook-Air-multitasking-and-multidisplay-250305-1020x574.jpg.webp\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2025/03/Apple-MacBook-Air-multitasking-and-multidisplay-250305-768x432.jpg.webp 768w, https://www.cultofmac.com/wp-content/uploads/2025/03/Apple-MacBook-Air-multitasking-and-multidisplay-250305-1440x810.jpg.webp 1440w, https://www.cultofmac.com/wp-content/uploads/2025/03/Apple-MacBook-Air-multitasking-and-multidisplay-250305-1020x574.jpg.webp 1020w, https://www.cultofmac.com/wp-content/uploads/2025/03/Apple-MacBook-Air-multitasking-and-multidisplay-250305.jpg.webp 2040w\" sizes=\"(max-width: 768px) 768px, (max-width: 1020px) 1020px, 2040px\" alt=\"M4 MacBook Air with two Apple Studio Displays\" data-ratio=\"1.7777777777778\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\tThe M4 MacBook Air can drive more than one external display. \u003cbr/\u003e\u003cem\u003ePhoto: Apple\u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003eUsers of the just-revealed M4 MacBook Air can connect two external screens to the notebook while also using the built-in display. In other words, the new Air breaks through a limitation that’s bothered many users since the debut of Apple silicon in 2020.\u003c/p\u003e\n\u003cp\u003eIt also brings this $999 model closer to parity with the M4 MacBook Pro, which starts at $1,599.\u003cspan id=\"more-892106\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003eM4 MacBook Air lets users view 3 displays at once\u003c/h2\u003e\n\u003cp\u003eMacBook Air is a consumer-oriented product. It’s designed to let users shop or scroll social media or maybe work on their homework. In Apple’s opinion, more than one external screen wasn’t a priority for this group. Those who want to set up some kind of “command center” with multiple external monitors could opt instead for a MacBook Pro — with Pro standing for “professional.”\u003c/p\u003e\n\u003cp\u003eBut that policy seems to have changed. Apple’s announcement on Wednesday of the \u003ca href=\"https://www.cultofmac.com/news/m4-macbook-air\" data-lasso-id=\"1641710635\"\u003eM4 MacBook Air\u003c/a\u003e says, “It also offers support for up to two external displays in addition to the built-in display.”\u003c/p\u003e\n\u003cp\u003eThe \u003ca href=\"https://www.apple.com/macbook-air/specs/\" data-lasso-id=\"1641710636\" target=\"_blank\"\u003etech specs for the new computer\u003c/a\u003e go into more detail. They state that it “simultaneously supports full native resolution on the built-in display at 1 billion colors and up to two external displays with up to 6K resolution at 60Hz.”\u003c/p\u003e\n\u003cp\u003eThe M4 MacBook Air sports a pair of USB-C ports with Thunderbolt 4. Two external monitors would occupy both of these (of course), but the notebook also has a MagSafe port for charging, as necessary.\u003c/p\u003e\n\u003ch3\u003eA years-long limitation\u003c/h3\u003e\n\u003cp\u003eBack in the days of \u003ca href=\"https://www.cultofmac.com/news/apple-true-tone-macbook-air-faster-chips-macbook-pro\" data-lasso-id=\"1641710637\"\u003ethe 2019 MacBook Air\u003c/a\u003e, it was possible to connect two external displays while also using the laptop’s built-in one. But that computer ran on an Intel processor, and the debut of the Apple M1 chip the next year brought support for multiple external monitors in the MacBook Air to an end.\u003c/p\u003e\n\u003cp\u003eAnd as years went by and the M2 and M3 chips appeared in successive MacBook Air models, only two screens in total were ever supported in the consumer-oriented laptop. That said, the M3-based model does offer a trick: closing the laptop’s clamshell to shut off the internal display allows two external ones to be used. But still, only two screens.\u003c/p\u003e\n\u003cp\u003eJust so there’s no confusion, Apple notebooks running more powerful Pro and Max chips can handle more screens. \u003ca href=\"https://www.cultofmac.com/news/apple-macbook-pro-support-multiple-external-displays-number\" data-lasso-id=\"1641710638\"\u003eUp to four\u003c/a\u003e. But that didn’t help the Air.\u003c/p\u003e\n\u003cp\u003eWhich means, at this point, out of the recent MacBook Air lineup, only the M4 model can handle two external screens while the built-in display stays active.        \u003c/p\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-05T21:01:14Z",
  "modifiedTime": null
}
