{
  "id": "38203f41-27eb-442e-9bb9-7ea0001faf92",
  "title": "Apple security chief found not guilty of bribery charges over firearm permits",
  "link": "https://appleinsider.com/articles/25/04/03/apple-security-chief-found-not-guilty-of-bribery-charges-over-firearm-permits?utm_medium=rss",
  "description": "Apple security chief Thomas Moyer was accused of bribery after allegedly attempting to donate iPads in return for concealed firearm permits, but has been found not guilty.Apple security chief Thomas Moyer. Image source: LinkedInIt's been an incredibly long few years for the head of global security at Apple, Thomas Moyer, as he was accused of bribing officials in exchange for firearm permits in 2020. The case was dismissed in 2021, but then reopened in 2023 when the Santa Clara District Attorney's Office appealed.The case has run its course, and according to information provided by Moyer's attorneys to AppleInsider, Moyer was found not guilty of bribery charges. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Wesley Hilliard",
  "published": "Thu, 03 Apr 2025 00:10:44 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Wesley Hilliard",
  "length": 1755,
  "excerpt": "Apple security chief Thomas Moyer was accused of bribery after allegedly attempting to donate iPads in return for concealed firearm permits, but has been found not guilty.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Apple security chief Thomas Moyer was accused of bribery after allegedly attempting to donate iPads in return for concealed firearm permits, but has been found not guilty. It's been an incredibly long few years for the head of global security at Apple, Thomas Moyer, as he was accused of bribing officials in exchange for firearm permits in 2020. The case was dismissed in 2021, but then reopened in 2023 when the Santa Clara District Attorney's Office appealed. The case has run its course, and according to information provided by Moyer's attorneys to AppleInsider, Moyer was found not guilty of bribery charges. \"We are deeply grateful to the jury for bringing this misguided prosecution to an end. Tom Moyer is innocent and should never have been charged. Mr. Moyer is grateful for the support he received throughout this ordeal from Apple and, especially, from his family.\"The original accusation was that Moyer agreed to donate 200 iPads to the Sheriff's Office in exchange for concealed carry permits. Apple approved the donation, but it was scrapped once the investigation was launched by the District Attorney. When the case was originally dismissed, Judge Geffon said, \"There is simply no evidence that suddenly, on February 8, 2019, Moyer was told or believed that the permits would not be issued or released to the executive protection team unless the Sheriff's Office received something in exchange.\" Apple had confirmation that permits would be issued in 2018, which predates the alleged bribe attempt. The Santa Clara County Superior Court jury found Thomas Moyer not guilty, so the trial has officially concluded. Apple has not commented on the proceedings beyond an initial statement stating the company found no evidence of wrongdoing.",
  "image": "https://photos5.appleinsider.com/gallery/63195-131312-IMG_1962-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eApple security chief Thomas Moyer was accused of bribery after allegedly attempting to donate \u003ca href=\"https://appleinsider.com/inside/ipad\" title=\"iPad\" data-kpt=\"1\"\u003eiPads\u003c/a\u003e in return for concealed firearm permits, but has been found not guilty.\n\u003c/p\u003e\u003cp\u003eIt\u0026#39;s been an incredibly long few years for the head of global security at Apple, Thomas Moyer, as he was accused of bribing officials in exchange for firearm permits \u003ca href=\"https://appleinsider.com/articles/21/06/02/bribery-case-against-apple-security-chief-thomas-moyer-dismissed\"\u003ein 2020\u003c/a\u003e. The case \u003ca href=\"https://appleinsider.com/articles/21/06/02/bribery-case-against-apple-security-chief-thomas-moyer-dismissed\"\u003ewas dismissed\u003c/a\u003e in 2021, but then \u003ca href=\"https://appleinsider.com/articles/23/08/28/apple-security-chief-must-face-bribery-charges-over-firearms-permits\"\u003ereopened in 2023\u003c/a\u003e when the Santa Clara District Attorney\u0026#39;s Office appealed.\n\u003c/p\u003e\u003cp\u003eThe case has run its course, and according to information provided by Moyer\u0026#39;s attorneys to \u003cem\u003eAppleInsider\u003c/em\u003e, Moyer was found not guilty of bribery charges.\n\u003c/p\u003e\u003cblockquote\u003e\u0026#34;We are deeply grateful to the jury for bringing this misguided prosecution to an end.  Tom Moyer is innocent and should never have been charged.  Mr. Moyer is grateful for the support he received throughout this ordeal from Apple and, especially, from his family.\u0026#34;\u003c/blockquote\u003e\u003cp\u003eThe original accusation was that Moyer agreed to donate 200 iPads to the Sheriff\u0026#39;s Office in exchange for concealed carry permits. Apple approved the donation, but it was scrapped once the investigation was launched by the District Attorney.\n\u003c/p\u003e\u003cp\u003eWhen the case was originally dismissed, Judge Geffon said, \u0026#34;There is simply no evidence that suddenly, on February 8, 2019, Moyer was told or believed that the permits would not be issued or released to the executive protection team unless the Sheriff\u0026#39;s Office received something in exchange.\u0026#34; Apple had confirmation that permits would be issued in 2018, which predates the alleged bribe attempt.\n\u003c/p\u003e\u003cp\u003eThe Santa Clara County Superior Court jury found Thomas Moyer not guilty, so the trial has officially concluded. Apple has not commented on the proceedings beyond an initial statement stating the company found no evidence of wrongdoing.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-03T00:10:44Z",
  "modifiedTime": null
}
