{
  "id": "425d8587-de8c-478d-9525-93e134ca9d41",
  "title": "Apple is reportedly redesigning the MacBook Pro next year, here’s what we’re expecting",
  "link": "https://9to5mac.com/2025/06/14/apple-macbook-pro-overhaul-2026-redesign-rumors/",
  "description": "Rumors strongly suggest that Apple will be MacBook Pro, and we’ll be delving into them here. more…",
  "author": "Michael Burkhardt",
  "published": "Sat, 14 Jun 2025 22:56:57 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Michael Burkhardt",
  "length": 3683,
  "excerpt": "Rumors strongly suggest that Apple will be overhauling the MacBook Pro in 2026, marking five years since the previous redesign...",
  "siteName": "9to5Mac",
  "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=192",
  "text": "Rumors strongly suggest that Apple will be overhauling the MacBook Pro in 2026, marking five years since the previous redesign that we know and love today. There are three key rumors to follow with this redesigned MacBook Pro, and we’ll be delving into them here. OLED display After debuting in the iPad Pro in 2024, Apple is expected to introduce OLED display technology to the MacBook Pro for the very first time with the redesign in 2026. This’ll provide higher brightness, better contrast ratios, and nicer colors to the MacBook Pro lineup for the very first time. Plus, according to TheElec, Apple will be using the same Tandem OLED display tech as the aforementioned iPad Pro: The OLED MacBook Air is also expected to get a standard single-stack display, rather than the more sophisticated Two-Stack Tandem displays we reported on for the MacBook Pro. Single-stack displays have one red, green and blue layer, while two-stack tandem OLED has a second RGB layer. Two layers stacked in tandem increases the brightness of the screen, while also increasing longevity. While transitioning to OLED, Apple may also ditch the notch, in favor of a smaller camera hole cutout. This information comes from Omdia, who describes it as a “rounded corner + hole cut.” The report doesn’t specify whether or not it’ll be a single hole punch, or something more similar to Dynamic Island on the iPhone. Either way, there won’t be as chunky of a cutout in your MacBook Pro display once the redesign arrives. Thinner design According to Bloomberg, Apple will be adopting a new, thinner design with the 2026 MacBook Pro. There aren’t many other details specified, so it’s unclear if the overall chassis design will change: Though Apple has continued to enhance the product with new chips and other internal improvements, the MacBook Pro probably won’t get another true overhaul until 2026. The company had once hoped to release this new version in 2025 — with a thinner design and a move to crisper OLED screens — but there were delays related to the display technology. Cutting-edge M6 chip Apple will also debut the M6 family of chips in this new MacBook Pro redesign. Currently, M6 is anticipated to be the first generation of Apple Silicon to adopt TSMC’s 2nm technology, alongside the A20 chip for iPhone. As per usual, we should see M6, M6 Pro, and M6 Max versions of the MacBook Pro, in both 14-inch and 16-inch sizes. With a new process node, we should see noticeable performance and efficiency gains. Wrap up Overall, the biggest feature of this upgrade is certainly the fact that the MacBook Pro will be adopting OLED. That said, I’ll certainly appreciate the thinner design – particularly on the 16-inch MacBook Pro, which currently comes in at 4.7 pounds. In case you aren’t too fond of waiting around a year and a half to buy a new MacBook Pro, there are some good discounts on the current M4 MacBook Pro models now that they’re around halfway through their lifespan. You can pick up an M4 14-inch for $1429, an M4 Pro 14-inch for $1779, or an M4 Pro 16-inch for $2249. These are all around $200 off compared to their typical prices. My favorite Apple accessory recommendations: Anker MagSafe 2-in-1 Wireless Charging Stand with Qi2 MOFT Magnetic Wallet Stand, fits up to 3 cards Logitech Brio 100 1080p Webcam for Mac AirTag 4-pack (on sale for 20% off!) SanDisk Extreme 2TB USB-C SSD, up to 1050MB/s Aulumu Vegan Leather Case for iPhone 16 Pro Follow Michael: X/Twitter, Bluesky, Instagram Add 9to5Mac to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/06/16-14-macbook-pro.jpg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"800\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2022/06/16-14-macbook-pro.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"Touchscreen Mac\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/06/16-14-macbook-pro.jpg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/06/16-14-macbook-pro.jpg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/06/16-14-macbook-pro.jpg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/06/16-14-macbook-pro.jpg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/figure\u003e\n\n\u003cp\u003eRumors strongly suggest that Apple will be \u003ca href=\"https://9to5mac.com/2024/11/03/apple-macbook-pro-redesign-2026/\"\u003eoverhauling\u003c/a\u003e the \u003ca href=\"https://amzn.to/4kGW989\"\u003eMacBook Pro\u003c/a\u003e in 2026, marking five years since the previous redesign that we know and love today. There are three key rumors to follow with this redesigned \u003ca href=\"https://amzn.to/4kGW989\"\u003eMacBook Pro\u003c/a\u003e, and we’ll be delving into them here.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-oled-display\"\u003eOLED display\u003c/h2\u003e\n\n\n\n\u003cp\u003eAfter debuting in the \u003ca href=\"https://amzn.to/4c9dqTX\"\u003eiPad Pro\u003c/a\u003e in 2024, Apple is expected to introduce \u003ca href=\"https://9to5mac.com/2025/02/11/samsung-report-confirms-timings-for-oled-macbook-pro-macbook-air-further-delayed/\"\u003eOLED \u003c/a\u003edisplay technology to the \u003ca href=\"https://amzn.to/4kGW989\"\u003eMacBook Pro\u003c/a\u003e for the very first time with the redesign in 2026. This’ll provide higher brightness, better contrast ratios, and nicer colors to the \u003ca href=\"https://amzn.to/4kGW989\"\u003eMacBook Pro\u003c/a\u003e lineup for the very first time.\u003c/p\u003e\n\n\n\n\u003cp\u003ePlus, \u003ca href=\"https://9to5mac.com/2025/02/11/samsung-report-confirms-timings-for-oled-macbook-pro-macbook-air-further-delayed/\"\u003eaccording to\u003c/a\u003e \u003cem\u003eTheElec\u003c/em\u003e, Apple will be using the same Tandem OLED display tech as the aforementioned iPad Pro:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThe OLED MacBook Air is also expected to get a standard single-stack display, rather than the more sophisticated \u003ca href=\"https://9to5mac.com/2022/09/06/oled-ipad-screen/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eTwo-Stack Tandem displays\u003c/a\u003e we reported on for the MacBook Pro.\u003c/p\u003e\n\n\n\n\u003cp\u003eSingle-stack displays have one red, green and blue layer, while two-stack tandem OLED has a second RGB layer. Two layers stacked in tandem increases the brightness of the screen, while also increasing longevity.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eWhile transitioning to OLED, Apple may also ditch the notch, in favor of a smaller camera hole cutout. This \u003ca href=\"https://9to5mac.com/2024/12/09/oled-macbook-pro-notch/\"\u003einformation\u003c/a\u003e comes from \u003cem\u003eOmdia\u003c/em\u003e, who describes it as a “rounded corner + hole cut.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe report doesn’t specify whether or not it’ll be a single hole punch, or something more similar to Dynamic Island on the iPhone. Either way, there won’t be as chunky of a cutout in your \u003ca href=\"https://amzn.to/4iRmM9D\"\u003eMacBook Pro\u003c/a\u003e display once the redesign arrives.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-thinner-design\"\u003eThinner design\u003c/h2\u003e\n\n\n\n\u003cp\u003eAccording to \u003cem\u003eBloomberg\u003c/em\u003e, Apple will be adopting a \u003ca href=\"https://9to5mac.com/2024/11/03/apple-macbook-pro-redesign-2026/\"\u003enew, thinner design\u003c/a\u003e with the 2026 MacBook Pro. There aren’t many other details specified, so it’s unclear if the overall chassis design will change:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThough Apple has continued to enhance the product with new chips and other internal improvements, the MacBook Pro probably won’t get another true overhaul until 2026. The company had once hoped to release this new version in 2025 — with a thinner design and a move to crisper OLED screens — but there were delays related to the display technology.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003ch2 id=\"h-cutting-edge-m6-chip\"\u003eCutting-edge M6 chip\u003c/h2\u003e\n\n\n\n\u003cp\u003eApple will also debut the M6 family of chips in this new \u003ca href=\"https://amzn.to/4iRmM9D\"\u003eMacBook Pro\u003c/a\u003e redesign. Currently, M6 is anticipated to be the first generation of Apple Silicon to adopt \u003ca href=\"https://9to5mac.com/2025/03/22/apple-iphone-18-2nm-a20-chip-kuo/\"\u003eTSMC’s 2nm technology\u003c/a\u003e, alongside the A20 chip for iPhone.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs per usual, we should see M6, M6 Pro, and M6 Max versions of the \u003ca href=\"https://amzn.to/4iRmM9D\"\u003eMacBook Pro\u003c/a\u003e, in both 14-inch and 16-inch sizes. With a new process node, we should see noticeable performance and efficiency gains.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-wrap-up\"\u003eWrap up\u003c/h2\u003e\n\n\n\n\n\t\u003cp\u003eOverall, the biggest feature of this upgrade is certainly the fact that the MacBook Pro will be adopting OLED. That said, I’ll certainly appreciate the thinner design – particularly on the \u003ca href=\"https://amzn.to/3TmOu2G\"\u003e16-inch MacBook Pro\u003c/a\u003e, which currently comes in at 4.7 pounds.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn case you aren’t too fond of waiting around a year and a half to buy a new MacBook Pro, there are some good discounts on the current \u003ca href=\"https://amzn.to/4l7827h\"\u003eM4 MacBook Pro\u003c/a\u003e models now that they’re around halfway through their lifespan. You can pick up an \u003ca href=\"https://amzn.to/4l7827h\"\u003eM4 14-inch for $1429\u003c/a\u003e, an \u003ca href=\"https://amzn.to/4jVaSeC\"\u003eM4 Pro 14-inch for $1779\u003c/a\u003e, or an\u003ca href=\"https://amzn.to/3TmOu2G\"\u003e M4 Pro 16-inch for $2249\u003c/a\u003e. These are all around $200 off compared to their typical prices.\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMy favorite Apple accessory recommendations:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/401kHkn\"\u003eAnker MagSafe 2-in-1 Wireless Charging Stand with Qi2\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://redirect.viglink.com/?key=0ab71bd42c2ca312a536dac167978a13\u0026amp;u=https%3A%2F%2Famzn.to%2F41h8skw\u0026amp;type=ap\u0026amp;loc=https%3A%2F%2F9to5toys.com%2F2025%2F02%2F13%2Fmoft-magnetic-wallet-stand-apple-iphone-magsafe-wallet-review%2F\u0026amp;ref=https%3A%2F%2Fwww.google.com%2F\"\u003eMOFT Magnetic Wallet Stand, fits up to 3 cards\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/45xW8i8\"\u003eLogitech Brio 100 1080p Webcam for Mac\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/3XCA3tQ\"\u003eAirTag 4-pack (on sale for 20% off!)\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/3DtypE6\"\u003eSanDisk Extreme 2TB USB-C SSD, up to 1050MB/s\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/4jF8DMG\"\u003eAulumu Vegan Leather Case for iPhone 16 Pro\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eFollow Michael: \u003ca href=\"https://x.com/mbrkhrdt\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eX/Twitter\u003c/a\u003e, \u003ca href=\"https://bsky.app/profile/michaelb.nyc\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBluesky\u003c/a\u003e, \u003ca href=\"https://instagram.com/m.brkhrdt\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eInstagram\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Mac to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cdiv\u003e\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://bit.ly/43RjEnY\"\u003e\u003cimg src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/06/iMazing_-WWDC25_9to5mac_750x150@2x.webp\" alt=\"\" width=\"1024\" height=\"205\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-14T22:56:57Z",
  "modifiedTime": "2025-06-14T23:14:01Z"
}
