{
  "id": "4697df73-02e6-4f98-bbb1-11f106e9db7d",
  "title": "Apple pursuing idea of an all-screen iPhone with a wrap around display",
  "link": "https://appleinsider.com/articles/21/10/05/apple-pursuing-idea-of-an-iphone-with-a-wrap-around-display?utm_medium=rss",
  "description": "Apple continues to research and protect the idea of an iPhone that features a curved touch-sensitive screen wrapping around the entire device.Detail from the patent showing one form of wraparound iPhone displayApple files countless patent applications every year, and it is granted something like countless minus one. Just because there's a patent, just because it's been granted, it does not follow that Apple will make whatever the idea is — except sometimes, surely, it must be very keen.Perhaps especially now when Apple has been granted a patent — that it has already been granted. This happens when the company puts through an amended version after the original is granted, and very often it's close to impossible to spot what has changed. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "William Gallagher",
  "published": "Tue, 22 Apr 2025 18:24:33 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "William Gallagher",
  "length": 2371,
  "excerpt": "Apple continues to research and protect the idea of an iPhone that features a curved touch-sensitive screen wrapping around the entire device.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "Apple continues to research and protect the idea of an iPhone that features a curved touch-sensitive screen wrapping around the entire device. Apple files countless patent applications every year, and it is granted something like countless minus one. Just because there's a patent, just because it's been granted, it does not follow that Apple will make whatever the idea is — except sometimes, surely, it must be very keen. Perhaps especially now when Apple has been granted a patent — that it has already been granted. This happens when the company puts through an amended version after the original is granted, and very often it's close to impossible to spot what has changed. Yet even the smallest reason behind a resubmission is a sign that Apple is serious about a research topic. \"Electronic device with wrap around display,\" is a yet-again granted patent. It's a yet-again patent, because this version comes after a series of others as Apple has repeatedly filed for patents on slightly different versions of this \"wraparound\" display idea. The newly-granted one was originally applied for in 2019. But a previous wraparound idea was filed as long ago as 2013. And 2020 saw at least two more. So if this is just some Apple employee's lunchtime hobby, they haven't half stuck with it. This version includes an element of flexibility, too, which means it may touch on issues that something like an iPhone fold would need. The patent refers to a flexible display within a transparent housing. That display could then be able to present images on any part of the screen. It's that business of presenting on any part of the device that Apple seems the most keen on. Apple says that it's a way of making the most of otherwise unused portions of a device, especially since space is at such a premium in a small device. The patent also describes methods of manufacturing the wraparound displaySpecifically, the regular form of an iPhone, or an iPad, \"leaves the sides and rear surfaces of the device [comparatively] unused,\" says Apple. So a wraparound display would better use the available surface area. The patent is chiefly about the theoretical process of manufacturing such a display, but what it describes is less an all-round, flexible one. What it could have, is a screen that moves with a device, being positioned at different parts of the chassis as wanted.",
  "image": "https://photos5.appleinsider.com/gallery/44872-87238-000-lead-Wraparound-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eApple continues to research and protect the idea of an \u003ca href=\"https://appleinsider.com/inside/iphone\"\u003eiPhone\u003c/a\u003e that features a curved touch-sensitive screen wrapping around the entire device.\n\u003c/p\u003e\u003cp\u003eApple files countless patent applications every year, and it is granted something like countless minus one. Just because there\u0026#39;s a patent, just because it\u0026#39;s been granted, it does not follow that Apple will make whatever the idea is —  except sometimes, surely, it must be very keen.\n\u003c/p\u003e\u003cp\u003ePerhaps especially now when Apple has been granted a patent —  that it has already been granted. This happens when the company puts through an amended version after the original is granted, and very often it\u0026#39;s close to impossible to spot what has changed.\n\u003c/p\u003e\u003cp\u003eYet even the smallest reason behind a resubmission is a sign that Apple is serious about a research topic. \u0026#34;Electronic device with wrap around display,\u0026#34; is a \u003ca href=\"https://ppubs.uspto.gov/api/pdf/downloadPdf/12282361?requestToken=eyJzdWIiOiIzNjdiNDhhMC1kMGFhLTQzMzEtYTQwOC0zZjFhYmNmMWJmMzMiLCJ2ZXIiOiIxZjJmZWQxMC03MzVjLTQxYWUtOWU3OS01YjgwNTA5ZjVmMjUiLCJleHAiOjB9\"\u003eyet-again granted patent\u003c/a\u003e. It\u0026#39;s a yet-again patent, because this version comes after a series of others as Apple has repeatedly filed for patents on slightly different versions of this \u0026#34;wraparound\u0026#34; display idea.\n\u003c/p\u003e\u003cp\u003eThe newly-granted one was originally applied for \u003ca href=\"https://appleinsider.com/articles/19/11/02/apple-again-investigating-wrap-around-display-for-iphone-another-patent-filing-has-revealed-that-apple-is-continuing-its-efforts-to-make-foldable-iphones-this-time-specifically-looking-to-make-use-of-the-sides-and-back-of-devices-apple-has-filed-a-fu\"\u003ein 2019\u003c/a\u003e. But a previous wraparound idea was filed as \u003ca href=\"https://appleinsider.com/articles/13/03/28/apple-looking-into-futuristic-device-with-wrap-around-display-and-seamless-glass-housing\"\u003elong ago as 2013\u003c/a\u003e. And 2020 saw \u003ca href=\"https://appleinsider.com/articles/20/02/21/apple-researching-all-glass-iphone-with-wraparound-touchscreen\"\u003eat least two more\u003c/a\u003e.\n\u003c/p\u003e\u003cp\u003eSo if this is just some Apple employee\u0026#39;s lunchtime hobby, they haven\u0026#39;t half stuck with it. This version includes an element of flexibility, too, which means it may touch on issues that something like an \u003ca href=\"https://appleinsider.com/inside/iphone-fold\"\u003eiPhone fold\u003c/a\u003e would need.\n\u003c/p\u003e\u003cp\u003eThe patent refers to a flexible display within a transparent housing. That display could then be able to present images on any part of the screen.\n\u003c/p\u003e\u003cp\u003eIt\u0026#39;s that business of presenting on any part of the device that Apple seems the most keen on. Apple says that it\u0026#39;s a way of making the most of otherwise unused portions of a device, especially since space is at such a premium in a small device.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/44872-87239-001-Assembly-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/44872-87239-001-Assembly-xl.jpg\" alt=\"The patent also describes methods of manufacturing the wraparound display\" height=\"714\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eThe patent also describes methods of manufacturing the wraparound display\u003c/span\u003e\u003c/p\u003e\u003cp\u003eSpecifically, the regular form of an iPhone, or an \u003ca href=\"https://appleinsider.com/inside/ipad\" title=\"iPad\" data-kpt=\"1\"\u003eiPad\u003c/a\u003e, \u0026#34;leaves the sides and rear surfaces of the device [comparatively] unused,\u0026#34; says Apple. So a wraparound display would better use the available surface area.\n\u003c/p\u003e\u003cp\u003eThe patent is chiefly about the theoretical process of manufacturing such a display, but what it describes is less an all-round, flexible one. What it could have, is a screen that moves with a device, being positioned at different parts of the chassis as wanted.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2021-10-05T13:18:00Z",
  "modifiedTime": null
}
