{
  "id": "49125fe6-6cf7-4451-9906-8a5b8410f821",
  "title": "Review: XREAL One’s are incredibly versatile, and they really come to life with the iPad Pro",
  "link": "https://9to5mac.com/2025/07/02/xreal-one-ar-glasses-review-versatile-with-m4-ipad-pro/",
  "description": "I’ve been reviewing one of XREAL’s more recent releases of AR glasses: the . These are certainly the most versatile pair of AR glasses I’ve tried out so far, and they actually really come to life somewhere you wouldn’t expect: the M4 iPad Pro running iPadOS 26. come in at just under 3 ounces (84 grams), making them easy to just carry around. more…",
  "author": "Michael Burkhardt",
  "published": "Thu, 03 Jul 2025 00:28:25 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Michael Burkhardt",
  "length": 5173,
  "excerpt": "I’ve been reviewing one of XREAL’s more recent releases of AR glasses: the XREAL One’s. These are certainly the most...",
  "siteName": "9to5Mac",
  "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=192",
  "text": "I’ve been reviewing one of XREAL’s more recent releases of AR glasses: the XREAL One’s. These are certainly the most versatile pair of AR glasses I’ve tried out so far, and they actually really come to life somewhere you wouldn’t expect: the M4 iPad Pro running iPadOS 26. XREAL One come in at just under 3 ounces (84 grams), making them easy to just carry around. Why I enjoy them Typically, when you think about plug-in AR glasses, you’re using it for one of two things. It’s either to mirror your phone screen to have a movie or show on a massive display, or to extend your laptop screen – that way you can work with a much larger surface than what a 14-inch display (give or take) would afford you. Usually, the iPad isn’t a big part of the equation, but I found myself loving the XREAL One glasses with my iPad. I personally use an 11-inch iPad Pro, and while that display size is great for portability and tablet usage – it does fall a bit short for productivity when I have it attached to my Magic Keyboard sometimes. The solution? XREAL One. Obviously, external displays exist too, but I’ve never been too keen on using my iPad at a desk, seeing as I could just use a Mac. XREAL One serve as a large high-resolution external display, and since it’s just a pair of glasses you can toss in your bag, they’re incredibly portable too. Plus, with iPadOS 26 introducing windowing on all supported iPad models, having an external display is more useful than ever. The XREAL One glasses are pretty plug and play, so once you plug them into your iPad Pro’s USB-C port, you’re off to the races. You can configure a few options on the glasses, but no app is required for setup, which I think is quite nice. Key specs These glasses utilize micro-OLED panels, similar to the ones you’d find on Apple Vision Pro. They get very bright, and they’re certainly very sharp. You get a 1920×1080 display per eye, resulting in over 4 million pixels overall. The displays also run at 120Hz for smooth visuals, and pack 600 nits of brightness – though they certainly feel a bit brighter than that to me. XREAL One’s offer electrochromic dimming, allowing you to adjust how much light can pass through with just the click of a button. You can either go “clear”, which allows all light to pass through – “shade”, which adds some more tint, or “theater”, which completely blacks out the glasses. It’s really nice that you can effectively use these as a pair of completely secluded glasses, in case you’re outdoors or whatnot. There’s also IPD-adjustment on-device, allowing you to tune things in for your own eyes. IPD (inter-pupillary distance) misalignments are the key reason for motion sickness with XR content, so this is an important feature. XREAL also totes built-in Bose speakers with support for Spatial Audio, though I’m personally more of an AirPods guy and typically don’t use built-in speakers on any of my devices. Standout features Beyond that, XREAL One also offer tracking. Most pairs of AR glasses that I’ve tried out just anchor your display to the center of your glasses, so if you move your head, your content also moves with you. While that can be desirable for certain use cases, it can get annoying at times. With “Anchor” mode, you can keep your display in one spot, that way if you turn your head to look at something else, your content is no longer in view. There’s also a level of tracking involved in “Follow” mode, so even if you prefer your content stay in view at all times, there’s a bit of gradual motion when you move your head around, so it doesn’t feel like your content is just stuck in one position. Last but not least, these glasses also offer the ability to run an Ultra Wide display. I haven’t used this feature a ton, but it’s there if ultra-wide displays are your thing and you just haven’t bothered buying one. Final thoughts At just $499, these are certainly a remarkable value for everything they offer. I’ve always felt that wired AR glasses make a lot of sense, seeing as you get to cut the added cost of on-board compute and battery. These definitely nail a lot of key aspects of the experience, and I’d absolutely recommend them if you’re looking for a well refined pair of AR glasses without spending too much money. Buy XREAL One (Standalone) on Amazon – $499 Buy XREAL One w/ included hub on Amazon – $539 Buy XREAL One w/ Beam Pro on Amazon – $699 Luckily, XREAL One’s have not yet been impacted by tariff-related price hikes. They were $499 when they launched, and still remain $499 today. Other XREAL glasses have been impacted, but there’s no news on the XREAL One’s as of now. My favorite Apple accessory recommendations: Anker MagSafe 2-in-1 Wireless Charging Stand with Qi2 MOFT Magnetic Wallet Stand, fits up to 3 cards Logitech Brio 100 1080p Webcam for Mac AirTag 4-pack (on sale for 20% off!) SanDisk Extreme 2TB USB-C SSD, up to 1050MB/s AirPods Pro 2 (USB-C) Follow Michael: X/Twitter, Bluesky, Instagram Add 9to5Mac to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0111.jpeg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"800\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0111.jpeg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0111.jpeg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0111.jpeg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0111.jpeg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0111.jpeg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/figure\u003e\n\n\u003cp\u003eI’ve been reviewing one of XREAL’s more recent releases of AR glasses: the \u003ca href=\"https://amzn.to/4lwmTrT\"\u003eXREAL One’s\u003c/a\u003e. These are certainly the most versatile pair of AR glasses I’ve tried out so far, and they actually really come to life somewhere you wouldn’t expect: the \u003ca href=\"https://amzn.to/44ut0Gy\"\u003eM4 iPad Pro \u003c/a\u003erunning iPadOS 26. \u003ca href=\"https://amzn.to/4lwmTrT\"\u003eXREAL One\u003c/a\u003e come in at just under 3 ounces (84 grams), making them easy to just carry around.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-why-i-enjoy-them\"\u003eWhy I enjoy them\u003c/h2\u003e\n\n\n\n\u003cp\u003eTypically, when you think about plug-in AR glasses, you’re using it for one of two things. It’s either to mirror your phone screen to have a movie or show on a massive display, or to extend your laptop screen – that way you can work with a much larger surface than what a 14-inch display (give or take) would afford you.\u003c/p\u003e\n\n\n\n\u003cp\u003eUsually, the iPad isn’t a big part of the equation, but I found myself loving the \u003ca href=\"https://amzn.to/4lwmTrT\"\u003eXREAL One\u003c/a\u003e glasses with my iPad.\u003c/p\u003e\n\n\n\n\u003cp\u003eI personally use an \u003ca href=\"https://amzn.to/44ut0Gy\"\u003e11-inch iPad Pro\u003c/a\u003e, and while that display size is great for portability and tablet usage – it does fall a bit short for productivity when I have it attached to my Magic Keyboard sometimes. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe solution? \u003ca href=\"https://amzn.to/4lwmTrT\"\u003eXREAL One\u003c/a\u003e. Obviously, external displays exist too, but I’ve never been too keen on using my iPad at a desk, seeing as I could just use a Mac. \u003ca href=\"https://amzn.to/4lwmTrT\"\u003eXREAL One\u003c/a\u003e serve as a large high-resolution external display, and since it’s just a pair of glasses you can toss in your bag, they’re incredibly portable too. \u003c/p\u003e\n\n\n\n\u003cp\u003ePlus, with iPadOS 26 introducing windowing on all supported iPad models, having an external display is more useful than ever. The \u003ca href=\"https://amzn.to/4lwmTrT\"\u003eXREAL One glasses\u003c/a\u003e are pretty plug and play, so once you plug them into your \u003ca href=\"https://amzn.to/44ut0Gy\"\u003eiPad Pro\u003c/a\u003e’s USB-C port, you’re off to the races. You can configure a few options on the glasses, but no app is required for setup, which I think is quite nice.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\n\u003cfigure data-wp-context=\"{\u0026#34;imageId\u0026#34;:\u0026#34;6865cf3908aa8\u0026#34;}\" data-wp-interactive=\"core/image\"\u003e\u003cimg decoding=\"async\" data-wp-class--hide=\"state.isContentHidden\" data-wp-class--show=\"state.isContentVisible\" data-wp-init=\"callbacks.setButtonStyles\" data-wp-on-async--click=\"actions.showLightbox\" data-wp-on-async--load=\"callbacks.setButtonStyles\" data-wp-on-async-window--resize=\"callbacks.setButtonStyles\" height=\"683\" width=\"1024\" data-id=\"1008434\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0113.jpeg?quality=82\u0026amp;strip=all\u0026amp;w=1024\" alt=\"\" srcset=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0113.jpeg 3000w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0113.jpeg?resize=155,103 155w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0113.jpeg?resize=655,437 655w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0113.jpeg?resize=768,512 768w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0113.jpeg?resize=1024,683 1024w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0113.jpeg?resize=1536,1024 1536w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0113.jpeg?resize=2048,1365 2048w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0113.jpeg?resize=350,233 350w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0113.jpeg?resize=140,93 140w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0113.jpeg?resize=1500,1000 1500w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0113.jpeg?resize=150,100 150w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cfigure data-wp-context=\"{\u0026#34;imageId\u0026#34;:\u0026#34;6865cf3909267\u0026#34;}\" data-wp-interactive=\"core/image\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" data-wp-class--hide=\"state.isContentHidden\" data-wp-class--show=\"state.isContentVisible\" data-wp-init=\"callbacks.setButtonStyles\" data-wp-on-async--click=\"actions.showLightbox\" data-wp-on-async--load=\"callbacks.setButtonStyles\" data-wp-on-async-window--resize=\"callbacks.setButtonStyles\" height=\"683\" width=\"1024\" data-id=\"1008435\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0112.jpeg?quality=82\u0026amp;strip=all\u0026amp;w=1024\" alt=\"\" srcset=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0112.jpeg 3000w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0112.jpeg?resize=155,103 155w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0112.jpeg?resize=655,437 655w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0112.jpeg?resize=768,512 768w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0112.jpeg?resize=1024,683 1024w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0112.jpeg?resize=1536,1024 1536w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0112.jpeg?resize=2048,1365 2048w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0112.jpeg?resize=350,233 350w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0112.jpeg?resize=140,93 140w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0112.jpeg?resize=1500,1000 1500w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0112.jpeg?resize=150,100 150w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/figure\u003e\n\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-key-specs\"\u003eKey specs\u003c/h2\u003e\n\n\n\n\u003cp\u003eThese glasses utilize micro-OLED panels, similar to the ones you’d find on Apple Vision Pro. They get very bright, and they’re certainly very sharp. You get a 1920×1080 display per eye, resulting in over 4 million pixels overall. The displays also run at 120Hz for smooth visuals, and pack 600 nits of brightness – though they certainly feel a bit brighter than that to me.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://amzn.to/4lwmTrT\"\u003eXREAL One’s\u003c/a\u003e offer electrochromic dimming, allowing you to adjust how much light can pass through with just the click of a button. You can either go “clear”, which allows all light to pass through – “shade”, which adds some more tint, or “theater”, which completely blacks out the glasses. It’s really nice that you can effectively use these as a pair of completely secluded glasses, in case you’re outdoors or whatnot.\u003c/p\u003e\n\n\n\n\u003cp\u003eThere’s also IPD-adjustment on-device, allowing you to tune things in for your own eyes. IPD (inter-pupillary distance) misalignments are the key reason for motion sickness with XR content, so this is an important feature. XREAL also totes built-in Bose speakers with support for Spatial Audio, though I’m personally more of an \u003ca href=\"https://amzn.to/4kkTdwS\"\u003eAirPods\u003c/a\u003e guy and typically don’t use built-in speakers on any of my devices.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" height=\"683\" width=\"1024\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0114.jpeg?quality=82\u0026amp;strip=all\u0026amp;w=1024\" alt=\"\" srcset=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0114.jpeg 3000w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0114.jpeg?resize=155,103 155w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0114.jpeg?resize=655,437 655w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0114.jpeg?resize=768,512 768w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0114.jpeg?resize=1024,683 1024w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0114.jpeg?resize=1536,1024 1536w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0114.jpeg?resize=2048,1365 2048w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0114.jpeg?resize=350,233 350w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0114.jpeg?resize=140,93 140w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0114.jpeg?resize=1500,1000 1500w, https://9to5mac.com/wp-content/uploads/sites/6/2025/07/IMG_0114.jpeg?resize=150,100 150w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-standout-features\"\u003eStandout features\u003c/h2\u003e\n\n\n\n\u003cp\u003eBeyond that, \u003ca href=\"https://amzn.to/4lwmTrT\"\u003eXREAL One\u003c/a\u003e also offer tracking. Most pairs of AR glasses that I’ve tried out just anchor your display to the center of your glasses, so if you move your head, your content also moves with you. While that can be desirable for certain use cases, it can get annoying at times. \u003c/p\u003e\n\n\n\n\u003cp\u003eWith “Anchor” mode, you can keep your display in one spot, that way if you turn your head to look at something else, your content is no longer in view. There’s also a level of tracking involved in “Follow” mode, so even if you prefer your content stay in view at all times, there’s a bit of gradual motion when you move your head around, so it doesn’t feel like your content is just stuck in one position.\u003c/p\u003e\n\n\n\n\u003cp\u003eLast but not least, these glasses also offer the ability to run an Ultra Wide display. I haven’t used this feature a ton, but it’s there if ultra-wide displays are your thing and you just haven’t bothered buying one.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-final-thoughts\"\u003eFinal thoughts\u003c/h2\u003e\n\n\n\n\u003cp\u003eAt just $499, these are certainly a remarkable value for everything they offer. I’ve always felt that wired AR glasses make a lot of sense, seeing as you get to cut the added cost of on-board compute and battery. These definitely nail a lot of key aspects of the experience, and I’d absolutely recommend them if you’re looking for a well refined pair of AR glasses without spending too much money.\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eBuy \u003ca href=\"https://amzn.to/4lwmTrT\"\u003eXREAL One (Standalone) on Amazon \u003c/a\u003e– $499\u003c/li\u003e\n\n\n\n\u003cli\u003eBuy \u003ca href=\"https://amzn.to/4laZKvm\"\u003eXREAL One w/ included hub on Amazon\u003c/a\u003e – $539\u003c/li\u003e\n\n\n\n\u003cli\u003eBuy \u003ca href=\"https://amzn.to/44nArR7\"\u003eXREAL One w/ Beam Pro on Amazon\u003c/a\u003e – $699\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eLuckily,\u003ca href=\"https://amzn.to/4lwmTrT\"\u003e XREAL One’s\u003c/a\u003e have not yet been impacted by tariff-related price hikes. They were $499 when they launched, and still remain $499 today. Other XREAL glasses have been impacted, but there’s no news on the \u003ca href=\"https://amzn.to/4lwmTrT\"\u003eXREAL One’s\u003c/a\u003e as of now.\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMy favorite Apple accessory recommendations:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/401kHkn\"\u003eAnker MagSafe 2-in-1 Wireless Charging Stand with Qi2\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://redirect.viglink.com/?key=0ab71bd42c2ca312a536dac167978a13\u0026amp;u=https%3A%2F%2Famzn.to%2F41h8skw\u0026amp;type=ap\u0026amp;loc=https%3A%2F%2F9to5toys.com%2F2025%2F02%2F13%2Fmoft-magnetic-wallet-stand-apple-iphone-magsafe-wallet-review%2F\u0026amp;ref=https%3A%2F%2Fwww.google.com%2F\"\u003eMOFT Magnetic Wallet Stand, fits up to 3 cards\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/45xW8i8\"\u003eLogitech Brio 100 1080p Webcam for Mac\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/3XCA3tQ\"\u003eAirTag 4-pack (on sale for 20% off!)\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/3DtypE6\"\u003eSanDisk Extreme 2TB USB-C SSD, up to 1050MB/s\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/4jF8DMG\"\u003eAirPods Pro 2 (USB-C)\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eFollow Michael: \u003ca href=\"https://x.com/mbrkhrdt\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eX/Twitter\u003c/a\u003e, \u003ca href=\"https://bsky.app/profile/michaelb.nyc\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBluesky\u003c/a\u003e, \u003ca href=\"https://instagram.com/m.brkhrdt\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eInstagram\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Mac to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-03T00:28:25Z",
  "modifiedTime": "2025-07-03T00:28:27Z"
}
