{
  "id": "59c7bceb-6269-449e-ba6c-ebee21d9235c",
  "title": "Bands can turn concert set lists into Apple Music playlists",
  "link": "https://appleinsider.com/articles/24/10/17/bands-can-turn-concert-set-lists-into-apple-music-playlists?utm_medium=rss",
  "description": "Music fans will be able to relive the concerts of their favorite acts, as Apple Music is now allowing artists to turn their set lists into playlists.Apple Music for Artists - image credit: AppleApple's new tool for musicians is detailed in Apple Music for Artists as a form of promotion. Musical acts can share a playlist of their concert set list with fans via their Apple Music page.While this does provide fans a way to listen to songs from the concert and relive the experience at home, it also helps before a concert. Fans will know what songs will be played ahead of time, so they will know if their favorite song will be performed. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Malcolm Owen",
  "published": "Thu, 17 Oct 2024 19:07:54 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Malcolm Owen",
  "length": 2172,
  "excerpt": "Music fans will be able to relive the concerts of their favorite acts, as Apple Music is now allowing artists to turn their set lists into playlists.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v9/images/apple-touch-icon-144.png",
  "text": "Apple Music for Artists - image credit: Apple Music fans will be able to relive the concerts of their favorite acts, as Apple Music is now allowing artists to turn their set lists into playlists. Apple's new tool for musicians is detailed in Apple Music for Artists as a form of promotion. Musical acts can share a playlist of their concert set list with fans via their Apple Music page. While this does provide fans a way to listen to songs from the concert and relive the experience at home, it also helps before a concert. Fans will know what songs will be played ahead of time, so they will know if their favorite song will be performed. As well as appearing on their artist page, the playlist can be used on social media to promote future tour dates. Apple advises the artist image will make up the majority of the cover art for the Set List playlist, with the words \"Set List\" in a block at the top alongside the Apple Music logo. The easiest way for artists to create the Set List playlist is to keep their Bandsintown account up to date with tour dates. The band's upcoming show dates will be able to link to their artist pages on Shazam, Spotlight Search, and Apple Maps as well. To create the Set List playlist with Apple Music for Artists, users must go to Artist Content and select Artist Playlists to see all existing Set Lists. They can then click the plus icon to create a new Set List, set the type of show, add an event name, add an event from Bandsintown or manually, and then set a publish date. Once created, artists can then search for songs to add to the Set List that they played on tour. Covers or collaborations with other artists can also be included in the Set List playlist. After a tour has finished and the Set List isn't needed, it can also be hidden from view. Hidden playlists remain as a draft in the Apple Music for Artists profile, so it could be republished again in the future. The Set List will appear alongside many other playlists offered on Apple Music, including albums and curated editions made by Apple's editorial team.",
  "image": "https://photos5.appleinsider.com/gallery/61430-126897-applemusicforartists-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-hero\" aria-labelledby=\"hero-cap\" role=\"figure\"\u003e\n                          \u003cp id=\"hero-cap\" title=\"Apple Music for Artists - image credit: Apple\"\u003eApple Music for Artists - image credit: Apple\u003c/p\u003e\n                                    \u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61430-126897-applemusicforartists-xl.jpg\"\u003e\n              \u003cimg fetchpriority=\"high\" src=\"https://photos5.appleinsider.com/gallery/61430-126897-applemusicforartists-xl.jpg\" alt=\"\"/\u003e\n            \u003c/a\u003e\n                      \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cp\u003eMusic fans will be able to relive the concerts of their favorite acts, as \u003ca href=\"https://appleinsider.com/inside/apple-music\" title=\"Apple Music\" data-kpt=\"1\"\u003eApple Music\u003c/a\u003e is now allowing artists to turn their set lists into playlists. \n\u003c/p\u003e\u003cp\u003eApple\u0026#39;s new tool for musicians is detailed in \u003ca href=\"https://artists.apple.com/ui\"\u003eApple Music for Artists\u003c/a\u003e as a form of promotion. Musical acts can share a playlist of their \u003ca href=\"https://artists.apple.com/support/5466-promote-shows-set-lists\"\u003econcert set list\u003c/a\u003e with fans via their Apple Music page. \n\u003c/p\u003e\u003cp\u003eWhile this does provide fans a way to listen to songs from the concert and relive the experience at home, it also helps before a concert. Fans will know what songs will be played ahead of time, so they will know if their favorite song will be performed. \n\u003c/p\u003e\u003cp\u003eAs well as appearing on their artist page, the playlist can be used on social media to promote future tour dates. \n\u003c/p\u003e\u003cp\u003eApple advises the artist image will make up the majority of the cover art for the Set List playlist, with the words \u0026#34;Set List\u0026#34; in a block at the top alongside the Apple Music logo. \n\u003c/p\u003e\u003cp\u003eThe easiest way for artists to create the Set List playlist is to keep their Bandsintown account up to date with tour dates. The band\u0026#39;s upcoming show dates will be able to link to their artist pages on Shazam, Spotlight Search, and \u003ca href=\"https://appleinsider.com/inside/apple-maps\" title=\"Apple Maps\" data-kpt=\"1\"\u003eApple Maps\u003c/a\u003e as well. \n\u003c/p\u003e\u003cp\u003eTo create the Set List playlist with Apple Music for Artists, users must go to Artist Content and select Artist Playlists to see all existing Set Lists. They can then click the plus icon to create a new Set List, set the type of show, add an event name, add an event from Bandsintown or manually, and then set a publish date. \n\u003c/p\u003e\u003cp\u003eOnce created, artists can then search for songs to add to the Set List that they played on tour. Covers or collaborations with other artists can also be included in the Set List playlist. \n\u003c/p\u003e\u003cp\u003eAfter a tour has finished and the Set List isn\u0026#39;t needed, it can also be hidden from view. Hidden playlists remain as a draft in the Apple Music for Artists profile, so it could be republished again in the future. \n\u003c/p\u003e\u003cp\u003eThe Set List will appear alongside many other playlists offered on Apple Music, including albums and curated editions made by Apple\u0026#39;s editorial team. \u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-17T19:07:54Z",
  "modifiedTime": null
}
