{
  "id": "5a203988-06db-4f04-bc72-1b39963619ec",
  "title": "Apple may discontinue current iPhone SE \u0026 iPhone 14 models in EU",
  "link": "https://appleinsider.com/articles/24/12/14/apple-may-discontinue-current-iphone-se-iphone-14-models-in-eu?utm_medium=rss",
  "description": "If you are in the EU and were thinking of buying an iPhone SE or iPhone 14 from Apple, you might want to hurry.The iPhone SE, and remaining iPhone 14 models, may be discontinued soon.A new rumor suggests that Apple may discontinue selling the current iPhone SE and iPhone 14 models it still offers by the end of the year. The report is likely to turn out to be true, but for the wrong reasons.The theory behind the claim was originally posted by French site iGeneration. The claim posits that Apple does not want to run afoul of a European Union mandate that all smartphones sold there must use the USB-C connector as of January 2025. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Charles Martin",
  "published": "Sat, 14 Dec 2024 17:08:00 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Charles Martin",
  "length": 2995,
  "excerpt": "If you are in the EU and were thinking of buying an iPhone SE or iPhone 14 from Apple, you might want to hurry.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "If you are in the EU and were thinking of buying an iPhone SE or iPhone 14 from Apple, you might want to hurry. A new rumor suggests that Apple may discontinue selling the current iPhone SE and iPhone 14 models it still offers by the end of the year. The report is likely to turn out to be true, but for the wrong reasons. The theory behind the claim was originally posted by French site iGeneration. The claim posits that Apple does not want to run afoul of a European Union mandate that all smartphones sold there must use the USB-C connector as of January 2025. Both the iPhone 14 line and the current iPhone SE still use Lightning ports. However, the EU law does not forbid older smartphones designed prior to the mandate from being sold with the outdated ports. It also doesn't require stopping sales of iPhones by resellers. The mandate only applies to smartphones designed since the law was passed. It also doesn't affect smartphones sold elsewhere, so Apple could continue selling the iPhone SE, and iPhone 14 and iPhone 14 Plus — the last two iPhone 14 models still available — worldwide, if it chose to. The line in the sandThe real reason Apple could stop selling the iPhone SE and iPhone 14 models a bit earlier than expected is much simpler: the company wants all of its iPhones in 2025 to be able to run its Apple Intelligence features. Currently, those abilities are limited to the very latest iPhone models — specifically the iPhone 15 Pro and iPhone 15 Pro Max, and all models of the iPhone 16. All M1, M2, M3, and M4 Mac and iPad models already meet the specifications for Apple Intelligence, which is rolling out in stages via iOS 18, iPadOS 18, and macOS Sequoia. Previous iPhones, up to and including the iPhone 15 and iPhone 15 Plus, will also not get the Apple Intelligence features, though they do get the other improvements in iOS 18 if they are eligible. However, Apple plans to replace the iPhone SE with a newer model, expected in the first half of 2025, that will likely be able to run Apple Intelligence. Given that Apple Intelligence will be rolling out across iOS, iPadOS and macOS updates across at least the first half of 2025, this could boost sales of the future iPhone 17 line, expected in the fall. Apple could conceivably encourage older iPhone owners, including those with the iPhone 15 and iPhone 15 Plus, to upgrade to the iPhone 17 lineup through higher trade-in values or other incentives. It's not clear if this will happen, though. The next iPhone SE model could also be an easy entry point for upgraders if it supports Apple Intelligence as expected. The upcoming fourth generation of the SE will reportedly change its design to resemble the iPhone 14, and could see a price increase up to $499 from the current $429. It is also expected to gain significant hardware improvements, including a 48-megapixel rear camera and an OLED screen, according to reports. It may also be the first iPhone model to get Apple's expected self-made new modem.",
  "image": "https://photos5.appleinsider.com/gallery/62050-128524-61458-126966-60686-124899-47545-92860-iPhone-SE-3-Starlight-On-Wrist-Rest-xl-xl-xl-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eIf you are in the EU and were thinking of buying an \u003ca href=\"https://appleinsider.com/inside/iphone-se\" title=\"iPhone SE\" data-kpt=\"1\"\u003eiPhone SE\u003c/a\u003e or iPhone 14 from Apple, you might want to hurry.\n\u003c/p\u003e\u003cp\u003eA new rumor suggests that Apple may discontinue selling the current iPhone SE and \u003ca href=\"https://appleinsider.com/inside/iphone-14\" title=\"iPhone 14\" data-kpt=\"1\"\u003eiPhone 14\u003c/a\u003e models it still offers by the end of the year. The report is likely to turn out to be true, but for the wrong reasons.\n\u003c/p\u003e\u003cp\u003eThe theory \u003ca href=\"https://www.igen.fr/iphone/2024/12/apple-va-arreter-la-vente-des-iphone-se-et-iphone-14-dans-lunion-europeenne-147523\"\u003ebehind the claim\u003c/a\u003e was originally posted by French site \u003cem\u003eiGeneration\u003c/em\u003e. The claim posits that Apple does not want to run afoul of a European Union mandate that all smartphones sold there must use the USB-C connector as of January 2025.\n\u003c/p\u003e\u003cp\u003eBoth the \u003ca href=\"https://appleinsider.com/inside/iphone-14\" title=\"iPhone 14\" data-kpt=\"1\"\u003eiPhone 14\u003c/a\u003e line and the current iPhone SE still use Lightning ports.\n\u003c/p\u003e\u003cp\u003eHowever, the EU law does not forbid older smartphones designed prior to the mandate from being sold with the outdated ports. It also doesn\u0026#39;t require stopping sales of iPhones by resellers. The mandate only applies to smartphones designed since the law was passed.\n\u003c/p\u003e\u003cp\u003eIt also doesn\u0026#39;t affect smartphones sold elsewhere, so Apple could continue selling the iPhone SE, and iPhone 14 and iPhone 14 Plus —   the last two iPhone 14 models still available —   worldwide, if it chose to.\n\u003c/p\u003e\u003ch2 data-anchor=\"the-line-in-the-sand\" id=\"the-line-in-the-sand\"\u003eThe line in the sand\u003c/h2\u003e\u003cp\u003eThe real reason Apple could stop selling the iPhone SE and iPhone 14 models a bit earlier than expected is much simpler: the company wants all of its iPhones in 2025 to be able to run its \u003ca href=\"https://appleinsider.com/articles/24/12/11/apples-ios-182-release-brings-image-playground-to-the-iphone\"\u003eApple Intelligence\u003c/a\u003e features.\n\u003c/p\u003e\u003cp\u003eCurrently, those abilities are limited to the very latest iPhone models —   specifically the \u003ca href=\"https://appleinsider.com/inside/iphone-15-pro\" title=\"iPhone 15 Pro\" data-kpt=\"1\"\u003eiPhone 15 Pro\u003c/a\u003e and iPhone 15 Pro Max, and all models of the \u003ca href=\"https://appleinsider.com/inside/iphone-16\" title=\"iPhone 16\" data-kpt=\"1\"\u003eiPhone 16\u003c/a\u003e. All M1, M2, M3, and \u003ca href=\"https://appleinsider.com/inside/m4\" title=\"M4\" data-kpt=\"1\"\u003eM4\u003c/a\u003e Mac and \u003ca href=\"https://appleinsider.com/inside/ipad\" title=\"iPad\" data-kpt=\"1\"\u003eiPad\u003c/a\u003e models \u003ca href=\"\"\u003ealready meet\u003c/a\u003e the specifications for \u003ca href=\"https://appleinsider.com/inside/apple-intelligence\" title=\"Apple Intelligence\" data-kpt=\"1\"\u003eApple Intelligence\u003c/a\u003e, which is rolling out in stages via \u003ca href=\"https://appleinsider.com/inside/ios-18\" title=\"iOS 18\" data-kpt=\"1\"\u003eiOS 18\u003c/a\u003e, \u003ca href=\"https://appleinsider.com/inside/ipados-18\" title=\"iPadOS 18\" data-kpt=\"1\"\u003eiPadOS 18\u003c/a\u003e, and \u003ca href=\"https://appleinsider.com/inside/macos-sequoia\" title=\"macOS Sequoia\" data-kpt=\"1\"\u003emacOS Sequoia\u003c/a\u003e.\n\u003c/p\u003e\u003cp\u003ePrevious iPhones, up to and including the iPhone 15 and iPhone 15 Plus, will also not get the \u003ca href=\"https://appleinsider.com/inside/apple-intelligence\" title=\"Apple Intelligence\" data-kpt=\"1\"\u003eApple Intelligence\u003c/a\u003e features, though they do get the \u003ca href=\"\"\u003eother improvements\u003c/a\u003e in \u003ca href=\"https://appleinsider.com/inside/ios-18\" title=\"iOS 18\" data-kpt=\"1\"\u003eiOS 18\u003c/a\u003e if they are eligible. However, Apple plans to replace the iPhone SE with a newer model, expected in the first half of 2025, that will likely be able to run Apple Intelligence.\n\u003c/p\u003e\u003cp\u003eGiven that Apple Intelligence will be rolling out across iOS, \u003ca href=\"https://appleinsider.com/inside/ipados\" title=\"iPadOS\" data-kpt=\"1\"\u003eiPadOS\u003c/a\u003e and \u003ca href=\"https://appleinsider.com/inside/macos\" title=\"macOS\" data-kpt=\"1\"\u003emacOS\u003c/a\u003e updates across at least the first half of 2025, this could boost sales of the future \u003ca href=\"https://appleinsider.com/inside/iphone-17\" title=\"iPhone 17\" data-kpt=\"1\"\u003eiPhone 17\u003c/a\u003e line, expected in the fall.\n\u003c/p\u003e\u003cp\u003eApple could conceivably encourage older iPhone owners, including those with the iPhone 15 and iPhone 15 Plus, to upgrade to the \u003ca href=\"https://appleinsider.com/inside/iphone-17\" title=\"iPhone 17\" data-kpt=\"1\"\u003eiPhone 17\u003c/a\u003e lineup through higher trade-in values or other incentives. It\u0026#39;s not clear if this will happen, though.\n\u003c/p\u003e\u003cp\u003eThe next iPhone SE model could also be an easy entry point for upgraders if it supports Apple Intelligence as expected. The upcoming fourth generation of the SE will reportedly change its design to resemble the iPhone 14, and could see a price increase \u003ca href=\"https://appleinsider.com/articles/24/08/14/apples-budget-iphone-se-4-what-the-rumor-mill-says-is-on-the-way\"\u003eup to $499\u003c/a\u003e from the current $429.\n\u003c/p\u003e\u003cp\u003eIt is also expected to gain significant hardware improvements, including a 48-megapixel rear camera and an OLED screen, \u003ca href=\"https://appleinsider.com/articles/24/12/09/iphone-se-4-rumored-to-get-48mp-rear-camera-oled-screen\"\u003eaccording to reports\u003c/a\u003e. It may also be the first iPhone model to get Apple\u0026#39;s expected \u003ca href=\"https://appleinsider.com/articles/24/12/06/apple-plans-three-year-rollout-of-its-self-made-iphone-modem-starting-with-iphone-se\"\u003eself-made new modem\u003c/a\u003e.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-14T17:08:00Z",
  "modifiedTime": null
}
