{
  "id": "60e1ce90-0a06-482d-b5d8-d525cd231e90",
  "title": "How to set up and use your brand-new AirPods",
  "link": "https://www.cultofmac.com/how-to/set-up-airpods",
  "description": "Got some new AirPods? Here's how to set up your AirPods, get the most out of them, and fix anything that goes wrong. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
  "author": "Charlie Sorrel",
  "published": "Wed, 25 Dec 2024 00:30:00 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "How-To",
    "AirPods",
    "iPhone tips",
    "Top stories"
  ],
  "byline": "Charlie Sorrel",
  "length": 8083,
  "excerpt": "Got some new AirPods? Here's how to set up your AirPods, get the most out of them, and fix anything that goes wrong.",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "How-To You’ll be one happy duck with your new AirPods. Photo: Apple If you’re a super lucky duck, then Santa may have left you a pair of AirPods. They are truly one of the best products Apple ever made, because they really do offer a huge upgrade on all previous headphones. Here’s how to set up your new AirPods. How to set up AirPods: Pair them only once AirPods are easy to use, and they sound amazing. This article will show you everything you need to know. Tap “Connect,” and then… well, that’s pretty much all.Screenshot: Apple One of AirPods best features is something you’ll only see once — the easy pairing. It’s so easy that you might not know you’ve done it, and once you have paired your AirPods with one device, it will automatically be paired with all your other devices, thanks to iCloud. How to pair AirPods to iPhone Here’s how to connect your AirPods to iPhone for the first time: Unlock your iPhone. Pop open the AirPods case (no need to take them out yet), and hold it next to your iPhone. When the popup appears on the screen, tap Connect, then tap Done. That’s it. You can now go ahead and put the AirPods in your ears. How to use AirPods To use your AirPods, just shove them in your ears. They will connect automatically, and when you press play on music or a video, the sounds will be routed to the AirPods. To pause playback, remove one AirPod. To resume playback, put it back in your ear. This lets you pause the music when you take out a bud to listen to someone — when paying in a supermarket, for example. If you take out both AirPods, then playback will stop, and audio will be routed back to the iPhone’s own speaker the next time you press play. Another neat trick is to put one bud in your ear, and keep the other in the case. The iPhone will then mix both left and right tracks into one mono track, so you can listen to all of a stereo track in one ear. This can be handy for podcasts. Bonus: When one AirPod’s battery runs down, you can switch to the other, while the first one recharges in the case. This doubles usage time. Set up AirPods with other devices AirPods work just like any other AirPlay device.Photo: Apple To use your AirPods on another Apple device, tap the standard AirPlay box to select them as an output. AirPlay can be found in Control Center, or by tapping the AirPlay icon in any video or music playback view. Your AirPods will be listed, alongside any other available AirPlay speakers. Check AirPods battery level Check the AirPods battery by opening the case near your iPhone.Photo: Apple To see how much charge remains in your AirPods, just open the lid of the case and hold it near an iPhone or iPad that has been paired with them. After a few seconds, a panel will pop up on the screen with the charge levels for the AirPods themselves, and for the charging case. If you’re using the AirPods, then you can also use the battery widget on your iPhone or iPad to check the levels. Pair AirPods with regular Bluetooth You can also use AirPods with any other device that works with Bluetooth speakers and headphones. You lose the cool extra features that work with modern Apple devices, but they will function just fine. Just go ahead and pair the AirPods like you would pair any other Bluetooth audio receiver. The exact method depends on the device you’re using. To put the AirPods in pairing mode, just press and hold the setup button on the back until the LED pulses white. Set up and customize AirPods gestures I have mine set for Play/Pause and Next Track.Screenshot: D. Griffin Jones/Cult of Mac You control AirPods by interacting with the earbuds’ stems. On the latest AirPods and AirPods Pro, you can click the stem. On older models, you can tap them. Clicking and holding the AirPods will adjust the noise cancellation mode, on supported models. By default, the double-click gestures for controlling your AirPods are play/pause (right AirPod), and summon Siri (left AirPod). You can customize these on your iPhone, in the Settings app. The available choices are Siri, play/pause, next track, previous track, and off. Siri is handy, but I find I prefer next track on the left, and play/pause on the right. After all, with “Hey Siri,” you don’t really need a physical gesture for it. Next track is particularly good, because it also works with the skip function in audiobook and podcasts apps. Apple gives you plenty of ways to customize what your AirPods or AirPods Pro do when you double tap or press and hold their stems. Here’s Apple’s complete guide to changing the settings on your AirPods. Reset your AirPods The Reset button can be found on either the front or the back of your AirPods.Photo: Apple If you have trouble with your AirPods, there are a few tricks to get them working again. Apple has a support page with instructions, but the basics are that you should make sure they’re charged, then try closing the lid, and waiting for 15 seconds before opening it again. If that doesn’t work, hold the button on the AirPods’ case until the status light flashes white. On fourth-generation AirPods, this is a capacitive sensor on the front, below the light. (Pictured on the left.) On AirPods Pro, this is a button on the back of the case. (Pictured on the right.) On first-generation, second-generation or third-generation AirPods, this is also a button on the back of the case. And if that doesn’t work, hold the same button down for at least 15 seconds to perform a reset. You’ll know it worked when you see the status lamp “flash amber a few times and then flash white.” Enjoy your AirPods To be honest, you don’t need to go beyond the first step in this list to set up your AirPods. And enjoy them you will. No more cable tangles, snags, or booming noises from cables rubbing or banging on your clothes as you move. No more forgetting to pause an audiobook when you take out your earbuds. and no more finding your wireless headphones without charge. Happy New Year. How to connect AirPods to laptop You can use AirPods with a Windows PC or laptop. They’ll work like any other Bluetooth headphones or earbuds, and setting them up is easy. To connect AirPods to a laptop, do the following: Put AirPods in pairing mode: Open the AirPods case. Press and hold the setup button on the back of the case until the LED light starts blinking white. Turn on Bluetooth: On your laptop, go to Settings, then Bluetooth \u0026 devices, and click Devices. Add Bluetooth or other device: Click the plus sign where it says “Add Bluetooth or other device.” Select your AirPods: Select your AirPods from the list of devices. Click “Connect”: If your AirPods don’t connect automatically, click Connect. Test the audio: Make sure they work by testing the audio. How to connect AirPods to Android AirPods also work great with Android but some features, like Siri and the battery life indicator, won’t work on Android devices. However, you can use third-party apps like MaterialPods to display battery life and launch Google Assistant. To connect AirPods to an Android device, do the following: Turn on Bluetooth: On your Android device go to Settings \u003e Connections \u003e Bluetooth. Or swipe down from the top of the screen and touch and hold Bluetooth Put AirPods in pairing mode: Put your AirPods in their charging case and open the lid. Press and hold the setup button on the back of the case until the status light flashes white. Select your AirPods from the list of Bluetooth devices. If you’re having trouble connecting your AirPods to your Android device, try resetting the connection. Put your AirPods back in their charging case, wait a second, and then take them out again. If that doesn’t work, they may be connecting automatically to another nearby device. To stop this, turn off Bluetooth on any other devices they might be trying to connect to. D. Griffin Jones and Leander Kahney also contributed to this article. This article on how to set up AirPods was originally published on December 27, 2017. It was updated with the latest information.",
  "image": "https://www.cultofmac.com/wp-content/uploads/2023/12/AirPods.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-520431\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/how-to\" title=\"How-To\" aria-label=\"How-To articles\"\u003eHow-To\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"How to set up and use your brand-new AirPods\" src=\"https://www.cultofmac.com/wp-content/uploads/2023/12/AirPods-1536x864.jpg\" alt=\"Woman smiling wearing AirPods\" data-ratio=\"1.7777777777778\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\tYou’ll be one happy duck with your new AirPods. \u003cbr/\u003e\u003cem\u003ePhoto: Apple\u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003eIf you’re a super lucky duck, then Santa may have left you a pair of AirPods. They are truly one of the best products Apple ever made, because they really do offer a huge upgrade on all previous headphones. Here’s how to set up your new AirPods.\u003c/p\u003e\u003cspan data-ez-ph-id=\"901\"\u003e\u003c/span\u003e\n\n\u003ch2\u003eHow to set up AirPods: Pair them only once\u003c/h2\u003e\n\u003cp\u003eAirPods are easy to use, and they sound amazing. This article will show you everything you need to know.\u003c/p\u003e\n\n\n\u003cfigure id=\"31740\" aria-labelledby=\"figcaption_31740\"\u003e\u003ca href=\"https://www.cultofmac.com/wp-content/uploads/2023/12/ios16-iphone13-pro-airpods-setup.jpg\" data-lasso-id=\"1641668300\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" title=\"Ios16 iphone13 pro airpods setup\" src=\"https://www.cultofmac.com/wp-content/uploads/2023/12/ios16-iphone13-pro-airpods-setup.jpg\" alt=\"Connect your AirPods to your iPhone\" width=\"800\" height=\"1028\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2023/12/ios16-iphone13-pro-airpods-setup-400x514@2x.jpg 800w, https://www.cultofmac.com/wp-content/uploads/2023/12/ios16-iphone13-pro-airpods-setup-400x514.jpg 400w, https://www.cultofmac.com/wp-content/uploads/2023/12/ios16-iphone13-pro-airpods-setup-350x450.jpg 350w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"figcaption_31740\"\u003eTap “Connect,” and then… well, that’s pretty much all.\u003cbr/\u003e\u003cspan\u003eScreenshot: Apple\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eOne of AirPods best features is something you’ll only see once — the easy pairing. It’s so easy that you might not know you’ve done it, and once you have paired your AirPods with one device, it will automatically be paired with all your other devices, thanks to iCloud.\u003c/p\u003e\u003cspan data-ez-ph-id=\"909\"\u003e\u003c/span\u003e\n\u003ch3\u003eHow to pair AirPods to iPhone\u003c/h3\u003e\n\u003cp\u003eHere’s how to connect your AirPods to iPhone for the first time:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eUnlock your iPhone.\u003c/li\u003e\n\u003cli\u003ePop open the AirPods case (no need to take them out yet), and hold it next to your iPhone.\u003c/li\u003e\n\u003cli\u003eWhen the popup appears on the screen, tap \u003cstrong\u003eConnect\u003c/strong\u003e, then tap \u003cstrong\u003eDone\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eThat’s it. You can now go ahead and put the AirPods in your ears.\u003c/p\u003e\u003cspan data-ez-ph-id=\"910\"\u003e\u003c/span\u003e\n\u003ch3\u003eHow to use AirPods\u003c/h3\u003e\n\u003cp\u003eTo use your AirPods, just shove them in your ears. They will connect automatically, and when you press play on music or a video, the sounds will be routed to the AirPods.\u003c/p\u003e\n\u003cp\u003eTo pause playback, remove one AirPod. To resume playback, put it back in your ear. This lets you pause the music when you take out a bud to listen to someone — when paying in a supermarket, for example. If you take out both AirPods, then playback will stop, and audio will be routed back to the iPhone’s own speaker the next time you press play.\u003c/p\u003e\u003cspan data-ez-ph-id=\"911\"\u003e\u003c/span\u003e\n\u003cp\u003eAnother neat trick is to put one bud in your ear, and keep the other in the case. The iPhone will then mix both left and right tracks into one mono track, so you can listen to all of a stereo track in one ear. This can be handy for podcasts. Bonus: When one AirPod’s battery runs down, you can switch to the other, while the first one recharges in the case. This doubles usage time.\u003c/p\u003e\n\u003ch3\u003eSet up AirPods with other devices\u003c/h3\u003e\n\u003cfigure id=\"31740\" aria-labelledby=\"figcaption_31740\"\u003e\u003cimg decoding=\"async\" title=\"Airpods airplay iPhone\" src=\"https://www.cultofmac.com/wp-content/uploads/2017/12/ios11-iphone7-control-center-music-airpods.jpg\" alt=\"AirPods work just like any other AirPlay device.\" width=\"1600\" height=\"1304\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2017/12/ios11-iphone7-control-center-music-airpods.jpg 1600w, https://www.cultofmac.com/wp-content/uploads/2017/12/ios11-iphone7-control-center-music-airpods-400x326.jpg 400w, https://www.cultofmac.com/wp-content/uploads/2017/12/ios11-iphone7-control-center-music-airpods-780x636.jpg 780w, https://www.cultofmac.com/wp-content/uploads/2017/12/ios11-iphone7-control-center-music-airpods-350x285.jpg 350w, https://www.cultofmac.com/wp-content/uploads/2017/12/ios11-iphone7-control-center-music-airpods-400x326@2x.jpg 800w, https://www.cultofmac.com/wp-content/uploads/2017/12/ios11-iphone7-control-center-music-airpods-780x636@2x.jpg 1560w, https://www.cultofmac.com/wp-content/uploads/2017/12/ios11-iphone7-control-center-music-airpods-350x285@2x.jpg 700w\" sizes=\"(max-width: 1600px) 100vw, 1600px\"/\u003e\u003cfigcaption id=\"figcaption_31740\"\u003eAirPods work just like any other AirPlay device.\u003cbr/\u003e\u003cspan\u003ePhoto: Apple\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eTo use your AirPods on another Apple device, tap the standard AirPlay box to select them as an output. AirPlay can be found in \u003ca href=\"https://www.cultofmac.com/485298/how-to-customize-control-center-ios-11-beta/\" data-lasso-id=\"195286\"\u003eControl Center\u003c/a\u003e, or by tapping the AirPlay icon in any video or music playback view. Your AirPods will be listed, alongside any other available AirPlay speakers.\u003c/p\u003e\n\u003ch3\u003eCheck AirPods battery level\u003c/h3\u003e\n\u003cfigure id=\"31740\" aria-labelledby=\"figcaption_31740\"\u003e\u003cimg decoding=\"async\" title=\"Airpods charge battery check\" src=\"https://www.cultofmac.com/wp-content/uploads/2017/12/airpods-charge-battery-check.jpg\" alt=\"Check battery by opening the case near your iPhone.\" width=\"1600\" height=\"1236\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2017/12/airpods-charge-battery-check.jpg 1600w, https://www.cultofmac.com/wp-content/uploads/2017/12/airpods-charge-battery-check-400x309.jpg 400w, https://www.cultofmac.com/wp-content/uploads/2017/12/airpods-charge-battery-check-780x603.jpg 780w, https://www.cultofmac.com/wp-content/uploads/2017/12/airpods-charge-battery-check-350x270.jpg 350w, https://www.cultofmac.com/wp-content/uploads/2017/12/airpods-charge-battery-check-400x309@2x.jpg 800w, https://www.cultofmac.com/wp-content/uploads/2017/12/airpods-charge-battery-check-780x603@2x.jpg 1560w, https://www.cultofmac.com/wp-content/uploads/2017/12/airpods-charge-battery-check-350x270@2x.jpg 700w\" sizes=\"(max-width: 1600px) 100vw, 1600px\"/\u003e\u003cfigcaption id=\"figcaption_31740\"\u003eCheck the AirPods battery by opening the case near your iPhone.\u003cbr/\u003e\u003cspan\u003ePhoto: Apple\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eTo see how much charge remains in your AirPods, just open the lid of the case and hold it near an iPhone or iPad that has been paired with them. After a few seconds, a panel will pop up on the screen with the charge levels for the AirPods themselves, and for the charging case.\u003c/p\u003e\u003cspan data-ez-ph-id=\"912\"\u003e\u003c/span\u003e\n\u003cp\u003eIf you’re using the AirPods, then you can also use the battery widget on your iPhone or iPad to check the levels.\u003c/p\u003e\n\u003ch3\u003ePair AirPods with regular Bluetooth\u003c/h3\u003e\n\u003cp\u003eYou can also use AirPods with any other device that works with Bluetooth speakers and headphones. You lose the cool extra features that work with modern Apple devices, but they will function just fine. Just go ahead and pair the AirPods like you would pair any other Bluetooth audio receiver. The exact method depends on the device you’re using. To put the AirPods in pairing mode, just press and hold the setup button on the back until the LED pulses white.\u003c/p\u003e\n\u003ch3\u003eSet up and customize AirPods gestures\u003c/h3\u003e\n\u003cfigure id=\"31740\" aria-labelledby=\"figcaption_31740\"\u003e\u003ca href=\"https://www.cultofmac.com/wp-content/uploads/2023/04/Customize-AirPods-Controls.jpg\" data-lasso-id=\"1641668301\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Customize AirPods Controls\" src=\"https://www.cultofmac.com/wp-content/uploads/2023/04/Customize-AirPods-Controls-780x736.jpg\" alt=\"Customizing controls on AirPods\" width=\"780\" height=\"736\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2023/04/Customize-AirPods-Controls-780x736.jpg 780w, https://www.cultofmac.com/wp-content/uploads/2023/04/Customize-AirPods-Controls-400x378.jpg 400w, https://www.cultofmac.com/wp-content/uploads/2023/04/Customize-AirPods-Controls-1536x1450.jpg 1536w, https://www.cultofmac.com/wp-content/uploads/2023/04/Customize-AirPods-Controls-2048x1933.jpg 2048w, https://www.cultofmac.com/wp-content/uploads/2023/04/Customize-AirPods-Controls-350x330.jpg 350w, https://www.cultofmac.com/wp-content/uploads/2023/04/Customize-AirPods-Controls-780x736@2x.jpg 1560w, https://www.cultofmac.com/wp-content/uploads/2023/04/Customize-AirPods-Controls-400x378@2x.jpg 800w\" sizes=\"auto, (max-width: 780px) 100vw, 780px\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"figcaption_31740\"\u003eI have mine set for Play/Pause and Next Track.\u003cbr/\u003e\u003cspan\u003eScreenshot: D. Griffin Jones/Cult of Mac\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eYou control AirPods by interacting with the earbuds’ stems. On the latest AirPods and AirPods Pro, you can click the stem. On older models, you can tap them.\u003c/p\u003e\u003cspan data-ez-ph-id=\"913\"\u003e\u003c/span\u003e\n\u003cp\u003eClicking and holding the AirPods will \u003ca href=\"https://support.apple.com/guide/airpods/switch-between-noise-control-modes-dev9812f5cc3/web\" data-lasso-id=\"1641668302\" target=\"_blank\"\u003eadjust the noise cancellation mode\u003c/a\u003e, on supported models.\u003c/p\u003e\n\u003cp\u003eBy default, the double-click gestures for controlling your AirPods are play/pause (right AirPod), and summon Siri (left AirPod). You can \u003ca href=\"https://www.cultofmac.com/505021/ios-11-customize-left-right-airpod-double-tap-shortcuts/\" data-lasso-id=\"195287\"\u003ecustomize these on your iPhone\u003c/a\u003e, in the \u003cstrong\u003eSettings\u003c/strong\u003e app. The available choices are \u003cstrong\u003eSiri\u003c/strong\u003e, \u003cstrong\u003eplay/pause\u003c/strong\u003e, \u003cstrong\u003enext track\u003c/strong\u003e, \u003cstrong\u003eprevious track\u003c/strong\u003e, and \u003cstrong\u003eoff\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eSiri is handy, but I find I prefer \u003cstrong\u003enext track\u003c/strong\u003e on the left, and \u003cstrong\u003eplay/pause\u003c/strong\u003e on the right. After all, with “Hey Siri,” you don’t really need a physical gesture for it. Next track is particularly good, because it also works with the skip function in audiobook and podcasts apps.\u003c/p\u003e\u003cspan data-ez-ph-id=\"914\"\u003e\u003c/span\u003e\n\u003cp\u003eApple gives you plenty of ways to customize what your AirPods or AirPods Pro do when you double tap or press and hold their stems. Here’s Apple’s complete guide to \u003ca href=\"https://support.apple.com/en-us/HT212203\" data-lasso-id=\"1641418836\" target=\"_blank\"\u003echanging the settings on your AirPods\u003c/a\u003e.\u003c/p\u003e\n\u003ch3\u003eReset your AirPods\u003c/h3\u003e\n\u003cfigure id=\"31740\" aria-labelledby=\"figcaption_31740\"\u003e\u003ca href=\"https://www.cultofmac.com/wp-content/uploads/2023/12/AirPods-Reset-Button.jpg\" data-lasso-id=\"1641668303\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"AirPods Reset Button\" src=\"https://www.cultofmac.com/wp-content/uploads/2023/12/AirPods-Reset-Button-1440x776.jpg\" alt=\"Reset button on AirPods and AirPods Pro\" width=\"780\" height=\"420\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2023/12/AirPods-Reset-Button-1440x776.jpg.webp 1440w, https://www.cultofmac.com/wp-content/uploads/2023/12/AirPods-Reset-Button-400x216.jpg 400w, https://www.cultofmac.com/wp-content/uploads/2023/12/AirPods-Reset-Button-1536x828.jpg 1536w, https://www.cultofmac.com/wp-content/uploads/2023/12/AirPods-Reset-Button-2048x1104.jpg 2048w, https://www.cultofmac.com/wp-content/uploads/2023/12/AirPods-Reset-Button-350x189.jpg 350w, https://www.cultofmac.com/wp-content/uploads/2023/12/AirPods-Reset-Button-400x216@2x.jpg 800w\" sizes=\"auto, (max-width: 780px) 100vw, 780px\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"figcaption_31740\"\u003eThe Reset button can be found on either the front or the back of your AirPods.\u003cbr/\u003e\u003cspan\u003ePhoto: Apple\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eIf you have trouble with your AirPods, there are a few tricks to get them working again. Apple has a \u003ca href=\"https://support.apple.com/en-us/HT207010\" data-lasso-id=\"195288\" target=\"_blank\"\u003esupport page with instructions\u003c/a\u003e, but the basics are that you should make sure they’re charged, then try closing the lid, and waiting for 15 seconds before opening it again.\u003c/p\u003e\n\u003cp\u003eIf that doesn’t work, hold the button on the AirPods’ case until the status light flashes white.\u003c/p\u003e\u003cspan data-ez-ph-id=\"915\"\u003e\u003c/span\u003e\n\u003cul\u003e\n\u003cli\u003eOn fourth-generation AirPods, this is a capacitive sensor on the front, below the light. (Pictured on the left.)\u003c/li\u003e\n\u003cli\u003eOn AirPods Pro, this is a button on the back of the case. (Pictured on the right.)\u003c/li\u003e\n\u003cli\u003eOn first-generation, second-generation or third-generation AirPods, this is also a button on the back of the case.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAnd if \u003cem\u003ethat\u003c/em\u003e doesn’t work, hold the same button down for at least 15 seconds to perform a reset. You’ll know it worked when you see the status lamp “flash amber a few times and then flash white.”\u003c/p\u003e\n\u003ch3\u003eEnjoy your AirPods\u003c/h3\u003e\n\u003cp\u003eTo be honest, you don’t need to go beyond the first step in this list to set up your AirPods. And enjoy them you will. No more cable tangles, snags, or booming noises from cables rubbing or banging on your clothes as you move. No more forgetting to pause an audiobook when you take out your earbuds. and no more finding your wireless headphones without charge. Happy New Year.\u003c/p\u003e\n\u003ch3\u003eHow to connect AirPods to laptop\u003c/h3\u003e\n\u003cp\u003eYou can use AirPods with a Windows PC or laptop. They’ll work like any other Bluetooth headphones or earbuds, and setting them up is easy.\u003c/p\u003e\u003cspan data-ez-ph-id=\"916\"\u003e\u003c/span\u003e\n\u003cp\u003eTo connect AirPods to a laptop, do the following:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\u003cstrong\u003ePut AirPods in pairing mode\u003c/strong\u003e: Open the AirPods case. Press and hold the setup button on the back of the case until the LED light starts blinking white.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eTurn on Bluetooth\u003c/strong\u003e: On your laptop, go to \u003cstrong\u003eSettings\u003c/strong\u003e, then \u003cstrong\u003eBluetooth \u0026amp; devices\u003c/strong\u003e, and click \u003cstrong\u003eDevices\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eAdd Bluetooth or other device\u003c/strong\u003e: Click the \u003cstrong\u003eplus\u003c/strong\u003e sign where it says “Add Bluetooth or other device.”\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eSelect your AirPods\u003c/strong\u003e: Select your AirPods from the list of devices.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eClick “Connect”\u003c/strong\u003e: If your AirPods don’t connect automatically, click Connect.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eTest the audio\u003c/strong\u003e: Make sure they work by testing the audio.\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch3\u003eHow to connect AirPods to Android\u003c/h3\u003e\n\u003cp\u003eAirPods also work great with Android but some features, like Siri and the battery life indicator, won’t work on Android devices. However, you can use third-party apps like \u003ca href=\"https://play.google.com/store/apps/details?id=com.pryshedko.materialpods\u0026amp;hl=en_US\" data-lasso-id=\"1641668387\" target=\"_blank\"\u003eMaterialPods\u003c/a\u003e to display battery life and launch Google Assistant.\u003c/p\u003e\n\u003cp\u003eTo connect AirPods to an Android device, do the following:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\u003cstrong\u003eTurn on Bluetooth\u003c/strong\u003e: On your Android device go to \u003cstrong\u003eSettings\u003c/strong\u003e \u0026gt; \u003cstrong\u003eConnections\u003c/strong\u003e \u0026gt; \u003cstrong\u003eBluetooth\u003c/strong\u003e. Or swipe down from the top of the screen and touch and hold \u003cstrong\u003eBluetooth\u003c/strong\u003e\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003ePut AirPods in pairing mode\u003c/strong\u003e: Put your AirPods in their charging case and open the lid. Press and hold the setup button on the back of the case until the status light flashes white.\u003c/li\u003e\n\u003cli\u003eSelect your AirPods from the list of Bluetooth devices.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eIf you’re having trouble connecting your AirPods to your Android device, try resetting the connection. Put your AirPods back in their charging case, wait a second, and then take them out again. If that doesn’t work, they may be connecting automatically to another nearby device. To stop this, turn off Bluetooth on any other devices they might be trying to connect to.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eD. Griffin Jones and Leander Kahney also contributed to this article. This article on how to set up AirPods was originally published on December 27, 2017. It was updated with the latest information.\u003c/em\u003e        \u003c/p\u003e\u003cspan data-ez-ph-id=\"917\"\u003e\u003c/span\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-12-25T00:30:00Z",
  "modifiedTime": "2024-12-24T22:17:16Z"
}
