{
  "id": "68fc0503-9612-423e-ae8d-bdc96a954260",
  "title": "Apple fans in Saudi Arabia can now shop directly from Apple",
  "link": "https://appleinsider.com/articles/25/07/21/apple-fans-in-saudi-arabia-can-now-shop-directly-from-apple?utm_source=rss",
  "description": "Apple continues its global retail expansion with a long-awaited online launch in Saudi Arabia.Saudi Arabia — image credit: US Department of StateIn December 2024, Apple CEO Tim Cook announced that Saudi Arabia would be gaining access to the Apple Store online in 2025. Now, it seems as though that time has finally come.Starting today, those in Saudi Arabia can now purchase Apple devices directly from Apple, as spotted by MacRumors. This includes iPhone, iPad, Mac, Apple Watch, and other Apple gear. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "",
  "published": "Mon, 21 Jul 2025 22:52:39 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Amber Neely",
  "length": 1342,
  "excerpt": "Apple continues its global retail expansion with a long-awaited online launch in Saudi Arabia.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v11/icon-512.png",
  "text": "Mon Jul 21 2025, 06:52 PM EDT · 1 minute read Saudi Arabia -- image credit: US Department of State Apple continues its global retail expansion with a long-awaited online launch in Saudi Arabia. In December 2024, Apple CEO Tim Cook announced that Saudi Arabia would be gaining access to the Apple Store online in 2025. Now, it seems as though that time has finally come. Starting today, those in Saudi Arabia can now purchase Apple devices directly from Apple, as spotted by MacRumors. This includes iPhone, iPad, Mac, Apple Watch, and other Apple gear. Previously, anyone in Saudi Arabia who wanted to purchase Apple products needed to rely on Apple Authorized Resellers. Even so, the iPhone was the best-selling smartphone in the region, with studies showing that it accounted for nearly half the market. In addition to the Apple Store Online, Apple hopes to open several flagship Apple Store locations starting in 2026. This includes an \"iconic\" store at Diriyah.",
  "image": "https://photos5.appleinsider.com/gallery/61980-128379-000-lede-Saudi-Arabia-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-block\"\u003e\n        \u003cmain\u003e\n            \u003carticle id=\"post\"\u003e\n                \u003cheader\u003e\n                    \n                    \n                    \u003cdiv\u003e\n                        \u003cp\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/amber+neely.jpg\" width=\"44\" height=\"44\" alt=\"Amber Neely\u0026#39;s profile picture\"/\u003e\n                        \u003c/p\u003e\n                        \u003cp\u003e\n                            \u003ctime datetime=\"\"\u003eMon Jul 21 2025, 06:52 PM EDT\u003c/time\u003e\n                            ·\n                            \u003cspan\u003e1 minute read\u003c/span\u003e\n                        \u003c/p\u003e\n                    \u003c/div\u003e\n                    \u003cdiv\u003e\n                        \u003cp\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/61980-128379-000-lede-Saudi-Arabia-xl.jpg\" alt=\"\"/\u003e\u003c/p\u003e\u003cp title=\"Saudi Arabia -- image credit: US Department of State\"\u003eSaudi Arabia -- image credit: US Department of State\u003c/p\u003e\n                                            \n                                                                                                            \n                                    \u003c/div\u003e\u003c/header\u003e\n                \u003cdiv\u003e\n                    \u003cp\u003eApple continues its global retail expansion with a long-awaited online launch in Saudi Arabia.\n\u003c/p\u003e\u003cp\u003eIn \u003ca href=\"https://appleinsider.com/articles/24/12/09/apple-stores-coming-to-saudi-arabia-for-the-first-time\"\u003eDecember 2024,\u003c/a\u003e Apple CEO \u003ca href=\"https://appleinsider.com/inside/tim-cook\" title=\"Tim Cook\" data-kpt=\"1\"\u003eTim Cook\u003c/a\u003e announced that Saudi Arabia would be gaining access to the Apple Store online in 2025. Now, it seems as though that time has finally come. \n\u003c/p\u003e\u003cp\u003eStarting today, those in Saudi Arabia can now purchase Apple devices directly from Apple, as \u003ca href=\"https://www.macrumors.com/2025/07/21/apple-online-store-now-live-in-saudi-arabia/\"\u003espotted by\u003c/a\u003e \u003cem\u003eMacRumors.\u003c/em\u003e This includes \u003ca href=\"https://appleinsider.com/inside/iphone\" title=\"iPhone\" data-kpt=\"1\"\u003eiPhone\u003c/a\u003e, iPad, Mac, \u003ca href=\"https://appleinsider.com/inside/apple-watch\" title=\"Apple Watch\" data-kpt=\"1\"\u003eApple Watch\u003c/a\u003e, and other Apple gear.\n\u003c/p\u003e\u003cp\u003ePreviously, anyone in Saudi Arabia who wanted to purchase Apple products needed to rely on Apple Authorized Resellers. Even so, the iPhone was the best-selling smartphone in the region, with studies showing that it accounted for nearly half the market. \n\u003c/p\u003e\u003cp\u003eIn addition to the Apple Store Online, Apple hopes to open several flagship Apple Store locations starting in 2026. This includes an \u0026#34;iconic\u0026#34; store at Diriyah. \u003c/p\u003e\n\n                \u003c/div\u003e\n\n                \n            \u003c/article\u003e\n        \u003c/main\u003e\n        \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-07-21T22:52:39Z",
  "modifiedTime": null
}
