{
  "id": "75592431-bfa2-4ab4-a88a-c8e9e15c4df0",
  "title": "WWDC 2025: Everything you need to know before Apple’s big event",
  "link": "https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html",
  "description": "Macworld Of the big Apple events of the year, WWDC is the most reliable: In each of the past 18 Junes, like clockwork, Apple has held a big get-together for its developer partners and announced a raft of important software updates. The September iPhone launch, March/April spring event and October event seem almost unpredictable by comparison. In this article, we list the major announcements (and some of the smaller titbits) you can expect to hear about at WWDC 2025. Some of these–updates to the five big Apple operating systems, most obviously–are as predictable as the timing of the event. But we reckon Apple will spring a few surprises this year. When is WWDC 2025? Apple has announced that WWDC25 will take place from June 9 to 13, with the keynote event on Monday June 9. The company has now invited members of the press to view the keynote stream from Apple Park, including Macworld’s Roman Loyola. When is the WWDC keynote? The keynote is will begin, as usual, at 10am Pacific Time. It will take place on Monday, June 9. If you are wondering what time will the WWDC keynote start where you are it translates to: US: at 10 a.m. (PDT), 11 a.m. (MDT), noon (CDT), 1 p.m. (EDT) Canada: at 2 p.m. (ADT) UK: at 6 p.m. (BST) Europe: at 7 p.m. (CEST) India: at 10.30 p.m. (IST) Singapore and China: next day at 1 a.m. Japan: following day at 2 a.m. (JST) Australia: following day at 1 a.m. (AWST), 2.30 a.m. (ACST), 3 a.m. (AEST) New Zealand: following day at 5 a.m. (NZST) How to watch WWDC 2025 When WWDC starts Apple will live stream the opening keynote on its website and elsewhere, including on the Apple TV app. This means you’ll be able to watch the presentation on iPhone, iPad, Mac, Apple TV, and even PC. Current Apple Developer Program members, Apple Developer Enterprise Program members and Swift Student Challenge winners were able to apply for free tickets. More information about how to do that below. What is WWDC? WWDC stands for the Worldwide Developers Conference and is dedicated to the third-party software and hardware developers that create apps and accessories for Apple’s platforms: iPhone, iPad, Mac, Apple TV, and Vision Pro. At the event Apple previews the software coming to iPhones, Macs, iPads and more later in the year. The beta program starts after the event so that developers can start testing the new software, find out ways to use new features, and and make sure it works with their apps. What will Apple announce at WWDC 2025? While devs are at the heart of the event, Apple uses WWDC to announce its software plans and potentially some new Macs and other products to the world. In the past we’ve seen quite a lot of new stuff, including new Macs. Read on to find out what we expect to see Apple unveil at the event, from software and hardware to some entirely new products. Apple WWDC 2025: Software releases WWDC is all about the software, so we can be certain that Apple will reveal details of its upcoming operating system updates for iPhone, iPad, Mac, Apple TV, HomePod, and Apple Watch. Those updates will then be issued to developers as a beta to test, and then a few weeks later a public beta will start. Learn about participating in Apple’s beta software program so you can test the new software as soon as the beta arrives. Eventually, the new software will be available for everyone to download in the fall (usually September for iOS/iPadOS/watchOS and either September or October for macOS. Here’s what to expect: Apple Intelligence AI will be at the forefront of WWDC, with the company likely to discuss how it is growing its AI feature set known as Apple Intelligence. At WWDC 2024 Apple Intelligence features were a large part of the announcements around iOS 18, iPadOS 18, and macOS 15 Sequoia, but Apple is yet to deliver on some of its promises relating to Apple Intelligence, with some Siri related features being pushed to the iOS 19 release. iOS 19 The headliner of the event simply because of the sheer number of iPhone owners across the planet. If you’ve got an iPhone made within the past five years, you’ll likely be able to install the new version of iOS when it’s released in the fall of 2025–though the Apple Intelligence features are only for the iPhone 15 Pro or later. At WWDC Apple will showcase the new features coming to iPhones later in 2025. The rumors we’ve heard about iOS 19 so far indicate that we could see a major design overhaul, improvements to Siri, more Apple intelligence features, and Home app changes. But before iOS 19 launches, there’s a whole beta-testing cycle to get through. iOS 19 will be announced at WWDC 2025, and then released as a developer beta (for registered app developers only) almost immediately after the keynote. Developers will then be able to install the iOS beta and a few weeks later a public beta version will be made available for all users who want to try the new features. Our advice is to be cautious and prepared for serious flaws with the beta software–it might even brick your device. Over the course of the next few months, the developer and public betas will go through a testing process where features will be tweaked, changed, fixed, and updated until we reach the finished iOS 19.0 public release, most likely in September. Read all the rumors and our hopes for iOS 19 in our iOS 19 guide. iPadOS 19 The accompanying update for iPad owners, iPadOS 19 is likely to incorporate most of the new features of iOS 19 but adapted to a larger-screen interface. When Apple’s two mobile operating systems split in 2019 they were similar in most respects, but the iPad version is heading steadily into its own realm. In 2022, Apple released iPad OS 16 a month after iOS 16, so it’s possible that the two versions don’t arrive at the same time. Find out more about iPadOS 19 in our guide. macOS 16 What’s Apple got in store for its follow-up to macOS Sequoia? We’ll find out at WWDC 2025. This version will be numbered macOS 16, but what is less predictable is the California landmark Apple will name the version after. So far we’ve had: Mavericks, Yosemite, El Capitan, Sierra, High Sierra, Mojave, Catalina, Big Sur, Monterey, Ventura and Sonoma. Based on the trademarks Apple has applied for, macOS Rincon or Skyline could be likely. We’ll share all the rumors and our hopes for macOS 16 in our macOS 16 guide. visionOS 3 Now that the Vision Pro has been on sale for a while you can expect to hear about new software features coming to the device at WWDC. Apple is likely to have things to say about new apps being made for the device as well as third-party software that is being created for Vision Pro. watchOS 12 The new operating system for the Apple Watch will be revealed at WWDC 2025. This is more of a niche than the iPhone, iPad, and Mac updates discussed above but could bring more health and fitness features to Apple Watch owners around the world. Expect AI to have an impact here as well. tvOS 19 The lowest-profile of the big Apple operating systems, tvOS is the platform that runs on the Apple TV. tvOS is generally light on new features, but the push into AI could change that, with new discovery and search tools. HomePod software version 19 Apple is also likely to update the software on the HomePod and HomePod mini alongside the other operating systems. We may hear more about Apple’s plans for the HomePod during the WWDC event–especially as Apple is rumored to planning big changes to the HomePod. Other software You can also expect Apple to update its developer-focused apps, like Swift, Xcode, and TestFlight. Apple displayed this special Swift logo on its WWDC 2023 website.Apple WWDC 2025: Hardware releases WWDC tends to be a software-focused event, but Apple has often found time during its WWDC keynotes to launch hardware products too. The first few iPhone revisions—iPhone 3G, iPhone 3GS, iPhone 4, and iPhone 4S—were all released at WWDC, and the HomePod had its unveiling at the event in 2017 as well. However, the event has focused on Mac releases in recent years. Apple unveiled the iMac Pro in 2017 alongside updates to the iMac, MacBook, and MacBook Pro, and announced a new Mac Pro and the Pro Display XDR in June 2019. At WWDC 2020, Apple announced the transition from Intel to Apple silicon, and WWDC 2022 saw Apple launch the M2 chip in the MacBook Air and MacBook Pro. WWDC 2023 saw Apple introduce the Vision Pro, 15-inch MacBook Air, and the Mac Studio and Mac Pro with M2 Ultra chip. What’s in the hardware pipeline for Apple right now? Hardware seems unlikely for this event due to a heavy focus on AI, but there are still some possibilities for surprises: New Macs We already have M4, M4 Pro, and M4 Max, but no M4 Ultra yet, and updates to the Mac Pro are long overdue. Mac Pro Over the years, including in 2023, new Mac Pro models have been launched at WWDC. Apple updated the Mac Studio in March 2025, but notably Apple gave the Mac Studio an M3 Ultra chip option rather than an M4 Ultra: is the M4 Ultra being kept back for the Mac Pro? It looks like it. Read what we know about the M4 Mac Pro. Other hardware There are also rumors about a HomePod, or HomeHub that could be used to control digital home hardware and home security tools. There are lots of rumors about different products, WWDC could be the first time we hear Apple discuss this new product. Read about Apple’s HomeHub plans. How to attend WWDC If you wanted to attend the WWDC Keynote in person you needed to enter a lottery and apply for a ticket to attend the keynote alongside other developers. There was a lot of competition for those tickets, which were randomly selected from those to apply and aren’t transferable. The good news is that tickets are free, at least. The lottery for ticket allocated for 2025 started at the end of March and those interested had to apply by the beginning of April. The lucky applicants were notified of their success in getting a ticket at the beginning of April. Apple invites developers to participate in a series of classes, workshops, and sessions to learn about the system-wide changes coming to the major software platforms in the coming year so they can update their apps. Some lucky developers even get to watch the event live in person. Current Apple Developer Program members. Apple Entrepreneur Camp alumni. Swift Student Challenge winners; challenge applicants will be included in a separate random selection process for winners (it is usually in May that Apple began alerting the lucky few of their status as winners). Current Apple Developer Enterprise Program members. You can find out more about how to get tickets to WWDC in our FAQ. WWDC keynote tickets have been free and randomly distributed for the past few years, but it previously cost $1,599 for developers to attend and those tickets sold out very quickly. Even without a ticket, all registered Apple developers get online access to session videos, slides, and sample code throughout the week. Apple will share additional conference information in advance of WWDC25 through the Apple Developer app. When was WWDC last year? Apple traditionally holds WWDC during the first weeks of June. Here are the dates from the past few years: WWDC 2024: June 10-14 WWDC 2023: June 5-9 WWDC 2022: June 6-10 WWDC 2021: June 7-11 WWDC 2020: June 22-26 WWDC 2019: June 3-7 WWDC 2018: June 4-8 For a broader view of the year’s plans, check out our guide to the new Apple products coming in 2025. We’ll update this article regularly in the run-up to WWDC, so check back to see the latest news.",
  "author": "",
  "published": "Tue, 20 May 2025 15:19:18 +0000",
  "source": "https://www.macworld.com/index.rss",
  "categories": [
    "Apple Inc, Apple TV, iOS, Mac, MacOS, Personal Software"
  ],
  "byline": "",
  "length": 11826,
  "excerpt": "What you need to know about Apple's WWDC 2025 including date and time, rumors, how to watch, and the expected updates.",
  "siteName": "Macworld",
  "favicon": "https://www.macworld.com/wp-content/uploads/2021/03/cropped-macworld-favicon.png?w=192",
  "text": "Of the big Apple events of the year, WWDC is the most reliable: In each of the past 18 Junes, like clockwork, Apple has held a big get-together for its developer partners and announced a raft of important software updates. The September iPhone launch, March/April spring event and October event seem almost unpredictable by comparison. In this article, we list the major announcements (and some of the smaller titbits) you can expect to hear about at WWDC 2025. Some of these–updates to the five big Apple operating systems, most obviously–are as predictable as the timing of the event. But we reckon Apple will spring a few surprises this year. When is WWDC 2025? Apple has announced that WWDC25 will take place from June 9 to 13, with the keynote event on Monday June 9. The company has now invited members of the press to view the keynote stream from Apple Park, including Macworld’s Roman Loyola. When is the WWDC keynote? The keynote is will begin, as usual, at 10am Pacific Time. It will take place on Monday, June 9. If you are wondering what time will the WWDC keynote start where you are it translates to: US: at 10 a.m. (PDT), 11 a.m. (MDT), noon (CDT), 1 p.m. (EDT) Canada: at 2 p.m. (ADT) UK: at 6 p.m. (BST) Europe: at 7 p.m. (CEST) India: at 10.30 p.m. (IST) Singapore and China: next day at 1 a.m. Japan: following day at 2 a.m. (JST) Australia: following day at 1 a.m. (AWST), 2.30 a.m. (ACST), 3 a.m. (AEST) New Zealand: following day at 5 a.m. (NZST) How to watch WWDC 2025 When WWDC starts Apple will live stream the opening keynote on its website and elsewhere, including on the Apple TV app. This means you’ll be able to watch the presentation on iPhone, iPad, Mac, Apple TV, and even PC. Current Apple Developer Program members, Apple Developer Enterprise Program members and Swift Student Challenge winners were able to apply for free tickets. More information about how to do that below. What is WWDC? WWDC stands for the Worldwide Developers Conference and is dedicated to the third-party software and hardware developers that create apps and accessories for Apple’s platforms: iPhone, iPad, Mac, Apple TV, and Vision Pro. At the event Apple previews the software coming to iPhones, Macs, iPads and more later in the year. The beta program starts after the event so that developers can start testing the new software, find out ways to use new features, and and make sure it works with their apps. What will Apple announce at WWDC 2025? While devs are at the heart of the event, Apple uses WWDC to announce its software plans and potentially some new Macs and other products to the world. In the past we’ve seen quite a lot of new stuff, including new Macs. Read on to find out what we expect to see Apple unveil at the event, from software and hardware to some entirely new products. Apple WWDC 2025: Software releases WWDC is all about the software, so we can be certain that Apple will reveal details of its upcoming operating system updates for iPhone, iPad, Mac, Apple TV, HomePod, and Apple Watch. Those updates will then be issued to developers as a beta to test, and then a few weeks later a public beta will start. Learn about participating in Apple’s beta software program so you can test the new software as soon as the beta arrives. Eventually, the new software will be available for everyone to download in the fall (usually September for iOS/iPadOS/watchOS and either September or October for macOS. Here’s what to expect: Apple Intelligence AI will be at the forefront of WWDC, with the company likely to discuss how it is growing its AI feature set known as Apple Intelligence. At WWDC 2024 Apple Intelligence features were a large part of the announcements around iOS 18, iPadOS 18, and macOS 15 Sequoia, but Apple is yet to deliver on some of its promises relating to Apple Intelligence, with some Siri related features being pushed to the iOS 19 release. iOS 19 The headliner of the event simply because of the sheer number of iPhone owners across the planet. If you’ve got an iPhone made within the past five years, you’ll likely be able to install the new version of iOS when it’s released in the fall of 2025–though the Apple Intelligence features are only for the iPhone 15 Pro or later. At WWDC Apple will showcase the new features coming to iPhones later in 2025. The rumors we’ve heard about iOS 19 so far indicate that we could see a major design overhaul, improvements to Siri, more Apple intelligence features, and Home app changes. But before iOS 19 launches, there’s a whole beta-testing cycle to get through. iOS 19 will be announced at WWDC 2025, and then released as a developer beta (for registered app developers only) almost immediately after the keynote. Developers will then be able to install the iOS beta and a few weeks later a public beta version will be made available for all users who want to try the new features. Our advice is to be cautious and prepared for serious flaws with the beta software–it might even brick your device. Over the course of the next few months, the developer and public betas will go through a testing process where features will be tweaked, changed, fixed, and updated until we reach the finished iOS 19.0 public release, most likely in September. Read all the rumors and our hopes for iOS 19 in our iOS 19 guide. iPadOS 19 The accompanying update for iPad owners, iPadOS 19 is likely to incorporate most of the new features of iOS 19 but adapted to a larger-screen interface. When Apple’s two mobile operating systems split in 2019 they were similar in most respects, but the iPad version is heading steadily into its own realm. In 2022, Apple released iPad OS 16 a month after iOS 16, so it’s possible that the two versions don’t arrive at the same time. Find out more about iPadOS 19 in our guide. macOS 16 What’s Apple got in store for its follow-up to macOS Sequoia? We’ll find out at WWDC 2025. This version will be numbered macOS 16, but what is less predictable is the California landmark Apple will name the version after. So far we’ve had: Mavericks, Yosemite, El Capitan, Sierra, High Sierra, Mojave, Catalina, Big Sur, Monterey, Ventura and Sonoma. Based on the trademarks Apple has applied for, macOS Rincon or Skyline could be likely. We’ll share all the rumors and our hopes for macOS 16 in our macOS 16 guide. visionOS 3 Now that the Vision Pro has been on sale for a while you can expect to hear about new software features coming to the device at WWDC. Apple is likely to have things to say about new apps being made for the device as well as third-party software that is being created for Vision Pro. watchOS 12 The new operating system for the Apple Watch will be revealed at WWDC 2025. This is more of a niche than the iPhone, iPad, and Mac updates discussed above but could bring more health and fitness features to Apple Watch owners around the world. Expect AI to have an impact here as well. tvOS 19 The lowest-profile of the big Apple operating systems, tvOS is the platform that runs on the Apple TV. tvOS is generally light on new features, but the push into AI could change that, with new discovery and search tools. HomePod software version 19 Apple is also likely to update the software on the HomePod and HomePod mini alongside the other operating systems. We may hear more about Apple’s plans for the HomePod during the WWDC event–especially as Apple is rumored to planning big changes to the HomePod. Other software You can also expect Apple to update its developer-focused apps, like Swift, Xcode, and TestFlight. Apple displayed this special Swift logo on its WWDC 2023 website.Apple WWDC 2025: Hardware releases WWDC tends to be a software-focused event, but Apple has often found time during its WWDC keynotes to launch hardware products too. The first few iPhone revisions—iPhone 3G, iPhone 3GS, iPhone 4, and iPhone 4S—were all released at WWDC, and the HomePod had its unveiling at the event in 2017 as well. However, the event has focused on Mac releases in recent years. Apple unveiled the iMac Pro in 2017 alongside updates to the iMac, MacBook, and MacBook Pro, and announced a new Mac Pro and the Pro Display XDR in June 2019. At WWDC 2020, Apple announced the transition from Intel to Apple silicon, and WWDC 2022 saw Apple launch the M2 chip in the MacBook Air and MacBook Pro. WWDC 2023 saw Apple introduce the Vision Pro, 15-inch MacBook Air, and the Mac Studio and Mac Pro with M2 Ultra chip. What’s in the hardware pipeline for Apple right now? Hardware seems unlikely for this event due to a heavy focus on AI, but there are still some possibilities for surprises: New Macs We already have M4, M4 Pro, and M4 Max, but no M4 Ultra yet, and updates to the Mac Pro are long overdue. Mac Pro Over the years, including in 2023, new Mac Pro models have been launched at WWDC. Apple updated the Mac Studio in March 2025, but notably Apple gave the Mac Studio an M3 Ultra chip option rather than an M4 Ultra: is the M4 Ultra being kept back for the Mac Pro? It looks like it. Read what we know about the M4 Mac Pro. Other hardware There are also rumors about a HomePod, or HomeHub that could be used to control digital home hardware and home security tools. There are lots of rumors about different products, WWDC could be the first time we hear Apple discuss this new product. Read about Apple’s HomeHub plans. How to attend WWDC If you wanted to attend the WWDC Keynote in person you needed to enter a lottery and apply for a ticket to attend the keynote alongside other developers. There was a lot of competition for those tickets, which were randomly selected from those to apply and aren’t transferable. The good news is that tickets are free, at least. The lottery for ticket allocated for 2025 started at the end of March and those interested had to apply by the beginning of April. The lucky applicants were notified of their success in getting a ticket at the beginning of April. Apple invites developers to participate in a series of classes, workshops, and sessions to learn about the system-wide changes coming to the major software platforms in the coming year so they can update their apps. Some lucky developers even get to watch the event live in person. Current Apple Developer Program members. Apple Entrepreneur Camp alumni. Swift Student Challenge winners; challenge applicants will be included in a separate random selection process for winners (it is usually in May that Apple began alerting the lucky few of their status as winners). Current Apple Developer Enterprise Program members. You can find out more about how to get tickets to WWDC in our FAQ. WWDC keynote tickets have been free and randomly distributed for the past few years, but it previously cost $1,599 for developers to attend and those tickets sold out very quickly. Even without a ticket, all registered Apple developers get online access to session videos, slides, and sample code throughout the week. Apple will share additional conference information in advance of WWDC25 through the Apple Developer app. When was WWDC last year? Apple traditionally holds WWDC during the first weeks of June. Here are the dates from the past few years: WWDC 2024: June 10-14 WWDC 2023: June 5-9 WWDC 2022: June 6-10 WWDC 2021: June 7-11 WWDC 2020: June 22-26 WWDC 2019: June 3-7 WWDC 2018: June 4-8 For a broader view of the year’s plans, check out our guide to the new Apple products coming in 2025. We’ll update this article regularly in the run-up to WWDC, so check back to see the latest news.",
  "image": "https://www.macworld.com/wp-content/uploads/2025/05/WWDC-2025-Event.jpg?quality=50\u0026strip=all\u0026w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"link_wrapped_content\"\u003e\n\n\n\n\n\u003cp\u003eOf the big \u003ca href=\"https://www.macworld.com/article/672537/when-is-apples-next-event.html\"\u003eApple events\u003c/a\u003e of the year, \u003ca href=\"https://www.macworld.com/wwdc\"\u003eWWDC\u003c/a\u003e is the most reliable: In each of the past 18 Junes, like clockwork, Apple has held a big get-together for its developer partners and announced a raft of important software updates. The September iPhone launch, March/April spring event and October event seem almost unpredictable by comparison.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn this article, we list the major announcements (and some of the smaller titbits) you can expect to hear about at WWDC 2025. Some of these–updates to the five big Apple operating systems, most obviously–are as predictable as the timing of the event. But we reckon Apple will spring a few surprises this year.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"when-is-wwdc-2025\"\u003eWhen is WWDC 2025?\u003c/h2\u003e\n\n\n\n\u003cp\u003eApple has announced that WWDC25 will take place from \u003cstrong\u003eJune 9 to 13\u003c/strong\u003e, with the keynote event on \u003cstrong\u003eMonday June 9.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe company has now invited members of the press to view the keynote stream from Apple Park, including Macworld’s Roman Loyola. \u003c/p\u003e\n\n\t\t\n\t\t\t\n\t\t\t\n\n\n\u003ch2 id=\"when-is-the-wwdc-keynote\"\u003eWhen is the WWDC keynote?\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe keynote is will begin, as usual, at \u003cstrong\u003e10am\u003c/strong\u003e Pacific Time. It will take place on \u003cstrong\u003eMonday, June 9.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you are wondering what time will the WWDC keynote start where you are it translates to:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eUS: at 10 a.m. (PDT), 11 a.m. (MDT), noon (CDT), 1 p.m. (EDT)\u003c/li\u003e\n\n\n\n\u003cli\u003eCanada: at 2 p.m. (ADT)\u003c/li\u003e\n\n\n\n\u003cli\u003eUK: at 6 p.m. (BST)\u003c/li\u003e\n\n\n\n\u003cli\u003eEurope: at 7 p.m. (CEST)\u003c/li\u003e\n\n\n\n\u003cli\u003eIndia: at 10.30 p.m. (IST)\u003c/li\u003e\n\n\n\n\u003cli\u003eSingapore and China: next day at 1 a.m.\u003c/li\u003e\n\n\n\n\u003cli\u003eJapan: following day at 2 a.m. (JST) \u003c/li\u003e\n\n\n\n\u003cli\u003eAustralia: following day at 1 a.m. (AWST), 2.30 a.m. (ACST), 3 a.m. (AEST)\u003c/li\u003e\n\n\n\n\u003cli\u003eNew Zealand: following day at 5 a.m. (NZST)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2 id=\"how-to-watch-wwdc-2025\"\u003eHow to watch WWDC 2025\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhen WWDC starts Apple will live stream the opening keynote on its website and elsewhere, including on the Apple TV app. This means you’ll be able to watch the presentation on iPhone, iPad, Mac, Apple TV, and even PC.\u003c/p\u003e\n\n\n\n\u003cp\u003eCurrent Apple Developer Program members, Apple Developer Enterprise Program members and Swift Student Challenge winners were able to apply for free tickets. More information about how to do that below.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"what-is-wwdc\"\u003eWhat is WWDC?\u003c/h2\u003e\n\n\n\n\u003cp\u003eWWDC stands for the Worldwide Developers Conference and is dedicated to the third-party software and hardware developers that create apps and accessories for Apple’s platforms: iPhone, iPad, Mac, Apple TV, and \u003ca href=\"https://www.macworld.com/article/557878/apple-vision-pro-release-date-headset-specs-price.html\"\u003eVision Pro\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003eAt the event Apple previews the software coming to iPhones, Macs, iPads and more later in the year. The beta program starts after the event so that developers can start testing the new software, find out ways to use new features, and and make sure it works with their apps. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"what-will-apple-announce-at-wwdc-2025\"\u003eWhat will Apple announce at WWDC 2025?\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhile devs are at the heart of the event, Apple uses WWDC to announce its software plans and potentially some new Macs and other products to the world. In the past we’ve seen quite a lot of new stuff, including new Macs. Read on to find out what we expect to see Apple unveil at the event, from software and hardware to some entirely new products.\u003c/p\u003e\n\n\n\u003cdiv\u003e\u003cfigure\u003e\u003cimg decoding=\"async\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/wwdc23-keynote-logo.gif?w=1200\" alt=\"Apple WWDC 2023 keynpte logo\" width=\"1200\" height=\"710\" sizes=\"(max-width: 1200px) 100vw, 1200px\" loading=\"lazy\"/\u003e\u003c/figure\u003e\u003cp\u003eApple\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003ch2 id=\"wwdc-2025-software-releases\"\u003eWWDC 2025: Software releases\u003c/h2\u003e\n\n\n\n\u003cp\u003eWWDC is all about the software, so we can be certain that Apple will reveal details of its upcoming operating system updates for iPhone, iPad, Mac, Apple TV, HomePod, and Apple Watch. Those updates will then be issued to developers as a beta to test, and then a few weeks later a public beta will start. \u003ca href=\"https://www.macworld.com/article/674359/how-to-join-apples-beta-program-and-try-out-new-software.html\"\u003eLearn about participating in Apple’s beta software program\u003c/a\u003e so you can test the new software as soon as the beta arrives. \u003c/p\u003e\n\n\n\n\u003cp\u003eEventually, the new software will be available for everyone to download in the fall (usually September for iOS/iPadOS/watchOS and either September or October for macOS. \u003c/p\u003e\n\n\n\n\u003cp\u003eHere’s what to expect:\u003c/p\u003e\n\n\n\n\u003ch3 id=\"apple-intelligence\"\u003eApple Intelligence\u003c/h3\u003e\n\n\n\n\u003cp\u003eAI will be at the forefront of WWDC, with the company likely to discuss how it is growing its AI feature set known as Apple Intelligence. At WWDC 2024 Apple Intelligence features were a large part of the announcements around iOS 18, iPadOS 18, and macOS 15 Sequoia, but Apple is yet to deliver on some of its promises relating to Apple Intelligence, with some Siri related features being pushed to the iOS 19 release.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"ios-19\"\u003eiOS 19\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe headliner of the event simply because of the sheer number of iPhone owners across the planet. If you’ve got an iPhone made within the past five years, you’ll likely be able to install the new version of iOS when it’s released in the fall of 2025–though the Apple Intelligence features are only for the iPhone 15 Pro or later.\u003c/p\u003e\n\n\n\n\u003cp\u003eAt WWDC Apple will showcase the new features coming to iPhones later in 2025. The rumors we’ve heard about iOS 19 so far indicate that we could see a major design overhaul, improvements to Siri, more Apple intelligence features, and Home app changes. \u003c/p\u003e\n\n\n\n\u003cp\u003eBut before iOS 19 launches, there’s a whole beta-testing cycle to get through. iOS 19 will be announced at WWDC 2025, and then released as a developer beta (for registered app developers only) almost immediately after the keynote. Developers will then be able to \u003ca href=\"https://www.macworld.com/article/671198/ios-beta-latest-how-get.html\"\u003einstall the iOS beta\u003c/a\u003e and a few weeks later a public beta version will be made available for all users who want to try the new features. Our advice is to be cautious and prepared for serious flaws with the beta software–it might even brick your device.\u003c/p\u003e\n\n\n\n\u003cp\u003eOver the course of the next few months, the developer and public betas will go through a testing process where features will be tweaked, changed, fixed, and updated until we reach the finished iOS 19.0 public release, most likely in September.\u003c/p\u003e\n\n\n\n\u003cp\u003eRead all the rumors and our hopes for iOS 19 in our \u003ca href=\"https://www.macworld.com/article/2575705/ios-19-features-release-date-beta.html\" data-type=\"URL\" data-id=\"https://www.macworld.com/article/1785378/ios-17-leak-app-settings-interface-details.html\"\u003eiOS 19 guide.\u003c/a\u003e \u003c/p\u003e\n\n\n\n\u003ch3 id=\"ipados-19\"\u003eiPadOS 19\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe accompanying update for iPad owners, iPadOS 19 is likely to incorporate most of the new features of iOS 19 but adapted to a larger-screen interface. When Apple’s two mobile operating systems split in 2019 they were similar in most respects, but the iPad version is heading steadily into its own realm.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn 2022, Apple released iPad OS 16 a month after iOS 16, so it’s possible that the two versions don’t arrive at the same time.\u003c/p\u003e\n\n\n\n\u003cp\u003eFind out more about \u003ca href=\"https://www.macworld.com/article/2766625/ipados-19-release-date-compatilbity-features-beta.html\"\u003eiPadOS 19 in our guide\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003ch3 id=\"macos-16\"\u003emacOS 16\u003c/h3\u003e\n\n\n\n\u003cp\u003eWhat’s Apple got in store for its follow-up to \u003ca href=\"https://www.macworld.com/article/2265062/macos-15-release-name-compatibility-features.html\"\u003emacOS Sequoia\u003c/a\u003e? We’ll find out at WWDC 2025.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis version will be numbered macOS 16, but what is less predictable is the California landmark Apple will name the version after. \u003ca href=\"https://www.macworld.com/article/672681/list-of-all-macos-versions-including-the-latest-macos.html\" data-type=\"URL\" data-id=\"https://www.macworld.com/article/672681/list-of-all-macos-versions-including-the-latest-macos.html\"\u003eSo far\u003c/a\u003e we’ve had: Mavericks, Yosemite, El Capitan, Sierra, High Sierra, Mojave, Catalina, Big Sur, Monterey, Ventura and Sonoma. Based on the \u003ca href=\"https://www.macworld.com/article/1795091/macos-14-name-skyline-rincon-ios-ipados-features.html\" data-type=\"URL\" data-id=\"https://www.macworld.com/article/1795091/macos-14-name-skyline-rincon-ios-ipados-features.html\"\u003etrademarks Apple has applied for\u003c/a\u003e, macOS Rincon or Skyline could be likely.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe’ll share all the rumors and our hopes for macOS 16 in our \u003ca href=\"https://www.macworld.com/article/2644146/macos-16-release-beta-features-compatibility.html\"\u003emacOS 16 guide\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"visionos-3\"\u003evisionOS 3\u003c/h3\u003e\n\n\n\n\u003cp\u003eNow that the Vision Pro has been on sale for a while you can expect to hear about new software features coming to the device at WWDC. Apple is likely to have things to say about new apps being made for the device as well as third-party software that is being created for Vision Pro. \u003c/p\u003e\n\n\n\n\u003ch3 id=\"watchos-12\"\u003ewatchOS 12\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe new operating system for the Apple Watch will be revealed at WWDC 2025. This is more of a niche than the iPhone, iPad, and Mac updates discussed above but could bring more health and fitness features to Apple Watch owners around the world. Expect AI to have an impact here as well.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"tvos-19\"\u003etvOS 19\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe lowest-profile of the big Apple operating systems, tvOS is the platform that runs on the Apple TV. tvOS is generally light on new features, but the push into AI could change that, with new discovery and search tools.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"homepod-software-version-19\"\u003eHomePod software version 19\u003c/h3\u003e\n\n\n\n\u003cp\u003eApple is also likely to update the software on the HomePod and HomePod mini alongside the other operating systems. We may hear more about Apple’s plans for the HomePod during the WWDC event–especially as Apple is rumored to planning big \u003ca href=\"https://www.macworld.com/article/676817/homepod-with-screen-rumours-and-release-date.html\"\u003echanges to the HomePod\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"other-software\"\u003eOther software \u003c/h3\u003e\n\n\n\n\u003cp\u003eYou can also expect Apple to update its developer-focused apps, like Swift, Xcode, and TestFlight. \u003c/p\u003e\n\n\n\u003cdiv\u003e\u003cfigure\u003e\u003cimg decoding=\"async\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/wwdc-swift.gif?w=1200\" alt=\"WWDC 2023 swift logo\" width=\"1200\" height=\"675\" sizes=\"(max-width: 1200px) 100vw, 1200px\" loading=\"lazy\"/\u003e\u003cfigcaption\u003eApple displayed this special Swift logo on its WWDC 2023 website.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eApple\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003ch2 id=\"wwdc-2025-hardware-releases\"\u003eWWDC 2025: Hardware releases\u003c/h2\u003e\n\n\n\n\u003cp\u003eWWDC tends to be a software-focused event, but Apple has often found time during its WWDC keynotes to launch hardware products too. The first few iPhone revisions—iPhone 3G, iPhone 3GS, iPhone 4, and iPhone 4S—were all released at WWDC, and the HomePod had its unveiling at the event in 2017 as well.\u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, the event has focused on Mac releases in recent years. Apple unveiled the iMac Pro in 2017 alongside updates to the iMac, MacBook, and MacBook Pro, and announced a new Mac Pro and the Pro Display XDR in June 2019. At WWDC 2020, Apple announced the transition from Intel to Apple silicon, and WWDC 2022 saw Apple launch the M2 chip in the MacBook Air and MacBook Pro. WWDC 2023 saw Apple introduce the Vision Pro, 15-inch MacBook Air, and the Mac Studio and Mac Pro with M2 Ultra chip. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhat’s in the hardware pipeline for Apple right now? \u003ca href=\"https://www.macworld.com/article/2354529/wwdc-no-new-hardware-mac-ipads-apple-tv.html\" data-type=\"link\" data-id=\"https://www.macworld.com/article/2354529/wwdc-no-new-hardware-mac-ipads-apple-tv.html\"\u003eHardware seems unlikely\u003c/a\u003e for this event due to a heavy focus on AI, but there are still some possibilities for surprises:\u003c/p\u003e\n\n\n\n\u003ch2 id=\"new-macs\"\u003eNew Macs \u003c/h2\u003e\n\n\n\n\u003cp\u003eWe already have M4, M4 Pro, and M4 Max, but no M4 Ultra yet, and updates to the Mac Pro are long overdue. \u003c/p\u003e\n\n\n\n\u003ch3 id=\"mac-pro\"\u003eMac Pro \u003c/h3\u003e\n\n\n\n\u003cp\u003eOver the years, including in 2023, new Mac Pro models have been launched at WWDC. Apple updated the Mac Studio in March 2025, but notably Apple gave the Mac Studio an M3 Ultra chip option rather than an M4 Ultra: is the M4 Ultra being kept back for the Mac Pro? It looks like it. \u003c/p\u003e\n\n\n\n\u003cp\u003eRead \u003ca href=\"https://www.macworld.com/article/2320613/m3-m4-ultra-mac-pro-everything-you-need-to-know.html\"\u003ewhat we know about the M4 Mac Pro\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"other-hardware\"\u003eOther hardware \u003c/h2\u003e\n\n\n\n\u003cp\u003eThere are also rumors about a HomePod, or HomeHub that could be used to control digital home hardware and home security tools. There are lots of rumors about different products, WWDC could be the first time we hear Apple discuss this new product. \u003c/p\u003e\n\n\n\n\u003cp\u003eRead about \u003ca href=\"https://www.macworld.com/article/676817/homepod-with-screen-rumours-and-release-date.html\"\u003eApple’s HomeHub plans\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"how-to-attend-wwdc\"\u003eHow to attend WWDC\u003c/h2\u003e\n\n\n\n\u003cp\u003eIf you wanted to attend the WWDC Keynote in person you needed to enter a lottery and apply for a ticket \u003ca href=\"https://go.skimresources.com?id=111346X1569486\u0026amp;xs=1\u0026amp;url=https://developer.apple.com/wwdc25/special-event/\u0026amp;xcust=1-3-678333-1-0-0-0-0\u0026amp;sref=https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\" rel=\"nofollow\" data-subtag=\"1-3-678333-1-0-0-0-0\" data-domain-name=\"apple\" target=\"_blank\"\u003eto attend the keynote\u003c/a\u003e alongside other developers. There was a lot of competition for those tickets, which were randomly selected from those to apply and aren’t transferable. The good news is that tickets are free, at least.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe lottery for ticket allocated for 2025 started at the end of March and those interested had to apply by the beginning of April. The lucky applicants were notified of their success in getting a ticket at the beginning of April.\u003c/p\u003e\n\n\n\n\u003cp\u003eApple invites developers to participate in a series of classes, workshops, and sessions to learn about the system-wide changes coming to the major software platforms in the coming year so they can update their apps. Some lucky developers even get to watch the event live in person. \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eCurrent Apple Developer Program members.\u003c/li\u003e\n\n\n\n\u003cli\u003eApple Entrepreneur Camp alumni.\u003c/li\u003e\n\n\n\n\u003cli\u003eSwift Student Challenge winners; challenge applicants will be included in a separate random selection process for winners (it is usually in May that Apple began alerting the lucky few of their status as winners).\u003c/li\u003e\n\n\n\n\u003cli\u003eCurrent Apple Developer Enterprise Program members.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eYou can find out more about \u003ca href=\"https://www.macworld.com/article/698158/how-to-apply-wwdc-keynote-watch-apple-park.html\"\u003ehow to get tickets to WWDC\u003c/a\u003e in our FAQ.\u003c/p\u003e\n\n\n\n\u003cp\u003eWWDC keynote tickets have been free and randomly distributed for the past few years, but it previously cost $1,599 for developers to attend and those tickets sold out very quickly.\u003c/p\u003e\n\n\n\n\u003cp\u003eEven without a ticket, all registered Apple developers get online access to session videos, slides, and sample code throughout the week. \u003c/p\u003e\n\n\n\n\u003cp\u003eApple will share additional conference information in advance of WWDC25 through the \u003ca href=\"https://go.skimresources.com?id=111346X1569486\u0026amp;xs=1\u0026amp;url=https://apps.apple.com/us/app/apple-developer/id640199958/\u0026amp;xcust=1-3-678333-1-0-0-0-0\u0026amp;sref=https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\" rel=\"nofollow\" data-subtag=\"1-3-678333-1-0-0-0-0\" data-domain-name=\"apple\" target=\"_blank\"\u003eApple Developer app\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"when-was-wwdc-last-year\"\u003eWhen was WWDC last year?\u003c/h2\u003e\n\n\n\n\u003cp\u003eApple traditionally holds WWDC during the first weeks of June. Here are the dates from the past few years:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eWWDC 2024: June 10-14\u003c/li\u003e\n\n\n\n\u003cli\u003eWWDC 2023: June 5-9\u003c/li\u003e\n\n\n\n\u003cli\u003eWWDC 2022: June 6-10\u003c/li\u003e\n\n\n\n\u003cli\u003eWWDC 2021: June 7-11\u003c/li\u003e\n\n\n\n\u003cli\u003eWWDC 2020: June 22-26\u003c/li\u003e\n\n\n\n\u003cli\u003eWWDC 2019: June 3-7\u003c/li\u003e\n\n\n\n\u003cli\u003eWWDC 2018: June 4-8\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eFor a broader view of the year’s plans, check out our guide to the \u003ca href=\"https://www.macworld.com/article/671090/new-apple-products.html\"\u003enew Apple products coming in 2025\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe’ll update this article regularly in the run-up to WWDC, so check back to see the latest news.\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": null,
  "modifiedTime": null
}
