{
  "id": "7e30f60b-d395-4275-837d-2ba602721db0",
  "title": "Today in Apple history: Toy Story 2 arrives in theaters",
  "link": "https://www.cultofmac.com/apple-history/toy-story-2-debuts-apple-history",
  "description": "On November 24, 1999, Steve Jobs got another feather in his cap when Pixar's Toy Story 2 arrived in theaters and became a massive hit. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
  "author": "Luke Dormehl",
  "published": "Sun, 24 Nov 2024 18:30:08 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "Apple history",
    "Pixar",
    "Steve Jobs",
    "TIAH: 1990s",
    "Today in Apple history"
  ],
  "byline": "Luke Dormehl",
  "length": 3390,
  "excerpt": "On November 24, 1999, Steve Jobs got another feather in his cap when Pixar's Toy Story 2 arrived in theaters and became a massive hit.",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "Apple history Toy Story 2 coincided with the start of Steve Jobs' own career second act. Photo: Pixar November 24, 1999: Steve Jobs gets another feather in his cap when Toy Story 2, the sequel to the 1995 Pixar hit, debuts in theaters. It goes on to become the first animated sequel in history to gross more than the original. While more a piece of Steve Jobs history than Apple history, the release of Toy Story 2 caps a spectacular year for Apple’s CEO. Toy Story 2: The toys are back in town Originally planned as a direct-to-video movie, Toy Story 2 turned out to be a massive hit for Pixar — and, by extension, for Jobs. The Apple co-founder was as engaged as he ever would be with the animation studio at this stage. With the first Toy Story movie, Jobs’ main contribution was negotiating a distribution deal with Disney. (He also acted as a cheerleader/one-man focus group as the animated film came together.) He played an even bigger part in shaping the sequel. In early 1997, it wasn’t even certain whether Pixar would make Toy Story 2 itself or farm it out to a third party that could produce a stripped-down version to satisfy a home audience made up predominantly of kids. Animated sequel becomes a big hit for Pixar Jobs, however, ultimately made the call for it to become a Pixar flick. He formed the film’s core production team by shutting down Pixar’s video game operations. He put the game team, which produced hit CD-ROMs Toy Story Animated StoryBook and Toy Story Activity Center, to work on the movie sequel. Toy Story 2 also confirmed to Jobs that Pixar’s early successes were no fluke — and that the studio needed a bigger home. With Pixar honcho Ed Catmull, Jobs began looking for a new headquarters soon after the sequel hit theaters. They ultimately found what they were looking for in an abandoned Del Monte fruit-canning facility in Emeryville, California, across the bay from San Francisco. Given that Jobs passed away before Apple Park ever got properly started, developing the Pixar HQ was one of the most hands-on building projects he was ever involved with. It went against the idea of a traditional movie studio with multiple separate buildings. Instead, Pixar opted for one large building based around a central atrium. Anyone wanting to know where the philosophy behind the Apple Park spaceship campus (complete with its focus on random encounters) comes from, look no further! One more thing about Toy Story 2 Toy Story 2 seems a relatively minor footnote in the Pixar pantheon and the life of Steve Jobs in general. However, it’s interesting for another reason. Just four years removed from the original movie’s debut, it’s fascinating to look back and see how much had changed for Jobs during that time. In 1995, he was still outside Apple, with two businesses that certainly didn’t look like big successes. Both NeXT and Pixar appeared to be money pits. By 1999, Jobs had returned to Apple. He became a billionaire, thanks largely to the success of Toy Story and Pixar’s subsequent IPO. And he was the feted mastermind behind hit products like the iMac and iBook. It’s appropriate that Toy Story 2 became a sequel that outperformed the original. This phase of Jobs’ life began his own second act. And it proved much bigger and better than anything he achieved up until this point.",
  "image": "https://www.cultofmac.com/wp-content/uploads/2016/11/Toy-Story-2-image-toy-story-2-36440635-1024-768.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-455513\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/apple-history\" title=\"Apple history\" aria-label=\"Apple history articles\"\u003eApple history\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"Today in Apple history: Toy Story 2 arrives in theaters\" src=\"https://www.cultofmac.com/wp-content/uploads/2016/11/Toy-Story-2-image-toy-story-2-36440635-1024-768.jpg\" alt=\"Toy Story 2 coincided with the start of Steve Jobs\u0026#39; own career second act.\" data-ratio=\"1.3333333333333\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\t\u003cem\u003eToy Story 2\u003c/em\u003e coincided with the start of Steve Jobs\u0026#39; own career second act. \u003cbr/\u003e\u003cem\u003ePhoto: Pixar\u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003e\u003cimg decoding=\"async\" title=\"November 24: Today in Apple history\" src=\"https://www.cultofmac.com/wp-content/uploads/2016/11/24.jpg\" alt=\"November 24: Today in Apple history: Toy Story 2 arrives in theaters\" width=\"80\" height=\"80\" srcset=\"https://www.cultofmac.com/wp-content/uploads/2016/11/24.jpg 80w, https://www.cultofmac.com/wp-content/uploads/2016/11/24-160x160.jpg 160w\" sizes=\"(max-width: 80px) 100vw, 80px\"/\u003e \u003cstrong\u003eNovember 24, 1999:\u003c/strong\u003e Steve Jobs gets another feather in his cap when \u003cem\u003eToy Story 2\u003c/em\u003e, the sequel to the 1995 Pixar hit, debuts in theaters. It goes on to become the first animated sequel in history to gross more than the original.\u003c/p\u003e\n\u003cp\u003eWhile more a piece of \u003ca href=\"https://www.cultofmac.com/steve-jobs\" data-lasso-id=\"1641648025\"\u003eSteve Jobs\u003c/a\u003e history than Apple history, the release of \u003cem\u003eToy Story 2\u003c/em\u003e caps a spectacular year for Apple’s CEO.\u003cspan id=\"more-455513\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eToy Story 2\u003c/em\u003e: The toys are back in town\u003c/h2\u003e\n\u003cp\u003eOriginally planned as a direct-to-video movie, \u003cem\u003eToy Story 2\u003c/em\u003e turned out to be a massive hit for Pixar — and, by extension, for Jobs. The Apple co-founder was as engaged as he ever would be with the animation studio at this stage.\u003c/p\u003e\u003cspan data-ez-ph-id=\"909\"\u003e\u003c/span\u003e\n\u003cp\u003eWith the \u003ca href=\"https://www.cultofmac.com/news/today-in-apple-history-toy-story-arrives-in-theaters\" data-lasso-id=\"1641648026\"\u003efirst \u003cem\u003eToy Story \u003c/em\u003emovie\u003c/a\u003e, Jobs’ main contribution was negotiating a distribution deal with Disney. (He also acted as a cheerleader/one-man focus group as the animated film came together.) He played an even bigger part in shaping the sequel.\u003c/p\u003e\n\u003cp\u003eIn early 1997, it wasn’t even certain whether Pixar would make \u003cem\u003eToy Story 2\u003c/em\u003e itself or farm it out to a third party that could produce a stripped-down version to satisfy a home audience made up predominantly of kids.\u003c/p\u003e\n\u003ch3\u003eAnimated sequel becomes a big hit for Pixar\u003c/h3\u003e\n\u003cp\u003eJobs, however, ultimately made the call for it to become a Pixar flick. He formed the film’s core production team by shutting down Pixar’s video game operations. He put the game team, which produced hit CD-ROMs \u003cem\u003e\u003ca href=\"https://disney.fandom.com/wiki/Toy_Story:_Animated_StoryBook\" data-lasso-id=\"176342\" target=\"_blank\"\u003eToy Story Animated StoryBook\u003c/a\u003e\u003c/em\u003e and \u003cem\u003e\u003ca href=\"https://disney.fandom.com/wiki/Toy_Story:_Activity_Center\" data-lasso-id=\"176343\" target=\"_blank\"\u003eToy Story Activity Center\u003c/a\u003e,\u003c/em\u003e to work on the movie sequel.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eToy Story 2\u003c/em\u003e also confirmed to Jobs that Pixar’s early successes were no fluke — and that the studio needed a bigger home. With Pixar honcho Ed Catmull, Jobs began looking for a new headquarters soon after the sequel hit theaters. They ultimately found what they were looking for in an \u003ca href=\"https://monumenttoextraction.org/stories/food-processing/\" data-lasso-id=\"176344\" target=\"_blank\"\u003eabandoned Del Monte fruit-canning facility\u003c/a\u003e in Emeryville, California, across the bay from San Francisco.\u003c/p\u003e\n\u003cp\u003eGiven that Jobs passed away before \u003ca href=\"https://www.cultofmac.com/638182/apple-park-is-one-of-earths-most-valuable-buildings/\" data-lasso-id=\"176345\"\u003eApple Park\u003c/a\u003e ever got properly started, developing the Pixar HQ was one of the most hands-on building projects he was ever involved with. It went against the idea of a traditional movie studio with multiple separate buildings. Instead, Pixar opted for one large building based around a central atrium.\u003c/p\u003e\n\u003cp\u003eAnyone wanting to know where the philosophy behind the Apple Park spaceship campus (complete with its \u003ca href=\"https://www.cultofmac.com/394681/apples-spaceship-campus-was-designed-to-promote-collaboration/\" data-lasso-id=\"176346\"\u003efocus on random encounters\u003c/a\u003e) comes from, look no further!\u003c/p\u003e\n\u003ch3\u003eOne more thing about \u003cem\u003eToy Story 2\u003c/em\u003e\u003c/h3\u003e\n\u003cp\u003e\u003cem\u003eToy Story 2\u003c/em\u003e seems a relatively minor footnote in the Pixar pantheon and the life of Steve Jobs in general. However, it’s interesting for another reason. Just four years removed from the original movie’s debut, it’s fascinating to look back and see how much had changed for Jobs during that time.\u003c/p\u003e\u003cspan data-ez-ph-id=\"912\"\u003e\u003c/span\u003e\n\u003cp\u003eIn 1995, he was still outside Apple, with two businesses that certainly didn’t look like big successes. Both NeXT and Pixar appeared to be money pits.\u003c/p\u003e\n\u003cp\u003eBy 1999, Jobs had returned to Apple. He \u003ca href=\"https://www.cultofmac.com/456126/steve-jobs-billionaire/\" data-lasso-id=\"1641397128\"\u003ebecame a billionaire\u003c/a\u003e, thanks largely to the success of \u003cem\u003eToy Story\u003c/em\u003e and Pixar’s subsequent IPO. And he was the feted mastermind behind hit products like the \u003ca href=\"https://www.cultofmac.com/442280/today-in-apple-history-imac-g3-arrives-to-save-apple/\" data-lasso-id=\"176348\"\u003eiMac\u003c/a\u003e and \u003ca href=\"https://www.cultofmac.com/439013/today-in-apple-history-ibook-ushers-in-a-wi-fi-revolution/\" data-lasso-id=\"176349\"\u003eiBook\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIt’s appropriate that \u003cem\u003eToy Story 2\u003c/em\u003e became a sequel that outperformed the original. This phase of Jobs’ life began his own second act. And it proved much bigger and better than anything he achieved up until this point.\u003c/p\u003e\u003cspan data-ez-ph-id=\"913\"\u003e\u003c/span\u003e\n\u003cp\u003e\u003ciframe title=\"TOY STORY 2 | Official Trailer | Official Disney Pixar UK\" width=\"780\" height=\"439\" data-ezsrc=\"https://www.youtube.com/embed/0gDFIGAXZa4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e        \u003c/p\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-24T18:30:08Z",
  "modifiedTime": "2024-11-24T18:30:40Z"
}
