{
  "id": "858ed7dd-25fe-4778-b52b-2b763aefe9e9",
  "title": "Contabulation",
  "link": "https://www.macstories.net/linked/contabulation/",
  "description": "Rumors have been flying for a while about a planned redesign for iOS 19. One of the rumors is that iOS tab bars will support search bars, which led Ben McCarthy, the developer of Obscura, to write a terrific breakdown of how tab bars should be used: If search is the primary form of navigation, […]",
  "author": "John Voorhees",
  "published": "Wed, 23 Apr 2025 15:15:55 +0000",
  "source": "https://www.macstories.net/feed",
  "categories": [
    "Linked",
    "design",
    "iOS"
  ],
  "byline": "",
  "length": 1309,
  "excerpt": "Rumors have been flying for a while about a planned redesign for iOS 19. One of the rumors is that iOS tab bars will support search bars, which led Ben McCarthy, the developer of Obscura, to write a terrific breakdown of how tab bars should be used: If search is the primary form of navigation,",
  "siteName": "",
  "favicon": "https://www.macstories.net/app/themes/macstories4/images/apple-touch-icon-152x152-precomposed.png",
  "text": "Rumors have been flying for a while about a planned redesign for iOS 19. One of the rumors is that iOS tab bars will support search bars, which led Ben McCarthy, the developer of Obscura, to write a terrific breakdown of how tab bars should be used: If search is the primary form of navigation, as in Safari, Maps, or Callsheet, it should be at the bottom. If a search bar is just used for filtering content already on screen, then it can make more sense to leave it at the top, as scrolling is probably the more natural way to find what you’re looking for (the Settings app is a good example of this). So I’m delighted at the rumours that iOS 19’s Tab Bars can adapt into Search Bars when needed. I think it’ll be [a] big improvement and allow for more flexible navigation patterns with less code. But Ben didn’t just provide pointers on how tab bars should be used. They also explained that tab bars: should support actions and context menus, accommodate more than five tabs, and allow for user-generated tabs, something that is common on macOS. It’s a great post, well worth studying as we wait to see whether and how far Apple will go in modifying the tab bar. As Ben notes, the tab bar has been around since the beginning of the iPhone, has changed very little, and is due for a redesign. I agree.",
  "image": "https://56243e3f6f46fe44a301-deabeb5f3878e3553d0b065ea974f9bf.ssl.cf1.rackcdn.com/256px.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"content\"\u003e\n\n    \n\n    \u003cdiv\u003e\n                        \u003cp id=\"p1\"\u003eRumors have been flying for a while about \u003ca href=\"https://www.macrumors.com/2025/04/07/ios-19-rounder-app-icons-video/\" rel=\"noopener noreferrer\"\u003ea planned redesign for iOS 19\u003c/a\u003e. One of the rumors is that iOS tab bars will support search bars, which led \u003ca href=\"https://mastodon.social/@BenRiceM\" rel=\"noopener noreferrer\"\u003eBen McCarthy\u003c/a\u003e, the developer of \u003ca href=\"https://obscura.camera\" rel=\"noopener noreferrer\"\u003eObscura\u003c/a\u003e, to write \u003ca href=\"https://benricemccarthy.ghost.io/contabulation/\" rel=\"noopener noreferrer\"\u003ea terrific breakdown of how tab bars should be used\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote id=\"blockquote2\"\u003e\u003cp\u003e\n  If search is the primary form of navigation, as in Safari, Maps, or Callsheet, it should be at the bottom. If a search bar is just used for filtering content already on screen, then it can make more sense to leave it at the top, as scrolling is probably the more natural way to find what you’re looking for (the Settings app is a good example of this). So I’m delighted at the rumours that iOS 19’s Tab Bars can adapt into Search Bars when needed. I think it’ll be [a] big improvement and allow for more flexible navigation patterns with less code.\n\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp id=\"p3\"\u003eBut Ben didn’t just provide pointers on how tab bars should be used. They also explained that tab bars:\u003c/p\u003e\n\u003cul id=\"ul4\"\u003e\u003cli\u003eshould support actions and context menus, \u003c/li\u003e\n\u003cli\u003eaccommodate more than five tabs, \u003c/li\u003e\n\u003cli\u003eand allow for user-generated tabs, something that is common on macOS. \u003c/li\u003e\n\u003c/ul\u003e\u003cp id=\"p5\"\u003eIt’s a great post, well worth studying as we wait to see whether and how far Apple will go in modifying the tab bar. As Ben notes, the tab bar has been around since the beginning of the iPhone, has changed very little, and is due for a redesign. I agree.\u003c/p\u003e\n            \u003c/div\u003e\n\n    \n        \n\n    \n    \n    \n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-23T15:15:55-04:00",
  "modifiedTime": null
}
