{
  "id": "95bfa860-5d08-46b0-b632-218d4a927e2b",
  "title": "iOS 18.2 is nearing its public release and it's packed with AI features",
  "link": "https://appleinsider.com/articles/24/12/05/ios-182-is-nearing-its-public-release-and-its-packed-with-ai-features?utm_medium=rss",
  "description": "The release candidate version of iOS 18.2 has arrived, as Apple gears up for the software's full public rollout. Here's everything you need to know about the update and its features.Here's what's new in iOS 18.2.On Thursday, two weeks after the fourth developer beta, Apple deployed the release candidate build of iOS 18.2. While the update can be installed on devices as old as the iPhone XR and iPhone XS, the software includes a variety of features that only work on iPhone 15 Pro, iPhone 15 Pro Max, and the iPhone 16 range.Apple Intelligence makes it possible to use generative AI software for things such as text editing, proofreading, summarization, as well as tone adjustment, among other things. These features are available system-wide through a dedicated Writing Tools framework on iOS, iPadOS, and macOS, with iOS 18.2 bringing even more AI-powered functionality to the table. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Marko Zivkovic",
  "published": "Thu, 05 Dec 2024 23:39:22 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Marko Zivkovic",
  "length": 14051,
  "excerpt": "The release candidate version of iOS 18.2 has arrived, as Apple gears up for the software's full public rollout. Here's everything you need to know about the update and its features.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "The release candidate version of iOS 18.2 has arrived, as Apple gears up for the software's full public rollout. Here's everything you need to know about the update and its features. On Thursday, two weeks after the fourth developer beta, Apple deployed the release candidate build of iOS 18.2. While the update can be installed on devices as old as the iPhone XR and iPhone XS, the software includes a variety of features that only work on iPhone 15 Pro, iPhone 15 Pro Max, and the iPhone 16 range. Apple Intelligence makes it possible to use generative AI software for things such as text editing, proofreading, summarization, as well as tone adjustment, among other things. These features are available system-wide through a dedicated Writing Tools framework on iOS, iPadOS, and macOS, with iOS 18.2 bringing even more AI-powered functionality to the table. Subscribe to AppleInsider on YouTubeSubscribe to AppleInsider on YouTubeThe software expands upon the existing capabilities of Writing Tools, originally introduced with iOS 18.1. The iOS 18.2 update offers many new Apple Intelligence features related to image generation, as well as a variety of other improvements. Starting with iOS 18.2, Siri can forward questions and requests to ChatGPT. OpenAI's software also powers a new text composition feature in Writing Tools. This means that users can ask ChatGPT to generate text or answer questions directly from iOS, rather than using a third-party app or website. iOS 18.2 introduces ChatGPT integration. ChatGPT integration was introduced with user privacy in mind, as all requests are sent anonymously. A ChatGPT account is not required for the use of basic features, which are freely available to users at any time. Advanced ChatGPT capabilities, however, are available only in a limited capacity. As part of the iOS 18.2 update, users will be able to see whether or not they've exceeded the daily limit for ChatGPT's advanced capabilities. Once the advanced capability limit has been passed, additional requests are sent to the basic version of ChatGPT for up to 24 hours. Those who want even more now have the option to upgrade to ChatGPT Plus for $19.99 a month straight from the Settings app. Siri has gained the ability to fetch real-time information with ChatGPT Plus, and the virtual assistant can share screenshots with ChatGPT as well. It's worth pointing out that ChatGPT integration is only available for devices that already support Apple Intelligence, such as the iPhone 16 range. With the iOS 18.2 update, Apple has also included new settings specific to these devices. iOS 18.2 enables Visual Intelligence on the iPhone 16 range iOS 18.2 introduces various settings for the Camera Control, which made its debut with the iPhone 16 range. The Camera Control is an entirely new hardware component, a button with a capacitive surface and a force sensor. The button can be used in conjunction with Apple Intelligence through an entirely new feature known as Visual Intelligence. Visual Intelligence is available on iPhone 16 models running iOS 18.2. With Visual Intelligence, users can click and hold the Camera Control button while aiming their iPhone 16 at an object or location of interest. This will, in turn, provide users with useful information via Apple's generative AI software. For instance, users can point their devices towards a restaurant and receive details about the location's ratings or working hours. In the same way, it's also possible to add a calendar event from a flyer or identify a dog by breed. Additional Camera Control settings for iPhone 16 users There are also new settings related to the Camera Control and its functions in iOS 18.2. Users can now adjust the double-click speed for Camera Control. Apart from the Default option, the double-click speed can be set to Slow or Slower. iOS 18.2 introduces additional settings for the Camera Control on iPhone 16. The software update adds a new AE/AF Lock option as well, which locks the exposure and focus when taking a photo. The Camera Control can be configured to toggle AE/AF Lock with a light press. This means that the exposure stays consistent and that the image won't darken, even when the iPhone is moved around. Apple has added a new customization option that lets you open the Camera app even if your screen is off. Located in Settings \u003e Display and Brightness, there's now an option titled Require Screen On, which is enabled by default. Disabling this option lets you activate the Camera app via Camera Control even if the device's display is currently off. iOS 18.2 introduces Image Playground, which is an entirely new system application that lets users create images through artificial intelligence. Image Playground uses AI to generate images at the user's request. In the Image Playground app, users can write a description of the image they want to see and have generative AI create it. This can be an image of a person they know, a landscape, an object, or anything in between. The software does have guardrails in place, though, so it's not able to create images of copyrighted characters or inappropriate content. Images can be created in one of two styles: animation and illustration. The content created within Image Playground is not hyper-realistic by any means. Apple has also made sure that all images generated with the app are labeled as such so that they could never be mistaken for real-world photographs. Image Playground can generate images of people the user knows. Image Playground allows you to generate images with a resolution of 1024 by 1024. They are saved locally and can be shared like any other photo on your iPhone, iPad, or Mac. A similar feature, known as Image Wand, lets users create images based on text found within the Notes app. Typed or handwritten text can be turned into an image through artificial intelligence. Image Playground features integration with system applications such as Freeform, Keynote, Messages, and Pages, as well as with third-party apps. With it, users can create so-called Genmojis along with other types of images. Create custom 'Genmoji' with Apple Intelligence on iOS 18.2 With iOS 18.2, users can create unique emojis straight from the iOS keyboard. These custom emoticons are known as Genmoji and can be synced via iCloud, appearing in the user's sticker drawer across all compatible devices. With iOS 18.2, it's possible to create so-called Genmoji. Users can simply describe the emoji they want to create, such as one based on an object or a person they know, and Apple Intelligence will make it a reality. Genmoji can be created with source images from the Photos app, or a generic emoji person can be used instead. Genmoji don't necessarily need to be people, though, as they can consist of various objects, both real and imaginary — it's all up to the end user's creativity. On-device email categorization is available within the Mail application The Mail app has received a significant update with iOS 18.2, as Apple's built-in email application can now sort emails into pre-defined categories. Email categorization was one of the key improvements previewed at WWDC 2024, and it's now finally here. Apple's Mail app can sort emails into pre-defined categories on iOS 18.2. Through machine learning, the built-in Mail app can classify emails into categories such as: Primary - which displays time-sensitive messages, emails from people the user might know, and other important information Transactions - an email category for receipts and order confirmations Updates - which contains newsletters and social media notices Promotions - for marketing and sales-related emails The Mail app now features an entirely new Digest view, which can display all emails from a specific company, making interactions with these messages significantly easier. With the Digest view, users will be able to get information about flights from a particular company, for instance. Users will also be able to adjust the email category in which senders appear. There's also a new option for app badges, letting users choose whether they appear only for primary unread messages or all unread messages. While Apple Intelligence and its associated features are undoubtedly a major component of the iOS 18.2 update, the software also contains a variety of improvements that have nothing to do with AI. Specifically, iOS 18.2 contains new features for FindMy, Photos, and much more. FindMy has received a significant update with iOS 18.2, as the software now lets users share the location of lost items with people they trust. FindMy has received a significant improvement with iOS 18.2. When an AirTag or other item is lost, users can opt to share the location of the item with a trusted individual or even an airline, all so that the lost item can be more easily recovered. This could be particularly useful for lost luggage, though FindMy-equipped devices have also helped authorities locate stolen vehicles in some instances. The lost item's location is shared in the form of a link. The link recipient will be able to see the AirTag's location, serial number, and the user's Apple Account email or phone number for a limited amount of time. Location sharing is automatically stopped once the item is found, or when the link to the item's location expires. Hearing Health features for AirPods Pro 2 now available in more countries iOS 18.2 also expands the availability of Hearing Health features for the AirPods Pro 2 wireless earbuds. Specifically, the Hearing Test feature is now available in Cyprus, Czechia, France, Italy, Luxembourg, Romania, Spain, the United Arab Emirates, and the United Kingdom. The clinical-grade Hearing Aid feature, meanwhile, was made available in the United Arab Emirates. Hearing Health features for AirPods Pro 2 are now available in additional countries. Hearing Health features were originally introduced with the iOS 18.1 update in the United States, following FDA approval in September 2024. On AirPods Pro 2, these features let users test their hearing or use the device as a hearing aid in cases of mild to moderate hearing loss. It's worth noting, though, that the AirPods Pro 2 need to be running firmware 7B19 or newer for any of these features to function. The features are not meant to work in countries or regions where they have not yet been approved. Other changes in the iOS 18.2 update The operating system also introduces a minor change to video playback in the Photos application. Videos are no longer automatically zoomed in as soon as playback begins. Users also have the option to scrub through a video frame-by-frame and can disable the auto-looping of video playback. iPadOS 18.2 features a revamped tab bar in the Apple TV app. On the iPad side of things, iPadOS 18.2 introduces a noteworthy change to the Apple TV application. The in-app tab bar has been made customizable, and now items from the sidebar can be added to it. Certain system applications and features have also received minor updates: Apple Music and Apple TV — a new Natural Search feature makes it easier to search for content by actor, decade, genre, mood, etc. Face ID — When trusting a computer from an iPhone, Face ID can now be used for authentication instead of the user's passcode. iPhone Mirroring — allows users to mirror their iPhone screen even when a Mac is using it as a personal hotspot. Podcasts — new options for Favorite categories, and a personalized Search page. Notes — an additional \"Create Image\" button that appears when text is selected. Safari — new background images for the Safari Start Page, along with a Live Activity for file downloads. Shortcuts — three new shortcuts related to the Fitness application. Stocks — pre-market price quotes let users track track NASDAQ and NYSE tickers prior to market open Voice Memos — support for layered recording, which can be used to add vocals to a song idea, for instance. Misc. — Web content filters are now automatically enabled for minors in Utah. While there are some improvements of note in this list, the great majority of them build upon existing applications and their features. The software also contains a few minor bug fixes, as detailed in Apple's release notes. visionOS 2.2 brings Wide and Ultrawide views to Mac Virtual Display, watchOS 11.2 adds a new pause button visionOS 2.2, on the other hand, includes a major improvement to the Mac Virtual Display feature. While the Apple Vision Pro was always usable as an external display for Mac, there are now two new display modes: Ultrawide and Wide. According to Apple, the new Ultrawide setting is the equivalent of connecting two 4K monitors to a Mac and using them side-by-side. visionOS 2.2 introduces improvements to the Mac Virtual Display feature. Apple also made it possible to view multiple sports games at once on the Apple Vision Pro. With visionOS 2.2, users can now view up to 5 MLB or MLS games simultaneously through their Apple TV+ subscription. While it's not currently possible to view other sports, Apple has added SharePlay integration with visionOS 2.2, letting users of the headset watch games together. On the Apple Watch, watchOS 11.2 introduces a new pause button for the Camera Remote application. This means that it's now possible to pause videos being recorded on an iPhone via the Camera Remote app on an Apple Watch, through a new button located on the left side of the screen. The Apple Vision Pro and Apple Watch platforms still lack Apple Intelligence, though, meaning that their users won't be able to take advantage of the various AI features available on other Apple platforms. Although some Apple Intelligence features are already here, such as email summarization and the Clean Up tool in Photos, a good chunk of them are still only available in the release candidate build. iOS 18.2 is expected to receive its final public release in early December 2024, which is when features like Image Playground and Visual Intelligence will become available to all users.",
  "image": "https://photos5.appleinsider.com/gallery/61959-128345-61501-127082-iOS-182-V2-xl-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n          \u003cp\u003eThe release candidate version of \u003ca href=\"https://appleinsider.com/inside/ios-18\" title=\"iOS 18\" data-kpt=\"1\"\u003eiOS 18.2\u003c/a\u003e has arrived, as Apple gears up for the software\u0026#39;s full public rollout. Here\u0026#39;s everything you need to know about the update and its features.\n\u003c/p\u003e\u003cp\u003eOn Thursday, two weeks after the \u003ca href=\"https://appleinsider.com/articles/24/11/20/fourth-round-of-developer-betas-for-ios-182-ipados-182-macos-sequoia-152-land\"\u003efourth developer beta\u003c/a\u003e, Apple \u003ca href=\"https://appleinsider.com/articles/24/12/05/apple-issues-release-candidates-for-ios-182-ipados-182-macos-sequoia-152\"\u003edeployed\u003c/a\u003e the release candidate build of iOS 18.2. While the update can be installed on devices as old as the \u003ca href=\"https://appleinsider.com/inside/iphone-xr\"\u003eiPhone XR\u003c/a\u003e and \u003ca href=\"https://appleinsider.com/inside/iphone-xs\"\u003eiPhone XS\u003c/a\u003e, the software includes a variety of features that only work on \u003ca href=\"https://appleinsider.com/inside/iphone-15-pro\" title=\"iPhone 15 Pro\" data-kpt=\"1\"\u003eiPhone 15 Pro\u003c/a\u003e, iPhone 15 Pro Max, and the \u003ca href=\"https://appleinsider.com/inside/iphone-16\" title=\"iPhone 16\" data-kpt=\"1\"\u003eiPhone 16\u003c/a\u003e range. \n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://appleinsider.com/inside/apple-intelligence\" title=\"Apple Intelligence\" data-kpt=\"1\"\u003eApple Intelligence\u003c/a\u003e makes it possible to use generative AI software for things such as text editing, proofreading, \u003ca href=\"https://appleinsider.com/articles/24/06/11/apple-mail-in-ios-18-introduces-on-device-email-categorization-smart-replies-and-summaries\"\u003esummarization\u003c/a\u003e, as well as tone adjustment, among other things. These features are available system-wide through a dedicated Writing Tools framework on iOS, \u003ca href=\"https://appleinsider.com/inside/ipados\" title=\"iPadOS\" data-kpt=\"1\"\u003eiPadOS\u003c/a\u003e, and \u003ca href=\"https://appleinsider.com/inside/macos\" title=\"macOS\" data-kpt=\"1\"\u003emacOS\u003c/a\u003e, with iOS 18.2 bringing even more AI-powered functionality to the table.\n\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ciframe src=\"https://www.youtube.com/embed/OJR48omm8hY\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" loading=\"lazy\"\u003e\u003c/iframe\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.youtube.com/c/appleinsider?sub_confirmation=1\"\u003eSubscribe to AppleInsider on YouTube\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.youtube.com/c/appleinsider?sub_confirmation=1\"\u003eSubscribe to AppleInsider on YouTube\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe software expands upon the existing capabilities of Writing Tools, originally introduced with \u003ca href=\"https://appleinsider.com/articles/24/10/28/ios-181-ipados-181-review-baby-steps-with-apple-intelligence\"\u003eiOS 18.1\u003c/a\u003e. The iOS 18.2 update offers many new Apple Intelligence features related to \u003ca href=\"https://appleinsider.com/articles/24/10/23/hands-on-with-image-playground-chatgpt-and-genmoji-in-ios-182\"\u003eimage generation\u003c/a\u003e, as well as a variety of other improvements.\n\u003c/p\u003e\u003cp\u003eStarting with iOS 18.2, \u003ca href=\"https://appleinsider.com/inside/siri\" title=\"Siri\" data-kpt=\"1\"\u003eSiri\u003c/a\u003e can forward questions and requests to ChatGPT. OpenAI\u0026#39;s software also powers a new text composition feature in Writing Tools. This means that users can ask ChatGPT to generate text or answer questions directly from \u003ca href=\"https://appleinsider.com/inside/ios\" title=\"iOS\" data-kpt=\"1\"\u003eiOS\u003c/a\u003e, rather than using a third-party app or website.\n\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61959-128334-61641-127411-ChatGPT-Signup-xl-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/61959-128334-61641-127411-ChatGPT-Signup-xl-xl.jpg\" alt=\"Smartphone displaying ChatGPT Plus subscription screen on a white surface, with a green plant and an AirPods case nearby.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003e\u003cspan\u003eiOS 18.2 introduces ChatGPT integration.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003eChatGPT integration was introduced with user privacy in mind, as all requests are sent anonymously. A ChatGPT account is not required for the use of basic features, which are freely available to users at any time.\n\u003c/p\u003e\u003cp\u003eAdvanced ChatGPT capabilities, however, are available only in a limited capacity. As part of the iOS 18.2 update, users will be able to see whether or not they\u0026#39;ve exceeded the daily limit for ChatGPT\u0026#39;s advanced capabilities.\n\u003c/p\u003e\u003cp\u003eOnce the advanced capability limit has been passed, additional requests are sent to the basic version of ChatGPT for up to 24 hours. Those who want even more now have the option to upgrade to ChatGPT Plus for $19.99 a month straight from the Settings app. Siri has gained the ability to fetch real-time information with ChatGPT Plus, and the virtual assistant can share screenshots with ChatGPT as well.\n\u003c/p\u003e\u003cp\u003eIt\u0026#39;s worth pointing out that ChatGPT integration is only available for devices that already support Apple Intelligence, such as the iPhone 16 range. With the iOS 18.2 update, Apple has also included new settings specific to these devices.\n\u003c/p\u003e\u003cp\u003e\u003ch2 data-anchor=\"ios-182-enables-visual-intelligence-on-the-iphone-16-range\" id=\"ios-182-enables-visual-intelligence-on-the-iphone-16-range\"\u003eiOS 18.2 enables Visual Intelligence on the iPhone 16 range\u003c/h2\u003e\n\u003c/p\u003e\u003cp\u003eiOS 18.2 introduces various settings for the \u003ca href=\"https://appleinsider.com/inside/iphone-16/tips/iphone-16-camera-control-button----the-ultimate-guide\"\u003eCamera Control\u003c/a\u003e, which \u003ca href=\"https://appleinsider.com/articles/24/09/10/iphone-16-has-a-new-camera-control-button----heres-everything-it-can-do\"\u003emade its debut\u003c/a\u003e with the iPhone 16 range. The Camera Control is an entirely new hardware component, a button with a capacitive surface and a force sensor.  The button can be used in conjunction with Apple Intelligence through an entirely new feature known as Visual Intelligence.\n\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61959-128335-61501-127072-Visual-Intelligence-xl-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/61959-128335-61501-127072-Visual-Intelligence-xl-xl.jpg\" alt=\"Two hands interact with a smartphone displaying search results for a LEGO Ghostbusters vehicle.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003e\u003cspan\u003eVisual Intelligence is available on iPhone 16 models running iOS 18.2.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003eWith Visual Intelligence, users can click and hold the Camera Control button while aiming their iPhone 16 at an object or location of interest. This will, in turn, provide users with useful information via Apple\u0026#39;s generative AI software.\n\u003c/p\u003e\u003cp\u003eFor instance, users can point their devices towards a restaurant and receive details about the location\u0026#39;s ratings or working hours. In the same way, it\u0026#39;s also possible to add a calendar event from a flyer or identify a dog by breed.\n\u003c/p\u003e\u003cp\u003e\u003ch2 data-anchor=\"additional-camera-control-settings-for-iphone-16-users\" id=\"additional-camera-control-settings-for-iphone-16-users\"\u003eAdditional Camera Control settings for iPhone 16 users\u003c/h2\u003e\n\u003c/p\u003e\u003cp\u003eThere are also new settings related to the Camera Control and its functions in iOS 18.2. Users can now adjust the double-click speed for Camera Control. Apart from the \u003cstrong\u003eDefault\u003c/strong\u003e option, the double-click speed can be set to \u003cstrong\u003eSlow\u003c/strong\u003e or \u003cstrong\u003eSlower\u003c/strong\u003e.\n\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61959-128336-61641-127412-AE-AF-Lock-for-Camera-Control-xl-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/61959-128336-61641-127412-AE-AF-Lock-for-Camera-Control-xl-xl.jpg\" alt=\"Person holding a smartphone displaying camera control settings, with a plant and a pair of white earbuds on a table in the background.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003e\u003cspan\u003eiOS 18.2 introduces additional settings for the Camera Control on iPhone 16.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003eThe software update adds a new \u003cstrong\u003eAE/AF Lock\u003c/strong\u003e option as well, which locks the exposure and focus when taking a photo. The Camera Control can be configured to toggle AE/AF Lock with a light press. This means that the exposure stays consistent and that the image won\u0026#39;t darken, even when the \u003ca href=\"https://appleinsider.com/inside/iphone\" title=\"iPhone\" data-kpt=\"1\"\u003eiPhone\u003c/a\u003e is moved around.\n\u003c/p\u003e\u003cp\u003eApple has added a new customization option that lets you open the Camera app even if your screen is off. Located in \u003cstrong\u003eSettings \u0026gt; Display and Brightness\u003c/strong\u003e, there\u0026#39;s now an option titled \u003cstrong\u003eRequire Screen On\u003c/strong\u003e, which is enabled by default. Disabling this option lets you activate the Camera app via Camera Control even if the device\u0026#39;s display is currently off.\n\u003c/p\u003e\u003cp\u003eiOS 18.2 introduces \u003ca href=\"https://appleinsider.com/articles/24/06/10/apples-image-playground-is-a-new-system-wide-ai-powered-image-generation-tool\"\u003eImage Playground\u003c/a\u003e, which is an entirely new system application that lets users create images through artificial intelligence.\n\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61959-128337-61501-127073-Image-Playground-Generation-xl-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/61959-128337-61501-127073-Image-Playground-Generation-xl-xl.jpg\" alt=\"A person interacting with a smartphone displaying animated emoji characters and suggestions for customization, with hands visible on a white background.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003e\u003cspan\u003eImage Playground uses AI to generate images at the user\u0026#39;s request.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003eIn the Image Playground app, users can write a description of the image they want to see and have generative AI create it. This can be an image of a person they know, a landscape, an object, or anything in between. The software does have guardrails in place, though, so it\u0026#39;s not able to create images of copyrighted characters or inappropriate content.\n\u003c/p\u003e\u003cp\u003eImages can be created in one of two styles: animation and illustration. The content created within Image Playground is not hyper-realistic by any means. Apple has also made sure that all images generated with the app are labeled as such so that they could never be mistaken for real-world photographs.\n\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61959-128344-61501-127075-Image-Generation-Doesnt-Match-Photos-very-well-xl-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/61959-128344-61501-127075-Image-Generation-Doesnt-Match-Photos-very-well-xl-xl.jpg\" alt=\"Person interacting with a smartphone screen displaying a character customization interface, featuring a cartoonish elderly man with a bald head and large ears.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003e\u003cspan\u003eImage Playground can generate images of people the user knows.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003eImage Playground allows you to generate images with a resolution of 1024 by 1024. They are saved locally and can be shared like any other photo on your iPhone, \u003ca href=\"https://appleinsider.com/inside/ipad\" title=\"iPad\" data-kpt=\"1\"\u003eiPad\u003c/a\u003e, or \u003ca href=\"https://appleinsider.com/inside/mac\" title=\"Mac\" data-kpt=\"1\"\u003eMac\u003c/a\u003e. A similar feature, known as Image Wand, lets users create images based on text found within the Notes app. Typed or handwritten text can be turned into an image through artificial intelligence.\n\u003c/p\u003e\u003cp\u003eImage Playground features integration with system applications such as Freeform, Keynote, Messages, and Pages, as well as with third-party apps. With it, users can create so-called \u003ca href=\"https://appleinsider.com/articles/24/06/10/genmoji-will-allow-custom-ai-created-emojis-in-ios-18-and-might-resurrect-memoji\"\u003eGenmojis\u003c/a\u003e along with other types of images. \n\u003c/p\u003e\u003cp\u003e\u003ch2 data-anchor=\"create-custom-genmoji-with-apple-intelligence-on-ios-182\" id=\"create-custom-genmoji-with-apple-intelligence-on-ios-182\"\u003eCreate custom \u0026#39;Genmoji\u0026#39; with Apple Intelligence on iOS 18.2\u003c/h2\u003e\n\u003c/p\u003e\u003cp\u003eWith iOS 18.2, users can create unique emojis straight from the iOS keyboard. These custom emoticons are known as Genmoji and can be synced via \u003ca href=\"https://appleinsider.com/inside/icloud\" title=\"iCloud\" data-kpt=\"1\"\u003eiCloud\u003c/a\u003e, appearing in the user\u0026#39;s sticker drawer across all compatible devices.\n\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61959-128338-61501-127071-Describing-Genmoji-xl-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/61959-128338-61501-127071-Describing-Genmoji-xl-xl.jpg\" alt=\"Hands holding a smartphone with a shopping cart emoji on the screen, typing a description into a text box below the emoji.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWith iOS 18.2, it\u0026#39;s possible to create so-called Genmoji.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003eUsers can simply describe the emoji they want to create, such as one based on an object or a person they know, and Apple Intelligence will make it a reality. Genmoji can be created with source images from the Photos app, or a generic emoji person can be used instead.\n\u003c/p\u003e\u003cp\u003eGenmoji don\u0026#39;t necessarily need to be people, though, as they can consist of various objects, both real and imaginary —  it\u0026#39;s all up to the end user\u0026#39;s creativity.\n\u003c/p\u003e\u003cp\u003e\u003ch2 data-anchor=\"ondevice-email-categorization-is-available-within-the-mail-application\" id=\"ondevice-email-categorization-is-available-within-the-mail-application\"\u003eOn-device email categorization is available within the Mail application\u003c/h2\u003e\n\u003c/p\u003e\u003cp\u003eThe Mail app has received a significant update with iOS 18.2, as Apple\u0026#39;s built-in email application can now sort emails into pre-defined categories. Email categorization was one of the key improvements previewed at \u003ca href=\"https://appleinsider.com/inside/wwdc\" title=\"WWDC\" data-kpt=\"1\"\u003eWWDC\u003c/a\u003e 2024, and it\u0026#39;s now finally here.\n\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61959-128339-61501-127079-Mail-Filtering-xl-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/61959-128339-61501-127079-Mail-Filtering-xl-xl.jpg\" alt=\"Person holding a smartphone displaying an inbox with notifications and message summaries. Hands are partially visible with a bracelet on the left wrist.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003e\u003cspan\u003eApple\u0026#39;s Mail app can sort emails into pre-defined categories on iOS 18.2.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003eThrough machine learning, the built-in Mail app can classify emails into categories such as:\n\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\n\u003cli\u003ePrimary - which displays time-sensitive messages, emails from people the user might know, and other important information\u003c/li\u003e\n\u003cli\u003eTransactions - an email category for receipts and order confirmations\u003c/li\u003e\n\u003cli\u003eUpdates - which contains newsletters and social media notices\u003c/li\u003e\n\u003cli\u003ePromotions - for marketing and sales-related emails\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\u003cp\u003eThe Mail app now features an entirely new Digest view, which can display all emails from a specific company, making interactions with these messages significantly easier.\n\u003c/p\u003e\u003cp\u003eWith the Digest view, users will be able to get information about flights from a particular company, for instance. Users will also be able to adjust the email category in which senders appear. There\u0026#39;s also a new option for app badges, letting users choose whether they appear only for primary unread messages or all unread messages.\n\u003c/p\u003e\u003cp\u003eWhile Apple Intelligence and its associated features are undoubtedly a major component of the iOS 18.2 update, the software also contains a variety of improvements that have nothing to do with AI. Specifically, iOS 18.2 contains new features for FindMy, Photos, and much more.\n\u003c/p\u003e\u003cp\u003eFindMy has received a \u003ca href=\"https://appleinsider.com/articles/24/11/11/find-mys-share-item-location-will-help-airlines-find-your-luggage\"\u003esignificant update\u003c/a\u003e with iOS 18.2, as the software now lets users share the location of lost items with people they trust.\n\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61959-128340-61641-127414-Share-Location-of-Find-My-device-xl-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/61959-128340-61641-127414-Share-Location-of-Find-My-device-xl-xl.jpg\" alt=\"Smartphone displaying item location sharing screen, hand holding a small white device, blurred white AirPods case, and a green potted plant on a white surface.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFindMy has received a significant improvement with iOS 18.2.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003eWhen an \u003ca href=\"https://appleinsider.com/inside/airtags\" title=\"AirTag\" data-kpt=\"1\"\u003eAirTag\u003c/a\u003e or other item is lost, users can opt to share the location of the item with a trusted individual or even an airline, all so that the lost item can be more easily recovered. This could be particularly useful for lost luggage, though FindMy-equipped devices have also \u003ca href=\"https://appleinsider.com/articles/24/09/30/apple-airpods-help-police-locate-stolen-ferrari-worth-575000\"\u003ehelped authorities locate\u003c/a\u003e stolen vehicles in some instances.\n\u003c/p\u003e\u003cp\u003eThe lost item\u0026#39;s location is shared in the form of a link. The link recipient will be able to see the AirTag\u0026#39;s location, serial number, and the user\u0026#39;s Apple Account email or phone number for a limited amount of time. Location sharing is automatically stopped once the item is found, or when the link to the item\u0026#39;s location expires.\n\u003c/p\u003e\u003cp\u003e\u003ch2 data-anchor=\"hearing-health-features-for-airpods-pro-2-now-available-in-more-countries\" id=\"hearing-health-features-for-airpods-pro-2-now-available-in-more-countries\"\u003eHearing Health features for AirPods Pro 2 now available in more countries\u003c/h2\u003e\n\u003c/p\u003e\u003cp\u003eiOS 18.2 also expands the availability of Hearing Health features for the \u003ca href=\"https://appleinsider.com/inside/airpods-pro-2\" title=\"AirPods Pro 2\" data-kpt=\"1\"\u003eAirPods Pro 2\u003c/a\u003e wireless earbuds. Specifically, the Hearing Test feature is now available in Cyprus, Czechia, France, Italy, Luxembourg, Romania, Spain, the United Arab Emirates, and the United Kingdom. The clinical-grade Hearing Aid feature, meanwhile, was made available in the United Arab Emirates.\n\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61959-128343-60981-125637-IMG_0894-xl-(2)-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/61959-128343-60981-125637-IMG_0894-xl-(2)-xl.jpg\" alt=\"Smartphone displaying AirPods Pro hearing aid setup screen next to an open AirPods Pro charging case with earbuds.\" height=\"720\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHearing Health features for AirPods Pro 2 are now available in additional countries.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003e\u003ca href=\"https://appleinsider.com/articles/24/09/09/airpods-pro-2-to-be-clinical-grade-hearing-aid-with-update\"\u003eHearing Health\u003c/a\u003e features were originally introduced with the iOS 18.1 update in the United States, following \u003ca href=\"https://appleinsider.com/articles/24/09/12/fda-approves-airpods-pro-2-hearing-aid-features\"\u003eFDA approval\u003c/a\u003e in September 2024. On AirPods Pro 2, these features let users test their hearing or use the device as a hearing aid in cases of mild to moderate hearing loss.\n\u003c/p\u003e\u003cp\u003eIt\u0026#39;s worth noting, though, that the AirPods Pro 2 need to be running \u003ca href=\"https://appleinsider.com/articles/24/10/24/airpods-pro-2-receive-support-for-hearing-health-features-with-new-firmware-update\"\u003efirmware 7B19\u003c/a\u003e or newer for any of these features to function. The features are not meant to work in countries or regions where they have not yet been approved.\n\u003c/p\u003e\u003cp\u003e\u003ch2 data-anchor=\"other-changes-in-the-ios-182-update\" id=\"other-changes-in-the-ios-182-update\"\u003eOther changes in the iOS 18.2 update\u003c/h2\u003e\n\u003c/p\u003e\u003cp\u003eThe operating system also introduces a minor change to video playback in the Photos application. Videos are no longer automatically zoomed in as soon as playback begins. Users also have the option to scrub through a video frame-by-frame and can disable the auto-looping of video playback.\n\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61959-128342-61714-127664-IMG_1336-xl-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/61959-128342-61714-127664-IMG_1336-xl-xl.jpg\" alt=\"Tablet screen displaying a streaming app interface with navigation sidebar, top chart shows various TV show thumbnails, apps like Crunchyroll and Hulu, and a \u0026#39;Now on Apple TV+\u0026#39; section.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003e\u003cspan\u003eiPadOS 18.2 features a revamped tab bar in the Apple TV app.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003eOn the iPad side of things, iPadOS 18.2 introduces a noteworthy change to the \u003ca href=\"https://appleinsider.com/inside/apple-tv\" title=\"Apple TV\" data-kpt=\"1\"\u003eApple TV\u003c/a\u003e application. The in-app tab bar has been made customizable, and now items from the sidebar can be added to it.\n\u003c/p\u003e\u003cp\u003eCertain system applications and features have also received minor updates:\n\u003c/p\u003e\u003cdiv\u003e\u003cul\u003e\n\u003cli\u003eApple Music and Apple TV —  a new Natural Search feature makes it easier to search for content by actor, decade, genre, mood, etc.\u003c/li\u003e\n\u003cli\u003eFace ID —   When trusting a computer from an iPhone, Face ID can now be used for authentication instead of the user\u0026#39;s passcode.\u003c/li\u003e\n\u003cli\u003eiPhone Mirroring —   allows users to mirror their iPhone screen even when a Mac is using it as a personal hotspot.\u003c/li\u003e\n\u003cli\u003ePodcasts —  new options for Favorite categories, and a personalized Search page.\u003c/li\u003e\n\u003cli\u003eNotes —   an additional \u0026#34;Create Image\u0026#34; button that appears when text is selected.\u003c/li\u003e\n\u003cli\u003eSafari —  new background images for the Safari Start Page, along with a Live Activity for file downloads.\u003c/li\u003e\n\u003cli\u003eShortcuts —   three new shortcuts related to the Fitness application.\u003c/li\u003e\n\u003cli\u003eStocks —  pre-market price quotes let users track track NASDAQ and NYSE tickers prior to market open\u003c/li\u003e\n\u003cli\u003eVoice Memos —  support for layered recording, which can be used to add vocals to a song idea, for instance.\u003c/li\u003e\n\u003cli\u003eMisc. —  Web content filters are now automatically enabled for minors in Utah.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\u003cp\u003eWhile there are some improvements of note in this list, the great majority of them build upon existing applications and their features. The software also contains a few minor bug fixes, as detailed in Apple\u0026#39;s release notes.\n\u003c/p\u003e\u003cp\u003e\u003ch2 data-anchor=\"visionos-22-brings-wide-and-ultrawide-views-to-mac-virtual-display-watchos-112-adds-a-new-pause-button\" id=\"visionos-22-brings-wide-and-ultrawide-views-to-mac-virtual-display-watchos-112-adds-a-new-pause-button\"\u003evisionOS 2.2 brings Wide and Ultrawide views to Mac Virtual Display, watchOS 11.2 adds a new pause button\u003c/h2\u003e\n\u003c/p\u003e\u003cp\u003evisionOS 2.2, on the other hand, includes a major improvement to the \u003ca href=\"https://appleinsider.com/inside/apple-vision-pro/tips/how-to-use-mac-virtual-display-for-apple-vision-pro-with-desktop-macs-and-macbooks\"\u003eMac Virtual Display\u003c/a\u003e feature. While the \u003ca href=\"https://appleinsider.com/inside/apple-vision-pro\" title=\"Apple Vision Pro\" data-kpt=\"1\"\u003eApple Vision Pro\u003c/a\u003e was always usable as an external display for Mac, there are now two new display modes: Ultrawide and Wide. According to Apple, the new Ultrawide setting is the equivalent of connecting two 4K monitors to a Mac and using them side-by-side.\n\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61959-128341-61641-127407-Ultra-Wide-Spatial-Mac-(1)-xl-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/61959-128341-61641-127407-Ultra-Wide-Spatial-Mac-(1)-xl-xl.jpg\" alt=\"Three computer monitors display colorful abstract art, an edited photo of a cat, and a tech news website, set against a foggy outdoor background.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003e\u003cspan\u003evisionOS 2.2 introduces improvements to the Mac Virtual Display feature.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003eApple also made it possible to view multiple sports games at once on the Apple Vision Pro. With visionOS 2.2, users can now view up to 5 MLB or MLS games simultaneously through their \u003ca href=\"https://appleinsider.com/inside/apple-tv-plus\" title=\"Apple TV+\" data-kpt=\"1\"\u003eApple TV+\u003c/a\u003e subscription. While it\u0026#39;s not currently possible to view other sports, Apple has added \u003ca href=\"https://appleinsider.com/inside/shareplay\" title=\"SharePlay\" data-kpt=\"1\"\u003eSharePlay\u003c/a\u003e integration with visionOS 2.2, letting users of the headset watch games together.\n\u003c/p\u003e\u003cp\u003eOn the \u003ca href=\"https://appleinsider.com/inside/apple-watch\" title=\"Apple Watch\" data-kpt=\"1\"\u003eApple Watch\u003c/a\u003e, watchOS 11.2 introduces a new pause button for the Camera Remote application. This means that it\u0026#39;s now possible to pause videos being recorded on an iPhone via the Camera Remote app on an Apple Watch, through a new button located on the left side of the screen.\n\u003c/p\u003e\u003cp\u003eThe Apple Vision Pro and Apple Watch platforms still lack Apple Intelligence, though, meaning that their users won\u0026#39;t be able to take advantage of the various AI features available on other Apple platforms.\n\u003c/p\u003e\u003cp\u003eAlthough some Apple Intelligence features are already here, such as email summarization and the Clean Up tool in Photos, a good chunk of them are still only available in the release candidate build. iOS 18.2 is \u003ca href=\"https://appleinsider.com/articles/24/11/03/ios-182-with-image-playground-and-visual-intelligence-now-expected-in-early-december\"\u003eexpected\u003c/a\u003e to receive its final public release in early December 2024, which is when features like Image Playground and Visual Intelligence will become available to all users.\u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2024-12-05T23:39:22Z",
  "modifiedTime": null
}
