{
  "id": "99f840f2-1aa2-4b5d-a66c-b0fde578db7d",
  "title": "When will Apple Intelligence arrive on Apple TV and Apple Watch?",
  "link": "https://9to5mac.com/2025/01/07/apple-intelligence-apple-tv-watch/",
  "description": "Google recently announced that it’s bringing the Gemini AI assistant to Google TV. At the same time, our sister site 9to5Google found evidence of Gemini coming soon to Wear OS – Google’s operating system for smartwatches. On the Apple side, devices like Apple TV and Apple Watch don’t have Apple Intelligence support, and some people are starting to wonder when that will change. more…",
  "author": "Filipe Espósito",
  "published": "Wed, 08 Jan 2025 00:20:49 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Filipe Espósito",
  "length": 4310,
  "excerpt": "Google recently announced that it’s bringing the Gemini AI assistant to Google TV. At the same time, our sister site...",
  "siteName": "9to5Mac",
  "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=192",
  "text": "Google recently announced that it’s bringing the Gemini AI assistant to Google TV. At the same time, our sister site 9to5Google found evidence of Gemini coming soon to Wear OS – Google’s operating system for smartwatches. On the Apple side, devices like Apple TV and Apple Watch don’t have Apple Intelligence support, and some people are starting to wonder when that will change. Apple competitors bring AI to TV and smartwatches When it comes to Apple Intelligence, the features are only available on iPhones, iPads, and Macs. Even so, the list is quite limited. Apple Intelligence requires devices with the A17 Pro chip (such as the iPhone 15 Pro and iPad mini 7) and later, or the M1 chip and later. Apple has said that it will bring Apple Intelligence to more devices over time, but it has never said which devices will be next and when exactly this will happen. For now, owners of Apple TV, Apple Watch, HomePod, and even Apple Vision Pro can’t take advantage of Apple Intelligence tools. So let’s take a look at what the competition is doing so far. As mentioned earlier, Google announced at CES 2025 that it’s bringing Gemini to Google TV. When we talk about generative AI, most people certainly think about chatbots to answer questions or write text. In part, that’s what Gemini will do on Google TV. The company says its AI “will make searching through your media easier than ever.” But there are some features designed to enhance the experience of using a TV. For instance, Gemini will let users create art with their family or even ask for a summary of the day’s news. Google has also announced AI-generated screensavers and summaries for movies and shows. On Wear OS, Gemini will certainly be useful in letting users have more natural conversations with their smartwatches, which will certainly make it easier to interact with these devices when your smartphone isn’t around. Apple Intelligence on Apple TV and Apple Watch Okay, so let’s get back to Apple. When will Apple Intelligence arrive on Apple TV and Apple Watch? Unfortunately, probably not very soon – and there are two reasons for that. First, Apple Intelligence is being rolled out in phases. The first phase introduced Writing Tools and text summarization. The second phase enabled things like Genmoji and Image Playgrounds, as well as the integration of ChatGPT into Siri. For the third phase, which is expected to be released by spring, Siri will gain onscreen awareness and be able to control actions between apps. Most of these features aren’t exactly useful for devices like Apple TV and Apple Watch. I’m sure that having ChatGPT on the Apple Watch might be useful sometimes, but it doesn’t sound like a game-changing feature. Onscreen awareness sounds nice, as does the ability to better control apps with your voice, but these features are yet to come to the iPhone, iPad, and Mac. If I had to guess, Apple probably wants to refine the Apple Intelligence experience on these devices first before expanding the features to others. But there’s a second important reason: hardware. As I said before, Apple Intelligence requires the latest chips since almost everything is processed on-device for better privacy. Unless Apple creates lighter language models for Apple TV and Apple Watch, current hardware wouldn’t be able to support Apple Intelligence in its current state. The latest Apple TV, which was introduced in 2022, has the same A15 chip as the iPhone 13. Rumors suggest that a new Apple TV is on track for release in 2025, but it’s unclear when this will happen or whether it will have a chip capable of running Apple Intelligence. As for the Apple Watch, we would have to wait until at least September for the new hardware. In short, those hoping for Apple Intelligence on these devices will probably have to wait a bit longer. In the meantime, tell us in the comments section below what you expect from Apple Intelligence on Apple TV and Apple Watch. Read also Buy new Apple products at a discount A new HomePod mini is coming, and it definitely needs Apple Intelligence Apple is developing a new device for your home: Here’s what the rumors say Add 9to5Mac to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/07/apple-intelligence_33d1ce.jpg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"800\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2024/07/apple-intelligence_33d1ce.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"Apple Intelligence\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/07/apple-intelligence_33d1ce.jpg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/07/apple-intelligence_33d1ce.jpg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/07/apple-intelligence_33d1ce.jpg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/07/apple-intelligence_33d1ce.jpg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/figure\u003e\n\n\u003cp\u003eGoogle recently announced that \u003ca href=\"https://9to5google.com/2025/01/06/gemini-google-tv/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eit’s bringing the Gemini AI assistant to Google TV\u003c/a\u003e. At the same time, our sister site \u003cem\u003e\u003ca href=\"https://9to5google.com/2025/01/06/gemini-wear-os-prep/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e9to5Google\u003c/a\u003e\u003c/em\u003e found evidence of Gemini coming soon to Wear OS – Google’s operating system for smartwatches. On the Apple side, devices like Apple TV and Apple Watch don’t have Apple Intelligence support, and some people are starting to wonder when that will change.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-apple-competitors-bring-ai-to-tv-and-smartwatches\"\u003eApple competitors bring AI to TV and smartwatches\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhen it comes to \u003ca href=\"https://9to5mac.com/guides/apple-intelligence/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eApple Intelligence\u003c/a\u003e, the features are only available on iPhones, iPads, and Macs. Even so, the list is quite limited. Apple Intelligence requires devices with the A17 Pro chip (such as the \u003ca href=\"https://amzn.to/3DI3cNc\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eiPhone 15 Pro\u003c/a\u003e and \u003ca href=\"https://amzn.to/408LqKv\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eiPad mini 7\u003c/a\u003e) and later, or the M1 chip and later.\u003c/p\u003e\n\n\n\n\u003cp\u003eApple has said that it will bring Apple Intelligence to more devices over time, but it has never said which devices will be next and when exactly this will happen. For now, owners of \u003ca href=\"https://amzn.to/4gJZwJE\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eApple TV\u003c/a\u003e, \u003ca href=\"https://amzn.to/3DL7R13\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eApple Watch\u003c/a\u003e, HomePod, and even Apple Vision Pro can’t take advantage of Apple Intelligence tools. So let’s take a look at what the competition is doing so far.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs mentioned earlier, Google announced at CES 2025 that it’s bringing Gemini to \u003ca href=\"https://amzn.to/3DMNy3c\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eGoogle TV\u003c/a\u003e. When we talk about generative AI, most people certainly think about chatbots to answer questions or write text. In part, that’s what Gemini will do on \u003ca href=\"https://amzn.to/3DMNy3c\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eGoogle TV\u003c/a\u003e. The company says its AI “will make searching through your media easier than ever.”\u003c/p\u003e\n\n\n\n\u003cp\u003eBut there are some features designed to enhance the experience of using a TV. For instance, Gemini will let users create art with their family or even ask for a summary of the day’s news. Google has also announced AI-generated screensavers and summaries for movies and shows.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1436\" height=\"810\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/01/FINAL_GTV_CES_Keyword_Snippet_Asset.max-1440x810-1.png\" alt=\"When will Apple Intelligence arrive on Apple TV and Apple Watch?\" srcset=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/01/FINAL_GTV_CES_Keyword_Snippet_Asset.max-1440x810-1.png 1436w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/FINAL_GTV_CES_Keyword_Snippet_Asset.max-1440x810-1.png?resize=155,87 155w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/FINAL_GTV_CES_Keyword_Snippet_Asset.max-1440x810-1.png?resize=655,369 655w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/FINAL_GTV_CES_Keyword_Snippet_Asset.max-1440x810-1.png?resize=768,433 768w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/FINAL_GTV_CES_Keyword_Snippet_Asset.max-1440x810-1.png?resize=1024,578 1024w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/FINAL_GTV_CES_Keyword_Snippet_Asset.max-1440x810-1.png?resize=350,197 350w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/FINAL_GTV_CES_Keyword_Snippet_Asset.max-1440x810-1.png?resize=140,79 140w, https://9to5mac.com/wp-content/uploads/sites/6/2025/01/FINAL_GTV_CES_Keyword_Snippet_Asset.max-1440x810-1.png?resize=150,85 150w\" sizes=\"(max-width: 1436px) 100vw, 1436px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eOn Wear OS, Gemini will certainly be useful in letting users have more natural conversations with their \u003ca href=\"https://amzn.to/3PupRzn\" target=\"_blank\" rel=\"noreferrer noopener\"\u003esmartwatches\u003c/a\u003e, which will certainly make it easier to interact with these devices when your smartphone isn’t around.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-apple-intelligence-on-apple-tv-and-apple-watch\"\u003eApple Intelligence on Apple TV and Apple Watch\u003c/h2\u003e\n\n\n\n\u003cp\u003eOkay, so let’s get back to Apple. When will Apple Intelligence arrive on \u003ca href=\"https://amzn.to/4gJZwJE\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eApple TV\u003c/a\u003e and Apple Watch? Unfortunately, probably not very soon – and there are two reasons for that.\u003c/p\u003e\n\n\n\n\u003cp\u003eFirst, Apple Intelligence is being rolled out in phases. The first phase introduced Writing Tools and text summarization. The second phase enabled things like Genmoji and Image Playgrounds, as well as the integration of ChatGPT into Siri. For the third phase, which is expected to be released by spring, Siri will gain onscreen awareness and be able to control actions between apps.\u003c/p\u003e\n\n\n\n\u003cp\u003eMost of these features aren’t exactly useful for devices like \u003ca href=\"https://amzn.to/4gJZwJE\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eApple TV\u003c/a\u003e and \u003ca href=\"https://amzn.to/3DL7R13\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eApple Watch\u003c/a\u003e. I’m sure that having ChatGPT on the \u003ca href=\"https://amzn.to/3DL7R13\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eApple Watch\u003c/a\u003e might be useful sometimes, but it doesn’t sound like a game-changing feature. Onscreen awareness sounds nice, as does the ability to better control apps with your voice, but these features are yet to come to the \u003ca href=\"https://amzn.to/3DI3cNc\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eiPhone\u003c/a\u003e, \u003ca href=\"https://amzn.to/3C0jdh1\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eiPad\u003c/a\u003e, and \u003ca href=\"https://amzn.to/426yzLO\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMac\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf I had to guess, Apple probably wants to refine the Apple Intelligence experience on these devices first before expanding the features to others.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1600\" height=\"800\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2024/12/image-tools-apple-intelligence-ios182.jpg.webp\" alt=\"Apple Intelligence\" srcset=\"https://9to5mac.com/wp-content/uploads/sites/6/2024/12/image-tools-apple-intelligence-ios182.jpg.webp 1600w, https://9to5mac.com/wp-content/uploads/sites/6/2024/12/image-tools-apple-intelligence-ios182.jpg.webp?resize=155,78 155w, https://9to5mac.com/wp-content/uploads/sites/6/2024/12/image-tools-apple-intelligence-ios182.jpg.webp?resize=655,328 655w, https://9to5mac.com/wp-content/uploads/sites/6/2024/12/image-tools-apple-intelligence-ios182.jpg.webp?resize=768,384 768w, https://9to5mac.com/wp-content/uploads/sites/6/2024/12/image-tools-apple-intelligence-ios182.jpg.webp?resize=1024,512 1024w, https://9to5mac.com/wp-content/uploads/sites/6/2024/12/image-tools-apple-intelligence-ios182.jpg.webp?resize=1536,768 1536w, https://9to5mac.com/wp-content/uploads/sites/6/2024/12/image-tools-apple-intelligence-ios182.jpg.webp?resize=350,175 350w, https://9to5mac.com/wp-content/uploads/sites/6/2024/12/image-tools-apple-intelligence-ios182.jpg.webp?resize=140,70 140w, https://9to5mac.com/wp-content/uploads/sites/6/2024/12/image-tools-apple-intelligence-ios182.jpg.webp?resize=290,145 290w, https://9to5mac.com/wp-content/uploads/sites/6/2024/12/image-tools-apple-intelligence-ios182.jpg.webp?resize=150,75 150w\" sizes=\"auto, (max-width: 1600px) 100vw, 1600px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eBut there’s a second important reason: hardware. As I said before, Apple Intelligence requires the latest chips since almost everything is processed on-device for better privacy. Unless Apple creates lighter language models for Apple TV and Apple Watch, current hardware wouldn’t be able to support Apple Intelligence in its current state.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe latest Apple TV, which was introduced in 2022, has the same A15 chip as the iPhone 13. Rumors suggest that a new Apple TV is on track for release in 2025, but it’s unclear when this will happen or whether it will have a chip capable of running Apple Intelligence. As for the \u003ca href=\"https://amzn.to/3DL7R13\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eApple Watch\u003c/a\u003e, we would have to wait until at least September for the new hardware.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn short, those hoping for Apple Intelligence on these devices will probably have to wait a bit longer. In the meantime, tell us in the comments section below what you expect from Apple Intelligence on Apple TV and Apple Watch.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-read-also\"\u003eRead also\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/4guM5wA\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBuy new Apple products at a discount\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/12/12/homepod-mini-apple-intelligence/\"\u003eA new HomePod mini is coming, and it definitely needs Apple Intelligence\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/apple-new-home-device-rumors/\"\u003eApple is developing a new device for your home: Here’s what the rumors say\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Mac to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cdiv\u003e\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://bit.ly/4fKrcwC\"\u003e\u003cimg src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/01/upgraded-banner.png\" alt=\"\" width=\"750\" height=\"150\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-08T00:20:49Z",
  "modifiedTime": "2025-01-08T00:20:51Z"
}
