{
  "id": "9a0969af-4149-42a5-bb55-1d40b5e9dc91",
  "title": "Indie App Spotlight: ‘Finma’ is a financial management app with on-device processing",
  "link": "https://9to5mac.com/2025/02/22/indie-app-spotlight-finma/",
  "description": "Welcome to Indie App Spotlight. This is a weekly 9to5Mac series where we showcase the latest apps in the indie app world. If you’re a developer and would like your app featured, get in contact. Finma is a financial management app for your iPhone. It has a focus on user privacy and doesn’t require a connection to your bank account. It also features beautiful charts and many useful features to give you a better financial picture. more…",
  "author": "Michael Burkhardt",
  "published": "Sat, 22 Feb 2025 20:30:00 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Michael Burkhardt",
  "length": 2666,
  "excerpt": "Welcome to Indie App Spotlight. This is a weekly 9to5Mac series where we showcase the latest apps in the indie app...",
  "siteName": "9to5Mac",
  "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=192",
  "text": "Welcome to Indie App Spotlight. This is a weekly 9to5Mac series where we showcase the latest apps in the indie app world. If you’re a developer and would like your app featured, get in contact. Finma is a financial management app for your iPhone. It has a focus on user privacy and doesn’t require a connection to your bank account. It also features beautiful charts and many useful features to give you a better financial picture. Privacy focused without compromising Plaid, the service that most developers use to allow users to link banks into financial apps, can get very expensive. That’s part of the reason why many smaller financial apps don’t support automatic linking. Obviously, that can be annoying for users, since that generally requires manual data entry. Finma has a unique solution for this though. Instead of having to enter everything manually, you can instead import data from your emails, including statements and transaction alerts. There’s also an option to upload statements if you don’t want to share your emails. Of course, anything uploaded to the app is processed on device, and Finma doesn’t have access to your financial records. Unique features Finma has a number of unique features to help you better manage your finances, including budget alerts, payment alerts, and many helpful charts to give you a bigger picture idea. It also features home screen widgets for a better financial understanding. Budget alerts keep you on top of your spending. You can easily set spend thresholds for certain categories, and as you approach them (and surpass them), the app will remind you. This helps fight overspending. You can also create your own rules for categorization. There’s also payment alerts, helping you stay on top of subscriptions, credit card due dates, bills, and more. Last but not least, there are many great interactive charts, giving you detailed insights on exactly how you’re spending your money. The layout is also very customizable, allowing you to prioritize the insights you care about most. Pricing \u0026 download Finma is available for free on the App Store, and costs $2.99/month or $24.99/year for the full experience. It requires an iPhone running iOS 16.4 or later. My favorite iPhone accessories on Amazon: ESR MagSafe Wallet with Kickstand, Grip, and Find My support Anker MagSafe 2-in-1 Wireless Charging Stand with Qi2 UGREEN 6.6ft braided USB-C charging cables, 2-pack AirPods Pro 2 (USB-C) Follow Michael: X/Twitter, Bluesky, Instagram Add 9to5Mac to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/02/Finma-app.jpg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"800\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/02/Finma-app.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/02/Finma-app.jpg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/02/Finma-app.jpg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/02/Finma-app.jpg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/02/Finma-app.jpg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/figure\u003e\n\n\u003cp\u003e\u003cem\u003eWelcome to \u003ca href=\"https://9to5mac.com/guides/indie-app-spotlight\"\u003eIndie App Spotlight\u003c/a\u003e. This is a weekly 9to5Mac series where we showcase the latest apps in the indie app world. If you’re a developer and would like your app featured, get \u003ca href=\"https://9to5mac.com/author/michaelb\"\u003ein contact\u003c/a\u003e\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://apps.apple.com/app/finma/id6446134557\"\u003eFinma\u003c/a\u003e is a financial management app for your iPhone. It has a focus on user privacy and doesn’t require a connection to your bank account. It also features beautiful charts and many useful features to give you a better financial picture. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-privacy-focused-without-compromising\"\u003ePrivacy focused without compromising\u003c/h2\u003e\n\n\n\n\u003cp\u003ePlaid, the service that most developers use to allow users to link banks into financial apps, can get very expensive. That’s part of the reason why many smaller financial apps don’t support automatic linking.\u003c/p\u003e\n\n\n\n\u003cp\u003eObviously, that can be annoying for users, since that generally requires manual data entry.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://apps.apple.com/app/finma/id6446134557\"\u003eFinma\u003c/a\u003e has a unique solution for this though. Instead of having to enter everything manually, you can instead import data from your emails, including statements and transaction alerts. There’s also an option to upload statements if you don’t want to share your emails.\u003c/p\u003e\n\n\n\n\u003cp\u003eOf course, anything uploaded to the app is processed on device, and Finma doesn’t have access to your financial records.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-unique-features\"\u003eUnique features\u003c/h2\u003e\n\n\n\n\u003cp\u003eFinma has a number of unique features to help you better manage your finances, including budget alerts, payment alerts, and many helpful charts to give you a bigger picture idea. It also features home screen widgets for a better financial understanding.\u003c/p\u003e\n\n\n\n\u003cp\u003eBudget alerts keep you on top of your spending. You can easily set spend thresholds for certain categories, and as you approach them (and surpass them), the app will remind you. This helps fight overspending. You can also create your own rules for categorization.\u003c/p\u003e\n\n\n\n\u003cp\u003eThere’s also payment alerts, helping you stay on top of subscriptions, credit card due dates, bills, and more.\u003c/p\u003e\n\n\n\n\u003cp\u003eLast but not least, there are many great interactive charts, giving you detailed insights on exactly how you’re spending your money. The layout is also very customizable, allowing you to prioritize the insights you care about most.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-pricing-amp-download\"\u003ePricing \u0026amp; download\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://apps.apple.com/app/finma/id6446134557\"\u003eFinma\u003c/a\u003e is available for \u003ca href=\"https://apps.apple.com/app/finma/id6446134557\"\u003efree on the App Store\u003c/a\u003e, and costs $2.99/month or $24.99/year for the full experience. It requires an iPhone running iOS 16.4 or later.\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMy favorite iPhone accessories on Amazon:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/4iIK6GW\"\u003eESR MagSafe Wallet with Kickstand, Grip, and Find My support\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/401kHkn\"\u003eAnker MagSafe 2-in-1 Wireless Charging Stand with Qi2\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/40d3yVb\"\u003eUGREEN 6.6ft braided USB-C charging cables, 2-pack\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/3BPaKx3\"\u003eAirPods Pro 2 (USB-C)\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eFollow Michael: \u003ca href=\"https://x.com/mbrkhrdt\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eX/Twitter\u003c/a\u003e, \u003ca href=\"https://bsky.app/profile/michaelb.nyc\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBluesky\u003c/a\u003e, \u003ca href=\"https://instagram.com/m.brkhrdt\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eInstagram\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Mac to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cdiv\u003e\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://bit.ly/41hwFHk\"\u003e\u003cimg src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/02/gif3-1.gif\" alt=\"\" width=\"750\" height=\"150\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-22T20:30:00Z",
  "modifiedTime": null
}
