{
  "id": "a9504c29-1f84-4416-8889-506b05cdcc66",
  "title": "Apple cancels California DMV permit for self-driving car testing",
  "link": "https://appleinsider.com/articles/24/10/11/apple-cancels-california-dmv-permit-for-self-driving-car-testing?utm_medium=rss",
  "description": "The California Department of Motor Vehicles has canceled Apple's permit for testing self-driving vehicles on roads at the company's request, in a move that could spell the end of the project.An Apple self-driving test rigApple, like many other tech giants, have been testing self-driving vehicle systems for a number of years. However, a development at the California DMV has put the future of the project in doubt.Apple had a permit for testing autonomous vehicles on roads with a safety driver until April 30, 2025. According to MacReports, Apple contacted the DMV to cancel its Autonomous Vehicles Program Manufacturer's Testing Permit. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Malcolm Owen",
  "published": "Fri, 11 Oct 2024 19:52:38 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Malcolm Owen",
  "length": 1636,
  "excerpt": "The California Department of Motor Vehicles has canceled Apple's permit for testing self-driving vehicles on roads at the company's request, in a move that could spell the end of the project.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v9/images/apple-touch-icon-144.png",
  "text": "An Apple self-driving test rig The California Department of Motor Vehicles has canceled Apple's permit for testing self-driving vehicles on roads at the company's request, in a move that could spell the end of the project. Apple, like many other tech giants, have been testing self-driving vehicle systems for a number of years. However, a development at the California DMV has put the future of the project in doubt. Apple had a permit for testing autonomous vehicles on roads with a safety driver until April 30, 2025. According to MacReports, Apple contacted the DMV to cancel its Autonomous Vehicles Program Manufacturer's Testing Permit. The DMV then contacted Apple by letter on September 25, confirming Apple's request to cancel the permit, and that it would end by September 27, 2024. Without the permit, Apple is no longer able to carry out self-driving vehicle testing on public roads. Apple had first received its permit in 2017, with it expanding the fleet and team of drivers over time. While it had previously employed over 200 drivers for the project, as of May 2024, it had 68 registered vehicles and just 15 registered drivers. Though the canceled permit does leave the door open for Apple to resume activity in the future, it seems that the project is dead for the moment. In February, a report found employees considered Apple's Project Titan project was a \"Titanic disaster\" and a failure. Another report in March said that the challenge of a full self-driving vehicle system was insurmountable, even for Apple.",
  "image": "https://photos5.appleinsider.com/gallery/61369-126785-40231-77412-37975-71780-000-lead-Apple-Car-xl-xl-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-hero\" aria-labelledby=\"hero-cap\" role=\"figure\"\u003e\n                          \u003cp id=\"hero-cap\" title=\"An Apple self-driving test rig\"\u003eAn Apple self-driving test rig\u003c/p\u003e\n                                    \u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/61369-126785-40231-77412-37975-71780-000-lead-Apple-Car-xl-xl-xl.jpg\"\u003e\n              \u003cimg fetchpriority=\"high\" src=\"https://photos5.appleinsider.com/gallery/61369-126785-40231-77412-37975-71780-000-lead-Apple-Car-xl-xl-xl.jpg\" alt=\"\"/\u003e\n            \u003c/a\u003e\n                      \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n          \u003cp\u003eThe California Department of Motor Vehicles has canceled Apple\u0026#39;s permit for testing self-driving vehicles on roads at the company\u0026#39;s request, in a move that could spell the end of the project. \n\u003c/p\u003e\u003cp\u003eApple, like many other tech giants, have been testing self-driving vehicle systems for a number of years. However, a development at the California DMV has put the future of the project in doubt. \n\u003c/p\u003e\u003cp\u003eApple had a permit for testing autonomous vehicles on roads with a safety driver until April 30, 2025. \u003ca href=\"https://macreports.com/apple-officially-cancels-autonomous-vehicles-program-manufacturers-testing-permit/\"\u003eAccording to\u003c/a\u003e \u003cem\u003eMacReports\u003c/em\u003e, Apple contacted the DMV to cancel its Autonomous Vehicles Program Manufacturer\u0026#39;s Testing Permit. \n\u003c/p\u003e\u003cp\u003eThe DMV then contacted Apple by letter on September 25, confirming Apple\u0026#39;s request to cancel the permit, and that it would end by September 27, 2024. \n\u003c/p\u003e\u003cp\u003eWithout the permit, Apple is no longer able to carry out self-driving vehicle testing on public roads. \n\u003c/p\u003e\u003cp\u003eApple had first received its \u003ca href=\"https://appleinsider.com/articles/17/04/21/full-copy-of-apples-self-driving-car-permit-revealed\"\u003epermit in 2017\u003c/a\u003e, with it expanding the fleet and team of drivers over time. While it had previously employed \u003ca href=\"https://appleinsider.com/articles/23/03/22/apple-self-driving-test-program-grows-to-over-200-drivers\"\u003eover 200 drivers\u003c/a\u003e for the project, as of May 2024, it had 68 registered vehicles and just 15 registered drivers. \n\u003c/p\u003e\u003cp\u003eThough the canceled permit does leave the door open for Apple to resume activity in the future, it seems that the project is dead for the moment. \n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://appleinsider.com/articles/24/02/29/abandoned-10-billion-apple-car-project-referred-to-as-titanic-disaster-by-employees\"\u003eIn February\u003c/a\u003e, a report found employees considered Apple\u0026#39;s Project Titan project was a \u0026#34;Titanic disaster\u0026#34; and a failure. Another report \u003ca href=\"https://appleinsider.com/articles/24/03/03/apples-failed-project-titan-was-a-full-self-driving-gamble\"\u003ein March\u003c/a\u003e said that the challenge of a full self-driving vehicle system was insurmountable, even for Apple. \n\u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-10-11T19:52:38Z",
  "modifiedTime": null
}
