{
  "id": "abb743ab-3a09-4ef4-802b-566d530b15b5",
  "title": "Ticketmaster announces support for richer event tickets in Apple Wallet with iOS 18",
  "link": "https://9to5mac.com/2024/10/10/ticketmaster-tickets-apple-wallet-ios-18/",
  "description": "With iOS 18, the Apple Wallet app has gained support for richer event tickets, which provide more details with useful information about the event. As iOS 18 is now available to the public, Ticketmaster announced on Thursday that it will soon be rolling out support for richer tickets in Apple Wallet. more…",
  "author": "Filipe Espósito",
  "published": "Fri, 11 Oct 2024 00:51:43 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Filipe Espósito",
  "length": 2399,
  "excerpt": "With iOS 18, the Apple Wallet app has gained support for richer event tickets, which provide more details with useful...",
  "siteName": "9to5Mac",
  "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=192",
  "text": "With iOS 18, the Apple Wallet app has gained support for richer event tickets, which provide more details with useful information about the event. As iOS 18 is now available to the public, Ticketmaster announced on Thursday that it will soon be rolling out support for richer tickets in Apple Wallet. The company said in a blog post that “Ticketmaster is the first ticketing company to enable the new, enhanced ticket experience in Apple Wallet.” With the update, users will see key information on their tickets, such as a map of the venue, parking details, recommended Apple Music playlists, weather forecast for the day of the event, and an easy way to share real-time location with friends during the event. Ticketmaster worked closely with Apple on this new experience for iOS 18 users. “With the new, enhanced ticket in Apple Wallet experience, fans are closer to the action from the moment they add their pass to their iPhone,” says Mark Yovich, President at Ticketmaster. “We’re extremely proud to work with Apple to bring this enhanced ticketing experience to fans.” The new experience will debut later this month with Los Angeles Football Club (LAFC) at their home game at BMO Stadium on Saturday, October 19. iPhone users running iOS 18.0 or later who add their ticket to Apple Wallet via the Ticketmaster or LAFC apps will see the new, more detailed tickets. Ticketmaster says the experience will also be available soon for Miami HEAT tickets, with more events to be supported in 2025. More about iOS 18 In addition to richer event tickets, Apple Wallet in iOS 18 also features Tap to Cash – a new way to quickly transfer money just by holding two iPhones together. With the update, users can also authenticate Apple Pay transactions on Windows PCs through an iPhone. iOS 18 is available for iPhone XR and later, although some specific features require newer hardware. iOS 18 is here, and it’s Apple’s most personal iPhone update yet These missing iOS 18 features are coming in iOS 18.1 or later Passbook lets you create an Apple Wallet pass from any QR code Here’s a look at iOS 18’s ‘Tap to Provision’ feature for adding cards to Apple Pay Apple teases four new partners for IDs in Wallet as California support officially launches Add 9to5Mac to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/10/apple-wallet-ticketmaster-ticket-ios-18.jpg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"800\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2024/10/apple-wallet-ticketmaster-ticket-ios-18.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"Ticketmaster announces support for richer event tickets in Apple Wallet with iOS 18\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/10/apple-wallet-ticketmaster-ticket-ios-18.jpg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/10/apple-wallet-ticketmaster-ticket-ios-18.jpg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/10/apple-wallet-ticketmaster-ticket-ios-18.jpg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/10/apple-wallet-ticketmaster-ticket-ios-18.jpg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/figure\u003e\n\n\u003cp\u003eWith iOS 18, the Apple Wallet app has gained support for richer event tickets, which provide more details with useful information about the event. As iOS 18 is now available to the public, Ticketmaster announced on Thursday that it will soon be rolling out support for richer tickets in Apple Wallet.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eThe company said in a \u003ca href=\"https://business.ticketmaster.com/press-release/apple-wallet-experience/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eblog post\u003c/a\u003e that “Ticketmaster is the first ticketing company to enable the new, enhanced ticket experience in Apple Wallet.”\u003c/p\u003e\n\n\n\n\u003cp\u003eWith the update, users will see key information on their tickets, such as a map of the venue, parking details, recommended Apple Music playlists, weather forecast for the day of the event, and an easy way to share real-time location with friends during the event.\u003c/p\u003e\n\n\n\n\u003cp\u003eTicketmaster worked closely with Apple on this new experience for iOS 18 users. “With the new, enhanced ticket in Apple Wallet experience, fans are closer to the action from the moment they add their pass to their iPhone,” says Mark Yovich, President at Ticketmaster. “We’re extremely proud to work with Apple to bring this enhanced ticketing experience to fans.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe new experience will debut later this month with Los Angeles Football Club (LAFC) at their home game at BMO Stadium on Saturday, October 19. iPhone users running iOS 18.0 or later who add their ticket to Apple Wallet via the Ticketmaster or LAFC apps will see the new, more detailed tickets.\u003c/p\u003e\n\n\n\n\u003cp\u003eTicketmaster says the experience will also be available soon for Miami HEAT tickets, with more events to be supported in 2025.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-more-about-ios-18\"\u003eMore about iOS 18\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn addition to richer event tickets, Apple Wallet in iOS 18 also features Tap to Cash – a new way to quickly transfer money just by holding two iPhones together. With the update, users can also authenticate Apple Pay transactions on Windows PCs through an iPhone.\u003c/p\u003e\n\n\n\n\u003cp\u003eiOS 18 is available for \u003ca href=\"https://amzn.to/4dQlIzC\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eiPhone XR and later\u003c/a\u003e, although some specific features require \u003ca href=\"https://amzn.to/3A6HocC\" target=\"_blank\" rel=\"noreferrer noopener\"\u003enewer hardware\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/09/16/ios-18-new-features-now-available/\"\u003eiOS 18 is here, and it’s Apple’s most personal iPhone update yet\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/09/17/missing-ios-18-features-coming-in-ios-181-or-later/\"\u003eThese missing iOS 18 features are coming in iOS 18.1 or later\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/10/09/passbook-lets-you-create-an-apple-wallet-pass-from-any-qr-code/\"\u003ePassbook lets you create an Apple Wallet pass from any QR code\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/06/28/ios-18-tap-to-provision-apple-pay/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHere’s a look at iOS 18’s ‘Tap to Provision’ feature for adding cards to Apple Pay\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/09/19/apple-ids-in-wallet-new-states/\"\u003eApple teases four new partners for IDs in Wallet as California support officially launches\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Mac to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cdiv\u003e\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://bit.ly/3zEhT2p\"\u003e\u003cimg src=\"https://9to5mac.com/wp-content/uploads/sites/6/2024/10/750-x-150.jpg?quality=82\u0026amp;strip=all\" alt=\"\" width=\"750\" height=\"150\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-11T00:51:43Z",
  "modifiedTime": "2024-10-11T00:51:45Z"
}
