{
  "id": "bbc18901-c030-4832-bdae-868a07845667",
  "title": "Apple lands record-breaking 81 Emmy Award nominations with Severance leading",
  "link": "https://www.apple.com/newsroom/2025/07/apple-lands-record-breaking-81-emmy-award-nominations-with-severance-leading/",
  "description": "",
  "author": "Apple Newsroom",
  "published": "2025-07-15T21:53:06.923Z",
  "source": "https://www.apple.com/newsroom/rss-feed.rss",
  "categories": [
    "PRESS RELEASE"
  ],
  "byline": "",
  "length": 24367,
  "excerpt": "Apple TV+ today earned a record-breaking 81 Emmy Award nominations across 14 hit Apple Original titles for this year’s 77th Emmy Awards.",
  "siteName": "Apple Newsroom",
  "favicon": "",
  "text": "opens in new window PRESS RELEASE July 15, 2025 Apple lands record-breaking 81 Emmy Award nominations, with Severance leading as this year’s most-nominated series and The Studio becoming the most-nominated freshman comedy in history Global phenomenon Severance scores 27 nominations for hit second season, including Outstanding Drama Series and nine performance category nominations Breakout comedy The Studio sweeps with 23 nominations, including Outstanding Comedy Series, making history with the most nominations for a freshman comedy and most overall acting nominations this year Apple TV+ leads as the only network to land multiple title nominations across Outstanding Comedy and Drama Series categories, as The Studio, Severance, Slow Horses, and Shrinking land top program nominations, alongside Apple’s first-ever Outstanding Television Movie nod for The Gorge Apple also lands the most acting nominations of any network or studio this year, with 31 performance nods total Apple Originals honored with nominations across 14 titles, including Severance, The Studio, Slow Horses, Shrinking, Presumed Innocent, The Gorge, Bad Sisters, Dope Thief, Disclaimer, Pachinko, Your Friends \u0026 Neighbors, Dark Matter, Deaf President Now!, and Bono: Stories of Surrender Severance scores 27 Emmy Award nominations for its hit second season, including Outstanding Drama Series and nine performance category nominations. CULVER CITY, CALIFORNIA Apple TV+ today earned a record-breaking 81 Emmy Award nominations across 14 hit Apple Original titles for this year’s 77th Emmy Awards. Severance became this year’s most-nominated series with 27 nominations, and The Studio made history as the most-nominated freshman comedy series with 23 nominations in total. Additionally, with top program nominations for drama (Slow Horses) and comedy (Shrinking), Apple TV+ became the only network to have multiple titles nominated in the Outstanding Comedy and Drama Series categories. Apple also landed the most acting nominations of any network or studio this year, with 31 performance nods total. “Everyone at Apple is celebrating the talent, creativity, and hard work of all of our Emmy nominees this morning,” said Zack Van Amburg, Apple’s head of Worldwide Video. “Severance and The Studio have exceeded our wildest expectations in earning the most nominations for both drama and comedy series, alongside the phenomenal Shrinking and Slow Horses. These shows have connected deeply with audiences around the world, and we’re incredibly appreciative to the Television Academy for recognizing the breadth of storytelling that has been an honor for us to champion. We send our warmest congratulations to all of today’s nominees.” “This record-breaking year is a milestone for Apple, and we’re especially proud of the continued impact our outstanding series nominees — Severance, The Studio, Shrinking, and Slow Horses — are having on global culture,” said Jamie Erlicht, Apple’s Head of Worldwide Video. “These nominations honor bold storytelling, exceptional performances, and remarkable craftsmanship, and we’re deeply grateful to the Television Academy for recognizing these visionary creators.” Severance dominates as the most-nominated series this year, with 27 overall nominations, including Outstanding Drama, Outstanding Lead Actor for Adam Scott, Outstanding Lead Actress for Britt Lower, Outstanding Directing for Ben Stiller and Jessica Lee Gagné, Outstanding Writing for Dan Erickson, alongside recognition for outstanding performances by Zach Cherry, Tramell Tillman, John Turturro, Patricia Arquette, Jane Alexander, Gwendoline Christie, and Merritt Wever, as well as nods across several craft categories. As the most-nominated freshman comedy series in history, in addition to Outstanding Comedy, The Studio scores Outstanding Lead Actor, Directing, and Writing for Seth Rogen; Outstanding Supporting Actor for Ike Barinholtz; and Outstanding Supporting Actress for Kathryn Hahn and Catherine O’Hara. It also earned five of the six nominations in the Outstanding Guest Actor category, including first-ever acting nominations for directors Martin Scorsese and Ron Howard, alongside Bryan Cranston, Dave Franco, and Anthony Mackie, plus an Outstanding Guest Actress nomination for Zoë Kravitz. Breakout comedy The Studio sweeps with 23 Emmy Award nominations, including Outstanding Comedy Series. In its sophomore season, Apple’s beloved Shrinking nabs its first-ever nomination for Outstanding Comedy Series, and Harrison Ford is recognized with his first Emmy Award nomination for his celebrated performance in the series. Jason Segel nabs Outstanding Lead Actor in a Comedy, alongside Outstanding Supporting Actor and Actress nominations for Michael Urie and Jessica Williams, respectively. Shrinking nabs its first-ever Emmy Award nomination for Outstanding Comedy Series. Following last year’s Emmy Award win for Outstanding Writing for a Drama Series, Slow Horses lands nominations for Outstanding Drama, Outstanding Lead Actor for Sir Gary Oldman, Outstanding Directing for Adam Randall, Outstanding Casting, and Outstanding Writing for a Drama Series for Will Smith. Slow Horses lands five Emmy Award nominations, including Outstanding Drama and Outstanding Lead Actor for Sir Gary Oldman. Apple Original Films’ The Gorge lands the first Outstanding Television Movie nomination for Apple TV+, as Apple Original documentaries Deaf President Now! and Bono: Stories of Surrender are also recognized. Apple TV+ series stars lead with the most performance nominations overall, earning 31 acting category nominations, including 10 top acting nominations for acclaimed performances in The Studio, nine nominations for the stars and guest stars of Severance, and four nominations each for performances in Shrinking and Presumed Innocent. Dope Thief star Brian Tyree Henry also scores a nomination for Outstanding Lead Actor in a Limited or Anthology Series or Movie, as Sir Gary Oldman lands his second nomination for Outstanding Lead Actor in a Drama Series for Slow Horses, and Sharon Horgan is recognized with her second nomination for Outstanding Lead Actress in a Drama Series for the BAFTA Award-winning Bad Sisters. The nominations were announced today by the Television Academy, and the winners will be unveiled at the Creative Arts ceremonies on September 6 and 7, and the Primetime Emmy Awards ceremony on September 14, 2025. To date, Apple Original films, documentaries, and series have earned 580 wins and 2,761 award nominations and counting, including multi-Emmy Award-winning comedy Ted Lasso and historic Oscar Best Picture winner CODA. In total, Apple scores 81 Emmy Award nominations, including: Severance (27) Outstanding Drama Series Outstanding Lead Actor in a Drama Series: Adam Scott Outstanding Lead Actress in a Drama Series: Britt Lower Outstanding Supporting Actor in a Drama Series: Zach Cherry Outstanding Supporting Actor in a Drama Series: Tramell Tillman Outstanding Supporting Actor in a Drama Series: John Turturro Outstanding Supporting Actress in a Drama Series: Patricia Arquette Outstanding Guest Actress in a Drama Series: Jane Alexander Outstanding Guest Actress in a Drama Series: Gwendoline Christie Outstanding Guest Actress in a Drama Series: Merritt Wever Outstanding Directing for a Drama Series: Jessica Lee Gagné Outstanding Directing for a Drama Series: Ben Stiller Outstanding Writing for a Drama Series: Dan Erickson Outstanding Production Design for a Narrative Contemporary Program (One Hour or More) Outstanding Music Composition for a Series (Original Dramatic Score) Outstanding Casting For A Drama Series Outstanding Choreography For Scripted Programming Outstanding Cinematography For A Series (One Hour) Outstanding Picture Editing For A Drama Series (X3) Outstanding Title Design Outstanding Music Supervision Outstanding Sound Editing For A Comedy Or Drama Series (One Hour) Outstanding Sound Mixing For A Comedy Or Drama Series (One Hour) Outstanding Special Visual Effects In A Single Episode Outstanding Stunt Performance The Studio (23) Outstanding Comedy Series Outstanding Lead Actor in a Comedy Series: Seth Rogen Outstanding Supporting Actor in a Comedy Series: Ike Barinholtz Outstanding Supporting Actress in a Comedy Series: Kathryn Hahn Outstanding Supporting Actress in a Comedy Series: Catherine O’Hara Outstanding Guest Actor in a Comedy Series: Bryan Cranston Outstanding Guest Actor in a Comedy Series: Dave Franco Outstanding Guest Actor in a Comedy Series: Ron Howard Outstanding Guest Actor in a Comedy Series: Anthony Mackie Outstanding Guest Actor in a Comedy Series: Martin Scorsese Outstanding Guest Actress in a Comedy Series: Zoë Kravitz Outstanding Directing for a Comedy Series: Seth Rogen, Evan Goldberg Outstanding Writing for a Comedy Series: Seth Rogen, Evan Goldberg, Peter Heck, Alex Gregory, Frida Perez Outstanding Production Design for a Narrative Program (Half-Hour) Outstanding Casting For A Comedy Series Outstanding Cinematography For A Series (Half-Hour) Outstanding Contemporary Costumes For A Series Outstanding Picture Editing For A Single Camera Comedy Series Outstanding Contemporary Hairstyling Outstanding Music Composition for a Series (Original Dramatic Score) Outstanding Music Supervision Outstanding Sound Editing For A Comedy Or Drama Series (Half-Hour) Outstanding Sound Mixing For A Comedy Or Drama Series (Half-Hour) And Animation Shrinking (7) Outstanding Comedy Series Outstanding Lead Actor in a Comedy Series: Jason Segel Outstanding Supporting Actor in a Comedy Series: Harrison Ford Outstanding Supporting Actor in a Comedy Series: Michael Urie Outstanding Supporting Actress in a Comedy Series: Jessica Williams Outstanding Casting For A Comedy Series Outstanding Sound Mixing For A Comedy Or Drama Series (Half-Hour) And Animation Slow Horses (5) Outstanding Drama Series Outstanding Lead Actor in a Drama Series: Gary Oldman Outstanding Writing for a Drama Series: Will Smith Outstanding Directing for a Drama Series: Adam Randall Outstanding Casting For A Drama Series Presumed Innocent (4) Outstanding Lead Actor in a Limited or Anthology Series or Movie: Jake Gyllenhaal Outstanding Supporting Actor in a Limited or Anthology Series or Movie: Bill Camp Outstanding Supporting Actor in a Limited or Anthology Series or Movie: Peter Sarsgaard Outstanding Supporting Actress in a Limited or Anthology Series or Movie: Ruth Negga Disclaimer (2) Outstanding Lead Actress in a Limited or Anthology Series or Movie: Cate Blanchett Outstanding Cinematography For A Limited Or Anthology Series or Movie Bad Sisters (1) Outstanding Lead Actress in a Drama Series: Sharon Horgan Dope Thief (1) Outstanding Lead Actor in a Limited or Anthology Series or Movie: Brian Tyree Henry The Gorge (2) Outstanding Television Movie Outstanding Sound Editing For A Limited Or Anthology Series, Movie Or Special Deaf President Now! (2) Outstanding Documentary or Nonfiction Special Outstanding Directing For A Documentary/Nonfiction Program: Nyle DiMarco, Davis Guggenheim Pachinko (2) Outstanding Production Design for a Narrative Period or Fantasy Program (One Hour or More) Outstanding Cinematography For A Series (One Hour) Your Friends \u0026 Neighbors (1) Outstanding Original Main Title Theme Music Bono: Stories of Surrender (1) Outstanding Technical Direction and Camerawork For A Special Dark Matter (1) Outstanding Title Design Nominees for Outstanding Commercial (2) “Heartstrings” — Apple AirPods Pro “Flock” — Apple Privacy Severance In Severance, Mark Scout (Adam Scott) leads a team at Lumon Industries, whose employees have undergone a severance procedure that surgically divides their memories between their work and personal lives. This daring experiment in “work-life balance” is called into question as Mark finds himself at the center of an unraveling mystery that will force him to confront the true nature of his work … and of himself. In season two, Mark and his friends learn the dire consequences of trifling with the severance barrier, leading them further down a path of woe. The Studio In The Studio, Seth Rogen stars as Matt Remick, the newly appointed head of embattled Continental Studios. As movies struggle to stay alive and relevant, Matt and his core team of infighting executives battle their insecurities as they wrangle narcissistic artists and craven corporate overlords in the ever-elusive pursuit of making great films. With their power suits masking their never-ending sense of panic, every party, set visit, casting decision, marketing meeting and award show presents them with an opportunity for glittering success or career-ending catastrophe. As someone who eats, sleeps and breathes movies, it’s the job Matt’s been pursuing his whole life, and it may very well destroy him. Shrinking Shrinking follows a grieving therapist who starts to break the rules and tell his clients exactly what he thinks. Ignoring his training and ethics, he finds himself making huge, tumultuous changes to people’s lives … including his own. Slow Horses This darkly funny espionage drama follows a team of British intelligence agents who serve in a dumping ground department of MI5 due to their career-ending mistakes. Led by their brilliant but irascible leader, the notorious Jackson Lamb (Academy Award winner Sir Gary Oldman), they navigate the espionage world’s smoke and mirrors to defend England from sinister forces. Presumed Innocent Presumed Innocent is an eight-episode limited series starring and executive produced by Jake Gyllenhaal, hailing from David E. Kelley and executive producer J.J. Abrams and based on the New York Times bestselling novel of the same name by Scott Turow. Starring Gyllenhaal in the lead role of chief deputy prosecutor Rusty Sabich, the series takes viewers on a gripping journey through the horrific murder that upends the Chicago Prosecuting Attorney’s office when one of its own is suspected of the crime. The series explores obsession, sex, politics, and the power and limits of love, as the accused fights to hold his family and marriage together. The star-studded ensemble cast of the thriller also includes Ruth Negga, Bill Camp, Elizabeth Marvel, Peter Sarsgaard, O-T Fagbenle, and Renate Reinsve. Disclaimer Disclaimer is a gripping psychological thriller in seven chapters, starring Academy Award winners Cate Blanchett and Kevin Kline. Written and directed by five-time Academy Award winner Alfonso Cuarón, “Disclaimer” is based on the bestselling novel of the same name by Renée Knight. Acclaimed journalist Catherine Ravenscroft (Blanchett) built her reputation revealing the misdeeds and transgressions of others. When she receives a novel from an unknown author, she is horrified to realize she is now the main character in a story that exposes her darkest secrets. As Catherine races to uncover the writer’s true identity, she is forced to confront her past before it destroys her life and her relationships with her husband Robert (Sacha Baron Cohen) and their son Nicholas (Kodi Smit-McPhee). The ensemble cast includes Lesley Manville, Louis Partridge, Leila George and Hoyeon, and features Indira Varma as the narrator. Bad Sisters Bad Sisters season two returns to follow the lives of the Garvey sisters played by Sharon Horgan as Eva, Anne-Marie Duff as Grace, Eva Birthistle as Ursula, Sarah Greene as Bibi and Eve Hewson as Becka. Two years after the “accidental death” of Grace’s abusive husband, the close-knit Garvey sisters may have moved on, but when past truths resurface, the ladies are thrust back into the spotlight, suspicions are at an all-time high, lies are told, secrets revealed and the sisters are forced to work out who they can trust. Dope Thief Based on Dennis Tafoya’s book Dope Thief, the series follows long-time Philly friends and delinquents who pose as DEA agents to rob an unknown house in the countryside, only to have their small-time grift become a life-and-death enterprise, as they unwittingly reveal and unravel the biggest hidden narcotics corridor on the Eastern Seaboard. The Gorge Two highly-trained operatives (Miles Teller and Anya Taylor-Joy) are appointed to posts in guard towers on opposite sides of a vast and highly classified gorge, protecting the world from an undisclosed, mysterious evil that lurks within. They bond from a distance while trying to stay vigilant in defending against an unseen enemy. When the cataclysmic threat to humanity is revealed to them, they must work together in a test of both their physical and mental strength to keep the secret in the gorge before it’s too late. Pachinko Epic in scope and intimate in tone, the story begins with a forbidden love and crescendos into a sweeping saga that journeys between Korea, Japan and America to tell an unforgettable story of war and peace, love and loss, triumph and reckoning. Your Friends \u0026 Neighbors After being fired in disgrace, a hedge fund manager still grappling with his recent divorce, resorts to stealing from his neighbors’ homes in the exceedingly affluent Westmont Village, only to discover that the secrets and affairs hidden behind those wealthy facades might be more dangerous than he ever imagined. Deaf President Now! The story of the greatest civil rights movement most people have never heard of. Deaf President Now! recounts the eight days of historic protests held at Gallaudet University in 1988 after the school’s board of trustees appointed a hearing president over several very qualified Deaf candidates. After a week of rallies, boycotts and protests, the students of Gallaudet University triumph as the hearing president resigns and beloved dean Dr. I. King Jordan becomes the university’s first Deaf president. The protests marked a pivotal moment in civil rights history, with an impact that extended well beyond the Gallaudet campus, and paved the way for the Americans with Disabilities Act (ADA). Deaf President Now! features exclusive interviews with the five key figures of the movement, including the DPN4 — Jerry Covell, Bridgetta Bourne-Firl, Tim Rarus and Greg Hlibok — alongside I. King Jordan, as well as archival and scripted elements. The film also incorporates an experimental narrative approach called Deaf Point of View, using impressionistic visual photography and intricate sound design to thrust the audience into the Deaf experience. Bono: Stories of Surrender Bono: Stories of Surrender is a vivid reimagining of Bono’s critically acclaimed one-man stage show, Stories of Surrender: An Evening of Words, Music and Some Mischief… As he pulls back the curtain on a remarkable life and the family, friends and faith that have challenged and sustained him, he also reveals personal stories about his journey as a son, father, husband, activist and rock star. Along with never-before-seen, exclusive footage from the tour, the film features Bono performing many of the iconic U2 songs that have shaped his life and legacy. Dark Matter Hailed as one of the best sci-fi novels of the decade, Dark Matter is a story about the road not taken. The series will follow Jason Dessen (played by Joel Edgerton), a physicist, professor and family man who — one night while walking home on the streets of Chicago — is abducted into an alternate version of his life. Wonder quickly turns to nightmare when he tries to return to his reality amid the mind-bending landscape of lives he could have lived. In this labyrinth of realities, he embarks on a harrowing journey to get back to his true family and save them from the most terrifying, unbeatable foe imaginable: himself. All programs are currently streaming on Apple TV+. Apple TV+ offers premium, compelling drama and comedy series, feature films, groundbreaking documentaries, and kids and family entertainment, and is available to watch across all your favorite screens. After its launch on November 1, 2019, Apple TV+ became the first all-original streaming service to launch around the world, and has premiered more original hits and received more award recognitions faster than any other streaming service in its debut. For more information, visit apple.com/tvpr and see the full list of supported devices. Stay up to date with the latest articles from Apple Newsroom.",
  "image": "https://www.apple.com/newsroom/images/2025/07/apple-lands-record-breaking-81-emmy-award-nominations-with-severance-leading/tile/Apple-TV-Plus-Emmy-nominations-Severance-lp.jpg.og.jpg?202507152311",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\n\n\n\t\n    \n\n\n\n\n\n\n\n \n\u003cnav id=\"ac-localnav\" lang=\"en-US\" role=\"navigation\" aria-label=\"Newsroom\" data-analytics-region=\"local nav\" data-sticky=\"\"\u003e\n\t\n    \n    \n        \n\n\n\n\n    \n    \n    \n\t\n\t\n\n\u003c/nav\u003e\n\n\n\n\n\n\u003cmain id=\"main\" role=\"main\"\u003e \n\n\n\n\n\u003cspan id=\"opens-in-new-window\"\u003eopens in new window\u003c/span\u003e\n\u003csection\u003e\n\u003carticle data-analytics-activitymap-region-id=\"article\"\u003e\n\n\n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n\n\n\n    \n\n\n\n\n\n    \u003cdiv\u003e\n        \n\t\t\n        \u003cdiv\u003e\n                    \n                    \n                        \u003cspan\u003ePRESS RELEASE\u003c/span\u003e\n                    \n                    \n                        \u003cspan\u003eJuly 15, 2025\u003c/span\u003e\n                    \n                    \n                \u003c/div\u003e\n\n        \u003cdiv\u003e\n                \n                \n                \n                    \u003ch2\u003e\n                        \n    \n        Apple lands record-breaking 81 Emmy Award nominations, with \u003cem\u003eSeverance\u003c/em\u003e leading as this year’s most-nominated series and \u003cem\u003eThe Studio\u003c/em\u003e becoming the most-nominated freshman comedy in history\n    \n\n                    \u003c/h2\u003e\n                \n            \u003c/div\u003e\n\n        \u003cdiv\u003e\n                \n                \n                    Global phenomenon \u003cem\u003eSeverance\u003c/em\u003e scores 27 nominations for hit second season, including Outstanding Drama Series and nine performance category nominations\u003cp\u003e\n\nBreakout comedy \u003cem\u003eThe Studio\u003c/em\u003e sweeps with 23 nominations, including Outstanding Comedy Series, making history with the most nominations for a freshman comedy and most overall acting nominations this year\u003c/p\u003e\u003cp\u003e\n\nApple TV+ leads as the only network to land multiple title nominations across Outstanding Comedy and Drama Series categories, as \u003cem\u003eThe Studio\u003c/em\u003e, \u003cem\u003eSeverance\u003c/em\u003e, \u003cem\u003eSlow Horses\u003c/em\u003e, and \u003cem\u003eShrinking\u003c/em\u003e land top program nominations, alongside Apple’s first-ever Outstanding Television Movie nod for \u003cem\u003eThe Gorge\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\n\nApple also lands the most acting nominations of any network or studio this year, with 31 performance nods total\u003c/p\u003e\u003cp\u003e\n\nApple Originals honored with nominations across 14 titles, including \u003cem\u003eSeverance\u003c/em\u003e, \u003cem\u003eThe Studio\u003c/em\u003e, \u003cem\u003eSlow Horses\u003c/em\u003e, \u003cem\u003eShrinking\u003c/em\u003e, \u003cem\u003ePresumed Innocent\u003c/em\u003e, \u003cem\u003eThe Gorge\u003c/em\u003e, \u003cem\u003eBad Sisters\u003c/em\u003e, \u003cem\u003eDope Thief\u003c/em\u003e, \u003cem\u003eDisclaimer\u003c/em\u003e, \u003cem\u003ePachinko\u003c/em\u003e, \u003cem\u003eYour Friends \u0026amp; Neighbors\u003c/em\u003e, \u003cem\u003eDark Matter\u003c/em\u003e, \u003cem\u003eDeaf President Now!\u003c/em\u003e, and \u003cem\u003eBono: Stories of Surrender\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\n\n        \n            \n    \n    \n    \n    \n    \n\n        \n\n    \u003c/div\u003e\n\n\n\n\n\n\n\n    \n    \n    \n\n\n\n\n\n\n  \n    \n    \n    \n    \n      \u003cfigure aria-label=\"Media, A still from Apple TV+ series “Severance” featuring actors Britt Lower and Adam Scott.\"\u003e\n        \u003cdiv\u003e\n             \n              \n              \u003cdiv\u003e\n                \u003cem\u003eSeverance\u003c/em\u003e scores 27 Emmy Award nominations for its hit second season, including Outstanding Drama Series and nine performance category nominations.\n              \u003c/div\u003e\n            \n            \n            \n            \n            \u003ca href=\"https://www.apple.com/newsroom/images/2025/07/apple-lands-record-breaking-81-emmy-award-nominations-with-severance-leading/article/Apple-TV-Plus-Emmy-nominations-Severance.zip\" download=\"\" data-analytics-title=\"download image - Apple-TV-Plus-Emmy-nominations-Severance_big\" aria-label=\"Download media, A still from Apple TV+ series “Severance” featuring actors Britt Lower and Adam Scott.\"\u003e\u003c/a\u003e\n          \u003c/div\u003e\n      \u003c/figure\u003e\n    \n  \n\n\n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003cdiv\u003e\u003cspan\u003eCULVER CITY, CALIFORNIA\u003c/span\u003e Apple TV+ today earned a record-breaking 81 Emmy Award nominations across 14 hit Apple Original titles for this year’s 77th Emmy Awards. \u003cem\u003eSeverance\u003c/em\u003e became this year’s most-nominated series with 27 nominations, and \u003cem\u003eThe Studio\u003c/em\u003e made history as the most-nominated freshman comedy series with 23 nominations in total. Additionally, with top program nominations for drama (\u003cem\u003eSlow Horses\u003c/em\u003e) and comedy (\u003cem\u003eShrinking\u003c/em\u003e), Apple TV+ became the only network to have multiple titles nominated in the Outstanding Comedy and Drama Series categories. Apple also landed the most acting nominations of any network or studio this year, with 31 performance nods total.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e“Everyone at Apple is celebrating the talent, creativity, and hard work of all of our Emmy nominees this morning,” said Zack Van Amburg, Apple’s head of Worldwide Video. “\u003cem\u003eSeverance\u003c/em\u003e and \u003cem\u003eThe Studio\u003c/em\u003e have exceeded our wildest expectations in earning the most nominations for both drama and comedy series, alongside the phenomenal \u003cem\u003eShrinking\u003c/em\u003e and \u003cem\u003eSlow Horses\u003c/em\u003e. These shows have connected deeply with audiences around the world, and we’re incredibly appreciative to the Television Academy for recognizing the breadth of storytelling that has been an honor for us to champion. We send our warmest congratulations to all of today’s nominees.”\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e“This record-breaking year is a milestone for Apple, and we’re especially proud of the continued impact our outstanding series nominees — \u003cem\u003eSeverance\u003c/em\u003e, \u003cem\u003eThe Studio\u003c/em\u003e, \u003cem\u003eShrinking\u003c/em\u003e, and \u003cem\u003eSlow Horses\u003c/em\u003e — are having on global culture,” said Jamie Erlicht, Apple’s Head of Worldwide Video. “These nominations honor bold storytelling, exceptional performances, and remarkable craftsmanship, and we’re deeply grateful to the Television Academy for recognizing these visionary creators.”\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cem\u003eSeverance\u003c/em\u003e dominates as the most-nominated series this year, with 27 overall nominations, including Outstanding Drama, Outstanding Lead Actor for Adam Scott, Outstanding Lead Actress for Britt Lower, Outstanding Directing for Ben Stiller and Jessica Lee Gagné, Outstanding Writing for Dan Erickson, alongside recognition for outstanding performances by Zach Cherry, Tramell Tillman, John Turturro, Patricia Arquette, Jane Alexander, Gwendoline Christie, and Merritt Wever, as well as nods across several craft categories.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eAs the most-nominated freshman comedy series in history, in addition to Outstanding Comedy, \u003cem\u003eThe Studio\u003c/em\u003e scores Outstanding Lead Actor, Directing, and Writing for Seth Rogen; Outstanding Supporting Actor for Ike Barinholtz; and Outstanding Supporting Actress for Kathryn Hahn and Catherine O’Hara. It also earned five of the six nominations in the Outstanding Guest Actor category, including first-ever acting nominations for directors Martin Scorsese and Ron Howard, alongside Bryan Cranston, Dave Franco, and Anthony Mackie, plus an Outstanding Guest Actress nomination for Zoë Kravitz.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n\n\n  \n    \n    \n    \n    \n      \u003cfigure aria-label=\"Media, A still from Apple TV+ series “The Studio” featuring actor Seth Rogen.\"\u003e\n        \u003cdiv\u003e\n             \n              \n              \u003cdiv\u003e\n                Breakout comedy \u003cem\u003eThe Studio\u003c/em\u003e sweeps with 23 Emmy Award nominations, including Outstanding Comedy Series.\n              \u003c/div\u003e\n            \n            \n            \n            \n            \u003ca href=\"https://www.apple.com/newsroom/images/2025/07/apple-lands-record-breaking-81-emmy-award-nominations-with-severance-leading/article/Apple-TV-Plus-Emmy-nominations-The-Studio.zip\" download=\"\" data-analytics-title=\"download image - Apple-TV-Plus-Emmy-nominations-The-Studio_big\" aria-label=\"Download media, A still from Apple TV+ series “The Studio” featuring actor Seth Rogen.\"\u003e\u003c/a\u003e\n          \u003c/div\u003e\n      \u003c/figure\u003e\n    \n  \n\n\n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003eIn its sophomore season, Apple’s beloved \u003cem\u003eShrinking\u003c/em\u003e nabs its first-ever nomination for Outstanding Comedy Series, and Harrison Ford is recognized with his first Emmy Award nomination for his celebrated performance in the series. Jason Segel nabs Outstanding Lead Actor in a Comedy, alongside Outstanding Supporting Actor and Actress nominations for Michael Urie and Jessica Williams, respectively.\n\u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n\n\n  \n    \n    \n    \n    \n      \u003cfigure aria-label=\"Media, Key art from Apple TV+ series “Shrinking.”\"\u003e\n        \u003cdiv\u003e\n             \n              \n              \u003cdiv\u003e\n                \u003cem\u003eShrinking\u003c/em\u003e nabs its first-ever Emmy Award nomination for Outstanding Comedy Series.\n              \u003c/div\u003e\n            \n            \n            \n            \n            \u003ca href=\"https://www.apple.com/newsroom/images/2025/07/apple-lands-record-breaking-81-emmy-award-nominations-with-severance-leading/article/Apple-TV-Plus-Emmy-nominations-Shrinking.zip\" download=\"\" data-analytics-title=\"download image - Apple-TV-Plus-Emmy-nominations-Shrinking_big\" aria-label=\"Download media, Key art from Apple TV+ series “Shrinking.”\"\u003e\u003c/a\u003e\n          \u003c/div\u003e\n      \u003c/figure\u003e\n    \n  \n\n\n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003eFollowing last year’s Emmy Award win for Outstanding Writing for a Drama Series, \u003cem\u003eSlow Horses\u003c/em\u003e lands nominations for Outstanding Drama, Outstanding Lead Actor for Sir Gary Oldman, Outstanding Directing for Adam Randall, Outstanding Casting, and Outstanding Writing for a Drama Series for Will Smith.\n\u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n\n\n  \n    \n    \n    \n    \n      \u003cfigure aria-label=\"Media, A still from Apple TV+ series “Slow Horses” featuring actors Jack Lowden and Gary Oldman.\"\u003e\n        \u003cdiv\u003e\n             \n              \n              \u003cdiv\u003e\n                \u003cem\u003eSlow Horses\u003c/em\u003e lands five Emmy Award nominations, including Outstanding Drama and Outstanding Lead Actor for Sir Gary Oldman.\n              \u003c/div\u003e\n            \n            \n            \n            \n            \u003ca href=\"https://www.apple.com/newsroom/images/2025/07/apple-lands-record-breaking-81-emmy-award-nominations-with-severance-leading/article/Apple-TV-Plus-Emmy-nominations-Slow-Horses.zip\" download=\"\" data-analytics-title=\"download image - Apple-TV-Plus-Emmy-nominations-Slow-Horses_big\" aria-label=\"Download media, A still from Apple TV+ series “Slow Horses” featuring actors Jack Lowden and Gary Oldman.\"\u003e\u003c/a\u003e\n          \u003c/div\u003e\n      \u003c/figure\u003e\n    \n  \n\n\n\n\n\n\n\n\n    \n    \n    \n\n\n     \n     \n    \n    \n        \u003cdiv\u003e\n             \n                 \u003cdiv\u003eApple Original Films’ \u003cem\u003eThe Gorge\u003c/em\u003e lands the first Outstanding Television Movie nomination for Apple TV+, as Apple Original documentaries \u003cem\u003eDeaf President Now!\u003c/em\u003e and \u003cem\u003eBono: Stories of Surrender\u003c/em\u003e are also recognized.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eApple TV+ series stars lead with the most performance nominations overall, earning 31 acting category nominations, including 10 top acting nominations for acclaimed performances in \u003cem\u003eThe Studio\u003c/em\u003e, nine nominations for the stars and guest stars of \u003cem\u003eSeverance\u003c/em\u003e, and four nominations each for performances in \u003cem\u003eShrinking\u003c/em\u003e and \u003cem\u003ePresumed Innocent\u003c/em\u003e. \u003cem\u003eDope Thief\u003c/em\u003e star Brian Tyree Henry also scores a nomination for Outstanding Lead Actor in a Limited or Anthology Series or Movie, as Sir Gary Oldman lands his second nomination for Outstanding Lead Actor in a Drama Series for \u003cem\u003eSlow Horses\u003c/em\u003e, and Sharon Horgan is recognized with her second nomination for Outstanding Lead Actress in a Drama Series for the BAFTA Award-winning \u003cem\u003eBad Sisters\u003c/em\u003e.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eThe nominations were announced today by the Television Academy, and the winners will be unveiled at the Creative Arts ceremonies on September 6 and 7, and the Primetime Emmy Awards ceremony on September 14, 2025.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eTo date, Apple Original films, documentaries, and series have earned 580 wins and 2,761 award nominations and counting, including multi-Emmy Award-winning comedy \u003cem\u003eTed Lasso\u003c/em\u003e and historic Oscar Best Picture winner \u003cem\u003eCODA\u003c/em\u003e.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eIn total, Apple scores 81 Emmy Award nominations, including:\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eSeverance\u003c/em\u003e (27)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Drama Series\u003c/li\u003e\n\u003cli\u003eOutstanding Lead Actor in a Drama Series: Adam Scott\u003c/li\u003e\n\u003cli\u003eOutstanding Lead Actress in a Drama Series: Britt Lower\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actor in a Drama Series: Zach Cherry\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actor in a Drama Series: Tramell Tillman\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actor in a Drama Series: John Turturro\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actress in a Drama Series: Patricia Arquette\u003c/li\u003e\n\u003cli\u003eOutstanding Guest Actress in a Drama Series: Jane Alexander\u003c/li\u003e\n\u003cli\u003eOutstanding Guest Actress in a Drama Series: Gwendoline Christie\u003c/li\u003e\n\u003cli\u003eOutstanding Guest Actress in a Drama Series: Merritt Wever\u003c/li\u003e\n\u003cli\u003eOutstanding Directing for a Drama Series: Jessica Lee Gagné\u003c/li\u003e\n\u003cli\u003eOutstanding Directing for a Drama Series: Ben Stiller\u003c/li\u003e\n\u003cli\u003eOutstanding Writing for a Drama Series: Dan Erickson\u003c/li\u003e\n\u003cli\u003eOutstanding Production Design for a Narrative Contemporary Program (One Hour or More)\u003c/li\u003e\n\u003cli\u003eOutstanding Music Composition for a Series (Original Dramatic Score)\u003c/li\u003e\n\u003cli\u003eOutstanding Casting For A Drama Series\u003c/li\u003e\n\u003cli\u003eOutstanding Choreography For Scripted Programming\u003c/li\u003e\n\u003cli\u003eOutstanding Cinematography For A Series (One Hour)\u003c/li\u003e\n\u003cli\u003eOutstanding Picture Editing For A Drama Series (X3)\u003c/li\u003e\n\u003cli\u003eOutstanding Title Design\u003c/li\u003e\n\u003cli\u003eOutstanding Music Supervision\u003c/li\u003e\n\u003cli\u003eOutstanding Sound Editing For A Comedy Or Drama Series (One Hour)\u003c/li\u003e\n\u003cli\u003eOutstanding Sound Mixing For A Comedy Or Drama Series (One Hour)\u003c/li\u003e\n\u003cli\u003eOutstanding Special Visual Effects In A Single Episode\u003c/li\u003e\n\u003cli\u003eOutstanding Stunt Performance\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eThe Studio\u003c/em\u003e (23)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Comedy Series\u003c/li\u003e\n\u003cli\u003eOutstanding Lead Actor in a Comedy Series: Seth Rogen\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actor in a Comedy Series: Ike Barinholtz\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actress in a Comedy Series: Kathryn Hahn\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actress in a Comedy Series: Catherine O’Hara\u003c/li\u003e\n\u003cli\u003eOutstanding Guest Actor in a Comedy Series: Bryan Cranston\u003c/li\u003e\n\u003cli\u003eOutstanding Guest Actor in a Comedy Series: Dave Franco\u003c/li\u003e\n\u003cli\u003eOutstanding Guest Actor in a Comedy Series: Ron Howard\u003c/li\u003e\n\u003cli\u003eOutstanding Guest Actor in a Comedy Series: Anthony Mackie\u003c/li\u003e\n\u003cli\u003eOutstanding Guest Actor in a Comedy Series: Martin Scorsese\u003c/li\u003e\n\u003cli\u003eOutstanding Guest Actress in a Comedy Series: Zoë Kravitz\u003c/li\u003e\n\u003cli\u003eOutstanding Directing for a Comedy Series: Seth Rogen, Evan Goldberg\u003c/li\u003e\n\u003cli\u003eOutstanding Writing for a Comedy Series: Seth Rogen, Evan Goldberg, Peter Heck, Alex Gregory, Frida Perez\u003c/li\u003e\n\u003cli\u003eOutstanding Production Design for a Narrative Program (Half-Hour)\u003c/li\u003e\n\u003cli\u003eOutstanding Casting For A Comedy Series\u003c/li\u003e\n\u003cli\u003eOutstanding Cinematography For A Series (Half-Hour)\u003c/li\u003e\n\u003cli\u003eOutstanding Contemporary Costumes For A Series\u003c/li\u003e\n\u003cli\u003eOutstanding Picture Editing For A Single Camera Comedy Series\u003c/li\u003e\n\u003cli\u003eOutstanding Contemporary Hairstyling\u003c/li\u003e\n\u003cli\u003eOutstanding Music Composition for a Series (Original Dramatic Score)\u003c/li\u003e\n\u003cli\u003eOutstanding Music Supervision\u003c/li\u003e\n\u003cli\u003eOutstanding Sound Editing For A Comedy Or Drama Series (Half-Hour)\u003c/li\u003e\n\u003cli\u003eOutstanding Sound Mixing For A Comedy Or Drama Series (Half-Hour) And Animation\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eShrinking\u003c/em\u003e (7)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Comedy Series\u003c/li\u003e\n\u003cli\u003eOutstanding Lead Actor in a Comedy Series: Jason Segel\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actor in a Comedy Series: Harrison Ford\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actor in a Comedy Series: Michael Urie\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actress in a Comedy Series: Jessica Williams\u003c/li\u003e\n\u003cli\u003eOutstanding Casting For A Comedy Series\u003c/li\u003e\n\u003cli\u003eOutstanding Sound Mixing For A Comedy Or Drama Series (Half-Hour) And Animation\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eSlow Horses\u003c/em\u003e (5)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Drama Series\u003c/li\u003e\n\u003cli\u003eOutstanding Lead Actor in a Drama Series: Gary Oldman\u003c/li\u003e\n\u003cli\u003eOutstanding Writing for a Drama Series: Will Smith\u003c/li\u003e\n\u003cli\u003eOutstanding Directing for a Drama Series: Adam Randall\u003c/li\u003e\n\u003cli\u003eOutstanding Casting For A Drama Series\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003ePresumed Innocent\u003c/em\u003e (4)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Lead Actor in a Limited or Anthology Series or Movie: Jake Gyllenhaal\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actor in a Limited or Anthology Series or Movie: Bill Camp\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actor in a Limited or Anthology Series or Movie: Peter Sarsgaard\u003c/li\u003e\n\u003cli\u003eOutstanding Supporting Actress in a Limited or Anthology Series or Movie: Ruth Negga\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eDisclaimer\u003c/em\u003e (2)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Lead Actress in a Limited or Anthology Series or Movie: Cate Blanchett\u003c/li\u003e\n\u003cli\u003eOutstanding Cinematography For A Limited Or Anthology Series or Movie\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eBad Sisters\u003c/em\u003e (1)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Lead Actress in a Drama Series: Sharon Horgan\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eDope Thief\u003c/em\u003e (1)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Lead Actor in a Limited or Anthology Series or Movie: Brian Tyree Henry\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eThe Gorge\u003c/em\u003e (2)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Television Movie\u003c/li\u003e\n\u003cli\u003eOutstanding Sound Editing For A Limited Or Anthology Series, Movie Or Special\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eDeaf President Now!\u003c/em\u003e (2)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Documentary or Nonfiction Special\u003c/li\u003e\n\u003cli\u003eOutstanding Directing For A Documentary/Nonfiction Program: Nyle DiMarco, Davis Guggenheim\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003ePachinko\u003c/em\u003e (2)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Production Design for a Narrative Period or Fantasy Program (One Hour or More)\u003c/li\u003e\n\u003cli\u003eOutstanding Cinematography For A Series (One Hour)\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eYour Friends \u0026amp; Neighbors\u003c/em\u003e (1)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Original Main Title Theme Music\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eBono: Stories of Surrender\u003c/em\u003e (1)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Technical Direction and Camerawork For A Special\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eDark Matter\u003c/em\u003e (1)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eOutstanding Title Design\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003eNominees for Outstanding Commercial (2)\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003e“Heartstrings” — Apple AirPods Pro\u003c/li\u003e\n\u003cli\u003e“Flock” — Apple Privacy\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eSeverance\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\nIn \u003cem\u003eSeverance\u003c/em\u003e, Mark Scout (Adam Scott) leads a team at Lumon Industries, whose employees have undergone a severance procedure that surgically divides their memories between their work and personal lives. This daring experiment in “work-life balance” is called into question as Mark finds himself at the center of an unraveling mystery that will force him to confront the true nature of his work … and of himself. In season two, Mark and his friends learn the dire consequences of trifling with the severance barrier, leading them further down a path of woe.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eThe Studio\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\nIn \u003cem\u003eThe Studio\u003c/em\u003e, Seth Rogen stars as Matt Remick, the newly appointed head of embattled Continental Studios. As movies struggle to stay alive and relevant, Matt and his core team of infighting executives battle their insecurities as they wrangle narcissistic artists and craven corporate overlords in the ever-elusive pursuit of making great films. With their power suits masking their never-ending sense of panic, every party, set visit, casting decision, marketing meeting and award show presents them with an opportunity for glittering success or career-ending catastrophe. As someone who eats, sleeps and breathes movies, it’s the job Matt’s been pursuing his whole life, and it may very well destroy him.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eShrinking\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\n\u003cem\u003eShrinking\u003c/em\u003e follows a grieving therapist who starts to break the rules and tell his clients exactly what he thinks. Ignoring his training and ethics, he finds himself making huge, tumultuous changes to people’s lives … including his own.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eSlow Horses\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\nThis darkly funny espionage drama follows a team of British intelligence agents who serve in a dumping ground department of MI5 due to their career-ending mistakes. Led by their brilliant but irascible leader, the notorious Jackson Lamb (Academy Award winner Sir Gary Oldman), they navigate the espionage world’s smoke and mirrors to defend England from sinister forces.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003ePresumed Innocent\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\n\u003cem\u003ePresumed Innocent\u003c/em\u003e is an eight-episode limited series starring and executive produced by Jake Gyllenhaal, hailing from David E. Kelley and executive producer J.J. Abrams and based on the New York Times bestselling novel of the same name by Scott Turow. Starring Gyllenhaal in the lead role of chief deputy prosecutor Rusty Sabich, the series takes viewers on a gripping journey through the horrific murder that upends the Chicago Prosecuting Attorney’s office when one of its own is suspected of the crime. The series explores obsession, sex, politics, and the power and limits of love, as the accused fights to hold his family and marriage together. The star-studded ensemble cast of the thriller also includes Ruth Negga, Bill Camp, Elizabeth Marvel, Peter Sarsgaard, O-T Fagbenle, and Renate Reinsve.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eDisclaimer\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\n\u003cem\u003eDisclaimer\u003c/em\u003e is a gripping psychological thriller in seven chapters, starring Academy Award winners Cate Blanchett and Kevin Kline. Written and directed by five-time Academy Award winner Alfonso Cuarón, “Disclaimer” is based on the bestselling novel of the same name by Renée Knight. Acclaimed journalist Catherine Ravenscroft (Blanchett) built her reputation revealing the misdeeds and transgressions of others. When she receives a novel from an unknown author, she is horrified to realize she is now the main character in a story that exposes her darkest secrets. As Catherine races to uncover the writer’s true identity, she is forced to confront her past before it destroys her life and her relationships with her husband Robert (Sacha Baron Cohen) and their son Nicholas (Kodi Smit-McPhee). The ensemble cast includes Lesley Manville, Louis Partridge, Leila George and Hoyeon, and features Indira Varma as the narrator.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eBad Sisters\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\n\u003cem\u003eBad Sisters\u003c/em\u003e season two returns to follow the lives of the Garvey sisters played by Sharon Horgan as Eva, Anne-Marie Duff as Grace, Eva Birthistle as Ursula, Sarah Greene as Bibi and Eve Hewson as Becka. Two years after the “accidental death” of Grace’s abusive husband, the close-knit Garvey sisters may have moved on, but when past truths resurface, the ladies are thrust back into the spotlight, suspicions are at an all-time high, lies are told, secrets revealed and the sisters are forced to work out who they can trust.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eDope Thief\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\nBased on Dennis Tafoya’s book \u003cem\u003eDope Thief\u003c/em\u003e, the series follows long-time Philly friends and delinquents who pose as DEA agents to rob an unknown house in the countryside, only to have their small-time grift become a life-and-death enterprise, as they unwittingly reveal and unravel the biggest hidden narcotics corridor on the Eastern Seaboard.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eThe Gorge\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\nTwo highly-trained operatives (Miles Teller and Anya Taylor-Joy) are appointed to posts in guard towers on opposite sides of a vast and highly classified gorge, protecting the world from an undisclosed, mysterious evil that lurks within. They bond from a distance while trying to stay vigilant in defending against an unseen enemy. When the cataclysmic threat to humanity is revealed to them, they must work together in a test of both their physical and mental strength to keep the secret in the gorge before it’s too late.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003ePachinko\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\nEpic in scope and intimate in tone, the story begins with a forbidden love and crescendos into a sweeping saga that journeys between Korea, Japan and America to tell an unforgettable story of war and peace, love and loss, triumph and reckoning.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eYour Friends \u0026amp; Neighbors\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\nAfter being fired in disgrace, a hedge fund manager still grappling with his recent divorce, resorts to stealing from his neighbors’ homes in the exceedingly affluent Westmont Village, only to discover that the secrets and affairs hidden behind those wealthy facades might be more dangerous than he ever imagined.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eDeaf President Now!\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\nThe story of the greatest civil rights movement most people have never heard of. \u003cem\u003eDeaf President Now!\u003c/em\u003e recounts the eight days of historic protests held at Gallaudet University in 1988 after the school’s board of trustees appointed a hearing president over several very qualified Deaf candidates. After a week of rallies, boycotts and protests, the students of Gallaudet University triumph as the hearing president resigns and beloved dean Dr. I. King Jordan becomes the university’s first Deaf president. The protests marked a pivotal moment in civil rights history, with an impact that extended well beyond the Gallaudet campus, and paved the way for the Americans with Disabilities Act (ADA). \u003cem\u003eDeaf President Now!\u003c/em\u003e features exclusive interviews with the five key figures of the movement, including the DPN4 — Jerry Covell, Bridgetta Bourne-Firl, Tim Rarus and Greg Hlibok — alongside I. King Jordan, as well as archival and scripted elements. The film also incorporates an experimental narrative approach called Deaf Point of View, using impressionistic visual photography and intricate sound design to thrust the audience into the Deaf experience.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eBono: Stories of Surrender\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\n\u003cem\u003eBono: Stories of Surrender\u003c/em\u003e is a vivid reimagining of Bono’s critically acclaimed one-man stage show, \u003cem\u003eStories of Surrender: An Evening of Words, Music and Some Mischief…\u003c/em\u003e As he pulls back the curtain on a remarkable life and the family, friends and faith that have challenged and sustained him, he also reveals personal stories about his journey as a son, father, husband, activist and rock star. Along with never-before-seen, exclusive footage from the tour, the film features Bono performing many of the iconic U2 songs that have shaped his life and legacy.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eDark Matter\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\nHailed as one of the best sci-fi novels of the decade, \u003cem\u003eDark Matter\u003c/em\u003e is a story about the road not taken. The series will follow Jason Dessen (played by Joel Edgerton), a physicist, professor and family man who — one night while walking home on the streets of Chicago — is abducted into an alternate version of his life. Wonder quickly turns to nightmare when he tries to return to his reality amid the mind-bending landscape of lives he could have lived. In this labyrinth of realities, he embarks on a harrowing journey to get back to his true family and save them from the most terrifying, unbeatable foe imaginable: himself.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eAll programs are currently streaming on Apple TV+.\n\u003c/div\u003e\n                 \n             \n                 \u003cdiv\u003eApple TV+ offers premium, compelling drama and comedy series, feature films, groundbreaking documentaries, and kids and family entertainment, and is available to watch across all your favorite screens. After its launch on November 1, 2019, Apple TV+ became the first all-original streaming service to launch around the world, and has premiered more original hits and received more award recognitions faster than any other streaming service in its debut.\n\u003c/div\u003e\n                 \n             \n         \u003c/div\u003e\n \n\n    \n    \n    \n\n\n\n\n    \n    \n        \n    \n\n\n    \n    \n    \n\n\n\n    \n    \n    \n\n\n\n\n    \n\n\n\n\n    \n    \n    \n\n\n\n\n\n    \n    \n    \u003cdiv\u003e\n            \u003col\u003e\n\u003cli\u003eFor more information, visit \u003ca href=\"https://www.apple.com/tv-pr/\" target=\"_blank\"\u003eapple.com/tvpr\u003c/a\u003e and see the full list of supported devices.\u003c/li\u003e\n\u003c/ol\u003e\n\n        \u003c/div\u003e\n\n\n\n    \n    \n    \n\n\n\n\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\t\t\n\n\u003c/article\u003e\n\n\n\n\u003c/section\u003e\n\u003c/main\u003e\n\n\n\n\u003cdiv\u003e\n            Stay up to date with the latest articles from Apple Newsroom.\n        \u003c/div\u003e\n\t\n\n\u003c/div\u003e",
  "readingTime": "26 min read",
  "publishedTime": "2025-07-01T15:00:00Z",
  "modifiedTime": null
}
