{
  "id": "bfe02190-e121-4fad-a228-b7f32567251f",
  "title": "Mastercard may be in for a fight to stay Apple Card network provider",
  "link": "https://appleinsider.com/articles/25/04/01/mastercard-may-be-in-for-a-fight-to-stay-apple-card-network-provider?utm_medium=rss",
  "description": "There's been a quiet battle between banks to be the next Apple Card issuer as Goldman Sachs moves on, but another battle is brewing between networks to take over from Mastercard.Apple Card could go with Visa for payment networkApple is set to move Apple Card from Goldman Sachs at some point soon, but Apple could switch payment networks in the process. Goldman Sachs previously suggested it wanted to rid itself of Apple Card in 12 to 15 months as of November 2023 — so the move is past due.Before the card issuer changes, however, Apple may choose to sign a new contract with a different payment network. The current network is Mastercard, but according to a report from The Wall Street Journal, Visa and American Express are fighting for the position. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Wesley Hilliard",
  "published": "Tue, 01 Apr 2025 21:07:52 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Wesley Hilliard",
  "length": 1646,
  "excerpt": "There's been a quiet battle between banks to be the next Apple Card issuer as Goldman Sachs moves on, but another battle is brewing between networks to take over from Mastercard.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "There's been a quiet battle between banks to be the next Apple Card issuer as Goldman Sachs moves on, but another battle is brewing between networks to take over from Mastercard. Apple is set to move Apple Card from Goldman Sachs at some point soon, but Apple could switch payment networks in the process. Goldman Sachs previously suggested it wanted to rid itself of Apple Card in 12 to 15 months as of November 2023 — so the move is past due. Before the card issuer changes, however, Apple may choose to sign a new contract with a different payment network. The current network is Mastercard, but according to a report from The Wall Street Journal, Visa and American Express are fighting for the position. Visa has even reportedly offered Apple about $100 million to take over as the payment network. That's a large sum it has reserved for its biggest clients, like Costco. American Express is also reportedly attempting to take over as both issuer and network for Apple Card. The Amex CEO has previously seemed uninterested in Apple Card, but throwing in the ability to be the network provider may sweeten the deal. Apple can't move from Mastercard until that portion of the contract expires sometime in 2026. However, even if Goldman Sachs finds a new issuer, it'll take time to make the shift and may be able to include some negotiation into who the new network provider is. Nothing official has been said publicly, and there is still no sign of what company will take over from Goldman Sachs or when. It could be several months before it all shakes out, but if Goldman Sachs is so pressed to be free of Apple, expect moves to be made soon.",
  "image": "https://photos5.appleinsider.com/gallery/63181-131277-IMG_1949-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eThere\u0026#39;s been a quiet battle between banks to be the next \u003ca href=\"https://appleinsider.com/inside/apple-card\" title=\"Apple Card\" data-kpt=\"1\"\u003eApple Card\u003c/a\u003e issuer as Goldman Sachs moves on, but another battle is brewing between networks to take over from Mastercard.\n\u003c/p\u003e\u003cp\u003eApple is set to move Apple Card from Goldman Sachs at some point soon, but Apple could switch payment networks in the process. Goldman Sachs previously suggested it wanted to rid itself of Apple Card in \u003ca href=\"https://appleinsider.com/articles/23/11/28/apple-and-goldman-sachs-to-part-ways-on-apple-card-no-successor-named\"\u003e12 to 15 months\u003c/a\u003e as of November 2023 —  so the move is past due.\n\u003c/p\u003e\u003cp\u003eBefore the card issuer changes, however, Apple may choose to sign a new contract with a different payment network. The current network is Mastercard, but according to \u003ca href=\"https://www.wsj.com/finance/banking/apple-card-visa-mastercard-deal-3ce762da?reflink=mobilewebshare_permalink\"\u003ea report\u003c/a\u003e from \u003cem\u003eThe Wall Street Journal\u003c/em\u003e, Visa and American Express are fighting for the position.\n\u003c/p\u003e\u003cp\u003eVisa has even reportedly offered Apple about $100 million to take over as the payment network. That\u0026#39;s a large sum it has reserved for its biggest clients, like Costco.\n\u003c/p\u003e\u003cp\u003eAmerican Express is also reportedly attempting to take over as both issuer and network for Apple Card. The Amex CEO has \u003ca href=\"https://appleinsider.com/articles/23/12/07/american-express-doesnt-seem-that-interested-in-an-apple-card-partnership\"\u003epreviously seemed\u003c/a\u003e uninterested in Apple Card, but throwing in the ability to be the network provider may sweeten the deal.\n\u003c/p\u003e\u003cp\u003eApple can\u0026#39;t move from Mastercard until that portion of the \u003ca href=\"https://appleinsider.com/articles/23/07/25/how-the-apple-goldman-sachs-relationship-became-an-unhappy-marriage\"\u003econtract expires\u003c/a\u003e sometime in 2026. However, even if Goldman Sachs finds a new issuer, it\u0026#39;ll take time to make the shift and may be able to include some negotiation into who the new network provider is.\n\u003c/p\u003e\u003cp\u003eNothing official has been said publicly, and there is still no sign of what company will take over from Goldman Sachs or when. It could be several months before it all shakes out, but if Goldman Sachs is \u003ca href=\"https://appleinsider.com/articles/24/09/10/goldman-sachs-is-certain-to-lose-millions-when-it-sells-off-its-apple-card-stake\"\u003eso pressed\u003c/a\u003e to be free of Apple, expect moves to be made soon.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-01T21:07:52Z",
  "modifiedTime": null
}
