{
  "id": "c6435704-1fd5-4c4d-ae78-7486f84f7748",
  "title": "Price drop: This 3-in-1 charger is perfect for Apple fans on the road",
  "link": "https://www.cultofmac.com/daily-deals/3-in-1-magnetic-wireless-charging-pad",
  "description": "Need a travel charger for iPhone, Apple Watch and AirPods? Get the 3-in-1 Magnetic Wireless Charging Pad for just $26.97 for a limited time. (via Cult of Mac - Apple news, rumors, reviews and how-tos)",
  "author": "Cult of Mac Deals",
  "published": "Fri, 08 Nov 2024 21:45:15 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "Daily deals",
    "3-in-1 chargers",
    "Cult of Mac Deals",
    "travel chargers",
    "wireless chargers"
  ],
  "byline": "Cult of Mac Deals",
  "length": 2834,
  "excerpt": "Need a travel charger for iPhone, Apple Watch and AirPods? Get the 3-in-1 Magnetic Wireless Charging Pad for just $26.97 for a limited time.",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "Daily deals Power up to 3 devices wirelessly with this foldable $32.99 charger. Photo: Cult of Mac Deals Every time you leave your desk, the battery clock starts ticking. Which of your Apple devices will need to recharge first? Luckily, you can recharge three at once with this 3-in-1 Magnetic Wireless Charging Pad. It looks a lot like Apple’s MagSafe Duo, but it can handle three devices, not just two, which makes it an even more convenient travel charger. Plus, it costs a fraction of what Apple’s charger does. And now it’s even cheaper, thanks to a limited-time deal that drops the price to just $26.97 (regularly $69.99). This post contains affiliate links. Cult of Mac may earn a commission when you use our links to buy items. A foldable charging station for your Apple gear The design makes all the difference with this unique charging 3-in-1 charger. When folded up, it measures just over 3 square inches. So it’s small enough to stow in your pants pocket, backpack or purse. Fold out the three connected tiles, and you have a versatile power solution that can be laid out flat or configured to meet your needs. Turn it into a triangle, and you’ve got a phone stand that lets you watch movies, play games or make video calls, juicing up your battery all the while. Better yet, you can charge up to three devices at the same time, as long as you connect it to a powerful enough wall charger. (Ugreen makes an affordable one for international travel, and Anker makes a wide range of excellent USB-C chargers.) This folding 3-in-1 charger can accommodate iPhones and wireless-charging AirPods cases. Plus, one tile comes with a flip-up bit that makes it the perfect spot for your Apple Watch. Smartphones can charge at an impressive 15W, while a smart chip guards against overheating. Meanwhile, the MagSafe-like magnetic pad ensures your iPhone stays put no matter what configuration your charger is in. The silicone material is soft and easy on your gear, but durable enough to withstand the rigors of travel and other movement. A great 3-in-1 travel charger makes packing and productivity easier Forgetful packers may benefit from the all-in-one nature of this wireless charging pad, as they won’t need to remember all the cords and wall adapters for their Apple devices. Plus, this streamlined 3-in-1 charger reduces cable clutter. And it comes in two colors: white and black. Get the 3-in-1 Magnetic Wireless Charging Pad for just $26.97 for a limited time. Buy from: Cult of Mac Deals Prices subject to change. All sales handled by StackCommerce, our partner who runs Cult of Mac Deals. For customer support, please email StackCommerce directly. We originally published this post on the 3-in-1 charger on September 19, 2023. We updated the pricing.",
  "image": "https://www.cultofmac.com/wp-content/uploads/2023/09/CoM-Charger-1.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-830820\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/daily-deals\" title=\"Daily deals\" aria-label=\"Daily deals articles\"\u003eDaily deals\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"Price drop: This 3-in-1 charger is perfect for Apple fans on the road\" src=\"https://www.cultofmac.com/wp-content/uploads/2023/09/CoM-Charger-1-1536x1024.jpeg\" alt=\"Get the 3-in-1 charger that doubles as a phone stand for under $33.\" data-ratio=\"1.5\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\tPower up to 3 devices wirelessly with this foldable $32.99 charger. \u003cbr/\u003e\u003cem\u003ePhoto: Cult of Mac Deals \u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003eEvery time you leave your desk, the battery clock starts ticking. Which of your Apple devices will need to recharge first? Luckily, you can recharge three at once with this 3-in-1 Magnetic Wireless Charging Pad.\u003c/p\u003e\n\u003cp\u003eIt looks a lot like \u003ca href=\"https://www.amazon.com/dp/B08MWR2NXZ/?tag=dd-cult087-20\" title=\"Buy from Amazon\" rel=\"sponsored\" target=\"_blank\"\u003eApple’s MagSafe Duo\u003c/a\u003e, but it can handle three devices, not just two, which makes it an even more convenient travel charger. Plus, it costs a fraction of what Apple’s charger does. And now it’s \u003cem\u003eeven cheaper\u003c/em\u003e, thanks to a limited-time deal that \u003ca href=\"https://deals.cultofmac.com/sales/3-in-1-magnetic-wireless-charging-pad-white?utm_source=cultofmac.com\u0026amp;utm_medium=referral\u0026amp;utm_campaign=3-in-1-magnetic-wireless-charging-pad-white\u0026amp;utm_term=scsf-579300\u0026amp;utm_content=a0xRn0000000d7pIAA\u0026amp;scsonar=1\" rel=\"noopener\" data-lasso-id=\"1641353336\" target=\"_blank\"\u003edrops the price to just $26.97\u003c/a\u003e (regularly $69.99).\u003c/p\u003e\u003cspan data-ez-ph-id=\"909\"\u003e\u003c/span\u003e\n\u003cp\u003eThis post contains \u003ca href=\"https://www.cultofmac.com/cult-of-mac-reviews-policy/\" target=\"_blank\"\u003eaffiliate links\u003c/a\u003e. \u003cem\u003eCult of Mac\u003c/em\u003e may earn a commission when you use our links to buy items.\u003c/p\u003e\n\n\u003ch2\u003eA foldable charging station for your Apple gear\u003c/h2\u003e\n\u003cp\u003eThe design makes all the difference with this unique charging 3-in-1 charger. When folded up, it measures just over 3 square inches. So it’s small enough to stow in your pants pocket, backpack or purse. Fold out the three connected tiles, and you have a versatile power solution that can be laid out flat or configured to meet your needs.\u003c/p\u003e\n\u003cp\u003eTurn it into a triangle, and you’ve got a phone stand that lets you watch movies, play games or make video calls, juicing up your battery all the while.\u003c/p\u003e\n\u003cp\u003eBetter yet, you can charge up to three devices at the same time, as long as you connect it to a powerful enough wall charger. (Ugreen makes an \u003ca href=\"https://www.amazon.com/dp/B09X1H88VP/?tag=dd-cult087-20\" title=\"Buy from Amazon\" rel=\"sponsored\" target=\"_blank\"\u003eaffordable one for international\u003c/a\u003e travel, and Anker makes a \u003ca href=\"https://www.amazon.com/stores/page/9ED21883-64E3-4C34-83C9-0780BF624AA7\" data-lasso-id=\"1641353339\" target=\"_blank\"\u003ewide range of excellent USB-C chargers\u003c/a\u003e.)\u003c/p\u003e\n\u003cp\u003eThis folding 3-in-1 charger can accommodate iPhones and wireless-charging AirPods cases. Plus, one tile comes with a flip-up bit that makes it the perfect spot for your \u003ca href=\"https://www.cultofmac.com/apple-watch\" rel=\"noopener\" data-lasso-id=\"1641353340\"\u003eApple Watch\u003c/a\u003e. Smartphones can charge at an impressive 15W, while a smart chip guards against overheating.\u003c/p\u003e\n\u003cp\u003eMeanwhile, the MagSafe-like magnetic pad ensures your iPhone stays put no matter what configuration your charger is in. The silicone material is soft and easy on your gear, but durable enough to withstand the rigors of travel and other movement.\u003c/p\u003e\u003cspan data-ez-ph-id=\"912\"\u003e\u003c/span\u003e\n\u003ch3\u003eA great 3-in-1 travel charger makes packing and productivity easier\u003c/h3\u003e\n\u003cp\u003eForgetful packers may benefit from the all-in-one nature of this wireless charging pad, as they won’t need to remember all the cords and wall adapters for their Apple devices. Plus, this streamlined 3-in-1 charger reduces cable clutter. And it comes in two colors: white and black.\u003c/p\u003e\n\u003cp\u003eGet the \u003ca href=\"https://deals.cultofmac.com/sales/3-in-1-magnetic-wireless-charging-pad-white?utm_source=cultofmac.com\u0026amp;utm_medium=referral\u0026amp;utm_campaign=3-in-1-magnetic-wireless-charging-pad-white\u0026amp;utm_term=scsf-579300\u0026amp;utm_content=a0xRn0000000d7pIAA\u0026amp;scsonar=1\" rel=\"noopener\" data-lasso-id=\"1641353341\" target=\"_blank\"\u003e3-in-1 Magnetic Wireless Charging Pad\u003c/a\u003e for just $26.97 for a limited time.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBuy from:\u003c/strong\u003e \u003ca href=\"https://deals.cultofmac.com/sales/3-in-1-magnetic-wireless-charging-pad-white?utm_source=cultofmac.com\u0026amp;utm_medium=referral\u0026amp;utm_campaign=3-in-1-magnetic-wireless-charging-pad-white\u0026amp;utm_term=scsf-579300\u0026amp;utm_content=a0xRn0000000d7pIAA\u0026amp;scsonar=1\" data-lasso-id=\"1641353342\" target=\"_blank\"\u003eCult of Mac Deals\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePrices subject to change. All sales handled by StackCommerce, our partner who runs \u003ca href=\"https://deals.cultofmac.com/\" data-lasso-id=\"1641353343\" target=\"_blank\"\u003eCult of Mac Deals\u003c/a\u003e. For customer support, please \u003ca href=\"https://www.cultofmac.com/cdn-cgi/l/email-protection#780b0d0808170a0c380b0c191b131b1715151d0a1b1d561b1715\"\u003eemail StackCommerce directly\u003c/a\u003e. We originally published this post on the 3-in-1 charger on September 19, 2023. We updated the pricing.\u003c/em\u003e        \u003c/p\u003e\u003cspan data-ez-ph-id=\"913\"\u003e\u003c/span\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-08T21:45:15Z",
  "modifiedTime": "2024-11-08T23:14:34Z"
}
