{
  "id": "e178fc91-3d8d-401a-aff1-6df2c99b3d18",
  "title": "PlayStation DualSense controllers updating soon with multiple device pairing",
  "link": "https://appleinsider.com/articles/25/07/23/playstation-dualsense-controllers-updating-soon-with-multiple-device-pairing?utm_source=rss",
  "description": "Apple has long partnered with Sony to sell its PlayStation controllers, which can pair with Apple devices, and they're getting a big quality-of-life update later in 2025 — multiple device pairing.DualSense controller getting multi-device pairingThe PlayStation DualSense and DualSense Edge are premium controllers that match up great with Apple's premium hardware. Apple sells the white model in its online store and promotes it regularly when discussing gaming on its platforms.PlayStation announced that a long-awaited update to the DualSense controllers will be coming later in the year that adds a multiple device pairing option. It will work by enabling users to switch between devices on the fly without having to pair and re-pair every time. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "",
  "published": "Wed, 23 Jul 2025 21:24:27 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "Wesley Hilliard",
  "length": 2691,
  "excerpt": "Apple has long partnered with Sony to sell its PlayStation controllers, which can pair with Apple devices, and they're getting a big quality-of-life update later in 2025 — multiple device pairing.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v11/icon-512.png",
  "text": "Wed Jul 23 2025, 05:24 PM EDT · 1 minute read DualSense controller getting multi-device pairing Apple has long partnered with Sony to sell its PlayStation controllers, which can pair with Apple devices, and they're getting a big quality-of-life update later in 2025 — multiple device pairing. The PlayStation DualSense and DualSense Edge are premium controllers that match up great with Apple's premium hardware. Apple sells the white model in its online store and promotes it regularly when discussing gaming on its platforms. PlayStation announced that a long-awaited update to the DualSense controllers will be coming later in the year that adds a multiple device pairing option. It will work by enabling users to switch between devices on the fly without having to pair and re-pair every time. Currently, users have to hold down the share and PS buttons to enter pairing mode, then navigate to whatever settings menu the user's device has to pair. It's not always the easiest process and can be frustrating if the controller doesn't show up in the Bluetooth menu. The new method will let users pair the controller and instantly switch between four devices. It works by pressing the PS button and one of the face buttons (Triangle, Circle, Cross, and Square) to switch between devices. I frequently use a DualSense Edge across multiple products, so the feature will be very useful. Switch between an Apple Vision Pro, iPad Pro, PlayStation 5, and a Mac with a simple button press. The controller will indicate when it is pairing with which configuration using indicator lights. One light for Triangle, two for Circle, three for Cross, and four for Square. Sony didn't give an exact timeline for this feature release, but beta testing begins on July 24. These betas can last a few weeks, so late August or early September is possible. There isn't any word on whether the feature will come to the PSVR2 Sense controllers. These can now pair to Apple Vision Pro in visionOS 26, so having the ability to easily swap between PlayStation and Vision Pro would be a nice bonus. Once the feature is available, update the controller via a PlayStation console and multi-device switching will be enabled. It enhances an already great controller with a much-needed upgrade that other controller makers will hopefully emulate.",
  "image": "https://photos5.appleinsider.com/gallery/64468-134327-iPad-mini-controller-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-block\"\u003e\n        \u003cmain\u003e\n            \u003carticle id=\"post\"\u003e\n                \u003cheader\u003e\n                    \n                    \n                    \u003cdiv\u003e\n                        \u003cp\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/wesley+hilliard.jpg\" width=\"44\" height=\"44\" alt=\"Wesley Hilliard\u0026#39;s profile picture\"/\u003e\n                        \u003c/p\u003e\n                        \u003cp\u003e\n                            \u003ctime datetime=\"\"\u003eWed Jul 23 2025, 05:24 PM EDT\u003c/time\u003e\n                            ·\n                            \u003cspan\u003e1 minute read\u003c/span\u003e\n                        \u003c/p\u003e\n                    \u003c/div\u003e\n                    \u003cdiv\u003e\n                        \u003cp\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/64468-134327-iPad-mini-controller-xl.jpg\" alt=\"\"/\u003e\u003c/p\u003e\u003cp title=\"DualSense controller getting multi-device pairing\"\u003eDualSense controller getting multi-device pairing\u003c/p\u003e\n                                            \n                                                                                                            \n                                    \u003c/div\u003e\u003c/header\u003e\n                \u003cdiv\u003e\n                    \u003cp\u003eApple has long partnered with Sony to sell its PlayStation controllers, which can pair with Apple devices, and they\u0026#39;re getting a big quality-of-life update later in 2025 —  multiple device pairing.\n\u003c/p\u003e\u003cp\u003eThe PlayStation DualSense and DualSense Edge are premium controllers that \u003ca href=\"https://appleinsider.com/articles/21/02/01/how-to-use-a-playstation-5-dualsense-controller-with-iphone-and-ipad\"\u003ematch up great\u003c/a\u003e with Apple\u0026#39;s premium hardware. Apple sells the white model in its online store and promotes it regularly when discussing gaming on its platforms.\n\u003c/p\u003e\u003cp\u003ePlayStation \u003ca href=\"https://blog.playstation.com/2025/07/23/new-ps5-system-update-beta-previews-dualsense-wireless-controller-pairing-across-multiple-devices/\"\u003eannounced\u003c/a\u003e that a long-awaited update to the DualSense controllers will be coming later in the year that adds a multiple device pairing option. It will work by enabling users to switch between devices on the fly without having to pair and re-pair every time.\n\u003c/p\u003e\u003cp\u003eCurrently, users have to hold down the share and PS buttons to enter pairing mode, then navigate to whatever settings menu the user\u0026#39;s device has to pair. It\u0026#39;s not always the easiest process and can be frustrating if the controller doesn\u0026#39;t show up in the Bluetooth menu.\n\u003c/p\u003e\u003cp\u003eThe new method will let users pair the controller and instantly switch between four devices. It works by pressing the PS button and one of the face buttons (Triangle, Circle, Cross, and Square) to switch between devices.\n\u003c/p\u003e\u003cp\u003eI frequently use a DualSense Edge across multiple products, so the feature will be very useful. Switch between an \u003ca href=\"https://appleinsider.com/inside/apple-vision-pro\" title=\"Apple Vision Pro\" data-kpt=\"1\"\u003eApple Vision Pro\u003c/a\u003e, \u003ca href=\"https://appleinsider.com/inside/ipad-pro\" title=\"iPad Pro\" data-kpt=\"1\"\u003eiPad Pro\u003c/a\u003e, PlayStation 5, and a \u003ca href=\"https://appleinsider.com/inside/mac\" title=\"Mac\" data-kpt=\"1\"\u003eMac\u003c/a\u003e with a simple button press.\n\u003c/p\u003e\u003cp\u003eThe controller will indicate when it is pairing with which configuration using indicator lights. One light for Triangle, two for Circle, three for Cross, and four for Square.\n\u003c/p\u003e\u003cp\u003eSony didn\u0026#39;t give an exact timeline for this feature release, but beta testing begins on July 24. These betas can last a few weeks, so late August or early September is possible.\n\u003c/p\u003e\u003cp\u003eThere isn\u0026#39;t any word on whether the feature will come to the PSVR2 Sense controllers. These can \u003ca href=\"https://appleinsider.com/articles/25/06/12/how-psvr2-sense-controllers-work-on-apple-vision-pro\"\u003enow pair\u003c/a\u003e to Apple Vision Pro in \u003ca href=\"https://appleinsider.com/inside/visionos-26\" title=\"visionOS 26\" data-kpt=\"1\"\u003evisionOS 26\u003c/a\u003e, so having the ability to easily swap between PlayStation and Vision Pro would be a nice bonus.\n\u003c/p\u003e\u003cp\u003eOnce the feature is available, update the controller via a PlayStation console and multi-device switching will be enabled. It enhances an already great controller with a much-needed upgrade that other controller makers will hopefully emulate.\u003c/p\u003e\n\n                \u003c/div\u003e\n\n                \n            \u003c/article\u003e\n        \u003c/main\u003e\n        \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-23T21:24:27Z",
  "modifiedTime": null
}
