{
  "id": "ed3475b9-a7ca-413b-ad5c-55e1cd53aef8",
  "title": "iPadOS 26: Testing the new local capture for podcasting",
  "link": "https://9to5mac.com/2025/06/22/ipados-26-testing-the-new-local-capture-for-podcasting/",
  "description": "If you’re a creator or podcaster, I’ll bet your ears perked up towards the end of the WWDC25 keynote, when Apple announced that built-in local audio and video capture during calls would be coming to iPadOS 26. And while I have tried (and repeatedly failed) to fit the iPad in my podcasting workflow, I knew Jason Snell would be one of the first to take the feature for a spin. And he did just that. more…",
  "author": "Marcus Mendes",
  "published": "Sun, 22 Jun 2025 16:30:00 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Marcus Mendes",
  "length": 3220,
  "excerpt": "If you’re podcaster, I’ll bet your ears perked up when Apple announced local capture for iPadOS 26. Jason Snell already tested it out.",
  "siteName": "9to5Mac",
  "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=192",
  "text": "If you’re a creator or podcaster, I’ll bet your ears perked up towards the end of the WWDC25 keynote, when Apple announced that built-in local audio and video capture during calls would be coming to iPadOS 26. And while I have tried (and repeatedly failed) to fit the iPad in my podcasting workflow, I knew Jason Snell would be one of the first to take the feature for a spin. And he did just that. Currently on iOS and iPadOS, once you’re on a call, you can’t run a second app in the background to capture local audio. This all but rules out using iPhones and iPads for remote podcasting. That’s because aside from jumping on a regular call, each participant records their own end of the conversation locally so that all the tracks are full quality when it’s time to edit. So on the iPhone and the iPad, you either recorded your own voice, or you made a conference call. With iOS 26 and iPadOS 26, you’ll be able to do both. Sort of. More on this later. It just works Knowing Jason Snell, who famously edited podcasts on Ferrite, on his iPad, for years (which he’s thoroughly documented in the podcasting section on Six Colors), I knew it would be just a matter of days until he’d take the much, much anticipated iPad local media capture for a spin. And he did. In fact, he recorded an entire podcast episode of the Six Colors Podcast with Dan Moren (who joined in remotely) using nothing but iPads, running the first iPadOS 26 developer beta, and… it just worked. If you want to hear the result for yourself, Snell made this particular members-only episode publicly available over at his post. You wouldn’t know the entire thing was recorded on the iPad, which is precisely the point. System-level capture, but with guardrails So, as I said, Apple will “sort of” allow you to do both: record your own voice, and join a conference call. What I mean by that is that rather than fully unlocking simultaneous mic access for multiple apps (like in the Mac), Apple is taking a more measured and privacy-centered approach, to avoid abuse. Here’s Snell: Instead, Apple has just built in a system feature, found in Control Center, that will capture local audio and video when you’re on a call. It doesn’t work when another app is not currently using the microphone and camera, so it can’t be set to surreptitiously record stuff, and it displays a recording symbol at the top of the screen when it’s running. Early verdict: surprisingly polished (with room for tweaks) For a first-developer-beta feature, the implementation is already impressively stable. Snell notes a couple of missing niceties (like real-time audio level monitoring and gain adjustment controls for different mics), but those are the kind of things Apple could still refine before the public release. Make sure to check out Snell’s full write-up at Six Colors for all the technical details and early impressions. If Apple keeps refining this feature, I might finally be able to take just my iPad on trips, and finally give my satchel-weary MacBook Pro–carrying shoulders a well-deserved break. Add 9to5Mac to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-fi.jpg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"800\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-fi.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-fi.jpg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-fi.jpg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-fi.jpg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-fi.jpg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/figure\u003e\n\n\u003cp\u003eIf you’re a creator or podcaster, I’ll bet your ears perked up towards the end of the WWDC25 keynote, when Apple announced that built-in local audio and video capture during calls would be coming to iPadOS 26.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd while I have tried (and repeatedly failed) to fit the iPad in my podcasting workflow, I knew Jason Snell would be one of the first to take the feature for a spin. \u003ca href=\"https://sixcolors.com/post/2025/06/a-few-notes-on-ipados-26-audio-and-video-capture/\"\u003eAnd he did just that\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eCurrently on iOS and iPadOS, once you’re on a call, you can’t run a second app in the background to capture local audio. This all but rules out using iPhones and iPads for remote podcasting.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s because aside from jumping on a regular call, each participant records their own end of the conversation locally so that all the tracks are full quality when it’s time to edit. So on the iPhone and the iPad, you either recorded your own voice, or you made a conference call. With iOS 26 and iPadOS 26, you’ll be able to do both. Sort of. More on this later.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" height=\"564\" width=\"1024\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-ipad.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1024\" alt=\"\" srcset=\"https://9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-ipad.jpg 1816w, https://9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-ipad.jpg?resize=155,85 155w, https://9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-ipad.jpg?resize=655,361 655w, https://9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-ipad.jpg?resize=768,423 768w, https://9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-ipad.jpg?resize=1024,564 1024w, https://9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-ipad.jpg?resize=1536,846 1536w, https://9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-ipad.jpg?resize=350,193 350w, https://9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-ipad.jpg?resize=140,77 140w, https://9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-ipad.jpg?resize=1600,881 1600w, https://9to5mac.com/wp-content/uploads/sites/6/2025/06/local-capture-ipad.jpg?resize=150,83 150w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-it-just-works\"\u003eIt just works\u003c/h2\u003e\n\n\n\n\u003cp\u003eKnowing Jason Snell, who famously edited podcasts on \u003ca href=\"https://apps.apple.com/br/app/ferrite-recording-studio/id1018780185\"\u003eFerrite\u003c/a\u003e, on his iPad, for years (which he’s thoroughly documented in the \u003ca href=\"https://sixcolors.com/tag/podcasting/\"\u003epodcasting\u003c/a\u003e section on \u003ca href=\"https://sixcolors.com/\"\u003e\u003cem\u003eSix Colors\u003c/em\u003e\u003c/a\u003e), I knew it would be just a matter of days until he’d take the much, much anticipated iPad local media capture for a spin.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd he did.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn fact, he recorded an entire podcast episode of the \u003ca href=\"https://sixcolors.com/member-podcast/2025/06/ipad-podcasting-and-glassy-design/\"\u003e\u003cem\u003eSix Colors Podcast\u003c/em\u003e\u003c/a\u003e with Dan Moren (who joined in remotely) using nothing but iPads, running the first iPadOS 26 developer beta, and… it just worked.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you want to hear the result for yourself, Snell made this particular members-only episode publicly available over at \u003ca href=\"https://sixcolors.com/post/2025/06/a-few-notes-on-ipados-26-audio-and-video-capture/\"\u003ehis post\u003c/a\u003e. You wouldn’t know the entire thing was recorded on the iPad, which is precisely the point.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-system-level-capture-but-with-guardrails\"\u003eSystem-level capture, but with guardrails\u003c/h2\u003e\n\n\n\n\u003cp\u003eSo, as I said, Apple will “sort of” allow you to do both: record your own voice, and join a conference call. What I mean by that is that rather than fully unlocking simultaneous mic access for multiple apps (like in the Mac), Apple is taking a more measured and privacy-centered approach, to avoid abuse.\u003c/p\u003e\n\n\n\n\u003cp\u003eHere’s Snell:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eInstead, Apple has just built in a system feature, found in Control Center, that will capture local audio and video when you’re on a call. It doesn’t work when another app is not currently using the microphone and camera, so it can’t be set to surreptitiously record stuff, and it displays a recording symbol at the top of the screen when it’s running.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003ch2 id=\"h-early-verdict-surprisingly-polished-with-room-for-tweaks\"\u003eEarly verdict: surprisingly polished (with room for tweaks)\u003c/h2\u003e\n\n\n\n\u003cp\u003eFor a first-developer-beta feature, the implementation is already impressively stable.\u003c/p\u003e\n\n\n\n\u003cp\u003eSnell notes a couple of missing niceties (like real-time audio level monitoring and gain adjustment controls for different mics), but those are the kind of things Apple could still refine before the public release.\u003c/p\u003e\n\n\n\n\u003cp\u003eMake sure to check out \u003ca href=\"https://sixcolors.com/post/2025/06/a-few-notes-on-ipados-26-audio-and-video-capture/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSnell’s full write-up at \u003cem\u003eSix Colors\u003c/em\u003e\u003c/a\u003e for all the technical details and early impressions. If Apple keeps refining this feature, I might finally be able to take just my iPad on trips, and finally give my satchel-weary MacBook Pro–carrying shoulders a well-deserved break.\u003c/p\u003e\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Mac to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-22T16:30:00Z",
  "modifiedTime": null
}
