{
  "id": "f0fe854b-a0ab-45b1-8fba-0ed0e0198f64",
  "title": "Mercury Weather can now provide notifications for rain and snow",
  "link": "https://9to5mac.com/2024/11/06/mercury-weather-notifications-rain-snow/",
  "description": "Mercury Weather is a cool indie app that works as an alternative to Apple’s Weather app. Following an update in August that added new features to the app, there’s now another update available – and this one provides notifications about weather conditions. more…",
  "author": "Filipe Espósito",
  "published": "Wed, 06 Nov 2024 23:11:38 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Filipe Espósito",
  "length": 2181,
  "excerpt": "Mercury Weather is a cool indie app that works as an alternative to Apple’s Weather app. Following an update in...",
  "siteName": "9to5Mac",
  "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=192",
  "text": "Mercury Weather is a cool indie app that works as an alternative to Apple’s Weather app. Following an update in August that added new features to the app, there’s now another update available – and this one provides notifications about weather conditions. Here’s what’s new in Mercury Weather Users can opt to receive precise notifications about rain and snow, as well as alerts for severe weather conditions. The app can also send follow-up notifications if the precipitation forecast changes or with estimates of whether it will be a short shower or rain for the rest of the day. In addition, version 2.8 of the app also adds a new large detailed widget that shows current conditions, rainfall, as well as hourly and daily forecasts. For those unfamiliar, Mercury Weather has a unique design, as well as cool features like an option to let users choose between different weather data providers – including Apple Weather, OpenWeather and Foreca. The app also comes with multiple widgets for the Home and Lock Screen. Another important detail is that the app is available for iPhone, iPad, Mac, Apple Watch, and Apple Vision Pro. Mercury Weather was developed by the same team behind Orbit, an app that helps people manage freelance work, calculate working hours, and generate invoices. You can download Mercury Weather for free on the App Store. However, some features such as adding multiple locations require a subscription which starts at $2.99 per month. There are also lifetime licenses available for individuals and families. Read also Indie App Spotlight: ‘Time2Pack’ is an app for all your travel needs Gentler Streak adds new sleep insights with its latest update Indie App Spotlight: ‘Access’ is the missing piece to Apple’s new Passwords app Blackmagic Camera for iPhone now works with Camera Control Perplexity AI native app for macOS now available on the Mac App Store CAE showcases new pilot training solution for Apple Vision Pro Snapchat camera will be available from the iPhone Lock Screen, but no filters Add 9to5Mac to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/11/mercury-weather.jpg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"800\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2024/11/mercury-weather.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"Mercury Weather can now provide notifications for rain and snow\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/11/mercury-weather.jpg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/11/mercury-weather.jpg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/11/mercury-weather.jpg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/11/mercury-weather.jpg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/figure\u003e\n\n\u003cp\u003eMercury Weather is a cool indie app that works as an alternative to Apple’s Weather app. \u003ca href=\"https://9to5mac.com/2024/08/07/mercury-weather-update-widget/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFollowing an update in August that added new features to the app\u003c/a\u003e, there’s now another update available – and this one provides notifications about weather conditions.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-here-s-what-s-new-in-mercury-weather\"\u003eHere’s what’s new in Mercury Weather\u003c/h2\u003e\n\n\n\n\u003cp\u003eUsers can opt to receive precise notifications about rain and snow, as well as alerts for severe weather conditions. The app can also send follow-up notifications if the precipitation forecast changes or with estimates of whether it will be a short shower or rain for the rest of the day.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn addition, version 2.8 of the app also adds a new large detailed widget that shows current conditions, rainfall, as well as hourly and daily forecasts.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor those unfamiliar, Mercury Weather has a unique design, as well as cool features like an option to let users choose between different weather data providers – including Apple Weather, OpenWeather and Foreca.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe app also comes with multiple widgets for the Home and Lock Screen. Another important detail is that the app is available for \u003ca href=\"https://amzn.to/3YBTDpR\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eiPhone\u003c/a\u003e, \u003ca href=\"https://amzn.to/4ezWgid\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eiPad\u003c/a\u003e, \u003ca href=\"https://amzn.to/3NUD1EW\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMac\u003c/a\u003e, \u003ca href=\"https://amzn.to/4fvhQ8R\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eApple Watch\u003c/a\u003e, and \u003ca href=\"https://amzn.to/4fBAg7u\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eApple Vision Pro\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eMercury Weather was developed by the same team behind \u003ca href=\"https://9to5mac.com/2021/05/11/smart-invoices-orbit-app-updated-with-apple-watch-version-for-the-first-time/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eOrbit\u003c/a\u003e, an app that helps people manage freelance work, calculate working hours, and generate invoices.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can \u003ca href=\"https://apps.apple.com/app/id1621800675?platform=iphone\" target=\"_blank\" rel=\"noreferrer noopener\"\u003edownload Mercury Weather for free on the App Store\u003c/a\u003e. However, some features such as adding multiple locations require a subscription which starts at $2.99 per month. There are also lifetime licenses available for individuals and families.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-read-also\"\u003eRead also\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/11/02/indie-app-spotlight-time2pack/\"\u003eIndie App Spotlight: ‘Time2Pack’ is an app for all your travel needs\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/10/29/gentler-streak-sleep-insights/\"\u003eGentler Streak adds new sleep insights with its latest update\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/10/26/indie-app-spotlight-access/\"\u003eIndie App Spotlight: ‘Access’ is the missing piece to Apple’s new Passwords app\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/10/25/blackmagic-camera-iphone-camera-control/\"\u003eBlackmagic Camera for iPhone now works with Camera Control\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/10/24/perplexity-ai-app-macos-mac/\"\u003ePerplexity AI native app for macOS now available on the Mac App Store\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/10/22/cae-pilot-training-apple-vision-pro/\"\u003eCAE showcases new pilot training solution for Apple Vision Pro\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/10/24/snapchat-camera-will-be-available-from-the-iphone-lock-screen-but-no-filters/\"\u003eSnapchat camera will be available from the iPhone Lock Screen, but no filters\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Mac to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-06T23:11:38Z",
  "modifiedTime": "2024-11-06T23:11:39Z"
}
