{
  "id": "f167313f-ca3b-4ce6-8bc7-bafd2d04a7ee",
  "title": "Expect to see these 9 colors in iPhone Series 17 models",
  "link": "https://www.cultofmac.com/news/expect-to-see-these-9-colors-in-iphone-series-17-models",
  "description": "Recent leaks of color-matched camera rings from Asia reveal the nine colors in iPhone 17 models we should expect to see in September. (via Cult of Mac - Your source for the latest Apple news, rumors, analysis, reviews, how-tos and deals.)",
  "author": "David Snow",
  "published": "Fri, 11 Jul 2025 16:58:43 +0000",
  "source": "https://www.cultofmac.com/feed",
  "categories": [
    "News",
    "iPhone 17",
    "iPhone 17 Air",
    "iPhone 17 Pro Max"
  ],
  "byline": "David Snow",
  "length": 3546,
  "excerpt": "Recent leaks of color-matched camera rings from Asia reveal the nine colors in iPhone 17 models we should expect to see in September.",
  "siteName": "Cult of Mac",
  "favicon": "",
  "text": "News These camera ring protector rings always match the iPhone colors. Photo: [email protected] Apple’s upcoming iPhone 17 should offer a fresh take on color options, with new leaks suggesting five colors for the base iPhone 17 and four for the iPhone 17 Air model. The latest information comes from leaked images of third-party camera lens protector rings. They’re designed to match Apple’s official iPhone color offerings. The iPhone 17 series is expected to launch with design tweaks in September alongside Pro models, continuing Apple’s annual fall release tradition. So the standard iPhone 17 will likely be available in five colors — black, silver, blue, green and purple — according to leaker yeux1122 on Korean blog Naver. The addition of green and purple, also predicted by leaker Majin Bu recently, represents a notable shift from the current iPhone 16 lineup, which offers black, white, pink, teal and ultramarine options. iPhone 17: Purple and Green Colors in Testing as Potential New Shade for 2025 Full Article:https://t.co/jZJJoUHBsf pic.twitter.com/1in8R6dDa5 — Majin Bu (@MajinBuOfficial) June 20, 2025 This color refresh suggests Apple wants to move away from the pink and teal shades that have been popular in recent generations. So it replaces them with the more traditional green and purple options. Some reports recently said the green and purple colors in testing phases, with speculation that Apple might choose only one of the two. However, these latest leaks indicate both colors will make it to the final release. The core color palette maintains familiar options with black, silver and blue serving as the foundation, though the specific shade of blue may differ from previous generations. These changes align with Apple’s typical approach of refreshing color options annually to maintain consumer interest and distinguish new models from their predecessors. iPhone 17 Air’s 4 colors: Premium color scheme iPhone 17 Air colors air on the side of subtlety, similar to Pro models.Photo: [email protected] iPhone 17 Air, set to replace the iPhone 16 Plus in Apple’s lineup, will reportedly offer a more refined selection of four colors: black, silver, light gold and light blue. Yeux1122’s report matches what leaker Majin Bu predicted recently. This more limited and sophisticated color palette reflects Apple’s positioning of the iPhone 17 Air as a premium alternative with its distinctive ultra-thin design. In other words, a bit like a “Pro” model. The shift to more muted, Pro-style color options for the iPhone 17 Air makes strategic sense as Apple repositions this model as a premium offering rather than simply a larger version of the base model. The light gold and light blue options are described as particularly subtle, suggesting Apple is targeting users who prefer understated elegance over bold color statements. Leak reliability and missing Pro model details These color revelations provide insight into Apple’s 2025 strategy. But it’s worth noting leaker yeux1122 appears to have a mixed track record. They previously incorrectly predicted Apple’s 5G modem plans. However, the information aligns with earlier reports from other sources. That lends additional credibility. Notably absent from these leaks are color options for the iPhone 17 Pro and iPhone 17 Pro Max models. Previous rumors have suggested these premium models might include a sky blue option, though those reports come from sources with less reliable track records.",
  "image": "https://cdn.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-colors.jpeg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-906069\"\u003e\n\t\t\n        \t\t\u003csection\u003e\n\t\t  \u003cul\u003e\n\t\t    \u003cli\u003e\u003ca href=\"https://www.cultofmac.com/news\" title=\"News\" aria-label=\"News articles\"\u003eNews\u003c/a\u003e\u003c/li\u003e\n\t\t  \u003c/ul\u003e\n\t\t\u003c/section\u003e\n\n\t\t\n\t\u003cfigure\u003e\n\t\t\t\t\t\t\t\u003cimg title=\"Expect to see these 9 colors in iPhone Series 17 models\" src=\"https://cdn.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-colors.jpeg.webp\" srcset=\"https://cdn.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-colors-768x568.jpeg.webp 768w, https://cdn.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-colors.jpeg.webp 1440w, https://cdn.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-colors.jpeg.webp 1020w, https://cdn.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-colors.jpeg.webp 2040w\" sizes=\"(max-width: 768px) 768px, (max-width: 1020px) 1020px, 2040px\" alt=\"9 colors in iPhone Series 17 models\" data-ratio=\"1.3518796992481\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cfigcaption\u003e\n\t\t\t\t\t\t\tThese camera ring protector rings always match the iPhone colors. \u003cbr/\u003e\u003cem\u003ePhoto: \u003ca href=\"https://www.cultofmac.com/cdn-cgi/l/email-protection\" data-cfemail=\"f78e92828fc6c6c5c5b7b996819285d994989a\"\u003e[email protected]\u003c/a\u003e\u003c/em\u003e\n\t\t\t\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\t\u003c/figure\u003e\n\n\n\n\u003csection\u003e\n\n\t  \t\n\u003cp\u003eApple’s upcoming iPhone 17 should offer a fresh take on color options, with new leaks suggesting five colors for the base iPhone 17 and four for the iPhone 17 Air model. The latest information comes from leaked images of third-party camera lens protector rings. They’re designed to match Apple’s official iPhone color offerings.\u003c/p\u003e\n\n\n\u003cp\u003eThe iPhone 17 series is expected to \u003ca href=\"https://www.cultofmac.com/news/iphone-17-leak-teases-pro-exclusive-design-upgrades\" data-lasso-id=\"1641817716\"\u003elaunch with design tweaks in September\u003c/a\u003e alongside Pro models, continuing Apple’s annual fall release tradition. So the standard iPhone 17 will likely be available in five colors — black, silver, blue, green and purple — according to leaker \u003ca href=\"https://m.blog.naver.com/PostView.naver?blogId=yeux1122\u0026amp;logNo=223929496579\u0026amp;navType=by\" data-lasso-id=\"1641817717\" target=\"_blank\"\u003eyeux1122 on Korean blog Naver\u003c/a\u003e. The addition of green and purple, also \u003ca href=\"https://x.com/MajinBuOfficial/status/1936061526147776765\" data-lasso-id=\"1641817718\" target=\"_blank\"\u003epredicted by leaker Majin Bu\u003c/a\u003e recently, represents a notable shift from the current iPhone 16 lineup, which offers black, white, pink, teal and ultramarine options.\u003c/p\u003e\n\u003cblockquote data-width=\"550\" data-dnt=\"true\"\u003e\n\u003cp lang=\"en\" dir=\"ltr\"\u003eiPhone 17: Purple and Green Colors in Testing as Potential New Shade for 2025\u003c/p\u003e\n\u003cp\u003eFull Article:\u003ca href=\"https://t.co/jZJJoUHBsf\" target=\"_blank\"\u003ehttps://t.co/jZJJoUHBsf\u003c/a\u003e \u003ca href=\"https://t.co/1in8R6dDa5\" target=\"_blank\"\u003epic.twitter.com/1in8R6dDa5\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Majin Bu (@MajinBuOfficial) \u003ca href=\"https://twitter.com/MajinBuOfficial/status/1936061526147776765?ref_src=twsrc%5Etfw\" target=\"_blank\"\u003eJune 20, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\u003cp\u003eThis color refresh suggests Apple wants to move away from the pink and teal shades that have been popular in recent generations. So it replaces them with the more traditional green and purple options. Some reports recently said the green and purple colors in testing phases, with speculation that Apple might choose only one of the two. However, these latest leaks indicate both colors will make it to the final release.\u003c/p\u003e\n\u003cp\u003eThe core color palette maintains familiar options with black, silver and blue serving as the foundation, though the specific shade of blue may differ from previous generations. These changes align with Apple’s typical approach of refreshing color options annually to maintain consumer interest and distinguish new models from their predecessors.\u003c/p\u003e\n\u003ch3\u003eiPhone 17 Air’s 4 colors: Premium color scheme\u003c/h3\u003e\n\u003cfigure id=\"29\" aria-labelledby=\"figcaption_29\"\u003e\u003ca href=\"https://cdn.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-Air-colors.jpeg\" data-lasso-id=\"1641817719\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" title=\"IPhone 17 Air colors\" src=\"https://cdn.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-Air-colors.jpeg\" alt=\"iPhone 17 Air colors\" width=\"900\" height=\"671\" srcset=\"https://cdn.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-Air-colors.jpeg.webp 900w, https://cdn.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-Air-colors-400x298.jpeg 400w, https://cdn.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-Air-colors-350x261.jpeg 350w, https://cdn.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-Air-colors-768x573.jpeg.webp 768w, https://www.cultofmac.com/wp-content/uploads/2025/07/iPhone-17-Air-colors-400x298@2x.jpeg 800w\" sizes=\"(max-width: 900px) 100vw, 900px\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"figcaption_29\"\u003eiPhone 17 Air colors air on the side of subtlety, similar to Pro models.\u003cbr/\u003e\u003cspan\u003ePhoto: \u003ca href=\"https://www.cultofmac.com/cdn-cgi/l/email-protection\" data-cfemail=\"037a66767b32323131434d627566712d606c6e\"\u003e[email protected]\u003c/a\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u003ca href=\"https://www.cultofmac.com/news/iphone-17-air-may-trade-battery-life-for-a-thinner-profile\" data-lasso-id=\"1641817720\"\u003eiPhone 17 Air\u003c/a\u003e, set to replace the iPhone 16 Plus in Apple’s lineup, will reportedly offer a more refined selection of four colors: black, silver, light gold and light blue. Yeux1122’s report matches what leaker \u003ca href=\"https://majinbuofficial.com/iphone-17-air-could-be-available-in-4-new-color-options/\" data-lasso-id=\"1641817721\" target=\"_blank\"\u003eMajin Bu predicted recently\u003c/a\u003e. This more limited and sophisticated color palette reflects Apple’s positioning of the iPhone 17 Air as a premium alternative with its distinctive ultra-thin design. In other words, a bit like a “Pro” model.\u003c/p\u003e\n\u003cp\u003eThe shift to more muted, Pro-style color options for the iPhone 17 Air makes strategic sense as Apple repositions this model as a premium offering rather than simply a larger version of the base model. The light gold and light blue options are described as particularly subtle, suggesting Apple is targeting users who prefer understated elegance over bold color statements.\u003c/p\u003e\n\u003ch3\u003eLeak reliability and missing Pro model details\u003c/h3\u003e\n\u003cp\u003eThese color revelations provide insight into Apple’s 2025 strategy. But it’s worth noting leaker yeux1122 appears to have a mixed track record. They previously incorrectly predicted Apple’s 5G modem plans. However, the information aligns with earlier reports from other sources. That lends additional credibility.\u003c/p\u003e\n\u003cp\u003eNotably absent from these leaks are color options for the iPhone 17 Pro and iPhone 17 Pro Max models. Previous rumors have suggested these premium models might include \u003ca href=\"https://majinbuofficial.com/the-new-iphone-17-pro-color/\" data-lasso-id=\"1641817722\" target=\"_blank\"\u003ea sky blue option\u003c/a\u003e, though those reports come from sources with less reliable track records.        \u003c/p\u003e\n\n\t  \t\t  \u003c/section\u003e\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-07-11T16:58:43Z",
  "modifiedTime": "2025-07-11T19:11:38Z"
}
