{
  "id": "f521454f-15ef-4eed-b3fe-4751715a3076",
  "title": "Report corroborates on Samsung making Galaxy S25 ‘Slim’ to compete with iPhone Air",
  "link": "https://9to5mac.com/2024/11/15/samsung-s25-slim-iphone-air/",
  "description": "Recent rumors have strongly suggested that Apple is working on an ultra-slim version of the iPhone for next year that could be called the “iPhone 17 Slim” or even the “iPhone 17 Air”. While we are almost a year away from this product, it seems that Samsung is pushing ahead with its plans to launch a Galaxy S25 “Slim.” more…",
  "author": "Filipe Espósito",
  "published": "Sat, 16 Nov 2024 00:39:08 +0000",
  "source": "https://9to5mac.com/feed",
  "categories": [
    "News"
  ],
  "byline": "Filipe Espósito",
  "length": 2391,
  "excerpt": "Recent rumors have strongly suggested that Apple is working on an ultra-slim version of the iPhone for next year that...",
  "siteName": "9to5Mac",
  "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=192",
  "text": "Recent rumors have strongly suggested that Apple is working on an ultra-slim version of the iPhone for next year that could be called the “iPhone 17 Slim” or even the “iPhone 17 Air”. While we are almost a year away from this product, it seems that Samsung is pushing ahead with its plans to launch a Galaxy S25 “Slim.” SmartPrix has obtained details of SM-S937, a mysterious variant of Samsung’s Galaxy S25. The website explains that the model numbers of the successors to the Galaxy S24, S24+ and S24 Ultra had already been leaked, and the fourth identifier suggests that the lineup will gain another version in addition to the three existing versions. A report last month revealed that Samsung is building a “Slim” version of the Galaxy S25 that will be launched next year along with the other phones in the S25 series. It’s still unclear how much thinner this new Galaxy phone will be, but it seems that Samsung wants to get ahead of Apple in the race for the thinnest smartphone of 2025. According to multiple sources, Apple is expected to replace the “Plus” variant of the iPhone with this super slim version next year. The device is rumored to have a single rear camera and a smaller cut-out for the front camera and sensors behind the Dynamic Island. The so-called iPhone 17 Air would be promoted as a version between the regular iPhone 17 and the iPhone 17 Pro. The iPhone 17 Air should also be one of the first iPhone models to feature Apple’s new custom 5G modem, along with the iPhone SE 4. However, a recent report suggested that Apple is facing difficulties in making a super slim design, and it may not be as thin as initially expected. As of right now, the iPhone 17 lineup is expected to be announced and released in September of 2025. As always, this timeline can shift based on production and supply chain issues. It’s also important to remember that because we’re still months away from the announcement of the iPhone 17 lineup, it’s possible that Apple’s plans change. Read also iPhone roadmap is ‘most ambitious in the product’s history,’ per John Ternus Report: Apple may have found its supplier for the thin iPhone 17 Air display iPhone 17 Air won’t be the best iPhone, but it will be the future Best deals on iPhones Add 9to5Mac to your Google News feed.  FTC: We use income earning auto affiliate links. More.",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/10/iphone-17-air-clouds.jpg?resize=1200%2C628\u0026quality=82\u0026strip=all\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\n\u003cfigure\u003e\n\t\u003cimg width=\"1600\" height=\"800\" src=\"https://9to5mac.com/wp-content/uploads/sites/6/2024/10/iphone-17-air-clouds.jpg?quality=82\u0026amp;strip=all\u0026amp;w=1600\" alt=\"iPhone 17 Air\" srcset=\"https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/10/iphone-17-air-clouds.jpg?w=320\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 320w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/10/iphone-17-air-clouds.jpg?w=640\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 640w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/10/iphone-17-air-clouds.jpg?w=1024\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1024w, https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/10/iphone-17-air-clouds.jpg?w=1500\u0026amp;quality=82\u0026amp;strip=all\u0026amp;ssl=1 1500w\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/figure\u003e\n\n\u003cp\u003eRecent rumors have strongly suggested that Apple is working on an \u003ca href=\"https://9to5mac.com/2024/11/08/iphone-17-air-features-price-release-date/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eultra-slim version of the iPhone\u003c/a\u003e for next year that could be called the “iPhone 17 Slim” or even the “iPhone 17 Air”. While we are almost a year away from this product, it seems that Samsung is pushing ahead with its plans to launch a Galaxy S25 “Slim.”\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.smartprix.com/bytes/samsungs-mysterious-galaxy-s25-slim-smartphone-officially-spotted-for-first-time/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eSmartPrix\u003c/em\u003e\u003c/a\u003e has obtained details of SM-S937, a mysterious variant of Samsung’s Galaxy S25. The website explains that the model numbers of the successors to the \u003ca href=\"https://amzn.to/4fl8T1D\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eGalaxy S24, S24+ and S24 Ultra\u003c/a\u003e had already been leaked, and the fourth identifier suggests that the lineup will gain another version in addition to the three existing versions.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://9to5google.com/2024/10/31/samsung-galaxy-s25-slim-report-iphone/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eA report last month\u003c/a\u003e revealed that Samsung is building a “Slim” version of the Galaxy S25 that will be launched next year along with the other phones in the S25 series. It’s still unclear how much thinner this new Galaxy phone will be, but it seems that Samsung wants to get ahead of Apple in the race for the thinnest smartphone of 2025.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to multiple sources, Apple is expected to replace the “Plus” variant of the iPhone with this super slim version next year. The device is rumored to have a single rear camera and a smaller cut-out for the front camera and sensors behind the Dynamic Island. The so-called iPhone 17 Air would be promoted as a version between the regular iPhone 17 and the iPhone 17 Pro.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe iPhone 17 Air should also be one of the first iPhone models to feature Apple’s new custom 5G modem, along with the iPhone SE 4. However, a recent report suggested that Apple is facing difficulties in making a super slim design, \u003ca href=\"https://9to5mac.com/2024/11/11/rumor-iphone-17-air-might-not-be-as-thin-as-apple-had-intially-hoped/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eand it may not be as thin as initially expected\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs of right now, the iPhone 17 lineup is expected to be announced and released in September of 2025. As always, this timeline can shift based on production and supply chain issues.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s also important to remember that because we’re still months away from the announcement of the iPhone 17 lineup, it’s possible that Apple’s plans change.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-read-also\"\u003eRead also\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/10/21/iphone-roadmap-is-most-ambitious-in-the-products-history-per-john-ternus/\"\u003eiPhone roadmap is ‘most ambitious in the product’s history,’ per John Ternus\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/10/04/report-apple-may-have-found-its-supplier-for-the-thin-iphone-17-air-display/\"\u003eReport: Apple may have found its supplier for the thin iPhone 17 Air display\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://9to5mac.com/2024/08/20/iphone-17-air-wont-be-the-best-iphone-but-it-will-be-the-future/\"\u003eiPhone 17 Air won’t be the best iPhone, but it will be the future\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amzn.to/3YJvm16\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBest deals on iPhones\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\t\u003cp\u003e\n\t\t\u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n\t\t\t\u003cem\u003eAdd 9to5Mac to your Google News feed.\u003c/em\u003e \n\t\t\t\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\u003cp\u003e\u003cem\u003eFTC: We use income earning auto affiliate links.\u003c/em\u003e \u003ca href=\"https://9to5mac.com/about/#affiliate\"\u003eMore.\u003c/a\u003e\u003c/p\u003e\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-16T00:39:08Z",
  "modifiedTime": "2024-11-16T00:39:10Z"
}
