{
  "id": "f5c376ac-4458-47cf-a268-68c3d1a26f29",
  "title": "Nimble Valet 3-in-1 Wireless Charger review: One charger for all your daily gear",
  "link": "https://appleinsider.com/articles/25/03/05/nimble-valet-3-in-1-wireless-charger-review-one-charger-for-all-your-daily-gear?utm_medium=rss",
  "description": "The Nimble Valet 3-in-1 charger adds a bit of upscale touch to your counter or nightstand while charging your daily gear at the fastest possible wireless speeds.Nimble Valet 3-in-1 Wireless Charger review: A unique, stylish, and eco-friendly way to charge We've tried our fair share of three-in-one chargers. While there are a lot of great ones, this model from Nimble adds additional functionality for users at a similar price point.What we found especially impressive, is that it manages to have fast charging, premium materials — like a walnut wood frame, is very eco-friendly, and yet it isn't priced any higher than other comparable chargers. Continue Reading on AppleInsider | Discuss on our Forums",
  "author": "Andrew O'Hara",
  "published": "Wed, 05 Mar 2025 00:13:06 +0000",
  "source": "https://appleinsider.com/rss/news/",
  "categories": null,
  "byline": "{{ author }} | {{ dateFormatted }}",
  "length": 5479,
  "excerpt": "The Nimble Valet 3-in-1 charger adds a bit of upscale touch to your counter or nightstand while charging your daily gear at the fastest possible wireless speeds.",
  "siteName": "AppleInsider",
  "favicon": "https://photos5.appleinsider.com/v10/images/favicon-ai-144.png",
  "text": "The Nimble Valet 3-in-1 charger adds a bit of upscale touch to your counter or nightstand while charging your daily gear at the fastest possible wireless speeds. We've tried our fair share of three-in-one chargers. While there are a lot of great ones, this model from Nimble adds additional functionality for users at a similar price point. What we found especially impressive, is that it manages to have fast charging, premium materials — like a walnut wood frame, is very eco-friendly, and yet it isn't priced any higher than other comparable chargers. Subscribe to AppleInsider on YouTubeSubscribe to AppleInsider on YouTubeNimble Valet 3-in-1 Wireless Charger review: DesignThe Nimble Valet 3-in-1 wireless charger starts unassuming enough. It has a dark walnut exterior with what looks like a leather top surface. But Nimble has always been focused on the environment. The leather is made from aloe cactus which is durable and eco-friendly. It feels very nice and many would probably be tricked into thinking it was real leather upon feeling it. Nimble Valet 3-in-1 Wireless Charger review: All the charging spots can fold flat, or flip upThere are a total of three chargers and the Qi2 pad and the Apple Watch puck are all outlined in brushed space grey metal. They're also both adjustable. The MagSafe-compatible Qi2 charger can lay flat, or raise up with adjustable angles. It can be a little hard to grip when flush, but the strength is needed to support various angles and heights. Nimble Valet 3-in-1 Wireless Charger review: The metal-encased Apple Watch puck rotates, depending on the band you useFor the Apple Watch puck, it too can lay flat or you can rotate it up. When pivoted up, it makes it easier for the watch to sit and can support Nightstand Mode. The entire bottom of the valet is covered in rubber, hiding the plastic shell on the inside. Nimble says the plastic they do use, is 100 percent PCR. There is a recessed hole in the bottom to route the charging cable, with two options available. The cable can go out the side or the back, depending on where you need to route it. Nimble Valet 3-in-1 Wireless Charger review: Charging performanceIncluded with the Nimble valet charger is a braided USB-C to USB-C cable, as well as a 36W power adapter. That's enough juice to charge all three chargers at maximum speed. Nimble Valet 3-in-1 Wireless Charger review: The Apple Watch puck supports fast charge on modern versions of Apple WatchFor Apple Watch, that means it supports fast charging. On Apple Watch Series 10, that's 80% charge in only 30 minutes. For Qi2, that is up to 15W of wireless power. Since that stand is adjustable, it can also go into StandBy mode while charging. Nimble Valet 3-in-1 Wireless Charger review: iPhone charging in StandBy modeYou can choose different widgets, a photo gallery, or just a bespoke clock. What you choose will depend on your uses and where you place it. For us, we use StandBy mode at night and on our desk. By our bedside, we have the clock and our blood sugar readout, while on our desk we like to view the calendar. Nimble Valet 3-in-1 Wireless Charger review: Building into your daily lifeWe've had a habit of trying to seek out smaller and more portable charges. Nimble went the opposite, instead opting to make something larger that has a larger purpose sitting on your counter. Nimble Valet 3-in-1 Wireless Charger review: Top down view of charging our iPhone, AirPods, and Apple WatchIt is only a few moments to swap out the tray we used to use in our kitchen for the Nimble valet instead. At the same time, we did opt for a different USB-C power supply, one that had an additional output that we could use to charge an iPad at the same time. Nimble Valet 3-in-1 Wireless Charger review: The valet has extra space for your wallet, cash, and moreThe Nimble tray isn't huge, but it's enough for us to fit a pair of sunglasses, our wallet, and our keys. Our daily accessories. It's so convenient to have a place to keep our items and our AirPods are always charged. Nimble Valet 3-in-1 Wireless Charger review: Should you buy it?Nimble has checked a lot of boxes with its 3-in-1 valet-style charger. Eco-friendly, fast charging, premium materials, elegant design, and wholly unique. There's quite literally nothing else like this on the market. We've seen valet chargers, but they don't have adjustable stands or use eco-friendly materials. We've seen adjustable stands and 3-in-1 chargers, but they aren't valets to hold your wallet and keys. And the only other walnut charger we've seen debuted back in 2019 Nimble Valet 3-in-1 Wireless Charger review: The body is made of a dark walnut woodAs an Apple Store exclusive, we probably shouldn't have expected less. If you want a perfect common space, desk, or nightstand charger to also house your valuables, Nimble has you covered. Nimble Valet 3-in-1 Wireless Charger review: ProsEco-friendly design through-and-through Elegant wood and cactus-leather build Charges three devices Certifications for Qi2 and fast charge Apple Watch puck Ample space for daily pocket accessories Charger and cable included Supports StandBy modeNimble Valet 3-in-1 Wireless Charger review: ConsMetal rim around Qi2 puck can be hard to grab No additional USB outputsNimble Valet 3-in-1 Wireless Charger rating: 5 out of 5 Nimble Valet 3-in-1 Wireless Charger: Where to buyPick up the Nimble Valley 3-in-1 wireless charger for $149.99 online, or your local Apple Store.",
  "image": "https://photos5.appleinsider.com/gallery/62644-129966-Charging-Three-Devices-on-Nimble-Valet-xl.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eThe Nimble Valet 3-in-1 charger adds a bit of upscale touch to your counter or nightstand while charging your daily gear at the fastest possible wireless speeds.\n\u003c/p\u003e\u003cp\u003eWe\u0026#39;ve tried our fair share of three-in-one chargers. While there are a lot of great ones, this model from Nimble adds additional functionality for users at a similar price point.\n\u003c/p\u003e\u003cp\u003eWhat we found especially impressive, is that it manages to have fast charging, premium materials —  like a walnut wood frame, is very eco-friendly, and yet it isn\u0026#39;t priced any higher than other comparable chargers.\n\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ciframe src=\"https://www.youtube.com/embed/6ghntLV8Gqs\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" loading=\"lazy\"\u003e\u003c/iframe\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.youtube.com/c/appleinsider?sub_confirmation=1\"\u003eSubscribe to AppleInsider on YouTube\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.youtube.com/c/appleinsider?sub_confirmation=1\"\u003eSubscribe to AppleInsider on YouTube\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003ch2 data-anchor=\"nimble-valet-3in1-wireless-charger-review-design\" id=\"nimble-valet-3in1-wireless-charger-review-design\"\u003eNimble Valet 3-in-1 Wireless Charger review: Design\u003c/h2\u003e\u003cp\u003eThe Nimble Valet 3-in-1 wireless charger starts unassuming enough. It has a dark walnut exterior with what looks like a leather top surface.\n\u003c/p\u003e\u003cp\u003eBut Nimble has always been focused on the environment. The leather is made from aloe cactus which is durable and eco-friendly.\n\u003c/p\u003e\u003cp\u003eIt feels very nice and many would probably be tricked into thinking it was real leather upon feeling it.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62644-129961-Nibmle-Valet-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62644-129961-Nibmle-Valet-xl.jpg\" alt=\"A wooden charging station with two charging pads on a white shelf against a red brick wall.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eNimble Valet 3-in-1 Wireless Charger review: All the charging spots can fold flat, or flip up\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThere are a total of three chargers and the Qi2 pad and the \u003ca href=\"https://appleinsider.com/inside/apple-watch\" title=\"Apple Watch\" data-kpt=\"1\"\u003eApple Watch\u003c/a\u003e puck are all outlined in brushed space grey metal. They\u0026#39;re also both adjustable.\n\u003c/p\u003e\u003cp\u003eThe \u003ca href=\"https://appleinsider.com/inside/magsafe\" title=\"MagSafe\" data-kpt=\"1\"\u003eMagSafe\u003c/a\u003e-compatible Qi2 charger can lay flat, or raise up with adjustable angles. It can be a little hard to grip when flush, but the strength is needed to support various angles and heights.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62644-129963-Apple-Watch-Puck-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62644-129963-Apple-Watch-Puck-xl.jpg\" alt=\"A close-up of a sleek black and wood wireless charging station with a circular charging pad and an adjustable magnetic mount.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eNimble Valet 3-in-1 Wireless Charger review: The metal-encased Apple Watch puck rotates, depending on the band you use\u003c/span\u003e\u003c/p\u003e\u003cp\u003eFor the Apple Watch puck, it too can lay flat or you can rotate it up. When pivoted up, it makes it easier for the watch to sit and can support Nightstand Mode.\n\u003c/p\u003e\u003cp\u003eThe entire bottom of the valet is covered in rubber, hiding the plastic shell on the inside. Nimble says the plastic they do use, is 100 percent PCR.\n\u003c/p\u003e\u003cp\u003eThere is a recessed hole in the bottom to route the charging cable, with two options available. The cable can go out the side or the back, depending on where you need to route it.\n\u003c/p\u003e\u003ch2 data-anchor=\"nimble-valet-3in1-wireless-charger-review-charging-performance\" id=\"nimble-valet-3in1-wireless-charger-review-charging-performance\"\u003eNimble Valet 3-in-1 Wireless Charger review: Charging performance\u003c/h2\u003e\u003cp\u003eIncluded with the Nimble valet charger is a braided USB-C to USB-C cable, as well as a 36W power adapter. That\u0026#39;s enough juice to charge all three chargers at maximum speed.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62644-129964-Apple-Watch-Charging-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62644-129964-Apple-Watch-Charging-xl.jpg\" alt=\"Smartwatch with an orange band displays time as 9:33 and date as Saturday 15 on a wooden surface.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eNimble Valet 3-in-1 Wireless Charger review: The Apple Watch puck supports fast charge on modern versions of Apple Watch\u003c/span\u003e\u003c/p\u003e\u003cp\u003eFor Apple Watch, that means it supports fast charging. On \u003ca href=\"https://appleinsider.com/inside/apple-watch-series-10\" title=\"Apple Watch Series 10\" data-kpt=\"1\"\u003eApple Watch Series 10\u003c/a\u003e, that\u0026#39;s 80% charge in only 30 minutes.\n\u003c/p\u003e\u003cp\u003eFor Qi2, that is up to 15W of wireless power. Since that stand is adjustable, it can also go into StandBy mode while charging.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62644-129967-iPhone-in-standby-mode-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62644-129967-iPhone-in-standby-mode-xl.jpg\" alt=\"Digital clock on stand displaying time, next to orange speaker, smartwatch with orange band, white earbuds case, and an orange item, all against a red brick background.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eNimble Valet 3-in-1 Wireless Charger review: iPhone charging in StandBy mode\u003c/span\u003e\u003c/p\u003e\u003cp\u003eYou can choose different widgets, a photo gallery, or just a bespoke clock. What you choose will depend on your uses and where you place it.\n\u003c/p\u003e\u003cp\u003eFor us, we use StandBy mode at night and on our desk. By our bedside, we have the clock and our blood sugar readout, while on our desk we like to view the calendar.\n\u003c/p\u003e\u003ch2 data-anchor=\"nimble-valet-3in1-wireless-charger-review-building-into-your-daily-life\" id=\"nimble-valet-3in1-wireless-charger-review-building-into-your-daily-life\"\u003eNimble Valet 3-in-1 Wireless Charger review: Building into your daily life\u003c/h2\u003e\u003cp\u003eWe\u0026#39;ve had a habit of trying to seek out smaller and more portable charges. Nimble went the opposite, instead opting to make something larger that has a larger purpose sitting on your counter.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62644-129965-Top-Down-Charging-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62644-129965-Top-Down-Charging-xl.jpg\" alt=\"A smartphone charging wirelessly on a pad, displaying 92% charge, next to wireless earbuds and an orange-banded smartwatch, with a smart speaker nearby.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eNimble Valet 3-in-1 Wireless Charger review: Top down view of charging our iPhone, AirPods, and Apple Watch\u003c/span\u003e\u003c/p\u003e\u003cp\u003eIt is only a few moments to swap out the tray we used to use in our kitchen for the Nimble valet instead. At the same time, we did opt for a different USB-C power supply, one that had an additional output that we could use to charge an \u003ca href=\"https://appleinsider.com/inside/ipad\" title=\"iPad\" data-kpt=\"1\"\u003eiPad\u003c/a\u003e at the same time.\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62644-129968-Accesories-on-valet-stand-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62644-129968-Accesories-on-valet-stand-xl.jpg\" alt=\"A charging station with an orange wallet, smartwatch, AirPods case, circular pad, and colorful pins, including \u0026#39;Hair Force One\u0026#39; text.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eNimble Valet 3-in-1 Wireless Charger review: The valet has extra space for your wallet, cash, and more\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThe Nimble tray isn\u0026#39;t huge, but it\u0026#39;s enough for us to fit a pair of sunglasses, our wallet, and our keys. Our daily accessories.\n\u003c/p\u003e\u003cp\u003eIt\u0026#39;s so convenient to have a place to keep our items and our \u003ca href=\"https://appleinsider.com/inside/airpods\" title=\"AirPods\" data-kpt=\"1\"\u003eAirPods\u003c/a\u003e are always charged.\n\u003c/p\u003e\u003ch2 data-anchor=\"nimble-valet-3in1-wireless-charger-review-should-you-buy-it\" id=\"nimble-valet-3in1-wireless-charger-review-should-you-buy-it\"\u003eNimble Valet 3-in-1 Wireless Charger review: Should you buy it?\u003c/h2\u003e\u003cp\u003eNimble has checked a lot of boxes with its 3-in-1 valet-style charger. Eco-friendly, fast charging, premium materials, elegant design, and wholly unique.\n\u003c/p\u003e\u003cp\u003eThere\u0026#39;s quite literally nothing else like this on the market. We\u0026#39;ve seen valet chargers, but they don\u0026#39;t have adjustable stands or use eco-friendly materials.\n\u003c/p\u003e\u003cp\u003eWe\u0026#39;ve seen adjustable stands and 3-in-1 chargers, but they aren\u0026#39;t valets to hold your wallet and keys. And the only other walnut charger we\u0026#39;ve seen \u003ca href=\"https://appleinsider.com/articles/19/03/20/hands-on-with-the-nicest-wireless-charger-weve-found-yet----nomad-walnut-base-station\"\u003edebuted back in 2019\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://photos5.appleinsider.com/gallery/62644-129962-Nimble-Logo-xl.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://photos5.appleinsider.com/gallery/62644-129962-Nimble-Logo-xl.jpg\" alt=\"Close-up of a wooden device corner on a white surface, featuring the logo \u0026#39;nimble\u0026#39; with a running figure. Background is blurred with pink and blue hues.\" height=\"738\" loading=\"lazy\"/\u003e\u003c/a\u003e\n\u003cspan\u003eNimble Valet 3-in-1 Wireless Charger review: The body is made of a dark walnut wood\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAs an Apple Store exclusive, we probably shouldn\u0026#39;t have expected less. If you want a perfect common space, desk, or nightstand charger to also house your valuables, Nimble has you covered.\n\u003c/p\u003e\u003ch2 data-anchor=\"nimble-valet-3in1-wireless-charger-review-pros\" id=\"nimble-valet-3in1-wireless-charger-review-pros\"\u003eNimble Valet 3-in-1 Wireless Charger review: Pros\u003c/h2\u003e\u003cul\u003e\u003cli\u003eEco-friendly design through-and-through\u003c/li\u003e\n\u003cli\u003eElegant wood and cactus-leather build\u003c/li\u003e\n\u003cli\u003eCharges three devices\u003c/li\u003e\n\u003cli\u003eCertifications for Qi2 and fast charge Apple Watch puck\u003c/li\u003e\n\u003cli\u003eAmple space for daily pocket accessories\u003c/li\u003e\n\u003cli\u003eCharger and cable included\u003c/li\u003e\n\u003cli\u003eSupports StandBy mode\u003c/li\u003e\u003c/ul\u003e\u003ch2 data-anchor=\"nimble-valet-3in1-wireless-charger-review-cons\" id=\"nimble-valet-3in1-wireless-charger-review-cons\"\u003eNimble Valet 3-in-1 Wireless Charger review: Cons\u003c/h2\u003e\u003cul\u003e\u003cli\u003eMetal rim around Qi2 puck can be hard to grab\u003c/li\u003e\n\u003cli\u003eNo additional USB outputs\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eNimble Valet 3-in-1 Wireless Charger rating: 5 out of 5\u003c/strong\u003e\n\u003c/p\u003e\u003ch2 data-anchor=\"nimble-valet-3in1-wireless-charger-where-to-buy\" id=\"nimble-valet-3in1-wireless-charger-where-to-buy\"\u003eNimble Valet 3-in-1 Wireless Charger: Where to buy\u003c/h2\u003e\u003cp\u003ePick up the Nimble Valley 3-in-1 wireless charger for \u003ca href=\"https://www.apple.com/shop/product/HRW52ZM/A/nimble-valet-3-in-1-wireless-charger\" rel=\"nofollow\" target=\"blank\"\u003e$149.99 online\u003c/a\u003e, or your local Apple Store.\u003c/p\u003e\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
