{
  "id": "165b5eee-f888-4770-bc3a-9a7864a3a2ae",
  "title": "#FASuccess Ep 434: Attracting HNW Clients By Focusing Not On Estate But Legacy Planning Instead, With Vanessa N. Martinez",
  "link": "https://feeds.feedblitz.com/~/917106902/0/kitcesnerdseyeview~FASuccess-Ep-Attracting-HNW-Clients-By-Focusing-Not-On-Estate-But-Legacy-Planning-Instead-With-Vanessa-N-Martinez/",
  "description": "Welcome everyone! Welcome to the 434th episode of the Financial Advisor Success Podcast! My guest on today's podcast is Vanessa N. Martinez. Vanessa is the CEO of Expressive Wealth, an RIA based in Chicago, Illinois, that oversees $135 million in assets under management for approximately 70 client households, including 10 'core' ultra-high-net-worth families. What's uniqueRead More... The post #FASuccess Ep 434: Attracting HNW Clients By Focusing Not On Estate But Legacy Planning Instead, With Vanessa N. Martinez first appeared on Kitces.com.",
  "author": "Michael Kitces",
  "published": "Tue, 22 Apr 2025 11:02:50 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Financial Advisor Success Podcast",
    "OPTIN: One Page Business Plan (BAR)",
    "OPTIN: One Page Business Plan (SLIDE IN)"
  ],
  "byline": "Michael Kitces",
  "length": 75860,
  "excerpt": "Welcome everyone! Welcome to the 434th episode of the Financial Advisor Success Podcast! My guest on today's podcast is Vanessa N. Martinez. Vanessa is the CEO of Expressive Wealth, an RIA based in Chicago, Illinois, that oversees $135 million in assets under management for approximately 70 client households, including 10 'core' ultra-high-net-worth families. What's unique",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary Welcome everyone! Welcome to the 434th episode of the Financial Advisor Success Podcast! My guest on today's podcast is Vanessa N. Martinez. Vanessa is the CEO of Expressive Wealth, an RIA based in Chicago, Illinois, that oversees $135 million in assets under management for approximately 70 client households, including 10 'core' ultra-high-net-worth families. What's unique about Vanessa, though, is how her firm, in addition to ensuring clients have established a 'traditional' estate plan focusing on the efficient transfer of their assets, works with its high-net-worth clients on what Vanessa calls \"legacy planning\" in order to not only pass down their assets to the next generation, but also the parents' family values that generated their wealth as well. In this episode, we talk in-depth about how Vanessa engages in a multi-meeting discovery process with clients (to first understand where they stand today with regard to estate planning and intra-family communication, and then to dig deeper into what the client wants to achieve through their legacy), how Vanessa has clients consider their family values for each of the accumulation, preservation, and distribution phases of their lifetimes (leaving room open to amend these values as their life and financial circumstances change over time), and why Vanessa has clients write down their values and legacy goals both to ensure their permanence (and to prevent misunderstandings that can develop when values are simply communicated verbally like the telephone game down the family tree over time). We also talk about how Vanessa's intimate involvement in her clients' lives (from attending major life events to supporting family members going through life transitions) helps drive client referrals to their friends in similar life (and financial) situations, how Vanessa uses neighborhood-based client events (such as a 'stocks and sip' evening of financial education and wine sipping) to draw in a select group of clients and their friends (without having any awkwardness for not inviting her full client roster that don't live in that neighborhood), and how Vanessa has found success holding client events on Thursday nights given that attendees are often a good mood (with only one workday left in the week) while also avoiding filling up a valuable weekend night that prospects may not be willing to let go of to meet her. And be certain to listen to the end, where Vanessa shares how she uses a practicing psychologist in a \"Chief Clinical Officer\" role to provide personality and communication assessments for her team and to facilitate communication when she brings together clients and their children in a family meeting to discuss the results of her legacy exploration exercise, how Vanessa has found that getting clients to focus on their legacy while still alive can allow them to answer questions from their children and to eventually deepen their relationship with their kids before any wealth is inherited, and why Vanessa ultimately views legacy planning as a way for clients to share their stories with the next generation so they value not just the dollars they will receive but also the emotional and intellectual wealth being passed on to them as well. So, whether you're interested in learning about the difference between estate and legacy planning, how to engage in deep legacy planning conversations with clients, or using intimate client events to attract new prospects, then we hope you enjoy this episode of the Financial Advisor Success podcast, with Vanessa N. Martinez. Michael Kitces is Head of Planning Strategy at Focus Partners Wealth, which provides an evidence-based approach to private wealth management for near- and current retirees, and Focus Partners Advisor Solutions, a turnkey wealth management services provider supporting thousands of independent financial advisors through the scaling phase of growth. In addition, he is a co-founder of the XY Planning Network, AdvicePay, fpPathfinder, and New Planner Recruiting, the former Practitioner Editor of the Journal of Financial Planning, the host of the Financial Advisor Success podcast, and the publisher of the popular financial planning industry blog Nerd’s Eye View through his website Kitces.com, dedicated to advancing knowledge in financial planning. In 2010, Michael was recognized with one of the FPA’s “Heart of Financial Planning” awards for his dedication and work in advancing the profession. Read all of Michael’s articles here. Never miss a Financial Advisor Success podcast episode! Get notified of the latest episodes (and all our research as it’s released!) directly via email: Resources Featured In This Episode: Vanessa N. Martinez: Website | LinkedIn Are you a successful financial advisor, or do you know of one that would be a great fit for the Financial Advisor Success podcast? Fill out this form to be considered! Full Transcript: Michael: Welcome, Vanessa N. Martinez, to the \"Financial Advisor Success\" podcast. Vanessa: Hi. Michael: I'm so excited to have you join us today and to get to dig a little into the dynamics that crop up when we start doing, it's normally, I'll say, estate planning for clients, although I know you have a little bit of a different approach to it that I think will be the focus for today. Because when I look historically, I mean, estate planning has, \"always been a staple of financial planning in the CFP curriculum.\" Because for most of our history of CFP, most people had an estate tax problem. If you go back to the 70s, 80s, and even the 90s, the estate tax exemption, topped out at $600,000. So a young couple with term insurance had an estate tax problem. And so we offered solutions with insurance and irrevocable life insurance trusts and all the tools and estate planning tactics we had. And then over the past 20 years, the estate tax exemption rose dramatically from $600,000 to a million, to now, for a married couple, we're closing in on $30 million, which means the number of taxable estates from the IRS fell 95% or more. And a lot of advisory firms kind of have moved away from estate planning and focused elsewhere. Either we do the income tax planning, a basis step up on the estate, or we just try to get documents in place with Encore Estate and Trust \u0026 Will and wealth.com and all the services that have cropped up. Having Clients Engage In A Writing Exercise To Record Their Legacy [04:50] Michael: But to me, there's always been another aspect of the estate planning side, which is taxes aside. Literally. Who gets what money, when, and how, and how does that shape the legacy of what's left behind? And the more dollars that are at stake, the more legacy tends to take on a role. And I know that's a domain you have spent a lot of time on that I'm excited to talk about, about, I guess, what does it mean to do legacy planning as distinct from estate planning? And I guess whether even you think that's a fair distinction to make in our world. Vanessa: I definitely think there's a difference. I think you said it quite well that the estate plans were truly created for tax optimization and to kind of tell a story on how you want those assets to transfer to the next generation. I guess how and when and who. We left out the human side of next-generation sharing. And that's where I believe legacy planning comes into play. We need to share, not just our values. Many people have created a mission statement or family values, which I think is wonderful. And I think that's the first step. But then we lean even further into it and need to share the stories behind the \"what's.\" I can tell you, \"Okay, Michael, I'm adding you to my estate plan and this is what you're going to get.\" But if I don't share with you how I created those dollars, then you might be unaware of not just all the sacrifices I made to create them, but also maybe partially my intention in giving them to you specifically. So I think legacy planning is digging really deep into those stories that we need to share with the next generation so they learn to value the dollars that we're passing on, as well as the emotional and intellectual wealth we're passing to them. Michael: I'm struck by how you framed that. Legacy. I mean, I quote this exactly right. Legacy planning, sharing the stories with the next generation so they value the dollars we're passing to them. Vanessa: Mm-hmm. I think if you try to remember the day that your parents gave you XYZ dollar amount, it'll be impactful in the sense like, \"Oh, I remember the first time they gave me, let's say, $15,000 for a down payment on my house. And that was it. I love them so much for it. They're such great parents because they thought about it and saved it for me and gave it to me.\" But now, if you go back and your parents shared with you the creation of that, so if they say, \"When you were five years old, I got this promotion for a partnership at my practice and I remember picking you up from school, you had spilled ice cream on yourself and remember you gave me that project with the macaroni on it that I still have hanging. That day was the day I got the promotion, and that's what propelled me forward for XYZ.\" So now you've done two pieces. You've connected the next generation to your wealth creation. Right? You've told them how they were a part of that. And as much as we want to say as the matriarch and patriarch, we did everything, it's impossible to be in a silo, right? We need all of those surroundings, which is our community, our friends, our family. So I think bringing them into the picture makes them value the dollars more. Michael: So do you think of this as distinct from estate planning, an extension of estate planning, a whole different category aside from estate planning? Help us sort of connect together. How do you think about this from the perspective of what the industry does, and then how do you position this relative to engaging with clients? Vanessa: So this is not a plug, I swear. I'm completing my second book and the title of it is \"The Emotional Heirloom.\" And this is where I encompass and share a tool on how to be able to pass on your legacy that incorporates all three aspects, the emotional, intellectual, and financial wealth that gets created. And this gets created through the...what we're used to, kind of the business cycle. When we think of it with our clients, it's their cycle of life, their accumulation phase, their preservation phase, and their distribution phase. In each one of those phases, they're developing wealth, all different types of wealth. And how that gets created are those lessons learned. So we were talking earlier about sharing best practices. We do it so much with our networking groups and our peers, but that sharing best practices should be a tool we use with families. This is that tool. This emotional heirloom is sharing best practices. So we have to share, not just sacrifices, the problems and issues that we face, the fears that we had, or what was our motivation on becoming a doctor, doing all those extra years of school, or anything that is your life story. There was reasons that everything happens. And I feel if we write it down, then we'll be able to share it more eloquently with the next generation. Because I'm sure if you think back, \"Wow, how many times have I told a story that happened many years ago?\" And as you tell it to the next person, it becomes kind of the telephone game where you're like, \"Wait, did I do that? I don't remember now.\" So I think there's those pieces of if you write it down as it's happening, and you're building out this beautiful emotional heirloom for the next generation, you're going to have let's...I'm not saying we're lying, a little bit more truer stories, more tied to the facts of what happened in that moment, in that day. And for me, it has not only served the next generation, but it serves me. When I go back into my journal and I look at these pieces, I'm like, \"Wow, that happened this many years ago.\" And I could see my millions of exclamation points that I have in my journal, or smearing from maybe where tears fell on my pages. But that shows me my growth in this journey of life. Michael: And so is this about...should I think of this in the context of journaling? This is taking clients through a practice of ongoing journaling? Or are we talking about something different? Vanessa: It's a yes and. Michael: Okay. Vanessa: So there will be some journaling, there might be just a picture in time, there might be one piece of a device. So it's not going to be a one-and-done, and it doesn't, like our business, it's not one-size-fits-all. So in the book, we go through multiple ways that you can create yours that is comfortable for you. And we'll share what you really want the next generation to know and understand. Michael: So then help me understand a little bit more, just what's the tool? Vanessa: It is writing. Michael: Okay. Vanessa: You can say writing, scrapbooking. It could be an intentional letter that's then attached to it. It could be all placed in a box. It can be placed in a book. So it just depends on your personality and your style. Michael: Okay. And then what's the process? Are you trying to give them particular prompts of things to write about? Vanessa: Yes. I think that is much needed, because if I were to tell you to just grab a pen and paper, for some of us that enjoy it, it's fairly easy. But for those that do not, I need you to help me. What do you want me to talk about? I want a fear. What is your fear today? What do you think your fear was then? So it's specific. So we try to... In the book, there will be worksheets, and in there, it'll have a prompt with an example. So it's not only telling you share this, but it says share this and it sounds something this. Michael: So can you give me some examples of the kinds of prompts that you would take clients through? Vanessa: Maybe our first question would be, what's your relationship with money? Or what do you believe your relationship with money is? Then we'll give examples of does it prompt you a need to save? And is this because someone in your family told you or you didn't have enough? Or maybe it's any circumstance that could have come. So it gives you a full example of a story that could be told based on someone who selected a fear of money or some people that get excited with money. Why are you excited about money? Maybe you lived through an era where it was replenished daily and you had more than enough of it. Okay, so that makes you excited. Great. Now let's dig deeper. So that's kind of what the book does. It makes you understand why you feel what you feel by prompting multiple questions. Michael: And so how many questions do you take people through? Vanessa: Only three through each phase. So thinking through accumulation, preservation, and distribution, each phase will have three. So it's not overwhelming, right? Michael: Okay. Vanessa: I think some might want to write more, and that's fine. But because we believe this tool adds so much value to leaving that lasting legacy that...we can keep it short and sweet and be intentional with these pieces that should be shared. Hence why I'm writing the book with a doctor in psychology. Because there's different phases that we go through as well at different, sometimes ages of our life and sometimes different circumstances. So we kind of tying two pieces together while we're doing this. Questions For Clients Exploring The Accumulation, Preservation, And Distribution Phases Of Their Financial Lives [15:49] Michael: So help me understand how questions tie to each phase. I mean, I'm presuming at the point I pick up the book or at the point I become a client, I'm in one of these phases, which is kind of cycle of life, accumulation, preservation, distribution. So how does this flow through three phases if I'm living in any particular one right now? Vanessa: So let's say you're in preservation phase, regardless you're reading a book, a normal book. So that meant you've already skipped chapter two, which is accumulation phase, but that doesn't mean you can't go back and write about it. And another piece is it's not linear, right? So today you could tell me, \"Vanessa, I'm in preservation phase.\" And then we can talk five years down the road and say, \"Nope, just kidding. I had this big life event, something happened with my company, something happened with this X, Y, Z, and I had to go back to accumulation phase.\" That's okay, because that is life, right? So it'll tie the pieces together that in some cases, you might want to answer the same question for the phase that you're in, but we try to tie accumulation more to a motivator because it's your beginning. So we need to know, okay, what's triggering you to move forward? What's making you want to take the next steps? So there is specific pieces that we try to make intentional on the phase, but we also don't want to create that stigma that, oh, if you're 20 to 39, you're in accumulation, but after 40, you should have already hit preservation mode and you should keep that until you're 60, right? So we're trying to get away from that. So we tie what it could be, should be, would be, all of those in the questions. Michael: And then likewise, do I have to wait to get to distribution phase to start writing my takeaways around distribution phase? Is this like a living document thing I'm creating and adapting over time for my family? Vanessa: Yes. It should be a living document as is an estate plan, right? As things change, you change, your decisions change. So in this case, I would say it's kind of what we talked about right now. If you're in preservation phase and then you have to go back to accumulation phase because something devastating happened and you need to start all over, which is okay, then you can kind of go back and not necessarily rewrite, but add to it. And as far as moving forward, because I agree with you, because I do like to write, I'm more about this is what I would like for it to look like. And then you could reread it for yourself and see where you're at. But this is something that you can deliver. So when it comes to what you're saying, it's a living document. It is very much like an estate document that you can amend and change. But once you're ready to share, and maybe you share phase by phase with family because you're like, okay, I think I'm done with this and I really want to share this with them now, you can. And if you say you want to wait a little longer, you can. I think in the past, estate plans, because why they were created for, tax optimization. And in some cases, we hear people say rule after the grave. What was written in them was quite different than now. I believe many families, at least in my experience, have wanted to start gifting during lifetime. I don't know if COVID did this to everyone, but you want to share in the memories. You don't want... You want to be a part of it. And I used to tell families this all the time when we would sit together, \"The last thing I want is to then deliver these huge inheritances to the next generation and see the smiles on their face, the ideas that they have of what they're going to do with everything and the light in their eyes and the gratitude. And that doesn't...that appreciation doesn't belong to me. Right? That's for them. And now they're not here to see it.\" So after living through moments that, it became so important for me to make sure that the real people that should live through that appreciation are the creators. And if they do some of that during lifetime, they get to enjoy it. Michael: So I guess I'm just trying to visualize further. Can you share maybe one of the questions from each of the three phases? I'm just trying to visualize, what am I writing about or asking a client to write about as they go through each phase? Vanessa: Okay. So you can't hold me to this because my editor is still reviewing. Michael: Understood. Understood. We're giving examples from a manuscript in motion. Vanessa: Yes, to get a sneak peek. So in the accumulation phase, one of the questions is share about your emotional relationship with money and how it's impacted your accumulation phase of life. And then in our example, if you're apprehensive regarding finances, maybe you've avoided taking a deep look at your finances investments in order to reduce the risk of mistakes. If you have set high expectations for your earning goals, you may hyperfocus on working extra hours or jobs, etc., to get the financial results you hope you have for your life. So here, it's what are you feeling? Is it hot that you're setting high expectations, or is it that you're apprehensive? And why is it? So it's making you continue to ask yourself. So this is right in the beginning, right? That's accumulation. Then we go into preservation. And this one, it's asking for advice. So it's more of give some advice on your emotional growth and share an experience that propelled this progress. So if your advice is something like \"Be intentional on having difficult conversations, even when you know they might lead to an outcome you don't want.\" Let's say that is your advice. The experience shared here will give insight to not just take the advice, but to see what can happen when you do. We want the next generation to feel part of the journey. And the distribution phase. Create a list of meaningful mentors you've had throughout your life, starting from childhood to today. Share about how you see the impact reflected in your present. These people can be family members, professors, friends, therapists, etc. This is a time to reflect on what a significant impact any one individual can make in another's life. Michael: Interesting. And in theory... I guess in theory. In practice, as I'm doing this, as someone going through this, I'm writing it. I'm writing the answers to these in a journal. I'm typing them in a Word doc, depending on my written mode of preference. But I'm sitting down and trying to write out answers to these. Vanessa: Yes. I think the newer generation might be jotting them down in their notes tab on their phone. But yes, that's exactly what this is. Michael: So then when or how do I share this with the family? Vanessa: So this is an answer that we...well, I do not like, but it is the right answer. It's called it depends. There are family meetings that can be held, that can be, in my opinion, should be held. And you can share both of the monetary aspects that travel through and how and why, as well as this emotional heirloom. So it just really depends on the style that you live with your family. Right. Do you meet consistently? Is it just over Christmas that you all get together? Some families have a lot of family meetings throughout the year, right? So is this the special one where we share this? It just depends. Michael: And otherwise, I'm... I'll have a document that says, \"Please read this that my children or grandchildren find when I pass away.\" Vanessa: I would not like that as an option for anyone personally. Michael: Okay. Why not? Vanessa: Because the idea is if...that they get to ask questions. You would think that you'd be thorough enough to answer all of these things for yourself. But if you gave me your list of mentors, I would say, and you just listed them and said what they did for you. How about if my question is, well, which one impacted you most? Can I talk to them? Can you do an intro? I'd love to hear what they think about you. So it's really deepening the relationship you have with your family. And that would be a little difficult if I'm just going to go back and read it. But I get it. For some people, this is a difficult and uncomfortable phase that I would hope through motivation, you can embrace it. Michael: And is this intended for those very, very high net-worth folks who are moving a lot of dollars? Vanessa: Definitely... Michael: I mean, is that kind of the idea? There's a lot of wealth. I probably need to give more context to this than just literally bequeathing them millions of dollars or tens of millions of dollars, depending on how far you are up the net worth scale. Is that the idea in context of this? Vanessa: Definitely not. That is actually... I don't want to say it's the opposite because then I'm doing the same thing. I think I know this is for everyone because wealth or riches aren't tied to dollars. So if I've lived with my family who has given me a tremendous amount of emotional and intellectual wealth, I can consider myself just as wealthy as Elon Musk, right? I don't need dollars to impact the level of my wealth, but I do need these stories to remind me of how wealthy I am. Putting Legacy Planning Conversations Into Practice With Clients [27:03] Michael: So how does this work in practice? I mean, you're writing the book now because of a version of this that you're doing in practice with clients. How does it work as a part of the advisory work that you do with clients? Vanessa: So it's an introductory level still. I wanted to have the book completed because then it becomes a full tool and it leaves... I mean, you can be flexible. Like I said, there could be additional questions asked, but at least it's a guiding light. And I wanted to have it complete before going super deep into it with the clients and saying, \"Okay, we have a deliverable and let's get it going.\" But it does start with the family meetings. And the family meetings, I think sometimes when we think of this, or I don't know what you think of when you hear family meeting, do you think of a big table with ten people sitting around it or do you think just a partner? Michael: I feel like there's two versions of family meetings that get put out there. There's some kind of raucous home for the holidays thing. And there's what really, really rich people do or family meeting has a whole other meaning to it because we're having a family meeting to talk about the governance of the wealth of the family. I don't feel I have talked to a lot of clients over the years that say we have family meetings. Vanessa: And I think you are 100% right on what the view is. And that's why in some cases it makes it very difficult to embrace it because you're thinking, \"Oh, no, that's for those people or no, that sounds overwhelming.\" So I'm calling it a family meeting because everyone listening, you were in the financial industry, right? Michael: Yup. Vanessa: So we kind of get the idea. But it's exactly what you're saying. It's just sitting with the family and talking, but being intentional on what you want to share in that moment. And I feel that the intentionality piece is what's lost tied to how you communicate. Right? So if you just walk downstairs and you're getting the kids ready for school and you're like, \"Knowledge is power.\" And you send them off to school, they might remember it. Right? And at some point, they might think it's silly that you say that. And maybe you say it every day. But the intentional piece would be to say, \"Hey, people have movie night and they have game night.\" This is kind of that. If we can make it more normal, then I believe that we would end this shirt-sleeve-to-shirt-sleeve losing of inheritance and not just the dollars piece, but also the wealth and richness of culture and stories because it's not shared. And that's why we have history classes. We have it because we want to learn from it and grow from it. And in some cases, it was done very well and we want to just repeat it. So if we don't do that with our families, who will? So the idea would be, let's say there's one of the partners that's a little more adamant on, \"Oh, I love this idea. Let's start it. I'm going to make him or her join us and be a part of it.\" It's just about having the conversation and saying, \"Okay, what do you want to share with the kids?\" \"I only want to share that we've been building this and we're thinking of keeping the lake house,\" let's say, in this case. Do they want it? Do they not? Okay, let's talk about it. And then you're intentional on what questions you ask and what you share. So it's really just having conversations. But sometimes, most times, we're worried of what other people will say and how the communication, and will they hear me, really hear me and what I'm trying to say and not take it the wrong way. So what do we all do? Avoid it. That's just what we do. It's natural to avoid, avoid conflict, avoid just any of that. Michael: So how do you help clients unavoid when some of them probably do go right into avoidance mode? \"You're going to have a family meeting about this,\" like, \"Nope, I'm not.\" Vanessa: Yes. So it takes time. And just everything else in life, what do we do? When we're scared of something, besides avoidance, because that's the first step. The second one is making a decision. So if you make the decision to say, \"Hey, I do want a healthy legacy, I do want these things, but I'm scared to do all of these things that you're saying.\" So then we say, \"Okay, let's do one thing first, just one thing.\" And in some cases, we're the doers. Right? So it might be you want to tell the family that you want to gift them X, Y, Z, whatever it is, then maybe we're the liaison that facilitates that first piece. And then once they see the outcome, then they're like, \"Oh, I could do this. I'll do this next time.\" So whatever it is, we do smaller steps until they get to the comfort level, both them and the children or the beneficiaries. Everybody has to kind of... and that's what makes them a little difficult sometimes. But if you're not making it a state-of-the-union type of meeting and it's truly just let's get together and talk, it flows quite nicely. Michael: So does that mean there are times when you, your firm is actually involved in trying to facilitate one of these conversations or just the first one for a client who's trying to take their first baby step? Vanessa: Yep. We definitely are. We're part of the pre and the during. Michael: And so can you share more about how that works in practice? How are clients even delivering the message and convening this meeting together when they're not used to doing that and you're going to be in the room and everyone's figuring this out for the first time? Vanessa: You know, it's funny how you phrase that, because I guess that's not how it's thought. But it's just funny to think it through that you're like, \"Oh, and the financial...our financial advisor will be there.\" I think that this works well when you are so intertwined with the family. That it's... And Vanessa's coming because she's going to help. That's how it how it's said. And it's more we've been preparing for this along the way, right? Because you have more than one generation that you're managing their overall wealth. So you've kind of gently slipped this in in multiple conversations. Like, how would you feel if you know we all got together and talked about this? How would you feel if we got all together? How would you feel if we all got together? And of course, asking, can we share? Right? Can we share what your thoughts are on this? And then getting to the point where, yep, kids are ready. Are you ready? I'm ready. Let's do it. Michael: And so how do you get to the point that you're already in front of the kids? I mean, so are you in a world of very high-dollar clients with multi-generational wealth and you're up and down the family tree already? Vanessa: I am. How Vanessa Serves UNHW Multi-Generational Families [34:51] Michael: Okay. So then help us... Then I guess let me take a brief step back, say, help us understand just the clients that you work with and the and the firm itself. Who do you work with, and what do you do? And the client...and how many clients you serve? Just help us visualize the business itself. Vanessa: I have a blend. We're broad. So we have individuals and families, because some people, it's just one person and maybe the beneficiaries end up being something more like a charity or nieces and nephews, but still beneficiaries. People that are forming their business and inheritors. So it might go where I get another generation and then slowly have to just communicate with the generation above them. So it does make it complicated, depending on which one lands with us, right, which one selected us first. But then over time, it's truly just information-sharing. I think when you look at maybe children, I'll call them, even though they're adults, but they're someone's children and they're in their 50s. And they want to understand what's going to happen next because they're trying to make plans for their estate, right? And they're trying to organize their trusts in a tax efficient manner. But you can't fully do that unless you know what's falling into your estate. Or if anything is falling into your state, and typically, you know, right? You know there's something, you don't know when, how much, what, or all of those details. But even their communication sharing, right, if your children were to ask you, \"Hey, dad, how much are you going to leave me or what's in the estate?\" I don't know what your reaction would be. My assumption is it wouldn't be very positive if the question is asked that abrasively. But now if your child is in their 40s and 50s and they're building their estate plan and they say, \"Hey, dad, can you... You know what, I'm really trying to build this out for me. And do you have recommendations? Can you point me in the right direction? What do you think I should and shouldn't do here? Look at this with me.\" Then you'll be more willing to say, \"Oh, okay, hold on. I think you should do this because we've done this. And let me kind of guide you here.\" Or it might be, \"Let me connect you with my attorney,\" which is what some people do, right. Some people don't...are not ready to share. And that's okay. But at least if you're connected with that attorney, you still have the piece of confidentiality. But you can still guide the next generation to make sure that their plan ties efficiently with the matriarch and patriarch. Michael: And so how many clients, or I guess households do you, because I'm assuming multi-generationally, can I have multiple clients in one household across the generations? How many clients or households do you guys do this with in practice today? Vanessa: It's not all of the AUM we have. We do it right now with ten families. Michael: Okay, ten high-dollar families. Vanessa: Families, that's multiple generations. Yeah. Michael: Okay. And then what's the, I guess AUM base or revenue base? I don't know how you measure it in the context of the business. What's the... Vanessa: Right now, we're at $135 [million]. Michael: Okay. And so you end out very deep with these ten core families that have large dollar amounts getting into presumably both the portfolio management side, because there is AUM here as well as all of these estate legacy conversations? Vanessa: Yes. Michael: So can you walk us through then what the planning process is? I mean, if I am a new, prospectively new high-dollar household that says like, \"Yeah, Vanessa, this...I think we need to sort through this for ourselves and what we're going to leave for our kids, for our family. I want to become a client.\" How does it work? What's the process that a new client goes through when they say I want to do this with your firm? Vanessa: It's knowing where they are today. So most likely, they have something in place. I'm hoping an estate plan. They probably have a net worth built out, maybe even a financial plan already created. So it depends on where they are. We want to make sure we understand a snapshot of exactly what they have today and what they've done. That's always the most important piece. So, of course, if we think of it all of our websites, right, we have a discovery session. Of course, we have that because we want to understand all of your pieces. And I share this with clients, and I think we're very similar in this thought process, is that I need to understand all the pieces to be able to give you any and all recommendations. It won't happen if I'm not understanding what else you have and what else you're doing. So you know how you have some clients that might just want to hand over a portion or are wary of what comes next. So we have to sit with them and understand, \"Okay, just share with me, not because I'm trying to push you to give me all of these assets, just so I know how and why they're invested that way. And I need to understand how many properties, I need to understand what states they're in.\" So I think that discovery piece is the most, most, most impactful meeting to start to dig into everything they have. Once you have that and you collaborate with them to confirm, \"Okay, this is all correct. This is what you're looking like,\" then you can go into \"Now, what is your goal?\" And in your case, you're saying, okay, I want to do the legacy portion. Then we have to talk about, okay, do you want to do lifetime gifting? Or is your plan all after death? So it's very convoluted because it really depends on where you are and what you want to accomplish. The end goal would be, we are intentionality on communication. Let's communicate, not just with each other as advisor-client, but also between each other, right? Because I'm sure we've all seen it, that you have one spouse who knows 95% of everything that's going on and another that can range anywhere between 2% to maybe 60%. So you can't just jump the gun and go straight to, oh, let's do a legacy planning because this is fun. We get to talk about our values, and our mission, and our whys, and all of these wonderful pieces if you two don't even know. So that is piece one. If we're talking about, besides asset allocation and asset location, now let's talk about what do each of you fully know and not know about what's going on. And then it's kind of transparency, right? If we can have transparency between them, then this process is much easier to pass on. Michael: So I'm just trying to visualize how this flows in terms of meetings or timeline with the client. So it sounds meeting number one is discovery, is a discovery meeting. How long is that meeting? How long does it take to dig into this much stuff? Vanessa: It's a few meetings. I think it shouldn't be the end goal of, oh, it takes ten meetings and then we're done with this. That's just not how this is. This is a very fluid process and it's going to be dependent on how fast or how slow you want to go, how much you're willing to be vulnerable and share, and how long it takes for you to become vulnerable and share. So it's not quantifiable like that. This is not, as our wonderful listeners, those math people, which I am too. I like that, right? I two plus two equals four. But this is not one of those cases. This is going to be, \"it depends.\" And of course, we have life happening as this is all going down. Michael: So at least in the ideal flow, what comes after discovery? I mean, you talked about asset allocation. Is the investment side of things next for you because you're running an assets-under-management model? Is there some other meeting in the process? What comes next if I'm following the normal process? Vanessa: So if you're following the normal process, first, we learn about each other and understand what do we have at hand, right? Then the second, let's call it meeting just to kind of keep a flow here, would be, okay, now, what do you want? What is the end goal or what is a short-term, midterm and long term [goal]? We can have multiple goals. After we establish that, then I can make recommendations as to let's establish a timeline, right? Now, because I understand you, you understand me, and I've established what we need to do to get you to that, now I can say, \"Okay, this is going to take, let's say, five steps.\" And it might be different for everyone because of the urgency of what comes next. So let's say you don't have an estate plan and you come to me and you do need one. So we need to get that done, right? If you have children, it just depends on your situation will change the priorities of which step comes next. But if we want to say, streamline, you came out of a box and let me cookie-cutter this after the discovery and understanding your wishes, I make recommendations, we can get the assets invested. We review both your estate plan and any tax, your previous tax return to kind of make sure that those two pieces tie to each other. In this process, we'll find that maybe things aren't titled correctly. So that is a quick and easy fix on our side because we're just listing it. That can take a year for some people. If you have private equity, venture capital, all of these different, more complicated ownerships, they take longer to then title into your estate plan. Then after we complete that, and like I said, first you have to be in order. You can't share disorder. So once you're in order, then we can kind of get into this family narrative, right? Composing this emotional heirloom that then can be shared with the family. And it can be done through phases, just like everything else. And what I said, it depends on the person, right? I have those people that are similar to me, type A, and only know one speed and it's super, super fast. So those people, we can move a little faster where I can say, hey, I need you to change the title on these three things. And they're like, okay, three weeks later, they're like, \"Done. What's next?\" \"Oh, perfect. Now let's go on to the next.\" But if you don't work at that pace, it's not my pace. It has to be your pace, what you feel comfortable with, because you're going to find joy in all of these phases. So I want to take your pace once you're done with that. Or some people will get overwhelmed if I'm like, \"Okay, first we have to make sure we amend your estate because we reviewed these three things and you're not up to date after the laws have changed. You need accumulation. You need this. You need that. If I start spewing all of these things out at someone, the first thing they're going to say is, \"I'm out. You're too much. This is... I can't do this. So that's why I always believe in the platinum rule, right? It's not treat people how you want to be treated. It's treat people how they want to be treated and tying this to communication. It's not my style of communication. You have to learn what theirs is. And if you want them to follow along and truly reach these goals, you have to meet them where they are. And take those steps as they're embracing one by one. Michael: With the asterisk, when you're working with very-high-dollar clients with a lot of complexity, there's a lot of moving parts just to get to where they are. Vanessa: Yes, yes. And you have to be understanding of these things. I think that's also the case. Michael: And so I'm presuming that the level of complexity of high-dollar clients is also why, if I heard right, even the discovery layer is essentially two meetings. The first is, I just need to know where you are today and all the things you've got now. And meeting number two is, okay, now we can actually start talking about goals and what you want and where you're going. We have to do that in two meetings because it's too much to get through in one. Vanessa: For sure. Unless you have that person that comes in with a binder and says, \"Ask me a question, any question.\" And they turn to the page because they got the little post-its on it. If you got one of those, then maybe you can get it done in a meeting. Michael: Yep. So then in this kind of model, I mean, how many meetings do you have with clients through the first year? Is you're just blocking and tackling through this much stuff? Vanessa: Normally, the first year, and I would say the first quarter, is more intense. Because if you have a client that is actually getting the pieces done that you're requesting, you need to make sure you follow through with that. If you have a client that you're like, \"Hey, can you get this done?\" And they automatically tell you, \"Hey, it's going to take me a month or two months to get that to you,\" okay. Then you just put them on pause. Right? And then you have the follow-up. Of course, all our wonderful task managers and will remind us to give them a call to check in. But if not, then you got to go the other route. Michael: And so what does it add up to over the span of a year? Vanessa: For a new client that wants to be involved and is responsive, I would say probably at least six meetings. Michael: Okay. Vanessa: But I think if we're in this case, because I know it can sound overwhelming, because then you're like, \"Oh, and then there's more clients and then there's more meetings and then there's more things.\" Really, if you establish a really great relationship with them and they're trying to be intentional on getting a project completing, not necessarily, \"Hello, Mr. Client. How has your...\" No. We don't have to do that. I just talked to you last week. Right? I know what's happening. You already told me what's happening. We're having this call today to get this and this done. Right? That's it. So it's not an hour to two-hour meetings, every single time. And I want my clients to know that they can reach out to me whenever and how many times they want, knowing that they're going to have that purpose. And as we know, we have some clients that do what they do, no matter what we say, no matter how we act, no matter how many rules we put in place, that...we can't change that. Right? But the same way that you create a culture in your practice, you also create that with the families that you work with, and they'll understand your style and you'll understand their style. And in some cases, it might be, \"Hey, that's perfect. So for the next three things, I'm going to have Kasha reach out to you and she'll get that done for you.\" \"Oh, of course. Sounds great.\" It's just about expectation. I know it's easier said than done. I'm making it sound it's easy. I know it's not. Expressive Wealth's AUM-Based Fee Model [52:14] Michael: So what's the actual business model for you? Are you assets under management fee? Is there retainer fees or minimums? How does the business model work? Vanessa: Ninety-nine percent is AUM. Michael: Okay. And how does fee schedule work for you when you're working with high-dollar clients this? Vanessa: It's a tiered approach and depending on the complexity, we'll sit and talk through what works best and what's fair, to be honest, because we have some things that are... I am very considerate when it comes to that in the sense if you have something that's locked up and there is absolutely nothing that can be done, there's no way I'm going to charge you for that because there's nothing I can do with that. Even though I am incorporating it into our plan, if I can't actively make a decision whether to hold, buy, or sell something, then my advice has no relevance if I can't do anything. Michael: So does that mean you may otherwise charge an assets under advisement fee? Vanessa: Correct. Michael: Anything on their balance sheet that you can advise on not just the assets that are regulatorily managed? Vanessa: Correct. But that's why I'm saying 99 is AUM, 99% is AUM. It's very... Michael: Which is being actually managed assets? Vanessa: Correct. Correct. Michael: Okay. And so how did the tiers work for you? Where do you put breakpoints when you're...the account balances can get pretty large? Vanessa: After ten. We're at...between ten and 20. We're at 70 bps [basis points]. Michael: After ten million, you're at 70 bits? Vanessa: Mm-hmm. Michael: Okay. And then does it... Is there another breakpoint above 20? Vanessa: We talk that through with those clients. Michael: Okay. Okay. Is there a minimum for you? Vanessa: I would say I don't have one now, but... I don't think I'd go lower than 60 bps, mainly because I'm not your asset manager. I'm your wealth advisor. And if you value all of the additional care advice that I give you on absolutely everything you do, you'll agree to that. Michael: Is there an asset minimum that they have to bring in the door just to be eligible to fit for the services as a client in the first place? Vanessa: No. No. That was something that we were intentional on. Obviously, we have our own models, so we're individual stocks and bonds. Which means that at a certain dollar amount, it makes it almost impossible to diversify properly. And that's not our model. So to do that, yes, we do need a certain dollar amount, but I just want to do what's right by the client. And based on how we do things, it makes it impossible to diversify you. But of course, there's family members, there's referrals that we want, and everyone is valuable. So we have different flows on how to work through those. Michael: How do you manage capacity when you're going after a decamillionaire households, but...and anyone can potentially be a client and take a slot? Vanessa: The way we look at that is we are growing our advisor base. So right now, we're currently at four advisors. And I think it's kind of the people that you refer are the clients that you have, so it tends to just flow naturally to not have to turn anyone away, per se. But our idea has always been that if that comes, we'll build something, right? I mean, we do have ETFs for depending on moving things. Just a holding spot for certain things. So we do have them, and we have models, different ETF models that we run through. Michael: So does that mean you have other clients beyond the core ten families on the books now? Vanessa: Yes. Michael: I'm just trying to envision, even for big-dollar families, four advisors for ten clients feels a lot of folks. Vanessa: Yes. One is a new advisor. Michael: Okay. So getting up to speed. So then how many total clients or households are there across the business between the core folks and the others that other advisors are working with? Vanessa: There, I think we might be leaning more towards households. Maybe 60 to 70. Michael: Okay. And so you kind of have a segmentation-style model. You have some of the largest higher-dollar households, other advisors working with clients at other tiers on the spectrum. And that's how you kind of handle the segmentation challenge? Vanessa: Maybe for the future. Currently, the way we did it is I launched Expressive Wealth and I had two advisors that were at other practices and they came over with their book. Michael: Oh, okay. Okay. Vanessa: So each one of us has those types of families as well as a blend of others. So yeah, the idea would be that we would then bring on newer advisors, right? Succession planning. I believe succession planning starts now to build trust. This is a slow game. This is not then you turn over and pass someone along. That's not how we see it. It's definitely a relationship, and to build that, it takes quite some time. Driving Client Growth By Holding Client Events And Being Visible In Their Lives [58:55] Michael: So then where do these large high-dollar clients come from? Vanessa: In some cases, previous practices. In some cases, referrals from friends. Michael: So there's not a separate marketing process for you guys, it's just all word of mouth in that community? Vanessa: Yes. And very, I said, we're so intertwined in the families that we're at events with them. So it's different to say, I'm just giving you a referral because I talked about you versus, oh, you were there and you talked to my friend, so-and-so. Michael: Okay. Vanessa: Like birthday parties, like weddings, just in case you were going to ask for examples. I know you love examples, Michael. Michael: I'm just trying to visualize it. I'm a very visual person. So I guess I'm just trying to envision how you manage growth. Are you just stuck in a, it's a fairly reactive world, we're just trying to be out there and if we make enough contact, enough opportunities at some point, a referral shows up? Vanessa: We are intentional in our marketing with having more of a presence. So by that, I mean networking events or actual events that we launch. We have obviously, right, we have the second book coming out. We have a podcast that we run that we just launched, blogs, and newsletters. So content is out and our key in our content is always education, communication, education and communication. Because that's kind of our brand. We want to make sure that families understand this. So typically, when we get referrals or we go places, the main referral source with our family is when they say, they're not like, \"Oh, this is all about performance. They're great. Go with them.\" It's more of, \"Oh, my goodness, my daughter was going to get married or is getting married and Vanessa was able to help kind of get everything in order for the prenup.\" Or \"She explained to them what it actually means so it didn't look and sound a bad word.\" So that is how our referrals transfer. And we have been quite fortunate in that. Michael: So then what kinds of, I guess, I think you said those networking events, you go out to and events that you run and yourselves, what kind of event marketing are you doing to fill this in? Vanessa: Still educational. So in that case, it might be something like a wine and stock night. Michael: Wine and stock night. So how does that work? Vanessa: So it might be at a wine store that has the space, and then we do a quick chit-chat on kind of what we see, where we see it heading, and things you can do or put in place to kind of help today. All general allocation pieces, but then have a quick sommelier come on and explain two different wines. So now you're just sitting there networking with everyone that's in the room talking about stock and wine. Michael: And who gets invited to an event this? How many people in the room, and who are you inviting? Vanessa: Small groups. And it's a client and two friends. Michael: Okay. So very small, there are four of us and the sommelier hanging out. Vanessa: A little bit bigger, more like ten to 15 total. Michael: So then a few clients may get invites and bring a few friends each. Vanessa: Yes. Michael: And just how do you do the invite? How do you position this with clients to get comfortable to bring friends to what nominally is the marketing event for their financial advisor? Vanessa: I think in...the way that we've done it is because we have that really strong relationship with our clients, it's more like, what are your friends asking about? So it might not be stocks. That was just an example, but it's typically exactly what you started this whole conversation with, which is estate planning, right? That is I think a big question for many. Understanding their own. Do they have the right one in place? Some people, and you would be astonished. And how it's just, they only have the will, because it was done so many years ago, and in their mind, that's what that meant and didn't realize, well, that that goes through probate. So, I think those pieces are kind of where we lean. What are the questions? That's what we want to do. We want to answer your questions. We don't want to just sit here and teach you, because some people will be like, \"What? Stocks? I don't want to hear about that. I don't care about that.\" But if I say, \"Your kids are going to college, make sure you have something in place like a health care directive, so that you're aware of what's happening just in case.\" Then it's like, \"Wait, what? I am.\" And then it's an age group, right? And then it's a demographic, maybe in the neighborhood, maybe with a mom's group. That they're all, \"Oh, my goodness, I do want to learn about this.\" That's what makes it enticing. If you're answering what someone has questions on, they will be there. Michael: And so how does the actual invitation process work then? Do you go to select clients and ask them bring friends? Do you send this to all clients? Vanessa: No. Select. Michael: You have to bring a friend? Vanessa: No, it's select. And they don't have to. But sometimes because they know it's a few people, then they're kind of like, \"Oh, I at least want one person with me. They travel in packs. Michael: So the outreach is to clients and the invitation is your friends are welcome if you'd to bring one? Vanessa: Or a few. Michel: Or a few. Vanessa: A couple, more a couple than a few. I don't want that many. But yes. And the way we assign it is more of where do we want to have it? The way we assign it is more of where do we want to have it? Do we want to have it over here in my neighborhood? Do I know that I have five other families in this other neighborhood? You want to make it easy. You want to answer their questions. And you want to make it accessible. And you want to pick a night that is accessible. Nobody wants to give you their Friday night. So we lean on Thursdays because there you just have one other day of work left. So Thursdays is typically our night, and that's how we kind of assign who gets to go to what. So some clients, the retired clients, would love to go to absolutely everything. Michael: Well, they have a lot of time. Yes, they do. Vanessa: Correct. Correct. So it's not that we don't want them, it's that it's further away. Right? So it's kind of in the setting of in the neighborhood and neighborhood get-together. Michael: Okay. And so that's how you frame it to kind of politely not have invited all clients to so and so. So someone says like, \"Vanessa, I heard you did one of your events. I didn't get invited.\" Vanessa: Correct. Michael: It was a neighborhood thing up there. It's not really where you are. Vanessa: Yes. Because then it's family. Right? You can have someone who is...that you did invite and then the mother or the daughter, either/or is in another neighborhood. And it's not that you didn't want to invite the mother and the daughter, or in some cases, you might, even though they're in different…if they want to come in and maybe babysit the grandkids actually. But if not, you want you want to be fair and saying why you didn't. It's not that I didn't want you there, it's truly because it's a neighborhood thing. Michael: I guess obviously from a pure kind of marketing geography and certain neighborhoods and zip codes work are naturally conducive to this approach anyways, given the dollars in the neighborhood. Vanessa: Yeah, they are. Obviously, I'm in Chicago. But I'm assuming it works like this in most places. Once you get into the suburbs and even more so a little village, per se, it's like everybody knows everybody and everybody knows everything. So it's already a little community in itself. So it invites itself to be very easily done. What's Surprised Vanessa The Most Building Her Advisory Business [1:08:22] Michael: So as you reflect on this journey, what's surprised you the most about building an advisory business working with these types of high-dollar clients? Vanessa: They're very open in wanting your success as well. So it's kind of they're proud of you and they want you to continue to succeed. Of course, you have to give them their time, but they want you to succeed. When you're in that kind of relationship, it's overwhelming in a joyful way to hear them say that. That it is beyond that. That even though in my mind, I become quite attached to the clients I work with. I mean, honestly to everybody. So watch out, Michael, I might be calling you after this. I build that really strong connection, and I always want to be helpful. I consider myself just a server at heart that I'm always willing to help and to share. And I didn't...the surprise was that so are they. So are they. Michael: And so how does that show up in practice? Vanessa: It's the applauding your successes, sharing it, which then leads to a referral that's already closed. You really have to do almost nothing because...it's kind of a beyond a referral. I don't even know what word exists. I'm just making stuff up now, but it's that easy. Michael: So what kind of successes? I mean, what success is in the context of my client shares it with their friends that results in a referral coming through? Vanessa: It's that piece that we were talking about on same friends that have children in the same age group that are going through the same things that then my client will share how I was supportive in meeting with her daughter and her future husband to talk through these things. There's no fee. There's no catch. There's nothing besides helping the family with what their goals are. And if I know that from the beginning, then it's easy to align and bring it down to the next generation. And they share that. Michael: So I feel like a lot of advisors try to do various versions of... I take \"accommodation clients,\" family members of kids...kids and family members of my top clients because I'm trying to be supportive and show up well for them. And a lot don't seem to get referrals. It's kind of \"Thank you for helping my kids.\" And then they move on. Is there a nice... I'm just wondering, why does this seem to result in more referral activity for you than it does for some other advisors? Vanessa: It can go both ways, right? So I don't think it's in all cases the advisor. It'll be a blend of both. There are some clients that are just very transactional in life. And there's some advisors that are very transactional. And I think sometimes, and this is the whole piece of having a chief clinical officer on the team, is that sometimes that self-awareness button, we haven't pressed it hard enough. And what that means is maybe you're transactional even though you say you're relationship-based, and that's okay as long as you know it and want that to be the case. There's many advisors that are like, \"Vanessa, I think you go too deep. I think that you cross the lines.\" And that's okay because that's their opinion. And that's okay, and I get it. And they can be successful in their own right. But for me, this works. For me, this brings me joy. And I feel that when I talk to my clients when I'm with them, they know I'm in it for what I'm in it for, which is to reach the goals because I care. And many of us say that. But if your actions don't show that, other people can feel it. Leveraging A \"Chief Clinical Officer\" To Support Both The Team And Its Clients [1:13:14] Michael: And did you say there's a chief clinical officer on the team? Vanessa: Yes. Michael: So what is what is that? Vanessa: What is that? Michael: what is that called? What is that? Vanessa: So this is bringing back the doctor in psychology that we have on the team. And she supports the team itself as well as in these, I'm going to call them client conversations now because we said we don't use the word client meetings. So she supports in those, as well as internally with the team. Michael: So can you tell me a little bit more of what does she actually do? What does it mean she supports in the team and meetings? Vanessa: So on the team side, we have an assessment that we run, a different one. We'll do a different one each year. Obviously, as you know, I launched on International Women's Day in 2024. So this is year one. So one assessment down. Many, many to go. But the idea is to evaluate and assess either our personality or our communication style. And then be able to understand each other better as a team. Because I'm sure you've had the times where you're sitting there talking to someone and then they repeat back to you. That's not what I said. We've all had that happen. And that's because we either aren't listening or are, but what we heard is what we heard, and that's maybe not what they were trying to say. So she helps us as a team become better at listening and being self-aware of these things. Right? Because if our assessment shows that this is how we tend to do things, okay then, how do we evolve from that? So that's internal pieces, which then just make us all better to serve our clients. And then on the client side, it's more as a liaison, as an outsider. Because I can be in there and I could definitely sit there and walk through the flow of the estate plan, and the GST [Generation-Skipping Tax] and the GRATs [Grantor Retained Annuity Trusts] and the SLATs [Spousal Lifetime Access Trusts] and all the wonderfulness that's involved. But when it comes to those difficult conversations, if you're going to say, \"Okay. We're keeping the lake house and we're having this trust and the expenses flow through that.\" And then one of the kids is, \"Yeah, but then what happens when that runs out? Then we have to cover it. I don't want to cover it because he comes more and I don't go.\" And then she doesn't come. And then it becomes an argument. But if we have someone as an outsider that says, \"Okay. Let's talk about that.\" It's kind of like you in the room. Where you're like, \"Wait, let's dig deeper there.\" So we try to understand why are they so angry about keeping the house? What do they feel that maybe hasn't been shared with them that makes them feel they don't want to? Or why do they feel that burden is heavier on them? Maybe in the past, they've taken on other burdens more. Maybe they're the family member that is either getting less of the inheritance, producing less income. Whatever it may be, right? But you dig deeper in these conversations. And what I found in the past that not having a chief clinical officer, or let's call it a liaison to facilitate this or help in the process, then that burden is now placed on me. And I'm definitely not trained for that. So this...it's been tremendously helpful. And obviously, we've only been in business for a year with this new structure. So we've only gone through it with two families. And it was... I don't even know what word to use besides just an enjoyable time with great success. Michael: So is the psychologist in every meeting? Or just some? Vanessa: Only in the final one. So remember how we talked that we're going to do a couple pre-meetings and we're going to do some planning. And then once the family is ready, then we'll lean into the next step, which is communicating it to others at whatever phase they're willing to do it. So it could be step one, we're only going to talk structure, no dollars, no this, no that. Okay. And we can gauge where we feel if it's just a sharing. Some matriarchs and patriarchs just want to tell you what it is. And some want your opinion because obviously it's a revocable, it's a living document, we can change it still. So it just depends on what the family wants. If we feel that there's a need, we'll take up her time. Michael: So normally when we get to the family meeting that we're convening, she's coming to the family meeting or facilitating the family meeting? Vanessa: Well, we'd be the facilitators. The advisor would be the facilitator, but she would be kind of, I don't even know what to call it, a support person. Michael: Okay. And so then you like... Well, how do you explain her role presence to the family? Vanessa: Communication. Michael: She's going to be new to the meeting. Because they've seen you for a while now, but she's new to the meeting. Vanessa: I state it as she is going to be helping with communication styles. I mean, I'm fully transparent, obviously, with the name of Expressive Wealth on the door. Communication, I repeat it constantly. And they know of her because she's on the website. They know of her because we've talked about it. So it's kind of you already knew it was coming. Michael: Okay. And at the end of the day, just...you pay her by the meeting to engage with clients? Vanessa: Correct. Because she has her own practice. Michael: Okay. As a practicing psychologist. Vanessa: Correct, correct. The Low Point On Vanessa's Journey [1:19:45] Michael: Okay. So as you've gone through this journey, what was the low point for you? Vanessa: I don't think there's one low point. I think there's many. I think we go through ups and downs and it depends on maybe the time or the day, right? When you... sometimes I think of it when you have a baby and they're tiny and you're like, \"I wish they'd walk already. I wish they would talk already.\" And then when they do and you're like, \"Oh, man, I didn't want all that.\" I feel that happens with the business when you create it. Sometimes I want clients to fully trust me. Obviously, I have discretion over their portfolio and I'm like, \"Okay, just kind of let me roll with it. I got this.\" But then when clients fully trust you, then you start feeling quite a big burden, right? Because anything and everything is you. And of course, you consult, but you know when they're like, \"Vanessa, why are you asking me? You already know. It's what you say.\" But I'm like, \"No, we have to...we're going to educate you. Let me explain to you.\" And they're like, \"Yes, I get it. I know why you picked this or I know why you decided to change this or make this or recommend that we do these things.\" But those moments are difficult when there's volatility in the market, right? Because you carry that. You know it's not your fault. You know that you can only lean in on what you can control. And this is not something that we can control. But that doesn't mean that the burden isn't there. And that's something that you carry as an entrepreneur. So those moments come quite often. Michael: So how do you manage that burden when markets get volatile and it feels it's on your shoulders? Vanessa: I know I'm doing my best. And I literally have to remind myself of that, as well as I have skin in the game. Anything that my clients are in, I'm in. I'm that advisor that if there's something new and I'm like, \"Okay, let's try it.\" It's kind of like, \"Okay, let me try it first. I want to test the waters.\" Funny enough, like Bitcoin, years I was not a believer. Not to say that I am now, but too many clients were talking about it. And if I don't fully get immersed in it and understand it, not just poo-poo it away, right, I can't just be like, \"No, it's not real. It's not blah. I'm not I'm not going to talk about it.\" Right? You can't do that. Your client wants to talk about it. So besides being just educated on talking about it, I was like, \"Okay, let me give it a try. Let me put something in there so I can also see those pieces.\" So that way when you talk about the experience, oh, you feel it when it moves and I'm talking about it, I feel it because I lost too. So see, this is why more of this is instead of that. So I'm quite in there with them. Vanessa's Advice For Her Younger Self And For Newer Advisors [1:22:50] Michael: So what else do you know now that you wish you could go back and tell you from ten-plus years ago? Vanessa: Slow is okay. Actually, slow is good. Not okay. I make decisions sometimes too quickly. And some might say, \"Oh, that's great. You're right. You're not missing opportunities. You're not.\" But I think there is an aware piece that I was missing. So there's always those risky people and then there's risk-averse. But I think there's a third layer, which is that risk-aware. And now what I've done is kind of stepped into that phase of, \"Okay, sounds good, looks good. Let me do it. Let me have a quick test at it.\" And I love the fact that my partner, Lauren, is the opposite of me, because you need that. You need that diversity of thinking to be able to actually move forward. If you keep going one way, it can work. But how long is it going to work for? Right? So it's nice to have. I love that I have her as a partner and that we do think differently. And I think we just...we definitely make each other better because when I would make decisions quickly, I would say, \"Okay, this is a great idea.\" And then if it didn't work within a week, I'm like, \"Fail. Next.\" And I'm like, I didn't even give it a fair try now that I look back, right? Then I just kept shooting ideas. Michael: What was the most challenging one of those that whipsawed around in a not good way? Vanessa: Platforms. Michael: So like tech that you tried and then it didn't work out and then you moved on and wish you hadn't gone through it so fast. Vanessa: Correct. But you're caught in this whirlwind of \"Keep it moving, Vanessa. Keep going. You got to go on to the next thing. You just got to pick. You have to do this. You have to...\" I think no one was putting that pressure on me besides me. But now having Lauren as my partner, besides not just a sounding board, but also another intelligent mind that says, \"Hey, I think this and this, they're both good. But this is superior for this.\" And then we can debate it. But then come to a good answer for the team, for the clients we serve. Michael: So what advice would you give younger and newer advisors coming into the profession and wanting to get their career started? Vanessa: I think testing the waters. Basically, you could say, I don't want to say anywhere, but where the opportunities arise is good thing. The more exposure you have to the different options that are out there, the more educated your decision will be when you're ready to call it your career. So besides the kind of wirehouse model, the independent RIA, all of these different ones that exist besides just that, it's the culture that you're in, the mentorship or non-mentorship that exists in the company. The role, right? There's planners that can be not client-facing. Are you that kind of person that prefers not to, but you would really enjoy all of the pieces that are involved? Or do you really want to sit in front of the client? Testing all of those pieces. I would say this is a wonderful, wonderful career. And I'm sure there's other careers like it, but obviously, it's the one I chose and love. But I can't think, at least off the top of my head, a career where you get to learn from every single person that you sit with to make someone else's life better. And what I mean is the best practices piece, right? You come with a family and they share maybe things that they've done. Not so great, great. Work, not work. And now that just becomes part of my tool bag. And then I get to share it on with the next family. So I know that I'm kind of gifting other people's experiences to the next family, of course, and myself and my team's family. I don't know if other jobs have that, but I love that I get to experience that every day. What Success Means To Vanessa [1:27:56] Michael: So as we wrap up, this is a podcast about success and just one of the themes that comes up is the word success means very different things to different people. And so you're now on this wonderful path of success with the business. A hundred and thirty-five million dollars under management growing. The business is in a wonderful place. How do you define success for yourself at this point? Vanessa: I would say when I know that I've positively impacted someone's life to the point that they want to do the same for someone else, I've reached success. Michael: And so like a pay-it-forward moment...when you've created a pay-it-forward desire? Vanessa: Yes. Because it takes time to create that. But once you've been given that often enough and you cultivate that sense of giving brings joy and prosperity, then people will want to share. And that is success. Michael: I love it. I love it. Well, thank you so much, Vanessa, for joining us on the \"Financial Advisor Success\" podcast. Vanessa: Thank you for having me. Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Social-Image-FAS-434.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434.png\"\u003e\u003cimg decoding=\"async\" title=\"Vanessa Martinez Podcast Featured Image FAS\" src=\"https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-300x300.png\" alt=\"Vanessa Martinez Podcast Featured Image FAS\" width=\"300\" height=\"300\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-300x300.png 300w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-1024x1024.png 1024w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-150x150.png 150w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-768x768.png 768w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-1536x1536.png 1536w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-400x400.png 400w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-800x800.png 800w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-200x200.png 200w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434.png 1668w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-300x300.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-300x300.png 300w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-1024x1024.png 1024w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-150x150.png 150w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-768x768.png 768w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-1536x1536.png 1536w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-400x400.png 400w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-800x800.png 800w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434-200x200.png 200w, https://www.kitces.com/wp-content/uploads/2025/04/Vanessa-Martinez-Podcast-Featured-Image-FAS-434.png 1668w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003eWelcome everyone! Welcome to the 434th episode of the \u003cstrong\u003eFinancial Advisor Success Podcast\u003c/strong\u003e!\u003c/p\u003e\n\u003cp\u003eMy guest on today\u0026#39;s podcast is Vanessa N. Martinez. Vanessa is the CEO of Expressive Wealth, an RIA based in Chicago, Illinois, that oversees $135 million in assets under management for approximately 70 client households, including 10 \u0026#39;core\u0026#39; ultra-high-net-worth families.\u003c/p\u003e\n\u003cp\u003eWhat\u0026#39;s unique about Vanessa, though, is how her firm, in addition to ensuring clients have established a \u0026#39;traditional\u0026#39; estate plan focusing on the efficient transfer of their assets, works with its high-net-worth clients on what Vanessa calls \u0026#34;legacy planning\u0026#34; in order to not only pass down their assets to the next generation, but also the parents\u0026#39; family values that generated their wealth as well.\u003c/p\u003e\n\u003cp\u003eIn this episode, we talk in-depth about how Vanessa engages in a multi-meeting discovery process with clients (to first understand where they stand today with regard to estate planning and intra-family communication, and then to dig deeper into what the client wants to achieve through their legacy), how Vanessa has clients consider their family values for each of the accumulation, preservation, and distribution phases of their lifetimes (leaving room open to amend these values as their life and financial circumstances change over time), and why Vanessa has clients write down their values and legacy goals both to ensure their permanence (and to prevent misunderstandings that can develop when values are simply communicated verbally like the telephone game down the family tree over time).\u003c/p\u003e\n\u003cp\u003eWe also talk about how Vanessa\u0026#39;s intimate involvement in her clients\u0026#39; lives (from attending major life events to supporting family members going through life transitions) helps drive client referrals to their friends in similar life (and financial) situations, how Vanessa uses neighborhood-based client events (such as a \u0026#39;stocks and sip\u0026#39; evening of financial education and wine sipping) to draw in a select group of clients and their friends (without having any awkwardness for not inviting her full client roster that don\u0026#39;t live in that neighborhood), and how Vanessa has found success holding client events on Thursday nights given that attendees are often a good mood (with only one workday left in the week) while also avoiding filling up a valuable weekend night that prospects may not be willing to let go of to meet her.\u003c/p\u003e\n\u003cp\u003eAnd be certain to listen to the end, where Vanessa shares how she uses a practicing psychologist in a \u0026#34;Chief Clinical Officer\u0026#34; role to provide personality and communication assessments for her team and to facilitate communication when she brings together clients and their children in a family meeting to discuss the results of her legacy exploration exercise, how Vanessa has found that getting clients to focus on their legacy while still alive can allow them to answer questions from their children and to eventually deepen their relationship with their kids before any wealth is inherited, and why Vanessa ultimately views legacy planning as a way for clients to share their stories with the next generation so they value not just the dollars they will receive but also the emotional and intellectual wealth being passed on to them as well.\u003c/p\u003e\n\u003cp\u003eSo, whether you\u0026#39;re interested in learning about the difference between estate and legacy planning, how to engage in deep legacy planning conversations with clients, or using intimate client events to attract new prospects, then we hope you enjoy this episode of the Financial Advisor Success podcast, with Vanessa N. Martinez.\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" width=\"200\" height=\"200\" src=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg\" alt=\"Michael Kitces\" decoding=\"async\" srcset=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-300x300.jpg 300w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-768x768.jpg 768w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-800x800.jpg 800w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP.jpg 1022w\" sizes=\"auto, (max-width: 200px) 100vw, 200px\" data-src=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-300x300.jpg 300w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-768x768.jpg 768w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-800x800.jpg 800w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP.jpg 1022w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eMichael Kitces is Head of Planning Strategy at \u003ca href=\"https://wealth.focuspartners.com/michael-kitces?utm_campaign=ForConsumers\u0026amp;utm_id=Kitces\u0026amp;utm_medium=KitcesReferral\u0026amp;utm_source=Kitces\"\u003eFocus Partners Wealth\u003c/a\u003e, which provides an evidence-based approach to private wealth management for near- and current retirees, and \u003ca href=\"https://advisor.focuspartners.com/kitces/?utm_source=Kitces\u0026amp;utm_medium=KitcesReferral\u0026amp;utm_campaign=ForConsumers\u0026amp;utm_id=Kitces\"\u003eFocus Partners Advisor Solutions\u003c/a\u003e, a turnkey wealth management services provider supporting thousands of independent financial advisors through the scaling phase of growth.\u003c/p\u003e\n\u003cp\u003eIn addition, he is a co-founder of the \u003ca href=\"https://www.xyplanningnetwork.com/\"\u003eXY Planning Network\u003c/a\u003e, \u003ca href=\"https://advicepay.com/\"\u003eAdvicePay\u003c/a\u003e, \u003ca href=\"https://www.fppathfinder.com/\" target=\"_blank\" rel=\"noopener\"\u003efpPathfinder\u003c/a\u003e, and \u003ca href=\"https://newplannerrecruiting.com/\"\u003eNew Planner Recruiting\u003c/a\u003e, the former Practitioner Editor of the Journal of Financial Planning, the host of the \u003cem\u003eFinancial Advisor Success \u003c/em\u003epodcast, and the publisher of \u003ca href=\"https://www.kitces.com/blog/\"\u003ethe popular financial planning industry blog \u003cem\u003eNerd’s Eye View\u003c/em\u003e\u003c/a\u003e through his website \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e, dedicated to advancing knowledge in financial planning. In 2010, Michael was recognized with one of the FPA’s “Heart of Financial Planning” awards for his dedication and work in advancing the profession.\u003c/p\u003e\n\u003cp\u003eRead all of Michael’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=13\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\" target=\"_blank\" rel=\"noopener\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cbr/\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eNever miss a Financial Advisor Success podcast episode! Get notified of the latest episodes (and all our research as it’s released!) directly via email:\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\u003c/div\u003e\n\t\t\t\n\u003ch2 id=\"resources-featured-in-this-episode\"\u003eResources Featured In This Episode:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eVanessa N. Martinez: \u003ca href=\"https://expressivewealth.com\"\u003eWebsite\u003c/a\u003e | \u003ca href=\"https://www.linkedin.com/in/vanessa-n-martinez/\"\u003eLinkedIn\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eAre you a successful financial advisor, or do you know of one that would be a great fit for the Financial Advisor Success podcast?\u003c/em\u003e \u003cem\u003e\u003ca href=\"https://www.kitces.com/podcast/#apply-recommend\" target=\"_blank\" rel=\"noopener\"\u003eFill out this form\u003c/a\u003e to be considered!\u003c/em\u003e\u003c/p\u003e\n\u003ch2 id=\"full-transcript\"\u003eFull Transcript:\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Welcome, Vanessa N. Martinez, to the \u0026#34;Financial Advisor Success\u0026#34; podcast.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Hi.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I\u0026#39;m so excited to have you join us today and to get to dig a little into the dynamics that crop up when we start doing, it\u0026#39;s normally, I\u0026#39;ll say, estate planning for clients, although I know you have a little bit of a different approach to it that I think will be the focus for today. Because when I look historically, I mean, estate planning has, \u0026#34;always been a staple of financial planning in the CFP curriculum.\u0026#34; Because for most of our history of CFP, most people had an estate tax problem. If you go back to the 70s, 80s, and even the 90s, the estate tax exemption, topped out at $600,000. So a young couple with term insurance had an estate tax problem. And so we offered solutions with insurance and irrevocable life insurance trusts and all the tools and estate planning tactics we had.\u003c/p\u003e\n\u003cp\u003eAnd then over the past 20 years, the estate tax exemption rose dramatically from $600,000 to a million, to now, for a married couple, we\u0026#39;re closing in on $30 million, which means the number of taxable estates from the IRS fell 95% or more. And a lot of advisory firms kind of have moved away from estate planning and focused elsewhere. Either we do the income tax planning, a basis step up on the estate, or we just try to get documents in place with Encore Estate and Trust \u0026amp; Will and wealth.com and all the services that have cropped up.\u003c/p\u003e\n\u003ch2 data-nav-title=\"A Writing Exercise For Clients [04:50]\" id=\"having-clients-engage-in-a-writing-exercise-to-record-their-legacy-0450\"\u003eHaving Clients Engage In A Writing Exercise To Record Their Legacy [04:50]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e But to me, there\u0026#39;s always been another aspect of the estate planning side, which is taxes aside. Literally. Who gets what money, when, and how, and how does that shape the legacy of what\u0026#39;s left behind? And the more dollars that are at stake, the more legacy tends to take on a role. And I know that\u0026#39;s a domain you have spent a lot of time on that I\u0026#39;m excited to talk about, about, I guess, what does it mean to do legacy planning as distinct from estate planning? And I guess whether even you think that\u0026#39;s a fair distinction to make in our world.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e I definitely think there\u0026#39;s a difference. I think you said it quite well that the estate plans were truly created for tax optimization and to kind of tell a story on how you want those assets to transfer to the next generation. I guess how and when and who. We left out the human side of next-generation sharing. And that\u0026#39;s where I believe legacy planning comes into play. We need to share, not just our values. Many people have created a mission statement or family values, which I think is wonderful. And I think that\u0026#39;s the first step. But then we lean even further into it and need to share the stories behind the \u0026#34;what\u0026#39;s.\u0026#34;\u003c/p\u003e\n\u003cp\u003eI can tell you, \u0026#34;Okay, Michael, I\u0026#39;m adding you to my estate plan and this is what you\u0026#39;re going to get.\u0026#34; But if I don\u0026#39;t share with you how I created those dollars, then you might be unaware of not just all the sacrifices I made to create them, but also maybe partially my intention in giving them to you specifically. So I think legacy planning is digging really deep into those stories that we need to share with the next generation so they learn to value the dollars that we\u0026#39;re passing on, as well as the emotional and intellectual wealth we\u0026#39;re passing to them.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I\u0026#39;m struck by how you framed that. Legacy. I mean, I quote this exactly right. Legacy planning, sharing the stories with the next generation so they value the dollars we\u0026#39;re passing to them.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Mm-hmm. I think if you try to remember the day that your parents gave you XYZ dollar amount, it\u0026#39;ll be impactful in the sense like, \u0026#34;Oh, I remember the first time they gave me, let\u0026#39;s say, $15,000 for a down payment on my house. And that was it. I love them so much for it. They\u0026#39;re such great parents because they thought about it and saved it for me and gave it to me.\u0026#34; But now, if you go back and your parents shared with you the creation of that, so if they say, \u0026#34;When you were five years old, I got this promotion for a partnership at my practice and I remember picking you up from school, you had spilled ice cream on yourself and remember you gave me that project with the macaroni on it that I still have hanging. That day was the day I got the promotion, and that\u0026#39;s what propelled me forward for XYZ.\u0026#34;\u003c/p\u003e\n\u003cp\u003eSo now you\u0026#39;ve done two pieces. You\u0026#39;ve connected the next generation to your wealth creation. Right? You\u0026#39;ve told them how they were a part of that. And as much as we want to say as the matriarch and patriarch, we did everything, it\u0026#39;s impossible to be in a silo, right? We need all of those surroundings, which is our community, our friends, our family. So I think bringing them into the picture makes them value the dollars more.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So do you think of this as distinct from estate planning, an extension of estate planning, a whole different category aside from estate planning? Help us sort of connect together. How do you think about this from the perspective of what the industry does, and then how do you position this relative to engaging with clients?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e So this is not a plug, I swear. I\u0026#39;m completing my second book and the title of it is \u0026#34;The Emotional Heirloom.\u0026#34; And this is where I encompass and share a tool on how to be able to pass on your legacy that incorporates all three aspects, the emotional, intellectual, and financial wealth that gets created. And this gets created through the...what we\u0026#39;re used to, kind of the business cycle. When we think of it with our clients, it\u0026#39;s their cycle of life, their accumulation phase, their preservation phase, and their distribution phase. In each one of those phases, they\u0026#39;re developing wealth, all different types of wealth. And how that gets created are those lessons learned.\u003c/p\u003e\n\u003cp\u003eSo we were talking earlier about sharing best practices. We do it so much with our networking groups and our peers, but that sharing best practices should be a tool we use with families. This is that tool. This emotional heirloom is sharing best practices. So we have to share, not just sacrifices, the problems and issues that we face, the fears that we had, or what was our motivation on becoming a doctor, doing all those extra years of school, or anything that is your life story.\u003c/p\u003e\n\u003cp\u003eThere was reasons that everything happens. And I feel if we write it down, then we\u0026#39;ll be able to share it more eloquently with the next generation. Because I\u0026#39;m sure if you think back, \u0026#34;Wow, how many times have I told a story that happened many years ago?\u0026#34; And as you tell it to the next person, it becomes kind of the telephone game where you\u0026#39;re like, \u0026#34;Wait, did I do that? I don\u0026#39;t remember now.\u0026#34; So I think there\u0026#39;s those pieces of if you write it down as it\u0026#39;s happening, and you\u0026#39;re building out this beautiful emotional heirloom for the next generation, you\u0026#39;re going to have let\u0026#39;s...I\u0026#39;m not saying we\u0026#39;re lying, a little bit more truer stories, more tied to the facts of what happened in that moment, in that day.\u003c/p\u003e\n\u003cp\u003eAnd for me, it has not only served the next generation, but it serves me. When I go back into my journal and I look at these pieces, I\u0026#39;m like, \u0026#34;Wow, that happened this many years ago.\u0026#34; And I could see my millions of exclamation points that I have in my journal, or smearing from maybe where tears fell on my pages. But that shows me my growth in this journey of life.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so is this about...should I think of this in the context of journaling? This is taking clients through a practice of ongoing journaling? Or are we talking about something different?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e It\u0026#39;s a yes and.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e So there will be some journaling, there might be just a picture in time, there might be one piece of a device. So it\u0026#39;s not going to be a one-and-done, and it doesn\u0026#39;t, like our business, it\u0026#39;s not one-size-fits-all. So in the book, we go through multiple ways that you can create yours that is comfortable for you. And we\u0026#39;ll share what you really want the next generation to know and understand.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So then help me understand a little bit more, just what\u0026#39;s the tool?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e It is writing.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e You can say writing, scrapbooking. It could be an intentional letter that\u0026#39;s then attached to it. It could be all placed in a box. It can be placed in a book. So it just depends on your personality and your style.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And then what\u0026#39;s the process? Are you trying to give them particular prompts of things to write about?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes. I think that is much needed, because if I were to tell you to just grab a pen and paper, for some of us that enjoy it, it\u0026#39;s fairly easy. But for those that do not, I need you to help me. What do you want me to talk about? I want a fear. What is your fear today? What do you think your fear was then? So it\u0026#39;s specific. So we try to... In the book, there will be worksheets, and in there, it\u0026#39;ll have a prompt with an example. So it\u0026#39;s not only telling you share this, but it says share this and it sounds something this.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So can you give me some examples of the kinds of prompts that you would take clients through?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Maybe our first question would be, what\u0026#39;s your relationship with money? Or what do you believe your relationship with money is? Then we\u0026#39;ll give examples of does it prompt you a need to save? And is this because someone in your family told you or you didn\u0026#39;t have enough? Or maybe it\u0026#39;s any circumstance that could have come.\u003c/p\u003e\n\u003cp\u003eSo it gives you a full example of a story that could be told based on someone who selected a fear of money or some people that get excited with money. Why are you excited about money? Maybe you lived through an era where it was replenished daily and you had more than enough of it. Okay, so that makes you excited. Great. Now let\u0026#39;s dig deeper. So that\u0026#39;s kind of what the book does. It makes you understand why you feel what you feel by prompting multiple questions.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so how many questions do you take people through?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Only three through each phase. So thinking through accumulation, preservation, and distribution, each phase will have three. So it\u0026#39;s not overwhelming, right?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e I think some might want to write more, and that\u0026#39;s fine. But because we believe this tool adds so much value to leaving that lasting legacy that...we can keep it short and sweet and be intentional with these pieces that should be shared. Hence why I\u0026#39;m writing the book with a doctor in psychology. Because there\u0026#39;s different phases that we go through as well at different, sometimes ages of our life and sometimes different circumstances. So we kind of tying two pieces together while we\u0026#39;re doing this.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Questions To Explore Financial Lives [15:49]\" id=\"questions-for-clients-exploring-the-accumulation-preservation-and-distribution-phases-of-their-financial-lives-1549\"\u003eQuestions For Clients Exploring The Accumulation, Preservation, And Distribution Phases Of Their Financial Lives [15:49]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So help me understand how questions tie to each phase. I mean, I\u0026#39;m presuming at the point I pick up the book or at the point I become a client, I\u0026#39;m in one of these phases, which is kind of cycle of life, accumulation, preservation, distribution. So how does this flow through three phases if I\u0026#39;m living in any particular one right now?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e So let\u0026#39;s say you\u0026#39;re in preservation phase, regardless you\u0026#39;re reading a book, a normal book. So that meant you\u0026#39;ve already skipped chapter two, which is accumulation phase, but that doesn\u0026#39;t mean you can\u0026#39;t go back and write about it. And another piece is it\u0026#39;s not linear, right? So today you could tell me, \u0026#34;Vanessa, I\u0026#39;m in preservation phase.\u0026#34; And then we can talk five years down the road and say, \u0026#34;Nope, just kidding. I had this big life event, something happened with my company, something happened with this X, Y, Z, and I had to go back to accumulation phase.\u0026#34; That\u0026#39;s okay, because that is life, right?\u003c/p\u003e\n\u003cp\u003eSo it\u0026#39;ll tie the pieces together that in some cases, you might want to answer the same question for the phase that you\u0026#39;re in, but we try to tie accumulation more to a motivator because it\u0026#39;s your beginning. So we need to know, okay, what\u0026#39;s triggering you to move forward? What\u0026#39;s making you want to take the next steps? So there is specific pieces that we try to make intentional on the phase, but we also don\u0026#39;t want to create that stigma that, oh, if you\u0026#39;re 20 to 39, you\u0026#39;re in accumulation, but after 40, you should have already hit preservation mode and you should keep that until you\u0026#39;re 60, right? So we\u0026#39;re trying to get away from that. So we tie what it could be, should be, would be, all of those in the questions.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And then likewise, do I have to wait to get to distribution phase to start writing my takeaways around distribution phase? Is this like a living document thing I\u0026#39;m creating and adapting over time for my family?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes. It should be a living document as is an estate plan, right? As things change, you change, your decisions change. So in this case, I would say it\u0026#39;s kind of what we talked about right now. If you\u0026#39;re in preservation phase and then you have to go back to accumulation phase because something devastating happened and you need to start all over, which is okay, then you can kind of go back and not necessarily rewrite, but add to it. And as far as moving forward, because I agree with you, because I do like to write, I\u0026#39;m more about this is what I would like for it to look like. And then you could reread it for yourself and see where you\u0026#39;re at. But this is something that you can deliver.\u003c/p\u003e\n\u003cp\u003eSo when it comes to what you\u0026#39;re saying, it\u0026#39;s a living document. It is very much like an estate document that you can amend and change. But once you\u0026#39;re ready to share, and maybe you share phase by phase with family because you\u0026#39;re like, okay, I think I\u0026#39;m done with this and I really want to share this with them now, you can. And if you say you want to wait a little longer, you can.\u003c/p\u003e\n\u003cp\u003eI think in the past, estate plans, because why they were created for, tax optimization. And in some cases, we hear people say rule after the grave. What was written in them was quite different than now. I believe many families, at least in my experience, have wanted to start gifting during lifetime. I don\u0026#39;t know if COVID did this to everyone, but you want to share in the memories. You don\u0026#39;t want... You want to be a part of it.\u003c/p\u003e\n\u003cp\u003eAnd I used to tell families this all the time when we would sit together, \u0026#34;The last thing I want is to then deliver these huge inheritances to the next generation and see the smiles on their face, the ideas that they have of what they\u0026#39;re going to do with everything and the light in their eyes and the gratitude. And that doesn\u0026#39;t...that appreciation doesn\u0026#39;t belong to me. Right? That\u0026#39;s for them. And now they\u0026#39;re not here to see it.\u0026#34; So after living through moments that, it became so important for me to make sure that the real people that should live through that appreciation are the creators. And if they do some of that during lifetime, they get to enjoy it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So I guess I\u0026#39;m just trying to visualize further. Can you share maybe one of the questions from each of the three phases? I\u0026#39;m just trying to visualize, what am I writing about or asking a client to write about as they go through each phase?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Okay. So you can\u0026#39;t hold me to this because my editor is still reviewing.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Understood. Understood. We\u0026#39;re giving examples from a manuscript in motion.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes, to get a sneak peek. So in the accumulation phase, one of the questions is share about your emotional relationship with money and how it\u0026#39;s impacted your accumulation phase of life. And then in our example, if you\u0026#39;re apprehensive regarding finances, maybe you\u0026#39;ve avoided taking a deep look at your finances investments in order to reduce the risk of mistakes. If you have set high expectations for your earning goals, you may hyperfocus on working extra hours or jobs, etc., to get the financial results you hope you have for your life.\u003c/p\u003e\n\u003cp\u003eSo here, it\u0026#39;s what are you feeling? Is it hot that you\u0026#39;re setting high expectations, or is it that you\u0026#39;re apprehensive? And why is it? So it\u0026#39;s making you continue to ask yourself. So this is right in the beginning, right? That\u0026#39;s accumulation. Then we go into preservation. And this one, it\u0026#39;s asking for advice. So it\u0026#39;s more of give some advice on your emotional growth and share an experience that propelled this progress.\u003c/p\u003e\n\u003cp\u003eSo if your advice is something like \u0026#34;Be intentional on having difficult conversations, even when you know they might lead to an outcome you don\u0026#39;t want.\u0026#34; Let\u0026#39;s say that is your advice. The experience shared here will give insight to not just take the advice, but to see what can happen when you do. We want the next generation to feel part of the journey.\u003c/p\u003e\n\u003cp\u003eAnd the distribution phase. Create a list of meaningful mentors you\u0026#39;ve had throughout your life, starting from childhood to today. Share about how you see the impact reflected in your present. These people can be family members, professors, friends, therapists, etc. This is a time to reflect on what a significant impact any one individual can make in another\u0026#39;s life.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Interesting. And in theory... I guess in theory. In practice, as I\u0026#39;m doing this, as someone going through this, I\u0026#39;m writing it. I\u0026#39;m writing the answers to these in a journal. I\u0026#39;m typing them in a Word doc, depending on my written mode of preference. But I\u0026#39;m sitting down and trying to write out answers to these.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes. I think the newer generation might be jotting them down in their notes tab on their phone. But yes, that\u0026#39;s exactly what this is.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So then when or how do I share this with the family?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e So this is an answer that we...well, I do not like, but it is the right answer. It\u0026#39;s called it depends. There are family meetings that can be held, that can be, in my opinion, should be held. And you can share both of the monetary aspects that travel through and how and why, as well as this emotional heirloom. So it just really depends on the style that you live with your family. Right. Do you meet consistently? Is it just over Christmas that you all get together? Some families have a lot of family meetings throughout the year, right? So is this the special one where we share this? It just depends.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And otherwise, I\u0026#39;m... I\u0026#39;ll have a document that says, \u0026#34;Please read this that my children or grandchildren find when I pass away.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e I would not like that as an option for anyone personally.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. Why not?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Because the idea is if...that they get to ask questions. You would think that you\u0026#39;d be thorough enough to answer all of these things for yourself. But if you gave me your list of mentors, I would say, and you just listed them and said what they did for you. How about if my question is, well, which one impacted you most? Can I talk to them? Can you do an intro? I\u0026#39;d love to hear what they think about you. So it\u0026#39;s really deepening the relationship you have with your family. And that would be a little difficult if I\u0026#39;m just going to go back and read it. But I get it. For some people, this is a difficult and uncomfortable phase that I would hope through motivation, you can embrace it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And is this intended for those very, very high net-worth folks who are moving a lot of dollars?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Definitely...\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I mean, is that kind of the idea? There\u0026#39;s a lot of wealth. I probably need to give more context to this than just literally bequeathing them millions of dollars or tens of millions of dollars, depending on how far you are up the net worth scale. Is that the idea in context of this?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Definitely not. That is actually... I don\u0026#39;t want to say it\u0026#39;s the opposite because then I\u0026#39;m doing the same thing. I think I know this is for everyone because wealth or riches aren\u0026#39;t tied to dollars. So if I\u0026#39;ve lived with my family who has given me a tremendous amount of emotional and intellectual wealth, I can consider myself just as wealthy as Elon Musk, right? I don\u0026#39;t need dollars to impact the level of my wealth, but I do need these stories to remind me of how wealthy I am.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Legacy Planning Convos In Practice [27:03]\" id=\"putting-legacy-planning-conversations-into-practice-with-clients-2703\"\u003ePutting Legacy Planning Conversations Into Practice With Clients [27:03]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So how does this work in practice? I mean, you\u0026#39;re writing the book now because of a version of this that you\u0026#39;re doing in practice with clients. How does it work as a part of the advisory work that you do with clients?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e So it\u0026#39;s an introductory level still. I wanted to have the book completed because then it becomes a full tool and it leaves... I mean, you can be flexible. Like I said, there could be additional questions asked, but at least it\u0026#39;s a guiding light. And I wanted to have it complete before going super deep into it with the clients and saying, \u0026#34;Okay, we have a deliverable and let\u0026#39;s get it going.\u0026#34; But it does start with the family meetings. And the family meetings, I think sometimes when we think of this, or I don\u0026#39;t know what you think of when you hear family meeting, do you think of a big table with ten people sitting around it or do you think just a partner?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I feel like there\u0026#39;s two versions of family meetings that get put out there. There\u0026#39;s some kind of raucous home for the holidays thing. And there\u0026#39;s what really, really rich people do or family meeting has a whole other meaning to it because we\u0026#39;re having a family meeting to talk about the governance of the wealth of the family. I don\u0026#39;t feel I have talked to a lot of clients over the years that say we have family meetings.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e And I think you are 100% right on what the view is. And that\u0026#39;s why in some cases it makes it very difficult to embrace it because you\u0026#39;re thinking, \u0026#34;Oh, no, that\u0026#39;s for those people or no, that sounds overwhelming.\u0026#34; So I\u0026#39;m calling it a family meeting because everyone listening, you were in the financial industry, right?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Yup.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e So we kind of get the idea. But it\u0026#39;s exactly what you\u0026#39;re saying. It\u0026#39;s just sitting with the family and talking, but being intentional on what you want to share in that moment. And I feel that the intentionality piece is what\u0026#39;s lost tied to how you communicate. Right? So if you just walk downstairs and you\u0026#39;re getting the kids ready for school and you\u0026#39;re like, \u0026#34;Knowledge is power.\u0026#34; And you send them off to school, they might remember it. Right? And at some point, they might think it\u0026#39;s silly that you say that. And maybe you say it every day.\u003c/p\u003e\n\u003cp\u003eBut the intentional piece would be to say, \u0026#34;Hey, people have movie night and they have game night.\u0026#34; This is kind of that. If we can make it more normal, then I believe that we would end this shirt-sleeve-to-shirt-sleeve losing of inheritance and not just the dollars piece, but also the wealth and richness of culture and stories because it\u0026#39;s not shared. And that\u0026#39;s why we have history classes. We have it because we want to learn from it and grow from it. And in some cases, it was done very well and we want to just repeat it. So if we don\u0026#39;t do that with our families, who will?\u003c/p\u003e\n\u003cp\u003eSo the idea would be, let\u0026#39;s say there\u0026#39;s one of the partners that\u0026#39;s a little more adamant on, \u0026#34;Oh, I love this idea. Let\u0026#39;s start it. I\u0026#39;m going to make him or her join us and be a part of it.\u0026#34; It\u0026#39;s just about having the conversation and saying, \u0026#34;Okay, what do you want to share with the kids?\u0026#34; \u0026#34;I only want to share that we\u0026#39;ve been building this and we\u0026#39;re thinking of keeping the lake house,\u0026#34; let\u0026#39;s say, in this case. Do they want it? Do they not? Okay, let\u0026#39;s talk about it. And then you\u0026#39;re intentional on what questions you ask and what you share.\u003c/p\u003e\n\u003cp\u003eSo it\u0026#39;s really just having conversations. But sometimes, most times, we\u0026#39;re worried of what other people will say and how the communication, and will they hear me, really hear me and what I\u0026#39;m trying to say and not take it the wrong way. So what do we all do? Avoid it. That\u0026#39;s just what we do. It\u0026#39;s natural to avoid, avoid conflict, avoid just any of that.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So how do you help clients unavoid when some of them probably do go right into avoidance mode? \u0026#34;You\u0026#39;re going to have a family meeting about this,\u0026#34; like, \u0026#34;Nope, I\u0026#39;m not.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes. So it takes time. And just everything else in life, what do we do? When we\u0026#39;re scared of something, besides avoidance, because that\u0026#39;s the first step. The second one is making a decision. So if you make the decision to say, \u0026#34;Hey, I do want a healthy legacy, I do want these things, but I\u0026#39;m scared to do all of these things that you\u0026#39;re saying.\u0026#34; So then we say, \u0026#34;Okay, let\u0026#39;s do one thing first, just one thing.\u0026#34; And in some cases, we\u0026#39;re the doers. Right?\u003c/p\u003e\n\u003cp\u003eSo it might be you want to tell the family that you want to gift them X, Y, Z, whatever it is, then maybe we\u0026#39;re the liaison that facilitates that first piece. And then once they see the outcome, then they\u0026#39;re like, \u0026#34;Oh, I could do this. I\u0026#39;ll do this next time.\u0026#34; So whatever it is, we do smaller steps until they get to the comfort level, both them and the children or the beneficiaries. Everybody has to kind of... and that\u0026#39;s what makes them a little difficult sometimes. But if you\u0026#39;re not making it a state-of-the-union type of meeting and it\u0026#39;s truly just let\u0026#39;s get together and talk, it flows quite nicely.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So does that mean there are times when you, your firm is actually involved in trying to facilitate one of these conversations or just the first one for a client who\u0026#39;s trying to take their first baby step?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yep. We definitely are. We\u0026#39;re part of the pre and the during.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so can you share more about how that works in practice? How are clients even delivering the message and convening this meeting together when they\u0026#39;re not used to doing that and you\u0026#39;re going to be in the room and everyone\u0026#39;s figuring this out for the first time?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e You know, it\u0026#39;s funny how you phrase that, because I guess that\u0026#39;s not how it\u0026#39;s thought. But it\u0026#39;s just funny to think it through that you\u0026#39;re like, \u0026#34;Oh, and the financial...our financial advisor will be there.\u0026#34; I think that this works well when you are so intertwined with the family. That it\u0026#39;s... And Vanessa\u0026#39;s coming because she\u0026#39;s going to help. That\u0026#39;s how it how it\u0026#39;s said. And it\u0026#39;s more we\u0026#39;ve been preparing for this along the way, right? Because you have more than one generation that you\u0026#39;re managing their overall wealth.\u003c/p\u003e\n\u003cp\u003eSo you\u0026#39;ve kind of gently slipped this in in multiple conversations. Like, how would you feel if you know we all got together and talked about this? How would you feel if we got all together? How would you feel if we all got together? And of course, asking, can we share? Right? Can we share what your thoughts are on this? And then getting to the point where, yep, kids are ready. Are you ready? I\u0026#39;m ready. Let\u0026#39;s do it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so how do you get to the point that you\u0026#39;re already in front of the kids? I mean, so are you in a world of very high-dollar clients with multi-generational wealth and you\u0026#39;re up and down the family tree already?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e I am.\u003c/p\u003e\n\u003ch2 data-nav-title=\"UNHW Multi-Generational Families [34:51]\" id=\"how-vanessa-serves-unhw-multigenerational-families-3451\"\u003eHow Vanessa Serves UNHW Multi-Generational Families [34:51]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So then help us... Then I guess let me take a brief step back, say, help us understand just the clients that you work with and the and the firm itself. Who do you work with, and what do you do? And the client...and how many clients you serve? Just help us visualize the business itself.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e I have a blend. We\u0026#39;re broad. So we have individuals and families, because some people, it\u0026#39;s just one person and maybe the beneficiaries end up being something more like a charity or nieces and nephews, but still beneficiaries. People that are forming their business and inheritors. So it might go where I get another generation and then slowly have to just communicate with the generation above them. So it does make it complicated, depending on which one lands with us, right, which one selected us first.\u003c/p\u003e\n\u003cp\u003eBut then over time, it\u0026#39;s truly just information-sharing. I think when you look at maybe children, I\u0026#39;ll call them, even though they\u0026#39;re adults, but they\u0026#39;re someone\u0026#39;s children and they\u0026#39;re in their 50s. And they want to understand what\u0026#39;s going to happen next because they\u0026#39;re trying to make plans for their estate, right? And they\u0026#39;re trying to organize their trusts in a tax efficient manner. But you can\u0026#39;t fully do that unless you know what\u0026#39;s falling into your estate.\u003c/p\u003e\n\u003cp\u003eOr if anything is falling into your state, and typically, you know, right? You know there\u0026#39;s something, you don\u0026#39;t know when, how much, what, or all of those details. But even their communication sharing, right, if your children were to ask you, \u0026#34;Hey, dad, how much are you going to leave me or what\u0026#39;s in the estate?\u0026#34; I don\u0026#39;t know what your reaction would be. My assumption is it wouldn\u0026#39;t be very positive if the question is asked that abrasively.\u003c/p\u003e\n\u003cp\u003eBut now if your child is in their 40s and 50s and they\u0026#39;re building their estate plan and they say, \u0026#34;Hey, dad, can you... You know what, I\u0026#39;m really trying to build this out for me. And do you have recommendations? Can you point me in the right direction? What do you think I should and shouldn\u0026#39;t do here? Look at this with me.\u0026#34; Then you\u0026#39;ll be more willing to say, \u0026#34;Oh, okay, hold on. I think you should do this because we\u0026#39;ve done this. And let me kind of guide you here.\u0026#34; Or it might be, \u0026#34;Let me connect you with my attorney,\u0026#34; which is what some people do, right. Some people don\u0026#39;t...are not ready to share. And that\u0026#39;s okay. But at least if you\u0026#39;re connected with that attorney, you still have the piece of confidentiality. But you can still guide the next generation to make sure that their plan ties efficiently with the matriarch and patriarch.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so how many clients, or I guess households do you, because I\u0026#39;m assuming multi-generationally, can I have multiple clients in one household across the generations? How many clients or households do you guys do this with in practice today?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e It\u0026#39;s not all of the AUM we have. We do it right now with ten families.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay, ten high-dollar families.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Families, that\u0026#39;s multiple generations. Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And then what\u0026#39;s the, I guess AUM base or revenue base? I don\u0026#39;t know how you measure it in the context of the business. What\u0026#39;s the...\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Right now, we\u0026#39;re at $135 [million].\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And so you end out very deep with these ten core families that have large dollar amounts getting into presumably both the portfolio management side, because there is AUM here as well as all of these estate legacy conversations?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So can you walk us through then what the planning process is? I mean, if I am a new, prospectively new high-dollar household that says like, \u0026#34;Yeah, Vanessa, this...I think we need to sort through this for ourselves and what we\u0026#39;re going to leave for our kids, for our family. I want to become a client.\u0026#34; How does it work? What\u0026#39;s the process that a new client goes through when they say I want to do this with your firm?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e It\u0026#39;s knowing where they are today. So most likely, they have something in place. I\u0026#39;m hoping an estate plan. They probably have a net worth built out, maybe even a financial plan already created. So it depends on where they are. We want to make sure we understand a snapshot of exactly what they have today and what they\u0026#39;ve done. That\u0026#39;s always the most important piece. So, of course, if we think of it all of our websites, right, we have a discovery session. Of course, we have that because we want to understand all of your pieces. And I share this with clients, and I think we\u0026#39;re very similar in this thought process, is that I need to understand all the pieces to be able to give you any and all recommendations. It won\u0026#39;t happen if I\u0026#39;m not understanding what else you have and what else you\u0026#39;re doing.\u003c/p\u003e\n\u003cp\u003eSo you know how you have some clients that might just want to hand over a portion or are wary of what comes next. So we have to sit with them and understand, \u0026#34;Okay, just share with me, not because I\u0026#39;m trying to push you to give me all of these assets, just so I know how and why they\u0026#39;re invested that way. And I need to understand how many properties, I need to understand what states they\u0026#39;re in.\u0026#34; So I think that discovery piece is the most, most, most impactful meeting to start to dig into everything they have. Once you have that and you collaborate with them to confirm, \u0026#34;Okay, this is all correct. This is what you\u0026#39;re looking like,\u0026#34; then you can go into \u0026#34;Now, what is your goal?\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd in your case, you\u0026#39;re saying, okay, I want to do the legacy portion. Then we have to talk about, okay, do you want to do lifetime gifting? Or is your plan all after death? So it\u0026#39;s very convoluted because it really depends on where you are and what you want to accomplish. The end goal would be, we are intentionality on communication. Let\u0026#39;s communicate, not just with each other as advisor-client, but also between each other, right? Because I\u0026#39;m sure we\u0026#39;ve all seen it, that you have one spouse who knows 95% of everything that\u0026#39;s going on and another that can range anywhere between 2% to maybe 60%.\u003c/p\u003e\n\u003cp\u003eSo you can\u0026#39;t just jump the gun and go straight to, oh, let\u0026#39;s do a legacy planning because this is fun. We get to talk about our values, and our mission, and our whys, and all of these wonderful pieces if you two don\u0026#39;t even know. So that is piece one. If we\u0026#39;re talking about, besides asset allocation and asset location, now let\u0026#39;s talk about what do each of you fully know and not know about what\u0026#39;s going on. And then it\u0026#39;s kind of transparency, right? If we can have transparency between them, then this process is much easier to pass on.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So I\u0026#39;m just trying to visualize how this flows in terms of meetings or timeline with the client. So it sounds meeting number one is discovery, is a discovery meeting. How long is that meeting? How long does it take to dig into this much stuff?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e It\u0026#39;s a few meetings. I think it shouldn\u0026#39;t be the end goal of, oh, it takes ten meetings and then we\u0026#39;re done with this. That\u0026#39;s just not how this is. This is a very fluid process and it\u0026#39;s going to be dependent on how fast or how slow you want to go, how much you\u0026#39;re willing to be vulnerable and share, and how long it takes for you to become vulnerable and share. So it\u0026#39;s not quantifiable like that. This is not, as our wonderful listeners, those math people, which I am too. I like that, right? I two plus two equals four. But this is not one of those cases. This is going to be, \u0026#34;it depends.\u0026#34; And of course, we have life happening as this is all going down.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So at least in the ideal flow, what comes after discovery? I mean, you talked about asset allocation. Is the investment side of things next for you because you\u0026#39;re running an assets-under-management model? Is there some other meeting in the process? What comes next if I\u0026#39;m following the normal process?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e So if you\u0026#39;re following the normal process, first, we learn about each other and understand what do we have at hand, right? Then the second, let\u0026#39;s call it meeting just to kind of keep a flow here, would be, okay, now, what do you want? What is the end goal or what is a short-term, midterm and long term [goal]? We can have multiple goals. After we establish that, then I can make recommendations as to let\u0026#39;s establish a timeline, right?\u003c/p\u003e\n\u003cp\u003eNow, because I understand you, you understand me, and I\u0026#39;ve established what we need to do to get you to that, now I can say, \u0026#34;Okay, this is going to take, let\u0026#39;s say, five steps.\u0026#34; And it might be different for everyone because of the urgency of what comes next. So let\u0026#39;s say you don\u0026#39;t have an estate plan and you come to me and you do need one. So we need to get that done, right? If you have children, it just depends on your situation will change the priorities of which step comes next.\u003c/p\u003e\n\u003cp\u003eBut if we want to say, streamline, you came out of a box and let me cookie-cutter this after the discovery and understanding your wishes, I make recommendations, we can get the assets invested. We review both your estate plan and any tax, your previous tax return to kind of make sure that those two pieces tie to each other. In this process, we\u0026#39;ll find that maybe things aren\u0026#39;t titled correctly. So that is a quick and easy fix on our side because we\u0026#39;re just listing it. That can take a year for some people. If you have private equity, venture capital, all of these different, more complicated ownerships, they take longer to then title into your estate plan.\u003c/p\u003e\n\u003cp\u003eThen after we complete that, and like I said, first you have to be in order. You can\u0026#39;t share disorder. So once you\u0026#39;re in order, then we can kind of get into this family narrative, right? Composing this emotional heirloom that then can be shared with the family. And it can be done through phases, just like everything else. And what I said, it depends on the person, right? I have those people that are similar to me, type A, and only know one speed and it\u0026#39;s super, super fast. So those people, we can move a little faster where I can say, hey, I need you to change the title on these three things. And they\u0026#39;re like, okay, three weeks later, they\u0026#39;re like, \u0026#34;Done. What\u0026#39;s next?\u0026#34; \u0026#34;Oh, perfect. Now let\u0026#39;s go on to the next.\u0026#34;\u003c/p\u003e\n\u003cp\u003eBut if you don\u0026#39;t work at that pace, it\u0026#39;s not my pace. It has to be your pace, what you feel comfortable with, because you\u0026#39;re going to find joy in all of these phases. So I want to take your pace once you\u0026#39;re done with that. Or some people will get overwhelmed if I\u0026#39;m like, \u0026#34;Okay, first we have to make sure we amend your estate because we reviewed these three things and you\u0026#39;re not up to date after the laws have changed. You need accumulation. You need this. You need that. If I start spewing all of these things out at someone, the first thing they\u0026#39;re going to say is, \u0026#34;I\u0026#39;m out. You\u0026#39;re too much. This is... I can\u0026#39;t do this.\u003c/p\u003e\n\u003cp\u003eSo that\u0026#39;s why I always believe in the platinum rule, right? It\u0026#39;s not treat people how you want to be treated. It\u0026#39;s treat people how they want to be treated and tying this to communication. It\u0026#39;s not my style of communication. You have to learn what theirs is. And if you want them to follow along and truly reach these goals, you have to meet them where they are. And take those steps as they\u0026#39;re embracing one by one.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e With the asterisk, when you\u0026#39;re working with very-high-dollar clients with a lot of complexity, there\u0026#39;s a lot of moving parts just to get to where they are.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes, yes. And you have to be understanding of these things. I think that\u0026#39;s also the case.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so I\u0026#39;m presuming that the level of complexity of high-dollar clients is also why, if I heard right, even the discovery layer is essentially two meetings. The first is, I just need to know where you are today and all the things you\u0026#39;ve got now. And meeting number two is, okay, now we can actually start talking about goals and what you want and where you\u0026#39;re going. We have to do that in two meetings because it\u0026#39;s too much to get through in one.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e For sure. Unless you have that person that comes in with a binder and says, \u0026#34;Ask me a question, any question.\u0026#34; And they turn to the page because they got the little post-its on it. If you got one of those, then maybe you can get it done in a meeting.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Yep. So then in this kind of model, I mean, how many meetings do you have with clients through the first year? Is you\u0026#39;re just blocking and tackling through this much stuff?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Normally, the first year, and I would say the first quarter, is more intense. Because if you have a client that is actually getting the pieces done that you\u0026#39;re requesting, you need to make sure you follow through with that. If you have a client that you\u0026#39;re like, \u0026#34;Hey, can you get this done?\u0026#34; And they automatically tell you, \u0026#34;Hey, it\u0026#39;s going to take me a month or two months to get that to you,\u0026#34; okay. Then you just put them on pause. Right? And then you have the follow-up. Of course, all our wonderful task managers and will remind us to give them a call to check in. But if not, then you got to go the other route.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so what does it add up to over the span of a year?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e For a new client that wants to be involved and is responsive, I would say probably at least six meetings.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e But I think if we\u0026#39;re in this case, because I know it can sound overwhelming, because then you\u0026#39;re like, \u0026#34;Oh, and then there\u0026#39;s more clients and then there\u0026#39;s more meetings and then there\u0026#39;s more things.\u0026#34; Really, if you establish a really great relationship with them and they\u0026#39;re trying to be intentional on getting a project completing, not necessarily, \u0026#34;Hello, Mr. Client. How has your...\u0026#34; No. We don\u0026#39;t have to do that. I just talked to you last week. Right? I know what\u0026#39;s happening. You already told me what\u0026#39;s happening. We\u0026#39;re having this call today to get this and this done. Right? That\u0026#39;s it. So it\u0026#39;s not an hour to two-hour meetings, every single time. And I want my clients to know that they can reach out to me whenever and how many times they want, knowing that they\u0026#39;re going to have that purpose.\u003c/p\u003e\n\u003cp\u003eAnd as we know, we have some clients that do what they do, no matter what we say, no matter how we act, no matter how many rules we put in place, that...we can\u0026#39;t change that. Right? But the same way that you create a culture in your practice, you also create that with the families that you work with, and they\u0026#39;ll understand your style and you\u0026#39;ll understand their style. And in some cases, it might be, \u0026#34;Hey, that\u0026#39;s perfect. So for the next three things, I\u0026#39;m going to have Kasha reach out to you and she\u0026#39;ll get that done for you.\u0026#34; \u0026#34;Oh, of course. Sounds great.\u0026#34; It\u0026#39;s just about expectation. I know it\u0026#39;s easier said than done. I\u0026#39;m making it sound it\u0026#39;s easy. I know it\u0026#39;s not.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Expressive Wealth\u0026#39;s Fee Model [52:14]\" id=\"expressive-wealths-aumbased-fee-model-5214\"\u003eExpressive Wealth\u0026#39;s AUM-Based Fee Model [52:14]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So what\u0026#39;s the actual business model for you? Are you assets under management fee? Is there retainer fees or minimums? How does the business model work?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Ninety-nine percent is AUM.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And how does fee schedule work for you when you\u0026#39;re working with high-dollar clients this?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e It\u0026#39;s a tiered approach and depending on the complexity, we\u0026#39;ll sit and talk through what works best and what\u0026#39;s fair, to be honest, because we have some things that are... I am very considerate when it comes to that in the sense if you have something that\u0026#39;s locked up and there is absolutely nothing that can be done, there\u0026#39;s no way I\u0026#39;m going to charge you for that because there\u0026#39;s nothing I can do with that. Even though I am incorporating it into our plan, if I can\u0026#39;t actively make a decision whether to hold, buy, or sell something, then my advice has no relevance if I can\u0026#39;t do anything.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So does that mean you may otherwise charge an assets under advisement fee?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Correct.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Anything on their balance sheet that you can advise on not just the assets that are regulatorily managed?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Correct. But that\u0026#39;s why I\u0026#39;m saying 99 is AUM, 99% is AUM. It\u0026#39;s very...\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Which is being actually managed assets?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Correct. Correct.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And so how did the tiers work for you? Where do you put breakpoints when you\u0026#39;re...the account balances can get pretty large?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e After ten. We\u0026#39;re at...between ten and 20. We\u0026#39;re at 70 bps [basis points].\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e After ten million, you\u0026#39;re at 70 bits?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Mm-hmm.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And then does it... Is there another breakpoint above 20?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e We talk that through with those clients.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. Okay. Is there a minimum for you?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e I would say I don\u0026#39;t have one now, but... I don\u0026#39;t think I\u0026#39;d go lower than 60 bps, mainly because I\u0026#39;m not your asset manager. I\u0026#39;m your wealth advisor. And if you value all of the additional care advice that I give you on absolutely everything you do, you\u0026#39;ll agree to that.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Is there an asset minimum that they have to bring in the door just to be eligible to fit for the services as a client in the first place?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e No. No. That was something that we were intentional on. Obviously, we have our own models, so we\u0026#39;re individual stocks and bonds. Which means that at a certain dollar amount, it makes it almost impossible to diversify properly. And that\u0026#39;s not our model. So to do that, yes, we do need a certain dollar amount, but I just want to do what\u0026#39;s right by the client. And based on how we do things, it makes it impossible to diversify you. But of course, there\u0026#39;s family members, there\u0026#39;s referrals that we want, and everyone is valuable. So we have different flows on how to work through those.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e How do you manage capacity when you\u0026#39;re going after a decamillionaire households, but...and anyone can potentially be a client and take a slot?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e The way we look at that is we are growing our advisor base. So right now, we\u0026#39;re currently at four advisors. And I think it\u0026#39;s kind of the people that you refer are the clients that you have, so it tends to just flow naturally to not have to turn anyone away, per se. But our idea has always been that if that comes, we\u0026#39;ll build something, right? I mean, we do have ETFs for depending on moving things. Just a holding spot for certain things. So we do have them, and we have models, different ETF models that we run through.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So does that mean you have other clients beyond the core ten families on the books now?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I\u0026#39;m just trying to envision, even for big-dollar families, four advisors for ten clients feels a lot of folks.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes. One is a new advisor.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So getting up to speed. So then how many total clients or households are there across the business between the core folks and the others that other advisors are working with?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e There, I think we might be leaning more towards households. Maybe 60 to 70.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And so you kind of have a segmentation-style model. You have some of the largest higher-dollar households, other advisors working with clients at other tiers on the spectrum. And that\u0026#39;s how you kind of handle the segmentation challenge?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Maybe for the future. Currently, the way we did it is I launched Expressive Wealth and I had two advisors that were at other practices and they came over with their book.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Oh, okay. Okay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e So each one of us has those types of families as well as a blend of others. So yeah, the idea would be that we would then bring on newer advisors, right? Succession planning. I believe succession planning starts now to build trust. This is a slow game. This is not then you turn over and pass someone along. That\u0026#39;s not how we see it. It\u0026#39;s definitely a relationship, and to build that, it takes quite some time.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Driving Client Growth With Events [58:55]\" id=\"driving-client-growth-by-holding-client-events-and-being-visible-in-their-lives-5855\"\u003eDriving Client Growth By Holding Client Events And Being Visible In Their Lives [58:55]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So then where do these large high-dollar clients come from?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e In some cases, previous practices. In some cases, referrals from friends.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So there\u0026#39;s not a separate marketing process for you guys, it\u0026#39;s just all word of mouth in that community?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes. And very, I said, we\u0026#39;re so intertwined in the families that we\u0026#39;re at events with them. So it\u0026#39;s different to say, I\u0026#39;m just giving you a referral because I talked about you versus, oh, you were there and you talked to my friend, so-and-so.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Like birthday parties, like weddings, just in case you were going to ask for examples. I know you love examples, Michael.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I\u0026#39;m just trying to visualize it. I\u0026#39;m a very visual person. So I guess I\u0026#39;m just trying to envision how you manage growth. Are you just stuck in a, it\u0026#39;s a fairly reactive world, we\u0026#39;re just trying to be out there and if we make enough contact, enough opportunities at some point, a referral shows up?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e We are intentional in our marketing with having more of a presence. So by that, I mean networking events or actual events that we launch. We have obviously, right, we have the second book coming out. We have a podcast that we run that we just launched, blogs, and newsletters. So content is out and our key in our content is always education, communication, education and communication. Because that\u0026#39;s kind of our brand. We want to make sure that families understand this.\u003c/p\u003e\n\u003cp\u003eSo typically, when we get referrals or we go places, the main referral source with our family is when they say, they\u0026#39;re not like, \u0026#34;Oh, this is all about performance. They\u0026#39;re great. Go with them.\u0026#34; It\u0026#39;s more of, \u0026#34;Oh, my goodness, my daughter was going to get married or is getting married and Vanessa was able to help kind of get everything in order for the prenup.\u0026#34; Or \u0026#34;She explained to them what it actually means so it didn\u0026#39;t look and sound a bad word.\u0026#34; So that is how our referrals transfer. And we have been quite fortunate in that.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So then what kinds of, I guess, I think you said those networking events, you go out to and events that you run and yourselves, what kind of event marketing are you doing to fill this in?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Still educational. So in that case, it might be something like a wine and stock night.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Wine and stock night. So how does that work?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e So it might be at a wine store that has the space, and then we do a quick chit-chat on kind of what we see, where we see it heading, and things you can do or put in place to kind of help today. All general allocation pieces, but then have a quick sommelier come on and explain two different wines. So now you\u0026#39;re just sitting there networking with everyone that\u0026#39;s in the room talking about stock and wine.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And who gets invited to an event this? How many people in the room, and who are you inviting?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Small groups. And it\u0026#39;s a client and two friends.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So very small, there are four of us and the sommelier hanging out.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e A little bit bigger, more like ten to 15 total.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So then a few clients may get invites and bring a few friends each.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And just how do you do the invite? How do you position this with clients to get comfortable to bring friends to what nominally is the marketing event for their financial advisor?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e I think in...the way that we\u0026#39;ve done it is because we have that really strong relationship with our clients, it\u0026#39;s more like, what are your friends asking about? So it might not be stocks. That was just an example, but it\u0026#39;s typically exactly what you started this whole conversation with, which is estate planning, right? That is I think a big question for many. Understanding their own. Do they have the right one in place? Some people, and you would be astonished. And how it\u0026#39;s just, they only have the will, because it was done so many years ago, and in their mind, that\u0026#39;s what that meant and didn\u0026#39;t realize, well, that that goes through probate.\u003c/p\u003e\n\u003cp\u003eSo, I think those pieces are kind of where we lean. What are the questions? That\u0026#39;s what we want to do. We want to answer your questions. We don\u0026#39;t want to just sit here and teach you, because some people will be like, \u0026#34;What? Stocks? I don\u0026#39;t want to hear about that. I don\u0026#39;t care about that.\u0026#34; But if I say, \u0026#34;Your kids are going to college, make sure you have something in place like a health care directive, so that you\u0026#39;re aware of what\u0026#39;s happening just in case.\u0026#34; Then it\u0026#39;s like, \u0026#34;Wait, what? I am.\u0026#34; And then it\u0026#39;s an age group, right? And then it\u0026#39;s a demographic, maybe in the neighborhood, maybe with a mom\u0026#39;s group. That they\u0026#39;re all, \u0026#34;Oh, my goodness, I do want to learn about this.\u0026#34; That\u0026#39;s what makes it enticing. If you\u0026#39;re answering what someone has questions on, they will be there.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so how does the actual invitation process work then? Do you go to select clients and ask them bring friends? Do you send this to all clients?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e No. Select.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e You have to bring a friend?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e No, it\u0026#39;s select. And they don\u0026#39;t have to. But sometimes because they know it\u0026#39;s a few people, then they\u0026#39;re kind of like, \u0026#34;Oh, I at least want one person with me. They travel in packs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So the outreach is to clients and the invitation is your friends are welcome if you\u0026#39;d to bring one?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Or a few.\u003c/p\u003e\n\u003cp\u003eMichel: Or a few.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e A couple, more a couple than a few. I don\u0026#39;t want that many. But yes. And the way we assign it is more of where do we want to have it? The way we assign it is more of where do we want to have it? Do we want to have it over here in my neighborhood? Do I know that I have five other families in this other neighborhood? You want to make it easy. You want to answer their questions. And you want to make it accessible. And you want to pick a night that is accessible. Nobody wants to give you their Friday night. So we lean on Thursdays because there you just have one other day of work left. So Thursdays is typically our night, and that\u0026#39;s how we kind of assign who gets to go to what. So some clients, the retired clients, would love to go to absolutely everything.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Well, they have a lot of time. Yes, they do.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Correct. Correct. So it\u0026#39;s not that we don\u0026#39;t want them, it\u0026#39;s that it\u0026#39;s further away. Right? So it\u0026#39;s kind of in the setting of in the neighborhood and neighborhood get-together.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And so that\u0026#39;s how you frame it to kind of politely not have invited all clients to so and so. So someone says like, \u0026#34;Vanessa, I heard you did one of your events. I didn\u0026#39;t get invited.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Correct.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e It was a neighborhood thing up there. It\u0026#39;s not really where you are.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes. Because then it\u0026#39;s family. Right? You can have someone who is...that you did invite and then the mother or the daughter, either/or is in another neighborhood. And it\u0026#39;s not that you didn\u0026#39;t want to invite the mother and the daughter, or in some cases, you might, even though they\u0026#39;re in different…if they want to come in and maybe babysit the grandkids actually. But if not, you want you want to be fair and saying why you didn\u0026#39;t. It\u0026#39;s not that I didn\u0026#39;t want you there, it\u0026#39;s truly because it\u0026#39;s a neighborhood thing.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I guess obviously from a pure kind of marketing geography and certain neighborhoods and zip codes work are naturally conducive to this approach anyways, given the dollars in the neighborhood.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yeah, they are. Obviously, I\u0026#39;m in Chicago. But I\u0026#39;m assuming it works like this in most places. Once you get into the suburbs and even more so a little village, per se, it\u0026#39;s like everybody knows everybody and everybody knows everything. So it\u0026#39;s already a little community in itself. So it invites itself to be very easily done.\u003c/p\u003e\n\u003ch2 data-nav-title=\"What Surprised Vanessa The Most [1:08:22]\" id=\"whats-surprised-vanessa-the-most-building-her-advisory-business-10822\"\u003eWhat\u0026#39;s Surprised Vanessa The Most Building Her Advisory Business [1:08:22]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So as you reflect on this journey, what\u0026#39;s surprised you the most about building an advisory business working with these types of high-dollar clients?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e They\u0026#39;re very open in wanting your success as well. So it\u0026#39;s kind of they\u0026#39;re proud of you and they want you to continue to succeed. Of course, you have to give them their time, but they want you to succeed. When you\u0026#39;re in that kind of relationship, it\u0026#39;s overwhelming in a joyful way to hear them say that. That it is beyond that. That even though in my mind, I become quite attached to the clients I work with. I mean, honestly to everybody. So watch out, Michael, I might be calling you after this. I build that really strong connection, and I always want to be helpful. I consider myself just a server at heart that I\u0026#39;m always willing to help and to share. And I didn\u0026#39;t...the surprise was that so are they. So are they.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so how does that show up in practice?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e It\u0026#39;s the applauding your successes, sharing it, which then leads to a referral that\u0026#39;s already closed. You really have to do almost nothing because...it\u0026#39;s kind of a beyond a referral. I don\u0026#39;t even know what word exists. I\u0026#39;m just making stuff up now, but it\u0026#39;s that easy.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So what kind of successes? I mean, what success is in the context of my client shares it with their friends that results in a referral coming through?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e It\u0026#39;s that piece that we were talking about on same friends that have children in the same age group that are going through the same things that then my client will share how I was supportive in meeting with her daughter and her future husband to talk through these things. There\u0026#39;s no fee. There\u0026#39;s no catch. There\u0026#39;s nothing besides helping the family with what their goals are. And if I know that from the beginning, then it\u0026#39;s easy to align and bring it down to the next generation. And they share that.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So I feel like a lot of advisors try to do various versions of... I take \u0026#34;accommodation clients,\u0026#34; family members of kids...kids and family members of my top clients because I\u0026#39;m trying to be supportive and show up well for them. And a lot don\u0026#39;t seem to get referrals. It\u0026#39;s kind of \u0026#34;Thank you for helping my kids.\u0026#34; And then they move on. Is there a nice... I\u0026#39;m just wondering, why does this seem to result in more referral activity for you than it does for some other advisors?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e It can go both ways, right? So I don\u0026#39;t think it\u0026#39;s in all cases the advisor. It\u0026#39;ll be a blend of both. There are some clients that are just very transactional in life. And there\u0026#39;s some advisors that are very transactional. And I think sometimes, and this is the whole piece of having a chief clinical officer on the team, is that sometimes that self-awareness button, we haven\u0026#39;t pressed it hard enough. And what that means is maybe you\u0026#39;re transactional even though you say you\u0026#39;re relationship-based, and that\u0026#39;s okay as long as you know it and want that to be the case.\u003c/p\u003e\n\u003cp\u003eThere\u0026#39;s many advisors that are like, \u0026#34;Vanessa, I think you go too deep. I think that you cross the lines.\u0026#34; And that\u0026#39;s okay because that\u0026#39;s their opinion. And that\u0026#39;s okay, and I get it. And they can be successful in their own right. But for me, this works. For me, this brings me joy. And I feel that when I talk to my clients when I\u0026#39;m with them, they know I\u0026#39;m in it for what I\u0026#39;m in it for, which is to reach the goals because I care. And many of us say that. But if your actions don\u0026#39;t show that, other people can feel it.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Leveraging A Chief Clinical Officer [1:13:14]\" id=\"leveraging-a-chief-clinical-officer-to-support-both-the-team-and-its-clients-11314\"\u003eLeveraging A \u0026#34;Chief Clinical Officer\u0026#34; To Support Both The Team And Its Clients [1:13:14]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And did you say there\u0026#39;s a chief clinical officer on the team?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So what is what is that?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e What is that?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e what is that called? What is that?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e So this is bringing back the doctor in psychology that we have on the team. And she supports the team itself as well as in these, I\u0026#39;m going to call them client conversations now because we said we don\u0026#39;t use the word client meetings. So she supports in those, as well as internally with the team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So can you tell me a little bit more of what does she actually do? What does it mean she supports in the team and meetings?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e So on the team side, we have an assessment that we run, a different one. We\u0026#39;ll do a different one each year. Obviously, as you know, I launched on International Women\u0026#39;s Day in 2024. So this is year one. So one assessment down. Many, many to go. But the idea is to evaluate and assess either our personality or our communication style. And then be able to understand each other better as a team. Because I\u0026#39;m sure you\u0026#39;ve had the times where you\u0026#39;re sitting there talking to someone and then they repeat back to you. That\u0026#39;s not what I said. We\u0026#39;ve all had that happen. And that\u0026#39;s because we either aren\u0026#39;t listening or are, but what we heard is what we heard, and that\u0026#39;s maybe not what they were trying to say.\u003c/p\u003e\n\u003cp\u003eSo she helps us as a team become better at listening and being self-aware of these things. Right? Because if our assessment shows that this is how we tend to do things, okay then, how do we evolve from that? So that\u0026#39;s internal pieces, which then just make us all better to serve our clients. And then on the client side, it\u0026#39;s more as a liaison, as an outsider. Because I can be in there and I could definitely sit there and walk through the flow of the estate plan, and the GST [Generation-Skipping Tax] and the GRATs [Grantor Retained Annuity Trusts] and the SLATs [Spousal Lifetime Access Trusts] and all the wonderfulness that\u0026#39;s involved.\u003c/p\u003e\n\u003cp\u003eBut when it comes to those difficult conversations, if you\u0026#39;re going to say, \u0026#34;Okay. We\u0026#39;re keeping the lake house and we\u0026#39;re having this trust and the expenses flow through that.\u0026#34; And then one of the kids is, \u0026#34;Yeah, but then what happens when that runs out? Then we have to cover it. I don\u0026#39;t want to cover it because he comes more and I don\u0026#39;t go.\u0026#34; And then she doesn\u0026#39;t come. And then it becomes an argument. But if we have someone as an outsider that says, \u0026#34;Okay. Let\u0026#39;s talk about that.\u0026#34; It\u0026#39;s kind of like you in the room. Where you\u0026#39;re like, \u0026#34;Wait, let\u0026#39;s dig deeper there.\u0026#34;\u003c/p\u003e\n\u003cp\u003eSo we try to understand why are they so angry about keeping the house? What do they feel that maybe hasn\u0026#39;t been shared with them that makes them feel they don\u0026#39;t want to? Or why do they feel that burden is heavier on them? Maybe in the past, they\u0026#39;ve taken on other burdens more. Maybe they\u0026#39;re the family member that is either getting less of the inheritance, producing less income. Whatever it may be, right? But you dig deeper in these conversations.\u003c/p\u003e\n\u003cp\u003eAnd what I found in the past that not having a chief clinical officer, or let\u0026#39;s call it a liaison to facilitate this or help in the process, then that burden is now placed on me. And I\u0026#39;m definitely not trained for that. So this...it\u0026#39;s been tremendously helpful. And obviously, we\u0026#39;ve only been in business for a year with this new structure. So we\u0026#39;ve only gone through it with two families. And it was... I don\u0026#39;t even know what word to use besides just an enjoyable time with great success.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So is the psychologist in every meeting? Or just some?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Only in the final one. So remember how we talked that we\u0026#39;re going to do a couple pre-meetings and we\u0026#39;re going to do some planning. And then once the family is ready, then we\u0026#39;ll lean into the next step, which is communicating it to others at whatever phase they\u0026#39;re willing to do it. So it could be step one, we\u0026#39;re only going to talk structure, no dollars, no this, no that. Okay. And we can gauge where we feel if it\u0026#39;s just a sharing. Some matriarchs and patriarchs just want to tell you what it is. And some want your opinion because obviously it\u0026#39;s a revocable, it\u0026#39;s a living document, we can change it still. So it just depends on what the family wants. If we feel that there\u0026#39;s a need, we\u0026#39;ll take up her time.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So normally when we get to the family meeting that we\u0026#39;re convening, she\u0026#39;s coming to the family meeting or facilitating the family meeting?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Well, we\u0026#39;d be the facilitators. The advisor would be the facilitator, but she would be kind of, I don\u0026#39;t even know what to call it, a support person.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And so then you like... Well, how do you explain her role presence to the family?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Communication.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e She\u0026#39;s going to be new to the meeting. Because they\u0026#39;ve seen you for a while now, but she\u0026#39;s new to the meeting.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e I state it as she is going to be helping with communication styles. I mean, I\u0026#39;m fully transparent, obviously, with the name of Expressive Wealth on the door. Communication, I repeat it constantly. And they know of her because she\u0026#39;s on the website. They know of her because we\u0026#39;ve talked about it. So it\u0026#39;s kind of you already knew it was coming.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And at the end of the day, just...you pay her by the meeting to engage with clients?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Correct. Because she has her own practice.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. As a practicing psychologist.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Correct, correct.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Low Point On Vanessa’s Journey [1:19:45]\" id=\"the-low-point-on-vanessas-journey-11945\"\u003eThe Low Point On Vanessa\u0026#39;s Journey [1:19:45]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So as you\u0026#39;ve gone through this journey, what was the low point for you?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e I don\u0026#39;t think there\u0026#39;s one low point. I think there\u0026#39;s many. I think we go through ups and downs and it depends on maybe the time or the day, right? When you... sometimes I think of it when you have a baby and they\u0026#39;re tiny and you\u0026#39;re like, \u0026#34;I wish they\u0026#39;d walk already. I wish they would talk already.\u0026#34; And then when they do and you\u0026#39;re like, \u0026#34;Oh, man, I didn\u0026#39;t want all that.\u0026#34; I feel that happens with the business when you create it. Sometimes I want clients to fully trust me. Obviously, I have discretion over their portfolio and I\u0026#39;m like, \u0026#34;Okay, just kind of let me roll with it. I got this.\u0026#34; But then when clients fully trust you, then you start feeling quite a big burden, right?\u003c/p\u003e\n\u003cp\u003eBecause anything and everything is you. And of course, you consult, but you know when they\u0026#39;re like, \u0026#34;Vanessa, why are you asking me? You already know. It\u0026#39;s what you say.\u0026#34; But I\u0026#39;m like, \u0026#34;No, we have to...we\u0026#39;re going to educate you. Let me explain to you.\u0026#34; And they\u0026#39;re like, \u0026#34;Yes, I get it. I know why you picked this or I know why you decided to change this or make this or recommend that we do these things.\u0026#34; But those moments are difficult when there\u0026#39;s volatility in the market, right? Because you carry that. You know it\u0026#39;s not your fault. You know that you can only lean in on what you can control. And this is not something that we can control. But that doesn\u0026#39;t mean that the burden isn\u0026#39;t there. And that\u0026#39;s something that you carry as an entrepreneur. So those moments come quite often.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So how do you manage that burden when markets get volatile and it feels it\u0026#39;s on your shoulders?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e I know I\u0026#39;m doing my best. And I literally have to remind myself of that, as well as I have skin in the game. Anything that my clients are in, I\u0026#39;m in. I\u0026#39;m that advisor that if there\u0026#39;s something new and I\u0026#39;m like, \u0026#34;Okay, let\u0026#39;s try it.\u0026#34; It\u0026#39;s kind of like, \u0026#34;Okay, let me try it first. I want to test the waters.\u0026#34; Funny enough, like Bitcoin, years I was not a believer. Not to say that I am now, but too many clients were talking about it. And if I don\u0026#39;t fully get immersed in it and understand it, not just poo-poo it away, right, I can\u0026#39;t just be like, \u0026#34;No, it\u0026#39;s not real. It\u0026#39;s not blah. I\u0026#39;m not I\u0026#39;m not going to talk about it.\u0026#34; Right? You can\u0026#39;t do that. Your client wants to talk about it.\u003c/p\u003e\n\u003cp\u003eSo besides being just educated on talking about it, I was like, \u0026#34;Okay, let me give it a try. Let me put something in there so I can also see those pieces.\u0026#34; So that way when you talk about the experience, oh, you feel it when it moves and I\u0026#39;m talking about it, I feel it because I lost too. So see, this is why more of this is instead of that. So I\u0026#39;m quite in there with them.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Advice For Newer Advisors [1:22:50]\" id=\"vanessas-advice-for-her-younger-self-and-for-newer-advisors-12250\"\u003eVanessa\u0026#39;s Advice For Her Younger Self And For Newer Advisors [1:22:50]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So what else do you know now that you wish you could go back and tell you from ten-plus years ago?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Slow is okay. Actually, slow is good. Not okay. I make decisions sometimes too quickly. And some might say, \u0026#34;Oh, that\u0026#39;s great. You\u0026#39;re right. You\u0026#39;re not missing opportunities. You\u0026#39;re not.\u0026#34; But I think there is an aware piece that I was missing. So there\u0026#39;s always those risky people and then there\u0026#39;s risk-averse. But I think there\u0026#39;s a third layer, which is that risk-aware. And now what I\u0026#39;ve done is kind of stepped into that phase of, \u0026#34;Okay, sounds good, looks good. Let me do it. Let me have a quick test at it.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd I love the fact that my partner, Lauren, is the opposite of me, because you need that. You need that diversity of thinking to be able to actually move forward. If you keep going one way, it can work. But how long is it going to work for? Right? So it\u0026#39;s nice to have. I love that I have her as a partner and that we do think differently. And I think we just...we definitely make each other better because when I would make decisions quickly, I would say, \u0026#34;Okay, this is a great idea.\u0026#34; And then if it didn\u0026#39;t work within a week, I\u0026#39;m like, \u0026#34;Fail. Next.\u0026#34; And I\u0026#39;m like, I didn\u0026#39;t even give it a fair try now that I look back, right? Then I just kept shooting ideas.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e What was the most challenging one of those that whipsawed around in a not good way?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Platforms.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So like tech that you tried and then it didn\u0026#39;t work out and then you moved on and wish you hadn\u0026#39;t gone through it so fast.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Correct. But you\u0026#39;re caught in this whirlwind of \u0026#34;Keep it moving, Vanessa. Keep going. You got to go on to the next thing. You just got to pick. You have to do this. You have to...\u0026#34; I think no one was putting that pressure on me besides me. But now having Lauren as my partner, besides not just a sounding board, but also another intelligent mind that says, \u0026#34;Hey, I think this and this, they\u0026#39;re both good. But this is superior for this.\u0026#34; And then we can debate it. But then come to a good answer for the team, for the clients we serve.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So what advice would you give younger and newer advisors coming into the profession and wanting to get their career started?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e I think testing the waters. Basically, you could say, I don\u0026#39;t want to say anywhere, but where the opportunities arise is good thing. The more exposure you have to the different options that are out there, the more educated your decision will be when you\u0026#39;re ready to call it your career. So besides the kind of wirehouse model, the independent RIA, all of these different ones that exist besides just that, it\u0026#39;s the culture that you\u0026#39;re in, the mentorship or non-mentorship that exists in the company. The role, right? There\u0026#39;s planners that can be not client-facing.\u003c/p\u003e\n\u003cp\u003eAre you that kind of person that prefers not to, but you would really enjoy all of the pieces that are involved? Or do you really want to sit in front of the client? Testing all of those pieces. I would say this is a wonderful, wonderful career. And I\u0026#39;m sure there\u0026#39;s other careers like it, but obviously, it\u0026#39;s the one I chose and love. But I can\u0026#39;t think, at least off the top of my head, a career where you get to learn from every single person that you sit with to make someone else\u0026#39;s life better.\u003c/p\u003e\n\u003cp\u003eAnd what I mean is the best practices piece, right? You come with a family and they share maybe things that they\u0026#39;ve done. Not so great, great. Work, not work. And now that just becomes part of my tool bag. And then I get to share it on with the next family. So I know that I\u0026#39;m kind of gifting other people\u0026#39;s experiences to the next family, of course, and myself and my team\u0026#39;s family. I don\u0026#39;t know if other jobs have that, but I love that I get to experience that every day.\u003c/p\u003e\n\u003ch2 id=\"what-success-means-to-vanessa-12756\"\u003eWhat Success Means To Vanessa [1:27:56]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So as we wrap up, this is a podcast about success and just one of the themes that comes up is the word success means very different things to different people. And so you\u0026#39;re now on this wonderful path of success with the business. A hundred and thirty-five million dollars under management growing. The business is in a wonderful place. How do you define success for yourself at this point?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e I would say when I know that I\u0026#39;ve positively impacted someone\u0026#39;s life to the point that they want to do the same for someone else, I\u0026#39;ve reached success.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so like a pay-it-forward moment...when you\u0026#39;ve created a pay-it-forward desire?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Yes. Because it takes time to create that. But once you\u0026#39;ve been given that often enough and you cultivate that sense of giving brings joy and prosperity, then people will want to share. And that is success.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I love it. I love it. Well, thank you so much, Vanessa, for joining us on the \u0026#34;Financial Advisor Success\u0026#34; podcast.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVanessa:\u003c/strong\u003e Thank you for having me.\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;#FASuccess Ep 434: Attracting HNW Clients By Focusing Not On Estate But Legacy Planning Instead, With Vanessa N. Martinez\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-6a714ee6a490cb0804e68ba6-=\"\"\u003e\n                    \u003cimg decoding=\"async\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\n                    \u003c/a\u003e\n                \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "79 min read",
  "publishedTime": "2025-04-22T07:02:50-04:00",
  "modifiedTime": "2025-04-22T20:31:54Z"
}
