{
  "id": "191b55d9-038a-45e8-96d6-1c1a04bf35c9",
  "title": "Wealthbox’s Upcoming Built-In AI Meeting Notes Tool Signals Competition For Standalone Providers (And More Of The Latest In Financial #AdvisorTech – March 2025)",
  "link": "https://feeds.feedblitz.com/~/916307342/0/kitcesnerdseyeview~Wealthboxs-Upcoming-BuiltIn-AI-Meeting-Notes-Tool-Signals-Competition-For-Standalone-Providers-And-More-Of-The-Latest-In-Financial-AdvisorTech-%e2%80%93-March/",
  "description": "Welcome to the April 2025 issue of the Latest News in Financial #AdvisorTech – where we look at the big news, announcements, and underlying trends and developments that are emerging in the world of technology solutions for financial advisors! This month's edition kicks off with the news that Wealthbox has announced it is planning toRead More... The post Wealthbox’s Upcoming Built-In AI Meeting Notes Tool Signals Competition For Standalone Providers (And More Of The Latest In Financial #AdvisorTech – March 2025) first appeared on Kitces.com.",
  "author": "Ben Henry-Moreland",
  "published": "Mon, 07 Apr 2025 11:04:03 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Technology \u0026 Advisor FinTech",
    "OPTIN: One Page Business Plan (BAR)",
    "OPTIN: One Page Business Plan (SLIDE IN)"
  ],
  "byline": "Ben Henry-Moreland",
  "length": 48553,
  "excerpt": "Welcome to the April 2025 issue of the Latest News in Financial #AdvisorTech – where we look at the big news, announcements, and underlying trends and developments that are emerging in the world of technology solutions for financial advisors! This month's edition kicks off with the news that Wealthbox has announced it is planning to",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary Welcome to the April 2025 issue of the Latest News in Financial #AdvisorTech – where we look at the big news, announcements, and underlying trends and developments that are emerging in the world of technology solutions for financial advisors! This month's edition kicks off with the news that Wealthbox has announced it is planning to launch a new built-in AI meeting note tool that it seeks to integrate seamlessly with its existing CRM solution – which serves as a prominent warning for the many standalone AI meeting note tools like Jump and Zocks that have launched over the last few years about the threat they face from existing AdvisorTech providers, since although the standalone tools' existing users may be happy where they are, Wealthbox's new solution could attract a significant amount of the new users who are either adopting AI meeting notes for the first time or upgrading from a non-advisor-specific solution like Fathom, eating into the standalone tools' future growth rates and making it hard for them (and their VC investors) to realize a substantial return on their heavy investment into the category. From there, the latest highlights also feature a number of other interesting advisor technology announcements, including: All-in-one platform Advisor360 has announced the launch of a new standalone CRM designed specifically for independent RIAs as it attempts to make more inroads into the RIA channel – which raises the question of what other parts of its platform it might need to modify to better suit the needs of RIAs, when most of it was built to cater to its roots in the insurance and broker-dealer channels? Advisor workflow support solution Hubly has been acquired by Docupace, which suggests that Hubly might have struggled to gain a critical mass of users as a solution to help solve the shortcomings of advisor CRM systems' workflow capabilities – especially given that the price of Hubly was often as much or more expensive than the CRM platforms themselves, which may have been simply too much to expect advisors to pay compared to the magnitude of the problem it solves TaxStatus, a provider that had previously served as a service layer to automatically pull clients' IRS tax data either for monitoring by the advisor or to send to tax planning software like Holistiplan, has been steadily moving towards becoming a full-featured tax planning solution itself, as demonstrated by the release of its new Financial Baseline Reports that mirrors other platforms' tax snapshots to serve as a high-level overview of the client's tax situation as a jumping-off point for deeper tax planning conversations Read the analysis about these announcements in this month's column, and a discussion of more trends in advisor technology, including: A new data visualization tool, Exhibit A, has launched with the goal of helping advisors add custom-branded investment visuals to their client proposals and marketing materials, rather than the all-too-common practice of pasting in images from third-party sources that don't serve to burnish the advisor's expertise and brand Alaris, a sell-side M\u0026A consulting firm, has launched a new technology tool that helps sellers of RIA firms to narrow down from what could be dozens of potential buyers by algorithmically ranking them by the quality of their potential fit (rather than simply by choosing between the highest bidders, which can present pitfalls if the firms don't ultimately mesh together well) And be certain to read to the end, where we have provided an update to our popular \"Financial AdvisorTech Solutions Map\" (and also added the changes to our AdvisorTech Directory) as well! *And for #AdvisorTech companies who want to submit their tech announcements for consideration in future issues, please submit to [email protected]! Ben Henry-Moreland Team Kitces Ben Henry-Moreland is a Senior Financial Planning Nerd at Kitces.com, where he specializes in writing and speaking on financial planning topics including tax, practice management, and technology. He also co-authors the monthly Kitces #AdvisorTech column. Drawing from his experience as a financial planner and a solo advisory firm owner, Ben is passionate about fulfilling the site’s mission of making financial advicers better and more successful. Read more of Ben’s articles here. + Read More + Michael Kitces Team Kitces Michael Kitces is Head of Planning Strategy at Focus Partners Wealth, which provides an evidence-based approach to private wealth management for near- and current retirees, and Focus Partners Advisor Solutions, a turnkey wealth management services provider supporting thousands of independent financial advisors through the scaling phase of growth. In addition, he is a co-founder of the XY Planning Network, AdvicePay, fpPathfinder, and New Planner Recruiting, the former Practitioner Editor of the Journal of Financial Planning, the host of the Financial Advisor Success podcast, and the publisher of the popular financial planning industry blog Nerd’s Eye View through his website Kitces.com, dedicated to advancing knowledge in financial planning. In 2010, Michael was recognized with one of the FPA’s “Heart of Financial Planning” awards for his dedication and work in advancing the profession. Read all of Michael’s articles here. + Read More + Wealthbox Announces Upcoming Built-In AI Meeting Notes Assistant, Sounding Alarm Bells For (Industry-Specific) Standalone AI Providers Over the last two years, AI meeting note tools have gone from being essentially nonexistent as a software category to the fastest-growing category on the Kitces AdvisorTechMap. According to the most recent Kitces Research on the Financial Planning Process, about 18% of financial advisory teams have adopted AI meeting note tools so far, and they've broadly divided along two paths in doing so. According to the research, just over half of advisors who use AI meeting note tools use so-called 'generic' (i.e., not advisor-specific) tools such as Fathom, Fireflies, or Zoom's built-in AI Companion, which provide a meeting summary and transcription but aren't trained specifically on advisor conversations and don't integrate with other advisor-specific technology. The other not-quite-half of advisors have adopted \"advisor-specific\" AI meeting note tools like Jump, Zocks, Finmate.ai, and a host of others: In addition to the core meeting transcription and summarization functionality, they also include integration with the advisor's CRM to automatically log the meeting notes in the client's file (and often to prompt follow-up tasks for the advisory team), as well as the ability to draft a post-meeting summary email for the advisor to edit as needed and send to the client. And perhaps most significantly, most advisor-specific AI notetakers are designed to identify and highlight the main points that a financial advisor would want to come out of a client meeting – e.g., specific financial information, goals, plans, and next steps for the client and advisory team to take. The breakdown of AI meeting note tools along these two lines demonstrates that advisors are of differing minds about how these tools fit in their tech stack. The 'generic' solution users may be happy to use a tool like Zoom AI Companion that's already bundled into their pro Zoom account (with its sheer built-in convenience leading it to become the #1 most-adopted AI notetaking solution by financial advisors), or one like Fathom or Fireflies that can be used for free or at minimal cost, but don't feel the need to pay $100+ per user per month (the typical cost of most advisor-specific AI notetakers) for a standalone solution made specifically for advisors. The \"advisor-specific\" solution users, on the other hand, would rather use the tool that works best for their specific use case (i.e., that's trained to know what information the advisor would want to capture from a client meeting, and that integrates with the advisor's existing technology), even if it's more expensive than the generic options. And notably, thus far the industry-specific solutions, with their additional integrations to the rest of the AdvisorTech stack, are out-scoring the generic providers in advisor satisfaction, as well. And so glaring question as of late has been: When will existing AdvisorTech providers start to build or acquire AI notetakers to bundle into their own solutions, offering advisors the same depth of integrated capabilities that are driving advisor satisfaction, but without the need to purchase a separate standalone solution (that, ironically, is often more expensive 'just' to get AI-summarized notes into the CRM system than it is to buy the CRM system itself!)? After all, if Zoom has captured the highest overall market share so far simply by already being embedded within its users' existing software, wouldn't it follow that an AdvisorTech solution (most likely a CRM, given the closeness of integration needed to log notes, edit data, and kick off tasks) could capture much of the market share for advisor-specific AI notetakers by doing the same? We may have an answer to those questions soon, because Wealthbox, one of the \"big three\" CRM providers for financial advisors (along with Redtail and Salesforce), has announced its plan to roll out a new AI meeting assistant this summer as an add-on to its core CRM product. Although there aren't yet many details about specific features or pricing, the main selling point seems to be that the new AI notetaker (currently dubbed \"Project Althea\") will be able to function seamlessly alongside and within Wealthbox, and as the company puts it in its announcement, \"infuse AI throughout the Wealthbox application\". At first glance, Wealthbox's announcement has major implications for the other AI meeting note providers on the Kitces AdvisorTech Map. As one of the first non-standalone, advisor-specific tools (alongside Advisor360, which recently announced its own acquisition of Parrot AI's notetaker that it intends to integrate into its own platform), Wealthbox's AI notetaker would effectively have the same incumbent advantage for users of Wealthbox CRM that Zoom's AI Companion currently has for users of its meeting software: Advisors will be more likely to use a tool that's built into the software they're using already than to go out and shop for a third-party solution. Which in turn means fewer Wealthbox users choosing Jump, Zocks, or other standalone options when they decide to adopt AI notetaking (or to upgrade to an advisor-specific solution from one of the generic tools). At the same time, if Wealthbox wants to gain significant market share in the competitive AI notetaker market, it still needs to show advisors that its solution works as well or better than the other advisor-specific options. Advisors who are using tools like Jump or Zocks are doing so because they see them as superior options to the less expensive generic tools (and report higher satisfaction accordingly), and they aren't necessarily likely to switch to a more 'convenient' option if it doesn't generate accurate meeting transcriptions or summaries. And it's worth noting that the biggest differentiator for Wealthbox – that it will integrate better with its CRM than the standalone AI notetakers – doesn't seem to have been a significant pain point for users of the standalone solutions so far. So it won't necessarily be the case that current users of advisor-specific AI notetakers will flock to Wealthbox's new solution, even if they're Wealthbox users themselves, if they're already satisfied with how the solutions they're using integrate with Wealthbox already. The one thing that could potentially peel existing users away from advisor-specific solutions is if Wealthbox dramatically undercuts them on pricing – which, it must be said, is a possibility given that unlike the start-up standalone tools, Wealthbox has a built-in channel to market and distribute to its tens of thousands of CRM users, allowing for lower client acquisition costs and the ability to accordingly price at a lower rate. And just from a pure behavioral economics perspective, Wealthbox seems unlikely to price an \"add-on\" AI meeting note solution higher than its core CRM price of $75 per user per month, which is already less than what most of the standalone advisor-specific AI notetakers charge. So it is possible that the standalone AI meeting note providers will see some significant pressure on their pricing, especially if other CRM systems (e.g., Redtail, which parent company Orion has indicated it also has its own AI initiatives underway) also release their own lower-cost built-in AI notetakers. Ultimately, it's important to note that with less than 20% of advisors actually using AI meeting note tools, there's a lot of room for growth for both the standalone meeting notes tools and built-in options. But as investment dollars continue to flood into the space – including, in just the last few months, a $20 million funding round for Jump, a $3 million round for Zeplyn, a $2 million round for Mili, and a recently announced $13.8 million round for Zocks – more competition only increases the pressure on each provider to grow fast enough to emerge as one of the (at most) two or three market leaders that most AdvisorTech categories tend to consolidate towards. As long as the entire category continues to grow rapidly in adoption among advisors, it might feel like there's room for everybody in the field – but as the overall growth rate levels off in the long term, the existence of AI meeting note tools that live in the software that advisors already use could cause problems for the standalone providers who need to convince advisors to adopt a separate solution. Advisor360 Releases Tandem \"CRM-Plus\" To Cater To Independent RIAs' Data Needs CRM software began as essentially a digitized version of the Rolodexes financial advisors once kept on their desks to keep track of their clients' contact information. But as software capabilities grew in the 2000s and providers moved to cloud-based applications that could freely move data back and forth between platforms, CRMs gradually expanded their feature set to include new functions built off of the client data at the software's core – and increasingly as integration capabilities improved, data pulled in from the advisor's other technology platforms as well. In the 2010s, CRMs largely evolved along one of two paths. On one hand, some CRMs have essentially morphed into the advisor's \"hub\" for client-related tasks, adding workflow and task management features that tie to client records within the system, allowing advisors to know from each client's record what their last contact date was, which action items remained incomplete, and who was responsible for the next action. These include the \"big three\" CRM providers of Wealthbox, Redtail, and SalesForce, as well as newer providers like Quivr which has leaned even further into becoming an all-around workflow and project management tool. On the other hand, other CRMs evolved to effectively become the control panel for an underlying, unified stream of client data that connects most of the advisor's portfolio management technology stack: Their custodian, rebalancing, performance reporting, and billing tools, all of which need a consistent set of data flowing between them to function properly. The most prominent example of this type of CRM is Advyzon, which was built in conjunction with Advyzon's portfolio management tools and became one of the highest-rated CRM providers in the most recent Kitces Research on Advisor Technology, though other providers like AdvisorEngine, Envestnet's Tamarac, and BNY Pershing's Wove have all built CRM tools on top of their integrated portfolio management solutions. And now another all-in-one portfolio management provider, Advisor360, has jumped into the fray by launching a new platform called Tandem, which at its core is a CRM but also includes features that rely on the unified client data layer that Tandem is built off of. Specifically, Tandem builds in performance reporting and recordkeeping features that flow from the client's investment data, which makes it, in Advisor360's words, an \"enhanced\" CRM that differentiates itself by also serving as a single source of client data that can be sent to and synchronized across all of the advisor's technology platforms. For Advisor360, the announcement represents the latest attempt to make inroads into the RIA marketplace. Although it made a big splash when it was first released in 2019 (after being built as the proprietary tech platform for Commonwealth Financial Network) by landing MassMutual and its 9,000 financial advisors its first external client, Advisor360 has since struggled to maintain that early momentum, and in particular to find solutions that appeal outside of its roots in the broker-dealer and insurance industries. Which is an issue for Advisor360 in that it risks losing clients any time one of its broker-dealer users moves to the RIA channel and decides that what made Advisor360 work well for them as a broker-dealer no longer suits their needs as an independent RIA. Case in point: Unlike Advyzon and AdvisorEngine's CRM products which come bundled within their respective all-in-one portfolio management platforms, Advisor360 is making Tandem available on a stand-alone basis. The implication could be that Advisor360 feels it would have a hard time selling its CRM (which was specifically built for RIAs) alongside its core portfolio management platform (which was originally built with broker-dealers in mind). Which is a smart strategy as far as it goes, since it's generally better to sell something that people want as a standalone product rather than bundling it together with something they don't want, but it also raises questions about how seamlessly Tandem will function alongside platforms that weren't necessarily built to function with it. Because the reality is that it's very hard to get tools that were built separately, and on different data models, to work well together – for example, three years after Orion acquired Redtail, the two still function as very separate platforms, since even with common ownership and teams working full-time on integrating the platforms together, there are some underlying differences that can't be resolved without literally rebuilding everything from scratch. Still, in a CRM category that has long been dominated by the \"big three\" of Wealthbox, Redtail, and Salesforce, and has arguably suffered from a lack of disruptive innovation over that time, the entrance of a new competitor from an established platform like Advisor360 is a noteworthy event. And in launching a CRM designed with data management at its core, Advisor360 seems to have recognized that there's only so much advisors will pay for a CRM that functions solely as a contact and task management tool (e.g., Redtail and Wealthbox still cost less than $100 per month per user), and that there may be more opportunity in a tool that can solve advisors' problems with unifying and synchronizing data, with the CRM serving as the control panel for the bigger data-management apparatus. The question, then, is whether Advisor360 can build out more areas of its platform that can function well alongside Tandem and serve the needs of independent RIAs – in other words, a true competitor to the likes of Advyzon and Orion – to hold onto its user base no matter what channel they choose to end up in. At a high level, financial planning isn't something that can be done with a cookie-cutter approach. Each client has different goals, values, and financial circumstances, and plans need to be carefully tailored to ensure that they closely match the clients' needs and wants. But at a more granular level, financial planning can also be thought of as an ongoing series of smaller processes, many of which can be broken down into sequential steps that can be systematized and repeated each time the need for that task comes up. For example, each time a client wants to move money to or from one of their investment accounts, the advisory team might go through the same process of verifying the dollar amounts and locations, populating and submitting paperwork, resolving NIGOs, and potentially submitting trades. On the financial planning side, an annual client meeting might entail a systematic review of all components of the client's plan, including data gathering, summarization, and analysis for each. And in all cases, it's a best practice to document the completion of each step to demonstrate compliance with the RIA firm's policies and procedures and with state or Federal laws and regulations. It's helpful, then, for financial advisors to establish and maintain written workflows to help them stay organized. At the very least, solo and small ensemble advisors can use checklists to stay on top of where they are in each process and avoid missing any steps, for which they can create their own individual checklists from scratch or use off-the-shelf versions from providers like fpPathfinder. For larger teams with staff supporting multiple advisors, however, the need for workflows is more urgent (because of the number of team member handoffs involved along the way) and also more complex: The workflow solution needs to be more than a list of steps in a process, it also needs to reflect how tasks are assigned and handed off to those responsible for each step along the way, and there needs to be a way for managers to stay appraised on the big picture of how each project is progressing and which team members are responsible for which tasks at any given time. It would seem that the most obvious place for a workflow tool to live within an advisor's tech stack would be within their CRM, since that tends to be the hub for most of an advisor's client-related tasks, and is usually the first place where an advisor goes after a client meeting to log meeting notes and update information (after which the next step is usually to kick off one or more workflows based on action items from the meeting). And many CRM platforms do include workflow tools in one form or another – but in recent years, as advisory firms have on the whole gotten bigger and more complex, CRM platforms by and large haven't invested in improving their workflow tools enough to keep up with the needs of the firms they serve. They might be able to perform the basic functions of kicking off sequential tasks and assigning them to the appropriate team members, but they often stop short of more advanced functions like automation of routine tasks (e.g., triggering a scheduling email to a client six weeks in advance of their annual review date) or project management tools to keep team members appraised on the status of collaborative tasks. Advisors' frustration with the limitations of their CRMs' workflow capabilities led to the launch of Hubly, which was designed to integrate with and overlay advisors' existing CRM tools (specifically Wealthbox and Redtail) with more robust workflow features, including a visual \"kanban\"-style layout of tasks, automation capabilities, project tracking tools, and a large library of pre-designed workflows that can be used out of the box or customized to the advisor's liking. The caveat, however, was that Hubly's pricing of $110+ per user per month meant that Hubly itself was often more costly for advisors than the CRM platforms it was overlaying – and since advisors still needed the CRM to work with Hubly, that meant they were paying more than double the cost of CRM alone 'just' for a tool to improve on the CRM's workflow capabilities. And so despite Hubly's enhancement of advisors' ability to deploy workflows in their practice, it hasn't gained a great deal of traction among advisors, with most of the advisors who do use workflow tools opting to stick with what's in their CRM despite their clear limitations (given the relative cost difference when 'just' the CRM is less than half the price of the two together). Against that backdrop comes the news this month that Hubly is being acquired by Docupace, the advisory back office management platform that also owns PreciseFP. For now, like PreciseFP, it appears that Hubly will keep operating as a standalone product under Docupace's umbrella, although comments from Docupace CEO David Knoch suggest that Hubly and Docupace will be \"thoughtfully brought together\" as soon as next year, which makes it uncertain whether current Hubly clients will be able to continue using it on its own without adopting the whole Docupace platform, or if Hubly will be positioned more directly as part of Docupace's \"RIA Productivity Suite\" alongside PreciseFP. For Docupace, the Hubly acquisition represents a further expansion beyond its roots as a document management system for enterprise RIAs and broker-dealers to attract small- and mid-sized RIAs. To that end, it likely sees synergies between Hubly and PreciseFP, a tool made to help with systematizing the process of collecting client information that likely appeals to the same types of process-oriented advisors who represent much of Hubly's user base. And indeed, Docupace is already offering a temporary discount to users of either Hubly or PreciseFP who decide to sign up with the other. But for Hubly, the acquisition reflects the difficulty of sustaining as an independent provider that overlays a core advisor software system… especially at a price that's higher than the system it overlays in the first place. In Hubly's case, it always had a narrow path to walk between small firms whose workflow needs are simple enough to be accomplished within their CRM (and wouldn't need to pay up for Hubly), and bigger enterprise-level firms who use Salesforce and its own robust built-in workflow capabilities (and wouldn't need Hubly to overlay their CRM). And among those firms whose needs did fit in between (using small/mid-sized RIA CRMs like Weatlhbox and Redtail, with a large enough team to need more sophisticated workflows), it needed to price its product in a way that reflected the magnitude of the pain point that it addressed in the size of firm addressing it – with the implication being that the incremental process improvement provided by Hubly just didn't align with the asking price for the advisors in its target market. Which was made even more challenging by the existence of cheaper, general-purpose solutions like Asana or Trello, as well as by the recent launch of solutions like Quivr as a CRM specifically built around workflows to eliminate the need for a separate overlay entirely. Still, there's likely enough of a niche among process-oriented workflow power users for Hubly to stay in operation as a subsidiary of Docupace, especially if they can encourage some crossover between Hubly and PreciseFP. However, Docupace might still find it necessary to adjust Hubly's pricing to where it's palatable for advisors to pay for it in addition to their CRM. Because as Hubly's story as a standalone company shows, while advisors do often lament about workflow inefficiencies, most advisory firms just don't have very high organic growth rates, which means they'll just only pay \"so much\" for software to solve the pain point. Or put more simply, even the right product can struggle to gain traction when it's offered at the wrong price – and when the cost for a solution to solve CRMs' workflow shortcomings is more expensive than the CRM itself, it isn't surprising that advisors en masse would balk at adopting it. TaxStatus Introduces Financial Baseline Report, Signaling A Shift From IRS Data Pipeline To Holistiplan Competitor? A client's tax returns contain troves of useful information about their financial lives, from the obvious (e.g., the amounts and sources of their income, their household members, and their retirement contributions) to the more subtle (e.g., their medical expenses, charitable intentions, and debt levels that are all implied by their itemized deductions, or the existence of income-producing assets that client hadn't made the advisor aware of). Historically, however, in order to find all this information advisors needed to review their clients' tax returns themselves, which was a time-consuming process – and even if experience and training in knowing where in the return to look and what information to look for could make it somewhat more efficient, it remained a very manual task due to the sheer length and density of many clients' tax returns. Since the debut of Holistiplan in 2019, however, it's become much easier to get up to speed on the details of a client's tax situation without manually reading through the whole return. Holistiplan, along with other competitors like FP Alpha and RightCapital's Tax Analyzer that have emerged more recently, are trained to scan clients' tax returns and pull out the key information that the advisor might need to know. They then package that information into a core tax \"snapshot\" report, giving the high-level overview of the client's tax situation, which can then serve as a springboard for further review of the return and/or deeper tax planning conversations around actions like Roth conversions, charitable donation strategies, and tax-efficient investing (which most of these platforms have the capability to model in one form or another). What's notable, however, is that even platforms like Holistiplan and FP Alpha aren't entirely frictionless in how they gather and analyze client tax information. The advisor still needs to procure a PDF of the client's tax return and upload it to the software, which while not representing a major obstacle, does add another step to the client data gathering process that must be repeated each year whenever the client's updated tax return is available. And the software is limited to analyzing only the tax returns that the advisor actually has on hand, so if the client can't find a tax return from a previous year, there's no way of knowing what it might contain. Against this backdrop, TaxStatus emerged as a tool with the capability to pull in a client's last 10 years of tax history directly from the IRS, including not just tax return data but also forms like W-2s, K-1s, and 1099s that are filed for each taxpayer, as well as information on any outstanding taxes or penalties owed. At first, TaxStatus's main function seemed to be simply as a service layer to import client tax data from the IRS: Advisors could use TaxStatus directly to monitor their clients' tax situations and keep in the loop with any IRS notices received by any of their clients, or they could use the tool's integration with tax planning tools like Holistiplan to populate the client's tax information in the planning software automatically without the need for a PDF copy of the return. Either way, the role of TaxStatus (and its core business model) was about the tax data it provided – what the advisor decided to do next with that data was up to them. But given that TaxStatus had already built the pipes to the IRS's tax data, and an ID verification system that clients could complete quickly to authorize the advisor's access to their data, the obvious next step seemed to be to build their own full-functioning tax planning tool on top of their pre-existing data collection capabilities. And now with TaxStatus's recent announcement of their new \"Financial Baseline Report\", it appears that they may finally be moving in that direction. At a high level, the TaxStatus Financial Baseline Report appears to have a lot in common with Holistiplan's Tax Report and FP Alpha's Tax Snapshot. Which is to say that it provides a summary of the client's income, their marginal and effective tax rates, and eligibility status for certain credits and deductions, along with other key tax data. Notably, the report also contains a quasi-net worth statement, listing the client's assets and liabilities as reported to the IRS (e.g., via Form 1099-DIV for brokerage accounts, Form 5498 for retirement accounts, and Forms 1098 and 1098-E for mortgages and student loans, respectively), while also compiling an employment history for the client via their historical W-2, K-1, and Schedule C filings. At the same time, for all the comprehensiveness of its historical tax data, TaxStatus doesn't yet have the forward-looking planning tools – like projections of different tax scenarios or Roth conversion optimization calculations – that would truly make it a competitor to Holistiplan or FP Alpha in the tax planning category. But for almost any tax planning software, the \"core\" report, whether it's Holistiplan's Tax Report, FP Alpha's Tax Snapshot, or the new TaxStatus Financial Baseline Report, serves as the starting point for almost all client conversations around taxes, where the advisor can overview the client's current situation, point out inefficiencies or planning opportunities, and only then start to build out future scenarios to solidify the client's next steps. So it makes sense that TaxStatus would start there, with the possibility (and almost inevitability) of more forward-looking planning tools to come. Ultimately, while it may not be a full-fledged planning tool yet, TaxStatus's shift in the direction of tax planning is yet another signal that the days of Holistiplan's near monopoly over the Tax Planning category of the Kitces AdvisorTech Map may be drawing to an end. Between TaxStatus's new features, FP Alpha's release of their Tax Module as a standalone product, and RightCapital's release of their Tax Analyzer tool bundled with their core financial planning software, the competition is starting to heat up in a category that Holistiplan has long dominated. And if and when TaxStatus does build out more features to truly compete in that space, it will be well positioned to do so when it can offer the same capabilities of its competition without the advisor ever needing to ask for a PDF of the client's tax return. \"Exhibit A\" Launches To Provide White-Labeled Investment Visuals For Advisor Marketing Materials Although stories are most commonly told in words, they're often most effectively told with pictures. The human brain processes and retains visual information faster than it does for written text, and while the common claim that we process visuals 60,000 faster than text may be a myth, it's easy enough to prove how visuals tend to be more compelling than text: Look at a sheet of paper covered with text next to one with a picture on it, and see which one grabs the eye quicker. The effectiveness of visual communication is even more striking when it comes to financial advice, where the topics are often complex and unfamiliar to non-experts. Any advisor who's tried to explain a report consisting of block after block of text to a client knows the feeling of watching someone's eyes glaze over as their brain works to keep up with the stream of words. Contrast that to a report with a few effective visuals, which can often communicate in a moment or two what it might take several minutes and hundreds of words to describe through text. And so for advisors who seek to educate clients and prospects in financial topics – whether that's  to respond to a client's question, to highlight the advisor's investment philosophy in a prospect proposal, or to demonstrate the advisor's expertise in a blog post or newsletter – visuals are essential to making sure that the reader understands the point the advisor is trying to make. The caveat is that it isn't easy to create effective visuals. It's simple enough to sit down and type out one's thoughts into words, but creating a graphic requires careful thought about how the image will most clearly illustrate the point at hand. And once the graphic is designed, it's a whole other undertaking to then make it professional-looking: A scribble on a notebook page might be helpful as a first draft, but it won't necessarily lend much professional weight to the final product (except for the select few who have fully leaned into the \"scribbling on a notebook page\" concept). And so rather than create their own visuals from scratch, advisors often borrow from other materials, pulling in screenshots of charts from investment managers like Vanguard and BlackRock or from industry publications like JPMorgan's \"Guide to the Markets\". Which is fine on its own, as it at least provides some professionally made visuals to assist in telling the story the advisor wants to tell without needing to build them from scratch. However, from the advisor's perspective, the point of telling the story usually isn't just about educating the client or prospect on financial topics – it's about demonstrating the advisor's expertise and authority on the topic. And when including visuals in client-facing materials, pasted-in charts and graphs from various sources (usually with the source's logo or watermark on the image, or hopefully at least attributed to them) don't do as good of a job of demonstrating and reinforcing the advisor's expertise as images that include the advisor's own branding, so they look like they really were built by the advisor for that particular document. This month a new AdvisorTech provider, Exhibit A, launched to help fill the need for effective visuals that can be branded for an advisor's client-facing materials. Spearheaded by Michael Batnick, the Director of Research for Ritholz Wealth Management and himself a prolific blogger on markets and investing, Exhibit A is effectively a library of white-labeled charts on investment and economic topics, to which the advisor can add their own branding and either export to their own client materials or use to build a proposal deck using one of the software's pre-built templates. In this vein, Exhibit A is similar to platforms like Clearnomics, which also provides white-labeled charts and talking points for advisors to use in their client-facing materials, and it fulfills a similar purpose as YCharts in combining visuals and market insights into a preformatted client proposal. And so while it can be useful as way to support advisors who lean heavily into content marketing through blogs or newsletters (as Batnick and the Ritholz team of bloggers/advisors have done over the years), Exhibit A is more clearly positioned as a sales enablement tool for advisors who want to create professional-looking client proposals that effectively demonstrate the advisor's expertise on investing and the markets – and who don't want to detract from that appearance of expertise by including pasted-in images from third party sources. Which is reflected in Exhibit A's pricing, because while $299 per month is on the expensive side for a tool that's solely used as an aid for marketing and visual design, the cost seems more reasonable in the context of a sales process, where getting a single new client to sign up based on the professionalism and expertise demonstrated in the proposal deck can more than offset the product's cost. The question going forward is how much traction Exhibit A will gain with its heavy focus on investments in an environment where financial advisors are increasingly eager to demonstrate their value in other ways, like tax and retirement planning. With investing becoming increasingly commoditized as more and more advisors have moved to model-driven approaches in the last two decades, the emphasis of advisors' value proposition – and subsequently their marketing materials – has shifted towards holistic financial planning, taxes, and money psychology. And yet at the end of the day, most financial advisors are still paid on an AUM basis and manage investments for their clients – and with Exhibit A costing more than 10x the cost of platforms like fpPathfinder that aim to demonstrate expertise in financial planning, they're clearly betting that advisors will pay a premium for quality investment-related content. So from a \"show me your budget and I'll show you your priorities\" perspective, maybe it really is still essential for advisors to prove their investment expertise when making the final pitch for clients. Or in other words, the market for tools that show an advisor's value will ultimately reflect how advisors feel they need to demonstrate that value – and as long as the market for investment-related visuals continues to expand, there can be little doubt that it's still an investment-centric industry at heart. Alaris Introduces An M\u0026A \"Matchmaking\" App To Help RIA Sellers Find Buyers Based On The Right Culture Fit (Not Just The Highest Bid) The M\u0026A landscape for advisory firms over the last several years has been overwhelmingly a seller's market. Dozens of private equity-funded acquirers have been singularly focused on rolling up RIAs under their respective umbrellas, which means that for every firm that's ready to sell there could literally be 50 PE-backed potentially interested buyers to choose from. From the selling firm's perspective, while it's good to have a lot of potential buyers bidding against each other to buy your firm, it's also a challenge to narrow down the suitors to find the one that's the best fit. Which is a problem, since \"fit\" – that is, the alignment of firm culture, processes, and technology, among other factors – is often the most important factor that can make the difference between a deal that closes successfully (and pays out all of its contingency provisions based on revenue growth, client retention, etc., after the deal closes), and one that either falls through entirely or closes but leaves the acquired firm struggling to mesh with their new parent company. Which means that the quality of the match doesn't only impact client service after the deal, it can actually change the financial outcome of the deal itself, in a very material way. It would seem logical, given the importance of 'fit' to a successful RIA merger, that most RIA sellers would want to narrow their potential buyers down based on the quality of their fit with the selling firm. However, that isn't the way that most M\u0026A deals are handled in practice. Instead, the primary consideration tends to be which firm is willing to pay the most: M\u0026A deals for independent advisory firms are generally run as an open auction system, where the field is narrowed down to the handful of highest bidders. Only then does the focus shift to figuring out which of the remaining firms might be the best fit. While the auction method might be a good way for the selling firm to get the highest nominal price (and the buy-side investment bank handling the deal, which typically gets paid a percentage of the closing price), the fact that it doesn't consider alignment until the second half of the process can lead to problems if none of the highest-bidding acquirers are truly a good fit and the seller ends up settling for merely the \"least-worst\" option. If the issues of fit can't be resolved between the \"winning\" acquirer and the selling firm, it could lead to a situation where the deal doesn't close to begin with (and the seller has to start the process all over again) or the deal does close, but the seller doesn't receive the full nominal sales price because the integration issues between the firms keep it from reaching its contingency targets. And ironically, a not-highest-bidder might have been the highest bidder if they had only known in advance how well-aligned the prospective firm was to their own acquiring enterprise. Acquiring firms have tried to solve this problem somewhat by trying to bypass the auction process entirely. Using data from tools like RIA Growth Catalyst, they can try to identify the firms that aren't on the market whose financials make them potentially good targets for acquisition in the coming year(s), and they can do their own due diligence on the firms' fit and eventually reach out directly to start a conversation about an acquisition. But navigating around the auction process to prospect with acquisition targets one-to-one isn't necessarily going to give selling firms any better chance of finding the acquirer with the best fit – in fact, it just means that they aren't subject to competition for fit or selling price, and could end with a selling firm taking an imperfect deal with the first reasonably-promising outreach that comes along, when there were potentially far better suitors on the open market. Against this backdrop, the sell-side M\u0026A consultancy Alaris Acquisitions recently launched a new tool called Alaris \"Lens\" , which turns the standard auction process on its head by allowing selling firms to filter potential acquirers by a set of culture-style compatibility metrics in order to narrow the field down based on fit first, rather than selecting first by potential buying price. To do this, Alaris collects data on a number of criteria, from financials to client segmentation to technology, and runs it through an algorithm that assesses the selling firm's compatibility with potential buyers. It then lists the top 10 matches, ranked by the quality of the fit and categorized from \"optimal\" to \"weak\". Which means that, in contrast to the standard auction process where acquirers are filtered on price first and on fit last, selling firms using Alaris can filter on fit first, and only start the discussion about numbers when there's a strong likelihood that the firms will mesh well (which in turn can lift the price that good-fit buyers are willing to offer in the first place when the bidding stage comes). It makes a lot of sense for RIA sellers to view the M\u0026A process through this framework, particularly in a landscape where selling firms can be swamped with potential buyers. However, there's a reason that the buy-side, open-auction method has traditionally controlled the M\u0026A process, which is that the buy-side often has an easier business model to succeed with than the sell-side. An RIA acquirer is exceedingly more likely to do more acquisitions in the future than a selling firm is to be re-sold, and so buy-side M\u0026A consultants are able to get repeat business whereas sell-side consultants need to continuously find new clients to work with after their existing clients' deals close. Which means unlike RIA Growth Catalyst, which is more of a buyer's tool (for serial RIA acquirers) that prices as SaaS software, it seems likely that Alaris's new solution is not just about providing technology for selling firms to find better-fit M\u0026A partners, but for driving business to (and even aiding in the process of) Alaris's own M\u0026A consulting business (which Alaris doesn't sell \"the software\", it uses the software as a value-add to win M\u0026A consulting business with prospective sellers). Still, with this much money flowing into the M\u0026A space, there's presumably a fair amount of demand from selling (or even just selling-curious) firms for a solution that can solve the problem of finding an acquirer who is a good fit before talking about the dollars involved. If at some point the market turns back towards buyers, then sellers might have to move their focus back to price first – but at least in the current environment, sellers can be reasonably sure that a \"fair market value\" in dollars will be there regardless, which allows them to put fit at the center of their consideration (and maximize the likelihood they get all the dollars, including with post-deal contingencies), and which positions Alaris well to get connected with selling firms via its fit-first solution.  In the meantime, we've rolled out a beta version of our new AdvisorTech Directory, along with making updates to the latest version of our Financial AdvisorTech Solutions Map (produced in collaboration with Craig Iskowitz of Ezra Group)! So what do you think? Is the possibility of using AI meeting note technology that's built into a CRM platform worth switching from a standalone provider? Can TaxStatus threaten Holistiplan's position in the tax planning category by eliminating the need for uploading PDFs of client tax returns? Is it worth paying for white-labeled investment visuals for client-facing materials versus 'borrowing' graphics from other sources? Let us know your thoughts by sharing in the comments below! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003eWelcome to the April 2025 issue of the Latest News in Financial #AdvisorTech – where we look at the big news, announcements, and underlying trends and developments that are emerging in the world of technology solutions for financial advisors!\u003c/p\u003e\n\u003cp\u003eThis month\u0026#39;s edition kicks off with the news that Wealthbox has announced it is planning to launch a new built-in AI meeting note tool that it seeks to integrate seamlessly with its existing CRM solution – which serves as a prominent warning for the many standalone AI meeting note tools like Jump and Zocks that have launched over the last few years about the threat they face from existing AdvisorTech providers, since although the standalone tools\u0026#39; existing users may be happy where they are, Wealthbox\u0026#39;s new solution could attract a significant amount of the new users who are either adopting AI meeting notes for the first time or upgrading from a non-advisor-specific solution like Fathom, eating into the standalone tools\u0026#39; future growth rates and making it hard for them (and their VC investors) to realize a substantial return on their heavy investment into the category.\u003c/p\u003e\n\u003cp\u003eFrom there, the latest highlights also feature a number of other interesting advisor technology announcements, including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAll-in-one platform Advisor360 has announced the launch of a new standalone CRM designed specifically for independent RIAs as it attempts to make more inroads into the RIA channel – which raises the question of what other parts of its platform it might need to modify to better suit the needs of RIAs, when most of it was built to cater to its roots in the insurance and broker-dealer channels?\u003c/li\u003e\n\u003cli\u003eAdvisor workflow support solution Hubly has been acquired by Docupace, which suggests that Hubly might have struggled to gain a critical mass of users as a solution to help solve the shortcomings of advisor CRM systems\u0026#39; workflow capabilities – especially given that the price of Hubly was often as much or more expensive than the CRM platforms themselves, which may have been simply too much to expect advisors to pay compared to the magnitude of the problem it solves\u003c/li\u003e\n\u003cli\u003eTaxStatus, a provider that had previously served as a service layer to automatically pull clients\u0026#39; IRS tax data either for monitoring by the advisor or to send to tax planning software like Holistiplan, has been steadily moving towards becoming a full-featured tax planning solution itself, as demonstrated by the release of its new Financial Baseline Reports that mirrors other platforms\u0026#39; tax snapshots to serve as a high-level overview of the client\u0026#39;s tax situation as a jumping-off point for deeper tax planning conversations\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRead the analysis about these announcements in this month\u0026#39;s column, and a discussion of more trends in advisor technology, including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA new data visualization tool, Exhibit A, has launched with the goal of helping advisors add custom-branded investment visuals to their client proposals and marketing materials, rather than the all-too-common practice of pasting in images from third-party sources that don\u0026#39;t serve to burnish the advisor\u0026#39;s expertise and brand\u003c/li\u003e\n\u003cli\u003eAlaris, a sell-side M\u0026amp;A consulting firm, has launched a new technology tool that helps sellers of RIA firms to narrow down from what could be dozens of potential buyers by algorithmically ranking them by the quality of their potential fit (rather than simply by choosing between the highest bidders, which can present pitfalls if the firms don\u0026#39;t ultimately mesh together well)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAnd be certain to read to the end, where we have provided an update to our popular \u0026#34;Financial AdvisorTech Solutions Map\u0026#34; (and also added the changes to our AdvisorTech Directory) as well!\u003c/p\u003e\n\u003cp\u003e*And for #AdvisorTech companies who want to submit their tech announcements for consideration in future issues, please submit to \u003ca href=\"https://feeds.feedblitz.com/cdn-cgi/l/email-protection#f0a4959398be958783b09b9984939583de939f9d\"\u003e\u003cspan data-cfemail=\"693d0c0a01270c1e1a2902001d0a0c1a470a0604\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" width=\"200\" height=\"200\" src=\"https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-200x200.png\" alt=\"Guest Headshots\" decoding=\"async\" srcset=\"https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-200x200.png 200w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-300x300.png 300w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-150x150.png 150w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-400x400.png 400w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2.png 500w\" sizes=\"auto, (max-width: 200px) 100vw, 200px\" data-src=\"https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-200x200.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-200x200.png 200w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-300x300.png 300w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-150x150.png 150w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-400x400.png 400w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2.png 500w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003ch3 id=\"ben-henrymoreland\"\u003eBen Henry-Moreland\u003c/h3\u003e\n\u003cp\u003eTeam Kitces\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003eBen Henry-Moreland is a Senior Financial Planning Nerd at \u003ca href=\"https://www.kitces.com/\" target=\"_blank\" rel=\"noopener\" data-sk=\"tooltip_parent\"\u003eKitces.com\u003c/a\u003e, where he specializes in writing and speaking on financial planning topics including tax, practice management, and technology. He also co-authors the monthly Kitces #AdvisorTech column. Drawing from his experience as a financial planner and a solo advisory firm owner, Ben is passionate about fulfilling the site’s mission of making financial advicers better and more successful.\u003c/p\u003e\n\u003cp\u003eRead more of Ben’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=3193\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e+ Read More +\u003c/p\u003e\n\u003c/div\u003e\n\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" width=\"200\" height=\"200\" src=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg\" alt=\"Michael Kitces\" decoding=\"async\" srcset=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-300x300.jpg 300w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-768x768.jpg 768w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-800x800.jpg 800w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP.jpg 1022w\" sizes=\"auto, (max-width: 200px) 100vw, 200px\" data-src=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-300x300.jpg 300w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-768x768.jpg 768w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-800x800.jpg 800w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP.jpg 1022w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003ch3 id=\"michael-kitces\"\u003eMichael Kitces\u003c/h3\u003e\n\u003cp\u003eTeam Kitces\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eMichael Kitces is Head of Planning Strategy at \u003ca href=\"https://wealth.focuspartners.com/michael-kitces?utm_campaign=ForConsumers\u0026amp;utm_id=Kitces\u0026amp;utm_medium=KitcesReferral\u0026amp;utm_source=Kitces\"\u003eFocus Partners Wealth\u003c/a\u003e, which provides an evidence-based approach to private wealth management for near- and current retirees, and \u003ca href=\"https://advisor.focuspartners.com/kitces/?utm_source=Kitces\u0026amp;utm_medium=KitcesReferral\u0026amp;utm_campaign=ForConsumers\u0026amp;utm_id=Kitces\"\u003eFocus Partners Advisor Solutions\u003c/a\u003e, a turnkey wealth management services provider supporting thousands of independent financial advisors through the scaling phase of growth.\u003c/p\u003e\n\u003cp\u003eIn addition, he is a co-founder of the \u003ca href=\"https://www.xyplanningnetwork.com/\"\u003eXY Planning Network\u003c/a\u003e, \u003ca href=\"https://advicepay.com/\"\u003eAdvicePay\u003c/a\u003e, \u003ca href=\"https://www.fppathfinder.com/\" target=\"_blank\" rel=\"noopener\"\u003efpPathfinder\u003c/a\u003e, and \u003ca href=\"https://newplannerrecruiting.com/\"\u003eNew Planner Recruiting\u003c/a\u003e, the former Practitioner Editor of the Journal of Financial Planning, the host of the \u003cem\u003eFinancial Advisor Success \u003c/em\u003epodcast, and the publisher of \u003ca href=\"https://www.kitces.com/blog/\"\u003ethe popular financial planning industry blog \u003cem\u003eNerd’s Eye View\u003c/em\u003e\u003c/a\u003e through his website \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e, dedicated to advancing knowledge in financial planning. In 2010, Michael was recognized with one of the FPA’s “Heart of Financial Planning” awards for his dedication and work in advancing the profession.\u003c/p\u003e\n\u003cp\u003eRead all of Michael’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=13\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\" target=\"_blank\" rel=\"noopener\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e+ Read More +\u003c/p\u003e\n\u003c/div\u003e\n\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003ch2 data-nav-title=\"Wealthbox Announces AI Meeting Tool\" id=\"wealthbox-announces-upcoming-builtin-ai-meeting-notes-assistant-sounding-alarm-bells-for-industryspecific-standalone-ai-providers\"\u003e\u003cspan\u003e\u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisortech-february-2025-news-fp-alpha-right-capital-holistiplan-tax-return-extraction/\"\u003eWealthbox Announces Upcoming Built-In AI Meeting Notes Assistant, Sounding Alarm Bells For (Industry-Specific) Standalone AI Providers\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eOver the last two years, AI meeting note tools have gone from being essentially nonexistent as a software category to the fastest-growing category on the \u003ca href=\"https://www.kitces.com/fintechmap/\"\u003eKitces AdvisorTechMap\u003c/a\u003e. According to \u003ca href=\"https://www.kitces.com/kitces-report-how-financial-planners-actually-do-financial-planning/\"\u003ethe most recent Kitces Research on the Financial Planning Process\u003c/a\u003e, about 18% of financial advisory teams have adopted AI meeting note tools so far, and they\u0026#39;ve broadly divided along two paths in doing so.\u003c/p\u003e\n\u003cp\u003eAccording to the research, \u003ca href=\"https://www.kitces.com/blog/ai-notetakers-client-meeting-for-financial-advisors-adoption-satisfaction-trends-research-productivity/\"\u003ejust over half of advisors who use AI meeting note tools use so-called \u0026#39;generic\u0026#39; (i.e., not advisor-specific) tools\u003c/a\u003e such as \u003ca href=\"https://fathom.video/\"\u003eFathom\u003c/a\u003e, \u003ca href=\"http://fireflies.ai/\"\u003eFireflies\u003c/a\u003e, or \u003ca href=\"https://www.zoom.com/en/products/ai-assistant/\"\u003eZoom\u0026#39;s built-in AI Companion\u003c/a\u003e, which provide a meeting summary and transcription but aren\u0026#39;t trained specifically on advisor conversations and don\u0026#39;t integrate with other advisor-specific technology. The other not-quite-half of advisors have adopted \u0026#34;advisor-specific\u0026#34; AI meeting note tools like \u003ca href=\"https://jumpapp.com/\"\u003eJump\u003c/a\u003e, \u003ca href=\"https://www.zocks.io/\"\u003eZocks\u003c/a\u003e, \u003ca href=\"https://www.finmate.ai/\"\u003eFinmate.ai\u003c/a\u003e, and \u003ca href=\"https://fintech.kitces.com/category/client-engagement/client-meeting-support/\"\u003ea host of others\u003c/a\u003e: In addition to the core meeting transcription and summarization functionality, they also include integration with the advisor\u0026#39;s CRM to automatically log the meeting notes in the client\u0026#39;s file (and often to prompt follow-up tasks for the advisory team), as well as the ability to draft a post-meeting summary email for the advisor to edit as needed and send to the client. And perhaps most significantly, most advisor-specific AI notetakers are designed to identify and highlight the main points that a \u003cem\u003efinancial advisor\u003c/em\u003e would want to come out of a client meeting – e.g., specific financial information, goals, plans, and next steps for the client and advisory team to take.\u003c/p\u003e\n\u003cp\u003eThe breakdown of AI meeting note tools along these two lines demonstrates that advisors are of differing minds about how these tools fit in their tech stack. The \u0026#39;generic\u0026#39; solution users may be happy to use a tool like Zoom AI Companion that\u0026#39;s already bundled into their pro Zoom account (with its sheer built-in convenience leading it to become \u003ca href=\"https://www.kitces.com/blog/ai-notetakers-client-meeting-for-financial-advisors-adoption-satisfaction-trends-research-productivity/\"\u003ethe #1 most-adopted AI notetaking solution by financial advisors\u003c/a\u003e), or one like Fathom or Fireflies that can be used for free or at minimal cost, but don\u0026#39;t feel the need to pay $100+ per user per month (the typical cost of most advisor-specific AI notetakers) for a standalone solution made specifically for advisors. The \u0026#34;advisor-specific\u0026#34; solution users, on the other hand, would rather use the tool that works best for their specific use case (i.e., that\u0026#39;s trained to know what information the advisor would want to capture from a client meeting, and that integrates with the advisor\u0026#39;s existing technology), even if it\u0026#39;s more expensive than the generic options. And notably, thus far the industry-specific solutions, with their additional integrations to the rest of the AdvisorTech stack, are \u003ca href=\"https://www.kitces.com/blog/ai-notetakers-client-meeting-for-financial-advisors-adoption-satisfaction-trends-research-productivity/\"\u003eout-scoring the generic providers in advisor satisfaction\u003c/a\u003e, as well.\u003c/p\u003e\n\u003cp\u003eAnd so glaring question as of late has been: When will existing AdvisorTech providers start to build or acquire AI notetakers to bundle into their own solutions, offering advisors the same depth of integrated capabilities that are driving advisor satisfaction, but without the need to purchase a separate standalone solution (that, ironically, is often more expensive \u0026#39;just\u0026#39; to get AI-summarized notes into the CRM system than it is to buy the CRM system itself!)? After all, if Zoom has captured the highest overall market share so far simply by already being embedded within its users\u0026#39; existing software, wouldn\u0026#39;t it follow that an AdvisorTech solution (most likely a CRM, given the closeness of integration needed to log notes, edit data, and kick off tasks) could capture much of the market share for advisor-specific AI notetakers by doing the same?\u003c/p\u003e\n\u003cp\u003eWe may have an answer to those questions soon, because \u003ca href=\"https://www.wealthbox.com/\"\u003eWealthbox\u003c/a\u003e, one of the \u0026#34;big three\u0026#34; CRM providers for financial advisors (along with \u003ca href=\"https://corporate.redtailtechnology.com/\"\u003eRedtail\u003c/a\u003e and \u003ca href=\"https://www.salesforce.com/financial-services/wealth-management-software/\"\u003eSalesforce\u003c/a\u003e), \u003ca href=\"https://www.wealthbox.com/project-althea/\"\u003ehas announced its plan to roll out a new AI meeting assistant this summer as an add-on to its core CRM product\u003c/a\u003e. Although there aren\u0026#39;t yet many details about specific features or pricing, the main selling point seems to be that the new AI notetaker (currently dubbed \u0026#34;Project Althea\u0026#34;) will be able to function seamlessly alongside and within Wealthbox, and as the company puts it in its announcement, \u0026#34;infuse AI throughout the Wealthbox application\u0026#34;.\u003c/p\u003e\n\u003cp\u003eAt first glance, Wealthbox\u0026#39;s announcement has major implications for the other AI meeting note providers on the \u003ca href=\"https://fintech.kitces.com/category/client-engagement/client-meeting-support/\"\u003eKitces AdvisorTech Map\u003c/a\u003e. As one of the first non-standalone, advisor-specific tools (alongside \u003ca href=\"https://www.advisor360.com/\"\u003eAdvisor360\u003c/a\u003e, which \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisortech-february-2025-news-fp-alpha-right-capital-holistiplan-tax-return-extraction/\"\u003erecently announced its own acquisition of Parrot AI\u0026#39;s notetaker that it intends to integrate into its own platform\u003c/a\u003e), Wealthbox\u0026#39;s AI notetaker would effectively have the same incumbent advantage for users of Wealthbox CRM that Zoom\u0026#39;s AI Companion currently has for users of its meeting software: Advisors will be more likely to use a tool that\u0026#39;s built into the software they\u0026#39;re using already than to go out and shop for a third-party solution. Which in turn means fewer Wealthbox users choosing Jump, Zocks, or other standalone options when they decide to adopt AI notetaking (or to upgrade to an advisor-specific solution from one of the generic tools).\u003c/p\u003e\n\u003cp\u003eAt the same time, if Wealthbox wants to gain significant market share in the competitive AI notetaker market, it still needs to show advisors that its solution works as well or better than the other advisor-specific options. Advisors who are using tools like Jump or Zocks are doing so \u003cem\u003ebecause\u003c/em\u003e they see them as superior options to the less expensive generic tools (and \u003ca href=\"https://www.kitces.com/blog/ai-notetakers-client-meeting-for-financial-advisors-adoption-satisfaction-trends-research-productivity/\"\u003ereport higher satisfaction accordingly\u003c/a\u003e), and they aren\u0026#39;t necessarily likely to switch to a more \u0026#39;convenient\u0026#39; option if it doesn\u0026#39;t generate accurate meeting transcriptions or summaries. And it\u0026#39;s worth noting that the biggest differentiator for Wealthbox – that it will integrate better with its CRM than the standalone AI notetakers – doesn\u0026#39;t seem to have been a significant pain point for users of the standalone solutions so far. So it won\u0026#39;t necessarily be the case that current users of advisor-specific AI notetakers will flock to Wealthbox\u0026#39;s new solution, even if they\u0026#39;re Wealthbox users themselves, if they\u0026#39;re already satisfied with how the solutions they\u0026#39;re using integrate with Wealthbox already.\u003c/p\u003e\n\u003cp\u003eThe one thing that could potentially peel existing users away from advisor-specific solutions is if Wealthbox dramatically undercuts them on pricing – which, it must be said, is a possibility given that unlike the start-up standalone tools, Wealthbox has a built-in channel to market and distribute to its tens of thousands of CRM users, allowing for lower client acquisition costs and the ability to accordingly price at a lower rate. And just from a pure behavioral economics perspective, Wealthbox seems unlikely to price an \u0026#34;add-on\u0026#34; AI meeting note solution higher than its core CRM price of $75 per user per month, which is already less than what most of the standalone advisor-specific AI notetakers charge. So it is possible that the standalone AI meeting note providers will see some significant pressure on their pricing, especially if other CRM systems (e.g., Redtail, which \u003ca href=\"https://www.businesswire.com/news/home/20250204421685/en/Orion-Enhances-its-Unified-Flexible-Advisor-Platform-with-New-Tech-Upgrades\"\u003eparent company Orion has indicated it also has its own AI initiatives underway\u003c/a\u003e) also release their own lower-cost built-in AI notetakers.\u003c/p\u003e\n\u003cp\u003eUltimately, it\u0026#39;s important to note that with less than 20% of advisors actually using AI meeting note tools, there\u0026#39;s a lot of room for growth for both the standalone meeting notes tools and built-in options. But as investment dollars continue to flood into the space – including, in just the last few months, \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisortech-march-2025-news-morningstar-circleblack-jump-blackdiamond/\"\u003ea $20 million funding round for Jump\u003c/a\u003e, \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisortech-december-2024-robinhood-acquires-tradepmr-advyzon-auria-smartasset-tech-news/\"\u003ea\u003c/a\u003e $3 million round for Zeplyn, \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisortech-february-2025-news-fp-alpha-right-capital-holistiplan-tax-return-extraction/\"\u003ea $2\u003c/a\u003e million round for Mili, and \u003ca href=\"https://citywire.com/ria/news/zocks-ceo-talks-capital-raise-as-ai-notetaker-race-heats-up\"\u003ea recently announced $13.8 million round for Zocks\u003c/a\u003e – more competition only increases the pressure on each provider to grow fast enough to emerge as one of the (at most) two or three market leaders that most AdvisorTech categories tend to consolidate towards. As long as the entire category continues to grow rapidly in adoption among advisors, it might feel like there\u0026#39;s room for everybody in the field – but as the overall growth rate levels off in the long term, the existence of AI meeting note tools that live in the software that advisors already use could cause problems for the standalone providers who need to convince advisors to adopt a separate solution.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Advisor360 Releases Tandem CRM-Plus\" id=\"advisor360-releases-tandem-crmplus-to-cater-to-independent-rias-data-needs\"\u003e\u003cspan\u003e\u003ca href=\"https://www.advisor360.com/press-release-advisor360-introduces-tandem-a-crm-plus-for-independent-financial-advisors\"\u003eAdvisor360 Releases Tandem \u0026#34;CRM-Plus\u0026#34; To Cater To Independent RIAs\u0026#39; Data Needs\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eCRM software began as essentially a digitized version of the Rolodexes financial advisors once kept on their desks to keep track of their clients\u0026#39; contact information. But as software capabilities grew in the 2000s and providers moved to cloud-based applications that could freely move data back and forth between platforms, CRMs gradually expanded their feature set to include new functions built off of the client data at the software\u0026#39;s core – and increasingly as integration capabilities improved, data pulled in from the advisor\u0026#39;s other technology platforms as well.\u003c/p\u003e\n\u003cp\u003eIn the 2010s, CRMs largely evolved along one of two paths. On one hand, some CRMs have essentially morphed into the advisor\u0026#39;s \u0026#34;hub\u0026#34; for client-related tasks, adding workflow and task management features that tie to client records within the system, allowing advisors to know from each client\u0026#39;s record what their last contact date was, which action items remained incomplete, and who was responsible for the next action. These include the \u0026#34;big three\u0026#34; CRM providers of \u003ca href=\"https://www.wealthbox.com/\"\u003eWealthbox\u003c/a\u003e, \u003ca href=\"https://corporate.redtailtechnology.com/\"\u003eRedtail\u003c/a\u003e, and \u003ca href=\"https://www.salesforce.com/financial-services/wealth-management-software/\"\u003eSalesForce\u003c/a\u003e, as well as newer providers like \u003ca href=\"https://www.quivrcrm.io/\"\u003eQuivr\u003c/a\u003e which has leaned even further into becoming an all-around workflow and project management tool.\u003c/p\u003e\n\u003cp\u003eOn the other hand, other CRMs evolved to effectively become the control panel for an underlying, unified stream of client data that connects most of the advisor\u0026#39;s portfolio management technology stack: Their custodian, rebalancing, performance reporting, and billing tools, all of which need a consistent set of data flowing between them to function properly. The most prominent example of this type of CRM is \u003ca href=\"https://www.advyzon.com/main/index.html\"\u003eA\u003c/a\u003edvyzon, which was built in conjunction with Advyzon\u0026#39;s portfolio management tools and became one of the highest-rated CRM providers in \u003ca href=\"https://www.kitces.com/kitces-report-independent-financial-advisor-technology-fintech-software-tools-research/\"\u003ethe most recent Kitces \u003c/a\u003eResearch on Advisor Technology, though other providers like \u003ca href=\"https://www.advisorengine.com/\"\u003eAdvisorEngine\u003c/a\u003e, \u003ca href=\"https://www.tamaracinc.com/crm\"\u003eEnvestnet\u0026#39;s Tamar\u003c/a\u003eac, and \u003ca href=\"https://www.bny.com/pershing/us/en/platforms/wove.html\"\u003eBNY Pershing\u0026#39;s Wove\u003c/a\u003e have all built CRM tools on top of their integrated portfolio management solutions.\u003c/p\u003e\n\u003cp\u003eAnd now another all-in-one portfolio management provider, \u003ca href=\"https://www.advisor360.com/\"\u003eAdvisor360\u003c/a\u003e, has jumped into the fray \u003ca href=\"https://www.businesswire.com/news/home/20250304100321/en/Advisor360-Introduces-Tandem-A-CRM-for-Independent-Financial-Advisors\"\u003eby launching a new platform called Tandem\u003c/a\u003e, which at its core is a CRM but also includes features that rely on the unified client data layer that Tandem is built off of. Specifically, Tandem builds in performance reporting and recordkeeping features that flow from the client\u0026#39;s investment data, which makes it, in Advisor360\u0026#39;s words, an \u0026#34;enhanced\u0026#34; CRM that differentiates itself by also serving as a single source of client data that can be sent to and synchronized across all of the advisor\u0026#39;s technology platforms.\u003c/p\u003e\n\u003cp\u003eFor Advisor360, the announcement represents the latest attempt to make inroads into the RIA marketplace. Although it made a big splash when it was first released in 2019 (after being built as the proprietary tech platform for Commonwealth Financial Network) \u003ca href=\"https://riabiz.com/a/2019/4/12/commonwealth-ceo-wayne-bloom-brushes-off-rep-pushback-spins-off-advisor360-to-sell-formerly-exclusive-software-and-research-to-competitors\"\u003eby landing MassMutual and its 9,000 financial advisors its first external client\u003c/a\u003e, Advisor360 has since struggled to maintain that early momentum, and in particular to find solutions that appeal outside of its roots in the broker-dealer and insurance industries. Which is an issue for Advisor360 in that it risks losing clients any time one of its broker-dealer users moves to the RIA channel and decides that what made Advisor360 work well for them as a broker-dealer no longer suits their needs as an independent RIA.\u003c/p\u003e\n\u003cp\u003eCase in point: Unlike Advyzon and AdvisorEngine\u0026#39;s CRM products which come bundled within their respective all-in-one portfolio management platforms, Advisor360 is making Tandem available on a stand-alone basis. The implication could be that Advisor360 feels it would have a hard time selling its CRM (which was specifically built for RIAs) alongside its core portfolio management platform (which was originally built with broker-dealers in mind). Which is a smart strategy as far as it goes, since it\u0026#39;s generally better to sell something that people want as a standalone product rather than bundling it together with something they don\u0026#39;t want, but it also raises questions about how seamlessly Tandem will function alongside platforms that weren\u0026#39;t necessarily built to function with it. Because the reality is that it\u0026#39;s very hard to get tools that were built separately, and on different data models, to work well together – for example, \u003ca href=\"https://riabiz.com/a/2022/6/9/orion-speed-closes-redtail-purchase-in-48-days-so-eric-clarke-can-get-right-to-work-stacking-it-with-four-other-ma-deals-in-two-years-at-his-omaha-mothership\"\u003ethree years after Orion acquired Redtail\u003c/a\u003e, the two still function as very separate platforms, since even with common ownership and teams working full-time on integrating the platforms together, there are some underlying differences that can\u0026#39;t be resolved without literally rebuilding everything from scratch.\u003c/p\u003e\n\u003cp\u003eStill, in a CRM category that has long been dominated by the \u0026#34;big three\u0026#34; of Wealthbox, Redtail, and Salesforce, and has arguably suffered from a lack of disruptive innovation over that time, the entrance of a new competitor from an established platform like Advisor360 is a noteworthy event. And in launching a CRM designed with data management at its core, Advisor360 seems to have recognized that there\u0026#39;s only so much advisors will pay for a CRM that functions solely as a contact and task management tool (e.g., Redtail and Wealthbox still cost less than $100 per month per user), and that there may be more opportunity in a tool that can solve advisors\u0026#39; problems with unifying and synchronizing data, with the CRM serving as the control panel for the bigger data-management apparatus. The question, then, is whether Advisor360 can build out more areas of its platform that can function well alongside Tandem \u003cem\u003eand\u003c/em\u003e serve the needs of independent RIAs – in other words, a true competitor to the likes of Advyzon and Orion – to hold onto its user base no matter what channel they choose to end up in.\u003c/p\u003e\n\n\u003cp\u003eAt a high level, financial planning isn\u0026#39;t something that can be done with a cookie-cutter approach. Each client has different goals, values, and financial circumstances, and plans need to be carefully tailored to ensure that they closely match the clients\u0026#39; needs and wants. But at a more granular level, financial planning can also be thought of as an ongoing series of smaller processes, many of which can be broken down into sequential steps that can be systematized and repeated each time the need for that task comes up. For example, each time a client wants to move money to or from one of their investment accounts, the advisory team might go through the same process of verifying the dollar amounts and locations, populating and submitting paperwork, resolving NIGOs, and potentially submitting trades. On the financial planning side, an annual client meeting might entail a systematic review of all components of the client\u0026#39;s plan, including data gathering, summarization, and analysis for each. And in all cases, it\u0026#39;s a best practice to document the completion of each step to demonstrate compliance with the RIA firm\u0026#39;s policies and procedures and with state or Federal laws and regulations.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s helpful, then, for financial advisors to establish and maintain written workflows to help them stay organized. At the very least, solo and small ensemble advisors \u003ca href=\"https://www.kitces.com/blog/why-arent-checklists-a-financial-planning-standard/\"\u003ecan use checklists to stay on top of where they are in each process and avoid missing any steps\u003c/a\u003e, for which they can create their own individual checklists from scratch or use off-the-shelf versions from providers like \u003ca href=\"https://www.fppathfinder.com/\"\u003efpPathfinder\u003c/a\u003e. For larger teams with staff supporting multiple advisors, however, the need for workflows is more urgent (because of the number of team member handoffs involved along the way) and also more complex: The workflow solution needs to be more than a list of steps in a process, it also needs to reflect how tasks are assigned and handed off to those responsible for each step along the way, and there needs to be a way for managers to stay appraised on the big picture of how each project is progressing and which team members are responsible for which tasks at any given time.\u003c/p\u003e\n\u003cp\u003eIt would seem that the most obvious place for a workflow tool to live within an advisor\u0026#39;s tech stack would be within their CRM, since that tends to be the hub for most of an advisor\u0026#39;s client-related tasks, and is usually the first place where an advisor goes after a client meeting to log meeting notes and update information (after which the next step is usually to kick off one or more workflows based on action items from the meeting). And many CRM platforms do include workflow tools in one form or another – but in recent years, as advisory firms have on the whole gotten bigger and more complex, CRM platforms by and large haven\u0026#39;t invested in improving their workflow tools enough to keep up with the needs of the firms they serve. They might be able to perform the basic functions of kicking off sequential tasks and assigning them to the appropriate team members, but they often stop short of more advanced functions like automation of routine tasks (e.g., triggering a scheduling email to a client six weeks in advance of their annual review date) or project management tools to keep team members appraised on the status of collaborative tasks.\u003c/p\u003e\n\u003cp\u003eAdvisors\u0026#39; frustration with the limitations of their CRMs\u0026#39; workflow capabilities led to the launch of \u003ca href=\"https://www.myhubly.com/\"\u003eHubly\u003c/a\u003e, which was designed to integrate with and overlay advisors\u0026#39; existing CRM tools (specifically \u003ca href=\"https://www.wealthbox.com/\"\u003eWealthbox\u003c/a\u003e and \u003ca href=\"https://corporate.redtailtechnology.com/\"\u003eRedtail\u003c/a\u003e) with more robust workflow features, including a visual \u0026#34;\u003ca href=\"https://en.wikipedia.org/wiki/Kanban_(development)\"\u003ekanban\u003c/a\u003e\u0026#34;-style layout of tasks, automation capabilities, project tracking tools, and a large library of pre-designed workflows that can be used out of the box or customized to the advisor\u0026#39;s liking. The caveat, however, was that Hubly\u0026#39;s pricing of $110+ per user per month meant that Hubly itself was often more costly for advisors than the CRM platforms it was overlaying – and since advisors still needed the CRM to work with Hubly, that meant they were paying more than double the cost of CRM alone \u0026#39;just\u0026#39; for a tool to improve on the CRM\u0026#39;s workflow capabilities. And so despite Hubly\u0026#39;s enhancement of advisors\u0026#39; ability to deploy workflows in their practice, it hasn\u0026#39;t gained a great deal of traction among advisors, with most of the advisors who do use workflow tools opting to stick with what\u0026#39;s in their CRM despite their clear limitations (given the relative cost difference when \u0026#39;just\u0026#39; the CRM is less than half the price of the two together).\u003c/p\u003e\n\u003cp\u003eAgainst that backdrop comes \u003ca href=\"https://www.docupace.com/news-events/docupace-accelerates-market-leadership-with-strategic-acquisition-of-hubly/\"\u003ethe news this month that Hubly is being acquired b\u003c/a\u003ey Docupace, the advisory back office management platform that also owns \u003ca href=\"https://precisefp.com/\"\u003ePreciseFP\u003c/a\u003e. For now, like PreciseFP, it appears that Hubly will keep operating as a standalone product under Docupace\u0026#39;s umbrella, although \u003ca href=\"https://citywire.com/ria/news/docupace-acquires-workflow-management-platform/a2461431\"\u003ecomments from Docupace CEO David Knoch\u003c/a\u003e suggest that Hubly and Docupace will be \u0026#34;thoughtfully brought together\u0026#34; as soon as next year, which makes it uncertain whether current Hubly clients will be able to continue using it on its own without adopting the whole Docupace platform, or if Hubly will be positioned more directly as part of \u003ca href=\"https://www.docupace.com/ria-productivity-suite/\"\u003eDocupace\u0026#39;s \u0026#34;RIA Productivity Suite\u0026#34;\u003c/a\u003e alongside PreciseFP.\u003c/p\u003e\n\u003cp\u003eFor Docupace, the Hubly acquisition represents a further expansion beyond its roots as a document management system for enterprise RIAs and broker-dealers to attract small- and mid-sized RIAs. To that end, it likely sees synergies between Hubly and PreciseFP, a tool made to help with systematizing the process of collecting client information that likely appeals to the same types of process-oriented advisors who represent much of Hubly\u0026#39;s user base. And indeed, Docupace is already offering a temporary discount to users of either Hubly or PreciseFP who decide to sign up with the other.\u003c/p\u003e\n\u003cp\u003eBut for Hubly, the acquisition reflects the difficulty of sustaining as an independent provider that overlays a core advisor software system… especially at a price that\u0026#39;s higher than the system it overlays in the first place. In Hubly\u0026#39;s case, it always had a narrow path to walk between small firms whose workflow needs are simple enough to be accomplished within their CRM (and wouldn\u0026#39;t need to pay up for Hubly), and bigger enterprise-level firms who use Salesforce and its own robust built-in workflow capabilities (and wouldn\u0026#39;t need Hubly to overlay their CRM). And among those firms whose needs did fit in between (using small/mid-sized RIA CRMs like Weatlhbox and Redtail, with a large enough team to need more sophisticated workflows), it needed to price its product in a way that reflected the magnitude of the pain point that it addressed in the size of firm addressing it – with the implication being that the incremental process improvement provided by Hubly just didn\u0026#39;t align with the asking price for the advisors in its target market. Which was made even more challenging by the existence of cheaper, general-purpose solutions like \u003ca href=\"https://asana.com/\"\u003eAsana\u003c/a\u003e or \u003ca href=\"https://trello.com/\"\u003eTrello\u003c/a\u003e, as well as by the recent launch of solutions like \u003ca href=\"https://www.quivrcrm.io/\"\u003eQuivr\u003c/a\u003e as \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisortech-november-2024-holistiplan-new-estate-planning-document-tool-quivr-currentclient-news/\"\u003ea CRM specifically built around workflows to eli\u003c/a\u003eminate the need for a separate overlay entirely.\u003c/p\u003e\n\u003cp\u003eStill, there\u0026#39;s likely enough of a niche among process-oriented workflow power users for Hubly to stay in operation as a subsidiary of Docupace, especially if they can encourage some crossover between Hubly and PreciseFP. However, Docupace might still find it necessary to adjust Hubly\u0026#39;s pricing to where it\u0026#39;s palatable for advisors to pay for it in addition to their CRM. Because as Hubly\u0026#39;s story as a standalone company shows, while advisors do often lament about workflow inefficiencies, most advisory firms just don\u0026#39;t have very high organic growth rates, which means they\u0026#39;ll just only pay \u0026#34;so much\u0026#34; for software to solve the pain point. Or put more simply, even the right product can struggle to gain traction when it\u0026#39;s offered at the wrong price – and when the cost for a solution to solve CRMs\u0026#39; workflow shortcomings is more expensive than the CRM itself, it isn\u0026#39;t surprising that advisors en masse would balk at adopting it.\u003c/p\u003e\n\u003ch2 data-nav-title=\"TaxStatus\u0026#39;s Financial Baseline Report\" id=\"taxstatus-introduces-financial-baseline-report-signaling-a-shift-from-irs-data-pipeline-to-holistiplan-competitor\"\u003e\u003cspan\u003e\u003ca href=\"https://t3technologyhub.com/taxstatus-introduces-the-taxstatus-financial-baseline-empowering-advisors-and-clients-with-a-complete-financial-picture-sourced-directly-from-irs-data/\"\u003eTaxStatus Introduces Financial Baseline Report, Signaling A Shift From IRS Data Pipeline To Holistiplan Competitor?\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eA client\u0026#39;s tax returns contain troves of useful information about their financial lives, from the obvious (e.g., the amounts and sources of their income, their household members, and their retirement contributions) to the more subtle (e.g., their medical expenses, charitable intentions, and debt levels that are all implied by their itemized deductions, or the existence of income-producing assets that client hadn\u0026#39;t made the advisor aware of). Historically, however, in order to find all this information advisors needed to review their clients\u0026#39; tax returns themselves, which was a time-consuming process – and even \u003ca href=\"https://www.kitces.com/review-tax-returns-course/\"\u003eif experience and training in knowing where in the return to look and what information to look for could make it somewhat more efficient\u003c/a\u003e, it remained a very manual task due to the sheer length and density of many clients\u0026#39; tax returns.\u003c/p\u003e\n\u003cp\u003eSince the debut of \u003ca href=\"https://www.holistiplan.com/\"\u003eHolistiplan\u003c/a\u003e in 2019, however, it\u0026#39;s become much easier to get up to speed on the details of a client\u0026#39;s tax situation without manually reading through the whole return. Holistiplan, along with other competitors like \u003ca href=\"https://fpalpha.com/solutions/\"\u003eFP Alpha\u003c/a\u003e and \u003ca href=\"https://www.rightcapital.com/tax-analyzer/\"\u003eRightCapital\u0026#39;s Tax Analyzer\u003c/a\u003e that have emerged more recently, are trained to scan clients\u0026#39; tax returns and pull out the key information that the advisor might need to know. They then package that information into a core tax \u0026#34;snapshot\u0026#34; report, giving the high-level overview of the client\u0026#39;s tax situation, which can then serve as a springboard for further review of the return and/or deeper tax planning conversations around actions like Roth conversions, charitable donation strategies, and tax-efficient investing (which most of these platforms have the capability to model in one form or another).\u003c/p\u003e\n\u003cp\u003eWhat\u0026#39;s notable, however, is that even platforms like Holistiplan and FP Alpha aren\u0026#39;t entirely frictionless in how they gather and analyze client tax information. The advisor still needs to procure a PDF of the client\u0026#39;s tax return and upload it to the software, which while not representing a major obstacle, does add another step to the client data gathering process that must be repeated each year whenever the client\u0026#39;s updated tax return is available. And the software is limited to analyzing only the tax returns that the advisor actually has on hand, so if the client can\u0026#39;t find a tax return from a previous year, there\u0026#39;s no way of knowing what it might contain.\u003c/p\u003e\n\u003cp\u003eAgainst this backdrop, \u003ca href=\"https://www.taxstatus.com/\"\u003eTaxStatus\u003c/a\u003e emerged as a tool with the capability to pull in a client\u0026#39;s last 10 years of tax history directly from the IRS, including not just tax return data but also forms like W-2s, K-1s, and 1099s that are filed for each taxpayer, as well as information on any outstanding taxes or penalties owed. At first, TaxStatus\u0026#39;s main function seemed to be simply as a service layer to import client tax data from the IRS: Advisors could use TaxStatus directly to monitor their clients\u0026#39; tax situations and keep in the loop with any IRS notices received by any of their clients, or they could use the tool\u0026#39;s integration with tax planning tools like Holistiplan to populate the client\u0026#39;s tax information in the planning software automatically without the need for a PDF copy of the return. Either way, the role of TaxStatus (and its core business model) was about the tax data it provided – what the advisor decided to do next with that data was up to them.\u003c/p\u003e\n\u003cp\u003eBut given that TaxStatus had already built the pipes to the IRS\u0026#39;s tax data, and an ID verification system that clients could complete quickly to authorize the advisor\u0026#39;s access to their data, the obvious next step seemed to be to build their own full-functioning tax planning tool on top of their pre-existing data collection capabilities. And now \u003ca href=\"https://www.taxstatus.com/learn/introducing-the-taxstatus-financial-baseline/\"\u003ewith TaxStatus\u0026#39;s recent announcement of their new \u0026#34;Financial Baseline Report\u0026#34;\u003c/a\u003e, it appears that they may finally be moving in that direction.\u003c/p\u003e\n\u003cp\u003eAt a high level, the TaxStatus Financial Baseline Report appears to have a lot in common with \u003ca href=\"https://www.holistiplan.com/platform/tax-planning/\"\u003eHolistiplan\u0026#39;s Tax Report\u003c/a\u003e and \u003ca href=\"https://fpalpha.com/solutions/#tax-planning\"\u003eFP Alpha\u0026#39;s Tax Snapshot\u003c/a\u003e. Which is to say that it provides a summary of the client\u0026#39;s income, their marginal and effective tax rates, and eligibility status for certain credits and deductions, along with other key tax data. Notably, the report also contains a quasi-net worth statement, listing the client\u0026#39;s assets and liabilities as reported to the IRS (e.g., via Form 1099-DIV for brokerage accounts, Form 5498 for retirement accounts, and Forms 1098 and 1098-E for mortgages and student loans, respectively), while also compiling an employment history for the client via their historical W-2, K-1, and Schedule C filings.\u003c/p\u003e\n\u003cp\u003eAt the same time, for all the comprehensiveness of its historical tax data, TaxStatus doesn\u0026#39;t yet have the forward-looking planning tools – like projections of different tax scenarios or Roth conversion optimization calculations – that would truly make it a competitor to Holistiplan or FP Alpha in the tax planning category. But for almost any tax planning software, the \u0026#34;core\u0026#34; report, whether it\u0026#39;s Holistiplan\u0026#39;s Tax Report, FP Alpha\u0026#39;s Tax Snapshot, or the new TaxStatus Financial Baseline Report, serves as the starting point for almost all client conversations around taxes, where the advisor can overview the client\u0026#39;s current situation, point out inefficiencies or planning opportunities, and only then start to build out future scenarios to solidify the client\u0026#39;s next steps. So it makes sense that TaxStatus would start there, with the possibility (and almost inevitability) of more forward-looking planning tools to come.\u003c/p\u003e\n\u003cp\u003eUltimately, while it may not be a full-fledged planning tool yet, TaxStatus\u0026#39;s shift in the direction of tax planning is yet another signal that the days of Holistiplan\u0026#39;s near monopoly over the Tax Planning category of the \u003ca href=\"https://www.kitces.com/fintechmap/\"\u003eKitces AdvisorTech Map\u003c/a\u003e may be drawing to an end. Between TaxStatus\u0026#39;s new features, \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisortech-february-2025-news-fp-alpha-right-capital-holistiplan-tax-return-extraction/\"\u003eFP Alpha\u0026#39;s release of their Tax Module as a standalone product, and RightCapital\u0026#39;s release of their Tax Analyzer tool bundled with their core financial planning software\u003c/a\u003e, the competition is starting to heat up in a category that Holistiplan has long dominated. And if and when TaxStatus does build out more features to truly compete in that space, it will be well positioned to do so when it can offer the same capabilities of its competition without the advisor ever needing to ask for a PDF of the client\u0026#39;s tax return.\u003c/p\u003e\n\u003ch2 data-nav-title=\"‘Exhibit A’ To Provide White-Labeled Visuals\" id=\"exhibit-a-launches-to-provide-whitelabeled-investment-visuals-for-advisor-marketing-materials\"\u003e\u003cspan\u003e\u003ca href=\"https://citywire.com/ria/news/ritholtzs-michael-batnick-launches-data-visualization-business/\"\u003e\u0026#34;Exhibit A\u0026#34; Launches To Provide White-Labeled Investment Visuals For Advisor Marketing Materials\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eAlthough stories are most commonly told in words, they\u0026#39;re often most \u003cem\u003eeffectively\u003c/em\u003e told with pictures. The human brain processes and retains visual information faster than it does for written text, and \u003ca href=\"https://cogdogblog.com/2012/05/repeated-enough/\"\u003ewhile the common claim that we process visuals 60,000 faster than text may be a myth\u003c/a\u003e, it\u0026#39;s easy enough to prove how visuals tend to be more compelling than text: Look at a sheet of paper covered with text next to one with a picture on it, and see which one grabs the eye quicker.\u003c/p\u003e\n\u003cp\u003eThe effectiveness of visual communication is even more striking when it comes to financial advice, where the topics are often complex and unfamiliar to non-experts. Any advisor who\u0026#39;s tried to explain a report consisting of block after block of text to a client knows the feeling of watching someone\u0026#39;s eyes glaze over as their brain works to keep up with the stream of words. Contrast that to a report with a few effective visuals, which can often communicate in a moment or two what it might take several minutes and hundreds of words to describe through text. And so for advisors who seek to educate clients and prospects in financial topics – whether that\u0026#39;s  to respond to a client\u0026#39;s question, to highlight the advisor\u0026#39;s investment philosophy in a prospect proposal, or to demonstrate the advisor\u0026#39;s expertise in a blog post or newsletter – visuals are essential to making sure that the reader understands the point the advisor is trying to make.\u003c/p\u003e\n\u003cp\u003eThe caveat is that it isn\u0026#39;t easy to create effective visuals. It\u0026#39;s simple enough to sit down and type out one\u0026#39;s thoughts into words, but creating a graphic requires careful thought about how the image will most clearly illustrate the point at hand. And once the graphic is designed, it\u0026#39;s a whole other undertaking to then make it professional-looking: A scribble on a notebook page might be helpful as a first draft, but it won\u0026#39;t necessarily lend much professional weight to the final product (except for \u003ca href=\"https://behaviorgap.com/\"\u003ethe select few who have fully leaned into the \u0026#34;scribbling on a notebook page\u0026#34; concept\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eAnd so rather than create their own visuals from scratch, advisors often borrow from other materials, pulling in screenshots of charts from investment managers like Vanguard and BlackRock or from industry publications like JPMorgan\u0026#39;s \u003ca href=\"https://am.jpmorgan.com/us/en/asset-management/adv/insights/market-insights/guide-to-the-markets/\"\u003e\u0026#34;Guide to the Markets\u0026#34;\u003c/a\u003e. Which is fine on its own, as it at least provides some professionally made visuals to assist in telling the story the advisor wants to tell without needing to build them from scratch. However, from the advisor\u0026#39;s perspective, the point of telling the story usually isn\u0026#39;t just about educating the client or prospect on financial topics – it\u0026#39;s about demonstrating the \u003cem\u003eadvisor\u0026#39;s\u003c/em\u003e expertise and authority on the topic. And when including visuals in client-facing materials, pasted-in charts and graphs from various sources (usually with the source\u0026#39;s logo or watermark on the image, or hopefully at least attributed to them) don\u0026#39;t do as good of a job of demonstrating and reinforcing the advisor\u0026#39;s expertise as images that include the advisor\u0026#39;s own branding, so they look like they really were built by the advisor for that particular document.\u003c/p\u003e\n\u003cp\u003eThis month a new AdvisorTech provider, \u003ca href=\"https://exhibitaforadvice.com/\"\u003eExhibit A\u003c/a\u003e, launched to help fill the need for effective visuals that can be branded for an advisor\u0026#39;s client-facing materials. \u003ca href=\"https://www.theirrelevantinvestor.com/p/we-started-a-new-company\"\u003eSpearheaded by Michael Batnick\u003c/a\u003e, the Director of Research for \u003ca href=\"https://www.ritholtzwealth.com/\"\u003eRitholz Wealth Management\u003c/a\u003e and himself \u003ca href=\"https://www.theirrelevantinvestor.com/p/we-started-a-new-company\"\u003ea prolific blogger on markets and investing\u003c/a\u003e, Exhibit A is effectively a library of white-labeled charts on investment and economic topics, to which the advisor can add their own branding and either export to their own client materials or use to build a proposal deck using one of the software\u0026#39;s pre-built templates.\u003c/p\u003e\n\u003cp\u003eIn this vein, Exhibit A is similar to platforms like \u003ca href=\"https://www.clearnomics.com/\"\u003eClearnomics\u003c/a\u003e, which also provides white-labeled \u003ca href=\"https://www.kitces.com/blog/clearnomics-10-charts-recession-fears-tariff-risk-market-volatility-economy-investor-anxiety/\"\u003echarts and talking points for advisors to use in their client-facing materials\u003c/a\u003e, and it fulfills a similar purpose as \u003ca href=\"https://ycharts.com/\"\u003eYCharts\u003c/a\u003e in combining visuals and market insights into a preformatted client proposal. And so while it can be useful as way to support advisors who lean heavily into content marketing through blogs or newsletters (as Batnick and the Ritholz team of bloggers/advisors have done over the years), Exhibit A is more clearly positioned as a sales enablement tool for advisors who want to create professional-looking client proposals that effectively demonstrate the advisor\u0026#39;s expertise on investing and the markets – and who don\u0026#39;t want to detract from that appearance of expertise by including pasted-in images from third party sources. Which is reflected in Exhibit A\u0026#39;s pricing, because while $299 per month is on the expensive side for a tool that\u0026#39;s solely used as an aid for marketing and visual design, the cost seems more reasonable in the context of a sales process, where getting a single new client to sign up based on the professionalism and expertise demonstrated in the proposal deck can more than offset the product\u0026#39;s cost.\u003c/p\u003e\n\u003cp\u003eThe question going forward is how much traction Exhibit A will gain with its heavy focus on investments in an environment where financial advisors are increasingly eager to demonstrate their value in other ways, like tax and retirement planning. With investing becoming increasingly commoditized as more and more advisors have moved to model-driven approaches in the last two decades, the emphasis of advisors\u0026#39; value proposition – and subsequently their marketing materials – has shifted towards holistic financial planning, taxes, and money psychology. And yet at the end of the day, most financial advisors are still paid on an AUM basis and manage investments for their clients – and with Exhibit A costing more than 10x the cost of platforms like \u003ca href=\"https://www.fppathfinder.com/\"\u003efpPathfinder\u003c/a\u003e that aim to demonstrate expertise in financial planning, they\u0026#39;re clearly betting that advisors will pay a premium for quality investment-related content. So from a \u0026#34;show me your budget and I\u0026#39;ll show you your priorities\u0026#34; perspective, maybe it really is still essential for advisors to prove their investment expertise when making the final pitch for clients. Or in other words, the market for tools that show an advisor\u0026#39;s value will ultimately reflect how advisors feel they need to demonstrate that value – and as long as the market for investment-related visuals continues to expand, there can be little doubt that it\u0026#39;s still an investment-centric industry at heart.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Alaris Introduces M\u0026amp;A ‘Matchmaking’ App\" id=\"alaris-introduces-an-ma-matchmaking-app-to-help-ria-sellers-find-buyers-based-on-the-right-culture-fit-not-just-the-highest-bid\"\u003e\u003cspan\u003e\u003ca href=\"https://www.wealthmanagement.com/ria-news/alaris-acquisitions-launches-matchmaking-app-for-ria-m-a\"\u003eAlaris Introduces An M\u0026amp;A \u0026#34;Matchmaking\u0026#34; App To Help RIA Sellers Find Buyers Based On The Right Culture Fit (Not Just The Highest Bid)\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eThe M\u0026amp;A landscape for advisory firms over the last several years has been overwhelmingly a seller\u0026#39;s market. Dozens of private equity-funded acquirers have been singularly focused on rolling up RIAs under their respective umbrellas, which means that for every firm that\u0026#39;s ready to sell there \u003ca href=\"https://citywire.com/ria/news/piper-sandler-number-of-sponsor-backed-ria-platforms-rose-to-50-in-2024/a2461985\"\u003ecould literally be 50 PE-backed potentially interested buyers to choose from\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFrom the selling firm\u0026#39;s perspective, while it\u0026#39;s good to have a lot of potential buyers bidding against each other to buy your firm, it\u0026#39;s also a challenge to narrow down the suitors to find the one that\u0026#39;s the best fit. Which is a problem, since \u0026#34;fit\u0026#34; – that is, the alignment of firm culture, processes, and technology, among other factors – is often the most important factor that can make the difference between a deal that closes successfully (and pays out all of its contingency provisions based on revenue growth, client retention, etc., after the deal closes), and one that either falls through entirely or closes but leaves the acquired firm struggling to mesh with their new parent company. Which means that the quality of the match doesn\u0026#39;t only impact client service after the deal, it can actually change the financial outcome of the deal itself, in a very material way.\u003c/p\u003e\n\u003cp\u003eIt would seem logical, given the importance of \u0026#39;fit\u0026#39; to a successful RIA merger, that most RIA sellers would want to narrow their potential buyers down based on the quality of their fit with the selling firm. However, \u003ca href=\"https://citywire.com/ria/news/opinion-the-m-and-a-playbook-is-broken-here-s-how-to-fix-it/a2461074\"\u003ethat isn\u0026#39;t the way that most M\u0026amp;A deals are handled in practice\u003c/a\u003e. Instead, the primary consideration tends to be which firm is willing to pay the most: M\u0026amp;A deals for independent advisory firms are generally run as an open auction system, where the field is narrowed down to the handful of highest bidders. Only then does the focus shift to figuring out which of the remaining firms might be the best fit.\u003c/p\u003e\n\u003cp\u003eWhile the auction method might be a good way for the selling firm to get the highest nominal price (and the buy-side investment bank handling the deal, which typically gets paid a percentage of the closing price), the fact that it doesn\u0026#39;t consider alignment until the second half of the process can lead to problems if none of the highest-bidding acquirers are truly a good fit and the seller ends up settling for merely the \u0026#34;least-worst\u0026#34; option. If the issues of fit can\u0026#39;t be resolved between the \u0026#34;winning\u0026#34; acquirer and the selling firm, it could lead to a situation where the deal doesn\u0026#39;t close to begin with (and the seller has to start the process all over again) or the deal does close, but the seller doesn\u0026#39;t receive the full nominal sales price because the integration issues between the firms keep it from reaching its contingency targets. And ironically, a not-highest-bidder might have \u003cem\u003ebeen \u003c/em\u003ethe highest bidder if they had only known in advance how well-aligned the prospective firm was to their own acquiring enterprise.\u003c/p\u003e\n\u003cp\u003eAcquiring firms have tried to solve this problem somewhat by trying to bypass the auction process entirely. Using data from tools like \u003ca href=\"https://www.riagrowthcatalyst.com/\"\u003eRIA G\u003c/a\u003erowth Catalyst, they can try to identify the firms that \u003cem\u003earen\u0026#39;t\u003c/em\u003e on the market whose financials make them potentially good targets for acquisition in the coming year(s), and they can do their own due diligence on the firms\u0026#39; fit and eventually reach out directly to start a conversation about an acquisition. But navigating around the auction process to prospect with acquisition targets one-to-one isn\u0026#39;t necessarily going to give \u003cem\u003eselling\u003c/em\u003e firms any better chance of finding the acquirer with the best fit – in fact, it just means that they aren\u0026#39;t subject to competition for fit \u003cem\u003eor\u003c/em\u003e selling price, and could end with a selling firm taking an imperfect deal with the first reasonably-promising outreach that comes along, when there were potentially far better suitors on the open market.\u003c/p\u003e\n\u003cp\u003eAgainst this backdrop, \u003ca href=\"https://www.wealthmanagement.com/ria-news/alaris-acquisitions-launches-matchmaking-app-for-ria-m-a\"\u003ethe sell-side M\u0026amp;A consultancy Alaris Acquisitions recently launched a new tool called Alaris \u0026#34;Lens\u003c/a\u003e\u0026#34; , which turns the standard auction process on its head by allowing selling firms to filter potential acquirers by a set of culture-style compatibility metrics in order to narrow the field down based on fit first, rather than selecting first by potential buying price. To do this, \u003ca href=\"https://www.alarisacquisitions.com/\"\u003eAlaris\u003c/a\u003e collects data on a number of criteria, from financials to client segmentation to technology, and runs it through an algorithm that assesses the selling firm\u0026#39;s compatibility with potential buyers. It then lists the top 10 matches, ranked by the quality of the fit and categorized from \u0026#34;optimal\u0026#34; to \u0026#34;weak\u0026#34;. Which means that, in contrast to the standard auction process where acquirers are filtered on price first and on fit last, selling firms using Alaris can filter on fit first, and only start the discussion about numbers when there\u0026#39;s a strong likelihood that the firms will mesh well (which in turn can lift the price that good-fit buyers are willing to offer in the first place when the bidding stage comes).\u003c/p\u003e\n\u003cp\u003eIt makes a lot of sense for RIA sellers to view the M\u0026amp;A process through this framework, particularly in a landscape where selling firms can be swamped with potential buyers. However, there\u0026#39;s a reason that the buy-side, open-auction method has traditionally controlled the M\u0026amp;A process, which is that the buy-side often has an easier business model to succeed with than the sell-side. An RIA acquirer is exceedingly more likely to do more acquisitions in the future than a selling firm is to be re-sold, and so buy-side M\u0026amp;A consultants are able to get repeat business whereas sell-side consultants need to continuously find new clients to work with after their existing clients\u0026#39; deals close. Which means unlike \u003ca href=\"https://www.riagrowthcatalyst.com/\"\u003eRIA Growth Catalyst\u003c/a\u003e, which is more of a buyer\u0026#39;s tool (for serial RIA acquirers) that prices as SaaS software, it seems likely that Alaris\u0026#39;s new solution is not \u003cem\u003ejust\u003c/em\u003e about providing technology for selling firms to find better-fit M\u0026amp;A partners, but for driving business to (and even aiding in the process of) Alaris\u0026#39;s own M\u0026amp;A consulting business (which Alaris doesn\u0026#39;t sell \u0026#34;the software\u0026#34;, it uses the software as a value-add to win M\u0026amp;A consulting business with prospective sellers).\u003c/p\u003e\n\u003cp\u003eStill, with this much money flowing into the M\u0026amp;A space, there\u0026#39;s presumably a fair amount of demand from selling (or even just selling-curious) firms for a solution that can solve the problem of finding an acquirer who is a good fit before talking about the dollars involved. If at some point the market turns back towards buyers, then sellers might have to move their focus back to price first – but at least in the current environment, sellers can be reasonably sure that a \u0026#34;fair market value\u0026#34; in dollars will be there regardless, which allows them to put fit at the center of their consideration (and maximize the likelihood they get all the dollars, including with post-deal contingencies), and which positions Alaris well to get connected with selling firms via its fit-first solution.\u003cstrong\u003e \u003c/strong\u003e\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eIn the meantime, we\u0026#39;ve rolled out \u003cu\u003e\u003ca href=\"https://fintech.kitces.com/\" target=\"_blank\" rel=\"noopener\"\u003ea beta version of our new AdvisorTech Directory\u003c/a\u003e\u003c/u\u003e, along with making updates to the latest version of our Financial AdvisorTech Solutions Map (produced in collaboration with Craig Iskowitz of \u003cu\u003e\u003ca href=\"https://ezragroupllc.com/\" target=\"_blank\" rel=\"noopener\"\u003eEzra Group\u003c/a\u003e\u003c/u\u003e)!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/fintechmap/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Advisor FinTech Landscape April\" src=\"https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025.png\" alt=\"Advisor FinTech Landscape April\" width=\"2560\" height=\"1920\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025.png 2560w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-300x225.png 300w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-1024x768.png 1024w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-768x576.png 768w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-1536x1152.png 1536w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-2048x1536.png 2048w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-2000x1500.png 2000w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-800x600.png 800w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025.png 2560w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-300x225.png 300w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-1024x768.png 1024w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-768x576.png 768w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-1536x1152.png 1536w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-2048x1536.png 2048w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-2000x1500.png 2000w, https://www.kitces.com/wp-content/uploads/2025/04/Advisor-FinTech-Landscape-April-2025-800x600.png 800w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eSo what do you think? Is the possibility of using AI meeting note technology that\u0026#39;s built into a CRM platform worth switching from a standalone provider? Can TaxStatus threaten Holistiplan\u0026#39;s position in the tax planning category by eliminating the need for uploading PDFs of client tax returns? Is it worth paying for white-labeled investment visuals for client-facing materials versus \u0026#39;borrowing\u0026#39; graphics from other sources? Let us know your thoughts by sharing in the comments below\u003c/strong\u003e\u003cstrong\u003e!\u003c/strong\u003e\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;Wealthbox’s Upcoming Built-In AI Meeting Notes Tool Signals Competition For Standalone Providers (And More Of The Latest In Financial #AdvisorTech – March 2025)\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-4dbe267bc7d01d62e67d52e5-=\"\"\u003e\n                    \u003cimg decoding=\"async\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\n                    \u003c/a\u003e\n                \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "50 min read",
  "publishedTime": "2025-04-07T07:04:03-04:00",
  "modifiedTime": "2025-04-03T20:51:06Z"
}
