{
  "id": "2e7c9fec-5b4f-4db1-87cb-32dbb24a1bef",
  "title": "America (and I) Went on a Pre-Tariff Splurge in March",
  "link": "https://www.nerdwallet.com/article/cars/car-sales-march-2025",
  "description": "With higher prices on the horizon, consumers have gone shopping, as reflected in retail sales figures for March. Car sales in particular were up sharply.",
  "author": "Rick VanderKnyff",
  "published": "Wed, 16 Apr 2025 22:36:35 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Car News",
    "Cars"
  ],
  "byline": "Rick VanderKnyff",
  "length": 5109,
  "excerpt": "With higher prices on the horizon, consumers have gone shopping, as reflected in retail sales figures for March. Car sales in particular were up sharply.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "My wife and I bought a new car last month.It turns out we were not alone. That was made apparent by the crowds at the dealership where we bought our hybrid hatchback on March 30, and confirmed by a new report on retail sales figures for March. Advance estimates of March retail sales released today by the U.S. Census Bureau showed sales of motor vehicles and parts up 5.3% over the previous month, compared to a 1.6% decline in February. When looking back to March 2024, car sales were up a whopping 8.8% year over year.Overall, retail sales were up 1.4% over February — the largest month-over-month rise in more than two years, according to Reuters, and above expectations for the month. In addition to cars, categories that saw month-over-month growth include building materials (up 3.3%) and a grouping that includes sporting goods, hobbies, musical instruments and bookstores (up 2.4%).News moves fast. Stay ahead of how it could impact your money.Interest rates, inflation, natural disasters — get notified when breaking news could affect your finances, and get expert insights to help you plan your next move. Typically, economists would applaud numbers like this as signs of a healthy economy, but in this case the consensus is that March is a one-time splurge with rockier seas ahead. “March was basically a big clearance sale in the eyes of many consumers,” Heather Long, an economics columnist at the Washington Post, posted on X. “This is unlikely to continue.”The March rise in retail sales is a reaction to the myriad wide-ranging tariffs that President Donald Trump has put into motion since taking office in January. The resulting trade war is expected to reignite inflation on a wide range of items, everything from everyday essentials like food and clothing to luxury items and big-ticket purchases — like cars. While many of the tariffs are now in effect for goods coming into the country, existing inventories are largely priced at their pre-tariff levels. Of course, those inventories will not last forever. According to estimates from Cox Automotive, the 91-day supply of new vehicles across all brands recorded at the beginning of March had shrunk to 70 days by April 1. Inventory levels are much lower for certain in-demand brands, below 50 days for Lexus, Toyota, Honda and Subaru. Once those inventories run out, dealers will begin filling their lots with cars that have been hit by tariffs — a tax paid by the importer, but typically tacked onto the final sales price. Chief among the announced auto duties now in effect is a 25% tariff on imported cars and light trucks, to be joined before May 3 by a 25% tariff on car parts manufactured outside the U.S. (There are partial exceptions for certain models assembled in Canada and Mexico). Trump has exhorted consumers to buy American cars and trucks, but after decades of supply chain and manufacturing globalization, there is not a single car model made entirely in the U.S. The Tesla Model Y comes closest, but the top 10 vehicles in the Cars.com “American-Made Index Report” for 2024 includes models of Honda, Toyota, Volkswagen and Lexus. Thanks to tariffs, car prices are expected to rise $2,000 or more for some economy models and as much as $20,000 for luxury models. Used cars are not directly affected by tariffs, but inventories are shrinking there as well, just as they did in the thick of the pandemic. Kelley Blue Book reported that the average car dealer had a 43-day supply of used cars at the beginning of March, which had declined to 39 days at the end of the month.Finally buying that second carTrump signaled his love for tariffs all through his campaign, and began implementing them through executive order as soon as he took office. He announced the 25% auto tariff on March 26. My wife and I didn’t waste time. On March 30, we signed the paperwork on a bright blue Honda Civic (assembled in Indiana, with a Japanese-made engine and drive train).We tend to save up and pay cash for new cars, and keep them for a decade or more. Our adult sons are out of the house and we’ve gotten by reasonably well for the past few years with one car, a reliable Subaru Forester that is great in the kind of weather we’re apt to get in Western Washington, but with less-than-ideal gas mileage.We’d been thinking about a second car, something more fuel-efficient, especially for all those local trips. We had the money set aside, but the decision didn’t seem urgent — until that tariff announcement. It seems clear many folks who bought in March were in a similar boat: thinking it was time to buy a new car, accelerating that decision based on the sharp price rise that is about to hit. When we sat down with the sales manager to finalize the deal, it was the Sunday after the Wednesday tariff announcement. He said the sales team had been running full-tilt since then and that popular models were disappearing rapidly. We bought one of the last two available of the model we had targeted.When we asked what he figured our car would have cost after tariffs, he ran the numbers on his calculator. At least $6,000 more, he said.",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2025/04/IMG_6672-1440x864.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eMy wife and I bought a new car last month.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIt turns out we were not alone. That was made apparent by the crowds at the dealership where we bought our hybrid hatchback on March 30, and confirmed by a new report on retail sales figures for March. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAdvance estimates of March retail sales released today by the U.S. Census Bureau showed sales of motor vehicles and parts up 5.3% over the previous month, compared to a 1.6% decline in February. When looking back to March 2024, car sales were up a whopping 8.8% year over year.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eOverall, retail sales were up 1.4% over February — the largest month-over-month rise in more than two years, according to Reuters, and above expectations for the month. In addition to cars, categories that saw month-over-month growth include building materials (up 3.3%) and a grouping that includes sporting goods, hobbies, musical instruments and bookstores (up 2.4%).\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ch3 data-currency=\"Text\" id=\"news-moves-fast.-stay-ahead-of-how-it-could-impact-your-money.\"\u003e\u003cspan\u003eNews moves fast. Stay ahead of how it could impact your money.\u003c/span\u003e\u003c/h3\u003e\u003cp\u003e\u003cspan\u003eInterest rates, inflation, natural disasters — get notified when breaking news could affect your finances, and get expert insights to help you plan your next move. \u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" src=\"https://s3.us-east-1.amazonaws.com/cdns3.nerdwallet.com/User+Engagement/25Q1_UEG_Content-Site-Ads-2-Fed_signals_major.svg\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eTypically, economists would applaud numbers like this as signs of a healthy economy, but in this case the consensus is that March is a one-time splurge with rockier seas ahead. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“March was basically a big clearance sale in the eyes of many consumers,” Heather Long, an economics columnist at the Washington Post, posted on X. “This is unlikely to continue.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe March rise in retail sales is a reaction to the myriad wide-ranging \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/tariff-news\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003etariffs\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e that President Donald Trump has put into motion since taking office in January. The resulting \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/what-is-a-trade-war\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003etrade war\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e is expected to reignite \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/trump-tariffs\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003einflation on a wide range of items\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, everything from everyday essentials like food and clothing to luxury items and big-ticket purchases — like cars. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhile many of the tariffs are now in effect for goods coming into the country, existing inventories are largely priced at their pre-tariff levels. Of course, those inventories will not last forever. According to estimates from Cox Automotive, the 91-day supply of new vehicles across all brands recorded at the beginning of March had shrunk to 70 days by April 1. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eInventory levels are much lower for certain in-demand brands, below 50 days for Lexus, Toyota, Honda and Subaru. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eOnce those inventories run out, dealers will begin filling their lots with cars that have been hit by tariffs — a tax paid by the importer, but typically tacked onto the final sales price. Chief among the announced auto duties now in effect is a 25% tariff on imported cars and light trucks, to be joined before May 3 by a 25% tariff on car parts manufactured outside the U.S. (There are partial exceptions for certain models assembled in Canada and Mexico). \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eTrump has exhorted consumers to buy American cars and trucks, but after decades of supply chain and manufacturing globalization, there is not a single car model made entirely in the U.S. The Tesla Model Y comes closest, but the top 10 vehicles in the Cars.com “American-Made Index Report” for 2024 includes models of Honda, Toyota, Volkswagen and Lexus. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThanks to tariffs, \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/cars/car-market-prices\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003ecar prices\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e are expected to rise $2,000 or more for some economy models and as much as $20,000 for luxury models. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eUsed cars are not directly affected by tariffs, but inventories are shrinking there as well, just as they did in the thick of the pandemic. Kelley Blue Book reported that the average car dealer had a 43-day supply of used cars at the beginning of March, which had declined to 39 days at the end of the month.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"finally-buying-that-second-car\"\u003e\u003cspan\u003eFinally buying that second car\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eTrump signaled his love for tariffs all through his campaign, and began implementing them through executive order as soon as he took office. He announced the 25% auto tariff on March 26. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMy wife and I didn’t waste time. On March 30, we signed the paperwork on a bright blue Honda Civic (assembled in Indiana, with a Japanese-made engine and drive train).\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWe tend to save up and pay cash for new cars, and keep them for a decade or more. Our adult sons are out of the house and we’ve gotten by reasonably well for the past few years with one car, a reliable Subaru Forester that is great in the kind of weather we’re apt to get in Western Washington, but with less-than-ideal gas mileage.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWe’d been thinking about a second car, something more fuel-efficient, especially for all those local trips. We had the money set aside, but the decision didn’t seem urgent — until that tariff announcement. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIt seems clear many folks who bought in March were in a similar boat: thinking it was time to buy a new car, accelerating that decision based on the sharp price rise that is about to hit. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhen we sat down with the sales manager to finalize the deal, it was the Sunday after the Wednesday tariff announcement. He said the sales team had been running full-tilt since then and that popular models were disappearing rapidly. We bought one of the last two available of the model we had targeted.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhen we asked what he figured our car would have cost after tariffs, he ran the numbers on his calculator. At least $6,000 more, he said.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-04-16T22:36:35Z",
  "modifiedTime": null
}
