{
  "id": "3efd4320-82c6-443c-a6d3-f34cd3c911fd",
  "title": "Holistiplan’s Fee Increase Sparks Competition From FP Alpha And RightCapital (And More Of The Latest In Financial #AdvisorTech – February 2025)",
  "link": "https://feeds.feedblitz.com/~/912181838/0/kitcesnerdseyeview~Holistiplans-Fee-Increase-Sparks-Competition-From-FP-Alpha-And-RightCapital-And-More-Of-The-Latest-In-Financial-AdvisorTech-%e2%80%93-February/",
  "description": "Welcome to the February 2025 issue of the Latest News in Financial #AdvisorTech – where we look at the big news, announcements, and underlying trends and developments that are emerging in the world of technology solutions for financial advisors! This month's edition kicks off with the news that FP Alpha has released its tax returnRead More... The post Holistiplan’s Fee Increase Sparks Competition From FP Alpha And RightCapital (And More Of The Latest In Financial #AdvisorTech – February 2025) first appeared on Kitces.com.",
  "author": "Ben Henry-Moreland",
  "published": "Mon, 03 Feb 2025 12:01:38 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Technology \u0026 Advisor FinTech",
    "OPTIN: One Page Business Plan (BAR)",
    "OPTIN: One Page Business Plan (SLIDE IN)"
  ],
  "byline": "Ben Henry-Moreland",
  "length": 44903,
  "excerpt": "Welcome to the February 2025 issue of the Latest News in Financial #AdvisorTech – where we look at the big news, announcements, and underlying trends and developments that are emerging in the world of technology solutions for financial advisors! This month's edition kicks off with the news that FP Alpha has released its tax return",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary Welcome to the February 2025 issue of the Latest News in Financial #AdvisorTech – where we look at the big news, announcements, and underlying trends and developments that are emerging in the world of technology solutions for financial advisors! This month's edition kicks off with the news that FP Alpha has released its tax return extraction and analysis module as a standalone product, while RightCapital has separately launched its own tax return extraction tool bundled within its platform – with both announcements coming on the heels of Holistiplan implementing a significant price increase, suggesting that Holistiplan's decision to raise prices may have inadvertently opened the door for more competition within the tax planning technology category (which it had previously had all to itself) From there, the latest highlights also feature a number of other interesting advisor technology announcements, including: Move Health, a service that provides guidance on and implementation of health insurance solutions for financial advisors, has acquired Caribou, a software tool for analyzing and comparing different health insurance plans, creating a single end-to-end platform for healthcare cost analysis and implementation of health insurance – although the question remains how deeply advisors are willing to get into health insurance implementation with their clients when they tend not to be health insurance experts themselves Advisor Credit Exchange, a marketplace solution connecting advisors with lending solutions for their clients, announced that it plans to shut down – which raises questions for Envestnet (which had an equity stake in Advisor Credit Exchange and featured it on its platform) and if it will further step back from its \"marketplace of marketplaces\" model as it pertains to non-investment-based solutions under its new ownership; as well as about the outlook for other lending marketplace platforms and whether liability management is too far outside of advisors' core offerings to gain much traction? Wealthtender, a lead generation and advisor review gathering platform, has launched a new Testimonial Marketing Studio to help advisors better promote their client testimonials in social media and email campaigns, reflecting the reality that advisors have generally been slow to adopt testimonial marketing since the release of the SEC's Marketing Rule in 2021, and that platforms like Wealthtender have needed to offer tools like Testimonial Marketing Studio to encourage advisors to solicit and promote client reviews in order for those platforms to gain traction Read the analysis about these announcements in this month's column, and a discussion of more trends in advisor technology, including: Mili, one of the most recent AI-powered notetaking solutions on the AdvisorTech Map, has announced a recent $2M seed funding round – although Mili's choice to position itself as the \"most secure\" notetaker reflects the reality that technology solutions often misunderstand what advisors want to see highlighted in technology (e.g., they expect all the different AI notetaker solutions to have a baseline level of data security, but beyond that they care about which one does the best job of solving their problems than they do about which one is the \"most\" secure) Advisor360 has announced its acquisition of the AI meeting notes platform Parrot AI, representing the first existing advisor technology platform to integrate AI notetaking into its own solution – which could be an ominous sign for the many standalone AI notetaker tools on the market, because if the trend to bring AI notetaking in-house picks up speed among existing advisor platforms, the market for standalone tools could shrink very quickly if advisors decide they would rather have AI notetaking as a feature within the tools they already use And be certain to read to the end, where we have provided an update to our popular \"Financial AdvisorTech Solutions Map\" (and also added the changes to our AdvisorTech Directory) as well! *And for #AdvisorTech companies who want to submit their tech announcements for consideration in future issues, please submit to [email protected]! Ben Henry-Moreland Team Kitces Ben Henry-Moreland is a Senior Financial Planning Nerd at Kitces.com, where he specializes in writing and speaking on financial planning topics including tax, practice management, and technology. He also co-authors the monthly Kitces #AdvisorTech column. Drawing from his experience as a financial planner and a solo advisory firm owner, Ben is passionate about fulfilling the site’s mission of making financial advicers better and more successful. Read more of Ben’s articles here. + Read More + Michael Kitces Team Kitces Michael Kitces is Head of Planning Strategy at Focus Partners Wealth, which provides an evidence-based approach to private wealth management for near- and current retirees, and Focus Partners Advisor Solutions, a turnkey wealth management services provider supporting thousands of independent financial advisors through the scaling phase of growth. In addition, he is a co-founder of the XY Planning Network, AdvicePay, fpPathfinder, and New Planner Recruiting, the former Practitioner Editor of the Journal of Financial Planning, the host of the Financial Advisor Success podcast, and the publisher of the popular financial planning industry blog Nerd’s Eye View through his website Kitces.com, dedicated to advancing knowledge in financial planning. In 2010, Michael was recognized with one of the FPA’s “Heart of Financial Planning” awards for his dedication and work in advancing the profession. Read all of Michael’s articles here. + Read More + Tax planning is a key component of the financial planning process, but for many years it was difficult to scale over an entire client base. This had partly to do with the sheer scope and ever-growing complexity of the tax code and the amount of knowledge and training needed to keep up with tax planning opportunities were available. But it was also because much of the information needed to do comprehensive tax planning (income, deductions, credits, dependents, business expenses, withholdings, etc.) tends to be contained in a client's current and historical tax returns. Which meant historically that finding the information buried in a client's tax return was a manual process of poring over the various schedules and worksheets, and the only real way to get more efficient was to gain enough familiarity with the forms themselves (either through reviewing clients' returns year after year or through experiential training and education on tax return review) to know where to look to quickly find the necessary data. In 2019, however, the bar for efficiently reviewing client tax returns was lowered significantly with the launch of Holistiplan. Now advisors could simply upload a client's return to Holistiplan's platform, which automatically scans the return and delivers a client- (and advisor-)friendly summary of the client's tax situation with key numbers and potential planning opportunities, without the need to pore through pages of return documents themselves. The sheer usefulness of Holistiplan in delivering quick and user-friendly tax analysis caused it to explode in popularity almost overnight; within 5 years, according to Kitces Research on Advisor Technology, Holistiplan had a 42% adoption rate among all advisors, dominating the previously-niche tax planning software category. For most of the time since its 2019 launch, Holistiplan has continued to have most of the tax planning market to itself. Although other software providers have expanded document extraction technology to other types of documents in hopes of becoming \"the Holistiplan of\" other categories like estate planning, investment analysis, and insurance review, few providers have directly challenged Holistiplan in the realm of tax return analysis. The main exception to this over the past few years has been FP Alpha, which created its own tax return extraction tool which feeds clients' tax return data into a \"snapshot\" summary report, tax projections, and Roth conversion analysis. The caveat, however, was that up until now FP Alpha's tax module has only been offered as a part of its broader suite of planning tools which also include estate planning and property and casualty insurance. Which meant that unlike Holistiplan, where advisors interested in just the tax planning solution could buy that as a standalone product, FP Alpha required advisors to purchase the whole bundle, even if they only wanted to use the tax module and had no interest in the estate or insurance components. And so despite having built out a tool that functioned similarly to Holistiplan, FP Alpha struggled to make a meaningful dent in Holistiplan's market share in the tax planning category of the AdvisorTech Solutions Map. In late 2024, however, Holistiplan inadvertently opened the door to more competition when it began communicating to its users a major price restructuring which nearly doubled the cost of the tool. And as well regarded as Holistiplan is among its users – its 9.1 average satisfaction rating in the most recent Kitces Research on Advisor Technology made it one of the highest rated software solutions in any category – the steep price increase has sparked at least some interest among advisors in finding a competing solution. And so coincidentally – or perhaps not-so-coincidentally – in the news in January was the story that FP Alpha has made its tax module available to buy as a standalone product, which it's calling FP Alpha Tax. On top of that, the comprehensive financial planning platform RightCapital also chose this month to unveil its own tax return extraction and analysis tool, dubbed Tax Analyzer, which is bundled in with its Premium pricing tier. It isn't necessarily the case that FP Alpha's and RightCapital's announcements were intentionally made in reaction to Holistiplan's pricing change, but what is certain is that they come at a time when some advisors might be especially receptive to the idea of changing their tax planning software if a less expensive option is available. To that end, both FP Alpha's and RightCapital's solutions are less expensive than Holistiplan: FP Alpha Tax currently charges $1,125 for the first 75 tax uploads versus $1,999 for Holistiplan's 75-household plan, while RightCapital's Tax Analyzer doesn't cost anything beyond the $179.95 monthly fee for their Premium subscription tier. Notably, the differences between Holistiplan, FP Alpha Tax, and RightCapital's Tax Analyzer go beyond their respective prices. For instance, Holistiplan's Premium tier includes features like support for state taxes, an auto-generated \"tax preparer letter\" detailing the client's significant tax events from the past year (e.g., property sales, Roth conversions, or charitable contributions), as well as a bundled-in property and casualty insurance analysis tool. FP Alpha Tax, meanwhile, is centered around its three core components of the tax snapshot, projection, and Roth conversion analysis. In other words, Holistiplan, while being generally more expensive, comes with a bigger feature set; while FP Alpha Tax is a more focused tool for pure Federal tax planning (which is an ironic reversal of the previous situation where FP Alpha was the bundled tool and Holistiplan was the pure tax planning tool!). RightCapital's Tax Analyzer, meanwhile, appears to be less about creating detailed tax summaries for the previous year and more about quickly setting up future planning scenarios. So advisors can choose whether Holistiplan's higher price continues to be worth it for the features that they offer; whether FP Alpha Tax provides a better match between price and the features the advisor needs; or (for advisors already using RightCapital) whether Tax Analyzer's more basic tools provide enough value that it isn't worth paying anything more for a standalone solution. All of which goes to highlight the pressure that specialized planning tools can find themselves under, especially once they find enough success to attract the notice of potential competitors. On one side, there can be the temptation to provide more and more features on the premise of \"adding value\", which generally necessitates charging higher fees and can leave the provider open to being undercut by less-expensive competitors. And on the other side are comprehensive planning platforms that can decide to introduce their own version of the tool for \"free\" to its existing users (something that RightCapital has done multiple times in the past) that can eliminate some advisors' need to pay anything extra for the tool at all. In this case, Holistiplan – possibly under pressure from the private equity owners who took a stake in the company in the fall of 2023 – decided to take the path of adding features and commensurately increasing prices. Which made sense at some level, given the previous lack of competitive pressure and the fact that the price increase was high enough that Holistiplan could have lost some users and still come out ahead in the end. And notably, many advisors may still find Holistiplan to be well worth the cost even at a higher price point. But still, when a provider decides to raise prices by that much all at once, it creates space for competitors to gain a foothold – and Holistiplan's decision may have inadvertently created the need for it to learn how to compete in a market it had only ever had all to itself. Move Health Acquires Caribou To Combine Health Insurance Implementation And Planning Each year, Fidelity puts out an update of its annual Health Cost Estimate, which seeks to quantify the amount that an average 65-year-old can expect to spend on healthcare costs in retirement. Each year's update is usually headlined with an eye-popping number about the total cost of retirees' healthcare savings: In the 2024 report, for example, the estimate is that each 65-year-old retiring this year can expect to spend $165,000 in healthcare costs, with the amount doubled to $330,000 for couples. As daunting as those numbers look when framed as a lump-sum, however, the reality is that healthcare costs aren't necessarily that prohibitive for many retirees – especially those with the affluence to become clients of financial advisors. Dividing the $165,000 headline number by the 20-year typical life expectancy of a 65-year-old results in $8,250 per year (with a significant part of that amount coming in the form of premiums for Medicare Parts B, D, and/or any supplemental Medicare coverage). Overall, Medicare has generally done a good job of narrowing the range of retirement healthcare costs and reducing the occurrence of \"surprise\" healthcare bills that could put an unexpected strain on a previously healthy financial plan. All of which means that, while healthcare costs are often a component of long-term retirement projections as a part of the financial planning process, there has been historically little traction for technology tools that go deeper into healthcare planning. For most retirees, healthcare is just another recurring expense category alongside their other nondiscretionary costs like food and housing, which scales up or down depending on the overall health of the retiree – in other words, people in poorer health tend to be aware of that fact and to budget for higher healthcare costs accordingly. What makes the relative predictability of healthcare costs possible, however, is insurance – either employer-provided plans for W-2 employees and their families, private or Marketplace plans for early retirees and self-employed workers, or Medicare for seniors age 65 and older. Everyone needs insurance, and with a wide range of options available (especially for early retirees and self-employed workers who don't have an employer-provided plan, and for retirees with a plethora of supplemental Medicare and Medicare Advantage plans to choose from) there's a sizeable gap in health insurance solutions to be solved for. The trouble is that most financial advisors don't write or sell health insurance policies themselves – advisors by and large don't have deep expertise into different types of health insurance that would allow them to recommend the best plan for a client, and even if they did, the fact that health insurance plans are overwhelmingly sold on commission would preclude them from being offered by fee-only advisors. And so at the end of the day, there's a gap between a client's need for a healthcare plan that allows them to control their healthcare costs, and a solution that can help them find and implement the right policy for their needs. In recent years, Move Health has sought to address this gap by offering financial advisors a platform where they can connect clients with Move Health's in-house health insurance planners, who can recommend and enroll clients in health insurance plans – effectively serving as an outsourced insurance desk specifically for health insurance. And now in the news this month, Move Health has announced that it has acquired Caribou, a healthcare planning tool that had up until now been a \"pure\" software tool (i.e., focused on planning for healthcare costs and comparing plan options, without support for implementing the policy itself). The acquisition makes sense at first glance: Caribou's technology for analyzing different healthcare options complements Move Health's ability to recommend and enroll clients in policies, which makes Move Health more of an end-to-end solution in both planning and implementing health insurance for advisory clients. But in a way, the acquisition may also imply that Caribou perhaps wasn't getting the traction among advisors that it needed to survive as a standalone health insurance planning solution, to the point that the best way forward was to attach itself to a provider that could actually handle the implementation part as well. Which opens up a broader question about how willing financial advisors may be to go in-depth into health insurance with their clients, either from a planning or an implementation standpoint. The time spent on analyzing plans, comparing options, and managing the relationship between the client and the insurance planner has to come from somewhere, and with advisors more likely to center their value proposition around the core areas of retirement planning, tax planning, and investment management, the reality is that healthcare planning may lay too far away from the advisor's main revenue center to justify the resources it would require. All of which isn't to downplay the importance of health insurance planning and implementation – clearly everyone needs health insurance, and finding the right plan is a key part of managing healthcare costs at any stage of life. But for advisors for whom healthcare planning has traditionally been outside of their core competency, expanding into that space often brings up questions the advisor may not be equipped to handle. And so the question for both Move Health and Caribou going forward is whether providing a tech-enabled service to make it easier to plan and implement healthcare solutions for clients will actually draw more advisors to include healthcare planning into their own practices – or whether the topic will remain too far outside of their comfort zone (and too far away from their core value proposition) to make it worthwhile? Envestnet-Backed Advisor Credit Exchange Shuts Down As Advisors Show Limited Interest In Implementing Debt Solutions For Clients The modern \"marketplace\" model in advisor technology has its roots in the expansion of the RIA channel in the late 1990s and early 2000s, when financial advisors began to shift away from selling individual product solutions like mutual funds and insurance policies (and being compensated with commissions on those sales) and towards managing portfolios (and being compensated on an ongoing AUM basis). In order to scale the process of managing asset-allocated portfolios across an entire client base, advisors increasingly turned to third party solutions like TAMPs and SMAs (who handled both model creation and implementation of client portfolios), which in turn led to an unbundling of the TAMP and the creation of model marketplaces (who set the model, but leave the implementation to the advisor)… and the rise of platforms like Envestnet, Orion Communities, and Schwab's Model Market Center to connect advisors with the proliferating number of TAMPs, SMAs, and outsourced model providers that existed to serve them. As these platforms built out their marketplaces – and the technology to facilitate them – advisors were also increasingly expanding their services beyond portfolio management and into more holistic financial planning. And so the logical next step for technology providers was to take the marketplace approach that had already proven effective for distributing managed accounts and model portfolios, and to apply it to other types of financial products that advisors may recommend to their clients. Which led to the emergence of providers like DPL Financial Partners and FidX (for insurance and annuity products), and Sora, Sandbox, and Advisor Credit Exchange for (for loans and credit solutions). But while marketplace-style solutions can make a lot of sense for financial advisors on the investment management side since they're directly tied to the advisor's main source of revenue (managing portfolio assets), the question with other types of marketplaces has always been whether they fall too far outside of the advisor's core services to generate significant enough demand for the products they offer – or in other words, even if they provide a great \"storefront\" of annuity products or lenders, is that enough for advisors to want to undertake the extra work of helping their clients implement, instead of 'simply' referring out to a fellow professional who can help clients instead (and who actually gets paid to do the implementation)? In this context, it's notable that Advisor Credit Exchange, one of the first advisor-focused marketplaces for lending products, announced in January that it would be shutting down at the end of the month. The news came after reports in December that the startup had laid off staff and was exploring strategic options, suggesting that it wasn't able to find an acquisition partner or a fresh source of capital in the interim. Advisor Credit Exchange's story is closely linked to Envestnet, as the two platforms have partnered since 2019 to offer lending products on Envestnet's platform, while Envestnet also owned an equity stake in Advisor Credit Exchange. And for its part, Envestnet was just last year taken private by Bain Capital. The implication, then, is that as Envestnet's new owners have evaluated the many segments of the business to figure out a way to make the whole (at least) as valuable as its parts, they made the decision to not further support Advisor Credit Exchange, which (presuming it wasn't able to find another buyer) left it with little other choice than to wind down. For Envestnet, the shutdown of Advisor Credit Exchange represents the first in what could be multiple steps back from its \"marketplace of marketplaces\" approach that offers channels to connect advisors with providers of not only a host of investment products but also insurance products (through FidX), estate planning and trust solutions (through Trucendent), and up until the shutdown of Advisor Credit Exchange, banking and lending products. Notably, Envestnet also owns an equity stake in FidX, which launched on the Envestnet platform at about the same time Advisor Credit Exchange did, as well as in Trucendent. The fact that those platforms are still standing today (at least for now), while Advisor Credit Exchange isn't, suggests that they performed better in Bain's post-acquisition analysis – which makes sense given that insurance and estate planning have traditionally been more of a core part of advisors' service offering, while debt management (at least in terms of finding and implementing liability solutions for clients) has not. Which raises the question for other platforms like Sora and Sandbox that offer debt and lending solutions for clients of financial advisors of how much traction they can reasonably expect to gain given that Advisor Credit Exchange, which had the benefit of partnering with one of the biggest marketplace and technology platforms in Envestnet and the 100,000+ advisors that use some part of its platform already, wasn't able to find a sustainable path forward. Granted, the issue could have lain more with Envestnet than with Advisor Credit Exchange itself, as Envestnet had long struggled to effectively manage all its different parts into a well-functioning whole. But there's at least the possibility that liability management may lay too far afield for most advisors to consider as a meaningful part of their service offering. Because while there can be instances, particularly with ultra-high-net-worth clients, where finding a lender who can offer a loan at 0.5% or 1% less than the market rate can result in material savings and be well worth the effort to do so, the reality is that those clients (and the advisors that serve them) are relatively few in number. For most other advisors, to the extent that they do help their clients find lending solutions, it more often comes in the form of developing relationships with bankers or mortgage brokers whom they can refer clients to while not being involved in (or in some cases, dragged into the minutia of) finding or securing the specific loan. And so the bottom line is that, while there's a proven business model for marketplaces that can facilitate transactions between clients and third party financial solution providers, the opportunity is really only at its strongest when the solution is in an area, like investment management, that generates revenue for the advisor or at least is closely tied to the advisor's core value proposition (and isn't already easy to refer out to a trusted partner). For a solution that's farther afield from the advisor's revenue source, like lending management, the opportunity can still be there if the solution can perhaps help the advisor truly to meaningfully differentiate – such as gaining a foothold in the UHNW space by offering HNW clients loans at terms that are bona fide superior than they could get elsewhere. But as the Advisor Credit Exchange story makes clear, there may not be enough of a natural demand for lending solutions to yield a sustainable offering for all advisors? In the Internet era, when someone wants to find a local restaurant or plumber or dentist or almost any other service provider, they go online to look for it. And when it's important to find the best provider – the restaurant that will provide the best setting for an anniversary date night, or the plumber who won't leave a whole in the wall, or the dentist who won't overly judge their patients' flossing habits – people often rely on reviews from their peers to get a sense of who they can trust. To fulfill this demand for peer reviews of businesses and service providers, a number of review platforms have popped up over the years, from general-purpose platforms like Yelp and Google Reviews to industry-specific sites like Angi (for home services) and Healthgrades (for medical professionals). Except up until early 2021, there were no review sites for financial advisors, on account of what was at the time an SEC rule strictly forbidding advisors from soliciting client testimonials, or from promoting any testimonials that a client may have left (assuming they found their way to the site and left a review on their own accord). Which left no room for a sustainable business model for an advisor-specific review platform: With advisors unable to highlight the platform in any way, there would have been few ways for a platform to gain a critical mass of reviews or to effectively monetize the reviews that were written. Starting in 2021, however, the SEC's updated Marketing Rule finally opened the doors for financial advisors to solicit and promote testimonials. In the years since, a number of financial advisor review platforms have emerged, including Amplify Reviews, TestimonialIQ, IndyFin (which was acquired by lead generation platform WiserAdvisor in 2023) and Wealthtender. But despite now being allowed to employ testimonials in their marketing, advisors have been slow to do so. Which may be partially on account of the specific conditions and disclosure requirements mandated by the SEC Marketing Rule to avoid the possibility of an advisor cherry-picking the best reviews to make public. But it may also be because, having not been allowed to use testimonials when they were initially building their businesses and marketing practices, many advisors simply aren't sure how to make the best use of the testimonials they get. And so it's notable that this month Wealthtender has announced the launch of a new Testimonial Marketing Studio, a suite of design tools meant to help advisors 'dress up' their reviews and testimonials for promotion on social media and email marketing campaigns. At a certain level, it makes sense for Wealthtender to invest in more tools to help advisors promote their reviews. Although advisors may now be allowed to solicit and highlight testimonials, those testimonials don't do any good if they're not seen by prospective clients. And while the advisor could certainly the reviews they've received on their own website, that only works if there's a marketing engine that can reliably drive prospects to that website – as with digital onboarding and robo-advice tools, it isn't an \"if you build it, they will come\" proposition where embedded testimonials will automatically translate into more pageviews to read them. And from Wealthtender's perspective, it definitely helps to create a way to get more eyeballs on Wealthtender-hosted reviews as they aim to become the site for financial advisor reviews (as, for example, Angi has become the site to find reviews of home contractors). The question, however, is that if Wealthtender is launching a new effort to gain more attention for its reviews \"off-platform\" (e.g., on social media and in email campaigns), does that indicate that it's having trouble gaining traction \"on-platform\" with accumulating reviews on its site? The reason that advisor review sites struggled before the new SEC Marketing Rule was because advisors couldn't send clients to leave reviews or prospects to read them. And so even though testimonials are now allowed, those sites will continue to struggle if advisors still aren't actively soliciting or promoting reviews. Ultimately, financial advisors have long struggled with marketing, and tend to cling hard to the tried-and-true methods like client referrals, developing relationships with centers of influence like accountants and attorneys, and event marketing – which is reflected in advisors' general slowness to adopt testimonials. However, as the cost of traditional marketing methods increase (with the most recent Kitces Research on Marketing showing the average client acquisition costs have risen by 75% from 2021 to 2024), advisors may find themselves more open to trying new (to them) methods. For which Wealthtender has positioned themselves well to guide advisors through collecting and deploying client testimonials, once they get around to doing so. In August of 2023, Client Meeting Support was a fairly tiny category of the Kitces AdvisorTech Map, consisting of just five providers offering various ways to enhance efficiency around client meetings, from meeting note and follow-up templates to dictation and transcription tools: Kitces AdvisorTech Map August 2023: In the last 18 months, however, we've added a whopping 10 new tools to the Client Meeting Support category – all of which offer as their core feature some form of AI-enabled notetaking and meeting summary generation: Kitces AdvisorTech Map February 2025: Keep in mind that these are just the notetaking tools that are specific to financial advisors. There are plenty of other general-purpose tools, including Fathom, Otter, Fireflies, Zoom AI Companion, and many others. The proliferation of AI notetaking tools reflects the sheer amount of opportunity that tech providers and investors sense in reducing the time needed for meeting preparation and follow-up (and capitalizes on the 'AI is the future' frenzy of venture capital investors). Which makes sense, given how much time those tasks tend to take when done manually (e.g., the most recent Kitces Research on the Financial Planning Process showed that advisors spend an hour or more on meeting prep and follow-up for each hour of client meetings). Any tool that could cut that time down even by 50% would represent meaningful time savings, and an opportunity to significantly boost advisor productivity. The problem that arises when so many providers show up all at once that each essentially offer versions of the same service, though, is that they become harder and harder to differentiate from one another. And the more new providers pile into the space, the more of a burden it is on advisors to evaluate them all and decide which one is actually the best fit for their purposes. So it becomes incumbent on each new provider to effectively show what makes them different – if they can't find a way to stand out, they'll fade together with all the rest of the providers. All of which makes it interesting to see how each new AI meeting note tool positions itself relative to the others. A notable example of this is Mili, an AI note-taking solution that recently emerged from \"stealth\" mode and announced a $2 million seed funding investment. Mili, as the current version of its website makes clear, positions itself as the \"most secure meeting assistant for wealth advisors\". Which is fine as far as it goes – obviously advisors don't want to have their clients' personal information compromised by hackers or absorbed into an AI model's training data. But at this point, don't advisors expect their AI notetaking tools to be secure? To that end, most of the existing AI meeting notes providers on the Kitces AdvisorTech Map already note their SOC2 certification, which is quite a robust baseline level of data security to have already become a 'standard' (and is a higher rate of SOC2 certification than many other AdvisorTech categories!). And arguably once companies go beyond that baseline level, advisors tend to care less about additional layers of security (given that data breaches amongst AdvisorTech vendors are already so rare) and more about whether or not the tool actually does what they need it to do: in other words, while 'more secure' is better with all things being equal, if it's a choice between one solution that's \"secure enough\" and produces coherent notes and integrates to the advisor's CRM, and another that's \"more\" secure but doesn't do those things as well, advisors are almost always going to go for the one that does a better job as a notetaker than the one that's just the most-most secure. For instance, beyond looking at data security alone, various platforms have different procedures around whether or not meetings are recorded or stored after the fact, which may matter for compliance purposes – though the reality is that without much guidance from securities regulators on these tools so far, the question for advisors is usually less about \"will compliance allow me to use an AI notetaker that records meetings?\" and more about \"will compliance allow me to use an AI notetaker at all?\". Which means firms that see AI notetakers as a compliance risk tend not to allow them at all, rather than filtering for those that aim to be the most compliant. All of which make security and compliance difficult to work as differentiators, since the advisors who can actually use AI notetakers will likely be evaluating for other features. This isn't to pick on any individual technology provider – AdvisorTech vendors often struggle to hone in on and articulate which of advisors' problems they're actually trying to solve, which makes it hard to gain traction when advisors aren't clear on what makes that solution worth buying to begin with. But in a category where numerous new tools have popped up and continue to raise capital from investors (and where less expensive general-purpose tools like Zoom continue to improve themselves), the path to growth lies not in picking one area like security and trying to out-do all the others – it's about just being the best at recognizing and solving for advisors' problems. For AI meeting note tools, this simply means being the best tool at removing friction from the meeting prep and follow-up process by taking accurate and well-organized notes and syncing to the advisor's existing systems, while being \"at least\" as secure as the competition to assure advisors that no compromises are being made on that front. Which may not make for as clear of a differentiator on the surface – since virtually all other AI notetaking tools are touting their ability to do the same thing – but in a category like AI meeting notes where the problem being solved is fairly straightforward, the best path might be just to focus on being the best at solving that problem. Advisor360 Buys Parrot AI To Bundle AI Meeting Notes Directly Into Its (CRM) Platform Broadly speaking, the debate in advisor technology over the past 10-15 years has been about \"all-in-one\" platforms (where multiple solutions are bundled and deeply integrated together under a single provider) versus a \"best-in-breed\" approach (where advisors buy the individual tools that work best for them, and deal with existing integrations to make them work as a cohesive whole themselves). And despite immense investments of private equity capital over the past decade, advisors in recent years have increasingly shown a preference to go the best-of-breed route – a trend that has shown up in the story of providers like Envestnet, Orion, and Nitrogen that built or bought their way up to becoming all-in-one solutions only to struggle to gain all-in-one adoption and/or to really make those solutions perform better than the sum of their parts, leading them to ultimately unbundle their offerings so advisors can just choose the components they want. But that broad industry narrative does overlook some instances where providers have built or bought tools and integrated them successfully into their platforms. For instance, RightCapital has long made a practice of integrating new tools and features into its financial planning platform, from Social Security optimization to cash flow mapping to one-page financial plans to its new Tax Analyzer, and it remains highly regarded as a financial planning tool and a category leader in advisor satisfaction according to our own Kitces AdvisorTech Research. Another example would be Advyzon, which built its own CRM platform to accompany its portfolio management and reporting tools, and similarly ended up being one of the highest rated CRM providers in the most recent Kitces Research on Advisor Technology. There seem to be two keys to making new features or tools work within an existing platform. The first is that the tool should be good: It isn't enough to have just any piece of software to fill a gap in the platform; it needs to be one that advisors would actually buy on its own as a standalone tool, otherwise they'll look elsewhere. Or stated more simply, an all-in-one is only capable of winning business away from competitors when its components are each capable of competing head-to-head as a best-of-breed solution in the first place. On top of that, it seems to work best if the tool is mostly adjacent to the functions that the platform already provides. For instance, it makes sense to have a tax planning tool embedded into a comprehensive financial planning platform, since they're often used side-by-side in the same meetings and within the same workflows. On the other hand, adding a financial planning tool to an investment management platform is harder to make work since there just isn't as much synergy between the two (as Envestnet found with MoneyGuide Pro and Orion found with Advizr, both of which struggled with adoption and user experience after their respective acquisitions). Once a platform ventures into the deep waters of categories beyond its existing core functionality, the seas get rougher as it must compete with experienced players who may have a deeper understanding of the needs of advisors in that category and how to solve them. In that context, it's notable that this month the performance reporting and digital onboarding platform Advisor360 announced that it was acquiring Parrot AI, a relatively unknown (at least to financial advisors) AI meeting notes tool, to embed within its platform. As standalone AI notetaking tools have proliferated over the last two years, it seemed to be only a matter of time before an existing advisor platform either built or acquired one of their own. And it made the most sense for that platform to be a CRM – or an all-in-one with its own CRM – given how closely AI notetakers must integrate with CRM platforms to exchange client data, meeting notes, and follow-up tasks. In buying Parrot AI, a smaller meeting notes tool that wasn't already targeted towards advisors, Advisor360 gets a \"blank slate\" AI solution – consisting mainly of a trained AI model and the staff of engineers who built and ran it – that it can shape and integrate into its platform the way it wants. At an industry level, the obvious question is which will be the next advisor platform to announce that it has built or acquired an AI notetaking solution? The list of potential acquirers isn't necessarily limited to all-in-one solutions (e.g., Orion or Envestnet), since as noted above, it would make plenty of sense for a CRM platform (e.g., Wealthbox or Advyzon) to have an integrated AI notetaking solution (even as the overall tides shift towards standalone best-of-breed tools, since the two functions are so closely aligned). Ultimately, however, it's hard not to see Advisor360's acquisition of Parrot AI as a warning shot to existing standalone AI meeting note tools. Each advisor platform that integrates its own meeting notes tool shrinks the potential market for all of the standalone solutions, and given that there are only a few CRM providers in broad use, that market could start to shrink really quickly if the trend takes hold with other CRM providers bringing meeting notes tools in-house. In other words, if and when not only Advisor360, but also Redtail and Wealthbox and Advyzon and Salesforce all have their own integrated meeting notes tools, what comes next for the standalone AI meeting notes tools on the market, and can they still differentiate enough for advisors to be willing to pay a whole separate fee on top of the CRM provider they already use? There's a glimmer of hope in the fact that standalone solutions have continued to thrive in other categories – since at the end of the day, it's not just enough to package together a CRM and a notetaking tool, but they actually have to be good software that works well together. But it still looks like it could be a hard road from here, as once bigger platforms start to offer their own AI notetakers (and develop AI tools for other use cases over time), advisors could very likely decide that they'd just as soon have those tools live in the platforms that they already use (and part of the platform fee they already pay), rather than having to buy them as a standalone solution. In the meantime, we've rolled out a beta version of our new AdvisorTech Directory, along with making updates to the latest version of our Financial AdvisorTech Solutions Map (produced in collaboration with Craig Iskowitz of Ezra Group)! So what do you think? Does Holistiplan's price increase make it worth considering lower-cost options, either as a standalone tool like FP Alpha or bundled in with RightCapital? Will Testimonial Marketing Exchange spur more advisors to solicit and highlight their testimonials by making it easier to turn them into marketing campaigns? Would advisors prefer to use an AI meeting notes tool that's embedded in their existing software rather than using a standalone platform? Let us know your thoughts by sharing in the comments below! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003eWelcome to the February 2025 issue of the Latest News in Financial #AdvisorTech – where we look at the big news, announcements, and underlying trends and developments that are emerging in the world of technology solutions for financial advisors!\u003c/p\u003e\n\u003cp\u003eThis month\u0026#39;s edition kicks off with the news that FP Alpha has released its tax return extraction and analysis module as a standalone product, while RightCapital has separately launched its own tax return extraction tool bundled within its platform – with both announcements coming on the heels of Holistiplan implementing a significant price increase, suggesting that Holistiplan\u0026#39;s decision to raise prices may have inadvertently opened the door for more competition within the tax planning technology category (which it had previously had all to itself)\u003c/p\u003e\n\u003cp\u003eFrom there, the latest highlights also feature a number of other interesting advisor technology announcements, including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMove Health, a service that provides guidance on and implementation of health insurance solutions for financial advisors, has acquired Caribou, a software tool for analyzing and comparing different health insurance plans, creating a single end-to-end platform for healthcare cost analysis and implementation of health insurance – although the question remains how deeply advisors are willing to get into health insurance implementation with their clients when they tend not to be health insurance experts themselves\u003c/li\u003e\n\u003cli\u003eAdvisor Credit Exchange, a marketplace solution connecting advisors with lending solutions for their clients, announced that it plans to shut down – which raises questions for Envestnet (which had an equity stake in Advisor Credit Exchange and featured it on its platform) and if it will further step back from its \u0026#34;marketplace of marketplaces\u0026#34; model as it pertains to non-investment-based solutions under its new ownership; as well as about the outlook for other lending marketplace platforms and whether liability management is too far outside of advisors\u0026#39; core offerings to gain much traction?\u003c/li\u003e\n\u003cli\u003eWealthtender, a lead generation and advisor review gathering platform, has launched a new Testimonial Marketing Studio to help advisors better promote their client testimonials in social media and email campaigns, reflecting the reality that advisors have generally been slow to adopt testimonial marketing since the release of the SEC\u0026#39;s Marketing Rule in 2021, and that platforms like Wealthtender have needed to offer tools like Testimonial Marketing Studio to encourage advisors to solicit and promote client reviews in order for those platforms to gain traction\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRead the analysis about these announcements in this month\u0026#39;s column, and a discussion of more trends in advisor technology, including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMili, one of the most recent AI-powered notetaking solutions on the AdvisorTech Map, has announced a recent $2M seed funding round – although Mili\u0026#39;s choice to position itself as the \u0026#34;most secure\u0026#34; notetaker reflects the reality that technology solutions often misunderstand what advisors want to see highlighted in technology (e.g., they expect all the different AI notetaker solutions to have a baseline level of data security, but beyond that they care about which one does the best job of solving their problems than they do about which one is the \u0026#34;most\u0026#34; secure)\u003c/li\u003e\n\u003cli\u003eAdvisor360 has announced its acquisition of the AI meeting notes platform Parrot AI, representing the first existing advisor technology platform to integrate AI notetaking into its own solution – which could be an ominous sign for the many standalone AI notetaker tools on the market, because if the trend to bring AI notetaking in-house picks up speed among existing advisor platforms, the market for standalone tools could shrink very quickly if advisors decide they would rather have AI notetaking as a feature within the tools they already use\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAnd be certain to read to the end, where we have provided an update to our popular \u0026#34;Financial AdvisorTech Solutions Map\u0026#34; (and also added the changes to our AdvisorTech Directory) as well!\u003c/p\u003e\n\u003cp\u003e*And for #AdvisorTech companies who want to submit their tech announcements for consideration in future issues, please submit to \u003ca href=\"https://feeds.feedblitz.com/cdn-cgi/l/email-protection#11457472795f746662517a78657274623f727e7c\"\u003e\u003cspan data-cfemail=\"580c3d3b30163d2f2b1833312c3b3d2b763b3735\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" width=\"200\" height=\"200\" src=\"https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-200x200.png\" alt=\"Guest Headshots\" decoding=\"async\" srcset=\"https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-200x200.png 200w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-300x300.png 300w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-150x150.png 150w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-400x400.png 400w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2.png 500w\" sizes=\"auto, (max-width: 200px) 100vw, 200px\" data-src=\"https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-200x200.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-200x200.png 200w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-300x300.png 300w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-150x150.png 150w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-400x400.png 400w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2.png 500w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003ch3 id=\"ben-henrymoreland\"\u003eBen Henry-Moreland\u003c/h3\u003e\n\u003cp\u003eTeam Kitces\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003eBen Henry-Moreland is a Senior Financial Planning Nerd at \u003ca href=\"https://www.kitces.com/\" target=\"_blank\" rel=\"noopener\" data-sk=\"tooltip_parent\"\u003eKitces.com\u003c/a\u003e, where he specializes in writing and speaking on financial planning topics including tax, practice management, and technology. He also co-authors the monthly Kitces #AdvisorTech column. Drawing from his experience as a financial planner and a solo advisory firm owner, Ben is passionate about fulfilling the site’s mission of making financial advicers better and more successful.\u003c/p\u003e\n\u003cp\u003eRead more of Ben’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=3193\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e+ Read More +\u003c/p\u003e\n\u003c/div\u003e\n\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" width=\"200\" height=\"200\" src=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg\" alt=\"Michael Kitces\" decoding=\"async\" srcset=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-300x300.jpg 300w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-768x768.jpg 768w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-800x800.jpg 800w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP.jpg 1022w\" sizes=\"auto, (max-width: 200px) 100vw, 200px\" data-src=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-300x300.jpg 300w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-768x768.jpg 768w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-800x800.jpg 800w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP.jpg 1022w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003ch3 id=\"michael-kitces\"\u003eMichael Kitces\u003c/h3\u003e\n\u003cp\u003eTeam Kitces\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eMichael Kitces is Head of Planning Strategy at \u003ca href=\"https://wealth.focuspartners.com/michael-kitces?utm_campaign=ForConsumers\u0026amp;utm_id=Kitces\u0026amp;utm_medium=KitcesReferral\u0026amp;utm_source=Kitces\"\u003eFocus Partners Wealth\u003c/a\u003e, which provides an evidence-based approach to private wealth management for near- and current retirees, and \u003ca href=\"https://advisor.focuspartners.com/kitces/?utm_source=Kitces\u0026amp;utm_medium=KitcesReferral\u0026amp;utm_campaign=ForConsumers\u0026amp;utm_id=Kitces\"\u003eFocus Partners Advisor Solutions\u003c/a\u003e, a turnkey wealth management services provider supporting thousands of independent financial advisors through the scaling phase of growth.\u003c/p\u003e\n\u003cp\u003eIn addition, he is a co-founder of the \u003ca href=\"https://www.xyplanningnetwork.com/\"\u003eXY Planning Network\u003c/a\u003e, \u003ca href=\"https://advicepay.com/\"\u003eAdvicePay\u003c/a\u003e, \u003ca href=\"https://www.fppathfinder.com/\" target=\"_blank\" rel=\"noopener\"\u003efpPathfinder\u003c/a\u003e, and \u003ca href=\"https://newplannerrecruiting.com/\"\u003eNew Planner Recruiting\u003c/a\u003e, the former Practitioner Editor of the Journal of Financial Planning, the host of the \u003cem\u003eFinancial Advisor Success \u003c/em\u003epodcast, and the publisher of \u003ca href=\"https://www.kitces.com/blog/\"\u003ethe popular financial planning industry blog \u003cem\u003eNerd’s Eye View\u003c/em\u003e\u003c/a\u003e through his website \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e, dedicated to advancing knowledge in financial planning. In 2010, Michael was recognized with one of the FPA’s “Heart of Financial Planning” awards for his dedication and work in advancing the profession.\u003c/p\u003e\n\u003cp\u003eRead all of Michael’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=13\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\" target=\"_blank\" rel=\"noopener\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e+ Read More +\u003c/p\u003e\n\u003c/div\u003e\n\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\n\u003cp\u003eTax planning is a key component of the financial planning process, but for many years it was difficult to scale over an entire client base. This had partly to do with the sheer scope and ever-growing complexity of the tax code and the amount of knowledge and training needed to keep up with tax planning opportunities were available. But it was also because much of the information needed to do comprehensive tax planning (income, deductions, credits, dependents, business expenses, withholdings, etc.) tends to be contained in a client\u0026#39;s current and historical tax returns. Which meant historically that finding the information buried in a client\u0026#39;s tax return was a manual process of poring over the various schedules and worksheets, and the only real way to get more efficient was to gain enough familiarity with the forms themselves (either through reviewing clients\u0026#39; returns year after year or \u003ca href=\"https://www.kitces.com/review-tax-returns-course/\"\u003ethrough experiential training and education on tax return review\u003c/a\u003e) to know where to look to quickly find the necessary data.\u003c/p\u003e\n\u003cp\u003eIn 2019, however, the bar for efficiently reviewing client tax returns was lowered significantly with the launch of Holistiplan. Now advisors could simply upload a client\u0026#39;s return to Holistiplan\u0026#39;s platform, which automatically scans the return and delivers a client- (and advisor-)friendly summary of the client\u0026#39;s tax situation with key numbers and potential planning opportunities, without the need to pore through pages of return documents themselves. The sheer usefulness of Holistiplan in delivering quick and user-friendly tax analysis caused it to explode in popularity almost overnight; within 5 years, according to \u003ca href=\"https://www.kitces.com/kitces-report-independent-financial-advisor-technology-fintech-software-tools-research/\"\u003eKitces Research on Advisor Technology\u003c/a\u003e, Holistiplan had a 42% adoption rate among all advisors, dominating the previously-niche tax planning software category.\u003c/p\u003e\n\u003cp\u003eFor most of the time since its 2019 launch, Holistiplan has continued to have most of the tax planning market to itself. Although other software providers have expanded document extraction technology to other types of documents in hopes of becoming \u0026#34;the Holistiplan of\u0026#34; other categories like estate planning, investment analysis, and insurance review, few providers have directly challenged Holistiplan in the realm of tax return analysis. The main exception to this over the past few years has been \u003ca href=\"https://fpalpha.com/\"\u003eFP Alpha\u003c/a\u003e, which created its own tax return extraction tool which feeds clients\u0026#39; tax return data into a \u0026#34;snapshot\u0026#34; summary report, tax projections, and Roth conversion analysis. The caveat, however, was that up until now FP Alpha\u0026#39;s tax module has only been offered as a part of its broader suite of planning tools which also include estate planning and property and casualty insurance. Which meant that unlike Holistiplan, where advisors interested in just the tax planning solution could buy that as a standalone product, FP Alpha required advisors to purchase the whole bundle, even if they only wanted to use the tax module and had no interest in the estate or insurance components. And so despite having built out a tool that functioned similarly to Holistiplan, FP Alpha struggled to make a meaningful dent in Holistiplan\u0026#39;s market share in the tax planning category of the \u003ca href=\"https://www.kitces.com/fintechmap/\"\u003eAdvisorTech Solutions Map\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIn late 2024, however, Holistiplan inadvertently opened the door to more competition when \u003ca href=\"https://www.reddit.com/r/CFP/comments/1h60ehm/holistiplan_price_going_way_up/\"\u003eit began communicating to its users a major price restructuring\u003c/a\u003e which nearly doubled the cost of the tool. And as well regarded as Holistiplan is among its users – its 9.1 average satisfaction rating in \u003ca href=\"https://www.kitces.com/kitces-report-independent-financial-advisor-technology-fintech-software-tools-research/\"\u003ethe most recent Kitces Research on Advisor Technology\u003c/a\u003e made it one of the highest rated software solutions in any category – the steep price increase has sparked at least some interest among advisors in finding a competing solution.\u003c/p\u003e\n\u003cp\u003eAnd so coincidentally – or perhaps not-so-coincidentally – in the news in January was \u003ca href=\"https://citywire.com/ria/news/fp-alpha-unveils-standalone-tax-tool/a2457753\"\u003ethe story that FP Alpha has made its tax module available to buy as a standalone product\u003c/a\u003e, which it\u0026#39;s calling FP Alpha Tax. On top of that, the comprehensive financial planning platform \u003ca href=\"https://www.rightcapital.com/\"\u003eRightCapital\u003c/a\u003e also chose this month to \u003ca href=\"https://markets.businessinsider.com/news/stocks/rightcapital-introduces-tax-analyzer-ocr-technology-to-read-tax-returns-in-seconds-and-identify-tax-smart-opportunities-1034225356\"\u003eunveil its own tax return extraction and analysis tool\u003c/a\u003e, dubbed \u003ca href=\"https://www.rightcapital.com/tax-analyzer/\"\u003eTax Analyzer\u003c/a\u003e, which is bundled in with its Premium pricing tier.\u003c/p\u003e\n\u003cp\u003eIt isn\u0026#39;t necessarily the case that FP Alpha\u0026#39;s and RightCapital\u0026#39;s announcements were intentionally made in reaction to Holistiplan\u0026#39;s pricing change, but what is certain is that they come at a time when some advisors might be especially receptive to the idea of changing their tax planning software if a less expensive option is available. To that end, both FP Alpha\u0026#39;s and RightCapital\u0026#39;s solutions are less expensive than Holistiplan: \u003ca href=\"https://fpalpha.com/pricing/\"\u003eFP Alpha Tax currently charges $1,125 for the first 75 tax uploads\u003c/a\u003e versus \u003ca href=\"https://app.holistiplan.com/start/?tier=3\u0026amp;_gl=1*1y0ofaq*_gcl_au*MTE0NTY3ODI5My4xNzM4MDgwNTM0\"\u003e$1,999 for Holistiplan\u0026#39;s 75-household plan\u003c/a\u003e, while RightCapital\u0026#39;s Tax Analyzer doesn\u0026#39;t cost anything beyond \u003ca href=\"https://www.rightcapital.com/pricing/\"\u003ethe $179.95 monthly fee for their Premium subscription tier\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eNotably, the differences between Holistiplan, FP Alpha Tax, and RightCapital\u0026#39;s Tax Analyzer go beyond their respective prices. For instance, Holistiplan\u0026#39;s Premium tier includes features like support for state taxes, an auto-generated \u0026#34;tax preparer letter\u0026#34; detailing the client\u0026#39;s significant tax events from the past year (e.g., property sales, Roth conversions, or charitable contributions), as well as a bundled-in property and casualty insurance analysis tool. FP Alpha Tax, meanwhile, is centered around its three core components of the tax snapshot, projection, and Roth conversion analysis. In other words, Holistiplan, while being generally more expensive, comes with a bigger feature set; while FP Alpha Tax is a more focused tool for pure Federal tax planning (which is an ironic reversal of the previous situation where FP Alpha was the bundled tool and Holistiplan was the pure tax planning tool!). RightCapital\u0026#39;s Tax Analyzer, meanwhile, appears to be less about creating detailed tax summaries for the previous year and more about quickly setting up future planning scenarios. So advisors can choose whether Holistiplan\u0026#39;s higher price continues to be worth it for the features that they offer; whether FP Alpha Tax provides a better match between price and the features the advisor needs; or (for advisors already using RightCapital) whether Tax Analyzer\u0026#39;s more basic tools provide enough value that it isn\u0026#39;t worth paying anything more for a standalone solution.\u003c/p\u003e\n\u003cp\u003eAll of which goes to highlight the pressure that specialized planning tools can find themselves under, especially once they find enough success to attract the notice of potential competitors. On one side, there can be the temptation to provide more and more features on the premise of \u0026#34;adding value\u0026#34;, which generally necessitates charging higher fees and can leave the provider open to being undercut by less-expensive competitors. And on the other side are comprehensive planning platforms that can decide to introduce their own version of the tool for \u0026#34;free\u0026#34; to its existing users (something that \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisortech-february-2024/\"\u003eRightCapital has done\u003c/a\u003e \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisortech-may-2022/\"\u003emultiple times\u003c/a\u003e \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisortech-october-2022/\"\u003ein the past\u003c/a\u003e) that can eliminate some advisors\u0026#39; need to pay anything extra for the tool at all.\u003c/p\u003e\n\u003cp\u003eIn this case, Holistiplan – possibly under pressure from \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisortech-october-2023/\"\u003ethe private equity owners who took a stake in the company in the fall of 2023\u003c/a\u003e – decided to take the path of adding features and commensurately increasing prices. Which made sense at some level, given the previous lack of competitive pressure and the fact that the price increase was high enough that Holistiplan could have lost some users and still come out ahead in the end. And notably, many advisors may still find Holistiplan to be well worth the cost even at a higher price point. But still, when a provider decides to raise prices by that much all at once, it creates space for competitors to gain a foothold – and Holistiplan\u0026#39;s decision may have inadvertently created the need for it to learn how to compete in a market it had only ever had all to itself.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Move Health Acquires Caribou\" id=\"move-health-acquires-caribou-to-combine-health-insurance-implementation-and-planning\"\u003e\u003cspan\u003e\u003ca href=\"https://www.wealthmanagement.com/technology/caribou-and-its-healthplanner-technology-acquired-move-health\"\u003eMove Health Acquires Caribou To Combine Health Insurance Implementation And Planning\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eEach year, Fidelity puts out an update of \u003ca href=\"https://newsroom.fidelity.com/pressreleases/fidelity-investments--releases-2024-retiree-health-care-cost-estimate-as-americans-seek-clarity-arou/s/7322cc17-0b90-46c4-ba49-38d6e91c3961\"\u003eits annual Health Cost Estimate\u003c/a\u003e, which seeks to quantify the amount that an average 65-year-old can expect to spend on healthcare costs in retirement. Each year\u0026#39;s update is usually headlined with an eye-popping number about the total cost of retirees\u0026#39; healthcare savings: In \u003ca href=\"https://newsroom.fidelity.com/pressreleases/fidelity-investments--releases-2024-retiree-health-care-cost-estimate-as-americans-seek-clarity-arou/s/7322cc17-0b90-46c4-ba49-38d6e91c3961\"\u003ethe 2024 report\u003c/a\u003e, for example, the estimate is that each 65-year-old retiring this year can expect to spend $165,000 in healthcare costs, with the amount doubled to $330,000 for couples.\u003c/p\u003e\n\u003cp\u003eAs daunting as those numbers look when framed as a lump-sum, however, \u003ca href=\"https://www.kitces.com/blog/vanguard-mercer-study-real-annual-health-care-costs-in-retirement-projections/\"\u003ethe reality is that healthcare costs aren\u0026#39;t necessarily \u003cem\u003ethat\u003c/em\u003e prohibitive for many retirees\u003c/a\u003e – especially those with the affluence to become clients of financial advisors. Dividing the $165,000 headline number by the 20-year typical life expectancy of a 65-year-old results in $8,250 per year (with a significant part of that amount coming in the form of premiums for Medicare Parts B, D, and/or any supplemental Medicare coverage). Overall, Medicare has generally done a good job of narrowing the range of retirement healthcare costs and reducing the occurrence of \u0026#34;surprise\u0026#34; healthcare bills that could put an unexpected strain on a previously healthy financial plan.\u003c/p\u003e\n\u003cp\u003eAll of which means that, while healthcare costs are often a component of long-term retirement projections as a part of the financial planning process, there has been historically little traction for technology tools that go deeper into healthcare planning. For most retirees, healthcare is just another recurring expense category alongside their other nondiscretionary costs like food and housing, which scales up or down depending on the overall health of the retiree – in other words, people in poorer health tend to be aware of that fact and to budget for higher healthcare costs accordingly.\u003c/p\u003e\n\u003cp\u003eWhat makes the relative predictability of healthcare costs possible, however, is \u003cem\u003einsurance\u003c/em\u003e – either employer-provided plans for W-2 employees and their families, private or Marketplace plans for early retirees and self-employed workers, or Medicare for seniors age 65 and older. Everyone needs insurance, and with a wide range of options available (especially for early retirees and self-employed workers who don\u0026#39;t have an employer-provided plan, and for retirees with a plethora of supplemental Medicare and Medicare Advantage plans to choose from) there\u0026#39;s a sizeable gap in health insurance solutions to be solved for.\u003c/p\u003e\n\u003cp\u003eThe trouble is that most financial advisors don\u0026#39;t write or sell health insurance policies themselves – advisors by and large don\u0026#39;t have deep expertise into different types of health insurance that would allow them to recommend the best plan for a client, and even if they did, the fact that health insurance plans are overwhelmingly sold on commission would preclude them from being offered by fee-only advisors. And so at the end of the day, there\u0026#39;s a gap between a client\u0026#39;s need for a healthcare plan that allows them to control their healthcare costs, and a solution that can help them find and implement the right policy for their needs.\u003c/p\u003e\n\u003cp\u003eIn recent years, \u003ca href=\"https://advisors.movehealth.io/\"\u003eMove Health\u003c/a\u003e has sought to address this gap by offering financial advisors a platform where they can connect clients with Move Health\u0026#39;s in-house health insurance planners, who can recommend and enroll clients in health insurance plans – effectively serving as an outsourced insurance desk specifically for health insurance.\u003c/p\u003e\n\u003cp\u003eAnd now in the news this month, \u003ca href=\"https://advisors.movehealth.io/move-health-has-acquired-caribou\"\u003eMove Health has announced\u003c/a\u003e that it has acquired \u003ca href=\"https://www.caribouwealth.com/\"\u003eCaribou\u003c/a\u003e, a healthcare planning tool that had up until now been a \u0026#34;pure\u0026#34; software tool (i.e., focused on planning for healthcare costs and comparing plan options, without support for implementing the policy itself).\u003c/p\u003e\n\u003cp\u003eThe acquisition makes sense at first glance: Caribou\u0026#39;s technology for analyzing different healthcare options complements Move Health\u0026#39;s ability to recommend and enroll clients in policies, which makes Move Health more of an end-to-end solution in both planning and implementing health insurance for advisory clients. But in a way, the acquisition may also imply that Caribou perhaps wasn\u0026#39;t getting the traction among advisors that it needed to survive as a standalone health insurance planning solution, to the point that the best way forward was to attach itself to a provider that could actually handle the implementation part as well.\u003c/p\u003e\n\u003cp\u003eWhich opens up a broader question about how willing financial advisors may be to go in-depth into health insurance with their clients, either from a planning or an implementation standpoint. The time spent on analyzing plans, comparing options, and managing the relationship between the client and the insurance planner has to come from somewhere, and with advisors more likely to center their value proposition around the core areas of retirement planning, tax planning, and investment management, the reality is that healthcare planning may lay too far away from the advisor\u0026#39;s main revenue center to justify the resources it would require.\u003c/p\u003e\n\u003cp\u003eAll of which isn\u0026#39;t to downplay the importance of health insurance planning and implementation – clearly everyone needs health insurance, and finding the right plan is a key part of managing healthcare costs at any stage of life. But for advisors for whom healthcare planning has traditionally been outside of their core competency, expanding into that space often brings up questions the advisor may not be equipped to handle. And so the question for both Move Health and Caribou going forward is whether providing a tech-enabled service to make it easier to plan and implement healthcare solutions for clients will actually draw more advisors to include healthcare planning into their own practices – or whether the topic will remain too far outside of their comfort zone (and too far away from their core value proposition) to make it worthwhile?\u003c/p\u003e\n\u003ch2 data-nav-title=\"Advisor Credit Exchange Shuts Down\" id=\"envestnetbacked-advisor-credit-exchange-shuts-down-as-advisors-show-limited-interest-in-implementing-debt-solutions-for-clients\"\u003e\u003cspan\u003e\u003ca href=\"https://citywire.com/ria/news/envestnet-backed-advisor-credit-exchange-to-shut-down-sources/a2457772\"\u003eEnvestnet-Backed Advisor Credit Exchange Shuts Down As Advisors Show Limited Interest In Implementing Debt Solutions For Clients\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eThe modern \u0026#34;marketplace\u0026#34; model in advisor technology has its roots in the expansion of the RIA channel in the late 1990s and early 2000s, when financial advisors began to shift away from selling individual product solutions like mutual funds and insurance policies (and being compensated with commissions on those sales) and towards managing portfolios (and being compensated on an ongoing AUM basis). In order to scale the process of managing asset-allocated portfolios across an entire client base, advisors increasingly turned to third party solutions like TAMPs and SMAs (who handled both model creation and implementation of client portfolios), which \u003ca href=\"https://www.kitces.com/blog/model-marketplace-from-irebal-riskalyze-orion-and-unbundling-traditional-tamp/\"\u003ein turn led to an unbundling of the TAMP and the creation of model marketplaces\u003c/a\u003e (who set the model, but leave the implementation to the advisor)… and the rise of platforms like \u003ca href=\"https://www.envestnet.com/\"\u003eEnvestnet\u003c/a\u003e, \u003ca href=\"https://orion.com/communities\"\u003eOrion Communities\u003c/a\u003e, and \u003ca href=\"https://advisorservices.schwab.com/serving-your-clients/acct-mgmnt-trading/trading/model-market-center\"\u003eSchwab\u0026#39;s Model Market Center\u003c/a\u003e to connect advisors with the proliferating number of TAMPs, SMAs, and outsourced model providers that existed to serve them.\u003c/p\u003e\n\u003cp\u003eAs these platforms built out their marketplaces – and the technology to facilitate them – advisors were also increasingly expanding their services beyond portfolio management and into more holistic financial planning. And so the logical next step for technology providers was to take the marketplace approach that had already proven effective for distributing managed accounts and model portfolios, and to apply it to other types of financial products that advisors may recommend to their clients. Which led to the emergence of providers like \u003ca href=\"https://www.dplfp.com/\"\u003eDPL Financial Partners\u003c/a\u003e and \u003ca href=\"https://fidx.io/\"\u003eFidX\u003c/a\u003e (for insurance and annuity products), and \u003ca href=\"https://www.sorafinance.com/\"\u003eSora\u003c/a\u003e, \u003ca href=\"https://www.sandboxwealth.com/\"\u003eSandbox\u003c/a\u003e, and \u003ca href=\"https://advisorcreditexchange.com/\"\u003eAdvisor Credit Exchange\u003c/a\u003e for (for loans and credit solutions).\u003c/p\u003e\n\u003cp\u003eBut while marketplace-style solutions can make a lot of sense for financial advisors on the investment management side since they\u0026#39;re directly tied to the advisor\u0026#39;s main source of revenue (managing portfolio assets), the question with other types of marketplaces has always been whether they fall too far outside of the advisor\u0026#39;s core services to generate significant enough demand for the products they offer – or in other words, even if they provide a great \u0026#34;storefront\u0026#34; of annuity products or lenders, is that enough for advisors to want to undertake the extra work of helping their clients implement, instead of \u0026#39;simply\u0026#39; referring out to a fellow professional who can help clients instead (and who actually gets paid to do the implementation)?\u003c/p\u003e\n\u003cp\u003eIn this context, it\u0026#39;s notable that \u003ca href=\"https://advisorcreditexchange.com/\"\u003eAdvisor Credit Exchange\u003c/a\u003e, one of the first advisor-focused marketplaces for lending products, \u003ca href=\"https://citywire.com/ria/news/envestnet-backed-advisor-credit-exchange-to-shut-down-sources/a2457772\"\u003eannounced in January that it would be shutting down at the end of the month\u003c/a\u003e. The news came after \u003ca href=\"https://citywire.com/ria/news/envestnet-backed-advisor-credit-exchange-lays-off-staff-explores-strategic-options-sources/a2456385\"\u003ereports in December that the startup had laid off staff and was exploring strategic options\u003c/a\u003e, suggesting that it wasn\u0026#39;t able to find an acquisition partner or a fresh source of capital in the interim.\u003c/p\u003e\n\u003cp\u003eAdvisor Credit Exchange\u0026#39;s story is closely linked to Envestnet, as \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisor-fintech-may-2019/\"\u003ethe two platforms have partnered since 2019 to offer lending products on Envestnet\u0026#39;s platform\u003c/a\u003e, while Envestnet also owned an equity stake in Advisor Credit Exchange. And for its part, \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisortech-august-2024/\"\u003eEnvestnet was just last year taken private by Bain Capital\u003c/a\u003e. The implication, then, is that as Envestnet\u0026#39;s new owners have evaluated the many segments of the business to figure out a way to make the whole (at least) as valuable as its parts, they made the decision to not further support Advisor Credit Exchange, which (presuming it wasn\u0026#39;t able to find another buyer) left it with little other choice than to wind down.\u003c/p\u003e\n\u003cp\u003eFor Envestnet, the shutdown of Advisor Credit Exchange represents the first in what could be multiple steps back from its \u0026#34;marketplace of marketplaces\u0026#34; approach that offers channels to connect advisors with providers of not only a host of investment products but also insurance products (through \u003ca href=\"https://fidx.io/\"\u003eFidX\u003c/a\u003e), estate planning and trust solutions (through \u003ca href=\"https://www.trucendent.com/\"\u003eTrucendent\u003c/a\u003e), and up until the shutdown of Advisor Credit Exchange, banking and lending products. Notably, Envestnet also owns an equity stake in FidX, \u003ca href=\"https://www.kitces.com/blog/envestnet-fidx-insurance-annuity-exchange-platform-moneyguidepro-free-tamarac/\"\u003ewhich launched on the Envestnet platform at about the same time Advisor Credit Exchange did\u003c/a\u003e, \u003ca href=\"https://www.wealthmanagement.com/estate-planning/envestnet-joins-increasingly-crowded-digital-estate-planning-space\"\u003eas well as in Trucendent\u003c/a\u003e. The fact that those platforms are still standing today (at least for now), while Advisor Credit Exchange isn\u0026#39;t, suggests that they performed better in Bain\u0026#39;s post-acquisition analysis – which makes sense given that insurance and estate planning have traditionally been more of a core part of advisors\u0026#39; service offering, while debt management (at least in terms of finding and implementing liability solutions for clients) has not.\u003c/p\u003e\n\u003cp\u003eWhich raises the question for other platforms like \u003ca href=\"https://www.sorafinance.com/\"\u003eSora\u003c/a\u003e and \u003ca href=\"https://www.sandboxwealth.com/\"\u003eSandbox\u003c/a\u003e that offer debt and lending solutions for clients of financial advisors of how much traction they can reasonably expect to gain given that Advisor Credit Exchange, which had the benefit of partnering with one of the biggest marketplace and technology platforms in Envestnet and the 100,000+ advisors that use some part of its platform already, wasn\u0026#39;t able to find a sustainable path forward.\u003c/p\u003e\n\u003cp\u003eGranted, the issue could have lain more with Envestnet than with Advisor Credit Exchange itself, as Envestnet had long struggled to effectively manage all its different parts into a well-functioning whole. But there\u0026#39;s at least the possibility that liability management may lay too far afield for most advisors to consider as a meaningful part of their service offering. Because while there can be instances, particularly with ultra-high-net-worth clients, where finding a lender who can offer a loan at 0.5% or 1% less than the market rate can result in material savings and be well worth the effort to do so, the reality is that those clients (and the advisors that serve them) are relatively few in number. For most other advisors, to the extent that they do help their clients find lending solutions, it more often comes in the form of developing relationships with bankers or mortgage brokers whom they can refer clients to while not being involved in (or in some cases, dragged into the minutia of) finding or securing the specific loan.\u003c/p\u003e\n\u003cp\u003eAnd so the bottom line is that, while there\u0026#39;s a proven business model for marketplaces that can facilitate transactions between clients and third party financial solution providers, the opportunity is really only at its strongest when the solution is in an area, like investment management, that generates revenue for the advisor or at least is closely tied to the advisor\u0026#39;s core value proposition (and isn\u0026#39;t already easy to refer out to a trusted partner). For a solution that\u0026#39;s farther afield from the advisor\u0026#39;s revenue source, like lending management, the opportunity can still be there if the solution can perhaps help the advisor truly to meaningfully differentiate – such as gaining a foothold in the UHNW space by offering HNW clients loans at terms that are bona fide superior than they could get elsewhere. But as the Advisor Credit Exchange story makes clear, there may not be enough of a natural demand for lending solutions to yield a sustainable offering for all advisors?\u003c/p\u003e\n\n\u003cp\u003eIn the Internet era, when someone wants to find a local restaurant or plumber or dentist or almost any other service provider, they go online to look for it. And when it\u0026#39;s important to find the \u003cem\u003ebest\u003c/em\u003e provider – the restaurant that will provide the best setting for an anniversary date night, or the plumber who won\u0026#39;t leave a whole in the wall, or the dentist who won\u0026#39;t overly judge their patients\u0026#39; flossing habits – people often rely on reviews from their peers to get a sense of who they can trust.\u003c/p\u003e\n\u003cp\u003eTo fulfill this demand for peer reviews of businesses and service providers, a number of review platforms have popped up over the years, from general-purpose platforms like \u003ca href=\"https://www.yelp.com/\"\u003eYelp\u003c/a\u003e and Google Reviews to industry-specific sites like \u003ca href=\"https://www.angi.com/\"\u003eAngi\u003c/a\u003e (for home services) and \u003ca href=\"https://www.healthgrades.com/\"\u003eHealthgrades\u003c/a\u003e (for medical professionals). Except up until early 2021, there were no review sites for financial advisors, on account of what was at the time an SEC rule strictly forbidding advisors from soliciting client testimonials, or from promoting any testimonials that a client may have left (assuming they found their way to the site and left a review on their own accord). Which \u003ca href=\"https://www.kitces.com/blog/mailbag-why-there-will-never-be-a-successful-financial-advisor-review-site-in-the-foreseeable-future/\"\u003eleft no room for a sustainable business model for an advisor-specific review platform\u003c/a\u003e: With advisors unable to highlight the platform in any way, there would have been few ways for a platform to gain a critical mass of reviews or to effectively monetize the reviews that were written.\u003c/p\u003e\n\u003cp\u003eStarting in 2021, however, \u003ca href=\"https://www.kitces.com/blog/sec-marketing-rule-ria-investment-adviser-testimonial-endorsement-promoter-third-party-rating/\"\u003ethe SEC\u0026#39;s updated Marketing Rule finally opened the doors for financial advisors to solicit and promote testimonials\u003c/a\u003e. In the years since, a number of financial advisor review platforms have emerged, including \u003ca href=\"https://amplifyreviews.com/\"\u003eAmplify Reviews\u003c/a\u003e, \u003ca href=\"https://www.testimonialiq.com/\"\u003eTestimonialIQ\u003c/a\u003e, \u003ca href=\"https://indyfin.com/\"\u003eIndyFin\u003c/a\u003e (which was acquired by lead generation platform WiserAdvisor in 2023) and \u003ca href=\"https://wealthtender.com/\"\u003eWealthtender\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eBut despite now being allowed to employ testimonials in their marketing, advisors have been slow to do so. Which may be partially on account of \u003ca href=\"https://www.kitces.com/blog/sec-marketing-rule-ria-investment-adviser-testimonial-endorsement-promoter-third-party-rating/\"\u003ethe specific conditions and disclosure requirements mandated by the SEC Marketing Rule\u003c/a\u003e to avoid the possibility of an advisor cherry-picking the best reviews to make public. But it may also be because, having not been allowed to use testimonials when they were initially building their businesses and marketing practices, many advisors simply aren\u0026#39;t sure how to make the best use of the testimonials they get.\u003c/p\u003e\n\u003cp\u003eAnd so it\u0026#39;s notable that this month \u003ca href=\"https://www.linkedin.com/posts/briancthorp_introducing-testimonial-marketing-studio-activity-7284949612061245440-czFR/?utm_medium=member_desktop\u0026amp;utm_source=share\"\u003eWealthtender has announced the launch\u003c/a\u003e of a new \u003ca href=\"https://wealthtender.com/testimonial-marketing-studio/\"\u003eTestimonial Marketing Studio\u003c/a\u003e, a suite of design tools meant to help advisors \u0026#39;dress up\u0026#39; their reviews and testimonials for promotion on social media and email marketing campaigns.\u003c/p\u003e\n\u003cp\u003eAt a certain level, it makes sense for Wealthtender to invest in more tools to help advisors promote their reviews. Although advisors may now be allowed to solicit and highlight testimonials, those testimonials don\u0026#39;t do any good if they\u0026#39;re not seen by prospective clients. And while the advisor could certainly the reviews they\u0026#39;ve received on their own website, \u003cem\u003ethat\u003c/em\u003e only works if there\u0026#39;s a marketing engine that can reliably drive prospects \u003cem\u003eto\u003c/em\u003e that website – \u003ca href=\"https://www.kitces.com/blog/why-financial-advisors-using-robo-advisor-technology-still-will-not-close-the-millennial-gap/\"\u003eas with digital onboarding and robo-advice tools\u003c/a\u003e, it isn\u0026#39;t an \u0026#34;if you build it, they will come\u0026#34; proposition where embedded testimonials will automatically translate into more pageviews to read them. And from Wealthtender\u0026#39;s perspective, it definitely helps to create a way to get more eyeballs on Wealthtender-hosted reviews as they aim to become \u003cem\u003ethe\u003c/em\u003e site for financial advisor reviews (as, for example, Angi has become \u003cem\u003ethe\u003c/em\u003e site to find reviews of home contractors).\u003c/p\u003e\n\u003cp\u003eThe question, however, is that if Wealthtender is launching a new effort to gain more attention for its reviews \u0026#34;off-platform\u0026#34; (e.g., on social media and in email campaigns), does that indicate that it\u0026#39;s having trouble gaining traction \u0026#34;on-platform\u0026#34; with accumulating reviews on its site? The reason that advisor review sites struggled before the new SEC Marketing Rule was because advisors couldn\u0026#39;t send clients to leave reviews or prospects to read them. And so even though testimonials are now allowed, those sites will continue to struggle if advisors still aren\u0026#39;t actively soliciting or promoting reviews.\u003c/p\u003e\n\u003cp\u003eUltimately, financial advisors have long struggled with marketing, and tend to cling hard to the tried-and-true methods like client referrals, developing relationships with centers of influence like accountants and attorneys, and event marketing – which is reflected in advisors\u0026#39; general slowness to adopt testimonials. However, as the cost of traditional marketing methods increase (with \u003ca href=\"https://www.kitces.com/kitces-report-financial-planner-advisor-marketing-tactics-strategies-referrals-centers-influence-networking/\"\u003ethe most recent Kitces Research on Marketing\u003c/a\u003e showing the average client acquisition costs have risen by 75% from 2021 to 2024), advisors may find themselves more open to trying new (to them) methods. For which Wealthtender has positioned themselves well to guide advisors through collecting and deploying client testimonials, once they get around to doing so.\u003c/p\u003e\n\n\u003cp\u003eIn August of 2023, Client Meeting Support was a fairly tiny category of the \u003ca href=\"https://www.kitces.com/fintechmap/\"\u003eKitces AdvisorTech Map\u003c/a\u003e, consisting of just five providers offering various ways to enhance efficiency around client meetings, from meeting note and follow-up templates to dictation and transcription tools:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKitces AdvisorTech Map August 2023:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Client Meeting August\" src=\"https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023.png\" alt=\"Client Meeting August\" width=\"2828\" height=\"447\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023.png 2828w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023-300x47.png 300w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023-1024x162.png 1024w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023-768x121.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023-1536x243.png 1536w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023-2048x324.png 2048w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023-2000x316.png 2000w\" sizes=\"auto, (max-width: 2828px) 100vw, 2828px\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023.png 2828w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023-300x47.png 300w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023-1024x162.png 1024w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023-768x121.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023-1536x243.png 1536w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023-2048x324.png 2048w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-August-2023-2000x316.png 2000w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eIn the last 18 months, however, we\u0026#39;ve added a whopping 10 new tools to the Client Meeting Support category – all of which offer as their core feature some form of AI-enabled notetaking and meeting summary generation:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKitces AdvisorTech Map February 2025:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Client Meeting February\" src=\"https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025.png\" alt=\"Client Meeting February\" width=\"3163\" height=\"518\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025.png 3163w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025-300x49.png 300w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025-1024x168.png 1024w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025-768x126.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025-1536x252.png 1536w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025-2048x335.png 2048w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025-2000x328.png 2000w\" sizes=\"auto, (max-width: 3163px) 100vw, 3163px\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025.png 3163w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025-300x49.png 300w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025-1024x168.png 1024w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025-768x126.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025-1536x252.png 1536w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025-2048x335.png 2048w, https://www.kitces.com/wp-content/uploads/2025/02/Client-Meeting-February-2025-2000x328.png 2000w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eKeep in mind that these are just the notetaking tools that are \u003cem\u003especific to financial advisors\u003c/em\u003e. There are plenty of other general-purpose tools, including \u003ca href=\"https://fathom.video/\"\u003eFathom\u003c/a\u003e, \u003ca href=\"https://otter.ai/\"\u003eOtter\u003c/a\u003e, \u003ca href=\"https://fireflies.ai/\"\u003eFireflies\u003c/a\u003e, \u003ca href=\"https://www.zoom.com/en/ai-assistant/\"\u003eZoom AI Companion\u003c/a\u003e, and many others.\u003c/p\u003e\n\u003cp\u003eThe proliferation of AI notetaking tools reflects the sheer amount of opportunity that tech providers and investors sense in reducing the time needed for meeting preparation and follow-up (and capitalizes on the \u0026#39;AI is the future\u0026#39; frenzy of venture capital investors). Which makes sense, given how much time those tasks tend to take when done manually (e.g., \u003ca href=\"https://www.kitces.com/kitces-report-how-financial-planners-actually-do-financial-planning/\"\u003ethe most recent Kitces Research on the Financial Planning Process\u003c/a\u003e showed that advisors spend an hour or more on meeting prep and follow-up for each hour of client meetings). Any tool that could cut that time down even by 50% would represent meaningful time savings, and an opportunity to significantly boost advisor productivity.\u003c/p\u003e\n\u003cp\u003eThe problem that arises when so many providers show up all at once that each essentially offer versions of the same service, though, is that they become harder and harder to differentiate from one another. And the more new providers pile into the space, the more of a burden it is on advisors to evaluate them all and decide which one is actually the best fit for their purposes. So it becomes incumbent on each new provider to effectively show what makes them different – if they can\u0026#39;t find a way to stand out, they\u0026#39;ll fade together with all the rest of the providers.\u003c/p\u003e\n\u003cp\u003eAll of which makes it interesting to see how each new AI meeting note tool positions itself relative to the others. A notable example of this is \u003ca href=\"https://www.getmili.ai/\"\u003eMili\u003c/a\u003e, an AI note-taking solution \u003ca href=\"https://www.prnewswire.com/news-releases/mili-emerges-from-stealth-with-its-enterprise-ai-platform-for-wealth-management-firms-and-2-million-in-seed-funding-302344221.html\"\u003ethat recently emerged from \u0026#34;stealth\u0026#34; mode and announced a $2 million seed funding investment\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eMili, as \u003ca href=\"https://www.getmili.ai/\"\u003ethe current version of its website\u003c/a\u003e makes clear, positions itself as the \u0026#34;most secure meeting assistant for wealth advisors\u0026#34;. Which is fine as far as it goes – obviously advisors don\u0026#39;t want to have their clients\u0026#39; personal information compromised by hackers or absorbed into an AI model\u0026#39;s training data. But at this point, don\u0026#39;t advisors \u003cem\u003eexpect\u003c/em\u003e their AI notetaking tools to be secure? To that end, most of the existing AI meeting notes providers on the \u003ca href=\"https://www.kitces.com/fintechmap/\"\u003eKitces AdvisorTech Map\u003c/a\u003e already note their SOC2 certification, which is quite a robust baseline level of data security to have already become a \u0026#39;standard\u0026#39; (and is a higher rate of SOC2 certification than many other AdvisorTech categories!). And arguably once companies go beyond that baseline level, advisors tend to care less about additional layers of security (given that data breaches amongst AdvisorTech vendors are already so rare) and more about whether or not the tool actually does what they need it to do: in other words, while \u0026#39;more secure\u0026#39; is better with all things being equal, if it\u0026#39;s a choice between one solution that\u0026#39;s \u0026#34;secure enough\u0026#34; and produces coherent notes and integrates to the advisor\u0026#39;s CRM, and another that\u0026#39;s \u0026#34;more\u0026#34; secure but doesn\u0026#39;t do those things as well, advisors are almost always going to go for the one that does a better job as a notetaker than the one that\u0026#39;s just the most-most secure.\u003c/p\u003e\n\u003cp\u003eFor instance, beyond looking at data security alone, various platforms have different procedures around whether or not meetings are recorded or stored after the fact, which may matter for compliance purposes – though the reality is that without much guidance from securities regulators on these tools so far, the question for advisors is usually less about \u0026#34;will compliance allow me to use an AI notetaker that records meetings?\u0026#34; and more about \u0026#34;will compliance allow me to use an AI notetaker \u003cem\u003eat all\u003c/em\u003e?\u0026#34;. Which means firms that see AI notetakers as a compliance risk tend not to allow them \u003cem\u003eat all\u003c/em\u003e, rather than filtering for those that aim to be the most compliant. All of which make security and compliance difficult to work as differentiators, since the advisors who can actually use AI notetakers will likely be evaluating for other features.\u003c/p\u003e\n\u003cp\u003eThis isn\u0026#39;t to pick on any individual technology provider – AdvisorTech vendors often struggle to hone in on and articulate which of advisors\u0026#39; problems they\u0026#39;re actually trying to solve, which makes it hard to gain traction when advisors aren\u0026#39;t clear on what makes that solution worth buying to begin with. But in a category where numerous new tools have popped up and continue to raise capital from investors (and where less expensive general-purpose tools like Zoom continue to improve themselves), the path to growth lies not in picking one area like security and trying to out-do all the others – it\u0026#39;s about just being the best at recognizing and solving for advisors\u0026#39; problems.\u003c/p\u003e\n\u003cp\u003eFor AI meeting note tools, this simply means being the best tool at removing friction from the meeting prep and follow-up process by taking accurate and well-organized notes and syncing to the advisor\u0026#39;s existing systems, while being \u0026#34;at least\u0026#34; as secure as the competition to assure advisors that no compromises are being made on that front. Which may not make for as clear of a differentiator on the surface – since virtually all other AI notetaking tools are touting their ability to do the same thing – but in a category like AI meeting notes where the problem being solved is fairly straightforward, the best path might be just to focus on being the best at solving that problem.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Advisor360 Buys Parrot AI\" id=\"advisor360-buys-parrot-ai-to-bundle-ai-meeting-notes-directly-into-its-crm-platform\"\u003e\u003cspan\u003e\u003ca href=\"https://citywire.com/ria/news/advisor360-buys-generative-ai-software-firm/a2457770\"\u003eAdvisor360 Buys Parrot AI To Bundle AI Meeting Notes Directly Into Its (CRM) Platform\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003eBroadly speaking, the debate in advisor technology over the past 10-15 years has been about \u0026#34;all-in-one\u0026#34; platforms (where multiple solutions are bundled and deeply integrated together under a single provider) versus a \u0026#34;best-in-breed\u0026#34; approach (where advisors buy the individual tools that work best for them, and deal with existing integrations to make them work as a cohesive whole themselves). And despite immense investments of private equity capital over the past decade, advisors in recent years have increasingly shown a preference to go the best-of-breed route – a trend that has shown up in the story of providers like Envestnet, Orion, and Nitrogen that built or bought their way up to becoming all-in-one solutions only to struggle to gain all-in-one adoption and/or to really make those solutions perform better than the sum of their parts, leading them to ultimately unbundle their offerings so advisors can just choose the components they want.\u003c/p\u003e\n\u003cp\u003eBut that broad industry narrative does overlook some instances where providers have built or bought tools and integrated them successfully into their platforms. For instance, \u003ca href=\"https://www.rightcapital.com/\"\u003eRightCapital\u003c/a\u003e has long made a practice of integrating new tools and features into its financial planning platform, from Social Security optimization to cash flow mapping to one-page financial plans to \u003ca href=\"https://www.rightcapital.com/tax-analyzer/\"\u003eits new Tax Analyzer\u003c/a\u003e, and it remains highly regarded as a financial planning tool and \u003ca href=\"https://fintech.kitces.com/details/financial-planning/financial-planning/rightcapital\"\u003ea category leader in advisor satisfaction according to our own Kitces AdvisorTech Research\u003c/a\u003e. Another example would be \u003ca href=\"https://www.advyzon.com/main/index.html\"\u003eAdvyzon\u003c/a\u003e, which built its own CRM platform to accompany its portfolio management and reporting tools, and similarly ended up being one of the highest rated CRM providers \u003ca href=\"https://www.kitces.com/kitces-report-independent-financial-advisor-technology-fintech-software-tools-research/\"\u003ein the most recent Kitces Research on Advisor Technology\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThere seem to be two keys to making new features or tools work within an existing platform. The first is that the tool should be \u003cem\u003egood\u003c/em\u003e: It isn\u0026#39;t enough to have just any piece of software to fill a gap in the platform; it needs to be one that advisors would actually buy on its own as a standalone tool, otherwise they\u0026#39;ll look elsewhere. Or stated more simply, an all-in-one is only capable of winning business away from competitors when its components are each capable of competing head-to-head as a best-of-breed solution in the first place.\u003c/p\u003e\n\u003cp\u003eOn top of that, it seems to work best if the tool is mostly adjacent to the functions that the platform already provides. For instance, it makes sense to have a tax planning tool embedded into a comprehensive financial planning platform, since they\u0026#39;re often used side-by-side in the same meetings and within the same workflows. On the other hand, adding a financial planning tool to an investment management platform is harder to make work since there just isn\u0026#39;t as much synergy between the two (as \u003ca href=\"https://www.kitces.com/blog/envestnet-fidx-insurance-annuity-exchange-platform-moneyguidepro-free-tamarac/\"\u003eEnvestnet found with MoneyGuide Pro\u003c/a\u003e and \u003ca href=\"https://www.kitces.com/blog/the-latest-in-financial-advisor-fintech-august-2019/\"\u003eOrion found with Advizr\u003c/a\u003e, both of which struggled with adoption and user experience after their respective acquisitions). Once a platform ventures into the deep waters of categories beyond its existing core functionality, the seas get rougher as it must compete with experienced players who may have a deeper understanding of the needs of advisors in that category and how to solve them.\u003c/p\u003e\n\u003cp\u003eIn that context, it\u0026#39;s notable that this month \u003ca href=\"https://www.advisor360.com/press-release-advisor360-acquires-generative-artificial-intelligence-provider-parrot-ai\"\u003ethe performance reporting and digital onboarding platform Advisor360 announced\u003c/a\u003e that it was acquiring \u003ca href=\"https://parrot.ai/\"\u003eParrot AI\u003c/a\u003e, a relatively unknown (at least to financial advisors) AI meeting notes tool, to embed within its platform.\u003c/p\u003e\n\u003cp\u003eAs standalone AI notetaking tools have proliferated over the last two years, it seemed to be only a matter of time before an existing advisor platform either built or acquired one of their own. And it made the most sense for that platform to be a CRM – or an all-in-one with its own CRM – given how closely AI notetakers must integrate with CRM platforms to exchange client data, meeting notes, and follow-up tasks. In buying Parrot AI, a smaller meeting notes tool that wasn\u0026#39;t already targeted towards advisors, Advisor360 gets a \u0026#34;blank slate\u0026#34; AI solution – consisting mainly of a trained AI model and the staff of engineers who built and ran it – that it can shape and integrate into its platform the way it wants.\u003c/p\u003e\n\u003cp\u003eAt an industry level, the obvious question is which will be the next advisor platform to announce that it has built or acquired an AI notetaking solution? The list of potential acquirers isn\u0026#39;t necessarily limited to all-in-one solutions (e.g., Orion or Envestnet), since as noted above, it would make plenty of sense for a CRM platform (e.g., Wealthbox or Advyzon) to have an integrated AI notetaking solution (even as the overall tides shift towards standalone best-of-breed tools, since the two functions are so closely aligned).\u003c/p\u003e\n\u003cp\u003eUltimately, however, it\u0026#39;s hard not to see Advisor360\u0026#39;s acquisition of Parrot AI as a warning shot to existing standalone AI meeting note tools. Each advisor platform that integrates its own meeting notes tool shrinks the potential market for all of the standalone solutions, and given that there are only a few CRM providers in broad use, that market could start to shrink really quickly if the trend takes hold with other CRM providers bringing meeting notes tools in-house. In other words, if and when not only Advisor360, but also Redtail and Wealthbox and Advyzon and Salesforce all have their own integrated meeting notes tools, what comes next for the standalone AI meeting notes tools on the market, and can they still differentiate enough for advisors to be willing to pay a whole separate fee on top of the CRM provider they already use?\u003c/p\u003e\n\u003cp\u003eThere\u0026#39;s a glimmer of hope in the fact that standalone solutions have continued to thrive in other categories – since at the end of the day, it\u0026#39;s not just enough to package together a CRM and a notetaking tool, but they actually have to be good software that works well together. But it still looks like it could be a hard road from here, as once bigger platforms start to offer their own AI notetakers (and develop AI tools for other use cases over time), advisors could very likely decide that they\u0026#39;d just as soon have those tools live in the platforms that they already use (and part of the platform fee they already pay), rather than having to buy them as a standalone solution.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eIn the meantime, we\u0026#39;ve rolled out \u003cu\u003e\u003ca href=\"https://fintech.kitces.com/\" target=\"_blank\" rel=\"noopener\"\u003ea beta version of our new AdvisorTech Directory\u003c/a\u003e\u003c/u\u003e, along with making updates to the latest version of our Financial AdvisorTech Solutions Map (produced in collaboration with Craig Iskowitz of \u003cu\u003e\u003ca href=\"https://ezragroupllc.com/\" target=\"_blank\" rel=\"noopener\"\u003eEzra Group\u003c/a\u003e\u003c/u\u003e)!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/fintechmap/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Advisor FinTech Landscape February\" src=\"https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025.png\" alt=\"Advisor FinTech Landscape February\" width=\"2560\" height=\"1920\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025.png 2560w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-300x225.png 300w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-1024x768.png 1024w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-768x576.png 768w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-1536x1152.png 1536w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-2048x1536.png 2048w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-2000x1500.png 2000w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-800x600.png 800w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025.png 2560w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-300x225.png 300w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-1024x768.png 1024w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-768x576.png 768w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-1536x1152.png 1536w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-2048x1536.png 2048w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-2000x1500.png 2000w, https://www.kitces.com/wp-content/uploads/2025/01/Advisor-FinTech-Landscape-February-2025-800x600.png 800w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSo what do you think? Does Holistiplan\u0026#39;s price increase make it worth considering lower-cost options, either as a standalone tool like FP Alpha or bundled in with RightCapital? Will Testimonial Marketing Exchange spur more advisors to solicit and highlight their testimonials by making it easier to turn them into marketing campaigns? Would advisors prefer to use an AI meeting notes tool that\u0026#39;s embedded in their existing software rather than using a standalone platform? Let us know your thoughts by sharing in the comments below!\u003c/strong\u003e\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;Holistiplan’s Fee Increase Sparks Competition From FP Alpha And RightCapital (And More Of The Latest In Financial #AdvisorTech – February 2025)\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-148b0e0f7bded6ff88fc682a-=\"\"\u003e\n                    \u003cimg decoding=\"async\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\n                    \u003c/a\u003e\n                \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "47 min read",
  "publishedTime": "2025-02-03T07:01:38-05:00",
  "modifiedTime": "2025-01-31T21:34:39Z"
}
