{
  "id": "411b65cf-6c81-4099-8cfb-2e0d25526662",
  "title": "#600: Mini-Retirements Are the New Early Retirement – with Mom of Six, Jillian Johnsrud",
  "link": "https://affordanything.com/600-mini-retirements-are-the-new-early-retirement-with-mom-of-six-jillian-johnsrud/",
  "description": "Jillian Johnsrud was falling apart. After suffering a miscarriage, she couldn’t pull herself together to return to her job as a youth pastor in DC. She decided to take a month off. That unexpected break became Jillian’s first “mini-retirement” — a deliberate step away from work for at least 30 days to focus on something [...]",
  "author": "Paula Pant",
  "published": "Mon, 21 Apr 2025 11:53:49 +0000",
  "source": "https://affordanything.com/feed/",
  "categories": [
    "Episodes",
    "FIRE",
    "early retirement",
    "retirement planning"
  ],
  "byline": "",
  "length": 4594,
  "excerpt": "Jillian Johnsrud was falling apart. After suffering a miscarriage, she couldn’t pull herself together to return to her job as a youth pastor in DC. She decided to take a month off.",
  "siteName": "",
  "favicon": "https://affordanything.com/wp-content/uploads/eminence/favicon/favicon-196x196.png?v=10932",
  "text": "Jillian Johnsrud was falling apart. After suffering a miscarriage, she couldn’t pull herself together to return to her job as a youth pastor in DC. She decided to take a month off. That unexpected break became Jillian’s first “mini-retirement” — a deliberate step away from work for at least 30 days to focus on something meaningful. Today, Jillian is a mom of six who has taken more than a dozen mini-retirements with her kids, who currently range in age from 8 to 17. During her first mini-retirement, she and her best friend piled into her green Honda Civic and drove from DC to Seattle, leaving her 13-year-old son Micah at home with her husband. A couple years later, Jillian took Micah, then 15, to Glacier National Park in Montana for another mini-retirement. They saw mountain goats, kayaked together, and swam in ice-cold waters. This trip created irreplaceable memories. Sadly, Micah died six years later. His death changed how Jillian sees time. She now understands that meaningful moments don’t wait for perfect timing – they either happen now or vanish forever. Waiting for “someday” might mean missing chances forever. This drives her philosophy about mini retirements — life contains fleeting seasons that we either embrace now or miss entirely. “To be able to share those memories with him there is priceless,” Jillian tells us. This understanding shapes her approach with her other children too. From a 10-week road trip to 10 national parks in a pop-up camper to a recent six-month journey across the eastern United States with her five younger children (now ages 8-17), Jillian prioritizes experiences that fit each season of family life. Planning your own mini retirement? Jillian recommends focusing on four key areas: managing your time (pick just 2-3 priorities), addressing career logistics (craft a compelling story for your employer), saving money (about 6.5 percent of your income for a month off every other year), and preparing for emotional revelations. Jillian emphasizes the importance of separating your mini retirement fund from long-term retirement savings. This separate fund, which she calls the “in-between bucket,” allows you to spend freely on experiences now rather than postponing all enjoyment until traditional retirement age. As Jillian puts it: “You can’t postpone every good thing in your life.” —————————————————————————————————— Timestamps: Note: Timestamps will vary on individual listening devices based on dynamic advertising run times. The provided timestamps are approximate and may be several minutes off due to changing ad lengths. (0:00) Introduction to mini-retirements (0:59) Definition of mini-retirement: stepping away from work for 30+ days to focus on something meaningful (3:03) Jillian shares her first mini-retirement story after experiencing personal loss (8:28) Taking time off to enjoy important life moments before they pass (12:12) Jillian’s trip to Glacier National Park with her son Micah before he passed away (20:33) Four components of planning a mini-retirement: time, career, finances, unexpected challenges (34:14) Time management: choosing 2-3 clear goals rather than trying to do everything (42:39) Career strategies: how to present your mini-retirement to employers (1:01:29) Financial planning: saving 6.5% of income for monthly breaks every other year (1:14:34) Handling unexpected challenges that arise during your time off (1:20:01) How mini-retirements reveal personal issues you’ve avoided through work (1:33:32) Jillian’s recent family adventures with five children Thanks to our sponsors! NetSuite NetSuite is the number one cloud financial system, bringing accounting, financial management, inventory, HR, into ONE platform, and ONE source of truth. Head to NetSuite.com/PAULA  and download the CFO’s Guide to AI and Machine Learning. Indeed If you’re looking for amazing talent to bolster your team, you need Indeed. Go to indeed.com/paula and start hiring today. Wayfair Wayfair is the go-to destination for everything home, no matter your style or budget. Go to wayfair.com or the Wayfair mobile app to shop for Black Friday deals. Pestie Pestie gets rid of over 100 types of bugs, from spiders and ants to roaches and scorpions. Protect your home from bugs with Pestie. For 10% off your order, go to pestie.com/PAULA pestie.com/PAULA. Shopify Diversify your business by selling physical and digital products through Shopify’s all-in-one platform. Every 28 seconds an entrepreneur makes their first sale on Shopify! Go to shopify.com/paula for one-dollar-per-month trial period for three months.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain\u003e\u003carticle aria-label=\"#600: Mini-Retirements Are the New Early Retirement – with Mom of Six, Jillian Johnsrud\"\u003e\u003cdiv\u003e\n\u003cp\u003eJillian Johnsrud was falling apart. After suffering a miscarriage, she couldn’t pull herself together to return to her job as a youth pastor in DC. She decided to take a month off.\u003c/p\u003e\n\u003cp\u003eThat unexpected break became Jillian’s first “mini-retirement” — a deliberate step away from work for at least 30 days to focus on something meaningful.\u003c/p\u003e\n\u003cp\u003eToday, Jillian is a mom of six who has taken more than a dozen mini-retirements with her kids, who currently range in age from 8 to 17.\u003c/p\u003e\n\u003cp\u003eDuring her first mini-retirement, she and her best friend piled into her green Honda Civic and drove from DC to Seattle, leaving her 13-year-old son Micah at home with her husband.\u003c/p\u003e\n\u003cp\u003eA couple years later, Jillian took Micah, then 15, to Glacier National Park in Montana for another mini-retirement. They saw mountain goats, kayaked together, and swam in ice-cold waters.\u003c/p\u003e\n\u003cp\u003eThis trip created irreplaceable memories. Sadly, Micah died six years later.\u003c/p\u003e\n\u003cp\u003eHis death changed how Jillian sees time. She now understands that meaningful moments don’t wait for perfect timing – they either happen now or vanish forever.\u003c/p\u003e\n\u003cp\u003eWaiting for “someday” might mean missing chances forever.\u003c/p\u003e\n\u003cp\u003eThis drives her philosophy about mini retirements — life contains fleeting seasons that we either embrace now or miss entirely.\u003c/p\u003e\n\u003cp\u003e“To be able to share those memories with him there is priceless,” Jillian tells us.\u003c/p\u003e\n\u003cp\u003eThis understanding shapes her approach with her other children too. From a 10-week road trip to 10 national parks in a pop-up camper to a recent six-month journey across the eastern United States with her five younger children (now ages 8-17), Jillian prioritizes experiences that fit each season of family life.\u003c/p\u003e\n\u003cp\u003ePlanning your own mini retirement? Jillian recommends focusing on four key areas: managing your time (pick just 2-3 priorities), addressing career logistics (craft a compelling story for your employer), saving money (about 6.5 percent of your income for a month off every other year), and preparing for emotional revelations.\u003c/p\u003e\n\u003cp\u003eJillian emphasizes the importance of separating your mini retirement fund from long-term retirement savings. This separate fund, which she calls the “in-between bucket,” allows you to spend freely on experiences now rather than postponing all enjoyment until traditional retirement age.\u003c/p\u003e\n\u003cp\u003eAs Jillian puts it: “You can’t postpone every good thing in your life.”\u003c/p\u003e\n\u003cp\u003e——————————————————————————————————\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cu\u003eTimestamps:\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eNote: Timestamps will vary on individual listening devices based on dynamic advertising run times. The provided timestamps are approximate and may be several minutes off due to changing ad lengths.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e(0:00) Introduction to mini-retirements\u003c/p\u003e\n\u003cp\u003e(0:59) Definition of mini-retirement: stepping away from work for 30+ days to focus on something meaningful\u003c/p\u003e\n\u003cp\u003e(3:03) Jillian shares her first mini-retirement story after experiencing personal loss\u003c/p\u003e\n\u003cp\u003e(8:28) Taking time off to enjoy important life moments before they pass\u003c/p\u003e\n\u003cp\u003e(12:12) Jillian’s trip to Glacier National Park with her son Micah before he passed away\u003c/p\u003e\n\u003cp\u003e(20:33) Four components of planning a mini-retirement: time, career, finances, unexpected challenges\u003c/p\u003e\n\u003cp\u003e(34:14) Time management: choosing 2-3 clear goals rather than trying to do everything\u003c/p\u003e\n\u003cp\u003e(42:39) Career strategies: how to present your mini-retirement to employers\u003c/p\u003e\n\u003cp\u003e(1:01:29) Financial planning: saving 6.5% of income for monthly breaks every other year\u003c/p\u003e\n\u003cp\u003e(1:14:34) Handling unexpected challenges that arise during your time off\u003c/p\u003e\n\u003cp\u003e(1:20:01) How mini-retirements reveal personal issues you’ve avoided through work\u003c/p\u003e\n\u003cp\u003e(1:33:32) Jillian’s recent family adventures with five children\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://affordanything.com/wp-content/uploads/listen-to-afford-anything-on-itunes.png\" alt=\"listen to afford anything on itunes\" width=\"150\" height=\"38\"/\u003e\u003ca href=\"https://subscribeonandroid.com/paulaandjaymoney.libsyn.com/rss\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://affordanything.com/wp-content/uploads/subscribe-on-android-afford-anything.png\" alt=\"subscribe on android afford anything\" width=\"110\" height=\"40\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eThanks to our sponsors!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.netsuite.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eNetSuite\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nNetSuite is the number one cloud financial system, bringing accounting, financial management, inventory, HR, into ONE platform, and ONE source of truth. Head to \u003ca href=\"http://www.netsuite.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eNetSuite.com/PAULA \u003c/strong\u003e\u003c/a\u003e and download the CFO’s Guide to AI and Machine Learning.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003ca href=\"https://indeed.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eIndeed\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nIf you’re looking for amazing talent to bolster your team, you need Indeed. Go to \u003ca href=\"https://indeed.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eindeed.com/paula\u003c/strong\u003e\u003c/a\u003e and start hiring today.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003ca href=\"https://wayfair.com/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eWayfair\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nWayfair is the go-to destination for everything home, no matter your style or budget. Go to \u003cstrong\u003e\u003ca href=\"https://wayfair.com/\" target=\"_blank\" rel=\"noopener\"\u003ewayfair.com \u003c/a\u003e\u003c/strong\u003e\u003cstrong\u003eor the Wayfair mobile app\u003c/strong\u003e to shop for Black Friday deals.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003ca href=\"https://pestie.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003ePestie\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nPestie gets rid of over 100 types of bugs, from spiders and ants to roaches and scorpions. Protect your home from bugs with Pestie. For 10% off your order, go to \u003cstrong\u003e\u003ca href=\"https://pestie.com/paula\" target=\"_blank\" rel=\"noopener\"\u003epestie.com/PAULA\u003c/a\u003e\u003c/strong\u003e pestie.com/PAULA.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003ca href=\"https://www.shopify.com/free-trial?utm_campaign=paid_audio_-_podcast_-_amer_-_united_states_-_all_-_experimential_-_english_-_awareness\u0026amp;utm_source=podcast\u0026amp;utm_medium=audio\u0026amp;utm_term=paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eShopify\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nDiversify your business by selling physical and digital products through Shopify’s all-in-one platform. Every 28 seconds an entrepreneur makes their first sale on Shopify! Go to \u003ca href=\"https://www.shopify.com/free-trial?utm_campaign=paid_audio_-_podcast_-_amer_-_united_states_-_all_-_experimential_-_english_-_awareness\u0026amp;utm_source=podcast\u0026amp;utm_medium=audio\u0026amp;utm_term=paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eshopify.com/paula\u003c/strong\u003e\u003c/a\u003e for one-dollar-per-month trial period for three months.\u003c/p\u003e\n\u003c/div\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
