{
  "id": "4bad5d53-6ca5-4ca4-9963-dd905b4d3d0c",
  "title": "Why Residential Commercial Real Estate Looks Attractive in 2025",
  "link": "https://www.financialsamurai.com/residential-commercial-real-estate-looks-attractive/",
  "description": "In this Financial Samurai podcast episode, I speak to Ben Miller, co-founder and CEO of Fundrise about his outlook for residential commercial real estate in 2025. Despite high mortgage rates, he's taken a positive view and he shares the main reasons why.  Listen to my conversation with Ben by click the play button below or go to […] The post Why Residential Commercial Real Estate Looks Attractive in 2025 appeared first on Financial Samurai.",
  "author": "Financial Samurai",
  "published": "Mon, 20 Jan 2025 12:18:00 +0000",
  "source": "https://www.financialsamurai.com/feed/",
  "categories": [
    "Real Estate"
  ],
  "byline": "Financial Samurai",
  "length": 5864,
  "excerpt": "Four reasons to be positive on commercial real estate in 2025 according to Ben Miller, CEO of Fundrise, a leading private real estate co.",
  "siteName": "Financial Samurai",
  "favicon": "https://i2.wp.com/financialsamurai.com/wp-content/uploads/2017/02/cropped-FinancialSamurai-Site-Icon-700x700-180x180.png",
  "text": "In this Financial Samurai podcast episode, I speak to Ben Miller, co-founder and CEO of Fundrise about his outlook for residential commercial real estate in 2025. Despite high mortgage rates, he's taken a positive view and he shares the main reasons why.  Listen to my conversation with Ben by click the play button below or go to the episode on Apple or Spotify. Reasons To Be Positive On Residential Commercial Real Estate In 2025 In my post, How I'd Invest $250,000 Today, I touched upon why I believe residential commercial real estate presents a compelling investment opportunity in 2025. However, with stubbornly high mortgage rates to start the year, some doubt has crept in. Naturally, I was excited to hear Ben's optimistic perspective on the topic. Below is a summary of the four key reasons Ben is bullish on residential commercial real estate in 2025, as discussed on the podcast. You’ll notice some skepticism in my voice as I challenge certain points in his arguments. Since there are no guarantees when investing in risk assets, it's always wise to uncover any potential blind spots. 1) Valuation Differential Between Stocks and Real Estate Is Too Wide The S\u0026P 500 is trading at ~22x forward earnings, well above its historical average forward P/E of 17x. Historically, investing in stocks at such elevated valuations has often led to lackluster returns. Meanwhile, commercial real estate prices have declined by over 20% in the past two years, as stocks surged by more than 50%. This massive valuation gap seems unsustainable, particularly if mortgage rates begin to edge lower. Below is a chart that caught my attention because it highlights how apartment values have declined to levels similar to those seen during the global financial crisis. However, the economy and household balance sheets are significantly stronger today. This disconnect makes me optimistic about residential commercial real estate, as prices rebounded sharply following the global financial crisis. Back in 2010, I vividly remember wanting to start a fund to buy up all the residential real estate in Vallejo, a city 29 miles north of San Francisco that had declared bankruptcy. However, I lacked the funds and connections to make it happen. Today, I can simply invest in a residential commercial real estate fund and gain exposure to properties at significant discounts. 2) Performance Correlation Is Out of Alignment Stocks and commercial real estate have historically been highly correlated, as both reflect the broader economy. From 2012 to 2022, their performance moved in tandem. A healthy economy benefits both asset classes. However, since 2022, this correlation has broken down, creating an opportunity for those who believe in mean reversion. Moreover, in a potential recession, real estate could outperform stocks as investors shift toward a more stable asset. A chart demonstrating the historical correlation between stocks and real estate 3) Future Undersupply of Housing Elevated interest rates since 2022 have significantly slowed new construction, even in builder-friendly cities like Austin and Houston. Costar says that new housing starts in Houston are down 97%. This multi-year pause in development is setting the stage for a housing undersupply. Ben, with his company's enormous portfolio of residential commercial real estate, believes the oversupply from the building boom through 2021 will be absorbed by the end of 2025, if not by the middle of 2025, faster than many estimates. As a result, he expects rents and residential commercial real estate prices to begin rising again by late 2025 and beyond. Their portfolio is already seeing rent growth return. In the interview, I also present my argument that the return to office will bolster commercial real estate in major cities like NYC, San Francisco, Boston, Seattle, and LA, where building new developments is significantly more challenging. However, Ben remains skeptical, citing advancements in technology as a counterpoint. 4) Low Risk Of Accelerating Inflation There’s a widespread fear that Trump’s second term could bring significant inflation. However, the economy in 2015, 2016, and 2017 was much stronger than it is today. Yet, despite robust growth and eventual tax cuts after Trump took office on January 20, 2017, inflation remained relatively low until the pandemic. Additionally, Trump has pledged to combat inflation during his campaign, suggesting it’s unlikely he would pursue policies that could exacerbate it. Demographics also point to a deflationary trend over the long term. With America’s birth rate declining, slower population growth is likely to exert downward pressure on inflation. Investing in Commercial Real Estate for the Long Term As a value investor, I’m always on the lookout for disconnects in historical performance and valuations. Many personal finance enthusiasts likely share this mindset, as we tend to be more frugal and cost-conscious. In 2025, I’d prefer to allocate more new investment dollars to undervalued residential commercial real estate rather than expensive stocks. After the S\u0026P 500’s strong performance in 2023 and 2024, it’s hard to imagine the index delivering outsized returns again in 2025. So far, I’ve invested about $300,000 with Fundrise, a trusted partner and long-time sponsor of Financial Samurai. With a low investment minimum of just $10, dollar-cost averaging into commercial real estate has never been more accessible. To expedite your journey to financial freedom, join over 60,000 others and subscribe to the free Financial Samurai newsletter. Financial Samurai is among the largest independently-owned personal finance websites, established in 2009. Everything is written based on firsthand experience and expertise.",
  "image": "https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/house-6799908_1280.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-275415\" itemtype=\"https://schema.org/CreativeWork\" itemscope=\"itemscope\"\u003e\n\n\t\n\t\n\u003cdiv data-ast-blocks-layout=\"true\" itemprop=\"text\"\u003e\n\n\t\t\n\t\t\n\u003cp\u003eIn this Financial Samurai podcast episode, I speak to Ben Miller, co-founder and CEO of \u003ca href=\"https://www.financialsamurai.com/fundrise\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003e\u003cstrong\u003eFundrise\u003c/strong\u003e\u003c/a\u003e about his outlook for residential commercial real estate in 2025. Despite high mortgage rates, he\u0026#39;s taken a positive view and he shares the main reasons why. \u003c/p\u003e\n\n\n\n\u003cp\u003eListen to my conversation with Ben by click the play button below or go to the episode on \u003ca href=\"https://podcasts.apple.com/us/podcast/the-bull-case-for-commercial-real-estate-in-2025-and-beyond/id1324765509?i=1000684215054\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eApple\u003c/a\u003e or \u003ca href=\"https://open.spotify.com/episode/1H0EJqsj9JC3QrIDyJ79Ei?si=-D6puChASQOGSg4_hH9awQ\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSpotify\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch2 id=\"h-reasons-to-be-positive-on-residential-commercial-real-estate-in-2025\"\u003eReasons To Be Positive On Residential Commercial Real Estate In 2025\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn my post, \u003cem\u003e\u003ca href=\"https://www.financialsamurai.com/how-id-invest-250000-cash/\"\u003eHow I\u0026#39;d Invest $250,000 Today\u003c/a\u003e\u003c/em\u003e, I touched upon why I believe residential commercial real estate presents a compelling investment opportunity in 2025. However, with stubbornly high mortgage rates to start the year, some doubt has crept in.\u003c/p\u003e\n\n\n\n\u003cp\u003eNaturally, I was excited to hear Ben\u0026#39;s optimistic perspective on the topic. Below is a summary of the four key reasons Ben is bullish on residential commercial real estate in 2025, as discussed on the podcast.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou’ll notice some \u003cem\u003eskepticism\u003c/em\u003e in my voice as I challenge certain points in his arguments. Since there are no guarantees when investing in risk assets, it\u0026#39;s always wise to uncover any potential blind spots.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-1-valuation-differential-between-stocks-and-real-estate-is-too-wide\"\u003e1) \u003cstrong\u003eValuation Differential Between Stocks and Real Estate\u003c/strong\u003e Is Too Wide\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe S\u0026amp;P 500 is trading at ~22x forward earnings, well above its historical average forward P/E of 17x. Historically, investing in stocks at such elevated valuations has often led to lackluster returns.\u003c/p\u003e\n\n\n\n\u003cp\u003eMeanwhile, commercial real estate prices have declined by over 20% in the past two years, as stocks surged by more than 50%. This massive valuation gap seems unsustainable, particularly if mortgage rates begin to edge lower.\u003c/p\u003e\n\n\n\n\u003cp\u003eBelow is a chart that caught my attention because it highlights how apartment values have declined to levels similar to those seen during the \u003ca href=\"https://www.financialsamurai.com/personal-lessons-learned-since-the-2008-financial-crisis/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eglobal financial crisis\u003c/a\u003e. However, the economy and household balance sheets are significantly stronger today. This disconnect makes me optimistic about residential commercial real estate, as prices rebounded sharply following the global financial crisis.\u003c/p\u003e\n\n\n\n\u003cp\u003eBack in 2010, I vividly remember wanting to start a fund to buy up all the residential real estate in Vallejo, a city 29 miles north of San Francisco that had declared bankruptcy. However, I lacked the funds and connections to make it happen. Today, I can simply invest in a residential commercial \u003ca href=\"https://www.financialsamurai.com/real-estate-crowdfunding-learning-center/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ereal estate fund\u003c/a\u003e and gain exposure to properties at significant discounts.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/IMG_6745.jpeg\" alt=\"Why commercial residential real estate looks attractive in 2025, prices are down as much as they were during the global financial crisis\" srcset=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/IMG_6745.jpeg 1920w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/IMG_6745-350x197.jpeg 350w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/IMG_6745-728x410.jpeg 728w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/IMG_6745-768x432.jpeg 768w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/IMG_6745-1536x864.jpeg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch3 id=\"h-2-performance-correlation-is-out-of-alignment\"\u003e2) Performance Correlation Is Out of Alignment\u003c/h3\u003e\n\n\n\n\u003cp\u003eStocks and commercial real estate have historically been highly correlated, as both reflect the broader economy. From 2012 to 2022, their performance moved in tandem. A healthy economy benefits both asset classes.\u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, since 2022, this correlation has broken down, creating an opportunity for those who believe in mean reversion. Moreover, in a potential recession, real estate could outperform stocks as investors shift toward a more stable asset.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1730\" height=\"934\" src=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/CA-HomePrices-Stocks-Q3-2022-1.png\" alt=\"Historical correlation between home price and stock price index\" srcset=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/CA-HomePrices-Stocks-Q3-2022-1.png?fit=1456,9999 1730w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/CA-HomePrices-Stocks-Q3-2022-1-350x189.png?fit=1456,9999 350w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/CA-HomePrices-Stocks-Q3-2022-1-728x393.png?fit=1456,9999 728w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/CA-HomePrices-Stocks-Q3-2022-1-768x415.png?fit=1456,9999 768w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/CA-HomePrices-Stocks-Q3-2022-1-1536x829.png?fit=1456,9999 1536w\" sizes=\"(max-width: 1730px) 100vw, 1730px\"/\u003e\u003cfigcaption\u003eA chart demonstrating the historical correlation between stocks and real estate\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003ch3 id=\"h-3-future-undersupply-of-housing\"\u003e3) Future Undersupply of Housing\u003c/h3\u003e\n\n\n\n\u003cp\u003eElevated interest rates since 2022 have significantly slowed new construction, even in builder-friendly cities like Austin and Houston. Costar says that new housing starts in Houston are down 97%. This multi-year pause in development is setting the stage for a housing undersupply.\u003c/p\u003e\n\n\n\n\u003cp\u003eBen, with his company\u0026#39;s enormous portfolio of residential commercial real estate, believes the oversupply from the building boom through 2021 will be absorbed by the end of 2025, if not by the middle of 2025, faster than many estimates. As a result, he expects rents and residential commercial real estate prices to begin rising again by late 2025 and beyond. Their portfolio is already seeing rent growth return. \u003c/p\u003e\n\n\n\n\u003cp\u003eIn the interview, I also present my argument that the\u003ca href=\"https://www.financialsamurai.com/capitalizing-on-the-return-to-office-big-city-real-estate-insights/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e return to office\u003c/a\u003e will bolster commercial real estate in major cities like NYC, San Francisco, Boston, Seattle, and LA, where building new developments is significantly more challenging. However, Ben remains skeptical, citing advancements in technology as a counterpoint.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1283\" height=\"1130\" src=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/undersupply-of-housing.png\" alt=\"Supply of housing in America since 2000. Freddie Mac believes there is a 1.5 million housing units below a balanced market, undersupply\" srcset=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/undersupply-of-housing.png?fit=1456,9999 1283w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/undersupply-of-housing-350x308.png?fit=1456,9999 350w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/undersupply-of-housing-568x500.png?fit=1456,9999 568w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/01/undersupply-of-housing-768x676.png?fit=1456,9999 768w\" sizes=\"auto, (max-width: 1283px) 100vw, 1283px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch3 id=\"h-4-low-risk-of-accelerating-inflation\"\u003e4) Low Risk Of Accelerating Inflation\u003c/h3\u003e\n\n\n\n\u003cp\u003eThere’s a widespread fear that \u003ca href=\"https://www.financialsamurai.com/what-a-trump-presidency-means-for-your-finances/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eTrump’s second term\u003c/a\u003e could bring significant inflation. However, the economy in 2015, 2016, and 2017 was much stronger than it is today. Yet, despite robust growth and eventual tax cuts after Trump took office on January 20, 2017, inflation remained relatively low until the pandemic.\u003c/p\u003e\n\n\n\n\u003cp\u003eAdditionally, Trump has pledged to combat inflation during his campaign, suggesting it’s unlikely he would pursue policies that could exacerbate it.\u003c/p\u003e\n\n\n\n\u003cp\u003eDemographics also point to a deflationary trend over the long term. With America’s birth rate declining, slower population growth is likely to exert downward pressure on inflation.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://willowdaleequity.com/blog/do-stocks-outperform-real-estate/\" target=\"_blank\" rel=\" noreferrer noopener\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"957\" height=\"457\" src=\"https://www.financialsamurai.com/wp-content/uploads/2025/01/stock-market-vs-commercial-real-estate-returns-min.png-1.webp\" alt=\"Stock market versus commercial real estate correlation\" srcset=\"https://www.financialsamurai.com/wp-content/uploads/2025/01/stock-market-vs-commercial-real-estate-returns-min.png-1.webp 957w, https://www.financialsamurai.com/wp-content/uploads/2025/01/stock-market-vs-commercial-real-estate-returns-min.png-1-350x167.webp 350w, https://www.financialsamurai.com/wp-content/uploads/2025/01/stock-market-vs-commercial-real-estate-returns-min.png-1-728x348.webp 728w, https://www.financialsamurai.com/wp-content/uploads/2025/01/stock-market-vs-commercial-real-estate-returns-min.png-1-768x367.webp 768w\" sizes=\"auto, (max-width: 957px) 100vw, 957px\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-investing-in-commercial-real-estate-for-the-long-term\"\u003e\u003cstrong\u003eInvesting in Commercial Real Estate for the Long Term\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs a value investor, I’m always on the lookout for disconnects in historical performance and valuations. Many personal finance enthusiasts likely share this mindset, as we tend to be more frugal and cost-conscious.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn 2025, I’d prefer to allocate more new investment dollars to undervalued residential commercial real estate rather than expensive stocks. After the S\u0026amp;P 500’s strong performance in 2023 and 2024, it’s hard to imagine the index delivering outsized returns again in 2025.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo far, I’ve invested about $300,000 with \u003cstrong\u003e\u003ca aria-label=\"Fundrise (opens in a new tab)\" href=\"https://www.financialsamurai.com/fundrise\" target=\"_blank\" rel=\"nofollow noindex noreferrer noopener\"\u003eFundrise\u003c/a\u003e\u003c/strong\u003e, a trusted partner and long-time sponsor of Financial Samurai. With a low investment minimum of just $10, dollar-cost averaging into commercial real estate has never been more accessible. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://www.financialsamurai.com/fundrise\" target=\"_blank\" rel=\" noreferrer noopener\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1495\" height=\"1268\" src=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2023/10/Fundrise-dashboard-2025.png\" alt=\"Financial Samurai Fundrise investment amount and dashboard\" srcset=\"https://i2.wp.com/financialsamurai.com/wp-content/uploads/2023/10/Fundrise-dashboard-2025.png?fit=1456,9999 1495w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2023/10/Fundrise-dashboard-2025-350x297.png?fit=1456,9999 350w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2023/10/Fundrise-dashboard-2025-590x500.png?fit=1456,9999 590w, https://i2.wp.com/financialsamurai.com/wp-content/uploads/2023/10/Fundrise-dashboard-2025-768x651.png?fit=1456,9999 768w\" sizes=\"auto, (max-width: 1495px) 100vw, 1495px\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eTo expedite your journey to financial freedom, join over 60,000 others and subscribe to the \u003cstrong\u003e\u003ca href=\"https://www.financialsamurai.com/news\" target=\"_blank\" rel=\"noreferrer noopener\"\u003efree Financial Samurai newsletter\u003c/a\u003e\u003c/strong\u003e. Financial Samurai is among the largest independently-owned personal finance websites, established in 2009. Everything is written based on firsthand experience and expertise.\u003c/p\u003e\n\n\t\t\n\t\t\n\t\t\t\u003c/div\u003e\n\n\t\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-20T12:18:00Z",
  "modifiedTime": "2025-01-20T17:11:37Z"
}
