{
  "id": "5cdb1938-29b5-4f92-a798-d3866a52dbca",
  "title": "The Best Way To Determine If You Have Enough Money",
  "link": "https://www.financialsamurai.com/the-best-way-to-determine-if-you-have-enough-money/",
  "description": "I recently received a question that boils down to this: How do you know when you have enough money? And once you do, when is it time to shift from chasing excess returns to simply maintaining what you have? There are several ways to approach this question, which I’ll explore in this post. I've come […] The post The Best Way To Determine If You Have Enough Money appeared first on Financial Samurai.",
  "author": "Financial Samurai",
  "published": "Mon, 09 Jun 2025 11:18:00 +0000",
  "source": "https://www.financialsamurai.com/feed/",
  "categories": [
    "Wealth"
  ],
  "byline": "Financial Samurai",
  "length": 17296,
  "excerpt": "Here's the best way to determine if you have enough money. Further, you'll learn how to allocate your net worth so you never run out of money.",
  "siteName": "Financial Samurai",
  "favicon": "https://i2.wp.com/financialsamurai.com/wp-content/uploads/2017/02/cropped-FinancialSamurai-Site-Icon-700x700-180x180.png",
  "text": "I recently received a question that boils down to this: How do you know when you have enough money? And once you do, when is it time to shift from chasing excess returns to simply maintaining what you have? There are several ways to approach this question, which I’ll explore in this post. I've come up with a framework that I think makes sense for those who think they truly have enough. Here's the question presented from a reader. Hi Sam, I just finished your piece on risk-free passive income—really well done. A very accurate depiction of the trade-offs between the two approaches. I have a question for you: You illustrate the comparison using a $5 million portfolio. I’m curious—at what wealth level does the appeal of building more wealth start to fade, and when does preserving capital with 2%–3% returns plus inflation protection become the primary objective? I fully agree that wealth building is still relevant at the $5 million level. But what about at $10 million? $15 million? Or does it take more? Let’s assume a 3.75%–4% yield and inflation-beating dividend growth (say, via SCHD). Real estate could match this as well, but I question whether it truly qualifies as passive. At what point in the journey does playing defense and focusing on income stability outweigh the pursuit of more wealth? When is it time to stop chasing and just maintain? Thanks, Jim The Elusive Concept of “Enough” “Enough” is subjective. For some, there’s never enough money—enough is always a moving target, 2X more than what they think they want once they get there. For others, it might mean having 25X to 50X their annual expenses in investments, multiples I think are appropriate for 80% of people to answer what enough is. Spend $50,000 a year? You have enough if you have between $1.25 million – $2.5 million in investable assets. I personally like using the inverse of the FS Withdrawal Rate as a guide. If the 10-year bond yield declines to 3%, then you'd divide $50,000 by 2.4% (3% X 80%) if you use my FS withdrawal rate to get to $2,083,333. My safe withdrawal rate is a dynamic safe withdrawal rate that changes with economic conditions. It helps families build generational wealth. However, I believe the best way to know you have enough money is this: you refuse to trade your time doing something you don’t fully enjoy for money. What you enjoy is, of course, also highly subjective. But it should be something you like doing at least 90% of the time or you feel at least 90% of the activity is enjoyable. The Real Test: Will You Walk Away? The clearest indicator that you have enough money is your willingness to walk away from a job—or an activity—that drains you. You can rationalize your way into staying. You might tell yourself: “I don’t need the money.” But if you’re still clocking in at a job you dislike, you’re not being honest. Time is more valuable than money, so if you really had enough, you wouldn’t be doing something you dislike. Now, I know some of you who are financially independent on paper will say, “But I love my job.” And that’s awesome. Seriously—you’ve hit the career lottery. Keep going. Nobody quits or retires early from a job they dislike. But I also know many more are saying that out of fear—afraid to let go of a steady paycheck, afraid of losing structure or identity. And if that’s the case, I challenge you: muster the courage to engineer your layoff or find a path out. That’s when you’ll know you’ve reached enough. Questions to Ask Yourself If You Think You Have Enough Money To help determine whether you have the courage to stop doing something you don’t enjoy just for the money, ask yourself: Would you rather take care of your baby during their precious first year of life, or sit in endless meetings every day? Commute during rush hour, or sleep in and read a good book? Work late for a month to finish a project, or spend that time playing with your kids or helping them with schoolwork? Travel for business for weeks at a time, or care for an aging parent with health issues? Meet monthly and quarterly sales quotas, or play pickleball in the late morning and take a nap after? Play corporate politics to get promoted, or enjoy the freedom to be your true self and only spend time with people you like? Fly out on a Sunday afternoon for a Monday morning client meeting, or travel the world with no set return date? If given the choice, who with enough money would honestly choose the work option in any of these scenarios? Your financial independence number is not real if you continue to subject yourself to displeasure after getting there. When Is It Time To Stop Chasing More Wealth and Just Maintain? Once you have enough money, logic would dictate that you no longer need to take financial risks. Instead, you could simply invest your entire net worth into risk-free or low-risk investments that at least keep up with inflation. These types of investments that generate risk-free income include: Money market funds (though yields may not always match or beat inflation) Treasury bonds (yields are generally higher than inflation) AAA municipal bonds (nearly risk-free and usually yield more than inflation) The reality, however, is that stocks and real estate have historically been the best-performing asset classes when it comes to beating inflation over the long term. Cryptocurrency—specifically Bitcoin—is also a contender. But as we all know, none of these are risk-free. Divide Your Wealth Into Risk-Free and Risk-Required Buckets If you truly believe you have enough money, the best strategy is to allocate a portion of your net worth into completely risk-free or low-risk investments. This bucket should generate enough passive income to cover 100% of your living expenses. In other words, ringfence a portion of your net worth that will take care of you for life, no matter what happens. Once you’ve secured this financial base, you can then invest the remainder of your wealth in riskier assets for potentially greater returns, without the stress of needing those returns to survive. Think about this portion of your investments as playing with the house’s money. A Fat FIRE Example: Let’s say your desired annual household spending is $400,000. You’re fortunate to have a top 1% net worth of $14 million. At a 4% safe withdrawal rate, you’d allocate $10 million ($400,000 / 0.04) into Treasury bonds yielding over 4% or similarly safe investments. You can then invest the remaining $4 million into stocks, real estate, venture, crypto, or any risk asset you want. Even if you lose half—or all—of this risk bucket, your lifestyle remains fully supported by your safe assets. Thankfully, most investments don’t go to zero and actually make you money over time. A Lean FIRE Example: Let’s say you and your spouse have no children and are content spending $50,000 gross a year. Your net worth is $1.5 million. At a 4% safe withdrawal rate, you would allocate $1.25 million to risk-free or low-risk investments, and invest the remaining $250,000 in riskier assets for possible upside. Now, of course, allocating 83.3% of your net worth to safe assets might seem extreme. But if you’re truly satisfied with what you have, then this asset allocation makes perfect sense. Especially when the Treasury yield is greater than inflation, as it often is—since inflation helps determine bond yields in the first place. If you're uncomfortable with such a conservative approach, then perhaps you don’t actually feel like you have enough. On paper, you might be financially independent, but emotionally and psychologically, you're not there yet. You're still willing to risk losing money for the chance of having more that you want or think you need. Or you're still encouraging your spouse to work or you're still working hard on generating supplemental income. And that’s OK. Just be honest with yourself about whether you truly have enough. The Ideal Percentage of Your Net Worth in Risk-Free Assets You might think the ideal situation is being able to allocate the smallest percentage of your net worth to risk-free assets while still being able to cover your desired living expenses. The lower the percentage, the richer you appear to be. But having too small a percentage in risk-free assets might also suggest you're overly frugal or not generous enough with your time and wealth. For example, let’s say you have a $10 million net worth, the ideal net worth to retire according to a previous FS survey, and only spend $40,000 in gross income a year. At a 4% rate of return, you’d only need to allocate 10%—or $1 million—into risk-free investments to cover your expenses. But what’s the point of having $10 million if you’re only living off 10% of it? You could have saved all the stress and energy slaving away when you were younger. Sure, investing the remaining $9 million in risk assets to potentially double it in 10 years sounds exciting. But again, what’s the point if you're not spending it or using it to help others? Money should be spent or given away before we die. A More Balanced Approach: 20%–50% In Risk-Free Investments Once you have enough, the ideal percentage of your net worth in risk-free assets is somewhere around 20% to 50%. Within this range, you're likely spending enough to enjoy the fruits of your labor—say, $80,000 to $200,000 a year, continuing the earlier example. At the same time, you still have a significant portion of your net worth—50% or more—invested in risk assets that have historically outpaced inflation. Even if you no longer need more money, it would be unwise to bet against the long-term returns of stocks, real estate, and other growth assets. And if your risk investments do well, you can always use the extra gains to support your children, grandchildren, friends, relatives, or organizations in need. When in doubt, split the difference: 50% risk-free, 50% risk assets. It’s a balanced, emotionally comforting strategy that gives you both security and upside. As your net worth grows, overtime, the risk free percentage of your net worth gets smaller and smaller. Nobody Is Going to Follow My Recommended Risk-Free Percentages Despite the logic, very few people who believe they have enough money will follow this 20%–50% allocation guide. Why? Two reasons: Greed – We all want more money, especially more than our peers. An Unrealistic Fear of the Worst – We catastrophize worst-case scenarios that rarely happen. Ironically, these two emotions often lead us to take more risk than necessary in pursuit of money we don’t actually need. The result is usually working far longer than necessary and/or dying with far more money than we can ever spend. There’s also a positive reason many of the multi-millionaires I consult with give for why they keep grinding: the simple challenge of making more. They see it as a game—running up the score through productive efforts like building a business, gaining more clients, or conducting investment research and taking calculated risks. My Reason to Take More Risk: A Clear Forecast for Higher Expenses I left corporate America in 2012 because I believed $3 million was enough for my wife and me to live a modest lifestyle in expensive cities like San Francisco or Honolulu. And it was as we could comfortably live off $80,000 gross a year, the amount my investments were producing. The actual courage to leave was helped by negotiating a severance package that covered at least five years of normal living expenses. But instead of putting my roughly $2.7 million in investable assets (excluding home equity) into Treasury and municipal bonds, I chose to invest 98% in stocks and rental properties. At 34, I knew I was too young not to take risk—especially since we appeared to be recovering from the global financial crisis. I even dumped my entire six-figure severance check into a DJIA index structured note. Check the receipts. My wife also wanted to leave her job by age 35 in 2015, which added more pressure to grow our net worth. I also knew that having children would cause our annual expenses to balloon—especially if we stayed in San Francisco. Unsubsidized healthcare and preschool tuition alone could run an extra $4,000–$5,000 a month after tax. With a second child, our monthly costs could easily rise by another $3,000–$4,000. Putting the 20% – 50% Into Risk-Free Investments To The Test With a $3 million net worth, my recommended percentages into risk-free investments would be between $600,000 to $1.5 million. At a 4% rate of return, that would generate $24,000 – $60,000. Unfortunately, we wanted to live off $80,000 a year. Further, the risk-free rate was only about 1.6% at the time. Oh how lucky we are today. At 34, I simply wasn’t rich enough to comfortably retire. Covering $80,000 a year in pre-tax expenses through risk-free income at 4% would require allocating $2 million. That means, at a 20% allocation, I would’ve needed to retire with at least $10 million! So it seems that the low-end of my recommended risk-free investments range is still quite extreme. In hindsight, the most reasonable allocation to risk-free investments would have been 50%. To do that, I would have needed an extra $1 million in capital—raising my target net worth to $4 million. This makes sense because one of my biggest regrets about retiring early was doing so too early. If I could do it over again, I would have tried to transfer to another office and worked until age 40—just 5.5 more years. If I had, I would’ve reached at least a $4 million net worth by then, especially given how stocks and real estate continued to rise. But then again, I forget how miserable I was. Ah, being able to back up what I felt I should have done with objective math is a wonderful feeling! Instead of accumulating a $1 million greater net worth, I just spent time earning online income to make up for the phantom risk-free gross passive income gap of $20,000 – $56,0000 a year. It was an enjoyable and effective process, especially since I had the security blanket of a severance package. This 20%–50% risk-free allocation range is another way to calculate your financial independence number. With $80,000 in desired annual spending and a 4% safe withdrawal rate, my FI target ranged from $4 million to $10 million. Fear Of A Difficult Future Pushes Me To Continue Taking Risk Today, I could sell a large portion of my investments and move the proceeds into risk-free Treasury bonds to cover our desired living expenses. But the tax bill would be immense. Instead, I’d much rather allocate most of my new money I earn toward building up our risk-free investments. Of course, with my relatively low income, that will take time. So the first step was to sell one rental property and reposition some of the tax-free profits into Treasury bonds. While our investments are worth more than 25 times our annual household expenses, only about 5% of our net worth is currently allocated to risk-free or ultra-low-risk assets. Witnessing AI displace jobs and seeing kids with 1,590 SAT scores and 3.96 unweighted GPAs get rejected from nearly 90% of the colleges they apply to paints a bleak picture of the future for my children. As a result, I continue to take risks for them. Now that I’ve written this article, I should aim to increase that risk-free allocation to 30% by the time I turn 50 in 2027. Based on our current expenses and realistic net worth projections, this percentage feels achievable and appropriate. Having 70% of my net worth exposed to risk assets is more than enough to participate in greater upside potential. If I can make the asset allocation shift, I’ll let you know whether I finally feel 100% financially secure. Please run your own risk-free percentage allocation as well! Readers, how do you measure whether you truly have enough? Do you think people who say they have enough but continue working at a job they don’t enjoy are fooling themselves? What do you believe is the ideal percentage of your net worth to allocate to risk-free assets in order to confidently cover your living expenses for life? And why do you think we still take investment risks—even when, on paper, we already have enough? Suggestions To Build More Wealth For superior financial management, explore Empower, a remarkable wealth management tool I've trusted since 2012. Empower goes beyond basic budgeting, offering insights into investment fees and retirement planning. Best of all, it's completely free. If you want to achieve financial freedom sooner, pick up a copy of my USA TODAY? bestseller, Millionaire Milestones: Simple Steps To Seven Figures. It's packed with actionable advice to help you build more wealth than 90% of the population, so you can live free. To expedite your journey to financial freedom, join over 60,000 others and subscribe to the free Financial Samurai newsletter. Financial Samurai is among the largest independently-owned personal finance websites, established in 2009. Everything is written based on firsthand experience and expertise.",
  "image": "https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/06/ai-generated-9181825_1280.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-280918\" itemtype=\"https://schema.org/CreativeWork\" itemscope=\"itemscope\"\u003e\n\n\t\n\t\n\u003cdiv data-ast-blocks-layout=\"true\" itemprop=\"text\"\u003e\n\n\t\t\n\t\t\n\u003cp\u003eI recently received a question that boils down to this: How do you know when you have enough money? And once you do, when is it time to shift from chasing excess returns to simply maintaining what you have?\u003c/p\u003e\n\n\n\n\u003cp\u003eThere are several ways to approach this question, which I’ll explore in this post. I\u0026#39;ve come up with a framework that I think makes sense for those who think they truly have enough.\u003c/p\u003e\n\n\n\n\u003cp\u003eHere\u0026#39;s the question presented from a reader.\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eHi Sam,\u003c/p\u003e\n\n\n\n\u003cp\u003eI just finished your piece on \u003ca href=\"https://www.financialsamurai.com/hidden-dangers-of-earning-risk-free-passive-income/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003erisk-free passive income\u003c/a\u003e—really well done. A very accurate depiction of the trade-offs between the two approaches.\u003c/p\u003e\n\n\n\n\u003cp\u003eI have a question for you: You illustrate the comparison using a $5 million portfolio. I’m curious—at what wealth level does the appeal of building more wealth start to fade, and when does preserving capital with 2%–3% returns plus inflation protection become the primary objective?\u003c/p\u003e\n\n\n\n\u003cp\u003eI fully agree that wealth building is still relevant at the $5 million level. But what about at $10 million? $15 million? Or does it take more? Let’s assume a 3.75%–4% yield and inflation-beating dividend growth (say, via SCHD). Real estate could match this as well, but I question whether it truly qualifies as passive.\u003c/p\u003e\n\n\n\n\u003cp\u003eAt what point in the journey does playing defense and focusing on income stability outweigh the pursuit of more wealth? When is it time to stop chasing and just maintain?\u003c/p\u003e\n\n\n\n\u003cp\u003eThanks,\u003c/p\u003e\n\n\n\n\u003cp\u003eJim\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003ch2 id=\"h-the-elusive-concept-of-enough\"\u003eThe Elusive Concept of “Enough” \u003c/h2\u003e\n\n\n\n\u003cp\u003e“Enough” is subjective. For some, there’s never enough money—\u003cem\u003eenough\u003c/em\u003e is always a moving target, 2X more than what they think they want once they get there. \u003c/p\u003e\n\n\n\n\u003cp\u003eFor others, it might mean having 25X to 50X their annual expenses in investments, multiples I think are appropriate for 80% of people to answer what enough is. Spend $50,000 a year? You have enough if you have between $1.25 million – $2.5 million in investable assets. \u003c/p\u003e\n\n\n\n\u003cp\u003eI personally like using the inverse of the \u003ca href=\"https://www.financialsamurai.com/proper-safe-withdrawal-rate/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFS Withdrawal Rate\u003c/a\u003e as a guide. If the 10-year bond yield declines to 3%, then you\u0026#39;d divide $50,000 by 2.4% (3% X 80%) if you use my FS withdrawal rate to get to $2,083,333. My safe withdrawal rate is a dynamic safe withdrawal rate that changes with economic conditions. It helps families build generational wealth.\u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, I believe the best way to know you have enough money is this: \u003cstrong\u003eyou refuse to trade your time doing something you don’t fully enjoy for money.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eWhat you enjoy is, of course, also highly subjective. But it should be something you like doing at least 90% of the time or you feel at least 90% of the activity is enjoyable.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-real-test-will-you-walk-away\"\u003eThe Real Test: Will You Walk Away?\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe clearest indicator that you have enough money is your willingness to walk away from a job—or an activity—that drains you.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can rationalize your way into staying. You might tell yourself: \u003cem\u003e“I don’t need the money.”\u003c/em\u003e But if you’re still clocking in at a job you dislike, you’re not being honest. Time is more valuable than money, so if you really had enough, you wouldn’t be doing something you dislike.\u003c/p\u003e\n\n\n\n\u003cp\u003eNow, I know some of you who are financially independent on \u003cem\u003epaper\u003c/em\u003e will say, “But I love my job.” And that’s awesome. Seriously—you’ve hit the career lottery. Keep going. Nobody quits or \u003ca href=\"https://www.financialsamurai.com/the-dark-side-of-early-retirement-risks-dangers/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eretires early from a job they dislike\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut I also know many more are saying that out of fear—afraid to let go of a steady paycheck, afraid of losing structure or identity. And if that’s the case, I challenge you: muster the courage to engineer your layoff or find a path out. That’s when you’ll \u003cem\u003eknow\u003c/em\u003e you’ve reached enough.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-questions-to-ask-yourself-if-you-think-you-have-enough-money\"\u003e\u003cstrong\u003eQuestions to Ask Yourself \u003c/strong\u003eIf You Think You Have Enough Money\u003c/h2\u003e\n\n\n\n\u003cp\u003eTo help determine whether you have the courage to stop doing something you don’t enjoy just for the money, ask yourself:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eWould you rather take care of your baby during their precious first year of life, or sit in endless meetings every day?\u003c/li\u003e\n\n\n\n\u003cli\u003eCommute during rush hour, or sleep in and \u003ca href=\"https://www.financialsamurai.com/millionaire-milestones-book/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eread a good book\u003c/a\u003e?\u003c/li\u003e\n\n\n\n\u003cli\u003eWork late for a month to finish a project, or spend that time playing with your kids or helping them with schoolwork?\u003c/li\u003e\n\n\n\n\u003cli\u003eTravel for business for weeks at a time, or care for an aging parent with health issues?\u003c/li\u003e\n\n\n\n\u003cli\u003eMeet monthly and quarterly sales quotas, or play pickleball in the late morning and take a nap after?\u003c/li\u003e\n\n\n\n\u003cli\u003ePlay corporate politics to get promoted, or enjoy the freedom to be your true self and only spend time with people you like?\u003c/li\u003e\n\n\n\n\u003cli\u003eFly out on a Sunday afternoon for a Monday morning client meeting, or travel the world with no set return date?\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eIf given the choice, who with enough money would honestly choose the work option in any of these scenarios?\u003c/p\u003e\n\n\n\n\u003cp\u003eYour \u003ca href=\"https://www.financialsamurai.com/financial-independence-number-is-not-real-if-nothing-changes/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003efinancial independence number is not real\u003c/a\u003e if you continue to subject yourself to displeasure after getting there.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-when-is-it-time-to-stop-chasing-more-wealth-and-just-maintain\"\u003e\u003cstrong\u003eWhen Is It Time To Stop Chasing More Wealth and Just Maintain?\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eOnce you have enough money, logic would dictate that you no longer need to take financial risks. Instead, you could simply invest your entire net worth into risk-free or low-risk investments that at least keep up with inflation.\u003c/p\u003e\n\n\n\n\u003cp\u003eThese types of investments that generate risk-free income include:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eMoney market funds\u003c/strong\u003e (though yields may not always match or beat inflation)\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eTreasury bonds\u003c/strong\u003e (yields are generally higher than inflation)\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eAAA municipal bonds\u003c/strong\u003e (nearly risk-free and usually yield more than inflation)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eThe reality, however, is that stocks and real estate have historically been the best-performing asset classes when it comes to beating inflation over the long term. Cryptocurrency—specifically Bitcoin—is also a contender. But as we all know, none of these are risk-free.\u003c/p\u003e\n\n\n\n\u003ch2\u003eDivide Your Wealth Into Risk-Free and Risk-Required Buckets\u003c/h2\u003e\n\n\n\n\u003cp\u003eIf you truly believe you have enough money, the best strategy is to allocate a portion of your net worth into completely risk-free or low-risk investments. This bucket should generate enough \u003ca href=\"https://www.financialsamurai.com/ranking-the-best-passive-income-investments/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003epassive income\u003c/a\u003e to cover 100% of your living expenses. In other words, ringfence a portion of your net worth that will take care of you for life, no matter what happens.\u003c/p\u003e\n\n\n\n\u003cp\u003eOnce you’ve secured this financial base, you can then invest the remainder of your wealth in riskier assets for potentially greater returns, without the stress of needing those returns to survive. Think about this portion of your investments as playing with the house’s money.\u003c/p\u003e\n\n\n\n\u003ch3\u003eA \u003ca href=\"https://www.financialsamurai.com/what-is-fat-fire-best-way-to-retire-early/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFat FIRE\u003c/a\u003e Example:\u003c/h3\u003e\n\n\n\n\u003cp\u003eLet’s say your desired annual household spending is $400,000. You’re fortunate to have a \u003ca href=\"https://www.financialsamurai.com/top-one-percent-net-worth-amounts-by-age/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003etop 1% net worth\u003c/a\u003e of $14 million. At a 4% safe withdrawal rate, you’d allocate \u003cstrong\u003e$10 million ($400,000 / 0.04)\u003c/strong\u003e into Treasury bonds yielding over 4% or similarly safe investments.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can then invest the remaining \u003cstrong\u003e$4 million\u003c/strong\u003e into stocks, real estate, \u003ca href=\"https://www.financialsamurai.com/venture-capital-funds-beats-investing-in-individual-companies/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eventure\u003c/a\u003e, crypto, or any risk asset you want. Even if you lose half—or all—of this risk bucket, your lifestyle remains fully supported by your safe assets. Thankfully, most investments don’t go to zero and actually make you money over time.\u003c/p\u003e\n\n\n\n\u003ch3\u003eA \u003ca href=\"https://www.financialsamurai.com/what-is-lean-fire-the-minimalists-way-to-retire-early/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLean FIRE\u003c/a\u003e Example:\u003c/h3\u003e\n\n\n\n\u003cp\u003eLet’s say you and your spouse have no children and are content spending $50,000 gross a year. Your net worth is $1.5 million. At a 4% safe withdrawal rate, you would allocate \u003cstrong\u003e$1.25 million\u003c/strong\u003e to risk-free or low-risk investments, and invest the remaining \u003cstrong\u003e$250,000\u003c/strong\u003e in riskier assets for possible upside.\u003c/p\u003e\n\n\n\n\u003cp\u003eNow, of course, allocating 83.3% of your net worth to safe assets might seem extreme. But if you’re truly satisfied with what you have, then this asset allocation makes perfect sense. Especially when the Treasury yield is greater than inflation, as it often is—since inflation helps determine bond yields in the first place.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you\u0026#39;re uncomfortable with such a conservative approach, then perhaps you don’t actually feel like you have enough. On paper, you might be financially independent, but \u003cem\u003eemotionally and psychologically\u003c/em\u003e, you\u0026#39;re not there yet. \u003c/p\u003e\n\n\n\n\u003cp\u003eYou\u0026#39;re still willing to risk losing money for the chance of having more that you want or think you need. Or you\u0026#39;re still encouraging your spouse to work or you\u0026#39;re still working hard on generating supplemental income. \u003c/p\u003e\n\n\n\n\u003cp\u003eAnd that’s OK. Just be honest with yourself about whether you truly have enough.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-ideal-percentage-of-your-net-worth-in-risk-free-assets\"\u003eThe Ideal Percentage of Your Net Worth in Risk-Free Assets\u003c/h2\u003e\n\n\n\n\u003cp\u003eYou might think the ideal situation is being able to allocate the \u003cem\u003esmallest\u003c/em\u003e percentage of your net worth to risk-free assets while still being able to cover your desired living expenses. The lower the percentage, the richer you appear to be. But having too small a percentage in risk-free assets might also suggest you\u0026#39;re overly frugal or not generous enough with your time and wealth. \u003c/p\u003e\n\n\n\n\u003cp\u003eFor example, let’s say you have a \u003ca href=\"https://www.financialsamurai.com/10-million-dollars-the-ideal-net-worth-amount-for-retirement/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e$10 million net worth\u003c/a\u003e, the ideal net worth to retire according to a previous FS survey, and only spend $40,000 in gross income a year. At a 4% rate of return, you’d only need to allocate 10%—or $1 million—into risk-free investments to cover your expenses. But what’s the point of having $10 million if you’re only living off 10% of it? You could have saved all the stress and energy slaving away when you were younger.\u003c/p\u003e\n\n\n\n\u003cp\u003eSure, investing the remaining $9 million in risk assets to potentially double it in 10 years sounds exciting. But again, what’s the point if you\u0026#39;re not spending it or using it to help others? Money should be spent or given away before we die.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-a-more-balanced-approach-20-50-in-risk-free-investments\"\u003eA More Balanced Approach: 20%–50% In Risk-Free Investments\u003c/h2\u003e\n\n\n\n\u003cp\u003eOnce you have enough, the ideal percentage of your net worth in risk-free assets is somewhere around \u003cstrong\u003e20% to 50%\u003c/strong\u003e. Within this range, you\u0026#39;re likely spending enough to enjoy the fruits of your labor—say, $80,000 to $200,000 a year, continuing the earlier example. At the same time, you still have a significant portion of your net worth—50% or more—invested in risk assets that have historically outpaced inflation.\u003c/p\u003e\n\n\n\n\u003cp\u003eEven if you no longer \u003cem\u003eneed\u003c/em\u003e more money, it would be unwise to bet against the long-term returns of stocks, real estate, and other growth assets. And if your risk investments do well, you can always use the extra gains to support your children, grandchildren, friends, relatives, or organizations in need.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen in doubt, split the difference: \u003cstrong\u003e50% risk-free, 50% risk assets\u003c/strong\u003e. It’s a balanced, emotionally comforting strategy that gives you both security and upside. As your net worth grows, overtime, the risk free percentage of your net worth gets smaller and smaller. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-nobody-is-going-to-follow-my-recommended-risk-free-percentages\"\u003eNobody Is Going to Follow My Recommended Risk-Free Percentages\u003c/h2\u003e\n\n\n\n\u003cp\u003eDespite the logic, very few people who believe they have enough money will follow this 20%–50% allocation guide. Why? Two reasons:\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003e\u003cstrong\u003eGreed\u003c/strong\u003e – We all want more money, especially more than our peers.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eAn Unrealistic Fear of the Worst\u003c/strong\u003e – We catastrophize worst-case scenarios that rarely happen.\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eIronically, these two emotions often lead us to take more risk than necessary in pursuit of money we don’t actually need. The result is usually working far longer than necessary and/or dying with far more money than we can ever spend.\u003c/p\u003e\n\n\n\n\u003cp\u003eThere’s also a positive reason many of the multi-millionaires \u003ca href=\"https://www.financialsamurai.com/career-personal-finance/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eI consult with\u003c/a\u003e give for why they keep grinding: the simple challenge of making more. They see it as a game—running up the score through productive efforts like building a business, gaining more clients, or conducting investment research and taking calculated risks.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-my-reason-to-take-more-risk-a-clear-forecast-for-higher-expenses\"\u003eMy \u003cstrong\u003eReason to Take More Risk: A Clear Forecast for Higher Expenses\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eI left corporate America in 2012 because I believed $3 million was enough for my wife and me to live a modest lifestyle in expensive cities like San Francisco or Honolulu. And it was as we could comfortably live off $80,000 gross a year, the amount my investments were producing. The actual courage to leave was helped by \u003ca href=\"https://www.financialsamurai.com/how-to-make-money-quitting-your-job-2/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003enegotiating a severance package\u003c/a\u003e that covered at least five years of normal living expenses.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut instead of putting my roughly $2.7 million in investable assets (excluding home equity) into Treasury and municipal bonds, I chose to invest 98% in stocks and rental properties. At 34, I knew I was too young \u003cem\u003enot\u003c/em\u003e to take risk—especially since we appeared to be recovering from the global financial crisis. I even dumped my entire six-figure severance check into a \u003ca href=\"https://www.financialsamurai.com/understanding-structured-derivative-products-cdsnote-as-an-investment/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDJIA index structured note\u003c/a\u003e. Check the receipts.\u003c/p\u003e\n\n\n\n\u003cp\u003eMy wife also wanted to leave her job by age 35 in 2015, which added more pressure to grow our net worth. I also knew that having children would cause our annual expenses to balloon—especially if we stayed in San Francisco. Unsubsidized healthcare and preschool tuition alone could run an extra $4,000–$5,000 a month after tax. With a second child, our monthly costs could easily rise by another $3,000–$4,000.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-putting-the-20-50-into-risk-free-investments-to-the-test\"\u003ePutting the 20% – 50% Into Risk-Free Investments To The Test\u003c/h3\u003e\n\n\n\n\u003cp\u003eWith a $3 million net worth, my recommended percentages into risk-free investments would be between $600,000 to $1.5 million. At a 4% rate of return, that would generate $24,000 – $60,000. Unfortunately, we wanted to live off $80,000 a year. Further, the risk-free rate was only about 1.6% at the time. Oh how lucky we are today.\u003c/p\u003e\n\n\n\n\u003cp\u003eAt 34, I simply wasn’t rich enough to comfortably retire. Covering $80,000 a year in pre-tax expenses through risk-free income at 4% would require allocating $2 million. That means, at a 20% allocation, I would’ve needed to retire with at least $10 million! So it seems that the low-end of my recommended risk-free investments range is still quite extreme.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn hindsight, the most reasonable allocation to risk-free investments would have been 50%. To do that, I would have needed an extra $1 million in capital—raising my target net worth to $4 million. \u003c/p\u003e\n\n\n\n\u003cp\u003eThis makes sense because one of my \u003ca href=\"https://www.financialsamurai.com/if-i-could-retire-all-over-again-these-are-the-things-id-do-differently/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ebiggest regrets about retiring early\u003c/a\u003e was doing so too early. If I could do it over again, I would have tried to transfer to another office and worked until age 40—just 5.5 more years. If I had, I would’ve reached at least a $4 million net worth by then, especially given how stocks and real estate continued to rise. But then again, I forget how miserable I was.\u003c/p\u003e\n\n\n\n\u003cp\u003eAh, being able to back up what I \u003cem\u003efelt\u003c/em\u003e I should have done with objective math is a wonderful feeling! Instead of accumulating a $1 million greater net worth, I just spent time \u003ca href=\"https://www.financialsamurai.com/reflections-on-making-money-online-since-2009/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eearning online income\u003c/a\u003e to make up for the phantom risk-free gross passive income gap of $20,000 – $56,0000 a year. It was an enjoyable and effective process, especially since I had the security blanket of a severance package.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis 20%–50% risk-free allocation range is another way to calculate your financial independence number. With $80,000 in desired annual spending and a 4% safe withdrawal rate, my FI target ranged from $4 million to $10 million.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-fear-of-a-difficult-future-pushes-me-to-continue-taking-risk\"\u003eFear Of A Difficult Future Pushes Me To Continue Taking Risk\u003c/h2\u003e\n\n\n\n\u003cp\u003eToday, I could sell a large portion of my investments and move the proceeds into risk-free Treasury bonds to cover our desired living expenses. But the tax bill would be immense. \u003c/p\u003e\n\n\n\n\u003cp\u003eInstead, I’d much rather allocate most of my \u003cem\u003enew money\u003c/em\u003e I earn toward building up our risk-free investments. Of course, with my relatively low income, that will take time. So the first step was to \u003ca href=\"https://www.financialsamurai.com/why-it-can-make-sense-to-sell-your-rental-property-even-if-youre-bullish/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003esell one rental property\u003c/a\u003e and reposition some of the tax-free profits into Treasury bonds.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile our investments are worth more than 25 times our annual household expenses, only about 5% of our net worth is currently allocated to risk-free or ultra-low-risk assets. Witnessing \u003ca href=\"https://www.financialsamurai.com/safeguarding-your-future-from-ai-existential-crisis-playbook/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAI displace jobs\u003c/a\u003e and seeing kids with 1,590 SAT scores and 3.96 unweighted GPAs get rejected from nearly 90% of the colleges they apply to paints a bleak picture of the future for my children. As a result, I continue to take risks for them.\u003c/p\u003e\n\n\n\n\u003cp\u003eNow that I’ve written this article, I should aim to \u003cstrong\u003eincrease that risk-free allocation to 30%\u003c/strong\u003e by the time I turn 50 in 2027. Based on our current expenses and realistic net worth projections, this percentage feels achievable and appropriate. Having 70% of my net worth exposed to risk assets is more than enough to participate in greater upside potential.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf I can make the asset allocation shift, I’ll let you know whether I finally \u003cem\u003efeel\u003c/em\u003e 100% financially secure. Please run your own risk-free percentage allocation as well!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eReaders, how do you measure whether you truly have enough? Do you think people who say they have enough but continue working at a job they don’t enjoy are fooling themselves? What do you believe is the ideal percentage of your net worth to allocate to risk-free assets in order to confidently cover your living expenses for life? And why do you think we still take investment risks—even when, on paper, we already have enough?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch2 id=\"m_5445711901278710641gmail-h-subscribe-to-financial-samurai\"\u003eSuggestions To Build More Wealth\u003c/h2\u003e\n\n\n\n\u003cp\u003eFor superior financial management, explore \u003cstrong\u003e\u003ca href=\"https://www.financialsamurai.com/empower\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003eEmpower\u003c/a\u003e\u003c/strong\u003e, a remarkable wealth management tool I\u0026#39;ve trusted since 2012. Empower goes beyond basic budgeting, offering insights into investment fees and retirement planning. Best of all, it\u0026#39;s completely free.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you want to achieve financial freedom sooner, pick up a copy of my USA TODAY? bestseller, \u003cstrong\u003e\u003ca href=\"https://www.amazon.com/Millionaire-Milestones-Simple-Steps-Figures/dp/0593714709?_encoding=UTF8\u0026amp;dib_tag=se\u0026amp;dib=eyJ2IjoiMSJ9.izkGqbD4PEdYF4MLrr_xA06iZ_EoRUgVdVUumS2a8EAxY86zhzttj8No6Q4bOhddtD7Q9RRIoxczZfBJUF0pEcYGW7_O8rm_vjSMDX90uazo5l1ged1ONU1Pi383hUcrPSgBkq3-RvToTvijEbErraUtRdzOxjlcsFOeRRoa8FRyWes44cp7RaFSRgpYJ0Jy7xsa34o2VLBCGcvp02jSOtOLEMo3fRB6xAe7ozVoNYQ.qFnMqnSCyqk4qu9RswtFWfumODinIclo1eCFFQ5yjYY\u0026amp;qid=1732554720\u0026amp;sr=8-1\u0026amp;linkCode=sl1\u0026amp;tag=fsamurai-20\u0026amp;linkId=f5325663a0b9e27f52540f478554ceee\u0026amp;language=en_US\u0026amp;ref_=as_li_ss_tl\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003eMillionaire Milestones: Simple Steps To Seven Figures\u003c/a\u003e\u003c/strong\u003e. It\u0026#39;s packed with actionable advice to help you build more wealth than 90% of the population, so you can live free. \u003c/p\u003e\n\n\n\n\u003cp\u003eTo expedite your journey to financial freedom, join over 60,000 others and subscribe to the \u003cstrong\u003e\u003ca href=\"https://www.financialsamurai.com/news\" target=\"_blank\" rel=\"noreferrer noopener\"\u003efree Financial Samurai newsletter\u003c/a\u003e\u003c/strong\u003e. Financial Samurai is among the largest independently-owned personal finance websites, established in 2009. Everything is written based on firsthand experience and expertise.\u003c/p\u003e\n\n\t\t\n\t\t\n\t\t\t\u003c/div\u003e\n\n\t\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "18 min read",
  "publishedTime": "2025-06-09T11:18:00Z",
  "modifiedTime": "2025-06-09T16:34:42Z"
}
