{
  "id": "68494cc6-bbb3-4bde-94e9-79ae0dd42e12",
  "title": "Weekend Reading For Financial Planners (July 26–27)",
  "link": "https://feeds.feedblitz.com/~/922192886/0/kitcesnerdseyeview~Weekend-Reading-For-Financial-Planners-July-%e2%80%93/",
  "description": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that Charles Schwab's annual RIA benchmarking study found that median firm AUM increased 16.6% in 2024, with revenue up by 17.6%. While some of these gains can be attributed to strong market performance, firms also boostedRead More... The post Weekend Reading For Financial Planners (July 26–27) first appeared on Kitces.com.",
  "author": "Adam Van Deusen",
  "published": "Fri, 25 Jul 2025 18:00:17 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Weekend Reading",
    "OPTIN: Value Of Advice (BAR)",
    "OPTIN: Value Of Advice (SLIDE IN)"
  ],
  "byline": "Adam Van Deusen",
  "length": 38233,
  "excerpt": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that Charles Schwab's annual RIA benchmarking study found that median firm AUM increased 16.6% in 2024, with revenue up by 17.6%. While some of these gains can be attributed to strong market performance, firms also boosted",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that Charles Schwab's annual RIA benchmarking study found that median firm AUM increased 16.6% in 2024, with revenue up by 17.6%. While some of these gains can be attributed to strong market performance, firms also boosted their organic growth during the year, with firms with less than $250M AUM showing 9.2% net organic growth and larger firms seeing 5.0% growth (while RIAs as a whole also maintained a 97% client retention rate). In the report, Schwab also identified key traits of \"top performing\" firms (including having a defined ideal client persona and a defined client value proposition) and the key strategic initiatives respondents plan to pursue (with generating client referrals topping the list for the third consecutive year, followed by recruiting new staff). Also in industry news this week: A recent report highlights the rapid growth of RIA \"consolidators\", with advisors seeking them out for compliance and succession support, though concerns about a potential loss of autonomy and independence from joining one remain The Treasury has delayed until 2028 the effective date for a proposed Anti-Money Laundering (AML) rule that would have affected most SEC-registered RIAs and plans to revisit the substance of the rule to perhaps tailor it more specifically to focus on businesses that face the greatest AML risk From there, we have several articles on tax planning: The One Big Beautiful Bill Act (OBBBA) has made the Section 199A tax deduction permanent (i.e., without a scheduled sunset date), potentially benefiting not only business-owner clients but also those who own REITs in their portfolios as well The OBBBA has also made permanent the Qualified Opportunity Zone program (albeit with a narrower scope and updated rules), providing some clients with the chance to defer gains on the sale of certain investment property How charitable planning considerations might change under the OBBBA, from the new 0.5% AGI 'floor' on the deductibility of charitable contributions that starts in 2026 to the ability of non-itemizers to potentially get a tax benefit for (at least some of) their charitable gifts We also have a number of articles on retirement planning: How financial advisors can help clients explore their funding options amidst an expected increase in the costs of long-term care in the coming years The planning considerations surrounding unpaid care, from the benefits of creating a formalized care plan well in advance of a need to cash flow planning for younger clients who might be responsible for (unpaid) caregiving in the future An analysis of the options for advisors and their clients who face a premium increase on their long-term care insurance policies We wrap up with three final articles, all about travel: Why flexibility is the key to saving on flights, from flying on less popular days of the week to traveling during \"shoulder season\" How State Department employees created an online system that allows many Americans to renew their passports online in as little as 15 minutes (and achieved overwhelmingly positive reviews in the process) Amidst crowding in many airport lounges, some airlines and credit card companies are looking to open smaller lounges offering more casual, grab-and-go options for their customers Enjoy the 'light' reading! Adam is a Financial Planning Nerd at Kitces.com. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits. Read more of Adam’s articles here. Schwab's Latest RIA Benchmarking Study Shows Organic Growth Success, Hiring Needs On Horizon (Alec Rich | Citywire RIA) After experiencing a rocky market environment in 2022, RIAs and their clients saw a bounce-back year in 2023 as strong equity market performance buoyed client portfolios (and firm Assets Under Management [AUM]). While 2024 also saw strong market returns (further boosting AUM), a key question is whether firms also were able to also grow organically (i.e., adding new clients or additional assets from current clients), which could help insulate their AUM (and revenue, if charging on an AUM basis) in the face of a future market downturn. According to Charles Schwab's latest annual RIA Benchmarking Study, median firm AUM increased 16.6% in 2024, with revenue up by 17.6%. Looking at organic growth by firm size, those with more than $250 million in AUM had median net organic growth rise 5.0% in 2024 (up from 4.9% in 2023) while those with under $250 million in AUM showed 9.2% net organic growth (up from 7.8% in 2023). Further, client retention remained at 97%, where it has stood for the past decade, demonstrating the continued 'stickiness' of client relationships with RIAs. Looking under the hood, Schwab identified factors that separated its \"top performing\" RIAs (i.e., those in the top 20% of Schwab's Firm Performance Index, which looks across 15 metrics) from other firms. These included having an ideal client persona or profile (with 82% of top performing firms having one, compared to 73% of other firms with more than $250 million in AUM and 57% of smaller firms), having a documented client value proposition (81% of top-performing firms, compared to 71% of other larger firms and 47% of smaller firms), and a documented marketing plan (with 58% of top performing firms having one, compared to 52% of other larger firms and 32% of smaller firms). Firms with all three of these features in place gained 67% more clients and 68% more new client assets in 2024 compared to other firms, according to the study. In terms of top strategic initiatives for the RIAs surveyed, acquiring new clients through client referrals topped the list for the third consecutive year, followed by recruiting staff to increase the firm's skill set and capacity (up from third place last year), and acquiring new clients through business referrals. Notably, while hiring appears to remain a top priority (with 78% of firms surveyed making at least one hire in 2024, the highest mark since 2021), developing the skills and capabilities of staff ranked eighth in the list of strategic initiatives, down from fifth place last year (potentially leading to frustrations among some staff if they feel their firm is more invested in bringing on new employees and less invested in developing their skills?). Ultimately, the key point is that RIAs saw AUM growth in 2024 not only due to market appreciation, but also thanks to their organic growth efforts (and continued high client retention). Further, using the benchmarking study data to take stock of the key practices that separate top-performing firms identified in the study from others (from narrowing in on an ideal client persona to creating a documented marketing plan), and considering how (and whether) they might fit within their own practice, could help firms continue their client and AUM growth through future bull and bear markets! Amidst Growth Of RIA \"Consolidators\", Advisors Looking For Compliance, Tech, Succession Support: Cerulli (Diana Britton | WealthManagement) In recent years, many advisors have left larger wirehouses and broker-dealer platforms to either join an existing RIA or start one of their own. Typically, these RIAs are much smaller than the larger firms they left, offering an increased level of independence and flexibility. The caveat, however, is that when they leave their support infrastructure behind, advisors starting their own firms have to build all that operations, tech, and compliance framework themselves. Which for advisors who ultimately want to focus most on serving clients, can be challenging… and seems now to be leading both to the rise of various \"supported independence\" platforms, along with advisors who change their minds and decide maybe it would be better to be part of a larger platform after all and choose to merge themselves into one of the so-called “RIA consolidators” (i.e., large RIAs active in acquiring smaller firms, often fueled by capital from private equity firms). And the trend seems to be accelerating. According to research and consulting firm Cerulli Associates, 12,000 advisors were affiliated with these \"consolidators\" as of 2023, up from just 4,000 in 2018. Among advisors surveyed by Cerulli, the top services provided by consolidators include compliance guidance and ongoing support (cited by 58%), and an integrated tech platform (55%), along with helping advisors to solve their succession planning needs (50%). Notably, while consolidators can often provide advisors centralized investment platforms (given their scale), only 25% of advisors surveyed by Cerulli cited this as a top service, as ironically the availability of technology (e.g., model management/rebalancing software) has made this less of a pain point for advisors than in the past. On the other hand, the most common concerns cited by respondents about joining a consolidator firm included a loss of autonomy (52%) and independence (51%), the practical challenges of transitioning operations (45%), potential for client resistance to the move (36%), and lost revenue during the transition period (30%). In the end, advisory firms have a range of options when looking for increased support as they seek to size up and scale (e.g., joining a larger firm to access its resources and economies of scale or working with a “supported independence” platform) or explore their succession planning options (e.g., navigating an internal succession or looking for an external partner for a sale), and it appears that RIA consolidators will remain viable options for both of these groups in the years ahead. Which means many advisors who might have started in the wirehouse or broker-dealers channels and become an independent RIA may ultimately find that they end up within a large organization (for better or worse) yet again… though given that there have always been a subset of advisors who prefer to leverage existing infrastructure rather than building their own (thus the success of wirehouses and independent broker-dealers in the first place), perhaps RIA consolidators are less of a “new” trend and more simply the RIA channel replicating the various types of support structures that already existed in the broker-dealer channel? Treasury Delays AML Rule For Advisors To Conduct \"Broad Review\" (Melanie Waddell | ThinkAdvisor) Under the Bank Secrecy Act (BSA), banks and other major financial institutions are required to fulfill certain \"Know Your Customer\" (KYC) requirements to prevent criminals, terrorists, and other unsavory actors from using the financial system to pursue their illicit ends. Notably, though, despite managing billions of dollars in assets (and potentially being an attractive medium for illicit actors to park or invest their money), investment advisers have not been on the list of financial institutions under the BSA. To address this gap, the (Biden-era) Treasury Department last August finalized new rules that would add certain SEC-registered RIAs and those reporting to the SEC as exempt reporting advisers (though notably not state-registered RIAs or certain SEC-registered RIAs with less than $100M of AUM), as well as residential real estate advisors, to the list of \"financial institutions\" under the BSA and would require them to implement risk-based Anti-Money Laundering and Countering the Financing of Terrorism (AML/CFT) programs, including a requirement to report suspicious activity to Treasury's Financial Crimes Enforcement Network (FinCEN). Further, affected RIAs would have to conduct an ongoing customer due diligence program that includes developing a customer risk profile and conducting ongoing monitoring to identify and report suspicious transactions. However, following the change in presidential administrations, the Treasury Department announced this week that it has postponed the effective date for the AML rule (from January 1, 2026 to January 1, 2028) to \"ensure efficient regulation that appropriately balances costs and benefits\" as \"the rule must be effectively tailored to the diverse business models and risk profiles of the investment advisor sectors\" (as critiques the rule [including from the Investment Adviser Association (IAA)] suggested that many RIAs are at low risk for facilitating money laundering and that the rule's requirements would be burdensome and potentially duplicative). Treasury said that its Financial Crimes Enforcement Network (FinCEN) will revisit the substance of the AML rule as well as the proposed rule establishing customer identification program requirements for advisers (which, combined with the delayed effective date, received praise from the IAA). In sum, affected financial advisory firms appear to have until at least 2028 to implement measures within a (likely revised) AML rule (which would have otherwise added additional compliance and paperwork obligations for certain RIAs). Nevertheless, amidst potential threats from criminals looking to abuse the financial system, advisers offering comprehensive planning services (as well as their investment custodians) are likely already conducting a certain level due diligence on their clients, as understanding their background and circumstances is an important part of preparing a financial plan. Which could be a 'defense mechanism' for these firms against criminals, as these actors might instead try to park their money with more investment-centric advisers and fund managers that spend less time getting to know their clients? OBBBA Makes Permanent Section 199A Tax Deduction – Benefitting Business Owners And REIT Stockholders (David Bodamer | WealthManagement) The 2017 Tax Cuts and Jobs Act (TCJA) created a major new tax deduction for pass-through business owners (i.e., sole proprietorships, partnerships, and S corporations) with the Section 199A deduction for Qualified Business Income (QBI). In short, Section 199A allows eligible business owners to deduct up to 20% of the lesser of their QBI from qualifying pass-through businesses or their total taxable income (minus net capital gains). The Section 199A deduction was one of several measures within the TCJA that was scheduled to sunset at the end of 2025, but under the One Big Beautiful Bill Act (OBBBA) has been made 'permanent' (i.e., with out a scheduled sunset date) with relatively minor changes, providing added certainty to business owners that the deduction will continue for the foreseeable future. While many of the headlines surrounding this measure focus on the QBI deduction for business owners, the Section 199A deduction also includes a component for dividends from REITs (Real Estate Investment Trusts). Which means that a much wider group of clients could benefit from this deduction (as they might hold individual REITs, REIT funds, or even REITs within more diversified funds). For instance (given that most REIT dividends are taxed as ordinary income), with the deduction those in the 32% tax bracket could see their REIT dividends taxed at a 25.6% rate. Ultimately, the key point is that while many business-owner clients will continue to benefit from the now-'permanent' QBI deduction, a broader swath of clients will likely see a reduction in their taxes thanks to the deduction as well (even if they don't think they 'run' a business!). Further, because this deduction narrows the gap between REITs (which have historically been seen as tax-inefficient given their significant amounts of taxable distributions treated as ordinary income) and other investments, advisors could offer value for clients by revisiting their asset location strategy to ensure different types of assets are in the optimal location [i.e., taxable versus retirement accounts] for tax efficiency, liquidity, or other goals. Opportunity Zones Made Permanent Under OBBBA, With Narrower Scope And Updated Rules (Elaine Misonzhnik | WealthManagement) The 2017 Tax Cuts and Jobs Act (TCJA) created a new type of investment known as a Qualified Opportunity Fund (QOF). These funds allowed investors to pool capital into Qualified Opportunity Zones (QOZs), which are low-income geographic areas designated by state governments. QOFs offered the potential for significant tax benefits, particularly for high-income investors. Individuals could sell appreciated investment property (e.g., stocks, funds, or real estate) and reinvest the gains into a QOF. That gain would then be deferred until the earlier of December 31, 2026, or the date the QOF was sold or exchanged. Which effectively allowed for up to eight years of gain deferral for QOFs created in 2018. Now, Section 70421 of the One Big Beautiful Bill Act (OBBBA) creates a more permanent version of the QOF program, but with a narrower scope and updated rules. Under the new measure, states will be allowed to designate a new round of QOZs every 10 years starting in 2026. The definition of low-income areas will be slightly more restrictive: qualifying communities must have a median income below 70% of the median income for the state or metropolitan area where they're located, rather than 80% under the original law). Starting in 2027, investors can defer capital gains by reinvesting them into a QOF, with deferral lasting until the earlier of when the property is sold or exchanged or five years after the original investment. As with the original program, investors who hold a QOF for at least five years will receive a 10% basis step-up on the deferred gain. However, investments in a QOF that invests at least 90% of its assets in rural QOZ property would receive a 30% step-up. In contrast to the original QOZ program, there is no additional 5% step-up for QOFs held for more than seven years. As before, any gains attributable to the original deferred gain will be excluded from taxation if the QOF is held for more than 10 years – though any further gains after 30 years would become taxable. Notably, all of these proposed changes apply only to new QOF investments made starting in 2027. For existing investors whose deferred gains are scheduled to be recognized in 2026, there's no way to extend that deferral further; those gains would still become taxable as planned. Amidst this backdrop, some industry observers believe there could be a continued slowdown in opportunity zone fundraising until the new measures come into effect in 2027, at which point there could be a spike in opportunities as investors look to take advantage of the updated rules. In sum, the OBBBA offers clients selling investments with significant embedded gains a continued opportunity to defer those gains through investment in QOFs. Nevertheless, while such an 'opportunity' might be attractive to certain clients, advisors can provide value by evaluating other options for tax deferral (e.g., 1031 exchanges or 351 exchanges) as well and recommending the most appropriate option for the client's tax situation and financial goals. Charitable Planning Considerations For Advisors And Their Clients Post-OBBBA (Martin Shenkman | Forbes) For charitably inclined financial planning clients, the ability to support worthy organizations is often their primary motivation for donating money or assets. Nevertheless, given various tax incentives for charitable giving, advisors have long supported clients by creating a tax-optimized charitable giving strategy for them (that could ultimately allow the client to increase the size of their donations!). Notably, the 2017 Tax Cuts and Jobs Act (TCJA) shook up the tax considerations for charitable giving in part by dramatically increasing the standard deduction (which meant that fewer individuals would have sufficient itemized deductions [including charitable gifts] to surpass the standard deduction). And now, the One Big Beautiful Bill Act (OBBBA) makes 'permanent' (i.e., without a scheduled sunset date) the higher standard deduction (which was otherwise scheduled to sunset at the end of 2025), which will be $15,570 for single filers and $31,500 for joint filers. Which means that many of the strategies advisors have recommended to clients to maximize tax savings from their charitable giving (e.g., 'clumping' charitable gifts into the same year to exceed the standard deduction level, for instance by making a gift to a donor-advised fund that could then be granted to individual charities over time) could remain particularly useful going forward (though, thanks to the increased State And Local Tax [SALT] cap under OBBBA, taxpayers with significant SALT burdens could find themselves more likely to itemize in the years ahead anyway). Another new consideration for charitable giving is the introduction of a floor on the deductibility of charitable contributions of 0.5% of Adjusted Gross Income (AGI) starting in 2026. This means that deductions are only allowed to the extent an individual's otherwise-deductible contributions exceed 0.5% of their AGI (potentially making it beneficial to make anticipated charitable gifts in 2025 before the 0.5%-of-AGI floor takes effect in 2026). For those whose itemized deductions fall well short of their standard deduction, Section 70424 of OBBBA offers a charitable deduction for non-itemizers starting in 2026, with a maximum deduction of $1,000 for single filers and $2,000 for joint filers, allowing clients taking the standard deduction to gain some tax benefit from their charitable giving (though, importantly, qualifying charitable contributions must be in cash [i.e., no other types of property like household goods or securities] and cannot be made to Section 509(a)(3) \"supporting organizations\" or used to establish or maintain a donor-advised fund). Altogether, the OBBBA introduces new considerations for advisors and their clients looking to make charitable gifts in the most tax-efficient way possible, offering an opportunity for advisors to add value by assessing the options and benefits available to a client given their income and other itemized deductions, implementing potentially valuable strategies (e.g., charitable clumping, donating appreciated securities, and/or Qualified Charitable Distributions) where appropriate, and, perhaps more broadly, having regular conversations with clients to better understand their goals for charitable giving and create a long-term plan for making them come to fruition. Helping Clients Get Ahead Of A 'Perfect Storm' Poised To Raise Long-Term Care Costs (Mark Miller | Morningstar) With the number of Americans aged 65 and older projected to surge from 56.1 million in 2020 to 80.8 million in 2040, the number of individuals requiring long-term care services is almost certain to increase as well. Notably, this surge in demand for long-term care services could contribute to increased costs as well (e.g., as providers may need to increase wages to attract more staff to serve the growing demand). Which could put a strain on the finances of many older individuals. For instance, a study by Morningstar found that when long-term services and supports (a term encompassing a broad range of services to assist individuals who have trouble with activities of daily living) are considered, 41% of households are projected to run short of money in retirement, compared with 26% when those costs are excluded. Notably, this figure varies by demographic, and is particularly acute for single women, with 52% of individuals this group projected to be at risk of falling short in retirement when care costs are included (compared to 34% when these costs aren't included). In this environment, financial advisors can support their clients both by introducing the conversation about potential long-term care costs they might face and exploring potential ways to cover those costs based on their particular situation (with the Morningstar study finding that the mean present value of long-term care costs from retirement age through death for a couple requiring long-term care services amounts to approximately $250,000). To start, self-insuring might be an option for several client types, including those with significant assets, who are single (and therefore don't have to worry about spending down assets needed by a spouse to support their lifestyle needs), and/or don't have significant legacy interests. Potential strategies to support a self-funding approach include maximizing contributions to 'triple tax-advantaged' Health Savings Accounts (HSAs) while working, delaying Social Security benefits (to have a larger benefit to support care costs), or tapping into home equity (whether by selling a home and downsizing or taking out a reverse mortgage). For those looking to insure against the cost of long-term care, 'standard' long-term care policies and 'hybrid' policies that combine life insurance with a long-term care benefit are available (though the market for the former has been shrinking, and premiums have increased in recent years). Also, Medicaid can provide support for care costs (though accessing these benefits can require an individual to 'spend down' their own income and assets first). In the end, while the potential need for long-term care might be an uncomfortable topic for many clients, holding discussions on this topic well before a care need arises can help the clients better prepare financially for such a contingency (e.g., by creating a self-funding plan or by obtaining long-term care insurance coverage while they can still qualify for it) and hopefully reduce the chances that a future long-term care need will be catastrophic for their financial situation. (Christine Benz | Morningstar) Conversations about long-term care costs often consider expenses involved in hiring in-home care assistants or spending time in a long-term care facility. However, while 22% of those 65 and older will end up needing long-term care for more than five years, just 4% of those over 65 are expected to need paid long-term care for longer than five years, with the difference in these figures coming from unpaid caregiving provided by family members (often adult children), close friends, or others. Notably, the provision of unpaid care can have a variety of downstream effects, suggesting that having a care plan in place well in advance of a need can help both a senior and their caregiver(s) both financially and emotionally. To start, unpaid care can reduce the time available for paid work for providers, with more than 60% of unpaid caregivers being employed on a part-time or full-time basis. Further, 50% of working caregivers said they had to alter their work hours to provide care and 16% said they had declined promotions because of their caregiving responsibilities. One study found that unpaid caregivers had higher levels of debt and lower savings than people without caregiving responsibilities, almost certainly because of these work disruptions. Unpaid care can also take an emotional toll on those providing it, as they balance the stress of providing care with their other obligations (e.g., those in the 'sandwich' generation balancing care for both aging parents and their own children). This arrangement also has the potential to fracture relationships, for example between a child who provides care to a nearby parent and their siblings who live further away and don't bear this burden. Given the potential consequences of unpaid care, discussing the possibility of future long-term care needs amongst relevant stakeholders well in advance of an actual need can be an important step. For instance, a client (even in their 50s or 60s) might consider whether their current living situation is appropriate as they age and communicate their care preferences to family members (who can discuss their own willingness to provide care as well!). And when care is needed, formalizing the caregiving arrangement with a \"personal care agreement\" (which are typically created with the support of a Medicaid planning attorney) that outlines any compensation that will be provided, the types of services involved, and the expected duration of the care among other factors not only can set expectations among key parties, but also can prove valuable if the individual needing care might need to qualify for Medicaid). Ultimately, the key point is that while long-term care needs can impose a financial burden on those requiring care (particularly if they tap into external care sources), care from friends or family can introduce its challenges as well. Which suggests that advisors can offer value both for older clients by creating a plan based on their preferences for a long-term care contingency, but also for working-age clients by planning for the potential impact of disrupted income if they are expected to take on caregiving responsibilities in the future. How To Handle A Long-Term Care Insurance Rate Increase (Nerd's Eye View) Long-Term Care (LTC) insurance policies were very popular amongst consumers in the 1990s and into the early 2000s, as aging Americans sought to protect themselves against potentially high long-term care costs and take advantage of relatively low premiums offered by insurers. However, a confluence of events – including inadequate pricing on policies, falling interest rates, reluctance among some regulators to permit requested rate increases, and higher-than-expected claims – has led to a breakdown in the traditional LTC market and tough decisions for many clients. In the wake of insurance companies pulling out of the LTC market as well as increased premiums (as remaining providers seek to keep their policies on sound [and profitable] financial footing), clients have several options they can consider. To start, a client (who can afford to do so) might simply choose to pay the increased premium, as even the increased premium might be much less than the premium they would face on a new policy today. Other clients, though, might choose to adjust the policy's terms in order to mitigate the premium increase. Often, the first choice in this scenario is to reduce the benefit period (particularly if it's 5+ years in duration, given that the average claim is about 2.8 years [with the median claim being even shorter]), followed by reducing the inflation rate (with this option being potentially attractive for older clients, who have already gained significant benefits from the inflation rider and would face fewer years of compounded inflation), and finally reducing the daily benefit amount (as this amount, at best, is typically barely enough to cover the cost of care in their area). Finally, the client could choose to cancel the policy, which might be a feasible option if the client has amassed sufficient assets to self-insure against a potential long-term care need. In sum, while long-term care insurance premium increases are frustrating for clients, advisors can help them take control of the situation by assessing their options and choosing the path that best meets their ability to take on the increased premium, the terms of the policy, and their ability to withstand potential long-term care exposures. 6 Tips For Saving Money On Air Travel (Eric Barker | Barking Up The Wrong Tree) Over the last few years, air travel has seemingly become more painful, both figuratively (in the form of higher fares and add-on charges) and literally (as seats seem to get ever narrower with shrinking legroom). Nonetheless, there are several ways to score a lower-cost ticket and perhaps a more comfortable set along the way. To start, the ability to be flexible in terms of dates can unlock cheaper fares, with Tuesdays, Wednesdays, and Saturdays often offering better deals than other days of the week. Also, flexibility in when tickets are purchased can help as well, as buying them a year out (when the airlines aren't worried yet about not selling enough seats on the plans) or in the last few weeks before the flight (when fares often increase to raise revenue from business travelers with less-elastic demand) can be more expensive. Flexibility also comes into play with the time of year the travel will occur, with \"shoulder seasons\" (i.e., the time between a location's peak season [when flights will be expensive] and its low season [often when poor weather could take away enjoyment from the trip]) potentially offering providing opportunities for good deals. A final potential area where flexibility can pay off is in finding 'positioning' flights (i.e., buying a relatively cheap ticket to a city where a ticket for the desired long-haul destination is much less expensive than from one's 'home' airport). A helpful tool for exploring different options for paid flights is Google Flights, which allows searches based on different airports, airline alliances, and offers historic price information. Though, for those who are looking to cut flight costs further, using airline miles to book flights (whether earned from actual flying or from credit card sign-up bonuses and spending) can potentially provide the lowest-cost option (particularly when it comes to premium class travel), with several aggregator tools (e.g., PointsYeah) available to find award costs across multiple airlines and mileage programs. Ultimately, the key point is that while there is typically a tradeoff between cost and flexibility when it comes to airplane tickets, there is no one 'right' answer for each traveler. Because while many individuals might be willing to adjust their travel dates to score a good deal, others might prioritize getting a flight that matches specific scheduling preferences (even if it's more expensive). How State Department Employees Made Renewing A Passport Simple (Ben Cohen | The Wall Street Journal) For those planning to travel outside of the United States, having a passport is a must. And every 10 years, travelers go through the ritual of renewing their passports, which has previously required filling out paperwork, getting a physical picture (to very specific specifications) printed, and mailing all of these materials together with the old passport to the State Department for processing (hoping that the new passport comes before one's next international trip!). Given the frustrations many Americans were having with this process (and amidst a surge in demand for passports, with 25 million being issued this year, compared to just 3 million in the 1970s), the State Department's Bureau of Consular Affairs (which is in charge of passport matters) over the past several years set out to create a system for efficient online passport renewal (notably, few countries offer fully digital passport renewal, meaning the department didn't have many successful examples to emulate). An initial pilot program in 2022 led to frustrations both for staff and users (with some staff members resorting to printing out online applications and re-scanning them after review). With these lessons learned, a tightly controlled beta test in 2024 went much better, leading to a broader public rollout later in that year that has so far been wildly successful: renewals can now be completed entirely online in approximately 15 minutes (for those who meet the eligibility requirements to do so) and the system has received positive reviews from 94% of respondents. In the end, the improvements in the passport renewal process show that even some long-time processes can be improved (whether in government or in an advisory firm), particularly when tests of the new system are undertaken carefully and leaders are able to get buy-in from internal stakeholders who will be responsible for putting the new system into action! To Combat Crowds, New Airline Lounges Might Be Shrinking (Charles Passy | MarketWatch) Given the chaotic nature of many busy airports, lounges can offer a peaceful respite for travelers who can access them. However, in recent years many of these lounges (often larger, 'signature' lounges in larger airports) have become crowded, in part due to the popularity of certain premium credit cards that provide lounge access. With this in mind, lounge operators (including credit card companies and the airlines themselves) are planning on a new concept for many future lounge openings (with the first ones opening in Charlotte this summer and in Las Vegas next year): smaller lounges designed for quick visits. Rather than a more traditional lounge where one might sit down for an hour or more (perhaps enjoying some of the free food or drinks on offer or napping in a comfortable chair), the new concepts are designed for a quick visit for grab-and-go items or a shorter sit-down at the in-lounge bar for a drink. Which could offer an attractive option for travelers with less time before their flight (or who don't want to wade through the crowds of people in larger lounges) while allowing those with more time to take advantage of the traditional lounge (which could see reduced crowds if some travelers divert to the new concept). In sum, while it might seem counterintuitive to shrink the size of airport lounges at a time of high demand, offering options that allow certain travelers to get the refreshments (and perhaps a bit of quiet) that they seek from a lounge without having to navigate a larger, more crowded space could help address this challenge (while also being cheaper to open and operate for the providers themselves, which could ultimately lead them to open more lounges, including in smaller airports?). We hope you enjoyed the reading! Please leave a comment below to share your thoughts, or send an email to [email protected] to suggest any articles you think would be a good fit for a future column! In the meantime, if you're interested in more news and information regarding advisor technology, we'd highly recommend checking out Craig Iskowitz's \"Wealth Management Today\" blog. Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2025/01/Social-Image-Blog-Article-Weekend-Reading-2025.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003eEnjoy the current installment of \u0026#34;Weekend Reading For Financial Planners\u0026#34; – this week\u0026#39;s edition kicks off with the news that \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-26-27-2025/#schwab\"\u003eCharles Schwab\u0026#39;s annual RIA benchmarking study found that median firm AUM increased 16.6% in 2024\u003c/a\u003e, with revenue up by 17.6%. While some of these gains can be attributed to strong market performance, firms also boosted their organic growth during the year, with firms with less than $250M AUM showing 9.2% net organic growth and larger firms seeing 5.0% growth (while RIAs as a whole also maintained a 97% client retention rate). In the report, Schwab also identified key traits of \u0026#34;top performing\u0026#34; firms (including having a defined ideal client persona and a defined client value proposition) and the key strategic initiatives respondents plan to pursue (with generating client referrals topping the list for the third consecutive year, followed by recruiting new staff).\u003c/p\u003e\n\u003cp\u003eAlso in industry news this week:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-26-27-2025/#consolidators\"\u003erecent report highlights the rapid growth of RIA \u0026#34;consolidators\u0026#34;\u003c/a\u003e, with advisors seeking them out for compliance and succession support, though concerns about a potential loss of autonomy and independence from joining one remain\u003c/li\u003e\n\u003cli\u003eThe Treasury has \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-26-27-2025/#aml\"\u003edelayed until 2028 the effective date for a proposed Anti-Money Laundering (AML) rule\u003c/a\u003e that would have affected most SEC-registered RIAs and plans to revisit the substance of the rule to perhaps tailor it more specifically to focus on businesses that face the greatest AML risk\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFrom there, we have several articles on tax planning:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-26-27-2025/#OBBBA\"\u003eOne Big Beautiful Bill Act (OBBBA) has made the Section 199A tax deduction permanent\u003c/a\u003e (i.e., without a scheduled sunset date), potentially benefiting not only business-owner clients but also those who own REITs in their portfolios as well\u003c/li\u003e\n\u003cli\u003eThe OBBBA has also \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-26-27-2025/#opportunity\"\u003emade permanent the Qualified Opportunity Zone program\u003c/a\u003e (albeit with a narrower scope and updated rules), providing some clients with the chance to defer gains on the sale of certain investment property\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-26-27-2025/#charitable\"\u003eHow charitable planning considerations might change under the OBBBA\u003c/a\u003e, from the new 0.5% AGI \u0026#39;floor\u0026#39; on the deductibility of charitable contributions that starts in 2026 to the ability of non-itemizers to potentially get a tax benefit for (at least some of) their charitable gifts\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe also have a number of articles on retirement planning:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHow financial advisors can \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-26-27-2025/#storm\"\u003ehelp clients explore their funding options\u003c/a\u003e amidst an expected increase in the costs of long-term care in the coming years\u003c/li\u003e\n\u003cli\u003eThe \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-26-27-2025/#crisis\"\u003eplanning considerations surrounding unpaid care\u003c/a\u003e, from the benefits of creating a formalized care plan well in advance of a need to cash flow planning for younger clients who might be responsible for (unpaid) caregiving in the future\u003c/li\u003e\n\u003cli\u003eAn analysis of the options for advisors and their clients who \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-26-27-2025/#insurance\"\u003eface a premium increase on their long-term care insurance policies\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe wrap up with three final articles, all about travel:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWhy \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-26-27-2025/#saving\"\u003eflexibility is the key to saving on flights\u003c/a\u003e, from flying on less popular days of the week to traveling during \u0026#34;shoulder season\u0026#34;\u003c/li\u003e\n\u003cli\u003eHow State Department employees created an online system that \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-26-27-2025/#passport\"\u003eallows many Americans to renew their passports online\u003c/a\u003e in as little as 15 minutes (and achieved overwhelmingly positive reviews in the process)\u003c/li\u003e\n\u003cli\u003eAmidst crowding in many airport lounges, some airlines and credit card companies are \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-26-27-2025/#lounge\"\u003elooking to open smaller lounges offering more casual, grab-and-go options\u003c/a\u003e for their customers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEnjoy the \u0026#39;light\u0026#39; reading!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg width=\"200\" height=\"200\" data-src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" alt=\"Adam Van Deusen Headshot\" decoding=\"async\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\" data-sizes=\"(max-width: 200px) 100vw, 200px\" src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eAdam is a Financial Planning Nerd at \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits.\u003c/p\u003e\n\u003cp\u003eRead more of Adam’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=7517\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003ch2 data-nav-title=\"Schwab\u0026#39;s Latest RIA Benchmarking Study\" id=\"schwabs-latest-ria-benchmarking-study-shows-organic-growth-success-hiring-needs-on-horizon\"\u003e\u003cspan\u003e\u003ca id=\"schwab\"\u003e\u003c/a\u003e\u003ca href=\"https://citywire.com/ria/news/schwab-report-rias-find-organic-growth-success-as-hiring-concerns-loom/a2470398\"\u003eSchwab\u0026#39;s Latest RIA Benchmarking Study Shows Organic Growth Success, Hiring Needs On Horizon\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Alec Rich | Citywire RIA)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAfter experiencing a rocky market environment in 2022, RIAs and their clients saw a bounce-back year in 2023 as strong equity market performance buoyed client portfolios (and firm Assets Under Management [AUM]). While 2024 also saw strong market returns (further boosting AUM), a key question is whether firms also were able to also grow organically (i.e., adding new clients or additional assets from current clients), which could help insulate their AUM (and revenue, if charging on an AUM basis) in the face of a future market downturn.\u003c/p\u003e\n\u003cp\u003eAccording to \u003ca href=\"https://advisorservices.schwab.com/resource/ria-benchmarking-study-insights-2025\"\u003eCharles Schwab\u0026#39;s latest annual RIA Benchmarking Study\u003c/a\u003e, median firm AUM increased 16.6% in 2024, with revenue up by 17.6%. Looking at organic growth by firm size, those with more than $250 million in AUM had median net organic growth rise 5.0% in 2024 (up from 4.9% in 2023) while those with under $250 million in AUM showed 9.2% net organic growth (up from 7.8% in 2023). Further, client retention remained at 97%, where it has stood for the past decade, demonstrating the continued \u0026#39;stickiness\u0026#39; of client relationships with RIAs.\u003c/p\u003e\n\u003cp\u003eLooking under the hood, Schwab identified factors that separated its \u0026#34;top performing\u0026#34; RIAs (i.e., those in the top 20% of Schwab\u0026#39;s Firm Performance Index, which looks across 15 metrics) from other firms. These included having an ideal client persona or profile (with 82% of top performing firms having one, compared to 73% of other firms with more than $250 million in AUM and 57% of smaller firms), having a documented client value proposition (81% of top-performing firms, compared to 71% of other larger firms and 47% of smaller firms), and a documented marketing plan (with 58% of top performing firms having one, compared to 52% of other larger firms and 32% of smaller firms). Firms with all three of these features in place gained 67% more clients and 68% more new client assets in 2024 compared to other firms, according to the study.\u003c/p\u003e\n\u003cp\u003eIn terms of top strategic initiatives for the RIAs surveyed, acquiring new clients through \u003ca href=\"https://www.kitces.com/blog/client-referrals-net-promoter-score-introduction-meeting-coi-centers-of-influence/\"\u003eclient referrals\u003c/a\u003e topped the list for the third consecutive year, followed by \u003ca href=\"https://www.kitces.com/blog/hiring-experience-attracting-today-wealth-management-talent-practice-management-employees-firm-competitive-interview-process-lead-advisor/\"\u003erecruiting staff\u003c/a\u003e to increase the firm\u0026#39;s skill set and capacity (up from third place last year), and acquiring new clients through business referrals. Notably, while hiring appears to remain a top priority (with 78% of firms surveyed making at least one hire in 2024, the highest mark since 2021), developing the skills and capabilities of staff ranked eighth in the list of strategic initiatives, down from fifth place last year (potentially leading to frustrations among some staff if they feel their firm is more invested in bringing on new employees and less invested in \u003ca href=\"https://www.kitces.com/blog/the-small-firm-guide-to-associate-advisor-development-training-resources-and-programs-to-help-new-cfps-gain-real-world-expertise/\"\u003edeveloping their skills\u003c/a\u003e?).\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that RIAs saw AUM growth in 2024 not only due to market appreciation, but also thanks to their organic growth efforts (and continued high client retention). Further, \u003ca href=\"https://www.kitces.com/blog/industry-benchmarking-studies-financial-advisory-firms-key-performance-indicators-kpis-profitability-data/\"\u003eusing the benchmarking study data\u003c/a\u003e to take stock of the key practices that separate top-performing firms identified in the study from others (from narrowing in on an \u003ca href=\"https://www.kitces.com/blog/ideal-client-persona-financial-advisor-niche-marketing-messaging/\"\u003eideal client persona\u003c/a\u003e to \u003ca href=\"https://www.kitces.com/blog/financial-advisor-marketing-kpis-tracking-activity-prospect-sales-pipeline/\"\u003ecreating a documented marketing plan\u003c/a\u003e), and considering how (and whether) they might fit within their own practice, could help firms continue their client and AUM growth through future bull and bear markets!\u003c/p\u003e\n\u003ch2 data-nav-title=\"Advisors Looking For Succession Support\" id=\"amidst-growth-of-ria-consolidators-advisors-looking-for-compliance-tech-succession-support-cerulli\"\u003e\u003cspan\u003e\u003ca id=\"consolidators\"\u003e\u003c/a\u003e\u003ca href=\"https://www.wealthmanagement.com/ria-news/cerulli-more-advisors-affiliating-with-ria-consolidators\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eAmidst Growth Of RIA \u0026#34;Consolidators\u0026#34;, Advisors Looking For Compliance, Tech, Succession Support: Cerulli\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Diana Britton | WealthManagement)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn recent years, many advisors have left larger wirehouses and broker-dealer platforms to either join an existing RIA or start one of their own. Typically, these RIAs are much smaller than the larger firms they left, offering an increased level of independence and flexibility. The caveat, however, is that when they leave their support infrastructure behind, advisors starting their own firms have to build all that operations, tech, and compliance framework themselves. Which for advisors who ultimately want to focus most on serving clients, can be challenging… and seems now to be leading both to the rise of various \u0026#34;\u003ca href=\"https://www.xyplanningnetwork.com/\"\u003esupported independence\u003c/a\u003e\u0026#34; platforms, along with advisors who change their minds and decide maybe it would be better to be part of a larger platform after all and choose to merge themselves into one of the so-called “RIA consolidators” (i.e., large RIAs active in acquiring smaller firms, often fueled by capital from private equity firms). And the trend seems to be accelerating.\u003c/p\u003e\n\u003cp\u003eAccording to research and consulting firm \u003ca href=\"https://www.cerulli.com/arc\"\u003eCerulli Associates\u003c/a\u003e, 12,000 advisors were affiliated with these \u0026#34;consolidators\u0026#34; as of 2023, up from just 4,000 in 2018. Among advisors surveyed by Cerulli, the top services provided by consolidators include compliance guidance and ongoing support (cited by 58%), and an integrated tech platform (55%), along with helping advisors to solve their succession planning needs (50%). Notably, while consolidators can often provide advisors centralized investment platforms (given their scale), only 25% of advisors surveyed by Cerulli cited this as a top service, as ironically the availability of technology (e.g., \u003ca href=\"https://fintech.kitces.com/category/investment-management/trading--and--rebalancing/\"\u003emodel management/rebalancing software\u003c/a\u003e) has made this less of a pain point for advisors than in the past.\u003c/p\u003e\n\u003cp\u003eOn the other hand, the most common concerns cited by respondents about joining a consolidator firm included a loss of autonomy (52%) and independence (51%), the practical challenges of transitioning operations (45%), potential for client resistance to the move (36%), and lost revenue during the transition period (30%).\u003c/p\u003e\n\u003cp\u003eIn the end, advisory firms have a range of options when \u003ca href=\"https://www.kitces.com/blog/mark-tibergien-pershing-advisor-solutions-sizing-scaling-up-practice-management-advisory-business/\"\u003elooking for increased support as they seek to size up and scale\u003c/a\u003e (e.g., joining a larger firm to access its resources and economies of scale or \u003ca href=\"https://www.kitces.com/blog/future-advisor-platforms-tech-enabled-services-not-technology-ria-broker-dealer/\"\u003eworking with a “supported independence” platform\u003c/a\u003e) or explore their succession planning options (e.g., \u003ca href=\"https://www.kitces.com/blog/david-grau-jr-internal-succession-plan-private-equity-era-sale-acquisition/\"\u003enavigating an internal succession\u003c/a\u003e or looking for an external partner for a sale), and it appears that RIA consolidators will remain viable options for both of these groups in the years ahead. Which means many advisors who might have started in the wirehouse or broker-dealers channels and become an independent RIA may ultimately find that they end up within a large organization (\u003ca href=\"https://www.kitces.com/blog/learning-experiences-advisor-firm-owners-merging-selling-acquisition-inside-information/\"\u003efor better or worse\u003c/a\u003e) yet again… though given that there have always been a subset of advisors who prefer to leverage existing infrastructure rather than building their own (thus the success of wirehouses and independent broker-dealers in the first place), perhaps RIA consolidators are less of a “new” trend and more simply the RIA channel replicating the various types of support structures that already existed in the broker-dealer channel?\u003c/p\u003e\n\u003ch2 data-nav-title=\"Treasury Delays AML Rule\" id=\"treasury-delays-aml-rule-for-advisors-to-conduct-broad-review\"\u003e\u003cspan\u003e\u003ca id=\"aml\"\u003e\u003c/a\u003e\u003ca href=\"https://www.thinkadvisor.com/2025/07/21/treasury-delays-aml-rule-for-advisors-to-conduct-broad-review/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eTreasury Delays AML Rule For Advisors To Conduct \u0026#34;Broad Review\u0026#34;\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Melanie Waddell | ThinkAdvisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUnder the \u003ca href=\"https://www.occ.treas.gov/topics/supervision-and-examination/bsa/index-bsa.html\"\u003eBank Secrecy Act (BSA)\u003c/a\u003e, banks and other major financial institutions are required to fulfill certain \u0026#34;Know Your Customer\u0026#34; (KYC) requirements to prevent criminals, terrorists, and other unsavory actors from using the financial system to pursue their illicit ends. Notably, though, despite managing billions of dollars in assets (and potentially being an attractive medium for illicit actors to park or invest their money), investment advisers have not been on the list of financial institutions under the BSA.\u003c/p\u003e\n\u003cp\u003eTo address this gap, the (Biden-era) Treasury Department last August \u003ca href=\"https://www.fincen.gov/sites/default/files/shared/IAFinalRuleFactSheet-FINAL-508.pdf\"\u003efinalized new rules\u003c/a\u003e that would add certain SEC-registered RIAs and those reporting to the SEC as exempt reporting advisers (though notably not state-registered RIAs or certain SEC-registered RIAs with less than $100M of AUM), as well as residential real estate advisors, to the list of \u0026#34;financial institutions\u0026#34; under the BSA and would require them to implement risk-based Anti-Money Laundering and Countering the Financing of Terrorism (AML/CFT) programs, including a requirement to report suspicious activity to Treasury\u0026#39;s Financial Crimes Enforcement Network (FinCEN). Further, affected RIAs would have to conduct an ongoing customer due diligence program that includes developing a customer risk profile and conducting ongoing monitoring to identify and report suspicious transactions.\u003c/p\u003e\n\u003cp\u003eHowever, following the change in presidential administrations, \u003ca href=\"https://home.treasury.gov/news/press-releases/sb0201\"\u003ethe Treasury Department announced this week\u003c/a\u003e that it has postponed the effective date for the AML rule (from January 1, 2026 to January 1, 2028) to \u0026#34;ensure efficient regulation that appropriately balances costs and benefits\u0026#34; as \u0026#34;the rule must be effectively tailored to the diverse business models and risk profiles of the investment advisor sectors\u0026#34; (as critiques the rule [\u003ca href=\"https://www.investmentadviser.org/resources/iaa-recommends-changes-to-fincens-aml-rule-for-investment-advisers/\"\u003eincluding from the Investment Adviser Association\u003c/a\u003e (IAA)] suggested that many RIAs are at low risk for facilitating money laundering and that the rule\u0026#39;s requirements would be burdensome and potentially duplicative). Treasury said that its Financial Crimes Enforcement Network (FinCEN) will revisit the substance of the AML rule as well as the proposed rule establishing customer identification program requirements for advisers (which, combined with the delayed effective date, \u003ca href=\"https://www.investmentadviser.org/iaatoday/press-release/iaa-statement-on-treasury-postponement-and-reopening-of-investment-adviser-rule/\"\u003ereceived praise from the IAA\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eIn sum, affected financial advisory firms appear to have until at least 2028 to implement measures within a (likely revised) AML rule (which would have otherwise added additional compliance and paperwork obligations for certain RIAs). Nevertheless, amidst potential threats from criminals looking to abuse the financial system, advisers offering comprehensive planning services (as well as their investment custodians) are likely already conducting a certain level due diligence on their clients, as understanding their background and circumstances is an important part of preparing a financial plan. Which could be a \u0026#39;defense mechanism\u0026#39; for these firms against criminals, as these actors might instead try to park their money with more investment-centric advisers and fund managers that spend less time getting to know their clients?\u003c/p\u003e\n\u003ch2 data-nav-title=\"OBBBA Makes Permanent Section 199A\" id=\"obbba-makes-permanent-section-199a-tax-deduction-benefitting-business-owners-and-reit-stockholders\"\u003e\u003ca id=\"OBBBA\"\u003e\u003c/a\u003e\u003cspan\u003e\u003ca href=\"https://www.wealthmanagement.com/alternative-investments/obbba-makes-permanent-a-tax-deduction-that-benefits-reit-stockholders\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Taxes\"\u003eOBBBA Makes Permanent Section 199A Tax Deduction – Benefitting Business Owners And REIT Stockholders\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(David Bodamer | WealthManagement)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe 2017 Tax Cuts and Jobs Act (TCJA) created a major new tax deduction for pass-through business owners (i.e., sole proprietorships, partnerships, and S corporations) with the Section 199A deduction for Qualified Business Income (QBI). In short, Section 199A allows eligible business owners to deduct up to 20% of the lesser of their QBI from qualifying pass-through businesses or their total taxable income (minus net capital gains).\u003c/p\u003e\n\u003cp\u003eThe Section 199A deduction was one of several measures within the TCJA that was scheduled to sunset at the end of 2025, but under the \u003ca href=\"https://www.kitces.com/blog/obbba-one-big-beautiful-bill-act-tax-planning-salt-cap-senior-deduction-qbi-deduction-tax-cut-and-jobs-act-tcja-amt-trump-accounts/\"\u003eOne Big Beautiful Bill Act (OBBBA)\u003c/a\u003e has been made \u0026#39;permanent\u0026#39; (i.e., with out a scheduled sunset date) with relatively minor changes, providing added certainty to business owners that the deduction will continue for the foreseeable future. While many of the headlines surrounding this measure focus on the QBI deduction for business owners, \u003ca href=\"https://www.kitces.com/blog/reit-real-estate-investments-section-199a-qbi-deduction/\"\u003ethe Section 199A deduction also includes a component for dividends from REITs\u003c/a\u003e (Real Estate Investment Trusts). Which means that a much wider group of clients could benefit from this deduction (as they might hold individual REITs, REIT funds, or even REITs within more diversified funds). For instance (given that most REIT dividends are taxed as ordinary income), with the deduction those in the 32% tax bracket could see their REIT dividends taxed at a 25.6% rate.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that while many business-owner clients will continue to benefit from the now-\u0026#39;permanent\u0026#39; QBI deduction, a broader swath of clients will likely see a reduction in their taxes thanks to the deduction as well (even if they don\u0026#39;t think they \u0026#39;run\u0026#39; a business!). Further, because this deduction narrows the gap between REITs (which have historically been seen as tax-inefficient given their significant amounts of taxable distributions treated as ordinary income) and other investments, advisors could offer value for clients by revisiting their \u003ca href=\"https://www.kitces.com/blog/asset-location-the-new-wealth-management-value-add-for-optimal-portfolio-design/\"\u003easset location strategy\u003c/a\u003e to ensure \u003ca href=\"https://www.kitces.com/blog/yield-split-asset-location-tax-drag-alpha-efficiency-index-funds/\"\u003edifferent types of assets are in the optimal location [i.e., taxable versus retirement accounts] for tax efficiency, liquidity, or other goals\u003c/a\u003e.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Opportunity Zones Made Permanent\" id=\"opportunity-zones-made-permanent-under-obbba-with-narrower-scope-and-updated-rules\"\u003e\u003cspan\u003e\u003ca id=\"opportunity\"\u003e\u003c/a\u003e\u003ca href=\"https://www.wealthmanagement.com/alternative-investments/opportunity-zones-become-a-permanent-program-helping-advisors-find-tax-breaks-for-clients\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Taxes\"\u003eOpportunity Zones Made Permanent Under OBBBA, With Narrower Scope And Updated Rules\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Elaine Misonzhnik | WealthManagement)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe 2017 Tax Cuts and Jobs Act (TCJA) created \u003ca href=\"https://www.kitces.com/blog/qualified-opportunity-zone-qoz-fund-qof-defer-avoid-capital-gains/\"\u003ea new type of investment known as a Qualified Opportunity Fund (QOF)\u003c/a\u003e. These funds allowed investors to pool capital into Qualified Opportunity Zones (QOZs), which are low-income geographic areas designated by state governments. QOFs offered the potential for significant tax benefits, particularly for high-income investors. Individuals could sell appreciated investment property (e.g., stocks, funds, or real estate) and reinvest the gains into a QOF. That gain would then be deferred until the earlier of December 31, 2026, or the date the QOF was sold or exchanged. Which effectively allowed for up to eight years of gain deferral for QOFs created in 2018.\u003c/p\u003e\n\u003cp\u003eNow, \u003ca href=\"https://www.kitces.com/blog/obbba-one-big-beautiful-bill-act-tax-planning-salt-cap-senior-deduction-qbi-deduction-tax-cut-and-jobs-act-tcja-amt-trump-accounts/\"\u003eSection 70421 of the One Big Beautiful Bill Act (OBBBA)\u003c/a\u003e creates a more permanent version of the QOF program, but with a narrower scope and updated rules. Under the new measure, states will be allowed to designate a new round of QOZs every 10 years starting in 2026. The definition of low-income areas will be slightly more restrictive: qualifying communities must have a median income below 70% of the median income for the state or metropolitan area where they\u0026#39;re located, rather than 80% under the original law).\u003c/p\u003e\n\u003cp\u003eStarting in 2027, investors can defer capital gains by reinvesting them into a QOF, with deferral lasting until the earlier of when the property is sold or exchanged or five years after the original investment. As with the original program, investors who hold a QOF for at least five years will receive a 10% basis step-up on the deferred gain. However, investments in a QOF that invests at least 90% of its assets in rural QOZ property would receive a 30% step-up. In contrast to the original QOZ program, there is no additional 5% step-up for QOFs held for more than seven years. As before, any gains attributable to the original deferred gain will be excluded from taxation if the QOF is held for more than 10 years – though any further gains after 30 years would become taxable.\u003c/p\u003e\n\u003cp\u003eNotably, all of these proposed changes apply only to \u003cem\u003enew\u003c/em\u003e QOF investments made starting in 2027. For existing investors whose deferred gains are scheduled to be recognized in 2026, there\u0026#39;s no way to extend that deferral further; those gains would still become taxable as planned. Amidst this backdrop, some industry observers believe there could be a continued slowdown in opportunity zone fundraising until the new measures come into effect in 2027, at which point there could be a spike in opportunities as investors look to take advantage of the updated rules.\u003c/p\u003e\n\u003cp\u003eIn sum, the OBBBA offers clients selling investments with significant embedded gains a continued opportunity to defer those gains through investment in QOFs. Nevertheless, while such an \u0026#39;opportunity\u0026#39; might be attractive to certain clients, advisors can provide value by evaluating other options for tax deferral (e.g., 1031 exchanges or \u003ca href=\"https://www.kitces.com/blog/section-351-exchanges-tax-efficient-reallocate-portfolio-us-equity-markets-etf/\"\u003e351 exchanges\u003c/a\u003e) as well and recommending the most appropriate option for the client\u0026#39;s tax situation and financial goals.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Charitable Planning Post-OBBBA\" id=\"charitable-planning-considerations-for-advisors-and-their-clients-postobbba\"\u003e\u003cspan\u003e\u003ca id=\"charitable\"\u003e\u003c/a\u003e\u003ca href=\"https://www.forbes.com/sites/martinshenkman/2025/07/13/charitable-planning-after-the-big-beautiful-bill-obbba-is-different/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Taxes\"\u003eCharitable Planning Considerations For Advisors And Their Clients Post-OBBBA\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Martin Shenkman | Forbes)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor charitably inclined financial planning clients, the ability to support worthy organizations is often their primary motivation for donating money or assets. Nevertheless, given various tax incentives for charitable giving, advisors have long supported clients by creating a tax-optimized charitable giving strategy for them (that could ultimately allow the client to increase the size of their donations!).\u003c/p\u003e\n\u003cp\u003eNotably, the 2017 Tax Cuts and Jobs Act (TCJA) shook up the tax considerations for charitable giving in part by dramatically increasing the standard deduction (which meant that fewer individuals would have sufficient itemized deductions [including charitable gifts] to surpass the standard deduction). And now, the \u003ca href=\"https://www.kitces.com/blog/obbba-one-big-beautiful-bill-act-tax-planning-salt-cap-senior-deduction-qbi-deduction-tax-cut-and-jobs-act-tcja-amt-trump-accounts/\"\u003eOne Big Beautiful Bill Act (OBBBA)\u003c/a\u003e makes \u0026#39;permanent\u0026#39; (i.e., without a scheduled sunset date) the higher standard deduction (which was otherwise scheduled to sunset at the end of 2025), which will be $15,570 for single filers and $31,500 for joint filers. Which means that many of the strategies advisors have recommended to clients \u003ca href=\"https://www.kitces.com/blog/deduction-lumping-charitable-clumping-tax-savings-itemized-vs-standard-deduction/\"\u003eto maximize tax savings from their charitable giving\u003c/a\u003e (e.g., \u0026#39;clumping\u0026#39; charitable gifts into the same year to exceed the standard deduction level, for instance by making a gift to a \u003ca href=\"https://www.kitces.com/blog/rules-strategies-and-tactics-when-using-donor-advised-funds-for-charitable-giving/\"\u003edonor-advised fund\u003c/a\u003e that could then be granted to individual charities over time) could remain particularly useful going forward (though, thanks to the increased State And Local Tax [SALT] cap under OBBBA, taxpayers with significant SALT burdens could find themselves more likely to itemize in the years ahead anyway).\u003c/p\u003e\n\u003cp\u003eAnother new consideration for charitable giving is the introduction of a floor on the deductibility of charitable contributions of 0.5% of Adjusted Gross Income (AGI) starting in 2026. This means that deductions are only allowed to the extent an individual\u0026#39;s otherwise-deductible contributions exceed 0.5% of their AGI (potentially making it beneficial to make anticipated charitable gifts in 2025 before the 0.5%-of-AGI floor takes effect in 2026).\u003c/p\u003e\n\u003cp\u003eFor those whose itemized deductions fall well short of their standard deduction, Section 70424 of OBBBA offers a charitable deduction for non-itemizers starting in 2026, with a maximum deduction of $1,000 for single filers and $2,000 for joint filers, allowing clients taking the standard deduction to gain some tax benefit from their charitable giving (though, importantly, qualifying charitable contributions must be in cash [i.e., no other types of property like household goods or securities] and cannot be made to Section 509(a)(3) \u0026#34;supporting organizations\u0026#34; or used to establish or maintain a donor-advised fund).\u003c/p\u003e\n\u003cp\u003eAltogether, the OBBBA introduces new considerations for advisors and their clients looking to make charitable gifts in the most tax-efficient way possible, offering an opportunity for advisors to add value by assessing the options and benefits available to a client given their income and other itemized deductions, implementing potentially valuable strategies (e.g., charitable clumping, \u003ca href=\"https://www.kitces.com/blog/ira-qualified-charitable-distribution-qcd-to-satisfy-rmd-vs-donating-appreciated-securities/\"\u003edonating appreciated securities, and/or Qualified Charitable Distributions\u003c/a\u003e) where appropriate, and, perhaps more broadly, \u003ca href=\"https://www.kitces.com/blog/charitable-giving-advisor-client-conversations-charity-sample-script-questions-financial-plan/\"\u003ehaving regular conversations with clients\u003c/a\u003e to better understand their goals for charitable giving and create a long-term plan for making them come to fruition.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Long-Term Care Costs Poised To Rise\" id=\"helping-clients-get-ahead-of-a-perfect-storm-poised-to-raise-longterm-care-costs\"\u003e\u003cspan\u003e\u003ca id=\"storm\"\u003e\u003c/a\u003e\u003ca href=\"https://www.morningstar.com/retirement/perfect-storm-is-poised-raise-long-term-care-costs-heres-how-you-can-get-ahead-it\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eHelping Clients Get Ahead Of A \u0026#39;Perfect Storm\u0026#39; Poised To Raise Long-Term Care Costs\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Mark Miller | Morningstar)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWith the number of Americans aged 65 and older projected to surge from 56.1 million in 2020 to 80.8 million in 2040, the number of individuals requiring long-term care services is almost certain to increase as well. Notably, this surge in demand for long-term care services could contribute to increased costs as well (e.g., as providers may need to increase wages to attract more staff to serve the growing demand). Which could put a strain on the finances of many older individuals.\u003c/p\u003e\n\u003cp\u003eFor instance, \u003ca href=\"https://www.morningstar.com/retirement/how-cost-long-term-services-supports-shapes-retirement-readiness\"\u003ea study by Morningstar \u003c/a\u003efound that when long-term services and supports (a term encompassing a broad range of services to assist individuals who have trouble with activities of daily living) are considered, 41% of households are projected to run short of money in retirement, compared with 26% when those costs are excluded. Notably, this figure varies by demographic, and is particularly acute for single women, with 52% of individuals this group projected to be at risk of falling short in retirement when care costs are included (compared to 34% when these costs aren\u0026#39;t included).\u003c/p\u003e\n\u003cp\u003eIn this environment, financial advisors can support their clients both by introducing the conversation about potential long-term care costs they might face and exploring potential ways to cover those costs based on their particular situation (with the Morningstar study finding that the mean present value of long-term care costs from retirement age through death for a couple requiring long-term care services amounts to approximately $250,000). To start, self-insuring might be an option for several client types, including those with significant assets, who are single (and therefore don\u0026#39;t have to worry about spending down assets needed by a spouse to support their lifestyle needs), and/or don\u0026#39;t have significant legacy interests. Potential strategies to support a self-funding approach include maximizing contributions to \u0026#39;triple tax-advantaged\u0026#39; Health Savings Accounts (HSAs) while working, delaying Social Security benefits (to have a larger benefit to support care costs), or tapping into home equity (whether by selling a home and downsizing or taking out a reverse mortgage).\u003c/p\u003e\n\u003cp\u003eFor those looking to insure against the cost of long-term care, \u0026#39;standard\u0026#39; long-term care policies and \u0026#39;hybrid\u0026#39; policies that combine life insurance with a long-term care benefit are available (though the market for the former has been shrinking, and premiums have increased in recent years). Also, \u003ca href=\"https://www.kitces.com/blog/medicaid-annuities-institutional-care-nursing-home-asset-limits-eligibility-married-couples/\"\u003eMedicaid can provide support for care costs\u003c/a\u003e (though accessing these benefits can require an individual to \u0026#39;spend down\u0026#39; their own income and assets first).\u003c/p\u003e\n\u003cp\u003eIn the end, while the potential need for long-term care might be an uncomfortable topic for many clients, holding discussions on this topic well before a care need arises can help the clients better prepare financially for such a contingency (e.g., by creating a self-funding plan or by obtaining long-term care insurance coverage while they can still qualify for it) and hopefully reduce the chances that a future long-term care need will be catastrophic for their financial situation.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Christine Benz | Morningstar)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eConversations about long-term care costs often consider expenses involved in hiring in-home care assistants or spending time in a long-term care facility. However, while 22% of those 65 and older will end up needing long-term care for more than five years, just 4% of those over 65 are expected to need \u003cem\u003epaid\u003c/em\u003e long-term care for longer than five years, with the difference in these figures coming from unpaid caregiving provided by family members (often adult children), close friends, or others.\u003c/p\u003e\n\u003cp\u003eNotably, the provision of unpaid care can have a variety of downstream effects, suggesting that having a care plan in place well in advance of a need can help both a senior and their caregiver(s) both financially and emotionally. To start, unpaid care can reduce the time available for paid work for providers, with more than 60% of unpaid caregivers being employed on a part-time or full-time basis. Further, 50% of working caregivers said they had to alter their work hours to provide care and 16% said they had declined promotions because of their caregiving responsibilities. One \u003ca href=\"https://www.tiaa.org/public/institute/about/news/as-people-live-longer-family-caregivers-face-financial-challenges\"\u003estudy\u003c/a\u003e found that unpaid caregivers had higher levels of debt and lower savings than people without caregiving responsibilities, almost certainly because of these work disruptions.\u003c/p\u003e\n\u003cp\u003eUnpaid care can also take an emotional toll on those providing it, as they balance the stress of providing care with their other obligations (e.g., those in the \u0026#39;sandwich\u0026#39; generation balancing care for both aging parents and their own children). This arrangement also has the potential to fracture relationships, for example between a child who provides care to a nearby parent and their siblings who live further away and don\u0026#39;t bear this burden.\u003c/p\u003e\n\u003cp\u003eGiven the potential consequences of unpaid care, discussing the possibility of future long-term care needs amongst relevant stakeholders well in advance of an actual need can be an important step. For instance, a client (even in their 50s or 60s) might consider whether their current living situation is appropriate as they age and communicate their care preferences to family members (who can discuss their own willingness to provide care as well!). And when care is needed, formalizing the caregiving arrangement with a \u0026#34;personal care agreement\u0026#34; (which are typically created with the support of a Medicaid planning attorney) that outlines any compensation that will be provided, the types of services involved, and the expected duration of the care among other factors not only can set expectations among key parties, but also can prove valuable if the individual needing care might need to qualify for Medicaid).\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that while long-term care needs can impose a financial burden on those requiring care (particularly if they tap into external care sources), care from friends or family can introduce its challenges as well. Which suggests that advisors can offer value both for older clients by creating a plan based on their preferences for a long-term care contingency, but also for working-age clients by planning for the potential impact of disrupted income if they are expected to take on caregiving responsibilities in the future.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Handling A LTC Insurance Rate Increase\" id=\"how-to-handle-a-longterm-care-insurance-rate-increase\"\u003e\u003cspan\u003e\u003ca id=\"insurance\"\u003e\u003c/a\u003e\u003ca href=\"https://www.kitces.com/blog/how-to-handle-a-long-term-care-insurance-rate-increase/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eHow To Handle A Long-Term Care Insurance Rate Increase\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Nerd\u0026#39;s Eye View)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLong-Term Care (LTC) insurance policies were very popular amongst consumers in the 1990s and into the early 2000s, as aging Americans sought to protect themselves against potentially high long-term care costs and take advantage of relatively low premiums offered by insurers. However, a confluence of events – including inadequate pricing on policies, falling interest rates, reluctance among some regulators to permit requested rate increases, and higher-than-expected claims – has led to a breakdown in the traditional LTC market and tough decisions for many clients.\u003c/p\u003e\n\u003cp\u003eIn the wake of insurance companies pulling out of the LTC market as well as increased premiums (as remaining providers seek to keep their policies on sound [and profitable] financial footing), clients have several options they can consider. To start, a client (who can afford to do so) might simply choose to pay the increased premium, as even the increased premium might be much less than the premium they would face on a new policy today. Other clients, though, might choose to adjust the policy\u0026#39;s terms in order to mitigate the premium increase. Often, the first choice in this scenario is to reduce the benefit period (particularly if it\u0026#39;s 5+ years in duration, given that the average claim is about 2.8 years [with the median claim being even shorter]), followed by reducing the inflation rate (with this option being potentially attractive for older clients, who have already gained significant benefits from the inflation rider and would face fewer years of compounded inflation), and finally reducing the daily benefit amount (as this amount, at best, is typically barely enough to cover the cost of care in their area). Finally, the client could choose to cancel the policy, which might be a feasible option if the client has amassed sufficient assets to self-insure against a potential long-term care need.\u003c/p\u003e\n\u003cp\u003eIn sum, while long-term care insurance premium increases are frustrating for clients, advisors can help them take control of the situation by assessing their options and choosing the path that best meets their ability to take on the increased premium, the terms of the policy, and their ability to withstand potential long-term care exposures.\u003c/p\u003e\n\u003ch2 id=\"6-tips-for-saving-money-on-air-travel\"\u003e\u003cspan\u003e\u003ca id=\"saving\"\u003e\u003c/a\u003e\u003ca href=\"https://bakadesuyo.com/2025/07/save-money-on-travel/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003e6 Tips For Saving Money On Air Travel\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Eric Barker | Barking Up The Wrong Tree)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOver the last few years, air travel has seemingly become more painful, both figuratively (in the form of higher fares and add-on charges) and literally (as seats seem to get ever narrower with shrinking legroom). Nonetheless, there are several ways to score a lower-cost ticket and perhaps a more comfortable set along the way.\u003c/p\u003e\n\u003cp\u003eTo start, the ability to be flexible in terms of dates can unlock cheaper fares, with Tuesdays, Wednesdays, and Saturdays often offering better deals than other days of the week. Also, flexibility in when tickets are purchased can help as well, as buying them a year out (when the airlines aren\u0026#39;t worried yet about not selling enough seats on the plans) or in the last few weeks before the flight (when fares often increase to raise revenue from business travelers with less-elastic demand) can be more expensive. Flexibility also comes into play with the time of year the travel will occur, with \u0026#34;shoulder seasons\u0026#34; (i.e., the time between a location\u0026#39;s peak season [when flights will be expensive] and its low season [often when poor weather could take away enjoyment from the trip]) potentially offering providing opportunities for good deals. A final potential area where flexibility can pay off is in finding \u0026#39;positioning\u0026#39; flights (i.e., buying a relatively cheap ticket to a city where a ticket for the desired long-haul destination is much less expensive than from one\u0026#39;s \u0026#39;home\u0026#39; airport).\u003c/p\u003e\n\u003cp\u003eA helpful tool for exploring different options for paid flights is \u003ca href=\"https://www.google.com/travel/flights\"\u003eGoogle Flights\u003c/a\u003e, which allows searches based on different airports, airline alliances, and offers historic price information. Though, for those who are looking to cut flight costs further, using airline miles to book flights (whether earned from actual flying or from \u003ca href=\"https://www.kitces.com/blog/credit-card-rewards-travel-miles-transferrable-points-cash-back-sign-up-bonus-award-redemption/\"\u003ecredit card sign-up bonuses and spending\u003c/a\u003e) can potentially provide the lowest-cost option (particularly when it comes to premium class travel), with several aggregator tools (e.g., \u003ca href=\"https://www.pointsyeah.com/\"\u003ePointsYeah\u003c/a\u003e) available to find award costs across multiple airlines and mileage programs.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that while there is typically a tradeoff between cost and flexibility when it comes to airplane tickets, there is no one \u0026#39;right\u0026#39; answer for each traveler. Because while many individuals might be willing to adjust their travel dates to score a good deal, others might prioritize getting a flight that matches specific scheduling preferences (even if it\u0026#39;s more expensive).\u003c/p\u003e\n\u003ch2 data-nav-title=\"Renewing A Passport Made Simple\" id=\"how-state-department-employees-made-renewing-a-passport-simple\"\u003e\u003cspan\u003e\u003ca id=\"passport\"\u003e\u003c/a\u003e\u003ca href=\"https://www.wsj.com/business/us-passport-online-renewal-e58b51d1\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eHow State Department Employees Made Renewing A Passport Simple\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Ben Cohen | The Wall Street Journal)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor those planning to travel outside of the United States, having a passport is a must. And every 10 years, travelers go through the ritual of renewing their passports, which has previously required filling out paperwork, getting a physical picture (to very specific specifications) printed, and mailing all of these materials together with the old passport to the State Department for processing (hoping that the new passport comes before one\u0026#39;s next international trip!).\u003c/p\u003e\n\u003cp\u003eGiven the frustrations many Americans were having with this process (and amidst a surge in demand for passports, with 25 million being issued this year, compared to just 3 million in the 1970s), the State Department\u0026#39;s Bureau of Consular Affairs (which is in charge of passport matters) over the past several years set out to create a system for efficient online passport renewal (notably, few countries offer fully digital passport renewal, meaning the department didn\u0026#39;t have many successful examples to emulate).\u003c/p\u003e\n\u003cp\u003eAn initial pilot program in 2022 led to frustrations both for staff and users (with some staff members resorting to printing out online applications and re-scanning them after review). With these lessons learned, a tightly controlled beta test in 2024 went much better, leading to a broader public rollout later in that year that has so far been wildly successful: \u003ca href=\"https://travel.state.gov/content/travel/en/passports/have-passport/renew-online.html\"\u003erenewals can now be completed entirely online\u003c/a\u003e in approximately 15 minutes (for those who meet the eligibility requirements to do so) and the system has received positive reviews from 94% of respondents.\u003c/p\u003e\n\u003cp\u003eIn the end, the improvements in the passport renewal process show that even some long-time processes can be improved (whether in government or in an advisory firm), particularly when tests of the new system are undertaken carefully and leaders are able to get buy-in from internal stakeholders who will be responsible for putting the new system into action!\u003c/p\u003e\n\u003ch2 data-nav-title=\"New Airline Lounges Might Be Shrinking\" id=\"to-combat-crowds-new-airline-lounges-might-be-shrinking\"\u003e\u003cspan\u003e\u003ca id=\"lounge\"\u003e\u003c/a\u003e\u003ca href=\"https://www.marketwatch.com/story/airport-lounges-are-ridiculously-crowded-new-mini-lounges-might-help-ease-the-traffic-956eb8f7\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eTo Combat Crowds, New Airline Lounges Might Be Shrinking\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Charles Passy | MarketWatch)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGiven the chaotic nature of many busy airports, lounges can offer a peaceful respite for travelers who can access them. However, in recent years many of these lounges (often larger, \u0026#39;signature\u0026#39; lounges in larger airports) have become crowded, in part due to the popularity of certain premium credit cards that provide lounge access.\u003c/p\u003e\n\u003cp\u003eWith this in mind, lounge operators (including credit card companies and the airlines themselves) are planning on a new concept for many future lounge openings (with the first ones opening in Charlotte this summer and in Las Vegas next year): smaller lounges designed for quick visits. Rather than a more traditional lounge where one might sit down for an hour or more (perhaps enjoying some of the free food or drinks on offer or napping in a comfortable chair), the new concepts are designed for a quick visit for grab-and-go items or a shorter sit-down at the in-lounge bar for a drink. Which could offer an attractive option for travelers with less time before their flight (or who don\u0026#39;t want to wade through the crowds of people in larger lounges) while allowing those with more time to take advantage of the traditional lounge (which could see reduced crowds if some travelers divert to the new concept).\u003c/p\u003e\n\u003cp\u003eIn sum, while it might seem counterintuitive to shrink the size of airport lounges at a time of high demand, offering options that allow certain travelers to get the refreshments (and perhaps a bit of quiet) that they seek from a lounge without having to navigate a larger, more crowded space could help address this challenge (while also being cheaper to open and operate for the providers themselves, which could ultimately lead them to open more lounges, including in smaller airports?).\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eWe hope you enjoyed the reading! Please leave a comment below to share your thoughts, or send an email to \u003ca href=\"https://feeds.feedblitz.com/cdn-cgi/l/email-protection#760113131d131812041317121f1811361d1f021513055815191b\"\u003e\u003cspan data-cfemail=\"f384969698969d97819692979a9d94b3989a87909680dd909c9e\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e to suggest any articles you think would be a good fit for a future column!\u003c/p\u003e\n\u003cp\u003eIn the meantime, if you\u0026#39;re interested in more news and information regarding advisor technology, we\u0026#39;d highly recommend checking out \u003ca href=\"https://wmtoday.com/\"\u003eCraig Iskowitz\u0026#39;s \u0026#34;Wealth Management Today\u0026#34; blog\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;Weekend Reading For Financial Planners (July 26–27)\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-4a343db0a7c3b8d36b4ee1c2-=\"\"\u003e\n                    \u003cimg decoding=\"async\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\"/\u003e\n                    \u003c/a\u003e\n                \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "40 min read",
  "publishedTime": "2025-07-25T14:00:17-04:00",
  "modifiedTime": "2025-07-25T17:50:16Z"
}
