{
  "id": "871d4081-a3ea-4f3d-b0c1-89e20985761c",
  "title": "First Look At The New Kitces Members Section And The State Of The (Nerd’s Eye View) Blog",
  "link": "https://feeds.feedblitz.com/~/920946197/0/kitcesnerdseyeview~First-Look-At-The-New-Kitces-Members-Section-And-The-State-Of-The-Nerd%e2%80%99s-Eye-View-Blog/",
  "description": "The first quarter of 2025 brought a significant amount of turmoil for most financial advisory firms, as markets responded with high volatility to newly proposed tariffs – and advisors saw the challenging reality that in volatile markets, revenue dips while service demands from clients rise, as we're called (figuratively or literally) to help clients stayRead More... The post First Look At The New Kitces Members Section And The State Of The (Nerd’s Eye View) Blog first appeared on Kitces.com.",
  "author": "Michael Kitces",
  "published": "Mon, 30 Jun 2025 11:01:59 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Nerd's Eye View"
  ],
  "byline": "Michael Kitces",
  "length": 29522,
  "excerpt": "Kitces State of the Blog: A new members section, Directors Of Financial Planning (DFP) Community, newest Discovery Meetings course, and IAR CE intensives.",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary The first quarter of 2025 brought a significant amount of turmoil for most financial advisory firms, as markets responded with high volatility to newly proposed tariffs – and advisors saw the challenging reality that in volatile markets, revenue dips while service demands from clients rise, as we're called (figuratively or literally) to help clients stay the course through turbulent times. Yet in recent months, the volatility has subsided, markets have rallied back near their highs, and advisory firms are back to dealing with the increasingly common challenge of how to continue to scale service in the face of growth as clients continue to accrue over time. In recent years, the growth of Kitces.com has resulted in similar capacity constraints as our Members Section has grown by more than 20X since 2015, leading, in turn, to rapid growth of the team (from 2 to 25 team members since 2015), and ongoing reinvestments into technology. Which led us at the beginning of 2025 to announce a major new initiative for the year: to completely rebuild and replace our existing Members Section, which has struggled to keep pace with the growth of our Membership and the expanded breadth of our educational offerings to Members. And now as we come to the middle of the year, we're excited to announce a first-look opportunity to check out our new Members Section. The new design and main navigation is in place, and the team has already solved for some of the most common problems (from a pathway to join Kitces webinars live via our new dashboard – without needing to search through your email to find the link – to a new Group Administrator dashboard for larger firms that need to manage the subscription of multiple members using Kitces), with a long list of more Members Section enhancements to come in the second half of the year (from a new Learning Center to manage all of your CE completions and certificates, to a new CE catalog interface to make it easier to filter for the kind of content you're looking for and navigate to it more expediently). Those who want to check it out (and leave us feedback on what you like and where we still need to improve!) simply need to click the \"Experience What's New\" button in the upper left corner of the current Members Section! As we enter the midyear mark, the new Members Section isn't the only thing we spent the first half of the year building. We've also wrapped up the pilot for our new Directors of Financial Planning (DFP) Community, which is now open to any and all DFPs who want to join what is already a community of nearly 100 DFPs to share and collaborate on best practices in building and growing a centralized financial planning team and/or leading their firms' financial planning decisions (from what the 'right' client deliverables should be, to the best technology to select for a good client experience). As we also continue to expand our library of Kitces Training Courses (the new name for our MasterClasses, reflecting their intended focus to support Paraplanners and Associate Advisors) with a newly launched course on how to conduct a great Discovery Meeting with a new client, to be followed later this year by another on how to deliver a Financial Plan Presentation meeting. As we enter midyear, registration is now open for our annual IAR Ethics CE Day taking place on Thursday, August 28th. We've also announced a Save-The-Date for a second IAR CE Intensive Day later this year – on Thursday, October 30th, we'll host an \"IAR P\u0026P CE Day\" (covering the Products \u0026 Practice portion of the IAR CE requirement), with a particular focus on advanced tax and retirement planning. Which will now allow advicers to complete their full IAR CE obligation from our two CE Intensives, for those who would rather get their content through a live event than consume it incrementally through blog articles and webinars throughout the year. And yes, our IAR CE Intensives will still cross-apply CE credit for all other eligible CE types, including CFP, CPA, all the designations from IWI, College for Financial Planning, the American College, and more! In the meantime, our own Team of Nerds continues to expand. We recently hired several new team members, including Managing Editor Robert Long and Research Associate Karl VonZabern! If you're wondering how you can get more involved with the Kitces team, you can also sign up for our separate Career Opportunities mailing list (via our Career Opportunities page) to be notified when new positions open up! And for those who don't want to join the team full-time but would simply like to 'Nerd Out' with us for a bit and share what they do or know with their fellow advicers, remember to check out our \"How To Contribute\" page to see how you can engage with the Kitces platform as a guest writer, presenter, or podcast guest! Throughout it all, though, we remain focused on advancing our core mission – to \"Make Financial Advicers Better, And More Successful\" – through our four strategic pillars of supporting 'Nnovation of AdviorTech tools, delivering insightful Education, conducting original advicer Research, and facilitating the Development of financial advicer skills across the spectrum of experience and firm sizes (and yes… our organizational strategy does spell N-E-R-D☺). We look forward to continuing the journey with you in 2025 and beyond! Michael Kitces is Head of Planning Strategy at Focus Partners Wealth, which provides an evidence-based approach to private wealth management for near- and current retirees, and Focus Partners Advisor Solutions, a turnkey wealth management services provider supporting thousands of independent financial advisors through the scaling phase of growth. In addition, he is a co-founder of the XY Planning Network, AdvicePay, fpPathfinder, and New Planner Recruiting, the former Practitioner Editor of the Journal of Financial Planning, the host of the Financial Advisor Success podcast, and the publisher of the popular financial planning industry blog Nerd’s Eye View through his website Kitces.com, dedicated to advancing knowledge in financial planning. In 2010, Michael was recognized with one of the FPA’s “Heart of Financial Planning” awards for his dedication and work in advancing the profession. Read all of Michael’s articles here. First Look At The New Kitces Members Section For A Better Advicer Experience While Kitces.com and the Nerd's Eye View blog have been around since 2008, our current \"Members Section\" was not built until 2015, when we officially shifted from what was historically a premium newsletter service called The Kitces Report to instead delivering all of our written content for free via this Nerd's Eye View blog and rolling out our Kitces Members Section to provide CFP professionals with CE credit for all of the blog content they were already reading. Back then, the Members Section experience itself was very straightforward: read the blog, take the CE quiz, and we'd submit completed credit hours to the CFP Board on the advicer's behalf, all built directly into WordPress (the content management system we use to host the blog). However, the number of advicers using Kitces.com for their CE needs has literally grown more than 20X over the past decade, from under 1,000 to more than 20,000 today. In addition, the scope of our content has expanded beyond Nerd's Eye View blog articles and our long-standing The Kitces Report white papers. We now offer two webinars every month, our deeper-dive Training Courses for Associate Advisors and Paraplanners, various Practice Management resources, the ability to save articles from Nerd's Eye View and Suggest Topics that you'd like to see the Kitces team write about in the future, and more. And the breadth of CE types we offer has expanded as well, including the new IAR CE requirements for advisors working under an RIA, all the designations from The American College of Financial Services, the College for Financial Planning, and the Investments and Wealth Institute, along with CPE credits for CPAs and Enrolled Agents, and CE certificates to self-report for other CE-requiring organizations like NAPFA. All of which has made our Members Section increasingly difficult for financial advicers to navigate and find what they're looking for amidst a growing level of clutter (and increasingly difficult for us to maintain and scale as the numbers of advicers grew), culminating in your own Member feedback to our annual surveys that simply navigating the Members Section itself is now the worst part of being a Kitces Member. ☹ So earlier this year, we announced the start of a company-wide project to completely rebuild our Members Section from the ground up… and now, we're excited to give you a first look at what's been built so far (and a preview of what's still coming in the second half of the year!). First and foremost, we've tried to address some of the most common pain points that arise for Member feedback. You'll now be able to see at a glance where you stand on how much CE you've completed with Kitces for the year – from blog quizzes to live webinars, to any of our Training Courses you've enrolled in – and how many IAR CE hours you've earned. We've also streamlined access to our webinars – you'll now be able to access your personalized webinar link directly through the Members Section dashboard (just log in and click to join when the webinar is happening, or click in advance to add the webinar to your calendar with your personalized event link… no more digging through old emails trying to find the original confirmation with the right webinar link!). And we've fully rebuilt our Group Administrators dashboard for multi-advisor firms with a Group subscription to be able to purchase additional seats, change Group members, assign IAR CE access, and manage their payments and renewals all in one place. But that's just the starting point of this Members Section redesign! Our roadmap for the second half of the year includes: A centralized catalog of all of our CE-eligible content that will allow advicers to filter by topic (e.g., retirement or tax), content type (e.g., article or webinar), CE type (CFP, IAR, etc.), and more; An upgraded learning center that will allow you to see and manage all of your completed CE (webinar attendance history, CE quiz completions, download CE completion certificates on demand); A full events calendar of our webinars, Summits, and IAR CE Intensives so you can plan your CE for the year; and An improved CE quiz-and-reporting system that will allow us to submit CE on your behalf faster (and eventually for you to see, in real-time, the status of CE credits that were reported on your behalf). As we roll out this first look at our new Members Section, current members now have the opportunity to try it out! If you log into the Members Section, you can click on the \"Experience What’s New\" button in the upper left of the main navigation area, which will toggle between the current/original Members Section and the new redesign that we’re rolling out. So if you have a few moments, please try it out and let us know what you think. We're very focused on making sure these updates – and the new Members Section – really are a positive experience and an improvement over the current version! (There's a banner at the top of the new Members Section with a prompt to leave us feedback and share your thoughts on what you like or what you think we still need to work on!) We'll run the new Members Section in parallel with the existing one through the second half of the year, while we continue building out the remaining \"Coming Soon\" capabilities, allowing Members to choose which experience they prefer. Ultimately, there will be a full migration of all Members to the new experience as we head into the start of 2026 (which we aim to make as seamless as possible – with all existing member data migrated on your behalf!). The new Kitces Members Section experience is available for any Members who want to try it out in pilot, with more features coming in Q3 and Q4, and a full migration to the new experience heading into 2026! However, we're not going to be 'done' with just rebuilding the Members Section. A key aspect of this project was separating out our Members Section into a stand-alone application away from where it currently lives (on the back-end of our WordPress site)… which sets the stage for a broader redesign of this Nerd's Eye View blog in 2026 as well! We're cognizant that the blog has also become a bit dated in its design (what seemed so fresh and modern in 2015 is not so much in 2025!) and has similarly become more complex to navigate and find what you're looking for amidst the sheer breadth of our content. So design, navigation, search functionality, and more will be on the table for improvement in 2026. Stay tuned as we continue to reinvest into our future of serving educational content to make financial advicers better and more successful! Introducing Our Directors Of Financial Planning (DFP) Community And Expanded Kitces Masterclass Training Courses While the rebuilding of our Members Section has been a major company-wide project running throughout 2025, it's not the only way we're continuing to reinvest into the financial advicer community and in our efforts to make financial advicers better and more successful! When I first started in financial planning nearly 25 years ago, I took what was, at the time, a rather unconventional path. Rather than trying to prospect for my own client base, a few years into my career I took on a role as Director of Financial Planning at one of the early wealth management RIAs founded in the 1990s. I was tasked to build a department that would create and deliver all the financial plans to the clients of the firm, so the founders could focus on managing the business and bringing in more new clients (for us to deliver planning to) in order to grow the firm. In the years that followed, I had the amazing opportunity to deliver hundreds and hundreds of financial plans, set our client experience, build our financial planning process, and design client deliverables, while growing and training a wonderful team of financial planners. And yet, I struggled in total isolation – because, for years, I never met a single person who had a job title or description similar to mine. Most firms were simply too small to centralize financial planning the way ours had. In the years since, though, with the ongoing shift to assets-under-management and other recurring-revenue (e.g., subscription) business models, more and more advisory firms have grown their revenue to the point that they, too, can begin to hire Directors of Financial Planning – to centralize advisor training and development, plan construction and deliverables, and optimize financial planning technology and client experience. Which means there are now more and more Directors of Financial Planning… who are still largely isolated within their firms. Because even as larger advisory firms grow and hire more financial advisors, there is still only ever one Director of the department. And so in late 2024, we launched a pilot of our new Directors of Financial Planning (DFP) Community – created to provide a place for DFPs to share best practices and learn from one another about how best to build, scale, and systematize financial planner talent development across the organization. No solicitations or sponsors allowed – just private forums where DFPs can have conversations about best practices with one another, and monthly webinars where peers can share ideas and resources. Our DFP Community is built to fill the void that I experienced as our firm grew – a challenge so many other DFPs continue to face as they grow theirs. At the end of the second quarter, we successfully wrapped up our pilot phase, with great feedback from our initial cohort of DFPs who helped us shape everything from the forums to the format of the monthly gatherings. Now the DFP Community is open for general registration with a nominal cost (to help us cover our costs to set up and facilitate the community) at https://www.kitces.com/directors-of-financial-planning-community/. Notably, though, the goal is to keep the community focused on DFPs (or those with a substantively similar title),which means those in a leadership position who are responsible for firm-wide financial planning (from technology to client experience, firm deliverables to plan construction, advisor training and development). And to ensure the community remains focused, there is a brief application process, as we are screening to ensure that all members really are practicing DFPs! Our new Directors of Financial Planning (DFP) Community is now open for sign-ups… but only for those in a DFP (or substantively similar) role who are responsible for firm-wide financial planning decisions at the leadership level and in search of best-practices conversations with peers about how to do it! If you're a DFP, register here to join 100+ other DFPs and become part of the community! Ultimately, I believe that as more and more financial planning jobs are created in larger advisory firms that are scaling up, Directors of Financial Planning will become key positions that help to shape the future of the financial planning profession. And so, consistent with our mission of \"Making Financial Advicers Better and More Successful\", we want to do what we can to help support the crucial DFPs who are helping to shape that future, too! Expanding Our Kitces MasterClass Training Courses On How To Conduct Discovery, Plan Presentation, And Review Meetings Kitces.com has long been known for providing advanced financial planning content for experienced advisors – or as we sometimes joke, \"continuing education that actually teaches you something\" – where advisors often come to us after they begin to get bored with sponsored CE that isn't very educational or have become tired of consuming articles and webinars that just don't go deep enough to learn anything new as an experienced practitioner. Yet the reality of our mission, \"Making Financial Advicers Better and More Successful\", was never meant to be specific to the most experienced advisors. That just happened to be who came to us first in the early years of Kitces.com. Over the past decade, we've had an increasing number of advisors who are earlier in their career – those who have earned their CFP marks but have limited 'real-world' experience with clients – who want to learn how to level-up their own practice or career, and get to the level of competency and experience to be the traditional experienced-advisor Kitces reader. And so, in 2021, we began to build a series of skills-development Kitces Courses specifically designed for earlier-stage advisors (e.g., those in their first five years of experience) using a case-study-based learning format to provide more opportunities to practice with real-world scenarios. In the years since, we've built out a series of 4–6 hour Courses in specific practical areas that advicers commonly face, starting with how to review a client's tax return, or their estate documents, or their life insurance policies, and then we shifted to optimizing key aspects of a client's retirement plan (Social Security, Roth conversions, and tax-efficient portfolio withdrawals). Now in 2025, we've moved on to teaching advicers how to manage key client meetings, starting with the Discovery Meeting, then the Plan Presentation Meeting, and finally the ongoing Client Review Meeting. In fact, our newest Discovery Meetings course just launched last week and is now available to all, with our Plan Presentation Meeting course due out toward the end of the year, and our Review Meeting course rolling out in the first half of 2026, as our lineup of Training Courses continues to expand! Notably, though, we have gone through a slight rebrand of our Courses – what we previously called \"MasterClasses\" we are now calling \"Training Courses\" instead. The content itself has not changed at all, nor has our case-study-based skills-development orientation; however, the intent of our Courses from the start was to help newer and less experienced advisors (Paraplanners, Associate Advisors, and newly launched solo Advisors), and we found that the \"MasterClasses\" label was attracting more experienced advisors to take the Courses themselves (instead of having them send their Associate Advisors to learn!). So it is our hope that the \"Training Courses\" label helps the advicer community better understand which advicers should sign up (or who in the firm should be referred to take our Courses). Ultimately, though, our goal is nothing short of becoming the training platform for the next generation of financial advicers. A place where advisory firms that simply don't have the time and capacity to train new Associate Advisors and Paraplanners (on top of everything else it takes to serve clients and run the business) can turn to save themselves time on training. And a place where larger enterprises and their financial planning leadership can turn to build out the core of their financial planner training curriculum from pre-built Kitces content (saving themselves time to only need to develop their own firm-specific elements around the rest of a training curriculum that Kitces already provides). Going forward, Kitces MasterClasses will now be known as Kitces Training Courses, built specifically to help busy advisory firm owners have a place to send their Paraplanners and Associate Advisors to supplement the new advisors' learnings (or perhaps to come to brush up for themselves!). And now, our latest Kitces Training Course, on how to conduct a Discovery Meeting with a new client, is available at this link. The Return Of IAR Ethics CE Day, And A Second (IAR) CE Intensive! Back in 2022, the first three states (Maryland, Mississippi, and Vermont) rolled out a new 12-hours-per-year continuing education requirement for Investment Adviser Representatives (IARs) of RIAs, codifying a Model Rule that NASAA had promulgated in 2020. In the years since, more and more states have implemented the Model Rule as well, such that by 2025, nearly half (21 out of 50 states, plus the District of Columbia and the Virgin Islands) have put the requirement in place. Though, in reality, more than half of all financial advisors working at RIAs are now affected, given the rule's rollout in some of the largest states (e.g., California and Florida in 2024) and the fact that IARs are subject to the new CE requirement as long as they meet the de minimis number of clients in any state that has enacted the rule (which impacts a huge number of advisors who simply have more than five clients who have retired to Florida!). To meet the demand for this new form of CE in 2022, Kitces.com became one of the first IAR CE providers and began qualifying all of our Nerd's Eye View written content for IAR CE (in addition to all the other CE types we offer), with an aim to cover each of the two required IAR CE categories: six hours of Ethics and Professional Responsibility (or \"IAR Ethics\"), and six hours of Products \u0026 Practice (or \"IAR P\u0026P\"). In practice, most existing CFP CE content qualifies for IAR P\u0026P. As a result, nearly all of our blog CE catalog was already eligible (and over the years, we've expanded further to make our webinars and Training Courses eligible for IAR P\u0026P CE as well). However, very little of our (or any CE provider's) existing content qualified for IAR Ethics, which must pertain very specifically to RIA compliance and the ethical and professional responsibilities that IARs have to their clients – including not just fulfilling the letter but also the spirit of their compliance obligations. To fill this void, we began (and continue) to publish blog posts eligible for IAR Ethics CE – enough to cover the annual six-hour IAR Ethics requirement). In 2023, we expanded further by launching our \"Annual IAR Ethics CE Day\", a single full-day virtual program where advicers could fulfill all six hours of their IAR Ethics CE requirement (which, in practice, still seems to be the hardest to find content for!). We've repeated that IAR Ethics CE Day every year since. And now, in 2025, we're going one step further with the rollout of a second full-day virtual IAR CE program to cover the six-hour IAR P\u0026P requirement as well. These two \"CE Intensives\" (as each of these six-hour virtual programs is… well, CE intensive!) will now serve as core offerings in our annual calendar of virtual programs. They provide a video/webinar-based alternative for those who would rather knock out the P\u0026P obligation in a single day, rather than do it with one webinar or blog article at a time throughout the year. And they will feature a particular focus on the topic areas that have long been most popular on Kitces.com: tax and retirement planning. For those who are interested, our advance registration is now open for our IAR Ethics CE Day, taking place on Thursday, August 28th, from 11:30AM to 6:30PM (ET). Pricing is as follows: General registration: $247 for the full day of live content Kitces Premier Members: $197 Dual registration (IAR CE Day and joining the Kitces Members Section): $386 (valued at $436 when priced separately) IAR CE reporting fees: Included in the registration fee Discounts are also available for multi-advisor groups by contacting [email protected]. The date is also set for our second IAR P\u0026P CE Intensive, scheduled for Thursday, October 30th. Pricing will be similar to IAR Ethics CE Day, and registration will open in August! SAVE THE DATES: Kitces will run two IAR CE Intensives in 2025 – IAR Ethics CE Day on Thursday August 28th, followed by IAR P\u0026P CE Day on Thursday, October 30th. Each full-day event covers half of the 12-hour IAR CE requirement: the first event for the six hours of Ethics \u0026 Professional Responsibility and a second event for the six hours of Products \u0026 Practice. Perfect for advicers who prefer a live, intensive format to fulfill each obligation in a single-day format rather than consuming throughout the year via Members Section webinars and blog articles! Registration for IAR Ethics CE Day is now open here, with discounts available for Kitces Members and firms that want to register multiple advisors at once! IAR P\u0026P CE Day registration will open in August for the October event! Ongoing Growth Of Kitces And Its Team Of Nerds… As the updates above hopefully highlight, we are actively investing into the platform and programs it takes for Kitces.com to continue to grow for many years to come. Yet the reality is that, because we are first and foremost a provider of education and professional development, the core of our business is not the technology platform or the CE and practice management programs we run… it's the people who make it all happen. Which means that as our offerings to make financial advicers better and more successful continue to expand, so too has the Kitces team, now up to 25 team members (and nearly half a dozen more in various part-time contractor roles). These are the people who not only create all of our various types of Kitces content but also manage our live events, administer our CE reporting, support Members when they have questions, develop the code that runs our back-end systems, and provide the leadership that ensures that we keep running efficiently as a team! In fact, we've added several team members in just the past six months, including new Managing Editor Robert Long, and Research Associate Karl VonZabern! As our team continues to expand, future openings will be posted to our Kitces Career Opportunities page, and those who want to stay apprised of future openings with the Kitces Team can sign up for the Kitces Careers mailing list to be notified as each new role opens up, too! All in continued pursuit of our mission at Kitces.com – to Make Financial Advicers Better, and More Successful, through our N-E-R-D-y organizational strategy: supporting 'Nnovation of AdvisorTech tools, delivering Educational Insights, conducting Research on Advicers, and supporting the Development of Advicer skills. And notably, while we remain as committed as ever to creating our style of Quality, Nerdy, and Relevant content for the financial advicer community with our team of nerds, there are also plenty of opportunities for Advisors themselves to get involved or become contributors. So if you have some expertise or a best practice you'd like to share through the Kitces platform, you can do so as a writer, a guest who provides a demonstration via our podcast or Summits, or by developing a formal presentation to be a paid speaker! We encourage advicers to take a chance and submit their prospective contribution if any of our opportunities sound like a good fit (click here for the details on how, for each of our various contributor options, you can get started now!) – after all, we only grow as an advicer community by sharing our insights and solutions with others! (But it's totally OK to simply keep following the content journey with us!) If there's anything else you think we should be working on that we've missed, please share your thoughts in the comments below! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2025/06/Social-Image-State-Of-The-Blog-June-2025.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003eThe first quarter of 2025 brought a significant amount of turmoil for most financial advisory firms, as markets responded with high volatility to newly proposed tariffs – and advisors saw the challenging reality that in volatile markets, revenue dips while service demands from clients rise, as we\u0026#39;re called (figuratively or literally) to help clients stay the course through turbulent times. Yet in recent months, the volatility has subsided, markets have rallied back near their highs, and advisory firms are back to dealing with the increasingly common challenge of how to continue to scale service in the face of growth as clients continue to accrue over time.\u003c/p\u003e\n\u003cp\u003eIn recent years, the growth of Kitces.com has resulted in similar capacity constraints as our Members Section has grown by more than 20X since 2015, leading, in turn, to rapid growth of the team (from 2 to 25 team members since 2015), and ongoing reinvestments into technology. Which led us \u003cstrong\u003eat the beginning of 2025 to announce a major new initiative for the year: to completely rebuild and replace our existing Members Section\u003c/strong\u003e, which has struggled to keep pace with the growth of our Membership and the expanded breadth of our educational offerings to Members.\u003c/p\u003e\n\u003cp\u003eAnd now as we come to the middle of the year, \u003cstrong\u003ewe\u0026#39;re excited to announce a first-look opportunity to check out our new Members Section\u003c/strong\u003e. The new design and main navigation is in place, and the team has already solved for some of the most common problems (from a pathway to join Kitces webinars live via our new dashboard – without needing to search through your email to find the link – to a new Group Administrator dashboard for larger firms that need to manage the subscription of multiple members using Kitces), with \u003cstrong\u003ea long list of more Members Section enhancements to come in the second half of the year\u003c/strong\u003e (from a new Learning Center to manage all of your CE completions and certificates, to a new CE catalog interface to make it easier to filter for the kind of content you\u0026#39;re looking for and navigate to it more expediently). Those who want to check it out (and leave us feedback on what you like and where we still need to improve!) simply need to \u003cstrong\u003eclick the \u0026#34;Experience What\u0026#39;s New\u0026#34; button in the upper left corner of the current Members Section\u003c/strong\u003e!\u003c/p\u003e\n\u003cp\u003eAs we enter the midyear mark, the new Members Section isn\u0026#39;t the only thing we spent the first half of the year building. \u003cstrong\u003eWe\u0026#39;ve also wrapped up the pilot for our new Directors of Financial Planning (DFP) Community, which is now open to any and all DFPs\u003c/strong\u003e who want to join what is already a community of nearly 100 DFPs to share and collaborate on best practices in building and growing a centralized financial planning team and/or leading their firms\u0026#39; financial planning decisions (from what the \u0026#39;right\u0026#39; client deliverables should be, to the best technology to select for a good client experience). As we also \u003cstrong\u003econtinue to expand our library of Kitces Training Courses (the new name for our MasterClasses, reflecting their intended focus to support Paraplanners and Associate Advisors)\u003c/strong\u003e with a \u003cstrong\u003enewly launched course on how to conduct a great Discovery Meeting with a new client\u003c/strong\u003e, to be followed later this year by another on how to deliver a Financial Plan Presentation meeting.\u003c/p\u003e\n\u003cp\u003eAs we enter midyear, \u003cstrong\u003eregistration is now open for our annual IAR Ethics CE Day taking place on Thursday, August 28th. \u003c/strong\u003eWe\u0026#39;ve also announced a \u003cstrong\u003eSave-The-Date for a second IAR CE Intensive Day later this year – on Thursday, October 30th, we\u0026#39;ll host an \u0026#34;IAR P\u0026amp;P CE Day\u0026#34;\u003c/strong\u003e (covering the Products \u0026amp; Practice portion of the IAR CE requirement), with a particular focus on advanced tax and retirement planning. Which will now allow advicers to complete their full IAR CE obligation from our two CE Intensives, for those who would rather get their content through a live event than consume it incrementally through blog articles and webinars throughout the year. And yes, \u003cstrong\u003eour IAR CE Intensives will still cross-apply CE credit for all other eligible CE types, including CFP, CPA, all the designations\u003c/strong\u003e from IWI, College for Financial Planning, the American College, and more!\u003c/p\u003e\n\u003cp\u003eIn the meantime, our own Team of Nerds continues to expand. We recently hired several new team members, including Managing Editor Robert Long and Research Associate Karl VonZabern! \u003cstrong\u003eIf you\u0026#39;re wondering how you can get more involved with the Kitces team, you can also sign up for our separate Career Opportunities mailing list\u003c/strong\u003e (via our Career Opportunities page) to be notified when new positions open up! And for those who don\u0026#39;t want to join the team full-time but would simply like to \u0026#39;Nerd Out\u0026#39; with us for a bit and share what they do or know with their fellow advicers, \u003cstrong\u003eremember to check out our \u0026#34;How To Contribute\u0026#34; page to see how you can engage with the Kitces platform as a guest writer, presenter, or podcast guest\u003c/strong\u003e!\u003c/p\u003e\n\u003cp\u003eThroughout it all, though, we remain focused on advancing our core mission – to \u0026#34;Make Financial Advicers Better, And More Successful\u0026#34; – through our four strategic pillars of supporting \u0026#39;\u003cstrong\u003eN\u003c/strong\u003enovation of AdviorTech tools, delivering insightful \u003cstrong\u003eE\u003c/strong\u003education, conducting original advicer \u003cstrong\u003eR\u003c/strong\u003eesearch, and facilitating the \u003cstrong\u003eD\u003c/strong\u003eevelopment of financial advicer skills across the spectrum of experience and firm sizes (and yes… our organizational strategy does spell N-E-R-D☺). We look forward to continuing the journey with you in 2025 and beyond!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg width=\"200\" height=\"200\" data-src=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg\" alt=\"Michael Kitces\" decoding=\"async\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-300x300.jpg 300w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-768x768.jpg 768w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-800x800.jpg 800w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP.jpg 1022w\" data-sizes=\"(max-width: 200px) 100vw, 200px\" src=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg\" srcset=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-300x300.jpg 300w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-768x768.jpg 768w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-800x800.jpg 800w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP.jpg 1022w\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eMichael Kitces is Head of Planning Strategy at \u003ca href=\"https://wealth.focuspartners.com/michael-kitces?utm_campaign=ForConsumers\u0026amp;utm_id=Kitces\u0026amp;utm_medium=KitcesReferral\u0026amp;utm_source=Kitces\"\u003eFocus Partners Wealth\u003c/a\u003e, which provides an evidence-based approach to private wealth management for near- and current retirees, and \u003ca href=\"https://advisor.focuspartners.com/kitces/?utm_source=Kitces\u0026amp;utm_medium=KitcesReferral\u0026amp;utm_campaign=ForConsumers\u0026amp;utm_id=Kitces\"\u003eFocus Partners Advisor Solutions\u003c/a\u003e, a turnkey wealth management services provider supporting thousands of independent financial advisors through the scaling phase of growth.\u003c/p\u003e\n\u003cp\u003eIn addition, he is a co-founder of the \u003ca href=\"https://www.xyplanningnetwork.com/\"\u003eXY Planning Network\u003c/a\u003e, \u003ca href=\"https://advicepay.com/\"\u003eAdvicePay\u003c/a\u003e, \u003ca href=\"https://www.fppathfinder.com/\" target=\"_blank\" rel=\"noopener\"\u003efpPathfinder\u003c/a\u003e, and \u003ca href=\"https://newplannerrecruiting.com/\"\u003eNew Planner Recruiting\u003c/a\u003e, the former Practitioner Editor of the Journal of Financial Planning, the host of the \u003cem\u003eFinancial Advisor Success \u003c/em\u003epodcast, and the publisher of \u003ca href=\"https://www.kitces.com/blog/\"\u003ethe popular financial planning industry blog \u003cem\u003eNerd’s Eye View\u003c/em\u003e\u003c/a\u003e through his website \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e, dedicated to advancing knowledge in financial planning. In 2010, Michael was recognized with one of the FPA’s “Heart of Financial Planning” awards for his dedication and work in advancing the profession.\u003c/p\u003e\n\u003cp\u003eRead all of Michael’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=13\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\" target=\"_blank\" rel=\"noopener\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003ch2 data-nav-title=\"First Look At New Kitces Members Section\" id=\"first-look-at-the-new-kitces-members-section-for-a-better-advicer-experience\"\u003eFirst Look At The New Kitces Members Section For A Better Advicer Experience\u003c/h2\u003e\n\u003cp\u003eWhile Kitces.com and the Nerd\u0026#39;s Eye View blog have been around since 2008, our current \u0026#34;Members Section\u0026#34; was not built until 2015, when we officially shifted from what was historically a premium newsletter service called \u003cem\u003eThe Kitces Report \u003c/em\u003eto instead delivering all of our written content for free via this \u003cem\u003eNerd\u0026#39;s Eye View \u003c/em\u003eblog and rolling out our Kitces Members Section to provide CFP professionals with CE credit for all of the blog content they were already reading.\u003c/p\u003e\n\u003cp\u003eBack then, the Members Section experience itself was very straightforward: read the blog, take the CE quiz, and we\u0026#39;d submit completed credit hours to the CFP Board on the advicer\u0026#39;s behalf, all built directly into WordPress (the content management system we use to host the blog).\u003c/p\u003e\n\u003cp\u003eHowever, the number of advicers using Kitces.com for their CE needs has literally grown more than 20X over the past decade, from under 1,000 to more than 20,000 today. In addition, the scope of our content has expanded beyond Nerd\u0026#39;s Eye View blog articles and our long-standing \u003cem\u003eThe Kitces Report \u003c/em\u003ewhite papers. We now offer \u003ca href=\"https://www.kitces.com/kitces-events/\"\u003etwo webinars every month\u003c/a\u003e, our deeper-dive \u003ca href=\"https://www.kitces.com/kitces-online-ce-courses-for-financial-advisors/\"\u003eTraining Courses\u003c/a\u003e for Associate Advisors and Paraplanners, various Practice Management resources, the ability to save articles from Nerd\u0026#39;s Eye View and \u003ca href=\"https://www.kitces.com/member/suggest-topics-for-kitces/\"\u003eSuggest Topics\u003c/a\u003e that you\u0026#39;d like to see the Kitces team write about in the future, and more.\u003c/p\u003e\n\u003cp\u003eAnd the breadth of CE types we offer has expanded as well, including \u003ca href=\"https://www.kitces.com/kitces-iar-ce-faqs/\"\u003ethe new IAR CE requirements for advisors working under an RIA\u003c/a\u003e, all the designations from \u003ca href=\"https://www.theamericancollege.edu/\"\u003eThe American College of Financial Services\u003c/a\u003e, the \u003ca href=\"https://www.cffp.edu/\"\u003eCollege for Financial Planning\u003c/a\u003e, and the \u003ca href=\"https://investmentsandwealth.org/\"\u003eInvestments and Wealth Institute\u003c/a\u003e, along with \u003ca href=\"https://www.cpecredit.com/\"\u003eCPE credits\u003c/a\u003e for CPAs and Enrolled Agents, and CE certificates to self-report for other CE-requiring organizations like \u003ca href=\"https://www.napfa.org/\"\u003eNAPFA\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Continuing Education Approved Providers\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers.png\" alt=\"Continuing Education Approved Providers\" width=\"3228\" height=\"304\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers.png 3228w, https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers-300x28.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers-1024x96.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers-768x72.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers-1536x145.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers-2048x193.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers-2000x188.png 2000w\" data-sizes=\"auto, (max-width: 3228px) 100vw, 3228px\" src=\"https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers.png\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers.png 3228w, https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers-300x28.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers-1024x96.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers-768x72.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers-1536x145.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers-2048x193.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/01-Continuing-Education-Approved-Providers-2000x188.png 2000w\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAll of which has made our Members Section increasingly difficult for financial advicers to navigate and find what they\u0026#39;re looking for amidst a growing level of clutter (and increasingly difficult for us to maintain and scale as the numbers of advicers grew), culminating in \u003ca href=\"https://www.kitces.com/blog/rebuilding-members-section-kitces-state-of-the-blog-nerds-eye-view-2025-announcements-news/\"\u003eyour own Member feedback to our annual surveys that simply navigating the Members Section itself is now the \u003cem\u003eworst \u003c/em\u003epart of being a Kitces Member\u003c/a\u003e. ☹\u003c/p\u003e\n\u003cp\u003eSo \u003ca href=\"https://www.kitces.com/blog/rebuilding-members-section-kitces-state-of-the-blog-nerds-eye-view-2025-announcements-news/\"\u003eearlier this year, we announced the start of a company-wide project to completely rebuild our Members Section\u003c/a\u003e from the ground up… and now, we\u0026#39;re excited to give you a first look at what\u0026#39;s been built so far (and a preview of what\u0026#39;s still coming in the second half of the year!).\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Changes To Kitces Members Section\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section.png\" alt=\"Changes To Kitces Members Section\" width=\"2560\" height=\"1938\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section.png 2560w, https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section-300x227.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section-1024x775.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section-768x581.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section-1536x1163.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section-2048x1550.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section-2000x1514.png 2000w\" data-sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" src=\"https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section.png\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section.png 2560w, https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section-300x227.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section-1024x775.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section-768x581.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section-1536x1163.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section-2048x1550.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/02-Changes-To-Kitces-Members-Section-2000x1514.png 2000w\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eFirst and foremost, we\u0026#39;ve tried to address some of the most common pain points that arise for Member feedback. You\u0026#39;ll now be able to see at a glance where you stand on how much CE you\u0026#39;ve completed with Kitces for the year – from blog quizzes to live webinars, to any of our Training Courses you\u0026#39;ve enrolled in – and how many IAR CE hours you\u0026#39;ve earned. We\u0026#39;ve also streamlined access to our webinars – you\u0026#39;ll now be able to access your personalized webinar link directly through the Members Section dashboard (just log in and click to join when the webinar is happening, or click in advance to add the webinar to your calendar with your personalized event link… no more digging through old emails trying to find the original confirmation with the right webinar link!). And we\u0026#39;ve fully rebuilt our Group Administrators dashboard for \u003ca href=\"https://www.kitces.com/group-subscriptions/\"\u003emulti-advisor firms with a Group subscription\u003c/a\u003e to be able to purchase additional seats, change Group members, assign IAR CE access, and manage their payments and renewals all in one place.\u003c/p\u003e\n\u003cp\u003eBut that\u0026#39;s just the starting point of this Members Section redesign! Our roadmap for the second half of the year includes:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA \u003cstrong\u003ecentralized catalog of all of our CE-eligible content\u003c/strong\u003e that will allow advicers to filter by topic (e.g., retirement or tax), content type (e.g., article or webinar), CE type (CFP, IAR, etc.), and more;\u003c/li\u003e\n\u003cli\u003eAn \u003cstrong\u003eupgraded learning center that will allow you to see and manage all of your completed CE \u003c/strong\u003e(webinar attendance history, CE quiz completions, download CE completion certificates on demand);\u003c/li\u003e\n\u003cli\u003eA \u003cstrong\u003efull events calendar\u003c/strong\u003e of our webinars, Summits, and IAR CE Intensives so you can plan your CE for the year; and\u003c/li\u003e\n\u003cli\u003eAn \u003cstrong\u003eimproved CE quiz-and-reporting system\u003c/strong\u003e that will allow us to submit CE on your behalf faster (and eventually for you to see, in real-time, the status of CE credits that were reported on your behalf).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"A Kitces Members Section Redesign\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign.png\" alt=\"A Kitces Members Section Redesign\" width=\"3126\" height=\"4298\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign.png 3126w, https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign-218x300.png 218w, https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign-745x1024.png 745w, https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign-768x1056.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign-1117x1536.png 1117w, https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign-1490x2048.png 1490w, https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign-1455x2000.png 1455w\" data-sizes=\"auto, (max-width: 3126px) 100vw, 3126px\" src=\"https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign.png\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign.png 3126w, https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign-218x300.png 218w, https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign-745x1024.png 745w, https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign-768x1056.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign-1117x1536.png 1117w, https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign-1490x2048.png 1490w, https://www.kitces.com/wp-content/uploads/2025/06/03A-Kitces-Members-Section-Redesign-1455x2000.png 1455w\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAs we roll out this first look at our new Members Section, current members now have the opportunity to try it out! If you log into the Members Section, you can click on the \u0026#34;Experience What’s New\u0026#34; button in the upper left of the main navigation area, which will toggle between the current/original Members Section and the new redesign that we’re rolling out.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Experience Whats New\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New.png\" alt=\"Experience Whats New\" width=\"3126\" height=\"2038\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New.png 3126w, https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New-300x196.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New-1024x668.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New-768x501.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New-1536x1001.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New-2048x1335.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New-2000x1304.png 2000w\" data-sizes=\"auto, (max-width: 3126px) 100vw, 3126px\" src=\"https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New.png\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New.png 3126w, https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New-300x196.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New-1024x668.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New-768x501.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New-1536x1001.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New-2048x1335.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/04-Experience-Whats-New-2000x1304.png 2000w\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eSo if you have a few moments, please try it out and let us know what you think. We\u0026#39;re very focused on making sure these updates – and the new Members Section – really are a positive experience and an improvement over the current version! (There\u0026#39;s a banner at the top of the new Members Section with a prompt to leave us feedback and share your thoughts on what you like or what you think we still need to work on!)\u003c/p\u003e\n\u003cp\u003eWe\u0026#39;ll run the new Members Section in parallel with the existing one through the second half of the year, while we continue building out the remaining \u0026#34;Coming Soon\u0026#34; capabilities, allowing Members to choose which experience they prefer. Ultimately, there will be a full migration of all Members to the new experience as we head into the start of 2026 (which we aim to make as seamless as possible – with all existing member data migrated on your behalf!).\u003c/p\u003e\n\u003cfigure\u003e\n\u003cblockquote\u003e\u003cp\u003eThe new Kitces Members Section experience is available for any Members who want to try it out in pilot, with more features coming in Q3 and Q4, and a full migration to the new experience heading into 2026!\u003c/p\u003e\u003c/blockquote\u003e\n\u003c/figure\u003e\n\u003cp\u003eHowever, we\u0026#39;re not going to be \u0026#39;done\u0026#39; with just rebuilding the Members Section. A key aspect of this project was separating out our Members Section into a stand-alone application away from where it currently lives (on the back-end of our WordPress site)… which sets the stage for a broader redesign of this Nerd\u0026#39;s Eye View blog in 2026 as well! We\u0026#39;re cognizant that the blog has also become a bit dated in its design (what seemed so fresh and modern in 2015 is not so much in 2025!) and has similarly become more complex to navigate and find what you\u0026#39;re looking for amidst the sheer breadth of our content. So design, navigation, search functionality, and more will be on the table for improvement in 2026. Stay tuned as we continue to reinvest into our future of serving educational content to make financial advicers better and more successful!\u003c/p\u003e\n\u003ch2 data-nav-title=\"Directors Of Financial Planning (DFP)\" id=\"introducing-our-directors-of-financial-planning-dfp-community-and-expanded-kitces-masterclass-training-courses\"\u003eIntroducing Our Directors Of Financial Planning (DFP) Community And Expanded Kitces \u003cspan\u003eMasterclass\u003c/span\u003e \u003cem\u003eTraining\u003c/em\u003e Courses\u003c/h2\u003e\n\u003cp\u003eWhile the rebuilding of our Members Section has been a \u003cem\u003emajor \u003c/em\u003ecompany-wide project running throughout 2025, it\u0026#39;s not the only way we\u0026#39;re continuing to reinvest into the financial advicer community and in our efforts to make financial advicers better and more successful!\u003c/p\u003e\n\n\u003cp\u003eWhen I first started in financial planning nearly 25 years ago, I took what was, at the time, a rather unconventional path. Rather than trying to prospect for my own client base, a few years into my career I took on a role as Director of Financial Planning at one of the early wealth management RIAs founded in the 1990s. I was tasked to build a department that would create and deliver all the financial plans to the clients of the firm, so the founders could focus on managing the business and bringing in more new clients (for us to deliver planning to) in order to grow the firm.\u003c/p\u003e\n\u003cp\u003eIn the years that followed, I had the amazing opportunity to deliver hundreds and hundreds of financial plans, set our client experience, build our financial planning process, and design client deliverables, while growing and training a wonderful team of financial planners. And yet, I struggled in total isolation – because, for years, I never met a single person who had a job title or description similar to mine. Most firms were simply too small to centralize financial planning the way ours had.\u003c/p\u003e\n\u003cp\u003eIn the years since, though, with the ongoing shift to assets-under-management and other recurring-revenue (e.g., subscription) business models, more and more advisory firms have grown their revenue to the point that they, too, can begin to hire Directors of Financial Planning – to centralize advisor training and development, plan construction and deliverables, and optimize financial planning technology and client experience.\u003c/p\u003e\n\u003cp\u003eWhich means there are now more and more Directors of Financial Planning… who are still largely isolated within their firms. Because even as larger advisory firms grow and hire more financial advisors, there is still only ever one Director of the department.\u003c/p\u003e\n\u003cp\u003eAnd so in late 2024, we launched a pilot of our new Directors of Financial Planning (DFP) Community – created to provide a place for DFPs to share best practices and learn from one another about how best to build, scale, and systematize financial planner talent development across the organization. No solicitations or sponsors allowed – just private forums where DFPs can have conversations about best practices with one another, and monthly webinars where peers can share ideas and resources.\u003c/p\u003e\n\u003cp\u003eOur DFP Community is built to fill the void that I experienced as our firm grew – a challenge so many other DFPs continue to face as they grow theirs.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Kitces Directors Of Financial Planning Community\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community.png\" alt=\"Kitces Directors Of Financial Planning Community\" width=\"3126\" height=\"2038\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community.png 3126w, https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community-300x196.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community-1024x668.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community-768x501.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community-1536x1001.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community-2048x1335.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community-2000x1304.png 2000w\" data-sizes=\"auto, (max-width: 3126px) 100vw, 3126px\" src=\"https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community.png\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community.png 3126w, https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community-300x196.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community-1024x668.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community-768x501.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community-1536x1001.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community-2048x1335.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/05-Kitces-Directors-Of-Financial-Planning-Community-2000x1304.png 2000w\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAt the end of the second quarter, we successfully wrapped up our pilot phase, with great feedback from our initial cohort of DFPs who helped us shape everything from the forums to the format of the monthly gatherings. Now the DFP Community is open for general registration with a nominal cost (to help us cover our costs to set up and facilitate the community) at \u003ca href=\"https://www.kitces.com/directors-of-financial-planning-community/\"\u003ehttps://www.kitces.com/directors-of-financial-planning-community/\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eNotably, though, the goal is to keep the community focused on DFPs (or those with a substantively similar title),which means those in a leadership position who are responsible for firm-wide financial planning (from technology to client experience, firm deliverables to plan construction, advisor training and development). And to ensure the community remains focused, there is a brief application process, as we are screening to ensure that all members really are practicing DFPs!\u003c/p\u003e\n\u003cfigure\u003e\n\u003cblockquote\u003e\u003cp\u003eOur new Directors of Financial Planning (DFP) Community is now open for sign-ups… but only for those in a DFP (or substantively similar) role who are responsible for firm-wide financial planning decisions at the leadership level and in search of best-practices conversations with peers about how to do it! If you\u0026#39;re a DFP, \u003ca href=\"https://www.kitces.com/directors-of-financial-planning-community/\"\u003eregister here to join 100+ other DFPs and become part of the community\u003c/a\u003e!\u003c/p\u003e\u003c/blockquote\u003e\n\u003c/figure\u003e\n\u003cp\u003eUltimately, I believe that as more and more financial planning jobs are created in larger advisory firms that are scaling up, Directors of Financial Planning will become key positions that help to shape the future of the financial planning profession. And so, consistent with our mission of \u0026#34;Making Financial Advicers Better and More Successful\u0026#34;, we want to do what we can to help support the crucial DFPs who are helping to shape that future, too!\u003c/p\u003e\n\u003ch3 data-nav-title=\"Expanding Our Kitces Training Courses\" id=\"expanding-our-kitces-masterclass-training-courses-on-how-to-conduct-discovery-plan-presentation-and-review-meetings\"\u003eExpanding Our Kitces \u003cspan\u003eMasterClass\u003c/span\u003e Training Courses On How To Conduct Discovery, Plan Presentation, And Review Meetings\u003c/h3\u003e\n\u003cp\u003eKitces.com has long been known for providing advanced financial planning content for experienced advisors – or as we sometimes joke, \u0026#34;continuing education that \u003cem\u003eactually \u003c/em\u003eteaches you something\u0026#34; – where advisors often come to us after they begin to get bored with sponsored CE that isn\u0026#39;t very educational or have become tired of consuming articles and webinars that just don\u0026#39;t go deep enough to learn anything new as an experienced practitioner.\u003c/p\u003e\n\u003cp\u003eYet the reality of our mission, \u0026#34;Making Financial Advicers Better and More Successful\u0026#34;, was never meant to be specific to the most experienced advisors. That just happened to be who came to us first in the early years of Kitces.com. Over the past decade, we\u0026#39;ve had an increasing number of advisors who are earlier in their career – those who have earned their CFP marks but have limited \u0026#39;real-world\u0026#39; experience with clients – who want to learn how to level-up their own practice or career, and get to the level of competency and experience to \u003cem\u003ebe \u003c/em\u003ethe traditional experienced-advisor Kitces reader.\u003c/p\u003e\n\u003cp\u003eAnd so, in 2021, we began to build a series of skills-development Kitces Courses specifically designed for earlier-stage advisors (e.g., those in their first five years of experience) using a case-study-based learning format to provide more opportunities to practice with real-world scenarios. In the years since, we\u0026#39;ve built out a series of 4–6 hour Courses in specific practical areas that advicers commonly face, starting with how to review a client\u0026#39;s tax return, or their estate documents, or their life insurance policies, and then we shifted to optimizing key aspects of a client\u0026#39;s retirement plan (\u003ca href=\"https://www.kitces.com/social-security-optimization-course/\"\u003eSocial Security\u003c/a\u003e, \u003ca href=\"https://www.kitces.com/roth-conversions-course/\"\u003eRoth conversions\u003c/a\u003e, and \u003ca href=\"https://www.kitces.com/retirement-withdrawals-course/\"\u003etax-efficient portfolio withdrawals\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eNow in 2025, we\u0026#39;ve moved on to teaching advicers how to manage key client meetings, starting with the Discovery Meeting, then the Plan Presentation Meeting, and finally the ongoing Client Review Meeting. In fact, \u003ca href=\"https://www.kitces.com/discovery-meetings-course/\"\u003eour newest Discovery Meetings course just launched last week and is now available to all\u003c/a\u003e, with our Plan Presentation Meeting course due out toward the end of the year, and our Review Meeting course rolling out in the first half of 2026, as our lineup of Training Courses continues to expand!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Kitces Education Present And Future MasterClass Offerings\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2.png\" alt=\"Kitces Education Present And Future MasterClass Offerings\" width=\"2894\" height=\"1988\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2.png 2894w, https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2-300x206.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2-1024x703.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2-768x528.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2-1536x1055.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2-2048x1407.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2-2000x1374.png 2000w\" data-sizes=\"auto, (max-width: 2894px) 100vw, 2894px\" src=\"https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2.png\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2.png 2894w, https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2-300x206.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2-1024x703.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2-768x528.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2-1536x1055.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2-2048x1407.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/06-Kitces-Education-Present-And-Future-MasterClass-Offerings-2-2000x1374.png 2000w\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNotably, though, we have gone through a slight rebrand of our Courses – what we previously called \u0026#34;MasterClasses\u0026#34; we are now calling \u0026#34;Training Courses\u0026#34; instead. The content itself has not changed at all, nor has our case-study-based skills-development orientation; however, the intent of our Courses from the start was to help newer and less experienced advisors (Paraplanners, Associate Advisors, and newly launched solo Advisors), and we found that the \u0026#34;MasterClasses\u0026#34; label was attracting more experienced advisors to take the Courses themselves (instead of having them send their \u003cem\u003eAssociate\u003c/em\u003e Advisors to learn!). So it is our hope that the \u0026#34;Training Courses\u0026#34; label helps the advicer community better understand which advicers should sign up (or who in the firm should be referred to take our Courses).\u003c/p\u003e\n\u003cp\u003eUltimately, though, our goal is nothing short of becoming \u003cem\u003ethe \u003c/em\u003etraining platform for the next generation of financial advicers. A place where advisory firms that simply don\u0026#39;t have the time and capacity to train new Associate Advisors and Paraplanners (on top of everything else it takes to serve clients and run the business) can turn to save themselves time on training. And a place where larger enterprises and their financial planning leadership can turn to build out the core of their financial planner training curriculum from pre-built Kitces content (saving themselves time to only need to develop their own firm-specific elements around the rest of a training curriculum that Kitces already provides).\u003c/p\u003e\n\u003cfigure\u003e\n\u003cblockquote\u003e\u003cp\u003eGoing forward, Kitces MasterClasses will now be known as Kitces Training Courses, built specifically to help busy advisory firm owners have a place to send their Paraplanners and Associate Advisors to supplement the new advisors\u0026#39; learnings (or perhaps to come to brush up for themselves!).\u003c/p\u003e\n\u003cp\u003eAnd now, our latest Kitces Training Course, on how to conduct a Discovery Meeting with a new client, is available at \u003ca href=\"https://www.kitces.com/discovery-meetings-course/\"\u003ethis link\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n\u003c/figure\u003e\n\u003ch3 data-nav-title=\"Return Of IAR Ethics CE Day\" id=\"the-return-of-iar-ethics-ce-day-and-a-second-iar-ce-intensive\"\u003eThe Return Of IAR Ethics CE Day, And A Second (IAR) CE Intensive!\u003c/h3\u003e\n\u003cp\u003eBack in 2022, the first three states (Maryland, Mississippi, and Vermont) rolled out a new 12-hours-per-year continuing education requirement for Investment Adviser Representatives (IARs) of RIAs, codifying \u003ca href=\"https://www.nasaa.org/wp-content/uploads/2020/10/NASAA-IAR-CE-Model-Rule.pdf\"\u003ea Model Rule that NASAA had promulgated in 2020\u003c/a\u003e. In the years since, more and more states have implemented the Model Rule as well, such that by 2025, nearly half (21 out of 50 states, plus the District of Columbia and the Virgin Islands) have put the requirement in place. Though, in reality, more than half of all financial advisors working at RIAs are now affected, given the rule\u0026#39;s rollout in some of the largest states (e.g., California and Florida in 2024) and the fact that \u003ca href=\"https://www.kitces.com/blog/iar-ce-requirements-nasaa-continuing-education-investment-adviser-representatives/\"\u003eIARs are subject to the new CE requirement as long as they meet the de minimis number of clients in \u003cem\u003eany \u003c/em\u003estate that has enacted the rule\u003c/a\u003e (which impacts a huge number of advisors who simply have more than five clients who have retired to Florida!).\u003c/p\u003e\n\u003cp\u003e\u003cbr/\u003e\nTo meet the demand for this new form of CE in 2022, Kitces.com became one of the first IAR CE providers and began qualifying all of our Nerd\u0026#39;s Eye View written content for IAR CE (in addition to all the other CE types we offer), with an aim to cover each of the two required IAR CE categories: six hours of Ethics and Professional Responsibility (or \u0026#34;IAR Ethics\u0026#34;), and six hours of Products \u0026amp; Practice (or \u0026#34;IAR P\u0026amp;P\u0026#34;).\u003c/p\u003e\n\u003cp\u003eIn practice, most existing CFP CE content qualifies for IAR P\u0026amp;P. As a result, nearly all of our blog CE catalog was already eligible (and over the years, we\u0026#39;ve expanded further to make our webinars and Training Courses eligible for IAR P\u0026amp;P CE as well). However, very little of our (or any CE provider\u0026#39;s) existing content qualified for IAR Ethics, which must pertain very specifically to RIA compliance and the ethical and professional responsibilities that IARs have to their clients – including not just fulfilling the letter but also the spirit of their compliance obligations.\u003c/p\u003e\n\u003cp\u003eTo fill this void, we began (and continue) to publish blog posts eligible for IAR Ethics CE – enough to cover the annual six-hour IAR Ethics requirement). In 2023, we expanded further by launching our \u003ca href=\"https://www.kitces.com/kitces-iar-ethics-ce-day\"\u003e\u0026#34;Annual IAR Ethics CE Day\u0026#34;\u003c/a\u003e, a single full-day virtual program where advicers could fulfill all six hours of their IAR Ethics CE requirement (which, in practice, still seems to be the hardest to find content for!). We\u0026#39;ve repeated that IAR Ethics CE Day every year since.\u003c/p\u003e\n\u003cp\u003eAnd now, in 2025, we\u0026#39;re going one step further with the rollout of a second full-day virtual IAR CE program to cover the six-hour IAR P\u0026amp;P requirement as well. These two \u0026#34;CE Intensives\u0026#34; (as each of these six-hour virtual programs is… well, CE intensive!) will now serve as core offerings in our annual calendar of virtual programs. They provide a video/webinar-based alternative for those who would rather knock out the P\u0026amp;P obligation in a single day, rather than do it with one webinar or blog article at a time throughout the year. And they will feature a particular focus on the topic areas that have long been most popular on Kitces.com: tax and retirement planning.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Kitces IAR CE Offerings\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings.png\" alt=\"Kitces IAR CE Offerings\" width=\"3126\" height=\"2332\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings.png 3126w, https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings-300x224.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings-1024x764.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings-768x573.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings-1536x1146.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings-2048x1528.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings-2000x1492.png 2000w\" data-sizes=\"auto, (max-width: 3126px) 100vw, 3126px\" src=\"https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings.png\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings.png 3126w, https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings-300x224.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings-1024x764.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings-768x573.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings-1536x1146.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings-2048x1528.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/08-Kitces-IAR-CE-Offerings-2000x1492.png 2000w\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eFor those who are interested, our \u003ca href=\"https://www.kitces.com/kitces-iar-ethics-ce-day\"\u003eadvance registration is now open for our IAR Ethics CE Day\u003c/a\u003e, taking place on Thursday, August 28th, from 11:30AM to 6:30PM (ET). Pricing is as follows:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGeneral registration: $247 for the full day of live content\u003c/li\u003e\n\u003cli\u003eKitces Premier Members: $197\u003c/li\u003e\n\u003cli\u003eDual registration (IAR CE Day and \u003ca href=\"https://www.kitces.com/become-member-for-imca-ce-and-cfp-ce-credits/\"\u003ejoining the Kitces Members Section\u003c/a\u003e): $386 (valued at $436 when priced separately)\u003c/li\u003e\n\u003cli\u003eIAR CE reporting fees: Included in the registration fee\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDiscounts are also available for multi-advisor groups by contacting \u003ca href=\"https://feeds.feedblitz.com/cdn-cgi/l/email-protection#7512071a00050600170616071c05011c1a1b351e1c011610065b161a18\"\u003e\u003cspan data-cfemail=\"0463766b71747771667767766d74706d6b6a446f6d706761772a676b69\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe date is also set for our second IAR P\u0026amp;P CE Intensive, scheduled for Thursday, October 30th. Pricing will be similar to IAR Ethics CE Day, and registration will open in August!\u003c/p\u003e\n\u003cfigure\u003e\n\u003cblockquote\u003e\u003cp\u003e\u003cstrong\u003eSAVE THE DATES\u003c/strong\u003e: Kitces will run two IAR CE Intensives in 2025 – \u003cstrong\u003eIAR Ethics CE Day on Thursday August 28th\u003c/strong\u003e, followed by \u003cstrong\u003eIAR P\u0026amp;P CE Day on Thursday, October 30\u003csup\u003eth\u003c/sup\u003e. \u003c/strong\u003eEach full-day event covers half of the 12-hour IAR CE requirement: the first event for the six hours of Ethics \u0026amp; Professional Responsibility and a second event for the six hours of Products \u0026amp; Practice. Perfect for advicers who prefer a live, intensive format to fulfill each obligation in a single-day format rather than consuming throughout the year via Members Section webinars and blog articles!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRegistration for \u003c/strong\u003e\u003ca href=\"https://www.kitces.com/kitces-iar-ethics-ce-day/\"\u003e\u003cstrong\u003eIAR Ethics CE Day is now open here\u003c/strong\u003e\u003c/a\u003e, with discounts available for Kitces Members and firms that want to register multiple advisors at once!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIAR P\u0026amp;P CE Day registration will open in August\u003c/strong\u003e for the October event!\u003c/p\u003e\u003c/blockquote\u003e\n\u003c/figure\u003e\n\u003ch2 data-nav-title=\"Ongoing Growth Of Kitces Team\" id=\"ongoing-growth-of-kitces-and-its-team-of-nerds\"\u003eOngoing Growth Of Kitces And Its Team Of Nerds…\u003c/h2\u003e\n\u003cp\u003eAs the updates above hopefully highlight, we are actively investing into the platform and programs it takes for Kitces.com to continue to grow for many years to come. Yet the reality is that, because we are first and foremost a provider of education and professional development, the core of our business is not the technology platform or the CE and practice management programs we run… it\u0026#39;s the people who make it all happen.\u003c/p\u003e\n\u003cp\u003eWhich means that as our offerings to make financial advicers better and more successful continue to expand, so too has the Kitces team, now up to 25 team members (and nearly half a dozen more in various part-time contractor roles). These are the people who not only create all of our various types of Kitces content but also manage our live events, administer our CE reporting, support Members when they have questions, develop the code that runs our back-end systems, and provide the leadership that ensures that we keep running efficiently as a team!\u003c/p\u003e\n\u003cp\u003eIn fact, we\u0026#39;ve added several team members in just the past six months, including new Managing Editor Robert Long, and Research Associate Karl VonZabern!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"New Kitces Employees\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2.png\" alt=\"New Kitces Employees\" width=\"2560\" height=\"1127\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2.png 2560w, https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2-300x132.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2-1024x451.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2-768x338.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2-1536x676.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2-2048x902.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2-2000x881.png 2000w\" data-sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" src=\"https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2.png\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2.png 2560w, https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2-300x132.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2-1024x451.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2-768x338.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2-1536x676.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2-2048x902.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/10-New-Kitces-Employees2-2000x881.png 2000w\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAs our team continues to expand, future openings will be posted to our \u003ca href=\"https://www.kitces.com/career-opportunities/\"\u003eKitces Career Opportunities page\u003c/a\u003e, and those who want to stay apprised of future openings with the Kitces Team can sign up for \u003ca href=\"https://www.kitces.com/career-opportunities/#:~:text=Not%20The%20Right%20Job%20Now%2C%20But%20See%20Yourself%20Working%20Here%3F\"\u003ethe Kitces Careers mailing list\u003c/a\u003e to be notified as each new role opens up, too!\u003c/p\u003e\n\u003cp\u003eAll in continued pursuit of our mission at Kitces.com – to Make Financial Advicers Better, and More Successful, through our N-E-R-D-y organizational strategy: supporting \u0026#39;\u003cstrong\u003eN\u003c/strong\u003enovation of AdvisorTech tools, delivering \u003cstrong\u003eE\u003c/strong\u003educational Insights, conducting \u003cstrong\u003eR\u003c/strong\u003eesearch on Advicers, and supporting the \u003cstrong\u003eD\u003c/strong\u003eevelopment of Advicer skills.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Making Financial Advicers Better And More Successful\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful.png\" alt=\"Making Financial Advicers Better And More Successful\" width=\"3126\" height=\"2415\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful.png 3126w, https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful-300x232.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful-1024x791.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful-768x593.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful-1536x1187.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful-2048x1582.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful-2000x1545.png 2000w\" data-sizes=\"auto, (max-width: 3126px) 100vw, 3126px\" src=\"https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful.png\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful.png 3126w, https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful-300x232.png 300w, https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful-1024x791.png 1024w, https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful-768x593.png 768w, https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful-1536x1187.png 1536w, https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful-2048x1582.png 2048w, https://www.kitces.com/wp-content/uploads/2025/06/11-Making-Financial-Advicers-Better-And-More-Successful-2000x1545.png 2000w\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAnd notably, while we remain as committed as ever to creating our style of Quality, Nerdy, and Relevant content for the financial advicer community with our team of nerds, there are also plenty of opportunities for Advisors themselves to get involved or become contributors. So if you have some expertise or a best practice you\u0026#39;d like to share through the Kitces platform, you can do so as a writer, a guest who provides a demonstration via our podcast or Summits, or by developing a formal presentation to be a paid speaker! We encourage advicers to take a chance and submit their prospective contribution if any of our opportunities sound like a good fit (\u003ca href=\"https://www.kitces.com/how-to-contribute-content-article-podcast-webinar-office-hours-summit/\"\u003eclick here for the details on how, for each of our various contributor options, you can get started now\u003c/a\u003e!) – after all, we only grow as an advicer community by sharing our insights and solutions with others! (But it\u0026#39;s totally OK to simply keep following the content journey with us!)\u003c/p\u003e\n\u003cp\u003eIf there\u0026#39;s anything else you think we should be working on that we\u0026#39;ve missed, please share your thoughts in the comments below!\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;First Look At The New Kitces Members Section And The State Of The (Nerd’s Eye View) Blog\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-7133e2db05fa466e991fff19-=\"\"\u003e\n                    \u003cimg decoding=\"async\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\"/\u003e\n                    \u003c/a\u003e\n                \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "31 min read",
  "publishedTime": "2025-06-30T07:01:59-04:00",
  "modifiedTime": "2025-06-30T18:04:24Z"
}
