{
  "id": "a117f09e-e989-4636-9867-7324f0c8bbec",
  "title": "7 Payouts You Can Still Get From Old Lawsuits and Settlements",
  "link": "https://www.savingadvice.com/articles/2025/06/01/10157696_7-payouts-you-can-still-get-from-old-lawsuits-and-settlements.html",
  "description": "Many people don’t realize that money from old lawsuits and class action settlements may still be available for them to claim. Billions of dollars go...",
  "author": "Riley Schnepf",
  "published": "Sun, 01 Jun 2025 23:10:12 +0000",
  "source": "https://www.savingadvice.com/feed/",
  "categories": [
    "Law",
    "class action payouts",
    "class action settlements",
    "consumer rights",
    "financial literacy",
    "hidden funds",
    "legal settlements",
    "old lawsuits",
    "settlement checks",
    "unclaimed money"
  ],
  "byline": "Riley Schnepf",
  "length": 7636,
  "excerpt": "Don’t miss out on unclaimed money! Explore seven settlements and payouts you could still collect from old lawsuits that might surprise you.",
  "siteName": "SavingAdvice.com Blog",
  "favicon": "",
  "text": "Image source: UnsplashMany people don’t realize that money from old lawsuits and class action settlements may still be available for them to claim. Billions of dollars go uncollected every year because people either didn’t know they were eligible, didn’t file in time, or simply forgot about a lawsuit they saw on the news years ago.According to the National Association of Unclaimed Property Administrators (NAUPA), state governments alone hold over $50 billion in unclaimed funds, some of which stem from legal settlements and payouts that many consumers overlook. Companies settle lawsuits all the time, whether it’s for faulty products, unfair practices, or corporate wrongdoing. And when that happens, the money often sits in escrow accounts, waiting for rightful claimants to step forward.If you think you might have a share coming, now is the time to act. Here’s a look at seven payouts you can still get from old lawsuits and settlements—and how to check if your name is on the list.Old Lawsuits and Settlements You Might Still Benefit From1. Roundup Weedkiller LawsuitsBayer, which acquired Monsanto (maker of Roundup), has paid out billions to settle lawsuits claiming that the herbicide caused cancer, particularly non-Hodgkin lymphoma. While thousands of cases have already been settled, some are still being processed, especially those that didn’t meet earlier deadlines or were initially denied.If you used Roundup for personal or occupational use and later developed health problems, you may still qualify. Some settlements remain open on a rolling basis as new plaintiffs come forward.Check with the Roundup settlement website or a trusted legal resource to determine eligibility. Don’t assume it’s too late. Some cases are still being evaluated and paid out.2. Facebook Data Privacy SettlementThe Cambridge Analytica scandal revealed that Facebook mishandled millions of users’ personal data. A class action lawsuit eventually led to a multi-million-dollar settlement, with payouts ranging from a few dollars to hundreds, depending on how long users had an account and the level of data exposure.While the main claim filing period ended in 2023, some appeals and administrative claims remain open for users who encountered technical issues or whose data was misclassified. If you were a Facebook user between 2007 and 2022 and think you might qualify, it’s worth checking with the settlement administrator.Data privacy settlements often extend over several years due to appeals and court rulings, so you could still be entitled to a payout even if you missed the initial window.3. Wells Fargo Unauthorized Accounts SettlementIf you were a Wells Fargo customer between 2002 and 2017, you might be eligible for a payout from the infamous unauthorized accounts scandal. The bank opened millions of accounts without customers’ permission, leading to fraudulent fees and credit damage.The $3 billion settlement fund set aside money for both direct compensation and credit repair. While the main claims process ended in 2020, many affected customers didn’t realize they were eligible, and some states or court orders continue to administer payments.If you think Wells Fargo opened an account in your name or charged you fees you didn’t authorize, check with the Wells Fargo Unauthorized Accounts Settlement site for potential compensation.4. Equifax Data Breach SettlementWhen Equifax announced in 2017 that hackers had accessed the personal data of over 147 million Americans, it became one of the largest data breaches in history. A $700 million settlement followed, with compensation for credit monitoring, identity theft costs, and even cash payments for time spent dealing with the breach.Although the initial filing period ended in early 2020, the settlement administrator is still processing certain claims, particularly those involving documented losses or extended credit monitoring. If you never filed but experienced identity theft or other related damages after the breach, you may still be eligible.Visit the Equifax settlement site and see if you can submit a claim or request reconsideration, especially if you have proof of losses that weren’t initially documented.5. Transvaginal Mesh LawsuitsThousands of women sued medical device manufacturers over transvaginal mesh implants that caused serious complications, including pain, infection, and erosion. Settlements from major manufacturers like Johnson \u0026 Johnson and Boston Scientific totaled billions of dollars.Many of these settlements remain open due to ongoing litigation and appeals. Some states and law firms continue to process new claims as more women come forward. If you or someone you know had a transvaginal mesh implant and suffered complications, there may still be an opportunity to join a settlement fund.Check with a reputable law firm specializing in medical device cases to see if you can file a late claim. Many firms offer free consultations to assess eligibility.Image source: Unsplash6. Volkswagen Diesel Emissions SettlementRemember the “Dieselgate” scandal that rocked Volkswagen a few years back? It turned out that VW had installed software in millions of diesel vehicles that allowed them to cheat emissions tests. This led to one of the largest class action settlements in automotive history.While the initial wave of claims closed in 2019, many states extended deadlines or created secondary funds to handle late claims or cases still tied up in litigation. If you owned or leased an affected vehicle between 2009 and 2016 and didn’t file at the time, you might still qualify for compensation, repairs, or even a vehicle buyback.Check with the VW settlement site (or your state’s consumer affairs department) to see if you can still submit a claim or appeal. Even if you missed the first round, some funds are still processing payments for eligible late filers.7. 401(k) Mismanagement LawsuitsSome employers faced lawsuits for mismanaging employee retirement plans, including excessive fees, poor investment choices, and conflicts of interest. Companies like Boeing, Lockheed Martin, and others reached settlements worth hundreds of millions of dollars.While many class periods have ended, some settlements allow for late claims, especially if plan participants missed notifications or administrative delays occurred. If you were enrolled in a 401(k) plan with a major employer between 2010 and 2020, check with the settlement administrator or your plan’s record keeper.Properly documented claims can sometimes be submitted after the initial deadline, particularly if there’s evidence that you didn’t receive notice or were otherwise excluded from the process.Don’t Leave Money on the TableIf you’re like most people, you might assume that money from old lawsuits is out of reach. But billions of dollars in unclaimed funds are still waiting for rightful claimants, many of whom don’t even realize they qualify.Don’t leave that money on the table. Whether it’s data breaches, banking scandals, or defective products, chances are you’ve been impacted by at least one of these issues at some point.Which of these settlements surprised you the most, and have you ever filed a claim?Read More:11 Budget Laws That Keep Middle-Class Families Perpetually Broke15 Different Types Of Lawyers And When You Will Require Their ServicesRiley is an Arizona native with over nine years of writing experience. From personal finance to travel to digital marketing to pop culture, she’s written about everything under the sun. When she’s not writing, she’s spending her time outside, reading, or cuddling with her two corgis. Reader Interactions",
  "image": "https://www.savingadvice.com/wp-content/uploads/2025/06/tingey-injury-law-firm-nSpj-Z12lX0-unsplash_1500x1000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"genesis-content\"\u003e\u003carticle aria-label=\"7 Payouts You Can Still Get From Old Lawsuits and Settlements\"\u003e\u003cdiv\u003e\u003cfigure id=\"attachment_157697\" aria-describedby=\"caption-attachment-157697\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2025/06/tingey-injury-law-firm-nSpj-Z12lX0-unsplash_1500x1000.jpg\" alt=\"gavel, lawsuit\" width=\"1500\" height=\"1000\" srcset=\"https://www.savingadvice.com/wp-content/uploads/2025/06/tingey-injury-law-firm-nSpj-Z12lX0-unsplash_1500x1000.jpg 1500w,   https://www.savingadvice.com/wp-content/uploads/2025/06/tingey-injury-law-firm-nSpj-Z12lX0-unsplash_1500x1000-300x200.jpg 300w,   https://www.savingadvice.com/wp-content/uploads/2025/06/tingey-injury-law-firm-nSpj-Z12lX0-unsplash_1500x1000-550x367.jpg 550w,   https://www.savingadvice.com/wp-content/uploads/2025/06/tingey-injury-law-firm-nSpj-Z12lX0-unsplash_1500x1000-768x512.jpg 768w,   https://www.savingadvice.com/wp-content/uploads/2025/06/tingey-injury-law-firm-nSpj-Z12lX0-unsplash_1500x1000-100x67.jpg 100w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003cfigcaption id=\"caption-attachment-157697\"\u003eImage source: Unsplash\u003c/figcaption\u003e\u003c/figure\u003e\u003cp data-start=\"764\" data-end=\"1077\"\u003eMany people don’t realize that money from old lawsuits and class action settlements may still be available for them to claim. Billions of dollars go uncollected every year because people either didn’t know they were eligible, didn’t file in time, or simply forgot about a lawsuit they saw on the news years ago.\u003c/p\u003e\u003cp data-start=\"1079\" data-end=\"1542\"\u003eAccording to the \u003ca href=\"https://unclaimed.org/\" target=\"_blank\" rel=\"noopener\"\u003eNational Association of Unclaimed Property Administrators\u003c/a\u003e (NAUPA), state governments alone hold over $50 billion in unclaimed funds, some of which stem from legal settlements and payouts that many consumers overlook. Companies settle lawsuits all the time, whether it’s for faulty products, unfair practices, or corporate wrongdoing. And when that happens, the money often sits in escrow accounts, waiting for rightful claimants to step forward.\u003c/p\u003e\u003cp data-start=\"1544\" data-end=\"1742\"\u003eIf you think you might have a share coming, now is the time to act. Here’s a look at seven payouts you can still get from old lawsuits and settlements—and how to check if your name is on the list.\u003c/p\u003e\u003ch2 data-start=\"5942\" data-end=\"5977\"\u003eOld Lawsuits and Settlements You Might Still Benefit From\u003c/h2\u003e\u003ch2 data-start=\"5942\" data-end=\"5977\"\u003e1. Roundup Weedkiller Lawsuits\u003c/h2\u003e\u003cp data-start=\"5979\" data-end=\"6309\"\u003eBayer, which acquired Monsanto (maker of Roundup), has paid out billions to settle lawsuits claiming that the herbicide caused cancer, particularly non-Hodgkin lymphoma. While thousands of cases have already been settled, some are still being processed, especially those that didn’t meet earlier deadlines or were initially denied.\u003c/p\u003e\u003cp data-start=\"6311\" data-end=\"6505\"\u003eIf you used Roundup for personal or occupational use and later developed health problems, you may still qualify. Some settlements remain open on a rolling basis as new plaintiffs come forward.\u003c/p\u003e\u003cp data-start=\"6507\" data-end=\"6682\"\u003eCheck with the Roundup settlement website or a trusted legal resource to determine eligibility. Don’t assume it’s too late. Some cases are still being evaluated and paid out.\u003c/p\u003e\u003ch2 data-start=\"2657\" data-end=\"2697\"\u003e2. Facebook Data Privacy Settlement\u003c/h2\u003e\u003cp data-start=\"2699\" data-end=\"3004\"\u003eThe \u003ca href=\"https://www.theguardian.com/news/2018/mar/17/cambridge-analytica-facebook-influence-us-election\" target=\"_blank\" rel=\"noopener\"\u003eCambridge Analytica\u003c/a\u003e scandal revealed that Facebook mishandled millions of users’ personal data. A class action lawsuit eventually led to a multi-million-dollar settlement, with payouts ranging from a few dollars to hundreds, depending on how long users had an account and the level of data exposure.\u003c/p\u003e\u003cp data-start=\"3006\" data-end=\"3318\"\u003eWhile the main claim filing period ended in 2023, some appeals and administrative claims remain open for users who encountered technical issues or whose data was misclassified. If you were a Facebook user between 2007 and 2022 and think you might qualify, it’s worth checking with the settlement administrator.\u003c/p\u003e\u003cp data-start=\"3320\" data-end=\"3494\"\u003eData privacy settlements often extend over several years due to appeals and court rulings, so you could still be entitled to a payout even if you missed the initial window.\u003c/p\u003e\u003ch2 data-start=\"3501\" data-end=\"3553\"\u003e3. Wells Fargo Unauthorized Accounts Settlement\u003c/h2\u003e\u003cp data-start=\"3555\" data-end=\"3812\"\u003eIf you were a Wells Fargo customer between 2002 and 2017, you might be eligible for a payout from the infamous unauthorized accounts scandal. The bank opened millions of accounts without customers’ permission, leading to fraudulent fees and credit damage.\u003c/p\u003e\u003cp data-start=\"3814\" data-end=\"4079\"\u003eThe $3 billion settlement fund set aside money for both direct compensation and credit repair. While the main claims process ended in 2020, many affected customers didn’t realize they were eligible, and some states or court orders continue to administer payments.\u003c/p\u003e\u003cp data-start=\"4081\" data-end=\"4273\"\u003eIf you think Wells Fargo opened an account in your name or charged you fees you didn’t authorize, check with the Wells Fargo Unauthorized Accounts Settlement site for potential compensation.\u003c/p\u003e\u003ch2 data-start=\"4280\" data-end=\"4318\"\u003e4. Equifax Data Breach Settlement\u003c/h2\u003e\u003cp data-start=\"4320\" data-end=\"4644\"\u003eWhen Equifax announced in 2017 that hackers had accessed the personal data of over 147 million Americans, it became one of the largest data breaches in history. A $700 million settlement followed, with compensation for credit monitoring, identity theft costs, and even cash payments for time spent dealing with the breach.\u003c/p\u003e\u003cp data-start=\"4646\" data-end=\"4966\"\u003eAlthough the initial filing period ended in early 2020, the settlement administrator is still processing certain claims, particularly those involving documented losses or extended credit monitoring. If you never filed but experienced identity theft or other related damages after the breach, you may still be eligible.\u003c/p\u003e\u003cp data-start=\"4968\" data-end=\"5139\"\u003eVisit the Equifax settlement site and see if you can submit a claim or request reconsideration, especially if you have proof of losses that weren’t initially documented.\u003c/p\u003e\u003ch2 data-start=\"5146\" data-end=\"5180\"\u003e5. Transvaginal Mesh Lawsuits\u003c/h2\u003e\u003cp data-start=\"5182\" data-end=\"5454\"\u003eThousands of women sued medical device manufacturers over transvaginal mesh implants that caused serious complications, including pain, infection, and erosion. Settlements from major manufacturers like Johnson \u0026amp; Johnson and Boston Scientific totaled billions of dollars.\u003c/p\u003e\u003cp data-start=\"5456\" data-end=\"5767\"\u003eMany of these settlements remain open due to ongoing litigation and appeals. Some states and law firms continue to process new claims as more women come forward. If you or someone you know had a transvaginal mesh implant and suffered complications, there may still be an opportunity to join a settlement fund.\u003c/p\u003e\u003cp data-start=\"5769\" data-end=\"5935\"\u003eCheck with a reputable law firm specializing in medical device cases to see if you can file a late claim. Many firms offer free consultations to assess eligibility.\u003c/p\u003e\u003cfigure id=\"attachment_157698\" aria-describedby=\"caption-attachment-157698\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2025/06/erik-mclean-IHRnL6Phatg-unsplash_1500x1000.jpg\" alt=\"volkswagen logo, volkswagen car\" width=\"1500\" height=\"1000\" srcset=\"https://www.savingadvice.com/wp-content/uploads/2025/06/erik-mclean-IHRnL6Phatg-unsplash_1500x1000.jpg 1500w,   https://www.savingadvice.com/wp-content/uploads/2025/06/erik-mclean-IHRnL6Phatg-unsplash_1500x1000-300x200.jpg 300w,   https://www.savingadvice.com/wp-content/uploads/2025/06/erik-mclean-IHRnL6Phatg-unsplash_1500x1000-550x367.jpg 550w,   https://www.savingadvice.com/wp-content/uploads/2025/06/erik-mclean-IHRnL6Phatg-unsplash_1500x1000-768x512.jpg 768w,   https://www.savingadvice.com/wp-content/uploads/2025/06/erik-mclean-IHRnL6Phatg-unsplash_1500x1000-100x67.jpg 100w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"/\u003e\u003cfigcaption id=\"caption-attachment-157698\"\u003eImage source: Unsplash\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2 data-start=\"1749\" data-end=\"1795\"\u003e6. Volkswagen Diesel Emissions Settlement\u003c/h2\u003e\u003cp data-start=\"1797\" data-end=\"2072\"\u003eRemember the “\u003ca href=\"https://tosinadeoti.medium.com/dieselgate-how-volkswagen-engineered-a-lie-10ab8b237324\" target=\"_blank\" rel=\"noopener\"\u003eDieselgate\u003c/a\u003e” scandal that rocked Volkswagen a few years back? It turned out that VW had installed software in millions of diesel vehicles that allowed them to cheat emissions tests. This led to one of the largest class action settlements in automotive history.\u003c/p\u003e\u003cp data-start=\"2074\" data-end=\"2414\"\u003eWhile the initial wave of claims closed in 2019, many states extended deadlines or created secondary funds to handle late claims or cases still tied up in litigation. If you owned or leased an affected vehicle between 2009 and 2016 and didn’t file at the time, you might still qualify for compensation, repairs, or even a vehicle buyback.\u003c/p\u003e\u003cp data-start=\"2416\" data-end=\"2650\"\u003eCheck with the VW settlement site (or your state’s consumer affairs department) to see if you can still submit a claim or appeal. Even if you missed the first round, some funds are still processing payments for eligible late filers.\u003c/p\u003e\u003ch2 data-start=\"6689\" data-end=\"6726\"\u003e7. 401(k) Mismanagement Lawsuits\u003c/h2\u003e\u003cp data-start=\"6728\" data-end=\"6990\"\u003eSome employers faced lawsuits for mismanaging employee retirement plans, including excessive fees, poor investment choices, and conflicts of interest. Companies like Boeing, Lockheed Martin, and others reached settlements worth hundreds of millions of dollars.\u003c/p\u003e\u003cp data-start=\"6992\" data-end=\"7311\"\u003eWhile many class periods have ended, some settlements allow for late claims, especially if plan participants missed notifications or administrative delays occurred. If you were enrolled in a 401(k) plan with a major employer between 2010 and 2020, check with the settlement administrator or your plan’s record keeper.\u003c/p\u003e\u003cp data-start=\"7313\" data-end=\"7505\"\u003eProperly documented claims can sometimes be submitted after the initial deadline, particularly if there’s evidence that you didn’t receive notice or were otherwise excluded from the process.\u003c/p\u003e\u003ch2 data-start=\"7512\" data-end=\"7559\"\u003eDon’t Leave Money on the Table\u003c/h2\u003e\u003cp data-start=\"7561\" data-end=\"7783\"\u003eIf you’re like most people, you might assume that money from old lawsuits is out of reach. But billions of dollars in unclaimed funds are still waiting for rightful claimants, many of whom don’t even realize they qualify.\u003c/p\u003e\u003cp data-start=\"7785\" data-end=\"7972\"\u003eDon’t leave that money on the table. Whether it’s data breaches, banking scandals, or defective products, chances are you’ve been impacted by at least one of these issues at some point.\u003c/p\u003e\u003cp data-start=\"7974\" data-end=\"8105\" data-is-last-node=\"\" data-is-only-node=\"\"\u003eWhich of these settlements surprised you the most, and have you ever filed a claim?\u003c/p\u003e\u003cp data-start=\"7974\" data-end=\"8105\" data-is-last-node=\"\" data-is-only-node=\"\"\u003e\u003cstrong\u003eRead More:\u003c/strong\u003e\u003c/p\u003e\u003cp data-start=\"7974\" data-end=\"8105\" data-is-last-node=\"\" data-is-only-node=\"\"\u003e\u003ca href=\"https://www.savingadvice.com/articles/2025/05/09/10156051_11-budget-laws-that-keep-middle-class-families-perpetually-broke.html\" target=\"_blank\" rel=\"noopener\"\u003e11 Budget Laws That Keep Middle-Class Families Perpetually Broke\u003c/a\u003e\u003c/p\u003e\u003cp data-start=\"7974\" data-end=\"8105\" data-is-last-node=\"\" data-is-only-node=\"\"\u003e\u003ca href=\"https://www.savingadvice.com/articles/2025/03/06/10109030_15-different-types-of-lawyers-and-when-you-will-require-their-services.html\" target=\"_blank\" rel=\"noopener\"\u003e15 Different Types Of Lawyers And When You Will Require Their Services\u003c/a\u003e\u003c/p\u003e\u003cdiv itemtype=\"http://schema.org/Person\" itemscope=\"\" itemprop=\"author\"\u003e\u003cp\u003e\u003cimg alt=\"Riley Schnepf\" src=\"https://secure.gravatar.com/avatar/35fca4500e6abb163d1e135bb9e6a49c9db84ba09f1f932149e1720d7745a9be?s=100\u0026amp;d=monsterid\u0026amp;r=g\" srcset=\"https://secure.gravatar.com/avatar/35fca4500e6abb163d1e135bb9e6a49c9db84ba09f1f932149e1720d7745a9be?s=200\u0026amp;d=monsterid\u0026amp;r=g 2x\" height=\"100\" width=\"100\" itemprop=\"image\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eRiley is an Arizona native with over nine years of writing experience. From personal finance to travel to digital marketing to pop culture, she’s written about everything under the sun. When she’s not writing, she’s spending her time outside, reading, or cuddling with her two corgis.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e \u003c/div\u003e\u003c/article\u003e\u003ch2\u003eReader Interactions\u003c/h2\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-06-01T23:10:12Z",
  "modifiedTime": null
}
