{
  "id": "b3030cd9-980c-4cf3-af16-08703db839dd",
  "title": "Weekend Reading For Financial Planners (July 12–13)",
  "link": "https://feeds.feedblitz.com/~/921524534/0/kitcesnerdseyeview~Weekend-Reading-For-Financial-Planners-July-%e2%80%93/",
  "description": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" - this week's edition kicks off with the news that, amidst the growing number of RIAs it supervises, the Securities and Exchange Commission (SEC) is moving ahead with a potential plan to raise the $100 million regulatory assets under management threshold for SEC registration, withRead More... The post Weekend Reading For Financial Planners (July 12–13) first appeared on Kitces.com.",
  "author": "Adam Van Deusen",
  "published": "Fri, 11 Jul 2025 17:46:51 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Weekend Reading",
    "OPTIN: Value Of Advice (BAR)",
    "OPTIN: Value Of Advice (SLIDE IN)"
  ],
  "byline": "Adam Van Deusen",
  "length": 35393,
  "excerpt": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" - this week's edition kicks off with the news that, amidst the growing number of RIAs it supervises, the Securities and Exchange Commission (SEC) is moving ahead with a potential plan to raise the $100 million regulatory assets under management threshold for SEC registration, with",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary Enjoy the current installment of \"Weekend Reading For Financial Planners\" - this week's edition kicks off with the news that, amidst the growing number of RIAs it supervises, the Securities and Exchange Commission (SEC) is moving ahead with a potential plan to raise the $100 million regulatory assets under management threshold for SEC registration, with the regulator having talks with some state securities regulators (which would bear an increasing regulatory burden if the threshold were lifted and more firms came under their watch) on the issue. While the SEC has not released a formal proposal (which would likely offer advisers and other interested parties a chance to air their views on the issue), such a move could prove frustrating for firms forced to switch to state registration (particularly those with clients spread across state lines) as it would potentially require affected RIAs to register with multiple state regulators and be subject to a varying set of rules depending on which state(s) they are registered in, compared to the more uniform supervision they experience under the SEC. Also in industry news this week: A recent survey finds that (unsolicited) client referrals are the top source of new clients for advisors this year, while networking, client appreciation events, and educational events have also proven to be fruitful for some advisors A survey suggests that some advisors might be underestimating their clients' interest in charitable giving, an area where advisors can potentially offer hard-dollar tax savings for clients From there, we have several articles on financial planning implications of the \"One Big Beautiful Bill Act\" (OBBBA): Potential planning strategies in the wake of the increased State And Local Tax (SALT) cap, (including the potential value of managing income for clients near the phase-out limits) How the new $6,000 tax deduction for seniors works (and why clients who are delaying claiming Social Security benefits could be in for a pleasant surprise) Post-OBBBA estate planning strategies for clients across the wealth spectrum and how trusts could be an effective way for some clients to manage income amidst a growing number of phase-out ranges for certain tax benefits We also have a number of articles on marketing: Why the value of creating content tailored to an ideal client profile has increased in a world where more individuals are using Artificial Intelligence (AI) tools to find answers to their financial questions How 'traditional' Search Engine Optimization (SEO) still has value for advisors amidst growing use of AI tools for Internet searches How advisors can optimize their websites for ChatGPT search and reap the benefits of \"Answer Engine Optimization\" (AEO) We wrap up with three final articles, all about social life: Data show that the time Americans spend on in-person socializing has decreased dramatically over the past several decades, with increased time spent on watching television and using smartphones among the potential causes Four ways to socialize effectively in one's 30s and beyond, from formalizing social events to 'organizing' friends to identify the most relevant event types for each group A step-by-step approach to hosting a memorable (and relatively low-stress?) dinner party Enjoy the 'light' reading! Adam is a Financial Planning Nerd at Kitces.com. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits. Read more of Adam’s articles here. SEC Progressing On Plan That Could Send Many National RIAs Back To State Registration (Melanie Waddell | ThinkAdvisor) In the United States, Registered Investment Advisers (RIAs) are required to register in one of 2 ways: with the Federal government (namely the SEC), or with one or more state securities regulatory agencies. Under the National Securities Markets Improvement Act of 1996 (NSMIA), states were tasked with supervising firms up to $25 million in Regulatory Assets Under Management (RAUM), with the SEC in charge of larger firms. This asset limit for state registration was subsequently expanded under the Dodd-Frank Act of 2010 to $100 million to encourage the SEC, in the wake of the 2007-2009 financial crisis, to focus on supervising the largest firms (and delegating the rest of RIA oversight to the states). The legislation also allowed the SEC to increase this threshold again in the future if it sees fit. In early April, then-acting SEC Chair Mark Uyeda made headlines by saying he had asked SEC staff to conduct \"a periodic evaluation\" on whether the current $100 million threshold is still \"optimal\" (citing in particular the 45% growth in the number of RIAs since Dodd-Frank's 2012 compliance date, which has increased the number of RIA examinations the SEC is responsible for at a time when the agency is grappling with the departures of about 10% of its staff). Notably, any increase in the RAUM threshold for SEC registration would effectively shift those firms to become state-registered instead, putting more of a burden on the states to handle examinations instead (in an environment where some states themselves already struggle to maintain sufficient staff levels for timely RIA registrations and regular examinations). Which in turn raises the prospect that some RIAs may struggle with the fact that not all states have the same regulations (e.g., pertaining to whether the firm can use testimonials in their marketing) and thus would have to adapt their practices to each state in which they have clients. After taking the reins of the SEC, Chair Paul Atkins has indicated he is moving ahead with the plan to raise the $100 million asset threshold, with the regulator having talks with some state securities regulators on the issue (though specifics of these discussions are unclear, the SEC could be assessing state regulators' capabilities to take on a greater burden of RIA registrations and examinations). In a recent blog post, attorney Chris Stanley notes that while it's \"too early to tell whether, when, and by how much\" the $100 million threshold will be raised, SEC-registered RIAs with about $500 million or less in AUM might want to keep a watchful eye on the results of the SEC's staff evaluation (given the possible consequences for these firms and the potential to provide their views during a public comment period on any rulemaking on the topic). Ultimately, the significance of the prospective shift is that, to the extent that \"mid-sized\" RIAs (e.g., those with $100M to $500M of AUM) are more likely to have clients across multiple states (simply due to their size), firms will either have to manage to the potential of increased compliance burdens of navigating multiple states with similar-but-not-same rules, try to get to the point they're registered in 15+ states to be able to once again trigger eligibility for SEC registration (regardless of AUM), or may have a draw to various corporate RIA \"supported independence\" models where the platform RIA is large enough to be SEC-registered (and therefore advisors could affiliate with a Federally registered firm as a way to circumvent state registration if it's a problem point for htem). In the end, while a new RAUM threshold hasn't been proposed, the core idea of allowing the SEC to focus its supervisory efforts on the largest RIAs arguably makes sense, yet could still prove frustrating for firms forced to switch to state registration (particularly those with clients spread across state lines) as it would potentially require affected RIAs to register with multiple state regulators and be subject to a varying set of rules depending on which state(s) they are registered in, compared to the more uniform supervision they experience under the SEC. And there is a non-trivial consumer risk that RIA protections may decrease if the states themselves don't have the resources to actually oversee the mid-sized advisory firms pushed down into their purview. Of course, firms that have clients in more than 15 states remain eligible for SEC registration, regardless of their AUM, and SEC-registered supported-independence models have already been on the rise… but as long as states are not consistent in their own regulatory requirements from one state to another (and/or don't fully conform to the SEC's own guidance), a shift in AUM requirements for Federal registration will just put more focus than ever on NASAA to help improve the consistency of state-by-state regulation of RIAs. (Unsolicited) Referrals Top Source Of New Advisory Clients: Survey (Karen DeMasters | Financial Advisor) Adding new clients is a top priority for many financial advisory firms, whether they are in growth mode or are seeking to hold their client headcount relatively steady (given that some level of client attrition is inevitable over time). To do so, many firms will actively engage in one or more marketing strategies, which can cost time and/or money. However, a recent survey suggests that many advisors are benefiting from the value they're already providing clients in the form of unsolicited client referrals. According to a survey of 829 financial advisors by InspereX, 76% of respondents have gained new clients in 2025 through unsolicited client referrals, with this mode being the top way 51% of advisors acquired new clients. Other types of referrals also proved fruitful for advisors, with 38% of respondents reporting getting a new client this year after soliciting clients for referrals and the same percentage getting new clients from referrals from Centers Of Influence (COIs, including CPAs and attorneys). Other marketing tactics surveyed that led to new clients included networking (36%), client appreciation events (20%), and educational events (17%). These results reflect results from Kitces Research on Advisor Marketing, which found that 88% of advisors surveyed use client referrals and 95% have had success getting new clients with this tactic, while 62% use COI referrals (with 85% success), and 47% engage in in-person networking (with 64% success). In sum, referrals appear to remain a primary source of new clients for financial advisors. And while some might come unsolicited (thanks to the high level of service an advisor is providing their clients), there are also a variety of ways advisors could potentially drive even more referrals, from identifying \"active promoters\" among their client base or leveraging pro-social psychology to creating an exceptional onboarding experience, asking for referrals after celebrating successes with clients, or taking a structured approach to vetting and establishing productive COI relationships. Survey Suggests Some Advisors Might Be Underestimating Demand For Charitable Planning Guidance (David Lenok | WealthManagement) Clients are often focused on accumulating assets (at least until spending them down in retirement), but many clients (retired or otherwise) find meaning in giving money to charitable causes. Which can present a valuable opportunity for advisors to help clients do so in the most tax-efficient way possible. However, a recent survey sponsored by Fidelity Charitable (which has an interest in promoting charitable giving through its role as a donor-advised fund sponsor) suggests there might be a disconnect in terms of advisors' awareness of their clients' interest in charitable giving. According to the survey, while 85% of high-net-worth respondents (defined here as having at least $1 million in investible assets) give to charity, advisors surveyed estimated that 57% of this group gives to charity. Further, advisors reported speaking to 57% of their high-net-worth clients about charitable planning and tax strategies (and to only 28% of clients with less than $1 million in assets), suggesting that charitable planning discussions are far from ubiquitous despite significant interest amongst clients. The survey also found that clients were largely unfamiliar with specific tax-saving strategies related to charitable giving. For instance, among advisor clients who are aware of any charitable giving vehicles, only 22% have had a discussion about donating appreciated securities, 25% have discussed donor-advised funds, and 30% have discussed Qualified Charitable Distributions (QCDs). The survey found benefits among advisors (particularly newer advisors) from holding charitable planning conversations, with 32% of advisor respondents reporting that charitable planning has helped them attract new clients (52% for advisors with less than 15 years of experience) and 44% of advisors saying that charitable planning has helped them expand relationships with existing clients (61% for newer advisors). Ultimately, the key point is that many wealthy clients appear to be charitably disposed but might not be aware of different vehicles and strategies available to maximize the tax benefits from their giving. Which suggests that incorporating charitable giving conversations into the planning process could be an effective way for advisors to offer their clients hard-dollar value. OBBBA (Temporarily) Lifts SALT Limit, Preserves PTET Workaround (Kate Dore | CNBC) One of the major points of contention in the recent legislative debate that resulted in the passage of the \"One Big Beautiful Bill Act\" (OBBBA) was whether to make changes to the limit on the deductibility of State And Local Taxes (SALT, which was capped at $10,000 under the 2017 Tax Cuts and Jobs Act), with legislators from states with relatively high tax burdens pushing for an increase to the SALT cap (with some of their counterparts expressing concern about how lifting the cap would affect the cost of the legislation). After considering dueling initial proposals from the House and Senate, the final OBBBA includes an increase to the SALT limit to $40,000 starting in 2025 (with the cap increased by 1% annually thereafter). Notably, though, there are limits to this higher cap, including a phaseout between $500,000 and $600,000 of Adjusted Gross Income (AGI, with these levels increased by 1% each year), with those with AGI above this level being subject to the previous $10,000 cap on the deduction (suggesting that advisors could add significant value to high-income clients by keeping their AGI below this range to preserve the larger SALT limit). In addition, the increased SALT cap is only slated to last through 2029 (though a future Congress could choose to extend it beyond that year), at which point it would revert to the $10,000 level (also, the new SALT cap is only $20,000 for taxpayers those filing on a married filing separately basis, who also face a phaseout at $250,000 of AGI). Notably, OBBBA left in place the ability to take advantage of state-enacted laws creating a new Pass-Through Entity Tax (PTET) designed to help owners of pass-through businesses (partnerships, LLCs, and S corporations) avoid the SALT limitation and preserve the deductibility of their state tax payments (though fewer business-owner clients might need to use this strategy given the higher SALT cap). Given that financial advisors often work with higher-income clients who might have had state and local tax burdens that exceeded the previous $10,000 cap, many clients could see a reduction in their tax bills over the next several years (including those for whom it will now make sense to itemize their deductions based on the increased SALT cap) and for advisors to help them get the greatest value from the deduction (e.g., by being aware of the phase-out range and taking advantage of PTET programs, where appropriate). How The New $6,000 Tax Deduction For Seniors Really Works (John Manganaro | ThinkAdvisor) While financial planning clients who follow the news likely heard about the passage of the \"One Big Beautiful Bill Act\" (OBBBA) last week, many were reminded (or perhaps found out for the first time) upon receiving an email from the Social Security Administration highlighting its passage and the inclusion of a new tax deduction for those aged 65 and older. However, many clients might be confused about exactly what the new deduction means for them (and whether they're eligible for it in the first place). In broad terms, the new $6,000 deduction is available to individuals aged 65 and over, with an income phase-out (based on Modified Adjusted Gross Income [MAGI]) starting at $150,000 for those using the married filing jointly status and $75,000 for others (with the deduction being completely phased out at $250,000 and $175,000, respectively). The deduction is available for 2025 through 2028 (though Congress could elect to extend it beyond then). Notably, while the new deduction has sometimes been couched in terms of reducing or eliminating tax owed on Social Security benefits, the deduction is not tied directly to receiving Social Security. Which will benefit clients who are at least 65 but are delaying claiming benefits (who are still eligible for the deduction) but could disappoint those who are younger than 65 and have claimed benefits (who will not see a reduction in any tax owed on their benefits). In sum, many older planning clients will see their tax bills lowered by the new 'senior deduction' (whether or not they've claimed Social Security benefits) and advisors are well-positioned to help them understand and maximize the benefits of it, including by helping them manage their MAGI to allow them to remain eligible for the (full) deduction where possible (which could help them limit their exposure to Income-Related Adjustment Amount [IRMAA] surcharges and other key income-related thresholds that could impact their taxes as well!). Post-OBBBA Estate Planning Strategies For Clients Across The Wealth Spectrum (Martin Shenkman, Stuart Gladstone, and Susan Dromsky-Reed | WealthManagement) While much attention has been paid to the income tax implications of the \"One Big Beautiful Bill Act\" (OBBBA), the law also makes 'permanent' (i.e., without a defined sunset date) an elevated estate, gift, and generation-skipping tax exemption, which will be set at $15 million per individual for 2026 (much higher than the $7.14 million exemption level that would have been in place for 2026 absent legislative action) and adjusted for inflation in the future. While the $15 million exemption level will allow all but the wealthiest clients to avoid Federal estate tax exposure, there remain a variety of potential estate planning opportunities for clients across the wealth spectrum. For the wealthiest clients (e.g., those who might still be exposed to the Federal estate tax), planning for the current limit (and the potential that a new law could be passed in the future that reduces the exemption level) might be prudent. For other clients, the presence of any state-level wealth or inheritance taxes could call for actions to mitigate this exposure as well (in additional to the other benefits of estate planning, including control of assets after death). In addition, there are several potential intersections between income tax measures in the OBBBA and estate planning tools as well. For instance, given that the OBBBA increases the standard deduction to $31,500 for married filing jointly taxpayers, many client couples might not be able to receive a full deduction for charitable contributions they make (if their itemized deductions don't exceed the standard deduction). However, if a client shifts investment assets to an irrevocable non-grantor trust (where the trust, rather than the settlor, pays income tax on trust income), it may be possible to use charitable contributions to offset dollar-for-dollar taxable income. In addition, shifting investment assets (and the income they generate) into an appropriate trust could also allow a client to remain below key income thresholds that determine eligibility for various deductions under the OBBBA (e.g., the new 'senior' deduction and/or the deduction for qualified business income of specified service trades or businesses). Altogether, while it might be easy to assume that estate planning is less relevant now that the elevated exemption has been made 'permanent', advisors will continue to have opportunities to help clients ensure their estate plan matches their wishes (including perhaps by making it flexible in the face of potential future changes to relevant laws) and to minimize the taxes they owe both during their lives and, potentially, after their deaths! How AI Is Rewriting SEO Rules For Financial Advisors (Rob Burgess| FinancialPlanning) Given that consumers sometimes start their search for a financial advisor (or seek answers to planning-related questions) by going to Google, many advisors have worked to improve the Search Engine Optimization (SEO) of their firm's websites in order to rise up the search ranks and get in front of more potential clients. However, the introduction of large language models (e.g., ChatGPT) and their ability to provide Artificial Intelligence (AI)-powered search summaries (e.g., on Google) has changed the SEO landscape, as many consumers can now conduct 'zero-click' searches that provide answers without having to click through to an advisor's website. In this new environment, advisors could consider several different approaches to attract the attention of potential clients and establish their credibility. To start, creating content that is specific and tailored to the firm's ideal target client could help it both rise up the 'traditional' search rankings and potentially be included in AI responses (particularly at a time when the quantity of 'general' finance content is increasing thanks to the ability to create it quickly using AI tools, showing expertise in a specific area can help an advisor stand out). Also, advisors seeking to have their content included in AI responses can facilitate the process by making it easier for the AI platform to digest, for example by including FAQs, lists, and tables (advisors can potentially gain authority in the 'eyes' of the AI platform by being quoted in the media and having positive online reviews). In addition, advisors might have greater success attracting eyeballs by repurposing their content to move beyond written content and also include audio and/or video formats (as some potential clients might seek out those types of content first). Ultimately, the key point is that advisors who create high-quality, specific, relevant content could continue to reap the benefits of being seen as a trusted authority on issues their ideal target clients face and be included in AI-generated 'search' results (with perhaps less competition, at least for now, than the heavily competitive 'traditional' search market) as well! The Ongoing Value Of SEO For Advisors Amidst AI Disruption (Leo Almazora| InvestmentNews) The rise of AI-powered \"search\" (where users can get direct answers to their questions rather than having to click through to a website listed on search results) appears to have contributed to a reduction in traffic to many websites (e.g., monthly U.S. search traffic to Charles Schab fell 14% in May compared to a 179% surge it saw during the same period in 2024). Which might lead advisors to question whether the time and/or hard-dollar cost of engaging in Search Engine Optimization (SEO) is still worth it. According to advisor marketing firm Snappy Kraken's State of Digital 2024 Report, SEO continues to offer value for advisors, with those applying SEO seeing 93.9% more new website visitors per month on average compared to those who don't, having 93.4% more visitor interactions, and 74% more pageviews. In addition, several SEO tactics can be effective for \"AEO\", or Answer Engine Optimization, including having high ratings across a range of review sites (e.g., Google Reviews). In addition, client testimonials that highlight an advisor's specific areas of expertise, geographic scope, and client focus could be effective in having the firm be highlighted by an AI tool. Also, using a specific ideal client persona when creating website content can help gain access to both types of search, as it's easier to stand out compared to firms serving a more general audience (including larger national firms, which might have more marketing and SEO resources). In the end, SEO techniques appear to remain likely to remain relevant and valuable for the foreseeable future, not only as many consumers continue to rely on 'traditional' search, but also because they can support AEO as well. Which could ultimately help advisors show more potential clients how they can provide solutions for their unique needs! How To Optimize Advisor Websites For ChatGPT Search (Brent Carnduff | Advisor Rankings) Given the increasing popularity of AI tools for performing search functions, financial advisors might be interested in optimizing their content and websites for these platforms (often referred to as \"Answer Engine Optimization\", or AEO). Notably, while many features of content and websites that help them rise up the 'traditional' search rankings are useful for AEO as well, there are several key ways to get recognized by AI tools and gain the attention of potential clients. To start, an advisory firm can create clear, specific service pages on their website using the same language their ideal client would type or say in a search (e.g.,  \"Retirement Planning in Denver\"), which can make it easy for ChatGPT or other tools to identify the firm's specialization and location (and, hopefully, list it when a potential client asks ChatGPT \"Who are retirement planning specialists in Denver?\"). Next an advisor can build 'trust' with the AI platform by having citations in credible public-facing directories (e.g., NAPFA or Fee-Only Network), consistent \"NAP\" (Name, Address, Phone number) across its various web entries, and strong client reviews (particularly on Google). Advisors can also promote AEO by ensuring their website is technically sound, fast, mobile-friendly, and secure so that AI tools can easily access and understand their content. In addition, using schema markup (i.e., content labels that help search engines and Large Language Models [LLMs] understand content), location pages, and clean formatting can help AI platforms extract and present the advisor's information accurately. Further, while 'traditional' SEO might seem less important in a world where individuals increasingly use AI tools for search, having strong SEO can help for several reasons. First, Google content often appears in Common Crawl (which is used in LLM training) and higher-ranking content is more likely to be included in this data set (whether original content by the advisor or citations or quotes from other sources). Also, because ChatGPT's browsing tool and Microsoft Copilot are powered by Bing (rather than Google), Bing-specific SEO (e.g., prioritizing exact-match keywords, registering the business with Bing Places) could be particularly valuable. In sum, engaging in AEO doesn't require a firm to throw out all of the SEO efforts it has made to date. Rather, by leveraging the SEO tactics that remain relevant for AEO (e.g., being seen as an authority on a particular subject) and engaging in AEO-friendly techniques could help an advisor remain at the top of a potential client's 'search' results, whether as part of a Google Search or a ChatGPT prompt! The Death of Partying In The U.S.A. – And Why It Matters (Derek Thompson) Historians have identified a long social streak amongst Americans, dating back to the 1800s and even before. In fact, as late as the 1970s, the average American household entertained friends at home about 15 times a year and went out to a friend's house approximately every other week. However, more recent trends suggest that Americans across the age spectrum have pulled back from in-person socializing. According to data from the American Time Use Survey (which asks Americans to estimate how much time they spend on various activities), between 2003 and 2024, the amount of time Americans spent attending or hosting a social event declined by 50% (notably, this trend was in motion before the COVID pandemic, with the share of Americans who said they visited the homes of friends in the previous week declining by more than 40% between the 1970s and the late 1990s). While all age groups surveyed showed declines, some were steeper than others; for instance, while 55-64 year olds 'only' had a 13% decline in hours spent on social events, 15-24 year-olds showed a 69% drop, those aged 65 and up had a 55% decline, and those between 25 and 54 saw a 45% in time spent on social events. Simple face-to-face socializing (without a formal event) has fallen over the past two decades as well, by 20% overall and by more than 35% for unmarried men and people younger than 25. A key question, then, is why Americans are socializing less than they did in previous decades. One potential explanation is technology, including significant time spent in front of the television (e.g., men who watch television now spend 7 hours in front of the TV for every hour they spend socializing with somebody outside their home). Relatedly, the rise in smartphone use has led to an increase in \"parasocial' relationships\", where individuals might regularly follow the actions of individuals on social media or participate in online communities with people they've never met in person. For those in middle age, another potential explanation is the increased time parents are spending with their children. For instance, researchers found that between 1975 and 1998, mothers increased the amount of time they spent with their kids by about 200 minutes per week, while married fathers spent an additional 240 minutes per week with their kids (separate research found that childcare time surged again in the mid-1990s by more than 9 hours per week among college-educated parents). Altogether, the aggregate data paint a compelling picture of a decline in face-to-face socializing amongst Americans, which has the potential to result in less community engagement and a reduced sense of public trust over time. Which suggests that being more intentional about finding time for in-person socialization not only could lead to stronger personal connections, but also a stronger social fabric as well? 4 Ways To Socialize Effectively In Your 30s And Beyond (Catherine Andrews | Medium) As a kid or young adult it's fairly easy to organize social events, from an after-school hangout to an after-work happy hour. However, as time goes by and responsibilities (work, family, etc.) build up, it can be harder to plan for and execute social engagements with friends. With this in mind, Andrews offers four ways to facilitate social activities while maintaining other responsibilities. A first step is to bucket one's friends into 'groups' based on the types of activities they are most likely to engage in (so that invitations for a particular event go out to the person or people who are most likely to join). For instance, some friends might be most likely to come for a hike while others are more likely to come over for a party on the weekend and another group (perhaps those who live in another city) would want to join for a single large event each year (e.g., an annual friend getaway). It can also be helpful to recognize one's \"activator\" friends, or the ones who are most likely to plan and execute social events, and maintain ties with them (to secure invitations to more social events they organize). Another way to boost social opportunities is to formalize certain activities or join clubs. For example, holding a monthly book club is a good way to ensure the event will stay on the calendar (rather than holding ad hoc conversations about new books, which might not come to fruition). Finally, when invites come in or events or scheduled, following through and actually attending the events can build trust with one's friends (as no-shows who said they would come can be disappointing) and lead to more social opportunities in the future. Ultimately, the key point is that as responsibilities start to mount in middle age, it can become more difficult to plan and follow through on social engagements. Nonetheless, taking an organized approach to doing so can lead to greater opportunities and stronger social relationships that last over time! How To Host Your First Dinner Party (Alexandra Strick | The Hostess In The Studio Apartment) Hosting a dinner party is a classic way to socialize with friends or family. However, actually putting one on can seem intimidating given the number of potential tasks involved. Nonetheless, taking a step-by-step approach can make hosting the event easier and increase the chances of its success. The first step is to set a date and time for the event. Strick suggests hosting a first dinner party on a Saturday starting between 5pm and 9pm, which gives plenty of time for preparation and for cleanup/recovery before going back to work on Monday. Next, selecting a theme for the party (perhaps planning it around a particular holiday or season) can make menu-planning and any decorating simpler (e.g., a winter-theme party could call for plenty of warm drink options and cozy dim lighting). With a theme picked out, the next task is to craft a guest list. For those having a hard time paring down potential invitees, it can be helpful to consider who would most enjoy each other's company (and perhaps wait to invite others to a future party!), while those who are concerned that they won't have enough attendees could encourage guests to bring a friend along (or perhaps invite a work acquaintance they'd like to get to know better). A dinner party host can then move on to strategizing how they will organize their space (e.g., whether they might need to borrow additional chairs or table space), planning the menu (perhaps focusing on 'go-to' dishes the host knows they can cook well and can easily be served family style), and making a grocery list. And as the day of the event approaches, Strick recommends setting the table well in advance (to give time to procure any items that might be missing) and reserving time to clean the apartment or house to avoid any last-second dusting. In sum, while organizing a dinner party is not a simple endeavor, taking time for advanced planning can ensure that all necessary steps get done and that the host can (hopefully) have plenty of time to enjoy the party itself. Which can ultimately lead to happy guests, stronger friendships, and perhaps invitations to (more relaxing) dinner parties at friends' houses in the future. We hope you enjoyed the reading! Please leave a comment below to share your thoughts, or send an email to [email protected] to suggest any articles you think would be a good fit for a future column! In the meantime, if you're interested in more news and information regarding advisor technology, we'd highly recommend checking out Craig Iskowitz's \"Wealth Management Today\" blog. Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2025/01/Social-Image-Blog-Article-Weekend-Reading-2025.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003eEnjoy the current installment of \u0026#34;Weekend Reading For Financial Planners\u0026#34; - this week\u0026#39;s edition kicks off with the news that, amidst the growing number of RIAs it supervises, the \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-12-13-2025/#SEC-Plan\"\u003eSecurities and Exchange Commission (SEC) is moving ahead with a potential plan\u003c/a\u003e to raise the $100 million regulatory assets under management threshold for SEC registration, with the regulator having talks with some state securities regulators (which would bear an increasing regulatory burden if the threshold were lifted and more firms came under their watch) on the issue. While the SEC has not released a formal proposal (which would likely offer advisers and other interested parties a chance to air their views on the issue), such a move could prove frustrating for firms forced to switch to state registration (particularly those with clients spread across state lines) as it would potentially require affected RIAs to register with multiple state regulators and be subject to a varying set of rules depending on which state(s) they are registered in, compared to the more uniform supervision they experience under the SEC.\u003c/p\u003e\n\u003cp\u003eAlso in industry news this week:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA recent survey finds that \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-12-13-2025/#unsolicited-referrals\"\u003e(unsolicited) client referrals are the top source of new clients\u003c/a\u003e for advisors this year, while networking, client appreciation events, and educational events have also proven to be fruitful for some advisors\u003c/li\u003e\n\u003cli\u003eA survey suggests that some advisors might be \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-12-13-2025/#charitable-demand\"\u003eunderestimating their clients\u0026#39; interest in charitable giving\u003c/a\u003e, an area where advisors can potentially offer hard-dollar tax savings for clients\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFrom there, we have several articles on financial planning implications of the \u0026#34;One Big Beautiful Bill Act\u0026#34; (OBBBA):\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePotential \u003ca href=\"http://kitces.com/blog/weekend-reading-for-financial-planners-july-12-13-2025/#OBBBA1\"\u003eplanning strategies in the wake of the increased State And Local Tax (SALT) cap\u003c/a\u003e, (including the potential value of managing income for clients near the phase-out limits)\u003c/li\u003e\n\u003cli\u003eHow the \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-12-13-2025/#tax-deduction\"\u003enew $6,000 tax deduction for seniors\u003c/a\u003e works (and why clients who are delaying claiming Social Security benefits could be in for a pleasant surprise)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-12-13-2025/#OBBBA2\"\u003ePost-OBBBA estate planning strategies\u003c/a\u003e for clients across the wealth spectrum and how trusts could be an effective way for some clients to manage income amidst a growing number of phase-out ranges for certain tax benefits\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe also have a number of articles on marketing:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWhy the value of creating content tailored to an ideal client profile has increased in a world where \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-12-13-2025/#ai-seo1\"\u003emore individuals are using Artificial Intelligence (AI) tools\u003c/a\u003e to find answers to their financial questions\u003c/li\u003e\n\u003cli\u003eHow \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-12-13-2025/#ai-seo2\"\u003e\u0026#39;traditional\u0026#39; Search Engine Optimization (SEO) still has value\u003c/a\u003e for advisors amidst growing use of AI tools for Internet searches\u003c/li\u003e\n\u003cli\u003eHow advisors can \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-12-13-2025/#chatgpt\"\u003eoptimize their websites for ChatGPT search\u003c/a\u003e and reap the benefits of \u0026#34;Answer Engine Optimization\u0026#34; (AEO)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe wrap up with three final articles, all about social life:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eData show that the time Americans spend on in-person \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-12-13-2025/#partying\"\u003esocializing has decreased dramatically over the past several decades\u003c/a\u003e, with increased time spent on watching television and using smartphones among the potential causes\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-12-13-2025/#socialize\"\u003eFour ways to socialize effectively in one\u0026#39;s 30s and beyond\u003c/a\u003e, from formalizing social events to \u0026#39;organizing\u0026#39; friends to identify the most relevant event types for each group\u003c/li\u003e\n\u003cli\u003eA step-by-step approach to \u003ca href=\"https://www.kitces.com/blog/weekend-reading-for-financial-planners-july-12-13-2025/#dinner\"\u003ehosting a memorable (and relatively low-stress?) dinner party\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEnjoy the \u0026#39;light\u0026#39; reading!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg width=\"200\" height=\"200\" data-src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" alt=\"Adam Van Deusen Headshot\" decoding=\"async\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\" data-sizes=\"(max-width: 200px) 100vw, 200px\" src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eAdam is a Financial Planning Nerd at \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits.\u003c/p\u003e\n\u003cp\u003eRead more of Adam’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=7517\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003ch2 data-nav-title=\"SEC Progressing On Registration Plan\" id=\"sec-progressing-on-plan-that-could-send-many-national-rias-back-to-state-registration\"\u003e\u003ca id=\"SEC-Plan\"\u003e\u003c/a\u003e\u003cspan\u003e\u003ca href=\"https://www.thinkadvisor.com/2025/06/30/sec-in-talks-to-raise-aum-threshold-for-advisor-registration/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eSEC Progressing On Plan That Could Send Many National RIAs Back To State Registration\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Melanie Waddell | ThinkAdvisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the United States, \u003ca href=\"https://www.kitces.com/blog/registered-investment-advisor-ria-sec-federal-state-registration-rules-iras-notice-filing/\"\u003eRegistered Investment Advisers (RIAs) are required to register in one of 2 ways\u003c/a\u003e: with the Federal government (namely the SEC), or with one or more state securities regulatory agencies. Under the National Securities Markets Improvement Act of 1996 (NSMIA), states were tasked with supervising firms up to $25 million in \u003ca href=\"https://www.kitces.com/blog/calculating-regulatory-assets-under-management-vs-advisement-aua/\"\u003eRegulatory Assets Under Management (RAUM)\u003c/a\u003e, with the SEC in charge of larger firms. This asset limit for state registration was subsequently expanded under the Dodd-Frank Act of 2010 to $100 million to encourage the SEC, in the wake of the 2007-2009 financial crisis, to focus on supervising the largest firms (and delegating the rest of RIA oversight to the states). The legislation also allowed the SEC to increase this threshold again in the future if it sees fit.\u003c/p\u003e\n\u003cp\u003eIn early April, then-acting SEC Chair Mark Uyeda made headlines by saying he had asked SEC staff to conduct \u0026#34;a periodic evaluation\u0026#34; on whether the current $100 million threshold is still \u0026#34;optimal\u0026#34; (citing in particular the 45% growth in the number of RIAs since Dodd-Frank\u0026#39;s 2012 compliance date, which has increased the number of RIA examinations the SEC is responsible for at a time when the agency is grappling with the departures of about 10% of its staff). Notably, any increase in the RAUM threshold for SEC registration would effectively shift those firms to become state-registered instead, putting more of a burden on the states to handle examinations instead (in an environment where some states themselves already struggle to maintain sufficient staff levels for timely RIA registrations and regular examinations). Which in turn raises the prospect that some RIAs may struggle with the fact that not all states have the same regulations (e.g., pertaining to whether the firm can use testimonials in their marketing) and thus would have to adapt their practices to each state in which they have clients.\u003c/p\u003e\n\u003cp\u003eAfter taking the reins of the SEC, Chair Paul Atkins has indicated he is moving ahead with the plan to raise the $100 million asset threshold, with the regulator having talks with some state securities regulators on the issue (though specifics of these discussions are unclear, the SEC could be assessing state regulators\u0026#39; capabilities to take on a greater burden of RIA registrations and examinations). In a recent \u003ca href=\"https://beachstreetlegal.com/on-the-docket-sec-aum-threshold-under-evaluation-guidelines-for-reporting-of-securities-accounts-sec-withdraws-14-proposed-regulations-and-more/\"\u003eblog post\u003c/a\u003e, attorney Chris Stanley notes that while it\u0026#39;s \u0026#34;too early to tell whether, when, and by how much\u0026#34; the $100 million threshold will be raised, SEC-registered RIAs with about $500 million or less in AUM might want to keep a watchful eye on the results of the SEC\u0026#39;s staff evaluation (given the \u003ca href=\"https://x.com/BeachStreetEsq/status/1886487989670568370\"\u003epossible consequences for these firms\u003c/a\u003e and the potential to provide their views during a public comment period on any rulemaking on the topic).\u003c/p\u003e\n\u003cp\u003eUltimately, the significance of the prospective shift is that, to the extent that \u0026#34;mid-sized\u0026#34; RIAs (e.g., those with $100M to $500M of AUM) are more likely to have clients across multiple states (simply due to their size), firms will either have to manage to the potential of increased compliance burdens of navigating multiple states with similar-but-not-same rules, try to get to the point they\u0026#39;re registered in 15+ states to be able to once again trigger eligibility for SEC registration (regardless of AUM), or may have a draw to various corporate RIA \u0026#34;supported independence\u0026#34; models where the platform RIA \u003cem\u003eis \u003c/em\u003elarge enough to be SEC-registered (and therefore advisors could affiliate with a Federally registered firm as a way to circumvent state registration if it\u0026#39;s a problem point for htem).\u003c/p\u003e\n\u003cp\u003eIn the end, while a new RAUM threshold hasn\u0026#39;t been proposed, the core idea of allowing the SEC to focus its supervisory efforts on the largest RIAs arguably makes sense, yet could still prove frustrating for firms forced to switch to state registration (particularly those with clients spread across state lines) as it would potentially require affected RIAs to register with multiple state regulators and \u003ca href=\"https://www.kitces.com/blog/sec-state-registered-investment-advisers-compliance-rules-regulations-differences-documents-application-process/\"\u003ebe subject to a varying set of rules\u003c/a\u003e depending on which state(s) they are registered in, compared to the more uniform supervision they experience under the SEC. And there is a non-trivial consumer risk that RIA protections may decrease if the states themselves don\u0026#39;t have the resources to actually oversee the mid-sized advisory firms pushed down into their purview. Of course, firms that have clients in more than 15 states remain eligible for SEC registration, regardless of their AUM, and SEC-registered supported-independence models have already been on the rise… but as long as states are not consistent in their own regulatory requirements from one state to another (and/or don\u0026#39;t fully conform to the SEC\u0026#39;s own guidance), a shift in AUM requirements for Federal registration will just put more focus than ever on NASAA to help improve the consistency of state-by-state regulation of RIAs.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Referrals Top Source Of New Clients\" id=\"unsolicited-referrals-top-source-of-new-advisory-clients-survey\"\u003e\u003cspan\u003e\u003ca id=\"unsolicited-referrals\"\u003e\u003c/a\u003e\u003ca href=\"https://www.fa-mag.com/news/advisors-lack-reltionships-with-clients--children--survey-says-83103.html?section=126\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003e(Unsolicited) Referrals Top Source Of New Advisory Clients: Survey\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Karen DeMasters | Financial Advisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAdding new clients is a top priority for many financial advisory firms, whether they are in growth mode or are seeking to hold their client headcount relatively steady (given that some level of client attrition is inevitable over time). To do so, many firms will actively engage in one or more marketing strategies, which can cost time and/or money. However, a recent survey suggests that many advisors are benefiting from the value they\u0026#39;re already providing clients in the form of unsolicited client referrals.\u003c/p\u003e\n\u003cp\u003eAccording to \u003ca href=\"https://www.insperex.com/market-linked-products/advisor-pulse-survey/\"\u003ea survey of 829 financial advisors by InspereX\u003c/a\u003e, 76% of respondents have gained new clients in 2025 through unsolicited client referrals, with this mode being the top way 51% of advisors acquired new clients. Other types of referrals also proved fruitful for advisors, with 38% of respondents reporting getting a new client this year after soliciting clients for referrals and the same percentage getting new clients from referrals from Centers Of Influence (COIs, including CPAs and attorneys). Other marketing tactics surveyed that led to new clients included networking (36%), client appreciation events (20%), and educational events (17%). These results reflect results from \u003ca href=\"https://www.kitces.com/kitces-report-financial-planner-advisor-marketing-tactics-strategies-referrals-centers-influence-networking/\"\u003eKitces Research on Advisor Marketing\u003c/a\u003e, which found that 88% of advisors surveyed use client referrals and 95% have had success getting new clients with this tactic, while 62% use COI referrals (with 85% success), and 47% engage in in-person networking (with 64% success).\u003c/p\u003e\n\u003cp\u003eIn sum, referrals appear to remain a primary source of new clients for financial advisors. And while some might come unsolicited (thanks to the high level of service an advisor is providing their clients), there are also a variety of ways advisors could potentially drive even more referrals, from \u003ca href=\"https://www.kitces.com/blog/client-referrals-net-promoter-score-introduction-meeting-coi-centers-of-influence/\"\u003eidentifying \u0026#34;active promoters\u0026#34; among their client base\u003c/a\u003e or \u003ca href=\"https://www.kitces.com/blog/ways-to-ask-for-referrals-financial-advisor-questions-marketing/\"\u003eleveraging pro-social psychology\u003c/a\u003e to \u003ca href=\"https://www.kitces.com/blog/libby-greiwe-444-efficient-advisor-client-referrals-onboarding-coaching-consulting-30-day-period/\"\u003ecreating an exceptional onboarding experience\u003c/a\u003e, \u003ca href=\"https://www.kitces.com/blog/veronica-karas-captrust-marketing-referral-questions-prospects-network-coi/\"\u003easking for referrals after celebrating successes with clients\u003c/a\u003e, or \u003ca href=\"https://www.kitces.com/blog/coi-centers-of-influence-finanancial-advisor-relationship-referrals-strategy-prospects/\"\u003etaking a structured approach to vetting and establishing productive COI relationships\u003c/a\u003e.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Demand For Charitable Planning Guidance\" id=\"survey-suggests-some-advisors-might-be-underestimating-demand-for-charitable-planning-guidance\"\u003e\u003cspan\u003e\u003ca id=\"charitable-demand\"\u003e\u003c/a\u003e\u003ca href=\"https://www.wealthmanagement.com/philanthropy/advisors-are-underestimating-charitable-giving\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eSurvey Suggests Some Advisors Might Be Underestimating Demand For Charitable Planning Guidance\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(David Lenok | WealthManagement)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eClients are often focused on accumulating assets (at least until spending them down in retirement), but many clients (retired or otherwise) find meaning in giving money to charitable causes. Which can present a valuable opportunity for advisors to help clients do so in the most tax-efficient way possible.\u003c/p\u003e\n\u003cp\u003eHowever, a recent \u003ca href=\"https://www.fidelitycharitable.org/content/dam/fc-public/docs/insights/differentiating-with-charitable-planning.pdf\"\u003esurvey\u003c/a\u003e sponsored by Fidelity Charitable (which has an interest in promoting charitable giving through its role as a donor-advised fund sponsor) suggests there might be a disconnect in terms of advisors\u0026#39; awareness of their clients\u0026#39; interest in charitable giving. According to the survey, while 85% of high-net-worth respondents (defined here as having at least $1 million in investible assets) give to charity, advisors surveyed estimated that 57% of this group gives to charity. Further, advisors reported speaking to 57% of their high-net-worth clients about charitable planning and tax strategies (and to only 28% of clients with less than $1 million in assets), suggesting that charitable planning discussions are far from ubiquitous despite significant interest amongst clients.\u003c/p\u003e\n\u003cp\u003eThe survey also found that clients were largely unfamiliar with specific tax-saving strategies related to charitable giving. For instance, among advisor clients who are aware of any charitable giving vehicles, only 22% have had a discussion about \u003ca href=\"https://www.kitces.com/blog/deduction-lumping-charitable-clumping-tax-savings-itemized-vs-standard-deduction/\"\u003edonating appreciated securities\u003c/a\u003e, 25% have discussed \u003ca href=\"https://www.kitces.com/blog/rules-strategies-and-tactics-when-using-donor-advised-funds-for-charitable-giving/\"\u003edonor-advised funds\u003c/a\u003e, and 30% have discussed \u003ca href=\"https://www.kitces.com/blog/qualified-charitable-distribution-qcd-from-ira-to-satisfy-rmd-rules-and-requirements/\"\u003eQualified Charitable Distributions (QCDs)\u003c/a\u003e. The survey found benefits among advisors (particularly newer advisors) from holding charitable planning conversations, with 32% of advisor respondents reporting that charitable planning has helped them attract new clients (52% for advisors with less than 15 years of experience) and 44% of advisors saying that charitable planning has helped them expand relationships with existing clients (61% for newer advisors).\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that many wealthy clients appear to be charitably disposed but might not be aware of different vehicles and strategies available to maximize the tax benefits from their giving. Which suggests that \u003ca href=\"https://www.kitces.com/blog/charitable-giving-advisor-client-conversations-charity-sample-script-questions-financial-plan/\"\u003eincorporating charitable giving conversations into the planning process\u003c/a\u003e could be an effective way for advisors to offer their clients hard-dollar value.\u003c/p\u003e\n\u003ch2 data-nav-title=\"OBBBA (Temporarily) Lifts SALT Limit\" id=\"obbba-temporarily-lifts-salt-limit-preserves-ptet-workaround\"\u003e\u003ca id=\"OBBBA1\"\u003e\u003c/a\u003e\u003cspan\u003e\u003ca href=\"https://www.cnbc.com/2025/07/03/trumps-big-beautiful-bill-salt-deduction.html\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Taxes\"\u003eOBBBA (Temporarily) Lifts SALT Limit, Preserves PTET Workaround\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Kate Dore | CNBC)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOne of the major points of contention in the recent legislative debate that resulted in the passage of the \u0026#34;One Big Beautiful Bill Act\u0026#34; (OBBBA) was whether to make changes to the limit on the deductibility of State And Local Taxes (SALT, which was capped at $10,000 under the 2017 Tax Cuts and Jobs Act), with legislators from states with relatively high tax burdens pushing for an increase to the SALT cap (with some of their counterparts expressing concern about how lifting the cap would affect the cost of the legislation).\u003c/p\u003e\n\u003cp\u003eAfter considering dueling initial proposals from the House and Senate, the final OBBBA includes an increase to the SALT limit to $40,000 starting in 2025 (with the cap increased by 1% annually thereafter). Notably, though, there are limits to this higher cap, including a phaseout between $500,000 and $600,000 of Adjusted Gross Income (AGI, with these levels increased by 1% each year), with those with AGI above this level being subject to the previous $10,000 cap on the deduction (suggesting that advisors could add significant value to high-income clients by keeping their AGI below this range to preserve the larger SALT limit). In addition, the increased SALT cap is only slated to last through 2029 (though a future Congress could choose to extend it beyond that year), at which point it would revert to the $10,000 level (also, the new SALT cap is only $20,000 for taxpayers those filing on a married filing separately basis, who also face a phaseout at $250,000 of AGI).\u003c/p\u003e\n\u003cp\u003eNotably, OBBBA left in place the ability \u003ca href=\"https://www.kitces.com/blog/pass-through-entity-tax-ptet-salt-deduction-cap-partnership-s-corp-llc/\"\u003eto take advantage of state-enacted laws creating a new Pass-Through Entity Tax (PTET)\u003c/a\u003e designed to help owners of pass-through businesses (partnerships, LLCs, and S corporations) avoid the SALT limitation and preserve the deductibility of their state tax payments (though fewer business-owner clients might need to use this strategy given the higher SALT cap).\u003c/p\u003e\n\u003cp\u003eGiven that financial advisors often work with higher-income clients who might have had state and local tax burdens that exceeded the previous $10,000 cap, many clients could see a reduction in their tax bills over the next several years (including those for whom it will now make sense to itemize their deductions based on the increased SALT cap) and for advisors to help them get the greatest value from the deduction (e.g., by being aware of the phase-out range and taking advantage of PTET programs, where appropriate).\u003c/p\u003e\n\u003ch2 data-nav-title=\"New $6,000 Tax Deduction For Seniors\" id=\"how-the-new-6000-tax-deduction-for-seniors-really-works\"\u003e\u003cspan\u003e\u003ca id=\"tax-deduction\"\u003e\u003c/a\u003e\u003ca href=\"https://www.thinkadvisor.com/2025/07/07/how-the-new-6000-tax-deduction-for-seniors-really-works/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"\u0026#34;Taxes\"\u003eHow The New $6,000 Tax Deduction For Seniors Really Works\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(John Manganaro | ThinkAdvisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhile financial planning clients who follow the news likely heard about the passage of the \u0026#34;One Big Beautiful Bill Act\u0026#34; (OBBBA) last week, many were reminded (or perhaps found out for the first time) upon \u003ca href=\"https://www.axios.com/2025/07/07/social-security-email-big-beautiful-bill\"\u003ereceiving an email\u003c/a\u003e from the Social Security Administration \u003ca href=\"https://www.ssa.gov/news/press/releases/2025/#2025-07-03\"\u003ehighlighting its passage\u003c/a\u003e and the inclusion of a new tax deduction for those aged 65 and older.\u003c/p\u003e\n\u003cp\u003eHowever, many clients might be confused about exactly what the new deduction means for them (and whether they\u0026#39;re eligible for it in the first place). In broad terms, the new $6,000 deduction is available to individuals aged 65 and over, with an income phase-out (based on Modified Adjusted Gross Income [MAGI]) starting at $150,000 for those using the married filing jointly status and $75,000 for others (with the deduction being completely phased out at $250,000 and $175,000, respectively). The deduction is available for 2025 through 2028 (though Congress could elect to extend it beyond then).\u003c/p\u003e\n\u003cp\u003eNotably, while the new deduction has sometimes been couched in terms of reducing or eliminating tax owed on Social Security benefits, the deduction is not tied directly to receiving Social Security. Which will benefit clients who are at least 65 but are delaying claiming benefits (who are still eligible for the deduction) but could disappoint those who are younger than 65 and have claimed benefits (who will not see a reduction in any tax owed on their benefits).\u003c/p\u003e\n\u003cp\u003eIn sum, many older planning clients will see their tax bills lowered by the new \u0026#39;senior deduction\u0026#39; (whether or not they\u0026#39;ve claimed Social Security benefits) and advisors are well-positioned to help them understand and maximize the benefits of it, including by helping them manage their MAGI to allow them to remain eligible for the (full) deduction where possible (which could help them limit their exposure to \u003ca href=\"https://www.kitces.com/blog/irmaa-medicare-part-b-part-d-premium-surcharges-new-2018-magi-thresholds/\"\u003eIncome-Related Adjustment Amount [IRMAA]\u003c/a\u003e surcharges and other key income-related thresholds that could impact their taxes as well!).\u003c/p\u003e\n\u003ch2 data-nav-title=\"Post-OBBBA Estate Planning Strategies\" id=\"postobbba-estate-planning-strategies-for-clients-across-the-wealth-spectrum\"\u003e\u003cspan\u003e\u003ca id=\"OBBBA2\"\u003e\u003c/a\u003e\u003ca href=\"https://www.wealthmanagement.com/estate-planning/big-beautiful-bill-what-estate-planning-steps-make-sense-now-\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"\u0026#34;Taxes\"\u003ePost-OBBBA Estate Planning Strategies For Clients Across The Wealth Spectrum\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Martin Shenkman, Stuart Gladstone, and Susan Dromsky-Reed | WealthManagement)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhile much attention has been paid to the income tax implications of the \u0026#34;One Big Beautiful Bill Act\u0026#34; (OBBBA), the law also makes \u0026#39;permanent\u0026#39; (i.e., without a defined sunset date) an elevated estate, gift, and generation-skipping tax exemption, which will be set at $15 million per individual for 2026 (much higher than the $7.14 million exemption level that would have been in place for 2026 absent legislative action) and adjusted for inflation in the future.\u003c/p\u003e\n\u003cp\u003eWhile the $15 million exemption level will allow all but the wealthiest clients to avoid Federal estate tax exposure, there remain a variety of potential estate planning opportunities for clients across the wealth spectrum. For the wealthiest clients (e.g., those who might still be exposed to the Federal estate tax), planning for the current limit (and the potential that a new law could be passed in the future that reduces the exemption level) might be prudent. For other clients, the presence of any state-level wealth or inheritance taxes could call for actions to mitigate this exposure as well (in additional to the other benefits of estate planning, including control of assets after death).\u003c/p\u003e\n\u003cp\u003eIn addition, there are several potential intersections between income tax measures in the OBBBA and estate planning tools as well. For instance, given that the OBBBA increases the standard deduction to $31,500 for married filing jointly taxpayers, many client couples might not be able to receive a full deduction for charitable contributions they make (if their itemized deductions don\u0026#39;t exceed the standard deduction). However, if a client shifts investment assets to an irrevocable non-grantor trust (where the trust, rather than the settlor, pays income tax on trust income), it may be possible to use charitable contributions to offset dollar-for-dollar taxable income. In addition, shifting investment assets (and the income they generate) into an appropriate trust could also allow a client to remain below key income thresholds that determine eligibility for various deductions under the OBBBA (e.g., the new \u0026#39;senior\u0026#39; deduction and/or the deduction for qualified business income of specified service trades or businesses).\u003c/p\u003e\n\u003cp\u003eAltogether, while it might be easy to assume that estate planning is less relevant now that the elevated exemption has been made \u0026#39;permanent\u0026#39;, advisors will continue to have opportunities to help clients ensure their estate plan matches their wishes (including perhaps by \u003ca href=\"https://www.kitces.com/blog/flexible-estate-planning-strategies-that-adapt-to-a-constantly-changing-political-landscape-irc-ab-trust/\"\u003emaking it flexible in the face of potential future changes to relevant laws\u003c/a\u003e) and to minimize the taxes they owe both during their lives and, potentially, after their deaths!\u003c/p\u003e\n\u003ch2 data-nav-title=\"How AI Is Rewriting SEO Rules\" id=\"how-ai-is-rewriting-seo-rules-for-financial-advisors\"\u003e\u003ca id=\"ai-seo1\"\u003e\u003c/a\u003e\u003cspan\u003e\u003ca href=\"https://www.financial-planning.com/news/ai-powered-search-is-re-writing-seo-rules-and-advisors-must-adjust\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Marketing\"\u003eHow AI Is Rewriting SEO Rules For Financial Advisors\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Rob Burgess| FinancialPlanning)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGiven that consumers sometimes start their search for a financial advisor (or seek answers to planning-related questions) by going to Google, many advisors have worked to \u003ca href=\"https://www.kitces.com/blog/best-advisor-website-search-engine-optimization-seo-tips-meta-tags-descriptions-ux-linking/\"\u003eimprove the Search Engine Optimization (SEO)\u003c/a\u003e of their firm\u0026#39;s websites in order \u003ca href=\"https://www.kitces.com/blog/seo-financial-advisor-google-local-search-intent-best-keywords/\"\u003eto rise up the search ranks and get in front of more potential clients\u003c/a\u003e. However, the introduction of large language models (e.g., ChatGPT) and their ability to provide Artificial Intelligence (AI)-powered search summaries (e.g., on Google) has changed the SEO landscape, as many consumers can now conduct \u0026#39;zero-click\u0026#39; searches that provide answers without having to click through to an advisor\u0026#39;s website.\u003c/p\u003e\n\u003cp\u003eIn this new environment, advisors could consider several different approaches to attract the attention of potential clients and establish their credibility. To start, \u003ca href=\"https://www.kitces.com/blog/mikel-bruce-tinyfrog-financial-advisor-content-aida-social-proof-lead-magnet-content-marketing-website-clients-lead-generation/\"\u003ecreating content\u003c/a\u003e that is specific and tailored to the firm\u0026#39;s ideal target client could help it both rise up the \u0026#39;traditional\u0026#39; search rankings and potentially be included in AI responses (particularly at a time when the quantity of \u0026#39;general\u0026#39; finance content is increasing thanks to the ability to create it quickly using AI tools, showing expertise in a specific area can help an advisor stand out). Also, advisors seeking to have their content included in AI responses can facilitate the process by making it easier for the AI platform to digest, for example by including FAQs, lists, and tables (advisors can potentially gain authority in the \u0026#39;eyes\u0026#39; of the AI platform by being quoted in the media and having positive online reviews). In addition, advisors might have greater success attracting eyeballs by \u003ca href=\"https://www.kitces.com/blog/financial-advisor-content-marketing-repurpose-seo-video-podcast-social-media-newsletter/\"\u003erepurposing their content\u003c/a\u003e to move beyond written content and also include audio and/or video formats (as some potential clients might seek out those types of content first).\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that advisors who create high-quality, specific, relevant content could continue to reap the benefits of being seen as a trusted authority on issues their ideal target clients face and be included in AI-generated \u0026#39;search\u0026#39; results (with perhaps less competition, at least for now, than the heavily competitive \u0026#39;traditional\u0026#39; search market) as well!\u003c/p\u003e\n\u003ch2 data-nav-title=\"The Ongoing Value Of SEO For Advisors\" id=\"the-ongoing-value-of-seo-for-advisors-amidst-ai-disruption\"\u003e\u003ca id=\"ai-seo2\"\u003e\u003c/a\u003e\u003cspan\u003e\u003ca href=\"https://www.investmentnews.com/practice-management/with-ai-disrupting-google-should-advisors-call-it-quits-on-seo/260993\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Marketing\"\u003eThe Ongoing Value Of SEO For Advisors Amidst AI Disruption\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Leo Almazora| InvestmentNews)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe rise of AI-powered \u0026#34;search\u0026#34; (where users can get direct answers to their questions rather than having to click through to a website listed on search results) appears to have contributed to a reduction in traffic to many websites (e.g., monthly U.S. search traffic to Charles Schab fell 14% in May compared to a 179% surge it saw during the same period in 2024). Which might lead advisors to question whether the time and/or hard-dollar cost of engaging in Search Engine Optimization (SEO) is still worth it.\u003c/p\u003e\n\u003cp\u003eAccording to advisor marketing firm \u003ca href=\"https://snappykraken.com/state-of-digital\"\u003eSnappy Kraken\u0026#39;s State of Digital 2024 Report\u003c/a\u003e, SEO continues to offer value for advisors, with those applying SEO seeing 93.9% more new website visitors per month on average compared to those who don\u0026#39;t, having 93.4% more visitor interactions, and 74% more pageviews. In addition, several SEO tactics can be effective for \u0026#34;AEO\u0026#34;, or Answer Engine Optimization, including having high ratings across a range of review sites (e.g., \u003ca href=\"https://www.kitces.com/blog/tim-goodwin-seo-search-engine-optimization-google-reviews-advisor-prospects/\"\u003eGoogle Reviews\u003c/a\u003e). In addition, client testimonials that highlight an advisor\u0026#39;s specific areas of expertise, geographic scope, and client focus could be effective in having the firm be highlighted by an AI tool. Also, using a specific \u003ca href=\"https://www.kitces.com/blog/ideal-client-persona-financial-advisor-niche-marketing-messaging/\"\u003eideal client persona\u003c/a\u003e when creating website content can help gain access to both types of search, as it\u0026#39;s easier \u003ca href=\"https://www.kitces.com/blog/marketing-growth-financial-advisor-prospects-different-ria/\"\u003eto stand out compared to firms serving a more general audience\u003c/a\u003e (including larger national firms, which might have more marketing and SEO resources).\u003c/p\u003e\n\u003cp\u003eIn the end, \u003ca href=\"https://www.kitces.com/blog/best-advisor-website-search-engine-optimization-seo-tips-meta-tags-descriptions-ux-linking/\"\u003eSEO techniques\u003c/a\u003e appear to remain likely to remain relevant and valuable for the foreseeable future, not only as many consumers continue to rely on \u0026#39;traditional\u0026#39; search, but also because they can support AEO as well. Which could ultimately help advisors show more potential clients how they can provide solutions for their unique needs!\u003c/p\u003e\n\u003ch2 data-nav-title=\"How To Optimize Websites For ChatGPT\" id=\"how-to-optimize-advisor-websites-for-chatgpt-search\"\u003e\u003ca id=\"chatgpt\"\u003e\u003c/a\u003e\u003cspan\u003e\u003ca href=\"https://advisorrankings.io/aeo-optimizing-for-chatgpt-search-a-guide-for-financial-advisors/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Marketing\"\u003eHow To Optimize Advisor Websites For ChatGPT Search\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Brent Carnduff | Advisor Rankings)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGiven the increasing popularity of AI tools for performing search functions, financial advisors might be interested in optimizing their content and websites for these platforms (often referred to as \u0026#34;Answer Engine Optimization\u0026#34;, or AEO). Notably, while many features of content and websites that help them rise up the \u0026#39;traditional\u0026#39; search rankings are useful for AEO as well, there are several key ways to get recognized by AI tools and gain the attention of potential clients.\u003c/p\u003e\n\u003cp\u003eTo start, an advisory firm can create clear, specific service pages on their website using the same language their ideal client would type or say in a search (e.g.,  \u0026#34;Retirement Planning in Denver\u0026#34;), which can make it easy for ChatGPT or other tools to identify the firm\u0026#39;s specialization and location (and, hopefully, list it when a potential client asks ChatGPT \u0026#34;Who are retirement planning specialists in Denver?\u0026#34;). Next an advisor can build \u0026#39;trust\u0026#39; with the AI platform by having citations in credible public-facing directories (e.g., \u003ca href=\"https://www.napfa.org/find-an-advisor\"\u003eNAPFA\u003c/a\u003e or \u003ca href=\"https://www.feeonlynetwork.com/\"\u003eFee-Only Network\u003c/a\u003e), consistent \u0026#34;NAP\u0026#34; (Name, Address, Phone number) across its various web entries, and strong client reviews (particularly on Google). Advisors can also promote AEO by ensuring their website is technically sound, fast, mobile-friendly, and secure so that AI tools can easily access and understand their content. In addition, using schema markup (i.e., content labels that help search engines and Large Language Models [LLMs] understand content), location pages, and clean formatting can help AI platforms extract and present the advisor\u0026#39;s information accurately.\u003c/p\u003e\n\u003cp\u003eFurther, while \u0026#39;traditional\u0026#39; SEO might seem less important in a world where individuals increasingly use AI tools for search, \u003ca href=\"https://www.kitces.com/blog/brent-carnduff-advisor-rankings-marketing-organic-seo-google-rankings/\"\u003ehaving strong SEO can help for several reasons\u003c/a\u003e. First, Google content often appears in \u003ca href=\"https://commoncrawl.org/\"\u003eCommon Crawl\u003c/a\u003e (which is used in LLM training) and higher-ranking content is more likely to be included in this data set (whether original content by the advisor or citations or quotes from other sources). Also, because ChatGPT\u0026#39;s browsing tool and Microsoft Copilot are powered by Bing (rather than Google), Bing-specific SEO (e.g., prioritizing exact-match keywords, registering the business with Bing Places) could be particularly valuable.\u003c/p\u003e\n\u003cp\u003eIn sum, engaging in AEO doesn\u0026#39;t require a firm to throw out all of the SEO efforts it has made to date. Rather, by leveraging the SEO tactics that remain relevant for AEO (e.g., being seen as an authority on a particular subject) and engaging in AEO-friendly techniques could help an advisor remain at the top of a potential client\u0026#39;s \u0026#39;search\u0026#39; results, whether as part of a Google Search or a ChatGPT prompt!\u003c/p\u003e\n\u003ch2 data-nav-title=\"The Death of Partying In The U.S.A.\" id=\"the-death-of-partying-in-the-usa-and-why-it-matters\"\u003e\u003cspan\u003e\u003ca id=\"partying\"\u003e\u003c/a\u003e\u003ca href=\"https://www.derekthompson.org/p/the-death-of-partying-in-the-usaand\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eThe Death of Partying In The U.S.A. – And Why It Matters\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Derek Thompson)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHistorians have identified a long social streak amongst Americans, dating back to the 1800s and even before. In fact, as late as the 1970s, the average American household entertained friends at home about 15 times a year and went out to a friend\u0026#39;s house approximately every other week. However, more recent trends suggest that Americans across the age spectrum have pulled back from in-person socializing.\u003c/p\u003e\n\u003cp\u003eAccording to data from the \u003ca href=\"https://www.bls.gov/tus/\"\u003eAmerican Time Use Survey\u003c/a\u003e (which asks Americans to estimate how much time they spend on various activities), between 2003 and 2024, the amount of time Americans spent attending or hosting a social event declined by 50% (notably, this trend was in motion before the COVID pandemic, with the share of Americans who said they visited the homes of friends in the previous week declining by more than 40% between the 1970s and the late 1990s). While all age groups surveyed showed declines, some were steeper than others; for instance, while 55-64 year olds \u0026#39;only\u0026#39; had a 13% decline in hours spent on social events, 15-24 year-olds showed a 69% drop, those aged 65 and up had a 55% decline, and those between 25 and 54 saw a 45% in time spent on social events. Simple face-to-face socializing (without a formal event) has fallen over the past two decades as well, by 20% overall and by more than 35% for unmarried men and people younger than 25.\u003c/p\u003e\n\u003cp\u003eA key question, then, is why Americans are socializing less than they did in previous decades. One potential explanation is technology, including significant time spent in front of the television (e.g., men who watch television now spend 7 hours in front of the TV for every hour they spend socializing with somebody outside their home). Relatedly, the rise in smartphone use has led to an increase in \u0026#34;parasocial\u0026#39; relationships\u0026#34;, where individuals might regularly follow the actions of individuals on social media or participate in online communities with people they\u0026#39;ve never met in person. For those in middle age, another potential explanation is the increased time parents are spending with their children. For instance, researchers found that between 1975 and 1998, mothers increased the amount of time they spent with their kids by about 200 minutes per week, while married fathers spent an additional 240 minutes per week with their kids (separate research found that childcare time surged again in the mid-1990s by more than 9 hours per week among college-educated parents).\u003c/p\u003e\n\u003cp\u003eAltogether, the aggregate data paint a compelling picture of a decline in face-to-face socializing amongst Americans, which has the potential to result in less community engagement and a reduced sense of public trust over time. Which suggests that being more intentional about finding time for in-person socialization not only could lead to stronger personal connections, but also a stronger social fabric as well?\u003c/p\u003e\n\u003ch2 data-nav-title=\"4 Ways To Socialize Effectively In Your 30s\" id=\"4-ways-to-socialize-effectively-in-your-30s-and-beyond\"\u003e\u003cspan\u003e\u003ca id=\"socialize\"\u003e\u003c/a\u003e\u003ca href=\"https://candrews.medium.com/4-ways-to-socialize-effectively-if-boringly-in-your-30s-and-beyond-a556675c65fb\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003e4 Ways To Socialize Effectively In Your 30s And Beyond\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Catherine Andrews | Medium)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a kid or young adult it\u0026#39;s fairly easy to organize social events, from an after-school hangout to an after-work happy hour. However, as time goes by and responsibilities (work, family, etc.) build up, it can be harder to plan for and execute social engagements with friends. With this in mind, Andrews offers four ways to facilitate social activities while maintaining other responsibilities.\u003c/p\u003e\n\u003cp\u003eA first step is to bucket one\u0026#39;s friends into \u0026#39;groups\u0026#39; based on the types of activities they are most likely to engage in (so that invitations for a particular event go out to the person or people who are most likely to join). For instance, some friends might be most likely to come for a hike while others are more likely to come over for a party on the weekend and another group (perhaps those who live in another city) would want to join for a single large event each year (e.g., an annual friend getaway). It can also be helpful to recognize one\u0026#39;s \u0026#34;activator\u0026#34; friends, or the ones who are most likely to plan and execute social events, and maintain ties with them (to secure invitations to more social events they organize).\u003c/p\u003e\n\u003cp\u003eAnother way to boost social opportunities is to formalize certain activities or join clubs. For example, holding a monthly book club is a good way to ensure the event will stay on the calendar (rather than holding ad hoc conversations about new books, which might not come to fruition). Finally, when invites come in or events or scheduled, following through and actually attending the events can build trust with one\u0026#39;s friends (as no-shows who said they would come can be disappointing) and lead to more social opportunities in the future.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that as responsibilities start to mount in middle age, it can become more difficult to plan and follow through on social engagements. Nonetheless, taking an organized approach to doing so can lead to greater opportunities and stronger social relationships that last over time!\u003c/p\u003e\n\u003ch2 id=\"how-to-host-your-first-dinner-party\"\u003e\u003cspan\u003e\u003ca id=\"dinner\"\u003e\u003c/a\u003e\u003ca href=\"https://alexandrastrick.substack.com/p/how-to-host-your-first-dinner-party\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eHow To Host Your First Dinner Party\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Alexandra Strick | The Hostess In The Studio Apartment)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHosting a dinner party is a classic way to socialize with friends or family. However, actually putting one on can seem intimidating given the number of potential tasks involved. Nonetheless, taking a step-by-step approach can make hosting the event easier and increase the chances of its success.\u003c/p\u003e\n\u003cp\u003eThe first step is to set a date and time for the event. Strick suggests hosting a first dinner party on a Saturday starting between 5pm and 9pm, which gives plenty of time for preparation and for cleanup/recovery before going back to work on Monday. Next, selecting a theme for the party (perhaps planning it around a particular holiday or season) can make menu-planning and any decorating simpler (e.g., a winter-theme party could call for plenty of warm drink options and cozy dim lighting). With a theme picked out, the next task is to craft a guest list. For those having a hard time paring down potential invitees, it can be helpful to consider who would most enjoy each other\u0026#39;s company (and perhaps wait to invite others to a future party!), while those who are concerned that they won\u0026#39;t have enough attendees could encourage guests to bring a friend along (or perhaps invite a work acquaintance they\u0026#39;d like to get to know better).\u003c/p\u003e\n\u003cp\u003eA dinner party host can then move on to strategizing how they will organize their space (e.g., whether they might need to borrow additional chairs or table space), planning the menu (perhaps focusing on \u0026#39;go-to\u0026#39; dishes the host knows they can cook well and can easily be served family style), and making a grocery list. And as the day of the event approaches, Strick recommends setting the table well in advance (to give time to procure any items that might be missing) and reserving time to clean the apartment or house to avoid any last-second dusting.\u003c/p\u003e\n\u003cp\u003eIn sum, while organizing a dinner party is not a simple endeavor, taking time for advanced planning can ensure that all necessary steps get done and that the host can (hopefully) have plenty of time to enjoy the party itself. Which can ultimately lead to happy guests, stronger friendships, and perhaps invitations to (more relaxing) dinner parties at friends\u0026#39; houses in the future.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eWe hope you enjoyed the reading! Please leave a comment below to share your thoughts, or send an email to \u003ca href=\"https://feeds.feedblitz.com/cdn-cgi/l/email-protection#5b2c3e3e303e353f293e3a3f32353c1b30322f383e2875383436\"\u003e\u003cspan data-cfemail=\"a4d3c1c1cfc1cac0d6c1c5c0cdcac3e4cfcdd0c7c1d78ac7cbc9\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e to suggest any articles you think would be a good fit for a future column!\u003c/p\u003e\n\u003cp\u003eIn the meantime, if you\u0026#39;re interested in more news and information regarding advisor technology, we\u0026#39;d highly recommend checking out \u003ca href=\"https://wmtoday.com/\"\u003eCraig Iskowitz\u0026#39;s \u0026#34;Wealth Management Today\u0026#34; blog\u003c/a\u003e.\u003c/p\u003e\n\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;Weekend Reading For Financial Planners (July 12–13)\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-67bc7216b9020e1880fbe103-=\"\"\u003e\n                    \u003cimg decoding=\"async\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\"/\u003e\n                    \u003c/a\u003e\n                \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "37 min read",
  "publishedTime": "2025-07-11T13:46:51-04:00",
  "modifiedTime": "2025-07-11T17:47:12Z"
}
