{
  "id": "c033adf7-3b63-40ef-be78-e7f01fcbe190",
  "title": "Return On Effort (ROE) Is Your Key To Unlocking A Better Life",
  "link": "https://www.financialsamurai.com/return-on-effort-roe-better-life/",
  "description": "If you want to optimize your life, it's essential to understand the concept of Return on Effort (ROE). The higher your ROE, the more you get out of your efforts, making it an invaluable framework for decision-making. ROE can also help you better utilize your time by prioritizing tasks and opportunities that yield the greatest […] The post Return On Effort (ROE) Is Your Key To Unlocking A Better Life appeared first on Financial Samurai.",
  "author": "Financial Samurai",
  "published": "Wed, 20 Nov 2024 19:38:00 +0000",
  "source": "https://www.financialsamurai.com/feed/",
  "categories": [
    "Career \u0026 Employment"
  ],
  "byline": "Financial Samurai",
  "length": 17006,
  "excerpt": "If you want to have a better life, focus on Return on Effort, or ROE. Learn how to better spend your finite time on greater rewards.",
  "siteName": "Financial Samurai",
  "favicon": "https://i2.wp.com/financialsamurai.com/wp-content/uploads/2017/02/cropped-FinancialSamurai-Site-Icon-700x700-180x180.png",
  "text": "If you want to optimize your life, it's essential to understand the concept of Return on Effort (ROE). The higher your ROE, the more you get out of your efforts, making it an invaluable framework for decision-making. ROE can also help you better utilize your time by prioritizing tasks and opportunities that yield the greatest results. I started focusing on Return on Effort in 2009 when I launched Financial Samurai. After a decade in finance and grueling 60+ hour workweeks, I was burned out and searching for an escape. The constant grind had taken a toll, and I needed a path to a more balanced and fulfilling lifestyle. Return on Effort is a spin on Return on Equity (ROE)—a key financial metric that measures a company’s profitability relative to its shareholders’ equity. ROE shows how effectively a company uses its shareholders' investments to generate profits, calculated using the formula: ROE = (Net Income / Shareholders’ Equity) ×100 As an MBA graduate and finance professional, it felt natural to adapt the concept of ROE to evaluate day-to-day life. Just as businesses aim to maximize returns on their financial capital, focusing on Return on Effort helps optimize personal energy and resources for the greatest impact and satisfaction. ROE Question: Work Harder or Relax During a Bull Market? Over the past month, I asked more than 20 people—ranging in age from 24 to 58—whether they would rather work harder during a bull market or relax more when times are good. I posed this question during conversations at school, on the pickleball courts, and at a couple of social poker games. To steer the conversation, I made a critical point upfront: in a bull market, your investments are working hard for you, so there's arguably less need to grind as much. Once you reach a minimum investment amount, work starts becoming optional. Despite my biased framing, not a single person said they’d choose to relax more. Every respondent said they’d work harder, summarizing their reasoning like this: “In a bull market, there’s more opportunity, so I’m going to work harder to take advantage of it.” The Problems with Everyone Working Harder While it's commendable to see people seizing opportunities during a bull market, the collective response to work harder reveals a potential downside: our efforts might simply result in everyone running in place. Think of it like this: if everyone in the front row of an NBA game remains seated, no one seated in the rows behind them needs to stand to maintain their view. But if the first row stands, everyone else behind them must follow, creating more effort for the same result. The Return on Effort (ROE) in this scenario is low. In pursuit of wealth, many push themselves harder—joining startups, starting businesses, or climbing corporate ladders in industries like tech, finance, or consulting. However, when the bull market inevitably ends, much of this effort may yield disappointing results. Most startups fail, and the gap between those who “win big” and those who don’t can grow immense. This disparity can lead to frustration or dissatisfaction, even among those who are objectively doing well. Sadly, hard work doesn’t always guarantee success, especially when luck plays a significant role in generating outsized wealth. All hard work guarantees is higher expectations of success. Witnessing peers achieve extraordinary success can leave others feeling like failures, even if they’ve achieved a comfortable lifestyle. Meanwhile, a minority of workers may opt to take it easy during a bull market, relying on well-allocated investments. While they might feel content in theory, the constant comparisons of today’s hyper-connected world can trigger feelings of inadequacy. Yes, working hard is essential to achieving our goals. But just as important is recognizing when we have enough—and allowing ourselves to slow down, enjoy the present, and appreciate what we’ve already accomplished. A New Perspective on Working Hard During Bull Markets Instead of defaulting to the grind, consider your ROE. Is the additional effort worth the incremental reward, or are you simply “standing up because everyone else is”? Sometimes, the better move might be to relax and let your investments work for you, ensuring that your mental and physical well-being don’t suffer from overexertion. After all, the average worker's raise is around 3%, roughly keeping pace with inflation. For those who earn promotions, raises typically range between 10% and 20%. However, if you're putting in significantly more than 3% to 20% in additional effort each year to achieve these raises, your Return on Effort (ROE) is diminishing. In addition, once the amount you save each year boosts your net worth by less than 10%, it’s time to reconsider how much effort you want to put into your job. Working smarter—not harder—might just be the key to thriving in any market condition. Effort In This Bull Market At 47, I’ve come to firmly believe that during a bull market, it makes sense to work less. Why? Because my investments now generate far more than I could ever make through active work. After more than 30 years of saving and investing, the impact of additional work on my net worth is minimal—my Return on Effort (ROE) is simply too low. On top of that, I no longer have the same energy or drive to earn significant amounts of money as I did in my 20s and 30s. Yet, I also have a clear goal: to regain our financial independence by December 31, 2027. Working harder to generate active income could help me reach that goal faster. Even if it means shaving just a few months off the timeline, the value of time has grown immensely for me, making the extra effort potentially worthwhile. Experimenting with Working Harder To test whether working harder during a bull market is worth it, I took a part-time role at a startup in November 2023, committing 20–25 hours a week. Combined with the 20 hours I spend weekly on Financial Samurai and writing my books, I was essentially back to full-time work. The extra income provided a psychological boost of security, particularly after draining much of my liquidity to purchase a home. However, in terms of my overall net worth, the additional income barely moved the needle. After just four months, I decided to stop working at the startup and choose freedom again. While the experiment helped me appreciate the value of steady income, it reinforced my belief that working harder in a bull market doesn’t always yield meaningful returns —especially when your investments are doing the heavy lifting for you. Sometimes, the best move is to step back and let your financial foundation work its magic. The Futility of Working Harder in a Bull Market Let’s use my rollover IRA again, worth ~$1.3 million, to demonstrate how little impact active income can have during a bull market. In this example, the IRA equals 100% of your net worth. Scenario: Work Harder for Two More Years Imagine you’re 53 years old, earning $120,000 annually (gross) with an effective tax rate of 20%, leaving $96,000 in after-tax income. You’ve also adopted Bill Bengen’s updated 5% withdrawal rate, which allows you to withdraw 1% more in retirement than his 4% Rule previously suggested. You decide to work for two more years, saving $30,000 annually, while your liquid net worth grows. Your goal is to retire at 55, 10 years earlier than the traditional retirement age of 65. Initial Net Worth: $1,300,000 Portfolio Growth at 10%/Year for Two Years: $1,573,000 Savings from Work: $60,000 Total Net Worth: $1,633,000 With a 5% withdrawal rate, you can withdraw $81,650 annually—just $3,000 more per year than if you hadn’t worked. That’s only $250 more per month. Congrats on being able to spend an extra $250 a month for your efforts! Scenario Evolution: A Raging Bull Market For Two Years Now, let’s assume two consecutive years of 20% portfolio growth: Portfolio Value After Growth: $1,872,000 Additional Savings from Work: $60,000 Total Net Worth: $1,932,000 At a 5% withdrawal rate, you can withdraw $96,600 annually or $14,950 more a year thanks to a raging bull market. However, your additional $60,000 in savings continues to only enable you to withdraw an additional $3,000 more a year, assuming no growth. $14,950 is greater than $3,000. The larger your portfolio grows, the smaller the percentage impact of your active income and savings. Now imagine if your net worth was much bigger, say $10 million, or $20+ million. Your Return on Work Effort shrinks as your portfolio takes over. The Cost of Working Harder Increases the Older You Get Sure, in the above example, you save and invest an additional $60,000 after two years of work. But the real cost is your precious time. In your 20s, 30s, and maybe 40s, working two extra years to earn an additional $60,000 makes sense. Time feels abundant, and your health and energy are likely at their peak. But in your 50s and older? That equation starts to break down. Delaying those two years in your mid-50s to hike the 26-mile Inca Trail could mean the difference between walking it or taking the bus—or giving up altogether. As we age, the window of opportunity to enjoy life experiences begins to close. For many, that window slams shut faster than expected. Just like converting money to a Roth IRA at a 24% federal marginal income tax bracket can feel like a wash, we need to determine at what age working harder becomes a wash too. The Key Takeaway: Invest Harder \u003e Work Harder During a bull market, investing harder beats working harder almost every time. While earning an extra $120,000 annually might feel productive, it pales in comparison to what a well-timed investment can achieve. The challenge lies in identifying opportunities for higher returns. While not easy, some years—like 2023 and 2024—offer outsized gains for those who stay invested. The longer you remain in the market, the greater your chance of benefiting from these historical surges. In the end, the smart move is to focus on increasing your ROE by investing strategically rather than grinding harder. Personally, I believe the top private AI companies have the potential to significantly outperform the S\u0026P 500 over the next 5–10 years. However, I don’t have enough conviction to go all-in, which is why I’ve allocated 10%–20% of my capital to venture funds instead. When Does Working Harder Stop Paying Off? From my experience, the ideal age to retire early and minimize regret is 45. In this article, we're not talking so much about retiring early, but about taking things easier for a more enjoyable life. By 45: You’re past the midpoint of life expectancy, which is appropriate given we aren’t productive workers for the first 16–18 years of our lives. The marginal benefit of working harder begins to decline because time, which is already priceless, begins to be twice as valuable This assumes you’ve worked for at least 22 years by age 45, saved and invested at least 10% of your income annually, and have the median life expectancy. Nobody wishes on their deathbed that they worked more instead of spending time with friends, family, and pursuing their passions. Retiring or taking things easier around 45 minimizes this regret and ensures you allocate your most valuable resource—time—to what truly matters. Declining Motivation to Work in Bear Markets Too It’s not just about the futility of working harder during a bull market as your net worth grows. The same applies during a bear market, where your Return on Effort (ROE) may feel even lower. Let’s say your $1.3 million portfolio drops 20% in a bear market, losing $260,000. Is it worth working another year to save $30,000 while still seeing your net worth decline by $230,000? Absolutely not. Working harder while losing money might simply make you angrier and more despondent. Instead, it’s often better to work less—or not at all—and extract value elsewhere during a down market. The less you work, the more you maximize your ROE when investments are down. This mindset aligns with the quiet quitting movement that gained traction post-pandemic. By working just enough to keep your job, you preserve your energy and maintain flexibility for the eventual recovery. Infinity Return on Effort (ROE) And Beyond! While achieving an “infinity ROE” sounds ideal, there are non-financial factors to consider: Status and ego: Some people work hard to stroke their egos or boost their social standing. Family: Many parents work harder to provide opportunities for their children while also setting a good example about the importance of work ethic. Passion: Those who love their work may not care about financial compensation because they simply love what they do. Personally, I wouldn’t be happiest relying solely on passive income because I enjoy doing things. My ideal mix is about 25% active income and 75% passive income. For example, if my total compensation were $100,000, I’d prefer $25,000 to come from activities that require effort—like entrepreneurship, creative pursuits, or consulting—and the remaining $75,000 from investments. Here's a chart I put together in 2014 about the ideal split between active and passive income. More than 10 years later, I still feel the same way today. Deciding your split is also an exercise in Return on Effort. The lower your active income as a percentage of total income, the higher your ROE. But you don't want that active income percentage to be so low that you feel useless to society. How to Boost Your ROE Without Working Harder If you can’t invest harder through greater savings, better investments, or more concentrated bets, there are other ways to maximize your efforts: Strengthen family relationships This can lead to financial assistance or early inheritance opportunities from The Bank Of Mom \u0026 Dad. Find a wealthy spouse Work on your appearance, personality, and fitness because finding a wealthy partner may fast-track your financial goals. Encourage your spouse to work longer and harder Their continued income could allow you more flexibility. Build wealthier connections Friends with higher net worth can introduce you to private investment opportunities. Leverage technology and the internet Use these tools to amplify entrepreneurial returns and scale your efforts. Some may scoff at these suggestions, but they’re rooted in reality. Don’t let honor or pride stand in the way of achieving a higher ROE and easier life. Marrying rich or accessing an early inheritance can shortcut decades of financial struggle. Always Think About The Opportunity Cost Of Your Efforts Ultimately, it’s up to you how hard you want to work. I encourage working your hardest until about age 45—taking advantage of every opportunity, bull or bear market. After 45, it’s time to rethink your approach and focus on your Return on Effort. Life is too short to waste on actions that don’t make a meaningful difference. Prioritize what brings the greatest value to your time and energy. Readers, will you be working harder or relaxing more during a bull market? If you plan to work harder, at what age and net worth do you envision finally easing up? Do you consider your Return on Effort (ROE) when making these decisions? If so, what other factors influence how much effort you’re willing to invest in work versus enjoying life? Let me know! Invest In Private Growth Companies Consider diversifying into private growth companies through an open venture capital fund. Companies are staying private for longer, as a result, more gains are accruing to private company investors. Finding the next Google or Apple before going public can be a life-changing investment.  Check out the Fundrise venture capital product, which invests in the following five sectors: Artificial Intelligence \u0026 Machine Learning Modern Data Infrastructure Development Operations (DevOps) Financial Technology (FinTech) Real Estate \u0026 Property Technology (PropTech) Over 60% of the Fundrise venture product is invests in artificial intelligence, which I'm extremely bullish about. In 20 years, I don't want my kids wondering why I didn't invest in AI or work in AI! The investment minimum is also only $10. Most venture capital funds have a $250,000+ minimum. In addition, you can see what product is holding before deciding to invest and how much. I've personally invested $150,000 in the Fundrise venture and Fundrise is a long-time sponsor of Financial Samurai. To expedite your journey to financial freedom, join over 60,000 others and subscribe to the free Financial Samurai newsletter. Financial Samurai is among the largest independently-owned personal finance websites, established in 2009.",
  "image": "https://i2.wp.com/financialsamurai.com/wp-content/uploads/2024/11/maldives-3220702_1280.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-272747\" itemtype=\"https://schema.org/CreativeWork\" itemscope=\"itemscope\"\u003e\n\n\t\n\t\n\u003cdiv data-ast-blocks-layout=\"true\" itemprop=\"text\"\u003e\n\n\t\t\n\t\t\n\u003cp\u003eIf you want to optimize your life, it\u0026#39;s essential to understand the concept of Return on Effort (ROE). The higher your ROE, the more you get out of your efforts, making it an invaluable framework for decision-making. ROE can also help you better utilize your time by prioritizing tasks and opportunities that yield the greatest results.\u003c/p\u003e\n\n\n\n\u003cp\u003eI started focusing on Return on Effort in 2009 when I launched Financial Samurai. After a decade in finance and grueling 60+ hour workweeks, I was burned out and searching for an escape. The constant grind had taken a toll, and I needed a path to a more balanced and fulfilling lifestyle. \u003c/p\u003e\n\n\n\n\u003cp\u003eReturn on Effort is a spin on Return on Equity (ROE)—a key financial metric that measures a company’s profitability relative to its shareholders’ equity. ROE shows how effectively a company uses its shareholders\u0026#39; investments to generate profits, calculated using the formula:\u003c/p\u003e\n\n\n\n\u003cp\u003eROE = (Net Income / Shareholders’ Equity) ×100\u003c/p\u003e\n\n\n\n\u003cp\u003eAs an MBA graduate and finance professional, it felt natural to adapt the concept of ROE to evaluate day-to-day life. Just as businesses aim to maximize returns on their financial capital, focusing on Return on Effort helps optimize personal energy and resources for the greatest impact and satisfaction.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-roe-question-work-harder-or-relax-during-a-bull-market\"\u003eROE Question: Work Harder or Relax During a Bull Market?\u003c/h2\u003e\n\n\n\n\u003cp\u003eOver the past month, I asked more than 20 people—ranging in age from 24 to 58—whether they would rather work harder during a \u003ca href=\"https://www.financialsamurai.com/why-its-better-to-retire-in-a-bear-market-than-in-a-bull-market/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ebull market\u003c/a\u003e or relax more when times are good. I posed this question during conversations at school, on the pickleball courts, and at a couple of social poker games.\u003c/p\u003e\n\n\n\n\u003cp\u003eTo steer the conversation, I made a critical point upfront: in a bull market, your investments are working hard for you, so there\u0026#39;s arguably less need to grind as much. Once you reach a \u003ca href=\"https://www.financialsamurai.com/minimum-investment-threshold-amount-work-optional/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eminimum investment amount\u003c/a\u003e, work starts becoming optional. Despite my biased framing, not a single person said they’d choose to relax more.\u003c/p\u003e\n\n\n\n\u003cp\u003eEvery respondent said they’d work harder, summarizing their reasoning like this:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e\u003cem\u003e“In a bull market, there’s more opportunity, so I’m going to work harder to take advantage of it.”\u003c/em\u003e\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003ch2\u003eThe Problems with Everyone Working Harder\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhile it\u0026#39;s commendable to see people seizing opportunities during a bull market, the collective response to work harder reveals a potential downside: our efforts might simply result in everyone running in place.\u003c/p\u003e\n\n\n\n\u003cp\u003eThink of it like this: if everyone in the front row of an NBA game remains seated, no one seated in the rows behind them needs to stand to maintain their view. But if the first row stands, everyone else behind them must follow, creating more effort for the same result. The Return on Effort (ROE) in this scenario is low.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn pursuit of wealth, many push themselves harder—\u003ca href=\"https://www.financialsamurai.com/candid-advice-for-those-joining-the-startup-world/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ejoining startups\u003c/a\u003e, starting businesses, or climbing corporate ladders in industries like tech, finance, or consulting. However, when the bull market inevitably ends, much of this effort may yield disappointing results. Most startups fail, and the gap between those who “win big” and those who don’t can grow immense. This disparity can lead to frustration or dissatisfaction, even among those who are objectively doing well.\u003c/p\u003e\n\n\n\n\u003cp\u003eSadly, hard work doesn’t always guarantee success, especially when \u003ca href=\"https://www.financialsamurai.com/your-wealth-is-mostly-due-to-luck-be-thankful/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eluck plays a significant role in generating outsized wealth\u003c/a\u003e. All hard work guarantees is higher expectations of success. Witnessing peers achieve extraordinary success can leave others feeling like failures, even if they’ve achieved a comfortable lifestyle.\u003c/p\u003e\n\n\n\n\u003cp\u003eMeanwhile, a minority of workers may opt to take it easy during a bull market, relying on well-allocated investments. While they might feel content in theory, the constant comparisons of today’s hyper-connected world can trigger feelings of inadequacy.\u003c/p\u003e\n\n\n\n\u003cp\u003eYes, working hard is essential to achieving our goals. But just as important is recognizing when we have enough—and allowing ourselves to slow down, enjoy the present, and appreciate what we’ve already accomplished.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-a-new-perspective-on-working-hard-during-bull-markets\"\u003eA New Perspective on Working Hard During Bull Markets\u003c/h2\u003e\n\n\n\n\u003cp\u003eInstead of defaulting to the grind, consider your ROE. Is the additional effort worth the incremental reward, or are you simply “standing up because everyone else is”? Sometimes, the better move might be to relax and \u003ca href=\"https://www.financialsamurai.com/investment-returns-versus-active-income/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003elet your investments work for you\u003c/a\u003e, ensuring that your mental and physical well-being don’t suffer from overexertion.\u003c/p\u003e\n\n\n\n\u003cp\u003eAfter all, the average worker\u0026#39;s raise is around 3%, roughly keeping pace with inflation. For those who earn promotions, raises typically range between 10% and 20%. However, if you\u0026#39;re putting in significantly more than 3% to 20% in additional effort each year to achieve these raises, your Return on Effort (ROE) is diminishing.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn addition, once the amount you save each year boosts your net worth by less than 10%, it’s time to reconsider how much effort you want to put into your job.\u003c/p\u003e\n\n\n\n\u003cp\u003eWorking smarter—not harder—might just be the key to thriving in any market condition.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-effort-in-this-bull-market\"\u003eEffort In This Bull Market\u003c/h2\u003e\n\n\n\n\u003cp\u003eAt 47, I’ve come to firmly believe that during a bull market, it makes sense to work less. Why? Because my investments now generate far more than I could ever make through active work. After more than 30 years of saving and investing, the impact of additional work on my net worth is minimal—my Return on Effort (ROE) is simply too low.\u003c/p\u003e\n\n\n\n\u003cp\u003eOn top of that, I no longer have the same energy or drive to earn significant amounts of money as I did in my 20s and 30s. \u003c/p\u003e\n\n\n\n\u003cp\u003eYet, I also have a clear goal: to regain our financial independence by December 31, 2027. Working harder to generate \u003ca href=\"https://www.financialsamurai.com/difference-between-active-income-and-passive-income/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eactive income\u003c/a\u003e could help me reach that goal faster. Even if it means shaving just a few months off the timeline, the value of time has grown immensely for me, making the extra effort potentially worthwhile.\u003c/p\u003e\n\n\n\n\u003ch3\u003eExperimenting with Working Harder\u003c/h3\u003e\n\n\n\n\u003cp\u003eTo test whether working harder during a bull market is worth it, I took a \u003ca href=\"https://www.financialsamurai.com/went-back-to-work-and-could-only-last-four-months/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003epart-time role at a startup\u003c/a\u003e in November 2023, committing 20–25 hours a week. Combined with the 20 hours I spend weekly on Financial Samurai and writing my books, I was essentially back to full-time work.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe extra income provided a psychological boost of security, particularly after \u003ca href=\"https://www.financialsamurai.com/the-need-for-liquidity-is-overrated-if-you-are-financially-competent/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003edraining much of my liquidity\u003c/a\u003e to purchase a home. However, in terms of my overall net worth, the additional income barely moved the needle.\u003c/p\u003e\n\n\n\n\u003cp\u003eAfter just four months\u003cstrong\u003e,\u003c/strong\u003e I decided to stop working at the startup and choose freedom again. While the experiment helped me appreciate the value of steady income, it reinforced my belief that working harder in a bull market doesn’t always yield meaningful returns —especially when your investments are doing the heavy lifting for you.\u003c/p\u003e\n\n\n\n\u003cp\u003eSometimes, the best move is to step back and let your financial foundation work its magic.\u003c/p\u003e\n\n\n\n\u003ch2\u003eThe Futility of Working Harder in a Bull Market\u003c/h2\u003e\n\n\n\n\u003cp\u003eLet’s use my \u003ca href=\"https://www.financialsamurai.com/benefits-of-converting-a-401k-into-a-rollover-ira/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003erollover IRA\u003c/a\u003e again, worth ~$1.3 million, to demonstrate how little impact active income can have during a bull market. In this example, the IRA equals 100% of your net worth. \u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-scenario-work-harder-for-two-more-years\"\u003eScenario: Work Harder for Two More Years\u003c/h3\u003e\n\n\n\n\u003cp\u003eImagine you’re 53 years old, earning $120,000 annually (gross) with an effective tax rate of 20%, leaving $96,000 in after-tax income. You’ve also adopted \u003ca href=\"https://www.financialsamurai.com/bill-bengen-retire-earlier/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBill Bengen’s updated 5% withdrawal rate\u003c/a\u003e, which allows you to withdraw 1% more in retirement than his 4% Rule previously suggested. \u003c/p\u003e\n\n\n\n\u003cp\u003eYou decide to work for two more years, saving $30,000 annually, while your liquid net worth grows. Your goal is to retire at 55, 10 years earlier than the \u003ca href=\"https://www.financialsamurai.com/reducing-the-traditional-retirement-age-from-65-to-55/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003etraditional retirement age of 65\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eInitial Net Worth\u003c/strong\u003e: $1,300,000\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003ePortfolio Growth at 10%/Year for Two Years\u003c/strong\u003e: $1,573,000\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eSavings from Work\u003c/strong\u003e: $60,000\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eTotal Net Worth\u003c/strong\u003e: $1,633,000\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eWith a 5% withdrawal rate, you can withdraw $81,650 annually—just $3,000 more per year than if you hadn’t worked. That’s only $250 more per month. Congrats on being able to spend an extra $250 a month for your efforts!\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-scenario-evolution-a-raging-bull-market-for-two-years\"\u003eScenario Evolution: A Raging Bull Market For Two Years\u003c/h3\u003e\n\n\n\n\u003cp\u003eNow, let’s assume two consecutive years of 20% portfolio growth:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003ePortfolio Value After Growth\u003c/strong\u003e: $1,872,000\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eAdditional Savings from Work\u003c/strong\u003e: $60,000\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eTotal Net Worth\u003c/strong\u003e: $1,932,000\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eAt a 5% withdrawal rate, you can withdraw $96,600 annually or $14,950 more a year thanks to a raging bull market. However, your additional $60,000 in savings continues to only enable you to withdraw an additional $3,000 more a year, assuming no growth.\u003c/p\u003e\n\n\n\n\u003cp\u003e$14,950 is greater than $3,000. The larger your portfolio grows, the smaller the percentage impact of your active income and savings. Now imagine if your net worth was much bigger, say \u003ca href=\"https://www.financialsamurai.com/10-million-dollars-the-ideal-net-worth-amount-for-retirement/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e$10 million\u003c/a\u003e, or \u003ca href=\"https://www.financialsamurai.com/20-million-net-worth/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e$20+ million\u003c/a\u003e. Your Return on Work Effort shrinks as your portfolio takes over.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-cost-of-working-harder-increases-the-older-you-get\"\u003eThe Cost of Working Harder Increases the Older You Get\u003c/h2\u003e\n\n\n\n\u003cp\u003eSure, in the above example, you save and invest an additional $60,000 after two years of work. But the real cost is your precious time.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn your 20s, 30s, and maybe 40s, working two extra years to earn an additional $60,000 makes sense. Time feels abundant, and your health and energy are likely at their peak. But in your 50s and older? That equation starts to break down.\u003c/p\u003e\n\n\n\n\u003cp\u003eDelaying those two years in your mid-50s to hike the 26-mile Inca Trail could mean the difference between walking it or taking the bus—or giving up altogether. As we age, the \u003ca href=\"https://www.financialsamurai.com/your-window-of-opportunity-is-smaller-than-you-think/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ewindow of opportunity to enjoy life\u003c/a\u003e experiences begins to close. For many, that window slams shut faster than expected. \u003c/p\u003e\n\n\n\n\u003cp\u003eJust like converting money to a Roth IRA at a 24% federal marginal income tax bracket can feel like a wash, we need to determine at what age working harder becomes a wash too.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-key-takeaway-invest-harder-gt-work-harder\"\u003eThe Key Takeaway: Invest Harder \u0026gt; Work Harder\u003c/h2\u003e\n\n\n\n\u003cp\u003eDuring a bull market, investing harder beats working harder almost every time. While earning an extra $120,000 annually might feel productive, it pales in comparison to what a well-timed investment can achieve.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe challenge lies in identifying opportunities for higher returns. While not easy, some years—like 2023 and 2024—offer outsized gains for those who stay invested. The longer you remain in the market, the greater your chance of benefiting from these historical surges.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn the end, the smart move is to focus on increasing your ROE by investing strategically rather than grinding harder. \u003c/p\u003e\n\n\n\n\u003cp\u003ePersonally, I believe the \u003ca href=\"https://www.financialsamurai.com/investing-in-private-ai-companies-without-connections-or-big-money/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003etop private AI companies\u003c/a\u003e have the potential to significantly outperform the S\u0026amp;P 500 over the next 5–10 years. However, I don’t have enough conviction to go all-in, which is why I’ve allocated 10%–20% of my capital to\u003ca href=\"https://www.financialsamurai.com/venture-capital-funds-beats-investing-in-individual-companies/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e venture funds\u003c/a\u003e instead.\u003c/p\u003e\n\n\n\n\u003ch2\u003eWhen Does Working Harder Stop Paying Off?\u003c/h2\u003e\n\n\n\n\u003cp\u003eFrom my experience, the \u003ca href=\"https://www.financialsamurai.com/ideal-age-to-retire/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eideal age to retire early and minimize regret\u003c/a\u003e is 45\u003cstrong\u003e.\u003c/strong\u003e In this article, we\u0026#39;re not talking so much about retiring early, but about taking things easier for a more enjoyable life. By 45:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eYou’re past the midpoint of life expectancy, which is appropriate given we aren’t productive workers for the first 16–18 years of our lives.\u003c/li\u003e\n\n\n\n\u003cli\u003eThe marginal benefit of working harder begins to decline because time, which is already priceless, begins to be twice as valuable\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eThis assumes you’ve worked for at least 22 years by age 45, saved and invested at least 10% of your income annually, and have the median life expectancy. \u003c/p\u003e\n\n\n\n\u003cp\u003eNobody wishes on their deathbed that they worked more instead of spending time with friends, family, and pursuing their passions. Retiring or taking things easier around 45 minimizes this regret and ensures you allocate your most valuable resource—time—to what truly matters.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-declining-motivation-to-work-in-bear-markets-too\"\u003eDeclining Motivation to Work in Bear Markets Too\u003c/h2\u003e\n\n\n\n\u003cp\u003eIt’s not just about the futility of working harder during a bull market as your net worth grows. The same applies during a bear market, where your Return on Effort (ROE) may feel even lower.\u003c/p\u003e\n\n\n\n\u003cp\u003eLet’s say your $1.3 million portfolio drops 20% in a bear market, losing $260,000. Is it worth working another year to save $30,000 while still seeing your net worth decline by $230,000?\u003c/p\u003e\n\n\n\n\u003cp\u003eAbsolutely not. Working harder while losing money might simply make you angrier and more despondent.\u003c/p\u003e\n\n\n\n\u003cp\u003eInstead, it’s often better to work less—or not at all—and extract value elsewhere during a down market. The less you work, the more you maximize your ROE when investments are down. \u003c/p\u003e\n\n\n\n\u003cp\u003eThis mindset aligns with the \u003ca href=\"https://www.financialsamurai.com/quiet-quitting/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003equiet quitting movement\u003c/a\u003e that gained traction post-pandemic. By working just enough to keep your job, you preserve your energy and maintain flexibility for the eventual recovery.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-infinity-return-on-effort-roe-and-beyond\"\u003eInfinity Return on Effort (ROE) And Beyond!\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhile achieving an “infinity ROE” sounds ideal, there are non-financial factors to consider:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eStatus and ego:\u003c/strong\u003e Some people work hard to stroke their egos or \u003ca href=\"https://www.financialsamurai.com/status-game/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eboost their social standing\u003c/a\u003e.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eFamily:\u003c/strong\u003e Many parents work harder to provide opportunities for their children while also setting a good example about the importance of work ethic.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003ePassion:\u003c/strong\u003e Those who love their work may not care about financial compensation because they simply love what they do. \u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003ePersonally, I wouldn’t be happiest relying solely on passive income because I enjoy doing things. My ideal mix is about 25% active income and 75% passive income. For example, if my total compensation were $100,000, I’d prefer $25,000 to come from activities that require effort—like entrepreneurship, creative pursuits, or consulting—and the remaining $75,000 from investments.\u003c/p\u003e\n\n\n\n\u003cp\u003eHere\u0026#39;s a chart I put together in 2014 about the \u003ca href=\"https://www.financialsamurai.com/the-ideal-split-between-passive-income-and-active-income-for-a-better-life/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eideal split between active and passive income\u003c/a\u003e. More than 10 years later, I still feel the same way today. Deciding your split is also an exercise in Return on Effort. The lower your active income as a percentage of total income, the higher your ROE. But you don\u0026#39;t want that active income percentage to be so low that you feel useless to society. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" src=\"https://www.financialsamurai.com/wp-content/uploads/2024/11/tempImageWrE8KU.heic\" alt=\"Ideal split between active and passive income for a better life - Focus on ROE\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch2 id=\"h-how-to-boost-your-roe-without-working-harder\"\u003eHow to Boost Your ROE Without Working Harder\u003c/h2\u003e\n\n\n\n\u003cp\u003eIf you can’t invest harder through greater savings, better investments, or more concentrated bets, there are other ways to maximize your efforts:\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003e\u003cstrong\u003eStrengthen family relationships\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eThis can lead to financial assistance or early inheritance opportunities from \u003ca href=\"https://www.financialsamurai.com/bank-of-mom-and-dad/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Bank Of Mom \u0026amp; Dad\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eFind a wealthy spouse \u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eWork on your appearance, personality, and fitness because finding a wealthy partner may fast-track your financial goals.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eEncourage your spouse to work longer\u003c/strong\u003e \u003cstrong\u003eand harder\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eTheir continued income could allow you more flexibility.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eBuild wealthier connections\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eFriends with higher net worth can introduce you to \u003ca href=\"https://www.financialsamurai.com/real-estate-crowdfunding-learning-center/\"\u003eprivate investment opportunities\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eLeverage technology and the internet\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eUse these tools to amplify entrepreneurial returns and scale your efforts.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eSome may scoff at these suggestions, but they’re rooted in reality. Don’t let \u003ca href=\"https://www.financialsamurai.com/honor-and-pride-hard-mode/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ehonor or pride\u003c/a\u003e stand in the way of achieving a higher ROE and easier life. Marrying rich or accessing an early inheritance can shortcut decades of financial struggle.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-always-think-about-the-opportunity-cost-of-your-efforts\"\u003eAlways Think About The Opportunity Cost Of Your Efforts\u003c/h2\u003e\n\n\n\n\u003cp\u003eUltimately, it’s up to you how hard you want to work. I encourage working your hardest until about age 45—taking advantage of every opportunity, bull or bear market. After 45, it’s time to rethink your approach and focus on your Return on Effort.\u003c/p\u003e\n\n\n\n\u003cp\u003eLife is too short to waste on actions that don’t make a meaningful difference. Prioritize what brings the greatest value to your time and energy.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eReaders, will you be working harder or relaxing more during a bull market? If you plan to work harder, at what age and net worth do you envision finally easing up? Do you consider your Return on Effort (ROE) when making these decisions? If so, what other factors influence how much effort you’re willing to invest in work versus enjoying life? Let me know!\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch2 id=\"m_2635475621034076768m_3915149201710271422gmail-h-invest-in-private-growth-companies\"\u003eInvest In Private Growth Companies\u003c/h2\u003e\n\n\n\n\u003cp\u003eConsider diversifying into private growth companies through an open venture capital fund. Companies are staying private for longer, as a result, more gains are accruing to private company investors. Finding the next Google or Apple before going public can be a life-changing investment. \u003c/p\u003e\n\n\n\n\u003cp\u003eCheck out the \u003cstrong\u003e\u003ca href=\"https://www.financialsamurai.com/innovation\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003eFundrise venture capital product,\u003c/a\u003e\u003c/strong\u003e which invests in the following five sectors:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eArtificial Intelligence \u0026amp; Machine Learning\u003c/li\u003e\n\n\n\n\u003cli\u003eModern Data Infrastructure\u003c/li\u003e\n\n\n\n\u003cli\u003eDevelopment Operations (DevOps)\u003c/li\u003e\n\n\n\n\u003cli\u003eFinancial Technology (FinTech)\u003c/li\u003e\n\n\n\n\u003cli\u003eReal Estate \u0026amp; Property Technology (PropTech)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eOver 60% of the Fundrise venture product is invests in artificial intelligence, which I\u0026#39;m extremely bullish about. In 20 years, I don\u0026#39;t want my kids wondering why I didn\u0026#39;t invest in AI or work in AI!\u003c/p\u003e\n\n\n\n\u003cp\u003eThe investment minimum is also only $10. Most venture capital funds have a $250,000+ minimum. In addition, you can see what product is holding before deciding to invest and how much. I\u0026#39;ve personally invested $150,000 in the Fundrise venture and Fundrise is a long-time sponsor of Financial Samurai. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eTo expedite your journey to financial freedom, join over 60,000 others and subscribe to the \u003cstrong\u003e\u003ca href=\"https://www.financialsamurai.com/news\" target=\"_blank\" rel=\"noreferrer noopener\"\u003efree Financial Samurai newsletter\u003c/a\u003e\u003c/strong\u003e. Financial Samurai is among the largest independently-owned personal finance websites, established in 2009.\u003c/em\u003e\u003c/p\u003e\n\n\t\t\n\t\t\n\t\t\t\u003c/div\u003e\n\n\t\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "18 min read",
  "publishedTime": "2024-11-20T19:38:00Z",
  "modifiedTime": "2024-11-20T23:19:42Z"
}
