{
  "id": "c5437662-ea32-4d7d-b7df-69dfd9e625be",
  "title": "Why Most Financial Planners Don’t Offer Very Short Engagements",
  "link": "https://obliviousinvestor.com/why-most-financial-planners-dont-offer-very-short-engagements/",
  "description": "One question I receive regularly is why most financial planners don’t offer an option for an engagement that consists of just a one-hour paid phone call, to answer a handful of questions. There are a few reasons (which I think most people outside the industry are unaware of) for the rarity of such a business […]",
  "author": "Mike",
  "published": "Mon, 21 Apr 2025 12:00:41 +0000",
  "source": "https://obliviousinvestor.com/feed/",
  "categories": [
    "Working with Advisors"
  ],
  "byline": "",
  "length": 5672,
  "excerpt": "One question I receive regularly is why most financial planners don’t offer an option for an engagement that consists of just a one-hour paid phone call, to answer a handful of questions.",
  "siteName": "",
  "favicon": "",
  "text": "One question I receive regularly is why most financial planners don’t offer an option for an engagement that consists of just a one-hour paid phone call, to answer a handful of questions.There are a few reasons (which I think most people outside the industry are unaware of) for the rarity of such a business model.State Regulation of Billing ModelsFirstly, state regulation of registered investment advisers (RIAs) often creates incentives for RIAs to prefer billing models other than hourly.For instance here in Missouri, hourly fees of above $250 are “presumptively excessive and unreasonable.” But an asset-based fee must exceed 2% per year before the regulator takes the same position. So that means that, for example, for a client with a $1 million portfolio, an RIA can charge up to $20,000 per year, without any regulatory hassle with respect to the fee, as long as the fee was calculated based on assets. But special justification would need to be provided in order to charge the same client $300/hour for 20 hours over the course of the year (totaling $6,000).You can do the math yourself with respect to portfolios of $2 million, $3 million, etc. — and quickly see how this results in a situation that’s kind of crazy in terms of how it influences the way that RIAs choose to charge for their services.The details vary by state, but the general situation is that the regulators are more comfortable with asset-based fees than other billing models.It’s no surprise that many RIAs opt for the billing model that results in more compensation and less regulatory hassle.Client On-Boarding TimeAnother factor that makes 1-hour (or similar) engagements rare is that there’s more “behind the scenes” work than people realize. In my own experience, it takes somewhere in the range of 2-4 hours just to:Meet with the potential-client to discuss a possible engagement and terms thereof,Get up to speed on the new client’s facts and circumstances,Set the client up in the recordkeeping software and perform the necessary related compliance activities, andSet the client up in the actual financial planning software.In other words, before even attempting to answer any actual financial planning questions, the planner has typically already invested a few hours of their time. And that has to be factored into the pricing in one way or another.An important point here is that, in a DIY context, none of items #1-3 above would be applicable at all (as there is no compliance required and the person is already of course up to speed on their own circumstances). I think this is relevant for two reasons:It’s an inherent inefficiency of working with a professional planner: it introduces new work that otherwise would not have to happen.I think many DIYers think only of the time it would take a professional planner to actually address their desired financial planning topics, and are thus surprised at the pricing (because they weren’t mentally accounting for the time the planner would spend on various other necessary tasks).Relatedly, many people assume that an hourly financial professional’s weekly compensation is probably somewhere along the lines of 40x their hourly rate, but that’s not remotely the case. A 2023 AICPA survey found that an hourly billable rate of $204 (which was the average for CPAs with 8-10 years experience) equated to an average annual compensation of $105,662 — or $2,032/week (i.e., 10x their hourly billable rate). And I strongly suspect that it’s typically lower than 10x for hourly registered investment advisers, given that RIAs are regulated more heavily than CPAs (i.e., have to spend more time on compliance activities that are not billable).The RIA “No More Than 5 Clients” RuleA registered investment adviser must register in the state in which the business is located. It also must register in any state in which the firm has more than 5 clients, within any one-year period (not just calendar years).Each additional state with which the RIA is registered creates significant ongoing compliance costs, because the firm is now subject to examination by an additional regulatory body. For instance, at any time, any state with which the firm is registered might demand to see assorted client records, the firm’s balance sheet, engagement agreements, the firm’s business continuity plan, the firm’s information security plan, or any number of other things. And each state may have their own unique rules about what they require to be included in any of those documents.Point being, for a solo practitioner or other very small firm, there’s a compelling reason to keep it to no more than 5 clients in any state (other than the state in which the firm is located) within any one-year period, if it’s at all practical to do so.In other words, the regulatory environment creates a strong incentive to have fewer clients and more revenue per client.If an RIA eventually reaches $100 million of assets under management or needs to be registered in 15 or more states, they must register with the SEC — and then they no longer have to be registered in all of those states. For an “advice-only” RIA though (i.e., one that provides advice but does not actually manage the clients’ portfolios) assets under management will always be zero. So they’re going to have to be registered in all the applicable states, until they reach 15. (And I promise you, being registered in 12, 13, or 14 states while building up to 15 is something that nobody wants to do.) \"A wonderful book that tells its readers, with simple logical explanations, our Boglehead Philosophy for successful investing.\" - Taylor Larimore, author of The Bogleheads' Guide to Investing",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eOne question I receive regularly is why most financial planners don’t offer an option for an engagement that consists of just a one-hour paid phone call, to answer a handful of questions.\u003c/p\u003e\u003cp\u003eThere are a few reasons (which I think most people outside the industry are unaware of) for the rarity of such a business model.\u003c/p\u003e\u003ch3\u003eState Regulation of Billing Models\u003c/h3\u003e\u003cp\u003eFirstly, state regulation of \u003ca href=\"https://obliviousinvestor.com/financial-advisor-licenses-and-designations/\"\u003eregistered investment advisers (RIAs)\u003c/a\u003e often creates incentives for RIAs to prefer billing models other than hourly.\u003c/p\u003e\u003cp\u003eFor instance here in Missouri, hourly fees of above $250 are “presumptively excessive and unreasonable.” But an asset-based fee must exceed 2% per year before the regulator takes the same position. So that means that, for example, for a client with a $1 million portfolio, an RIA can charge up to $20,000 per year, without any regulatory hassle with respect to the fee, as long as the fee was calculated based on assets. But special justification would need to be provided in order to charge the same client $300/hour for 20 hours over the course of the year (totaling $6,000).\u003c/p\u003e\u003cp\u003eYou can do the math yourself with respect to portfolios of $2 million, $3 million, etc. — and quickly see how this results in a situation that’s kind of crazy in terms of how it influences the way that RIAs choose to charge for their services.\u003c/p\u003e\u003cp\u003eThe details vary by state, but the general situation is that the regulators are \u003ca href=\"https://www.kitces.com/blog/regulation-of-financial-planning-subscription-and-retainer-fee-for-service/\"\u003emore comfortable with asset-based fees than other billing models\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eIt’s no surprise that many RIAs opt for the billing model that results in more compensation \u003cem\u003eand less regulatory hassle\u003c/em\u003e.\u003c/p\u003e\u003ch3\u003eClient On-Boarding Time\u003c/h3\u003e\u003cp\u003eAnother factor that makes 1-hour (or similar) engagements rare is that there’s more “behind the scenes” work than people realize. In my own experience, it takes somewhere in the range of 2-4 hours just to:\u003c/p\u003e\u003col\u003e\u003cli\u003eMeet with the potential-client to discuss a possible engagement and terms thereof,\u003c/li\u003e\u003cli\u003eGet up to speed on the new client’s facts and circumstances,\u003c/li\u003e\u003cli\u003eSet the client up in the recordkeeping software and perform the necessary related compliance activities, and\u003c/li\u003e\u003cli\u003eSet the client up in the actual financial planning software.\u003c/li\u003e\u003c/ol\u003e\u003cp\u003eIn other words, before even attempting to answer any actual financial planning questions, the planner has typically already invested a few hours of their time. And that has to be factored into the pricing in one way or another.\u003c/p\u003e\u003cp\u003eAn important point here is that, in a DIY context, none of items #1-3 above would be applicable at all (as there is no compliance required and the person is already of course up to speed on their own circumstances). I think this is relevant for two reasons:\u003c/p\u003e\u003cul\u003e\u003cli\u003eIt’s an inherent inefficiency of working with a professional planner: it introduces new work that otherwise would not have to happen.\u003c/li\u003e\u003cli\u003eI think many DIYers think only of the time it would take a professional planner to actually address their desired financial planning topics, and are thus surprised at the pricing (because they weren’t mentally accounting for the time the planner would spend on various other necessary tasks).\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eRelatedly, many people assume that an hourly financial professional’s weekly compensation is probably somewhere along the lines of 40x their hourly rate, but that’s not remotely the case. \u003ca href=\"https://www.aicpa-cima.com/professional-insights/article/national-map-survey\"\u003eA 2023 AICPA survey\u003c/a\u003e found that an hourly billable rate of $204 (which was the average for CPAs with 8-10 years experience) equated to an average annual compensation of $105,662 — or $2,032/week (i.e., 10x their hourly billable rate). And I strongly suspect that it’s typically lower than 10x for hourly registered investment advisers, given that RIAs are regulated more heavily than CPAs (i.e., have to spend more time on compliance activities that are not billable).\u003c/p\u003e\u003ch3\u003eThe RIA “No More Than 5 Clients” Rule\u003c/h3\u003e\u003cp\u003eA registered investment adviser must register in the state in which the business is located. It \u003cem\u003ealso\u003c/em\u003e must register in any state in which the firm has more than 5 clients, within any one-year period (not just calendar years).\u003c/p\u003e\u003cp\u003eEach additional state with which the RIA is registered creates significant ongoing compliance costs, because the firm is now subject to examination by an additional regulatory body. For instance, at any time, any state with which the firm is registered might demand to see assorted client records, the firm’s balance sheet, engagement agreements, the firm’s business continuity plan, the firm’s information security plan, or any number of other things. And each state may have their own unique rules about what they require to be included in any of those documents.\u003c/p\u003e\u003cp\u003ePoint being, for a solo practitioner or other very small firm, there’s a compelling reason to keep it to no more than 5 clients in any state (other than the state in which the firm is located) within any one-year period, if it’s at all practical to do so.\u003c/p\u003e\u003cp\u003eIn other words, the regulatory environment creates a strong incentive to have \u003cem\u003efewer clients\u003c/em\u003e and \u003cem\u003emore revenue per client\u003c/em\u003e.\u003c/p\u003e\u003cp\u003eIf an RIA eventually reaches $100 million of assets under management or needs to be registered in 15 or more states, they must register with the SEC — and then they no longer have to be registered in all of those states. For an “advice-only” RIA though (i.e., one that provides advice but does not actually \u003cem\u003emanage\u003c/em\u003e the clients’ portfolios) assets under management will always be zero. So they’re going to have to be registered in all the applicable states, until they reach 15. (And I promise you, being registered in 12, 13, or 14 states while building up to 15 is something that \u003cem\u003enobody\u003c/em\u003e wants to do.)\u003c/p\u003e\u003c/div\u003e\u003cp\u003e \u0026#34;A wonderful book that tells its readers, with simple logical explanations, our Boglehead Philosophy for successful investing.\u0026#34;\n- Taylor Larimore, author of \u003cem\u003eThe Bogleheads\u0026#39; Guide to Investing\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
