{
  "id": "d935e78d-daea-4ad9-ab33-6bd8ec3e22a4",
  "title": "What the ‘Big, Beautiful Bill’ Means for Your Finances",
  "link": "https://www.nerdwallet.com/article/finance/one-big-beautiful-bill",
  "description": "The GOP’s “big, beautiful bill” will impact people’s finances through tax provisions, cuts to social programs and diminished consumer protections.",
  "author": "Anna Helhoski",
  "published": "Thu, 03 Jul 2025 19:00:56 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Personal Finance"
  ],
  "byline": "Anna Helhoski",
  "length": 7348,
  "excerpt": "The GOP’s “big, beautiful bill” will impact people’s finances through tax provisions, cuts to social programs and diminished consumer protections.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "President Donald J. Trump's “big, beautiful bill” has cleared the finish line in Congress. Its provisions are expected to dramatically reshape the financial lives of millions of Americans and add trillions to an already-overflowing national debt. The Senate passed its version of the budget bill on Tuesday, and House Republicans approved the final package on Thursday by a vote of 218-214. Firmly walking the party line, the budget delivers on many of President Donald Trump’s top policy goals. Trump is expected to sign the bill into law on July 4. The legislation extends 2017 tax cuts, strips health insurance from millions of Medicaid recipients, increases defense and immigration enforcement, raises the debt limit and weakens food assistance. Altogether, the bill adds an estimated $3.3 trillion to the national debt over the next 10 years, according to an analysis by the Congressional Budget Office (CBO). Among the hundreds of line items in the budget are a slew of measures that could shake up household finances for years to come. Here are the provisions in the bill that will most directly affect Americans and the U.S. economy. Tax cuts and credits The budget makes permanent the 2017 tax cuts implemented during the first Trump administration that were set to expire by the end of the year. It’s by far the most expensive item in the budget. An analysis by the CBO that looks through 2034 finds the wealthiest households will benefit most with an average $12,044 in savings per year; middle-income families would see average annual savings of $500 to $1,000 per year; while the lowest-income households would lose an average of $1,559 annually. Among the nearly 70 tax-related provisions in the budget, here are the most notable for taxpayers, by how much money they'd cost the federal government or bring in as tax revenue. Measures that would reduce revenue for the federal government, according to the CBO: Standard deduction increases by $750 for individuals and $1,500 for couples in 2025, with annual inflation adjustments after that. Reduces revenue by an estimated $1,425 billion.Alternative minimum tax (AMT) exemption increases permanently, with changes to the income levels when the exemption phases out. Reduces revenue by $1,363 billion.Child Tax Credit increases permanently, to $2,200 in 2026. Reduces revenue by an estimated $817 billion.Estate and gift tax exemptions are permanently increased and extended. Reduces revenue by an estimated $212 billion.No tax on tips provision eliminates tips from taxable income for tax years 2025-2028. Reduces revenue by an estimated $32 billion.No tax on overtime pay for tax years 2025-2028. Reduces revenue by an estimated $90 billion.Interest on auto loans for new vehicles, up to $10,000, is excluded for tax years 2025-2028. Reduces revenue by an estimated $31 billion.Measures that would bring in money to the federal government:State and local tax (SALT) deduction cap increases to $40,000 for tax years 2025-2028. Increases revenue by an estimated $946 billion. The current limit of $10,000 is set to expire at the end of the year, so without a new cap, taxpayers could deduct an unlimited amount from their federal taxes and the government would collect less revenue.New deductions for seniors up to $6,000 for tax years 2025-2028. Increases revenue by an estimated $1,807 billion.Residential clean energy tax credit ends after 2025. That means homeowners can’t claim a tax credit for roof top solar, geothermal heat pumps or other green energy devices. Increases revenue by an estimated $77 billion.The bill also creates a new type of investment account for children, dubbed “Trump accounts,” that parents can pay into. The federal government will contribute $1,000 to each new account. The program would cost $15 billion, according to the CBO. The budget also closes a loophole that exempts small packages from tariffs, which could increase the costs consumers pay. The tax changes add up to $4.5 trillion in total cuts over 10 years, according to CBO estimates. Social safety netsTo offset some of the bill’s costs, Republicans marked deep cuts to social programs, including $930 billion in cuts over the next 10 years to Medicaid, Medicare and the Affordable Care Act (ACA), the CBO finds. Currently, 71 million Americans are enrolled in Medicaid and more than 45 million Americans have health coverage through the ACA, according to government data.Driving the Medicaid cuts is a new national work requirement for childless adults without disabilities and for parents with children ages 15 and up. To qualify for Medicaid, they must show they worked, volunteered or attended school at least 80 hours the month before signing up. Eligibility rules will also tighten, requiring states to check recipient eligibility every six months. An estimated 11.8 million more people will be uninsured by 2034 due to the Medicaid cuts, the CBO finds. Further cuts and changes to health care programs like the ACA could push that amount millions higher. The bill also affects those who receive food assistance through the Supplemental Nutrition Assistance Program (SNAP). To reduce federal spending, the bill tightens eligibility, expands work requirements and shifts costs to states.Consumer protections The budget includes funding cuts that could undermine consumer financial protections and limit access to student loan relief. Funding for the Consumer Financial Protection Bureau (CFPB) — the government watchdog that the Trump Administration has targeted for dismantling — will be cut in half. The agency oversees the consumer financial industry and has secured more than $21 billion in refunds and relief for more than 200 million consumers. With fewer dollars, the CFPB may be less able to assist consumers. Federal student loan borrowers will also feel the impact. The bill replaces existing repayment plans and extends the timeline for forgiveness. It also eliminates funding for the Graduate PLUS program and caps the lifetime amount a graduate student can borrow. National debt and the economy The Tax Foundation projects that the budget will temporarily boost economic growth by encouraging business investment through tax cuts. But it comes at a steep price: The national debt, which currently stands at more than $36 trillion, would increase by an additional $3 trillion over the next decade as a result of the bill, according to the CBO. The biggest costs in the budget are taxes, followed by $1 trillion allocated for defense, as well as border security and immigration enforcement — core priorities for Trump. The budget for that agenda includes some $45 billion for the U.S.-Mexico border wall and $45 billion for immigration detention facilities. The bill’s rollbacks of green energy incentives could hike energy costs for consumers, slow clean energy development and increase greenhouse gas emissions. Estimates by the Center for Climate and Energy Solutions says the rollbacks could also lead to job losses and slower economic growth. One critical component in the budget is a $5 trillion increase to the debt ceiling, which will prevent the U.S. from running out of money to meet its debt obligations. Before the bill’s passage, the government was headed for a potential default this summer. (Photo by Andrew Harnik/Getty Images News via Getty Images)",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2025/07/GettyImages-2222528300-1440x864.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003ePresident Donald J. Trump\u0026#39;s “big, beautiful bill” has cleared the finish line in Congress. Its provisions are expected to dramatically reshape the financial lives of millions of Americans and add trillions to an already-overflowing national debt. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe Senate passed its version of the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/2025-budget\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003ebudget bill\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e on Tuesday, and House Republicans approved the final package on Thursday by a vote of 218-214. Firmly walking the party line, the budget delivers on many of \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/trump-economy\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003ePresident Donald Trump\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e’s top policy goals. Trump is expected to sign the bill into law on July 4. The legislation extends 2017 tax cuts, strips health insurance from millions of Medicaid recipients, increases defense and immigration enforcement, raises the debt limit and weakens food assistance.   \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAltogether, the bill adds an estimated $3.3 trillion to the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/what-is-the-national-debt\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003enational debt\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e over the next 10 years, according to an analysis by the Congressional Budget Office (CBO). \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAmong the hundreds of line items in the budget are a slew of measures that could shake up household finances for years to come. Here are the provisions in the bill that will most directly affect Americans and the U.S. economy. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eTax cuts and credits \u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe budget makes permanent the 2017 tax cuts implemented during the first Trump administration that were set to expire by the end of the year. It’s by far the most expensive item in the budget. An analysis by the CBO that looks through 2034 finds the wealthiest households will benefit most with an average $12,044 in savings per year; middle-income families would see average annual savings of $500 to $1,000 per year; while the lowest-income households would lose an average of $1,559 annually. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAmong the nearly 70 tax-related provisions in the budget, here are the most notable for taxpayers, by how much money they\u0026#39;d cost the federal government or bring in as tax revenue. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMeasures that would reduce revenue for the federal government, according to the CBO: \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eStandard deduction increases by $750 for individuals and $1,500 for couples in 2025, with annual inflation adjustments after that. Reduces revenue by an estimated $1,425 billion.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eAlternative minimum tax (AMT) exemption increases permanently, with changes to the income levels when the exemption phases out. Reduces revenue by $1,363 billion.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eChild Tax Credit increases permanently, to $2,200 in 2026. Reduces revenue by an estimated $817 billion.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eEstate and gift tax exemptions are permanently increased and extended. Reduces revenue by an estimated $212 billion.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/no-tax-on-tips\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eNo tax on tips\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e provision eliminates tips from taxable income for tax years 2025-2028. Reduces revenue by an estimated $32 billion.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eNo tax on overtime pay for tax years 2025-2028. Reduces revenue by an estimated $90 billion.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eInterest on auto loans for new vehicles, up to $10,000, is excluded for tax years 2025-2028. Reduces revenue by an estimated $31 billion.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eMeasures that would bring in money to the federal government:\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eState and local tax (SALT) deduction cap increases to $40,000 for tax years 2025-2028. Increases revenue by an estimated $946 billion. The current limit of $10,000 is set to expire at the end of the year, so without a new cap, taxpayers could deduct an unlimited amount from their federal taxes and the government would collect less revenue.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eNew deductions for seniors up to $6,000 for tax years 2025-2028. Increases revenue by an estimated $1,807 billion.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eResidential clean energy tax credit ends after 2025. That means homeowners can’t claim a tax credit for roof top solar, geothermal heat pumps or other green energy devices. Increases revenue by an estimated $77 billion.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eThe bill also creates a new type of investment account for children, dubbed “Trump accounts,” that parents can pay into. The federal government will contribute $1,000 to each new account. The program would cost $15 billion, according to the CBO.  \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe budget also closes a loophole that exempts small packages from tariffs, which could increase the costs consumers pay. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe tax changes add up to $4.5 trillion in total cuts over 10 years, according to CBO estimates. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eSocial safety nets\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eTo offset some of the bill’s costs, Republicans marked deep cuts to social programs, including $930 billion in cuts over the next 10 years to \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/insurance/medicare/what-is-medicaid-and-who-is-eligible\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eMedicaid\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, Medicare and the Affordable Care Act (ACA), the CBO finds. Currently, 71 million Americans are enrolled in Medicaid and more than 45 million Americans have health coverage through the ACA, according to government data.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eDriving the Medicaid cuts is a new national work requirement for childless adults without disabilities and for parents with children ages 15 and up. To qualify for Medicaid, they must show they worked, volunteered or attended school at least 80 hours the month before signing up. Eligibility rules will also tighten, requiring states to check recipient eligibility every six months. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAn estimated 11.8 million more people will be uninsured by 2034 due to the Medicaid cuts, the CBO finds. Further cuts and changes to health care programs like the ACA could push that amount millions higher.  \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe bill also affects those who receive food assistance through the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/snap-food-benefits\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eSupplemental Nutrition Assistance Program\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e (SNAP). To reduce federal spending, the bill tightens eligibility, expands work requirements and shifts costs to states.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eConsumer protections \u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe budget includes funding cuts that could undermine consumer financial protections and limit access to student loan relief. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFunding for the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/what-is-cfpb#:~:text=The%20Consumer%20Financial%20Protection%20Bureau%2C%20or%20CFPB%2C%20is%20a%20government,lenders%20and%20other%20financial%20institutions.\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eConsumer Financial Protection Bureau\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e (CFPB) —  the government watchdog that the Trump Administration has targeted for dismantling — will be cut in half. The agency oversees the consumer financial industry and has secured more than $21 billion in refunds and relief for more than 200 million consumers. With fewer dollars, the CFPB may be less able to assist consumers. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.nerdwallet.com/reviews/loans/student-loans/federal-direct-plus-student-loans\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eFederal student loan\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e borrowers will also feel the impact. The bill replaces existing repayment plans and extends the timeline for \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/loans/student-loans/student-loan-forgiveness\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eforgiveness\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. It also eliminates funding for the Graduate PLUS program and caps the lifetime amount a graduate student can borrow. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eNational debt and the economy \u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe Tax Foundation projects that the budget will temporarily boost economic growth by encouraging business investment through tax cuts. But it comes at a steep price: The national debt, which currently stands at more than $36 trillion, would increase by an additional $3 trillion over the next decade as a result of the bill, according to the CBO.  \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe biggest costs in the budget are taxes, followed by $1 trillion allocated for defense, as well as border security and immigration enforcement — core priorities for Trump. The budget for that agenda includes some $45 billion for the U.S.-Mexico border wall and $45 billion for immigration detention facilities. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe bill’s rollbacks of green energy incentives could hike energy costs for consumers, slow clean energy development and increase greenhouse gas emissions. Estimates by the Center for Climate and Energy Solutions says the rollbacks could also lead to job losses and slower  economic growth. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eOne critical component in the budget is a $5 trillion increase to the debt ceiling, which will prevent the U.S. from running out of money to meet its debt obligations. Before the bill’s passage, the government was headed for a potential default this summer. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e(Photo by Andrew Harnik/Getty Images News via Getty Images)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-07-03T19:00:56Z",
  "modifiedTime": null
}
