{
  "id": "e3b2098d-210d-4db2-9203-c32eee4d94fb",
  "title": "#FASuccess Ep 408: Merging Into A Mid-Sized Firm To Grow Something Together (And Have A Real Piece Of It), With Maddi Keegan",
  "link": "https://feeds.feedblitz.com/~/906627305/0/kitcesnerdseyeview~FASuccess-Ep-Merging-Into-A-MidSized-Firm-To-Grow-Something-Together-And-Have-A-Real-Piece-Of-It-With-Maddi-Keegan/",
  "description": "Welcome everyone! Welcome to the 408th episode of the Financial Advisor Success Podcast! My guest on today's podcast is Maddi Keegan. Maddi is a Financial Advisor and the Director of Operations of Frazier Financial Advisors, an RIA based in Columbus, Ohio that oversees $860M in assets under management for 650 client households. What's unique about Maddi,Read More... The post #FASuccess Ep 408: Merging Into A Mid-Sized Firm To Grow Something Together (And Have A Real Piece Of It), With Maddi Keegan first appeared on Kitces.com.",
  "author": "Michael Kitces",
  "published": "Tue, 22 Oct 2024 11:01:31 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Financial Advisor Success Podcast",
    "OPTIN: One Page Business Plan (BAR)",
    "OPTIN: One Page Business Plan (SLIDE IN)"
  ],
  "byline": "Michael Kitces",
  "length": 93362,
  "excerpt": "Welcome everyone! Welcome to the 408th episode of the Financial Advisor Success Podcast! My guest on today's podcast is Maddi Keegan. Maddi is a Financial Advisor and the Director of Operations of Frazier Financial Advisors, an RIA based in Columbus, Ohio that oversees $860M in assets under management for 650 client households. What's unique about Maddi,",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary Welcome everyone! Welcome to the 408th episode of the Financial Advisor Success Podcast! My guest on today's podcast is Maddi Keegan. Maddi is a Financial Advisor and the Director of Operations of Frazier Financial Advisors, an RIA based in Columbus, Ohio that oversees $860M in assets under management for 650 client households. What's unique about Maddi, though, is that after building a successful solo advisory firm, she then decided to merge her business with Frazier Financial Advisors, a mid-sized RIA in her area where she negotiated for a stake in the business while stepping into both an advisor and operational role where she could really have impact in helping them to scale to the next level. In this episode, we talk in-depth about how Maddi, after successfully establishing and building her own solo firm, made the decision to merge her firm with a larger (but not too large) firm and negotiated the '2-way' street of sharing her knowledge while also absorbing the way of Frazier Financial, how Maddi charted the size and worth of her (solo) firm against Frazier Financial's (multi-advisor) firm to allow for an equitable 18-month transition into Frazier, and how Maddi's 3 non-negotiables of company culture, equity, and base compensation shaped how Maddi negotiated a package that she 'felt' acknowledged the full spectrum of her value, from existing clients to knowledge of large business operations, that she brought to the table. We also talk about Maddi's own unique journey from working at a Fortune 100 company to launching as a solo advisor to now being a director at her firm, including how, as a solo advisor, Maddi invested just $1,500 in improving her SEO strategy at her firm by leveraging better keywords and gathering Google Reviews and soon managed to get over 50% of her new prospects coming from Google instead of referrals, how Maddi's experience of mentoring, hiring, and eventually losing her first (contractor-turned-)employee made Maddi reflect on what she really wanted out of building her own firm (and ultimately decide that she didn't want to continue to build alone), and how Maddi explained her decision to close her business and merge with Frazier Financial to her existing clients, highlighting it as an expansion of resources and opportunities for her and her clients, ensuring that she was ultimately able to bring all but 2 of those clients along with her. And be certain to listen to the end, where Maddi shares how Frazier Financial positions 'at cost' tax preparation as a value proposition (to clients who actually don't really need a further discount, but are instead just eager to delegate), how Maddi looks to build out her firm's tech stack to get Frazier Financial though the 'dangerous middle' of growing and scaling the business, and why Maddi believes that the most powerful thing an up-and-coming advisor can do is network and build good connections with those around them to open more doors, as she reflects on how being a volunteer leader in her local FPA chapter was the introduction that led her to the firm she's at today.So, whether you're interested in learning about how to frame big changes as opportunities for clients (who may not mind those 'big changes' very much anyway), how to build holistic personal and professional goals and actually make progress year over year, or how to evaluate and negotiate a broad variety of career opportunities, then we hope you enjoy this episode of the Financial Advisor Success podcast, with Maddi Keegan. Michael Kitces is Head of Planning Strategy at Buckingham Strategic Wealth, which provides an evidence-based approach to private wealth management for near- and current retirees, and Buckingham Strategic Partners, a turnkey wealth management services provider supporting thousands of independent financial advisors through the scaling phase of growth. In addition, he is a co-founder of the XY Planning Network, AdvicePay, fpPathfinder, and New Planner Recruiting, the former Practitioner Editor of the Journal of Financial Planning, the host of the Financial Advisor Success podcast, and the publisher of the popular financial planning industry blog Nerd’s Eye View through his website Kitces.com, dedicated to advancing knowledge in financial planning. In 2010, Michael was recognized with one of the FPA’s “Heart of Financial Planning” awards for his dedication and work in advancing the profession. Read all of Michael’s articles here. Never miss a Financial Advisor Success podcast episode! Get notified of the latest episodes (and all our research as it’s released!) directly via email: Resources Featured In This Episode: Maddi Keegan: Website | LinkedIn Objectives Template – Download (Excel) Minerva Wealth Planning Upward Digital Marketing Wealthtender RightCapital MoneyGuidePro GeoWealth Tamarac Looking for sample client service calendars, marketing plans, and more? Check out our FAS resource page! Are you a successful financial advisor, or do you know of one that would be a great fit for the Financial Advisor Success podcast? Fill out this form to be considered! Full Transcript: Michael: Welcome, Maddi Keegan, to the \"Financial Advisor Success\" podcast. Maddi: Thanks so much for having me. Appreciate it. Michael: I'm really excited about today's conversation and exploring what to me is a really interesting dynamic in our industry that I feel like there's this sort of tendency and arc for advisors to skew towards independent channels over time. I think it's just some element of the longer that we do this, the more clarity we get about what we want to do and how we want to serve clients. And then you tend to skew towards places that give you more autonomy to kind of do what you want and serve clients the way that you believe that they should be served. Sometimes that leads to independent advisory firm channels. Sometimes that goes as far as like I'm just going to hang my own shingle and literally do my own thing my own way. But I find as firms go out on that spectrum, rarely do they go back the other direction. Very few advisors who hang their own shingle ever go back to work in mid- or large-sized firms once they've been out on their own. And I know you have followed a different path. You went out on your own, hung the shingle, did that for a while, and have now decided to merge back into a larger firm – or even, I would say, a mid-sized firm, just not one of the mega roll-ups, but a local firm where you can actually be a meaningful part of the business as a partner of the firm. And so I'm just excited to talk about this journey and progression of what leads you to go out and hang your own shingle and then what leads you to make a change and say, \"I think I'd rather be a partner in a larger firm and not running my own shop at this point.\" Maddi: Yeah. Definitely a lot of twists and turns throughout my career. It wasn't all part of the plan, but happy to chat through all that. Why Frazier Financial Advisors Uses Tax Preparation As A 'Low-Profit' Value-Add [4:59] Michael: So I think to get us started, why don't you just tell us about the advisory firm that you're in as it exists today? Let's understand the context of the business now and then we can talk a little bit about the journey and path in getting here. Maddi: Sure. So the firm, it's called Frazier Financial Advisors. We're in Central Ohio. We have clients all over the country in more than 35 states, but we're centrally located here. All our folks are located here as well. We have 17 full-time people. We have a tax practice in-house. That's a thing that I think is a little bit unique, is having that be part of our firm. And then in terms of, I know our industry uses AUM as a measure, so we have about $860M under management. We really like to think about it though when we talk about it on our website or to our clients about what the client investment profits or what they've benefited in working with us. And so that number is $280M at this point. We have some milestones out there that we like to share on that. Michael: Wait, wait. What's 280 million? Maddi: So that's client investment profits. So the net investment and then where our AUM is today. So we talk about it to clients as their investment profits rather than what is our AUM. We don't really share our AUM necessarily with clients. Michael: Oh, interesting. So looking back cumulatively of all the dollars that clients brought into the firm, this math sounds to me like they've deposited $580 million with you and it's at 860 million today because you've grown that by $280 million cumulatively. Maddi: That's right. That's right. Michael: Interesting. And so that's how you market it. That's how you put it out on your website as like firm positioning and value proposition. Maddi: Yeah. Yeah. We try to think about it from the client perspective and their lens and not wanting to make it about us, but being able to make it about how we can help them over the long term. We got registered in 1997 and so kind of what that trajectory has looked like and what we've been able to do for them and help them with their retirement or what have you. So yeah, we're proud of that number. That's how we talk about it externally. Michael: I guess just my brain goes to this, I can't help, but are there compliance challenges that crop up with that? I feel like so many of us are used to talking about things like returns if you say any numbers and obviously the SEC really scrutinizes any time you talk about anything returns related. Have you had compliance complications or implications from this or has that worked fine for you? Maddi: We have not. And I would say we also don't position the conversation to say you can expect a certain amount of return. It's more of just look at what you've invested and then look at how we've helped you grow, look at how our firm has helped you grow over the last 10, 20, 30 years. So no, we haven't had any issues with that at this point. Michael: There is sort of an interesting, it really doesn't promise any particular return or expectation, which as you know, that's where regulators get really concerned. As you said, here's a cumulative impact report. Maddi: Yeah. Michael: Interesting. Interesting. And then how many clients is it just that the firm's serving overall? Maddi: Yeah. So we have a little under 700 households. Some of those households are family members of clients or it's a little bit probably overstated, but right around 700 or less than 700 is how many households, kind of how we think about it. Michael: And then can I ask from a revenue perspective just what it adds up to for the business? Maddi: So I can tell you our fees from the advisory business are about 88–90% of our overall because we do have that tax practice and a little bit of insurance. For 2024, we're projected to be around $7 million total, but that includes the other fees as well. Michael: So you are now a little over 6 million in core advisory and almost 1 million of tax and insurance and the other ancillary pieces that layer in. So I guess I'm curious from that perspective, is tax a small niche thing you do for some clients? Is it something that you do for all clients in the firm? Do you charge separately? Is it bundled in? How does it work as it's attached to the rest of the business? Maddi: Yeah. It is a separate fee. So our clients kind of pay us on the advisory side and then they also pay us for the actual tax filing and preparation. We don't require our clients to use us for doing taxes. Most of our clients want to have kind of a one-stop shop and be able to do it all in one place. There's a lot of financial planning opportunities that come from tax planning and so it's just kind of a nice thing to have. And so I would say that the majority of our clients do use our tax services, but it is not a requirement. We tell them that day one. But we do, I will say the kind of talking through and doing tax efficiency planning is part of that financial planning engagement that we have with you. And then separately, there's the filing fee every year that you would pay for the actual return. It could be done. Michael: So do you have a sense of how many clients use or how many returns you have to plow into during tax season every year? Maddi: Yeah. I want to say I don't know the exact number, but I want to say it was a little over 500. Michael: Wow. Returns that you prepared. So a lot of returns. That's a lot of returns. Maddi: A lot of returns. It is a busy, I was going to say, entire year because we have a lot of extensions too. So it's a busy office, especially around tax time. Michael: So what fee level do you set for this? Maddi: So for the tax filing, it is really anywhere between $600–$1,500 depending on complexity. So we kind of look at... Because we do have some small business owners that require a little bit of extra work. And if it's a larger business, it might be even a little bit more than that. But the vast majority of the clients kind of fall somewhere [in that]. And we tell them somewhere between $600 to $1,500 with most clients kind of falling right around the $1,000 range for the tax prep and filing. Michael: And so it sounds like there's not any particular discounting because you're a client of the firm, you get this favorable price. It sounds like you're just trying to quote it like it is what it is. This is the cost of the work given the stuff that's going on in your life. Maddi: That's right. Yep. We're trying to compensate for the hours that our tax team is working. There are some nice synergies being a tax client. So I think clients do get some benefit in having both a financial planning relationship and a tax relationship with us. But to your point, it's totally separate and it's based on the hours that we work on that return. Michael: So how do you position it with clients? Because I get there is a version of you should do all this stuff together with us because it's cheaper. You get a deal. It's bundled. It's volume-priced, all that. But it doesn't feel like that's really the angle here. It doesn't sound like you're trying to do it from the perspective of if you bring everything under one roof with us, it'll cost you less to get your return done because you're still trying to charge fair value for what it takes to prepare a return these days. Maddi: Yeah. So I think it comes down to just the ease of working. So the primary advisor is the one actually kind of quarterbacking the entire tax return if they're doing taxes with us, even though they're not actually filing it. They're the person talking to the client, getting everything they need and then kind of communicating what's going on, letting them know what to expect. So I think the way we've messaged it is just saying like, \"This is really easy for you. It is a separate fee, but you get to work with, if I'm your primary advisor, you get to work with me all year long and then I'm kind of the person keeping you in the loop. You don't have this other entity or company that you're working with. And this kind of helps lead into some financial planning conversations. We could talk long term about how to save you on taxes or what this looks like long term or into your retirement.\" So that has seemed to... We haven't gotten a lot of pushback. You're always going to have some folks that are like, \"No, I can do it myself or find it for less.\" And that's another prerogative. That's okay. But a lot of our clients really are, I would say, extreme delegators and they really don't want to have to keep track of another entity or person or company that is doing it. So that's been attractive to them. Michael: And does that ever create any conflicts or competition for you with the other CPAs in town? Do you get CPAs that don't want to refer to you because you do taxes too, or CPAs you win business away from that are then unhappy that you took their tax clients? Does that crop up? Is that an issue for you? Maddi: I don't think so. And there are still, I would say, some prospects or even clients that don't have much complexity at all. They just have a W-2 and that's really it. We're probably not the best fit. So while most of our clients we are, we will sometimes refer out. We have a couple of local tax professionals that we've referred out to before. So I haven't really seen that myself personally of that kind of feeling that the competition with other CPAs, because we're also we're also not trying to get any tax clients that are not our financial planning clients. So I should say we don't put ourselves out there as a tax firm trying to find clients. It's more of we're a financial planning firm and we have this nice service in-house and full-time tax professionals to help us with the planning. Michael: Interesting, because I guess that is a good framing. So then is there a mentality overall just in how the firm thinks about the tax business in this context? Is it additional profits because ultimately tax business has some profitability to it? Do you just try to run it to break even because you're hoping it retains more core clients? If it retains more core clients, it's more profitable to get retention there than it is to get profits on the tax business. How do you think about it from the business end? Where does it fit into the picture? Maddi: I think we think of it more of kind of a value add on the financial planning side. I don't know for certain, but I do think we profit a little bit. But I don't think we're thinking of it as a way to profit. We're not thinking of it that way. We're thinking of it as this is a really nice benefit to have this expertise in house to help us and our clients throughout the year. So I would say we're probably pretty close to a break even if I had to guess. Michael: Yeah. Well, I just think about it overall. Even at hundreds of returns, if the average fee is around $1,000, it's $0.5 million business if you're making 10 or 15% profitability on it, it's tens of thousands of dollars of profits. That's not a bad thing, but 500 returns is a lot of work to make tens of thousands of dollars of profits on a business that does $6M of AUM. Maddi: Right. Michael: Right. It doesn't really feel like that becomes a big profitability engine at that point. Maddi: Yeah, exactly. And it's why we also don't really want tax clients unless we're kind of doing the whole deal. Michael: Right. So how do you handle this from a staffing perspective? In-house? Outsource? Just who does 500-plus returns? Maddi: Yeah. So mostly in-house, we have 2 full-time...well, 3 full-time tax professionals, one of which is our tax partner that kind of leads the tax team. And then during the actual tax season from January to April, we do have a couple of part-time contractors that come in to help just from January to April. But we do have 3 full-time staff, 2 of which are CPAs that are doing taxes for us. Michael: So 1 tax partner, 1 CPA, and 1 tax-support professional. Maddi: Yep. Enrolled agent. So actually filing, but not a CPA. Michael: Okay. And so what do they do the other 8 months of the year out of tax season? I say that tongue in cheek, there's extensions and other stuff, but just I feel like there's this mentality of, \"Okay, tax season is really busy during tax season. But if you have full-time people, what do they do the other 8 months of the year?\" How do you keep them busy and productive as a firm? Maddi: So I would say, so we do a lot of extensions. We do have quite a few businesses that we're working with. So we really are working, right now getting close to the 9/15 deadline for S Corps and then the 10/15 coming up, our tax team is still working on some returns that are for 2023. So really, it takes us into the fall. I should say as well, we kind of we kind of position it with our clients as well, if there's any level of complexity, we're wanting to extend. It's not a bad thing as long as they know that that the payment is made if they're going to owe that it's done by April 15th. They're totally fine with that expectation. So we do extend. I wish I knew the exact number, but it's a large amount of our returns are extended in the first place. So they're working pretty much through 10/15. Michael: Interesting. Maddi: Yeah. Michael: So priority-wise, as you prepare, it's like the simple ones get done by April 15th and everyone else just gets told like, \"You're going to be on extension, we're going to spend the next 4 or 6 months getting this sorted out. Let's just prepare the expectation upfront.\" Maddi: That's right. That's right. And then the last couple of months, we are pretty heavy on... Most of our primary advisors will know and want to do projections for their clients. And so we do projections pretty much the last couple of months, the tax team is busy getting ready for the next tax year. So there is plenty of work to go around. Michael: Okay. So I guess I'm almost envisioning 3 seasons, 3 uneven seasons for the tax team. You get January through April, we're in traditional tax prep cycle for April 15th, you get extension season, which is all the complex returns, which might be the majority of the returns that runs another 6 months from mid-April to mid-October. And then you get season 3 is a 2.5 month season of, okay, now let's do all the end-of-year tax projections for the loss harvesting, the gains harvesting, the Roth conversions, right? All that end of year tax planning stuff that we do that crops up there and then you repeat the cycle. Maddi: Yep. That's right. Michael: Interesting. Well, I guess how long have you been doing the tax preparation internally? Maddi: So this goes all the way back. Our founder, Jim Frazier, who started the RIA back in '97, he was a CPA turned advisor. And so he kind of started this with the tax practice and then said, \"Oh, I can't help these clients that are showing me everything that's going on and they're tax attorneys. They're talking about their broker. I could help them do this a little bit better.\" And so that's how he kind of decided ultimately to launch the RIA in '97. And so we have always had tax in-house. Michael: So notwithstanding, I feel like this has become a more popular thing in recent years for firms looking to bring tax preparation in-house. This was basically from the start for you because you're founded by a CPA who came over to the financial planning side. Maddi: Yep. Yep. Michael: Interesting. Which I guess also helps to clarify why you're not trying to grow it as a standalone tax practice and tax business because that's what Jim was leaving to make the advisory firm in the first place. So thus, it's a wonderful value add for clients, but I'm not trying to scale up a tax practice because I left that to make an advisory firm. Maddi: Yep. Yep. You'd have to ask him, but yes, that's my understanding. How Maddi Built Minerva Wealth Planning [21:45] Michael: So now help us understand your path to Frazier. So what were you doing before and how did you come to the firm? Maddi: Yeah. So I had my own RIA, Registered Investment Advisory firm in Central Ohio that I had started in 2019, Minerva Wealth Planning. And so I was kind of out there doing my own thing and working with my clients. And I had no intention of when I ended up joining them in 2023, in May of 2023, I never thought I would not continue to work for myself and be able to kind of have flexibility and control everything and have my own business and own 100% of it. That was not the plan, but I had an employee for a couple years when I was at Minerva Wealth Planning, and she ended up wanting to get out of the business completely, didn't want to be in the business anymore, in the profession anymore in October of '22. So at that time, I was a few years into my business, I was finally getting some decent traction, getting quite a few clients per month. And so I was at a place where I was like, \"Crap. I had this person that I thought was going to really kind of help me take this to the next level and become an advisor.\" She took the CFP track at Ohio State. And so before she started working for me, so I was like, \"This is great. We're going to go forward and be able to work together.\" And then she was like, \"I don't want to do this anymore.\" And, of course, I was like, \"Oh, are you sure? How can I help develop you? This is a great profession to be in.\" And she's like, \"I just don't want to do this. And I want to move to Texas.\" And I was like, \"Okay. Great. I'm happy. I'll support you,\" and still have a great relationship with her. But it did kind of bring me to this point of this crossroads where I was like, \"Okay, I'm bringing in too much for me to handle on my own.\" So I kind of started to figure out like, \"Do I hire a virtual assistant? Do I try to hire a paraplanner, a virtual paraplanner? How do I solve this issue of getting too many...having too much to do and not being able to do it kind of on my own?\" And so that was in October. I was having lunch with one of the partners of Frazier Financial, Brian Houts, in January of '23. And we knew each other because we were both on the board of the Financial Planning Association of Central Ohio. So they got together every so often and chatted and talked about our businesses. And I was complaining, I was kind of just unloading about I didn't know what to do and I was really thinking this was going to work and she was going to be a partner of mine, and all this stuff. And he was like, \"Well, why don't you come work at Frazier Financial?\" That was kind of the thought, first thought. And I was like, \"Oh, no. I don't want to do that. I'm happy. I'm not trying to leave. This is what I want to do. This is what I chose to do. I decided to do this.\" And he's like, \"Well why don't you get to know us a little better? Why don't you come get to meet some of the other partners, meet some of our employees, spend some time with us, kind of like date us, and then you can kind of make a decision if you don't think...? No pressure, but get to know us and maybe you'll change your mind.\" And I'll kind of get into all the reasons, I'm sure. So that was kind of the impetus, the start of this whole conversation. And so I started spending some time with them and the partners there and some of the employees and going into the office and meeting folks, and yeah, ended up kind of wanting to move there. Michael: All right. So I want to get further into the dating process in a moment, but I'm also just curious to hear more about what happened with this lovely person that just ultimately decided they didn't want to stay. So can you share more context? What did she come to do for the firm originally? What was her situation and context as she was seeking you out in the first place? Maddi: Yeah. So I found her, I was doing some work with Ohio State. She was a senior about to graduate from Ohio State. This was back in end of 2020, beginning of 2021. And so I got connected with her and was like, \"Oh.\" She was doing the CFP tracks, said she wanted to be in financial planning. And so I hired her as an intern and I think she was doing maybe 5 to 10 hours a week for me. And she was pretty much doing some administrative tasks like putting stuff into the CRM that I was using at the time and kind of doing some reporting on birthdays, stuff that was kind of helpful for me, but some administrative stuff that took a few hours a week. And then as we got closer to the end of her semester and also when she was going to graduate, I was like, \"Oh, this help is actually great. I would love to consider hiring her full-time.\" Looking back now, it was probably a little bit early in terms of revenue for Minerva Wealth Planning. Michael: I was going to say, where was your business at this point, if you recall, like clients or revenue? Maddi: Yeah. So, let's see. This is beginning of 2021. I want to say that year, total revenue, I think, was around $120,000. And I was paying her, I think, $40,000 once she was full-time. So I'm like... Michael: Okay. That's like new college grad starting job, entry-level position. Maddi: Right. I can't remember it now, but there were some things in there for bonuses if she did certain things, but I know her base was $40,000. So it was probably a little early, but I was like, \"I know I want to grow this business. I don't want to be kind of a... I know that I want to grow, I guess.\" And so I was like, \"I'm going to invest early.\" So before she graduated, I had offered a position to come work full time and to kind of help me with some, continue to do some administrative stuff, to sit in client meetings and take notes and to be able to kind of see how financial planning works. And she said yes, thankfully. And so worked for me. And most of what she did was super helpful. It was having her pretty much in every single meeting that I have with clients. So before, she would help me prep agendas. So I'd kind of talk about the client and what we were going to cover. She would prepare a really nice agenda. She would take all of the notes during the meeting and then she would send all the follow-up afterwards with my oversight. So she was doing that and then she was continuing to do some of the administrative tasks within the company. Michael: So you didn't necessarily hire her into, at least as I would characterize, a paraplanner, associate advisor role, like do a bunch of the planning work for all these clients. She was doing all the core administrative support work and freeing you up to do all the planning stuff for this growing client base. Maddi: Yep. That's right. Towards the end, she was doing a little bit more, getting a little bit more into some of the planning. But for the most of the time she was there, yeah, it was more of the administrative stuff. Yep. Michael: And do you recall at all just how many clients you were at at this point, how many you were juggling? Maddi: Yeah. So 2022, I think was our biggest growth year. I want to say I was somewhere around 35 to 40. So not a ton, but it was kind of at that place where I didn't have... I kind of wish I would have spent a little bit more time building out workflows and stuff. I didn't really have great processes. And so I was kind of trying to figure all of that out. Michael: Well, nobody really does at that stage, unless you're just one of those people that is naturally wired for system and process, like that you can't help but make them everywhere that you show up. I find for most firms, as we're at this stage, this is just the getting-stuff-done stage. And once you get north of 25 or 30 clients, there's just a lot of stuff to get done and it helps to have another person to help get stuff done. Like, \"I don't have a formal workflow process, just like this needs to be done by Friday. Figure it out.\" Maddi: Right. Right. That's right. Exactly. How Maddi Overhauled Her Marketing To Pull In More Prospects [30:02] Michael: Okay. So you guys, I guess you go your first year with your getting-stuff-done person and it goes well. You continue the second year. And I think you said 2022 was your bigger growth year. Is that connected or coincidence? Like I got the person and it left me up to do more marketing and we grew more, or is this simply the business was building momentum because you'd been going several years now? Maddi: Probably a bit of both. I will tell you, I was spending a lot more time, definitely in 2022, a lot more time prospecting or having conversations with prospecting or being out around there. So I think that kind of freeing me up to do that definitely had an impact, definitely had an impact. But at the same time, and I can talk about this too, I did a little bit of marketing and SEO stuff with my firm around the same time and ended up kind of having a little bit of spike of people reaching out to me online as well. So I think there's probably a combination of things. Michael: What did you do that spike people reaching out online? That sounds lovely. Maddi: So I guess there were 2 different groups that I ended up hiring. I wasn't spending a lot of money. It wasn't super sophisticated or anything like that. But I had hired a local firm. I can get the name. I can't remember. They're local here to Central Ohio, but they basically helped me rewrite my website. And so they kind of made it sound a lot better than what I could have done on my own. And we actually added in this kind of interesting thing that I got a lot of traction with, which was you could request a less than 5-minute video from me, and you would put in a couple of factors. So I think it was your first name, your income, what investment assets you have, a couple of basic things about yourself. And then I would create a kind of an educational...and I would call it an educational video. I can't give advice. And I had all the disclosures saying I can't give advice. But it was kind of this quick video where I could lock eyes virtually – obviously not real-time – but lock eyes with these people and say, \"Hi, thanks for submitting your information. I see that you don't have any type of investment assets, but you have this high income. Maybe you should think about what you're doing with excess dollars.\" It was kind of just a little educational series. And so they had encouraged me to put that on the website. And that was...yeah, I was getting more of that coming in. That was an interesting idea. Michael: Interesting. So I get it. Just prospects at the end of the day are just trying to figure out, \"Are you a good person? Can I trust you? Can I relate to you? Are you going to explain things well that I like working with you?\" And so they get a taste in their individual contexts and circumstances, not advice, etc. But they get a little bit in their specific context and circumstances to figure out, \"Okay. When Maddi talks to me, does this feel like someone that I would want to be in an ongoing advice relationship with?\" Maddi: Yep. That's right. Michael: So I'm presuming then, you send the video and then there's some follow up of like, \"And if you'd like to work together on an ongoing basis, please go here to fill out a prospect meeting.\" Maddi: Yep. That's exactly right. That was to get something scheduled just to chat real time with them. People meeting the first time after that video was pretty high. I would say 80 to 90% of people that got a video would set up the next meeting. Ultimately, getting to the finish line of signing on wasn't that high, but getting to the next step was very high. And then a decent chunk ended up also signing up. Michael: Interesting. So it sounds like the process from prospect to close wasn't necessarily improved, but the ability to get a bonafide prospect intro, get-to-know-you meeting was higher. Maddi: Yep. Michael: Okay. Very cool. Maddi: Yeah. Yeah. So that was one of the things I did. And then the other thing I did right around there was I hired another local firm, Upward Digital Marketing, to do just an SEO audit. And so it was super inexpensive. At the time, like I said, I didn't want to spend a ton of money. I think it was 500 bucks. And they looked over everything after I had redone my website. And they basically just gave me some key things to think about or to do like having or getting Google reviews, or...and we can talk...I had Wealthtender, kind of the reviews and how that works. But they had 5 or 6 different things they wanted me to do. In blogs, they wanted me to use certain words. So they kind of put that out there. And then I just kind of went in and did the things they told me to do. And so towards the probably last 6 months to a year, I would say a lot of the people that were coming to me were not referrals. They were people from Google or from the website. They were not referrals, which is kind of uncommon in our industry. Michael: So then can you explain a little more what were the SEO things you were doing that seem to have actually had an impact and literally were making referrals or making results...or sorry, making not referrals, making Google searches? Maddi: Definitely reviews was a huge one. I'm not sure if you've got there, I've heard of Wealthtender, but it kind of allows you to check the box on all the rules around testimonials for our profession. And so I had adopted Wealthtender. And then I also requested every single client to fill out a Google review. And so made sure that I had all my i's dotted and t's crossed on making sure that I wasn't cherry picking and everybody got access to it and just had asked everybody to do that. That was probably the biggest, from what I recall, that was kind of the biggest thing that I did that helped. Michael: Because then people are like, they're searching for your firm, they find the Google reviews. Maddi: Yep. Yep. I think the guy that I worked with for SEO, I think he even emailed me, I was looking back through my emails, and I went from the top of page 3 on Google to the top of page 2 within...it was a short period of time. There were some keywords, financial advisor, kind of some of the main ones, but putting woman, putting woman-owned or putting something about women. A lot of people found me and wanted to work with a woman. I also kind of had a little bit of a small niche within my firm of working with small business owners. And so there was some language I'd put in there about being a woman-owned business and working with small businesses and woman-owned small businesses. So there are a couple different kind of words I tried to put into the website, as well as in your blogs, if you kind of...and again, I'm not going to speak intelligently to this, my SEO person certainly could, but they gave me some kind of specific things to do with words and kind of continuing to add those to different blog posts so that it would kind of pull you further up on that search list. Michael: And I guess just curious, how do you know it was the Google reviews that were working? Were you literally finding prospects come in and say, like \"I wanted to reach out to you, because I saw you had really good Google reviews,\" and there it is? Maddi: It wasn't super precise. I did ask every prospect how they found me. And about 50% of them were saying they found me on Google. There were a few that were saying that they had seen that I had good reviews. I can't remember the exact amount, but that wasn't the primary driver. But it was very clearly, I remember being surprised kind of towards the end of being at Minerva Wealth Planning, that so many people that were coming to me were virtual from all over the country and were finding me on Google. And it wasn't...yeah, it wasn't. Michael: And this is all for a $500 SEO audit, and then just doing the things that they said. Maddi: Yeah. I think part of it maybe was just luck too, because I don't know that that's normal, how people can expect that. But I think I spent $1000 on the website design and then I spent $500 on the SEO stuff. So not a significant amount of investment. What Prompted Maddi To Merge Her Firm [38:01] Michael: So, growth is picking up. So what happened to your wonderful person? Maddi: I know. I'm so sad. Like I said, I'm still friends with her and I still love her. But she wanted to get... She kind of sat me down, and I think it was September, October of 22, and was like, \"Hey, I don't want this to hurt you or the firm or your feelings, but I kind of want to explore something else. I don't think I want to do this anymore.\" And of course, my initial reaction was, \"Oh, well am I...?\" If you're a business owner, you don't have a ton of time to train, I'm probably not doing a good enough job training you are getting you to do the things that you want to do. Like, \"How can I be helping you see how great this profession is? How can I train you anymore?\" And she's like, \"No, that's not it. I just want to get out of the industry completely.\" And so I was like, \"Okay.\" And she actually wanted to go into a music career. That's what she moved to do. So very different, very, very different than what the plan was. So it was just one of those situations. Part of me still thinks I could have done a better job of integrating her into the business. But at the end of the day, she really wanted to move to Texas and explore kind of doing a record deal and being able to do music. And so of course, I supported that, but was very sad. She did continue to work for me a couple of hours a week as a virtual assistant, kind of as a contractor after that, for a few months, because it helped her out and also continued to help me out. She just wasn't doing as much of the planning stuff in the client meetings because she wasn't available all the time. Michael: Right. So this just feels like one of those, we go to college for a thing, and then we do the thing for a little while after college, and then we decide that's not actually the thing that we wanted to do with our lives, just one of those? Maddi: I think so. I think so. I went to college for political science, so I have no judgment. I thought I was going to be doing something totally different than financial planning. Michael: I was a psych major theater minor. Here we are. Maddi: Yep. So I think that's it. Maybe she'll get back into the industry. I'd be happy to have her back, but we'd be happy to have her back. But for now, it sounds like she's doing something else. Michael: So what was it that as you came through that to say, \"Hey, this Frazier conversation seems interesting,\" as opposed to, \"Well, I guess I got to go find another one. I can just go hire another Ohio State grad,\" or try some different hiring strategy if that wasn't the one that you were happy with? Maddi: Yeah. I think that kind of initial like, \"Okay, this might be worth exploring,\" is Brian, who ended up being the person that kind of talked me into coming to Frazier, met with me initially. I had known him for a few years, so I think it was a little bit different of like, \"Okay, I trust this person. I've worked with him on the Financial Planning Association Board.\" Every time we met, he was an open book about what he does for clients, what the firm does for clients, shared every and anything with me. And I had had, kind of to give a little backstory to this, I had had a couple of different conversations with a couple of other different firms throughout my career and while I was with Minerva Wealth Planning about joining them. And they were kind of out of the blue people I didn't know very well, and that ended up not going anywhere. It was kind of crappy. And so this was the first time that it was a person that I knew very well, fairly well, and kind of that gave me at least to explore what it could look like. I kind of was like, \"I still don't think...\" I think I even told him like, \"I don't think this is going to work. I don't really want to do this, but I'll at least have conversations with you and your team and learn from you and I'll share, I'm an open book as well, I'll share everything I'm doing and how I'm doing it.\" And so that's kind of where it went next. Michael: So I think when you were describing this further, you kind of framed it as a dating process. So what was the dating process like? What did you do to try to figure out is this the firm I want to merge into after I've been getting momentum being out of my own? Yeah. Maddi: There were quite a few meetings, probably January, February, March of, we would just sit in a room and just they would pull up tech stack, for example, so all the tech they were using and would just show me what their process looks like, what type of technology. So one of the things that's kind of different about us is that we manage assets held away. So we claim custody. So he would show me like, \"Okay, this is this buy-all tool. This is how we aggregate assets and bring this in. And here's how we help that...help our clients with whatever, their held-away assets.\" And so it became almost a review of their business and how they do things so that I could get a sense of how would that fit with my business. It became kind of a 2-way thing, right? So they would share all the things and show me how they do things. And then I would pull up my planning software, pull up anything that I'm doing, my CRM, and kind of show them. I had a proposal process. I showed them how I do proposals and how I talk to prospects. And so we went through that for the first couple of months and then it became more of kind of talking to the partners there about what could it actually look like. After we got to a certain point where I was like, \"Okay, if I join, my kind of non-negotiables, I still want... I want to be a partner and it's not for financial reasons. I want to have a seat at the table and I want to be able to kind of help direct things and help build things.\" And so that's one thing that I know that I need. I also need my clients to not be hindered in any way by joining. I don't want them to feel like they're getting a worse experience or getting worse technology or getting worse service. And so there were kind of all these things that I started to talk through with them over those kind of probably March/April timeframe. And then we did some kind of offsite personal meetings as well. So I had dinner with all the partners and my husband came and their spouses came, and we kind of got to know each other outside of the office. And then I did go into the office and meet some of the team as well. So much of the conversation was with the partners, but kind of at one point towards the end of before deciding to join, I got into the office and met some of the folks that are there and kind of got to feel a little bit of the culture there. And so ultimately, they gave me an offer at the end of April. And I was like, \"Yeah, you've talked me into it. We are aligned culture-wise, we are aligned with how we serve clients.\" And there's a bunch of benefits, I would say, with joining that I can talk about. But at that point, I felt confident to move forward. Although it's kind of a funny story. When they had kind of shared with me that I could have these things that I wanted and get a decent compensation and all these things, my mom is also an executive in finance and I had called her for advice and was like, \"Okay, they're giving me all these things that I want. And they're super kind. And I like spending time with them. And I like working with them. There's got to be a catch. There's got to be some reason why they're doing this. They're trying to get me or trying to get me on something.\" And my mom was like, \"No. I just think they value you. I don't think you need to think that way.\" And I'm a pretty optimistic and trusting person, but still I was just a little hesitant that it felt so good. And it felt like they did value me. And so that's when I ultimately decided to join this end of April, beginning of May. Maddi's Non-Negotiables In Negotiating The Firm Merger [45:56] Michael: So now help us understand what were the non-negotiables, the things that really were the line in the sand for you about what it was going to take for a merger to work? Maddi: Sure. So there were a couple of things that I had stated to them. One was I definitely wanted to be an equity partner. Certainly, the revenue I brought over would help with this, but I didn't stipulate a certain percentage or anything like that. But I did say that I wanted to be an equity partner, and more so just to have a seat at the table. That was really what I wanted, was to be able to kind of help drive the change and drive the growth of the firm. And so that was one of my non-negotiables. Michael: Was there change planned? You just said you wanted to drive some change and growth at the firm. Were there change plans underway or things that you had in mind or just kind of in general principle like, \"I want a seat at the table as this thing grows and evolves?\" Maddi: Mostly just kind of the growth. Their growth trajectory, I think they've...we, I should say now, have doubled in the last 2 to 3 years. We've quadrupled since 2017. And so I kind of just saw that this was going from...and we are in that dangerous middle that I know people have talked about on the podcast before. But I could kind of see this just continuing to be this huge growth for this company. And so being part of building this out to the next level, to get to the billion-dollar mark, to get to and to me, more importantly, is how you're building out that team. A lot of my experience prior to being in financial planning was leading teams at a large Fortune 100 company. And so I really thought that I could be helpful in driving some of that on the operation side of the firm. And so I really wanted to have a seat at the table to help them with that. The other non-negotiable would be from a compensation standpoint, at least making close to what I was making for myself with the opportunity to kind of grow that aside from profit distributions, be able to grow that over time to reflect my experience and background. Those were the only real things that I kind of drew a line in the sand and said like, \"This has to...\" Told them, kind of verbally told them that this is what I'd want or need. And then kind of some of the other things that I would say though that I knew in the back of my head that maybe I didn't say out loud, but I realized over the months was I wanted a fun culture that I enjoyed coming to work and having a team around me that I really enjoyed being around. And so I wouldn't join a place where I felt like there wasn't a great group of people around me. So that was one of the things, flexibility and value of education. So we spend a lot of time and money on sending advisors to conferences or doing continuing education. That was really important to me. So there were some other things that I didn't necessarily state to them, but I could tell when they kind of opened the books and showed me everything, it was clear to me that some of those things that I value, that they value as well. So it was hugely cultural. And then kind of some of the details were around being an equity owner and having decent compensation for what I'm doing and feel like there's a path forward to continue to grow. How Equity Was Calculated In The Firm Merge [49:51] Michael: So, what's it like to transition from, just think of when we're solo and are on our own, compensation is kind of gross revenue minus business expenses equals, I get what's left over. Call it comp, call it salary, call it profits. We can be creative with some entities about how we do that for FICO purposes. But at the core, gross minus expenses equals my comp. And when you get into a realm of being an advisor in a larger firm with multiple advisors and multiple partners, there's usually some separation, some distinction of, \"here's what you earn in the business versus here's what you earn as profits for owning the business.\" So I guess I'm curious how that got negotiated, or even when you were thinking about, \"I need to have the same compensation,\" was that just what you earn in the business or was that what you earn in the business plus your profit distributions? How did you think about that comparison and transition? Maddi: Yeah. So kind of both. So the way that our deal is kind of working out, we're kind of in the middle of this equity transition. And how it works is, so the clients that I bring over from Minerva Wealth Planning, so the people that I brought over on May 1st, as well as anybody else that comes to me as a referral or through the name of Minerva Wealth Planning, so not by knowing Frazier Financial, all of those clients, the revenue generated from them in the year of 2024, so all of this year, that revenue goes towards a 5% ownership stake in Frazier Financial. So that gets me the equity piece. And then I have to make up the difference between our multiples, which I'm happy to talk about. So that's kind of how I get the long-term profit distribution separate from compensation for doing the work every day. So that's kind of the profit piece. And then compensation piece, I did want to make sure that my actual wages were in line with what I was doing and the types of clients I was working with. And so that was part of it as well. I'll continue to have W-2 wages as an advisor in the firm. And then also we have team bonus and partner bonus as well that's part of that based on performance of the company and performance of you and what you're delivering to the firm. So that's all kind of the regular compensation, but those profits won't be so technically 1/1/25 is when my revenue from Minerva Wealth Planning will then purchase shares of Frazier Financial and I'll be eligible to start getting those profit distributions of 5% of profits going forward, kind of outside of the comp discussion. Michael: Oh, interesting. So even though nominally, you merged and did the deal last year in May of 2023, that through the year of 2024, it sounds like your original Minerva practice is still kind of running like its own phantom revenue P\u0026L profitability that you get paid from and it's not really treated as literally part of the core where you're simply getting your Frazier financial profit distributions until 2025 when you're more than 18 months into the deal. Maddi: That's right. Michael: So help us understand just how did that come about? Maddi: Yeah, yeah. Kind of backs around that. I really wanted day one to walk in as partner. I don't know if it was ego or what, but I kind of wanted to walk in and have all these things that I said I wanted. And they had talked me out of, they were like, \"Hey, we understand where you're at. We do really want you here, but we think it's in both of our best interests to do a deal that's a little longer so that you have time to get to know us and make sure it's a good fit, we have time to get to know you and we feel like it's a good fit. And so we were just certain that we want to work together.\" And we had it built in that I could take all of my clients and leave, even clients that I brought on that were from the Minerva brand, they weren't Frazier Financial clients. I could take them and leave and go back and relaunch my RIA and not have issues. They're not going to come after me for any of that. So they talked me into it and I said, \"Okay.\" And I'm really glad they did. My decision has not changed. I'm very excited to purchase on 1/1. But I'm glad that we gave ourselves some time to really get to know each other because it's a huge giving up your business and the thing you've built over the last whatever, 4 or so years is not a small thing to do. And so I'm glad we structured it that way. The idea came from, we actually have one of our other partners, Brian, he did a similar deal with them back in 2018. He worked it out with them where he had a list of clients that he brought over and they structured it exactly the same way. So it was already kind of a precedent for how they've done it in the past. And I, of course, hired an attorney and looked over it and decided like, \"This was a good path forward.\" Michael: So does that mean...? Is Minerva literally the RIA entity still out there kind of running in the background until the deal closes with share purchases on 1/1/2025? Maddi: It actually closed. So I ended up closing it last December. So I kept it open pretty much all of last year with the thought maybe I'll change my mind and not want to do this. And ultimately in December, and I told the partners too, I was like, \"I'm certain of where things are at. I love the team. I love the clients I'm working with and I love how we're serving them. So I'm going to go ahead and shut it down.\" So I would have to kind of relaunch if I decided to do that. But I did shut it down in December of last year. Michael: Okay. So you really did do all the move clients, repay per advisory agreements, such like all that happened in May of 2023. It's just your internal structure is, \"I'm not actually an equity partner yet. I'm getting comped on the original book that I brought in because we're still in this 18-month transition, 20-month transition. And then we'll receipt compensation and equity on 1/1/25, assuming everybody's happy then, which seems to be the case, we receipt this in 1/1/2025, where my comp and equity structure changes within the firm.\" Maddi: That's right. Michael: Okay. So then I've got to ask as well, just how did you actually strike just the terms, the valuation? Was there purchase price and cash changing hands, or was this all equity for equity, stock for stock? How did you actually get to valuation and terms and structure? Maddi: Yeah. So our CFO, who's also our tax partner, he kind of tracks, at least for Frazier Financial, how they value and they've done some...I think they've gotten some outside valuation done as well, but he has a kind of how they value themselves. To kind of give you the way that we think about it multiplewise. So they gave me a 1.5 multiple and I am buying them at 2 times. So pretty steep. In my opinion, it felt like a pretty good deal with me being such a small solopreneur, and having a large firm giving me a 2. And probably externally, would not be. It was discounted for somebody kind of working in the company and coming up that way. And so that's the multiple. So... Michael: So they value your revenue at 1.5X based on your size, you buy into them at 2X based on their size. Maddi: That's right. Michael: It seems like a translation of relative revenue equity between the 2. Maddi: That's right. And then any of the clients that I have brought on, because of the Minerva Wealth Planning name, but after joining them, so didn't bring them with me, they will bonus me out for that. So it'll be just kind of ordinary income tax treatment for that. So the 1.5 times, they'll just bonus me that amount of revenue for 2024. And then all of my Minerva Wealth Planning clients, it ends up being long-term gains. I forget logistically how we structured it, but I know that...but it's set up in a way that it's a little bit better tax treatment than clients that have come on since I joined. Michael: And when did these numbers get struck? Is this your revenue when you joined last May and their revenue when they joined last May to do the pricing of the shares, or is all this really delayed until 1/1/25, and when we get there, it's 1.5 times your 2024 revenue, 2 times their 2024 revenue because you're still in this transition period? Maddi: Yeah. Yeah. It's the latter. In Tamarac, we use Tamarac for reporting, we were able to separate out anybody that I brought over. So the actual revenue dollars through 12/31. So technically, it's still kind of going if I brought in other clients from Minerva, but it's still kind of the additional revenue could be added to that. But yeah, we're actually using 2024 numbers after 12/31 for that figure. Michael: And then how does it work compensation-wise from there? Are you a revenue-based compensation firm? Are you a salary and bonus because the rest comes from profits as an owner? How is your comp get re-struck after the equity transition happens? Maddi: So it is a salary and bonus. So actually one of the things I love about us is all of our team, all of our advisors, everybody that works at Frazier Financial are on a salary and bonus, bonus based on top-line growth and then their performance personally. So that will continue to be kind of the large part of the compensation. And then for me, there will be a profit distribution based on my 5% on top of that. So I'll have my regular wages for being an advisor and the director of operations, and then I have a bonus depending on how I do and how much growth the firm has that's quarterly, and then I'll have profit distributions that are paid out over the year as well. Michael: Okay. So as you get into this post-transition stage, so you just help us understand what are your roles and responsibilities now? What is the final shaping of the position for you as it stands today? Maddi: So still probably about 60 to 70% of my time is being a primary advisor. So that's the language that we use, just kind of meaning that the primary person that is working with a particular client. So that is, of course, the clients that I brought over from Minerva Wealth Planning, as well as I've been taking on some h that come through to Frazier. So that will continue to be within my role for a while, I would imagine. The other part of that is really the director of ops work. For example, some of the things right now that I'd be kind of overseeing are like our tech stack. We have Salesforce is our CRM, but we're kind of continuing to look for ways that we can get more streamlined and efficient. And so I'm kind of driving some things there to try to help us get there with workflows and things like that. That's just one example, but really any of our tech stack. Also kind of helping with...and this is kind of more of an office management type thing or hospitality management type thing, but when we have IT issues like coordinating with our IT team, making sure things in the office are running smoothly, our office manager is keeping things looking great and greeting clients really well and all of those things that kind of come with the hospitality management. And oh, I should say also HR. So kind of that piece of it as well, making sure that people have access and understand what benefits we offer our employees and getting them kind of enrolled and talking about it every year. We do some off-sites and team-building things. So kind of coordinating all of those things continues to be, and then billing is a big one that kind of falls under the operations umbrella. So the other part of my time is spent kind of in those areas and trying to learn. So over the last 1.5 years, it's been a lot of me trying to learn those areas and how Frazier Financial does them. Michael: I was going to ask, is there team support around this right now, or is this all on your shoulders like tech stack, IT, HR, billing? Maddi: There's a ton of team support, especially because I'm still so new to some of the technology that Frazier Financial uses. So, for example, I learned how when I did billing for us for a few months so that I knew how to do that and because we had a maternity leave, so it worked out. But I am no longer doing the billing every month. I'm kind of overseeing it. And if there's an issue or outstanding accounts receivable or something, then I might get involved. But I'll kind of continue to kind of in the future oversee a little bit more. But I'm kind of a combo of the team helping and me doing a little bit of it too. Michael: And I guess from your perspective, the firm's perspective, what changes as this goes from Director of Ops to COO? What's the distinction there for you? Maddi: Yeah. I think it is kind of more so overseeing and being more strategic, not being so in the weeds on, for example, looking at, I'm using billing because we just talked about it, billing as an example, looking at that every month and trying to figure out what's going on. It's more of like, what is the next thing we're trying to accomplish? How can we have some challenges, for example, with because we manage assets held away, and we rely on aggregation software, there becomes sometimes issues where we can't build on accounts until there's some reconciliation done and whatnot. So instead of kind of in the weeds talking about how to solve the issue for this month, it's more of like, what other technology or software is out there? How can I be kind of thinking about this at a strategic level and helping us get positioned as we continue to kind of be in this dangerous middle, get us over the hump to the...? I don't know when it ends, but I think that we got a little while. So kind of continuing to get us into a good position with what's next is kind of how I'm thinking about that role. Michael: Okay. Because I'm inferring from the discussion because you're a firm that bills monthly on an ongoing basis, so billing's just a regular drumbeat for you. Maddi: Yep. Yep That's right. Michael: I'm curious, why monthly as opposed to quarterly or other intervals? Maddi: From my understanding, back when they started doing that, it was truly a cashflow...it was nice to have the cash every month rather than... It does make things a little bit more complicated when you have to kind of track because we do...I should say we pull monthly, but we bill clients quarterly in advance. So we have different clients at different quarters, if that makes sense, throughout the year. So it does create a little bit of complexity with keeping track of which calendar quarter and which clients are on this calendar quarter versus this other calendar quarter that starts in May or in June. Michael: Okay, s you're not actually billing 1/12 of your fee every month, 12 months of the year. You're billing clients quarterly, but I guess you bill roughly 1/3 of the clients quarterly on January, April, July, October going through, and then 1/3 of the clients are on the February quarterly cycle, and then 1/3 of the clients are on the March quarterly cycle. So they're all staggered, which means about 1/12 of your revenue comes in every month, but not because everybody's being billed 1/12. Clients are quarterly on staggered cycles. Maddi: Yep, exactly. Michael: Okay. And then it smooths out cashflow. Maddi: Yes. And that being the reasoning is, yep, there's cash coming in every month. Michael: Okay. Okay. Are you feeling good about it because the cashflow is smooth or is the additional billing frequency feeling like it's not...the juice is not worth the squeeze for the work it takes to do continuous monthly billing? Maddi: Yeah, it is definitely a beast. I will say it's working, I would say, totally to the credit of our team. So one of the ladies on our team, Emily, does our billing and it's working well because she does it, but it is a ton of hours. So it is something that we're always kind of looking for, how do we improve this process? I don't think that would result in us not kind of having this setup where we do have this kind of cashflow coming in every month. That gives us comfort and flexibility to invest in the business if we need to. But we're always looking for ways to improve that process. I don't think that we would shift to a different model though, anytime in the near future. But thankfully, it's running well enough because we have people like Emily that can do a great job with it. How Maddi Led Her Clients Through The Firm (And Technology) Transition [1:06:06] Michael: So as you look now that you're a year-plus into the merger, very close to the 1/1/25 transition to kind of further cement and finalize, I guess I'm just curious, what's turned out as expected or not from the vision of what this was in your head 1.5 years when you were getting ready to sign this paperwork? Maddi: Yeah. What's funny is I totally thought that the conversations with clients would be the hard part. I thought moving clients over would be the challenge and then everything else I can learn and I can integrate and I'm good with the team and I'll pick everything else up. It'll be fine. And it's kind of the opposite is true. The clients came over...I think I had everyone moved over within a month. Again, kudos to the team at Frazier to help with all the paperwork there. But clients signed. They didn't question things. They saw that it was better for them and felt it and were happy. It was surprising to me that that happened. And then the part of kind of learning, I don't think I kind of fully understood the challenge of learning. I've been in financial services my entire career, but I've been in financial planning since 2017. So I'm still not new, but somewhat still learning a lot about financial planning. So I'm learning that and then coming into a brand new business, supporting a team kind of in a new role, and then trying to learn how to do financial planning with a totally new set of procedures and of different tech that they're using and meeting structure and a whole new story. Like I had to learn how to tell the story. Many of our prospect meetings now, I'm doing. And so I have to be able to speak intelligently about what I do and why we are who we are. And so I don't think I gave enough...I didn't think that it was going to be so much of my time and energy to learn all that. It was way harder than I thought it would be. Michael: What was the planning change from what you were using or doing to what they are at Frazier? Maddi: Yeah. So I was using RightCapital with Minerva Wealth Planning. I still actually have it. They've been so supportive of me kind of taking my time and slowly transitioning over. So I still even have some folks on RightCapital. But they use MoneyGuidePro. And so it's been an adjustment. I will say what's interesting is, I think clients actually kind of liked when we're starting to get into the conversations about, \"Hey, we're kind of switching technology.\" They seem a little excited by like, \"There's this new thing that we get to walk through again and talk through again,\" because maybe it's been 2 or 3 years since we've done that with Maddi, the clients that came over with me. So I guess that's good. But that's, sorry, the long way of saying going from RightCapital to MoneyGuidePro. Michael: Any other tech changes that were particularly surprising, I guess are either disruptive to the bad or beneficial to the good? Maddi: So I do love that we use...so we use Tamarac for our client portals and for all of our reporting and trading and all of that. And I do... Michael: What were you using previously? Maddi: So I had kind of a weird setup. So I had a...maybe I should have mentioned this with Minerva Wealth Planning, I had a TAMP that I had hired. So I did not do the investment management in-house. It was a totally separate thing. And clients paid for it separately. It was not part of my planning fee. I used a company called GeoWealth. They're great. I still love them. They're a boutique firm in Chicago. And so they had their own...I think it was, I can't remember what the backend software was, but they had their own kind of portal that they had created. Michael: Yeah. GeoWealth built their own tech. Maddi: Yeah. So clients would use that if they wanted to go in and see reporting. That's where I would go in to request how their funds were going to be invested, that type of thing. So it makes it easier because we also have an investment team in-house at Frazier Financial, but I do like the Tamarac setup a lot better. I like how simple the client portal is. I think it drives good conversations with clients. So I'm really enjoying that. That's been a big shift that I do actually think is going well. Michael: So does that mean from the client end, when you went through the merger to Frazier, does this show up as a fee reduction for them because they were paying Minerva fees plus GeoWealth fees because you assessed them separately, but if Frazier does everything in-house with investment team and Tamarac in-house, you \"just pay the Frazier fee?\" Did that actually add up differently or favorably for clients at that point? Maddi: For many, it did. And I should mention too, with Minerva Wealth Planning, I did just a flat fee. So GeoWealth took their fee. I didn't do any AUM on that. With Frazier Financial, 1% of what we are managing helps get you to that minimum fee. So a lot of my clients were paying $3,600 with Minerva Wealth Planning, out of pocket for that for financial planning. Now, because we're managing it in-house, we have their IRAs or their Roth IRAs, whatever, 1% of the accounts that they have are going towards that minimum fee. So yes, what you're saying, for many of my clients, it was actually they're paying a little bit less because of the structure of having this minimum fee structure and having part of their investments go towards it, subsidize it. Michael: So what was the fee structure at Minerva then? How did you do it there between investment fees, planning fees, minimums, GeoWealth versus Minerva? How did it work there? Maddi: So it changed a little bit over time, of course. Usually, you start a little bit lower. Michael: As these things do. Yep. Maddi: That's right. You're not sure if you're going to get paid enough to...or if you deserve this much and that type of thing. But ultimately, the last couple of years, my fee structure was $3,600 a year for a couple, and it was $3,000 for an individual. There was a tiny bit of a premium in hours. I tried to equate it to how many hours I was planning to work with them over the year. That's how I backed into it with it, assuming $200 an hour for my compensation for that. So minimum fee for a lot of the clients that I had was $3,600. So they were paying that just monthly through AdvicePay. And then separately, if they had investments, I would tell them, \"I'd love to be able to help you with that. And I have this great almost an extension of me and my team, this group that I work with, GeoWealth. And they're going to be able to do the actual trades and make sure that you're getting rebalanced and all the things that need to happen with your accounts. They're the ones doing that.\" And so they have, at the time, I'm not sure if it's changed, but at the time, it was 25 basis points. And they have their own proprietary strategies and models. And they also have others on their platform as well. And I'd used a couple of different ones, but I mostly used their proprietary ones. And so it was just them. The client would just pay directly out of the accounts, the 25 basis points and pay me separately. Michael: So you didn't have an investment...you didn't have an AUM fee at all on your end. You were a planning fee and GeoWealth was a basis point charge for the portfolio? Maddi: Yep. That's right. Michael: Okay. And so then if Frazier sounds like is an AUM, is ultimately an AUM model. So clients that had assets can apply it against their fee minimum...their planning fee minimum. But I'm also inferring that large clients with more dollars might be more on an AUM fee at Frazier than they were at GeoWealth at \"just 25 basis points.\" Maddi: Yep. Yep. There were a small handful that were that exact scenario where they did have more assets. But yep, that's right. Michael: But sounds like your clientele were younger folks with planning needs and not large portfolios yet. So transitioning to Frazier 1% fee on a larger portfolio was not in practice a common transition challenge for them. Maddi: Yep. Yep. I worked a lot with kind of that HENRY [High-Earner, Not Rich Yet] group that we all talk about where they have the cash available, but not the assets. That's right. Michael: Interesting. Interesting. So it kind of lines up well for the context of the merger. As they accumulate wealth over time, they kind of naturally grow towards viability of an AUM model anyways, they have more assets to manage over time. But the transition was pretty straightforward because you were charging enough in planning fees to cover what an AUM fee would have to cover anyways. It's the cost to service clients. By whatever means, you're going to pay for it. To a certain amount, you got to pay to get financial planning service. Maddi: Right. I've actually been asked that a couple of times of you were flat fee and now you're AUM, how do you think about that? I was never flat fee because I didn't believe in the AUM model. It was more of I needed to solve for these folks that are similar to my age that are young. They don't have a ton of assets. And so here's how to do that. I think Frazier has done a great job of kind of going to the next level. I love the way they do it where it's we still have a minimum fee because we got to get paid to do the good planning work we do. But you can...over time, you can use the assets that you do have and then over time kind of build on that until you're kind of at that level where you are, rich or have the cash or have the investments I mean. Michael: Okay. Oh, right. Because if I'm in the old model, I was paying you $3,600 for a couple and a GOL fee – small fee, but I had an 'and', whereas I'm Frazier, my AUM fee goes directly, effectively goes directly against my planning fee, goes against my minimum, like I'm already making a dent in the minimum with any assets that I have at Frazier. Maddi: Yep. Yep. Michael: And so in practice, just was it...were there challenges explaining to clients this change in fee model in structure in flat fee versus AUM? How did that conversation go with clients? Maddi: Yeah. Surprisingly a lot better than I thought it would. I think during the transition, I think I lost, I want to say I lost 1 or 2 clients directly related to like, \"Okay, we don't really want to do that.\" The only comment I really heard was I was this kind of small, women-owned business. And so they were a little bit concerned about me joining this kind of larger firm. And so that was a little bit of the conversation that I had. But that was such a small percentage of people. And at the end of the day, I only lost 2 people or 2 households. Everyone else was like... And I explained. It was certainly I positioned it as, which is true, that I was going to have more support, the team approach that we have, all of us are very willing to be helpful. So if something happens to me, or I can't be there, they want to call, there's somebody in the office there that can support them. Michael: Right. Maddi: Of course, the tax piece being huge, too, for some of my clients, certainly not the ones that are many of the HENRYs, but there were some clients were over the long term, they saw the benefit of having even just having the knowledge in the office, right, just having access to a tax professional to ask questions and be around. They saw that being a great thing as well as being able to manage assets held away. I wasn't doing that at Minerva Wealth Planning. Now we do their 401(k)s and any of those types of things. So I think I positioned it in a way where they said, \"I trust you and you're making a sound decision based on what we see here. And I understand that. And yeah, we'll sign.\" What Surprised Maddi The Most About Building A Firm [1:17:37] Michael: So as you reflect on this journey overall, I guess both building your firm and then merging into Frazier and the growth with Frazier, what surprised you the most about just the path of building an advisory business? Maddi: Yeah. I already kind of mentioned, but I think the biggest surprise to me was how quickly clients will...if you do a good job, do the right thing for them and earn their trust, how much they'll trust you and do what you ask of them. The whole transition that I just talked about a moment ago, I can't believe that clients didn't bat an eye. And I brought over, I want to say it was close to 70 clients. For the most part, no one really did question that. They just trusted me blindly because I spent the time getting to know them. It's a really beautiful thing to have that in a profession, that somebody is that trusting of you. That was really shocking. And then of course, kind of the other side of that, that I already talked about too, but how challenging it was. I thought it would be easier to learn all the new things. And it was harder to do that than it was to just get the clients on board and be happy to continue working with you. So I would say that's one. The other thing I'll mention being really surprising is when I started my own thing, so I had worked at a large Fortune 100 company, I started my own thing and I thought, \"I'm going to be talking to clients all day long. I'm a very social, very extroverted person. This is going to be great. I'm going to love this.\" And certainly, I was talking to clients or prospects or people all day long, but I didn't realize, and I know people have said it before on the podcast, but how lonely it is to be a business owner by yourself. It was shocking to me. I couldn't believe how you don't have somebody that's there working towards a common goal with you that you can talk to, that you can ask questions, that you can collaborate with. That hit me hard. And that was part of the reason too, that I think I was seeking something, whether it meant hiring more people or joining another firm. I was just kind of like, \"Wow, I really want that collaboration. I'm used to that.\" That was what most of my career prior was about. And so that was really surprising, was how lonely it is. You really do have to kind of make the effort to talk to other advisors to get some of that need fulfilled in my opinion. The Low Point For Maddi On Her Journey [1:19:56] Michael: So what was the low point for you on this journey? Maddi: Oh, there are many low points, I feel like. Not many, but I guess my point is I think that people experience low points now, last few years, but also all throughout life. I think there'll probably be more. Some of the ones that kind of stand out, I'd say definitely Sydney leaving, because that's really what that...that was the person that used to work with me. It was kind of that point where I was at a crossroads where it was like, \"Okay, I have to hire again. How much do I invest in this person? What type of person do I hire? Do I hire an administrative person? Do I hire a paraplanner?\" All those questions, it was really hard kind of trying to figure out how to do that and where to go. And thankfully, it did end up working out however many months later, but it was a really hard time figuring that out. Michael: How much did it hit you for just the amount of work that had to blow back to you while you were transitioning through that? Maddi: Yeah. I would say you'd probably ask my husband or my daughter, because it felt like I was just working all the time. I don't know how to quantify that, but I will say it was often. It was probably, every weekend. And the funny thing is I didn't have...if you talk to other advisors, I didn't have that many households or clients, but just the way that I was doing things and how much time I put into every plan, and with all the prospecting coming in, it felt like it was a lot on my plate to try to be managing myself. And the other thing I want to mention, because I think it's important is huge, huge low point for me. So when I was at the Fortune 100 company before, I had an amazing boss and she let me and paid for me to take the [Series] 65 before I left, even though she knew it wouldn't be for staying there. She was very kind to let me do that. I'm not the dumbest person in the world. I consider myself somewhat smart. I could not pass the 65. I took it twice, failed both times. And I was down to the last night. I don't remember all the rules on that, but after you fail it the third time, I think you have to wait a year or something. There's some stipulation on how that works. But I failed it twice and was at this, again, kind of a crisis moment of like, \"Well, I'm clearly not capable or smart enough to do this job. How could I not be capable?\" You're kind of questioning yourself and your identity and all the work that you put in. Michael: I'm struck by that. I know by background, you have your MBA, you have your CFP marks, you've done a lot of studying things. Maddi: Yeah. Yeah, no, I don't know. I don't know what it was, if it was like a...what it was. But that 65 killed me. I usually test okay, I test well. But that was the one exam that I could not get through. And I had decided at that point, Michael, this is, \"I'm going out to do financial planning for my previous career,\" like, \"I'm going to go do it now.\" And so it almost felt like a sign. I'm not a superstitious person, but it almost felt like a sign like, \"Oh, my goodness. I'm about to walk out the door and I can't pass this exam. That means I can't...I actually can't do it. So it was a bit of a crisis moment, but thankfully, I was able to get there on the third try. So for anyone listening, I would say like, stick with it. It'll come. What Maddi Would Tell Her Younger Self [1:23:10] Michael: So what else do now you wish you could go back and tell you 10 years ago when you're at the Fortune 100 company considering this transition? Maddi: Yeah. I would say one big thing would be having more patience and understanding and being nicer to yourself. There was a podcast of yours I listened to a long time ago. I cannot remember the gentleman that talked about this, but a lot of us have advisors, we are carrying the weight of our clients' problems with us. I think that was the way he worded it. And I feel that. I feel that a lot. And so when a client asks a question, my instinct is to be like, \"Well, they shouldn't have asked because I should have been proactive enough to provide this before they asked me.\" And so I've tried to learn to just back off a little bit and not be so hard. I think there's a good level of pushing yourself and being better, but not to your own detriment. What we do is hard and is stressful and there's a lot of responsibility. And so we have to kind of give ourselves...we give our clients that same grace. So give ourselves that as well. I'd like to be better. I still struggle with that a little bit, but definitely a little bit less now than I did in the past. The other thing, I guess one more thing I would tell myself is that it's not a bad thing to be the dumbest person in the room. I used to think there was...people have to think you're smarter. They have to think something about you, you have to prove yourself. And I think now as I get older, and I think hopefully wiser, the more you learn, the more you don't...the more you understand that you don't know. And I think that's a beautiful thing. I think you should surround yourself with people that are smarter than you or that know something that you don't know, and continue to learn. So that's another thing that I wish that I would have told myself. I wish that I knew that. Maddi's Advice For Newer Advisors [1:25:07] Michael: Any other advice you would give just younger, newer advisors coming into the profession and pursuing their career? Maddi: Yeah. I would say big thing would be get involved with organizations if you can. So local financial planning association chapters, NAPFA, National Association of Personal Financial Advisors, local groups or trade organizations. Find a mentor ideally if you can. The more people you meet, I think the better position you're in just with different perspectives. And when you're going through hard times, having something to talk through. Michael: Well, I guess I'm struck. Ultimately, the outcome with Frazier and all the good stuff that's happened thereafter, that came from being on your FPA...your local FPA chapter board, right? That's where it started? Maddi: That's right. I would actually go as far as saying that I think every job or role that I've ever had has been somewhat related to my connecting or networking or... And I know people don't love the word 'networking'. It's not to get something out of it, but just naturally putting yourself in a position to meet a bunch of people in your profession or even outside your profession. It does create a lot of value. I think all of my experiences has been due to that for the most part. Michael: It reminds me, Carl Richards likes to call this just increasing your surface area.You have to get out there and expand the surface area to have the opportunity for opportunities to fall in your proverbial lap. Maddi: Yeah. I love that framing. What Success Means To Maddin[1:26:39] Michael: So as we wrap up, this is a podcast about success. And just one of the themes that comes up is literally that word success means very different things to different people. And so you went the successful path of building your firm on your own and now merging into a larger firm and getting to build with them and closing them on $1 billion of AUM. It's like the business seems to be going very well at this point. How do you define success for yourself now? Maddi: Yeah. I knew this question was coming. I've been thinking about it a lot. And I'm kind of a dork about how I think about success and goals and that I'm fairly structured with that. So every year...and I'm also a believer that I think my goals and objectives change often. At least they do for me, probably not for everybody, but they change often for me. So I do kind of that cliché exercise of every year, probably around the first of the year, sit down and try to figure out what is important to me. And it usually is between 2 different arenas. So there's personal and then there are professional, kind of professional arena. And so the way I think about success is I kind of create all of these different objectives for both personal and professional. And then I want to see that I'm tracking. I have specific kind of goals and tactics for each of those. I want to see that I'm tracking towards meeting that overall objective. So to give you an example of one. So on the personal side, I have a goal of feeling healthier and more vibrant. And then I have this nice template I'm happy to share with folks. It's pretty easy to make, but I have the objective and then I have why. And so under why I would have sustained living, ability to travel, feel good, look good, avoid future health costs. And then I have specific goals, 3 specific goals for that specific objective. And so those go across personal, family, relationships and work, and community involvement. So I have 6 different kind of overall objectives and then goals for each of those. And so really what I'm defining as success is looking back at that on a regular basis and saying like, \"I've made some progress. I don't expect to be perfect and meet every single goal, but I do want to see that I'm looking at this thinking about it. It's top of mind and I'm working towards that.\" And I've done this now the last few years and I'll tell you some of the goals stay exactly the same. So there is consistency in what I'm trying to accomplish there. And so I am seeing or feeling some of that success. So that's kind of how I think about it. But it's a moving target. Every year, you also get new goals and things you want to improve on. Michael: And you said there's actually a template that you have for this that you'd be willing to share out? Maddi: Yeah. I created it. Super simple, Excel template. But it allows you to kind of break it down between personal, professional into objectives, and then the 'why' behind the objective. Michael: Very cool. Very cool. So for folks that are listening, this is episode 408. So if you go to kitces.com/408, we'll have a link in the show notes to...I don't know, Maddi, what do you call it? Maddi: I call it the Objectives Template. Michael: The Objectives Template. All right. We will have the Objectives Template in the show notes. So kitces.com/408. I guess just to wrap up, I'm curious, what else is on the objectives list right now? What's the focus for you right now? Maddi: Yeah. So on the personal end, it's about kind of health. So I have some different things, workout-wise, meal-wise, intermittent fasting, things like that, that I'm trying to accomplish on that realm, continuing to learn and foster creativity. So trying to take Spanish lessons and read every month and pick up piano is kind of one of those things. Connect more with loved ones. So scheduling time with people or family I haven't seen is kind of part of that. Starting and maintaining therapy, which I had not done prior to this year actually, but I think it's really important for people. So that was kind of on the personal realm are some of those goals. On the professional side, leaving a legacy with the Financial Planning Association. So I'm currently the president of that organization this year for Central Ohio. And so wanting to do something to further improve that organization at the local level is what I would like to. And there's some specific things like satisfaction surveys and events and things. Expanding my knowledge in financial planning. So kind of continuing that, continuing education and conference schedules, and then improving our FFA operations. So some specifics around improving technology, not having so much outstanding accounts receivable, that type of thing specifically in that realm. Michael: Very cool. And so you said every year, this gets updated, some stay, some move on, and new goals come in, and that's an annual process for you. Maddi: That's right. And I don't expect 100%. So I've told myself basically 80% of these goals is kind of what I'm shooting for every year. But yes, that's right. Michael: Yep. I love it. I love it. Well, thank you so much, Maddi, for joining us on the \"Financial Advisor Success\" podcast. Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Social-Image-FAS-408-2.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2.png\"\u003e\u003cimg decoding=\"async\" title=\"Maddi Keegan Podcast Featured Image FAS\" src=\"https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-300x300.png\" alt=\"Maddi Keegan Podcast Featured Image FAS\" width=\"300\" height=\"300\" srcset=\"https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-300x300.png 300w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-1024x1024.png 1024w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-150x150.png 150w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-768x768.png 768w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-1536x1536.png 1536w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-400x400.png 400w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-800x800.png 800w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-200x200.png 200w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2.png 1667w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-src=\"https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-300x300.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-300x300.png 300w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-1024x1024.png 1024w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-150x150.png 150w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-768x768.png 768w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-1536x1536.png 1536w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-400x400.png 400w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-800x800.png 800w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2-200x200.png 200w, https://www.kitces.com/wp-content/uploads/2024/10/Maddi-Keegan-Podcast-Featured-Image-FAS-408-2.png 1667w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003eWelcome everyone! Welcome to the 408th episode of the \u003cstrong\u003eFinancial Advisor Success Podcast\u003c/strong\u003e!\u003c/p\u003e\n\u003cp\u003eMy guest on today\u0026#39;s podcast is Maddi Keegan. Maddi is a Financial Advisor and the Director of Operations of Frazier Financial Advisors, an RIA based in Columbus, Ohio that oversees $860M in assets under management for 650 client households.\u003c/p\u003e\n\u003cp\u003eWhat\u0026#39;s unique about Maddi, though, is that after building a successful solo advisory firm, she then decided to merge her business with Frazier Financial Advisors, a mid-sized RIA in her area where she negotiated for a stake in the business while stepping into both an advisor and operational role where she could really have impact in helping them to scale to the next level.\u003c/p\u003e\n\u003cp\u003eIn this episode, we talk in-depth about how Maddi, after successfully establishing and building her own solo firm, made the decision to merge her firm with a larger (but not too large) firm and negotiated the \u0026#39;2-way\u0026#39; street of sharing her knowledge while also absorbing the way of Frazier Financial, how Maddi charted the size and worth of her (solo) firm against Frazier Financial\u0026#39;s (multi-advisor) firm to allow for an equitable 18-month transition into Frazier, and how Maddi\u0026#39;s 3 non-negotiables of company culture, equity, and base compensation shaped how Maddi negotiated a package that she \u0026#39;felt\u0026#39; acknowledged the full spectrum of her value, from existing clients to knowledge of large business operations, that she brought to the table.\u003c/p\u003e\n\u003cp\u003eWe also talk about Maddi\u0026#39;s own unique journey from working at a Fortune 100 company to launching as a solo advisor to now being a director at her firm, including how, as a solo advisor, Maddi invested just $1,500 in improving her SEO strategy at her firm by leveraging better keywords and gathering Google Reviews and soon managed to get over 50% of her new prospects coming from Google instead of referrals, how Maddi\u0026#39;s experience of mentoring, hiring, and eventually losing her first (contractor-turned-)employee made Maddi reflect on what she really wanted out of building her own firm (and ultimately decide that she didn\u0026#39;t want to continue to build alone), and how Maddi explained her decision to close her business and merge with Frazier Financial to her existing clients, highlighting it as an expansion of resources and opportunities for her and her clients, ensuring that she was ultimately able to bring all but 2 of those clients along with her.\u003c/p\u003e\n\u003cp\u003eAnd be certain to listen to the end, where Maddi shares how Frazier Financial positions \u0026#39;at cost\u0026#39; tax preparation as a value proposition (to clients who actually don\u0026#39;t really need a further discount, but are instead just eager to delegate), how Maddi looks to build out her firm\u0026#39;s tech stack to get Frazier Financial though the \u0026#39;dangerous middle\u0026#39; of growing and scaling the business, and why Maddi believes that the most powerful thing an up-and-coming advisor can do is network and build good connections with those around them to open more doors, as she reflects on how being a volunteer leader in her local FPA chapter was the introduction that led her to the firm she\u0026#39;s at today.So, whether you\u0026#39;re interested in learning about how to frame big changes as opportunities for clients (who may not mind those \u0026#39;big changes\u0026#39; very much anyway), how to build holistic personal and professional goals and actually make progress year over year, or how to evaluate and negotiate a broad variety of career opportunities, then we hope you enjoy this episode of the Financial Advisor Success podcast, with Maddi Keegan.\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" width=\"200\" height=\"200\" src=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg\" alt=\"Michael Kitces\" decoding=\"async\" srcset=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-300x300.jpg 300w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-768x768.jpg 768w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-800x800.jpg 800w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP.jpg 1022w\" sizes=\"(max-width: 200px) 100vw, 200px\" data-src=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-300x300.jpg 300w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-768x768.jpg 768w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-800x800.jpg 800w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP.jpg 1022w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eMichael Kitces is Head of Planning Strategy at \u003ca href=\"https://buckinghamstrategicwealth.com/michael-kitces?utm_source=Kitces\u0026amp;utm_medium=KitcesReferral\u0026amp;utm_campaign=ForConsumers\u0026amp;utm_id=Kitces\"\u003eBuckingham Strategic Wealth\u003c/a\u003e, which provides an evidence-based approach to private wealth management for near- and current retirees, and \u003ca href=\"https://buckinghamstrategicpartners.com/kitces/?utm_source=Kitces\u0026amp;utm_medium=KitcesReferral\u0026amp;utm_campaign=ForConsumers\u0026amp;utm_id=Kitces\"\u003eBuckingham Strategic Partners\u003c/a\u003e, a turnkey wealth management services provider supporting thousands of independent financial advisors through the scaling phase of growth.\u003c/p\u003e\n\u003cp\u003eIn addition, he is a co-founder of the \u003ca href=\"https://www.xyplanningnetwork.com/\"\u003eXY Planning Network\u003c/a\u003e, \u003ca href=\"https://advicepay.com/\"\u003eAdvicePay\u003c/a\u003e, \u003ca href=\"https://www.fppathfinder.com/\" target=\"_blank\" rel=\"noopener\"\u003efpPathfinder\u003c/a\u003e, and \u003ca href=\"https://newplannerrecruiting.com/\"\u003eNew Planner Recruiting\u003c/a\u003e, the former Practitioner Editor of the Journal of Financial Planning, the host of the \u003cem\u003eFinancial Advisor Success \u003c/em\u003epodcast, and the publisher of \u003ca href=\"https://www.kitces.com/blog/\"\u003ethe popular financial planning industry blog \u003cem\u003eNerd’s Eye View\u003c/em\u003e\u003c/a\u003e through his website \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e, dedicated to advancing knowledge in financial planning. In 2010, Michael was recognized with one of the FPA’s “Heart of Financial Planning” awards for his dedication and work in advancing the profession.\u003c/p\u003e\n\u003cp\u003eRead all of Michael’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=13\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\" target=\"_blank\" rel=\"noopener\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cbr/\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eNever miss a Financial Advisor Success podcast episode! Get notified of the latest episodes (and all our research as it’s released!) directly via email:\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\u003c/div\u003e\n\t\t\t\n\u003ch2 id=\"resources-featured-in-this-episode\"\u003eResources Featured In This Episode:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eMaddi Keegan: \u003ca href=\"https://www.frazierfinancial.com\"\u003eWebsite\u003c/a\u003e | \u003ca href=\"https://www.linkedin.com/in/maddi-napier-keegan-cfp%C2%AE-mba-fsri-598228141/\"\u003eLinkedIn\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.kitces.com/maddi-keegan-objective-template/\"\u003eObjectives Template – Download (Excel)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"http://www.minervawealth.com\"\u003eMinerva Wealth Planning\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.upwarddigitalmarketing.com\"\u003eUpward Digital Marketing\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://wealthtender.com\"\u003eWealthtender\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.rightcapital.com\"\u003eRightCapital\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.moneyguidepro.com/ifa/\"\u003eMoneyGuidePro\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://geowealth.com\"\u003eGeoWealth\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.tamaracinc.com\"\u003eTamarac\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eLooking for sample client service calendars, marketing plans, and more? \u003c/em\u003e\u003cem\u003eCheck out \u003ca href=\"https://www.kitces.com/fas-resources/\"\u003eour FAS resource page\u003c/a\u003e!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAre you a successful financial advisor, or do you know of one that would be a great fit for the Financial Advisor Success podcast?\u003c/em\u003e \u003cem\u003e\u003ca href=\"https://www.kitces.com/podcast/#apply-recommend\" target=\"_blank\" rel=\"noopener\"\u003eFill out this form\u003c/a\u003e to be considered!\u003c/em\u003e\u003c/p\u003e\n\u003ch2 id=\"full-transcript\"\u003eFull Transcript:\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Welcome, Maddi Keegan, to the \u0026#34;Financial Advisor Success\u0026#34; podcast.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Thanks so much for having me. Appreciate it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I\u0026#39;m really excited about today\u0026#39;s conversation and exploring what to me is a really interesting dynamic in our industry that I feel like there\u0026#39;s this sort of tendency and arc for advisors to skew towards independent channels over time. I think it\u0026#39;s just some element of the longer that we do this, the more clarity we get about what we want to do and how we want to serve clients. And then you tend to skew towards places that give you more autonomy to kind of do what you want and serve clients the way that you believe that they should be served.\u003c/p\u003e\n\u003cp\u003eSometimes that leads to independent advisory firm channels. Sometimes that goes as far as like I\u0026#39;m just going to hang my own shingle and literally do my own thing my own way. But I find as firms go out on that spectrum, rarely do they go back the other direction. Very few advisors who hang their own shingle ever go back to work in mid- or large-sized firms once they\u0026#39;ve been out on their own. And I know you have followed a different path. You went out on your own, hung the shingle, did that for a while, and have now decided to merge back into a larger firm – or even, I would say, a mid-sized firm, just not one of the mega roll-ups, but a local firm where you can actually be a meaningful part of the business as a partner of the firm. And so I\u0026#39;m just excited to talk about this journey and progression of what leads you to go out and hang your own shingle and then what leads you to make a change and say, \u0026#34;I think I\u0026#39;d rather be a partner in a larger firm and not running my own shop at this point.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. Definitely a lot of twists and turns throughout my career. It wasn\u0026#39;t all part of the plan, but happy to chat through all that.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Tax Preparation As Value-Add [04:59]\" id=\"why-frazier-financial-advisors-uses-tax-preparation-as-a-lowprofit-valueadd-459\"\u003eWhy Frazier Financial Advisors Uses Tax Preparation As A \u0026#39;Low-Profit\u0026#39; Value-Add [4:59]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So I think to get us started, why don\u0026#39;t you just tell us about the advisory firm that you\u0026#39;re in as it exists today? Let\u0026#39;s understand the context of the business now and then we can talk a little bit about the journey and path in getting here.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Sure. So the firm, it\u0026#39;s called Frazier Financial Advisors. We\u0026#39;re in Central Ohio. We have clients all over the country in more than 35 states, but we\u0026#39;re centrally located here. All our folks are located here as well. We have 17 full-time people. We have a tax practice in-house. That\u0026#39;s a thing that I think is a little bit unique, is having that be part of our firm. And then in terms of, I know our industry uses AUM as a measure, so we have about $860M under management. We really like to think about it though when we talk about it on our website or to our clients about what the client investment profits or what they\u0026#39;ve benefited in working with us. And so that number is $280M at this point. We have some milestones out there that we like to share on that.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Wait, wait. What\u0026#39;s 280 million?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e So that\u0026#39;s client investment profits. So the net investment and then where our AUM is today. So we talk about it to clients as their investment profits rather than what is our AUM. We don\u0026#39;t really share our AUM necessarily with clients.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Oh, interesting. So looking back cumulatively of all the dollars that clients brought into the firm, this math sounds to me like they\u0026#39;ve deposited $580 million with you and it\u0026#39;s at 860 million today because you\u0026#39;ve grown that by $280 million cumulatively.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e That\u0026#39;s right. That\u0026#39;s right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Interesting. And so that\u0026#39;s how you market it. That\u0026#39;s how you put it out on your website as like firm positioning and value proposition.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. Yeah. We try to think about it from the client perspective and their lens and not wanting to make it about us, but being able to make it about how we can help them over the long term. We got registered in 1997 and so kind of what that trajectory has looked like and what we\u0026#39;ve been able to do for them and help them with their retirement or what have you. So yeah, we\u0026#39;re proud of that number. That\u0026#39;s how we talk about it externally.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I guess just my brain goes to this, I can\u0026#39;t help, but are there compliance challenges that crop up with that? I feel like so many of us are used to talking about things like returns if you say any numbers and obviously the SEC really scrutinizes any time you talk about anything returns related. Have you had compliance complications or implications from this or has that worked fine for you?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e We have not. And I would say we also don\u0026#39;t position the conversation to say you can expect a certain amount of return. It\u0026#39;s more of just look at what you\u0026#39;ve invested and then look at how we\u0026#39;ve helped you grow, look at how our firm has helped you grow over the last 10, 20, 30 years. So no, we haven\u0026#39;t had any issues with that at this point.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e There is sort of an interesting, it really doesn\u0026#39;t promise any particular return or expectation, which as you know, that\u0026#39;s where regulators get really concerned. As you said, here\u0026#39;s a cumulative impact report.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Interesting. Interesting. And then how many clients is it just that the firm\u0026#39;s serving overall?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. So we have a little under 700 households. Some of those households are family members of clients or it\u0026#39;s a little bit probably overstated, but right around 700 or less than 700 is how many households, kind of how we think about it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And then can I ask from a revenue perspective just what it adds up to for the business?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e So I can tell you our fees from the advisory business are about 88–90% of our overall because we do have that tax practice and a little bit of insurance. For 2024, we\u0026#39;re projected to be around $7 million total, but that includes the other fees as well.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So you are now a little over 6 million in core advisory and almost 1 million of tax and insurance and the other ancillary pieces that layer in. So I guess I\u0026#39;m curious from that perspective, is tax a small niche thing you do for some clients? Is it something that you do for all clients in the firm? Do you charge separately? Is it bundled in? How does it work as it\u0026#39;s attached to the rest of the business?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. It is a separate fee. So our clients kind of pay us on the advisory side and then they also pay us for the actual tax filing and preparation. We don\u0026#39;t require our clients to use us for doing taxes. Most of our clients want to have kind of a one-stop shop and be able to do it all in one place. There\u0026#39;s a lot of financial planning opportunities that come from tax planning and so it\u0026#39;s just kind of a nice thing to have. And so I would say that the majority of our clients do use our tax services, but it is not a requirement. We tell them that day one. But we do, I will say the kind of talking through and doing tax efficiency planning is part of that financial planning engagement that we have with you. And then separately, there\u0026#39;s the filing fee every year that you would pay for the actual return. It could be done.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So do you have a sense of how many clients use or how many returns you have to plow into during tax season every year?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. I want to say I don\u0026#39;t know the exact number, but I want to say it was a little over 500.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Wow. Returns that you prepared. So a lot of returns. That\u0026#39;s a lot of returns.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e A lot of returns. It is a busy, I was going to say, entire year because we have a lot of extensions too. So it\u0026#39;s a busy office, especially around tax time.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So what fee level do you set for this?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e So for the tax filing, it is really anywhere between $600–$1,500 depending on complexity. So we kind of look at... Because we do have some small business owners that require a little bit of extra work. And if it\u0026#39;s a larger business, it might be even a little bit more than that. But the vast majority of the clients kind of fall somewhere [in that]. And we tell them somewhere between $600 to $1,500 with most clients kind of falling right around the $1,000 range for the tax prep and filing.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so it sounds like there\u0026#39;s not any particular discounting because you\u0026#39;re a client of the firm, you get this favorable price. It sounds like you\u0026#39;re just trying to quote it like it is what it is. This is the cost of the work given the stuff that\u0026#39;s going on in your life.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e That\u0026#39;s right. Yep. We\u0026#39;re trying to compensate for the hours that our tax team is working. There are some nice synergies being a tax client. So I think clients do get some benefit in having both a financial planning relationship and a tax relationship with us. But to your point, it\u0026#39;s totally separate and it\u0026#39;s based on the hours that we work on that return.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So how do you position it with clients? Because I get there is a version of you should do all this stuff together with us because it\u0026#39;s cheaper. You get a deal. It\u0026#39;s bundled. It\u0026#39;s volume-priced, all that. But it doesn\u0026#39;t feel like that\u0026#39;s really the angle here. It doesn\u0026#39;t sound like you\u0026#39;re trying to do it from the perspective of if you bring everything under one roof with us, it\u0026#39;ll cost you less to get your return done because you\u0026#39;re still trying to charge fair value for what it takes to prepare a return these days.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. So I think it comes down to just the ease of working. So the primary advisor is the one actually kind of quarterbacking the entire tax return if they\u0026#39;re doing taxes with us, even though they\u0026#39;re not actually filing it. They\u0026#39;re the person talking to the client, getting everything they need and then kind of communicating what\u0026#39;s going on, letting them know what to expect. So I think the way we\u0026#39;ve messaged it is just saying like, \u0026#34;This is really easy for you. It is a separate fee, but you get to work with, if I\u0026#39;m your primary advisor, you get to work with me all year long and then I\u0026#39;m kind of the person keeping you in the loop. You don\u0026#39;t have this other entity or company that you\u0026#39;re working with. And this kind of helps lead into some financial planning conversations. We could talk long term about how to save you on taxes or what this looks like long term or into your retirement.\u0026#34;\u003c/p\u003e\n\u003cp\u003eSo that has seemed to... We haven\u0026#39;t gotten a lot of pushback. You\u0026#39;re always going to have some folks that are like, \u0026#34;No, I can do it myself or find it for less.\u0026#34; And that\u0026#39;s another prerogative. That\u0026#39;s okay. But a lot of our clients really are, I would say, extreme delegators and they really don\u0026#39;t want to have to keep track of another entity or person or company that is doing it. So that\u0026#39;s been attractive to them.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And does that ever create any conflicts or competition for you with the other CPAs in town? Do you get CPAs that don\u0026#39;t want to refer to you because you do taxes too, or CPAs you win business away from that are then unhappy that you took their tax clients? \u003cem\u003eDoes that crop up? Is that an issue for you?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e I don\u0026#39;t think so. And there are still, I would say, some prospects or even clients that don\u0026#39;t have much complexity at all. They just have a W-2 and that\u0026#39;s really it. We\u0026#39;re probably not the best fit. So while most of our clients we are, we will sometimes refer out. We have a couple of local tax professionals that we\u0026#39;ve referred out to before. So I haven\u0026#39;t really seen that myself personally of that kind of feeling that the competition with other CPAs, because we\u0026#39;re also we\u0026#39;re also not trying to get any tax clients that are not our financial planning clients. So I should say we don\u0026#39;t put ourselves out there as a tax firm trying to find clients. It\u0026#39;s more of we\u0026#39;re a financial planning firm and we have this nice service in-house and full-time tax professionals to help us with the planning.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Interesting, because I guess that is a good framing. So then is there a mentality overall just in how the firm thinks about the tax business in this context? Is it additional profits because ultimately tax business has some profitability to it? Do you just try to run it to break even because you\u0026#39;re hoping it retains more core clients? If it retains more core clients, it\u0026#39;s more profitable to get retention there than it is to get profits on the tax business. How do you think about it from the business end? Where does it fit into the picture?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e I think we think of it more of kind of a value add on the financial planning side. I don\u0026#39;t know for certain, but I do think we profit a little bit. But I don\u0026#39;t think we\u0026#39;re thinking of it as a way to profit. We\u0026#39;re not thinking of it that way. We\u0026#39;re thinking of it as this is a really nice benefit to have this expertise in house to help us and our clients throughout the year. So I would say we\u0026#39;re probably pretty close to a break even if I had to guess.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Yeah. Well, I just think about it overall. Even at hundreds of returns, if the average fee is around $1,000, it\u0026#39;s $0.5 million business if you\u0026#39;re making 10 or 15% profitability on it, it\u0026#39;s tens of thousands of dollars of profits. That\u0026#39;s not a bad thing, but 500 returns is a lot of work to make tens of thousands of dollars of profits on a business that does $6M of AUM.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Right. It doesn\u0026#39;t really feel like that becomes a big profitability engine at that point.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah, exactly. And it\u0026#39;s why we also don\u0026#39;t really want tax clients unless we\u0026#39;re kind of doing the whole deal.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Right. So how do you handle this from a staffing perspective? In-house? Outsource? Just who does 500-plus returns?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. So mostly in-house, we have 2 full-time...well, 3 full-time tax professionals, one of which is our tax partner that kind of leads the tax team. And then during the actual tax season from January to April, we do have a couple of part-time contractors that come in to help just from January to April. But we do have 3 full-time staff, 2 of which are CPAs that are doing taxes for us.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So 1 tax partner, 1 CPA, and 1 tax-support professional.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. Enrolled agent. So actually filing, but not a CPA.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And so what do they do the other 8 months of the year out of tax season? I say that tongue in cheek, there\u0026#39;s extensions and other stuff, but just I feel like there\u0026#39;s this mentality of, \u0026#34;Okay, tax season is really busy during tax season. But if you have full-time people, what do they do the other 8 months of the year?\u0026#34; How do you keep them busy and productive as a firm?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e So I would say, so we do a lot of extensions. We do have quite a few businesses that we\u0026#39;re working with. So we really are working, right now getting close to the 9/15 deadline for S Corps and then the 10/15 coming up, our tax team is still working on some returns that are for 2023. So really, it takes us into the fall. I should say as well, we kind of we kind of position it with our clients as well, if there\u0026#39;s any level of complexity, we\u0026#39;re wanting to extend. It\u0026#39;s not a bad thing as long as they know that that the payment is made if they\u0026#39;re going to owe that it\u0026#39;s done by April 15th. They\u0026#39;re totally fine with that expectation. So we do extend. I wish I knew the exact number, but it\u0026#39;s a large amount of our returns are extended in the first place. So they\u0026#39;re working pretty much through 10/15.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Interesting.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So priority-wise, as you prepare, it\u0026#39;s like the simple ones get done by April 15th and everyone else just gets told like, \u0026#34;You\u0026#39;re going to be on extension, we\u0026#39;re going to spend the next 4 or 6 months getting this sorted out. Let\u0026#39;s just prepare the expectation upfront.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e That\u0026#39;s right. That\u0026#39;s right. And then the last couple of months, we are pretty heavy on... Most of our primary advisors will know and want to do projections for their clients. And so we do projections pretty much the last couple of months, the tax team is busy getting ready for the next tax year. So there is plenty of work to go around.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So I guess I\u0026#39;m almost envisioning 3 seasons, 3 uneven seasons for the tax team. You get January through April, we\u0026#39;re in traditional tax prep cycle for April 15th, you get extension season, which is all the complex returns, which might be the majority of the returns that runs another 6 months from mid-April to mid-October. And then you get season 3 is a 2.5 month season of, okay, now let\u0026#39;s do all the end-of-year tax projections for the loss harvesting, the gains harvesting, the Roth conversions, right? All that end of year tax planning stuff that we do that crops up there and then you repeat the cycle.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. That\u0026#39;s right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Interesting. Well, I guess how long have you been doing the tax preparation internally?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e So this goes all the way back. Our founder, Jim Frazier, who started the RIA back in \u0026#39;97, he was a CPA turned advisor. And so he kind of started this with the tax practice and then said, \u0026#34;Oh, I can\u0026#39;t help these clients that are showing me everything that\u0026#39;s going on and they\u0026#39;re tax attorneys. They\u0026#39;re talking about their broker. I could help them do this a little bit better.\u0026#34; And so that\u0026#39;s how he kind of decided ultimately to launch the RIA in \u0026#39;97. And so we have always had tax in-house.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So notwithstanding, I feel like this has become a more popular thing in recent years for firms looking to bring tax preparation in-house. This was basically from the start for you because you\u0026#39;re founded by a CPA who came over to the financial planning side.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. Yep.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Interesting. Which I guess also helps to clarify why you\u0026#39;re not trying to grow it as a standalone tax practice and tax business because that\u0026#39;s what Jim was leaving to make the advisory firm in the first place. So thus, it\u0026#39;s a wonderful value add for clients, but I\u0026#39;m not trying to scale up a tax practice because I left that to make an advisory firm.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. Yep. You\u0026#39;d have to ask him, but yes, that\u0026#39;s my understanding.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Building Minerva Wealth Planning [21:45]\" id=\"how-maddi-built-minerva-wealth-planning-2145\"\u003eHow Maddi Built Minerva Wealth Planning [21:45]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So now help us understand your path to Frazier. So what were you doing before and how did you come to the firm?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. So I had my own RIA, Registered Investment Advisory firm in Central Ohio that I had started in 2019, Minerva Wealth Planning. And so I was kind of out there doing my own thing and working with my clients. And I had no intention of when I ended up joining them in 2023, in May of 2023, I never thought I would not continue to work for myself and be able to kind of have flexibility and control everything and have my own business and own 100% of it. That was not the plan, but I had an employee for a couple years when I was at Minerva Wealth Planning, and she ended up wanting to get out of the business completely, didn\u0026#39;t want to be in the business anymore, in the profession anymore in October of \u0026#39;22.\u003c/p\u003e\n\u003cp\u003eSo at that time, I was a few years into my business, I was finally getting some decent traction, getting quite a few clients per month. And so I was at a place where I was like, \u0026#34;Crap. I had this person that I thought was going to really kind of help me take this to the next level and become an advisor.\u0026#34; She took the CFP track at Ohio State. And so before she started working for me, so I was like, \u0026#34;This is great. We\u0026#39;re going to go forward and be able to work together.\u0026#34; And then she was like, \u0026#34;I don\u0026#39;t want to do this anymore.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd, of course, I was like, \u0026#34;Oh, are you sure? How can I help develop you? This is a great profession to be in.\u0026#34; And she\u0026#39;s like, \u0026#34;I just don\u0026#39;t want to do this. And I want to move to Texas.\u0026#34; And I was like, \u0026#34;Okay. Great. I\u0026#39;m happy. I\u0026#39;ll support you,\u0026#34; and still have a great relationship with her. But it did kind of bring me to this point of this crossroads where I was like, \u0026#34;Okay, I\u0026#39;m bringing in too much for me to handle on my own.\u0026#34; So I kind of started to figure out like, \u0026#34;Do I hire a virtual assistant? Do I try to hire a paraplanner, a virtual paraplanner? How do I solve this issue of getting too many...having too much to do and not being able to do it kind of on my own?\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd so that was in October. I was having lunch with one of the partners of Frazier Financial, Brian Houts, in January of \u0026#39;23. And we knew each other because we were both on the board of the Financial Planning Association of Central Ohio. So they got together every so often and chatted and talked about our businesses. And I was complaining, I was kind of just unloading about I didn\u0026#39;t know what to do and I was really thinking this was going to work and she was going to be a partner of mine, and all this stuff.\u003c/p\u003e\n\u003cp\u003eAnd he was like, \u0026#34;Well, why don\u0026#39;t you come work at Frazier Financial?\u0026#34; That was kind of the thought, first thought. And I was like, \u0026#34;Oh, no. I don\u0026#39;t want to do that. I\u0026#39;m happy. I\u0026#39;m not trying to leave. This is what I want to do. This is what I chose to do. I decided to do this.\u0026#34; And he\u0026#39;s like, \u0026#34;Well why don\u0026#39;t you get to know us a little better? Why don\u0026#39;t you come get to meet some of the other partners, meet some of our employees, spend some time with us, kind of like date us, and then you can kind of make a decision if you don\u0026#39;t think...? No pressure, but get to know us and maybe you\u0026#39;ll change your mind.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd I\u0026#39;ll kind of get into all the reasons, I\u0026#39;m sure. So that was kind of the impetus, the start of this whole conversation. And so I started spending some time with them and the partners there and some of the employees and going into the office and meeting folks, and yeah, ended up kind of wanting to move there.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e All right. So I want to get further into the dating process in a moment, but I\u0026#39;m also just curious to hear more about what happened with this lovely person that just ultimately decided they didn\u0026#39;t want to stay. So can you share more context? What did she come to do for the firm originally? What was her situation and context as she was seeking you out in the first place?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. So I found her, I was doing some work with Ohio State. She was a senior about to graduate from Ohio State. This was back in end of 2020, beginning of 2021. And so I got connected with her and was like, \u0026#34;Oh.\u0026#34; She was doing the CFP tracks, said she wanted to be in financial planning. And so I hired her as an intern and I think she was doing maybe 5 to 10 hours a week for me. And she was pretty much doing some administrative tasks like putting stuff into the CRM that I was using at the time and kind of doing some reporting on birthdays, stuff that was kind of helpful for me, but some administrative stuff that took a few hours a week. And then as we got closer to the end of her semester and also when she was going to graduate, I was like, \u0026#34;Oh, this help is actually great. I would love to consider hiring her full-time.\u0026#34; Looking back now, it was probably a little bit early in terms of revenue for Minerva Wealth Planning.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I was going to say, where was your business at this point, if you recall, like clients or revenue?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. So, let\u0026#39;s see. This is beginning of 2021. I want to say that year, total revenue, I think, was around $120,000. And I was paying her, I think, $40,000 once she was full-time. So I\u0026#39;m like...\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. That\u0026#39;s like new college grad starting job, entry-level position.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Right. I can\u0026#39;t remember it now, but there were some things in there for bonuses if she did certain things, but I know her base was $40,000. So it was probably a little early, but I was like, \u0026#34;I know I want to grow this business. I don\u0026#39;t want to be kind of a... I know that I want to grow, I guess.\u0026#34; And so I was like, \u0026#34;I\u0026#39;m going to invest early.\u0026#34; So before she graduated, I had offered a position to come work full time and to kind of help me with some, continue to do some administrative stuff, to sit in client meetings and take notes and to be able to kind of see how financial planning works. And she said yes, thankfully. And so worked for me.\u003c/p\u003e\n\u003cp\u003eAnd most of what she did was super helpful. It was having her pretty much in every single meeting that I have with clients. So before, she would help me prep agendas. So I\u0026#39;d kind of talk about the client and what we were going to cover. She would prepare a really nice agenda. She would take all of the notes during the meeting and then she would send all the follow-up afterwards with my oversight. So she was doing that and then she was continuing to do some of the administrative tasks within the company.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So you didn\u0026#39;t necessarily hire her into, at least as I would characterize, a paraplanner, associate advisor role, like do a bunch of the planning work for all these clients. She was doing all the core administrative support work and freeing you up to do all the planning stuff for this growing client base.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. That\u0026#39;s right. Towards the end, she was doing a little bit more, getting a little bit more into some of the planning. But for the most of the time she was there, yeah, it was more of the administrative stuff. Yep.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And do you recall at all just how many clients you were at at this point, how many you were juggling?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. So 2022, I think was our biggest growth year. I want to say I was somewhere around 35 to 40. So not a ton, but it was kind of at that place where I didn\u0026#39;t have... I kind of wish I would have spent a little bit more time building out workflows and stuff. I didn\u0026#39;t really have great processes. And so I was kind of trying to figure all of that out.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Well, nobody really does at that stage, unless you\u0026#39;re just one of those people that is naturally wired for system and process, like that you can\u0026#39;t help but make them everywhere that you show up. I find for most firms, as we\u0026#39;re at this stage, this is just the getting-stuff-done stage. And once you get north of 25 or 30 clients, there\u0026#39;s just a lot of stuff to get done and it helps to have another person to help get stuff done. Like, \u0026#34;I don\u0026#39;t have a formal workflow process, just like this needs to be done by Friday. Figure it out.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Right. Right. That\u0026#39;s right. Exactly.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Pulling In More Prospects [30:02]\" id=\"how-maddi-overhauled-her-marketing-to-pull-in-more-prospects-3002\"\u003eHow Maddi Overhauled Her Marketing To Pull In More Prospects [30:02]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So you guys, I guess you go your first year with your getting-stuff-done person and it goes well. You continue the second year. And I think you said 2022 was your bigger growth year. Is that connected or coincidence? Like I got the person and it left me up to do more marketing and we grew more, or is this simply the business was building momentum because you\u0026#39;d been going several years now?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Probably a bit of both. I will tell you, I was spending a lot more time, definitely in 2022, a lot more time prospecting or having conversations with prospecting or being out around there. So I think that kind of freeing me up to do that definitely had an impact, definitely had an impact. But at the same time, and I can talk about this too, I did a little bit of marketing and SEO stuff with my firm around the same time and ended up kind of having a little bit of spike of people reaching out to me online as well. So I think there\u0026#39;s probably a combination of things.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e What did you do that spike people reaching out online? That sounds lovely.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e So I guess there were 2 different groups that I ended up hiring. I wasn\u0026#39;t spending a lot of money. It wasn\u0026#39;t super sophisticated or anything like that. But I had hired a local firm. I can get the name. I can\u0026#39;t remember. They\u0026#39;re local here to Central Ohio, but they basically helped me rewrite my website. And so they kind of made it sound a lot better than what I could have done on my own.\u003c/p\u003e\n\u003cp\u003eAnd we actually added in this kind of interesting thing that I got a lot of traction with, which was you could request a less than 5-minute video from me, and you would put in a couple of factors. So I think it was your first name, your income, what investment assets you have, a couple of basic things about yourself. And then I would create a kind of an educational...and I would call it an educational video. I can\u0026#39;t give advice. And I had all the disclosures saying I can\u0026#39;t give advice. But it was kind of this quick video where I could lock eyes virtually – obviously not real-time – but lock eyes with these people and say, \u0026#34;Hi, thanks for submitting your information. I see that you don\u0026#39;t have any type of investment assets, but you have this high income. Maybe you should think about what you\u0026#39;re doing with excess dollars.\u0026#34; It was kind of just a little educational series. And so they had encouraged me to put that on the website. And that was...yeah, I was getting more of that coming in. That was an interesting idea.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Interesting. So I get it. Just prospects at the end of the day are just trying to figure out, \u0026#34;Are you a good person? Can I trust you? Can I relate to you? Are you going to explain things well that I like working with you?\u0026#34; And so they get a taste in their individual contexts and circumstances, not advice, etc. But they get a little bit in their specific context and circumstances to figure out, \u0026#34;Okay. When Maddi talks to me, does this feel like someone that I would want to be in an ongoing advice relationship with?\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. That\u0026#39;s right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So I\u0026#39;m presuming then, you send the video and then there\u0026#39;s some follow up of like, \u0026#34;And if you\u0026#39;d like to work together on an ongoing basis, please go here to fill out a prospect meeting.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. That\u0026#39;s exactly right. That was to get something scheduled just to chat real time with them. People meeting the first time after that video was pretty high. I would say 80 to 90% of people that got a video would set up the next meeting. Ultimately, getting to the finish line of signing on wasn\u0026#39;t that high, but getting to the next step was very high. And then a decent chunk ended up also signing up.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Interesting. So it sounds like the process from prospect to close wasn\u0026#39;t necessarily improved, but the ability to get a bonafide prospect intro, get-to-know-you meeting was higher.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. Very cool.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. Yeah. So that was one of the things I did. And then the other thing I did right around there was I hired another local firm, Upward Digital Marketing, to do just an SEO audit. And so it was super inexpensive. At the time, like I said, I didn\u0026#39;t want to spend a ton of money. I think it was 500 bucks. And they looked over everything after I had redone my website. And they basically just gave me some key things to think about or to do like having or getting Google reviews, or...and we can talk...I had Wealthtender, kind of the reviews and how that works. But they had 5 or 6 different things they wanted me to do. In blogs, they wanted me to use certain words. So they kind of put that out there. And then I just kind of went in and did the things they told me to do. And so towards the probably last 6 months to a year, I would say a lot of the people that were coming to me were not referrals. They were people from Google or from the website. They were not referrals, which is kind of uncommon in our industry.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So then can you explain a little more what were the SEO things you were doing that seem to have actually had an impact and literally were making referrals or making results...or sorry, making not referrals, making Google searches?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Definitely reviews was a huge one. I\u0026#39;m not sure if you\u0026#39;ve got there, I\u0026#39;ve heard of Wealthtender, but it kind of allows you to check the box on all the rules around testimonials for our profession. And so I had adopted Wealthtender. And then I also requested every single client to fill out a Google review. And so made sure that I had all my i\u0026#39;s dotted and t\u0026#39;s crossed on making sure that I wasn\u0026#39;t cherry picking and everybody got access to it and just had asked everybody to do that. That was probably the biggest, from what I recall, that was kind of the biggest thing that I did that helped.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Because then people are like, they\u0026#39;re searching for your firm, they find the Google reviews.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. Yep. I think the guy that I worked with for SEO, I think he even emailed me, I was looking back through my emails, and I went from the top of page 3 on Google to the top of page 2 within...it was a short period of time.\u003c/p\u003e\n\u003cp\u003eThere were some keywords, financial advisor, kind of some of the main ones, but putting woman, putting woman-owned or putting something about women. A lot of people found me and wanted to work with a woman.\u003c/p\u003e\n\u003cp\u003eI also kind of had a little bit of a small niche within my firm of working with small business owners. And so there was some language I\u0026#39;d put in there about being a woman-owned business and working with small businesses and woman-owned small businesses. So there are a couple different kind of words I tried to put into the website, as well as in your blogs, if you kind of...and again, I\u0026#39;m not going to speak intelligently to this, my SEO person certainly could, but they gave me some kind of specific things to do with words and kind of continuing to add those to different blog posts so that it would kind of pull you further up on that search list.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And I guess just curious, how do you know it was the Google reviews that were working? Were you literally finding prospects come in and say, like \u0026#34;I wanted to reach out to you, because I saw you had really good Google reviews,\u0026#34; and there it is?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e It wasn\u0026#39;t super precise. I did ask every prospect how they found me. And about 50% of them were saying they found me on Google. There were a few that were saying that they had seen that I had good reviews. I can\u0026#39;t remember the exact amount, but that wasn\u0026#39;t the primary driver. But it was very clearly, I remember being surprised kind of towards the end of being at Minerva Wealth Planning, that so many people that were coming to me were virtual from all over the country and were finding me on Google. And it wasn\u0026#39;t...yeah, it wasn\u0026#39;t.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And this is all for a $500 SEO audit, and then just doing the things that they said.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. I think part of it maybe was just luck too, because I don\u0026#39;t know that that\u0026#39;s normal, how people can expect that. But I think I spent $1000 on the website design and then I spent $500 on the SEO stuff. So not a significant amount of investment.\u003c/p\u003e\n\u003ch2 data-nav-title=\"What Prompted Maddi To Merge [38:01]\" id=\"what-prompted-maddi-to-merge-her-firm-3801\"\u003eWhat Prompted Maddi To Merge Her Firm [38:01]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, growth is picking up. So what happened to your wonderful person?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e I know. I\u0026#39;m so sad. Like I said, I\u0026#39;m still friends with her and I still love her. But she wanted to get... She kind of sat me down, and I think it was September, October of 22, and was like, \u0026#34;Hey, I don\u0026#39;t want this to hurt you or the firm or your feelings, but I kind of want to explore something else. I don\u0026#39;t think I want to do this anymore.\u0026#34; And of course, my initial reaction was, \u0026#34;Oh, well am I...?\u0026#34; If you\u0026#39;re a business owner, you don\u0026#39;t have a ton of time to train, I\u0026#39;m probably not doing a good enough job training you are getting you to do the things that you want to do. Like, \u0026#34;How can I be helping you see how great this profession is? How can I train you anymore?\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd she\u0026#39;s like, \u0026#34;No, that\u0026#39;s not it. I just want to get out of the industry completely.\u0026#34; And so I was like, \u0026#34;Okay.\u0026#34; And she actually wanted to go into a music career. That\u0026#39;s what she moved to do. So very different, very, very different than what the plan was. So it was just one of those situations. Part of me still thinks I could have done a better job of integrating her into the business. But at the end of the day, she really wanted to move to Texas and explore kind of doing a record deal and being able to do music. And so of course, I supported that, but was very sad. She did continue to work for me a couple of hours a week as a virtual assistant, kind of as a contractor after that, for a few months, because it helped her out and also continued to help me out. She just wasn\u0026#39;t doing as much of the planning stuff in the client meetings because she wasn\u0026#39;t available all the time.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Right. So this just feels like one of those, we go to college for a thing, and then we do the thing for a little while after college, and then we decide that\u0026#39;s not actually the thing that we wanted to do with our lives, just one of those?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e I think so. I think so. I went to college for political science, so I have no judgment. I thought I was going to be doing something totally different than financial planning.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I was a psych major theater minor. Here we are.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. So I think that\u0026#39;s it. Maybe she\u0026#39;ll get back into the industry. I\u0026#39;d be happy to have her back, but we\u0026#39;d be happy to have her back. But for now, it sounds like she\u0026#39;s doing something else.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So what was it that as you came through that to say, \u0026#34;Hey, this Frazier conversation seems interesting,\u0026#34; as opposed to, \u0026#34;Well, I guess I got to go find another one. I can just go hire another Ohio State grad,\u0026#34; or try some different hiring strategy if that wasn\u0026#39;t the one that you were happy with?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. I think that kind of initial like, \u0026#34;Okay, this might be worth exploring,\u0026#34; is Brian, who ended up being the person that kind of talked me into coming to Frazier, met with me initially. I had known him for a few years, so I think it was a little bit different of like, \u0026#34;Okay, I trust this person. I\u0026#39;ve worked with him on the Financial Planning Association Board.\u0026#34; Every time we met, he was an open book about what he does for clients, what the firm does for clients, shared every and anything with me.\u003c/p\u003e\n\u003cp\u003eAnd I had had, kind of to give a little backstory to this, I had had a couple of different conversations with a couple of other different firms throughout my career and while I was with Minerva Wealth Planning about joining them. And they were kind of out of the blue people I didn\u0026#39;t know very well, and that ended up not going anywhere. It was kind of crappy. And so this was the first time that it was a person that I knew very well, fairly well, and kind of that gave me at least to explore what it could look like. I kind of was like, \u0026#34;I still don\u0026#39;t think...\u0026#34; I think I even told him like, \u0026#34;I don\u0026#39;t think this is going to work. I don\u0026#39;t really want to do this, but I\u0026#39;ll at least have conversations with you and your team and learn from you and I\u0026#39;ll share, I\u0026#39;m an open book as well, I\u0026#39;ll share everything I\u0026#39;m doing and how I\u0026#39;m doing it.\u0026#34; And so that\u0026#39;s kind of where it went next.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So I think when you were describing this further, you kind of framed it as a dating process. So what was the dating process like? What did you do to try to figure out is this the firm I want to merge into after I\u0026#39;ve been getting momentum being out of my own? Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e There were quite a few meetings, probably January, February, March of, we would just sit in a room and just they would pull up tech stack, for example, so all the tech they were using and would just show me what their process looks like, what type of technology. So one of the things that\u0026#39;s kind of different about us is that we manage assets held away. So we claim custody. So he would show me like, \u0026#34;Okay, this is this buy-all tool. This is how we aggregate assets and bring this in. And here\u0026#39;s how we help that...help our clients with whatever, their held-away assets.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd so it became almost a review of their business and how they do things so that I could get a sense of how would that fit with my business. It became kind of a 2-way thing, right? So they would share all the things and show me how they do things. And then I would pull up my planning software, pull up anything that I\u0026#39;m doing, my CRM, and kind of show them. I had a proposal process. I showed them how I do proposals and how I talk to prospects.\u003c/p\u003e\n\u003cp\u003eAnd so we went through that for the first couple of months and then it became more of kind of talking to the partners there about what could it actually look like. After we got to a certain point where I was like, \u0026#34;Okay, if I join, my kind of non-negotiables, I still want... I want to be a partner and it\u0026#39;s not for financial reasons. I want to have a seat at the table and I want to be able to kind of help direct things and help build things.\u0026#34; And so that\u0026#39;s one thing that I know that I need. I also need my clients to not be hindered in any way by joining. I don\u0026#39;t want them to feel like they\u0026#39;re getting a worse experience or getting worse technology or getting worse service. And so there were kind of all these things that I started to talk through with them over those kind of probably March/April timeframe.\u003c/p\u003e\n\u003cp\u003eAnd then we did some kind of offsite personal meetings as well. So I had dinner with all the partners and my husband came and their spouses came, and we kind of got to know each other outside of the office. And then I did go into the office and meet some of the team as well. So much of the conversation was with the partners, but kind of at one point towards the end of before deciding to join, I got into the office and met some of the folks that are there and kind of got to feel a little bit of the culture there. And so ultimately, they gave me an offer at the end of April. And I was like, \u0026#34;Yeah, you\u0026#39;ve talked me into it. We are aligned culture-wise, we are aligned with how we serve clients.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd there\u0026#39;s a bunch of benefits, I would say, with joining that I can talk about. But at that point, I felt confident to move forward. Although it\u0026#39;s kind of a funny story. When they had kind of shared with me that I could have these things that I wanted and get a decent compensation and all these things, my mom is also an executive in finance and I had called her for advice and was like, \u0026#34;Okay, they\u0026#39;re giving me all these things that I want. And they\u0026#39;re super kind. And I like spending time with them. And I like working with them. There\u0026#39;s got to be a catch. There\u0026#39;s got to be some reason why they\u0026#39;re doing this. They\u0026#39;re trying to get me or trying to get me on something.\u0026#34; And my mom was like, \u0026#34;No. I just think they value you. I don\u0026#39;t think you need to think that way.\u0026#34; And I\u0026#39;m a pretty optimistic and trusting person, but still I was just a little hesitant that it felt so good. And it felt like they did value me. And so that\u0026#39;s when I ultimately decided to join this end of April, beginning of May.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Maddi’s Non-Negotiables In Merger [45:56]\" id=\"maddis-nonnegotiables-in-negotiating-the-firm-merger-4556\"\u003eMaddi\u0026#39;s Non-Negotiables In Negotiating The Firm Merger [45:56]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So now help us understand what were the non-negotiables, the things that really were the line in the sand for you about what it was going to take for a merger to work?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Sure. So there were a couple of things that I had stated to them. One was I definitely wanted to be an equity partner. Certainly, the revenue I brought over would help with this, but I didn\u0026#39;t stipulate a certain percentage or anything like that. But I did say that I wanted to be an equity partner, and more so just to have a seat at the table. That was really what I wanted, was to be able to kind of help drive the change and drive the growth of the firm. And so that was one of my non-negotiables.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Was there change planned? You just said you wanted to drive some change and growth at the firm. Were there change plans underway or things that you had in mind or just kind of in general principle like, \u0026#34;I want a seat at the table as this thing grows and evolves?\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Mostly just kind of the growth. Their growth trajectory, I think they\u0026#39;ve...we, I should say now, have doubled in the last 2 to 3 years. We\u0026#39;ve quadrupled since 2017. And so I kind of just saw that this was going from...and we are in that dangerous middle that I know people have talked about on the podcast before. But I could kind of see this just continuing to be this huge growth for this company. And so being part of building this out to the next level, to get to the billion-dollar mark, to get to and to me, more importantly, is how you\u0026#39;re building out that team. A lot of my experience prior to being in financial planning was leading teams at a large Fortune 100 company. And so I really thought that I could be helpful in driving some of that on the operation side of the firm. And so I really wanted to have a seat at the table to help them with that.\u003c/p\u003e\n\u003cp\u003eThe other non-negotiable would be from a compensation standpoint, at least making close to what I was making for myself with the opportunity to kind of grow that aside from profit distributions, be able to grow that over time to reflect my experience and background. Those were the only real things that I kind of drew a line in the sand and said like, \u0026#34;This has to...\u0026#34; Told them, kind of verbally told them that this is what I\u0026#39;d want or need.\u003c/p\u003e\n\u003cp\u003eAnd then kind of some of the other things that I would say though that I knew in the back of my head that maybe I didn\u0026#39;t say out loud, but I realized over the months was I wanted a fun culture that I enjoyed coming to work and having a team around me that I really enjoyed being around. And so I wouldn\u0026#39;t join a place where I felt like there wasn\u0026#39;t a great group of people around me. So that was one of the things, flexibility and value of education. So we spend a lot of time and money on sending advisors to conferences or doing continuing education. That was really important to me. So there were some other things that I didn\u0026#39;t necessarily state to them, but I could tell when they kind of opened the books and showed me everything, it was clear to me that some of those things that I value, that they value as well. So it was hugely cultural. And then kind of some of the details were around being an equity owner and having decent compensation for what I\u0026#39;m doing and feel like there\u0026#39;s a path forward to continue to grow.\u003c/p\u003e\n\u003ch2 data-nav-title=\"How Equity Was Calculated [49:51]\" id=\"how-equity-was-calculated-in-the-firm-merge-4951\"\u003eHow Equity Was Calculated In The Firm Merge [49:51]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, what\u0026#39;s it like to transition from, just think of when we\u0026#39;re solo and are on our own, compensation is kind of gross revenue minus business expenses equals, I get what\u0026#39;s left over. Call it comp, call it salary, call it profits. We can be creative with some entities about how we do that for FICO purposes. But at the core, gross minus expenses equals my comp. And when you get into a realm of being an advisor in a larger firm with multiple advisors and multiple partners, there\u0026#39;s usually some separation, some distinction of, \u0026#34;here\u0026#39;s what you earn in the business versus here\u0026#39;s what you earn as profits for owning the business.\u0026#34; So I guess I\u0026#39;m curious how that got negotiated, or even when you were thinking about, \u0026#34;I need to have the same compensation,\u0026#34; was that just what you earn in the business or was that what you earn in the business plus your profit distributions? How did you think about that comparison and transition?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. So kind of both. So the way that our deal is kind of working out, we\u0026#39;re kind of in the middle of this equity transition. And how it works is, so the clients that I bring over from Minerva Wealth Planning, so the people that I brought over on May 1st, as well as anybody else that comes to me as a referral or through the name of Minerva Wealth Planning, so not by knowing Frazier Financial, all of those clients, the revenue generated from them in the year of 2024, so all of this year, that revenue goes towards a 5% ownership stake in Frazier Financial. So that gets me the equity piece. And then I have to make up the difference between our multiples, which I\u0026#39;m happy to talk about. So that\u0026#39;s kind of how I get the long-term profit distribution separate from compensation for doing the work every day.\u003c/p\u003e\n\u003cp\u003eSo that\u0026#39;s kind of the profit piece. And then compensation piece, I did want to make sure that my actual wages were in line with what I was doing and the types of clients I was working with. And so that was part of it as well. I\u0026#39;ll continue to have W-2 wages as an advisor in the firm. And then also we have team bonus and partner bonus as well that\u0026#39;s part of that based on performance of the company and performance of you and what you\u0026#39;re delivering to the firm. So that\u0026#39;s all kind of the regular compensation, but those profits won\u0026#39;t be so technically 1/1/25 is when my revenue from Minerva Wealth Planning will then purchase shares of Frazier Financial and I\u0026#39;ll be eligible to start getting those profit distributions of 5% of profits going forward, kind of outside of the comp discussion.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Oh, interesting. So even though nominally, you merged and did the deal last year in May of 2023, that through the year of 2024, it sounds like your original Minerva practice is still kind of running like its own phantom revenue P\u0026amp;L profitability that you get paid from and it\u0026#39;s not really treated as literally part of the core where you\u0026#39;re simply getting your Frazier financial profit distributions until 2025 when you\u0026#39;re more than 18 months into the deal.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e That\u0026#39;s right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So help us understand just how did that come about?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah, yeah. Kind of backs around that. I really wanted day one to walk in as partner. I don\u0026#39;t know if it was ego or what, but I kind of wanted to walk in and have all these things that I said I wanted. And they had talked me out of, they were like, \u0026#34;Hey, we understand where you\u0026#39;re at. We do really want you here, but we think it\u0026#39;s in both of our best interests to do a deal that\u0026#39;s a little longer so that you have time to get to know us and make sure it\u0026#39;s a good fit, we have time to get to know you and we feel like it\u0026#39;s a good fit. And so we were just certain that we want to work together.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd we had it built in that I could take all of my clients and leave, even clients that I brought on that were from the Minerva brand, they weren\u0026#39;t Frazier Financial clients. I could take them and leave and go back and relaunch my RIA and not have issues. They\u0026#39;re not going to come after me for any of that. So they talked me into it and I said, \u0026#34;Okay.\u0026#34; And I\u0026#39;m really glad they did. My decision has not changed. I\u0026#39;m very excited to purchase on 1/1.\u003c/p\u003e\n\u003cp\u003eBut I\u0026#39;m glad that we gave ourselves some time to really get to know each other because it\u0026#39;s a huge giving up your business and the thing you\u0026#39;ve built over the last whatever, 4 or so years is not a small thing to do. And so I\u0026#39;m glad we structured it that way. The idea came from, we actually have one of our other partners, Brian, he did a similar deal with them back in 2018. He worked it out with them where he had a list of clients that he brought over and they structured it exactly the same way. So it was already kind of a precedent for how they\u0026#39;ve done it in the past. And I, of course, hired an attorney and looked over it and decided like, \u0026#34;This was a good path forward.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So does that mean...? Is Minerva literally the RIA entity still out there kind of running in the background until the deal closes with share purchases on 1/1/2025?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e It actually closed. So I ended up closing it last December. So I kept it open pretty much all of last year with the thought maybe I\u0026#39;ll change my mind and not want to do this. And ultimately in December, and I told the partners too, I was like, \u0026#34;I\u0026#39;m certain of where things are at. I love the team. I love the clients I\u0026#39;m working with and I love how we\u0026#39;re serving them. So I\u0026#39;m going to go ahead and shut it down.\u0026#34; So I would have to kind of relaunch if I decided to do that. But I did shut it down in December of last year.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So you really did do all the move clients, repay per advisory agreements, such like all that happened in May of 2023. It\u0026#39;s just your internal structure is, \u0026#34;I\u0026#39;m not actually an equity partner yet. I\u0026#39;m getting comped on the original book that I brought in because we\u0026#39;re still in this 18-month transition, 20-month transition. And then we\u0026#39;ll receipt compensation and equity on 1/1/25, assuming everybody\u0026#39;s happy then, which seems to be the case, we receipt this in 1/1/2025, where my comp and equity structure changes within the firm.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e That\u0026#39;s right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So then I\u0026#39;ve got to ask as well, just how did you actually strike just the terms, the valuation? Was there purchase price and cash changing hands, or was this all equity for equity, stock for stock? How did you actually get to valuation and terms and structure?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. So our CFO, who\u0026#39;s also our tax partner, he kind of tracks, at least for Frazier Financial, how they value and they\u0026#39;ve done some...I think they\u0026#39;ve gotten some outside valuation done as well, but he has a kind of how they value themselves. To kind of give you the way that we think about it multiplewise. So they gave me a 1.5 multiple and I am buying them at 2 times. So pretty steep. In my opinion, it felt like a pretty good deal with me being such a small solopreneur, and having a large firm giving me a 2. And probably externally, would not be. It was discounted for somebody kind of working in the company and coming up that way. And so that\u0026#39;s the multiple. So...\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So they value your revenue at 1.5X based on your size, you buy into them at 2X based on their size.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e That\u0026#39;s right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e It seems like a translation of relative revenue equity between the 2.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e That\u0026#39;s right. And then any of the clients that I have brought on, because of the Minerva Wealth Planning name, but after joining them, so didn\u0026#39;t bring them with me, they will bonus me out for that. So it\u0026#39;ll be just kind of ordinary income tax treatment for that. So the 1.5 times, they\u0026#39;ll just bonus me that amount of revenue for 2024. And then all of my Minerva Wealth Planning clients, it ends up being long-term gains. I forget logistically how we structured it, but I know that...but it\u0026#39;s set up in a way that it\u0026#39;s a little bit better tax treatment than clients that have come on since I joined.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And when did these numbers get struck? Is this your revenue when you joined last May and their revenue when they joined last May to do the pricing of the shares, or is all this really delayed until 1/1/25, and when we get there, it\u0026#39;s 1.5 times your 2024 revenue, 2 times their 2024 revenue because you\u0026#39;re still in this transition period?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. Yeah. It\u0026#39;s the latter. In Tamarac, we use Tamarac for reporting, we were able to separate out anybody that I brought over. So the actual revenue dollars through 12/31. So technically, it\u0026#39;s still kind of going if I brought in other clients from Minerva, but it\u0026#39;s still kind of the additional revenue could be added to that. But yeah, we\u0026#39;re actually using 2024 numbers after 12/31 for that figure.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And then how does it work compensation-wise from there? Are you a revenue-based compensation firm? Are you a salary and bonus because the rest comes from profits as an owner? How is your comp get re-struck after the equity transition happens?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e So it is a salary and bonus. So actually one of the things I love about us is all of our team, all of our advisors, everybody that works at Frazier Financial are on a salary and bonus, bonus based on top-line growth and then their performance personally. So that will continue to be kind of the large part of the compensation. And then for me, there will be a profit distribution based on my 5% on top of that. So I\u0026#39;ll have my regular wages for being an advisor and the director of operations, and then I have a bonus depending on how I do and how much growth the firm has that\u0026#39;s quarterly, and then I\u0026#39;ll have profit distributions that are paid out over the year as well.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So as you get into this post-transition stage, so you just help us understand what are your roles and responsibilities now? What is the final shaping of the position for you as it stands today?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e So still probably about 60 to 70% of my time is being a primary advisor. So that\u0026#39;s the language that we use, just kind of meaning that the primary person that is working with a particular client. So that is, of course, the clients that I brought over from Minerva Wealth Planning, as well as I\u0026#39;ve been taking on some h that come through to Frazier. So that will continue to be within my role for a while, I would imagine.\u003c/p\u003e\n\u003cp\u003eThe other part of that is really the director of ops work\u003cem\u003e. \u003c/em\u003eFor example, some of the things right now that I\u0026#39;d be kind of overseeing are like our tech stack. We have Salesforce is our CRM, but we\u0026#39;re kind of continuing to look for ways that we can get more streamlined and efficient. And so I\u0026#39;m kind of driving some things there to try to help us get there with workflows and things like that. That\u0026#39;s just one example, but really any of our tech stack.\u003c/p\u003e\n\u003cp\u003eAlso kind of helping with...and this is kind of more of an office management type thing or hospitality management type thing, but when we have IT issues like coordinating with our IT team, making sure things in the office are running smoothly, our office manager is keeping things looking great and greeting clients really well and all of those things that kind of come with the hospitality management. And oh, I should say also HR. So kind of that piece of it as well, making sure that people have access and understand what benefits we offer our employees and getting them kind of enrolled and talking about it every year. We do some off-sites and team-building things. So kind of coordinating all of those things continues to be, and then billing is a big one that kind of falls under the operations umbrella.\u003c/p\u003e\n\u003cp\u003eSo the other part of my time is spent kind of in those areas and trying to learn. So over the last 1.5 years, it\u0026#39;s been a lot of me trying to learn those areas and how Frazier Financial does them\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I was going to ask, is there team support around this right now, or is this all on your shoulders like tech stack, IT, HR, billing?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e There\u0026#39;s a ton of team support, especially because I\u0026#39;m still so new to some of the technology that Frazier Financial uses. So, for example, I learned how when I did billing for us for a few months so that I knew how to do that and because we had a maternity leave, so it worked out. But I am no longer doing the billing every month. I\u0026#39;m kind of overseeing it. And if there\u0026#39;s an issue or outstanding accounts receivable or something, then I might get involved. But I\u0026#39;ll kind of continue to kind of in the future oversee a little bit more. But I\u0026#39;m kind of a combo of the team helping and me doing a little bit of it too.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And I guess from your perspective, the firm\u0026#39;s perspective, what changes as this goes from Director of Ops to COO? What\u0026#39;s the distinction there for you?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. I think it is kind of more so overseeing and being more strategic, not being so in the weeds on, for example, looking at, I\u0026#39;m using billing because we just talked about it, billing as an example, looking at that every month and trying to figure out what\u0026#39;s going on. It\u0026#39;s more of like, what is the next thing we\u0026#39;re trying to accomplish? How can we have some challenges, for example, with because we manage assets held away, and we rely on aggregation software, there becomes sometimes issues where we can\u0026#39;t build on accounts until there\u0026#39;s some reconciliation done and whatnot.\u003c/p\u003e\n\u003cp\u003eSo instead of kind of in the weeds talking about how to solve the issue for this month, it\u0026#39;s more of like, what other technology or software is out there? How can I be kind of thinking about this at a strategic level and helping us get positioned as we continue to kind of be in this dangerous middle, get us over the hump to the...? I don\u0026#39;t know when it ends, but I think that we got a little while. So kind of continuing to get us into a good position with what\u0026#39;s next is kind of how I\u0026#39;m thinking about that role.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. Because I\u0026#39;m inferring from the discussion because you\u0026#39;re a firm that bills monthly on an ongoing basis, so billing\u0026#39;s just a regular drumbeat for you.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. Yep That\u0026#39;s right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I\u0026#39;m curious, why monthly as opposed to quarterly or other intervals?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e From my understanding, back when they started doing that, it was truly a cashflow...it was nice to have the cash every month rather than... It does make things a little bit more complicated when you have to kind of track because we do...I should say we pull monthly, but we bill clients quarterly in advance. So we have different clients at different quarters, if that makes sense, throughout the year. So it does create a little bit of complexity with keeping track of which calendar quarter and which clients are on this calendar quarter versus this other calendar quarter that starts in May or in June.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay, s you\u0026#39;re not actually billing 1/12 of your fee every month, 12 months of the year. You\u0026#39;re billing clients quarterly, but I guess you bill roughly 1/3 of the clients quarterly on January, April, July, October going through, and then 1/3 of the clients are on the February quarterly cycle, and then 1/3 of the clients are on the March quarterly cycle. So they\u0026#39;re all staggered, which means about 1/12 of your revenue comes in every month, but not because everybody\u0026#39;s being billed 1/12. Clients are quarterly on staggered cycles.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep, exactly.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And then it smooths out cashflow.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yes. And that being the reasoning is, yep, there\u0026#39;s cash coming in every month.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. Okay. Are you feeling good about it because the cashflow is smooth or is the additional billing frequency feeling like it\u0026#39;s not...the juice is not worth the squeeze for the work it takes to do continuous monthly billing?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah, it is definitely a beast. I will say it\u0026#39;s working, I would say, totally to the credit of our team. So one of the ladies on our team, Emily, does our billing and it\u0026#39;s working well because she does it, but it is a ton of hours. So it is something that we\u0026#39;re always kind of looking for, how do we improve this process? I don\u0026#39;t think that would result in us not kind of having this setup where we do have this kind of cashflow coming in every month. That gives us comfort and flexibility to invest in the business if we need to. But we\u0026#39;re always looking for ways to improve that process. I don\u0026#39;t think that we would shift to a different model though, anytime in the near future. But thankfully, it\u0026#39;s running well enough because we have people like Emily that can do a great job with it.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Leading Clients Through Transition [1:06:06]\" id=\"how-maddi-led-her-clients-through-the-firm-and-technology-transition-10606\"\u003eHow Maddi Led Her Clients Through The Firm (And Technology) Transition [1:06:06]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So as you look now that you\u0026#39;re a year-plus into the merger, very close to the 1/1/25 transition to kind of further cement and finalize, I guess I\u0026#39;m just curious, what\u0026#39;s turned out as expected or not from the vision of what this was in your head 1.5 years when you were getting ready to sign this paperwork?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. What\u0026#39;s funny is I totally thought that the conversations with clients would be the hard part. I thought moving clients over would be the challenge and then everything else I can learn and I can integrate and I\u0026#39;m good with the team and I\u0026#39;ll pick everything else up. It\u0026#39;ll be fine. And it\u0026#39;s kind of the opposite is true. The clients came over...I think I had everyone moved over within a month. Again, kudos to the team at Frazier to help with all the paperwork there. But clients signed. They didn\u0026#39;t question things. They saw that it was better for them and felt it and were happy. It was surprising to me that that happened.\u003c/p\u003e\n\u003cp\u003eAnd then the part of kind of learning, I don\u0026#39;t think I kind of fully understood the challenge of learning. I\u0026#39;ve been in financial services my entire career, but I\u0026#39;ve been in financial planning since 2017. So I\u0026#39;m still not new, but somewhat still learning a lot about financial planning. So I\u0026#39;m learning that and then coming into a brand new business, supporting a team kind of in a new role, and then trying to learn how to do financial planning with a totally new set of procedures and of different tech that they\u0026#39;re using and meeting structure and a whole new story. Like I had to learn how to tell the story. Many of our prospect meetings now, I\u0026#39;m doing. And so I have to be able to speak intelligently about what I do and why we are who we are. And so I don\u0026#39;t think I gave enough...I didn\u0026#39;t think that it was going to be so much of my time and energy to learn all that. It was way harder than I thought it would be.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e What was the planning change from what you were using or doing to what they are at Frazier?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. So I was using RightCapital with Minerva Wealth Planning. I still actually have it. They\u0026#39;ve been so supportive of me kind of taking my time and slowly transitioning over. So I still even have some folks on RightCapital. But they use MoneyGuidePro. And so it\u0026#39;s been an adjustment.\u003c/p\u003e\n\u003cp\u003eI will say what\u0026#39;s interesting is, I think clients actually kind of liked when we\u0026#39;re starting to get into the conversations about, \u0026#34;Hey, we\u0026#39;re kind of switching technology.\u0026#34; They seem a little excited by like, \u0026#34;There\u0026#39;s this new thing that we get to walk through again and talk through again,\u0026#34; because maybe it\u0026#39;s been 2 or 3 years since we\u0026#39;ve done that with Maddi, the clients that came over with me. So I guess that\u0026#39;s good. But that\u0026#39;s, sorry, the long way of saying going from RightCapital to MoneyGuidePro.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Any other tech changes that were particularly surprising, I guess are either disruptive to the bad or beneficial to the good?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e So I do love that we use...so we use Tamarac for our client portals and for all of our reporting and trading and all of that. And I do...\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e What were you using previously?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e So I had kind of a weird setup. So I had a...maybe I should have mentioned this with Minerva Wealth Planning, I had a TAMP that I had hired. So I did not do the investment management in-house. It was a totally separate thing. And clients paid for it separately. It was not part of my planning fee. I used a company called GeoWealth. They\u0026#39;re great. I still love them. They\u0026#39;re a boutique firm in Chicago. And so they had their own...I think it was, I can\u0026#39;t remember what the backend software was, but they had their own kind of portal that they had created.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Yeah. GeoWealth built their own tech.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. So clients would use that if they wanted to go in and see reporting. That\u0026#39;s where I would go in to request how their funds were going to be invested, that type of thing. So it makes it easier because we also have an investment team in-house at Frazier Financial, but I do like the Tamarac setup a lot better. I like how simple the client portal is. I think it drives good conversations with clients. So I\u0026#39;m really enjoying that. That\u0026#39;s been a big shift that I do actually think is going well.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So does that mean from the client end, when you went through the merger to Frazier, does this show up as a fee reduction for them because they were paying Minerva fees plus GeoWealth fees because you assessed them separately, but if Frazier does everything in-house with investment team and Tamarac in-house, you \u0026#34;just pay the Frazier fee?\u0026#34; Did that actually add up differently or favorably for clients at that point?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e For many, it did. And I should mention too, with Minerva Wealth Planning, I did just a flat fee. So GeoWealth took their fee. I didn\u0026#39;t do any AUM on that. With Frazier Financial, 1% of what we are managing helps get you to that minimum fee. So a lot of my clients were paying $3,600 with Minerva Wealth Planning, out of pocket for that for financial planning. Now, because we\u0026#39;re managing it in-house, we have their IRAs or their Roth IRAs, whatever, 1% of the accounts that they have are going towards that minimum fee. So yes, what you\u0026#39;re saying, for many of my clients, it was actually they\u0026#39;re paying a little bit less because of the structure of having this minimum fee structure and having part of their investments go towards it, subsidize it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So what was the fee structure at Minerva then? How did you do it there between investment fees, planning fees, minimums, GeoWealth versus Minerva? How did it work there?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e So it changed a little bit over time, of course. Usually, you start a little bit lower.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e As these things do. Yep.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e That\u0026#39;s right. You\u0026#39;re not sure if you\u0026#39;re going to get paid enough to...or if you deserve this much and that type of thing. But ultimately, the last couple of years, my fee structure was $3,600 a year for a couple, and it was $3,000 for an individual. There was a tiny bit of a premium in hours. I tried to equate it to how many hours I was planning to work with them over the year. That\u0026#39;s how I backed into it with it, assuming $200 an hour for my compensation for that.\u003c/p\u003e\n\u003cp\u003eSo minimum fee for a lot of the clients that I had was $3,600. So they were paying that just monthly through AdvicePay. And then separately, if they had investments, I would tell them, \u0026#34;I\u0026#39;d love to be able to help you with that. And I have this great almost an extension of me and my team, this group that I work with, GeoWealth. And they\u0026#39;re going to be able to do the actual trades and make sure that you\u0026#39;re getting rebalanced and all the things that need to happen with your accounts. They\u0026#39;re the ones doing that.\u0026#34; And so they have, at the time, I\u0026#39;m not sure if it\u0026#39;s changed, but at the time, it was 25 basis points. And they have their own proprietary strategies and models. And they also have others on their platform as well. And I\u0026#39;d used a couple of different ones, but I mostly used their proprietary ones. And so it was just them. The client would just pay directly out of the accounts, the 25 basis points and pay me separately.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So you didn\u0026#39;t have an investment...you didn\u0026#39;t have an AUM fee at all on your end. You were a planning fee and GeoWealth was a basis point charge for the portfolio?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. That\u0026#39;s right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And so then if Frazier sounds like is an AUM, is ultimately an AUM model. So clients that had assets can apply it against their fee minimum...their planning fee minimum. But I\u0026#39;m also inferring that large clients with more dollars might be more on an AUM fee at Frazier than they were at GeoWealth at \u0026#34;just 25 basis points.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. Yep. There were a small handful that were that exact scenario where they did have more assets. But yep, that\u0026#39;s right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e But sounds like your clientele were younger folks with planning needs and not large portfolios yet. So transitioning to Frazier 1% fee on a larger portfolio was not in practice a common transition challenge for them.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. Yep. I worked a lot with kind of that HENRY [High-Earner, Not Rich Yet] group that we all talk about where they have the cash available, but not the assets. That\u0026#39;s right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Interesting. Interesting. So it kind of lines up well for the context of the merger. As they accumulate wealth over time, they kind of naturally grow towards viability of an AUM model anyways, they have more assets to manage over time. But the transition was pretty straightforward because you were charging enough in planning fees to cover what an AUM fee would have to cover anyways. It\u0026#39;s the cost to service clients. By whatever means, you\u0026#39;re going to pay for it. To a certain amount, you got to pay to get financial planning service.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Right. I\u0026#39;ve actually been asked that a couple of times of you were flat fee and now you\u0026#39;re AUM, how do you think about that? I was never flat fee because I didn\u0026#39;t believe in the AUM model. It was more of I needed to solve for these folks that are similar to my age that are young. They don\u0026#39;t have a ton of assets. And so here\u0026#39;s how to do that. I think Frazier has done a great job of kind of going to the next level. I love the way they do it where it\u0026#39;s we still have a minimum fee because we got to get paid to do the good planning work we do. But you can...over time, you can use the assets that you do have and then over time kind of build on that until you\u0026#39;re kind of at that level where you are, rich or have the cash or have the investments I mean.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. Oh, right. Because if I\u0026#39;m in the old model, I was paying you $3,600 for a couple \u003cem\u003eand\u003c/em\u003e a GOL fee – small fee, but I had an \u0026#39;and\u0026#39;, whereas I\u0026#39;m Frazier, my AUM fee goes directly, effectively goes directly against my planning fee, goes against my minimum, like I\u0026#39;m already making a dent in the minimum with any assets that I have at Frazier.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yep. Yep.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so in practice, just was it...were there challenges explaining to clients this change in fee model in structure in flat fee versus AUM? How did that conversation go with clients?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. Surprisingly a lot better than I thought it would. I think during the transition, I think I lost, I want to say I lost 1 or 2 clients directly related to like, \u0026#34;Okay, we don\u0026#39;t really want to do that.\u0026#34; The only comment I really heard was I was this kind of small, women-owned business. And so they were a little bit concerned about me joining this kind of larger firm. And so that was a little bit of the conversation that I had. But that was such a small percentage of people. And at the end of the day, I only lost 2 people or 2 households. Everyone else was like... And I explained. It was certainly I positioned it as, which is true, that I was going to have more support, the team approach that we have, all of us are very willing to be helpful. So if something happens to me, or I can\u0026#39;t be there, they want to call, there\u0026#39;s somebody in the office there that can support them.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Of course, the tax piece being huge, too, for some of my clients, certainly not the ones that are many of the HENRYs, but there were some clients were over the long term, they saw the benefit of having even just having the knowledge in the office, right, just having access to a tax professional to ask questions and be around. They saw that being a great thing as well as being able to manage assets held away. I wasn\u0026#39;t doing that at Minerva Wealth Planning. Now we do their 401(k)s and any of those types of things. So I think I positioned it in a way where they said, \u0026#34;I trust you and you\u0026#39;re making a sound decision based on what we see here. And I understand that. And yeah, we\u0026#39;ll sign.\u0026#34;\u003c/p\u003e\n\u003ch2 data-nav-title=\"What Surprised Maddi The Most [1:17:37]\" id=\"what-surprised-maddi-the-most-about-building-a-firm-11737\"\u003eWhat Surprised Maddi The Most About Building A Firm [1:17:37]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So as you reflect on this journey overall, I guess both building your firm and then merging into Frazier and the growth with Frazier, what surprised you the most about just the path of building an advisory business?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. I already kind of mentioned, but I think the biggest surprise to me was how quickly clients will...if you do a good job, do the right thing for them and earn their trust, how much they\u0026#39;ll trust you and do what you ask of them. The whole transition that I just talked about a moment ago, I can\u0026#39;t believe that clients didn\u0026#39;t bat an eye. And I brought over, I want to say it was close to 70 clients. For the most part, no one really did question that. They just trusted me blindly because I spent the time getting to know them. It\u0026#39;s a really beautiful thing to have that in a profession, that somebody is that trusting of you. That was really shocking. And then of course, kind of the other side of that, that I already talked about too, but how challenging it was. I thought it would be easier to learn all the new things. And it was harder to do that than it was to just get the clients on board and be happy to continue working with you. So I would say that\u0026#39;s one.\u003c/p\u003e\n\u003cp\u003eThe other thing I\u0026#39;ll mention being really surprising is when I started my own thing, so I had worked at a large Fortune 100 company, I started my own thing and I thought, \u0026#34;I\u0026#39;m going to be talking to clients all day long. I\u0026#39;m a very social, very extroverted person. This is going to be great. I\u0026#39;m going to love this.\u0026#34; And certainly, I was talking to clients or prospects or people all day long, but I didn\u0026#39;t realize, and I know people have said it before on the podcast, but how lonely it is to be a business owner by yourself. It was shocking to me. I couldn\u0026#39;t believe how you don\u0026#39;t have somebody that\u0026#39;s there working towards a common goal with you that you can talk to, that you can ask questions, that you can collaborate with. That hit me hard.\u003c/p\u003e\n\u003cp\u003eAnd that was part of the reason too, that I think I was seeking something, whether it meant hiring more people or joining another firm. I was just kind of like, \u0026#34;Wow, I really want that collaboration. I\u0026#39;m used to that.\u0026#34; That was what most of my career prior was about. And so that was really surprising, was how lonely it is. You really do have to kind of make the effort to talk to other advisors to get some of that need fulfilled in my opinion.\u003c/p\u003e\n\u003ch2 data-nav-title=\"The Low Point For Maddi [1:19:56]\" id=\"the-low-point-for-maddi-on-her-journey-11956\"\u003eThe Low Point For Maddi On Her Journey [1:19:56]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So what was the low point for you on this journey?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Oh, there are many low points, I feel like. Not many, but I guess my point is I think that people experience low points now, last few years, but also all throughout life. I think there\u0026#39;ll probably be more. Some of the ones that kind of stand out, I\u0026#39;d say definitely Sydney leaving, because that\u0026#39;s really what that...that was the person that used to work with me. It was kind of that point where I was at a crossroads where it was like, \u0026#34;Okay, I have to hire again. How much do I invest in this person? What type of person do I hire? Do I hire an administrative person? Do I hire a paraplanner?\u0026#34; All those questions, it was really hard kind of trying to figure out how to do that and where to go. And thankfully, it did end up working out however many months later, but it was a really hard time figuring that out.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e How much did it hit you for just the amount of work that had to blow back to you while you were transitioning through that?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. I would say you\u0026#39;d probably ask my husband or my daughter, because it felt like I was just working all the time. I don\u0026#39;t know how to quantify that, but I will say it was often. It was probably, every weekend. And the funny thing is I didn\u0026#39;t have...if you talk to other advisors, I didn\u0026#39;t have that many households or clients, but just the way that I was doing things and how much time I put into every plan, and with all the prospecting coming in, it felt like it was a lot on my plate to try to be managing myself.\u003c/p\u003e\n\u003cp\u003eAnd the other thing I want to mention, because I think it\u0026#39;s important is huge, huge low point for me. So when I was at the Fortune 100 company before, I had an amazing boss and she let me and paid for me to take the [Series] 65 before I left, even though she knew it wouldn\u0026#39;t be for staying there. She was very kind to let me do that. I\u0026#39;m not the dumbest person in the world. I consider myself somewhat smart. I could not pass the 65. I took it twice, failed both times. And I was down to the last night. I don\u0026#39;t remember all the rules on that, but after you fail it the third time, I think you have to wait a year or something. There\u0026#39;s some stipulation on how that works. But I failed it twice and was at this, again, kind of a crisis moment of like, \u0026#34;Well, I\u0026#39;m clearly not capable or smart enough to do this job. How could I not be capable?\u0026#34; You\u0026#39;re kind of questioning yourself and your identity and all the work that you put in.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I\u0026#39;m struck by that. I know by background, you have your MBA, you have your CFP marks, you\u0026#39;ve done a lot of studying things.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. Yeah, no, I don\u0026#39;t know. I don\u0026#39;t know what it was, if it was like a...what it was. But that 65 killed me. I usually test okay, I test well. But that was the one exam that I could not get through. And I had decided at that point, Michael, this is, \u0026#34;I\u0026#39;m going out to do financial planning for my previous career,\u0026#34; like, \u0026#34;I\u0026#39;m going to go do it now.\u0026#34; And so it almost felt like a sign. I\u0026#39;m not a superstitious person, but it almost felt like a sign like, \u0026#34;Oh, my goodness. I\u0026#39;m about to walk out the door and I can\u0026#39;t pass this exam. That means I can\u0026#39;t...I actually can\u0026#39;t do it. So it was a bit of a crisis moment, but thankfully, I was able to get there on the third try. So for anyone listening, I would say like, stick with it. It\u0026#39;ll come.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Advice For Her Younger Self [1:23:10]\" id=\"what-maddi-would-tell-her-younger-self-12310\"\u003eWhat Maddi Would Tell Her Younger Self [1:23:10]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So what else do now you wish you could go back and tell you 10 years ago when you\u0026#39;re at the Fortune 100 company considering this transition?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. I would say one big thing would be having more patience and understanding and being nicer to yourself. There was a podcast of yours I listened to a long time ago. I cannot remember the gentleman that talked about this, but a lot of us have advisors, we are carrying the weight of our clients\u0026#39; problems with us. I think that was the way he worded it. And I feel that. I feel that a lot. And so when a client asks a question, my instinct is to be like, \u0026#34;Well, they shouldn\u0026#39;t have asked because I should have been proactive enough to provide this before they asked me.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd so I\u0026#39;ve tried to learn to just back off a little bit and not be so hard. I think there\u0026#39;s a good level of pushing yourself and being better, but not to your own detriment. What we do is hard and is stressful and there\u0026#39;s a lot of responsibility. And so we have to kind of give ourselves...we give our clients that same grace. So give ourselves that as well. I\u0026#39;d like to be better. I still struggle with that a little bit, but definitely a little bit less now than I did in the past.\u003c/p\u003e\n\u003cp\u003eThe other thing, I guess one more thing I would tell myself is that it\u0026#39;s not a bad thing to be the dumbest person in the room. I used to think there was...people have to think you\u0026#39;re smarter. They have to think something about you, you have to prove yourself. And I think now as I get older, and I think hopefully wiser, the more you learn, the more you don\u0026#39;t...the more you understand that you don\u0026#39;t know. And I think that\u0026#39;s a beautiful thing. I think you should surround yourself with people that are smarter than you or that know something that you don\u0026#39;t know, and continue to learn. So that\u0026#39;s another thing that I wish that I would have told myself. I wish that I knew that.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Maddi’s Advice For Newer Advisors [1:25:07]\" id=\"maddis-advice-for-newer-advisors-12507\"\u003eMaddi\u0026#39;s Advice For Newer Advisors [1:25:07]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Any other advice you would give just younger, newer advisors coming into the profession and pursuing their career?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. I would say big thing would be get involved with organizations if you can. So local financial planning association chapters, NAPFA, National Association of Personal Financial Advisors, local groups or trade organizations. Find a mentor ideally if you can. The more people you meet, I think the better position you\u0026#39;re in just with different perspectives. And when you\u0026#39;re going through hard times, having something to talk through.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Well, I guess I\u0026#39;m struck. Ultimately, the outcome with Frazier and all the good stuff that\u0026#39;s happened thereafter, that came from being on your FPA...your local FPA chapter board, right? That\u0026#39;s where it started?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e That\u0026#39;s right. I would actually go as far as saying that I think every job or role that I\u0026#39;ve ever had has been somewhat related to my connecting or networking or... And I know people don\u0026#39;t love the word \u0026#39;networking\u0026#39;. It\u0026#39;s not to get something out of it, but just naturally putting yourself in a position to meet a bunch of people in your profession or even outside your profession. It does create a lot of value. I think all of my experiences has been due to that for the most part.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e It reminds me, Carl Richards likes to call this just increasing your surface area.You have to get out there and expand the surface area to have the opportunity for opportunities to fall in your proverbial lap.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. I love that framing.\u003c/p\u003e\n\u003ch2 id=\"what-success-means-to-maddin12639\"\u003eWhat Success Means To Maddin[1:26:39]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So as we wrap up, this is a podcast about success. And just one of the themes that comes up is literally that word success means very different things to different people. And so you went the successful path of building your firm on your own and now merging into a larger firm and getting to build with them and closing them on $1 billion of AUM. It\u0026#39;s like the business seems to be going very well at this point. How do you define success for yourself now?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. I knew this question was coming. I\u0026#39;ve been thinking about it a lot. And I\u0026#39;m kind of a dork about how I think about success and goals and that I\u0026#39;m fairly structured with that. So every year...and I\u0026#39;m also a believer that I think my goals and objectives change often. At least they do for me, probably not for everybody, but they change often for me. So I do kind of that cliché exercise of every year, probably around the first of the year, sit down and try to figure out what is important to me. And it usually is between 2 different arenas. So there\u0026#39;s personal and then there are professional, kind of professional arena.\u003c/p\u003e\n\u003cp\u003eAnd so the way I think about success is I kind of create all of these different objectives for both personal and professional. And then I want to see that I\u0026#39;m tracking. I have specific kind of goals and tactics for each of those. I want to see that I\u0026#39;m tracking towards meeting that overall objective. So to give you an example of one. So on the personal side, I have a goal of feeling healthier and more vibrant. And then I have this nice template I\u0026#39;m happy to share with folks. It\u0026#39;s pretty easy to make, but I have the objective and then I have why.\u003c/p\u003e\n\u003cp\u003eAnd so under why I would have sustained living, ability to travel, feel good, look good, avoid future health costs. And then I have specific goals, 3 specific goals for that specific objective. And so those go across personal, family, relationships and work, and community involvement. So I have 6 different kind of overall objectives and then goals for each of those. And so really what I\u0026#39;m defining as success is looking back at that on a regular basis and saying like, \u0026#34;I\u0026#39;ve made some progress. I don\u0026#39;t expect to be perfect and meet every single goal, but I do want to see that I\u0026#39;m looking at this thinking about it. It\u0026#39;s top of mind and I\u0026#39;m working towards that.\u0026#34; And I\u0026#39;ve done this now the last few years and I\u0026#39;ll tell you some of the goals stay exactly the same. So there is consistency in what I\u0026#39;m trying to accomplish there. And so I am seeing or feeling some of that success. So that\u0026#39;s kind of how I think about it. But it\u0026#39;s a moving target. Every year, you also get new goals and things you want to improve on.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And you said there\u0026#39;s actually a template that you have for this that you\u0026#39;d be willing to share out?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. I created it. Super simple, Excel template. But it allows you to kind of break it down between personal, professional into objectives, and then the \u0026#39;why\u0026#39; behind the objective.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Very cool. Very cool. So for folks that are listening, this is episode 408. So if you go to kitces.com/408, we\u0026#39;ll have a link in the show notes to...I don\u0026#39;t know, Maddi, what do you call it?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e I call it the Objectives Template.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e The Objectives Template. All right. We will have the Objectives Template in the show notes. So kitces.com/408. I guess just to wrap up, I\u0026#39;m curious, what else is on the objectives list right now? What\u0026#39;s the focus for you right now?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e Yeah. So on the personal end, it\u0026#39;s about kind of health. So I have some different things, workout-wise, meal-wise, intermittent fasting, things like that, that I\u0026#39;m trying to accomplish on that realm, continuing to learn and foster creativity. So trying to take Spanish lessons and read every month and pick up piano is kind of one of those things. Connect more with loved ones. So scheduling time with people or family I haven\u0026#39;t seen is kind of part of that. Starting and maintaining therapy, which I had not done prior to this year actually, but I think it\u0026#39;s really important for people. So that was kind of on the personal realm are some of those goals.\u003c/p\u003e\n\u003cp\u003eOn the professional side, leaving a legacy with the Financial Planning Association. So I\u0026#39;m currently the president of that organization this year for Central Ohio. And so wanting to do something to further improve that organization at the local level is what I would like to. And there\u0026#39;s some specific things like satisfaction surveys and events and things. Expanding my knowledge in financial planning. So kind of continuing that, continuing education and conference schedules, and then improving our FFA operations. So some specifics around improving technology, not having so much outstanding accounts receivable, that type of thing specifically in that realm.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Very cool. And so you said every year, this gets updated, some stay, some move on, and new goals come in, and that\u0026#39;s an annual process for you.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaddi:\u003c/strong\u003e That\u0026#39;s right. And I don\u0026#39;t expect 100%. So I\u0026#39;ve told myself basically 80% of these goals is kind of what I\u0026#39;m shooting for every year. But yes, that\u0026#39;s right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Yep. I love it. I love it. Well, thank you so much, Maddi, for joining us on the \u0026#34;Financial Advisor Success\u0026#34; podcast.\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;#FASuccess Ep 408: Merging Into A Mid-Sized Firm To Grow Something Together (And Have A Real Piece Of It), With Maddi Keegan\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-dc6ee443d13ebc8883a039cc-=\"\"\u003e\u003cimg decoding=\"async\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "97 min read",
  "publishedTime": "2024-10-22T07:01:31-04:00",
  "modifiedTime": "2024-10-22T20:17:03Z"
}
