{
  "id": "fa45aa14-5f89-4a73-8786-24481aa162e9",
  "title": "Weekend Reading For Financial Planners (May 24–25)",
  "link": "https://feeds.feedblitz.com/~/918838592/0/kitcesnerdseyeview~Weekend-Reading-For-Financial-Planners-May-%e2%80%93/",
  "description": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that a recent survey of RIA employee compensation and wellbeing found that advisors appear broadly satisfied with their jobs and (perhaps unsurprisingly) identified a positive correlation between income and happiness at work (though separate research suggestsRead More... The post Weekend Reading For Financial Planners (May 24–25) first appeared on Kitces.com.",
  "author": "Adam Van Deusen",
  "published": "Fri, 23 May 2025 18:00:42 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Weekend Reading",
    "OPTIN: Value Of Advice (BAR)",
    "OPTIN: Value Of Advice (SLIDE IN)"
  ],
  "byline": "Adam Van Deusen",
  "length": 35448,
  "excerpt": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that a recent survey of RIA employee compensation and wellbeing found that advisors appear broadly satisfied with their jobs and (perhaps unsurprisingly) identified a positive correlation between income and happiness at work (though separate research suggests",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that a recent survey of RIA employee compensation and wellbeing found that advisors appear broadly satisfied with their jobs and (perhaps unsurprisingly) identified a positive correlation between income and happiness at work (though separate research suggests other factors might contribute more to advisor wellbeing). The survey also demonstrates the potential income upside for advisory firm employees who advance in their firms, with CEO respondents reporting average total annual compensation (including salary, cash bonuses, and non-cash compensation) of more than $900,000 (client-facing advisors surveyed had strong earnings as well, with average total compensation of more than $400,000). Altogether, while the pool of respondents was somewhat limited (and appears to skew senior in rank), the survey suggests that financial advice can be a lucrative career, in terms of compensation, a sense of meaning, and overall wellbeing. Also in industry news this week: While the latest iteration of Republicans' major tax legislation does not restore financial advisory fees as a potentially deductible expense, a coalition of organizations continue to push for it to be added to future legislation Charles Schwab announced this week that it is launching a program to help breakaway advisors launch and grow an independent RIA, offering a new option in the market of 'supported independence' platforms From there, we have several articles on retirement planning: How Treasury Inflation-Protected Securities (TIPS) can help mitigate inflation risk and maintain a client's purchasing power throughout retirement Comparing the relative and disadvantages of creating a TIPS 'ladder' versus investing in a TIPS index fund and how advisors can identify which types of clients could benefit from each How combining a single premium immediate annuity with a TIPS ladder can help mitigate both longevity and inflation risk for a client We also have a number of articles on practice management: Why seeking a 'specialist' to fill specific firm needs can often lead to better results for more mature advisory firms than hiring a talented generalist Considerations for firm founders who are considering hiring their child into the business, including the need to ensure buy-in from key stakeholders How RIAs can launch effective internship programs, from creating a position that offers the opportunity to perform meaningful work to providing mentorship opportunities to interns We wrap up with three final articles, all about how to be a better listener: Four techniques to be a better listener, including the skill of seeking to summarize what a speaker is saying rather than immediately identifying a solution How interjections such as \"huh?\" and \"mmhmm\" can help guide conversations and demonstrate that an individual is paying attention to what a speaker has to say Techniques for getting back on track when a conversational partner has zoned out Enjoy the 'light' reading! Adam is a Financial Planning Nerd at Kitces.com. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits. Read more of Adam’s articles here. Pay Report Offers Insights Into RIA Employees' Salaries, Bonuses, And Equity Compensation (Andrew Foerch | Citywire RIA) While working as a financial advisor can be a particularly meaningful job (given the opportunity to help clients live their best lives), it can also offer attractive compensation as well. To help analyze how pay differs across different types of positions and demographics, Citywire RIA conducted a survey of its readers, with 106 independent advisors responding (notably, while these respondents came from a variety of backgrounds, they might not represent a comprehensive cross-section of the RIA employee population, and numbers may be off given the limited sample size). Overall, total compensation not surprisingly varied by position, with CEO respondents earning the most total income (including annual salary and any cash- and non-cash bonuses, and likely including profit distributions as well), with more than $910,000 per year on average, followed by client-facing advisors ($442,040, again likely including both W-2 compensation and profit distributions) and chief investment officers ($377,000). In terms of firm type, employees of RIAs reported higher compensation than those at hybrid firms or Offices of Supervisory Jurisdiction (OSJs), $454,000 versus $373,000, buoyed in part by greater cash bonuses (e.g., higher profit distributions). Comparing compensation by gender, salaries for men and women were nearly identical ($271,000 and $269,000, respectively), but total compensation was lower for women due to lower cash bonuses and non-cash compensation (perhaps impacted by the lack of CEOs [who reported significantly larger cash and non-cash bonuses than other positions] and relatively small number of CIOs among female respondents, and more generally the lower rate of women owning their own advisory firms and participating directly in the profits thereof). The report also showed respondents were generally happy with their work, with 42 saying they were \"very happy\" and another 40 reporting being \"happy\" (with only 7 being \"unhappy\" and only 1 saying they were \"very unhappy\"). The survey showed a positive correlation between happiness and salary, with \"very happy\" respondents having an average salary of $307,000, \"happy\" respondents with $271,000, and \"unhappy\" respondents reporting an average salary of $166,000. Similarly, Kitces Research on Advisor Wellbeing (which surveyed a larger number and broader swath of the advisor community) also found that respondents tended to show high levels of wellbeing (an average of 6.8 on a 10-point scale) and that wellbeing was positively correlated with income. However, the Kitces Research study also found that higher income itself was not necessarily the primary driver of greater wellbeing; instead, factors such as autonomy (i.e., control over their work schedules and confidence in their ability to perform their work), experience, and team structure (with advisors who work in ensemble firms and enjoy this structure reporting greater wellbeing) were found to play primary roles in identifying 'thriving' advisors. Altogether, the Citywire survey (while somewhat limited in its reach) shows the potential income upside for advisors at RIAs (at least for those who are able to stay in the industry long enough to gain experience and advance to more senior advisory or leadership levels, and/or who found their own firms and participate in the profit distributions as well). Further, the survey and Kitces Research suggest that a career in financial advice can also contribute to overall wellbeing, whether because of the sense of meaning that such a career can provide and/or the autonomy and flexibility different career paths can offer! As Major Tax Legislation Nears Finish Line, RIA Advocates Push For Financial Advice Incentive (Sam Bojarski | Citywire RIA) One of the many changes made by the Tax Cuts and Jobs Act of 2017 was the repeal of miscellaneous itemized deductions, which was especially concerning to many financial advisors, as it included the elimination of the deduction for investment advisory fees (though not all taxpayers were eligible to claim a deduction for advisory fees in the first place, as not only did it require the taxpayer to itemize and exceed 2% of the taxpayer's AGI along with other miscellaneous itemized deductions, but even then, could be lost to the Alternative Minimum Tax [AMT]). Notably, though, this repeal is one of the many parts of the TCJA set to 'sunset' at the end of 2025 (along with marginal tax rates and the estate tax exemption, among other measures), making it a potential part of expected Congressional negotiations regarding the extension of the expiring provisions. This week the House of Representatives passed legislation that would make 'permanent' (i.e., without a scheduled sunset) many parts of the TCJA, including its tax bracket structure and higher standard deduction. However, the proposed legislation would also 'permanently' extend the elimination of miscellaneous itemized deductions exceeding 2% of AGI (including expenses such as investment fees), a cost-saving tactic as Republicans seek to advance similar tax legislation through the Senate using the reconciliation process, which wouldn't require support for the legislation from Democrats (but requires that the budget deficit not increase beyond the budget window [typically 10 years] per the associated \"Byrd Rule\"). Nonetheless, advocates for restoring the deductibility of advisory fees are continuing to advocate for it, whether in the current major legislation or perhaps as part of a package attached to other financial services bills. A coalition that includes CFP Board, the Investment Adviser Association, the Financial Services Institute, the National Association of Personal Financial Advisors (NAPFA), and the Financial Planning Association (FPA) in September sent a letter to the Chair of the House Ways and Means Committee urging Congress to restore the incentive, arguing that the repeal of the limited deduction for investment advisory and financial planning fees led to an \"unintended consequence\" of raising the cost of financial advice, highlighting the particular value of financial advice during turbulent economic periods, including the volatility resulting from the COVID-19 pandemic (notably, the repeal also had the consequence of giving a tax preference to commissions over fees when it comes to paying for financial advice, as commissions subtracted directly from an investment remained implicitly a pre-tax payment). Since then, representatives from the coalition have found that lawmakers from both major parties have been receptive to restoring the incentive, though it appears that it might not make it into this round of tax legislation (notably, though other priorities of advisor-related trade groups were included in the House-passed legislation, including extending the Qualified Business Income deduction [which is actually expanded in the House legislation] and allowing funds in 529 plans to be used to pay for post-secondary credentials, such as the CFP certification). In the end, while TCJA rules regarding the (non) deductibility of advisory fees appear poised to remain law (barring any last minute changes to the proposed legislation), there currently remain at least a few ways for some clients to access tax benefits for advisory fees, including taking them from accounts in a tax-efficient manner or deducting them as a business expense when possible. Nonetheless, such domains for advice fee deductibility remain limited, such that if the coalition's proposal is if enacted in the future, it could both level the playing field between those providing advice on an asset or fee-for-service basis and those who receive commissions, and simply make paying fees for financial advice a potentially more attractive proposition for clients! Schwab To Launch Membership Program Targeting Breakaways (Alex Ortolani | WealthManagement) Advisors looking to break away from wirehouses and other more captive models have long had the option to 'go independent' and start their own RIA. At the same time, for those who might have been used to the support provided by their previous firm (e.g., tech stacks and compliance support) taking on these responsibilities on their own often seems daunting. With this in mind, a variety of platforms (e.g., Dynasty Financial Partners, Sanctuary Wealth, Steward Partners, and XY Planning Network, among others) offer the opportunity to achieve 'supported independence', allowing the breakaway advisor to focus more of their time on serving clients rather than certain other (potentially time-consuming) aspects of running their business. This week, Charles Schwab (the largest RIA custodian) announced that it is launching a membership program of its own, dubbed Schwab Advisor ProDirect, targeting breakaway advisors with $50 million to $300 million in client assets who want to make the jump to the RIA model and wish to circumvent the supported-independence platforms to 'Go Direct' with Schwab instead. Those joining ProDirect, which is expected to launch in July, will pay a $5,250 quarterly membership fee (with a one-year initial membership that is renewable quarterly beyond the initial period), which will include support in four areas: launching an RIA; coaching and educational resources, including dedicated business consultants; \"connecting\" to the community of other participants and to curated products from third-party vendors (with potential discounts); and ongoing access to Schwab research and training. Notably, Schwab said that its core onboarding and custody services will not change with the addition of the ProDirect offering; it is an optional consulting support layer on top of Schwab's RIA custodial platform (and thus the additional membership fee). In sum, Schwab's offering represents a new entry into the growing supported independence platform ecosystem and gives the custodial giant the chance to attract new firms and the client assets they bring to its platform. For advisors looking to launch their own firm, Schwab's platform offers a new option and could be attractive to advisors looking to pay a (albeit sizeable) flat fee for consultative support (rather than a basis point fee based on revenue or assets under management) and value the services being offered. Zooming out to the 'supported independence' space writ large, though, Schwab's move is notable in that it had previously invested in Dynasty a few years ago, with rumors that it would make further investments in similar supported independence platforms (that help draw breakaway brokers to the RIA channel, and also to Schwab's platform). Which means this week's move to launch Schwab Advisor ProDirect signals a major change in approach as Schwab begins to steer firms to 'Go Direct' instead (even at the potential cost of competing with the supported independence platforms that previously helped fuel Schwab's growth)? Leveraging TIPS For Clients Fearing Inflation In Retirement (Guy Baker | WealthManagement) In the first couple decades of the 2000s, which saw relatively low and stable rates of inflation, it might have been easy for some clients to forget about the potential effects of price increases on their purchasing power in retirement. However, the inflationary spike that started in 2021 might have spurred new concerns among clients and conversations with their advisors as to how they might combat future bouts of inflation. One potential tool for advisors and their clients is to leverage Treasury Inflation-Protected Securities (TIPS). With TIPS, the bond's principal increases at the same rate as the Consumer Price Index (CPI), with the interest payment (which is a fixed percentage of the principal) rising in turn. In the event of deflation (i.e., a negative CPI), the reverse occurs, and the principal and interest payments are both reduced (though, when they mature, TIPS will return the greater of the inflation-adjusted principal of the original face value of the bond, protecting investors in extended deflationary periods). TIPS could potentially be useful for a range of clients, including those who are seeking lower-risk investments (particularly related to default risk, as TIPS are backed by the U.S. government), have a long-term horizon (to benefit from inflation adjustments over time), are seeking additional portfolio diversification, and/or are concerned about inflation-induced erosion in their fixed income holdings (as other bonds can suffer in real terms in inflationary environments). Nonetheless, there are several factors for advisors and clients to take into account when considering investments in TIPS. To start, while TIPS may outperform other bonds during future inflationary periods, they could offer a lower return than other types of Treasury bonds if inflation is lower than anticipated. In addition, given that TIPS produce both interest income and 'phantom income' (i.e., the amount the principal of TIPS increased during the year, which is taxable even though no actual money has been received), advisors could consider purchasing them in clients' tax-advantaged retirement accounts. Also, if individual TIPS aren't held until maturity (i.e., sold on the secondary market), they could be subject to liquidity, volatility, and interest rate risk. Ultimately, the key point is that TIPS can be an attractive option for clients looking to hedge against future inflation (e.g., retired clients looking to maintain a relatively steady standard of living) and offer financial advisors the opportunity add value not only by identifying the best way for their clients to invest in TIPS (e.g., a TIPS fund versus building a 'TIPS ladder' of individual securities with different maturities to match expected spending needs), but, at a more basic level, helping the client determine whether TIPS are the right tool to meet their financial goals. Weighing The Advantages And Disadvantages Of A TIPS Ladder Vs A TIPS Index Fund (Rick Miller | Sensible Financial Planning) Treasury Inflation-Protected Securities (TIPS) can be an attractive way to support future spending needs (particularly in retirement) by offering protection against future unanticipated inflation. Notably, investors have options when it comes to how to invest in TIPS, including purchasing individual TIPS or a TIPS index fund. When purchasing individual TIPS, investors (or their advisors) will frequently create a 'ladder' of TIPS with maturities matching their future expected spending needs. Similarly, TIPS mutual funds will purchase TIPS with a variety of maturities (though these might not line up exactly with a client's future spending needs). In general, TIPS index funds offer more convenience than a TIPS ladder, including the ability to be purchased at the price of a single share and the ability to sell shares with a high level of liquidity. However, this convenience comes at the cost of customization (e.g., the ability to match the timing of the spending needs of a given investor) and the introduction of interest rate risk (as while the share price of a TIPS index fund will vary based on movements in interest rates, the return on individual TIPS held to maturity will not be affected by interest rates), though this factor could be either beneficial or harmful to the client depending on whether rates rise or fall and whether the interest rate change occurs relatively early or late in retirement (suggesting that TIPS ladders might be favored by clients who prefer certainty over potential upside). In sum, while both TIPS ladders and TIPS index funds offers the inflation-mitigation benefits of TIPS, they vary in terms of the difficulty of investment and liquidity (with index funds holding the advantage in these regards), exposure to interest rate risk (with a TIPS ladder offering less exposure, when bonds are held to maturity), and certainty of income (with the TIPS ladder having an advantage). Which presents advisors with the opportunity to support clients by evaluating their clients' income needs (and flexibility), risk tolerance, and ability to commit to a (potentially long-term) strategy and choosing the best option for their needs. Combining SPIA With TIPS To Address Longevity And Inflation Risk In Retirement (Edward McQuarrie | Journal Of Financial Planning) For clients looking to hedge against longevity risk and secure a steady stream of retirement income, Single Premium Immediate Annuities (SPIAs) can be an attractive option. However, because these the payments on these annuities typically aren't adjusted for inflation, the purchasing power of the fixed payments can erode over time (e.g., after 26 years, the real value of the payment will be reduced by 40% if inflation was 2% over the period and by 70% if inflation runs at 5%). Which can lead advisors and their clients using SPIAs to find ways to mitigate future inflation. One potential option for an advisor and their client could be to use other retirement assets to purchase Treasury Inflation-Protected Securities (TIPS) alongside a SPIA to provide a measure of inflation protection (notably, TIPS could also be used to provide inflation protection alongside a defined-benefit pension that isn't adjusted for inflation). A key question, though, is determining the 'right' combination of assets to contribute to each investment. This decision could be made in part based on a client's tolerance for future inflation (and the flexibility of their income). For instance, a client with high fixed spending needs might dedicate more money to the TIPS ladder to better protect against inflation, while a client who would prefer a larger monthly income (at the risk that its purchasing power could be eroded if inflation were high in the future) might contribute more to the SPIA. McQuarrie suggests a starting point of allocating one-half of the assets invested in the SPIA into a TIPS ladder, adjusting this amount based on the client's inflation risk tolerance (with risk-avoidant clients investing more into the TIPS ladder). In the end, while SPIAs and TIPS each bring benefits to the table (as well as potential drawbacks), they could potentially be more effective in tandem to help clients protect against both longevity and inflation risk in retirement. Which suggests that advisors can add value for their clients not only by explaining the potential benefits of such a combination (and, more basically, highlight the potential danger of longevity and inflation risk) but also by exploring the optimal ratio of assets to invest in these instruments based on their risk tolerance and inflation expectations and by helping them execute such a strategy. Aligning Talent With Team Needs When Hiring  (Matt Sonnen | WealthManagement) When making their first hires, firm founders might seek out candidates who have a broad range of skills and strengths, as the new employee might be tasked with covering a variety of functions (e.g., client service tasks as well as preliminary planning responsibilities). However, taking this approach can potentially prove costly as a firm grows and requires more specialized expertise from each new employee. Before listing a new position, firms (particularly more mature ones) might first take stock of their current staff composition and business needs. For example, by having staff members evaluate their strengths, weaknesses, and aspirations (as they might seek different positions within the firm in the future), firm leadership can get a better idea of where skills gaps might currently exist (or could emerge in the future). Similarly, analyzing recent projects and overall firm performance might identify skill gaps that could be filled by a new hire. With a potential role identified, crafting a job description that clearly defines the specific skills and experience required for the position as well as the key job duties and expectations that it will entail will both help attract candidates who have these skills and ensure their expectations for the position match the reality (which can help prevent staff turnover resulting from expectation mismatches). Then, with potential candidates identified, using the interview process to explore their past experiences and assess how they've handled previous challenges can help determine whether their skills might be a good match for the firm's needs. In addition, bringing team members into the interview process can help determine whether candidates fit the firm's culture. Ultimately, the key point is that while it can be tempting to seek job candidates with broad-based experience and skills, hiring such individuals can potentially lead to duplicative skillsets (particularly when the firm has a broader employee base) and less return for the firm. Instead, identifying skills gaps and filling them with 'specialists' who have the strengths and experience to thrive in those roles can help the firm operate at peak performance. The Ups And Downs Of Hiring A Child (Or Joining A Parent's Practice) (Anne Field | Barron's) For firm founders who are also parents, hiring a child into the firm can potentially offer a variety of benefits, from being intimately familiar with their child's skills and personality to offering a possible succession path for the parent when they eventually decide to retire. However, bringing a child into the fold can also come with unique considerations that might not apply to a non-family hire. Well setting expectations is an important part of bringing on any hire, it can be particularly valuable when hiring a child, as the parent might have very different expectations (e.g., role and potential to take over firm leadership) than the child (who might be unsure whether they want to have a long-term career in financial advice). Also, as the child advances in the firm, they might have a different direction in mind for the business, suggesting that regular communication with their parent could ensure both parties are on the same page. Also, if a firm already has employees, bringing on a child can require particular care, as the incumbents might be watchful for any special treatment given to the new hire. Similarly, clients might need reassurance that the child is qualified for the position they're taking within the firm. To address this issue, a child interested in financial planning might first work at another firm (or gain separate skills [e.g., advanced portfolio management or tax credentials] that could be valuable) before joining their parents' business. Further, if the founder has multiple children, only bringing one on could complicate estate planning for the parent (who might be hesitant to give equity in the firm only to the child who works there). Altogether, while bringing a child into a firm can be an attractive proposition for both a parent (not only from a business perspective, but also for the opportunity to spend more time with them) and for the child themselves (as they could find a supportive environment in which to grow their advisory career and possibly a direct path to firm ownership), taking a thoughtful approach to doing so (including keeping the perspectives of other stakeholders in mind) can improve the chances that it will be a successful hire. How RIAs Can Launch An Effective Internship Program To Recruit Talent (Richard Chen | Journal Of Financial Planning) In the competitive environment for advisor talent, one potential way for firms to identify next-gen employees is to implement an internship program, which not only can serve as a force multiplier during the length of the internship, but also can serve as a trial run for potential full-time employees (giving the firm the chance to see how they operate in the real world rather than just on their resume or in an interview), and demonstrate the firm's commitment to attracting and developing fresh talent. A first step for firms thinking about establishing an internship program is to identify the specific, roles, responsibilities, and objectives that the intern(s) will take on. Next, identifying multiple sources of potential interns (e.g., participating in a job fair at a local college), can create a more robust pipeline from which to choose. Also, making the position attractive (e.g., by allowing the intern to take on meaningful work and providing adequate compensation) can further increase the quality of the intern candidate pool. Further, being clear about the potential for the internship to turn into a full-time position after graduation (and what the intern could expect in terms of career development if they do become an employee) can set proper expectations between the firm and potential interns. And once an intern does join the firm, investing in a smooth onboarding process and offering mentorship opportunities can provide the intern with a better experience (which might not only encourage them to accept a full-time job offer if it comes, but also to speak highly of the firm with their peers who might also be looking for job opportunities). In the end, while establishing and executing an effective internship program requires an investment of time and money from a firm, doing so can potentially pay dividends in the form of additional work support, better talent identification and, ultimately, a more vibrant and sustainable firm. 4 Techniques To Master The Art Of Listening (Debra Schifrin | Harvard Business Review) People who are considered good communicators are often those who can express themselves clearly, whether in a public forum or in a smaller conversation. However, communicating well is not only a matter of conveying one's thoughts effectively, but also of being an active listener as well (lest the content of one's comments not accurately reflect the discussion at hand!). One way to become a more adept listener is to \"listen to the end\" where possible. For example, when listening to a conversational partner, it can be tempting to think about how you want to respond while they're still speaking, interrupting with a solution, or offering an example from your own life. Instead, by focusing on what the interlocutor has to say, you can better understand their point and offer a better response (and make them feel more respected and heard in the process). Another tactic is to listen to summarize rather than solve. By summarizing what your conversational partner has to say, you can have a better understanding of their message and avoid jumping right into possible solutions (that might not be solving the right problem!). Also, putting the content of the speaker's comments into the context of your relationship with them can provide a more nuanced view of what they're trying to communicate and give clues to what an appropriate response might entail (e.g., the response to a comment from a peer might differ from that to a subordinate). Finally, listening in the context of the speaker's values and experiences can help identify the underlying message they're trying to communicate (e.g., a comment about a missed deadline might not just be about this particular incident, but rather part of a pattern of feeling disrespected). In sum, listening well is in part a function of both turning attention away from one's own thoughts and better understanding what a conversational partner is trying to communicate. Which can not only lead to better understanding of what's being discussed, but also, ultimately, greater respect as a communicator. Huh? The Valuable Role Of Interjections (Bob Holmes | Knowable Magazine) When remembering a conversation, an individual will likely remember the key messages and words that were spoken. However, in reality, conversational flow is not just a matter of the primary words being used, but also the small interjections (e.g., huh or mmhmm) that can provide signals to a speaker about how their interlocutor is receiving their comments. While it might be tempting to remove such 'filler' language, these interjections can communicate important messages (and are found across a wide range of languages). For instance, \"huh?\" can be used as a \"repair signal\" used by a listener to quickly indicate they don't understand the speaker's message (before the speaker can go on and take the conversation in an unproductive direction). In addition, \"continuers\" like \"mmhmm\" can signal to a speaker that their counterpart is actively listening and to continue with their comments (further, because this interjection can be made without opening one's mouth, it signals that the counterpart doesn't intend to speak themselves). And while many interjections are encouraging, some can shift the tone of a conversation in a negative direction (e.g., a sarcastic and elongated \"ohhh\"), suggesting care to ensure the purpose of including an interjection is clear (even if the interjection itself is short). Altogether, while it can be easy to ignore interjections (or even treat them as 'fillers' to be eliminated), they can serve an important role in demonstrating understanding and maintaining conversational flow (and, as a bonus, interjections are one of the hardest parts of language for AI tools to master, so their use can demonstrate one's humanness when interacting with someone remotely!). What To Do When Someone Stops Listening To You (Allison Shapira | Harvard Business Review) It's common to be in a conversation and recognize that your counterpart isn't paying complete attention to what you're saying (whether because they're actively doing something else like scrolling through their phone or just seem zoned out or inattentive). While this can be an annoying situation, recognizing that you've lost the other person's attention provides an opportunity to take steps to get the conversation back on track. One tactic is to step back to \"pause and breathe\", which can give you a chance to plan an approach without making a hasty comment. Also, before addressing the listener, it can help to assume positive intent on their part (i.e., considering that they're not necessarily being disrespectful, but instead might be confused or have something else going on in their life that's at the forefront of their minds). For instance, a financial planning client might zone out if their advisor launches into a lengthy, jargon-filled monologue that they don't understand. After calming your own mind down, one way to get the conversation back on track is to ask the listener an open-ended question (e.g., \"How have you handled this before?\" or \"What do you think?\"), which can encourage the counterpart to provide a substantive answer (and can lead to opportunities to ask follow-up questions that can keep the conversation going). Another potential tactic is to change the rhythm of the conversation, perhaps by allowing for a period of silence (which might snap the counterpart's attention back to the conversation), or by shifting one's physical position (e.g., standing up or sitting down) which can reset the listener's attention. Ultimately, the key point is that while active listening is a sign of respect, not being fully dialed in isn't necessarily a sign of disrespect. Instead, speakers can gauge the situation and offer the opportunity for a 'reset', which can keep the conversation flowing without making assumptions about the listener's intent. We hope you enjoyed the reading! Please leave a comment below to share your thoughts, or send an email to [email protected] to suggest any articles you think would be a good fit for a future column! In the meantime, if you're interested in more news and information regarding advisor technology, we'd highly recommend checking out Craig Iskowitz's \"Wealth Management Today\" blog. Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2025/01/Social-Image-Blog-Article-Weekend-Reading-2025.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003eEnjoy the current installment of \u0026#34;Weekend Reading For Financial Planners\u0026#34; – this week\u0026#39;s edition kicks off with the news that a recent survey of RIA employee compensation and wellbeing found that advisors appear broadly satisfied with their jobs and (perhaps unsurprisingly) identified a positive correlation between income and happiness at work (though separate research suggests other factors might contribute more to advisor wellbeing). The survey also demonstrates the potential income upside for advisory firm employees who advance in their firms, with CEO respondents reporting average total annual compensation (including salary, cash bonuses, and non-cash compensation) of more than $900,000 (client-facing advisors surveyed had strong earnings as well, with average total compensation of more than $400,000). Altogether, while the pool of respondents was somewhat limited (and appears to skew senior in rank), the survey suggests that financial advice can be a lucrative career, in terms of compensation, a sense of meaning, and overall wellbeing.\u003c/p\u003e\n\u003cp\u003eAlso in industry news this week:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWhile the latest iteration of Republicans\u0026#39; major tax legislation does not restore financial advisory fees as a potentially deductible expense, a coalition of organizations continue to push for it to be added to future legislation\u003c/li\u003e\n\u003cli\u003eCharles Schwab announced this week that it is launching a program to help breakaway advisors launch and grow an independent RIA, offering a new option in the market of \u0026#39;supported independence\u0026#39; platforms\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFrom there, we have several articles on retirement planning:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHow Treasury Inflation-Protected Securities (TIPS) can help mitigate inflation risk and maintain a client\u0026#39;s purchasing power throughout retirement\u003c/li\u003e\n\u003cli\u003eComparing the relative and disadvantages of creating a TIPS \u0026#39;ladder\u0026#39; versus investing in a TIPS index fund and how advisors can identify which types of clients could benefit from each\u003c/li\u003e\n\u003cli\u003eHow combining a single premium immediate annuity with a TIPS ladder can help mitigate both longevity and inflation risk for a client\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe also have a number of articles on practice management:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWhy seeking a \u0026#39;specialist\u0026#39; to fill specific firm needs can often lead to better results for more mature advisory firms than hiring a talented generalist\u003c/li\u003e\n\u003cli\u003eConsiderations for firm founders who are considering hiring their child into the business, including the need to ensure buy-in from key stakeholders\u003c/li\u003e\n\u003cli\u003eHow RIAs can launch effective internship programs, from creating a position that offers the opportunity to perform meaningful work to providing mentorship opportunities to interns\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe wrap up with three final articles, all about how to be a better listener:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFour techniques to be a better listener, including the skill of seeking to summarize what a speaker is saying rather than immediately identifying a solution\u003c/li\u003e\n\u003cli\u003eHow interjections such as \u0026#34;huh?\u0026#34; and \u0026#34;mmhmm\u0026#34; can help guide conversations and demonstrate that an individual is paying attention to what a speaker has to say\u003c/li\u003e\n\u003cli\u003eTechniques for getting back on track when a conversational partner has zoned out\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEnjoy the \u0026#39;light\u0026#39; reading!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg width=\"200\" height=\"200\" data-src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" alt=\"Adam Van Deusen Headshot\" decoding=\"async\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\" data-sizes=\"(max-width: 200px) 100vw, 200px\" src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eAdam is a Financial Planning Nerd at \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits.\u003c/p\u003e\n\u003cp\u003eRead more of Adam’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=7517\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003ch2 data-nav-title=\"Insights Into RIA Employees\u0026#39; Salaries\" id=\"pay-report-offers-insights-into-ria-employees-salaries-bonuses-and-equity-compensation\"\u003e\u003cspan\u003e\u003ca href=\"https://citywire.com/ria/news/heres-how-much-ria-employees-get-paid/a2464353\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003ePay Report Offers Insights Into RIA Employees\u0026#39; Salaries, Bonuses, And Equity Compensation\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Andrew Foerch | Citywire RIA)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhile working as a financial advisor can be a particularly meaningful job (given the opportunity to help clients live their best lives), it can also offer attractive compensation as well. To help analyze how pay differs across different types of positions and demographics, Citywire RIA conducted a survey of its readers, with 106 independent advisors responding (notably, while these respondents came from a variety of backgrounds, they might not represent a comprehensive cross-section of the RIA employee population, and numbers may be off given the limited sample size).\u003c/p\u003e\n\u003cp\u003eOverall, total compensation not surprisingly varied by position, with CEO respondents earning the most total income (including annual salary and any cash- and non-cash bonuses, and likely including profit distributions as well), with more than $910,000 per year on average, followed by client-facing advisors ($442,040, again likely including both W-2 compensation and profit distributions) and chief investment officers ($377,000). In terms of firm type, employees of RIAs reported higher compensation than those at hybrid firms or Offices of Supervisory Jurisdiction (OSJs), $454,000 versus $373,000, buoyed in part by greater cash bonuses (e.g., higher profit distributions). Comparing compensation by gender, salaries for men and women were nearly identical ($271,000 and $269,000, respectively), but total compensation was lower for women due to lower cash bonuses and non-cash compensation (perhaps impacted by the lack of CEOs [who reported significantly larger cash and non-cash bonuses than other positions] and relatively small number of CIOs among female respondents, and more generally \u003ca href=\"https://www.kitces.com/blog/gender-pay-gap-financial-advisor-compensation-men-vs-women-discrimination-preferences-kitces-research/\"\u003ethe lower rate of women owning their own advisory firms and participating directly in the profits thereof\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eThe report also showed respondents were generally happy with their work, with 42 saying they were \u0026#34;very happy\u0026#34; and another 40 reporting being \u0026#34;happy\u0026#34; (with only 7 being \u0026#34;unhappy\u0026#34; and only 1 saying they were \u0026#34;very unhappy\u0026#34;). The survey showed a positive correlation between happiness and salary, with \u0026#34;very happy\u0026#34; respondents having an average salary of $307,000, \u0026#34;happy\u0026#34; respondents with $271,000, and \u0026#34;unhappy\u0026#34; respondents reporting an average salary of $166,000. Similarly, \u003ca href=\"https://www.kitces.com/kitces-report-financial-advisor-wellbeing-perma-framework-designations-compensation-stress-community-social-support/\"\u003eKitces Research on Advisor Wellbeing\u003c/a\u003e (which surveyed a larger number and broader swath of the advisor community) also found that respondents tended to show high levels of wellbeing (an average of 6.8 on a 10-point scale) and that wellbeing was positively correlated with income. However, the Kitces Research study also found that higher income itself was not necessarily the primary driver of greater wellbeing; instead, factors such as autonomy (i.e., control over their work schedules and confidence in their ability to perform their work), experience, and team structure (with advisors who work in ensemble firms and enjoy this structure reporting greater wellbeing) were found to play primary roles in identifying \u0026#39;thriving\u0026#39; advisors.\u003c/p\u003e\n\u003cp\u003eAltogether, the Citywire survey (while somewhat limited in its reach) shows the potential income upside for advisors at RIAs (at least for those who are able to stay in the industry long enough to gain experience and advance to more senior advisory or leadership levels, and/or who found their own firms and participate in the profit distributions as well). Further, the survey and Kitces Research suggest that a career in financial advice can also contribute to overall wellbeing, whether because of the sense of meaning that such a career can provide and/or the autonomy and flexibility different career paths can offer!\u003c/p\u003e\n\u003ch2 data-nav-title=\"RIA Advocates Push For Advice Incentive\" id=\"as-major-tax-legislation-nears-finish-line-ria-advocates-push-for-financial-advice-incentive\"\u003e\u003cspan\u003e\u003ca href=\"https://citywire.com/ria/news/as-house-negotiates-tax-bill-ria-advocates-push-for-financial-advice-incentive/a2466133\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eAs Major Tax Legislation Nears Finish Line, RIA Advocates Push For Financial Advice Incentive\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Sam Bojarski | Citywire RIA)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOne of the many changes made by the \u003ca href=\"https://www.kitces.com/blog/final-gop-tax-plan-summary-tcja-2017-individual-tax-brackets-pass-through-strategies/\"\u003eTax Cuts and Jobs Act of 2017\u003c/a\u003e was the repeal of miscellaneous itemized deductions, which was especially concerning to many financial advisors, as it included the elimination of the deduction for investment advisory fees (though not all taxpayers were eligible to claim a deduction for advisory fees in the first place, as not only did it require the taxpayer to itemize and exceed 2% of the taxpayer\u0026#39;s AGI along with other miscellaneous itemized deductions, but even then, could be lost to the Alternative Minimum Tax [AMT]). Notably, though, this repeal is \u003ca href=\"https://www.kitces.com/blog/tax-cut-and-jobs-act-tcja-sunset-marginal-tax-rates-personal-exemption-phaseout-pease-limitation-qbi-deduction/\"\u003eone of the many parts of the TCJA set to \u0026#39;sunset\u0026#39; at the end of 2025\u003c/a\u003e (along with marginal tax rates and the estate tax exemption, among other measures), making it a potential part of expected Congressional negotiations regarding the extension of the expiring provisions.\u003c/p\u003e\n\u003cp\u003eThis week the House of Representatives passed legislation that would make \u0026#39;permanent\u0026#39; (i.e., without a scheduled sunset) \u003ca href=\"https://www.kitces.com/blog/republican-proposed-tax-bill-2025-tax-cuts-and-jobs-act-tcja-sunset-salt-deduction-cap-child-tax-credit-qbi-deduction-maga/\"\u003emany parts of the TCJA, including its tax bracket structure and higher standard deduction\u003c/a\u003e. However, the proposed legislation would also \u0026#39;permanently\u0026#39; extend the elimination of miscellaneous itemized deductions exceeding 2% of AGI (including expenses such as investment fees), a cost-saving tactic as Republicans seek to advance similar tax legislation through the Senate using the \u003ca href=\"https://bipartisanpolicy.org/explainer/budget-reconciliation-simplified/\"\u003ereconciliation process\u003c/a\u003e, which wouldn\u0026#39;t require support for the legislation from Democrats (but requires that the budget deficit not increase beyond the budget window [typically 10 years] per the associated \u003ca href=\"https://www.pgpf.org/programs-and-projects/fiscal-policy/understanding-complex-budget-terms-and-processes-and-why-they-matter/#byrd-rule\"\u003e\u0026#34;Byrd Rule\u0026#34;\u003c/a\u003e). Nonetheless, advocates for restoring the deductibility of advisory fees are continuing to advocate for it, whether in the current major legislation or perhaps as part of a package attached to other financial services bills.\u003c/p\u003e\n\u003cp\u003eA coalition that includes CFP Board, the Investment Adviser Association, the Financial Services Institute, the National Association of Personal Financial Advisors (NAPFA), and the Financial Planning Association (FPA) in September sent a \u003ca href=\"https://www.cfp.net/-/media/files/cfp-board/news/2024/coalition-letter-fee-deductibility.pdf\"\u003eletter\u003c/a\u003e to the Chair of the House Ways and Means Committee urging Congress to restore the incentive, arguing that the repeal of the limited deduction for investment advisory and financial planning fees led to an \u0026#34;unintended consequence\u0026#34; of raising the cost of financial advice, highlighting the particular value of financial advice during turbulent economic periods, including the volatility resulting from the COVID-19 pandemic (notably, the repeal also had the consequence of \u003ca href=\"https://www.kitces.com/blog/tax-deduction-financial-advisor-fees-commissions-ira-taxable-section-212-expense-tcja/\"\u003egiving a tax preference to commissions over fees when it comes to paying for financial advice, as commissions subtracted directly from an investment remained implicitly a pre-tax payment\u003c/a\u003e). Since then, representatives from the coalition have found that lawmakers from both major parties have been receptive to restoring the incentive\u003cstrong\u003e, though it appears that it might not make it into this round of tax legislation (notably, though other priorities of advisor-related trade groups were included in the House-passed legislation, including extending \u003c/strong\u003e\u003ca href=\"https://www.kitces.com/blog/pass-through-business-deduction-rules-qualified-business-income-qbi-limits/\"\u003e\u003cstrong\u003ethe Qualified Business Income deduction\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e [which is actually expanded in the House legislation] and allowing funds in 529 plans to be used to pay for post-secondary credentials, such as the CFP certification).\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the end, while TCJA rules regarding the (non) deductibility of advisory fees appear poised to remain law (barring any last minute changes to the proposed legislation), there \u003ca href=\"https://www.kitces.com/blog/investment-advisory-fee-deduction-post-tcja-ira-expense-ratio-etf-limited-partnership/\"\u003ecurrently remain at least a few ways for some clients to access tax benefits for advisory fees\u003c/a\u003e, including taking them from accounts in a tax-efficient manner or deducting them as a business expense when possible. Nonetheless, such domains for advice fee deductibility remain limited, such that if the coalition\u0026#39;s proposal is if enacted in the future, it could both level the playing field between those providing advice on an asset or fee-for-service basis and those who receive commissions, and simply make paying fees for financial advice a potentially more attractive proposition for clients!\u003c/p\u003e\n\u003ch2 data-nav-title=\"Schwab To Launch Membership Program\" id=\"schwab-to-launch-membership-program-targeting-breakaways\"\u003e\u003cspan\u003e\u003ca href=\"https://www.wealthmanagement.com/ria-news/schwab-to-launch-membership-program-targeting-breakaway-rias\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eSchwab To Launch Membership Program Targeting Breakaways\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Alex Ortolani | WealthManagement)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAdvisors looking to \u003ca href=\"https://www.kitces.com/blog/aum-revenue-requirement-breaking-away-wirehouse-broker-to-independent-ria/\"\u003ebreak away from wirehouses\u003c/a\u003e and other more captive models have long had the option to \u003ca href=\"https://www.kitces.com/blog/17-steps-breakaway-broker-advisor-transition-services-grier-rubeling-ria-paperwork-checklists-scripts/\"\u003e\u0026#39;go independent\u0026#39;\u003c/a\u003e and start their own RIA. At the same time, for those who might have been used to the support provided by their previous firm (e.g., tech stacks and compliance support) taking on these responsibilities on their own often seems daunting. With this in mind, a variety of platforms (e.g., \u003ca href=\"https://dynastyfinancialpartners.com/\"\u003eDynasty Financial Partners\u003c/a\u003e, \u003ca href=\"https://sanctuarywealth.com/\"\u003eSanctuary Wealth\u003c/a\u003e, \u003ca href=\"https://www.stewardpartners.com/\"\u003eSteward Partners\u003c/a\u003e, and \u003ca href=\"https://www.xyplanningnetwork.com/\"\u003eXY Planning Network\u003c/a\u003e, among others) \u003ca href=\"https://www.kitces.com/blog/future-advisor-platforms-tech-enabled-services-not-technology-ria-broker-dealer/\"\u003eoffer the opportunity to achieve \u0026#39;supported independence\u0026#39;\u003c/a\u003e, allowing the breakaway advisor to focus more of their time on serving clients rather than certain other (potentially time-consuming) aspects of running their business.\u003c/p\u003e\n\u003cp\u003eThis week, Charles Schwab (the largest RIA custodian) \u003ca href=\"https://pressroom.aboutschwab.com/press-releases/press-release/2025/Schwab-Advisor-Services-Announces-Schwab-Advisor-ProDirect-Membership-Program-for-Advisors-Going-Independent/default.aspx\"\u003eannounced\u003c/a\u003e that it is launching a membership program of its own, dubbed Schwab Advisor ProDirect, targeting breakaway advisors with $50 million to $300 million in client assets who want to make the jump to the RIA model and wish to circumvent the supported-independence platforms to \u0026#39;Go Direct\u0026#39; with Schwab instead. Those joining ProDirect, which is expected to launch in July, will pay a $5,250 quarterly membership fee (with a one-year initial membership that is renewable quarterly beyond the initial period), which will include support in four areas: launching an RIA; coaching and educational resources, including dedicated business consultants; \u0026#34;connecting\u0026#34; to the community of other participants and to curated products from third-party vendors (with potential discounts); and ongoing access to Schwab research and training. Notably, Schwab said that its core onboarding and custody services will not change with the addition of the ProDirect offering; it is an optional consulting support layer \u003cem\u003eon top \u003c/em\u003eof Schwab\u0026#39;s RIA custodial platform (and thus the additional membership fee).\u003c/p\u003e\n\u003cp\u003eIn sum, Schwab\u0026#39;s offering represents a new entry into the growing supported independence platform ecosystem and gives the custodial giant the chance to attract new firms and the client assets they bring to its platform. For advisors looking to launch their own firm, Schwab\u0026#39;s platform offers a new option and could be attractive to advisors looking to pay a (albeit sizeable) flat fee for consultative support (rather than a basis point fee based on revenue or assets under management) and value the services being offered. Zooming out to the \u0026#39;supported independence\u0026#39; space writ large, though, Schwab\u0026#39;s move is notable in that \u003ca href=\"https://www.wealthmanagement.com/ria-news/schwab-s-investment-in-dynasty-could-be-the-first-of-many\"\u003eit had previously invested in Dynasty a few years ago, with rumors that it would make further investments in similar supported independence platforms\u003c/a\u003e (that help draw breakaway brokers to the RIA channel, and also to Schwab\u0026#39;s platform). Which means this week\u0026#39;s move to launch Schwab Advisor ProDirect signals a major change in approach as Schwab begins to steer firms to \u0026#39;Go Direct\u0026#39; instead (even at the potential cost of competing with the supported independence platforms that previously helped fuel Schwab\u0026#39;s growth)?\u003c/p\u003e\n\u003ch2 data-nav-title=\"TIPS For Clients Fearing Inflation\" id=\"leveraging-tips-for-clients-fearing-inflation-in-retirement\"\u003e\u003cspan\u003e\u003ca href=\"https://www.wealthmanagement.com/fixed-income/inflation-fighting-tips-for-today-s-uncertain-times\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eLeveraging TIPS For Clients Fearing Inflation In Retirement\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Guy Baker | WealthManagement)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the first couple decades of the 2000s, which saw relatively low and stable rates of inflation, it might have been easy for some clients to forget about the potential effects of price increases on their purchasing power in retirement. However, the inflationary spike that started in 2021 might have spurred new concerns among clients and \u003ca href=\"https://www.kitces.com/blog/client-conversations-high-inflation-cash-management-tips-taxes/\"\u003econversations with their advisors as to how they might combat future bouts of inflation\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eOne potential tool for advisors and their clients is to leverage Treasury Inflation-Protected Securities (TIPS). With TIPS, the bond\u0026#39;s principal increases at the same rate as the Consumer Price Index (CPI), with the interest payment (which is a fixed percentage of the principal) rising in turn. In the event of deflation (i.e., a negative CPI), the reverse occurs, and the principal and interest payments are both reduced (though, when they mature, TIPS will return the greater of the inflation-adjusted principal of the original face value of the bond, protecting investors in extended deflationary periods). TIPS could potentially be useful for a range of clients, including those who are seeking lower-risk investments (particularly related to default risk, as TIPS are backed by the U.S. government), have a long-term horizon (to benefit from inflation adjustments over time), are seeking additional portfolio diversification, and/or are concerned about inflation-induced erosion in their fixed income holdings (as other bonds can suffer in real terms in inflationary environments).\u003c/p\u003e\n\u003cp\u003eNonetheless, there are several factors for advisors and clients to take into account when considering investments in TIPS. To start, while TIPS may outperform other bonds during future inflationary periods, they could offer a lower return than other types of Treasury bonds if inflation is lower than anticipated. In addition, given that TIPS produce both interest income and \u0026#39;phantom income\u0026#39; (i.e., the amount the principal of TIPS increased during the year, which is taxable even though no actual money has been received), advisors could consider purchasing them in clients\u0026#39; tax-advantaged retirement accounts. Also, if individual TIPS aren\u0026#39;t held until maturity (i.e., sold on the secondary market), they could be subject to liquidity, volatility, and interest rate risk.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that TIPS can be an attractive option for clients looking to hedge against future inflation (e.g., retired clients looking to maintain a relatively steady standard of living) and offer financial advisors the opportunity add value not only by identifying the best way for their clients to invest in TIPS (e.g., a TIPS fund versus building a \u0026#39;TIPS ladder\u0026#39; of individual securities with different maturities to match expected spending needs), but, at a more basic level, helping the client determine whether TIPS are the right tool to meet their financial goals.\u003c/p\u003e\n\u003ch2 data-nav-title=\"TIPS Ladder Vs TIPS Index Fund\" id=\"weighing-the-advantages-and-disadvantages-of-a-tips-ladder-vs-a-tips-index-fund\"\u003e\u003cspan\u003e\u003ca href=\"https://www.sensiblefinancial.com/tips-ladder-vs-tips-index-fund-advantages-disadvantages/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eWeighing The Advantages And Disadvantages Of A TIPS Ladder Vs A TIPS Index Fund\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Rick Miller | Sensible Financial Planning)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTreasury Inflation-Protected Securities (TIPS) can be an attractive way to support future spending needs (particularly in retirement) by offering protection against future unanticipated inflation. Notably, investors have options when it comes to how to invest in TIPS, including purchasing individual TIPS or a TIPS index fund.\u003c/p\u003e\n\u003cp\u003eWhen purchasing individual TIPS, investors (or their advisors) will frequently create a \u0026#39;ladder\u0026#39; of TIPS with maturities matching their future expected spending needs. Similarly, TIPS mutual funds will purchase TIPS with a variety of maturities (though these might not line up exactly with a client\u0026#39;s future spending needs). In general, TIPS index funds offer more convenience than a TIPS ladder, including the ability to be purchased at the price of a single share and the ability to sell shares with a high level of liquidity. However, this convenience comes at the cost of customization (e.g., the ability to match the timing of the spending needs of a given investor) and the introduction of interest rate risk (as while the share price of a TIPS index fund will vary based on movements in interest rates, the return on individual TIPS held to maturity will not be affected by interest rates), though this factor could be either beneficial or harmful to the client depending on whether rates rise or fall and whether the interest rate change occurs relatively early or late in retirement (suggesting that TIPS ladders might be favored by clients who prefer certainty over potential upside).\u003c/p\u003e\n\u003cp\u003eIn sum, while both TIPS ladders and TIPS index funds offers the inflation-mitigation benefits of TIPS, they vary in terms of the difficulty of investment and liquidity (with index funds holding the advantage in these regards), exposure to interest rate risk (with a TIPS ladder offering less exposure, when bonds are held to maturity), and certainty of income (with the TIPS ladder having an advantage). Which presents advisors with the opportunity to support clients by evaluating their clients\u0026#39; income needs (and flexibility), risk tolerance, and ability to commit to a (potentially long-term) strategy and choosing the best option for their needs.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Combining SPIA With TIPS\" id=\"combining-spia-with-tips-to-address-longevity-and-inflation-risk-in-retirement\"\u003e\u003cspan\u003e\u003ca href=\"https://www.financialplanningassociation.org/learning/publications/journal/DEC24-help-clients-hedge-their-life-annuity-tips\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eCombining SPIA With TIPS To Address Longevity And Inflation Risk In Retirement\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Edward McQuarrie | Journal Of Financial Planning)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor clients looking to hedge against longevity risk and secure a steady stream of retirement income, \u003ca href=\"https://www.kitces.com/blog/understanding-the-true-impact-of-single-premium-immediate-annuities-on-retirement-income-sustainability/\"\u003eSingle Premium Immediate Annuities (SPIAs)\u003c/a\u003e can be an attractive option. However, because these the payments on these annuities typically aren\u0026#39;t adjusted for inflation, the purchasing power of the fixed payments can erode over time (e.g., after 26 years, the real value of the payment will be reduced by 40% if inflation was 2% over the period and by 70% if inflation runs at 5%). Which can lead advisors and their clients using SPIAs to find ways to mitigate future inflation.\u003c/p\u003e\n\u003cp\u003eOne potential option for an advisor and their client could be to use other retirement assets to purchase Treasury Inflation-Protected Securities (TIPS) alongside a SPIA to provide a measure of inflation protection (notably, TIPS could also be used to provide inflation protection alongside a defined-benefit pension that isn\u0026#39;t adjusted for inflation). A key question, though, is determining the \u0026#39;right\u0026#39; combination of assets to contribute to each investment. This decision could be made in part based on a client\u0026#39;s tolerance for future inflation (and the flexibility of their income). For instance, a client with high fixed spending needs might dedicate more money to the TIPS ladder to better protect against inflation, while a client who would prefer a larger monthly income (at the risk that its purchasing power could be eroded if inflation were high in the future) might contribute more to the SPIA. McQuarrie suggests a starting point of allocating one-half of the assets invested in the SPIA into a TIPS ladder, adjusting this amount based on the client\u0026#39;s inflation risk tolerance (with risk-avoidant clients investing more into the TIPS ladder).\u003c/p\u003e\n\u003cp\u003eIn the end, while SPIAs and TIPS each bring benefits to the table (as well as potential drawbacks), they could potentially be more effective in tandem to help clients protect against both longevity and inflation risk in retirement. Which suggests that advisors can add value for their clients not only by explaining the potential benefits of such a combination (and, more basically, highlight the potential danger of longevity and inflation risk) but also by exploring the optimal ratio of assets to invest in these instruments based on their risk tolerance and inflation expectations and by helping them execute such a strategy.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Aligning Talent With Team Needs\" id=\"aligning-talent-with-team-needs-when-hiring\"\u003e\u003cspan\u003e\u003ca href=\"https://www.wealthmanagement.com/recruiting/smart-hiring-for-rias-aligning-talent-with-team-needs\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Practice-Management\"\u003eAligning Talent With Team Needs When Hiring \u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Matt Sonnen | WealthManagement)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhen \u003ca href=\"https://www.kitces.com/blog/solo-advisor-ria-when-to-hire-employees-capacity-wall/\"\u003emaking their first hires\u003c/a\u003e, firm founders might seek out candidates who have a broad range of skills and strengths, as the new employee might be tasked with covering a variety of functions (e.g., client service tasks as well as preliminary planning responsibilities). However, taking this approach can potentially prove costly as a firm grows and requires more specialized expertise from each new employee.\u003c/p\u003e\n\u003cp\u003eBefore listing a new position, firms (particularly more mature ones) might first take stock of their current staff composition and business needs. For example, by having staff members evaluate their strengths, weaknesses, and aspirations (as they might seek different positions within the firm in the future), firm leadership can get a better idea of where skills gaps might currently exist (or could emerge in the future). Similarly, analyzing recent projects and overall firm performance might identify skill gaps that could be filled by a new hire.\u003c/p\u003e\n\u003cp\u003eWith a potential role identified, \u003ca href=\"https://www.kitces.com/blog/crafting-a-compelling-job-description-for-your-next-financial-planning-hire/\"\u003ecrafting a job description\u003c/a\u003e that clearly defines the specific skills and experience required for the position as well as the key job duties and expectations that it will entail will both help attract candidates who have these skills and ensure their expectations for the position match the reality (which can help prevent staff turnover resulting from expectation mismatches). Then, with potential candidates identified, using the interview process to explore their past experiences and assess how they\u0026#39;ve handled previous challenges can help determine whether their skills might be a good match for the firm\u0026#39;s needs. In addition, bringing team members into the interview process can help determine whether candidates fit the firm\u0026#39;s culture.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that while it can be tempting to seek job candidates with broad-based experience and skills, hiring such individuals can potentially lead to duplicative skillsets (particularly when the firm has a broader employee base) and less return for the firm. Instead, identifying skills gaps and filling them with \u0026#39;specialists\u0026#39; who have the strengths and experience to thrive in those roles can help the firm operate at peak performance.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Ups And Downs Of Hiring A Child\" id=\"the-ups-and-downs-of-hiring-a-child-or-joining-a-parents-practice\"\u003e\u003cspan\u003e\u003ca href=\"https://www.barrons.com/advisor/articles/advisors-joining-family-practice-42d83762\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Practice-Management\"\u003eThe Ups And Downs Of Hiring A Child (Or Joining A Parent\u0026#39;s Practice)\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Anne Field | Barron\u0026#39;s)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor firm founders who are also parents, hiring a child into the firm can potentially offer a variety of benefits, from being intimately familiar with their child\u0026#39;s skills and personality to offering a possible succession path for the parent when they eventually decide to retire. However, bringing a child into the fold can also come with unique considerations that might not apply to a non-family hire.\u003c/p\u003e\n\u003cp\u003eWell setting expectations is an important part of bringing on any hire, it can be particularly valuable when hiring a child, as the parent might have very different expectations (e.g., role and potential to take over firm leadership) than the child (who might be unsure whether they want to have a long-term career in financial advice). Also, as the child advances in the firm, \u003ca href=\"https://www.kitces.com/blog/financial-advisor-succession-marketing-niche-target-client-smartasset/\"\u003ethey might have a different direction in mind for the business\u003c/a\u003e, suggesting that regular communication with their parent could ensure both parties are on the same page. Also, if a firm already has employees, bringing on a child can require particular care, as the incumbents might be watchful for any special treatment given to the new hire. Similarly, clients might need reassurance that the child is qualified for the position they\u0026#39;re taking within the firm. To address this issue, a child interested in financial planning might first work at another firm (or gain separate skills [e.g., advanced portfolio management or tax credentials] that could be valuable) before joining their parents\u0026#39; business. Further, if the founder has multiple children, only bringing one on could complicate estate planning for the parent (who might be hesitant to give equity in the firm only to the child who works there).\u003c/p\u003e\n\u003cp\u003eAltogether, while bringing a child into a firm can be an attractive proposition for both a parent (not only from a business perspective, but also for the opportunity to spend more time with them) and for the child themselves (as they could find a supportive environment in which to grow their advisory career and possibly a direct path to firm ownership), taking a thoughtful approach to doing so (including keeping the perspectives of other stakeholders in mind) can improve the chances that it will be a successful hire.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Launch An Effective Internship Program\" id=\"how-rias-can-launch-an-effective-internship-program-to-recruit-talent\"\u003e\u003cspan\u003e\u003ca href=\"https://www.financialplanningassociation.org/learning/publications/journal/FEB25-how-can-rias-launch-effective-internship-program-recruit-talent-OPEN\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Practice-Management\"\u003eHow RIAs Can Launch An Effective Internship Program To Recruit Talent\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Richard Chen | Journal Of Financial Planning)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the competitive environment for advisor talent, one potential way for firms to identify next-gen employees is to \u003ca href=\"https://www.kitces.com/blog/financial-planning-internship-programs-externship-recruitment-remote-work/\"\u003eimplement an internship program\u003c/a\u003e, which not only can serve as a force multiplier during the length of the internship, but also can serve as a trial run for potential full-time employees (giving the firm the chance to see how they operate in the real world rather than just on their resume or in an interview), and demonstrate the firm\u0026#39;s commitment to attracting and developing fresh talent.\u003c/p\u003e\n\u003cp\u003eA first step for firms thinking about \u003ca href=\"https://www.kitces.com/blog/implementing-financial-planning-summer-internship-interview-tasks-yankee-fjy/\"\u003eestablishing an internship program\u003c/a\u003e is to identify the specific, roles, responsibilities, and objectives that the intern(s) will take on. Next, identifying multiple sources of potential interns (e.g., participating in a job fair at a local college), can create a more robust pipeline from which to choose. Also, making the position attractive (e.g., by allowing the intern to take on meaningful work and providing adequate compensation) can further increase the quality of the intern candidate pool. Further, being clear about the potential for the internship to turn into a full-time position after graduation (and what the intern could expect in terms of career development if they do become an employee) can set proper expectations between the firm and potential interns. And once an intern does join the firm, investing in a smooth onboarding process and offering mentorship opportunities can provide the intern with a better experience (which might not only encourage them to accept a full-time job offer if it comes, but also to speak highly of the firm with their peers who might also be looking for job opportunities).\u003c/p\u003e\n\u003cp\u003eIn the end, while establishing and executing an effective internship program requires an investment of time and money from a firm, doing so can potentially pay dividends in the form of additional work support, better talent identification and, ultimately, a more vibrant and sustainable firm.\u003c/p\u003e\n\u003ch2 data-nav-title=\"4 Techniques For The Art Of Listening\" id=\"4-techniques-to-master-the-art-of-listening\"\u003e\u003cspan\u003e\u003ca href=\"https://hbr.org/2024/12/4-listening-skills-leaders-need-to-master\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003e4 Techniques To Master The Art Of Listening\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Debra Schifrin | Harvard Business Review)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePeople who are considered good communicators are often those who can express themselves clearly, whether in a public forum or in a smaller conversation. However, communicating well is not only a matter of conveying one\u0026#39;s thoughts effectively, but also of \u003ca href=\"https://www.kitces.com/blog/the-one-skill-that-has-the-biggest-impact-on-being-a-successful-financial-planner/\"\u003ebeing an active listener\u003c/a\u003e as well (lest the content of one\u0026#39;s comments not accurately reflect the discussion at hand!).\u003c/p\u003e\n\u003cp\u003eOne way to become a more adept listener is to \u0026#34;listen to the end\u0026#34; where possible. For example, when listening to a conversational partner, it can be tempting to think about how you want to respond while they\u0026#39;re still speaking, interrupting with a solution, or offering an example from your own life. Instead, by focusing on what the interlocutor has to say, you can better understand their point and offer a better response (and make them feel more respected and heard in the process). Another tactic is to listen to summarize rather than solve. By summarizing what your conversational partner has to say, you can have a better understanding of their message and avoid jumping right into possible solutions (that might not be solving the right problem!). Also, putting the content of the speaker\u0026#39;s comments into the context of your relationship with them can provide a more nuanced view of what they\u0026#39;re trying to communicate and give clues to what an appropriate response might entail (e.g., the response to a comment from a peer might differ from that to a subordinate). Finally, listening in the context of the speaker\u0026#39;s values and experiences can help identify the underlying message they\u0026#39;re trying to communicate (e.g., a comment about a missed deadline might not just be about this particular incident, but rather part of a pattern of feeling disrespected).\u003c/p\u003e\n\u003cp\u003eIn sum, listening well is in part a function of both \u003ca href=\"https://www.kitces.com/blog/why-are-we-afraid-to-listen/\"\u003eturning attention away from one\u0026#39;s own thoughts and better understanding what a conversational partner is trying to communicate\u003c/a\u003e. Which can not only lead to better understanding of what\u0026#39;s being discussed, but also, ultimately, greater respect as a communicator.\u003c/p\u003e\n\u003ch2 id=\"huh-the-valuable-role-of-interjections\"\u003e\u003cspan\u003e\u003ca href=\"https://arstechnica.com/science/2025/03/huh-the-valuable-role-of-interjections/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eHuh? The Valuable Role Of Interjections\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Bob Holmes | Knowable Magazine)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhen remembering a conversation, an individual will likely remember the key messages and words that were spoken. However, in reality, conversational flow is not just a matter of the primary words being used, but also the small interjections (e.g., huh or mmhmm) that can provide signals to a speaker about how their interlocutor is receiving their comments.\u003c/p\u003e\n\u003cp\u003eWhile it might be tempting to remove such \u0026#39;filler\u0026#39; language, these interjections can communicate important messages (and are found across a wide range of languages). For instance, \u0026#34;huh?\u0026#34; can be used as a \u0026#34;repair signal\u0026#34; used by a listener to quickly indicate they don\u0026#39;t understand the speaker\u0026#39;s message (before the speaker can go on and take the conversation in an unproductive direction). In addition, \u0026#34;continuers\u0026#34; like \u0026#34;mmhmm\u0026#34; can signal to a speaker that their counterpart is actively listening and to continue with their comments (further, because this interjection can be made without opening one\u0026#39;s mouth, it signals that the counterpart doesn\u0026#39;t intend to speak themselves). And while many interjections are encouraging, some can shift the tone of a conversation in a negative direction (e.g., a sarcastic and elongated \u0026#34;ohhh\u0026#34;), suggesting care to ensure the purpose of including an interjection is clear (even if the interjection itself is short).\u003c/p\u003e\n\u003cp\u003eAltogether, while it can be easy to ignore interjections (or even treat them as \u0026#39;fillers\u0026#39; to be eliminated), they can serve an important role in demonstrating understanding and maintaining conversational flow (and, as a bonus, interjections are one of the hardest parts of language for AI tools to master, so their use can demonstrate one\u0026#39;s humanness when interacting with someone remotely!).\u003c/p\u003e\n\u003ch2 data-nav-title=\"What To Do When Someone Stops Listening\" id=\"what-to-do-when-someone-stops-listening-to-you\"\u003e\u003cspan\u003e\u003ca href=\"https://hbr.org/2025/03/when-you-can-tell-someone-isnt-listening-to-you\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eWhat To Do When Someone Stops Listening To You\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Allison Shapira | Harvard Business Review)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s common to be in a conversation and recognize that your counterpart isn\u0026#39;t paying complete attention to what you\u0026#39;re saying (whether because they\u0026#39;re actively doing something else like scrolling through their phone or just seem zoned out or inattentive). While this can be an annoying situation, recognizing that you\u0026#39;ve lost the other person\u0026#39;s attention provides an opportunity to take steps to get the conversation back on track.\u003c/p\u003e\n\u003cp\u003eOne tactic is to step back to \u0026#34;pause and breathe\u0026#34;, which can give you a chance to plan an approach without making a hasty comment. Also, before addressing the listener, it can help to assume positive intent on their part (i.e., considering that they\u0026#39;re not necessarily being disrespectful, but instead might be confused or have something else going on in their life that\u0026#39;s at the forefront of their minds). For instance, a financial planning client might zone out if their advisor launches into a lengthy, jargon-filled monologue that they don\u0026#39;t understand. After calming your own mind down, one way to get the conversation back on track is to ask the listener an open-ended question (e.g., \u0026#34;How have you handled this before?\u0026#34; or \u0026#34;What do you think?\u0026#34;), which can encourage the counterpart to provide a substantive answer (and can lead to opportunities to ask \u003ca href=\"https://www.kitces.com/blog/follow-up-questions-financial-advisors-ask-clients-prospects-data-gathering-build-trust-communication-skills/\"\u003efollow-up questions\u003c/a\u003e that can keep the conversation going). Another potential tactic is to change the rhythm of the conversation, perhaps by allowing for a period of silence (which might snap the counterpart\u0026#39;s attention back to the conversation), or by shifting one\u0026#39;s physical position (e.g., standing up or sitting down) which can reset the listener\u0026#39;s attention.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that while active listening is a sign of respect, not being fully dialed in isn\u0026#39;t necessarily a sign of disrespect. Instead, speakers can gauge the situation and offer the opportunity for a \u0026#39;reset\u0026#39;, which can keep the conversation flowing without making assumptions about the listener\u0026#39;s intent.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eWe hope you enjoyed the reading! Please leave a comment below to share your thoughts, or send an email to \u003ca href=\"https://feeds.feedblitz.com/cdn-cgi/l/email-protection#f68193939d939892849397929f9891b69d9f82959385d895999b\"\u003e\u003cspan data-cfemail=\"067163636d636862746367626f6861466d6f726563752865696b\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e to suggest any articles you think would be a good fit for a future column!\u003c/p\u003e\n\u003cp\u003eIn the meantime, if you\u0026#39;re interested in more news and information regarding advisor technology, we\u0026#39;d highly recommend checking out \u003ca href=\"https://wmtoday.com/\"\u003eCraig Iskowitz\u0026#39;s \u0026#34;Wealth Management Today\u0026#34; blog\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;Weekend Reading For Financial Planners (May 24–25)\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-0f3f012d0d8fc9c631484615-=\"\"\u003e\n                    \u003cimg decoding=\"async\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\"/\u003e\n                    \u003c/a\u003e\n                \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "37 min read",
  "publishedTime": "2025-05-23T14:00:42-04:00",
  "modifiedTime": "2025-05-23T17:25:44Z"
}
