{
  "id": "11eac1d2-5f09-479e-bfb2-5696dd04e376",
  "title": "Hello, Ohio!",
  "link": "https://thebloggess.com/2025/02/25/hello-ohio/",
  "description": "So, this Sunday the Upper Arlington Library in Ohio is bringing out to do a talk and I’m very excited about it but also really nervous because I haven’t accepted many speaking gigs in the last five years, in part because I’m self-conscious about a nervous tic that I’ve developed that you’ve no doubt noticedContinue reading \"Hello, Ohio!\"",
  "author": "thebloggess",
  "published": "Tue, 25 Feb 2025 20:05:22 +0000",
  "source": "https://thebloggess.com/feed/",
  "categories": [
    "Random Crap"
  ],
  "byline": "",
  "length": 1452,
  "excerpt": "So, this Sunday the Upper Arlington Library in Ohio is bringing out to do a talk and I’m very excited about it but also really nervous because I haven’t accepted many speaking gigs in t…",
  "siteName": "The Bloggess",
  "favicon": "",
  "text": "So, this Sunday the Upper Arlington Library in Ohio is bringing out to do a talk and I’m very excited about it but also really nervous because I haven’t accepted many speaking gigs in the last five years, in part because I’m self-conscious about a nervous tic that I’ve developed that you’ve no doubt noticed if you’re part of my book club and watch my zooms. It’s basically an occasional heavy blink when it’s a good day, but on a bad day it looks as if an invisible ghost is aggressively poking me in the eye every two seconds. I’ve seen all the doctors and shrinks and they tell me the best way to make it go away is to not think about it because thinking about it makes it worse and so I’m constantly thinking that I need to not think about it, which is just as ridiculous and unhelpful as it sounds. But anyway, I’m writing this here because in the last few years I’ve had people reach out to ask if I have a problem or recommend testing or allergy meds, and so if I write this here maybe it will pop up when people google “What’s wrong with Jenny Lawson?” and I can say, “SO MANY THINGS. But one of them is that I have an occasional facial tic that is totally harmless but gets worse when I’m tired or nervous.” Here’s a video if you want more details, although my tic is hardly showing up at all in it, probably because I’m not worried about it showing up for once. THANKS FOR NOTHING, BRAIN: Post navigation",
  "image": "https://i0.wp.com/thebloggess.com/wp-content/uploads/2018/08/cropped-cropped-cheesecake.jpg?fit=512%2C512\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"content\"\u003e\n\n\t\t\u003cmain id=\"main\"\u003e\n\n\t\t\t\n\u003carticle id=\"post-42572\"\u003e\n\n\t\n\n\t\n\t\u003cdiv\u003e\n\t\t\n\u003cp\u003eSo, this Sunday the \u003cstrong\u003e\u003ca href=\"https://app.arts-people.com/index.php?show=263698\" data-type=\"link\" data-id=\"https://app.arts-people.com/index.php?show=263698\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eUpper Arlington Library in Ohio is bringing out to do a talk\u003c/a\u003e\u003c/strong\u003e and I’m very excited about it but also really nervous because I haven’t accepted many speaking gigs in the last five years, in part because I’m self-conscious about a nervous tic that I’ve developed that you’ve no doubt noticed if you’re part of my book club and watch my zooms.  It’s basically an occasional heavy blink when it’s a good day, but on a bad day it looks as if an invisible ghost is aggressively poking me in the eye every two seconds.  I’ve seen all the doctors and shrinks and they tell me the best way to make it go away is to not think about it because thinking about it makes it worse and so I’m constantly thinking that I need to not think about it, which is just as ridiculous and unhelpful as it sounds.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut anyway, I’m writing this here because in the last few years I’ve had people reach out to ask if I have a problem or recommend testing or allergy meds, and so if I write this here maybe it will pop up when people google “What’s wrong with Jenny Lawson?” and I can say, “SO MANY THINGS.  But one of them is that I have an occasional facial tic that is totally harmless but gets worse when I’m tired or nervous.”\u003c/p\u003e\n\n\n\n\u003cp\u003eHere’s a video if you want more details, although my tic is hardly showing up at all in it, probably because I’m not worried about it showing up for once.  THANKS FOR NOTHING, BRAIN:\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cdiv\u003e\n\u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/DGggIV_Jcde/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\u003c/blockquote\u003e\n\u003c/div\u003e\u003c/figure\u003e\n\n\n\n\n\t\u003c/div\u003e\n\n\t\n\n\t\t\t\t\n\u003c/article\u003e\n\n\t\u003cnav aria-label=\"Posts\"\u003e\n\t\t\u003ch2\u003ePost navigation\u003c/h2\u003e\n\t\t\n\t\u003c/nav\u003e\n\n\n\t\t\u003c/main\u003e\n\n\t\t\n\n\n\n\t\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-02-25T20:05:22Z",
  "modifiedTime": "2025-02-25T20:05:22Z"
}
