{
  "id": "3d10a3ae-6d80-48c5-8925-f03aef577c20",
  "title": "Eloi",
  "link": "https://www.penny-arcade.com/news/post/2025/03/03/eloi",
  "description": "In realspace, Gabriel has a tooth problem - several - and the arduous journey of taming this zone is nearly at an end. I wasn't aware that he was even sad about his toofs; I'm an eye looker, not some brigand crawsman. I didn't know until I was thirty two years old that my dad was literally missing one of his upper middle teeth and I had known the man since I condensed into this form. My fang trubs are the opposite - my teeth are goosed because I had braces and didn't, you know, one hundred percent wear my retainers all the time. I mean, they're fine. I can chew stuff. But there are a couple of 'em that lean a bit, like they're posted up outside the corner store. That leer. Rough characters.",
  "author": "",
  "published": "Mon, 03 Mar 2025 20:28:00 +0000",
  "source": "https://www.penny-arcade.com/feed",
  "categories": null,
  "byline": "By Tycho",
  "length": 1612,
  "excerpt": "Videogaming-related online strip by Mike Krahulik and Jerry Holkins. Includes news and commentary.",
  "siteName": "",
  "favicon": "",
  "text": "In realspace, Gabriel has a tooth problem - several - and the arduous journey of taming this zone is nearly at an end. I wasn't aware that he was even sad about his toofs; I'm an eye looker, not some brigand crawsman. I didn't know until I was thirty two years old that my dad was literally missing one of his upper middle teeth and I had known the man since I condensed into this form. My fang trubs are the opposite - my teeth are goosed because I had braces and didn't, you know, one hundred percent wear my retainers all the time. I mean, they're fine. I can chew stuff. But there are a couple of 'em that lean a bit, like they're posted up outside the corner store. That leer. Rough characters. His level of anxiety around this stuff is so potent that we've been forced to catalog it many times in the strip; it intersected with the drugs during one visit and resulted in some unpleasantness so I'm glad this phase is just about over. The thing he doesn't know that I know is that you get so used to having metal and wires in your mouth that when they come off, the smoothness of a human tooth is quite unsettling. You've had them your whole life, they've been in there, by all means you should remember how they feel, and you absolutely do not. They feel like something alien, slick or even slimy in their smoothness. The whole thing is a little Hellraiser, frankly. The mouth torments. The weird machinery. There's something about pain in this region that skips the orderly line and strikes right at the BIOS. (CW)TB out.",
  "image": "https://assets.penny-arcade.com/img/logo_opengraph.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \u003csection\u003e\n                            \u003cp\u003eIn realspace, Gabriel has a \u003ca href=\"https://www.penny-arcade.com/comic/2021/10/06/teeth-\"\u003etooth problem\u003c/a\u003e - several - and the arduous journey of taming this zone is nearly at an end. I wasn\u0026#39;t aware that he was even sad \u003ca href=\"https://www.penny-arcade.com/comic/2025/03/03/\"\u003eabout his toofs\u003c/a\u003e; I\u0026#39;m an eye looker, not some brigand crawsman. I didn\u0026#39;t know until I was thirty two years old that my dad was literally missing one of his upper middle teeth and I had known the man since I condensed into this form. My fang trubs are the opposite - my teeth are goosed because I \u003cem\u003ehad\u003c/em\u003e braces and didn\u0026#39;t, you know, one hundred percent wear my retainers all the time. I mean, they\u0026#39;re fine. I can chew stuff. But there are a couple of \u0026#39;em that lean a bit, like they\u0026#39;re posted up outside the corner store. That \u003cem\u003eleer\u003c/em\u003e. Rough characters.\u003c/p\u003e                        \u003c/section\u003e\n\t\t\t\t\t\t\n                        \u003csection\u003e\n                            \u003cp\u003eHis level of anxiety around this stuff is so potent that we\u0026#39;ve been forced to catalog it many times in the strip; it intersected with the drugs during one visit and resulted in \u003ca href=\"https://www.penny-arcade.com/comic/2018/06/15/splash-row\"\u003esome unpleasantness\u003c/a\u003e so I\u0026#39;m glad this phase is just about over. The thing he doesn\u0026#39;t know that \u003cem\u003eI\u003c/em\u003e know is that you get so used to having metal and wires in your mouth that when they come off, the smoothness of a human tooth is quite unsettling. You\u0026#39;ve had them your whole life, they\u0026#39;ve been in there, by all means you should remember how they feel, and you absolutely do not. They feel like something alien, slick or even slimy in their smoothness.\u003c/p\u003e\n\u003cp\u003eThe whole thing is a little Hellraiser, frankly. The mouth torments. The weird machinery. There\u0026#39;s something about pain in this region that skips the orderly line and strikes right at the BIOS.\u003c/p\u003e\n\u003cp\u003e(CW)TB out.\u003c/p\u003e\t\t\t\t\t\t\u003c/section\u003e\t\t\t\t\t\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
