{
  "id": "9c67a7dc-bbd6-426a-8fde-c31a16fa8b98",
  "title": "Best of…: Best of 2024: Lowering the Rent Floor",
  "link": "https://thedailywtf.com/articles/best-of-2024-lowering-the-rent-floor",
  "description": "Businesses always want to save money. But boy, they can sometimes come up with some hare-brained ways of doing it. Original --Remy Things weren't looking good for IniOil. It was the 1980s in the US: greed was good, anti-trust laws had been literally Borked, and financialization and mergers were eating up the energy industry. IniOil was a small fish surrounded by much larger fish, and the larger fish were hungry. Gordon was their primary IT person. He managed a farm of VAXes and other minicomputers, which geologists used to do complicated models to predict where oil might be found. In terms of utilization, the computer room was arguably the most efficient space in the company: those computers may have been expensive, but they were burning 24/7 to find more oil to extract. The CEO sent out a memo. \"Due to economic conditions,\" it read, \"we are going to have to cut costs and streamline.\" Cutting costs and streamlining meant \"hiring a bunch of Ivy League MBAs\" who had a long list of reforms they wanted the company to adopt. One of them was to force all the various business units to use internal billing and charge other business units for their services. At first, this looked like a good thing for Gordon. Their overhead costs were low- the IT team was small, and the VAXes were reliable, and the workloads were well understood. Billing out computer time was going to make all their metrics look amazing. Unfortunately, facilities also was a billable unit. And they charged by square foot. Suddenly, the IT team was paying through the nose for the computer room. What really stuck in Gordon's craw, however, was that it seemed like the computer room was getting billed at a more expensive rate than anything else in the building- it was about the same size as the sales floor, but was billed at double the rate. Gordon raised this with facilities. \"That's not true,\" they said. \"We bill by the square foot. You've got twice as much square footage.\" Gordon insisted that the computer room did not. He broke out a tape measure, went to the sales floor, took some measurements, then went to the computer room and repeated it. The difference was a matter of a few square feet. Gordon went back to facilities. \"Your measurements are wrong.\" \"They're square rooms,\" Gordon said. \"How wrong could I be? A factor of two? Do you want to take the measurements?\" Facilities didn't need to take measurements. They had drawings. And the drawings showed a room that was 80'x80'… and was 12,800 sq ft. Gordon pointed out how that didn't make sense, by basic arithmetic, and the facilities manager tapped an annotation on the drawing. \"Raised flooring\". Because the computer room had a raised floor, facilities was counting it as twice the floor space. Gordon tried to argue with facilities, pointing out that no matter how many raised floors were added, the actual building square footage did not change. But every business unit was looking to cut costs and boost internal profits, which meant \"seeing reason\" wasn't high on the facilities priority list. Gordon raised it up with management, but everyone was too panicked by the threat of mergers and losing jobs to start a major fight over it. Facilities said the square footage was 12,800, then that's what it was. But Gordon's management had a solution. \"Gordon,\" his boss said. \"Remove the raised flooring. Just rip it out.\" It was a quick and easy way to turn high billing rates into trip hazards and risks to equipment, but nobody was paying for risk mitigation and if there were any injuries because someone tripped over a cable, that'd come out of some other team's budget anyway. For a few months, the computer room was a hazard site, but the rent was at least cheap. In the end, though, none of it mattered- all the MBA driven cost \"savings\" weren't enough to stop a much bigger oil company from swallowing up IniOil. Most of the employees lost their jobs. The execs who owned most of the shares got a huge payout. And, well, the purchaser was interested in land leases and mineral rights, not computer rooms, so the VAXes were broken down and sold to a few universities. [Advertisement] Keep the plebs out of prod. Restrict NuGet feed privileges with ProGet. Learn more.",
  "author": "Remy Porter",
  "published": "Tue, 31 Dec 2024 06:30:00 GMT",
  "source": "http://syndication.thedailywtf.com/TheDailyWtf",
  "categories": [
    "Best of…"
  ],
  "byline": "Remy Porter",
  "length": 4236,
  "excerpt": "Businesses always want to save money. But boy, they can sometimes come up with some hare-brained ways of doing it. Original --Remy Things weren't looking good for IniOil. It was the 1980s in the US: greed was good, anti-trust laws had been literally Borked, and financialization and mergers were eating up the energy industry. IniOil was a small fish surrounded by much larger fish, and the larger fish were hungry. Gordon was their primary IT person. He managed a farm of VAXes and other minicomputers, which geologists used to do complicated models to predict where oil might be found. In terms of utilization, the computer room was arguably the most efficient space in the company: those computers may have been expensive, but they were burning 24/7 to find more oil to extract.",
  "siteName": "The Daily WTF",
  "favicon": "",
  "text": "Businesses always want to save money. But boy, they can sometimes come up with some hare-brained ways of doing it. Original --Remy Things weren't looking good for IniOil. It was the 1980s in the US: greed was good, anti-trust laws had been literally Borked, and financialization and mergers were eating up the energy industry. IniOil was a small fish surrounded by much larger fish, and the larger fish were hungry. Gordon was their primary IT person. He managed a farm of VAXes and other minicomputers, which geologists used to do complicated models to predict where oil might be found. In terms of utilization, the computer room was arguably the most efficient space in the company: those computers may have been expensive, but they were burning 24/7 to find more oil to extract. The CEO sent out a memo. \"Due to economic conditions,\" it read, \"we are going to have to cut costs and streamline.\" Cutting costs and streamlining meant \"hiring a bunch of Ivy League MBAs\" who had a long list of reforms they wanted the company to adopt. One of them was to force all the various business units to use internal billing and charge other business units for their services. At first, this looked like a good thing for Gordon. Their overhead costs were low- the IT team was small, and the VAXes were reliable, and the workloads were well understood. Billing out computer time was going to make all their metrics look amazing. Unfortunately, facilities also was a billable unit. And they charged by square foot. Suddenly, the IT team was paying through the nose for the computer room. What really stuck in Gordon's craw, however, was that it seemed like the computer room was getting billed at a more expensive rate than anything else in the building- it was about the same size as the sales floor, but was billed at double the rate. Gordon raised this with facilities. \"That's not true,\" they said. \"We bill by the square foot. You've got twice as much square footage.\" Gordon insisted that the computer room did not. He broke out a tape measure, went to the sales floor, took some measurements, then went to the computer room and repeated it. The difference was a matter of a few square feet. Gordon went back to facilities. \"Your measurements are wrong.\" \"They're square rooms,\" Gordon said. \"How wrong could I be? A factor of two? Do you want to take the measurements?\" Facilities didn't need to take measurements. They had drawings. And the drawings showed a room that was 80'x80'… and was 12,800 sq ft. Gordon pointed out how that didn't make sense, by basic arithmetic, and the facilities manager tapped an annotation on the drawing. \"Raised flooring\". Because the computer room had a raised floor, facilities was counting it as twice the floor space. Gordon tried to argue with facilities, pointing out that no matter how many raised floors were added, the actual building square footage did not change. But every business unit was looking to cut costs and boost internal profits, which meant \"seeing reason\" wasn't high on the facilities priority list. Gordon raised it up with management, but everyone was too panicked by the threat of mergers and losing jobs to start a major fight over it. Facilities said the square footage was 12,800, then that's what it was. But Gordon's management had a solution. \"Gordon,\" his boss said. \"Remove the raised flooring. Just rip it out.\" It was a quick and easy way to turn high billing rates into trip hazards and risks to equipment, but nobody was paying for risk mitigation and if there were any injuries because someone tripped over a cable, that'd come out of some other team's budget anyway. For a few months, the computer room was a hazard site, but the rent was at least cheap. In the end, though, none of it mattered- all the MBA driven cost \"savings\" weren't enough to stop a much bigger oil company from swallowing up IniOil. Most of the employees lost their jobs. The execs who owned most of the shares got a huge payout. And, well, the purchaser was interested in land leases and mineral rights, not computer rooms, so the VAXes were broken down and sold to a few universities. [Advertisement] Keep the plebs out of prod. Restrict NuGet feed privileges with ProGet. Learn more.",
  "image": "https://s3.amazonaws.com/remy.jetpackshark.com/remy-thumb.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv itemprop=\"articleBody\"\u003e\n            \u003cblockquote\u003eBusinesses always want to save money. But boy, they can sometimes come up with some hare-brained ways of doing it. \u003ca href=\"https://thedailywtf.com/articles/lowering-the-rent-floor\"\u003eOriginal\u003c/a\u003e --\u003cstrong\u003eRemy\u003c/strong\u003e\u003c/blockquote\u003e\n\n\u003cp\u003eThings weren\u0026#39;t looking good for IniOil. It was the 1980s in the US: greed was good, anti-trust laws had been \u003cem\u003eliterally\u003c/em\u003e Borked, and financialization and mergers were eating up the energy industry.  IniOil was a small fish surrounded by much larger fish, and the larger fish were hungry.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGordon\u003c/strong\u003e was their primary IT person. He managed a farm of VAXes and other minicomputers, which geologists used to do complicated models to predict where oil might be found. In terms of utilization, the computer room was arguably the most efficient space in the company: those computers may have been expensive, but they were burning 24/7 to find more oil to extract.\u003c/p\u003e\n\u003cp\u003eThe CEO sent out a memo. \u0026#34;Due to economic conditions,\u0026#34; it read, \u0026#34;we are going to have to cut costs and streamline.\u0026#34; Cutting costs and streamlining meant \u0026#34;hiring a bunch of Ivy League MBAs\u0026#34; who had a long list of reforms they wanted the company to adopt. One of them was to force all the various business units to use internal billing and charge other business units for their services.\u003c/p\u003e\n\u003cp\u003eAt first, this looked like a good thing for Gordon. Their overhead costs were low- the IT team was small, and the VAXes were reliable, and the workloads were well understood. Billing out computer time was going to make all their metrics look amazing.\u003c/p\u003e\n\u003cp\u003eUnfortunately, \u003cem\u003efacilities\u003c/em\u003e also was a billable unit. And they charged by square foot. Suddenly, the IT team was paying through the nose for the computer room.\u003c/p\u003e\n\u003cp\u003eWhat really stuck in Gordon\u0026#39;s craw, however, was that it seemed like the computer room was getting billed at a more expensive rate than anything else in the building- it was about the same size as the sales floor, but was billed at double the rate.\u003c/p\u003e\n\u003cp\u003eGordon raised this with facilities. \u0026#34;That\u0026#39;s not true,\u0026#34; they said. \u0026#34;We bill by the square foot. You\u0026#39;ve got twice as much square footage.\u0026#34;\u003c/p\u003e\n\u003cp\u003eGordon insisted that the computer room did \u003cem\u003enot\u003c/em\u003e. He broke out a tape measure, went to the sales floor, took some measurements, then went to the computer room and repeated it. The difference was a matter of a few square feet.\u003c/p\u003e\n\u003cp\u003eGordon went back to facilities. \u0026#34;Your measurements are wrong.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;They\u0026#39;re square rooms,\u0026#34; Gordon said. \u0026#34;How wrong could I be? A factor of two? Do you want to take the measurements?\u0026#34;\u003c/p\u003e\n\u003cp\u003eFacilities didn\u0026#39;t need to take measurements. They had drawings. And the drawings showed a room that was 80\u0026#39;x80\u0026#39;… and was 12,800 sq ft.  Gordon pointed out how that didn\u0026#39;t make sense, by \u003cem\u003ebasic arithmetic\u003c/em\u003e, and the facilities manager tapped an annotation on the drawing. \u0026#34;Raised flooring\u0026#34;.\u003c/p\u003e\n\u003cp\u003eBecause the computer room had a raised floor, facilities was counting it as \u003cem\u003etwice the floor space\u003c/em\u003e. Gordon tried to argue with facilities, pointing out that no matter how many raised floors were added, the actual building square footage did \u003cem\u003enot\u003c/em\u003e change. But every business unit was looking to cut costs and boost internal profits, which meant \u0026#34;seeing reason\u0026#34; wasn\u0026#39;t high on the facilities priority list.\u003c/p\u003e\n\u003cp\u003eGordon raised it up with management, but everyone was too panicked by the threat of mergers and losing jobs to start a major fight over it. Facilities said the square footage was 12,800, then that\u0026#39;s what it was. But Gordon\u0026#39;s management had a solution.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Gordon,\u0026#34; his boss said. \u0026#34;Remove the raised flooring. Just rip it out.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIt was a quick and easy way to turn high billing rates into trip hazards and risks to equipment, but nobody was paying for \u003cem\u003erisk mitigation\u003c/em\u003e and if there were any injuries because someone tripped over a cable, that\u0026#39;d come out of some other team\u0026#39;s budget anyway.\u003c/p\u003e\n\u003cp\u003eFor a few months, the computer room was a hazard site, but the rent was at least cheap. In the end, though, none of it mattered- all the MBA driven cost \u0026#34;savings\u0026#34; weren\u0026#39;t enough to stop a much bigger oil company from swallowing up IniOil. Most of the employees lost their jobs. The execs who owned most of the shares got a huge payout. And, well, the purchaser was interested in land leases and mineral rights, not computer rooms, so the VAXes were broken down and sold to a few universities.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://thedailywtf.com/images/inedo/proget-icon.png\"/\u003e [Advertisement] \n\tKeep the plebs out of prod. Restrict NuGet feed privileges with ProGet. \u003ca href=\"https://inedo.com/proget/private-nuget-server?utm_source=tdwtf\u0026amp;utm_medium=footer\u0026amp;utm_content=PlebsFooter\u0026amp;utm_campaign=Cyclops2020\"\u003eLearn more.\u003c/a\u003e\n\u003c/p\u003e\n\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-31T06:30:00Z",
  "modifiedTime": null
}
