{
  "id": "c0e430cd-5c76-4050-8ee0-4dd971d1a16d",
  "title": "Pregnant 25-year-old asks her sister to give up her name for her daughter to fulfill bogus family prophecy: 'I need you to release the name to her'",
  "link": "https://cheezburger.com/39674885/pregnant-25-year-old-asks-her-sister-to-give-up-her-name-for-her-daughter-to-fulfill-bogus-family",
  "description": "Having crazy, entitled family members may not always be fun, but it's certainly always entertaining.It's remarkable how you can go through life thinking that a close family member's behavior isn't that serious until one day, they ask you to change your name so that their unborn kid can have it fully for themselves and fulfill the \"family prophecy.\" Mysticism and spirituality obviously can provide meaning to life's many uncertainties, but you cannot project those beliefs onto others to the point that you're asking them to sacrifice a major thing…like their own name.Keep scrolling below for this tale of sisterly drama!",
  "author": "Ben Weiss",
  "published": "Mon, 17 Mar 2025 13:00:00 -0700",
  "source": "http://feeds.feedburner.com/failblog",
  "categories": [
    "family drama",
    "aita",
    "baby",
    "baby names",
    "AITAH",
    "mother",
    "family feud",
    "family",
    "pregnant",
    "sister",
    "entitled people"
  ],
  "byline": "Ben Weiss",
  "length": 846,
  "excerpt": "Pregnant 25-year-old asks her sister to give up her name for her daughter to fulfill bogus family prophecy: 'I need you to release the name to her' - The internet has generated a huge amount of laughs from cats and FAILS. And we all out of cats.",
  "siteName": "FAIL Blog",
  "favicon": "https://i.chzbgr.com/s/unversioned/images/square_logos/FailBlog.png",
  "text": "This 23-year-old's sister, who is two years older than she is, got into the bizarre family mysticism several years before, but things started to get intense when she got pregnant. Apparently, the 23-year-old is “the chosen one” and it will be “mutually beneficial” for the health of the entire family if she gave up her name to her future niece. Imagine the lived experience of giving up your name when you don't actually want to… you have to change it legally, you have to tell all the people in your life what your new name is, and so on. To make matters worse, this woman doesn't have any desire to change it all and would have to explain the crazy family mysticism to literally everyone in her life if she went through with this. Thankfully, she stood her ground, but we all worry about her relationship with her sister moving forward.",
  "image": "https://i.chzbgr.com/thumb1200/39674885/hC0C74465/up-her-name-for-her-daughter-to-fulfill-bogus-family-prophecy-i-need-you-to-release-the-name-to-her",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eThis 23-year-old\u0026#39;s sister, who is two years older than she is, got into the bizarre family mysticism several years before, but things started to get intense when she got pregnant. Apparently, the 23-year-old is “the chosen one” and it will be “mutually beneficial” for the health of the entire family if she gave up her name to her future niece.\u003c/p\u003e\n\n    \u003c/div\u003e\u003cdiv\u003e\n\n\u003cp\u003eImagine the lived experience of giving up your name when you don\u0026#39;t actually want to… you have to change it legally, you have to tell all the people in your life what your new name is, and so on. To make matters worse, this woman doesn\u0026#39;t have any desire to change it all and would have to explain the crazy family mysticism to literally everyone in her life if she went through with this. Thankfully, she stood her ground, but we all worry about her relationship with her sister moving forward.\u003c/p\u003e\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2025-03-17T13:00:00-07:00",
  "modifiedTime": null
}
