{
  "id": "cda921d4-fb17-4949-81da-a837e709cfbd",
  "title": "All Aboard",
  "link": "https://www.penny-arcade.com/news/post/2025/01/01/all-aboard",
  "description": "It's not a hundred percent clear what ills Gabriel is looking to secure, or at least tamp down, but we do have to respect that he's willing to invest in unorthodox techniques to manage them. We are all subject to pique, maladies of the body and mind, terrors of all stripes. To find a panacea for that which Scourges Man is a noble effort - a boon to the finder, but a treasury to our extended human family as well. I wish him every success.",
  "author": "",
  "published": "Wed, 01 Jan 2025 20:55:00 +0000",
  "source": "https://www.penny-arcade.com/feed",
  "categories": null,
  "byline": "By Tycho",
  "length": 3343,
  "excerpt": "Videogaming-related online strip by Mike Krahulik and Jerry Holkins. Includes news and commentary.",
  "siteName": "",
  "favicon": "",
  "text": "It's not a hundred percent clear what ills Gabriel is looking to secure, or at least tamp down, but we do have to respect that he's willing to invest in unorthodox techniques to manage them. We are all subject to pique, maladies of the body and mind, terrors of all stripes. To find a panacea for that which Scourges Man is a noble effort - a boon to the finder, but a treasury to our extended human family as well. I wish him every success. Wilmot's Warehouse must be the least likely franchise in all of Christendom. Originally a single player or co-operative game about the pneumonic space of arranging a warehouse fulfillment center full of abstract icons, its conceptual britches are now bursting at the euphemistic seams. There was a whole other Wilmot game I'd never even heard of called Wilmot Works it Out about… let's see. It's about Wilmot, the titular friendly square from the first game, who signs up for a puzzle subscription? And sometimes they get puzzles that have the wrong pieces in them? They have to build the puzzles and hang them on the wall. If you write it out is doesn't seem that cool. But if you play it - and there is a free demo - you find out that it's this delicious, tactile, sweet, relaxing game that trades on some of the same themes. Man, it's cool. Finding a boardgame that Brenna is going to like is like finding a beer that Gabe is going to like. Most of the time, they simply aren't interested in the genre. They don't really understand what the point is and they have other things that they already like. So, why is it worth the effort? Because it's incredibly difficult. Broadly, Brenna's problem with boardgames is that she is literally too smart. It's the same problem with our eldest child; people used to give us all these \"MENSA Approved\" games or whatever, games about assessing systems or patterns, and they couldn't even detect what the game was supposed to be because the supposed patterns were all completely obvious to them. For me, it might be kind of fun. For them, it was functionally a remedial exercise - \"Can you tell me which of the cards is blue?\" The games Brenna and the wily Samantha enjoy most are ones with some measure of infinite interpretation involved, like Dixit or Mysterium. It's the only thing that can even register as a recreational exercise in that domain. So, I'm hoping I have a winner here with the Wilmot's Warehouse board game, which functionally plays like the ancient cardboard staple Memory in reverse. In Memory Classic, you probe a grid of upside down squares to discover what symbol they have underneath, and then you try to find their partner. In this, you begin by drawing a tile interpreting the symbol, and playing it upside down in the middle. Then, you do this thirty-four more times - collaboratively narrativizing each of these symbols against the others you have placed, and trying to build a kind of Memory Palace that will let you recall where the icons are, and flipping them upside down. Then, you start getting orders for the things in your warehouse. Like Wilmot Works It Out, where you can get pieces to puzzles you don't even have, you can get confounding orders for things you don't have as well. Is this gonna kill? I think it's gonna kill. (CW)TB out.",
  "image": "https://assets.penny-arcade.com/img/logo_opengraph.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \u003csection\u003e\n                            \u003cp\u003eIt\u0026#39;s not a hundred percent clear what ills Gabriel is looking to secure, or at least tamp down, but we do have to respect that he\u0026#39;s willing to invest in \u003ca href=\"https://www.penny-arcade.com/comic/2024/01/01/\"\u003eunorthodox techniques\u003c/a\u003e to manage them. We are all subject to pique, maladies of the body and mind, terrors of all stripes. To find a panacea for that which Scourges Man is a noble effort - a boon to the finder, but a treasury to our extended human family as well. I wish him every success.\u003c/p\u003e                        \u003c/section\u003e\n\t\t\t\t\t\t\n                        \u003csection\u003e\n                            \u003cp\u003eWilmot\u0026#39;s Warehouse must be the least likely franchise in all of Christendom. Originally a single player or co-operative game \u003ca href=\"https://store.steampowered.com/app/839870/Wilmots_Warehouse/\"\u003eabout the pneumonic space of arranging a warehouse fulfillment center full of abstract icons\u003c/a\u003e, its conceptual britches are now bursting at the euphemistic seams. There was a whole other Wilmot game I\u0026#39;d never even heard of called \u003ca href=\"https://store.steampowered.com/app/2060590/Wilmot_Works_It_Out/\"\u003eWilmot Works it Out\u003c/a\u003e about… let\u0026#39;s see. It\u0026#39;s about Wilmot, the titular friendly square from the first game, who signs up for a puzzle subscription? And sometimes they get puzzles that have the wrong pieces in them? They have to build the puzzles and hang them on the wall. If you write it out is doesn\u0026#39;t seem that cool. But if you play it - and there is a free demo - you find out that it\u0026#39;s this delicious, tactile, sweet, relaxing game that trades on some of the same themes. Man, it\u0026#39;s cool.\u003c/p\u003e\n\u003cp\u003eFinding a boardgame that Brenna is going to like is like finding a beer that Gabe is going to like. Most of the time, they simply aren\u0026#39;t interested in the genre. They don\u0026#39;t really understand what the point is and they have other things that they \u003cem\u003ealready\u003c/em\u003e like. So, why is it worth the effort? Because it\u0026#39;s \u003cem\u003eincredibly difficult\u003c/em\u003e. Broadly, Brenna\u0026#39;s problem with boardgames is that she is literally too smart. It\u0026#39;s the same problem with our eldest child; people used to give us all these \u0026#34;MENSA Approved\u0026#34; games or whatever, games about assessing systems or patterns, and they couldn\u0026#39;t even detect what the game was supposed to be because the supposed patterns were all completely obvious to them. For me, it might be kind of fun. For them, it was functionally a remedial exercise - \u0026#34;Can you tell me which of the cards is blue?\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe games Brenna and the wily Samantha enjoy most are ones with some measure of infinite interpretation involved, like Dixit or Mysterium. It\u0026#39;s the only thing that can even register as a recreational exercise in that domain. So, I\u0026#39;m hoping I have a winner here with the \u003ca href=\"https://spacebiff.com/2024/08/06/wilmots-warehouse/\"\u003eWilmot\u0026#39;s Warehouse board game\u003c/a\u003e, which functionally plays like the ancient cardboard staple Memory in reverse. In Memory Classic, you probe a grid of upside down squares to discover what symbol they have underneath, and then you try to find their partner. In this, you begin by drawing a tile interpreting the symbol, and playing it upside down in the middle. Then, you do this thirty-four more times - collaboratively narrativizing each of these symbols against the others you have placed, and trying to build a kind of Memory Palace that will let you recall where the icons are, and flipping them upside down.\u003c/p\u003e\n\u003cp\u003eThen, you start getting orders for the things in your warehouse.\u003c/p\u003e\n\u003cp\u003eLike Wilmot Works It Out, where you can get pieces to puzzles you don\u0026#39;t even have, you can get confounding orders for things you don\u0026#39;t have as well. Is this gonna kill? I think it\u0026#39;s gonna kill.\u003c/p\u003e\n\u003cp\u003e(CW)TB out.\u003c/p\u003e\t\t\t\t\t\t\u003c/section\u003e\t\t\t\t\t\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
