{
  "id": "13b5d542-cfce-4c18-8e16-bff6399fdffb",
  "title": "Super Wizard Kart!",
  "link": "https://www.penny-arcade.com/news/post/2025/06/15/super-wizard-kart",
  "description": "I was asked to run a game of Acquisitions Incorporated and decided to dust off some ideas I had after running Wizard Kart for the C Team about a million years ago. While Wizard Kart was a sort of goofy way to play D\u0026D, its sequel Super Wizard Kart is a fully self-contained board game. The players did not even need to bring their character sheets to the session. I’d like to thank my incredible players Jerry Holkins, Jasmine Bhullar, Kate Welch and Trystan Falcone for agreeing to sit down and play the results of my mad tinkering. You can watch the results right here!",
  "author": "",
  "published": "Sun, 15 Jun 2025 19:02:00 +0000",
  "source": "https://www.penny-arcade.com/feed",
  "categories": null,
  "byline": "By Gabe",
  "length": 3336,
  "excerpt": "Videogaming-related online strip by Mike Krahulik and Jerry Holkins. Includes news and commentary.",
  "siteName": "",
  "favicon": "",
  "text": "I was asked to run a game of Acquisitions Incorporated and decided to dust off some ideas I had after running Wizard Kart for the C Team about a million years ago. While Wizard Kart was a sort of goofy way to play D\u0026D, its sequel Super Wizard Kart is a fully self-contained board game. The players did not even need to bring their character sheets to the session. I’d like to thank my incredible players Jerry Holkins, Jasmine Bhullar, Kate Welch and Trystan Falcone for agreeing to sit down and play the results of my mad tinkering. You can watch the results right here! If you watched the video linked above and you’re thinking “damn I wonder how that came about?” I have got you covered. Here’s a look at the whole process! The first board I built was a simple square just to test the two new ideas I had of moving traps and customizable karts. I used dungeon tiles to build the track and cut some plastic sheet protectors to make trap zones. I did not know what the traps were yet just that I wanted them to move.  For the karts I used 3x5 cards and wrote out all the stats for the parts I had envisioned and then mixed and matched them to build “karts”. This worked really well and let me tune all my numbers before moving on to the art side. I started out by sketching out my idea of how a kart might fit together. Here you can see the first sketch I did where I attempted to put all my parts together.  Once I had it all colored I saw it would work and that’s when I broke out the sticker machine.  Designing and cutting  stickers that can be stacked without showing white borders is actually sort of a dark art. I had done it previously for Club PA when I made Gabe and Tycho dress up dolls but it was still tricky and my first few tests were rough but proved it would work. The board got an update with a new track layout and a bit more polish. I used powers from the previous game updated to fit with my new mechanics as well as a few new powers and printed up the cards. Just like in the last game the player in last place would draw from a different deck that was stacked with better stuff. Also huge thanks here to Kris Straub for the amazing SWK logo he made! At this point I started testing it as much as I could with my family and as a group we really shaved off a lot of the rough edges. Everyone had super valuable input that went right into making the game more fun. A lot of dinner conversations were had about how powers should work and mechanics that needed to be adjusted or dropped outright because they were not fun. Super Wizard Kart is truly a Krahulik family endeavor.  As we played it the game got beat into shape and eventually I gave the board a few more passes adding things we came up with like the initiative tracker and giving everything I could a sparkly sticker makeover and designed the player sheets.  I was really happy with how the final product came out and I had a blast playing it with my friends. I’d like to thank all the players again for going along with me. If someone told me they made a board game in their living room out of stickers and glue I’d probably run but they all sat down for three hours and I appreciate that.  If you’d like to play Super Wizard Kart at home I’ll be sharing all my rules shortly so keep an eye out here on the site. -Gabe Out",
  "image": "https://assets.penny-arcade.com/img/logo_opengraph.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection\u003e\n                            \u003cp\u003eI was asked to run a game of Acquisitions Incorporated and decided to dust off some ideas I had after running Wizard Kart for the C Team about a million years ago. While Wizard Kart was a sort of goofy way to play D\u0026amp;D, its sequel Super Wizard Kart is a fully self-contained board game. The players did not even need to bring their character sheets to the session. I’d like to thank my incredible players Jerry Holkins, Jasmine Bhullar, Kate Welch and Trystan Falcone for agreeing to sit down and play the results of my mad tinkering. You can watch the results right here!\u003c/p\u003e\n\n                            \n\u003cp\u003e\u003ciframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/WfSuazWZkcI?si=CUlrzIoJF-aiSxn7\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eIf you watched the video linked above and you’re thinking “damn I wonder how that came about?” I have got you covered. Here’s a look at the whole process!\u003c/p\u003e\n\u003cp\u003e\u003cbr/\u003eThe first board I built was a simple square just to test the two new ideas I had of moving traps and customizable karts. I used dungeon tiles to build the track and cut some plastic sheet protectors to make trap zones. I did not know what the traps were yet just that I wanted them to move. \u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/IMG_4651.RcSDi0LD.jpg\" alt=\"\" width=\"600\" height=\"575\"/\u003e\u003cbr/\u003eFor the karts I used 3x5 cards and wrote out all the stats for the parts I had envisioned and then mixed and matched them to build “karts”. This worked really well and let me tune all my numbers before moving on to the art side.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/IMG_4649.AUOd1q-U.jpg\" alt=\"\" width=\"600\" height=\"451\"/\u003e\u003cbr/\u003eI started out by sketching out my idea of how a kart might fit together. Here you can see the first sketch I did where I attempted to put all my parts together. \u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/IMG_4652.7ESQpo8v.jpg\" alt=\"\" width=\"600\" height=\"443\"/\u003e\u003cbr/\u003eOnce I had it all colored I saw it would work and that’s when I broke out the sticker machine. \u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/IMG_4658.mWMzImBc.jpg\" alt=\"\" width=\"600\" height=\"427\"/\u003e\u003cbr/\u003eDesigning and cutting  stickers that can be stacked without showing white borders is actually sort of a dark art. I had done it previously for Club PA when \u003ca href=\"https://www.penny-arcade.com/news/post/2024/02/05/everything-we-know-about-gabe-s-new-stickers\" target=\"_blank\" rel=\"noopener\"\u003eI made Gabe and Tycho dress up dolls\u003c/a\u003e but it was still tricky and my first few tests were rough but proved it would work.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/IMG_4686%20%281%29.6vi-nuFS.jpg\" alt=\"\" width=\"545\" height=\"700\"/\u003e\u003cbr/\u003eThe board got an update with a new track layout and a bit more polish. I used powers from the previous game updated to fit with my new mechanics as well as a few new powers and printed up the cards. Just like in the last game the player in last place would draw from a different deck that was stacked with better stuff. Also huge thanks here to Kris Straub for the amazing SWK logo he made!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/IMG_4834.PMZEB89j.jpg\" alt=\"\" width=\"553\" height=\"700\"/\u003e\u003cbr/\u003eAt this point I started testing it as much as I could with my family and as a group we really shaved off a lot of the rough edges. Everyone had super valuable input that went right into making the game more fun. A lot of dinner conversations were had about how powers should work and mechanics that needed to be adjusted or dropped outright because they were not fun. Super Wizard Kart is truly a Krahulik family endeavor. \u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/IMG_4931.Ax8roo4k.jpg\" alt=\"\" width=\"600\" height=\"450\"/\u003e\u003cbr/\u003eAs we played it the game got beat into shape and eventually I gave the board a few more passes adding things we came up with like the initiative tracker and giving everything I could a sparkly sticker makeover and designed the player sheets. \u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/IMG_4932.KMcgWvMp.jpg\" alt=\"\" width=\"600\" height=\"450\"/\u003e\u003cbr/\u003eI was really happy with how the final product came out and I had a blast playing it with my friends. I’d like to thank all the players again for going along with me. If someone told me they made a board game in their living room out of stickers and glue I’d probably run but they all sat down for three hours and I appreciate that. \u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://assets.penny-arcade.com/news/IMG_4933.jmcflw6_.jpg\" alt=\"\" width=\"600\" height=\"450\"/\u003e\u003cbr/\u003eIf you’d like to play Super Wizard Kart at home I’ll be sharing all my rules shortly so keep an eye out here on the site.\u003c/p\u003e\n\u003cp\u003e\u003cbr/\u003e-Gabe Out\u003c/p\u003e\t\t\t\t\t\t\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
