{
  "id": "2eace364-3d99-40c9-ae82-8a2632ca0fcd",
  "title": "Mother of 3-year-olds twins refuses to parent them during 5-hour flight: 'The couple next to me moved'",
  "link": "https://cheezburger.com/39314437/mother-of-3-year-olds-twins-refuses-to-parent-them-during-5-hour-flight-the-couple-next-to-me-moved",
  "description": "Is it true that \"Parents just don't parent anymore?\" Some people think that after reading this person's airplane story: they had the most annoying flight ever, thanks to some very young children who were allowed to run wild. What is it about travel that brings out the worst in people? Is it the stress of getting to your flight on time while carrying your heavy luggage? By the time you get to your gate, you're already cranky and hungry, so then you have to pay a small fortune to eat awful airport food. For the parents who are traveling with children, their kids are going to start asking to go to the bathroom, whining about wanting to go home, telling them they're bored, and running laps around the gate. Some kids will start crying and carrying on before they've even set foot on the aircraft! By the time their flight gets delayed once or twice, and they board as slowly as humanly possible, those kids are crawling up the walls. Bringing something to occupy them during the flight is starting to sound like a good idea! Up next, read about some people whose giant mistakes got them immediately fired, like one person whose mistake caused \"total damage [that] was almost $1,000,000.\"",
  "author": "Remy Millisky",
  "published": "Thu, 20 Feb 2025 14:00:00 -0800",
  "source": "http://feeds.feedburner.com/failblog",
  "categories": [
    "Babies",
    "toddlers",
    "airport",
    "flight",
    "seating",
    "seats",
    "plane",
    "passenger",
    "twins",
    "flights",
    "airplane",
    "flying"
  ],
  "byline": "Remy Millisky",
  "length": 876,
  "excerpt": "Mother of 3-year-olds twins refuses to parent them during 5-hour flight: 'The couple next to me moved' - The internet has generated a huge amount of laughs from cats and FAILS. And we all out of cats.",
  "siteName": "FAIL Blog",
  "favicon": "https://i.chzbgr.com/s/unversioned/images/square_logos/FailBlog.png",
  "text": "Maybe every generation says some version of \"parents don't parent like they used to.\" However, kids today are growing up glued to iPads, which prior generations of parents never had to deal with. It's a whole new world out there! Plus, if you said to a parent in 1980, \"What if you could hand your child a magical tablet that would make them stop whining and crying indefinitely?\" I bet a lot of them would take you up on that offer. The parent on this plane seems to have just given up and let her kids take over. As the annoyed flyer near her mentioned, the kids just didn't have enough to keep them preoccupied. Sometimes, it's okay for the kids to have a little screen time (like when they're on a multi-hour flight!). And even if you're a very anti-screen parent, there are plenty of little toys and games you can bring on a flight to make the time pass for your toddler.",
  "image": "https://i.chzbgr.com/thumb1200/39314437/h45F35CEC/babies-toddlers-airport-flight-seating-seats-plane-passenger-twins-flights-airplane-flying",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eMaybe every generation says some version of \u0026#34;parents don\u0026#39;t parent like they used to.\u0026#34; However, kids today are growing up glued to iPads, which prior generations of parents never had to deal with. It\u0026#39;s a whole new world out there! Plus, if you said to a parent in 1980, \u0026#34;What if you could hand your child a magical tablet that would make them stop whining and crying indefinitely?\u0026#34; I bet a lot of them would take you up on that offer. \u003c/p\u003e\u003cp\u003eThe parent on this plane seems to have just given up and let her kids take over. As the annoyed flyer near her mentioned, the kids just didn\u0026#39;t have enough to keep them preoccupied. Sometimes, it\u0026#39;s okay for the kids to have a little screen time (like when they\u0026#39;re on a multi-hour flight!). And even if you\u0026#39;re a very anti-screen parent, there are plenty of little toys and games you can bring on a flight to make the time pass for your toddler. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-02-20T21:00:00-08:00",
  "modifiedTime": null
}
