{
  "id": "90b0e8e2-b7ff-49df-aa09-eedad4707bd7",
  "title": "This is what comes of reading more than you talk to actual people.",
  "link": "https://thebloggess.com/2024/11/04/this-is-what-comes-of-reading-more-than-you-talk-to-actual-people/",
  "description": "A few days ago I admitted on threads that I have been mispronouncing the word “calamity” for my entire life and I only found out that I’d been mispronouncing it when I used it incorrectly on a conference call because of course I did. And then people on threads were like, “Wait, how do youContinue reading \"This is what comes of reading more than you talk to actual people.\"",
  "author": "thebloggess",
  "published": "Mon, 04 Nov 2024 22:45:48 +0000",
  "source": "https://thebloggess.com/feed/",
  "categories": [
    "Random Crap"
  ],
  "byline": "",
  "length": 1140,
  "excerpt": "A few days ago I admitted on threads that I have been mispronouncing the word “calamity” for my entire life and I only found out that I’d been mispronouncing it when I used it inc…",
  "siteName": "The Bloggess",
  "favicon": "",
  "text": "A few days ago I admitted on threads that I have been mispronouncing the word “calamity” for my entire life and I only found out that I’d been mispronouncing it when I used it incorrectly on a conference call because of course I did. And then people on threads were like, “Wait, how do you pronounce it?” and I was like, “Lamè, llama, Lamar…cuh-LOM-uh-tee” to explain why I thought it was pronounced that way but then a bunch of people were like, “Wait, have I been pronouncing it wrong my whole life too??” and I felt a little better that I wasn’t the only one fucking it up, but then I realized that quite a few people were thinking that I was giving the corrected pronunciation (rather than explaining why I’d always mispronounced it) and then they thought that they were wrong for rhyming “calamity” with “manatee” even though that’s (apparently) the correct way and so now I think I’ve accidentally convinced a lot of people who were pronouncing it correctly to now mispronounce it and this seems like a very good example of a calamity even though I’m still not entirely sure how to pronounce it. Post navigation",
  "image": "https://i0.wp.com/thebloggess.com/wp-content/uploads/2018/08/cropped-cropped-cheesecake.jpg?fit=512%2C512\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"content\"\u003e\n\n\t\t\u003cmain id=\"main\"\u003e\n\n\t\t\t\n\u003carticle id=\"post-42049\"\u003e\n\n\t\n\n\t\n\t\u003cdiv\u003e\n\t\t\n\u003cp\u003eA few days ago I admitted on \u003cstrong\u003e\u003ca href=\"https://www.threads.net/@thebloggess\" data-type=\"link\" data-id=\"https://www.threads.net/@thebloggess\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ethreads\u003c/a\u003e\u003c/strong\u003e that I have been mispronouncing the word “calamity” for my entire life and I only found out that I’d been mispronouncing it when I used it incorrectly on a conference call because \u003cem\u003eof course I did\u003c/em\u003e.  And then people on threads were like, “Wait, how do you pronounce it?” and I was like, “Lamè, llama, Lamar…cuh-LOM-uh-tee” to explain why I thought it was pronounced that way but then a bunch of people were like, “Wait, \u003cem\u003ehave I been pronouncing it wrong my whole life too??\u003c/em\u003e” and  I felt a little better that I wasn’t the only one fucking it up, but then I realized that quite a few people were thinking that I was giving the corrected pronunciation (rather than explaining why I’d always mispronounced it) and then they thought that they were wrong for rhyming “calamity” with “manatee” even though that’s (\u003cem\u003eapparently\u003c/em\u003e) the correct way and so now I think I’ve accidentally convinced a lot of people who were pronouncing it correctly to now mispronounce it and this seems like a very good example of a calamity even though I’m still not entirely sure how to pronounce it.\u003c/p\u003e\n\n\n\n\n\t\u003c/div\u003e\n\n\t\n\n\t\t\t\t\n\u003c/article\u003e\n\n\t\u003cnav aria-label=\"Posts\"\u003e\n\t\t\u003ch2\u003ePost navigation\u003c/h2\u003e\n\t\t\n\t\u003c/nav\u003e\n\n\n\t\t\u003c/main\u003e\n\n\t\t\n\n\n\n\t\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-04T22:45:48Z",
  "modifiedTime": "2024-11-04T22:45:48Z"
}
