{
  "id": "9fc3a55b-5c23-44f1-8297-d6b2beab8e31",
  "title": "‘What a scammer’: Airbnb host demands guest cancel their reservation after claiming the room will not be ready in time, guest refuses when discovering they were already charged for it",
  "link": "https://cheezburger.com/38845957/what-a-scammer-airbnb-host-demands-guest-cancel-their-reservation-after-claiming-the-room-will-not",
  "description": "There is something about businesses that allow random people to provide service to other random people, that is simply a recipe for disaster. Airbnb, Uber, DoorDash, etc – In theory, they are all great business models that allow people to make money without needing to maintain a whole business. Interested in becoming a taxi driver on your days off? Sign up for Uber. Want to rent out a unit no one is using? You don't have to register it as a hotel, you can just sign up for Airbnb. Simple as that.Except when it's not.The fact that these people are doing these 'side gigs', means that some of them are not 100% committed to it, and are definitely not committed to satisfying their customers. Because of this lack of commitment, customer service has to work overtime to ensure that people do not take advantage of each other, especially those who attempt to scam others for money.Take the Airbnb host as an example of someone who didn't really care about the business, and tried to scam people because of it.",
  "author": "Bar Mor Hazut",
  "published": "Thu, 23 Jan 2025 15:00:00 -0800",
  "source": "http://feeds.feedburner.com/failblog",
  "categories": [
    "customer support",
    "customer service",
    "guests",
    "hotel",
    "refund",
    "hosting",
    "customers",
    "reservation",
    "room",
    "reddit story",
    "Airbnb",
    "cancel",
    "mildly infuriating",
    "scam",
    "Reddit",
    "money"
  ],
  "byline": "Bar Mor Hazut",
  "length": 549,
  "excerpt": "‘What a scammer’: Airbnb host demands guest cancel their reservation after claiming the room will not be ready in time, guest refuses when discovering they were already charged for it - The internet has generated a huge amount of laughs from cats and FAILS. And we all out of cats.",
  "siteName": "FAIL Blog",
  "favicon": "https://i.chzbgr.com/s/unversioned/images/square_logos/FailBlog.png",
  "text": "This host has a studio for rent on Airbnb, but they are not really committed to that job. How do we know? For starters, they allowed someone to make a reservation even though the room was not ready. Then they tried to scam the guest for their money after insisting the guest needed to cancel the reservation, thus paying for it in full.The fact that this is even allowed proves that a business that allows random people to give service to other random people is deeply flawed. But at least the guest in this story did not give in to the host's scam.",
  "image": "https://i.chzbgr.com/thumb1200/38845957/h23A1A733/the-room-will-not-be-ready-in-time-guest-refuses-when-discovering-they-were-already-charged-for-it",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThis host has a studio for rent on Airbnb, but they are not really committed to that job. How do we know? For starters, they allowed someone to make a reservation even though the room was not ready. Then they tried to scam the guest for their money after insisting the guest needed to cancel the reservation, thus paying for it in full.\u003c/p\u003e\u003cp\u003eThe fact that this is even allowed proves that a business that allows random people to give service to other random people is deeply flawed. But at least the guest in this story did not give in to the host\u0026#39;s scam.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2025-01-23T05:00:00-08:00",
  "modifiedTime": null
}
