{
  "id": "b6541944-0fba-42aa-a274-25250029c8b9",
  "title": "Chromodysmorphia",
  "link": "https://www.penny-arcade.com/news/post/2024/10/21/chromodysmorphia",
  "description": "The funniest thing about this is… well, maybe it's not funny broadly. The ironic thing about it is that the worst sort of abuse he could visit upon a miniature is beyond the apex of what I could ever achieve, and even he feels like this. So it must just be part of the Human Condition to find ourselves dwarfed by the immensity of The Task At Hand.",
  "author": "",
  "published": "Mon, 21 Oct 2024 17:51:00 +0000",
  "source": "https://www.penny-arcade.com/feed",
  "categories": null,
  "byline": "By Tycho",
  "length": 2333,
  "excerpt": "Videogaming-related online strip by Mike Krahulik and Jerry Holkins. Includes news and commentary.",
  "siteName": "",
  "favicon": "",
  "text": "The funniest thing about this is… well, maybe it's not funny broadly. The ironic thing about it is that the worst sort of abuse he could visit upon a miniature is beyond the apex of what I could ever achieve, and even he feels like this. So it must just be part of the Human Condition to find ourselves dwarfed by the immensity of The Task At Hand. Obviously I engage in the occasional bout of negative self talk, but you should know what I know if you find yourself situated in some trench of aesthetic despair, which is that Painted is better than Not Painted, and These things need to look decent from Three Feet Away, not inches from your nose. . They need to look good over there, in their context, in a blooming field of other small things. Go crazy on leaders or hero units, if you want, as crazy as you can go; that's literally what we did in real life, so it makes sense. They had plumes and shit, these mofos quite literally put a bird on it. But the rest of these mooks? Naw. The other play is to go Skirmishy if you're interested in the hobby but the sheer volume of models feels like an insuperable barrier. There are armies in Warhammer Underworlds for example, powerful armies, that consist of three models total. And Halo: Flashpoint is like four guys a side. Don't blame me if you graduate to one of the big games later. I only mention it because it happened to me, tee em. One manifestation of whatever's going on with me is that while I have a mental health crisis when I try to paint a miniature, those figurines so core to the playing of miniature wargames, I have an endless appetite and indeed bottomless enthusiasm for the painting of terrain. This is considered something like a psychopathy in my group, being that it's not only boring and bad, but also dumb. It's the polar opposite of what I should be painting. Maybe that's what gives the affair such a deviant thrill. I can look at the forty incredibly small rat-men I have to paint - small, even by the standards of the genre! - or I can paint a hunk of dilapidated cathedral which will be used in every game that is ever played by the group, even if I'm not there. It's eminently practical, but I still suspect it's a sophisticated form of procrastination. (CW)TB out.",
  "image": "https://assets.penny-arcade.com/img/logo_opengraph.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \u003csection\u003e\n                            \u003cp\u003eThe funniest thing about \u003ca href=\"https://www.penny-arcade.com/comic/2024/10/21/\"\u003ethis\u003c/a\u003e is… well, maybe it\u0026#39;s not funny broadly. The ironic thing about it is that the worst sort of abuse he could visit upon a miniature is beyond the apex of what I could ever achieve, and even \u003cem\u003ehe\u003c/em\u003e feels like this. So it must just be part of the Human Condition to find ourselves dwarfed by the immensity of The Task At Hand.\u003c/p\u003e                        \u003c/section\u003e\n\t\t\t\t\t\t\n                        \u003csection\u003e\n                            \u003cp\u003eObviously I engage in the occasional bout of negative self talk, but you should know what I know if you find yourself situated in some trench of aesthetic despair, which is that\u003c/p\u003e\n\u003cp\u003ePainted is better than Not Painted, and\u003c/p\u003e\n\u003cp\u003eThese things need to look decent from Three Feet Away, not inches from your nose.\u003c/p\u003e\n\u003cp\u003e. They need to look good over there, in their context, in a blooming field of other small things. Go crazy on leaders or hero units, if you want, as crazy as you can go; that\u0026#39;s literally what we did in real life, so it makes sense. They had plumes and shit, these mofos quite literally put a bird on it. But the rest of these mooks? Naw. The other play is to go Skirmishy if you\u0026#39;re interested in the hobby but the sheer volume of models feels like an insuperable barrier. There are armies in \u003ca href=\"https://www.warhammer-community.com/en-us/articles/bftjprgq/warhammer-underworlds-roadmap-get-set-for-a-year-of-releases/\"\u003eWarhammer Underworlds\u003c/a\u003e for example, powerful armies, that consist of three models total. And \u003ca href=\"https://haloflashpoint.manticgames.com/\"\u003eHalo: Flashpoint\u003c/a\u003e is like four guys a side. Don\u0026#39;t blame me if you graduate to one of the big games later. I only mention it because it happened to me, tee em.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eOne\u003c/em\u003e manifestation of whatever\u0026#39;s going on with me is that while I have a mental health crisis when I try to paint a miniature, those figurines \u003cem\u003eso core\u003c/em\u003e to the playing of miniature wargames, I have an endless appetite and indeed bottomless enthusiasm for the painting of terrain. This is considered something like a psychopathy in my group, being that it\u0026#39;s not only boring and bad, but also dumb. It\u0026#39;s the polar opposite of what I \u003cem\u003eshould\u003c/em\u003e be painting. Maybe that\u0026#39;s what gives the affair such a deviant thrill. I can look at the forty incredibly small rat-men I have to paint - small, even by the standards of the genre! - or I can paint a hunk of dilapidated cathedral which will be used in every game that is ever played by the group, even if I\u0026#39;m not there. It\u0026#39;s eminently practical, but I still suspect it\u0026#39;s a sophisticated form of procrastination.\u003c/p\u003e\n\u003cp\u003e(CW)TB out.\u003c/p\u003e\t\t\t\t\t\t\u003c/section\u003e\t\t\t\t\t\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
