{
  "id": "d75de9f6-4c67-430c-a6c1-66ff266669e2",
  "title": "14 Celebrities Who Had to Prove That They Weren’t Dead",
  "link": "https://www.cracked.com/article_44512_14-celebrities-who-had-to-prove-that-they-werent-dead.html?newsletter-cat=movies-tv",
  "description": "By Jesse Published: December 01st, 2024",
  "author": "",
  "published": "Sun, 01 Dec 2024 08:00:00 -0800",
  "source": "http://feeds.feedburner.com/CrackedRSS",
  "categories": null,
  "byline": "Jesse",
  "length": 4265,
  "excerpt": "Who do you think can take a joke better: Macaulay Culkin or The Rock?",
  "siteName": "Cracked.com",
  "favicon": "https://ui-seo-1.crackedcdn.com/images/favicon/apple-touch-icon.png?v=b33d062d90cfca74c0e8494b41bc0bf6",
  "text": "Who do you think can take a joke better: Macaulay Culkin or The Rock? Celebrities, for all their money and power, are like little pets who belong to the public. If they don’t do something interesting, we’ll kind of prod them a little bit until they do. One way people will goad a famous person into action is by lying about their gruesome, untimely death. Here are a few times celebrities had to clarify that they weren’t flattened at the bottom of a remote canyon… 14 The Rock Cause of “Death”: Fell off a cliff in New ZealandProof of Life: The future presidential nominee tweeted, threateningly, “I would love to meet the person who is starting rumors of my death — to show them how a dead foot feels up their ass.” 13 Wayne Knight Cause of “Death”: Nebulous Twitter rumorsProof of Life: Sarcastic indignant tweets. He posted “Does someone have to DIE to trend? Geez! Thanks for all the love everybody. I didn’t know you cared. Glad to be breathing!” And: “Some of you will be glad to hear this, others strangely disappointed, but….I am alive and well!” 12 Russell Crowe Cause of “Death”: Fell off a cliffProof of Life: A very Australian tweet: “Unable to answer. Fell off a mountain in Austria, all over red rover. Don’t know how I got there, but the media are never wrong. G’Bye” 11 Morgan Freeman Cause of “Death”: A hoax Facebook tribute page titled “RIP Morgan Freeman”Proof of Life: When asked about it, Freeman said, “I keep reading that I have died. I hope those stories are not true.” 10 Zach Braff Cause of “Death”: “OD’d on some pills”Proof of Life: A video from the set of Scrubs. He said, “I would never off myself with pills. If I had to do it, I would do it the way that everyone else would do it: by hitting myself with pots and pans.” 9 Jackie Chan Cause of “Death”: Heart attack, car crash, fall from a 12-story buildingProof of Life: Official statement: “Today, everybody called to congratulate me on my rumored engagement. Afterward, everybody called me to see if I was alive.” 8 Tom Cruise Cause of “Death”: Apparently died on the toilet, as a freak “plumming accident” occurred while he was on vacationProof of Life: He gave an interview to prove he wasn’t a pre-recorded hologram, saying, “I’m really alive. Did the internet get it wrong again?” 7 Usher Cause of “Death”: Car crashProof of Life: Shirtless selfie. He tweeted, “I must’ve died and went to heaven… Alive and cold kickin’ ass!” 6 Abe Vigoda Cause of “Death”: Typo. A 1982 People article referred to him as “the late Abe Vigoda.” Proof of Life: Snarky photo. He published a picture of himself reading People in a coffin.Murdered by Words: A contemporary said, “I’ve seen Abe in person. He only looks dead.” 5 Jon Bon Jovi Cause of “Death”: Found dead in a hotelProof of Life: State pride. He posted a picture of himself holding a sign with the date and the message: “Heaven looks a lot like New Jersey” 4 Billy Crystal Cause of “Death”: Heartfelt tweet from a fan: “BillyCrystal you were a gift my fav When Harry Met Sally…keep them Laughing in the Heaven’s”Proof of Life: Bewildered RT. Crystal responded with a simple “?” 3 Paul McCartney Cause of “Death”: Outlandish conspiracy theory. He wrote the title song to a 1985 film that, when played backward, made paranoid stoners hear “Paul is dead.” Then, of course, the “Abbey Road” album cover was packed with tiny hints that he’d been killed off and replaced. Proof of Life: McCartney told the BBC, “If the conclusion you reach is that I’m dead, then you’re wrong, because I’m alive and living in Scotland.” 2 Reba McEntire Cause of “Death”: Falling off a mountain in AustriaProof of Life: Career goals. She posted, “There is a rumor going around that I died after falling off a mountain in Austria yesterday while shooting a movie. While I would love to be shooting a movie in Austria, I definitely did not fall off a mountain! Nor am I dead! I am alive and kicking!!!” 1 Macaulay Culkin Cause of “Death”: Premature Facebook memorial pageProof of Life: His pizza-based indie band, the Pizza Underground, posted a couple pictures of his apparent lifeless corpse being puppetted by his friends. Tags: News Scroll down for the next article Must Read SIGN UP FORA WEEKLYNEWSLETTER OF JOKES + TRIVIA",
  "image": "https://s3.crackedcdn.com/phpimages/article/4/4/0/1192440.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"content-wrapper\" data-content-index=\"1\" data-content-id=\"44512\" data-content-type=\"article\" data-content-form=\"dpf\" data-content-rating=\"pg\"\u003e\n\u003cdiv\u003e\n\u003csection\u003e\n\n\u003cp\u003e\nWho do you think can take a joke better: Macaulay Culkin or The Rock?\n\u003c/p\u003e\n\u003cfigure\u003e \u003cpicture\u003e \u003csource media=\"(min-width: 700px)\" srcset=\"https://s3.crackedcdn.com/phpimages/article/4/3/9/1192439_800x450.jpg\"/\u003e \u003csource media=\"(min-width: 320px)\" srcset=\"https://s3.crackedcdn.com/phpimages/article/4/3/9/1192439_320x180.jpg\"/\u003e \u003cimg src=\"https://s3.crackedcdn.com/phpimages/article/4/3/9/1192439_320x180.jpg\" alt=\"14 Celebrities Who Had to Prove That They Weren’t Dead\"/\u003e \u003c/picture\u003e \u003c/figure\u003e  \u003c/section\u003e \u003carticle\u003e\u003cp\u003e\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.cracked.com/image-pictofact-13383-21-celebrities-who-were-on-top-of-the-world-one-day-and-at-rock-bottom-the-next\"\u003e\u003cspan\u003eCelebrities\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, for all their money and power, are like little pets who belong to the public. If they don’t do something interesting, we’ll kind of prod them a little bit until they do. One way people will goad a famous person into action is by lying about their gruesome, untimely death. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHere are a few times celebrities had to clarify that they weren’t flattened at the bottom of a remote canyon…\u003c/span\u003e\u003c/p\u003e\n\u003carticle id=\"entry-1\"\u003e\u003ch2\u003e\u003clabel\u003e14 \u003c/label\u003e\u003cspan\u003eThe Rock\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e Fell off a cliff in New Zealand\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e The future presidential nominee tweeted, threateningly, “I would love to meet the person who is starting rumors of my death — to show them how a dead foot feels up their ass.”\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003carticle id=\"entry-2\"\u003e\u003ch2\u003e\u003clabel\u003e13 \u003c/label\u003e\u003cspan\u003eWayne Knight\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e Nebulous Twitter rumors\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e Sarcastic indignant tweets. He posted “Does someone have to DIE to trend? Geez! Thanks for all the love everybody. I didn’t know you cared. Glad to be breathing!” And: “Some of you will be glad to hear this, others strangely disappointed, but….I am alive and well!”\u003c/span\u003e\u003c/p\u003e\n  \u003c/article\u003e\u003carticle id=\"entry-3\"\u003e\u003ch2\u003e\u003clabel\u003e12 \u003c/label\u003e\u003cspan\u003eRussell Crowe\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e Fell off a cliff\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e A very Australian tweet: “Unable to answer. Fell off a mountain in Austria, all over red rover. Don’t know how I got there, but the media are never wrong. G’Bye”\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003carticle id=\"entry-4\"\u003e\u003ch2\u003e\u003clabel\u003e11 \u003c/label\u003e\u003cspan\u003eMorgan Freeman\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e A hoax Facebook tribute page titled “RIP Morgan Freeman”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e When asked about it, Freeman said, “I keep reading that I have died. I hope those stories are not true.”\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003carticle id=\"entry-5\"\u003e\u003ch2\u003e\u003clabel\u003e10 \u003c/label\u003e\u003cspan\u003eZach Braff\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e “OD’d on some pills”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener\" href=\"https://www.youtube.com/watch?v=n3j4PJkkvUs\"\u003e\u003cspan\u003eA video\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e from the set of \u003ci\u003eScrubs\u003c/i\u003e. He said, “I would never off myself with pills. If I had to do it, I would do it the way that everyone else would do it: by hitting myself with pots and pans.”\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003carticle id=\"entry-6\"\u003e\u003ch2\u003e\u003clabel\u003e9 \u003c/label\u003e\u003cspan\u003eJackie Chan\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e Heart attack, car crash, fall from a 12-story building\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e Official statement: “Today, everybody called to congratulate me on my rumored engagement. Afterward, everybody called me to see if I was alive.”\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003carticle id=\"entry-7\"\u003e\u003ch2\u003e\u003clabel\u003e8 \u003c/label\u003e\u003cspan\u003eTom Cruise\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e Apparently died on the toilet, as a freak “plumming accident” occurred while he was on vacation\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e He gave an interview to prove he wasn’t a pre-recorded hologram, saying, “I’m really alive. Did the internet get it wrong again?”\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003carticle id=\"entry-8\"\u003e\u003ch2\u003e\u003clabel\u003e7 \u003c/label\u003e\u003cspan\u003eUsher\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e Car crash\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e Shirtless selfie. He tweeted, “I must’ve died and went to heaven… Alive and cold kickin’ ass!”\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003carticle id=\"entry-9\"\u003e\u003ch2\u003e\u003clabel\u003e6 \u003c/label\u003e\u003cspan\u003eAbe Vigoda\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e Typo. A 1982 \u003ci\u003ePeople\u003c/i\u003e article referred to him as “the late Abe Vigoda.” \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e Snarky photo. He published a picture of himself reading \u003ci\u003ePeople\u003c/i\u003e in a coffin.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eMurdered by Words:\u003c/strong\u003e A contemporary said, “I’ve seen Abe in person. He only looks dead.”\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003carticle id=\"entry-10\"\u003e\u003ch2\u003e\u003clabel\u003e5 \u003c/label\u003e\u003cspan\u003eJon Bon Jovi\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e Found dead in a hotel\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e State pride. He posted a picture of himself holding a sign with the date and the message: “Heaven looks a lot like New Jersey”\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003carticle id=\"entry-11\"\u003e\u003ch2\u003e\u003clabel\u003e4 \u003c/label\u003e\u003cspan\u003eBilly Crystal\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e Heartfelt tweet from a fan: “BillyCrystal you were a gift my fav When Harry Met Sally…keep them Laughing in the Heaven’s”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e Bewildered RT. Crystal responded with a simple “?”\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003carticle id=\"entry-12\"\u003e\u003ch2\u003e\u003clabel\u003e3 \u003c/label\u003e\u003cspan\u003ePaul McCartney\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e Outlandish conspiracy theory. He wrote the title song to a 1985 film that, when played backward, made paranoid stoners hear “Paul is dead.” Then, of course, the “Abbey Road” album cover was packed with tiny hints that he’d been killed off and replaced. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e McCartney told the BBC, “If the conclusion you reach is that I’m dead, then you’re wrong, because I’m alive and living in Scotland.”\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003carticle id=\"entry-13\"\u003e\u003ch2\u003e\u003clabel\u003e2 \u003c/label\u003e\u003cspan\u003eReba McEntire\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e Falling off a mountain in Austria\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e Career goals. She posted, “There is a rumor going around that I died after falling off a mountain in Austria yesterday while shooting a movie. While I would love to be shooting a movie in Austria, I definitely did not fall off a mountain! Nor am I dead! I am alive and kicking!!!”\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003carticle id=\"entry-14\"\u003e\u003ch2\u003e\u003clabel\u003e1 \u003c/label\u003e\u003cspan\u003eMacaulay Culkin\n\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eCause of “Death”:\u003c/strong\u003e Premature Facebook memorial page\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eProof of Life:\u003c/strong\u003e His pizza-based indie band, the Pizza Underground, posted a couple pictures of his apparent lifeless corpse being puppetted by his friends.\u003c/span\u003e\u003c/p\u003e\n\u003c/article\u003e\u003c/article\u003e  \u003csection\u003e \u003ch2\u003eTags:\u003c/h2\u003e \u003cul\u003e \u003cli\u003e\u003ca href=\"https://www.cracked.com/t/news\" title=\"News\"\u003eNews\u003c/a\u003e\u003c/li\u003e \u003c/ul\u003e \u003c/section\u003e  \u003cp\u003e\u003cspan\u003eScroll down for the next article\u003c/span\u003e \u003c/p\u003e  \u003cdiv\u003e \u003ch2\u003eMust Read\u003c/h2\u003e  \u003c/div\u003e \u003c/div\u003e \u003cdiv\u003e   \u003cdiv\u003e  \u003cdiv\u003e \u003cp\u003e\u003clabel\u003eSIGN UP FOR\u003c/label\u003e\u003c/p\u003e\u003ch3\u003eA WEEKLY\u003cbr/\u003eNEWSLETTER OF\u003cbr/\u003e JOKES + TRIVIA\u003c/h3\u003e  \u003c/div\u003e \u003c/div\u003e \u003c/div\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-01T08:00:00-08:00",
  "modifiedTime": null
}
