{
  "id": "dca74d7d-56f1-46f6-9035-cf410c3df23e",
  "title": "The Fuze, The Proud",
  "link": "https://www.penny-arcade.com/news/post/2024/11/12/the-fuze-the-proud",
  "description": "I think R6 is probably a top five game for me, if not top three. The most common rejoinder I hear from people who washed out of it has to do with the sheer number of champions - I mean heroes, I mean Operators - you have to contend with. It's coming up on something like eighty, but they are divided into Attackers and Defenders and I think the asymmetry helps a lot. Also, I'm a dessicated and ancient genetic doldrum and I managed to get it. It's worth a couple nights and some time on YouTube to gain entrance to the Inner Sanctum - to play a dynamic, aggressive social deduction game masquerading as a shooter. It's simultaneously still kickin' and profoundly slept on.",
  "author": "",
  "published": "Tue, 12 Nov 2024 02:05:00 +0000",
  "source": "https://www.penny-arcade.com/feed",
  "categories": null,
  "byline": "By Tycho",
  "length": 2049,
  "excerpt": "Videogaming-related online strip by Mike Krahulik and Jerry Holkins. Includes news and commentary.",
  "siteName": "",
  "favicon": "",
  "text": "I think R6 is probably a top five game for me, if not top three. The most common rejoinder I hear from people who washed out of it has to do with the sheer number of champions - I mean heroes, I mean Operators - you have to contend with. It's coming up on something like eighty, but they are divided into Attackers and Defenders and I think the asymmetry helps a lot. Also, I'm a dessicated and ancient genetic doldrum and I managed to get it. It's worth a couple nights and some time on YouTube to gain entrance to the Inner Sanctum - to play a dynamic, aggressive social deduction game masquerading as a shooter. It's simultaneously still kickin' and profoundly slept on. One issue we do occasionally experience has to do with a particular Operator on the attack side of the equation, called Fuze. Largely piloted by Mike Krahulik, this character's unique ability is to plant a device on one side of a wall that fires a volley of explosive grenades into the room on the opposite side. We can all see why that might be unpleasant, and the sound that accompanies it is a harbinger of doom. He likes to use them on flanks, both as a trick (are they going to breach here?) and a strike (for all the reasons that grenades are dangerous generally). The rest of us are providing the other tine of the flank, and even though you can see the outline of a teammate through the wall, sometimes that's not enough information. Or, it is enough information, but as God's Executioner Gabriel simply answers to a higher law. I'm in Japan currently, in Kobe. My only experience here before was largely centered on Tokyo, which has aspects of it that feel like other truly global cities while also being distinct for about a million reasons that barely warrant description if you have any familiarity with pop culture whatsoever. Kobe feels different to me; you wouldn't reach this level until about halfway through the game. I've never felt so white in my entire life. (CW)TB out.",
  "image": "https://assets.penny-arcade.com/img/logo_opengraph.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \u003csection\u003e\n                            \u003cp\u003eI think R6 is probably a top five game for me, if not top three. The most common rejoinder I hear from people who washed out of it has to do with the sheer number of champions - I mean heroes, I mean Operators - you have to contend with. It\u0026#39;s coming up on something like eighty, but they are divided into Attackers and Defenders and I think the asymmetry helps a lot. Also, I\u0026#39;m a dessicated and ancient genetic doldrum and I managed to get it. It\u0026#39;s worth a couple nights and some time on YouTube to gain entrance to the Inner Sanctum - to play a dynamic, aggressive social deduction game masquerading as a shooter. It\u0026#39;s simultaneously still kickin\u0026#39; and profoundly slept on.\u003c/p\u003e                        \u003c/section\u003e\n\t\t\t\t\t\t\n                        \u003csection\u003e\n                            \u003cp\u003eOne issue we do occasionally experience has to do with a particular Operator on the attack side of the equation, called Fuze. Largely piloted by Mike Krahulik, this character\u0026#39;s unique ability is to plant a device on one side of a wall that fires a volley of explosive grenades into the room on the opposite side. We can all see why that might be unpleasant, and the sound that accompanies it is a harbinger of doom.\u003c/p\u003e\n\u003cp\u003eHe likes to use them on flanks, both as a trick (are they going to breach here?) and a strike (for all the reasons that grenades are dangerous generally). The rest of us are providing the other tine of the flank, and even though you can see the outline of a teammate through the wall, sometimes that\u0026#39;s not enough information. Or, it is enough information, but as God\u0026#39;s Executioner Gabriel simply answers to \u003ca href=\"https://www.penny-arcade.com/comic/2024/11/11/\"\u003ea higher law\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eI\u0026#39;m in Japan currently, in Kobe. My only experience here before was largely centered on Tokyo, which has aspects of it that feel like other truly global cities while also being distinct for about a million reasons that barely warrant description if you have any familiarity with pop culture whatsoever.\u003c/p\u003e\n\u003cp\u003eKobe feels different to me; you wouldn\u0026#39;t reach this level until about halfway through the game. I\u0026#39;ve never felt so white in my entire life.\u003c/p\u003e\n\u003cp\u003e(CW)TB out.\u003c/p\u003e\t\t\t\t\t\t\u003c/section\u003e\t\t\t\t\t\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
