{
  "id": "e4d77168-89a4-4608-8e61-999fecf606cd",
  "title": "‘And we all enjoyed our meals in peace': Father uses Christmas music to shutdown the entitled man refusing to stop the video chat he's having at full volume that is overstimulating his neurodivergent son",
  "link": "https://cheezburger.com/38462725/and-we-all-enjoyed-our-meals-in-peace-father-uses-christmas-music-to-shutdown-the-entitled-man",
  "description": "How a family enjoys the holidays is unique and cater to that specific unite. One family will travel to somewhere new every year, or another will always go to the Nonna's and eat lots of pasta. Or maybe your family celebrates more on Christmas Eve and Christmas day everyone kind of does their own thing. Whatever it is, it's niche to you and your loved ones and that is beautiful. In these case of this Redditor, for his Christmas tradition, he took his kid out to have a one on one breakfast together. They went to the (in)famous Waffle House—a beloved staple breakfast chain. This place is known for their rowdy customers, but also, their camaraderie and tasty waffles. So when this adorable family duo, who are both \"high functioning autistic,\" went to Waffle House Christmas morning, they were hoping to have a good time. However, there are always entitled people out there that can get in the way of that peace…",
  "author": "Elna McHilderson",
  "published": "Fri, 27 Dec 2024 13:00:00 -0800",
  "source": "http://feeds.feedburner.com/failblog",
  "categories": [
    "karens",
    "neurodivergent",
    "reddit karen",
    "waffle house",
    "what goes around comes around",
    "entitled people karma",
    "pay back",
    "karens in the wild",
    "justice served",
    "entitled",
    "karen karma",
    "family",
    "father and son",
    "r-entitled",
    "Reddit",
    "karen story",
    "karma",
    "karen",
    "holidays",
    "entitled people"
  ],
  "byline": "Elna McHilderson",
  "length": 1307,
  "excerpt": "‘And we all enjoyed our meals in peace': Father uses Christmas music to shutdown the entitled man refusing to stop the video chat he's having at full volume that is overstimulating his neurodivergent son - The internet has generated a huge amount of laughs from cats and FAILS. And we all out of cats.",
  "siteName": "FAIL Blog",
  "favicon": "https://i.chzbgr.com/s/unversioned/images/square_logos/FailBlog.png",
  "text": "1 This image is for illustration only, and the subjects are models; the image does not depict the actual subjects of the story. What should have been a peaceful Christmas breakfast and bonding moment for a father and son during the holidays turned into somewhat of a stressful situation. If you have ever been to a Waffle House then you know that the booths are all set up back-to-back, so there really isn't any room in-between each customers at the booths. So, when the man sitting directly behind them decided to have a full-volume video chat, it was annoying to say the least. The father, at first, tried to give the guy a courtesy glance that read “sir, you are being impolite, please turn the phone off.” But the man returned that glance with an outright disrespectful eye-roll. The father could see that his son was getting overstimulated and he himself was feeling that way too. So, to deal with an entitled and loud guy, he dished on the same energy—but in a more festive way. The dad propped his phone up right behind the guy and blasted Christmas music at full volume. Eventually the man got the picture and hung up the phone, so the dad turned the music off. But what a beautiful way to shutdown a Waffle House grinch!",
  "image": "https://i.chzbgr.com/thumb1200/38462725/hE280135D/to-stop-the-video-chat-hes-having-at-full-volume-that-is-overstimulating-his-neurodivergent-son",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003e1\u003c/span\u003e\n                            \u003c/p\u003e\n        \u003cdiv\u003e\n\n\u003cp\u003e\u003cimg src=\"https://i.chzbgr.com/full/10447368704/hB04E3820\" id=\"_r_a_10447368704\" width=\"800\" height=\"534\" alt=\"Cheezburger Image 10447368704\" title=\"\"/\u003e  \u003c/p\u003e\n\n        \u003c/div\u003e\n            \u003cdiv\u003e\u003cp\u003e\u003ci\u003e\u003csub\u003e\u003csup\u003eThis image is for illustration only, and the subjects are models; the image does not depict the actual subjects of the story.\u003c/sup\u003e\u003c/sub\u003e\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\n        \n    \u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhat should have been a peaceful Christmas breakfast and bonding moment for a father and son during the holidays turned into somewhat of a stressful situation. If you have ever been to a Waffle House then you know that the booths are all set up back-to-back, so there really isn\u0026#39;t any room in-between each customers at the booths. So, when the man sitting directly behind them decided to have a full-volume video chat, it was annoying to say the least. \u003c/p\u003e\u003cp\u003eThe father, at first, tried to give the guy a courtesy glance that read “sir, you are being impolite, please turn the phone off.” But the man returned that glance with an outright disrespectful eye-roll. The father could see that his son was getting overstimulated and he himself was feeling that way too. So, to \u003ca href=\"https://cheezburger.com/38457861/we-live-in-a-society-karen-leaves-her-cart-behind-a-parked-car-and-man-in-the-car-returns-the-favor\" target=\"_blank\" rel=\"noopener\"\u003edeal with an entitled and loud guy,\u003c/a\u003e he dished on the same energy—but in a more festive way. The dad propped his phone up right behind the guy and blasted Christmas music at full volume. Eventually the man got the picture and hung up the phone, so the dad turned the music off. But what a beautiful way to shutdown a Waffle House grinch! \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-27T13:00:00-08:00",
  "modifiedTime": null
}
