{
  "id": "02641ee8-c74f-4e01-92b5-5e04f5a91697",
  "title": "Europe on Alert Over Suspected Sabotage of Undersea Cables",
  "link": "https://tech.slashdot.org/story/25/03/05/1928223/europe-on-alert-over-suspected-sabotage-of-undersea-cables?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "European nations have heightened security after a series of suspected sabotage attacks on submarine infrastructure in the Baltic Sea, with officials increasingly pointing to Russia as the likely culprit. Finnish authorities detained the tanker Eagle S in December after it allegedly damaged three undersea fiber-optic connections with Estonia and one with Germany. The vessel, carrying Russian oil as part of a \"shadow fleet\" evading sanctions, made suspicious course changes while crossing cable routes. In November, two more submarine cables in the Baltic were damaged, with investigations focusing on Chinese-owned cargo ship Yi Peng 3, which reduced speed near the cables and turned off its transponder. NATO launched Baltic Sentry in January to enhance surveillance, deploying ships and naval drones off Estonia's coast. The alliance also established a coordination cell following the 2022 Nord Stream pipeline sabotage. Russia has denied involvement, accusing NATO of using \"myths\" to increase its Baltic presence. Read more of this story at Slashdot.",
  "author": "msmash",
  "published": "2025-03-05T22:01:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "internet"
  ],
  "byline": "",
  "length": 1026,
  "excerpt": "European nations have heightened security after a series of suspected sabotage attacks on submarine infrastructure in the Baltic Sea, with officials increasingly pointing to Russia as the likely culprit. Finnish authorities detained the tanker Eagle S in December after it allegedly damaged three u...",
  "siteName": "",
  "favicon": "",
  "text": "European nations have heightened security after a series of suspected sabotage attacks on submarine infrastructure in the Baltic Sea, with officials increasingly pointing to Russia as the likely culprit. Finnish authorities detained the tanker Eagle S in December after it allegedly damaged three undersea fiber-optic connections with Estonia and one with Germany. The vessel, carrying Russian oil as part of a \"shadow fleet\" evading sanctions, made suspicious course changes while crossing cable routes. In November, two more submarine cables in the Baltic were damaged, with investigations focusing on Chinese-owned cargo ship Yi Peng 3, which reduced speed near the cables and turned off its transponder. NATO launched Baltic Sentry in January to enhance surveillance, deploying ships and naval drones off Estonia's coast. The alliance also established a coordination cell following the 2022 Nord Stream pipeline sabotage. Russia has denied involvement, accusing NATO of using \"myths\" to increase its Baltic presence.",
  "image": "https://a.fsdn.com/sd/topics/internet_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-176624169\"\u003e\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tEuropean nations \u003ca href=\"https://www.theguardian.com/world/ng-interactive/2025/mar/05/shadow-fleets-subaquatic-sabotage-europe-undersea-internet-cables-under-attack\"\u003ehave heightened security\u003c/a\u003e after a series of suspected sabotage attacks on submarine infrastructure in the Baltic Sea, with officials increasingly pointing to Russia as the likely culprit.\u003c/p\u003e\u003cp\u003e \n\nFinnish authorities detained the tanker Eagle S in December after it allegedly damaged three undersea fiber-optic connections with Estonia and one with Germany. The vessel, carrying Russian oil as part of a \u0026#34;shadow fleet\u0026#34; evading sanctions, made suspicious course changes while crossing cable routes.\u003c/p\u003e\u003cp\u003e \n\nIn November, two more submarine cables in the Baltic were damaged, with investigations focusing on Chinese-owned cargo ship Yi Peng 3, which reduced speed near the cables and turned off its transponder. NATO launched Baltic Sentry in January to enhance surveillance, deploying ships and naval drones off Estonia\u0026#39;s coast. The alliance also established a coordination cell following the 2022 Nord Stream pipeline sabotage.\u003c/p\u003e\u003cp\u003e \n\nRussia has denied involvement, accusing NATO of using \u0026#34;myths\u0026#34; to increase its Baltic presence.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
