{
  "id": "061f4ac4-3e59-4625-a133-296bd8d2f7ef",
  "title": "Google launches AI bot to call businesses for you about prices and availability",
  "link": "https://mashable.com/article/google-ask-for-me-ai-bot-call-businesses-for-you-price-availability",
  "description": "Google announced a new experiment in Search Labs that can call businesses on your behalf and ask about pricing and availability. This might get weird for whoever is picking up the phone.",
  "author": "",
  "published": "Thu, 30 Jan 2025 21:11:28 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Cecily Mauran",
  "length": 3739,
  "excerpt": "Starting with nail salons and car mechanics.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "Starting with nail salons and car mechanics. Great for introverts, confusing for business owners. Credit: Mashable composite: Google / Getty Images For people who hate making mundane phone calls, Google has an AI solution. On Thursday, the tech giant announced \"Ask for me,\" an experiment in its Search Labs testing ground for Google Search. The feature uses AI to call local businesses on your behalf and ask about pricing and availability. Currently, the feature works for calling nail salons and local mechanics for an oil change or other standard car maintenance, but according to the options menu, more businesses are coming soon.  Tweet may have been deleted Like the rest of the AI industry, Google is leaning more and more into agentic experiences — AI that can do things on your behalf. Automating information-gathering calls is just one of the ways it's doing this. Google recently launched a Gemini tool that acts as a research assistant that can gather data for you from the web, and it debuted another Search Labs experiment that waits on hold for you when calling customer service. Mashable Light Speed Its newest Gemini model is integrated with the latest Samsung Galaxy and Pixel phones, with features for pulling together information, creating calendar events, and sending messages. If you're enrolled in Search Labs, you can toggle on the experiment to test it. Note: By enrolling in Search Labs, you agree to share this data with Google to improve its AI models. Next, choose whether you're looking for information about a nail salon or mechanic, and proceed to the next few steps about the services you're looking for. Once you've added all the pertinent information, choose to receive a response via SMS or email, which takes up to 30 minutes. Easy peasy. Tweet may have been deleted For the receiving end of the call, that's another story. The person who picks up the phone will receive an automated announcement from Google AI saying that it's calling on behalf of a user. If the person hasn't hung up yet — because my first reaction would be that it's obviously spam — the AI will proceed to ask about pricing and availability. The receiver can then give the bot a response in a conversational manner, which it's capable of understanding, and send its response to you. When we tried it out, we got a response from Google 21 minutes later informing us about prices and availability for a manicure at a local nail salon. The Google bot also said they tried other salons but \"couldn't reach\" them. Maybe they were busy, or maybe they were bewildered by the automated request. Cecily is a tech reporter at Mashable who covers AI, Apple, and emerging tech trends. Before getting her master's degree at Columbia Journalism School, she spent several years working with startups and social impact businesses for Unreasonable Group and B Lab. Before that, she co-founded a startup consulting business for emerging entrepreneurial hubs in South America, Europe, and Asia. You can find her on Twitter at @cecily_mauran. These newsletters may contain advertising, deals, or affiliate links. By clicking Subscribe, you confirm you are 16+ and agree to our Terms of Use and Privacy Policy.",
  "image": "https://helios-i.mashable.com/imagery/articles/004r4IfRszb3wwOS7cAbU6b/hero-image.fill.size_1200x675.v1738265253.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n        \n\n        \n    \u003cp\u003eStarting with nail salons and car mechanics.\u003c/p\u003e\n    \n\n    \n\u003c/div\u003e\u003csection data-ga-module=\"content_body\"\u003e\n                        \u003cdiv\u003e\n                \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/articles/004r4IfRszb3wwOS7cAbU6b/hero-image.fill.size_1248x702.v1738265253.jpg\" alt=\"three smartphone screens showing the steps on google search for asking AI to call businesses to ask about pricing and availability\" width=\"1248\" height=\"702\" srcset=\"https://helios-i.mashable.com/imagery/articles/004r4IfRszb3wwOS7cAbU6b/hero-image.fill.size_400x225.v1738265253.jpg 400w, https://helios-i.mashable.com/imagery/articles/004r4IfRszb3wwOS7cAbU6b/hero-image.fill.size_800x450.v1738265253.jpg 800w, https://helios-i.mashable.com/imagery/articles/004r4IfRszb3wwOS7cAbU6b/hero-image.fill.size_1248x702.v1738265253.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eGreat for introverts, confusing for business owners.\u003c/span\u003e\n                \n                                    \u003cspan\u003eCredit: Mashable composite: Google / Getty Images\u003c/span\u003e\n                            \u003c/p\u003e\n                        \u003c/div\u003e\n\n    \n    \n    \n            \u003carticle id=\"article\" data-autopogo=\"\"\u003e\n                                    \u003cp\u003eFor people who hate making mundane phone calls, \u003ca href=\"https://mashable.com/category/google\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eGoogle\u003c/a\u003e has an AI solution. \u003c/p\u003e\u003cp\u003eOn Thursday, the tech giant \u003ca href=\"https://x.com/dozenrose/status/1885006588785877219\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eannounced\u003c/a\u003e \u0026#34;Ask for me,\u0026#34; an experiment in its Search Labs testing ground for Google Search. The feature uses AI to call local businesses on your behalf and ask about pricing and availability. Currently, the feature works for calling nail salons and local mechanics for an oil change or other standard car maintenance, but according to the options menu, more businesses are coming soon. \u003c/p\u003e\n\u003cblockquote\u003e\n    \u003ca href=\"https://twitter.com/dozenrose/status/1885006588785877219\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003e\n        Tweet may have been deleted\n    \u003c/a\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eLike the rest of the AI industry, Google is leaning more and more into agentic experiences — AI that can do things on your behalf. Automating information-gathering calls is just one of the ways it\u0026#39;s doing this. Google recently launched a Gemini tool that acts as a \u003ca href=\"https://mashable.com/article/google-adds-deep-research-gemini-browsing-the-web-on-your-behalf\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eresearch assistant\u003c/a\u003e that can gather data for you from the web, and it debuted another Search Labs experiment that waits on hold for you when calling customer service. \u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"mashablelightspeed\"\u003e\n        \u003cp\u003e\n            Mashable Light Speed\n        \u003c/p\u003e\n        \n        \n    \u003c/section\u003e\n\u003cp\u003eIts \u003ca href=\"https://mashable.com/article/google-announces-agentic-gemini-2-point-0-image-audio-support\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003enewest Gemini model\u003c/a\u003e is integrated with the \u003ca href=\"https://mashable.com/article/samsung-unpacked-galaxy-ai-agentic-features\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003elatest Samsung Galaxy\u003c/a\u003e and Pixel phones, with features for pulling together information, creating calendar events, and sending messages. \u003c/p\u003e\u003cp\u003eIf you\u0026#39;re enrolled in Search Labs, you can toggle on the experiment to test it. Note: By enrolling in Search Labs, you agree to share this data with Google to improve its AI models. Next, choose whether you\u0026#39;re looking for information about a nail salon or mechanic, and proceed to the next few steps about the services you\u0026#39;re looking for. Once you\u0026#39;ve added all the pertinent information, choose to receive a response via SMS or email, which takes up to 30 minutes. Easy peasy. \u003c/p\u003e\u003cblockquote\u003e\n    \u003ca href=\"https://twitter.com/dozenrose/status/1885006631752364249\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003e\n        Tweet may have been deleted\n    \u003c/a\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eFor the receiving end of the call, that\u0026#39;s another story. The person who picks up the phone will receive an automated announcement from Google AI saying that it\u0026#39;s calling on behalf of a user. If the person hasn\u0026#39;t hung up yet — because my first reaction would be that it\u0026#39;s obviously spam — the AI will proceed to ask about pricing and availability. The receiver can then give the bot a response in a conversational manner, which it\u0026#39;s capable of understanding, and send its response to you. \u003c/p\u003e\u003cp\u003eWhen we tried it out, we got a response from Google 21 minutes later informing us about prices and availability for a manicure at a local nail salon. The Google bot also said they tried other salons but \u0026#34;couldn\u0026#39;t reach\u0026#34; them. Maybe they were busy, or maybe they were bewildered by the automated request.\u003c/p\u003e\n\n                                        \n                    \u003c/article\u003e\n    \n    \n    \n            \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/defaults/fallback-thumbnail.fill.size_100x100.1.png\" alt=\"Mashable Image\" width=\"100\" height=\"100\" loading=\"lazy\"/\u003e\u003c/p\u003e\n                \u003c/div\u003e\n            \u003cp\u003eCecily is a tech reporter at Mashable who covers AI, Apple, and emerging tech trends. Before getting her master\u0026#39;s degree at Columbia Journalism School, she spent several years working with startups and social impact businesses for Unreasonable Group and B Lab. Before that, she co-founded a startup consulting business for emerging entrepreneurial hubs in South America, Europe, and Asia. You can find her on Twitter at \u003ca href=\"https://twitter.com/cecily_mauran\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e@cecily_mauran\u003c/a\u003e.\u003c/p\u003e\n        \u003c/div\u003e\n        \n        \n                    \u003c/section\u003e\u003cdiv x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"footer_nl_signup\" data-ga-label=\"Top Stories\"\u003e\n    \n\n    \u003cp\u003e\n        These newsletters may contain advertising, deals, or affiliate links. By clicking Subscribe, you confirm you are 16+ and agree to our \u003ca href=\"https://www.ziffdavis.com/terms-of-use\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003eTerms of Use\u003c/a\u003e and \u003ca href=\"https://www.ziffdavis.com/ztg-privacy-policy\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003ePrivacy Policy\u003c/a\u003e.\n    \u003c/p\u003e\n    \n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-30T21:11:28Z",
  "modifiedTime": "2025-01-30T21:11:28Z"
}
