{
  "id": "09f72bc9-e6e4-40c3-8eb9-60b0b18d0f81",
  "title": "Vay secures €34M to bring remote-controlled cars to the streets of Europe",
  "link": "https://thenextweb.com/news/vay-secures-34-million-eu-teledriving-remote-controlled-cars",
  "description": "German “teledriving” startup Vay has secured €34mn from the European Investment Bank (EIB).   In January, Vay launched a commercial remote-controlled car service in Las Vegas. Now it wants to roll out the technology on its home turf. In 2023, the company successfully conducted test drives without a safety driver on public roads in Hamburg. Vay says it has been working closely with authorities to launch a commercial service in the German city.  “This investment will play a crucial role in strengthening the confidence and trust that EU regulators, partners and consumers have in Vay, paving the way for the commercial…This story continues at The Next Web",
  "author": "Siôn Geschwindt",
  "published": "Thu, 17 Oct 2024 09:42:09 +0000",
  "source": "https://thenextweb.com/feed/",
  "categories": [
    "Insider",
    "Deep tech",
    "Startups and technology",
    "Electric vehicle",
    "Investors and funding"
  ],
  "byline": "Siôn Geschwindt",
  "length": 2696,
  "excerpt": "In January, Vay launched a commercial remote-controlled car service in Las Vegas. Now it wants to roll out the technology on home turf.",
  "siteName": "TNW | Deep-Tech",
  "favicon": "https://next.tnwcdn.com/assets/img/favicon/favicon-194x194.png",
  "text": "German “teledriving” startup Vay has secured €34mn from the European Investment Bank (EIB).   In January, Vay launched a commercial remote-controlled car service in Las Vegas. Now it wants to roll out the technology on its home turf. In 2023, the company successfully conducted test drives without a safety driver on public roads in Hamburg. Vay says it has been working closely with authorities to launch a commercial service in the German city.  “This investment will play a crucial role in strengthening the confidence and trust that EU regulators, partners and consumers have in Vay, paving the way for the commercial rollout of our services in European cities,” said Thomas von de Ohe, Vay’s CEO.   The The latest rumblings from the EU tech scene, a story from our wise ol' founder Boris, and some questionable AI art. It's free, every week, in your inbox. Sign up now!When users open the Vay app and request a ride, an electric vehicle comes to collect them. Just like an Uber — except there’s nobody in the car.  Instead, it’s piloted to the pick-up spot by a remote driver. The customer then takes the wheel for the journey to their destination. Once they depart, a teledriver takes control again. Teledrivers control the vehicles remotely from a purpose-built station equipped with a driver’s seat, steering wheel, pedals, and three monitors providing visibility in front of the car and to its side. Road traffic sounds, such as emergency vehicles and other warning signals, are transmitted via microphones to the teledriver’s headphones. This operator could technically be sitting on the other side of the world. However, most will be nearby at one of Vay’s teledriving centres.  For customers, teledriving is billed as a cheaper, more convenient alternative to traditional car-sharing. For operators, it could mean the difference between success or failure. “Remote driving can increase profitability in a sector known for fine margins,” explained Justin Spratt, chief business officer at Vay. The company claims its technology can double the amount of time vehicles are in use, boosting revenues.   Teledriving is billed as a midway point between conventional cars and autonomous vehicles, which are proving much more difficult to implement than operators had hoped for. “Given recent challenges in the autonomy industry, automotive-grade teledriving can offer an alternative path to safe ‘driverless’ transportation, as a human driver is always in control,” von de Ohe previously told TNW. In December 2023, Vay raised $95mn (€87mn) in a Series B round. The funding signals investor confidence in a technology that could offer a faster route to market than fully autonomous vehicles.",
  "image": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1\u0026fit=1280%2C640\u0026url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2024%2F06%2Fvay-founders-teledriving-autonpmous-vehicle.jpg\u0026signature=8290e53d9b6bf3f3f29197ec597bd57c",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-main-content\"\u003e\n                            \u003cp\u003e\u003cspan\u003eGerman “teledriving” \u003ca href=\"https://thenextweb.com/topic/startups\" target=\"_blank\" rel=\"noopener\"\u003estartup\u003c/a\u003e Vay has secured €34mn from the European Investment Bank (EIB).  \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIn January, Vay launched a \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/vay-teledriving-service-launches-vegas\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003ecommercial remote-controlled car service\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e in Las Vegas. Now it wants to roll out the technology on its home turf.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIn 2023, the company successfully conducted test drives without a safety driver on public roads in Hamburg. Vay says it has been working closely with authorities to launch a commercial service in the German city. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“This investment will play a crucial role in strengthening the confidence and trust that EU regulators, partners and consumers have in Vay, paving the way for the commercial rollout of our services in European cities,” said Thomas von de Ohe, Vay’s CEO.  \u003c/span\u003e\u003c/p\u003e\n\u003cdiv id=\"hs-embed-tnw\"\u003e\u003cp\u003e\u003cimg src=\"https://s3.eu-west-1.amazonaws.com/tnw.events/hardfork-2018/uploads/visuals/tnw-newsletter.png\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe \u003c/p\u003e\u003cp\u003eThe latest rumblings from the EU tech scene, a story from our wise ol\u0026#39; founder Boris, and some questionable AI art. It\u0026#39;s free, every week, in your inbox. Sign up now!\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eWhen users open the Vay app and request a ride, an \u003ca href=\"https://thenextweb.com/topic/ev\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan id=\"urn:enhancement-cde5e3e8-1942-4ba4-bc79-7faa9ba2e544\" itemid=\"https://data.thenextweb.com/tnw/entity/battery_electric_vehicle\"\u003eelectric vehicle\u003c/span\u003e\u003c/a\u003e comes to collect them. Just like an Uber — except there’s nobody in the car. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eInstead, it’s piloted to the pick-up spot by a remote driver. The customer then takes the wheel for the journey to their destination. Once they depart, a teledriver takes control again.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eTeledrivers control the vehicles remotely from a purpose-built station equipped with a driver’s seat, steering wheel, pedals, and three monitors providing visibility in front of the car and to its side.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eRoad traffic sounds, such as emergency vehicles and other warning signals, are transmitted via microphones to the teledriver’s headphones. This operator could technically be sitting on the other side of the world. However, most will be nearby at one of Vay’s teledriving centres. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eFor customers, teledriving is billed as a cheaper, more convenient alternative to traditional car-sharing. For operators, it could mean the difference between success or failure.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Remote driving can increase profitability in a sector known for fine margins,” explained Justin Spratt, chief business officer at Vay. The company claims its technology can double the amount of time vehicles are in use, boosting revenues.  \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eTeledriving is billed as a midway point between conventional cars and autonomous vehicles, \u003c/span\u003e\u003cspan\u003ewhich are proving much more \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/startup-wayve-1-billion-europes-largest-ai-funding-round-autonomous-vehicles\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003edifficult to implement\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e than operators had hoped for.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Given recent challenges in the autonomy industry, automotive-grade teledriving can offer an alternative path to safe ‘driverless’ transportation, as a human driver is always in control,” von de Ohe \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/vay-teledriving-service-launches-vegas\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003epreviously told\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e TNW.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIn December 2023, Vay raised $95mn (€87mn) in a Series B round. The funding signals investor confidence in a technology that could offer a faster route to market than fully autonomous vehicles.  \u003c/span\u003e\u003c/p\u003e\n                        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-17T09:42:09Z",
  "modifiedTime": "2024-10-17T09:42:11Z"
}
