{
  "id": "143824d6-e07f-4fd9-b4a6-a35dd6917459",
  "title": "Appeals court confirms that tracking-based online advertising is illegal in Europe",
  "link": "https://www.engadget.com/big-tech/appeals-court-confirms-that-tracking-based-online-advertising-is-illegal-in-europe-223714124.html?src=rss",
  "description": "The Belgian Court of Appeal ruled today that the Transparency and Consent Framework (TCF) currently used as the foundation for most online advertising is illegal in the EU. This decision upholds the findings of the Belgian Data Protection Authority from 2022 that the technology underpinning online ads violates several principles of the General Data Protection Regulations, an EU digital privacy law that took effect in 2018. Engadget's Daniel Cooper wrote a thorough explainer of the different systems that support the current online advertising ecosystem, which is valuable reading for anybody spending time online. The very simplified version is that advertisers participate in real-time bidding (RTB) to show their content online. Currently, those bids are based on information gathered from tracking individuals' activities online with cookies. The TCF was created by the Interactive Advertising Bureau as a way to standardize how websites ask users for permission to be tracked. The original 2022 decision determined that both the consent collected by the TCF and the data collected in the RTB process were illegal under the GDPR. \"Today's court's decision shows that the consent system used by Google, Amazon, X, Microsoft, deceives hundreds of millions of Europeans,\" said Dr Johnny Ryan, director of Enforce at the Irish Council for Civil Liberties, who has been leading the legal charge against the current approach to ad tech. \"The tech industry has sought to hide its vast data breach behind sham consent popups. Tech companies turned the GDPR into a daily nuisance rather than a shield for people.\" The reaction from IAB Europe, which filed the appeal, seems to mostly be relief that it hasn't been found responsible for the data collected by TCF. \"The Market Court has rejected the APD’s view that IAB Europe is a joint controller together with TCF participants for their own respective processing of personal data, for instance for the purpose of digital advertising,\" the organization's statement says. IAB Europe notes that it has already suggested changes to the TCF that better reflect the \"limited controllership\" and submitted them to the Belgian Data Protection Authority. The group faced fines and was ordered to rebuild its current ad-tech framework as a result of the original decision. We've also reached out to some of the major advertisers that use the RTB technology for comment on the ruling. While this does seem like a big win for privacy advocates and internet users in the EU, it's unclear exactly what the next steps will be for advertisers and for ad tech systems. Most likely, regulators will oversee changes the IAB Europe makes to the TCF, so consent pop-ups may not yet be a thing of the past.This article originally appeared on Engadget at https://www.engadget.com/big-tech/appeals-court-confirms-that-tracking-based-online-advertising-is-illegal-in-europe-223714124.html?src=rss",
  "author": "Anna Washenko",
  "published": "Wed, 14 May 2025 22:37:14 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Internet \u0026 Networking Technology",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Anna Washenko"
  ],
  "byline": "Anna Washenko",
  "length": 2729,
  "excerpt": "The Belgian Court of Appeal ruled today that the Transparency and Consent Framework (TCF) currently used as the foundation for most online advertising is...",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "The Belgian Court of Appeal ruled today that the Transparency and Consent Framework (TCF) currently used as the foundation for most online advertising is illegal in the EU. This decision upholds the findings of the Belgian Data Protection Authority from 2022 that the technology underpinning online ads violates several principles of the General Data Protection Regulations, an EU digital privacy law that took effect in 2018.Engadget's Daniel Cooper wrote a thorough explainer of the different systems that support the current online advertising ecosystem, which is valuable reading for anybody spending time online. The very simplified version is that advertisers participate in real-time bidding (RTB) to show their content online. Currently, those bids are based on information gathered from tracking individuals' activities online with cookies. The TCF was created by the Interactive Advertising Bureau as a way to standardize how websites ask users for permission to be tracked. The original 2022 decision determined that both the consent collected by the TCF and the data collected in the RTB process were illegal under the GDPR.\"Today's court's decision shows that the consent system used by Google, Amazon, X, Microsoft, deceives hundreds of millions of Europeans,\" said Dr Johnny Ryan, director of Enforce at the Irish Council for Civil Liberties, who has been leading the legal charge against the current approach to ad tech. \"The tech industry has sought to hide its vast data breach behind sham consent popups. Tech companies turned the GDPR into a daily nuisance rather than a shield for people.\"The reaction from IAB Europe, which filed the appeal, seems to mostly be relief that it hasn't been found responsible for the data collected by TCF. \"The Market Court has rejected the APD’s view that IAB Europe is a joint controller together with TCF participants for their own respective processing of personal data, for instance for the purpose of digital advertising,\" the organization's statement says. IAB Europe notes that it has already suggested changes to the TCF that better reflect the \"limited controllership\" and submitted them to the Belgian Data Protection Authority. The group faced fines and was ordered to rebuild its current ad-tech framework as a result of the original decision.We've also reached out to some of the major advertisers that use the RTB technology for comment on the ruling.While this does seem like a big win for privacy advocates and internet users in the EU, it's unclear exactly what the next steps will be for advertisers and for ad tech systems. Most likely, regulators will oversee changes the IAB Europe makes to the TCF, so consent pop-ups may not yet be a thing of the past.",
  "image": "https://s.yimg.com/ny/api/res/1.2/EQKNeFkVj2G3tOUdl2U2vQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDk7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-05/9380c420-3111-11f0-bfd3-10445345d578",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe Belgian Court of Appeal \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1\" href=\"https://www.dataprotectionauthority.be/citizen/the-market-court-rules-in-the-iab-europe-case\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:ruled today;elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1;itc:0;sec:content-canvas\"\u003eruled today\u003c/a\u003e that the Transparency and Consent Framework (TCF) currently used as the foundation for most online advertising is illegal in the EU. This decision upholds the findings of the Belgian Data Protection Authority \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1\" href=\"https://www.engadget.com/european-union-gdpr-ad-tech-unlawful-iccl-iab-europe-125735068.html\" data-ylk=\"slk:from 2022;elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1;itc:0;sec:content-canvas\"\u003efrom 2022\u003c/a\u003e that the technology underpinning online ads violates several principles of the \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1\" href=\"https://en.wikipedia.org/wiki/General_Data_Protection_Regulation\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:General Data Protection Regulations;elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1;itc:0;sec:content-canvas\"\u003eGeneral Data Protection Regulations\u003c/a\u003e, an EU digital privacy law that took effect in 2018.\u003c/p\u003e\u003cp\u003eEngadget\u0026#39;s Daniel Cooper wrote a thorough \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1\" href=\"https://www.engadget.com/europe-tracking-consent-iccl-iab-eu-gdpr-153055765.html\" data-ylk=\"slk:explainer;elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1;itc:0;sec:content-canvas\"\u003eexplainer\u003c/a\u003e of the different systems that support the current online advertising ecosystem, which is valuable reading for anybody spending time online. The very simplified version is that advertisers participate in real-time bidding (RTB) to show their content online. Currently, those bids are based on information gathered from tracking individuals\u0026#39; activities online with cookies. The TCF was created by the Interactive Advertising Bureau as a way to standardize how websites ask users for permission to be tracked. The original 2022 decision determined that both the consent collected by the TCF and the data collected in the RTB process were illegal under the GDPR.\u003c/p\u003e\u003cp\u003e\u0026#34;Today\u0026#39;s court\u0026#39;s decision shows that the consent system used by Google, Amazon, X, \u003ca href=\"https://www.yahoo.com/organizations/microsoft/\" data-ylk=\"slk:Microsoft;elm:context_link;itc:0;sec:content-canvas\"\u003eMicrosoft\u003c/a\u003e, deceives hundreds of millions of Europeans,\u0026#34; \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:5;pos:1\" href=\"https://www.iccl.ie/digital-data/eu-ruling-tracking-based-advertising-by-google-microsoft-amazon-x-across-europe-has-no-legal-basis/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:said;elm:context_link;elmt:doNotAffiliate;cpos:5;pos:1;itc:0;sec:content-canvas\"\u003esaid\u003c/a\u003e Dr Johnny Ryan, director of Enforce at the Irish Council for Civil Liberties, who has been leading the legal charge against the current approach to ad tech. \u0026#34;The tech industry has sought to hide its vast data breach behind sham consent popups. Tech companies turned the GDPR into a daily nuisance rather than a shield for people.\u0026#34;\u003c/p\u003e\u003cp\u003eThe \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:6;pos:1\" href=\"https://iabeurope.eu/belgian-market-court-confirms-limited-role-of-iab-europe-in-tcf/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:reaction;elm:context_link;elmt:doNotAffiliate;cpos:6;pos:1;itc:0;sec:content-canvas\"\u003ereaction\u003c/a\u003e from IAB Europe, which filed the appeal, seems to mostly be relief that it hasn\u0026#39;t been found responsible for the data collected by TCF. \u0026#34;The Market Court has rejected the APD’s view that IAB Europe is a joint controller together with TCF participants for their own respective processing of personal data, for instance for the purpose of digital advertising,\u0026#34; the organization\u0026#39;s statement says. IAB Europe notes that it has already suggested changes to the TCF that better reflect the \u0026#34;limited controllership\u0026#34; and submitted them to the Belgian Data Protection Authority. The group faced fines and was ordered to rebuild its current ad-tech framework as a result of the original decision.\u003c/p\u003e\u003cp\u003eWe\u0026#39;ve also reached out to some of the major advertisers that use the RTB technology for comment on the ruling.\u003c/p\u003e\u003cp\u003eWhile this does seem like a big win for privacy advocates and internet users in the EU, it\u0026#39;s unclear exactly what the next steps will be for advertisers and for ad tech systems. Most likely, regulators will oversee changes the IAB Europe makes to the TCF, so consent pop-ups may not yet be a thing of the past.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-14T22:37:14Z",
  "modifiedTime": null
}
