{
  "id": "1a90a4fa-8389-4a61-9910-59117758b725",
  "title": "‘Death Stranding 2: On the Beach’ Composer Had Free Rein to Make a Headbanging Soundtrack",
  "link": "https://gizmodo.com/death-stranding-2-on-the-beach-composer-had-free-rein-to-make-a-headbanging-soundtrack-2000623819",
  "description": "Longtime Kojima Productions composer Ludvig Forssell expanded on the sequel's sonic identity with Hideo Kojima's blessing to interpret its story.",
  "author": "Isaiah Colbert",
  "published": "Thu, 03 Jul 2025 21:45:04 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Games",
    "Death Stranding 2: On The Beach",
    "Hideo Kojima",
    "Ludvig Forssell",
    "PlayStation 5"
  ],
  "byline": "Isaiah Colbert",
  "length": 13322,
  "excerpt": "Longtime Kojima Productions composer Ludvig Forssell expanded on the sequel's sonic identity with Hideo Kojima's blessing to interpret its story.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Hideo Kojima‘s long-anticipated sequel Death Stranding 2: On the Beach is out now on PlayStation 5. While the game itself poses the question of whether the world should be connected, gamers on social media are coming to life with every neat gameplay secret and discovery they unearth in every nook and cranny of the game. Speaking of connections, io9 spoke with On the Beach composer Ludvig Forssell, whose credits include Metal Gear Solid V: The Phantom Pain as well as Mamoru Hosoda‘s 2022 animated film, Belle. Among other topics, we asked about how his musical philosophy evolved to make the sequel’s soundtrack live up to what’s being called an early candidate for game of the year. Isaiah Colbert, io9: If you had to describe Death Stranding 2’s score in three words, what would they be? Ludvig Forssell: I’m gonna go ahead and not use adjectives, but rather just words. Expansion, heart, and I would say, headbanging. io9: As a composer, you greatly influence players by subtly highlighting key moments and quiet periods in gameplay— delivering packages, avoiding ink ghosts, and linking Mexico and Australia by surfing on a coffin. With Death Stranding 2, which emotional themes were crucial for you to emphasize or expand on? Forssell: One of the most important parts for me with Death Stranding 2 was to give a connection to the emotional parts of the story that are a bit more expansive, again, compared to the first one. I really wanted to make sure that what we gave the player in terms of musicality on the second one was way more not on the sleeve, but a bit more easy to grasp in a way. A bit more straightforward. © Gizmodo/Kojima Productions io9: You’ve worked closely with Kojima Productions for years. How has your creative shorthand with Hideo Kojima evolved, especially when shaping the musicality of the emotional arc in its sequel? Forssell: I’ve worked with Mr. Kojima for over 10 years. That relationship has expanded bit by bit. I think, at this point, he is able to give me a lot of freedom to where I’m basically thrown in the deep end at the very get-go like, “Here’s the story. Figure it out yourself and give me something to run with in the game in terms of music.” I’ll be obviously in direct contact with him while delivering things like shooting him emails, [like], “Hey, this is the new cue for this part.” He’ll check it out on his phone or wherever he is. It’s very much letting me run with things and then we throw them into the game and see if they work or not. Then we might change things up. But generally—even now that I’m working as a freelancer on the game, and obviously not as hands-on with having a dev kid or anything in my house—I’m still given the freedom to use very little information to create something that I perceive and create out of my own mind without too much oversight. io9: Kojima’s storytelling often blurs the line between surreal and profoundly human, even if actors like Norman Reedus can’t entirely suss out where the story is going in the moment and have to trust that things will pan out. With this being your second go-around for a game like Death Stranding, would you say you’ve cracked what’s going on in its narrative in a way that informs the composing of its music? Forssell: With the first game, having been the audio director on that and having the process be a certain way when working in-house, with the second game I was fortunate enough to join in for some of the performance capture sessions—literally the times that Norman might have gotten the questions answered the way he did in what you just stated. Being there for those sessions and seeing Hideo work with the actors, explaining the scenes, and having the script obviously on hand is gives me a really good organic way to interact with the script and the story and and build my understanding of it over a longer period of time—having that be very closely connected to more parts of game production than just seeing in-game footage, reading a script, or seeing a description of a track that I’m supposed to write. To me, it’s always been quite, [well], not easy. Obviously, it’s a very complex story in both games. But I’ve been given many organic ways of interacting with the production that lead to a better understanding about what the game is, what the game is about, and what the story wants to say. io9: You mentioned earlier that you had a lot of creative freedom to shape the game’s musical direction as you saw fit. Through fellow On the Beach artist Woodkid, Kojima mentioned that he was concerned that playtests were too positive and that he had to make changes. Were there moments where he wanted to emphasize different cues when it came to musicality, when you guys were passing drafts back and forth as the tracks were coming along? Forssell: That’s a tough question. It’s such a granular process of doing things especially with the way game design works where everything comes together bit by bit. If something changes on the map, scripts have to change; everything is just intertwined so deeply, and that changes so incrementally that a lot of that comes into how the music is implemented, rather than going back to really reshaping the core ideas. I thought those were pretty much set in stone once we started out with the conceptual parts of the story being in place. The more granular changes that come along and afterwards are parts that we usually deal with by changing how music is played back and how we edit the music or mix the music in terms of having it feel and have the right impact for the player. Most of those changes that happened throughout game production are usually handled in tandem with the bigger team of sound designers, music editors, and music engineers, along with me being there, looking at, and giving ideas on how to tweak things. Sometimes, you’ll get a note from Mr. Kojima that’s like, “Oh, this part is not scary enough,” and the in-house team will be like, “OK, do we need to rewrite this music?” and I’ll have a listen to what’s playing back in the game and be like, “No, this is not scary enough because you can’t even hear the music. Just turn the music up 10 dBs and it’ll be scary.” It’s a lot of technicalities when it comes to working around and making things fit. I was fortunate enough to not have to rewrite and scrap a bunch of stuff, ’cause there’s a lot you can do by realizing what the final product is gonna be and and knowing what’s lacking in certain situations—that being sound design or other facets. You’re always striving towards a certain feeling, and getting that is a very, again, incremental and granular process. io9: Clair Obscur: Expedition 33 composer Lorien Testard once told me that while he has inspirations, he tries not to let them influence his compositions too directly. When you’re creating music for Death Stranding 2, do you take a similar approach? Or do you find yourself intentionally drawing from other composers, pop culture, your work in anime, or even personal experiences to shape On the Beach’s sonic atmosphere? Forssell: First off, shout-outs to Lorien. He did a great job on Expedition 33. I didn’t play it, but I’ve seen a full playthrough of the game, and the music is fantastic. And also, yeah, a good answer because I’m sort of similar. I do mostly consume music through media that I’m watching or playing, rather than actively listening to music in my daily life. That obviously inspires me in certain ways, but I don’t get specific things that I try to recreate. It’s rather the approach to certain things, like, “This game wanted to present music in a certain way for this part. That’s really cool. I might try to implement that sort of approach for some things that I do.” It’s more of getting inspiration in terms of how things are done rather than how things actually sound. © Gizmodo/Kojima Productions io9: When it comes to how things sound, were there new instruments or techniques that you experimented with to give DS2 a unique sonic texture for its score that surprised you by how well they turned out, or proved more difficult to bring to life from concept to track? Forssell: I don’t think I had anything that didn’t work out, per se. But we definitely wanted to expand upon what the first game’s soundtrack was and add more humanity and heart to some of that, which came about by using a small vocal ensemble that we recorded, a certain amount of cues with which we then resampled and used for all these sorts of weird vocal expressions and stuff like that, that was implemented to add to what the original game was. If there was anything that surprised me, you have the main antagonist of the game, Higgs, walking along carrying a guitar the entire game, so we knew that we wanted to implement guitars. Guitars were sort of a very much no-go thing for the first game soundtrack. I did not want to use guitars at all. So having guitars being added—I wouldn’t say forced upon me, but conceptually they were gonna be in the soundtrack this time around—[worked] out way better than I thought. That also leaned into more of the headbanging soundtrack, having a more fun side to some of the music rather than just being very action-informative. I feel like all those elements melded together really well for something that keeps the core of the first game soundtrack and adds more facets to it to make it less ambient and a bit more hands-on. Palpable. © Gizmodo/Kojima Productions io9: Death Stranding 2’s trailers have drawn many fans to compare Neil Vana to Metal Gear Solid’s Snake. While Kojima had to remind actor Luca Marinelli that he wasn’t playing Snake, the soundtrack does have a track called “Crab Battle.” Was this a cheeky musical Easter egg reference to Snake Eater on your part? If so, are there any other subtle musical flairs that paid homage to Hojima’s magnum opus? Forssell (laughs): Whatever could you be talking about? Yeah, no, I am aware of the meme, and it felt like we can’t just miss this opportunity. No spoilers, but the track is called “Crab Battle” for a reason. But yeah, that’s a meme, you’re welcome. I started out working with Mr. Kojima on Metal Gear Solid V, so I’ve been part of the process in creating music for those games, but in terms of musical legacy and all of that, the one I worked on might have been the one that leans the farthest away from what the other soundtracks were. The direction was very clearly going in a less melodic way for that soundtrack. Personally, it’s not stuck to the back of my head, creating original MGS music, so I don’t think it could subconsciously peek out somewhere. Obviously, there is sort of an homage track to some of that for the first game for the director’s cut, called “The Big Sneak,” but that’s supposed to be on the nose. But generally speaking, I was there when we recorded with Luca doing those scenes, and it didn’t feel like it would be obvious. The way people felt when they saw that scene didn’t seem like it was gonna turn out that way when we filmed it, but I can’t read every thought that Hideo has, and I don’t know what his actual plans were around that. But it’s good fun at the end of the day and people who play the game will get to get to know and learn about Neil’s character. He is very cool on his own, so [I] definitely hope that people get to see that for more than just the meme that it’s become with trailers and stuff. © Kojima Productions io9: During a Twitch stream with PatStaresAt, you noted how a motorcycle maneuver avoiding an early conflict with Higgs’ mechanical army means missing out on a cool thing you did with the game’s OST. With the reality that some people might finagle their way out of combat or stealth encounters, is there a particular theme or leitmotif from this sequel soundtrack that you hope lingers with players long after they hit credits? Forssell: That’s always hard because open world games are always gonna be impossible to force people to play them in certain ways and have them experience certain moments the way you want them to. Shit happens when you see something like that. [PatStaresAt] will see similar scenes that I’ve done music for in his playthrough going forward, so I’m not too bummed about it. There’s some of the boss battles that are not necessarily missable, but if you just run through them, you might not get to experience the full-blown impact of the music. One of the tracks that I’m proud of is called “Soaring Shadow,” which may not be a huge splash as a big moment in the game, but I’m definitely looking forward to people interacting with that part of the game. Other than that, again, no spoilers, but the endgame is very heavy on a lot of the fun stuff we got to do with the soundtrack this time around. With games being the way they are, you always see a big decrease of players when getting into the end game. Not a lot of games have more than 70% of the players actually finishing the game, so I definitely hope to see a lot of people get to enjoy that part of the game for its music. Death Stranding 2: On the Beach is available now on PlayStation 5. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/07/Ludvig-Forssell-Death-Stranding-2-On-The-Beach-InterviewWORDPRESS-1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003e\u003ca href=\"https://gizmodo.com/hideo-kojima-company-future-death-stranding-2000504716\"\u003eHideo Kojima\u003c/a\u003e‘s long-anticipated sequel \u003ca href=\"https://gizmodo.com/death-stranding-2-review-kojima-playstation-ps5-2000618120\"\u003e\u003cem\u003eDeath Stranding 2: On the Beach\u003c/em\u003e\u003c/a\u003e is out now on PlayStation 5. While the game itself poses the question of whether the world should be connected, gamers on social media are coming to life with every neat gameplay secret and discovery they unearth in every nook and cranny of the game.\u003c/p\u003e \u003cp\u003eSpeaking of connections, io9 spoke with \u003cem\u003eOn the Beach\u003c/em\u003e composer Ludvig Forssell, whose credits include \u003cem\u003e\u003ca href=\"https://kotaku.com/metal-gear-solid-v-the-phantom-pain-the-kotaku-review-1728728287\"\u003eMetal Gear Solid V: The Phantom Pain\u003c/a\u003e\u003c/em\u003e as well as \u003ca href=\"https://gizmodo.com/behold-mamoru-hosodas-new-anime-film-belle-which-looks-1846601964?utm_content=\u0026amp;utm_campaign=io9\u0026amp;utm_medium=SocialMarketing\u0026amp;utm_source=facebook\"\u003eMamoru Hosoda\u003c/a\u003e‘s 2022 animated film,\u003cem\u003e \u003ca href=\"https://gizmodo.com/check-out-the-gorgeous-first-3-minutes-of-mamoru-hosoda-1848340115\"\u003eBelle\u003c/a\u003e\u003c/em\u003e. Among other topics, we asked about how his musical philosophy evolved to make the sequel’s soundtrack live up to what’s being called an early candidate for game of the year.\u003c/p\u003e \u003cp\u003e\u003ciframe loading=\"lazy\" title=\"Should We Have Connected? | Death Stranding 2: On The Beach (Original Video Game Score)\" width=\"500\" height=\"375\" src=\"about:blank\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\" data-rocket-lazyload=\"fitvidscompatible\" data-lazy-src=\"https://www.youtube.com/embed/9x1lD3sFkyQ?list=PLRW80bBvVD3XT9mRxiZOrBAyVccgZchrF\"\u003e\u003c/iframe\u003e\u003c/p\u003e \u003chr/\u003e \u003cp\u003e\u003cstrong\u003eIsaiah Colbert, io9: If you had to describe \u003cem\u003eDeath Stranding 2\u003c/em\u003e’s score in three words, what would they be?\u003c/strong\u003e\u003c/p\u003e\n\n \u003cp\u003e\u003cstrong\u003eLudvig Forssell: \u003c/strong\u003eI’m gonna go ahead and not use adjectives, but rather just words. Expansion, heart, and I would say, headbanging.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eio9: As a composer, you greatly influence players by subtly highlighting key moments and quiet periods in gameplay— delivering packages, avoiding ink ghosts, and linking Mexico and Australia by surfing on a coffin. With \u003cem\u003eDeath Stranding 2\u003c/em\u003e, which emotional themes were crucial for you to emphasize or expand on?\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eForssell: \u003c/strong\u003eOne of the most important parts for me with \u003cem\u003eDeath Stranding 2\u003c/em\u003e was to give a connection to the emotional parts of the story that are a bit more expansive, again, compared to the first one. I really wanted to make sure that what we gave the player in terms of musicality on the second one was way more not on the sleeve, but a bit more easy to grasp in a way. A bit more straightforward.\u003c/p\u003e\n\n \u003cfigure id=\"attachment_2000623976\" aria-describedby=\"caption-attachment-2000623976\"\u003e\u003cimg decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Norman-Reedus-Sam-Bridges-Kojima-Producitons.jpg\" alt=\"Death Stranding 2 On The Beach Norman Reedus Sam Bridges Kojima Producitons\" width=\"1920\" height=\"1080\" srcset=\"https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Norman-Reedus-Sam-Bridges-Kojima-Producitons.jpg 1920w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Norman-Reedus-Sam-Bridges-Kojima-Producitons-336x189.jpg 336w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Norman-Reedus-Sam-Bridges-Kojima-Producitons-1280x720.jpg 1280w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Norman-Reedus-Sam-Bridges-Kojima-Producitons-768x432.jpg 768w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Norman-Reedus-Sam-Bridges-Kojima-Producitons-672x378.jpg 672w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Norman-Reedus-Sam-Bridges-Kojima-Producitons-960x540.jpg 960w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Norman-Reedus-Sam-Bridges-Kojima-Producitons-1600x900.jpg 1600w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Norman-Reedus-Sam-Bridges-Kojima-Producitons-1200x675.jpg 1200w\" sizes=\"(max-width: 639px) 100vw, (max-width: 1023px) calc(100vw - 2rem), (max-width: 1258px) calc((100vw - 3.68rem) * 2 / 3), 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-2000623976\"\u003e© Gizmodo/Kojima Productions\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003e\u003cstrong\u003eio9: You’ve worked closely with Kojima Productions for years. How has your creative shorthand with Hideo Kojima evolved, especially when shaping the musicality of the emotional arc in its sequel?\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eForssell: \u003c/strong\u003eI’ve worked with Mr. Kojima for over 10 years. That relationship has expanded bit by bit. I think, at this point, he is able to give me a lot of freedom to where I’m basically thrown in the deep end at the very get-go like, “Here’s the story. Figure it out yourself and give me something to run with in the game in terms of music.” I’ll be obviously in direct contact with him while delivering things like shooting him emails, [like], “Hey, this is the new cue for this part.” He’ll check it out on his phone or wherever he is.\u003c/p\u003e\n\n \u003cp\u003eIt’s very much letting me run with things and then we throw them into the game and see if they work or not. Then we might change things up. But generally—even now that I’m working as a freelancer on the game, and obviously not as hands-on with having a dev kid or anything in my house—I’m still given the freedom to use very little information to create something that I perceive and create out of my own mind without too much oversight.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eio9: Kojima’s storytelling often blurs the line between surreal and profoundly human, even if actors like Norman Reedus can’t entirely suss out where the story is going in the moment and have to trust that things will pan out. With this being your second go-around for a game like \u003cem\u003eDeath Stranding\u003c/em\u003e, would you say you’ve cracked what’s going on in its narrative in a way that informs the composing of its music?\u003c/strong\u003e\u003c/p\u003e\n\n \u003cp\u003e\u003cstrong\u003e Forssell: \u003c/strong\u003eWith the first game, having been the audio director on that and having the process be a certain way when working in-house, with the second game I was fortunate enough to join in for some of the performance capture sessions—literally the times that Norman might have gotten the questions answered the way he did in what you just stated. Being there for those sessions and seeing Hideo work with the actors, explaining the scenes, and having the script obviously on hand is gives me a really good organic way to interact with the script and the story and and build my understanding of it over a longer period of time—having that be very closely connected to more parts of game production than just seeing in-game footage, reading a script, or seeing a description of a track that I’m supposed to write.\u003c/p\u003e \u003cp\u003eTo me, it’s always been quite, [well], not easy. Obviously, it’s a very complex story in both games. But I’ve been given many organic ways of interacting with the production that lead to a better understanding about what the game is, what the game is about, and what the story wants to say.\u003c/p\u003e\n\n \u003cp\u003e\u003ciframe loading=\"lazy\" title=\"Norman Reedus on Hideo Kojima directing him in Death Stranding, and his love for Daryl Dixon | BAFTA\" width=\"500\" height=\"281\" src=\"about:blank\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\" data-rocket-lazyload=\"fitvidscompatible\" data-lazy-src=\"https://www.youtube.com/embed/00m6c8GwpCM?start=880\u0026amp;feature=oembed\"\u003e\u003c/iframe\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eio9: You mentioned earlier that you had a lot of creative freedom to shape the game’s musical direction as you saw fit. Through fellow \u003cem\u003eOn the Beach\u003c/em\u003e artist Woodkid, Kojima mentioned that he was concerned that playtests were too positive and that he had to make changes. Were there moments where he wanted to emphasize different cues when it came to musicality, when you guys were passing drafts back and forth as the tracks were coming along? \u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eForssell: \u003c/strong\u003eThat’s a tough question. It’s such a granular process of doing things especially with the way game design works where everything comes together bit by bit. If something changes on the map, scripts have to change; everything is just intertwined so deeply, and that changes so incrementally that a lot of that comes into how the music is implemented, rather than going back to really reshaping the core ideas. I thought those were pretty much set in stone once we started out with the conceptual parts of the story being in place. The more granular changes that come along and afterwards are parts that we usually deal with by changing how music is played back and how we edit the music or mix the music in terms of having it feel and have the right impact for the player.\u003c/p\u003e \u003cp\u003eMost of those changes that happened throughout game production are usually handled in tandem with the bigger team of sound designers, music editors, and music engineers, along with me being there, looking at, and giving ideas on how to tweak things. Sometimes, you’ll get a note from Mr. Kojima that’s like, “Oh, this part is not scary enough,” and the in-house team will be like, “OK, do we need to rewrite this music?” and I’ll have a listen to what’s playing back in the game and be like, “No, this is not scary enough because you can’t even hear the music. Just turn the music up 10 dBs and it’ll be scary.”\u003c/p\u003e\n\n \u003cp\u003eIt’s a lot of technicalities when it comes to working around and making things fit. I was fortunate enough to not have to rewrite and scrap a bunch of stuff, ’cause there’s a lot you can do by realizing what the final product is gonna be and and knowing what’s lacking in certain situations—that being sound design or other facets. You’re always striving towards a certain feeling, and getting that is a very, again, incremental and granular process.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eio9: \u003cem\u003eClair Obscur: Expedition 33\u003c/em\u003e composer Lorien Testard once told me that while he has inspirations, he tries not to let them influence his compositions too directly. When you’re creating music for \u003cem\u003eDeath Stranding 2\u003c/em\u003e, do you take a similar approach? Or do you find yourself intentionally drawing from other composers, pop culture, your work in anime, or even personal experiences to shape \u003cem\u003eOn the Beach\u003c/em\u003e’s sonic atmosphere?\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eForssell: \u003c/strong\u003eFirst off, shout-outs to Lorien. He did a great job on \u003ca href=\"https://www.polygon.com/review/563522/clair-obscur-expedition-33-review-ps5-pc-xbox#comments\"\u003e\u003cem\u003eExpedition 33\u003c/em\u003e\u003c/a\u003e. I didn’t play it, but I’ve seen a full playthrough of the game, and \u003ca href=\"https://aftermath.site/clair-obscur-soundtrack-interview\"\u003ethe music is fantastic\u003c/a\u003e. And also, yeah, a good answer because I’m sort of similar. I do mostly consume music through media that I’m watching or playing, rather than actively listening to music in my daily life. That obviously inspires me in certain ways, but I don’t get specific things that I try to recreate. It’s rather the approach to certain things, like, “This game wanted to present music in a certain way for this part. That’s really cool. I might try to implement that sort of approach for some things that I do.” It’s more of getting inspiration in terms of how things are done rather than how things actually sound.\u003c/p\u003e \u003cfigure id=\"attachment_2000623974\" aria-describedby=\"caption-attachment-2000623974\"\u003e\u003cimg decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Higgs-Troy-Baker-Kojima-Productions.jpg\" alt=\"Death Stranding 2 On The Beach Higgs Troy Baker Kojima Productions\" width=\"1920\" height=\"1080\" srcset=\"https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Higgs-Troy-Baker-Kojima-Productions.jpg 1920w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Higgs-Troy-Baker-Kojima-Productions-336x189.jpg 336w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Higgs-Troy-Baker-Kojima-Productions-1280x720.jpg 1280w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Higgs-Troy-Baker-Kojima-Productions-768x432.jpg 768w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Higgs-Troy-Baker-Kojima-Productions-672x378.jpg 672w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Higgs-Troy-Baker-Kojima-Productions-960x540.jpg 960w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Higgs-Troy-Baker-Kojima-Productions-1600x900.jpg 1600w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Higgs-Troy-Baker-Kojima-Productions-1200x675.jpg 1200w\" sizes=\"(max-width: 639px) 100vw, (max-width: 1023px) calc(100vw - 2rem), (max-width: 1258px) calc((100vw - 3.68rem) * 2 / 3), 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-2000623974\"\u003e© Gizmodo/Kojima Productions\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003e\u003cstrong\u003eio9: When it comes to how things sound, were there new instruments or techniques that you experimented with to give \u003cem\u003eDS2\u003c/em\u003e a unique sonic texture for its score that surprised you by how well they turned out, or proved more difficult to bring to life from concept to track?\u003c/strong\u003e\u003c/p\u003e\n\n \u003cp\u003e\u003cstrong\u003eForssell: \u003c/strong\u003eI don’t think I had anything that didn’t work out, per se. But we definitely wanted to expand upon what the first game’s soundtrack was and add more humanity and heart to some of that, which came about by using a small vocal ensemble that we recorded, a certain amount of cues with which we then resampled and used for all these sorts of weird vocal expressions and stuff like that, that was implemented to add to what the original game was. If there was anything that surprised me, you have the main antagonist of the game, Higgs, walking along carrying a guitar the entire game, so we knew that we wanted to implement guitars.\u003c/p\u003e \u003cp\u003eGuitars were sort of a very much no-go thing for the first game soundtrack. I did not want to use guitars at all. So having guitars being added—I wouldn’t say forced upon me, but conceptually they were gonna be in the soundtrack this time around—[worked] out way better than I thought. That also leaned into more of the headbanging soundtrack, having a more fun side to some of the music rather than just being very action-informative. I feel like all those elements melded together really well for something that keeps the core of the first game soundtrack and adds more facets to it to make it less ambient and a bit more hands-on. Palpable.\u003cstrong\u003e\u003cbr/\u003e \u003c/strong\u003e\u003c/p\u003e\n\n \u003cfigure id=\"attachment_2000623975\" aria-describedby=\"caption-attachment-2000623975\"\u003e\u003cimg decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Luca-Marinelli-Neil-Vana-Hideo-Kojima.jpg\" alt=\"Death Stranding 2 On The Beach Luca Marinelli Neil Vana Hideo Kojima\" width=\"1920\" height=\"1080\" srcset=\"https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Luca-Marinelli-Neil-Vana-Hideo-Kojima.jpg 1920w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Luca-Marinelli-Neil-Vana-Hideo-Kojima-336x189.jpg 336w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Luca-Marinelli-Neil-Vana-Hideo-Kojima-1280x720.jpg 1280w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Luca-Marinelli-Neil-Vana-Hideo-Kojima-768x432.jpg 768w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Luca-Marinelli-Neil-Vana-Hideo-Kojima-672x378.jpg 672w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Luca-Marinelli-Neil-Vana-Hideo-Kojima-960x540.jpg 960w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Luca-Marinelli-Neil-Vana-Hideo-Kojima-1600x900.jpg 1600w, https://gizmodo.com/app/uploads/2025/07/DEATH-STRANDING-2_-ON-THE-BEACH-Luca-Marinelli-Neil-Vana-Hideo-Kojima-1200x675.jpg 1200w\" sizes=\"(max-width: 639px) 100vw, (max-width: 1023px) calc(100vw - 2rem), (max-width: 1258px) calc((100vw - 3.68rem) * 2 / 3), 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-2000623975\"\u003e© Gizmodo/Kojima Productions\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003e\u003cstrong\u003eio9: \u003cem\u003eDeath Stranding 2\u003c/em\u003e’s trailers have drawn many fans to compare Neil Vana to \u003cem\u003eMetal Gear Solid\u003c/em\u003e’s Snake. While Kojima had to remind actor Luca Marinelli that he wasn’t playing Snake, the soundtrack does have a track called “Crab Battle.” Was this a cheeky musical Easter egg reference to \u003cem\u003eSnake Eater\u003c/em\u003e on your part? If so, are there any other subtle musical flairs that paid homage to Hojima’s magnum opus?\u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eForssell (laughs): \u003c/strong\u003eWhatever could you be talking about? Yeah, no, I am \u003ca href=\"https://knowyourmeme.com/memes/crab-battle\"\u003eaware of the meme\u003c/a\u003e, and it felt like we can’t just miss this opportunity. No spoilers, but the track is called “\u003ca href=\"https://www.youtube.com/watch?v=A2KaV-abw8E\u0026amp;pp=ygUdY3JhYiBiYXR0bGUgZGVhdGggc3RyYW5kaW5nIDI%3D\"\u003eCrab Battle\u003c/a\u003e” for a reason. But yeah, that’s a meme, you’re welcome.\u003c/p\u003e\n\n \u003cp\u003eI started out working with Mr. Kojima on \u003cem\u003eMetal Gear Solid V\u003c/em\u003e, so I’ve been part of the process in creating music for those games, but in terms of musical legacy and all of that, the one I worked on might have been the one that leans the farthest away from what the other soundtracks were. The direction was very clearly going in a less melodic way for that soundtrack. Personally, it’s not stuck to the back of my head,\u003cspan\u003e creating original \u003cem\u003eMGS\u003c/em\u003e music, so I don’t think it could subconsciously peek out somewhere.\u003c/span\u003e\u003c/p\u003e \u003cp\u003eObviously, there is sort of an homage track to some of that for the first game for the director’s cut, called “\u003ca href=\"https://www.youtube.com/watch?v=raWgqdiN8mg\u0026amp;pp=ygUeVGhlIEJpZyBTbmVhayAgZGVhdGggc3RyYW5kaW5n0gcJCcEJAYcqIYzv\"\u003eThe Big Sneak\u003c/a\u003e,” but that’s supposed to be on the nose. But generally speaking, I was there when \u003ca href=\"https://www.gamesradar.com/games/action/even-death-stranding-2s-solid-snake-doppelganger-thought-he-was-playing-a-metal-gear-solid-character-but-hideo-kojima-had-to-tell-him-youre-not-snake/\"\u003ewe recorded with Luca doing those scenes\u003c/a\u003e, and it didn’t feel like it would be obvious. The way people felt when they saw that scene didn’t seem like it was gonna turn out that way when we filmed it, but I can’t read every thought that Hideo has, and I don’t know what his actual plans were around that.\u003c/p\u003e \u003cp\u003eBut it’s good fun at the end of the day and people who play the game will get to get to know and learn about Neil’s character. He is very cool on his own, so [I] definitely hope that people get to see that for more than just the meme that it’s become with trailers and stuff.\u003c/p\u003e \u003cfigure id=\"attachment_2000623992\" aria-describedby=\"caption-attachment-2000623992\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2025/07/Death-Stranding-2-Kojima-Producitons.jpg\" alt=\"Death Stranding 2 Kojima Producitons\" width=\"1920\" height=\"1080\" srcset=\"https://gizmodo.com/app/uploads/2025/07/Death-Stranding-2-Kojima-Producitons.jpg 1920w, https://gizmodo.com/app/uploads/2025/07/Death-Stranding-2-Kojima-Producitons-336x189.jpg 336w, https://gizmodo.com/app/uploads/2025/07/Death-Stranding-2-Kojima-Producitons-1280x720.jpg 1280w, https://gizmodo.com/app/uploads/2025/07/Death-Stranding-2-Kojima-Producitons-768x432.jpg 768w, https://gizmodo.com/app/uploads/2025/07/Death-Stranding-2-Kojima-Producitons-672x378.jpg 672w, https://gizmodo.com/app/uploads/2025/07/Death-Stranding-2-Kojima-Producitons-960x540.jpg 960w, https://gizmodo.com/app/uploads/2025/07/Death-Stranding-2-Kojima-Producitons-1600x900.jpg 1600w, https://gizmodo.com/app/uploads/2025/07/Death-Stranding-2-Kojima-Producitons-1200x675.jpg 1200w\" sizes=\"(max-width: 639px) 100vw, (max-width: 1023px) calc(100vw - 2rem), (max-width: 1258px) calc((100vw - 3.68rem) * 2 / 3), 800px\"/\u003e\u003cfigcaption id=\"caption-attachment-2000623992\"\u003e© Kojima Productions\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003e\u003cstrong\u003eio9: During a Twitch stream with PatStaresAt, you noted how a motorcycle maneuver avoiding an early conflict with Higgs’ mechanical army means missing out on a cool thing you did with the game’s OST. With the reality that some people might finagle their way out of combat or stealth encounters, is there a particular theme or leitmotif from this sequel soundtrack that you hope lingers with players long after they hit credits?\u003c/strong\u003e\u003c/p\u003e\n\n \u003cp\u003e\u003cstrong\u003eForssell: \u003c/strong\u003eThat’s always hard because open world games are always gonna be impossible to force people to play them in certain ways and have them experience certain moments the way you want them to. Shit happens when you see something like that. [PatStaresAt] will see similar scenes that I’ve done music for in his playthrough going forward, so I’m not too bummed about it.\u003c/p\u003e \u003cp\u003eThere’s some of the boss battles that are not necessarily missable, but if you just run through them, you might not get to experience the full-blown impact of the music. One of the tracks that I’m proud of is called “\u003ca href=\"https://www.youtube.com/watch?v=N7Y_zE0z-Ac\u0026amp;pp=ygUgZGVhdGggc3RyYW5kaW5nIDIgc29hcmluZyBzaGFkb3c%3D\"\u003eSoaring Shadow\u003c/a\u003e,” which may not be a huge splash as a big moment in the game, but I’m definitely looking forward to people interacting with that part of the game.\u003c/p\u003e \u003cp\u003eOther than that, again, no spoilers, but the endgame is very heavy on a lot of the fun stuff we got to do with the soundtrack this time around. With games being the way they are, you always see a big decrease of players when getting into the end game. Not a lot of games have more than 70% of the players actually finishing the game, so I definitely hope to see a lot of people get to enjoy that part of the game for its music.\u003cstrong\u003e\u003cbr/\u003e \u003c/strong\u003e\u003c/p\u003e \u003cp\u003e\u003cem\u003eDeath Stranding 2: On the Beach\u003c/em\u003e is available now on PlayStation 5.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-07-03T21:45:04Z",
  "modifiedTime": "2025-07-03T21:45:04Z"
}
