{
  "id": "1b0dae7c-4ddc-46ce-b042-4cd23d36c6d3",
  "title": "As hospitals struggle with IV fluid shortage, NC plant restarts production",
  "link": "https://arstechnica.com/health/2024/11/as-hospitals-struggle-with-iv-fluid-shortage-nc-plant-restarts-production/",
  "description": "The initial batches will be shipped in late November at the earliest.",
  "author": "Beth Mole",
  "published": "Fri, 01 Nov 2024 21:42:48 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Health",
    "Science",
    "baxter",
    "drugs",
    "Fluid",
    "hospitals",
    "hurricane helene",
    "iV",
    "North Carolina",
    "shortage"
  ],
  "byline": "Beth Mole",
  "length": 2009,
  "excerpt": "The initial batches will be shipped in late November at the earliest.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "The western North Carolina plant that makes 60 percent of the country's intravenous fluid supply has restarted its highest-producing manufacturing line after being ravaged by flooding brought by Hurricane Helene last month. While it's an encouraging sign of recovery as hospitals nationwide struggle with shortages of fluids, supply is still likely to remain tight for the coming weeks. IV fluid maker Baxter Inc, which runs the Marion plant inundated by Helene, said Thursday that the restarted production line could produce, at peak, 25 percent of the plant's total production and about 50 percent of the plant's production of one-liter IV solutions, the product most commonly used by hospitals and clinics. “Recovery progress at our North Cove site continues to be very encouraging,\" Baxter CEO and President José Almeida said. \"In a matter of weeks, our team has advanced from the depths of Hurricane Helene’s impact to restarting our highest-throughput manufacturing line. This is a pivotal milestone, but more hard work remains as we work to return the plant to full production.\" Overall, Baxter said it is ahead of its previously projected timeline for getting the massive plant back up and running. Previously, the company said it had aimed to produce 90–100 percent of some products by the end of the year. Still, the initial batches now under production are expected to start shipping in late November at the earliest. One of the many challenges to restoring the facility was the lack of access to the site; Helene had damaged an access bridge. In its latest announcement, Baxter said that a temporary bridge—built with support from North Carolina's Department of Transportation and the federal Administration of Strategic Preparedness and Response (ASPR)—has allowed the transport of more than 885 truckloads of existing inventory out of the plant since Helene.  A second temporary bridge, expected to be completed in early November, will enable further access of traffic and equipment to the site.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/11/GettyImages-1241447543-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                      \n                      \n          \u003cp\u003eThe western North Carolina plant that makes \u003ca href=\"https://arstechnica.com/health/2024/10/helene-ravaged-the-nc-plant-that-makes-60-of-the-countrys-iv-fluid-supply/#gsc.tab=0\"\u003e60 percent of the country\u0026#39;s intravenous fluid supply\u003c/a\u003e has restarted its highest-producing manufacturing line after being ravaged by flooding brought by Hurricane Helene last month.\u003c/p\u003e\n\u003cp\u003eWhile it\u0026#39;s an encouraging sign of recovery as hospitals nationwide struggle with shortages of fluids, supply is still likely to remain tight for the coming weeks.\u003c/p\u003e\n\u003cp\u003eIV fluid maker Baxter Inc, which runs the Marion plant inundated by Helene, \u003ca href=\"https://www.baxter.com/baxter-newsroom/hurricane-helene-updates\"\u003esaid Thursday\u003c/a\u003e that the restarted production line could produce, at peak, 25 percent of the plant\u0026#39;s total production and about 50 percent of the plant\u0026#39;s production of one-liter IV solutions, the product most commonly used by hospitals and clinics.\u003c/p\u003e\n\u003cp\u003e“Recovery progress at our North Cove site continues to be very encouraging,\u0026#34; Baxter CEO and President José Almeida said. \u0026#34;In a matter of weeks, our team has advanced from the depths of Hurricane Helene’s impact to restarting our highest-throughput manufacturing line. This is a pivotal milestone, but more hard work remains as we work to return the plant to full production.\u0026#34;\u003c/p\u003e\n\u003cp\u003eOverall, Baxter said it is ahead of its previously projected timeline for getting the massive plant back up and running. Previously, the company said it had aimed to produce 90–100 percent of some products by the end of the year. Still, the initial batches now under production are expected to start shipping in late November at the earliest.\u003c/p\u003e\n\u003cp\u003eOne of the many challenges to restoring the facility was the lack of access to the site; Helene had damaged an access bridge. In its latest announcement, Baxter said that a temporary bridge—built with support from North Carolina\u0026#39;s Department of Transportation and the federal Administration of Strategic Preparedness and Response (ASPR)—has allowed the transport of more than 885 truckloads of existing inventory out of the plant since Helene.  A second temporary bridge, expected to be completed in early November, will enable further access of traffic and equipment to the site.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-01T21:42:48Z",
  "modifiedTime": "2024-11-01T21:42:48Z"
}
