{
  "id": "20aea002-e3f2-4a0a-8d45-fcb58908f7a6",
  "title": "After critics decry Orion heat shield decision, NASA reviewer says agency is correct",
  "link": "https://arstechnica.com/space/2024/12/former-flight-director-who-reviewed-orion-heat-shield-data-says-there-was-no-dissent/",
  "description": "\"If this isn’t raising red flags out there, I don’t know what will.\"",
  "author": "Eric Berger",
  "published": "Fri, 06 Dec 2024 22:29:32 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Science",
    "Space",
    "heat shield",
    "orion",
    "space"
  ],
  "byline": "Eric Berger",
  "length": 9451,
  "excerpt": "“If this isn’t raising red flags out there, I don’t know what will.”…",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "\"If this isn’t raising red flags out there, I don’t know what will.\" NASA's Orion spacecraft, consisting of a US-built crew module and European service module, is lifted during prelaunch processing at Kennedy Space Center in 2021. Credit: NASA/Amanda Stevenson Within hours of NASA announcing its decision to fly the Artemis II mission aboard an Orion spacecraft with an unmodified heat shield, critics assailed the space agency, saying it had made the wrong decision. \"Expediency won over safety and good materials science and engineering. Sad day for NASA,\" Ed Pope, an expert in advanced materials and heat shields, wrote on LinkedIn. There is a lot riding on NASA's decision, as the Artemis II mission involves four astronauts and the space agency's first crewed mission into deep space in more than 50 years. A former NASA astronaut, Charles Camarda, also expressed his frustrations on LinkedIn, saying the space agency and its leadership team should be \"ashamed.\" In an interview on Friday, Camarda, an aerospace engineer who spent two decades working on thermal protection for the space shuttle and hypersonic vehicles, said NASA is relying on flawed probabilistic risk assessments and Monte Carlo simulations to determine the safety of Orion's existing heat shield. \"I worked at NASA for 45 years,\" Camarda said. \"I love NASA. I do not love the way NASA has become. I do not like that we have lost our research culture.\" NASA makes a decision Pope, Camarada, and others—an official expected to help set space policy for the Trump administration told Ars on background, \"It's difficult to trust any of their findings\"—note that NASA has spent two years assessing the char damage incurred by the Orion spacecraft during its first lunar flight in late 2022, with almost no transparency. Initially, agency officials downplayed the severity of the issue, and the full scope of the problem was not revealed until a report this May by NASA's inspector general, which included photos of a heavily pock-marked heat shield. This year, from April to August, NASA convened an independent review team (IRT) to assess its internal findings about the root cause of the charring on the Orion heat shield and determine whether its plan to proceed without modifications to the heat shield was the correct one. However, though this review team wrapped up its work in August and began briefing NASA officials in September, the space agency kept mostly silent about the problem until a news conference on Thursday. The inspector general's report on May 1 included new images of Orion's heat shield. Credit: NASA Inspector General The inspector general's report on May 1 included new images of Orion's heat shield. Credit: NASA Inspector General \"Based on the data, we have decided—NASA unanimously and our decision-makers—to move forward with the current Artemis II Orion capsule and heat shield, with a modified entry trajectory,\" Bill Nelson, NASA's administrator, said Thursday. The heat shield investigation and other issues with the Orion spacecraft will now delay the Artemis II launch until April 2026, a slip of seven months from the previous launch date in September 2025. Notably the chair of the IRT, a former NASA flight director named Paul Hill, was not present at Thursday's news conference. Nor did the space agency release the IRT's report on its recommendations to NASA. In an interview, Camarda said he knew two people on the IRT who dissented from its conclusions that NASA's plan to fly the Orion heat shield, without modifications to address the charring problem, was acceptable. He also criticized the agency for not publicly releasing the independent report. \"NASA did not post the results of the IRT,\" he said. \"Why wouldn’t they post the results of what the IRT said? If this isn’t raising red flags out there, I don’t know what will.\" The view from the IRT Ars took these concerns to NASA on Friday, and the agency responded by offering an interview with Paul Hill, the review team's chair. He strongly denied there were any dissenting views. \"Every one of our conclusions, every one of our recommendations, was unanimously agreed to by our team,\" Hill said. \"We went through a lot of effort, arguing sentence by sentence, to make sure the entire team agreed. To get there we definitely had some robust and energetic discussions.\" Hill did acknowledge that, at the outset of the review team's discussions, two people were opposed to NASA's plan to fly the heat shield as is. \"There was, early on, definitely a difference of opinion with a couple of people who felt strongly that Orion's heat shield was not good enough to fly as built,\" he said. However, Hill said the IRT was won over by the depth of NASA's testing and the openness of agency engineers who worked with them. He singled out Luis Saucedo, a NASA engineer at NASA's Johnson Space Center who led the agency's internal char loss investigation. \"The work that was done by NASA, it was nothing short of eye-watering, it was incredible,\" Hill said. At the base of Orion, which has a titanium shell, there are 186 blocks of a material called Avcoat individually attached to provide a protective layer that allows the spacecraft to survive the heating of atmospheric reentry. Returning from the Moon, Orion encounters temperatures of up to 5,000° Fahrenheit (2,760° Celsius). A char layer that builds up on the outer skin of the Avcoat material is supposed to ablate, or erode, in a predictable manner during reentry. Instead, during Artemis I, fragments fell off the heat shield and left cavities in the Avcoat material. Work by Saucedo and others, including substantial testing in ground facilities, wind tunnels, and high-temperature arc jet chambers, allowed engineers to find the root cause of gases getting trapped in the heat shield and leading to cracking. Hill said his team was convinced that NASA successfully recreated the conditions observed during reentry and were able to replicate during testing the Avcoat cracking that occurred during Artemis I. When he worked at the agency, Hill played a leading role during the investigation into the cause of the loss of space shuttle Columbia, in 2003. He said he could understand if NASA officials \"circled the wagons\" in response to the IRT's work, but he said the agency could not have been more forthcoming. Every time the review team wanted more data or information, it was made available. Eventually, this made the entire IRT comfortable with NASA's findings. Publicly, NASA could have been more transparent The stickiest point during the review team's discussions involved the permeability of the heat shield. Counter-intuitively, the heat shield was not permeable enough during Artemis I. This led to gas buildup, higher pressures, and the cracking ultimately observed. The IRT was concerned because, as designed, the heat shield for Artemis II is actually more impermeable than the Artemis I vehicle. Why is this? It has to do with the ultrasound testing that verifies the strength of the bond between the Avcoat blocks and the titanium skin of Orion. With a more permeable heat shield, it was difficult to complete this testing with the Artemis I vehicle. So the shield for Artemis II was made more impermeable to accommodate ultrasound testing. \"That was a technical mistake, and when they made that decision they did not understand the ramifications,\" Hill said. However, Hill said NASA's data convinced the IRT that modifying the entry profile for Artemis II, to minimize the duration of passage through the atmosphere, would offset the impermeability of the heat shield. Hill said he did not have the authority to release the IRT report, but he did agree that the space agency has not been forthcoming with public information about their analyses before this week. \"This is a complex story to tell, and if you want everybody to come along with you, you've got to keep them informed,\" he said of NASA. \"I think they unintentionally did themselves a disservice by holding their cards too close.\" Eric Berger is the senior space editor at Ars Technica, covering everything from astronomy to private space to NASA policy, and author of two books: Liftoff, about the rise of SpaceX; and Reentry, on the development of the Falcon 9 rocket and Dragon. A certified meteorologist, Eric lives in Houston. 26 Comments",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/07/53706269423_faceffa991_k-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n            \u003carticle data-id=\"2065357\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \n\n      \n\n      \u003cp\u003e\n        \u0026#34;If this isn’t raising red flags out there, I don’t know what will.\u0026#34;\n      \u003c/p\u003e\n\n      \n    \u003c/div\u003e\n\n    \u003cdiv\u003e\n    \n    \u003cp\u003e\n      NASA\u0026#39;s Orion spacecraft, consisting of a US-built crew module and European service module, is lifted during prelaunch processing at Kennedy Space Center in 2021.\n\n              \u003cspan\u003e\n          Credit:\n\n                      \u003ca href=\"https://www.flickr.com/photos/nasakennedy/53706269423/in/album-72157700246421144/\" target=\"_blank\"\u003e\n          \n          NASA/Amanda Stevenson\n\n                      \u003c/a\u003e\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n  \u003c/div\u003e\n\u003c/header\u003e\n\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \n\u003cp\u003eWithin hours of NASA announcing its decision to fly the Artemis II mission aboard an Orion spacecraft with an unmodified heat shield, critics assailed the space agency, saying it had made the wrong decision.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Expediency won over safety and good materials science and engineering. Sad day for NASA,\u0026#34; Ed Pope, an expert in advanced materials and heat shields, wrote \u003ca href=\"https://www.linkedin.com/feed/update/urn:li:activity:7270570432926224384/\"\u003eon LinkedIn\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThere is a lot riding on NASA\u0026#39;s decision, as the Artemis II mission involves four astronauts and the space agency\u0026#39;s first crewed mission into deep space in more than 50 years.\u003c/p\u003e\n\u003cp\u003eA former NASA astronaut, Charles Camarda, also expressed his frustrations \u003ca href=\"https://www.linkedin.com/feed/update/urn:li:activity:7270557555267973120/\"\u003eon LinkedIn\u003c/a\u003e, saying the space agency and its leadership team should be \u0026#34;ashamed.\u0026#34; In an interview on Friday, Camarda, an aerospace engineer who spent two decades working on thermal protection for the space shuttle and hypersonic vehicles, said NASA is relying on flawed probabilistic risk assessments and Monte Carlo simulations to determine the safety of Orion\u0026#39;s existing heat shield.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I worked at NASA for 45 years,\u0026#34; Camarda said. \u0026#34;I love NASA. I do not love the way NASA has become. I do not like that we have lost our research culture.\u0026#34;\u003c/p\u003e\n\u003ch2\u003eNASA makes a decision\u003c/h2\u003e\n\u003cp\u003ePope, Camarada, and others—an official expected to help set space policy for the Trump administration told Ars on background, \u0026#34;It\u0026#39;s difficult to trust any of their findings\u0026#34;—note that NASA has spent two years assessing the char damage incurred by the Orion spacecraft during its first lunar flight in late 2022, with almost no transparency. Initially, agency officials downplayed the severity of the issue, and the full scope of the problem was not revealed until \u003ca href=\"https://oig.nasa.gov/office-of-inspector-general-oig/audit-reports/nasas-readiness-for-the-artemis-ii-crewed-mission-to-lunar-orbit/\"\u003ea report this May\u003c/a\u003e by NASA\u0026#39;s inspector general, which included photos of a heavily pock-marked heat shield.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThis year, from April to August, NASA convened an independent review team (IRT) to assess its internal findings about the root cause of the charring on the Orion heat shield and determine whether its plan to proceed without modifications to the heat shield was the correct one. However, though this review team wrapped up its work in August and began briefing NASA officials in September, the space agency kept mostly silent about the problem until a news conference on Thursday.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cdiv\u003e\n            \u003cp\u003e\u003ca data-pswp-width=\"1110\" data-pswp-height=\"531\" data-pswp-srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2024/05/orion-char.jpg 1110w, https://cdn.arstechnica.net/wp-content/uploads/2024/05/orion-char-300x144.jpg 300w, https://cdn.arstechnica.net/wp-content/uploads/2024/05/orion-char-640x306.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2024/05/orion-char-768x367.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2024/05/orion-char-980x469.jpg 980w\" data-cropped=\"false\" href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/05/orion-char.jpg\" target=\"_blank\"\u003e\n              \u003cimg width=\"1110\" height=\"531\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/05/orion-char.jpg\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2024/05/orion-char.jpg 1110w, https://cdn.arstechnica.net/wp-content/uploads/2024/05/orion-char-300x144.jpg 300w, https://cdn.arstechnica.net/wp-content/uploads/2024/05/orion-char-640x306.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2024/05/orion-char-768x367.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2024/05/orion-char-980x469.jpg 980w\" sizes=\"auto, (max-width: 1110px) 100vw, 1110px\"/\u003e\n            \u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"caption-2021262\"\u003e\u003cp\u003e\n              The inspector general\u0026#39;s report on May 1 included new images of Orion\u0026#39;s heat shield.\n                              \u003c/p\u003e\u003cp\u003e\n                  Credit:\n                                      NASA Inspector General\n                                  \u003c/p\u003e\n                          \u003c/div\u003e\n          \u003c/div\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      The inspector general\u0026#39;s report on May 1 included new images of Orion\u0026#39;s heat shield.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          NASA Inspector General\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003e\u0026#34;Based on the data, we have decided—NASA unanimously and our decision-makers—to move forward with the current Artemis II Orion capsule and heat shield, with a modified entry trajectory,\u0026#34; Bill Nelson, NASA\u0026#39;s administrator, said Thursday. The heat shield investigation and other issues with the Orion spacecraft will now delay the Artemis II launch until April 2026, a slip of seven months from the previous launch date in September 2025.\u003c/p\u003e\n\u003cp\u003eNotably the chair of the IRT, a former NASA flight director named Paul Hill, was not present at Thursday\u0026#39;s news conference. Nor did the space agency release the IRT\u0026#39;s report on its recommendations to NASA.\u003c/p\u003e\n\u003cp\u003eIn an interview, Camarda said he knew two people on the IRT who dissented from its conclusions that NASA\u0026#39;s plan to fly the Orion heat shield, without modifications to address the charring problem, was acceptable. He also criticized the agency for not publicly releasing the independent report. \u0026#34;NASA did not post the results of the IRT,\u0026#34; he said. \u0026#34;Why wouldn’t they post the results of what the IRT said? If this isn’t raising red flags out there, I don’t know what will.\u0026#34;\u003c/p\u003e\n\n\u003ch2\u003eThe view from the IRT\u003c/h2\u003e\n\u003cp\u003eArs took these concerns to NASA on Friday, and the agency responded by offering an interview with Paul Hill, the review team\u0026#39;s chair. He strongly denied there were any dissenting views.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003e\u0026#34;Every one of our conclusions, every one of our recommendations, was unanimously agreed to by our team,\u0026#34; Hill said. \u0026#34;We went through a lot of effort, arguing sentence by sentence, to make sure the entire team agreed. To get there we definitely had some robust and energetic discussions.\u0026#34;\u003c/p\u003e\n\u003cp\u003eHill did acknowledge that, at the outset of the review team\u0026#39;s discussions, two people were opposed to NASA\u0026#39;s plan to fly the heat shield as is. \u0026#34;There was, early on, definitely a difference of opinion with a couple of people who felt strongly that Orion\u0026#39;s heat shield was not good enough to fly as built,\u0026#34; he said.\u003c/p\u003e\n\u003cp\u003eHowever, Hill said the IRT was won over by the depth of NASA\u0026#39;s testing and the openness of agency engineers who worked with them. He singled out Luis Saucedo, a NASA engineer at NASA\u0026#39;s Johnson Space Center who led the agency\u0026#39;s internal char loss investigation.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The work that was done by NASA, it was nothing short of eye-watering, it was incredible,\u0026#34; Hill said.\u003c/p\u003e\n\u003cp\u003eAt the base of Orion, which has a titanium shell, there are 186 blocks of a material called Avcoat individually attached to provide a protective layer that allows the spacecraft to survive the heating of atmospheric reentry. Returning from the Moon, Orion encounters temperatures of up to 5,000° Fahrenheit (2,760° Celsius). A char layer that builds up on the outer skin of the Avcoat material is supposed to ablate, or erode, in a predictable manner during reentry. Instead, during Artemis I, fragments fell off the heat shield and left cavities in the Avcoat material.\u003c/p\u003e\n\u003cp\u003eWork by Saucedo and others, including substantial testing in ground facilities, wind tunnels, and high-temperature arc jet chambers, allowed engineers to find the root cause of gases getting trapped in the heat shield and leading to cracking. Hill said his team was convinced that NASA successfully recreated the conditions observed during reentry and were able to replicate during testing the Avcoat cracking that occurred during Artemis I.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n\n        \n        \u003cdiv\u003e\n          \n          \n\u003cp\u003eWhen he worked at the agency, Hill played a leading role during the investigation into the cause of the loss of space shuttle \u003cem\u003eColumbia\u003c/em\u003e, in 2003. He said he could understand if NASA officials \u0026#34;circled the wagons\u0026#34; in response to the IRT\u0026#39;s work, but he said the agency could not have been more forthcoming. Every time the review team wanted more data or information, it was made available. Eventually, this made the entire IRT comfortable with NASA\u0026#39;s findings.\u003c/p\u003e\n\u003ch2\u003ePublicly, NASA could have been more transparent\u003c/h2\u003e\n\u003cp\u003eThe stickiest point during the review team\u0026#39;s discussions involved the permeability of the heat shield. Counter-intuitively, the heat shield was not permeable enough during Artemis I. This led to gas buildup, higher pressures, and the cracking ultimately observed. The IRT was concerned because, as designed, the heat shield for Artemis II is actually \u003cem\u003emore\u003c/em\u003e impermeable than the Artemis I vehicle.\u003c/p\u003e\n\u003cp\u003eWhy is this? It has to do with the ultrasound testing that verifies the strength of the bond between the Avcoat blocks and the titanium skin of Orion. With a more permeable heat shield, it was difficult to complete this testing with the Artemis I vehicle. So the shield for Artemis II was made more impermeable to accommodate ultrasound testing. \u0026#34;That was a technical mistake, and when they made that decision they did not understand the ramifications,\u0026#34; Hill said.\u003c/p\u003e\n\u003cp\u003eHowever, Hill said NASA\u0026#39;s data convinced the IRT that modifying the entry profile for Artemis II, to minimize the duration of passage through the atmosphere, would offset the impermeability of the heat shield.\u003c/p\u003e\n\u003cp\u003eHill said he did not have the authority to release the IRT report, but he did agree that the space agency has not been forthcoming with public information about their analyses before this week.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This is a complex story to tell, and if you want everybody to come along with you, you\u0026#39;ve got to keep them informed,\u0026#34; he said of NASA. \u0026#34;I think they unintentionally did themselves a disservice by holding their cards too close.\u0026#34;\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\n\n                  \n          \n\n\n\n\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n          \u003cp\u003e\u003ca href=\"https://arstechnica.com/author/ericberger/\"\u003e\u003cimg src=\"https://arstechnica.com/wp-content/uploads/2016/05/e.berger-45959.jpg\" alt=\"Photo of Eric Berger\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\n\n  \u003cdiv\u003e\n    \n\n    \u003cp\u003e\n      Eric Berger is the senior space editor at Ars Technica, covering everything from astronomy to private space to NASA policy, and author of two books: \u003ca href=\"https://www.harpercollins.com/products/liftoff-eric-berger?variant=32126620205090\"\u003e\u003ci\u003eLiftoff\u003c/i\u003e\u003c/a\u003e, about the rise of SpaceX; and \u003ca href=\"https://www.penguinrandomhouse.com/books/759707/reentry-by-eric-berger/\"\u003e\u003ci\u003eReentry\u003c/i\u003e\u003c/a\u003e, on the development of the Falcon 9 rocket and Dragon. A certified meteorologist, Eric lives in Houston.\n    \u003c/p\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\n\n  \u003cp\u003e\n    \u003ca href=\"https://arstechnica.com/space/2024/12/former-flight-director-who-reviewed-orion-heat-shield-data-says-there-was-no-dissent/#comments\" title=\"26 comments\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 80 80\"\u003e\u003cdefs\u003e\u003cclipPath id=\"bubble-zero_svg__a\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"bubble-zero_svg__b\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#bubble-zero_svg__a)\"\u003e\u003cg fill=\"currentColor\" clip-path=\"url(#bubble-zero_svg__b)\"\u003e\u003cpath d=\"M80 40c0 22.09-17.91 40-40 40S0 62.09 0 40 17.91 0 40 0s40 17.91 40 40\"\u003e\u003c/path\u003e\u003cpath d=\"M40 40 .59 76.58C-.67 77.84.22 80 2.01 80H40z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n    26 Comments\n  \u003c/a\u003e\n      \u003c/p\u003e\n              \u003c/div\u003e\n  \u003c/article\u003e\n\n\n\n\n\n  \n\n\n  \u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003ca href=\"https://arstechnica.com/information-technology/2024/12/new-broadcom-sales-plan-may-be-insignificant-in-deterring-vmware-migrations/\"\u003e\n              \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1247615915-768x432-1733429422.jpg\" alt=\"Listing image for first story in Most Read: Broadcom reverses controversial plan in effort to cull VMware migrations\" decoding=\"async\" loading=\"lazy\"/\u003e\n            \u003c/a\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n\n\n  \n\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-12-06T22:29:32Z",
  "modifiedTime": "2024-12-06T22:40:31Z"
}
