{
  "id": "226552f8-a64b-4430-b7e6-689b6b9eab05",
  "title": "I read all the community notes on Elon Musk's X account. Here's what I learned.",
  "link": "https://mashable.com/article/elon-musk-community-notes",
  "description": "Elon Musk needs a lot of fact-checking. Community Notes, the Twitter/X service designed to stop lies on the platform, is barely doing it.",
  "author": "",
  "published": "Fri, 11 Oct 2024 22:20:42 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Chris Taylor",
  "length": 9241,
  "excerpt": "The user-voted fact-checks have been added to 70 Musk tweets so far — and most are on his replies. Here's why.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "The 'Dark MAGA' billionaire, speaking at a Trump rally, has been fact-checked 70 times on his own service. Credit: Jim Watson / AFP / Getty The first thing to know about Community Notes on Elon Musk's tweets: there ought to be a lot more of them.Community Notes, the Twitter/X fact-checks formerly known as Birdwatch, are often touted as one of the few good things to have survived the first chaotic year of Musk's ownership. These notes are user-generated, usually including links to high-quality sources. Like Reddit posts they live or die on upvotes (\"helpful\") and downvotes (\"not helpful\") — enough of the latter and they disappear. Anyone can sign up to contribute, if they don't have strikes against their account. Contributors are the only ones who get to see or vote on proposed notes before they're officially stamped on tweets.Musk will often tout Community Notes as a sign that he cares about the quality of information on a service that is crawling with deliberate disinformation. He's smart to do so: one study has found that Community Notes increase trust in social media, and so could help bring X's fleeing users back. But he doesn't even need to put his thumb on the scale of the X algorithm to avoid them himself. With nearly 200 million people following him, if even a small percentage of his adoring fans are signed up to rate proposed Community Notes, they can swarm the system, intercept and rate any proposed note on Musk's account as \"not helpful\" before he gets another badge of fact-checking shame. As in this instance, where retweeting a false story about a bomb at a Trump rally was a step too far even for his fans (the original tweet Musk quotes was deleted; the Note remains). Tweet may have been deleted This helps Musk significantly. Because as any study of his tweets confirms, the bomb story isn't too much of an outlier: Musk is spreading misinformation constantly. The New York Times looked at one weeks' worth in September, and found one-third to be \"false, misleading or missing vital context.\" In July, the month Musk endorsed Trump, the Center for Countering Digital Hate identified 50 Musk tweets that had been debunked by independent fact-checkers. Not one of them got Community Noted, and they were viewed a total of 1.2 billion times. As things stand on the unofficial Community Notes leaderboard, Musk is at #55, with 70 Community Notes so far. Several accounts that he frequently replies to and retweets are ranked in the top 10. The top account has more than 800 notes — but at a rate of 50 falsehoods a month, Musk would easily have outpaced them if oversight was equal.So what can we learn from the 70 fact-checks that did actually get added to Musk's account? Here's your TL;DR. Musk's early fibs weren't that big a deal. Tweet may have been deleted A mere three of the 70 Community Notes on Musk tweets were before the date he brought that sink in to Twitter in October 2022. That doesn't tell us too much, since the Birdwatch service was soft-launched in January 2021 and only fully rolled out weeks before Musk arrived. Still, we can see how minor the corrections were at first. In his first post with a Community Note, Musk claimed his Tesla Roadster was orbiting Mars; it's actually orbiting the sun somewhere out towards the asteroid belt (which is still quite a flex). The other two pre-Twitter Notes concern EV tax credits and Hyperloop tunnels, which he claims can't flood. Concerning, to use one of Musk's favorite words, but not a huge deal. In Musk's first week at Twitter, he racked up four more Notes. But they're harmless, even helpful. A couple point out when Musk is joking, in case it isn't clear. He calls Community Notes \"awesome\"; a Note provides further information on how to join. Mashable Light Speed Then on Nov 4, 2022, Musk claimed advertisers are \"trying to destroy free speech in America\" by fleeing the service. Community Notes stepped in to point out that advertisers were concerned about Musk's lax approach to security and misinformation as he gutted those teams. And a new more adversarial kind of Musk note was born. There are more Community Notes on his tech posts than his political posts. In 2023, Musk would receive 31 Notes. It's still his most fact-checked year. May 2023 — when Musk launched Ron DeSantis' campaign on X, and incorrectly claimed DeSantis had set \"an all time record for fundraising\" — is still his most fact-checked month. But that doesn't mean he's getting fact-checked on his political statements. More Community Notes appear on his claims about the tech and media world, including a number of bizarre attacks on nonprofits (see notes on his tweets about the Wikimedia Foundation, the Internet Archive, and NPR). Musk is more vulnerable in the replies.Of the 70 Community Notes on Musk tweets, a clear majority — 40 — are on tweets where Musk is replying to someone. That makes sense. The X algorithm artificially boosts Musk's regular posts, making sure that he shows up in your \"For You\" tab even if you don't follow him. But the algorithm doesn't push his replies, so falsehoods there are more likely to receive upvotes from Community Note volunteers acting in good faith.And what falsehoods they've been! In a reply to his mother, Musk disavowed knowledge of his father's emerald mine; Community Notes simply used his own words against him, digging up a quote acknowledging that his father co-owned the mine. In a reply to a former employee, Musk claims there's no proof that plastics in the environment harm us; turns out there is. \"Why would we have your home address?\" he asks a verified user concerned about X potentially doxxing him to the IDF; a Note points out that verification requires ID with an address.And he can't let well enough alone. When one supportive account posts a screenshot proudly proving that X is fair because \"even Elon Musk can be Community Noted,\" Musk replies that the Note in the screenshot \"is incorrect and the community already voted it away.\" That earns him another Community Note: nope, it's still there. Musk loves Community Notes, except when he doesn't. Tweet may have been deleted On seven out of the 70 posts, Musk invited the fact-check himself. Invariably he tags @CommunityNotes on a tweet he wanted to quote, and clearly already believed. On the stark statement he's pushing, he'll add a fig leaf by asking \"is this true\" or \"is this accurate?\" Nearly every time, the note that results provides context that Musk has missed. Yet Musk rarely responds to the fact-check he's invited. The one time he did, he dug in his heels. \"Community Notes is failing here,\" Musk wrote in February after claiming that it was impossible to sign into a Windows PC without a Microsoft account. No, the Note on this reply stated, you can do it — it just requires a workaround that \"the average Andy\" might not know about. The implication: A tech billionaire who's been logging into Windows machines for decades is not the average Andy.Nor does this particular tech billionaire get Community Noted like the Average Andy would, at least so far. And it doesn't seem the service will do anything whatsoever to rein in \"Dark MAGA\" Musk during the last month before the U.S. elections. Why? Because, like a good Community Note, we ought to note the limit of Community Notes — using clear language and high-quality sources. Here's a thorough debunk of Musk's repeated claim that \"illegal\" immigrants are voting in U.S. elections; none of his posts on this subject have been noted. (Ironically, Musk himself may have been at one time an \"illegal\" immigrant — you'd think the writers of sassy notes would enjoy pointing this out.) Here's a debunk of his \"you have said the actual truth\" reply to an antisemitic screed last year. A tweet so infamous, advertisers fled, and yet it was not noted. Here's a debunk of his \"voter fraud in Virginia\" post from the last week, also not noted. We could go on, but you get the point. If volunteers cannot overcome the Musk downvoters to append correctives on this kind of nonsense, there's very little he can say before election day that will be fact-checked. Noted. Chris is a veteran tech, entertainment and culture journalist, author of 'How Star Wars Conquered the Universe,' and co-host of the Doctor Who podcast 'Pull to Open.' Hailing from the U.K., Chris got his start as a sub editor on national newspapers. He moved to the U.S. in 1996, and became senior news writer for Time.com a year later. In 2000, he was named San Francisco bureau chief for Time magazine. He has served as senior editor for Business 2.0, and West Coast editor for Fortune Small Business and Fast Company. Chris is a graduate of Merton College, Oxford and the Columbia University Graduate School of Journalism. He is also a long-time volunteer at 826 Valencia, the nationwide after-school program co-founded by author Dave Eggers. His book on the history of Star Wars is an international bestseller and has been translated into 11 languages. This newsletter may contain advertising, deals, or affiliate links. Subscribing to a newsletter indicates your consent to our Terms of Use and Privacy Policy. You may unsubscribe from the newsletters at any time.",
  "image": "https://helios-i.mashable.com/imagery/articles/06BmFpjN3ThwEhQlBo9YVJv/hero-image.fill.size_1200x675.v1728501583.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection data-ga-module=\"content_body\"\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/articles/06BmFpjN3ThwEhQlBo9YVJv/hero-image.fill.size_1248x702.v1728501583.jpg\" alt=\"Elon Musk in his MAGA hat in front of a microphone.\" width=\"1248\" height=\"702\" srcset=\"https://helios-i.mashable.com/imagery/articles/06BmFpjN3ThwEhQlBo9YVJv/hero-image.fill.size_400x225.v1728501583.jpg 400w, https://helios-i.mashable.com/imagery/articles/06BmFpjN3ThwEhQlBo9YVJv/hero-image.fill.size_800x450.v1728501583.jpg 800w, https://helios-i.mashable.com/imagery/articles/06BmFpjN3ThwEhQlBo9YVJv/hero-image.fill.size_1248x702.v1728501583.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe \u0026#39;Dark MAGA\u0026#39; billionaire, speaking at a Trump rally, has been fact-checked 70 times on his own service.\u003c/span\u003e\n\u003cspan\u003eCredit: Jim Watson / AFP / Getty\u003c/span\u003e\n\u003c/p\u003e\n\u003c/div\u003e\n\u003carticle id=\"article\" data-autopogo=\"\"\u003e\n\u003cp\u003eThe first thing to know about Community Notes on \u003ca href=\"https://mashable.com/category/elon-musk\" target=\"_self\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eElon Musk\u003c/a\u003e\u0026#39;s tweets: there ought to be a \u003cem\u003elot \u003c/em\u003emore of them.\u003c/p\u003e\u003cp\u003eCommunity Notes, the Twitter/X fact-checks formerly known as Birdwatch, are often touted as one of the few good things to have survived the \u003ca href=\"https://mashable.com/article/musk-twitter-year\" target=\"_self\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003efirst chaotic year of Musk\u0026#39;s ownership\u003c/a\u003e. These notes are user-generated, usually including links to high-quality sources. Like Reddit posts they live or die on upvotes (\u0026#34;helpful\u0026#34;) and downvotes (\u0026#34;not helpful\u0026#34;) — enough of the latter and they disappear. Anyone can sign up to contribute, if they don\u0026#39;t have strikes against their account. Contributors are the only ones who get to see or vote on proposed notes before they\u0026#39;re officially stamped on tweets.\u003c/p\u003e\u003cp\u003eMusk will often tout Community Notes as a sign that he cares about the quality of information on a service that is crawling with deliberate disinformation. He\u0026#39;s smart to do so: one study has found that \u003ca href=\"https://academic.oup.com/pnasnexus/article/3/7/pgae217/7686087\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eCommunity Notes increase trust in social media\u003c/a\u003e, and so could help bring X\u0026#39;s fleeing users back. But he doesn\u0026#39;t even need to put his thumb on the scale of the X algorithm to avoid them himself. \u003c/p\u003e\u003cp\u003eWith nearly 200 million people following him, if even a small percentage of his adoring fans are signed up to rate proposed Community Notes, they can swarm the system, intercept and rate any proposed note on Musk\u0026#39;s account as \u0026#34;not helpful\u0026#34; before he gets another badge of fact-checking shame. As in this instance, where retweeting a false story about a bomb at a Trump rally was a step too far even for his fans (the original tweet Musk quotes was deleted; the Note remains). \u003c/p\u003e\u003cblockquote\u003e\n\u003ca href=\"https://twitter.com/elonmusk/status/1836423451512590767\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003e\nTweet may have been deleted\n\u003c/a\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThis helps Musk significantly. Because as any study of his tweets confirms, the bomb story isn\u0026#39;t too much of an outlier: \u003cem\u003eMusk is spreading misinformation constantly. \u003c/em\u003eThe \u003ca href=\"https://www.nytimes.com/2024/09/27/technology/elon-musk-x-posts.html\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cem\u003eNew York Times \u003c/em\u003elooked at one weeks\u0026#39; worth in September\u003c/a\u003e, and found one-third to be \u0026#34;false, misleading or missing vital context.\u0026#34; \u003c/p\u003e\u003cp\u003eIn July, the month Musk endorsed Trump, the Center for Countering Digital Hate \u003ca href=\"https://counterhate.com/research/musk-misleading-election-claims-viewed-1-2bn-times-on-x-with-no-fact-checks/\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eidentified 50 Musk tweets that had been debunked\u003c/a\u003e by independent fact-checkers. Not one of them got Community Noted, and they were viewed a total of 1.2 billion times. \u003c/p\u003e\u003cp\u003eAs things stand on the unofficial \u003ca href=\"https://community-notes-leaderboard.com/\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eCommunity Notes leaderboard\u003c/a\u003e, Musk is at #55, with 70 Community Notes so far. Several accounts that he frequently replies to and retweets are ranked in the top 10. The top account has more than 800 notes — but at a rate of 50 falsehoods a month, Musk would easily have outpaced them if oversight was equal.\u003c/p\u003e\u003cp\u003eSo what can we learn from the 70 fact-checks that \u003cem\u003edid\u003c/em\u003e actually get added to Musk\u0026#39;s account? Here\u0026#39;s your TL;DR. \u003c/p\u003e\u003ch2\u003eMusk\u0026#39;s early fibs weren\u0026#39;t that big a deal.\u003c/h2\u003e\u003cblockquote\u003e\n\u003ca href=\"https://twitter.com/elonmusk/status/1467156129386049538\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003e\nTweet may have been deleted\n\u003c/a\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eA mere three of the 70 Community Notes on Musk tweets were before the date he brought that sink in to Twitter in October 2022. That doesn\u0026#39;t tell us too much, since the Birdwatch service was soft-launched in January 2021 and only fully rolled out weeks before Musk arrived. \u003c/p\u003e\u003cp\u003eStill, we can see how minor the corrections were at first. In his first post with a Community Note, Musk claimed his Tesla Roadster was orbiting Mars; it\u0026#39;s actually \u003ca href=\"https://mashable.com/article/elon-musk-tesla-roadster-space-library\" target=\"_self\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eorbiting the sun somewhere out towards the asteroid belt\u003c/a\u003e (which is still quite a flex). The other two pre-Twitter Notes concern EV tax credits and Hyperloop tunnels, which he claims can\u0026#39;t flood. Concerning, to use one of Musk\u0026#39;s favorite words, but not a huge deal. \u003c/p\u003e\n\u003cp\u003eIn Musk\u0026#39;s first week at Twitter, he racked up four more Notes. But they\u0026#39;re harmless, even helpful. A couple point out when Musk is joking, in case it isn\u0026#39;t clear. He calls Community Notes \u0026#34;awesome\u0026#34;; a Note provides further information on how to join. \u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"mashablelightspeed\"\u003e\n\u003cp\u003e\nMashable Light Speed\n\u003c/p\u003e\n\n\n\u003c/section\u003e\n\u003cp\u003eThen on Nov 4, 2022, Musk claimed advertisers are \u0026#34;trying to destroy free speech in America\u0026#34; by fleeing the service. Community Notes stepped in to point out that advertisers were concerned about Musk\u0026#39;s lax approach to security and misinformation as he gutted those teams. And a new more adversarial kind of Musk note was born. \u003c/p\u003e\u003ch2\u003eThere are more Community Notes on his tech posts than his political posts. \u003c/h2\u003e\u003cp\u003eIn 2023, Musk would receive 31 Notes. It\u0026#39;s still his most fact-checked year. May 2023 — when Musk launched Ron DeSantis\u0026#39; campaign on X, and incorrectly claimed DeSantis had set \u0026#34;an all time record for fundraising\u0026#34; — is still his most fact-checked month. \u003c/p\u003e\u003cp\u003eBut that doesn\u0026#39;t mean he\u0026#39;s getting fact-checked on his political statements. More Community Notes appear on his claims about the tech and media world, including a number of bizarre attacks on nonprofits (see notes on his tweets about the \u003ca href=\"https://x.com/elonmusk/status/1651602599345373186\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eWikimedia Foundation\u003c/a\u003e, the \u003ca href=\"https://x.com/elonmusk/status/1651602599345373186\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eInternet Archive\u003c/a\u003e, and \u003ca href=\"https://twitter.com/elonmusk/status/1644638493883211779\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eNPR\u003c/a\u003e). \u003c/p\u003e\u003ch2\u003eMusk is more vulnerable in the replies.\u003c/h2\u003e\u003cp\u003eOf the 70 Community Notes on Musk tweets, a clear majority — 40 — are on tweets where Musk is replying to someone. That makes sense. The X algorithm artificially boosts Musk\u0026#39;s regular posts, making sure that he shows up in your \u0026#34;For You\u0026#34; tab even if you don\u0026#39;t follow him. But the algorithm doesn\u0026#39;t push his replies, so falsehoods there are more likely to receive upvotes from Community Note volunteers acting in good faith.\u003c/p\u003e\u003cp\u003eAnd what falsehoods they\u0026#39;ve been! In a reply to his mother, Musk \u003ca href=\"https://twitter.com/elonmusk/status/1611856501798215680\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003edisavowed knowledge of his father\u0026#39;s emerald mine\u003c/a\u003e; Community Notes simply used his own words against him, digging up a quote acknowledging that his father co-owned the mine. In a reply to a former employee, Musk \u003ca href=\"https://twitter.com/elonmusk/status/1826407741101109419\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eclaims there\u0026#39;s no proof that plastics in the environment harm us\u003c/a\u003e; turns out there is. \u0026#34;Why would we have your home address?\u0026#34; he asks a verified user concerned about X potentially doxxing him to the IDF; a Note points out that verification requires ID with an address.\u003c/p\u003e\u003cp\u003eAnd he can\u0026#39;t let well enough alone. When one supportive account posts a screenshot proudly proving that X is fair because \u0026#34;even Elon Musk can be Community Noted,\u0026#34; Musk replies that the Note in the screenshot \u0026#34;is incorrect and the community already voted it away.\u0026#34; That earns him another Community Note: nope, it\u0026#39;s still there. \u003c/p\u003e\u003ch2\u003eMusk loves Community Notes, except when he doesn\u0026#39;t. \u003c/h2\u003e\u003cblockquote\u003e\n\u003ca href=\"https://twitter.com/elonmusk/status/1651602599345373186\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003e\nTweet may have been deleted\n\u003c/a\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eOn seven out of the 70 posts, Musk invited the fact-check himself. Invariably he tags @CommunityNotes on a tweet he wanted to quote, and clearly already believed. On the stark statement he\u0026#39;s pushing, he\u0026#39;ll add a fig leaf by asking \u0026#34;is this true\u0026#34; or \u0026#34;is this accurate?\u0026#34; Nearly every time, the note that results provides context that Musk has missed. \u003c/p\u003e\u003cp\u003eYet Musk rarely responds to the fact-check he\u0026#39;s invited. The one time he did, he dug in his heels. \u0026#34;Community Notes is failing here,\u0026#34; \u003ca href=\"https://mashable.com/article/elon-musk-arguing-community-notes\" target=\"_self\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eMusk wrote in February\u003c/a\u003e after claiming that it was impossible to sign into a Windows PC without a Microsoft account. No, the Note on this reply stated, you can do it — it just requires a workaround that \u0026#34;the average Andy\u0026#34; might not know about. \u003c/p\u003e\n\u003cp\u003eThe implication: A tech billionaire who\u0026#39;s been logging into Windows machines for decades is not the average Andy.\u003c/p\u003e\u003cp\u003eNor does this particular tech billionaire get Community Noted like the Average Andy would, at least so far. And it doesn\u0026#39;t seem the service will do anything whatsoever to rein in \u003ca href=\"https://mashable.com/article/musk-weird-weekend\" target=\"_self\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u0026#34;Dark MAGA\u0026#34; Musk\u003c/a\u003e during the last month before the U.S. elections. \u003c/p\u003e\u003cp\u003eWhy? Because, like a good Community Note, we ought to note the limit of Community Notes — using clear language and high-quality sources. \u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.motherjones.com/politics/2024/09/elon-musk-noncitizen-voting-tweet-lies-disinformation/\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eHere\u0026#39;s a thorough debunk of Musk\u0026#39;s repeated claim\u003c/a\u003e that \u0026#34;illegal\u0026#34; immigrants are voting in U.S. elections; none of his posts on this subject have been noted. (Ironically, \u003ca href=\"https://www.lexisnexis.com/community/insights/legal/immigration/b/outsidenews/posts/did-elon-musk-violate-u-s-immigration-laws?srsltid=AfmBOopV0cPhDFKcKv3SAC_5fH3-B__gOSzILov99EKQ0CjH5kMmr959\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eMusk himself may have been at one time an \u0026#34;illegal\u0026#34; immigrant\u003c/a\u003e — you\u0026#39;d think the writers of sassy notes would enjoy pointing this out.) \u003c/p\u003e\u003cp\u003eHere\u0026#39;s a \u003ca href=\"https://www.cnn.com/2023/11/17/business/elon-musk-reveals-his-actual-truth/index.html\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003edebunk of his \u0026#34;you have said the actual truth\u0026#34; reply to an antisemitic screed last year\u003c/a\u003e. A tweet so infamous, advertisers fled, and yet it was not noted. \u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.axios.com/local/richmond/2024/10/08/elon-musk-henrico-false-election-fraud-tweet\" target=\"_blank\" data-ga-click=\"1\" data-ga-element=\"offer\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eHere\u0026#39;s a debunk of his \u0026#34;voter fraud in Virginia\u0026#34; post from the last week\u003c/a\u003e, also not noted. \u003c/p\u003e\u003cp\u003eWe could go on, but you get the point. If volunteers cannot overcome the Musk downvoters to append correctives on this kind of nonsense, there\u0026#39;s very little he can say before election day that \u003cem\u003ewill\u003c/em\u003e be fact-checked. \u003c/p\u003e\u003cp\u003eNoted. \u003c/p\u003e\n\n\u003c/article\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/authors/05EkIwdTFdfBnl3ahBh6Vjv/image.fill.size_100x100.v1624381061.jpg\" alt=\"Chris Taylor\" width=\"100\" height=\"100\" loading=\"lazy\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003eChris is a veteran tech, entertainment and culture journalist, author of \u0026#39;How Star Wars Conquered the Universe,\u0026#39; and co-host of the Doctor Who podcast \u0026#39;Pull to Open.\u0026#39; Hailing from the U.K., Chris got his start as a sub editor on national newspapers. He moved to the U.S. in 1996, and became senior news writer for Time.com a year later. In 2000, he was named San Francisco bureau chief for Time magazine. He has served as senior editor for Business 2.0, and West Coast editor for Fortune Small Business and Fast Company. Chris is a graduate of Merton College, Oxford and the Columbia University Graduate School of Journalism. He is also a long-time volunteer at 826 Valencia, the nationwide after-school program co-founded by author Dave Eggers. His book on the history of Star Wars is an international bestseller and has been translated into 11 languages.\u003c/p\u003e\n\u003c/div\u003e\n\n\u003c/section\u003e\u003cdiv x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"footer_nl_signup\" data-ga-label=\"Top Stories\"\u003e\n\n\u003cp\u003e\nThis newsletter may contain advertising, deals, or affiliate links. Subscribing to a newsletter indicates your consent to our \u003ca href=\"https://www.ziffdavis.com/terms-of-use\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003eTerms of Use\u003c/a\u003e and \u003ca href=\"https://www.ziffdavis.com/ztg-privacy-policy\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003ePrivacy Policy\u003c/a\u003e. You may unsubscribe from the newsletters at any time.\n\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-10-11T22:20:42Z",
  "modifiedTime": "2024-10-11T22:25:17Z"
}
