{
  "id": "25bf0052-0875-45b8-8c4d-a93aab61238c",
  "title": "Meet the 5 space tech firms vying to be Europe’s next launch provider",
  "link": "https://thenextweb.com/news/meet-5-space-tech-firms-european-launcher-challenge",
  "description": "Five rocket companies will compete for contracts to provide Europe’s next launch services — and boost the continent’s troubled access to space. The European Space Agency (ESA) selected the quintet, who will now contend for two types of contracts: Providing launch services for ESA between 2026 and 2030. Demonstrating upgraded launch capabilities, including at least one flight test. The initiative — named the European Launcher Challenge (ELC) — aims to expand Europe’s pathways into the cosmos. In recent years, these routes have been painfully limited. When the Ariane 5 rocket was retired in July 2023, ESA was left with no independent…This story continues at The Next Web",
  "author": "Thomas Macaulay",
  "published": "Wed, 09 Jul 2025 15:28:15 +0000",
  "source": "https://thenextweb.com/feed/",
  "categories": [
    "Deep tech",
    "Startups and technology",
    "Next Featured",
    "Government and policy",
    "Corporates and innovation"
  ],
  "byline": "Thomas Macaulay",
  "length": 4495,
  "excerpt": "ESA has chosen five rocket firms to compete for €169mn contracts, aiming to restore Europe’s independent access to space.",
  "siteName": "TNW | Deep-Tech",
  "favicon": "https://next.tnwcdn.com/assets/img/favicon/favicon-194x194.png",
  "text": "Five rocket companies will compete for contracts to provide Europe’s next launch services — and boost the continent’s troubled access to space. The European Space Agency (ESA) selected the quintet, who will now contend for two types of contracts: Providing launch services for ESA between 2026 and 2030. Demonstrating upgraded launch capabilities, including at least one flight test. The initiative — named the European Launcher Challenge (ELC) — aims to expand Europe’s pathways into the cosmos. In recent years, these routes have been painfully limited. When the Ariane 5 rocket was retired in July 2023, ESA was left with no independent access to space. The agency instead relied exclusively on SpaceX for its launches, leaving it with no autonomous control over its flight paths. Meanwhile, European taxpayer funds were being funnelled to an American company that competes with domestic businesses. The 💜 of EU techThe latest rumblings from the EU tech scene, a story from our wise ol' founder Boris, and some questionable AI art. It's free, every week, in your inbox. Sign up now!Thierry Breton, the EU’s commissioner for the internal market, described the situation as an “unprecedented crisis.” ESA finally regained sovereign access to space in July, when the Ariane 6 rocket had its maiden voyage. The launch provided welcome relief, but the rocket faces severe limitations. Unlike SpaceX’s Falcon 9, it’s not reusable. It’s also more expensive, less flexible for small-scale launches, and suffers from slower launch rates due to bureaucratic constraints. The ELC was designed to lower these barriers. There’s also big money on the line — ESA has earmarked up to €169mn per participant. Here are the five contenders for the cash. Isar Aerospace Founded: 2018 Headquarters: Ottobrunn, Germany Europe’s best-funded space tech firm, Isar Aerospace develops rockets for small to medium satellite payloads. A spin-off from the Technical University of Munich, the company aims to offer affordable and flexible launch services.  In March, Isar’s Spectrum vehicle had its debut flight — the first vertical orbital rocket launch from Western Europe. Unfortunately, the rocket exploded shortly after takeoff. Isar nonetheless hailed the launch a “great success.” MaiaSpace Founded: 2021 Headquarters: Paris, France MaiaSpace designs, manufactures, and operates competitive and sustainable solutions for space mobility. A subsidiary of ArianeGroup — the prime contractor for Ariane 6 — the company is developing a reusable, two-stage rocket called Maia. Designed for vertical takeoff and landing, Maia has been compared to a smaller-scale Falcon 9. Its first launch is planned for 2026. PLD Space Founded: 2011 Headquarters: Elche, Spain PLD Space also focuses on reusability. Its suborbital Miura 1 vehicle completed a successful test flight in 2023, marking Europe’s first fully private rocket launch. PLD Space is now building the larger Miura 5, a two-stage reusable orbital launcher for small payloads. Last December, the company secured an €11mn loan to support its development. The rocket’s inaugural flight is expected to take place in the first quarter of 2026. The Miura 1 launch took place at the Arenosillo Test Centre (CEDEA) in Huelva, Spain. Credit: PLD Space Rocket Factory Augsburg (RFA) Founded: 2018 Headquarters: Augsburg, Germany RFA is a spinoff from OHB SE, a German space tech giant. The startup’s flagship rocket is the RFA One, designed for frequent, low-cost missions. The company also secured access to SaxaVord Spaceport’s first launch pad — but the facility hasn’t always been a happy home for RFA. Last year, its rocket exploded during a test at the site. Undeterred, RFA has continued its mission to build low-cost, high-performance rockets. It’s targeting an inaugural launch later this year. Orbital Express Launch Founded: 2021 Headquarters: Forres, Scotland Also known as Orbex, Orbital Express Launch is developing a small orbital rocket called Prime. Billed as an environmentally friendly, reusable launcher, the vehicle is slated for a maiden flight in 2026. Orbex is also building a larger rocket, called Proxima. In June, the company’s CEO claimed Proxima would allow Orbex to compete with SpaceX on price — as long as it won a contract with the ELC. That target is now one step closer to reality. ESA will next discuss the proposals with the five challengers and their respective Member States, before determining which of them will be awarded contracts.",
  "image": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1\u0026fit=1280%2C640\u0026url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2025%2F07%2FUntitled-design-1-1.jpg\u0026signature=c86ebba0b3a9e019403f69c0b24b4d1e",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-main-content\"\u003e\n                            \u003cp\u003eFive rocket companies will compete for contracts to provide Europe’s next launch services — and boost the continent’s troubled access to space.\u003c/p\u003e\n\u003cp\u003eThe \u003ca href=\"https://thenextweb.com/topic/european-space-agency\" target=\"_blank\" rel=\"noopener\"\u003eEuropean Space Agency\u003c/a\u003e (ESA) selected the quintet, who will now contend for two types of contracts:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProviding launch services for ESA between 2026 and 2030.\u003c/li\u003e\n\u003cli\u003eDemonstrating upgraded launch capabilities, including at least one flight test.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe initiative — named the \u003ca href=\"https://www.esa.int/Enabling_Support/Space_Transportation/European_Launcher_Challenge\" target=\"_blank\" rel=\"nofollow noopener\"\u003eEuropean Launcher Challenge\u003c/a\u003e (ELC) — aims to expand Europe’s pathways into the cosmos. In recent years, these routes have been painfully limited.\u003c/p\u003e\n\u003cp\u003eWhen the Ariane 5 rocket was retired in July 2023, ESA was left with no independent access to \u003ca href=\"https://thenextweb.com/topic/space\" target=\"_blank\" rel=\"noopener\"\u003espace\u003c/a\u003e. The agency instead relied exclusively on SpaceX for its launches, leaving it with no autonomous control over its flight paths. Meanwhile, European taxpayer funds were being funnelled to an American company that competes with domestic businesses.\u003c/p\u003e\n\u003cdiv id=\"hs-embed-tnw\"\u003e\u003cp\u003e\u003cimg src=\"https://s3.eu-west-1.amazonaws.com/tnw.events/hardfork-2018/uploads/visuals/tnw-newsletter.png\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe 💜 of EU tech\u003c/p\u003e\u003cp\u003eThe latest rumblings from the EU tech scene, a story from our wise ol\u0026#39; founder Boris, and some questionable AI art. It\u0026#39;s free, every week, in your inbox. Sign up now!\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eThierry Breton, the EU’s commissioner for the internal market, described the situation as an “unprecedented crisis.”\u003c/p\u003e\n\u003cp\u003eESA finally regained sovereign access to space in July, when the Ariane 6 rocket had \u003ca href=\"https://thenextweb.com/news/esa-ariane-6-launces-restores-european-space-access\" target=\"_blank\" rel=\"noopener\"\u003eits maiden voyage\u003c/a\u003e. The launch provided welcome relief, but the rocket \u003ca href=\"https://thenextweb.com/news/ariane-6-impact-on-european-spacetech-startups\" target=\"_blank\" rel=\"noopener\"\u003efaces severe limitations\u003c/a\u003e. Unlike SpaceX’s Falcon 9, it’s not reusable. It’s also more expensive, less flexible for small-scale launches, and suffers from slower launch rates due to bureaucratic constraints.\u003c/p\u003e\n\u003cp\u003eThe ELC was designed to lower these barriers. There’s also big money on the line — ESA has earmarked up to €169mn per participant.\u003c/p\u003e\n\u003cp\u003eHere are the five contenders for the cash.\u003c/p\u003e\n\u003ch3\u003eIsar Aerospace\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003eFounded: 2018\u003c/strong\u003e\u003cbr/\u003e\n\u003cstrong\u003eHeadquarters: Ottobrunn, Germany\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEurope’s \u003ca href=\"https://www.emersonoxleygroup.com/post/isar-aerospace-europe-s-space-innovator-can-it-rival-spacex\" target=\"_blank\" rel=\"nofollow noopener\"\u003ebest-funded\u003c/a\u003e space tech firm, Isar Aerospace develops rockets for small to medium satellite payloads. A spin-off from the Technical University of Munich\u003cspan\u003e, the\u003c/span\u003e company aims to offer affordable and flexible launch services.\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIn\u003c/span\u003e March, Isar’s Spectrum vehicle had its debut flight — the first vertical orbital rocket launch from Western Europe. Unfortunately,\u003cspan\u003e the \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/orbital-rocket-launches-from-western-europe-for-first-time\" target=\"_blank\" rel=\"noopener\" data-gtm-vis-first-on-screen934287_1021=\"191635\" data-gtm-vis-total-visible-time934287_1021=\"100\" data-gtm-vis-has-fired934287_1021=\"1\"\u003e\u003cspan\u003erocket exploded\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e shortly after takeoff. \u003c/span\u003eIsar nonetheless hailed the launch a “great success.”\u003c/p\u003e\n\u003ch3\u003eMaiaSpace\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003eFounded: 2021\u003c/strong\u003e\u003cbr/\u003e\n\u003cstrong\u003eHeadquarters: Paris, France\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMaiaSpace designs, manufactures, and operates competitive and sustainable solutions for space mobility. A subsidiary of ArianeGroup — the prime contractor for Ariane 6 — the company is developing a reusable, two-stage rocket called Maia.\u003c/p\u003e\n\u003cp\u003eDesigned for vertical takeoff and landing, Maia has been compared to a smaller-scale Falcon 9. Its first launch is planned for 2026.\u003c/p\u003e\n\u003ch3\u003ePLD Space\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003eFounded: 2011\u003c/strong\u003e\u003cbr/\u003e\n\u003cstrong\u003eHeadquarters: Elche, Spain\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePLD Space also focuses on reusability. Its suborbital Miura 1 vehicle completed a successful test flight in 2023, marking Europe’s \u003ca href=\"https://thenextweb.com/news/pld-space-europe-reusable-rocket-launch-spain\" target=\"_blank\" rel=\"noopener\"\u003efirst fully private rocket launch\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003ePLD Space is now building the larger Miura 5, a two-stage reusable orbital launcher for small payloads. Last December, the company secured an \u003ca href=\"https://thenextweb.com/news/spanish-startup-edges-closer-to-europes-first-private-orbital-rocket-launch\" target=\"_blank\" rel=\"noopener\"\u003e€11mn loan\u003c/a\u003e to support its development. The rocket’s inaugural flight is expected to take place in the first quarter of 2026.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" alt=\"pld-space-orbital-rocket-launch-startup\" width=\"1500\" height=\"843\" data-src=\"https://cdn0.tnwcdn.com/wp-content/blogs.dir/1/files/2024/12/pld-space-orbital-rocket-launch-startup.jpg\" src=\"https://cdn0.tnwcdn.com/wp-content/blogs.dir/1/files/2024/12/pld-space-orbital-rocket-launch-startup.jpg\"/\u003e\u003cfigcaption\u003eThe Miura 1 launch took place at the Arenosillo Test Centre (CEDEA) in Huelva, Spain. Credit: PLD Space\u003c/figcaption\u003e\u003c/figure\u003e\n\u003ch3\u003eRocket Factory Augsburg (RFA)\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003eFounded: 2018\u003c/strong\u003e\u003cbr/\u003e\n\u003cstrong\u003eHeadquarters: Augsburg, Germany\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRFA is a spinoff from OHB SE, a German space tech giant. The startup’s flagship rocket is the RFA One, designed for frequent, low-cost missions.\u003c/p\u003e\n\u003cp\u003eThe company also secured access to\u003cspan\u003e \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/how-to-build-saxavord-spaceport-spacetech\" target=\"_blank\" rel=\"noopener\" data-gtm-vis-recent-on-screen934287_1021=\"125304\" data-gtm-vis-first-on-screen934287_1021=\"125304\" data-gtm-vis-total-visible-time934287_1021=\"100\" data-gtm-vis-has-fired934287_1021=\"1\"\u003eSaxaVord Spaceport’s\u003c/a\u003e first launch pad — but the facility hasn’t always been a happy home for RFA. Last year, its rocket \u003ca href=\"https://thenextweb.com/news/watch-rocket-fire-during-saxavord-spaceport-test\" target=\"_blank\" rel=\"noopener\"\u003eexploded during a test\u003c/a\u003e at the site. Undeterred, RFA has continued its mission to build low-cost, high-performance rockets. It’s targeting an inaugural launch later this year.\u003c/p\u003e\n\u003ch3\u003eOrbital Express Launch\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003eFounded: 2021\u003c/strong\u003e\u003cbr/\u003e\n\u003cstrong\u003eHeadquarters: Forres, Scotland\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAlso known as Orbex, Orbital Express Launch is developing a small orbital rocket called Prime. Billed as an environmentally friendly, reusable launcher, the vehicle is slated for a maiden flight in 2026.\u003c/p\u003e\n\u003cp\u003eOrbex is also building a larger rocket, called Proxima. In June, the company’s CEO \u003ca href=\"https://europeanspaceflight.com/orbex-ceo-says-proxima-rocket-will-let-it-compete-on-price-with-spacex/\" target=\"_blank\" rel=\"nofollow noopener\"\u003eclaimed\u003c/a\u003e Proxima would allow Orbex to compete with SpaceX on price — as long as it won a contract with the ELC.\u003c/p\u003e\n\u003cp\u003eThat target is now one step closer to reality. ESA will next discuss the proposals with the five challengers and their respective Member States, before determining which of them will be awarded contracts.\u003c/p\u003e\n                        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-09T15:28:15Z",
  "modifiedTime": "2025-07-09T15:28:15Z"
}
