{
  "id": "2a1e9f22-0f6a-4554-8456-3459f33e14a4",
  "title": "Apple's 'Friday Night Baseball' is back on March 28 with a World Series documentary in tow",
  "link": "https://www.engadget.com/entertainment/streaming/apples-friday-night-baseball-is-back-on-march-28-with-a-world-series-documentary-in-tow-222335747.html?src=rss",
  "description": "Apple's offered Major League Baseball games through the Apple TV app since 2022, and that's continuing in 2025, with new programming at no additional cost. The company announced that \"Friday Night Baseball\" is coming back on March 28, and that its releasing a three-part docuseries on the 2024 World Series and a new Yankees-focused Immersive Video for the Vision Pro. The opening weekend double-header on March 28 features a match between the Baltimore Orioles and Toronto Blue Jays at 6:30 PM ET and the New York Mets and Houston Astros at 7:30 PM ET. Apple says its season coverage will also include a rematch between the New York Yankees and the Los Angeles Dodgers after their World Series face-off in 2024, a game between the Texas Rangers and Astros, and match-ups between the Dodgers and the Philadelphia Phillies and the Dodgers and the Mets. You can view the complete schedule for the first half of the season in Apple's press release. Apple TV+ subscribers will also be able to watch coverage throughout the week on MLB shows like MLB Big Inning or Countdown to First Pitch, along with game recaps and replays of classic games. What's more interesting is the narrative documentary work Apple plans to release this season. The docuseries Fight For Glory: 2024 World Series covers the Dodgers and Yankees journey to last year's World Series and how each team handled their post-season. Meanwhile, the small Venn diagram of Yankees devotees who also happen to be Vision Pro owners will be able to watch VIP: Yankee Stadium, a short film shot in Apple's Immersive Video format that \"gives viewers an all-access pass to one of the world's most iconic sports venues.\" While Apple has reportedly toyed with buying the rights to NFL Prime Ticket in the past, so far the company's sports programming only covers Major League Soccer and Major League Baseball. \"Friday Night Baseball\" launched for free in the Apple TV app in 2022, and was moved behind the Apple TV+ paywall in 2023. That subscription required continues in 2025, though Apple is clearly trying to sweeten the deal with some additional baseball content this season.This article originally appeared on Engadget at https://www.engadget.com/entertainment/streaming/apples-friday-night-baseball-is-back-on-march-28-with-a-world-series-documentary-in-tow-222335747.html?src=rss",
  "author": "Ian Carlos Campbell",
  "published": "Mon, 03 Mar 2025 22:23:36 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Baseball",
    "Major League Baseball",
    "Sports \u0026 Recreation",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Ian Carlos Campbell"
  ],
  "byline": "Ian Carlos Campbell",
  "length": 2128,
  "excerpt": "Apple's streaming MLB games for subscribers on Fridays again, and sweetening the deal with a docuseries and a 3D movie for Vision Pro.",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "Apple's offered Major League Baseball games through the Apple TV app since 2022, and that's continuing in 2025, with new programming at no additional cost. The company announced that \"Friday Night Baseball\" is coming back on March 28, and that its releasing a three-part docuseries on the 2024 World Series and a new Yankees-focused Immersive Video for the Vision Pro.The opening weekend double-header on March 28 features a match between the Baltimore Orioles and Toronto Blue Jays at 6:30 PM ET and the New York Mets and Houston Astros at 7:30 PM ET. Apple says its season coverage will also include a rematch between the New York Yankees and the Los Angeles Dodgers after their World Series face-off in 2024, a game between the Texas Rangers and Astros, and match-ups between the Dodgers and the Philadelphia Phillies and the Dodgers and the Mets. You can view the complete schedule for the first half of the season in Apple's press release.Apple TV+ subscribers will also be able to watch coverage throughout the week on MLB shows like MLB Big Inning or Countdown to First Pitch, along with game recaps and replays of classic games. What's more interesting is the narrative documentary work Apple plans to release this season. The docuseries Fight For Glory: 2024 World Series covers the Dodgers and Yankees journey to last year's World Series and how each team handled their post-season. Meanwhile, the small Venn diagram of Yankees devotees who also happen to be Vision Pro owners will be able to watch VIP: Yankee Stadium, a short film shot in Apple's Immersive Video format that \"gives viewers an all-access pass to one of the world's most iconic sports venues.\"While Apple has reportedly toyed with buying the rights to NFL Prime Ticket in the past, so far the company's sports programming only covers Major League Soccer and Major League Baseball. \"Friday Night Baseball\" launched for free in the Apple TV app in 2022, and was moved behind the Apple TV+ paywall in 2023. That subscription required continues in 2025, though Apple is clearly trying to sweeten the deal with some additional baseball content this season.",
  "image": "https://s.yimg.com/ny/api/res/1.2/2PkRueI54A6OCDBbP3b7.Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-03/2e3e1b30-f87c-11ef-beff-35a8f83250a5",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eApple\u0026#39;s offered Major League Baseball games through the Apple TV app since 2022, and that\u0026#39;s continuing in 2025, with new programming at no additional cost. \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1\" href=\"https://www.apple.com/newsroom/2025/03/friday-night-baseball-returns-to-apple-tv-plus-on-march-28/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:The company announced;elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1;itc:0;sec:content-canvas\"\u003eThe company announced\u003c/a\u003e that \u0026#34;Friday Night Baseball\u0026#34; is coming back on March 28, and that its releasing a three-part docuseries on the 2024 World Series and a new Yankees-focused Immersive Video for \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1\" href=\"https://www.engadget.com/apple-vision-pro-two-months-later-a-telepresence-dream-181550906.html\" data-ylk=\"slk:the Vision Pro;elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1;itc:0;sec:content-canvas\"\u003ethe Vision Pro\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe opening weekend double-header on March 28 features a match between the Baltimore Orioles and Toronto Blue Jays at 6:30 PM ET and the New York Mets and Houston Astros at 7:30 PM ET. Apple says its season coverage will also include a rematch between the New York Yankees and the Los Angeles Dodgers after their World Series face-off in 2024, a game between the Texas Rangers and Astros, and match-ups between the Dodgers and the Philadelphia Phillies and the Dodgers and the Mets. You can view the complete schedule for the first half of the season in \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1\" href=\"https://www.apple.com/newsroom/2025/03/friday-night-baseball-returns-to-apple-tv-plus-on-march-28/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Apple\u0026#39;s press release;elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1;itc:0;sec:content-canvas\"\u003eApple\u0026#39;s press release\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eApple TV+ subscribers will also be able to watch coverage throughout the week on MLB shows like \u003cem\u003eMLB Big Inning \u003c/em\u003eor \u003cem\u003eCountdown to First Pitch\u003c/em\u003e, along with game recaps and replays of classic games. What\u0026#39;s more interesting is the narrative documentary work Apple plans to release this season. The docuseries \u003cem\u003eFight For Glory: 2024 World Series\u003c/em\u003e covers the Dodgers and Yankees journey to last year\u0026#39;s World Series and how each team handled their post-season. Meanwhile, the small Venn diagram of Yankees devotees who also happen to be Vision Pro owners will be able to watch \u003cem\u003eVIP: Yankee Stadium\u003c/em\u003e, a short film shot in Apple\u0026#39;s Immersive Video format that \u0026#34;gives viewers an all-access pass to one of the world\u0026#39;s most iconic sports venues.\u0026#34;\u003c/p\u003e\u003cp\u003eWhile Apple has reportedly toyed with \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1\" href=\"https://www.engadget.com/apple-reportedly-drops-out-of-nfl-sunday-ticket-negotiations-163902095.html\" data-ylk=\"slk:buying the rights to NFL Prime Ticket;elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1;itc:0;sec:content-canvas\"\u003ebuying the rights to NFL Prime Ticket\u003c/a\u003e in the past, so far the company\u0026#39;s sports programming only covers Major League Soccer and Major League Baseball. \u0026#34;Friday Night Baseball\u0026#34; \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:5;pos:1\" href=\"https://www.engadget.com/apple-tv-plus-friday-night-baseball-181930932.html\" data-ylk=\"slk:launched for free;elm:context_link;elmt:doNotAffiliate;cpos:5;pos:1;itc:0;sec:content-canvas\"\u003elaunched for free\u003c/a\u003e in the Apple TV app in 2022, and was \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:6;pos:1\" href=\"https://www.engadget.com/apples-friday-night-baseball-returns-april-7th-but-youll-need-a-subscription-to-watch-171047615.html\" data-ylk=\"slk:moved behind the Apple TV+ paywall;elm:context_link;elmt:doNotAffiliate;cpos:6;pos:1;itc:0;sec:content-canvas\"\u003emoved behind the Apple TV+ paywall\u003c/a\u003e in 2023. That subscription required continues in 2025, though Apple is clearly trying to sweeten the deal with some additional baseball content this season.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-03T22:23:36Z",
  "modifiedTime": null
}
