{
  "id": "30884c88-8dc1-4ea9-9c8e-1edff83137d6",
  "title": "California Grid Ran On 100% Renewables For a Record 98 Days",
  "link": "https://hardware.slashdot.org/story/24/12/31/222226/california-grid-ran-on-100-renewables-for-a-record-98-days?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "An anonymous reader quotes a report from Electrek: A new study published in the journal Renewable Energy (PDF) uses data from the state of California to demonstrate that no blackouts occurred when wind-water-solar electricity supply exceeded 100% of demand on the state's main grid for a record 98 of 116 days from late winter to early summer 2024 for an average (maximum) of 4.84 (10.1) hours per day. Compared to the same period in 2023, solar output in California is up 31%, wind power is up 8%, and batteries are up a staggering 105%. Batteries supplied up to 12% of nighttime demand by storing and redistributing excess solar energy. And here's the kicker: California's high electricity prices aren't because of wind, water, and solar energy. (That issue is primarily caused (PDF) by utilities recovering the cost of wildfire mitigation, transmission and distribution investments, and net energy metering.) In fact, researchers from Stanford, Lawrence Berkeley National Laboratory, and the University of California, Berkeley found that states with higher shares of renewable energy tend to see lower electricity prices. The takeaway -- and the data backs it up -- is that a large grid dominated by wind, water, and solar is not only feasible, it's also reliable. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2025-01-01T00:25:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "power"
  ],
  "byline": "",
  "length": 1269,
  "excerpt": "An anonymous reader quotes a report from Electrek: A new study published in the journal Renewable Energy (PDF) uses data from the state of California to demonstrate that no blackouts occurred when wind-water-solar electricity supply exceeded 100% of demand on the state's main grid for a record 98 of...",
  "siteName": "",
  "favicon": "",
  "text": "An anonymous reader quotes a report from Electrek: A new study published in the journal Renewable Energy (PDF) uses data from the state of California to demonstrate that no blackouts occurred when wind-water-solar electricity supply exceeded 100% of demand on the state's main grid for a record 98 of 116 days from late winter to early summer 2024 for an average (maximum) of 4.84 (10.1) hours per day. Compared to the same period in 2023, solar output in California is up 31%, wind power is up 8%, and batteries are up a staggering 105%. Batteries supplied up to 12% of nighttime demand by storing and redistributing excess solar energy. And here's the kicker: California's high electricity prices aren't because of wind, water, and solar energy. (That issue is primarily caused (PDF) by utilities recovering the cost of wildfire mitigation, transmission and distribution investments, and net energy metering.) In fact, researchers from Stanford, Lawrence Berkeley National Laboratory, and the University of California, Berkeley found that states with higher shares of renewable energy tend to see lower electricity prices. The takeaway -- and the data backs it up -- is that a large grid dominated by wind, water, and solar is not only feasible, it's also reliable.",
  "image": "https://a.fsdn.com/sd/topics/power_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-175809725\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tAn anonymous reader quotes a report from Electrek: \u003ci\u003eA new study \u003ca href=\"https://web.stanford.edu/group/efmh/jacobson/Articles/Others/25-CaliforniaWWS.pdf\"\u003epublished in the journal Renewable Energy\u003c/a\u003e (PDF) uses data from the state of California to demonstrate that no blackouts occurred when wind-water-solar electricity supply \u003ca href=\"https://electrek.co/2024/12/31/california-grid-100-percent-renewables-no-blackouts-cost-rises/\"\u003eexceeded 100% of demand on the state\u0026#39;s main grid for a record 98 of 116 days\u003c/a\u003e from late winter to early summer 2024 for an average (maximum) of 4.84 (10.1) hours per day. Compared to the same period in 2023, solar output in California is up 31%, wind power is up 8%, and batteries are up a staggering 105%. Batteries supplied up to 12% of nighttime demand by storing and redistributing excess solar energy.\n\u003cp\u003e \nAnd here\u0026#39;s the kicker: California\u0026#39;s high electricity prices aren\u0026#39;t because of wind, water, and solar energy. (That \u003ca href=\"https://www.publicadvocates.cpuc.ca.gov/-/media/cal-advocates-website/files/press-room/reports-and-analyses/241205-public-advocates-office-q3-2024-rates-report.pdf\"\u003eissue is primarily caused\u003c/a\u003e (PDF) by utilities recovering the cost of wildfire mitigation, transmission and distribution investments, and net energy metering.) In fact, researchers from Stanford, Lawrence Berkeley National Laboratory, and the University of California, Berkeley found that states with higher shares of renewable energy tend to see lower electricity prices. The takeaway -- and the data backs it up -- is that a large grid dominated by wind, water, and solar is not only feasible, it\u0026#39;s also reliable.\u003c/p\u003e\u003c/i\u003e\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
