{
  "id": "3488549f-6c30-4055-b4d5-977f1f9cde66",
  "title": "Elon Musk Keeps Saying Trump Will Tank the Economy",
  "link": "https://gizmodo.com/elon-musk-keeps-saying-trump-will-tank-the-economy-2000518006",
  "description": "A strange tactic to take a week before an election, to say the least.",
  "author": "Lucas Ropek",
  "published": "Tue, 29 Oct 2024 22:30:44 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Politics",
    "Donald Trump",
    "Elon Musk"
  ],
  "byline": "Lucas Ropek",
  "length": 6591,
  "excerpt": "A strange tactic to take a week before an election, to say the least.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Top economists and assorted financial experts have been sounding the alarm that Donald Trump’s plans for a second presidential administration would spike the federal deficit by trillions of dollars, worsen inflation, and, eventually, send the U.S. economy screaming toward a recession (if not an outright depression). Weirdly enough, it appears that Trump’s top campaign operative, Elon Musk, agrees that the candidate’s policies could do damage to the economy. For the second time in a week, Musk has weirdly implied that Trump will bring economic “hardship” to America, a claim that would be funny if it didn’t seem so likely. The first instance came during a “Telephone Town Hall” hosted on the tech billionaire’s website X, during which Musk said, cryptically: “We have to reduce spending to live within our means. And that necessarily involves some temporary hardship, but it will ensure long-term prosperity.” Musk, who was talking about reducing the national debt when he made the comments, didn’t elaborate on what he was referring to. If that may have spooked some voters, Musk did nothing to assuage their fears when, on Monday, the tech billionaire again seemed to affirm a vision of coming adversity for Americans. Musk did this by replying to a rightwing account on X, the likes of which had written a screed about a coming economic “tumble”: If Trump succeeds in forcing through mass deportations, combined with Elon hacking away at the government, As crazy as it sounds, firing people and reducing the deficit – there will be an initial severe overreaction in the economy – this economy propped up with debt (generating asset bubbles) and artificially suppressed wages (as a result of illegal immigration). Markets will tumble. But when the storm passes and everyone realizes we are on sounder footing, there will be a rapid recovery to a healthier, sustainable economy. History could be made in the coming two years. Musk replied: “sounds about right.” © Gizmodo screenshot Plenty of economists have warned that Trump’s plans could spell disaster for the U.S. economy. His plans to deport millions of illegal immigrants, give huge tax cuts to the wealthiest Americans, weaken the U.S. dollar, and institute global tariffs, have all been referred to as terrible ideas that could drive up the federal deficit, spur inflation, and cause chaos. Trump advisors’ have espoused plans—like making huge cuts to federal spending and firing tens of thousands of government workers—that would surely spur more chaos. That said, it is thoroughly bizarre to see Musk—a key Trump ally—admit this, whilst in the middle of one of the tightest presidential races in modern history. Why would Musk do this? It seems notable that one of Musk’s heroes is the current president of Argentina, Javier Milei, who has been credited with taking a “chainsaw” to the nation’s government. Milei, an avowed “free market,” “anti-woke” libertarian, took office in December of 2023, and has instituted what he calls an “austerity” budget, characterized by economic “shock treatment.” This strategy has involved making deep cuts to government spending on social welfare programs, devaluing the peso, and cutting thousands of government jobs, all in the hope of some vague libertarian glowup in the near to far future. The parallels between Milei’s government and the plans espoused by Trump’s allies are worth considering. While the U.S. and Argentina are two very different countries, the ideology animating Milei’s transformation of his government, and the ideology fueling many of Trump’s advisors is essentially the same. ProPublica recently revealed the espoused goals of powerful Trump advisor, and rightwing libertarian, Russell Vought, who is said to be a key figure in Project 2025, the anti-government effort promulgated by the Heritage Foundation. Vought has similarly said that he wants to drastically reorganize the federal government and put career civil servants “in trauma.” Musk, himself, has advocated for a “Government Efficiency” task force, the likes of which would “audit” public agencies to look for inefficiencies. Like Milei’s strategy, Trump advisors see a leaner, stripped-down bureaucracy as the key to long-term national wealth. That said, Argentina under Milei does not seem to be seeing a whole lot of wealth. In the first six months of his presidency, the nation’s poverty rates spiked by 10 percent and, last year, its inflation rate soared to 211 percent, the highest it had been in 32 years. Rates of homelessness and job loss have been seen to increase. Many Argentinians have been literally “scavenging” dumpsters to survive, Reuters reported in March. Inflation in the country is now slowing, but only after climbing to the highest rate in the world. When Milei took office last December, his comment, much like Musk’s, was: “We know that in the short term the situation will worsen.” Mission accomplished, I guess. For whatever reason, Trump’s supporters view him as a competent and successful businessman and have fond memories of the economy under his presidency. Despite these widely held beliefs, lots of credible economic data suggest that Trump actually inherited a strong economy (the likes of which had been in a period of sustained recovery ever since the 2008 financial crisis) from the outgoing Obama administration and that Trump’s policies actually served to undermine that strong economy, not help it. Ironically, Trump’s economic plans seem designed to harm his voter base—a situation his voters clearly do not understand. For instance, Trump has claimed he wants to end taxes on Social Security. Voters at a rally recently cheered for this proposal, ostensibly because they don’t like taxes. However, Social Security only continues to exist thanks to taxes. Trump’s suggestion is tantamount to a bank telling a small business that it’s going to cut off its line of credit; the business would flounder and die. Ending taxes on SS would starve and ultimately bankrupt the program in a matter of years, leading to tens of millions of Americans being thrown into poverty. Conversely, Harris has announced plans to save the program by raising taxes on the top 1 percent of Americans. The silver lining to all of this is that should Trump win the presidency and should he try to cram through many of his team’s screwball, rightwing economic proposals, he would obviously need the approval of Congress to pass them. It is unlikely that he would receive such approval. That said, the very fact that such harmful policies are being floated is scary enough.",
  "image": "https://gizmodo.com/app/uploads/2024/10/Elon-Musk-speaks-at-Trumps-Madison-Square-Garden-rally.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eTop economists and assorted financial experts have been sounding the alarm that Donald Trump’s plans for a second presidential administration would \u003ca href=\"https://www.cnbc.com/2024/08/27/trump-harris-budget-deficit-economy-election.html\"\u003espike the federal deficit\u003c/a\u003e by trillions of dollars, \u003ca href=\"https://apnews.com/article/trump-inflation-tariffs-taxes-immigration-federal-reserve-a18de763fcc01557258c7f33cab375ed\"\u003eworsen inflation\u003c/a\u003e, and, eventually, send the U.S. economy screaming toward a recession (if not an outright \u003ca href=\"https://www.washingtonpost.com/opinions/2024/10/22/trump-economic-policy-depression-catastrophe/\"\u003edepression\u003c/a\u003e). Weirdly enough, it appears that Trump’s top campaign operative, Elon Musk, agrees that the candidate’s policies could do damage to the economy.\u003c/p\u003e \u003cp\u003eFor the second time in a week, Musk has weirdly implied that Trump will bring economic “hardship” to America, a claim that would be funny if it didn’t seem so likely. The first instance came during a “Telephone Town Hall” hosted on the tech billionaire’s website X, during which \u003ca href=\"https://www.huffpost.com/entry/elon-musk-donald-trump-hardship_n_67211471e4b04165810ad447\"\u003eMusk said, cryptically\u003c/a\u003e: “We have to reduce spending to live within our means. And that necessarily involves some temporary hardship, but it will ensure long-term prosperity.” Musk, who was talking about reducing the national debt when he made the comments, didn’t elaborate on what he was referring to.\u003c/p\u003e \u003cp\u003eIf that may have spooked some voters, Musk did nothing to assuage their fears when, on Monday, the tech billionaire again seemed to affirm a vision of coming adversity for Americans. Musk did this by replying to a rightwing account on X, the likes of which \u003ca href=\"https://x.com/elonmusk/status/1851138625679081732\"\u003ehad written\u003c/a\u003e a screed about a coming economic “tumble”:\u003c/p\u003e\n\n \u003cblockquote\u003e\u003cp\u003e\u003cspan\u003eIf Trump succeeds in forcing through mass deportations, combined with Elon hacking away at the government, As crazy as it sounds, firing people and reducing the deficit – there will be an initial severe overreaction in the economy – this economy propped up with debt (generating asset bubbles) and artificially suppressed wages (as a result of illegal immigration). Markets will tumble. But when the storm passes and everyone realizes we are on sounder footing, there will be a rapid recovery to a healthier, sustainable economy. History could be made in the coming two years.\u003c/span\u003e\u003c/p\u003e\u003c/blockquote\u003e \u003cp\u003eMusk replied: “sounds about right.”\u003c/p\u003e \u003cfigure id=\"attachment_2000518065\" aria-describedby=\"caption-attachment-2000518065\"\u003e\u003cimg decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2024/10/Screenshot-2024-10-29-at-10.28.27 AM.jpg\" alt=\"Screenshot 2024 10 29 At 10.28.27 am\" width=\"1208\" height=\"1110\" srcset=\"https://gizmodo.com/app/uploads/2024/10/Screenshot-2024-10-29-at-10.28.27 AM.jpg 1208w, https://gizmodo.com/app/uploads/2024/10/Screenshot-2024-10-29-at-10.28.27 AM-300x276.jpg 300w, https://gizmodo.com/app/uploads/2024/10/Screenshot-2024-10-29-at-10.28.27 AM-1024x941.jpg 1024w, https://gizmodo.com/app/uploads/2024/10/Screenshot-2024-10-29-at-10.28.27 AM-768x706.jpg 768w, https://gizmodo.com/app/uploads/2024/10/Screenshot-2024-10-29-at-10.28.27 AM-680x625.jpg 680w, https://gizmodo.com/app/uploads/2024/10/Screenshot-2024-10-29-at-10.28.27 AM-896x823.jpg 896w\" sizes=\"(max-width: 1023px) calc(100vw - 2rem), (max-width: 1279px) calc(100vw - 26rem), 680px\"/\u003e\u003cfigcaption id=\"caption-attachment-2000518065\"\u003e© Gizmodo screenshot\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003ePlenty of \u003ca href=\"https://www.reuters.com/world/us/16-nobel-prize-winning-economists-say-trump-policies-will-fuel-inflation-2024-06-25/\"\u003eeconomists have warned\u003c/a\u003e that Trump’s plans could spell disaster for the U.S. economy. His plans to deport millions of illegal immigrants, give huge tax cuts to the wealthiest Americans, \u003ca href=\"https://foreignpolicy.com/2024/07/03/trump-economy-dollar-inflation-election/\"\u003eweaken the U.S. dollar\u003c/a\u003e, and \u003ca href=\"https://www.theatlantic.com/politics/archive/2024/10/trump-tariffs-economic-uncertainty/680427/\"\u003einstitute global tariffs\u003c/a\u003e, have all been referred to as terrible ideas that could drive up the federal deficit, spur inflation, and cause chaos. Trump advisors’ have espoused plans—like making huge cuts to federal spending and firing tens of thousands of government workers—that would surely spur more chaos. That said, it is thoroughly bizarre to see Musk—a key Trump ally—admit this, whilst in the middle of one of the tightest presidential races in modern history.\u003c/p\u003e\n\n \u003cp\u003eWhy would Musk do this? It seems notable that one of Musk’s heroes is the current president of Argentina, Javier Milei, who has been credited with \u003ca href=\"https://apnews.com/article/milei-economy-union-protests-strike-jobs-state-argentina-6b9b41603dcc2b9cbcf23e5654bd4e30\"\u003etaking a “chainsaw” to the nation’s government\u003c/a\u003e. Milei, an avowed “free market,” “anti-woke” libertarian, took office in December of 2023, and has instituted what he calls \u003ca href=\"https://www.youtube.com/watch?v=_7GLsj2Lg6c\"\u003ean “austerity” budget\u003c/a\u003e, characterized by economic “shock treatment.” This strategy has involved making deep cuts to government spending on social welfare programs, devaluing the peso, and cutting thousands of government jobs, all in the hope of some vague libertarian glowup in the near to far future.\u003c/p\u003e \u003cp\u003eThe parallels between Milei’s government and the plans espoused by Trump’s allies are worth considering. While the U.S. and Argentina are two very different countries, the ideology animating Milei’s transformation of his government, and the ideology fueling many of Trump’s advisors is \u003ca href=\"https://www.theguardian.com/commentisfree/2024/jan/06/rishi-sunak-javier-milei-donald-trump-atlas-network\"\u003eessentially the same\u003c/a\u003e. ProPublica \u003ca href=\"https://www.propublica.org/article/video-donald-trump-russ-vought-center-renewing-america-maga\"\u003erecently revealed\u003c/a\u003e the espoused goals of powerful Trump advisor, and \u003ca href=\"https://gizmodo.com/project-2025-author-says-in-leaked-video-that-trump-has-blessed-its-agenda-2000487655\"\u003erightwing libertarian\u003c/a\u003e, Russell Vought, who is said to be a key figure in Project 2025, the anti-government effort promulgated by the Heritage Foundation. Vought has similarly said that he wants to drastically reorganize the federal government and put career civil servants “in trauma.” Musk, himself, has advocated for a “Government Efficiency” task force, the likes of which would “audit” public agencies to look for inefficiencies. Like Milei’s strategy, Trump advisors see a leaner, stripped-down bureaucracy as the key to long-term national wealth.\u003c/p\u003e\n\n \u003cp\u003eThat said, Argentina under Milei does not seem to be seeing a whole lot of wealth. In the first six months of his presidency, the nation’s poverty rates spiked by 10 percent and, last year, its inflation rate soared to 211 percent, the highest it had been in 32 years. Rates of \u003ca href=\"https://www.batimes.com.ar/news/argentina/buenos-aires-because-of-the-crisis-300-more-people-per-month-are-living-rough.phtml\"\u003ehomelessness\u003c/a\u003e and \u003ca href=\"https://www.reuters.com/world/americas/argentina-jobless-rate-jumps-technical-recession-confirmed-2024-06-24/\"\u003ejob loss\u003c/a\u003e have been seen to increase. Many Argentinians \u003ca href=\"https://www.reuters.com/world/americas/argentina-food-prices-soar-more-people-scavenge-survive-2024-03-12/\"\u003ehave been literally “scavenging” dumpsters to survive\u003c/a\u003e, Reuters reported in March. Inflation in the country \u003ca href=\"https://www.reuters.com/world/americas/argentinas-triple-digit-inflation-slows-cash-strapped-workers-struggle-pay-bills-2024-10-10/#:~:text=While%20annualized%20inflation%20in%20September,statistics%20agency%20showed%20on%20Thursday.\"\u003eis now slowing\u003c/a\u003e, but only after climbing to \u003ca href=\"https://www.thetimes.com/world/latin-america/article/brutal-cuts-and-anti-woke-agenda-buoy-argentinas-rockstar-leader-xffqzx58b\"\u003ethe highest rate in the world\u003c/a\u003e. When Milei took office last December, \u003ca href=\"https://www.thetimes.com/world/latin-america/article/brutal-cuts-and-anti-woke-agenda-buoy-argentinas-rockstar-leader-xffqzx58b\"\u003ehis comment\u003c/a\u003e, much like Musk’s, was: “We know that in the short term the situation will worsen.” Mission accomplished, I guess.\u003c/p\u003e \u003cp\u003eFor whatever reason, Trump’s supporters view him as a competent and successful businessman and \u003ca href=\"https://www.reuters.com/world/us/many-us-voters-economy-is-personal-they-blame-democrats-2024-10-28/\"\u003ehave fond memories of the economy under his presidency\u003c/a\u003e. Despite these widely held beliefs, lots of credible economic data suggest that Trump actually inherited a strong economy (the likes of which had been in a period of \u003ca href=\"https://www.npr.org/2018/09/12/646708799/fact-check-who-gets-credit-for-the-booming-u-s-economy\"\u003esustained recovery\u003c/a\u003e ever since the 2008 financial crisis) from the outgoing Obama administration and that Trump’s policies actually \u003ca href=\"https://www.epi.org/blog/the-trump-administration-was-ruining-the-pre-covid-19-19-economy-too-just-more-slowly/\"\u003eserved to undermine that strong economy\u003c/a\u003e, not help it.\u003c/p\u003e\n\n \u003cp\u003eIronically, Trump’s economic plans seem designed to harm his voter base—a situation his voters clearly do not understand. For instance, Trump has claimed he wants to \u003ca href=\"https://www.crfb.org/blogs/donald-trumps-suggestion-end-taxation-social-security-benefits\"\u003eend taxes on Social Security\u003c/a\u003e. Voters at a rally recently \u003ca href=\"https://www.youtube.com/watch?v=XzfNA-UUVLg\"\u003echeered for this proposal\u003c/a\u003e, ostensibly because they don’t like taxes. However, Social Security only continues to \u003cem\u003eexist\u003c/em\u003e thanks to taxes. Trump’s suggestion is tantamount to a bank telling a small business that it’s going to cut off its line of credit; the business would flounder and die. Ending taxes on SS would starve and ultimately \u003ca href=\"https://www.msnbc.com/opinion/msnbc-opinion/trump-harris-social-security-bankruptcy-retirement-taxes-rcna177268\"\u003ebankrupt the program in a matter of years\u003c/a\u003e, leading to tens of millions of Americans being thrown into poverty. Conversely, Harris has \u003ca href=\"https://www.usatoday.com/story/news/politics/elections/2024/10/26/social-security-policies-harris-trump/75484288007/\"\u003eannounced plans\u003c/a\u003e to save the program by raising taxes on the top 1 percent of Americans.\u003c/p\u003e \u003cp\u003eThe silver lining to all of this is that should Trump win the presidency and should he try to cram through many of his team’s screwball, rightwing economic proposals, he would obviously need the approval of Congress to pass them. It is unlikely that he would receive such approval. That said, the very fact that such harmful policies are being floated is scary enough.\u003c/p\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-29T22:30:44Z",
  "modifiedTime": "2024-10-29T22:42:54Z"
}
