{
  "id": "3683b422-b480-4b10-b3d9-fdd45a66e99e",
  "title": "The Rings of Power‘s Cast Teases What’s in Store for Gandalf and Sauron in Season 3",
  "link": "https://gizmodo.com/the-rings-of-powers-cast-teases-whats-in-store-for-gandalf-and-sauron-in-season-3-2000600000",
  "description": "Amazon's Lord of the Rings prequel series is currently in production on its next installment.",
  "author": "Sabina Graves",
  "published": "Fri, 09 May 2025 00:20:18 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Television",
    "Charlie Vickers",
    "Daniel Weyman",
    "Lord of the Rings",
    "Prime",
    "Rings of Power"
  ],
  "byline": "Sabina Graves",
  "length": 1954,
  "excerpt": "Amazon's Lord of the Rings prequel series is currently in production on its next installment.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "After it was revealed that the Stranger was Gandalf at the end of season two of Prime Video’s The Rings of Power, fans of the Tolkien universe origin series have anticipated the handling of how the hero will rise. There’s also the matter of what Sauron will do as he gathers his own power. In a conversation with Deadline, Daniel Weyman (Gandalf) and Charlie Vickers (Sauron) discussed how this next season is important character building for the legends they’ll later become. For Gandalf, Weyman teased that it involves a lot of “tears” and continued, “I’m excited for this plethora of possible pitfalls, errors, and failings that young Gandalf can learn from. Literally anything could happen, because the only way we’re going to see a wise being later on is if he does some pretty horrendous accidental things, and puts his foot in the wrong places, and has to pick it up and learn again. So I’m hoping for lots of that kind of action just so that we can see him develop and learn how he gets to be the wizard that we all love.” Vickers jumped in describing how Sauron might not take it lightly that he was rejected by Galadriel, but is ready to go at his quest for power alone. “I’m incredibly lucky that Sauron in this time period is very specific to what he does. We get to go through so many exciting beats that I think fans will be really excited to see. I mean, he has made nearly all the rings now, but there’s one more that he [needs] to finish the collection, which he’s determined and has had in his mind for centuries. So, I’m super excited to see him go on the journey and hopefully take over Middle-earth… I’m sure everything will be great for everyone else.” Rings of Power Season one and two are currently streaming on Prime. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/05/Rings-of-Power-Gandalf-and-Sauron-Prime.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eAfter it was revealed that the Stranger was \u003ca href=\"https://gizmodo.com/lord-of-the-rings-new-movies-gollum-gandalf-ian-mckellan-2000493963\"\u003eGandalf\u003c/a\u003e at the end of season two of Prime Video’s \u003cem\u003e\u003ca href=\"https://gizmodo.com/rings-of-power-season-2-finale-recap-sauron-galadriel-gandalf-narsil-2000506957\"\u003eThe Rings of Power\u003c/a\u003e, \u003c/em\u003efans of the \u003ca href=\"https://gizmodo.com/rings-of-power-durins-door-explained-lord-of-the-rings-moria-2000498742\"\u003eTolkien universe\u003c/a\u003e origin series have anticipated the handling of how the hero will rise. There’s also the matter of what Sauron will do as he gathers his own power.\u003c/p\u003e \u003cp\u003eIn a conversation with \u003ca href=\"https://deadline.com/2025/05/rings-the-rings-of-power-cast-interview-1236381183/\"\u003eDeadline\u003c/a\u003e, Daniel Weyman (Gandalf) and Charlie Vickers (Sauron) discussed how this next season is important character building for the legends they’ll later become. For Gandalf, Weyman teased that it involves a lot of “tears” and continued, “I’m excited for this plethora of possible pitfalls, errors, and failings that young Gandalf can learn from. Literally anything could happen, because the only way we’re going to see a wise being later on is if he does some pretty horrendous accidental things, and puts his foot in the wrong places, and has to pick it up and learn again. So I’m hoping for lots of that kind of action just so that we can see him develop and learn how he gets to be the wizard that we all love.”\u003c/p\u003e \u003cp\u003eVickers jumped in describing how Sauron might not take it lightly that he was rejected by Galadriel, but is ready to go at his quest for power alone. “I’m incredibly lucky that Sauron in this time period is very specific to what he does. We get to go through so many exciting beats that I think fans will be really excited to see. I mean, he has made nearly all the rings now, but there’s one more that he [needs] to finish the collection, which he’s determined and has had in his mind for centuries. So, I’m super excited to see him go on the journey and hopefully take over Middle-earth… I’m sure everything will be great for everyone else.”\u003c/p\u003e \u003cp\u003e\u003cem\u003eRings of Power\u003c/em\u003e Season one and two are currently streaming on Prime.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-09T00:20:18Z",
  "modifiedTime": "2025-05-09T00:20:18Z"
}
