{
  "id": "37a2ea77-febe-4adc-a154-cd8dd5827791",
  "title": "Colorado Agency 'Improperly' Posted Passwords for Its Election System Online",
  "link": "https://yro.slashdot.org/story/24/10/30/2339250/colorado-agency-improperly-posted-passwords-for-its-election-system-online?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "For months, the Colorado Department of State inadvertently exposed partial passwords for voting machines in a public spreadsheet. \"While the incident is embarrassing and already fueling accusations from the state's Republican party, the department said in a statement that it 'does not pose an immediate security threat to Colorado's elections, nor will it impact how ballots are counted,'\" reports Gizmodo. From the report: Colorado NBC affiliate station 9NEWS reported that Hope Scheppelman, vice chair of the state's Republican party, revealed the error in a mass email sent Tuesday morning, which included an affidavit from a person who claimed to have downloaded the spreadsheet and discovered the passwords by clicking a button to reveal hidden tabs. In its statement, the Department of State said that there are two unique passwords for each of its voting machines, which are stored in separate places. Additionally, the passwords can only be used by a person who is physically operating the system and voting machines are stored in secure areas that require ID badges to access and are under 24/7 video surveillance. \"The Department took immediate action as soon as it was aware of this, and informed the Cybersecurity and Infrastructure Security Agency, which closely monitors and protects the [country's] essential security infrastructure,\" The department said, adding that it is \"working to remedy this situation where necessary.\" Colorado voters use paper ballots, ensuring that a physical paper trail that can be used to verify results tabulated electronically. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2024-10-31T00:10:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "privacy"
  ],
  "byline": "",
  "length": 1579,
  "excerpt": "For months, the Colorado Department of State inadvertently exposed partial passwords for voting machines in a public spreadsheet. \"While the incident is embarrassing and already fueling accusations from the state's Republican party, the department said in a statement that it 'does not pose an immedi...",
  "siteName": "",
  "favicon": "",
  "text": "For months, the Colorado Department of State inadvertently exposed partial passwords for voting machines in a public spreadsheet. \"While the incident is embarrassing and already fueling accusations from the state's Republican party, the department said in a statement that it 'does not pose an immediate security threat to Colorado's elections, nor will it impact how ballots are counted,'\" reports Gizmodo. From the report: Colorado NBC affiliate station 9NEWS reported that Hope Scheppelman, vice chair of the state's Republican party, revealed the error in a mass email sent Tuesday morning, which included an affidavit from a person who claimed to have downloaded the spreadsheet and discovered the passwords by clicking a button to reveal hidden tabs. In its statement, the Department of State said that there are two unique passwords for each of its voting machines, which are stored in separate places. Additionally, the passwords can only be used by a person who is physically operating the system and voting machines are stored in secure areas that require ID badges to access and are under 24/7 video surveillance. \"The Department took immediate action as soon as it was aware of this, and informed the Cybersecurity and Infrastructure Security Agency, which closely monitors and protects the [country's] essential security infrastructure,\" The department said, adding that it is \"working to remedy this situation where necessary.\" Colorado voters use paper ballots, ensuring that a physical paper trail that can be used to verify results tabulated electronically.",
  "image": "https://a.fsdn.com/sd/topics/privacy_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-175363997\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tFor months, the Colorado Department of State \u003ca href=\"https://gizmodo.com/colorado-agency-improperly-posted-passwords-for-its-election-system-online-2000518572\"\u003einadvertently exposed partial passwords for voting machines in a public spreadsheet\u003c/a\u003e. \u0026#34;While the incident is embarrassing and already fueling accusations from the state\u0026#39;s Republican party, the department said in \u003ca href=\"https://www.coloradosos.gov/pubs/newsRoom/pressReleases/2024/PR20241029Passwords.html\"\u003ea statement\u003c/a\u003e that it \u0026#39;does not pose an immediate security threat to Colorado\u0026#39;s elections, nor will it impact how ballots are counted,\u0026#39;\u0026#34; reports Gizmodo. From the report: \u003ci\u003e Colorado NBC affiliate station 9NEWS \u003ca href=\"https://www.9news.com/article/news/politics/elections/colorado-secretary-of-state-posted-voting-system-passwords/73-c9264216-7a0a-4d5b-9f64-60a28eb57e4d\"\u003ereported\u003c/a\u003e that Hope Scheppelman, vice chair of the state\u0026#39;s Republican party, revealed the error in a mass email sent Tuesday morning, which included an affidavit from a person who claimed to have downloaded the spreadsheet and discovered the passwords by clicking a button to reveal hidden tabs.\n\u003cp\u003e \nIn its statement, the Department of State said that there are two unique passwords for each of its voting machines, which are stored in separate places. Additionally, the passwords can only be used by a person who is physically operating the system and voting machines are stored in secure areas that require ID badges to access and are under 24/7 video surveillance.\n\u003c/p\u003e\u003cp\u003e \n\u0026#34;The Department took immediate action as soon as it was aware of this, and informed the Cybersecurity and Infrastructure Security Agency, which closely monitors and protects the [country\u0026#39;s] essential security infrastructure,\u0026#34; The department said, adding that it is \u0026#34;working to remedy this situation where necessary.\u0026#34; Colorado voters use paper ballots, ensuring that a physical paper trail that can be used to verify results tabulated electronically. \u003c/p\u003e\u003c/i\u003e\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
