{
  "id": "46dc1abc-a62e-4f97-86fd-5172b1ed75d5",
  "title": "NCI employees can’t publish information on these topics without special approval",
  "link": "https://arstechnica.com/science/2025/03/nci-employees-cant-publish-information-on-these-topics-without-special-approval/",
  "description": "Communications involving “controversial, high profile, or sensitive” topics will get extra scrutiny.",
  "author": "Annie Waldman and Lisa Song, ProPublica",
  "published": "Mon, 10 Mar 2025 23:07:33 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Health",
    "Science",
    "Department of Health and Human Services",
    "National Cancer Institute",
    "rfk jr",
    "syndication",
    "trump administration"
  ],
  "byline": "ProPublica",
  "length": 2415,
  "excerpt": "Communications involving “controversial, high profile, or sensitive” topics will get extra scrutiny.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "The list is “an unusual mix of words that are tied to activities that this administration has been at war with—like equity, but also words that they purport to be in favor of doing something about, like ultraprocessed food,” Tracey Woodruff, director of the Program on Reproductive Health and the Environment at the University of California, San Francisco, said in an email. The guidance states that staffers “do not need to share content describing the routine conduct of science if it will not get major media attention, is not controversial or sensitive, and does not touch on an administration priority.” A longtime senior employee at the institute said that the directive was circulated by the institute’s communications team, and the content was not discussed at the leadership level. It is not clear in which exact office the directive originated. The NCI, NIH and HHS did not respond to ProPublica’s emailed questions. (The existence of the list was first revealed in social media posts on Friday.) Health and research experts told ProPublica they feared the chilling effect of the new guidance. Not only might it lead to a lengthier and more complex clearance process, it may also cause researchers to censor their work out of fear or deference to the administration’s priorities. “This is real interference in the scientific process,” said Linda Birnbaum, a former director of the National Institute of Environmental Health Sciences who served as a federal scientist for four decades. The list, she said, “just seems like Big Brother intimidation.” During the first two months of Donald Trump’s second presidency, his administration has slashed funding for research institutions and stalled the NIH’s grant application process. Kennedy has suggested that hundreds of NIH staffers should be fired and said that the institute should deprioritize infectious diseases like COVID-19 and shift its focus to chronic diseases, such as diabetes and obesity. Obesity is on the NCI’s new list, as are infectious diseases including COVID-19, bird flu and measles. The “focus on bird flu and covid is concerning,” Woodruff wrote, because “not being transparent with the public about infectious diseases will not stop them or make them go away and could make them worse.” ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big Story newsletter to receive stories like this one in your inbox.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/03/GettyImages-2201503706-1536x1024.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n          \n          \n\u003cp\u003eThe list is “an unusual mix of words that are tied to activities that this administration has been at war with—like equity, but also words that they purport to be in favor of doing something about, like ultraprocessed food,” Tracey Woodruff, director of the Program on Reproductive Health and the Environment at the University of California, San Francisco, said in an email.\u003c/p\u003e\n\u003cp\u003eThe guidance states that staffers “do not need to share content describing the routine conduct of science if it will not get major media attention, is not controversial or sensitive, and does not touch on an administration priority.”\u003c/p\u003e\n\u003cp\u003eA longtime senior employee at the institute said that the directive was circulated by the institute’s communications team, and the content was not discussed at the leadership level. It is not clear in which exact office the directive originated. The NCI, NIH and HHS did not respond to ProPublica’s emailed questions. (The existence of the list was first revealed in social media posts on Friday.)\u003c/p\u003e\n\u003cp\u003eHealth and research experts told ProPublica they feared the chilling effect of the new guidance. Not only might it lead to a lengthier and more complex clearance process, it may also cause researchers to censor their work out of fear or deference to the administration’s priorities.\u003c/p\u003e\n\u003cp\u003e“This is real interference in the scientific process,” said Linda Birnbaum, a former director of the National Institute of Environmental Health Sciences who served as a federal scientist for four decades. The list, she said, “just seems like Big Brother intimidation.”\u003c/p\u003e\n\u003cp\u003eDuring the first two months of Donald Trump’s second presidency, his administration has \u003ca href=\"https://www.nytimes.com/interactive/2025/02/13/upshot/nih-trump-funding-cuts.html\"\u003eslashed funding\u003c/a\u003e for research institutions and \u003ca href=\"https://www.npr.org/sections/shots-health-news/2025/02/26/g-s1-50920/trump-nih-funding-freeze-medical-research\"\u003estalled the NIH’s grant application process\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eKennedy has suggested that \u003ca href=\"https://www.insidehighered.com/news/government/science-research-policy/2024/11/15/what-robert-f-kennedy-jr-has-said-about-nih\"\u003ehundreds of NIH staffers\u003c/a\u003e should be fired and said that the institute should deprioritize infectious diseases like COVID-19 and \u003ca href=\"https://www.nbcnews.com/health/health-news/rfk-jr-says-government-ignores-chronic-disease-misguided-rcna190042\"\u003eshift its focus\u003c/a\u003e to chronic diseases, such as diabetes and obesity.\u003c/p\u003e\n\u003cp\u003eObesity is on the NCI’s new list, as are infectious diseases including COVID-19, bird flu and measles.\u003c/p\u003e\n\u003cp\u003eThe “focus on bird flu and covid is concerning,” Woodruff wrote, because “not being transparent with the public about infectious diseases will not stop them or make them go away and could make them worse.”\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for \u003ca href=\"https://www.propublica.org/newsletters/the-big-story?source=reprint\u0026amp;placement=top-note\"\u003eThe Big Story newsletter\u003c/a\u003e to receive stories like this one in your inbox\u003c/em\u003e.\u003c/p\u003e\n\n\n\n          \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-10T23:07:33Z",
  "modifiedTime": "2025-03-10T23:08:09Z"
}
