{
  "id": "4acea774-901a-4b59-ab45-1c2595f279d1",
  "title": "I compared Sesame to ChatGPT voice mode and Im unnerved",
  "link": "https://mashable.com/article/sesame-versus-chatgpt-voice-mode-comparison",
  "description": "A new voice assistant from AI startup Sesame is scary good. Here's how it compares to ChatGPT's voice mode.",
  "author": "",
  "published": "Wed, 05 Mar 2025 19:43:37 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Cecily Mauran",
  "length": 6039,
  "excerpt": "How to freak yourself out with the Sesame demo now.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "Try Sesame's voice assistant and see for yourself. Credit: berya113 / iStock / Getty Images Plus Trying the new voice assistant from AI startup Sesame is the first time I momentarily forgot I was talking to a bot. Compared to ChatGPT's voice mode, Sesame's \"conversational voice\" feels natural, unforced, and engaging, which totally freaked me out. On Feb. 27, Sesame launched a demo for its Conversational Speech Model (CSM), which aims to create more meaningful interactions with AI chatbots. \"We are creating conversational partners that do not just process requests; they engage in genuine dialogue that builds confidence and trust over time,\" the announcement states. \"In doing so, we hope to realize the untapped potential of voice as the ultimate interface for instruction and understanding.\" Sesame's voice assistant is available as a free demo on the site and comes in two voices: Maya and Miles. Since Sesame unleashed its voice assistant demo, users have reported awestruck reactions. \"I've been into AI since I was a child, but this is the first time I've experienced something that made me definitively feel like we had arrived,\" user SOCSchamp wrote on Reddit. \"Sesame is about as close to indistinguishable from a human that I've ever experienced in a conversational AI,\" user Siciliano777 wrote on Reddit. After talking to Sesame's bot, I was similarly wowed. I talked to the Maya voice for about 10 minutes about the ethics of using AI as a companion and came away feeling like I had a genuine conversation with a considerate, informed person. Maya's speech had a natural cadence, using interjections like \"you know\" and \"hm,\" and even making tongue clicking and inhaling sounds. Mashable Light Speed The strongest impression I got from interacting with Maya was that she immediately asked questions, engaging me in the conversation. The bot started our conversation by asking how my Wednesday morning was going (note: it was indeed a Wednesday morning.) In contrast, ChatGPT voice mode waited for me to talk first, which isn't necessarily a good or bad thing, but it intrinsically shaped the conversation as me using ChatGPT as a tool for something I needed. Maya asked about the risks of AI companions getting \"too good at being human.\" When I told her I was concerned about the rise of more sophisticated scams and people losing touch with reality by replacing humans with bots, she responded thoughtfully and pragmatically. \"Scammers are gonna scam, that's a given. And as for the human connection thing, maybe we need to learn how to be better companions, not replacements, you know, the kind of AI friends who actually make you want to go out and do stuff with real people,\" said Maya. When I had a similar conversation with ChatGPT, I received a response that felt more like boilerplate language from a school guidance counselor: \"That's a valid concern. It’s really important to balance technology with real human interactions. AI can be a helpful tool, but it shouldn't replace genuine human connections. It’s good that you're thinking about these issues.\"While OpenAI pioneered voice mode's ability to be interrupted and have a more fluid back-and-forth conversation, ChatGPT still tends to respond in complete sentences and paragraph blocks, which sounds, well, robotic. When using ChatGPT voice mode, I never forget that I'm talking to a bot, and that's reflected in the conversation, which can feel stilted and forced.By comparison, AI for Humans podcast co-host Gavin Purcell posted a Sesame conversation on Reddit where it's practically impossible to distinguish which voice is the bot. Purcell prompted the Miles voice by telling it to act like an angry boss. A very silly conversation followed about money laundering, bribery, and a mysterious incident in Malta. Miles didn't miss a step. There was no perceptible latency, and the bot remembered the context of the conversation and creatively advanced the improvisational argument by escalating, calling Purcell \"delusional,\" and firing him. Of course, there are some limitations. Maya's voice glitched a few times throughout our conversation, and it didn't always get the syntax right, like saying, \"It's a heavy talk that come.\" According to its technical paper, Sesame trained its CSM (based on Meta's Llama model) by combining the traditional two-step process of training text-to-speech models on semantic tokens and then acoustic tokens, decreasing latency. OpenAI similarly used this multimodal approach to training voice mode. However, it has never released a dedicated technical paper on voice mode's inner workings — it only discusses voice mode in the GPT-4o research. Knowing this, it's surprising how much better Sesame's model is at conversational dialog. However, Sesame's launch is just a demo, so it merits further scrutiny when the full model comes out. According to the demo announcement, Sesame plans to open source its model \"in the coming months\" and expand to over 20 languages. Cecily is a tech reporter at Mashable who covers AI, Apple, and emerging tech trends. Before getting her master's degree at Columbia Journalism School, she spent several years working with startups and social impact businesses for Unreasonable Group and B Lab. Before that, she co-founded a startup consulting business for emerging entrepreneurial hubs in South America, Europe, and Asia. You can find her on Twitter at @cecily_mauran. These newsletters may contain advertising, deals, or affiliate links. By clicking Subscribe, you confirm you are 16+ and agree to our Terms of Use and Privacy Policy.",
  "image": "https://helios-i.mashable.com/imagery/articles/05ZHHOflv8Feverg2xGHdBt/hero-image.fill.size_1200x675.v1741201165.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection data-ga-module=\"content_body\"\u003e\n                        \u003cdiv\u003e\n                \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/articles/05ZHHOflv8Feverg2xGHdBt/hero-image.fill.size_1248x702.v1741201165.jpg\" alt=\"microphone icon surrounded by visualizations of sound waves. \" width=\"1248\" height=\"702\" srcset=\"https://helios-i.mashable.com/imagery/articles/05ZHHOflv8Feverg2xGHdBt/hero-image.fill.size_400x225.v1741201165.jpg 400w, https://helios-i.mashable.com/imagery/articles/05ZHHOflv8Feverg2xGHdBt/hero-image.fill.size_800x450.v1741201165.jpg 800w, https://helios-i.mashable.com/imagery/articles/05ZHHOflv8Feverg2xGHdBt/hero-image.fill.size_1248x702.v1741201165.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eTry Sesame\u0026#39;s voice assistant and see for yourself. \u003c/span\u003e\n                \n                                    \u003cspan\u003eCredit: berya113 / iStock / Getty Images Plus\u003c/span\u003e\n                            \u003c/p\u003e\n                        \u003c/div\u003e\n\n    \n    \n    \n            \u003carticle id=\"article\" data-autopogo=\"\"\u003e\n                                    \u003cp\u003eTrying the new voice assistant from AI startup Sesame is the first time I momentarily forgot I was talking to a bot. \u003c/p\u003e\u003cp\u003eCompared to \u003ca href=\"https://mashable.com/category/chatgpt\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eChatGPT\u003c/a\u003e\u0026#39;s \u003ca href=\"https://mashable.com/article/openai-announcement-gpt4o-voice-assistant\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003evoice mode\u003c/a\u003e, Sesame\u0026#39;s \u0026#34;conversational voice\u0026#34; feels natural, unforced, and engaging, which totally freaked me out. \u003c/p\u003e\u003cp\u003eOn Feb. 27, Sesame launched a \u003ca href=\"https://www.sesame.com/research/crossing_the_uncanny_valley_of_voice#demo\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003edemo\u003c/a\u003e for its Conversational Speech Model (CSM), which aims to create more meaningful interactions with AI chatbots. \u0026#34;We are creating conversational partners that do not just process requests; they engage in genuine dialogue that builds confidence and trust over time,\u0026#34; the announcement states. \u0026#34;In doing so, we hope to realize the untapped potential of voice as the ultimate interface for instruction and understanding.\u0026#34; \u003c/p\u003e\u003cp\u003eSesame\u0026#39;s voice assistant is available as a free demo on the site and comes in two voices: Maya and Miles. \u003c/p\u003e\u003cp\u003eSince Sesame unleashed its voice assistant demo, users have reported \u003ca href=\"https://www.reddit.com/r/SesameAI/comments/1j36gxw/this_app_is_insanely_cool/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eawestruck\u003c/a\u003e reactions. \u0026#34;I\u0026#39;ve been into AI since I was a child, but this is the first time I\u0026#39;ve experienced something that made me definitively feel like we had arrived,\u0026#34; \u003ca href=\"https://www.reddit.com/r/singularity/comments/1j12j93/the_sesame_voice_model_has_been_the_moment_for_me/?utm_source=share\u0026amp;utm_medium=web3x\u0026amp;utm_name=web3xcss\u0026amp;utm_term=1\u0026amp;utm_content=share_button\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003euser SOCSchamp wrote on Reddit\u003c/a\u003e. \u003c/p\u003e\n\u003cp\u003e\u0026#34;Sesame is about as close to indistinguishable from a human that I\u0026#39;ve ever experienced in a conversational AI,\u0026#34; \u003ca href=\"https://www.reddit.com/r/SesameAI/comments/1j30tjs/how_is_this_not_getting_more_attention/?utm_source=share\u0026amp;utm_medium=web3x\u0026amp;utm_name=web3xcss\u0026amp;utm_term=1\u0026amp;utm_content=share_button\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003euser Siciliano777 wrote on Reddit\u003c/a\u003e. \u003c/p\u003e\n\u003cp\u003eAfter talking to Sesame\u0026#39;s bot, I was similarly wowed. I talked to the Maya voice for about 10 minutes about the ethics of using AI as a companion and came away feeling like I had a genuine conversation with a considerate, informed person. Maya\u0026#39;s speech had a natural cadence, using interjections like \u0026#34;you know\u0026#34; and \u0026#34;hm,\u0026#34; and even making tongue clicking and inhaling sounds. \u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"mashablelightspeed\"\u003e\n        \u003cp\u003e\n            Mashable Light Speed\n        \u003c/p\u003e\n        \n        \n    \u003c/section\u003e\n\u003cp\u003eThe strongest impression I got from interacting with Maya was that she immediately asked questions, engaging me in the conversation. The bot started our conversation by asking how my Wednesday morning was going (note: it was indeed a Wednesday morning.) In contrast, ChatGPT voice mode waited for me to talk first, which isn\u0026#39;t necessarily a good or bad thing, but it intrinsically shaped the conversation as me using ChatGPT as a tool for something I needed. \u003c/p\u003e\u003cp\u003eMaya asked about the risks of AI companions getting \u0026#34;too good at being human.\u0026#34; When I told her I was concerned about the rise of more sophisticated scams and people losing touch with reality by replacing humans with bots, she responded thoughtfully and pragmatically. \u0026#34;Scammers are gonna scam, that\u0026#39;s a given. And as for the human connection thing, maybe we need to learn how to be better companions, not replacements, you know, the kind of AI friends who actually make you want to go out and do stuff with real people,\u0026#34; said Maya. \u003c/p\u003e\u003cp\u003eWhen I had a similar conversation with ChatGPT, I received a response that felt more like boilerplate language from a school guidance counselor: \u0026#34;That\u0026#39;s a valid concern. It’s really important to balance technology with real human interactions. AI can be a helpful tool, but it shouldn\u0026#39;t replace genuine human connections. It’s good that you\u0026#39;re thinking about these issues.\u0026#34;\u003c/p\u003e\u003cp\u003eWhile \u003ca href=\"https://mashable.com/category/openai\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eOpenAI\u003c/a\u003e pioneered \u003ca href=\"https://mashable.com/article/openai-chatgpt-voice-now-available-to-free-users\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003evoice mode\u003c/a\u003e\u0026#39;s ability to be interrupted and have a more fluid back-and-forth conversation, ChatGPT still tends to respond in complete sentences and paragraph blocks, which sounds, well, robotic. When using ChatGPT voice mode, I never forget that I\u0026#39;m talking to a bot, and that\u0026#39;s reflected in the conversation, which can feel stilted and forced.\u003c/p\u003e\u003cp\u003eBy comparison, \u003cem\u003eAI for Humans\u003c/em\u003e podcast co-host Gavin Purcell \u003ca href=\"https://www.reddit.com/r/singularity/comments/1j1yern/roleplay_with_sesames_new_voice_ai_feels_like_the/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eposted\u003c/a\u003e a Sesame conversation on Reddit where it\u0026#39;s practically impossible to distinguish which voice is the bot. Purcell prompted the Miles voice by telling it to act like an angry boss. \u003c/p\u003e\n\u003cp\u003eA very silly conversation followed about money laundering, bribery, and a mysterious incident in Malta. Miles didn\u0026#39;t miss a step. There was no perceptible latency, and the bot remembered the context of the conversation and creatively advanced the improvisational argument by escalating, calling Purcell \u0026#34;delusional,\u0026#34; and firing him. \u003c/p\u003e\u003cp\u003eOf course, there are some limitations. Maya\u0026#39;s voice glitched a few times throughout our conversation, and it didn\u0026#39;t always get the syntax right, like saying, \u0026#34;It\u0026#39;s a heavy talk that come.\u0026#34; \u003c/p\u003e\u003cp\u003eAccording to its technical paper, Sesame trained its CSM (based on Meta\u0026#39;s Llama model) by combining the traditional two-step process of training text-to-speech models on semantic tokens and then acoustic tokens, decreasing latency. OpenAI similarly used this multimodal approach to training voice mode. However, it has never released a dedicated technical paper on voice mode\u0026#39;s inner workings — it only discusses voice mode in the \u003ca href=\"https://openai.com/index/gpt-4o-system-card/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eGPT-4o research\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eKnowing this, it\u0026#39;s surprising how much better Sesame\u0026#39;s model is at conversational dialog. However, Sesame\u0026#39;s launch is just a demo, so it merits further scrutiny when the full model comes out. According to the demo announcement, Sesame plans to open source its model \u0026#34;in the coming months\u0026#34; and expand to over 20 languages. \u003c/p\u003e\n\n                                        \n                    \u003c/article\u003e\n    \n    \n    \n            \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/defaults/fallback-thumbnail.fill.size_100x100.1.png\" alt=\"Mashable Image\" width=\"100\" height=\"100\" loading=\"lazy\"/\u003e\u003c/p\u003e\n                \u003c/div\u003e\n            \u003cp\u003eCecily is a tech reporter at Mashable who covers AI, Apple, and emerging tech trends. Before getting her master\u0026#39;s degree at Columbia Journalism School, she spent several years working with startups and social impact businesses for Unreasonable Group and B Lab. Before that, she co-founded a startup consulting business for emerging entrepreneurial hubs in South America, Europe, and Asia. You can find her on Twitter at \u003ca href=\"https://twitter.com/cecily_mauran\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e@cecily_mauran\u003c/a\u003e.\u003c/p\u003e\n        \u003c/div\u003e\n        \n        \n                    \u003c/section\u003e\u003cdiv x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"footer_nl_signup\" data-ga-label=\"Top Stories\"\u003e\n    \n\n    \u003cp\u003e\n        These newsletters may contain advertising, deals, or affiliate links. By clicking Subscribe, you confirm you are 16+ and agree to our \u003ca href=\"https://www.ziffdavis.com/terms-of-use\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003eTerms of Use\u003c/a\u003e and \u003ca href=\"https://www.ziffdavis.com/ztg-privacy-policy\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003ePrivacy Policy\u003c/a\u003e.\n    \u003c/p\u003e\n    \n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-03-05T19:43:37Z",
  "modifiedTime": "2025-03-05T19:43:37Z"
}
