{
  "id": "52067efe-2a87-4b18-bc0f-97920e3e3fd3",
  "title": "Massive Expansion of Italy's Piracy Shield Underway",
  "link": "https://yro.slashdot.org/story/25/04/03/2257221/massive-expansion-of-italys-piracy-shield-underway?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "An anonymous reader quotes a report from Techdirt: Walled Culture has been following closely Italy's poorly designed Piracy Shield system. Back in December we reported how copyright companies used their access to the Piracy Shield system to order Italian Internet service providers (ISPs) to block access to all of Google Drive for the entire country, and how malicious actors could similarly use that unchecked power to shut down critical national infrastructure. Since then, the Computer \u0026 Communications Industry Association (CCIA), an international, not-for-profit association representing computer, communications, and Internet industry firms, has added its voice to the chorus of disapproval. In a letter (PDF) to the European Commission, it warned about the dangers of the Piracy Shield system to the EU economy [...]. It also raised an important new issue: the fact that Italy brought in this extreme legislation without notifying the European Commission under the so-called \"TRIS\" procedure, which allows others to comment on possible problems [...]. As well as Italy's failure to notify the Commission about its new legislation in advance, the CCIA believes that: this anti-piracy mechanism is in breach of several other EU laws. That includes the Open Internet Regulation which prohibits ISPs to block or slow internet traffic unless required by a legal order. The block subsequent to the Piracy Shield also contradicts the Digital Services Act (DSA) in several aspects, notably Article 9 requiring certain elements to be included in the orders to act against illegal content. More broadly, the Piracy Shield is not aligned with the Charter of Fundamental Rights nor the Treaty on the Functioning of the EU -- as it hinders freedom of expression, freedom to provide internet services, the principle of proportionality, and the right to an effective remedy and a fair trial. Far from taking these criticisms to heart, or acknowledging that Piracy Shield has failed to convert people to paying subscribers, the Italian government has decided to double down, and to make Piracy Shield even worse. Massimiliano Capitanio, Commissioner at AGCOM, the Italian Authority for Communications Guarantees, explained on LinkedIn how Piracy Shield was being extended in far-reaching ways (translation by Google Translate, original in Italian). [...] That is, Piracy Shield will apply to live content far beyond sports events, its original justification, and to streaming services. Even DNS and VPN providers will be required to block sites, a serious technical interference in the way the Internet operates, and a threat to people's privacy. Search engines, too, will be forced to de-index material. The only minor concession to ISPs is to unblock domain names and IP addresses that are no longer allegedly being used to disseminate unauthorized material. There are, of course, no concessions to ordinary Internet users affected by Piracy Shield blunders. In the future, Italy's Piracy Shield will add: - 30-minute blackout orders not only for pirate sports events, but also for other live content; - the extension of blackout orders to VPNs and public DNS providers; - the obligation for search engines to de-index pirate sites; - the procedures for unblocking domain names and IP addresses obscured by Piracy Shield that are no longer used to spread pirate content; - the new procedure to combat piracy on the #linear and \"on demand\" television, for example to protect the #film and #serietv. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2025-04-04T01:00:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "piracy"
  ],
  "byline": "",
  "length": 3496,
  "excerpt": "An anonymous reader quotes a report from Techdirt: Walled Culture has been following closely Italy's poorly designed Piracy Shield system. Back in December we reported how copyright companies used their access to the Piracy Shield system to order Italian Internet service providers (ISPs) to block ac...",
  "siteName": "",
  "favicon": "",
  "text": "An anonymous reader quotes a report from Techdirt: Walled Culture has been following closely Italy's poorly designed Piracy Shield system. Back in December we reported how copyright companies used their access to the Piracy Shield system to order Italian Internet service providers (ISPs) to block access to all of Google Drive for the entire country, and how malicious actors could similarly use that unchecked power to shut down critical national infrastructure. Since then, the Computer \u0026 Communications Industry Association (CCIA), an international, not-for-profit association representing computer, communications, and Internet industry firms, has added its voice to the chorus of disapproval. In a letter (PDF) to the European Commission, it warned about the dangers of the Piracy Shield system to the EU economy [...]. It also raised an important new issue: the fact that Italy brought in this extreme legislation without notifying the European Commission under the so-called \"TRIS\" procedure, which allows others to comment on possible problems [...]. As well as Italy's failure to notify the Commission about its new legislation in advance, the CCIA believes that: this anti-piracy mechanism is in breach of several other EU laws. That includes the Open Internet Regulation which prohibits ISPs to block or slow internet traffic unless required by a legal order. The block subsequent to the Piracy Shield also contradicts the Digital Services Act (DSA) in several aspects, notably Article 9 requiring certain elements to be included in the orders to act against illegal content. More broadly, the Piracy Shield is not aligned with the Charter of Fundamental Rights nor the Treaty on the Functioning of the EU -- as it hinders freedom of expression, freedom to provide internet services, the principle of proportionality, and the right to an effective remedy and a fair trial. Far from taking these criticisms to heart, or acknowledging that Piracy Shield has failed to convert people to paying subscribers, the Italian government has decided to double down, and to make Piracy Shield even worse. Massimiliano Capitanio, Commissioner at AGCOM, the Italian Authority for Communications Guarantees, explained on LinkedIn how Piracy Shield was being extended in far-reaching ways (translation by Google Translate, original in Italian). [...] That is, Piracy Shield will apply to live content far beyond sports events, its original justification, and to streaming services. Even DNS and VPN providers will be required to block sites, a serious technical interference in the way the Internet operates, and a threat to people's privacy. Search engines, too, will be forced to de-index material. The only minor concession to ISPs is to unblock domain names and IP addresses that are no longer allegedly being used to disseminate unauthorized material. There are, of course, no concessions to ordinary Internet users affected by Piracy Shield blunders. In the future, Italy's Piracy Shield will add: - 30-minute blackout orders not only for pirate sports events, but also for other live content; - the extension of blackout orders to VPNs and public DNS providers; - the obligation for search engines to de-index pirate sites; - the procedures for unblocking domain names and IP addresses obscured by Piracy Shield that are no longer used to spread pirate content; - the new procedure to combat piracy on the #linear and \"on demand\" television, for example to protect the #film and #serietv.",
  "image": "https://a.fsdn.com/sd/topics/piracy_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-176918127\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tAn anonymous reader quotes a report from Techdirt: \u003ci\u003eWalled Culture has been following closely Italy\u0026#39;s poorly designed Piracy Shield system. Back in December we reported how copyright companies used their access to the Piracy Shield system to order Italian Internet service providers (ISPs) to block access to all of Google Drive for the entire country, and how malicious actors could similarly use that unchecked power to \u003ca href=\"https://walledculture.org/why-italys-piracy-shield-risks-moving-from-tiresome-digital-farce-to-serious-national-tragedy/\"\u003eshut down critical national infrastructure\u003c/a\u003e. Since then, the Computer \u0026amp; Communications Industry Association (CCIA), an international, not-for-profit association representing computer, communications, and Internet industry firms, has added its voice to the chorus of disapproval. In \u003ca href=\"https://ccianet.org/wp-content/uploads/2025/01/Italian-Piracy-Shield-and-Copyright-Law-Amendments-.pdf\"\u003ea letter\u003c/a\u003e (PDF) to the European Commission, it warned about the dangers of the Piracy Shield system to the EU economy [...]. It also raised an important new issue: the fact that Italy brought in this extreme legislation without notifying the European Commission under the so-called \u0026#34;\u003ca href=\"https://technical-regulation-information-system.ec.europa.eu/en/home\"\u003eTRIS\u003c/a\u003e\u0026#34; procedure, which allows others to comment on possible problems [...].\n\u003cp\u003e \nAs well as Italy\u0026#39;s failure to notify the Commission about its new legislation in advance, the CCIA believes that: this anti-piracy mechanism is in breach of several other EU laws. That includes the Open Internet Regulation which prohibits ISPs to block or slow internet traffic unless required by a legal order. The block subsequent to the Piracy Shield also contradicts the Digital Services Act (DSA) in several aspects, notably Article 9 requiring certain elements to be included in the orders to act against illegal content. More broadly, the Piracy Shield is not aligned with the Charter of Fundamental Rights nor the Treaty on the Functioning of the EU -- as it hinders freedom of expression, freedom to provide internet services, the principle of proportionality, and the right to an effective remedy and a fair trial.\n\u003c/p\u003e\u003cp\u003e \nFar from taking these criticisms to heart, or acknowledging that Piracy Shield has \u003ca href=\"https://torrentfreak.com/piracy-shield-fails-to-convert-pirates-to-paying-subscribers-data-suggest-250119/\"\u003efailed to convert people to paying subscribers\u003c/a\u003e, the Italian government has \u003ca href=\"https://www.techdirt.com/2025/04/03/massive-expansion-of-italys-piracy-shield-underway-despite-growing-criticism-of-its-flaws/\"\u003edecided to double down, and to make Piracy Shield even worse\u003c/a\u003e. Massimiliano Capitanio, Commissioner at AGCOM, the Italian Authority for Communications Guarantees, explained on LinkedIn how Piracy Shield was being extended in far-reaching ways (translation by Google Translate, \u003ca href=\"https://www.linkedin.com/posts/massimiliano-capitanio-6b5ab321_pirateria-calcio-agcom-activity-7297696359191633920-D9uo/\"\u003eoriginal in Italian\u003c/a\u003e). [...] That is, Piracy Shield will apply to live content far beyond sports events, its original justification, and to streaming services. Even DNS and VPN providers will be required to block sites, a serious technical interference in the way the Internet operates, and a threat to people\u0026#39;s privacy. Search engines, too, will be forced to de-index material. The only minor concession to ISPs is to unblock domain names and IP addresses that are no longer allegedly being used to disseminate unauthorized material. There are, of course, no concessions to ordinary Internet users affected by Piracy Shield blunders.\u003c/p\u003e\u003c/i\u003e In the future, Italy\u0026#39;s Piracy Shield will add: \u003cbr/\u003e\n- 30-minute blackout orders not only for pirate sports events, but also for other live content;\u003cbr/\u003e\n- the extension of blackout orders to VPNs and public DNS providers;\u003cbr/\u003e\n- the obligation for search engines to de-index pirate sites;\u003cbr/\u003e\n- the procedures for unblocking domain names and IP addresses obscured by Piracy Shield that are no longer used to spread pirate content;\u003cbr/\u003e\n- the new procedure to combat piracy on the #linear and \u0026#34;on demand\u0026#34; television, for example to protect the #film and #serietv.\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
