{
  "id": "5632a99e-314f-41ae-b876-4d8203ac4bfe",
  "title": "Dave Bautista’s Next Franchise Play? Becoming a ‘Cat Assassin’",
  "link": "https://gizmodo.com/dave-bautistas-next-franchise-play-becoming-a-cat-assassin-2000615810",
  "description": "He's been aliens, assassins, and androids, now Dave Bautista is helping bring the upcoming 'Cat Assassin' to games and television.",
  "author": "Justin Carter",
  "published": "Sat, 14 Jun 2025 18:50:22 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Games",
    "cat assassin",
    "Dave Bautista"
  ],
  "byline": "Justin Carter",
  "length": 1878,
  "excerpt": "He's been aliens, assassins, and androids, now Dave Bautista is helping bring the upcoming 'Cat Assassin' to games and television.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "After hanging up his daggers as Drax the Destroyer and getting got as Glossu Rabban in Dune: Part Two, Dave Bautista is stepping into video games and animation with a new franchise by the name of Cat Assassin. The wrestler-actor and his production company Dogbone Entertainment will bring to life a new idea from Steve Lerner, who wrote 2022’s feline adventure game Stray. This would-be franchise will comprise a stealth-action video game—influenced by titles such as Assassin’s Creed, Splinter Cell, and Sifu—from developer Titan1Studios (Love is a Roguelike, The Events at Unity Farm) and a “neo-noir adult animated series.” Cat Assassin focuses on Hugh, an expert killer “caught between various cartels and power brokers in a dark and twisted city.” Bautista’s part of the enterprise’s “creative vision,” but at the moment, it’s unclear if that also means he’ll lend his voice to Hugh in either animated or video game form. (His current voice work includes the upcoming Army of the Dead animated series and playing himself in WWE games since 2003.) Titan1 has several TV and game projects in the works, so at the moment, there’s no real window on when to expect Cat Assassin. Still, in a statement on Titan1’s website Bautista called teaming with the company “a pleasure … Their ability to build worlds through animation has been so impressive and they’ve created a truly unique world in this game that I can’t wait to share with players.” While the game is seemingly expected for release in October 2027 for PC and several consoles, including the Nintendo Switch 2, Titan1 said more details on the overall franchise’s future is expected “in the coming months.” Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/06/cat-assassin-1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eAfter hanging up his daggers as \u003ca href=\"https://gizmodo.com/drax-guardians-of-the-galaxy-3-dave-bautista-james-gunn-1849954484\"\u003eDrax the Destroyer\u003c/a\u003e and \u003ca href=\"https://gizmodo.com/dave-bautista-dune-2-character-wwe-marvel-drax-scifi-1851287353\"\u003egetting got\u003c/a\u003e as Glossu Rabban in \u003cem\u003eDune: Part Two, \u003c/em\u003eDave Bautista is stepping into video games and animation with a new franchise by the name of \u003cem\u003eCat Assassin\u003c/em\u003e.\u003c/p\u003e \u003cp\u003eThe wrestler-actor and his production company Dogbone Entertainment will bring to life a new idea from Steve Lerner, who wrote 2022’s feline adventure game \u003cem\u003eStray\u003c/em\u003e. This would-be franchise will comprise a stealth-action video game—influenced by titles such as \u003cem\u003eAssassin’s Creed, Splinter Cell, \u003c/em\u003eand \u003cem\u003eSifu\u003c/em\u003e—from developer \u003ca href=\"https://www.cat-assassin.com/post/titan1studios-love-is-a-roguelite-or-liar-for-short-wins-best-pitch-at-migs\"\u003eTitan1Studios\u003c/a\u003e (\u003cem\u003eLove is a Roguelike, The Events at Unity Farm\u003c/em\u003e) and a “neo-noir adult animated series.”\u003c/p\u003e \u003cp\u003e\u003cem\u003eCat Assassin \u003c/em\u003efocuses on Hugh, an expert killer “caught between various cartels and power brokers in a dark and twisted city.” Bautista’s part of the enterprise’s “creative vision,” but at the moment, it’s unclear if that also means he’ll lend his voice to Hugh in either animated or video game form. (His current voice work includes the upcoming \u003cem\u003eArmy of the Dead \u003c/em\u003eanimated series and playing himself in \u003cem\u003eWWE \u003c/em\u003egames since 2003.)\u003c/p\u003e \u003cp\u003eTitan1 has several TV and game projects in the works, so at the moment, there’s no real window on when to expect \u003cem\u003eCat Assassin\u003c/em\u003e. Still, in a statement on \u003ca href=\"https://www.cat-assassin.com/post/titan1studios-love-is-a-roguelite-or-liar-for-short-wins-best-pitch-at-migs\"\u003eTitan1’s website\u003c/a\u003e Bautista called teaming with the company “a pleasure … Their ability to build worlds through animation has been so impressive and they’ve created a truly unique world in this game that I can’t wait to share with players.”\u003c/p\u003e\n\n \u003cp\u003eWhile the game is seemingly expected for release in \u003ca href=\"https://www.cat-assassin.com/\"\u003eOctober 2027\u003c/a\u003e for PC and several consoles, including the Nintendo Switch 2, Titan1 said more details on the overall franchise’s future is expected “in the coming months.”\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-14T18:50:22Z",
  "modifiedTime": "2025-06-14T18:50:22Z"
}
