{
  "id": "57cfa2cd-f919-4712-ac79-44a4ec852ced",
  "title": "Hawk Tuah Coin: Why celebrity-backed crypto is a dangerous investment",
  "link": "https://mashable.com/article/celebrity-crypto-memecoins-dangerous-investment-scam",
  "description": "Here's a quick reminder after the launch of Hawk Tuah girl Hailey Welch's crypto: Memecoins are a dangerous investment.",
  "author": "",
  "published": "Fri, 06 Dec 2024 00:12:59 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Matt Binder",
  "length": 5971,
  "excerpt": "Hailey Welch joins a long list of famous (and infamous) people who pushed ruinous memecoin offerings.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "Hailey Welch joins a long list of famous (and infamous) people who pushed ruinous memecoin offerings. Here's a quick reminder after the launch of Hawk Tuah girl Hailey Welch's crypto: Memecoins are a dangerous investment. Credit: Michael Tullberg/Getty Images Bitcoin has just hit $100,000.Buoyed by Donald Trump's reelection and the promise of a pro-cryptocurrency administration, crypto investors are going all in on the digital currency. With the price of Bitcoin rising high, cryptocurrency is seemingly seeping back into the public consciousness after the crypto crashes of 2022.And, it appears the memecoin fad is having a resurgence right now too. On the same day Bitcoin hit its new six-figure record high, the viral \"Hawk Tuah\" girl Hailey Welch launched her own cryptocurrency token $HAWK. Upon launch, $HAWK jumped to a market cap of $500 million. Within minutes, the token crashed. Its current market cap is around $36 million. Hawk Tuah fans quickly took to social media to share how they lost thousands of dollars.Things are starting to look a lot like 2021 all over again. During the last crypto rush of 2021, some celebrities and online influencers quickly saw that there was money to be made. Some musicians, reality TV stars, and e-sports names endorsed altcoins or even went ahead and made their own branded memecoins.Cryptocurrency is a risky investment to begin with. Crypto tokens are a highly volatile speculative asset. There is currently very little governmental oversight or regulation when it comes to the crypto market. Even Bitcoin, seen as the most \"safe\" bet in the crypto world, has had major ebbs and flows. If you have to sell during one of the down periods, you might lose a chunk of change. Mashable Light Speed Furthermore, now anyone can create a crypto token. Over the past few years, there have been platforms that have helped make the process very easy. Dogecoin, easily the most popular memecoin, set a standard of success that no other memecoin has been able to replicate.Yet, the allure of making easy money and getting rich quick through crypto tokens and memecoins have drawn in lots of money from people. Back in 2021, memecoins created by celebrities and influencers were all the rage. As Mashable reported then, many turned out to be a scam.Rug pulls are quite common with memecoins, especially those created by influencers and celebrities. Here's what often happens: A famous or notable individual launches a memecoin. Their fans are encouraged to purchase to support their favorite creator while also making money for themselves. However, before the memecoin is officially launched, the memecoin creator puts aside a certain amount of tokens for themselves or their friends. They either give these out freely or provide an unadvertised pre-launch sale at well below the price that the token will go for at launch. When the token does go on sale, the public buys, pushing the value of the memecoin up. But, as soon as that happens, those who received coins at pre-launch dump their holdings for profit, plummeting its value and eventually crashing the memecoin. The celebrity or influencer's fans are often then left holding the bag, their money tied up in a now-worthless token that they will never be able to sell. It may seem obvious that one should not accept financial advice from celebrities. Way back in 2018, the Securities and Exchange Commission issued a stark warning about the speculative machinations of public figures. \"Investors should be skeptical of investment advice posted to social media platforms, and should not make decisions based on celebrity endorsements,\" Enforcement Division Co-Director Steven Peikin wrote in the same statement announcing Floyd Mayweather Jr. and DJ Khaled were charged with illegally touting initial coin offerings. \"Social media influencers are often paid promoters, not investment professionals, and the securities they’re touting, regardless of whether they are issued using traditional certificates or on the blockchain, could be frauds.\"However, in an age or parasocial relationships, many fans feel like they can trust their favorite influencers. There's a feeling that \"they wouldn't scam me.\" But, time and time again, celebrity memecoins have failed, with insiders making money off of the influencer's fans. Tweet may have been deleted Take the aforementioned and recently launched $HAWK. In a X Spaces stream, YouTuber Coffeezilla who investigates cryptocurrency scams, confronts Welch and the developers behind her crypto token about how things played out after the launch. Its a tale we've heard before. The vast majority of the tokens were held by just a few crypto wallets before the public launch. After it launched, according to Coffeezilla, those insiders dumped the token. $HAWK's value plummeted and all of those buyers who got in at launch are left with a significant financial loss.There is no recourse for those memecoin buyers. There are no refunds, no way for them to get their money back. Most memecoins have zero utility, so there's no use case for the tokens either. The only way they're getting back what they put in is if Welch and her team can somehow convince another group of suckers to put their money into this worthless token.Hopefully, after reading this, you won't be one of those suckers. This newsletter may contain advertising, deals, or affiliate links. Subscribing to a newsletter indicates your consent to our Terms of Use and Privacy Policy. You may unsubscribe from the newsletters at any time.",
  "image": "https://helios-i.mashable.com/imagery/articles/02Qo89Ygw3elf4y4aAwpe0q/hero-image.fill.size_1200x675.v1733435518.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n        \n\n        \n    \u003cp\u003eHailey Welch joins a long list of famous (and infamous) people who pushed ruinous memecoin offerings.\u003c/p\u003e\n    \n\n    \n\u003c/div\u003e\u003csection data-ga-module=\"content_body\"\u003e\n                        \u003cdiv\u003e\n                \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/articles/02Qo89Ygw3elf4y4aAwpe0q/hero-image.fill.size_1248x702.v1733435518.jpg\" alt=\"Hailey Welch\" width=\"1248\" height=\"702\" srcset=\"https://helios-i.mashable.com/imagery/articles/02Qo89Ygw3elf4y4aAwpe0q/hero-image.fill.size_400x225.v1733435518.jpg 400w, https://helios-i.mashable.com/imagery/articles/02Qo89Ygw3elf4y4aAwpe0q/hero-image.fill.size_800x450.v1733435518.jpg 800w, https://helios-i.mashable.com/imagery/articles/02Qo89Ygw3elf4y4aAwpe0q/hero-image.fill.size_1248x702.v1733435518.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHere\u0026#39;s a quick reminder after the launch of Hawk Tuah girl Hailey Welch\u0026#39;s crypto: Memecoins are a dangerous investment. \u003c/span\u003e\n                \n                                    \u003cspan\u003eCredit: Michael Tullberg/Getty Images\u003c/span\u003e\n                            \u003c/p\u003e\n                        \u003c/div\u003e\n\n    \n    \n    \n            \u003carticle id=\"article\" data-autopogo=\"\"\u003e\n                                    \u003cp\u003eBitcoin has just hit \u003ca href=\"https://mashable.com/article/bitcoin-hits-100k\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003e$100,000\u003c/u\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eBuoyed by Donald Trump\u0026#39;s reelection and the promise of a pro-cryptocurrency administration, crypto investors are going all in on the digital currency. With the price of Bitcoin rising high, cryptocurrency is seemingly seeping back into the public consciousness after the crypto \u003ca href=\"https://mashable.com/article/ust-luna-what-is-happening\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003ecrashes\u003c/u\u003e\u003c/a\u003e of \u003ca href=\"https://mashable.com/article/crypto-crashing-why\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003e2022\u003c/u\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAnd, it appears the memecoin fad is having a resurgence right now too. On the same day Bitcoin hit its new six-figure record high, the viral \u0026#34;Hawk Tuah\u0026#34; girl Hailey Welch \u003ca href=\"https://mashable.com/article/hailey-welch-hawk-memecoin-launch\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003elaunched\u003c/u\u003e\u003c/a\u003e her own cryptocurrency token \u003ca href=\"https://mashable.com/article/hailey-welch-hawk-memecoin-launch\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003e$HAWK\u003c/u\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eUpon launch, $HAWK jumped to a market cap of $500 million. Within minutes, the \u003ca href=\"https://mashable.com/article/hailey-welch-hawk-memecoin-launch\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003etoken crashed\u003c/a\u003e. Its current market cap is around $36 million. Hawk Tuah fans quickly took to social media to share how they lost thousands of dollars.\u003c/p\u003e\u003cp\u003eThings are starting to look a lot like 2021 all over again. \u003c/p\u003e\u003cp\u003eDuring the \u003ca href=\"https://mashable.com/article/influencers-altcoin-scams\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003elast crypto rush of 2021\u003c/u\u003e\u003c/a\u003e, some celebrities and online influencers quickly saw that there was money to be made. Some musicians, reality TV stars, and e-sports names endorsed altcoins or even went ahead and made their own branded memecoins.\u003c/p\u003e\u003cp\u003eCryptocurrency is a risky investment to begin with. Crypto tokens are a highly volatile speculative asset. There is currently very little governmental oversight or regulation when it comes to the crypto market. Even Bitcoin, seen as the most \u0026#34;safe\u0026#34; bet in the crypto world, has had major ebbs and flows. If you have to sell during one of the down periods, you might lose a chunk of change.\u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"mashablelightspeed\"\u003e\n        \u003cp\u003e\n            Mashable Light Speed\n        \u003c/p\u003e\n        \n        \n    \u003c/section\u003e\n\u003cp\u003eFurthermore, now anyone can create a crypto token. Over the past few years, there have been platforms that have helped make the process very easy. Dogecoin, easily the most popular memecoin, set a standard of success that no other memecoin has been able to replicate.\u003c/p\u003e\u003cp\u003eYet, the allure of making easy money and getting rich quick through crypto tokens and memecoins have drawn in lots of money from people. \u003c/p\u003e\u003cp\u003eBack in 2021, memecoins created by celebrities and influencers were all the rage. As Mashable \u003ca href=\"https://mashable.com/article/influencers-altcoin-scams\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003ereported then\u003c/u\u003e\u003c/a\u003e, many turned out to be a \u003ca href=\"https://mashable.com/article/influencer-cryptocurrency-giveaways\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003escam\u003c/u\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eRug pulls are quite common with memecoins, especially those created by influencers and celebrities. \u003c/p\u003e\u003cp\u003eHere\u0026#39;s what often happens: A famous or notable individual launches a memecoin. Their fans are encouraged to purchase to support their favorite creator while also making money for themselves. However, before the memecoin is officially launched, the memecoin creator puts aside a certain amount of tokens for themselves or their friends. They either give these out freely or provide an unadvertised pre-launch sale at well below the price that the token will go for at launch. When the token does go on sale, the public buys, pushing the value of the memecoin up. But, as soon as that happens, those who received coins at pre-launch dump their holdings for profit, plummeting its value and eventually crashing the memecoin. The celebrity or influencer\u0026#39;s fans are often then left holding the bag, their money tied up in a now-worthless token that they will never be able to sell.\u003c/p\u003e\n\u003cp\u003eIt may seem obvious that one should not accept financial advice from celebrities. Way back in 2018, the Securities and Exchange Commission issued a stark warning about the speculative machinations of public figures. \u0026#34;Investors should be skeptical of investment advice posted to social media platforms, and should not make decisions based on celebrity endorsements,\u0026#34; Enforcement Division Co-Director Steven Peikin wrote in the same \u003ca href=\"https://www.sec.gov/newsroom/press-releases/2018-268\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003estatement announcing Floyd Mayweather Jr. and DJ Khaled were charged\u003c/a\u003e with illegally touting initial coin offerings. \u0026#34;Social media influencers are often paid promoters, not investment professionals, and the securities they’re touting, regardless of whether they are issued using traditional certificates or on the blockchain, could be frauds.\u0026#34;\u003c/p\u003e\u003cp\u003eHowever, in an age or parasocial relationships, many fans feel like they can trust their favorite influencers. There\u0026#39;s a feeling that \u0026#34;they wouldn\u0026#39;t scam me.\u0026#34; But, time and time again, \u003ca href=\"https://www.sec.gov/newsroom/press-releases/2018-268\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003ecelebrity memecoins have failed\u003c/a\u003e, with insiders making money off of the influencer\u0026#39;s fans.\u003c/p\u003e\u003cblockquote\u003e\n    \u003ca href=\"https://twitter.com/DramaAlert/status/1864585278469390809\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003e\n        Tweet may have been deleted\n    \u003c/a\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eTake the aforementioned and recently launched $HAWK. In a \u003ca href=\"https://x.com/DramaAlert/status/1864585278469390809\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eX Spaces stream\u003c/u\u003e\u003c/a\u003e, YouTuber Coffeezilla who investigates cryptocurrency scams, confronts Welch and the developers behind her crypto token about how things played out after the launch. Its a tale we\u0026#39;ve heard before. The vast majority of the tokens were held by just a few crypto wallets before the public launch. After it launched, according to Coffeezilla, those insiders dumped the token. $HAWK\u0026#39;s value plummeted and all of those buyers who got in at launch are left with a significant financial loss.\u003c/p\u003e\u003cp\u003eThere is no recourse for those memecoin buyers. There are no refunds, no way for them to get their money back. Most memecoins have zero utility, so there\u0026#39;s no use case for the tokens either. The only way they\u0026#39;re getting back what they put in is if Welch and her team can somehow convince another group of suckers to put their money into this worthless token.\u003c/p\u003e\u003cp\u003eHopefully, after reading this, you won\u0026#39;t be one of those suckers.\u003c/p\u003e\n\n                                        \n                    \u003c/article\u003e\n    \n    \n    \n        \n        \n                    \u003c/section\u003e\u003cdiv x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"footer_nl_signup\" data-ga-label=\"Top Stories\"\u003e\n    \n\n    \u003cp\u003e\n        This newsletter may contain advertising, deals, or affiliate links. Subscribing to a newsletter indicates your consent to our \u003ca href=\"https://www.ziffdavis.com/terms-of-use\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003eTerms of Use\u003c/a\u003e and \u003ca href=\"https://www.ziffdavis.com/ztg-privacy-policy\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003ePrivacy Policy\u003c/a\u003e. You may unsubscribe from the newsletters at any time.\n    \u003c/p\u003e\n    \n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-06T00:12:59Z",
  "modifiedTime": "2024-12-06T00:42:11Z"
}
