{
  "id": "60d32634-8c93-4b3b-8007-f20af560d702",
  "title": "Modern-Day Oracles or Bullshit Machines? How to thrive in a ChatGPT world",
  "link": "https://thebullshitmachines.com",
  "description": "Comments",
  "author": "",
  "published": "Sun, 09 Feb 2025 08:24:17 +0000",
  "source": "https://news.ycombinator.com/rss",
  "categories": null,
  "byline": "",
  "length": 2612,
  "excerpt": "How to thrive in a ChatGPT world",
  "siteName": "",
  "favicon": "",
  "text": "MODERN-DAY ORACLES or BULLSHIT MACHINES? How to thrive in a ChatGPT world Developed by Carl T. Bergstrom and Jevin D. West Technologists and publicists gush about how Large Language Models (LLMs) will revolutionize the way we work, learn, play, communicate, create, and connect to another. They are right that artificial intelligence (AI) will affect nearly every aspect of our daily lives. And they are right that by providing a way for people to talk with machines in ordinary language, LLMs constitute a dramatic step forward in making computing accessible to everyone. Yet for all the good that AI systems will do, they will also saturate our information environment with bullshit at a scale we’ve never before encountered. I think it's going to be the most transformative technology humanity has ever created, potentially on par with or exceeding the invention of the printing press, electricity, and the internet. For better or for worse, LLMs are here to stay. We all read content that they produce online, most of us interact with LLM chatbots, and many of us use them to produce content of our own. In a series of five- to ten-minute lessons, we will explain what these machines are, how they work, and how to thrive in a world where they are everywhere. You will learn when these systems can save you a lot of time and effort. You will learn when they are likely to steer you wrong. And you will discover how to see through the hype to tell the difference. ? Notice of Rights. The materials provided on this website are freely accessible for personal self-study and for non-commercial educational use in K-12 schools, colleges, and universities. For any commercial or corporate use, please contact the authors to discuss terms and obtain the necessary permissions. Redistribution of website content is prohibited without prior written consent from the authors. However, individual copies may be created to accommodate accessibility needs directly related to educational instruction. Unless otherwise stated, all content is copyrighted © 2025 by the authors. All rights reserved.",
  "image": "https://thebullshitmachines.com/assets/Dr4vf9U1GM/intro-horizontal-title-social-cover.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"article\" role=\"main\"\u003e\n      \u003cheader id=\"section-Title-2kXZCkIeDI\" data-effects=\"eyJ0ZXh0UGVyTGluZSI6ZmFsc2UsInRleHRGYWRlIjoibm9uZSIsImhhc0VmZmVjdHMiOmZhbHNlLCJuZWVkc0JhY2tncm91bmRDbG9uZSI6ZmFsc2UsImVuY29kZWQiOiIifQ==\"\u003e\n        \n        \n      \u003c/header\u003e\n      \u003cdiv data-scrollymoly-basis=\"true\" data-testid=\"ENG-5457\" id=\"section-EqRDrghv5N\" data-effects=\"eyJ0ZXh0UGVyTGluZSI6ZmFsc2UsInRleHRGYWRlIjoiYm90aCIsInRleHRCbHVyIjoiYm90aCIsImJhY2tncm91bmRCbHVyIjoiYm90aCIsImJhY2tncm91bmRHcmF5c2NhbGUiOiJvdXQiLCJoYXNFZmZlY3RzIjp0cnVlLCJuZWVkc0JhY2tncm91bmRDbG9uZSI6dHJ1ZSwiZW5jb2RlZCI6IiJ9\"\u003e\n                  \u003ch2\u003e\u003cspan\u003eMODERN-DAY \u003c/span\u003e\u003cspan\u003eORACLES  \u003c/span\u003e\u003cbr/\u003e\u003cspan\u003eor \u003c/span\u003e\u003cspan\u003eBULLSHIT\u003c/span\u003e\u003cspan\u003e\u003cstrong\u003e \u003c/strong\u003eMACHINES?\u003c/span\u003e\u003c/h2\u003e\n                  \u003cp\u003e\u003cspan\u003eHow to thrive in a ChatGPT world  \u003c/span\u003e\u003c/p\u003e\n                  \n                  \u003ch4\u003e\u003cspan\u003eDeveloped by Carl T. Bergstrom and Jevin D. West\u003c/span\u003e\u003c/h4\u003e\n                \u003c/div\u003e\n      \n      \n      \u003cdiv id=\"section-Effects-on-life-gXGw9X23fi\" data-effects=\"eyJ0ZXh0UGVyTGluZSI6ZmFsc2UsImhhc0VmZmVjdHMiOmZhbHNlLCJuZWVkc0JhY2tncm91bmRDbG9uZSI6ZmFsc2UsImVuY29kZWQiOiIifQ==\"\u003e\n              \u003cdiv\u003e\n                    \u003cp\u003eTechnologists and publicists gush about how Large Language Models (LLMs) will revolutionize the way we work, learn, play, communicate, create, and connect to another. \u003c/p\u003e\n                    \u003cp\u003eThey are right that artificial intelligence (AI) will affect nearly every aspect of our daily lives. \u003c/p\u003e\n                    \u003cp\u003eAnd they are right that by providing a way for people to talk with machines in ordinary language, LLMs constitute a dramatic step forward in making computing accessible to everyone. \u003c/p\u003e\n                    \u003cp\u003eYet for all the good that AI systems will do, they will also saturate our information environment with bullshit at a scale we’ve never before encountered.\u003c/p\u003e\n                    \n                  \u003c/div\u003e\n              \u003cdiv\u003e\n                      \u003cblockquote\u003e\u003cspan\u003eI think it\u0026#39;s going to be the most transformative technology humanity has ever created, potentially on par with or exceeding the invention of the printing press, electricity, and the internet.\u003c/span\u003e\n                        \n                      \u003c/blockquote\u003e\n                    \u003c/div\u003e\n            \u003c/div\u003e\n      \u003cdiv data-scrollymoly-basis=\"true\" data-testid=\"ENG-5457\" id=\"section-Course-goals-We6QHjJFqp\" data-effects=\"eyJ0ZXh0UGVyTGluZSI6ZmFsc2UsImhhc0VmZmVjdHMiOmZhbHNlLCJuZWVkc0JhY2tncm91bmRDbG9uZSI6ZmFsc2UsImVuY29kZWQiOiIifQ==\"\u003e\n                  \u003cp\u003e\u003cspan\u003eFor better or for worse, LLMs are here to stay. We all read content that they produce online, most of us interact with LLM chatbots, and many of us use them to produce content of our own.\u003c/span\u003e\u003c/p\u003e\n                  \n                  \u003cp\u003eIn a series of five- to ten-minute lessons, we will explain what these machines are, how they work, and how to thrive in a world where they are everywhere.\u003c/p\u003e\n                  \n                  \u003cp\u003eYou will learn when these systems can save you a lot of time and effort. You will learn when they are likely to steer you wrong. And you will discover how to see through the hype to tell the difference. \u003cspan\u003e\u003cem\u003e?\u003c/em\u003e\u003c/span\u003e\u003c/p\u003e\n                \u003c/div\u003e\n      \n      \u003cdiv id=\"section-O0UgCe5GaC\" data-effects=\"eyJ0ZXh0UGVyTGluZSI6ZmFsc2UsImhhc0VmZmVjdHMiOmZhbHNlLCJuZWVkc0JhY2tncm91bmRDbG9uZSI6ZmFsc2UsImVuY29kZWQiOiIifQ==\"\u003e\n                    \u003cp\u003e\u003cstrong\u003eNotice of Rights. \u003c/strong\u003eThe materials provided on this website are freely accessible for personal self-study and for non-commercial educational use in K-12 schools, colleges, and universities. For any commercial or corporate use, please \u003ca href=\"mailto:cbergst@uw.edu,jevinw@uw.edu\"\u003econtact the authors\u003c/a\u003e to discuss terms and obtain the necessary permissions. Redistribution of website content is prohibited without prior written consent from the authors. However, individual copies may be created to accommodate accessibility needs directly related to educational instruction. \u003c/p\u003e\n                    \u003cp\u003eUnless otherwise stated, all content is copyrighted © 2025 by the authors. All rights reserved.\u003c/p\u003e\n                  \u003c/div\u003e\n      \n      \n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
