{
  "id": "6a340e66-7ec0-47da-a7bb-27c9d172f108",
  "title": "Tony Gilroy Knows ‘Andor’ Broke the Heart of Cassian and Jyn Shippers",
  "link": "https://gizmodo.com/tony-gilroy-knows-andor-broke-the-heart-of-cassian-and-jyn-shippers-2000613509",
  "description": "The 'Star Wars' showrunner apologizes for dashing the dreams of one particular slice of the 'Rogue One' fandom.",
  "author": "Sabina Graves",
  "published": "Mon, 09 Jun 2025 23:15:05 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Television",
    "Adria Arjona",
    "Andor",
    "Diego Luna",
    "Felicity Jones",
    "Rogue One",
    "Star Wars"
  ],
  "byline": "Sabina Graves",
  "length": 3571,
  "excerpt": "The 'Star Wars' showrunner apologizes for dashing the dreams of one particular slice of the 'Rogue One' fandom.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "The adventures of rebel spy Cassian Andor (Diego Luna) powered Andor‘s two epic seasons. But getting to know who he was through those he loves is what catapulted the character from Rogue One one-off into the pantheon of beloved Star Wars heroes. Seeing the added layers of his family and friend circle captivated audiences and introduced us to even more characters we hope to see more of in the future, including his partner and romantic interest, Bix Caleen (Adria Arjona). A rebel heroine in her own right, Caleen pretty much stole our hearts too, but dashed the hopes of Jyn Erso and Cassian shippers across the fandom galaxy. The fleeting tension in Rogue One‘s elevator scene between the two rebels on the trail of the Death Star plans—who then embrace one another in their final moments—had the fandom taking the mere tease of a romance to mean more. It’s something Andor creator and Rogue One co-writer Tony Gilroy is well aware of. “I knew very well what had happened with Jyn and Cassian in Rogue One and what had happened in the elevator,” he told Collider; it’s something he truncated in the process of re-working the film (there was a kiss shot originally). “I knew that scene very, very well. I probably went back and looked at that. I was pleased to see that my memory of it was of all the other takes and other things, and I was really pleased to see how we’d edited that, that it was really ambiguous about what it was, and then I didn’t care anymore. I was like, ‘Okay. It makes sense.’” He explained that Cassian and Bix’s love story realistically explores the dynamic of two people who have been in each other’s lives for longer than a mission, and who we meet while they’re very much not together. “I mean, they’re both pretty sexually liberated in their way,” he said. “I think that first kiss they had, I think the first person they ever slept with is each other. Who knows how old they were on Ferrix? Probably very, very young. And over time, they were together and not together.” They’ve clearly had their own separate life experiences. “Timm starts off the show, and who’s in charge of that relationship, right?” Gilroy said, calling out Bix’s not-long-for-the-world jealous beau on Ferrix. “Cassian certainly has a rich history in just the little bit we see, and has alluded to, and his mother calls him out on all his girlfriends, and there’s Windi on Niamos. I think they have a very healthy idea of what the different calibrations of love are.” So yes, Cassian and Jyn may have had a moment but its informed by the knowledge of their win against the Empire. “I mean, why wouldn’t you hold somebody’s hand at the end of the world?” Gilroy said. “I felt bad for the people who had invested so much time in the fan fiction and stuff like that. The people who really had gone deep on it. It’s not considered canon, and it’s not something I have to pay attention to, legally, within the order, but people worked hard on that stuff, and it meant a lot to them. You don’t want to trample on somebody’s flower garden, you know? But I have to do what I have to do.” As the writer, who is actual steward of the lore, Gilroy at least offered his condolences for blasting the ship along with the Scarif shore Cassian and Jyn held each other on, stating, “I’m sure there’s somebody who will never get over that. I apologize. I really do.” Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/06/Rogue-One-A-Star-Wars-Story-Lucasfilm-1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eThe adventures of rebel spy Cassian Andor (Diego Luna) powered \u003cem\u003eAndor\u003c/em\u003e‘s two epic seasons. But getting to know who he was through those he loves is what catapulted the character from \u003ca href=\"https://gizmodo.com/heres-why-rogue-ones-rebellions-are-built-on-hope-got-its-payoff-in-andor-2000600363\"\u003e\u003cem\u003eRogue One\u003c/em\u003e\u003c/a\u003e one-off into the pantheon of beloved \u003cem\u003eStar Wars\u003c/em\u003e heroes. Seeing the added layers of his family and friend circle captivated audiences and introduced us to even more characters we hope to see more of in the future, including his partner and romantic interest, Bix Caleen (Adria Arjona). \u003ca href=\"https://gizmodo.com/andor-season-2-endings-explained-luthen-kleya-bix-star-wars-2000602980\"\u003eA rebel heroine in her own right\u003c/a\u003e, Caleen pretty much stole our hearts too, but dashed the hopes of Jyn Erso and Cassian shippers across the fandom galaxy.\u003c/p\u003e \u003cp\u003eThe fleeting tension in Rogue\u003cem\u003e One\u003c/em\u003e‘s elevator scene between the two rebels on the trail of the Death Star plans—who then embrace one another in their final moments—had the fandom taking the mere tease of a romance to mean more. It’s something \u003cem\u003eAndor\u003c/em\u003e creator and \u003cem\u003eRogue One\u003c/em\u003e co-writer \u003ca href=\"https://gizmodo.com/tony-gilroy-and-adria-arjona-on-andors-dark-season-2-scene-2000593289\"\u003eTony Gilroy\u003c/a\u003e is well aware of.\u003c/p\u003e \u003cp\u003e“I knew very well what had happened with Jyn and Cassian in \u003cem\u003eRogue One\u003c/em\u003e and what had happened in the elevator,” he told \u003ca href=\"https://collider.com/andor-season-2-tony-gilroy-apologizes-for-bix-cassian-relationship-ruining-jyn-cassian/\"\u003eCollider\u003c/a\u003e; it’s something he truncated in the process of re-working the film (there was a kiss shot originally).\u003c/p\u003e\n\n \u003cp\u003e“I knew that scene very, very well. I probably went back and looked at that. I was pleased to see that my memory of it was of all the other takes and other things, and I was really pleased to see how we’d edited that, that it was really ambiguous about what it was, and then I didn’t care anymore. I was like, ‘Okay. It makes sense.’”\u003c/p\u003e \u003cp\u003eHe explained that Cassian and Bix’s love story realistically explores the dynamic of two people who have been in each other’s lives for longer than a mission, and who we meet while they’re very much not together. “I mean, they’re both pretty sexually liberated in their way,” he said. “I think that first kiss they had, I think the first person they ever slept with is each other. Who knows how old they were on Ferrix? Probably very, very young. And over time, they were together and not together.”\u003c/p\u003e \u003cp\u003eThey’ve clearly had their own separate life experiences. “Timm starts off the show, and who’s in charge of that relationship, right?” Gilroy said, calling out Bix’s not-long-for-the-world jealous beau on Ferrix. “\u003cspan\u003eCassian certainly has a rich history in just the little bit we see, and has alluded to, and his mother calls him out on all his girlfriends, and there’s Windi on Niamos. I think they have a very healthy idea of what the different calibrations of love are.”\u003c/span\u003e\u003c/p\u003e\n\n \u003cp\u003eSo yes, Cassian and Jyn may have had a moment but its informed by the knowledge of their win against the Empire. “I mean, why wouldn’t you hold somebody’s hand at the end of the world?” Gilroy said. “I felt bad for the people who had invested so much time in the fan fiction and stuff like that. The people who really had gone deep on it. It’s not considered canon, and it’s not something I have to pay attention to, legally, within the order, but people worked hard on that stuff, and it meant a lot to them. You don’t want to trample on somebody’s flower garden, you know? But I have to do what I have to do.”\u003c/p\u003e \u003cp\u003eAs the writer, who is actual steward of the lore, Gilroy at least offered his condolences for blasting the ship along with the Scarif shore Cassian and Jyn held each other on, stating, “I’m sure there’s somebody who will never get over that. I apologize. I really do.”\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-09T23:15:05Z",
  "modifiedTime": "2025-06-09T23:15:05Z"
}
