{
  "id": "6b7aafca-b54a-4aa8-93df-cdfd7fb17e74",
  "title": "RFK Jr.’s health department calls Nature “junk science,” cancels subscriptions",
  "link": "https://arstechnica.com/health/2025/07/rfk-jr-s-health-department-calls-nature-junk-science-cancels-subscriptions/",
  "description": "The move comes after RFK Jr. called top medical journals \"corrupt.\"",
  "author": "Beth Mole",
  "published": "Tue, 01 Jul 2025 22:21:06 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Health",
    "DOE",
    "NASA",
    "Nature",
    "NIH",
    "USDA"
  ],
  "byline": "Beth Mole",
  "length": 1237,
  "excerpt": "The move comes after RFK Jr. called top medical journals “corrupt.”…",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "The move comes after HHS Secretary and anti-vaccine activist Robert F. Kennedy Jr. said on a May 27 podcast that prestigious medical journals are \"corrupt.\" \"We’re probably going to stop publishing in the Lancet, New England Journal of Medicine, JAMA, and those other journals because they’re all corrupt,\" he said. He accused the journals collectively of being a \"vessel for pharmaceutical propaganda.\" He went on to say that \"unless these journals change dramatically,\" the federal government would \"stop NIH scientists from publishing there\" and create \"in-house\" journals instead. Kennedy's criticism largely stems from his belief that modern medicine and mainstream science are part of a global conspiracy to generate pharmaceutical profits. Kennedy is a germ-theory denier who believes people can maintain their health not by relying on evidence-based medicine, such as vaccines, but by clean living and eating—a loose concept called \"terrain theory.\" Access to top scientific and medical journals is essential for federal scientists to keep up to date with their fields and publicize high-impact results. One NIH employee added to Nature news that it \"suppresses our scientific freedom, to pursue information where it is present.\"",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-876658722-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n          \n          \n\u003cp\u003eThe move comes after HHS Secretary and anti-vaccine activist Robert F. Kennedy Jr. said on a May 27 podcast that prestigious medical journals are \u0026#34;\u003ca href=\"https://youtu.be/sODZSAuxTTw?t=1889\"\u003ecorrupt\u003c/a\u003e.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;We’re probably going to stop publishing in the Lancet, New England Journal of Medicine, JAMA, and those other journals because they’re all corrupt,\u0026#34; he said. He accused the journals collectively of being a \u0026#34;vessel for pharmaceutical propaganda.\u0026#34; He went on to say that \u0026#34;unless these journals change dramatically,\u0026#34; the federal government would \u0026#34;stop NIH scientists from publishing there\u0026#34; and create \u0026#34;in-house\u0026#34; journals instead.\u003c/p\u003e\n\u003cp\u003eKennedy\u0026#39;s criticism largely stems from his belief that modern medicine and mainstream science are part of a global conspiracy to generate pharmaceutical profits. \u003ca href=\"https://arstechnica.com/health/2025/04/rfk-jr-s-anti-vaccine-stance-is-rooted-in-a-disbelief-in-germ-theory/\"\u003eKennedy is a germ-theory denier\u003c/a\u003e who believes people can maintain their health not by relying on evidence-based medicine, such as vaccines, but by clean living and eating—a loose concept called \u0026#34;terrain theory.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAccess to top scientific and medical journals is essential for federal scientists to keep up to date with their fields and publicize high-impact results. One NIH employee added to Nature news that it \u0026#34;suppresses our scientific freedom, to pursue information where it is present.\u0026#34;\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-07-01T22:21:06Z",
  "modifiedTime": "2025-07-01T22:32:12Z"
}
