{
  "id": "73aeef4d-5601-4030-b169-bb53578ac6bc",
  "title": "Asana CEO Announces Retirement, Stock Plummets 25%",
  "link": "https://tech.slashdot.org/story/25/03/10/2321254/asana-ceo-announces-retirement-stock-plummets-25?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "Dustin Moskovitz, CEO and co-founder of Asana, is stepping down and will transition to the role of Chair once a new CEO is appointed. \"As I reflect on my journey since co-founding Asana nearly 17 years ago, I'm filled with immense gratitude,\" Moskovitz said in a statement. \"Creating and leading Asana has been more than just building a company -- it's been a profound privilege to work alongside some of the most talented minds in the industry.\" Asana's stock price was down more than 25% following the news. CNBC reports: Asana said fourth-quarter sales rose 10% year over year to $188.3 million, which was in line with analysts' estimates. The company said its adjusted earnings per share was breakeven, ahead of analysts' estimates of a loss of one cent per share. Asana said it expects fiscal first-quarter revenue of $184.5 million to $186.5 million, trailing analysts' expectations of $191 million. Moskovitz owns about 53% of the company's outstanding shares, between his Class A and Class B holdings. He has substantially increased his ownership since the company's public market debut in 2020. [...] Moskovitz said in his Monday retirement statement that he plans to focus more on his philanthropic endeavors, such as Good Ventures and Open Philanthropy, which cites \"potential risks from advanced AI\" among its various focus areas. In 2010, Moskovitz signed the Giving Pledge, a promise by some of the wealthiest people in the world to donate most of their fortunes to charity. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2025-03-11T00:50:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "business"
  ],
  "byline": "",
  "length": 1,
  "excerpt": "×",
  "siteName": "",
  "favicon": "https://a.fsdn.com/sd/m/assets/apple-touch-icon-precomposed2X-e553cba2892b057428cabcdff1a372fc.png",
  "text": "×",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\n\n\n\n\n\u003cdiv id=\"ccpa-modal\"\u003e\n        \u003cp\u003e\u003cspan id=\"modal-close\"\u003e×\u003c/span\u003e\u003c/p\u003e\n    \u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
