{
  "id": "7c6d0dcd-8f45-4f75-b233-85131f173dce",
  "title": "200 mph for 500 miles: How IndyCar drivers prepare for the big race",
  "link": "https://arstechnica.com/features/2025/05/how-to-try-to-win-the-indianapolis-500/",
  "description": "Andretti Global's Kyle Kirkwood and Marcus Ericsson talk to us about the Indy 500.",
  "author": "Jonathan M. Gitlin",
  "published": "Sat, 24 May 2025 15:30:19 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Cars",
    "Features",
    "Indianapolis 500",
    "Indy 500",
    "IndyCar",
    "Racing",
    "simulation"
  ],
  "byline": "Jonathan M. Gitlin",
  "length": 11856,
  "excerpt": "Andretti Global’s Kyle Kirkwood and Marcus Ericsson talk to us about the Indy 500.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Andretti Global's Kyle Kirkwood and Marcus Ericsson talk to us about the Indy 500. #28, Marcus Ericsson, Andretti Global Honda prior to the NTT IndyCar Series 109th Running of the Indianapolis 500 at Indianapolis Motor Speedway on May 15, 2025 in Indianapolis, Indiana. Credit: Brandon Badraoui/Lumen via Getty Images #28, Marcus Ericsson, Andretti Global Honda prior to the NTT IndyCar Series 109th Running of the Indianapolis 500 at Indianapolis Motor Speedway on May 15, 2025 in Indianapolis, Indiana. Credit: Brandon Badraoui/Lumen via Getty Images This coming weekend is a special one for most motorsport fans. There are Formula 1 races in Monaco and NASCAR races in Charlotte. And arguably towering over them both is the Indianapolis 500, being held this year for the 109th time. America's oldest race is also one of its toughest: The track may have just four turns, but the cars negotiate them going three times faster than you drive on the highway, inches from the wall. For hours. At least at Le Mans, you have more than one driver per car. This year's race promises to be an exciting one. The track is sold out for the first time since the centenary race in 2016. A rookie driver and a team new to the series took pole position. Two very fast cars are starting at the back thanks to another conflict-of-interest scandal involving Team Penske, the second in two years for a team whose owner also owns the track and the series. And the cars are trickier to drive than they have been for many years, thanks to a new supercapacitor-based hybrid system that has added more than 100 lbs to the rear of the car, shifting the weight distribution further back. Ahead of Sunday's race, I spoke with a couple of IndyCar drivers and some engineers to get a better sense of how they prepare and what to expect. This year, the cars are harder to drive thanks to a hybrid system that has altered the weight balance. Credit: Geoff MIller/Lumen via Getty Images Concentrate It all comes \"from months of preparation,\" said Marcus Ericsson, winner of the race in 2022 and one of Andretti Global's drivers in this year's event. \"When we get here to the month of May, it's just such a busy month. So you've got to be prepared mentally—and basically before you get to the month of May because if you start doing it now, it's too late,\" he told me. The drivers spend all month at the track, with a race on the road course earlier this month. Then there's testing on the historic oval, followed by qualifying last weekend and the race this coming Sunday. \"So all those hours you put in in the winter, really, and leading up here to the month of May—it's what pays off now,\" Ericsson said. That work involved multiple sessions of physical training each week, and Ericsson says he also does weekly mental coaching sessions. \"This is a mental challenge,\" Ericsson told me. \"Doing those speeds with our cars, you can't really afford to have a split second of loss of concentration because then you might be in the wall and your day is over and you might hurt yourself.\" When drivers get tired or their focus slips, that's when mistakes happen, and a mistake at Indy often has consequences. Ericsson is sponsored by the antihistamine Allegra and its anti-drowsy-driving campaign. Fans can scan the QR codes on the back of his pit crew's shirts for a \"gamified experience.\" Credit: Andretti Global/Allegra Simulate Being mentally and physically prepared is part of it. It also helps if you can roll the race car off the transporter and onto the track with a setup that works rather than spending the month chasing the right combination of dampers, springs, wing angles, and so on. And these days, that means a lot of simulation testing. The multi-axis driver in the loop simulators might look like just a very expensive video game, but these multimillion-dollar setups aren't about having fun. \"Everything that you are feeling or changing in the sim is ultimately going to reflect directly to what happens on track,\" explained Kyle Kirkwood, teammate to Ericsson at Andretti Global and one of only two drivers to have won an Indycar race in 2025. Andretti, like the other teams using Honda engines, uses the new HRC simulator in Indiana. \"And yes, it's a very expensive asset, but it's also likely cheaper than going to the track and doing the real thing,\" Kirkwood said. \"And it's a much more controlled environment than being at the track because temperature changes or track conditions or wind direction play a huge factor with our car.\" A high degree of correlation between the simulation and the track is what makes it a powerful tool. \"We run through a sim, and you only get so many opportunities, especially at a place like Indianapolis, where you go from one day to the next and the temperature swings, or the wind conditions, or whatever might change drastically,\" Kirkwood said. \"You have to be able to sim it and be confident with the sim that you're running to go out there and have a similar balance or a similar performance.\" Andretti Global's Kyle Kirkwood is the only driver other than Álex Palou to have won an IndyCar race in 2025. Credit: Alison Arena/Andretti Global \"So you have to make adjustments, whether it's a spring rate, whether it's keel ballast or just overall, maybe center of pressure, something like that,\" Kirkwood said. \"You have to be able to adjust to it. And that's where the sim tool comes in play. You move the weight balance back, and you're like, OK, now what happens with the balance? How do I tune that back in? And you run that all through the sim, and for us, it's been mirror-perfect going to the track when we do that.\" More impressively, a lot of that work was done months ago. \"I would say most of it, we got through it before the start of this season,\" Kirkwood said. \"Once we get into the season, we only get a select few days because every Honda team has to run on the same simulator. Of course, it's different with the engineering sim; those are running nonstop.\" Sims are for engineers, too An IndyCar team is more than just its drivers—\"the spacer between the seat and the wheel,\" according to Kirkwood—and the engineers rely heavily on sim work now that real-world testing is so highly restricted. And they use a lot more than just driver-in-the-loop (DiL). \"Digital simulation probably goes to a higher level,\" explained Scott Graves, engineering manager at Andretti Global. \"A lot of the models we develop work in the DiL as well as our other digital tools. We try to develop universal models, whether that's tire models, engine models, or transmission models.\" \"Once you get into to a fully digital model, then I think your optimization process starts kicking in,\" Graves said. \"You're not just changing the setting and running a pretend lap with a driver holding a wheel. You're able to run through numerous settings and optimization routines and step through a massive number of permutations on a car. Obviously, you're looking for better lap times, but you're also looking for fuel efficiency and a lot of other parameters that go into crossing the finish line first.\" Parts like this anti-roll bar are simulated thousands of times. Credit: Siemens/Andretti Global As an example, Graves points to the dampers. \"The shock absorber is a perfect example where that's a highly sophisticated piece of equipment on the car and it's very open for team development. So our cars have fully customized designs there that are optimized for how we run the car, and they may not be good on another team's car because we're so honed in on what we're doing with the car,\" he said. \"The more accurate a digital twin is, the more we are able to use that digital twin to predict the performance of the car,\" said David Taylor, VP of industry strategy at Siemens DISW, which has partnered with Andretti for some years now. \"It will never be as complete and accurate as we want it to be. So it's a continuous pursuit, and we keep adding technology to our portfolio and acquiring companies to try to provide more and more tools to people like Scott so they can more accurately predict that performance.\" What to expect on Sunday? Kirkwood was bullish about his chances despite starting relatively deep in the field, qualifying in 23rd place. \"We've been phenomenal in race trim and qualifying,\" he said. \"We had a bit of a head-scratcher if I'm being honest—I thought we would definitely be a top-six contender, if not a front row contender, and it just didn't pan out that way on Saturday qualifying.\" \"But we rolled back out on Monday—the car was phenomenal. Once again, we feel very, very racy in traffic, which is a completely different animal than running qualifying,\" Kirkwood said. \"So I'm happy with it. I think our chances are good. We're starting deep in the field, but so are a lot of other drivers. So you can expect a handful of us to move forward.\" The more nervous hybrid IndyCars with their more rearward weight bias will probably result in more cautions, according to Ericsson, who will line up sixth for the start of the race on Sunday. \"Whereas in previous years you could have a bit of a moment and it would scare you, you usually get away with it,\" he said. \"This year, if you have a moment, it usually ends up with you being in the fence. I think that's why we've seen so many crashes this year—because a pendulum effect from the rear of the car that when you start losing it, this is very, very difficult or almost impossible to catch.\" \"I think it's going to mean that the race is going to be quite a few incidents with people making mistakes,\" Ericsson said. \"In practice, if your car is not behaving well, you bring it to the pit lane, right? You can do adjustments, whereas in the race, you have to just tough it out until the next pit stop and then make some small adjustments. So if you have a bad car at the start a race, it's going to be a tough one. So I think it's going to be a very dramatic and entertaining race.\" Jonathan is the Automotive Editor at Ars Technica. He has a BSc and PhD in Pharmacology. In 2014 he decided to indulge his lifelong passion for the car by leaving the National Human Genome Research Institute and launching Ars Technica's automotive coverage. He lives in Washington, DC. 48 Comments",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-2560x1440-1748012214.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n            \u003carticle data-id=\"2096807\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n    \n\n    \n\n    \u003cp\u003e\n      Andretti Global\u0026#39;s Kyle Kirkwood and Marcus Ericsson talk to us about the Indy 500.\n    \u003c/p\u003e\n\n    \n\n    \u003cdiv\u003e\n            \u003cp\u003e\u003ca data-pswp-width=\"7634\" data-pswp-height=\"5089\" data-pswp-srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733.jpg 7634w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-640x427.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-1024x683.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-768x512.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-1536x1024.jpg 1536w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-2048x1365.jpg 2048w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-980x653.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-1440x960.jpg 1440w\" data-cropped=\"false\" href=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733.jpg\" target=\"_blank\"\u003e\n              \u003cimg width=\"7634\" height=\"5089\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733.jpg\" alt=\"INDIANAPOLIS, INDIANA - MAY 15: #28, Marcus Ericsson, Andretti Global Honda prior to the NTT IndyCar Series 109th Running of the Indianapolis 500 at Indianapolis Motor Speedway on May 15, 2025 in Indianapolis, Indiana.\" loading=\"eager\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733.jpg 7634w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-640x427.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-1024x683.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-768x512.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-1536x1024.jpg 1536w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-2048x1365.jpg 2048w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-980x653.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2214687733-1440x960.jpg 1440w\" sizes=\"(max-width: 7634px) 100vw, 7634px\"/\u003e\n            \u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"caption-2096810\"\u003e\n    \n    \u003cp\u003e\n      #28, Marcus Ericsson, Andretti Global Honda prior to the NTT IndyCar Series 109th Running of the Indianapolis 500 at Indianapolis Motor Speedway on May 15, 2025 in Indianapolis, Indiana.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Brandon Badraoui/Lumen via Getty Images\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n          \u003c/div\u003e\n\n    \u003cdiv\u003e\n    \n    \u003cp\u003e\n      #28, Marcus Ericsson, Andretti Global Honda prior to the NTT IndyCar Series 109th Running of the Indianapolis 500 at Indianapolis Motor Speedway on May 15, 2025 in Indianapolis, Indiana.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Brandon Badraoui/Lumen via Getty Images\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n  \u003c/div\u003e\n\u003c/header\u003e\n\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \n\u003cp\u003eThis coming weekend is a special one for most motorsport fans. There are Formula 1 races in Monaco and NASCAR races in Charlotte. And arguably towering over them both is the Indianapolis 500, being held this year for the 109th time. America\u0026#39;s oldest race is also one of its toughest: The track may have just four turns, but the cars negotiate them going three times faster than you drive on the highway, inches from the wall. For hours. At least at Le Mans, you have more than one driver per car.\u003c/p\u003e\n\u003cp\u003eThis year\u0026#39;s race promises to be an exciting one. The track is sold out for the first time \u003ca href=\"https://arstechnica.com/cars/2016/05/the-greatest-spectacle-in-racing-turns-100-the-2016-indy-500/\"\u003esince the centenary race in 2016\u003c/a\u003e. A rookie driver and a team new to the series took pole position. Two very fast cars are \u003ca href=\"https://racer.com/2025/05/19/newgarden-power-sent-to-the-back-of-indy-500-grid-after-component-violations\"\u003estarting at the back\u003c/a\u003e thanks to \u003ca href=\"https://racer.com/2025/05/18/indycar-president-boles-explains-penske-qualifying-illegalities\"\u003eanother conflict-of-interest\u003c/a\u003e scandal involving Team Penske, the second in two years for a team whose owner also owns the track and the series. And the cars are trickier to drive than they have been for many years, thanks to a new supercapacitor-based hybrid system that has added more than 100 lbs to the rear of the car, shifting the weight distribution further back.\u003c/p\u003e\n\u003cp\u003eAhead of Sunday\u0026#39;s race, I spoke with a couple of IndyCar drivers and some engineers to get a better sense of how they prepare and what to expect.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"6491\" height=\"4327\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2215088264.jpg\" alt=\"INDIANAPOLIS, INDIANA - MAY 17: #28, Marcus Ericsson, Andretti Global Honda during qualifying for the NTT IndyCar Series 109th Running of the Indianapolis 500 at Indianapolis Motor Speedway on May 17, 2025 in Indianapolis, Indiana.\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2215088264.jpg 6491w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2215088264-640x427.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2215088264-1024x683.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2215088264-768x512.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2215088264-1536x1024.jpg 1536w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2215088264-2048x1365.jpg 2048w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2215088264-980x653.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-2215088264-1440x960.jpg 1440w\" sizes=\"auto, (max-width: 6491px) 100vw, 6491px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      This year, the cars are harder to drive thanks to a hybrid system that has altered the weight balance.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Geoff MIller/Lumen via Getty Images\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003ch2\u003eConcentrate\u003c/h2\u003e\n\u003cp\u003eIt all comes \u0026#34;from months of preparation,\u0026#34; said Marcus Ericsson, winner of the race in 2022 and one of Andretti Global\u0026#39;s drivers in this year\u0026#39;s event. \u0026#34;When we get here to the month of May, it\u0026#39;s just such a busy month. So you\u0026#39;ve got to be prepared mentally—and basically before you get to the month of May because if you start doing it now, it\u0026#39;s too late,\u0026#34; he told me.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThe drivers spend all month at the track, with a race on the road course earlier this month. Then there\u0026#39;s testing on the historic oval, followed by qualifying last weekend and the race this coming Sunday. \u0026#34;So all those hours you put in in the winter, really, and leading up here to the month of May—it\u0026#39;s what pays off now,\u0026#34; Ericsson said. That work involved multiple sessions of physical training each week, and Ericsson says he also does weekly mental coaching sessions.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This is a mental challenge,\u0026#34; Ericsson told me. \u0026#34;Doing those speeds with our cars, you can\u0026#39;t really afford to have a split second of loss of concentration because then you might be in the wall and your day is over and you might hurt yourself.\u0026#34;\u003c/p\u003e\n\u003cp\u003eWhen drivers get tired or their focus slips, that\u0026#39;s when mistakes happen, and a mistake at Indy often has consequences.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"5885\" height=\"3923\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Marcus-Ericsson-x-Pit-Crew.jpg\" alt=\"A racing driver stands in front of four mechanics, who are facing away from him. The mechanics have QR codes on the back of their shirts.\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Marcus-Ericsson-x-Pit-Crew.jpg 5885w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Marcus-Ericsson-x-Pit-Crew-640x427.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Marcus-Ericsson-x-Pit-Crew-1024x683.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Marcus-Ericsson-x-Pit-Crew-768x512.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Marcus-Ericsson-x-Pit-Crew-1536x1024.jpg 1536w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Marcus-Ericsson-x-Pit-Crew-2048x1365.jpg 2048w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Marcus-Ericsson-x-Pit-Crew-980x653.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Marcus-Ericsson-x-Pit-Crew-1440x960.jpg 1440w\" sizes=\"auto, (max-width: 5885px) 100vw, 5885px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Ericsson is sponsored by the antihistamine Allegra and its anti-drowsy-driving campaign. Fans can scan the QR codes on the back of his pit crew\u0026#39;s shirts for a \u0026#34;gamified experience.\u0026#34;\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Andretti Global/Allegra\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003ch2\u003eSimulate\u003c/h2\u003e\n\u003cp\u003eBeing mentally and physically prepared is part of it. It also helps if you can roll the race car off the transporter and onto the track with a setup that works rather than spending the month chasing the right combination of dampers, springs, wing angles, and so on. And these days, that means a lot of simulation testing.\u003c/p\u003e\n\u003cp\u003eThe \u003ca href=\"https://arstechnica.com/cars/2018/08/this-isnt-a-game-we-try-out-a-professional-driver-in-the-loop-simulator/\"\u003emulti-axis driver in the loop simulators\u003c/a\u003e might look like just a very expensive video game, but these multimillion-dollar setups aren\u0026#39;t about having fun. \u0026#34;Everything that you are feeling or changing in the sim is ultimately going to reflect directly to what happens on track,\u0026#34; explained Kyle Kirkwood, teammate to Ericsson at Andretti Global and one of only two drivers to have won an Indycar race in 2025.\u003c/p\u003e\n\u003cp\u003eAndretti, like the other teams using Honda engines, uses the \u003ca href=\"https://www.caranddriver.com/features/a60965304/2024-indy-500-honda-indycar-simulator/\"\u003enew HRC simulator in Indiana\u003c/a\u003e. \u0026#34;And yes, it\u0026#39;s a very expensive asset, but it\u0026#39;s also likely cheaper than going to the track and doing the real thing,\u0026#34; Kirkwood said. \u0026#34;And it\u0026#39;s a much more controlled environment than being at the track because temperature changes or track conditions or wind direction play a huge factor with our car.\u0026#34;\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eA high degree of correlation between the simulation and the track is what makes it a powerful tool. \u0026#34;We run through a sim, and you only get so many opportunities, especially at a place like Indianapolis, where you go from one day to the next and the temperature swings, or the wind conditions, or whatever might change drastically,\u0026#34; Kirkwood said. \u0026#34;You have to be able to sim it and be confident with the sim that you\u0026#39;re running to go out there and have a similar balance or a similar performance.\u0026#34;\u003c/p\u003e\n\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"1200\" height=\"800\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Indy-05162025KM-27883.jpg\" alt=\"Kyle Kirkwood\u0026#39;s indycar drives past the IMS logo on one of the track walls.\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Indy-05162025KM-27883.jpg 1200w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Indy-05162025KM-27883-640x427.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Indy-05162025KM-27883-1024x683.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Indy-05162025KM-27883-768x512.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Indy-05162025KM-27883-980x653.jpg 980w\" sizes=\"auto, (max-width: 1200px) 100vw, 1200px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Andretti Global\u0026#39;s Kyle Kirkwood is the only driver other than Álex Palou to have won an IndyCar race in 2025.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Alison Arena/Andretti Global\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003e\u0026#34;So you have to make adjustments, whether it\u0026#39;s a spring rate, whether it\u0026#39;s keel ballast or just overall, maybe center of pressure, something like that,\u0026#34; Kirkwood said. \u0026#34;You have to be able to adjust to it. And that\u0026#39;s where the sim tool comes in play. You move the weight balance back, and you\u0026#39;re like, OK, now what happens with the balance? How do I tune that back in? And you run that all through the sim, and for us, it\u0026#39;s been mirror-perfect going to the track when we do that.\u0026#34;\u003c/p\u003e\n\u003cp\u003eMore impressively, a lot of that work was done months ago. \u0026#34;I would say most of it, we got through it before the start of this season,\u0026#34; Kirkwood said. \u0026#34;Once we get into the season, we only get a select few days because every Honda team has to run on the same simulator. Of course, it\u0026#39;s different with the engineering sim; those are running nonstop.\u0026#34;\u003c/p\u003e\n\u003ch2\u003eSims are for engineers, too\u003c/h2\u003e\n\u003cp\u003eAn IndyCar team is more than just its drivers—\u0026#34;the spacer between the seat and the wheel,\u0026#34; according to Kirkwood—and the engineers rely heavily on sim work now that real-world testing is so highly restricted. And they use a lot more than just driver-in-the-loop (DiL).\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003e\u0026#34;Digital simulation probably goes to a higher level,\u0026#34; explained Scott Graves, engineering manager at Andretti Global. \u0026#34;A lot of the models we develop work in the DiL as well as our other digital tools. We try to develop universal models, whether that\u0026#39;s tire models, engine models, or transmission models.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;Once you get into to a fully digital model, then I think your optimization process starts kicking in,\u0026#34; Graves said. \u0026#34;You\u0026#39;re not just changing the setting and running a pretend lap with a driver holding a wheel. You\u0026#39;re able to run through numerous settings and optimization routines and step through a massive number of permutations on a car. Obviously, you\u0026#39;re looking for better lap times, but you\u0026#39;re also looking for fuel efficiency and a lot of other parameters that go into crossing the finish line first.\u0026#34;\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"1535\" height=\"1140\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Andretti-Anti-Rool-Bar-FEA-Study.jpg\" alt=\"A screenshot of a finite element analysis tool\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/Andretti-Anti-Rool-Bar-FEA-Study.jpg 1535w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Andretti-Anti-Rool-Bar-FEA-Study-640x475.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Andretti-Anti-Rool-Bar-FEA-Study-1024x760.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Andretti-Anti-Rool-Bar-FEA-Study-768x570.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Andretti-Anti-Rool-Bar-FEA-Study-980x728.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/05/Andretti-Anti-Rool-Bar-FEA-Study-1440x1069.jpg 1440w\" sizes=\"auto, (max-width: 1535px) 100vw, 1535px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Parts like this anti-roll bar are simulated thousands of times.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Siemens/Andretti Global\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eAs an example, Graves points to the dampers. \u0026#34;The shock absorber is a perfect example where that\u0026#39;s a highly sophisticated piece of equipment on the car and it\u0026#39;s very open for team development. So our cars have fully customized designs there that are optimized for how we run the car, and they may not be good on another team\u0026#39;s car because we\u0026#39;re so honed in on what we\u0026#39;re doing with the car,\u0026#34; he said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The more accurate a digital twin is, the more we are able to use that digital twin to predict the performance of the car,\u0026#34; said David Taylor, VP of industry strategy at Siemens DISW, which has partnered with Andretti for some years now. \u0026#34;It will never be as complete and accurate as we want it to be. So it\u0026#39;s a continuous pursuit, and we keep adding technology to our portfolio and acquiring companies to try to provide more and more tools to people like Scott so they can more accurately predict that performance.\u0026#34;\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n\n        \n        \u003cdiv\u003e\n          \n          \n\u003ch2\u003eWhat to expect on Sunday?\u003c/h2\u003e\n\u003cp\u003eKirkwood was bullish about his chances despite starting relatively deep in the field, qualifying in 23rd place. \u0026#34;We\u0026#39;ve been phenomenal in race trim and qualifying,\u0026#34; he said. \u0026#34;We had a bit of a head-scratcher if I\u0026#39;m being honest—I thought we would definitely be a top-six contender, if not a front row contender, and it just didn\u0026#39;t pan out that way on Saturday qualifying.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;But we rolled back out on Monday—the car was phenomenal. Once again, we feel very, very racy in traffic, which is a completely different animal than running qualifying,\u0026#34; Kirkwood said. \u0026#34;So I\u0026#39;m happy with it. I think our chances are good. We\u0026#39;re starting deep in the field, but so are a lot of other drivers. So you can expect a handful of us to move forward.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe more nervous hybrid IndyCars with their more rearward weight bias will probably result in more cautions, according to Ericsson, who will line up sixth for the start of the race on Sunday.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Whereas in previous years you could have a bit of a moment and it would scare you, you usually get away with it,\u0026#34; he said. \u0026#34;This year, if you have a moment, it usually ends up with you being in the fence. I think that\u0026#39;s why we\u0026#39;ve seen so many crashes this year—because a pendulum effect from the rear of the car that when you start losing it, this is very, very difficult or almost impossible to catch.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;I think it\u0026#39;s going to mean that the race is going to be quite a few incidents with people making mistakes,\u0026#34; Ericsson said. \u0026#34;In practice, if your car is not behaving well, you bring it to the pit lane, right? You can do adjustments, whereas in the race, you have to just tough it out until the next pit stop and then make some small adjustments. So if you have a bad car at the start a race, it\u0026#39;s going to be a tough one. So I think it\u0026#39;s going to be a very dramatic and entertaining race.\u0026#34;\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\n\n                  \n          \n\n\n\n\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n          \u003cp\u003e\u003ca href=\"https://arstechnica.com/author/jonathan-m-gitlin/\"\u003e\u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/09/jonathan-300x450.jpg\" alt=\"Photo of Jonathan M. Gitlin\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\n\n  \u003cdiv\u003e\n    \n\n    \u003cp\u003e\n      Jonathan is the Automotive Editor at Ars Technica. He has a BSc and PhD in Pharmacology. In 2014 he decided to indulge his lifelong passion for the car by leaving the National Human Genome Research Institute and launching Ars Technica\u0026#39;s automotive coverage. He lives in Washington, DC.\n    \u003c/p\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\n\n  \u003cp\u003e\n    \u003ca href=\"https://arstechnica.com/features/2025/05/how-to-try-to-win-the-indianapolis-500/#comments\" title=\"48 comments\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 80 80\"\u003e\u003cdefs\u003e\u003cclipPath id=\"bubble-zero_svg__a\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"bubble-zero_svg__b\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#bubble-zero_svg__a)\"\u003e\u003cg fill=\"currentColor\" clip-path=\"url(#bubble-zero_svg__b)\"\u003e\u003cpath d=\"M80 40c0 22.09-17.91 40-40 40S0 62.09 0 40 17.91 0 40 0s40 17.91 40 40\"\u003e\u003c/path\u003e\u003cpath d=\"M40 40 .59 76.58C-.67 77.84.22 80 2.01 80H40z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n    48 Comments\n  \u003c/a\u003e\n      \u003c/p\u003e\n              \u003c/div\u003e\n  \u003c/article\u003e\n\n\n  \n\n\n  \n\n\n  \u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003ca href=\"https://arstechnica.com/culture/2025/05/college-board-keeps-apologizing-for-screwing-up-digital-sat-and-ap-tests/\"\u003e\n              \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/05/GettyImages-183958940-768x432-1748029017.jpg\" alt=\"Listing image for first story in Most Read: College Board keeps apologizing for screwing up digital SAT and AP tests\" decoding=\"async\" loading=\"lazy\"/\u003e\n            \u003c/a\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n\n\n  \n\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-05-24T15:30:19Z",
  "modifiedTime": "2025-05-24T15:40:31Z"
}
