{
  "id": "80d39605-e2fb-4911-b95b-1e93481e162a",
  "title": "Why the digital divide persists within Indigenous communities",
  "link": "https://mashable.com/article/why-the-digital-divide-persists-for-tribal-areas-despite-funding",
  "description": "Despite no shortage of federal dollars for broadband connectivity, many tribal areas remain disconnected. It's a political, and ethical, lesson in patience.",
  "author": "",
  "published": "Mon, 13 Jan 2025 20:57:49 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Chase DiBenedetto",
  "length": 20168,
  "excerpt": "Billions have gone to connecting rural tribal lands with reliable online access, but complicated infrastructure and longstanding skepticism slow the connection.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "Armed with oodles of federal funding, indigenous communities are still fighting for internet access. Credit: Ian Moore / Mashable Composite; cgdeaw / Prasert Krainukul / Moment / Kirillm / Alina Bukhtiy / iStock / Getty In 2020, amid a global pandemic that highlighted a staggering digital divide among Americans, the federal government pledged to do something. Its solution? Some promising tech subsidies and a wave of funding for internet access initiatives, specifically high speed broadband. This money included the government's promise to fix the missing middle miles of fiber optic connections that have for decades kept many Indigenous areas offline.At the time, the round of funding was a history-making investment in supporting this internet infrastructure, filling a long-simmering institutional gap. Since then, much of the funding has been allocated and many government subsidized programs have run their course. But, years later, American Indian and Alaska Native households living on tribal lands still have one of the lowest broadband subscription rates in the United States, at 71 percent, with the national average at 90 percent, according to recent census data. Connection to high speed internet at home is increasingly considered a social determinant of health. According to the White House, it's also the cornerstone of educational opportunities, economic growth, and full participation in \"modern American life.\" The state of internet connectivity in 2024The American Indian Policy Institute (AIPI) reports that 18 percent of tribal reservation residents have no internet access, while 33 percent rely on their smartphones for internet service — unreliable internet connections plague around 31 percent of residents who responded. According to a July 2023 study by academics at the University of Illinois at Urbana, University of Victoria, and the Center for Indian Country Development, the share of households with Internet access in tribal areas is 21 percentage points lower than in neighboring non-tribal areas. Even when connected, the study found, download speeds are approximately 75 percent slower in these areas. Meanwhile, the lowest price for basic Internet services is 11 percent higher than other areas. While historic measures like geography, population density, and household income may explain the discrepancy in price, they don't explain the differences in access or speed, the study found. \"A sizable amount of the variation in the access and home connection gap between tribal and non-tribal is left unexplained.\"In a world now dependent on the internet — with lifesaving resources behind an online gate — Indigenous communities are at a digital disadvantage. According to a study by the Center for Retirement Research at Boston College, tribal communities members are less likely to receive Social Security benefits, despite having higher poverty rates. The report attributes this to the movement of resources online, and an increasingly large broadband divide within households on tribal lands.  Given its social complexity, the lack of Indigenous internet access isn't one that can be solved quickly — although the solutions are there. While some private companies, including major phone carriers and internet service providers, have pledged to do their own work to connect rural and Indigenous communities to high speed internet, they are limited by the demands of the market and long-standing tribal and federal negotiations. Meanwhile, Indigenous communities and their leaders are navigating their own solutions. At stake are the hard to predict repercussions of Native communities tying themselves to private interests, calling into question the politics of internet ownership, tribal sovereignty, and digital privacy. The state of broadband funding for 2025One obvious solution, it seems, is to tear down the financial barriers to getting rural areas better internet services. In 2009, the New America Foundation’s Open Technology Institute published the first major report on tech use and access among Indigenous communities, prompting a new wave of attention on the digital divide. Despite this, the federal government appropriated just $179.2 million to tribal lands and organizations within a major $7.2 billion package for the expansion of rural broadband. This trend would continue. It took another year, as part of the government's Connecting America: The National Broadband Plan, before the FCC was finally directed to prioritize tribal broadband.Funding that could actually help connect these communities didn't come for yet another four years, after the federal government opened a tribal priority for e-rate funding (used to subsidize educational tech). In 2020, regulators finally opened a historic Tribal Priority Window, which helped Indigenous areas and broadband projects obtain their own spectrum licenses, or permits that grant the right to use a frequency band for telecommunication purposes. Communities, however, were still required to find the resources to build out their networks.  There's a lot of tribal members that are champing at the bit to get hooked up. Technology changes, and you got to be prepared for it. But broadband funding saw a shift soon after. In Dec. 2021, the U.S. government launched the Affordability Connectivity Program, a successor to the previous Emergency Broadband Benefit (EBB) that offered 9 million Americans internet subsidies during the COVID-19 lockdown. Under the Affordability Connectivity Program, $14.2 billion was allocated to additional internet subsidies, including additional monthly funding for qualifying households on tribal lands. It was just one of several funding efforts under the Internet for All initiative, a Biden administration pool of resources stemming from the 2021 Bipartisan Infrastructure Law. Another Internet for All outcome: The historic Tribal Broadband Connectivity Program, which saw an initial $3 billion allocated to projects working on broadband infrastructure deployment and widespread adoption. It was the first time funding was specifically earmarked for tribal connectivity. The Infrastructure Improvement and Jobs Act added an additional $2 billion to the program, and a second round of $980 million in funding opened up for additional projects in 2023. That same year, the Biden administration announced a $42 billion plan to expand broadband access across the U.S. under its BEAD program. The funds were to be divided up between the states, with 19 of them receiving more than $1 billion. At the same time, the Biden administration announced $1 billion explicitly invested in building out the missing miles of broadband connections in rural communities. \"The Middle Mile program will invest more than $900 million in the infrastructure needed to connect communities, military bases, and tribal lands to the Internet, lower the cost of access, and increase bandwidth,\" said Secretary of Commerce Gina Raimondo in a statement. \"Much like how the interstate highway system connected every community in America to regional and national systems of highways, this program will help us connect communities across the country to regional and national networks that provide quality, affordable high-speed Internet access.\"There's a will, but the way is slowSo, with billions allocated, why are the numbers still showing so many disconnected Indigenous communities? Mashable Light Speed \"Billions of dollars flew out the window to go build broadband. Most fiber projects are four years. So we're not even halfway through that, in most cases. We're coming up on halfway at the end of this year, \" explained Matthew Rantanen, director of technology at the Southern California Tribal Chairmen's Association and director of technology for the Tribal Digital Village, a self-sustained internet initiative. Rantanen has been involved in Indigenous internet connectivity for nearly a quarter-century, interacting with the FCC and acting as co-chair of the National Congress of American Indians (NCAI) first Tech and Telecom Subcommittee, developed in 2001. As Rantanen explains, these projects go through phases of approval before construction can even begin. Obtaining rights of way and easement on a fiber project is a minimum of 18 to 24 months, for example. The forestry department and Bureau of Land Management are consulted. State reserves and trusts may be involved. Once design and engineering plans are formulated and contracted, communities have to submit for approval from the federal Bureau of Indian Affairs. Projects under the first round of Tribal Connectivity Program funding are just now being deployed, which means results of this funding will be seen under the second Trump administration, years after they were announced. \"There's a misunderstanding from the general public, and on the politician level. They are like, 'Hey, where's the results from this? We spit out all this money, but where's the results?' Well, you know, Rome wasn't built in a day. You invested long term in a solution that is going to start making a difference in the next couple of years. But don't cut it off before it happens.\"The same applies for major companies trying to connect their services. \"It could take close to a year before we actually get shovels in the ground, maybe even a little more than a year,\" explained AT\u0026T's California Tribal Liaison Julio Figueroa. Figueroa has worked for AT\u0026T for 26 years, starting first as a call center service representative in the days of Pacific Bell (now owned by AT\u0026T). In 2021, Figueroa was appointed as the tribal liaison for California, and now Nevada, the first person to hold such a position at the company.    Meanwhile, just as their resulting construction projects begin, many of the early Biden administration programs have evolved or been phased out. Instead of the Affordable Connectivity Program, which was cut off from additional funding  in June, those seeking out more accessible internet options are now directed to an Federal Communication Commission (FCC) program called Lifeline, which connects low-income, displaced, and otherwise disconnected individuals to discounted broadband and telephone service under participating providers. People living on tribal land can apply for a special discounted benefit of $34.25 per month, but programs like these can only help those with the ability to get connected in the first place.  If I were them, I would do everything in my power to contract those dollars and obligate those dollars prior to Inauguration Day. Earlier this year, the FCC under Biden and Chair Jessica Rosenworcel redefined broadband speed requirements, bumping up the paltry 25 mbps minimum to 100mbps. In doing so, the agency would be better able to pinpoint areas with poor internet access, especially among low income and rural communities, and get them on par with communities running above 100mbps. The state of federal funding under Trump administration 2.0, led by its cost cutting \"Department of Government Efficiency\" and its new FCC chair, looms over those dependent on such funding streams. Previous FCC heads, and other Republican politicians, have pushed back on updated broadband speed requirements and increased federal spending, prompting further concern about the future of Indigenous connectivity. Indigenous community advocates are wary that the former administration's funding legacy will continue. \"The biggest concern that I'm hearing throughout Indian Country is that they're worried about the money that they've already been granted. Is it going to go away? Is he going to put people in place that are intentionally going to be disruptive, and intentionally going to seek opportunities to draw that funding back?\" said Rantanen. \"There's no support for tribes in the next administration. There's a track record [with Trump]. What we're led to believe, or to expect, is that that is par for the course and he is going to be more effective at it. If I were [an Indigenous leader], I would do everything in my power to contract those dollars and obligate those dollars prior to Inauguration Day.\"Private companies addressing the digital divide Complicating the tenuous funding future Rantanen describes, there's a growing divide among tribal leaders as to what role internet service — and data privacy — plays in the push for tribal sovereignty. Should they take this on themselves, or should they call in the help of telecom companies with more might and more connections? The latter is an increasingly viable option as the market changes. Where there has historically been little draw to companies who don't see a profit bump in these communities, some telecommunications companies have now found value in supplying their services to get rural and tribal areas connected with devices and broadband at lower costs — helped in part by federal funding that can beef up the margins. Like the middle miles that are supposed to connect rural and tribal areas to the larger internet, Figueroa, the tribal liaison at AT\u0026T, acts as an interlocutor between the vision of internet connectivity among tribal communities and a telecommunications giant like his employer. He is the single point of contact for leaders interested in working with the company to connect their communities to mainline phone service, broadband, and physical technology, like computers. Figueroa has formed connections with the regional tribal chairpersons associations of California and the California Nations Indian Gaming Association (CNIGA), part of a larger goal of building trust with Indigenous leadership and their constituents before the timeline of construction begins. \"Even if it's a tribal citizen that's having issues with their bill, they can come to me,\" says Figueroa.  \"There's some nations that want to be their own internet provider on their tribal land. They want to exercise their sovereignty and be self-reliant. If there is no middle mile connection, AT\u0026T can provide a connection to the internet,\" Figueroa explained. \"We place a fiber circuit to the border of the reservation, and from then on, they take it over. They're fully responsible. They operate it. They service it for their tribal members.\" Other communities, however, don't want to self-sustain their internet connections, instead entering into agreements with private companies, like AT\u0026T, that will bring broadband internet to their areas – those connections remain owned and operated by the service providers. For example, AT\u0026T has entered into a partnership with the San Pasqual Band of Mission Indians to launch one of its biggest broadband connection projects yet, connecting 500 residents to a AT\u0026T Fiber and 5GB network speeds, expected to go live in early 2025. The company is working with three other groups on similar projects, including California's Rincon Band of Luiseño Indians, currently waiting on grants to be approved by the National Telecommunications and Information Administration. \"Once these tribal nations start deploying fiber optics, word is going to travel to other tribal nations,\" said Figueroa. \"They're going to start hearing about the successes of being connected. And I think the government will need to look at another round of funding for the tribal nations that now want to adopt and get funding for construction.\"Speaking to Mashable at the end of 2024, San Pasqual Chairman Stephen Cope explained that the decision to work with AT\u0026T came from the accessibility and resources the company could offer — and a specific concern for getting younger residents connected and supported as soon as possible. \"It's a great opportunity for San Pasqual,\" explained Cope. \"A lot of rural areas and reservations are limited in what they have, as far as broadband internet. We didn't know where to really start.\" Talking to other tribal leaders, Cope discovered many had signed deals with AT\u0026T, and that's when he reached out to Figueroa. The project began in early 2023, and its been a learning curve for both parties, Cope said, but it will also set a precedent for similar projects of its magnitude in southern California. Tribes should be defining their digital sovereignty playbook. \"There's a lot of tribal members that are champing at the bit to get hooked up. Technology changes, and you got to be prepared for it. My goal is to make sure that we stay at least equal or ahead of the game, and provide what we need to provide,\" said Cope, who described the AT\u0026T deal as a predominantly equal partnership. \"It's moving, and I'm encouraging as many leaders as possible to take the opportunity.\"Retaining control over digital lives Rantanen, on the other hand, is spearheading the movement for fully Indigenous-owned and controlled internet service. When Mashable first spoke to Rantanen in 2021, the Tribal Digital Village was operating tech centers and its own community-based network, TDVNet, for hundreds of households within the oversight of the Southern California Tribal Chairman's Association. Now, Rantanen leads more than a dozen tribal communities across California, Oregon, Washington, Montana, and even New York in building their own internet networks through the Tribal Broadband Bootcamp, a program started at the beginning of the 2021 funding boom and held in Rantanen's own home to help guide leaders in application and development. The bootcamp has expanded with help from the Internet Society and inspired by the organization's Indigenous Connectivity Summit.There's also the Tribal Resource Center, a hub of validated articles, links, videos, and even people to assist tribal nations with adopting broadband technologies. The center's three liaisons connect tribes with resources, operating under the concept of  \"sovereign nations, sovereign networks.\" Earlier this year, the American Indian Policy Institute and the National Congress of American Indians launched the Center for Tribal Digital Sovereignty. \"The center is intended to support tribes in defining parameters around all aspects of digital sovereignty, not just data sovereignty,\" explained Rantanen. The concept of tribal digital sovereignty encompasses not just the network itself, but the transport of data, the mechanism of transport, the legality of storing tribal information on a cloud server not overseen by tribal leaders, protocols for handing over tribal data to law enforcement, and more. The rise of AI, and the notion of using tribal data to train models, poses ethical and political quandaries. Rantanen urges Indigenous communities, whether supported by federal dollars or the assistance of major companies, to retain control over their networks whenever possible. \"It could be delayed control,\" he said. \"It may be something like three years so they can recover their losses and then they hand it over, but contractually set up your system so that the infrastructure on your sovereign territory is yours.\"In addition to simply connecting these areas to broadband, Rantanen explains, \"There's a lot of definitions that need to be put into place about tribal sovereign data and tribal sovereign space — space that is being dictated by the federal government, dictated by corporations, dictated by people that are not us. Tribes should be defining their digital sovereignty playbook, and should be promoting that to the federal government, to the state government, to the county governments, and to the people they interact with.\" Chase joined Mashable's Social Good team in 2020, covering online stories about digital activism, climate justice, accessibility, and media representation. Her work also touches on how these conversations manifest in politics, popular culture, and fandom. Sometimes she's very funny.",
  "image": "https://helios-i.mashable.com/imagery/articles/02TtBu7wub6UdS1nmJz1LRC/hero-image.fill.size_1200x675.v1735860095.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection data-ga-module=\"content_body\"\u003e\n                        \u003cdiv\u003e\n                \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/articles/02TtBu7wub6UdS1nmJz1LRC/hero-image.fill.size_1248x702.v1735860095.jpg\" alt=\"An illustration of construction cranes made out of giant internet cables, floating on an island with a large cloud above it. The cloud has a symbol indicating no internet service.\" width=\"1248\" height=\"702\" srcset=\"https://helios-i.mashable.com/imagery/articles/02TtBu7wub6UdS1nmJz1LRC/hero-image.fill.size_400x225.v1735860095.jpg 400w, https://helios-i.mashable.com/imagery/articles/02TtBu7wub6UdS1nmJz1LRC/hero-image.fill.size_800x450.v1735860095.jpg 800w, https://helios-i.mashable.com/imagery/articles/02TtBu7wub6UdS1nmJz1LRC/hero-image.fill.size_1248x702.v1735860095.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eArmed with oodles of federal funding, indigenous communities are still fighting for internet access.\u003c/span\u003e\n                \n                                    \u003cspan\u003eCredit: Ian Moore / Mashable Composite; cgdeaw / Prasert Krainukul / Moment / Kirillm / Alina Bukhtiy / iStock / Getty\u003c/span\u003e\n                            \u003c/p\u003e\n                        \u003c/div\u003e\n\n    \n    \n    \n            \u003carticle id=\"article\" data-autopogo=\"\"\u003e\n                                    \u003cp\u003eIn 2020, amid a global pandemic that highlighted a \u003ca href=\"https://www.weforum.org/stories/2021/01/covid-digital-divide-learning-education/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003estaggering digital divide among Americans\u003c/a\u003e, the federal government pledged to do something. \u003c/p\u003e\u003cp\u003eIts solution? Some promising tech subsidies and a \u003ca href=\"https://www.usda.gov/about-usda/news/press-releases/2020/06/24/trump-administration-invests-86-million-rural-broadband-service-eight-states\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003ewave of funding for internet access initiatives\u003c/a\u003e, specifically high speed broadband. This money included the government\u0026#39;s promise to fix the \u003ca href=\"https://www.bia.gov/as-ia/opa/online-press-release/trump-administration-invests-12-million-tribal-broadband-grants\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003emissing middle miles of fiber optic connections\u003c/a\u003e that have for decades kept many Indigenous areas offline.\u003c/p\u003e\u003cp\u003eAt the time, the round of funding was a history-making investment in supporting this internet infrastructure, filling a long-simmering institutional gap. Since then, much of the funding has been allocated and many government subsidized programs have run their course. But, years later, American Indian and Alaska Native households living on tribal lands still have one of the lowest broadband subscription rates in the United States, at 71 percent, with the national average at 90 percent, \u003ca href=\"https://www.census.gov/library/publications/2024/acs/acs-56.html\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eaccording to recent census data\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eConnection to high speed internet at home is increasingly considered a \u003ca href=\"https://www.fcc.gov/health/sdoh/studies-and-data-analytics\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003esocial determinant of health\u003c/a\u003e. According to the White House, it\u0026#39;s also the cornerstone of educational opportunities, \u003ca href=\"https://www.whitehouse.gov/briefing-room/blog/2024/05/31/affordable-high-speed-internet-is-spurring-economic-growth-and-boosting-small-businesses/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eeconomic growth,\u003c/a\u003e and full participation in \u0026#34;modern American life.\u0026#34; \u003c/p\u003e\n\u003ch2\u003eThe state of internet connectivity in 2024\u003c/h2\u003e\u003cp\u003eThe \u003ca href=\"https://aipi.asu.edu/sites/default/files/tribal_digital_divide_stimulus_bill_advocacy_04032020.pdf\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eAmerican Indian Policy Institute\u003c/u\u003e\u003c/a\u003e (AIPI) reports that 18 percent of tribal reservation residents have no internet access, while 33 percent rely on their smartphones for internet service — unreliable internet connections plague around 31 percent of residents who responded. \u003c/p\u003e\u003cp\u003eAccording to a July 2023 \u003ca href=\"https://dl.acm.org/doi/abs/10.1016/j.telpol.2022.102401\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003estudy\u003c/u\u003e\u003c/a\u003e by academics at the University of Illinois at Urbana, University of Victoria, and the Center for Indian Country Development, the share of households with Internet access in tribal areas is 21 percentage points lower than in neighboring non-tribal areas. Even when connected, the study found, download speeds are approximately 75 percent slower in these areas. Meanwhile, the lowest price for basic Internet services is 11 percent higher than other areas. While historic measures like geography, population density, and household income may explain the discrepancy in price, they don\u0026#39;t explain the differences in access or speed, the study found. \u0026#34;A sizable amount of the variation in the access and home connection gap between tribal and non-tribal is left unexplained.\u0026#34;\u003c/p\u003e\u003cp\u003eIn a world now dependent on the internet — with lifesaving resources behind an online gate — Indigenous communities are at a digital disadvantage. According to a \u003ca href=\"https://www.google.com/url?q=https://crr.bc.edu/lack-of-broadband-impedes-native-american-access-to-aid/\u0026amp;sa=D\u0026amp;source=docs\u0026amp;ust=1736272411724679\u0026amp;usg=AOvVaw2QL1F1m3QTr4icmHcCZNZm\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003estudy\u003c/a\u003e by the Center for Retirement Research at Boston College, tribal communities members are less likely to receive Social Security benefits, despite having higher poverty rates. The report attributes this to the movement of resources online, and an increasingly large broadband divide within households on tribal lands.  \u003c/p\u003e\u003cp\u003eGiven its social complexity, the lack of Indigenous internet access isn\u0026#39;t one that can be solved quickly — although the solutions are there. \u003c/p\u003e\u003cp\u003eWhile some private companies, including major phone carriers and internet service providers, have pledged to do their own work to connect rural and Indigenous communities to high speed internet, they are limited by the demands of the market and long-standing tribal and federal negotiations. Meanwhile, Indigenous communities and their leaders are navigating their own solutions. At stake are the hard to predict repercussions of Native communities tying themselves to private interests, calling into question the politics of internet ownership, tribal sovereignty, and digital privacy. \u003c/p\u003e\u003ch2\u003eThe state of broadband funding for 2025\u003c/h2\u003e\u003cp\u003eOne obvious solution, it seems, is to tear down the financial barriers to getting rural areas better internet services. \u003c/p\u003e\u003cp\u003eIn 2009, the New America Foundation’s Open Technology Institute published the first major report on tech use and access among Indigenous communities, prompting a new wave of attention on the digital divide. Despite this, the federal government appropriated just $179.2 million to tribal lands and organizations within a major $7.2 billion package for the expansion of rural broadband. This trend would continue. It took another year, as part of the government\u0026#39;s Connecting America: The National Broadband Plan, before the FCC was finally directed to prioritize tribal broadband.\u003c/p\u003e\u003cp\u003eFunding that could actually help connect these communities didn\u0026#39;t come for yet another four years, after the federal government opened a tribal priority for e-rate funding (used to subsidize educational tech). In 2020, regulators finally opened a historic Tribal Priority Window, which helped Indigenous areas and broadband projects obtain their own spectrum licenses, or permits that grant the right to use a frequency band for telecommunication purposes. Communities, however, were still required to find the resources to build out their networks. \u003c/p\u003e\u003cq\u003e\n    There\u0026#39;s a lot of tribal members that are champing at the bit to get hooked up. Technology changes, and you got to be prepared for it.\n            \n    \u003c/q\u003e\n\u003cp\u003eBut broadband funding saw a shift soon after. In Dec. 2021, the U.S. government launched the \u003ca href=\"https://mashable.com/article/biden-cheap-internet-acp\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003eAffordability Connectivity Program\u003c/u\u003e\u003c/a\u003e, a successor to the previous Emergency Broadband Benefit (EBB) that offered 9 million Americans internet subsidies during the COVID-19 lockdown. Under the Affordability Connectivity Program, $14.2 billion was allocated to additional internet subsidies, including additional monthly funding for qualifying households on tribal lands. It was just one of several funding efforts under the \u003ca href=\"https://www.internetforall.gov/programs\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eInternet for All initiative\u003c/u\u003e\u003c/a\u003e, a Biden administration pool of resources stemming from the 2021 Bipartisan Infrastructure Law. \u003c/p\u003e\u003cp\u003eAnother Internet for All outcome: The historic Tribal Broadband Connectivity Program, which saw an initial $3 billion allocated to projects working on broadband infrastructure deployment and widespread adoption. It was the first time funding was specifically earmarked for tribal connectivity. The Infrastructure Improvement and Jobs Act added an additional $2 billion to the program, and a second round of $980 million in funding opened up for additional projects in 2023. \u003c/p\u003e\u003cp\u003eThat same year, the Biden administration announced a \u003ca href=\"https://mashable.com/article/biden-broadband-internet-access-plan\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003e$42 billion plan\u003c/u\u003e\u003c/a\u003e to expand broadband access across the U.S. under its BEAD program. The funds were to be divided up between the states, with 19 of them receiving more than $1 billion. At the same time, the Biden administration announced \u003ca href=\"https://mashable.com/article/biden-high-1-billion-speed-internet-rural-plan\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003e$1 billion\u003c/u\u003e\u003c/a\u003e explicitly invested in building out the missing miles of broadband connections in rural communities. \u003c/p\u003e\u003cp\u003e\u0026#34;The Middle Mile program will invest more than $900 million in the infrastructure needed to connect communities, military bases, and tribal lands to the Internet, lower the cost of access, and increase bandwidth,\u0026#34; said Secretary of Commerce Gina Raimondo \u003ca href=\"https://www.commerce.gov/news/press-releases/2023/06/biden-harris-administration-announces-930-million-expand-and-strengthen\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003ein a statement\u003c/u\u003e\u003c/a\u003e. \u0026#34;Much like how the interstate highway system connected every community in America to regional and national systems of highways, this program will help us connect communities across the country to regional and national networks that provide quality, affordable high-speed Internet access.\u0026#34;\u003c/p\u003e\u003ch2\u003eThere\u0026#39;s a will, but the way is slow\u003c/h2\u003e\u003cp\u003eSo, with billions allocated, why are the numbers still showing so many disconnected Indigenous communities? \u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"mashablelightspeed\"\u003e\n        \u003cp\u003e\n            Mashable Light Speed\n        \u003c/p\u003e\n        \n        \n    \u003c/section\u003e\n\u003cp\u003e\u0026#34;Billions of dollars flew out the window to go build broadband. Most fiber projects are four years. So we\u0026#39;re not even halfway through that, in most cases. We\u0026#39;re coming up on halfway at the end of this year, \u0026#34; explained Matthew Rantanen, director of technology at the Southern California Tribal Chairmen\u0026#39;s Association and director of technology for the Tribal Digital Village, a self-sustained internet initiative. Rantanen has been involved in Indigenous internet connectivity for nearly a quarter-century, interacting with the FCC and acting as co-chair of the National Congress of American Indians (NCAI) first Tech and Telecom Subcommittee, developed in 2001. \u003c/p\u003e\u003cp\u003eAs Rantanen explains, these projects go through phases of approval before construction can even begin. Obtaining rights of way and easement on a fiber project is a minimum of 18 to 24 months, for example. The forestry department and Bureau of Land Management are consulted. State reserves and trusts may be involved. Once design and engineering plans are formulated and contracted, communities have to submit for approval from the federal Bureau of Indian Affairs. Projects under the first round of Tribal Connectivity Program funding are just now being deployed, which means results of this funding will be seen under the second Trump administration, years after they were announced. \u003c/p\u003e\u003cp\u003e\u0026#34;There\u0026#39;s a misunderstanding from the general public, and on the politician level. They are like, \u0026#39;Hey, where\u0026#39;s the results from this? We spit out all this money, but where\u0026#39;s the results?\u0026#39; Well, you know, Rome wasn\u0026#39;t built in a day. You invested long term in a solution that is going to start making a difference in the next couple of years. But don\u0026#39;t cut it off before it happens.\u0026#34;\u003c/p\u003e\u003cp\u003eThe same applies for major companies trying to connect their services. \u0026#34;It could take close to a year before we actually get shovels in the ground, maybe even a little more than a year,\u0026#34; explained AT\u0026amp;T\u0026#39;s California Tribal Liaison Julio Figueroa. Figueroa has worked for AT\u0026amp;T for 26 years, starting first as a call center service representative in the days of Pacific Bell (now owned by AT\u0026amp;T). In 2021, Figueroa was appointed as the tribal liaison for California, and now Nevada, the first person to hold such a position at the company.    \u003c/p\u003e\u003cp\u003eMeanwhile, just as their resulting construction projects begin, many of the early Biden administration programs have evolved or been phased out. Instead of the Affordable Connectivity Program, which was cut off from additional funding  in June, those seeking out more accessible internet options are now directed to an Federal Communication Commission (FCC) program called \u003ca href=\"https://www.lifelinesupport.org/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eLifeline\u003c/u\u003e\u003c/a\u003e, which connects low-income, displaced, and otherwise disconnected individuals to discounted broadband and telephone service under participating providers. People living on tribal land can apply for a \u003ca href=\"https://www.lifelinesupport.org/tribal-benefit/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003especial discounted benefit\u003c/u\u003e\u003c/a\u003e of $34.25 per month, but programs like these can only help those with the ability to get connected in the first place. \u003c/p\u003e\u003cq\u003e\n    If I were them, I would do everything in my power to contract those dollars and obligate those dollars prior to Inauguration Day.\n            \n    \u003c/q\u003e\n\u003cp\u003eEarlier this year, the FCC under Biden and Chair Jessica Rosenworcel \u003ca href=\"https://mashable.com/article/fcc-changes-broadband-speed-benchmark\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003eredefined broadband speed requirements\u003c/u\u003e\u003c/a\u003e, bumping up the paltry 25 mbps minimum to 100mbps. In doing so, the agency would be better able to pinpoint areas with poor internet access, especially among low income and rural communities, and get them on par with communities running above 100mbps. \u003c/p\u003e\u003cp\u003eThe state of federal funding under Trump administration 2.0, led by its cost cutting \u0026#34;\u003ca href=\"https://mashable.com/article/trump-elon-musk-doge-department-of-government-efficiency\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003eDepartment of Government Efficiency\u003c/u\u003e\u003c/a\u003e\u0026#34; and its new \u003ca href=\"https://mashable.com/article/trump-brendan-carr-fcc-net-neutrality\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003eFCC chair\u003c/u\u003e\u003c/a\u003e, looms over those dependent on such funding streams. Previous FCC heads, and other Republican politicians, have pushed back on updated broadband speed requirements and increased federal spending, prompting further concern about the future of Indigenous connectivity. Indigenous community advocates are wary that the former administration\u0026#39;s funding legacy will continue. \u003c/p\u003e\u003cp\u003e\u0026#34;The biggest concern that I\u0026#39;m hearing throughout Indian Country is that they\u0026#39;re worried about the money that they\u0026#39;ve already been granted. Is it going to go away? Is he going to put people in place that are intentionally going to be disruptive, and intentionally going to seek opportunities to draw that funding back?\u0026#34; said Rantanen. \u0026#34;There\u0026#39;s no support for tribes in the next administration. There\u0026#39;s a track record [with Trump]. What we\u0026#39;re led to believe, or to expect, is that that is par for the course \u003cem\u003eand\u003c/em\u003e he is going to be more effective at it. If I were [an Indigenous leader], I would do everything in my power to contract those dollars and obligate those dollars prior to Inauguration Day.\u0026#34;\u003c/p\u003e\u003ch2\u003ePrivate companies addressing the digital divide \u003c/h2\u003e\u003cp\u003eComplicating the tenuous funding future Rantanen describes, there\u0026#39;s a growing divide among tribal leaders as to what role internet service — and data privacy — plays in the push for tribal sovereignty. Should they take this on themselves, or should they call in the help of telecom companies with more might and more connections? The latter is an increasingly viable option as the market changes. Where there has historically been little draw to companies who don\u0026#39;t see a profit bump in these communities, some telecommunications companies have now found value in supplying their services to get rural and tribal areas connected with devices and broadband at lower costs — helped in part by federal funding that can beef up the margins. \u003c/p\u003e\u003cp\u003eLike the middle miles that are supposed to connect rural and tribal areas to the larger internet, Figueroa, the tribal liaison at AT\u0026amp;T, acts as an interlocutor between the vision of internet connectivity among tribal communities and a telecommunications giant like his employer. He is the single point of contact for leaders interested in working with the company to connect their communities to mainline phone service, broadband, and physical technology, like computers. \u003c/p\u003e\u003cp\u003eFigueroa has formed connections with the regional tribal chairpersons associations of California and the California Nations Indian Gaming Association (CNIGA), part of a larger goal of building trust with Indigenous leadership and their constituents before the timeline of construction begins. \u0026#34;Even if it\u0026#39;s a tribal citizen that\u0026#39;s having issues with their bill, they can come to me,\u0026#34; says Figueroa. \u003c/p\u003e\n\u003cp\u003e\u0026#34;There\u0026#39;s some nations that want to be their own internet provider on their tribal land. They want to exercise their sovereignty and be self-reliant. If there is no middle mile connection, AT\u0026amp;T can provide a connection to the internet,\u0026#34; Figueroa explained. \u0026#34;We place a fiber circuit to the border of the reservation, and from then on, they take it over. They\u0026#39;re fully responsible. They operate it. They service it for their tribal members.\u0026#34; \u003c/p\u003e\u003cp\u003eOther communities, however, don\u0026#39;t want to self-sustain their internet connections, instead entering into agreements with private companies, like AT\u0026amp;T, that will bring broadband internet to their areas – those connections remain owned and operated by the service providers. \u003c/p\u003e\u003cp\u003eFor example, AT\u0026amp;T has entered into a partnership with the San Pasqual Band of Mission Indians to launch one of its \u003ca href=\"https://www.attconnects.com/honoring-native-american-heritage-bridging-the-digital-divide-in-california-tribal-communities/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003ebiggest broadband connection projects yet\u003c/u\u003e\u003c/a\u003e, connecting 500 residents to a AT\u0026amp;T Fiber and 5GB network speeds, expected to go live in early 2025. The company is working with three other groups on similar projects, including California\u0026#39;s Rincon Band of Luiseño Indians, currently waiting on grants to be approved by the National Telecommunications and Information Administration. \u003c/p\u003e\u003cp\u003e\u0026#34;Once these tribal nations start deploying fiber optics, word is going to travel to other tribal nations,\u0026#34; said Figueroa. \u0026#34;They\u0026#39;re going to start hearing about the successes of being connected. And I think the government will need to look at another round of funding for the tribal nations that now want to adopt and get funding for construction.\u0026#34;\u003c/p\u003e\u003cp\u003eSpeaking to Mashable at the end of 2024, San Pasqual Chairman Stephen Cope explained that the decision to work with AT\u0026amp;T came from the accessibility and resources the company could offer — and a specific concern for getting younger residents connected and supported as soon as possible. \u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a great opportunity for San Pasqual,\u0026#34; explained Cope. \u0026#34;A lot of rural areas and reservations are limited in what they have, as far as broadband internet. We didn\u0026#39;t know where to really start.\u0026#34; Talking to other tribal leaders, Cope discovered many had signed deals with AT\u0026amp;T, and that\u0026#39;s when he reached out to Figueroa. The project began in early 2023, and its been a learning curve for both parties, Cope said, but it will also set a precedent for similar projects of its magnitude in southern California.\u003c/p\u003e\u003cq\u003e\n    Tribes should be defining their digital sovereignty playbook.\n            \n    \u003c/q\u003e\n\u003cp\u003e\u0026#34;There\u0026#39;s a lot of tribal members that are champing at the bit to get hooked up. Technology changes, and you got to be prepared for it. My goal is to make sure that we stay at least equal or ahead of the game, and provide what we need to provide,\u0026#34; said Cope, who described the AT\u0026amp;T deal as a predominantly equal partnership. \u0026#34;It\u0026#39;s moving, and I\u0026#39;m encouraging as many leaders as possible to take the opportunity.\u0026#34;\u003c/p\u003e\u003ch2\u003eRetaining control over digital lives \u003c/h2\u003e\u003cp\u003eRantanen, on the other hand, is spearheading the movement for fully Indigenous-owned and controlled internet service. \u003c/p\u003e\u003cp\u003eWhen Mashable \u003ca href=\"https://mashable.com/article/how-indigenous-communities-build-their-own-internet\" target=\"_self\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003efirst spoke\u003c/u\u003e\u003c/a\u003e to Rantanen in 2021, the Tribal Digital Village was operating tech centers and its own community-based network, \u003ca href=\"https://tdvnet.com/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eTDVNet\u003c/u\u003e\u003c/a\u003e, for hundreds of households within the oversight of the Southern California Tribal Chairman\u0026#39;s Association. Now, Rantanen leads more than a dozen tribal communities across California, Oregon, Washington, Montana, and even New York in building their own internet networks through the \u003ca href=\"https://tribalbroadbandbootcamp.org/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eTribal Broadband Bootcamp\u003c/u\u003e\u003c/a\u003e, a program started at the beginning of the 2021 funding boom and held in Rantanen\u0026#39;s own home to help guide leaders in application and development. The bootcamp has expanded with help from the Internet Society and inspired by the organization\u0026#39;s Indigenous Connectivity Summit.\u003c/p\u003e\u003cp\u003eThere\u0026#39;s also the \u003ca href=\"https://tribalresourcecenter.net/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eTribal Resource Center\u003c/u\u003e\u003c/a\u003e, a hub of validated articles, links, videos, and even people to assist tribal nations with adopting broadband technologies. The center\u0026#39;s three liaisons connect tribes with resources, operating under the concept of  \u0026#34;sovereign nations, sovereign networks.\u0026#34; \u003c/p\u003e\u003cp\u003eEarlier this year, the American Indian Policy Institute and the National Congress of American Indians launched the \u003ca href=\"https://aipi.asu.edu/ctds\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eCenter for Tribal Digital Sovereignty\u003c/u\u003e\u003c/a\u003e. \u0026#34;The center is intended to support tribes in defining parameters around all aspects of digital sovereignty, not just data sovereignty,\u0026#34; explained Rantanen. The concept of tribal digital sovereignty encompasses not just the network itself, but the transport of data, the mechanism of transport, the legality of storing tribal information on a cloud server not overseen by tribal leaders, protocols for handing over tribal data to law enforcement, and more. The rise of AI, and the notion of using tribal data to train models, poses ethical and political quandaries. \u003c/p\u003e\u003cp\u003eRantanen urges Indigenous communities, whether supported by federal dollars or the assistance of major companies, to retain control over their networks whenever possible. \u0026#34;It could be delayed control,\u0026#34; he said. \u0026#34;It may be something like three years so they can recover their losses and then they hand it over, but contractually set up your system so that the infrastructure on your sovereign territory is yours.\u0026#34;\u003c/p\u003e\u003cp\u003eIn addition to simply connecting these areas to broadband, Rantanen explains, \u0026#34;There\u0026#39;s a lot of definitions that need to be put into place about tribal sovereign data and tribal sovereign space — space that is being dictated by the federal government, dictated by corporations, dictated by people that are not us. Tribes should be defining their digital sovereignty playbook, and should be promoting that to the federal government, to the state government, to the county governments, and to the people they interact with.\u0026#34;\u003c/p\u003e\n\n                                        \n                    \u003c/article\u003e\n    \n    \n    \n            \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/authors/05mOEgYt2wjsOy1t4n2TjQ5/image.fill.size_100x100.v1624380988.jpg\" alt=\"Chase sits in front of a green framed window, wearing a cheetah print shirt and looking to her right. On the window\u0026#39;s glass pane reads \u0026#34;Ricas\u0026#39;s Tostadas\u0026#34; in red lettering.\" width=\"100\" height=\"100\" loading=\"lazy\"/\u003e\u003c/p\u003e\n                \u003c/div\u003e\n            \u003cp\u003eChase joined Mashable\u0026#39;s Social Good team in 2020, covering online stories about digital activism, climate justice, accessibility, and media representation. Her work also touches on how these conversations manifest in politics, popular culture, and fandom. Sometimes she\u0026#39;s very funny. \u003c/p\u003e\n        \u003c/div\u003e\n        \n        \n                    \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "22 min read",
  "publishedTime": "2025-01-13T20:57:49Z",
  "modifiedTime": "2025-01-13T20:57:49Z"
}
