{
  "id": "845503f2-ea26-40a3-a559-ae055d489283",
  "title": "We asked an intimacy coordinator about Gwyneth Paltrows dislike of intimacy coordinators",
  "link": "https://mashable.com/article/gwyneth-paltrow-marty-supreme-intimacy-coordinator",
  "description": "Intimacy coordinator Allie Oops explains the value of intimacy coordinators.",
  "author": "",
  "published": "Thu, 20 Mar 2025 17:14:23 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Anna Iovine",
  "length": 8619,
  "excerpt": "Paltrow, who helped break the Harvey Weinstein story, didn't know intimacy coordinators existed.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "Paltrow, who helped break the Harvey Weinstein story, didn't know intimacy coordinators existed. By Anna Iovine Anna Iovine Associate Editor, Features Anna Iovine is the associate editor of features at Mashable. Previously, as the sex and relationships reporter, she covered topics ranging from dating apps to pelvic pain. Before Mashable, Anna was a social editor at VICE and freelanced for publications such as Slate and the Columbia Journalism Review. Follow her on Bluesky. Read Full Bio  on March 20, 2025 Share on Facebook Share on Twitter Share on Flipboard Credit: Axelle / Bauer-Griffin / FilmMagic via Getty Images After the height of the #MeToo movement, intimacy coordinators — specialists making sure actors and others on set feel comfortable while filming intimate scenes — became more of the norm. From Sex Education to Babygirl, these experts' jobs are to make sex scenes safe to film and shine on screen.That doesn't mean everyone is a fan. This week, actor Gwyneth Paltrow said in an interview with Vanity Fair that she all but refused the intimacy coordinator in her upcoming movie Marty Supreme opposite internet boyfriend Timothée Chalamet.  \"There's now something called an intimacy coordinator, which I did not know existed,\" Paltrow told Vanity Fair. Paltrow and Chalamet apparently told the coordinator to refrain. \"We said, 'I think we're good. You can step a little bit back,' \" Paltrow said in the interview. \"I don't know how it is for kids who are starting out, but…if someone is like, 'Okay, and then he's going to put his hand here' …I would feel, as an artist, very stifled by that.\"When the coordinator asked if Paltrow was comfortable with a particular move, she reportedly said, \"Girl, I'm from the era where you get naked, you get in bed, the camera's on.\"That's certainly true. As Vanity Fair pointed out, convicted sex offender and producer Harvey Weinstein made unwanted sexual advances toward Paltrow when she was just starting out. She was an essential source in the bombshell 2017 New York Times story about Weinstein's abuses. The exposé was one of the reasons why #MeToo became so wide-reaching in 2017 — and that is partly why intimacy coordinators are becoming more common today. \"It's…kind of giving, 'I went through it, and I've survived, and I'm here,'\" said intimacy coordinator  Allie Oops in an interview with Mashable, \"rather than, 'What can we do to protect the next generation from me ever experiencing this?'\" Oops has worked with production companies like A24 and Neon, and consults on adult industry productions as well.Oops has seen that attitude towards more seasoned actors in her role as an intimacy coordinator, and she thinks Paltrow's experience is valid. Since Paltrow didn't know what intimacy coordinators do, she may not have talked with the one on set to give her a rundown of what would happen.  \"You wouldn't do a fight scene without a stunt coordinator.\" It could've also been an issue of personality fit. \"For all we know, that actual intimacy coordinator hired wasn't a great fit for her personality or for the production, and maybe it did feel a bit stifling,\" Oops said, \"but I think that it [an intimacy coordinator] does so much good. You wouldn't do a fight scene without a stunt coordinator.\" Mashable Top Stories Intimacy coordinators are there for safety, as a stunt coordinator is. They're also there to disrupt power on set. Many think the power is only actor-to-actor, said Oops — say, more established versus new, or older versus younger actor. But power comes from many places on set, she said, such as between a famous actor and the hair and makeup artist.\"I think having an intimacy coordinator isn't just for the actors. It's also to make the director feel comfortable, to make other people on the set feel comfortable,\" Oops said.If you're a household name like Gwyneth Paltrow, you hold power. But an unknown actor doesn't have that power, and thus that safety, to say no to something they don't want to do; they can risk getting fired or not getting hired for another gig. Intimacy coordinators act as advocates for actors in those situations. Ahead of a particular scene, the intimacy coordinator will find out what the actors are comfortable with and communicate that to the director to ensure their boundaries aren't being violated. Paltrow recognizes this, said Oops, when she mentions \"kids who are starting out.\" But she moves on to criticize the blocking (how actors are physically arranged) and choreography. In Oops' experience, a lot of people feel safer with a coordinator's help with blocking.\"And once you build that safe container, you have room to play within it. So it's not like you have to hit your hand here on the shoulder, but here isn't okay,\" Oops explained. \"It's more that everyone knows what's to be expected in a scene, and then from there, we can play around with it.\"While Paltrow felt stifled creativity, Oops believes building trust and safety lets actors be more creative. \"If you create a safe container, people have more freedom to relax into a role,\" she said. \"In my experience, there's a lot of talk about it, stifling creativity, creative energy. And I have found the opposite.\" She used an example of actors, the director, and the intimacy coordinator deciding the actors would kiss without tongue. \"Then you're not all of a sudden having a tongue shoved down your throat with no anticipation,\" she said. It also doesn't feel like your personal kissing skills are getting judged when you have talked through how the characters would kiss at that moment.\"You're able to relax into that role, and have more fun, and get more creative, and really fall into the character space,\" she continued.\"A good IC can also make a sex scene significantly better,\" Oops said.Comments like Paltrow's are bad for press reasons, as the intimacy coordinator role is so much about safety, but it's ultimately new for her, Oops said. But Oops has seen an overwhelmingly positive reaction to her work, which keeps her fueled and excited to be on set.Since Marty Supreme was probably a Screen Actors Guild (SAG, the actors' union) production, it was more likely than not to have an intimacy coordinator as SAG now has standards and protocols for having intimacy coordinators on set. And, from a liability standpoint, it's better to have one than not, Oops said. Last year, SAG tightened its rules about intimacy coordinators on set, especially concerning confidentiality. Coordinators can only speak about what went on during the creation of intimate scenes if actors and production give permission or if they're speaking to law enforcement. If they don't adhere to this, they could be potentially removed from SAG's registry after an investigation.So, despite Paltrow's comments, don't expect intimacy coordinators to go away anytime soon. Associate Editor, Features Anna Iovine is the associate editor of features at Mashable. Previously, as the sex and relationships reporter, she covered topics ranging from dating apps to pelvic pain. Before Mashable, Anna was a social editor at VICE and freelanced for publications such as Slate and the Columbia Journalism Review. Follow her on Bluesky. These newsletters may contain advertising, deals, or affiliate links. By clicking Subscribe, you confirm you are 16+ and agree to our Terms of Use and Privacy Policy.",
  "image": "https://helios-i.mashable.com/imagery/articles/07lrvwLdKnVKaPxwzLnVoSN/hero-image.fill.size_1200x675.v1742482845.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n        \n\n    \n        \n    \u003cp\u003ePaltrow, who helped break the Harvey Weinstein story, didn\u0026#39;t know intimacy coordinators existed.\u003c/p\u003e\n    \u003cdiv\u003e\n        \u003cdiv\u003e\u003cp\u003e\n                            By\n                                                                                                                                                    \u003c/p\u003e\u003cdiv aria-describedby=\"flyout\" x-data=\"{ showAuthor: false }\" @mouseover=\"showAuthor = true\" @mouseout=\"showAuthor = false\" @click=\"showAuthor = !showAuthor\" @click.outside=\"showAuthor = false\"\u003e\n                                    \u003cp\u003e\u003ca href=\"https://mashable.com/author/anna-iovine\"\u003eAnna Iovine\u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"flyout\" role=\"tooltip\" aria-label=\"Author Bio Flyout\" x-cloak=\"\" x-show=\"showAuthor\"\u003e\n            \n            \n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/authors/031XfQViFa19eBzOgOJOaiP/image.fill.size_1774x1974.v1673288127.jpg\" alt=\"anna iovine, a white woman with curly chin-length brown hair, smiles at the camera\" width=\"1774\" height=\"1974\"/\u003e\u003c/p\u003e\u003cdiv\u003e\n                        \u003cp\u003eAnna Iovine\u003c/p\u003e\n                        \u003cp\u003eAssociate Editor, Features\u003c/p\u003e\n                    \u003c/div\u003e\n                \u003c/div\u003e\n            \u003cp\u003e\n                Anna Iovine is the associate editor of features at Mashable. Previously, as the sex and relationships reporter, she covered topics ranging from dating apps to pelvic pain. Before Mashable, Anna was a social editor at VICE and freelanced for publications such as Slate and the Columbia Journalism Review. Follow her on \u003ca href=\"https://bsky.app/profile/annaroseiovine.bsky.social\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eBluesky\u003c/a\u003e.\n            \u003c/p\u003e\n            \u003cp\u003e\u003ca data-module=\"author-byline\" data-item=\"author-list\" data-element=\"author-name\" data-position=\"1\" href=\"https://mashable.com/author/anna-iovine\" aria-label=\"\u0026#39;s Full Author Bio\"\u003eRead Full Bio\u003c/a\u003e\n        \u003c/p\u003e\u003c/div\u003e\n                                \u003c/div\u003e\u003cp\u003e\n                                                                                                                             on \u003ctime datetime=\"Thu, 20 Mar 2025 17:14:23 +0000\"\u003eMarch 20, 2025\u003c/time\u003e\n                                    \u003c/p\u003e\u003c/div\u003e\n        \u003cp\u003e\n                            \u003ca href=\"https://www.facebook.com/sharer.php?u=https%3A%2F%2Fmashable.com%2Farticle%2Fgwyneth-paltrow-marty-supreme-intimacy-coordinator\" data-ga-element=\"social-share-link\" data-ga-action=\"social_share_link\" data-ga-position=\"1\" data-ga-label=\"facebook\" data-ga-click=\"\" aria-label=\"Facebook Share\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003e\n    \u003csvg\u003e\u003cuse href=\"/images/icons/spritemap.svg#sprite-facebook-f-brands\"\u003e\u003c/use\u003e\u003c/svg\u003e\n    \u003cspan\u003eShare on Facebook\u003c/span\u003e\n\u003c/a\u003e\n\u003ca href=\"https://twitter.com/intent/tweet?url=https%3A%2F%2Fmashable.com%2Farticle%2Fgwyneth-paltrow-marty-supreme-intimacy-coordinator\u0026amp;text=We+asked+an+intimacy+coordinator+about+Gwyneth+Paltrow%27s+dislike+of+intimacy+coordinators\" data-ga-element=\"social-share-link\" data-ga-action=\"social_share_link\" data-ga-position=\"2\" data-ga-label=\"twitter\" data-ga-click=\"\" aria-label=\"Twitter Share\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003e\n    \u003csvg\u003e\u003cuse href=\"/images/icons/spritemap.svg#sprite-twitter-brands\"\u003e\u003c/use\u003e\u003c/svg\u003e\n    \u003cspan\u003eShare on Twitter\u003c/span\u003e\n\u003c/a\u003e\n\u003ca href=\"https://share.flipboard.com/bookmarklet/popout?v=2\u0026amp;url=https%3A%2F%2Fmashable.com%2Farticle%2Fgwyneth-paltrow-marty-supreme-intimacy-coordinator\u0026amp;title=We+asked+an+intimacy+coordinator+about+Gwyneth+Paltrow%27s+dislike+of+intimacy+coordinators\" data-ga-element=\"social-share-link\" data-ga-action=\"social_share_link\" data-ga-position=\"3\" data-ga-label=\"flipboard\" data-ga-click=\"\" aria-label=\"Flipboard Share\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003e\n    \u003csvg\u003e\u003cuse href=\"/images/icons/spritemap.svg#sprite-flipboard-brands\"\u003e\u003c/use\u003e\u003c/svg\u003e\n    \u003cspan\u003eShare on Flipboard\u003c/span\u003e\n\u003c/a\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\n    \n\u003c/div\u003e\u003csection data-ga-module=\"content_body\"\u003e\n                        \u003cdiv\u003e\n                \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/articles/07lrvwLdKnVKaPxwzLnVoSN/hero-image.fill.size_1248x702.v1742482845.jpg\" alt=\"actor gwyneth paltrow in front of pink backdrop\" width=\"1248\" height=\"702\" srcset=\"https://helios-i.mashable.com/imagery/articles/07lrvwLdKnVKaPxwzLnVoSN/hero-image.fill.size_400x225.v1742482845.jpg 400w, https://helios-i.mashable.com/imagery/articles/07lrvwLdKnVKaPxwzLnVoSN/hero-image.fill.size_800x450.v1742482845.jpg 800w, https://helios-i.mashable.com/imagery/articles/07lrvwLdKnVKaPxwzLnVoSN/hero-image.fill.size_1248x702.v1742482845.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCredit: Axelle / Bauer-Griffin / FilmMagic via Getty Images\u003c/span\u003e\n                            \u003c/p\u003e\n                        \u003c/div\u003e\n\n    \n    \n    \n            \u003carticle id=\"article\" data-autopogo=\"\"\u003e\n                                    \u003cp\u003eAfter the height of the #MeToo movement, intimacy coordinators — specialists making sure actors and others on set feel comfortable while filming intimate scenes — became more of the norm. From \u003ca href=\"https://mashable.com/article/sex-education-sex-scenes-me-too-teen-genre\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cem\u003e\u003cu\u003eSex Education\u003c/u\u003e\u003c/em\u003e\u003c/a\u003e\u003cem\u003e \u003c/em\u003eto \u003ca href=\"https://mashable.com/article/babygirl-dom-sub-halina-reijn-nicole-kidman-harris-dickinson\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cem\u003e\u003cu\u003eBabygirl\u003c/u\u003e\u003c/em\u003e\u003c/a\u003e, these experts\u0026#39; jobs are to make sex scenes safe to film and shine on screen.\u003c/p\u003e\u003cp\u003eThat doesn\u0026#39;t mean everyone is a fan. This week, actor \u003ca href=\"https://www.vanityfair.com/hollywood/story/gwyneth-paltrow-2025-interview?srsltid=AfmBOopbNEDCBtdemALyqUB133QjQeP7nZyyJdP23dwhXLGu_VVOlYFl\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eGwyneth Paltrow said in an interview\u003c/u\u003e\u003c/a\u003e with \u003cem\u003eVanity Fair \u003c/em\u003ethat she all but refused the intimacy coordinator in her upcoming movie \u003cem\u003eMarty Supreme \u003c/em\u003eopposite internet boyfriend \u003ca href=\"https://mashable.com/article/timothee-chalamet-lookalike-contest\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cu\u003eTimothée Chalamet\u003c/u\u003e\u003c/a\u003e. \u003c/p\u003e\n\u003cp\u003e\u0026#34;There\u0026#39;s now something called an intimacy coordinator, which I did not know existed,\u0026#34; Paltrow told \u003cem\u003eVanity Fair\u003c/em\u003e. \u003c/p\u003e\u003cp\u003ePaltrow and Chalamet apparently told the coordinator to refrain. \u0026#34;We said, \u0026#39;I think we\u0026#39;re good. You can step a little bit back,\u0026#39; \u0026#34; Paltrow said in the interview. \u0026#34;I don\u0026#39;t know how it is for kids who are starting out, but…if someone is like, \u0026#39;Okay, and then he\u0026#39;s going to put his hand here\u0026#39; …I would feel, as an artist, very stifled by that.\u0026#34;\u003c/p\u003e\u003cp\u003eWhen the coordinator asked if Paltrow was comfortable with a particular move, she reportedly said, \u0026#34;Girl, I\u0026#39;m from the era where you get naked, you get in bed, the camera\u0026#39;s on.\u0026#34;\u003c/p\u003e\u003cp\u003eThat\u0026#39;s certainly true. As \u003cem\u003eVanity Fair\u003c/em\u003e pointed out, convicted sex offender and producer Harvey Weinstein made unwanted sexual advances toward Paltrow when she was just starting out. She was an \u003ca href=\"https://www.vanityfair.com/hollywood/2019/09/harvey-weinstein-gwyneth-paltrow-ashley-judd-jodi-kantor-megan-twohey\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eessential source in the bombshell 2017 \u003cem\u003eNew York Times \u003c/em\u003e\u003c/u\u003e\u003cu\u003estory\u003c/u\u003e\u003c/a\u003e about Weinstein\u0026#39;s abuses. The \u003ca href=\"https://mashable.com/article/jodi-kantor-megan-twohey-history-becomes-her\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eexposé\u003c/a\u003e was one of the reasons why #MeToo became so wide-reaching in 2017 — and that is partly why intimacy coordinators are becoming more common today.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It\u0026#39;s…kind of giving, \u0026#39;I went through it, and I\u0026#39;ve survived, and I\u0026#39;m here,\u0026#39;\u0026#34; said intimacy coordinator  \u003ca href=\"https://allieoops.com/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eAllie Oops\u003c/u\u003e\u003c/a\u003e in an interview with Mashable, \u0026#34;rather than, \u0026#39;What can we do to protect the next generation from me ever experiencing this?\u0026#39;\u0026#34; Oops has worked with production companies like A24 and Neon, and consults on adult industry productions as well.\u003c/p\u003e\u003cp\u003eOops has seen that attitude towards more seasoned actors in her role as an intimacy coordinator, and she thinks Paltrow\u0026#39;s experience is valid. Since Paltrow didn\u0026#39;t know what intimacy coordinators do, she may not have talked with the one on set to give her a rundown of what would happen. \u003c/p\u003e\u003cq\u003e\n    \u0026#34;You wouldn\u0026#39;t do a fight scene without a stunt coordinator.\u0026#34;\n    \u003c/q\u003e\n\u003cp\u003eIt could\u0026#39;ve also been an issue of personality fit. \u0026#34;For all we know, that actual intimacy coordinator hired wasn\u0026#39;t a great fit for her personality or for the production, and maybe it did feel a bit stifling,\u0026#34; Oops said, \u0026#34;but I think that it [an intimacy coordinator] does so much good. You wouldn\u0026#39;t do a fight scene without a stunt coordinator.\u0026#34;\u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"top-stories\"\u003e\n        \u003cp\u003e\n            Mashable Top Stories\n        \u003c/p\u003e\n        \n        \n    \u003c/section\u003e\n\u003cp\u003eIntimacy coordinators are there for safety, as a stunt coordinator is. They\u0026#39;re also there to disrupt power on set. Many think the power is only actor-to-actor, said Oops — say, more established versus new, or older versus younger actor. But power comes from many places on set, she said, such as between a famous actor and the hair and makeup artist.\u003c/p\u003e\u003cp\u003e\u0026#34;I think having an intimacy coordinator isn\u0026#39;t just for the actors. It\u0026#39;s also to make the director feel comfortable, to make other people on the set feel comfortable,\u0026#34; Oops said.\u003c/p\u003e\u003cp\u003eIf you\u0026#39;re a household name like Gwyneth Paltrow, you hold power. But an unknown actor doesn\u0026#39;t have that power, and thus that safety, to say no to something they don\u0026#39;t want to do; they can risk getting fired or not getting hired for another gig. Intimacy coordinators act as advocates for actors in those situations. Ahead of a particular scene, the intimacy coordinator will find out what the actors are comfortable with and communicate that to the director to ensure their boundaries aren\u0026#39;t being violated. \u003c/p\u003e\u003cp\u003ePaltrow recognizes this, said Oops, when she mentions \u0026#34;kids who are starting out.\u0026#34; But she moves on to criticize the blocking (how actors are physically arranged) and choreography. In Oops\u0026#39; experience, a lot of people feel safer with a coordinator\u0026#39;s help with blocking.\u003c/p\u003e\u003cp\u003e\u0026#34;And once you build that safe container, you have room to play within it. So it\u0026#39;s not like you have to hit your hand \u003cem\u003ehere\u003c/em\u003e on the shoulder, but \u003cem\u003ehere\u003c/em\u003e isn\u0026#39;t okay,\u0026#34; Oops explained. \u0026#34;It\u0026#39;s more that everyone knows what\u0026#39;s to be expected in a scene, and then from there, we can play around with it.\u0026#34;\u003c/p\u003e\u003cp\u003eWhile Paltrow felt stifled creativity, Oops believes building trust and safety lets actors be more creative. \u0026#34;If you create a safe container, people have more freedom to relax into a role,\u0026#34; she said. \u0026#34;In my experience, there\u0026#39;s a lot of talk about it, stifling creativity, creative energy. And I have found the opposite.\u0026#34;\u003c/p\u003e\n\u003cp\u003eShe used an example of actors, the director, and the intimacy coordinator deciding the actors would kiss without tongue. \u0026#34;Then you\u0026#39;re not all of a sudden having a tongue shoved down your throat with no anticipation,\u0026#34; she said. It also doesn\u0026#39;t feel like your personal kissing skills are getting judged when you have talked through how the characters would kiss at that moment.\u003c/p\u003e\u003cp\u003e\u0026#34;You\u0026#39;re able to relax into that role, and have more fun, and get more creative, and really fall into the character space,\u0026#34; she continued.\u003c/p\u003e\u003cp\u003e\u0026#34;A good IC can also make a sex scene significantly better,\u0026#34; Oops said.\u003c/p\u003e\u003cp\u003eComments like Paltrow\u0026#39;s are bad for press reasons, as the intimacy coordinator role is so much about safety, but it\u0026#39;s ultimately new for her, Oops said. But Oops has seen an overwhelmingly positive reaction to her work, which keeps her fueled and excited to be on set.\u003c/p\u003e\u003cp\u003eSince \u003cem\u003eMarty Supreme \u003c/em\u003ewas probably a Screen Actors Guild (SAG, the actors\u0026#39; union) production, it was more likely than not to have an intimacy coordinator as SAG now has \u003ca href=\"https://www.sagaftra.org/standards-and-protocols-use-intimacy-coordinators-0\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003estandards and protocols for having intimacy coordinators\u003c/u\u003e\u003c/a\u003e on set. And, from a liability standpoint, it\u0026#39;s better to have one than not, Oops said. \u003c/p\u003e\u003cp\u003eLast year, \u003ca href=\"https://deadline.com/2024/02/intimacy-coordinator-rules-tightened-sag-aftra-jenna-ortega-1235834577/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eSAG tightened its rules about intimacy coordinators\u003c/a\u003e on set, especially concerning confidentiality. Coordinators can only speak about what went on during the creation of intimate scenes if actors and production give permission or if they\u0026#39;re speaking to law enforcement. If they don\u0026#39;t adhere to this, they could be potentially removed from SAG\u0026#39;s registry after an investigation.\u003c/p\u003e\u003cp\u003eSo, despite Paltrow\u0026#39;s comments, don\u0026#39;t expect intimacy coordinators to go away anytime soon.\u003c/p\u003e\n\n                                        \n                    \u003c/article\u003e\n    \n    \n    \n            \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/authors/031XfQViFa19eBzOgOJOaiP/image.fill.size_100x100.v1673288127.jpg\" alt=\"anna iovine, a white woman with curly chin-length brown hair, smiles at the camera\" width=\"100\" height=\"100\" loading=\"lazy\"/\u003e\u003c/p\u003e\u003cdiv\u003e\n                        \n                        \u003cp\u003eAssociate Editor, Features\u003c/p\u003e\n                    \u003c/div\u003e\n                \u003c/div\u003e\n            \u003cp\u003eAnna Iovine is the associate editor of features at Mashable. Previously, as the sex and relationships reporter, she covered topics ranging from dating apps to pelvic pain. Before Mashable, Anna was a social editor at VICE and freelanced for publications such as Slate and the Columbia Journalism Review. Follow her on \u003ca href=\"https://bsky.app/profile/annaroseiovine.bsky.social\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eBluesky\u003c/a\u003e.\u003c/p\u003e\n        \u003c/div\u003e\n        \n        \n                    \u003c/section\u003e\u003cdiv x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"footer_nl_signup\" data-ga-label=\"Top Stories\"\u003e\n    \n\n    \u003cp\u003e\n        These newsletters may contain advertising, deals, or affiliate links. By clicking Subscribe, you confirm you are 16+ and agree to our \u003ca href=\"https://www.ziffdavis.com/terms-of-use\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003eTerms of Use\u003c/a\u003e and \u003ca href=\"https://www.ziffdavis.com/ztg-privacy-policy\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003ePrivacy Policy\u003c/a\u003e.\n    \u003c/p\u003e\n    \n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-03-20T17:14:23Z",
  "modifiedTime": "2025-03-20T17:14:31Z"
}
