{
  "id": "863e75ea-4b27-478a-bb4f-81d23e6f136d",
  "title": "Man Used ChatGPT To Plan Las Vegas Cybertruck Blast",
  "link": "https://yro.slashdot.org/story/25/01/08/0019223/man-used-chatgpt-to-plan-las-vegas-cybertruck-blast?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "According to police, the man killed in the January 1st Las Vegas Cybertruck blast used ChatGPT to plan the explosion. The Hill reports: In a press conference, Tuesday, Las Vegas police released more details of the intentions of 37-year-old Matthew Livelsberger, who died of a gunshot wound prior to the car exploding. Las Vegas Sheriff Kevin McMahill said it was concerning that Livelsberger used ChatGPT, a popular artificial intelligence model created by OpenAI, to carry out the explosion. According to police, Livelsberger asked ChatGPT various questions, including where the largest gun stores in Denver were, information about the explosive targets Tannerite and pistols. \"We knew that AI was going to change the game at some point or another in really all of our lives and certainly, I think this is the first incidence that I'm aware of on U.S. soil where ChatGPT is utilized to help an individual build a particular device, to learn information all across the country as they're moving forward,\" McMahill said. \"And so, absolutely, it's a concerning moment for us,\" he continued. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2025-01-08T00:40:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "crime"
  ],
  "byline": "",
  "length": 1092,
  "excerpt": "According to police, the man killed in the January 1st Las Vegas Cybertruck blast used ChatGPT to plan the explosion. The Hill reports: In a press conference, Tuesday, Las Vegas police released more details of the intentions of 37-year-old Matthew Livelsberger, who died of a gunshot wound prior to ...",
  "siteName": "",
  "favicon": "",
  "text": "According to police, the man killed in the January 1st Las Vegas Cybertruck blast used ChatGPT to plan the explosion. The Hill reports: In a press conference, Tuesday, Las Vegas police released more details of the intentions of 37-year-old Matthew Livelsberger, who died of a gunshot wound prior to the car exploding. Las Vegas Sheriff Kevin McMahill said it was concerning that Livelsberger used ChatGPT, a popular artificial intelligence model created by OpenAI, to carry out the explosion. According to police, Livelsberger asked ChatGPT various questions, including where the largest gun stores in Denver were, information about the explosive targets Tannerite and pistols. \"We knew that AI was going to change the game at some point or another in really all of our lives and certainly, I think this is the first incidence that I'm aware of on U.S. soil where ChatGPT is utilized to help an individual build a particular device, to learn information all across the country as they're moving forward,\" McMahill said. \"And so, absolutely, it's a concerning moment for us,\" he continued.",
  "image": "https://a.fsdn.com/sd/topics/crime_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-175848603\"\u003e\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tAccording to police, the man killed in the January 1st Las Vegas Cybertruck blast \u003ca href=\"https://thehill.com/policy/technology/5072577-las-vegas-cybertruck-blast-chatgpt/\"\u003eused ChatGPT to plan the explosion\u003c/a\u003e. The Hill reports: \u003ci\u003e In a \u003ca href=\"https://www.youtube.com/watch?v=LnB6xVjxRmg\"\u003epress conference\u003c/a\u003e, Tuesday, Las Vegas police released more details of the intentions of 37-year-old Matthew Livelsberger, who died of a gunshot wound prior to the car exploding. Las Vegas Sheriff Kevin McMahill said it was concerning that Livelsberger used ChatGPT, a popular artificial intelligence model created by OpenAI, to carry out the explosion. According to police, Livelsberger asked ChatGPT various questions, including where the largest gun stores in Denver were, information about the explosive targets Tannerite and pistols. \u003c/i\u003e \u0026#34;We knew that AI was going to change the game at some point or another in really all of our lives and certainly, I think this is the first incidence that I\u0026#39;m aware of on U.S. soil where ChatGPT is utilized to help an individual build a particular device, to learn information all across the country as they\u0026#39;re moving forward,\u0026#34; McMahill said.\n\u003c/p\u003e\u003cp\u003e \n\u0026#34;And so, absolutely, it\u0026#39;s a concerning moment for us,\u0026#34; he continued.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
