{
  "id": "8ef35434-55c0-4c79-b3e9-2083040e3962",
  "title": "Lyft’s New ‘Silver’ Accounts Should Make Hailing a Rideshare Easier for Older Passengers",
  "link": "https://lifehacker.com/travel/lyft-is-making-it-easier-for-older-riders?utm_medium=RSS",
  "description": "\"Lyft Silver\" includes live phone support for U.S. passengers.",
  "author": "Emily Long",
  "published": "Fri, 02 May 2025 21:30:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Travel"
  ],
  "byline": "Emily Long",
  "length": 2233,
  "excerpt": "\"Lyft Silver\" includes live phone support for U.S. passengers.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "Rideshare services are convenient, but accessing them can prove a challenge to less tech-savvy potential passengers, particularly older adults. But companies are introducing changes that make their services easier for these groups to access. Lyft Silver is a new account type that, like Women+ Connect (aimed at women and nonbinary passengers), makes it simpler and safer to hail a ride and get support when needed. Lyft Silver has several features to make rideshare services more accessible to older adults. With a Lyft Silver account, users will see a redesigned version of the app with larger fonts and simpler navigation. The app will prioritize matching Lyft Silver users with vehicles that are easy to get into and out of, and allow them to share real-time ride details with trusted contacts. Lyft will also offer live phone support between 8 a.m. and 9 p.m. ET to assist Lyft Silver riders in the U.S. How to access Lyft SilverLyft Silver will be available nationwide on May 5 to the first 25,000 riders to enroll in the service, with wait list signups open now. To enable Lyft Silver in the Lyft app, tap You on the bottom right menu bar and select Lyft Silver. You can also gift Lyft Silver to a friend or family member and fund their rides with Lyft Cash. Send an invite from the Lyft Silver page in the app—the recipient will get a link via text to turn the service on (and be prompted download the app if they don't already have it). You can add a gift card with the invite, which will automatically apply Lyft Cash to the recipient's account. What do you think so far? Uber also has options for older ridersLyft competitor Uber also has features built for older riders. A senior account has a \"simple mode\" for the Uber app, with larger text and icons, fewer ride options, prominent saved locations, and a streamlined booking process. Simple mode is automatically on for senior accounts, but can be disabled under Account \u003e Settings \u003e Accessibility \u003e Simple mode. Uber senior accounts can be set up by a family organizer, and health benefits cards can be added for eligible rides, such as transportation to and from medical appointments.",
  "image": "https://lifehacker.com/imagery/articles/01JT8XFWCXEMJ35NR43MB9DBTF/hero-image.fill.size_1200x675.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eRideshare services are convenient, but accessing them can prove a challenge to less tech-savvy potential passengers, particularly older adults. But companies are introducing changes that make their services easier for these groups to access. Lyft Silver is a new account type that, \u003ca href=\"https://lifehacker.com/travel/you-can-now-request-women-and-nonbinary-lyft-drivers\" target=\"_blank\"\u003elike Women+ Connect\u003c/a\u003e (aimed at women and nonbinary passengers), makes it simpler and safer to hail a ride and get support when needed. \u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.lyft.com/rider/silver\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eLyft Silver has several features\u003c/a\u003e to make rideshare services more accessible to older adults. With a Lyft Silver account, users will see a redesigned version of the app with larger fonts and simpler navigation. The app will prioritize matching Lyft Silver users with vehicles that are easy to get into and out of, and allow them to share real-time ride details with trusted contacts. \u003c/p\u003e\u003cp\u003eLyft will also offer live phone support between 8 a.m. and 9 p.m. ET to assist Lyft Silver riders in the U.S. \u003c/p\u003e\u003ch2 id=\"how-to-access-lyft-silver\"\u003eHow to access Lyft Silver\u003c/h2\u003e\u003cp\u003eLyft Silver will be available nationwide on May 5 to the first 25,000 riders to enroll in the service, with \u003ca href=\"https://www.lyft.com/rider/silver\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ewait list signups open now\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eTo enable Lyft Silver in the Lyft app, tap \u003cstrong\u003eYou\u003c/strong\u003e on the bottom right menu bar and select \u003cstrong\u003eLyft Silver\u003c/strong\u003e. You can also gift Lyft Silver to a friend or family member and fund their rides with Lyft Cash. Send an invite from the Lyft Silver page in the app—the recipient will get a link via text to turn the service on (and be prompted download the app if they don\u0026#39;t already have it). You can add a gift card with the invite, which will automatically apply Lyft Cash to the recipient\u0026#39;s account. \u003c/p\u003e\u003cdiv data-ga-click=\"\" data-ga-template=\"News\" data-ga-module=\"openweb_widget\" data-ga-element=\"openweb_scroll\" data-ga-item=\"openweb_scroll_midpage\" x-cloak=\"\" x-data=\"{ commentsCount: null, hasComments: false }\" x-init=\"commentsCount = await window.openweb.getMessagesCount(01JT8XFWCXEMJ35NR43MB9DBTF);\n     hasComments = commentsCount !== null \u0026amp;\u0026amp; commentsCount \u0026gt; 0\"\u003e\n            \n\n            \u003cp\u003e\u003cspan\u003e\n                What do you think so far?\n                \n            \u003c/span\u003e\n        \u003c/p\u003e\u003c/div\u003e\n\u003ch2 id=\"uber-also-has-options-for-older-riders\"\u003eUber also has options for older riders\u003c/h2\u003e\u003cp\u003eLyft competitor Uber \u003ca href=\"https://help.uber.com/en/riders/article/uber-for-seniors-faqs?nodeId=61c69dd2-22e1-4bb3-98ad-4244538ec1a8\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ealso has features built for older riders\u003c/a\u003e. A senior account has a \u0026#34;simple mode\u0026#34; for the Uber app, with larger text and icons, fewer ride options, prominent saved locations, and a streamlined booking process. Simple mode is automatically on for senior accounts, but can be disabled under \u003cstrong\u003eAccount \u0026gt; Settings \u0026gt; Accessibility \u0026gt; Simple mode\u003c/strong\u003e. \u003c/p\u003e\u003cp\u003eUber senior accounts can be set up by a family organizer, and health benefits cards can be added for eligible rides, such as transportation to and from medical appointments. \u003c/p\u003e\n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-02T21:30:00Z",
  "modifiedTime": "2025-05-02T21:30:00Z"
}
