{
  "id": "94d0db03-85b6-40bf-bd26-1f9e4ff6a4e6",
  "title": "Are Boeing’s problems beyond fixable?",
  "link": "https://arstechnica.com/tech-policy/2024/10/are-boeings-problems-beyond-fixable/",
  "description": "A new CEO promises a culture change as the aerospace titan is struggling hard.",
  "author": "Claire Bushey and Philip Georgiadis, Financial Times",
  "published": "Sat, 26 Oct 2024 12:15:05 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Policy",
    "aviation",
    "Boeing",
    "Boeing 737 MAX",
    "syndication"
  ],
  "byline": "Financial Times",
  "length": 10744,
  "excerpt": "A new CEO promises a culture change as the aerospace titan is struggling hard.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "A new CEO promises a culture change as the aerospace titan is struggling hard. Credit: Getty Images | Olivier Douliery As Boeing’s latest chief executive, Kelly Ortberg’s job was never going to be easy. On Wednesday, it got harder still. That morning, Ortberg had faced investors for the first time, telling them that ending a debilitating strike by Boeing’s largest union was the first step to stabilizing the plane maker’s business. But as the day wore on, it became clear that nearly two-thirds of the union members who voted on the company’s latest contract offer had rejected it. The six-week strike goes on, costing Boeing an estimated $50 million a day, pushing back the day it can resume production of most aircraft and further stressing its supply chain. The company that virtually created modern commercial aviation has spent the better part of five years in chaos, stemming from fatal crashes, a worldwide grounding, a guilty plea to a criminal charge, a pandemic that halted global air travel, a piece breaking off a plane in mid-flight and now a strike. Boeing’s finances look increasingly fragile and its reputation has been battered. Bank of America analyst Ron Epstein says Boeing is a titan in a crisis largely of its own making, comparing it to the Hydra of Greek mythology: “For every problem that’s come to a head, then [been] severed, more problems sprout up.” Resolving Boeing’s crisis is critical to the future of commercial air travel, as most commercial passenger aircraft are made by it or its European rival Airbus, which has little capacity for new customers until the 2030s. Ortberg, a 64-year-old Midwesterner who took the top job three months ago, says his mission is “pretty straightforward—turn this big ship in the right direction and restore Boeing to the leadership position that we all know and want.” Resolving the machinists’ strike is just the start of the challenges he faces. He needs to motivate the workforce, even as 33,000 are on strike and 17,000 face redundancy under a cost-cutting initiative. He must persuade investors to support an equity raise in an industry where the returns could take years to materialize. He needs to fix Boeing’s quality control and manufacturing issues, and placate its increasingly frustrated customers, who have had to rejig their schedules and cut flights owing to delays in plane deliveries. “I’ve never seen anything like it in our industry, to be honest. I’ve been around 30 years,” Carsten Spohr, chief executive of German flag carrier Lufthansa, said this month. Eventually, Boeing needs to launch a new aircraft model to better compete with Airbus. “If Kelly fixes this, he is a hero,” says Melius Research analyst Rob Spingarn. “But it’s very complex. There’s a lot of different things to fix.” Ortberg started his career as a mechanical engineer and went on to run Rockwell Collins, an avionics supplier to Boeing, until it was sold to engineering conglomerate United Technologies in 2018. His engineering background has been welcomed by many who regard previous executives’ emphasis on shareholder returns as the root cause of many of Boeing’s engineering and manufacturing problems. Longtime employees often peg the shift in Boeing’s culture to its 1997 merger with rival McDonnell Douglas. Phil Condit and Harry Stonecipher, who ran Boeing in the late 1990s and early 2000s, were admirers of Jack Welch, the General Electric chief executive known for financial engineering and ruthless cost cuts. Condit even moved Boeing’s headquarters from its manufacturing base in Seattle to Chicago in 2001, so the “corporate center” would no longer be “drawn into day-to-day business operations.” Jim McNerney, another Welch acolyte, instituted a program to boost Boeing’s profits by squeezing its suppliers during his decade in charge. He remarked on a 2014 earnings call about employees “cowering” before him, a dark quip still cited a decade later to explain Boeing’s tense relationship with its workers. Ken Ogren, a member of the International Association of Machinists and Aerospace Workers District 751, says managers at Boeing often felt pressured to move planes quickly through the factory. “We’ve had a lot of bean counters come through, and I’m going to be in the majority with a lot of people who believe they’ve been tripping over dollars to save pennies,” he says. Dennis Muilenburg headed the company in October 2018, when a new 737 Max crashed off the coast of Indonesia. Five months later, another Max crashed shortly after take-off in Ethiopia. In total, 346 people lost their lives. Regulators worldwide grounded the plane—a cash cow and a vital product in Boeing’s competition with Airbus—for nearly two years. Investigations eventually showed a faulty sensor triggered an anti-stall system, repeatedly forcing the aircraft’s nose downward. Boeing agreed in July to plead guilty to a criminal charge of fraud for misleading regulators about the plane’s design. Families of the crash victims are opposing the plea deal, which is before a federal judge for approval. The manufacturer’s problems were compounded by COVID-19, which grounded aircraft worldwide and led many airlines to hold off placing new orders and pause deliveries of existing ones. Boeing’s debt ballooned as it issued $25 billion in bonds to see it through the crisis. Regulators cleared the 737 Max to fly again, starting in November 2020. But hopes that Boeing was finally on top of its problems were shattered last January, when a door panel that was missing bolts blew off an Alaska Airlines jet at 16,000 feet. While no one was injured, the incident triggered multiple investigations and an audit by the US Federal Aviation Administration, which found lapses in Boeing’s manufacturing and quality assurance processes and led to an uncomfortable appearance by then chief executive Dave Calhoun at a Senate subcommittee hearing. The company also has struggled with its defense and space businesses. Fixed-price contracts on several military programs have resulted in losses and billions of dollars of one-off charges. Meanwhile, problems with its CST-100 Starliner spacecraft resulted in two astronauts being left on the International Space Station. SpaceX’s Crew Dragon vehicle will be used to return them to Earth early next year. Boeing’s stumbles have resulted in loss of life, loss of prestige, and a net financial loss every year since 2019. On Wednesday, it reported a $6 billion loss between July and September, the second-worst quarterly result in its history. One of Ortberg’s first big moves as chief executive was to move himself—from his Florida home to a house in Seattle. He told analysts that Boeing’s executives “need to be on the factory floors, in the back shops, and in our engineering labs” to be more in tune with the company’s products and workforce. Change in Boeing’s corporate culture must “be more than the poster on the wall,” he added. His approach represents a shift from his predecessor Calhoun, who was criticized for spending more time in New Hampshire and South Carolina than in Boeing’s factories in Washington state. Bill George, former chief executive at Medtronic and an executive fellow at Harvard Business School, says Ortberg is doing a “terrific job” so far, particularly for moving to the Pacific Northwest and pressuring other itinerant executives to follow. “If you’re based in Florida, and you come occasionally, what do you really know about what’s going on in the business?” he says, adding that Boeing has “no business being in Arlington, Virginia,” where the company moved its headquarters in 2022. Scott Kirby, chief executive at one of Boeing’s biggest customers, United Airlines, told his own investors this month that he was “encouraged” by Ortberg’s early moves, adding that the company suffered for decades from “a cultural challenge, where they focused on short-term profitability and the short-term stock price at the expense of what made Boeing great, which is building great products.” “Kelly Ortberg is pivoting the company back to their roots,” he said. “All the employees of Boeing will rally around that.” But Ogren of the machinists’ union cautions that previous commitments to culture change have been hollow. “You’ve got people at the top saying, ‘We’ve got to be safe, oh, and by the way, we need these planes out the door...’ They said the right thing. They didn’t emphasize it, and that’s not what they put pressure on the managers to achieve.” When workers eventually return to work—Peter Arment, an analyst at Baird, expects the dispute to be resolved in November—Ortberg wants better execution, even if it means lower output. “It is so much more important we do this right than fast,” he said. The company had planned to raise Max output from about 25 per month before the strike to 38 per month by the end of the year, a cap set by the FAA. It will not reach that goal and Spingarn, the Melius analyst, says the strike will probably delay any production increase by nine months to a year. Some workers would need retraining, Ortberg said, and the supply chain’s restart was likely to be “bumpy.” The manufacturer also has established a quality plan with the FAA that it must follow. Boeing also needed to launch a new airplane “at the right time in the future,” Ortberg said. Epstein of BofA called this “one of the most important messages” from the new chief executive, likely “to reinvigorate the workforce and culture at Boeing.” In the meantime, Boeing will continue to consume cash in 2025, having burnt through $10 billion so far this year, according to chief financial officer Brian West. Spingarn says that investors may be disappointed in the cash flow at first, but adds that “fixing airplanes isn’t one year, it’s three years.” For all the challenges, Ortberg has the right personality to turn Boeing around, says Ken Herbert, an analyst at RBC Capital Markets. “If he can’t do it, I don’t think anyone can.” © 2024 The Financial Times Ltd. All rights reserved. Not to be redistributed, copied, or modified in any way.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2021/11/getty-boeing-logo-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n            \u003carticle data-id=\"2058544\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \n\n      \n\n      \u003cp\u003e\n        A new CEO promises a culture change as the aerospace titan is struggling hard.\n      \u003c/p\u003e\n\n      \n    \u003c/div\u003e\n\n          \u003cdiv\u003e\n        \u003cp\u003e\u003cimg width=\"1000\" height=\"1000\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/getty-boeing-logo-1000x1000.jpg\" alt=\"A Boeing logo on the exterior of the company\u0026#39;s headquarters.\" loading=\"eager\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/getty-boeing-logo-1000x1000.jpg 1000w, https://cdn.arstechnica.net/wp-content/uploads/2021/11/getty-boeing-logo-150x150.jpg 150w, https://cdn.arstechnica.net/wp-content/uploads/2021/11/getty-boeing-logo-500x500.jpg 500w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"/\u003e\n        \u003c/p\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\u003cspan\u003e\n          Credit:\n\n          \n          Getty Images | Olivier Douliery\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/div\u003e\n      \u003c/div\u003e\n\u003c/header\u003e\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \n\u003cp\u003eAs Boeing’s latest chief executive, Kelly Ortberg’s job was never going to be easy. On Wednesday, it got harder still.\u003c/p\u003e\n\u003cp\u003eThat morning, Ortberg had faced investors for the first time, telling them that ending a debilitating strike by Boeing’s largest union was the first step to stabilizing the plane maker’s business.\u003c/p\u003e\n\u003cp\u003eBut as the day wore on, it became clear that nearly two-thirds of the union members who voted on the company’s latest contract offer had rejected it. The six-week strike goes on, costing Boeing an estimated $50 million a day, pushing back the day it can resume production of most aircraft and further stressing its supply chain.\u003c/p\u003e\n\u003cp\u003eThe company that virtually created modern commercial aviation has spent the better part of five years in chaos, stemming from fatal crashes, a worldwide grounding, a guilty plea to a criminal charge, a pandemic that halted global air travel, a piece breaking off a plane in mid-flight and now a strike. Boeing’s finances look increasingly fragile and its reputation has been battered.\u003c/p\u003e\n\u003cp\u003eBank of America analyst Ron Epstein says Boeing is a titan in a crisis largely of its own making, comparing it to the Hydra of Greek mythology: “For every problem that’s come to a head, then [been] severed, more problems sprout up.”\u003c/p\u003e\n\u003cp\u003eResolving Boeing’s crisis is critical to the future of commercial air travel, as most commercial passenger aircraft are made by it or its European rival Airbus, which has little capacity for new customers until the 2030s.\u003c/p\u003e\n\u003cp\u003eOrtberg, a 64-year-old Midwesterner who took the top job three months ago, says his mission is “pretty straightforward—turn this big ship in the right direction and restore Boeing to the leadership position that we all know and want.”\u003c/p\u003e\n\u003cp\u003eResolving the machinists’ strike is just the start of the challenges he faces. He needs to motivate the workforce, even as 33,000 are on strike and 17,000 face redundancy under a cost-cutting initiative.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eHe must persuade investors to support an equity raise in an industry where the returns could take years to materialize. He needs to fix Boeing’s quality control and manufacturing issues, and placate its increasingly frustrated customers, who have had to rejig their schedules and cut flights owing to delays in plane deliveries.\u003c/p\u003e\n\u003cp\u003e“I’ve never seen anything like it in our industry, to be honest. I’ve been around 30 years,” Carsten Spohr, chief executive of German flag carrier Lufthansa, said this month.\u003c/p\u003e\n\u003cp\u003eEventually, Boeing needs to launch a new aircraft model to better compete with Airbus.\u003c/p\u003e\n\u003cp\u003e“If Kelly fixes this, he is a hero,” says Melius Research analyst Rob Spingarn. “But it’s very complex. There’s a lot of different things to fix.”\u003c/p\u003e\n\u003cp\u003eOrtberg started his career as a mechanical engineer and went on to run Rockwell Collins, an avionics supplier to Boeing, until it was sold to engineering conglomerate United Technologies in 2018.\u003c/p\u003e\n\u003cp\u003eHis engineering background has been welcomed by many who regard previous executives’ emphasis on shareholder returns as the root cause of many of Boeing’s engineering and manufacturing problems.\u003c/p\u003e\n\u003cp\u003eLongtime employees often peg the shift in Boeing’s culture to its 1997 merger with rival McDonnell Douglas. Phil Condit and Harry Stonecipher, who ran Boeing in the late 1990s and early 2000s, were admirers of Jack Welch, the General Electric chief executive known for financial engineering and ruthless cost cuts.\u003c/p\u003e\n\u003cp\u003eCondit even moved Boeing’s headquarters from its manufacturing base in Seattle to Chicago in 2001, so the “corporate center” would no longer be “drawn into day-to-day business operations.”\u003c/p\u003e\n\u003cp\u003eJim McNerney, another Welch acolyte, instituted a program to boost Boeing’s profits by squeezing its suppliers during his decade in charge. He remarked on a 2014 earnings call about employees “cowering” before him, a dark quip still cited a decade later to explain Boeing’s tense relationship with its workers.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eKen Ogren, a member of the International Association of Machinists and Aerospace Workers District 751, says managers at Boeing often felt pressured to move planes quickly through the factory.\u003c/p\u003e\n\u003cp\u003e“We’ve had a lot of bean counters come through, and I’m going to be in the majority with a lot of people who believe they’ve been tripping over dollars to save pennies,” he says.\u003c/p\u003e\n\u003cp\u003eDennis Muilenburg headed the company in October 2018, when a new 737 Max crashed off the coast of Indonesia. Five months later, another Max crashed shortly after take-off in Ethiopia. In total, 346 people lost their lives.\u003c/p\u003e\n\u003cp\u003eRegulators worldwide grounded the plane—a cash cow and a vital product in Boeing’s competition with Airbus—for nearly two years. Investigations eventually showed a faulty sensor triggered an anti-stall system, repeatedly forcing the aircraft’s nose downward.\u003c/p\u003e\n\u003cp\u003eBoeing agreed in July to plead guilty to a criminal charge of fraud for misleading regulators about the plane’s design. Families of the crash victims are opposing the plea deal, which is before a federal judge for approval.\u003c/p\u003e\n\n\u003cp\u003eThe manufacturer’s problems were compounded by COVID-19, which grounded aircraft worldwide and led many airlines to hold off placing new orders and pause deliveries of existing ones. Boeing’s debt ballooned as it issued $25 billion in bonds to see it through the crisis.\u003c/p\u003e\n\u003cp\u003eRegulators cleared the 737 Max to fly again, starting in November 2020. But hopes that Boeing was finally on top of its problems were shattered last January, when a door panel that was missing bolts blew off an Alaska Airlines jet at 16,000 feet.\u003c/p\u003e\n\u003cp\u003eWhile no one was injured, the incident triggered multiple investigations and an audit by the US Federal Aviation Administration, which found lapses in Boeing’s manufacturing and quality assurance processes and led to an uncomfortable appearance by then chief executive Dave Calhoun at a Senate subcommittee hearing.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThe company also has struggled with its defense and space businesses. Fixed-price contracts on several military programs have resulted in losses and billions of dollars of one-off charges. Meanwhile, problems with its CST-100 Starliner spacecraft resulted in two astronauts being left on the International Space Station. SpaceX’s Crew Dragon vehicle will be used to return them to Earth early next year.\u003c/p\u003e\n\u003cp\u003eBoeing’s stumbles have resulted in loss of life, loss of prestige, and a net financial loss every year since 2019. On Wednesday, it reported a $6 billion loss between July and September, the second-worst quarterly result in its history.\u003c/p\u003e\n\u003cp\u003eOne of Ortberg’s first big moves as chief executive was to move himself—from his Florida home to a house in Seattle. He told analysts that Boeing’s executives “need to be on the factory floors, in the back shops, and in our engineering labs” to be more in tune with the company’s products and workforce. Change in Boeing’s corporate culture must “be more than the poster on the wall,” he added.\u003c/p\u003e\n\u003cp\u003eHis approach represents a shift from his predecessor Calhoun, who was criticized for spending more time in New Hampshire and South Carolina than in Boeing’s factories in Washington state.\u003c/p\u003e\n\u003cp\u003eBill George, former chief executive at Medtronic and an executive fellow at Harvard Business School, says Ortberg is doing a “terrific job” so far, particularly for moving to the Pacific Northwest and pressuring other itinerant executives to follow.\u003c/p\u003e\n\u003cp\u003e“If you’re based in Florida, and you come occasionally, what do you really know about what’s going on in the business?” he says, adding that Boeing has “no business being in Arlington, Virginia,” where the company moved its headquarters in 2022.\u003c/p\u003e\n\u003cp\u003eScott Kirby, chief executive at one of Boeing’s biggest customers, United Airlines, told his own investors this month that he was “encouraged” by Ortberg’s early moves, adding that the company suffered for decades from “a cultural challenge, where they focused on short-term profitability and the short-term stock price at the expense of what made Boeing great, which is building great products.”\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003e“Kelly Ortberg is pivoting the company back to their roots,” he said. “All the employees of Boeing will rally around that.”\u003c/p\u003e\n\u003cp\u003eBut Ogren of the machinists’ union cautions that previous commitments to culture change have been hollow. “You’ve got people at the top saying, ‘We’ve got to be safe, oh, and by the way, we need these planes out the door...’ They said the right thing. They didn’t emphasize it, and that’s not what they put pressure on the managers to achieve.”\u003c/p\u003e\n\u003cp\u003eWhen workers eventually return to work—Peter Arment, an analyst at Baird, expects the dispute to be resolved in November—Ortberg wants better execution, even if it means lower output. “It is so much more important we do this right than fast,” he said.\u003c/p\u003e\n\u003cp\u003eThe company had planned to raise Max output from about 25 per month before the strike to 38 per month by the end of the year, a cap set by the FAA. It will not reach that goal and Spingarn, the Melius analyst, says the strike will probably delay any production increase by nine months to a year. Some workers would need retraining, Ortberg said, and the supply chain’s restart was likely to be “bumpy.” The manufacturer also has established a quality plan with the FAA that it must follow.\u003c/p\u003e\n\u003cp\u003eBoeing also needed to launch a new airplane “at the right time in the future,” Ortberg said. Epstein of BofA called this “one of the most important messages” from the new chief executive, likely “to reinvigorate the workforce and culture at Boeing.”\u003c/p\u003e\n\u003cp\u003eIn the meantime, Boeing will continue to consume cash in 2025, having burnt through $10 billion so far this year, according to chief financial officer Brian West. Spingarn says that investors may be disappointed in the cash flow at first, but adds that “fixing airplanes isn’t one year, it’s three years.”\u003c/p\u003e\n\u003cp\u003eFor all the challenges, Ortberg has the right personality to turn Boeing around, says Ken Herbert, an analyst at RBC Capital Markets.\u003c/p\u003e\n\u003cp\u003e“If he can’t do it, I don’t think anyone can.”\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.ft.com/\"\u003e© 2024 The Financial Times Ltd\u003c/a\u003e. \u003ca href=\"https://www.ft.com\"\u003eAll rights reserved\u003c/a\u003e. Not to be redistributed, copied, or modified in any way.\u003c/em\u003e\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\n  \u003c/article\u003e\n\n\n\u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/10/mcdonalds-ice-cream-768x432.jpg\" alt=\"Listing image for first story in Most Read: US Copyright Office “frees the McFlurry,” allowing repair of ice cream machines\" decoding=\"async\" loading=\"lazy\"/\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n\n\n  \n\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-10-26T12:15:05Z",
  "modifiedTime": "2024-10-25T23:23:39Z"
}
