{
  "id": "a17af05a-d0db-40f0-848a-9bd3807465f3",
  "title": "609: You're the Oreo Cookie",
  "link": "https://atp.fm/609",
  "description": "🗣️ New ATP Member’s special: ATP Tier List: Storage Media 🗣️ Follow-up: Marco updates AutoSleep iPhone leather backs Suti PhoneBack Nomad Magnetic Leather Back HDR photos from big cameras Apple laptops can run without a battery connected XKCD: Ravioli-Shaped Objects You can soon get Apple TV+ on Prime Video Soccer corner “Drive to Survive” knockoff is coming (via Devon Dundee) On Messi/MLS popularity Shipping Forecast (via Antony Johnson) Enabling/disabling audio modes on AirPods 4 w/ ANC (via Scott Zero) John’s AirPods update GPX exports for geotagging photos (via Ryan Mikulovsky) Pedometer++ More thoughts on global keyboard shortcuts in Sequoia (via Michael Berk) NSEvent.addGlobalMonitorForEvents Passkey benefits Import/export is forthcoming Press release 1Password blog post Apple says “🤨” to OpenAI claims about reasoning Research paper Thread from Mehrdad Farajtabar More from Gary Marcus How LLMs might store facts Google breakup is a possibility Google’s response New iPad Mini Submerged Making of Submerged Vergence-accommodation conflict Ask ATP: How do you get started editing photos? (via Maxel Amador) What’s the point in performance cores if they’re not used? (via Scott Schuchart) Amdahl’s Law Members-only ATP Overtime: What is the right product mix for iPhone Max Tech’s iPhone 17 naming wishcasting Sponsored by: Squarespace: Save 10% off your first purchase of a website or domain using code ATP. Uncommon Goods: Get 15% off your next gift. Become a member for ATP Overtime, ad-free episodes, member specials, and our early-release, unedited “bootleg” feed!",
  "author": "ATP",
  "published": "Thu, 17 Oct 2024 14:00:57 +0000",
  "source": "https://atp.fm/rss",
  "categories": null,
  "byline": "",
  "length": 132,
  "excerpt": "Three nerds discussing tech, Apple, programming, and loosely related matters.",
  "siteName": "",
  "favicon": "https://cdn.atp.fm/images/20231026-favicon-180.png",
  "text": "Three nerds discussing tech, Apple, programming, and loosely related matters. Hosted by Marco Arment, Casey Liss, and John Siracusa.",
  "image": "https://cdn.atp.fm/artwork",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThree nerds discussing tech, Apple, programming, and loosely related matters. Hosted by \u003ca href=\"https://marco.org/\"\u003eMarco Arment\u003c/a\u003e, \u003ca href=\"https://www.caseyliss.com/\"\u003eCasey Liss\u003c/a\u003e, and \u003ca href=\"https://hypercritical.co/\"\u003eJohn Siracusa\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
