{
  "id": "a4872706-e07a-475a-bb0e-816dec07983e",
  "title": "Social Security recipients get a raise soon. Scammers are on notice.",
  "link": "https://mashable.com/article/social-security-raise-scam",
  "description": "Social Security recipients will receive a bump in funds soon and scammers may try to target them.",
  "author": "",
  "published": "Tue, 12 Nov 2024 23:52:58 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Neal Broverman",
  "length": 2771,
  "excerpt": "The agency is warning recipients of potential scam calls demanding personal data or even gift cards.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "The Social Security Administration announced last month that it’s implementing Cost-of-Living Adjustments (COLA) for the agency’s 72.5 million beneficiaries and Supplemental Security Income recipients. With the 2.5% bump expected in January and informational letters going out next month, scammers are already trying to take advantage of the change, according to SSA officials.\"Be wary of any communication that asks you to take extra steps or provide personal details for this increase, as it’s likely a scammer attempting to steal your identity or financial assets,\" said Acting Inspector General for the Social Security Administration Hannibal \"Mike\" Ware, in a statement. \"Our office is dedicated to protecting the public and deterring these criminals from exploiting honest, hardworking people.\" The COLA will automatically hit bank accounts, and be reflected in mailed checks, with no action needed by recipients. However, Ware had warned that you should not hand over personal information to anyone claiming they’re a representative of the SSA who needs your social security number or bank account to move forward with the COLA. Report any suspected fraud to the SSA’s Office of the Inspector General via their website (https://oig.ssa.gov/report/). Mashable Top Stories SSA officials warn all recipients to be on the lookout for \"fake calls, texts, emails, websites, messages on social media, or letters in the mail.\" While the agency typically contacts people via mail regarding updates and questions, they will call people on occasion, according to the SSA anti-scam site, especially if they \"recently applied for a Social Security benefit, are already receiving payments and require an update to their record, or have requested a phone call from the agency.\"The agency produced a video about SSA agency imposters who will call recipients and tell them of armed marshals or sheriffs’ deputies on their way to arrest them for some supposed malfeasance. One SSA recipient described being told by scammers to purchase Google Play cards to avoid arrest. When receiving a call purportedly from the SSA where threats or demands of money are made — or prizes offered — get off the phone, talk to someone you trust, and do a search on the internet. “SSA will not threaten you, demand your personal information or instant payment, email or text you pictures or documents, or use a real government official’s name to gain your trust,” according to another anti-scam video from the agency. “Social Security does not accept payments by gift card, pre-paid debit card, internet currency, or by mailing cash.” See more information on SSA-related scams here and check out other online resources here.",
  "image": "https://helios-i.mashable.com/imagery/articles/06yPqLI71FZkudF4nAfnHjG/hero-image.fill.size_1200x675.v1731453297.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"article\" data-autopogo=\"\"\u003e\n                                                \u003cp\u003eThe Social Security Administration announced last month that it’s implementing Cost-of-Living Adjustments (COLA) for the agency’s \u003ca href=\"https://www.ssa.gov/cola/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e72.5 million beneficiaries and Supplemental Security Income recipients\u003c/a\u003e. With the 2.5% bump expected in January and informational letters going out next month, scammers are already trying to take advantage of the change, according to SSA officials.\u003c/p\u003e\u003cp\u003e\u0026#34;Be wary of any communication that asks you to take extra steps or provide personal details for this increase, as it’s likely a scammer attempting to steal your identity or financial assets,\u0026#34; said Acting Inspector General for the Social Security Administration Hannibal \u0026#34;Mike\u0026#34; Ware, in a statement. \u0026#34;Our office is dedicated to protecting the public and deterring these criminals from exploiting honest, hardworking people.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe COLA will automatically hit bank accounts, and be reflected in mailed checks, with no action needed by recipients. \u003c/p\u003e\u003cp\u003eHowever, Ware had warned that you should not hand over personal information to anyone claiming they’re a representative of the SSA who needs your social security number or bank account to move forward with the COLA. Report any suspected fraud to the SSA’s Office of the Inspector General via their website (\u003ca href=\"https://oig.ssa.gov/report/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003ehttps://oig.ssa.gov/report/\u003c/a\u003e).\u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"top-stories\"\u003e\n        \u003cp\u003e\n            Mashable Top Stories\n        \u003c/p\u003e\n        \n        \n    \u003c/section\u003e\n\u003cp\u003eSSA officials warn all recipients to be on the lookout for \u0026#34;fake calls, texts, emails, websites, messages on social media, or letters in the mail.\u0026#34; \u003c/p\u003e\u003cp\u003eWhile the agency typically contacts people via mail regarding updates and questions, they will call people on occasion, according to the \u003ca href=\"https://www.ssa.gov/scam/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eSSA anti-scam site\u003c/a\u003e, especially if they \u0026#34;recently applied for a Social Security benefit, are already receiving payments and require an update to their record, or have requested a phone call from the agency.\u0026#34;\u003c/p\u003e\u003cp\u003eThe agency produced a video about SSA agency imposters who will call recipients and tell them of armed marshals or sheriffs’ deputies on their way to arrest them for some supposed malfeasance. \u003ca href=\"https://consumer.ftc.gov/articles/avoiding-and-reporting-gift-card-scams#:~:text=Only%20scammers%20will%20tell%20you,gift%20card%20and%20store%20receipt.\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eOne SSA recipient described being told by scammers to purchase Google Play cards to avoid arrest\u003c/a\u003e. When receiving a call purportedly from the SSA where threats or demands of money are made — or prizes offered — get off the phone, talk to someone you trust, and do a search on the internet.\u003c/p\u003e\n\u003cdiv\u003e\n    \u003cp\u003e\n        \u003ciframe src=\"https://player.vimeo.com/video/377637921\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n    \u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e“SSA will not threaten you, demand your personal information or instant payment, email or text you pictures or documents, or use a real government official’s name to gain your trust,” according to another anti-scam video from the agency. “Social Security does not accept payments by gift card, pre-paid debit card, internet currency, or by mailing cash.”\u003c/p\u003e\n\n\n\u003cp\u003eSee more information on \u003ca href=\"https://www.ssa.gov/scam/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eSSA-related scams here\u003c/a\u003e and check out other \u003ca href=\"https://www.ssa.gov/onlineservices/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eonline resources here\u003c/a\u003e.\u003c/p\u003e\n\n                            \n                    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-12T23:52:58Z",
  "modifiedTime": "2024-11-12T23:52:58Z"
}
