{
  "id": "aa6e701d-fbda-4c24-af18-2fe48220f075",
  "title": "I Tried YouTube's AI Video Generator, and I'm Scared",
  "link": "https://lifehacker.com/tech/youtube-shorts-veo-ai-generator?utm_medium=RSS",
  "description": "AI is truly the future of vertical videos you'll scroll past before choosing something you actually want to watch.",
  "author": "Justin Pot",
  "published": "Fri, 14 Feb 2025 21:00:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Internet"
  ],
  "byline": "Justin Pot",
  "length": 3190,
  "excerpt": "AI is truly the future of vertical videos you'll scroll past before choosing something you actually want to watch.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "I am probably going to regret putting my face in these. Credit: Justin Pot This week Google added Veo 2 to YouTube Shorts and—wow, this article is already gibberish. Let me back up.YouTube Shorts is YouTube's TikTok knockoff competitor. Veo2 is Google's AI tool for generating videos. As of this week, you can use that AI to make clips for YouTube Shorts. This innovative and revolutionary change will forever alter the vertical videos most people scroll past so they can find the thing they actually wanted to watch.According to a confusingly worded announcement post, you can now create clips to add to your Shorts simply by typing a sentence. Anyone can create a Short right in the YouTube mobile app either by combining footage already saved to their phone or by recording directly. Now there's a third option: generating horrifying footage using AI.\"Need a specific scene but don't have the right footage?\" the post asks. \"Simply use a text prompt to generate a video clip that fits perfectly into your narrative, or create a whole new world of content.\"I can't think of any place less appealing than a \"whole new world of content.\" The very phrase conjures up mental images of a digital purgatory, an endless void of placeholder content where the unworthy are sent to after a life lived passively consuming. So naturally I wanted to try this out. I fired up the YouTube application on my phone found that the feature is a little buried. To generate a clip, you need to click the Add button in the bottom-left corner and then—instead of clicking one of the photos or videos on your phone—tap the Create button at the top of the screen. After that, you can type your prompt and tap Create. I hope this is how it all ends to be honest. Credit: Justin Pot You'll see four thumbnails—tap one and the AI will generate a clip for you. This will be added to your timeline, meaning you can edit it into the rest of the Short however you like.I played around with this a few times, mostly with cats eating planets (I wanted to see it). The results were not particularly convincing from a feline or astronomical perspective—I'd say it resembled the feeling of a fading memory of a dream more than actual video footage—but I certainly ended up with a video that included the elements I described.There's one more way you can use these videos—as an animated background for your Shorts. To do this, tap the down arrow on the toolbar to expand it, tap the Green Screen option, then tap the AI sparkle instead of one of your photos. As before, you will be given four thumbnails to choose from—the one you choose will become a video. You can then record yourself talking as the video loops in the background. Honestly, this seems like a decent use for AI—a quick and disposable visual flare for a video that is also quick and disposable.For what's it's worth, we have an article about how to hide YouTube Shorts from your feed, as does seemingly every other website on the internet. I wonder why that is.",
  "image": "https://lifehacker.com/imagery/articles/01JM2YDREEYHQDNNJ0DRX4XEC6/hero-image.fill.size_1200x675.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n                                    I am probably going to regret putting my face in these. \n                \n                                    \u003cspan\u003eCredit: Justin Pot\u003c/span\u003e\n                            \u003c/p\u003e\u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eThis week Google added \u003ca href=\"https://deepmind.google/technologies/veo/veo-2/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eVeo 2\u003c/a\u003e to YouTube Shorts and—wow, this article is already gibberish. Let me back up.\u003c/p\u003e\u003cp\u003eYouTube Shorts is YouTube\u0026#39;s TikTok \u003cs\u003eknockoff\u003c/s\u003e competitor. Veo2 is Google\u0026#39;s AI tool for generating videos. As of this week, you can use that AI to make clips for YouTube Shorts. This innovative and revolutionary change will forever alter the vertical videos most people scroll past so they can find the thing they actually wanted to watch.\u003c/p\u003e\u003cp\u003eAccording to a \u003ca href=\"https://blog.youtube/news-and-events/veo-2-shorts/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003econfusingly worded announcement post,\u003c/a\u003e you can now create clips to add to your Shorts simply by typing a sentence. Anyone can create a Short right in the YouTube mobile app either by combining footage already saved to their phone or by recording directly. Now there\u0026#39;s a third option: generating horrifying footage using AI.\u003c/p\u003e\u003cp\u003e\u0026#34;Need a specific scene but don\u0026#39;t have the right footage?\u0026#34; the post asks. \u0026#34;Simply use a text prompt to generate a video clip that fits perfectly into your narrative, or create a whole new world of content.\u0026#34;\u003c/p\u003e\u003cp\u003eI can\u0026#39;t think of any place less appealing than a \u0026#34;whole new world of content.\u0026#34; The very phrase conjures up mental images of a digital purgatory, an endless void of placeholder content where the unworthy are sent to after a life lived passively consuming. \u003c/p\u003e\u003cp\u003eSo naturally I wanted to try this out. \u003c/p\u003e\u003cp\u003eI fired up the YouTube application on my phone found that the feature is a little buried. To generate a clip, you need to click the \u003cstrong\u003eAdd\u003c/strong\u003e button in the bottom-left corner and then—instead of clicking one of the photos or videos on your phone—tap the \u003cstrong\u003eCreate\u003c/strong\u003e button at the top of the screen. After that, you can type your prompt and tap \u003cstrong\u003eCreate\u003c/strong\u003e.\u003c/p\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01JM2YDREEYHQDNNJ0DRX4XEC6/images-1.fill.size_2000x964.v1739560772.png\" alt=\"Three screenshots. The first shows me typing \u0026#34;A cat eating all of the planets in the solar system\u0026#34;. The second shows four examples of this. The forth shows the cat in action, kind of.\" width=\"2000\" height=\"964\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01JM2YDREEYHQDNNJ0DRX4XEC6/images-1.fill.size_800x385.v1739560772.png 800w, https://lifehacker.com/imagery/articles/01JM2YDREEYHQDNNJ0DRX4XEC6/images-1.fill.size_1400x674.v1739560772.png 1400w, https://lifehacker.com/imagery/articles/01JM2YDREEYHQDNNJ0DRX4XEC6/images-1.fill.size_2000x964.v1739560772.png 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003eI hope this is how it all ends to be honest. \u003c/span\u003e\n                                        \u003cspan\u003eCredit: Justin Pot\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003cp\u003eYou\u0026#39;ll see four thumbnails—tap one and the AI will generate a clip for you. This will be added to your timeline, meaning you can edit it into the rest of the Short however you like.\u003c/p\u003e\u003cp\u003eI played around with this a few times, mostly with cats eating planets (I wanted to see it). The results were not particularly convincing from a feline or astronomical perspective—I\u0026#39;d say it resembled the feeling of a fading memory of a dream more than actual video footage—but I certainly ended up with a video that included the elements I described.\u003c/p\u003e\u003cp\u003eThere\u0026#39;s one more way you can use these videos—as an animated background for your Shorts. To do this, tap the down arrow on the toolbar to expand it, tap the \u003cstrong\u003eGreen Screen\u003c/strong\u003e option, then tap the AI sparkle instead of one of your photos. As before, you will be given four thumbnails to choose from—the one you choose will become a video. You can then record yourself talking as the video loops in the background. Honestly, this seems like a decent use for AI—a quick and disposable visual flare for a video that is also quick and disposable.\u003c/p\u003e\u003cp\u003eFor what\u0026#39;s it\u0026#39;s worth, we have an article about \u003ca href=\"https://lifehacker.com/tech/how-to-hide-youtube-shorts-from-feed\" target=\"_blank\"\u003ehow to hide YouTube Shorts from your feed\u003c/a\u003e, as does seemingly every other website on the internet. I wonder why that is.\u003c/p\u003e\n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-14T21:00:00Z",
  "modifiedTime": "2025-02-14T21:00:00Z"
}
