{
  "id": "ac0a5097-d4b8-4cff-84d5-fa86f3653d6b",
  "title": "Joby Aviation Has a Bold Plan to Make Flying Cars Real—Fast",
  "link": "https://gizmodo.com/joby-aviation-has-a-bold-plan-to-make-flying-cars-real-fast-2000631581",
  "description": "With test flights in Dubai and U.S. production scaling up, Joby is turning a sci-fi fantasy into a high-speed reality.",
  "author": "Luc Olinga",
  "published": "Fri, 18 Jul 2025 22:12:54 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Transportation",
    "electric scooters",
    "Electric Vehicles",
    "Flying car",
    "Joby"
  ],
  "byline": "Luc Olinga",
  "length": 4912,
  "excerpt": "With test flights in Dubai and U.S. production scaling up, Joby is turning a sci-fi fantasy into a high-speed reality.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Flying cars were supposed to be a fantasy. A punchline. A cartoonish promise from a Jetsons-era past. But Joby Aviation is no longer promising anything. It’s building them. The Santa Cruz, California-based company just unveiled the expansion of its manufacturing facility in Marina, CA, where it now has the capacity to build up to 24 electric air taxis per year. That’s two flying cars a month. With additional capacity ramping up in Dayton, Ohio, and test flights already underway in Dubai, the future of urban air mobility is no longer stuck in the concept phase. The production milestone comes as Joby’s aircraft completed piloted test flights in Dubai, marking the start of its commercial market readiness program in the UAE. In partnership with Dubai’s Roads and Transport Authority, the company is preparing for passenger operations as early as 2026, a timeline that looks far more realistic than it did even 12 months ago. “Reimagining urban mobility takes speed, scale, and precision manufacturing,” said Eric Allison, Joby’s Chief Product Officer. “Our expanded footprint, in both California and Ohio, is preparing us to do just that.” But as the aircraft roll off the line and take to the skies, a harder question looms: Is the world actually ready for mass-scale flying machines? From Blueprint to Assembly Line Unlike many of its eVTOL competitors still hawking mockups and vaporware, Joby is building real, FAA-cleared aircraft with vertical takeoff capabilities, 200 mph top speeds, and near-silent operation. Each aircraft can carry a pilot and four passengers and is intended for short, high-value routes, like from Dubai International Airport to Palm Jumeirah in 12 minutes (a trip that usually takes 45 minutes by car). At the Marina facility, which now spans over 435,000 square feet, Joby is producing aircraft components using 3D printing, data-driven quality control, and a team trained in part by Toyota engineers, thanks to a deep partnership between the two companies. The factory will also house simulators for pilot training, ground testing areas, and FAA-certification labs. Over in Dayton, Ohio, birthplace of aviation and now home to Joby’s next-generation production line, the company is preparing to eventually build 500 aircraft per year. It’s one of the most ambitious reindustrialization efforts by a Silicon Valley startup in recent memory, supported by state grants and a growing Midwestern advanced manufacturing workforce. Dubai Gets the First Ride While the manufacturing may be American, the first passengers won’t be. Joby’s launch customer is Dubai, which granted the company exclusive air taxi rights for six years. In return, Joby is working with local aviation authorities to stand up a full commercial air taxi network, starting with a vertiport under construction at Dubai International Airport. Dubai’s buy-in is key. The city has invested heavily in smart mobility, from driverless trains to robotaxis, and now hopes to integrate eVTOL aircraft into its broader transport grid. According to Dubai officials, the air taxis will be a premium service, targeted at those who want fast, seamless mobility between key parts of the city. “The air taxi will introduce a new premium service for residents and visitors seeking smooth, fast, and safe travel to key destinations across the city,” said Mattar Al Tayer, Director General of Dubai’s Roads and Transport Authority. “The service will also strengthen integration with public transport systems and individual mobility options.” Who Gets to Fly? The word premium is doing a lot of work here. While Joby’s aircraft may be clean, quiet, and fast, they are not cheap. At least not yet. With limited seating, piloted flights, and significant regulatory costs, it’s likely that early riders will be CEOs, tourists, and the ultra-wealthy, not your average daily commuter. That raises questions about access, equity, and infrastructure. Will flying cars become another luxury product for elites, while cities continue to neglect ground transportation for everyone else? Or could a mature eVTOL market actually relieve urban congestion and create scalable new forms of public transit? So far, the answers aren’t clear. Joby’s aircraft are real. Its timelines are aggressive. But adoption will depend on everything from pricing models and safety standards to public perception and noise tolerance. The Bottom Line With factories humming and flights underway, Joby Aviation may be the first company to industrialize the flying car, not as a sci-fi dream, but as a shippable product. Two aircraft a month. Six this year. Hundreds soon. It’s the kind of milestone that usually marks the start of something big. But like any disruptive technology, what happens next will depend on more than just engineering. We’ve figured out how to build flying cars. Now we have to decide what kind of world we want to fly them in.",
  "image": "https://gizmodo.com/app/uploads/2025/04/in-flight-jobyaviation-1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eFlying cars were supposed to be a fantasy. A punchline. A cartoonish promise from a Jetsons-era past. But Joby Aviation is no longer promising anything. It’s building them.\u003c/p\u003e \u003cp\u003eThe Santa Cruz, California-based company just \u003ca href=\"https://www.jobyaviation.com/news/joby-expands-manufacturing-capacity/\"\u003eunveiled\u003c/a\u003e the expansion of its manufacturing facility in Marina, CA, where it now has the capacity to build up to 24 electric air taxis per year. That’s two flying cars a month. With additional capacity ramping up in Dayton, Ohio, and test flights already underway in Dubai, the future of urban air mobility is no longer stuck in the concept phase.\u003c/p\u003e \u003cp\u003eThe production milestone comes as Joby’s aircraft \u003ca href=\"https://www.jobyaviation.com/news/joby-cements-global-lead-in-air-taxi-industry/\"\u003ecompleted\u003c/a\u003e piloted test flights in Dubai, marking the start of its commercial market readiness program in the UAE. In partnership with Dubai’s Roads and Transport Authority, the company is preparing for passenger operations as early as 2026, a timeline that looks far more realistic than it did even 12 months ago.\u003c/p\u003e \u003cp\u003e“Reimagining urban mobility takes speed, scale, and precision manufacturing,” said Eric Allison, Joby’s Chief Product Officer. “Our expanded footprint, in both California and Ohio, is preparing us to do just that.”\u003c/p\u003e\n\n \u003cp\u003eBut as the aircraft roll off the line and take to the skies, a harder question looms: Is the world actually ready for mass-scale flying machines?\u003c/p\u003e \u003ch2\u003eFrom Blueprint to Assembly Line\u003c/h2\u003e \u003cp\u003eUnlike many of its eVTOL competitors still hawking mockups and vaporware, Joby is building real, FAA-cleared aircraft with vertical takeoff capabilities, 200 mph top speeds, and near-silent operation. Each aircraft can carry a pilot and four passengers and is intended for short, high-value routes, like from Dubai International Airport to Palm Jumeirah in 12 minutes (a trip that usually takes 45 minutes by car).\u003c/p\u003e \u003cp\u003eAt the Marina facility, which now spans over 435,000 square feet, Joby is producing aircraft components using 3D printing, data-driven quality control, and a team trained in part by Toyota engineers, thanks to a deep partnership between the two companies. The factory will also house simulators for pilot training, ground testing areas, and FAA-certification labs.\u003c/p\u003e\n\n \u003cp\u003eOver in Dayton, Ohio, birthplace of aviation and now home to Joby’s next-generation production line, the company is preparing to eventually build 500 aircraft per year. It’s one of the most ambitious reindustrialization efforts by a Silicon Valley startup in recent memory, supported by state grants and a growing Midwestern advanced manufacturing workforce.\u003c/p\u003e \u003ch2\u003eDubai Gets the First Ride\u003c/h2\u003e \u003cp\u003eWhile the manufacturing may be American, the first passengers won’t be. Joby’s launch customer is Dubai, which granted the company exclusive air taxi rights for six years. In return, Joby is working with local aviation authorities to stand up a full commercial air taxi network, starting with a vertiport under construction at Dubai International Airport.\u003c/p\u003e\n\n \u003cp\u003eDubai’s buy-in is key. The city has invested heavily in smart mobility, from driverless trains to robotaxis, and now hopes to integrate eVTOL aircraft into its broader transport grid. According to Dubai officials, the air taxis will be a premium service, targeted at those who want fast, seamless mobility between key parts of the city.\u003c/p\u003e \u003cp\u003e“The air taxi will introduce a new premium service for residents and visitors seeking smooth, fast, and safe travel to key destinations across the city,” said Mattar Al Tayer, Director General of Dubai’s Roads and Transport Authority. “The service will also strengthen integration with public transport systems and individual mobility options.”\u003c/p\u003e\n\n \u003ch2\u003eWho Gets to Fly?\u003c/h2\u003e \u003cp\u003eThe word premium is doing a lot of work here. While Joby’s aircraft may be clean, quiet, and fast, they are not cheap. At least not yet. With limited seating, piloted flights, and significant regulatory costs, it’s likely that early riders will be CEOs, tourists, and the ultra-wealthy, not your average daily commuter.\u003c/p\u003e \u003cp\u003eThat raises questions about access, equity, and infrastructure. Will flying cars become another luxury product for elites, while cities continue to neglect ground transportation for everyone else? Or could a mature eVTOL market actually relieve urban congestion and create scalable new forms of public transit?\u003c/p\u003e\n\n \u003cp\u003eSo far, the answers aren’t clear. Joby’s aircraft are real. Its timelines are aggressive. But adoption will depend on everything from pricing models and safety standards to public perception and noise tolerance.\u003c/p\u003e \u003ch2\u003eThe Bottom Line\u003c/h2\u003e \u003cp\u003eWith factories humming and flights underway, Joby Aviation may be the first company to industrialize the flying car, not as a sci-fi dream, but as a shippable product. Two aircraft a month. Six this year. Hundreds soon.\u003c/p\u003e \u003cp\u003eIt’s the kind of milestone that usually marks the start of something big. But like any disruptive technology, what happens next will depend on more than just engineering.\u003c/p\u003e \u003cp\u003eWe’ve figured out how to build flying cars. Now we have to decide what kind of world we want to fly them in.\u003c/p\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-18T22:12:54Z",
  "modifiedTime": "2025-07-18T22:12:54Z"
}
