{
  "id": "b6366065-db93-4537-ae00-3a05dc9e6abe",
  "title": "Latest UN report demands 'unprecedented' emissions cuts to salvage climate goals",
  "link": "https://www.engadget.com/science/latest-un-report-demands-unprecedented-emissions-cuts-to-salvage-climate-goals-223450262.html?src=rss",
  "description": "The United Nations' Environmental Program has released a new report with yet more dire news about our odds of avoiding climate disaster caused by greenhouse gas emissions. According to this assessment, the current trajectory of international commitments will see the planet's temperature increasing 2.6 degrees Celsius or more over the course of this century. That amount of temperature change would lead to more catastrophic and life-threatening weather events. UN members are due to submit their latest Nationally Determined Contributions ahead of the COP30 conference in Brazil next year. The NDCs lay out each country's plan for reduced greenhouse gas emissions. One part of the NDCs are to reach the goal set by the Paris Agreement to limit global temperature increases to 1.5 degrees Celsius, and one part targets keeping global temperature increases to within a less ideal 2 degrees Celsius. While the report says it is technically possible to reach the Paris Agreement goal, much larger actions will be required to cut emissions by the necessary amount.  \"Increased deployment of solar photovoltaic technologies and wind energy could deliver 27 percent of the total emission reduction potential in 2030 and 38 percent in 2035,\" the report gives as an example of what's still needed. \"Action on forests could deliver around 20 percent of the potential in both years.\" \"Every fraction of a degree avoided counts in terms of lives saved, economies protected, damages avoided, biodiversity conserved and the ability to rapidly bring down any temperature overshoot,\" UN Environment Program Executive Director Inger Andersen wrote in the report's forward. International collaboration, government commitments and financial contributions will also be essential for getting back on track to either the 2-degree or 1.5-degree goals. \"G20 nations, particularly the largest-emitting members, would need to do the heavy lifting,\" the report reads. If all of this sounds familiar, that's probably because the UN has issued the same stark warnings in each of its annual reports on emissions for several years now. And other reports have echoed their calls, such as damning findings earlier this year that just 57 companies are responsible for 80 percent of carbon dioxide emissions worldwide.This article originally appeared on Engadget at https://www.engadget.com/science/latest-un-report-demands-unprecedented-emissions-cuts-to-salvage-climate-goals-223450262.html?src=rss",
  "author": "Anna Washenko",
  "published": "Thu, 24 Oct 2024 22:34:50 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Climate Change",
    "Environment",
    "Nature \u0026 Environment",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Anna Washenko"
  ],
  "byline": "Anna Washenko",
  "length": 2279,
  "excerpt": "The United Nations' Environmental Program has released a new report with yet more dire news about our odds of avoiding climate disaster caused by greenhouse ...",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "The United Nations' Environmental Program has released a new report with yet more dire news about our odds of avoiding climate disaster caused by greenhouse gas emissions. According to this assessment, the current trajectory of international commitments will see the planet's temperature increasing 2.6 degrees Celsius or more over the course of this century. That amount of temperature change would lead to more catastrophic and life-threatening weather events.UN members are due to submit their latest Nationally Determined Contributions ahead of the COP30 conference in Brazil next year. The NDCs lay out each country's plan for reduced greenhouse gas emissions. One part of the NDCs are to reach the goal set by the Paris Agreement to limit global temperature increases to 1.5 degrees Celsius, and one part targets keeping global temperature increases to within a less ideal 2 degrees Celsius. While the report says it is technically possible to reach the Paris Agreement goal, much larger actions will be required to cut emissions by the necessary amount.\"Increased deployment of solar photovoltaic technologies and wind energy could deliver 27 percent of the total emission reduction potential in 2030 and 38 percent in 2035,\" the report gives as an example of what's still needed. \"Action on forests could deliver around 20 percent of the potential in both years.\"\"Every fraction of a degree avoided counts in terms of lives saved, economies protected, damages avoided, biodiversity conserved and the ability to rapidly bring down any temperature overshoot,\" UN Environment Program Executive Director Inger Andersen wrote in the report's forward.International collaboration, government commitments and financial contributions will also be essential for getting back on track to either the 2-degree or 1.5-degree goals. \"G20 nations, particularly the largest-emitting members, would need to do the heavy lifting,\" the report reads.If all of this sounds familiar, that's probably because the UN has issued the same stark warnings in each of its annual reports on emissions for several years now. And other reports have echoed their calls, such as damning findings earlier this year that just 57 companies are responsible for 80 percent of carbon dioxide emissions worldwide.",
  "image": "https://s.yimg.com/ny/api/res/1.2/cNBWym7UxXBHVVCjWG8KVw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-10/b8504070-9254-11ef-b7bf-ca4973a7cd1d",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe United Nations\u0026#39; Environmental Program has released a new \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1\" href=\"https://www.unep.org/resources/emissions-gap-report-2024\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:report;elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003ereport\u003c/ins\u003e\u003c/a\u003e with yet more dire news about our odds of avoiding climate disaster caused by greenhouse gas emissions. According to this assessment, the current trajectory of international commitments will see the planet\u0026#39;s temperature increasing 2.6 degrees Celsius or more over the course of this century. That amount of temperature change would lead to more catastrophic and life-threatening weather events.\u003c/p\u003e\u003cp\u003eUN members are due to submit their latest Nationally Determined Contributions ahead of the COP30 conference in Brazil next year. The NDCs lay out each country\u0026#39;s plan for reduced greenhouse gas emissions. One part of the NDCs are to reach the goal set by the Paris Agreement to limit global temperature increases to 1.5 degrees Celsius, and one part targets keeping global temperature increases to within a less ideal 2 degrees Celsius. While the report says it is technically possible to reach the Paris Agreement goal, much larger actions will be required to cut emissions by the necessary amount.\u003c/p\u003e\u003cp\u003e\u0026#34;Increased deployment of solar photovoltaic technologies and wind energy could deliver 27 percent of the total emission reduction potential in 2030 and 38 percent in 2035,\u0026#34; the report gives as an example of what\u0026#39;s still needed. \u0026#34;Action on forests could deliver around 20 percent of the potential in both years.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Every fraction of a degree avoided counts in terms of lives saved, economies protected, damages avoided, biodiversity conserved and the ability to rapidly bring down any temperature overshoot,\u0026#34; UN Environment Program Executive Director Inger Andersen wrote in the report\u0026#39;s forward.\u003c/p\u003e\u003cp\u003eInternational collaboration, government commitments and financial contributions will also be essential for getting back on track to either the 2-degree or 1.5-degree goals. \u0026#34;G20 nations, particularly the largest-emitting members, would need to do the heavy lifting,\u0026#34; the report reads.\u003c/p\u003e\u003cp\u003eIf all of this sounds familiar, that\u0026#39;s probably because the UN has issued the same stark warnings in each of its annual reports on emissions for \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1\" href=\"https://www.engadget.com/un-emissions-gap-report-climate-change-warning-144323723.html\" data-ylk=\"slk:several years;elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003eseveral years\u003c/ins\u003e\u003c/a\u003e now. And other reports have echoed their calls, such as damning \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1\" href=\"https://www.engadget.com/only-57-companies-produced-80-percent-of-global-carbon-dioxide-130752291.html\" data-ylk=\"slk:findings;elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003efindings\u003c/ins\u003e\u003c/a\u003e earlier this year that just 57 companies are responsible for 80 percent of carbon dioxide emissions worldwide.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-24T22:34:50Z",
  "modifiedTime": null
}
