{
  "id": "b7bd240f-6718-4446-b053-ad16cf2b86c5",
  "title": "Life of a Marathon Streamer: Online for Three Years, Facing Isolation and Burnout",
  "link": "https://entertainment.slashdot.org/story/25/05/10/2334208/life-of-a-marathon-streamer-online-for-three-years-facing-isolation-and-burnout?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "Back in 2000, Slashdot founder CmdrTaco marked the 4th anniversary of Jennifer Ringley's pioneering \"JenniCam\" livestream (saying \"It sure beats the Netscape FishCam. It's nuts how Jenni's little cam became such a fixture on The Internet...\") But a new article in the Washington Post remembers how \"Once, Ringley looked directly into the camera and held a note in front of her eye. It read: 'I FEEL SO LONELY.'\" By 2003, Ringley had shut down the site and disappeared. She began declining interview requests, saying she was enjoying her privacy; her absence on social media continues to this day. \"But by then, the human zoo was everywhere,\" they write including \"social media, where everyone could become a character in their own show.\" In 2007 Justin Kan launched Justin.TV, which eventually became Twitch, \"a thrumming online city for anyone wanting to, as its slogan said, 'waste time watching other people waste time.'\" But the article also notes 2023 stats from the Bureau of Labor Statistics survey that found Americans\"were spending far less time socializing than they had 20 years ago — especially 18-to-29-year-olds, who were spending two more hours a day alone.\" So how did this play out for the next generation of livestreaming influencers? Here's the origin story of \"a lonely young woman in Texas\" who's \"streamed every second of her life for three years and counting.\" One afternoon, her boyfriend told her to try Twitch, saying, as she recalled: \"Your life sucks, you work at CVS, you have no friends. ... This could be helpful.\" In her first stream, on a Friday night, she played 3Â½ hours of \"World of Warcraft\" for her zero followers. Eight years later... Six hundred and forty-two people are watching when Emily tugs off her sleep mask to begin day No. 1,137 of broadcasting every hour of her life... On the live-streaming service Twitch, one of the world's most popular platforms, Emily is a legendary figure. For three years, she has ceaselessly broadcast her life — every birthday and holiday, every sickness and sleepless night, almost all of it alone. Her commitment has made her a model for success in the new internet economy, where authenticity and endurance are highly prized. It's also made her a good amount of money: $5.99 a month from thousands of subscribers each, plus donations and tips — minus Twitch's 30-to-40 percent cut. But to get there, Emily, who agreed to be interviewed on the condition that her last name be withheld due to concerns of harassment, has devoted herself to a solitary life of almost constant stimulation. For three years, she has taken no sick days, gone on no vacations, declined every wedding invitation, had no sex. She has broadcast and self-narrated a thousand days of sleeping, driving and crying, lugging her camera backpack through the grocery store, talking through a screen to strangers she'll never meet. Her goal is to buy a house and get married by the age of 30, but she's 28 and says she's too busy to have a boyfriend. Her last date was seven years ago... But no one tells streamers when to record or when to stop. There are no labor codes, performance limits or regulations to keep the platforms from setting incentives impossibly high. Many streamers figure out the optimal strategy themselves: The more you share, the more successful you can be.... Though some Twitch stars are millionaires, most scramble to get by, buffeted by the vagaries of audience attention. Emily's paid-subscription count, which peaked last year at 22,000, has since slumped to around 6,000, dropping her base income to about $5,000 a month, according to estimates from the analytics firm Streams Charts... Sometimes Emily dreads waking up and clocking into the reality show that is her life. She knows staring at screens all night is unhealthy, and when she feels too depressed to stream, she'll stay in bed for hours while her viewers watch. But she worries that taking a break would be \"career suicide,\" as she called it. Some viewers already complain that she showers too long, sleeps in too late, doesn't have enough fun... She said she \"used to show true sadness on stream\" but doesn't anymore because it makes viewers uncomfortable. When she hits a breaking point now, she said, she closes herself in the bathroom. Read more of this story at Slashdot.",
  "author": "EditorDavid",
  "published": "2025-05-10T23:36:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "tv"
  ],
  "byline": "",
  "length": 4304,
  "excerpt": "Back in 2000, Slashdot founder CmdrTaco marked the 4th anniversary of Jennifer Ringley's pioneering \"JenniCam\" livestream (saying \"It sure beats the Netscape FishCam. It's nuts how Jenni's little cam became such a fixture on The Internet...\") But a new article in the Washington Post remembers how ...",
  "siteName": "",
  "favicon": "",
  "text": "Back in 2000, Slashdot founder CmdrTaco marked the 4th anniversary of Jennifer Ringley's pioneering \"JenniCam\" livestream (saying \"It sure beats the Netscape FishCam. It's nuts how Jenni's little cam became such a fixture on The Internet...\") But a new article in the Washington Post remembers how \"Once, Ringley looked directly into the camera and held a note in front of her eye. It read: 'I FEEL SO LONELY.'\" By 2003, Ringley had shut down the site and disappeared. She began declining interview requests, saying she was enjoying her privacy; her absence on social media continues to this day. \"But by then, the human zoo was everywhere,\" they write including \"social media, where everyone could become a character in their own show.\" In 2007 Justin Kan launched Justin.TV, which eventually became Twitch, \"a thrumming online city for anyone wanting to, as its slogan said, 'waste time watching other people waste time.'\" But the article also notes 2023 stats from the Bureau of Labor Statistics survey that found Americans\"were spending far less time socializing than they had 20 years ago — especially 18-to-29-year-olds, who were spending two more hours a day alone.\" So how did this play out for the next generation of livestreaming influencers? Here's the origin story of \"a lonely young woman in Texas\" who's \"streamed every second of her life for three years and counting.\" One afternoon, her boyfriend told her to try Twitch, saying, as she recalled: \"Your life sucks, you work at CVS, you have no friends. ... This could be helpful.\" In her first stream, on a Friday night, she played 3Â½ hours of \"World of Warcraft\" for her zero followers. Eight years later... Six hundred and forty-two people are watching when Emily tugs off her sleep mask to begin day No. 1,137 of broadcasting every hour of her life... On the live-streaming service Twitch, one of the world's most popular platforms, Emily is a legendary figure. For three years, she has ceaselessly broadcast her life — every birthday and holiday, every sickness and sleepless night, almost all of it alone. Her commitment has made her a model for success in the new internet economy, where authenticity and endurance are highly prized. It's also made her a good amount of money: $5.99 a month from thousands of subscribers each, plus donations and tips — minus Twitch's 30-to-40 percent cut. But to get there, Emily, who agreed to be interviewed on the condition that her last name be withheld due to concerns of harassment, has devoted herself to a solitary life of almost constant stimulation. For three years, she has taken no sick days, gone on no vacations, declined every wedding invitation, had no sex. She has broadcast and self-narrated a thousand days of sleeping, driving and crying, lugging her camera backpack through the grocery store, talking through a screen to strangers she'll never meet. Her goal is to buy a house and get married by the age of 30, but she's 28 and says she's too busy to have a boyfriend. Her last date was seven years ago... But no one tells streamers when to record or when to stop. There are no labor codes, performance limits or regulations to keep the platforms from setting incentives impossibly high. Many streamers figure out the optimal strategy themselves: The more you share, the more successful you can be.... Though some Twitch stars are millionaires, most scramble to get by, buffeted by the vagaries of audience attention. Emily's paid-subscription count, which peaked last year at 22,000, has since slumped to around 6,000, dropping her base income to about $5,000 a month, according to estimates from the analytics firm Streams Charts... Sometimes Emily dreads waking up and clocking into the reality show that is her life. She knows staring at screens all night is unhealthy, and when she feels too depressed to stream, she'll stay in bed for hours while her viewers watch. But she worries that taking a break would be \"career suicide,\" as she called it. Some viewers already complain that she showers too long, sleeps in too late, doesn't have enough fun... She said she \"used to show true sadness on stream\" but doesn't anymore because it makes viewers uncomfortable. When she hits a breaking point now, she said, she closes herself in the bathroom.",
  "image": "https://a.fsdn.com/sd/topics/tv_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-177433415\"\u003e\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tBack in 2000, Slashdot founder CmdrTaco marked the \u003ca href=\"https://tech.slashdot.org/story/00/04/13/1939221/jennicamcelebrates-4-year-anniversary\"\u003e4th anniversary\u003c/a\u003e of Jennifer Ringley\u0026#39;s pioneering \u0026#34;JenniCam\u0026#34; livestream (saying \u0026#34;It sure beats the Netscape FishCam. It\u0026#39;s nuts how Jenni\u0026#39;s little cam became such a fixture on The Internet...\u0026#34;)\u003c/p\u003e\u003cp\u003e \n\nBut \u003ca href=\"https://www.washingtonpost.com/technology/2025/05/04/longest-marathon-streamer-emilycc/\"\u003ea new article in the Washington Post\u003c/a\u003e remembers how \u0026#34;Once, Ringley looked directly into the camera and held a note in front of her eye. It read: \u0026#39;I FEEL SO LONELY.\u0026#39;\u0026#34;\n\u003ci\u003eBy 2003, Ringley had shut down the site and disappeared. She began declining interview requests, \u003ca href=\"https://www.wired.com/2010/04/0414jennicam-launches/\"\u003esaying\u003c/a\u003e she was enjoying her privacy; her absence on social media continues to this day. \u003c/i\u003e \u003cbr/\u003e\n\u0026#34;But by then, the human zoo was everywhere,\u0026#34; they write including \u0026#34;social media, where everyone could become a character in their own show.\u0026#34;  In 2007 Justin Kan launched \u003ca href=\"https://www.10zenmonkeys.com/2007/06/06/a-conversation-with-justin-kan-of-justintv/\"\u003eJustin.TV\u003c/a\u003e, which eventually became Twitch, \u0026#34;a thrumming online city for anyone wanting to, as its slogan said, \u0026#39;waste time watching other people waste time.\u0026#39;\u0026#34;\u003c/p\u003e\u003cp\u003e \n\nBut the article also notes 2023 stats from the Bureau of Labor Statistics survey that found Americans\u0026#34;were spending far less time socializing than they had \u003ca href=\"https://www.bls.gov/tus/tables/a1_2003.pdf\"\u003e20 years ago\u003c/a\u003e — especially 18-to-29-year-olds, who were spending \u003ca href=\"https://www.washingtonpost.com/opinions/2025/02/21/trump-young-men-gen-z/\"\u003etwo more hours a day alone\u003c/a\u003e.\u0026#34;  So how did  this play out for the next generation of livestreaming influencers?  Here\u0026#39;s the origin story of \u0026#34;a lonely young woman in Texas\u0026#34; who\u0026#39;s \u0026#34;streamed every second of her life for three years and counting.\u0026#34;\n\n\u003ci\u003e\nOne afternoon, her boyfriend told her to try Twitch, saying, as she recalled: \u0026#34;Your life sucks, you work at CVS, you have no friends. ... This could be helpful.\u0026#34; In her \u003ca href=\"https://twitchtracker.com/emilycc/streams/23693992592\"\u003efirst stream\u003c/a\u003e, on a Friday night, she played 3Â½ hours of \u0026#34;World of Warcraft\u0026#34; for her zero followers.\n\u003c/i\u003e \u003cbr/\u003e\n\nEight years later...\n\u003ci\u003e\nSix hundred and forty-two people are watching when Emily tugs off her sleep mask to begin day No. 1,137 of broadcasting every hour of her life...  On the live-streaming service Twitch, one of the world\u0026#39;s most popular platforms, \u003ca href=\"https://www.twitch.tv/emilycc\"\u003eEmily\u003c/a\u003e is a legendary figure. For three years, she has ceaselessly broadcast her life — every birthday and holiday, every sickness and sleepless night, almost all of it alone.  Her commitment has made her a model for success in the new internet economy, where authenticity and endurance are highly prized. It\u0026#39;s also made her a good amount of money: $5.99 a month from thousands of subscribers each, plus donations and tips — minus Twitch\u0026#39;s 30-to-40 percent cut.\u003cp\u003e \nBut to get there, Emily, who agreed to be interviewed on the condition that her last name be withheld due to concerns of harassment, has devoted herself to a solitary life of almost constant stimulation. For three years, she has taken no sick days, gone on no vacations, declined every wedding invitation, had no sex. She has broadcast and self-narrated a thousand days of sleeping, driving and crying, lugging her camera backpack through the grocery store, talking through a screen to strangers she\u0026#39;ll never meet. Her goal is to buy a house and get married by the age of 30, but she\u0026#39;s 28 and says she\u0026#39;s too busy to have a boyfriend. Her last date was seven years ago...  But no one tells streamers when to record or when to stop. There are no labor codes, performance limits or regulations to keep the platforms from setting incentives impossibly high. Many streamers figure out the optimal strategy themselves: The more you share, the more successful you can be.... \u003c/p\u003e\u003cp\u003e \n\nThough some Twitch stars are \u003ca href=\"https://www.washingtonpost.com/technology/2021/12/02/twitch-loltyler1-tyler-steinkamp/\"\u003emillionaires\u003c/a\u003e, most scramble to get by, buffeted by the vagaries of audience attention. Emily\u0026#39;s paid-subscription count, which peaked last year at 22,000, has since slumped to around 6,000, dropping her base income to about $5,000 a month, according to \u003ca href=\"https://streamscharts.com/channels/emilycc\"\u003eestimates\u003c/a\u003e from the analytics firm Streams Charts...  Sometimes Emily dreads waking up and clocking into the reality show that is her life. She knows staring at screens all night is unhealthy, and when she feels too depressed to stream, she\u0026#39;ll stay in bed for hours while her viewers watch. But she worries that taking a break would be \u0026#34;career suicide,\u0026#34; as she called it. Some viewers already complain that she showers too long, sleeps in too late, doesn\u0026#39;t have enough fun... \u003c/p\u003e\u003cp\u003e \n\n She said she \u0026#34;used to show true sadness on stream\u0026#34; but doesn\u0026#39;t anymore because it makes viewers uncomfortable. When she hits a breaking point now, she said, she closes herself in the bathroom.\n\u003c/p\u003e\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
