{
  "id": "c5d5bc10-89f8-4e76-857e-2dbfa7c410b8",
  "title": "One of Kraven the Hunter‘s Weirdest Moments Was Added in Post",
  "link": "https://gizmodo.com/kraven-rhino-scream-nivola-2000545859",
  "description": "That strange (and funny) Rhino scream you've seen from the Kraven movie wasn't intentional, at least on the actor's end.",
  "author": "Justin Carter",
  "published": "Sat, 04 Jan 2025 19:50:49 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Movies",
    "Kraven the Hunter",
    "Sony"
  ],
  "byline": "Justin Carter",
  "length": 2393,
  "excerpt": "That strange (and funny) Rhino scream you've seen from the Kraven movie wasn't intentional, at least on the actor's end.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "If you’ve seen Kraven the Hunter or just been online, you probably know about an odd moment that occurs midway through the film. After being informed that his goons died trying and failing to kidnap the titular hunter, Alessandro Nivola’s Aleksei Systevich lets out a scream that sounds like a dying machine of some kind. You’d think it was meant to set up his transformation into the Rhino later in the film, or even get some kind of reaction out of his top goon. But neither happens, so it just exists as a weird moment in a movie that could stand to be more interesting in general. What happened here? According to Nivola in a recent interview with the Hollywood Reporter, he’d initially done a silent scream during shooting basically because he decided to at that moment. It seemed to pay off since it got the crew to laugh, and director J.C. Chandor later told him that take would be kept in the film’s final cut. But at some point during post-production, things changed, and that strange sound he makes was something done in post-production. He thinks it’s not as effective as the quiet scream, and he might’ve had a point, given how memetic it’s become over the past month. In that same interview, Nivola gave some thoughts on why Kraven got critically raked over the coals. By his telling, being on set was a “really joyful experience,” and he enjoyed getting to “run wild” with Chandor and co-star Christopher Abbott. (The three previously teamed on Chandor’s 2014 film A Most Violent Year.) He said there didn’t seem to be any production problems from his perspective, and noted some of the film’s issues “probably starts to play out in the edit. On these kinds of movies, you hear about all the wranglings at the studio, and maybe there were too many chefs.” Despite Kraven’s negative reception, Nivola’s been taking it stride. He’s grateful to the reviews that’ve praised his performance, but otherwise, he’s fine avoiding the “black hole” that can be critical and fan responses. It probably helps this isn’t the only film he’s in lately: you can also see him in The Brutalist and The Room Next Door, both of which are in theaters now, or will be later in January. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/01/kravenrhino.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eIf you’ve seen \u003ca href=\"https://gizmodo.com/youll-be-craving-some-aspirin-after-the-headache-that-is-kraven-the-hunter-2000537045\"\u003e\u003cem\u003eKraven the Hunter\u003c/em\u003e\u003c/a\u003e or just been online, you probably know about an odd moment that occurs midway through the film. After being informed that his goons died trying and failing to kidnap the titular hunter, Alessandro Nivola’s Aleksei Systevich lets out a scream that sounds like a dying machine of some kind. You’d think it was meant to set up his transformation into the Rhino later in the film, or even get some kind of reaction out of his top goon. But neither happens, so it just exists as a weird moment in a movie that could stand to be \u003ca href=\"https://gizmodo.com/lets-talk-about-the-wild-spider-man-connections-in-kraven-the-hunter-2000537985\"\u003emore interesting\u003c/a\u003e in general.\u003c/p\u003e\n\n \u003cp\u003eWhat happened here? According to Nivola in a recent interview with \u003ca href=\"https://www.hollywoodreporter.com/movies/movie-features/the-brutalist-alessandro-nivola-kraven-the-hunter-1236098004/\"\u003ethe Hollywood Reporter\u003c/a\u003e, he’d initially done a silent scream during shooting basically because he decided to at that moment. It seemed to pay off since it got the crew to laugh, and director J.C. Chandor later told him that take would be kept in the film’s final cut. But at some point during post-production, things changed, and that strange sound he makes was something done in post-production. He thinks it’s not as effective as the quiet scream, and he might’ve had a point, given how memetic it’s become over the past month.\u003c/p\u003e \u003cp\u003e\u003ciframe loading=\"lazy\" title=\"that part in Kraven the Hunter where Rhino makes a weird noise\" width=\"500\" height=\"281\" src=\"about:blank\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\" data-rocket-lazyload=\"fitvidscompatible\" data-lazy-src=\"https://www.youtube.com/embed/TvpLCibjEws?feature=oembed\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\n \u003cp\u003eIn that same interview, Nivola gave some thoughts on why \u003cem\u003eKraven \u003c/em\u003egot critically raked over the coals. By his telling, being on set was a “really joyful experience,” and he enjoyed getting to “run wild” with Chandor and co-star Christopher Abbott. (The three previously teamed on Chandor’s 2014 film \u003cem\u003eA Most Violent Year\u003c/em\u003e.) He said there didn’t seem to be any production problems from his perspective, and noted some of the film’s issues “probably starts to play out in the edit. On these kinds of movies, you hear about all the wranglings at the studio, and maybe there were too many chefs.”\u003c/p\u003e \u003cp\u003eDespite \u003cem\u003eKraven’s \u003c/em\u003enegative reception, Nivola’s been taking it stride. He’s grateful to the reviews that’ve praised his performance, but otherwise, he’s fine avoiding the “black hole” that can be critical and fan responses. It probably helps this isn’t the only film he’s in lately: you can also see him in \u003cem\u003eThe Brutalist \u003c/em\u003eand \u003cem\u003eThe Room Next Door, \u003c/em\u003eboth of which are in theaters now, or will be later in January.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-04T19:50:49Z",
  "modifiedTime": "2025-01-04T19:50:49Z"
}
