{
  "id": "cc6bc79e-95bc-4ac4-9d6e-796af35801fd",
  "title": "Southwest Airlines Will Require Passengers to Keep Portable Chargers Out During Flights",
  "link": "https://gizmodo.com/southwest-airlines-will-require-passengers-to-keep-portable-chargers-out-during-flights-2000605745",
  "description": "The policy starts May 28.",
  "author": "Matt Novak",
  "published": "Wed, 21 May 2025 23:37:22 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Transportation",
    "FAA",
    "portable chargers",
    "Southwest Airlines",
    "TSA"
  ],
  "byline": "Matt Novak",
  "length": 2594,
  "excerpt": "The policy starts May 28.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Southwest Airlines announced it will require all portable device chargers to be kept in plain sight during all flights while they’re in use. The new policy comes after a number of lithium-ion batteries fires on flights worldwide in recent years. The new policy will start May 28 and will require all Southwest passengers to make sure they don’t have any portable chargers, including power banks and cell phone battery charging cases, in overhead bins or even just inside a bag in under the seat in front of them, while they’re in use. “Using portable charging devices while stored in a bag or overhead bin will no longer be permitted,” the airline told Gizmodo in an emailed statement. “Nothing is more important to Southwest than the Safety of its Customers and Employees.” The airline told Gizmodo that it’s okay to keep your portable charger in your carry-on bag if it’s not connected to anything else. But any charger in active use, including one that may be connected to the phone in the form of a case, should be kept visible for the entire flight. The TSA already bans rechargeable and non-rechargeable lithium batteries for phones and laptops from checked baggage. Carry-on baggage is fine, but Southwest Airlines will soon require those chargers to be outside of all bags and visible while in use during the duration of the flight. It’s unclear if other U.S.-based airlines will follow Southwest’s lead, but other airlines around the world have also been cracking down on lithium-ion batteries in an effort to fight fire hazards. As the Associated Press notes, Singapore Airlines and Thai Airways both already prohibit the use of portable chargers on all flights. And Korean Airlines also bans portable chargers from overhead bins. The average U.S. passenger brings four different rechargeable devices with them on a flight, according to the UL Standards \u0026 Engagement research group, with the most common devices being smartphones (82%), laptops (41%), wireless headphones (39%), and tablets (36%). The most common incidents were caused by vaping devices, which accounted for 35% of all incidents on flights in 2023, while power banks accounted for 16% of all incidents reported. “Flight crews are trained to recognize and respond to lithium battery fires in the cabin,” the FAA explains on its website. “Passengers should notify flight crew immediately if their lithium battery or device is overheating, expanding, smoking or burning.” Indeed. If you see something on fire on your flight, battery or otherwise, please let the flight crew know. That’s just generally a good idea.",
  "image": "https://gizmodo.com/app/uploads/2024/07/GettyImages-1483114979.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eSouthwest Airlines announced it will require all portable device chargers to be kept in plain sight during all flights while they’re in use. The new policy comes after a number of lithium-ion batteries fires on flights worldwide in \u003ca href=\"https://gizmodo.com/spirit-airlines-vape-air-travel-emergency-landing-1850180955\"\u003erecent years\u003c/a\u003e.\u003c/p\u003e \u003cp\u003eThe new policy will start May 28 and will require all Southwest passengers to make sure they don’t have any portable chargers, including power banks and cell phone battery charging cases, in overhead bins or even just inside a bag in under the seat in front of them, while they’re in use.\u003c/p\u003e \u003cp\u003e“Using portable charging devices while stored in a bag or overhead bin will no longer be permitted,” the airline told Gizmodo in an emailed statement. “Nothing is more important to Southwest than the Safety of its Customers and Employees.”\u003c/p\u003e\n\n \u003cp\u003eThe airline told Gizmodo that it’s okay to keep your portable charger in your carry-on bag if it’s not connected to anything else. But any charger in active use, including one that may be connected to the phone in the form of a case, should be kept visible for the entire flight.\u003c/p\u003e \u003cp\u003eThe TSA already bans rechargeable and non-rechargeable lithium batteries for phones and laptops from checked baggage. Carry-on baggage is fine, but Southwest Airlines will soon require those chargers to be outside of all bags and visible while in use during the duration of the flight.\u003c/p\u003e \u003cp\u003eIt’s unclear if other U.S.-based airlines will follow Southwest’s lead, but other airlines around the world have also been cracking down on lithium-ion batteries in an effort to fight fire hazards. As the \u003ca href=\"https://abc7.com/post/southwest-airlines-will-require-chargers-kept-use-because-battery-fire-concerns/16492198/\"\u003eAssociated Press\u003c/a\u003e notes, Singapore Airlines and Thai Airways both already prohibit the use of portable chargers on all flights. And Korean Airlines also bans portable chargers from overhead bins.\u003c/p\u003e\n\n \u003cp\u003eThe average U.S. passenger brings four different rechargeable devices with them on a flight, according to the \u003ca href=\"https://ulse.org/aviation-safety\"\u003eUL Standards \u0026amp; Engagement\u003c/a\u003e research group, with the most common devices being smartphones (82%), laptops (41%), wireless headphones (39%), and tablets (36%). The most common incidents were caused by vaping devices, which accounted for 35% of all incidents on flights in 2023, while power banks accounted for 16% of all incidents reported.\u003c/p\u003e \u003cp\u003e“Flight crews are trained to recognize and respond to lithium battery fires in the cabin,” the FAA explains on its website. “Passengers should notify flight crew immediately if their lithium battery or device is overheating, expanding, smoking or burning.”\u003c/p\u003e\n\n \u003cp\u003eIndeed. If you see something on fire on your flight, battery or otherwise, please let the flight crew know. That’s just generally a good idea.\u003c/p\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-21T23:37:22Z",
  "modifiedTime": "2025-05-21T23:37:22Z"
}
