{
  "id": "cc9083c9-929e-4a6e-8dd5-f9b73b7e57c0",
  "title": "Xbox Cloud Gaming may finally let you stream your non-Game Pass purchases soon",
  "link": "https://www.engadget.com/gaming/xbox/xbox-cloud-gaming-may-finally-let-you-stream-your-non-game-pass-purchases-soon-212759959.html?src=rss",
  "description": "Microsoft is expanding Xbox Cloud Gaming’s streaming capabilities to support titles that aren’t on Xbox Game Pass, The Verge reports. The company has stated its plans to let users stream games from their own libraries numerous times over the last few years, going back to the announcement of Project xCloud, but the feature hasn’t yet materialized. Now, Microsoft is ready to start testing it among Xbox Insiders in November, with plans to ultimately support thousands of games, according to The Verge, which cites sources “familiar with Microsoft’s plans.” Xbox players have long been asking for the option to stream games that they’ve purchased, rather than only those that are available on Xbox Game Pass. If the testing period goes as planned, more players could soon see the ability to do this. The report comes on the heels of Xbox president Sarah Bond’s announcement on Friday that Android users will be able to buy and play games on the Xbox app starting next month. This article originally appeared on Engadget at https://www.engadget.com/gaming/xbox/xbox-cloud-gaming-may-finally-let-you-stream-your-non-game-pass-purchases-soon-212759959.html?src=rss",
  "author": "Cheyenne MacDonald",
  "published": "Sat, 12 Oct 2024 21:27:59 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Technology \u0026 Electronics",
    "Game Consoles",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Cheyenne MacDonald"
  ],
  "byline": "Cheyenne MacDonald",
  "length": 973,
  "excerpt": "Microsoft will soon begin testing an expanded version of Xbox Cloud Gaming that will support games from players' own libraries.",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "Microsoft is expanding Xbox Cloud Gaming’s streaming capabilities to support titles that aren’t on Xbox Game Pass, The Verge reports. The company has stated its plans to let users stream games from their own libraries numerous times over the last few years, going back to the announcement of Project xCloud, but the feature hasn’t yet materialized. Now, Microsoft is ready to start testing it among Xbox Insiders in November, with plans to ultimately support thousands of games, according to The Verge, which cites sources “familiar with Microsoft’s plans.”Xbox players have long been asking for the option to stream games that they’ve purchased, rather than only those that are available on Xbox Game Pass. If the testing period goes as planned, more players could soon see the ability to do this. The report comes on the heels of Xbox president Sarah Bond’s announcement on Friday that Android users will be able to buy and play games on the Xbox app starting next month.",
  "image": "https://s.yimg.com/os/creatr-uploaded-images/2024-10/00843190-88e0-11ef-afef-fc381f0c1f9d",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eMicrosoft is expanding Xbox Cloud Gaming’s streaming capabilities to support titles that aren’t on Xbox Game Pass, \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1\" href=\"https://www.theverge.com/2024/10/11/24268038/xbox-cloud-gaming-project-lapland-game-library\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:The Verge;elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1;itc:0;sec:content-canvas\"\u003e\u003cem\u003e\u003cins\u003eThe Verge\u003c/ins\u003e\u003c/em\u003e\u003c/a\u003e reports. The company has stated its plans to let users stream games from their own libraries numerous times over the last few years, going back to the announcement of \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1\" href=\"https://www.engadget.com/2019-11-14-project-xcloud-games-2020-plans.html\" data-ylk=\"slk:Project xCloud;elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003eProject xCloud\u003c/ins\u003e\u003c/a\u003e, but the feature hasn’t yet materialized. Now, Microsoft is ready to start testing it among Xbox Insiders in November, with plans to ultimately support thousands of games, according to \u003cem\u003eThe Verge\u003c/em\u003e, which cites sources “familiar with Microsoft’s plans.”\u003c/p\u003e\u003cp\u003eXbox players have long been asking for the option to stream games that they’ve purchased, rather than only those that are available on Xbox Game Pass. If the testing period goes as planned, more players could soon see the ability to do this. The report comes on the heels of Xbox president Sarah Bond’s announcement on Friday that Android users will be able to \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1\" href=\"https://www.engadget.com/gaming/xbox/xbox-gamers-will-soon-be-able-to-buy-games-from-the-xbox-android-app-120001529.html\" data-ylk=\"slk:buy and play games on the Xbox app;elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1;itc:0;sec:content-canvas\"\u003e\u003cins\u003ebuy and play games on the Xbox app\u003c/ins\u003e\u003c/a\u003e starting next month.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-10-12T21:27:59Z",
  "modifiedTime": null
}
