{
  "id": "d184e488-cf39-482a-ae54-0d0632a873a8",
  "title": "What will happen to TikTok? A look at the potential buyers.",
  "link": "https://www.engadget.com/social-media/what-will-happen-to-tiktok-a-look-at-the-potential-buyers-000110723.html?src=rss",
  "description": "TikTok may be back online and in app stores, but its future in the United States is still far from certain. President Donald Trump’s executive order delaying enforcement of the ban was only a temporary reprieve for the company. While ByteDance was once resistant to the idea of selling TikTok’s US business, that seems to have changed since Trump took office. A ByteDance investor said early this year that striking a deal to keep TikTok in the US is “in everybody's interest.\" Officials in China also suggested they were “open” to a deal, according to The Wall Street Journal. A number of people and companies have signaled some interest in TikTok. Trump himself has said he would like to see a “bidding war” for the app and that the US government should own a stake in the company. What an eventual deal may look like, though, is unclear. These are the offers we currently know about. On March 9, Trump said the administration was \"dealing with four different groups\" on a potential deal, though he didn't name names.  Trump’s executive order gave the company 75 days to come to an agreement, though he has recently said he would \"probably\" extend the deadline if a deal isn't reached by April 5. Oracle NPR reported in January that Oracle was working with Trump Administration officials on “a plan to save TikTok that involves tapping software company Oracle and a group of outside investors to effectively take control of the app's global operations.” Under this arrangement, ByteDance “would retain a minority stake in the company” but Oracle would oversee “the app's algorithm, data collection and software updates.” Headed up by Trump pal Larry Ellison, TikTok has an existing partnership with Oracle. The cloud company already hosts TikTok’s US user data and the company was a key part of TikTok’s original negotiations to remain operational in the US under a plan called Project Texas. (Those negotiations abruptly fell apart in 2022.) Trump also previously signed off on a deal for Oracle and Walmart to acquire a 20 percent stake in TikTok in 2020, when the president tried to ban the app during his first term. That deal never materialized. Now, Trump’s position on Oracle is unclear. He told reporters that Oracle was not among the “many people” with whom he had discussed a deal for TikTok. (Ellison, notably, has been at the White House in recent days. He joined Trump and OpenAI CEO Sam Altman for the announcement of the Stargate Project.) Microsoft Microsoft is reportedly also interested in playing a role in TikTok’s future, according to the same NPR story, which said Microsoft was among the “other potential investors” involved in the talks with Oracle. Trump seemingly confirmed this. When asked directly if Microsoft was interested in buying TikTok, Trump responded “I would say yes.” As with Oracle, this isn’t the first time Microsoft has attempted to acquire the social media company. Microsoft was in talks to buy TikTok in 2020 and take over its US business, but the deal abruptly fell apart. Microsoft CEO Satya Nadella later described it as “the strangest thing I’ve ever sort of worked on.” Perplexity AI (and maybe the US government) Just before TikTok briefly went offline, Perplexity AI threw its hat into the ring, offering a deal to ByteDance that “would “create a new entity combining Perplexity, TikTok US and New Capital Partners.” Since then, Perplexity has reportedly tweaked its proposal. According to the Associated Press, the AI company floated a plan that calls for the “U.S. government to own up to half of that new structure once it makes an initial public offering of at least $300 billion.” Under this plan, ByteDance would keep a minority stake in the company and “would contribute TikTok’s U.S. business without the proprietary algorithm that fuels what users see on the app.” Project Liberty Another set of investors that’s proposed a bid to buy TikTok is a group known as Project Liberty. Led by investor Frank McCourt, it includes Kevin O’Leary of Shark Tank fame. The group initially came forward before the ban took effect. In March, Reddit cofounder Alexis Ohanian announced that he was joining the Project Liberty bid to acquire TikTok's assets. \"I'd love to see an app where users actually own their data and where creators have real control,\" he wrote in a short post on X that hinted at a potential tie-in with... the blockchain. \"Imagine bringing all those users seamlessly onchain...\" An accompanying video referenced the possibility of \"decentralized distribution,\" but disn't offer details. O’Leary previously told CNBC that deals involving a government stake may not comply with the law. “That 50/50 deal, I would love to work with Trump on, so would every other potential buyer ... But the problem with some of these ideas is they are inconsistent with the ruling of the Supreme Court,” he said. “I would love to do a deal, if the law provided for it, but I don’t have the luxury of breaching the order of Congress.” Later, he said that the deal \"changes by the hour,\" writing on X that \"it's clear to me now that we're going to have to do a dance between the original owners, the founders of ByteDance itself, and interpreting the law of what Congress and Supreme Court has upheld.\" MrBeast YouTuber MrBeast, also known as Jimmy Donaldson, joked on X about buying TikTok ahead of the initial ban. He later said that “so many billionaires” had reached out to him about making an offer that he was going to try to actually pull it off. Okay fine, I’ll buy Tik Tok so it doesn’t get banned— MrBeast (@MrBeast) January 14, 2025 At least one group has already confirmed his involvement, along with other “high-net-worth individuals” looking to make an “all-cash offer.” That group, led by employer.com founder Jesse Tinsley also reportedly includes Roblox CEO David Baszucki. According to Bloomberg, together they have put together “significantly” more than $20 billion for a bid, though it’s not clear how seriously their offer is being considered. Bloomberg noted that there’s also a possibility that MrBeast may attach himself to other bids. What’s next? So where does all this leave TikTok? For now, the company is still in limbo. Yes, it's available in the App Store and Google Play, but the app's service could be interrupted again if the company is unable to reach some kind of a deal. For now, though, it seems both the government and ByteDance are much more willing to negotiate than they have been in the past, though it's not at all clear what terms both sides may actually agree on.   Update, March 10, 2025, 6:55PM ET: This story has been updated to add new statements from President Trump, as well as to add details about Reddit founder Alexis Ohanian joining the Project Liberty bid.This article originally appeared on Engadget at https://www.engadget.com/social-media/what-will-happen-to-tiktok-a-look-at-the-potential-buyers-000110723.html?src=rss",
  "author": "Karissa Bell",
  "published": "Mon, 10 Mar 2025 22:55:12 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Software",
    "Investment \u0026 Company Information",
    "Mergers, Acquisitions \u0026 Takeovers",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Karissa Bell"
  ],
  "byline": "Karissa Bell",
  "length": 6811,
  "excerpt": "TikTok is back online for now, but the app's future is still in limbo as Donald Trump pushes for a \"deal.\"",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "TikTok may be back online and in app stores, but its future in the United States is still far from certain. President Donald Trump’s executive order delaying enforcement of the ban was only a temporary reprieve for the company.While ByteDance was once resistant to the idea of selling TikTok’s US business, that seems to have changed since Trump took office. A ByteDance investor said early this year that striking a deal to keep TikTok in the US is “in everybody's interest.\" Officials in China also suggested they were “open” to a deal, according to The Wall Street Journal.A number of people and companies have signaled some interest in TikTok. Trump himself has said he would like to see a “bidding war” for the app and that the US government should own a stake in the company. What an eventual deal may look like, though, is unclear. These are the offers we currently know about. On March 9, Trump said the administration was \"dealing with four different groups\" on a potential deal, though he didn't name names.Trump’s executive order gave the company 75 days to come to an agreement, though he has recently said he would \"probably\" extend the deadline if a deal isn't reached by April 5.OracleNPR reported in January that Oracle was working with Trump Administration officials on “a plan to save TikTok that involves tapping software company Oracle and a group of outside investors to effectively take control of the app's global operations.” Under this arrangement, ByteDance “would retain a minority stake in the company” but Oracle would oversee “the app's algorithm, data collection and software updates.”Headed up by Trump pal Larry Ellison, TikTok has an existing partnership with Oracle. The cloud company already hosts TikTok’s US user data and the company was a key part of TikTok’s original negotiations to remain operational in the US under a plan called Project Texas. (Those negotiations abruptly fell apart in 2022.)Trump also previously signed off on a deal for Oracle and Walmart to acquire a 20 percent stake in TikTok in 2020, when the president tried to ban the app during his first term. That deal never materialized. Now, Trump’s position on Oracle is unclear. He told reporters that Oracle was not among the “many people” with whom he had discussed a deal for TikTok. (Ellison, notably, has been at the White House in recent days. He joined Trump and OpenAI CEO Sam Altman for the announcement of the Stargate Project.)MicrosoftMicrosoft is reportedly also interested in playing a role in TikTok’s future, according to the same NPR story, which said Microsoft was among the “other potential investors” involved in the talks with Oracle. Trump seemingly confirmed this. When asked directly if Microsoft was interested in buying TikTok, Trump responded “I would say yes.”As with Oracle, this isn’t the first time Microsoft has attempted to acquire the social media company. Microsoft was in talks to buy TikTok in 2020 and take over its US business, but the deal abruptly fell apart. Microsoft CEO Satya Nadella later described it as “the strangest thing I’ve ever sort of worked on.”Perplexity AI (and maybe the US government)Just before TikTok briefly went offline, Perplexity AI threw its hat into the ring, offering a deal to ByteDance that “would “create a new entity combining Perplexity, TikTok US and New Capital Partners.”Since then, Perplexity has reportedly tweaked its proposal. According to the Associated Press, the AI company floated a plan that calls for the “U.S. government to own up to half of that new structure once it makes an initial public offering of at least $300 billion.” Under this plan, ByteDance would keep a minority stake in the company and “would contribute TikTok’s U.S. business without the proprietary algorithm that fuels what users see on the app.”Project LibertyAnother set of investors that’s proposed a bid to buy TikTok is a group known as Project Liberty. Led by investor Frank McCourt, it includes Kevin O’Leary of Shark Tank fame. The group initially came forward before the ban took effect.In March, Reddit cofounder Alexis Ohanian announced that he was joining the Project Liberty bid to acquire TikTok's assets. \"I'd love to see an app where users actually own their data and where creators have real control,\" he wrote in a short post on X that hinted at a potential tie-in with... the blockchain. \"Imagine bringing all those users seamlessly onchain...\" An accompanying video referenced the possibility of \"decentralized distribution,\" but disn't offer details.O’Leary previously told CNBC that deals involving a government stake may not comply with the law. “That 50/50 deal, I would love to work with Trump on, so would every other potential buyer ... But the problem with some of these ideas is they are inconsistent with the ruling of the Supreme Court,” he said. “I would love to do a deal, if the law provided for it, but I don’t have the luxury of breaching the order of Congress.” Later, he said that the deal \"changes by the hour,\" writing on X that \"it's clear to me now that we're going to have to do a dance between the original owners, the founders of ByteDance itself, and interpreting the law of what Congress and Supreme Court has upheld.\"MrBeastYouTuber MrBeast, also known as Jimmy Donaldson, joked on X about buying TikTok ahead of the initial ban. He later said that “so many billionaires” had reached out to him about making an offer that he was going to try to actually pull it off.Okay fine, I’ll buy Tik Tok so it doesn’t get banned— MrBeast (@MrBeast) January 14, 2025At least one group has already confirmed his involvement, along with other “high-net-worth individuals” looking to make an “all-cash offer.” That group, led by employer.com founder Jesse Tinsley also reportedly includes Roblox CEO David Baszucki. According to Bloomberg, together they have put together “significantly” more than $20 billion for a bid, though it’s not clear how seriously their offer is being considered. Bloomberg noted that there’s also a possibility that MrBeast may attach himself to other bids.What’s next?So where does all this leave TikTok? For now, the company is still in limbo. Yes, it's available in the App Store and Google Play, but the app's service could be interrupted again if the company is unable to reach some kind of a deal. For now, though, it seems both the government and ByteDance are much more willing to negotiate than they have been in the past, though it's not at all clear what terms both sides may actually agree on.Update, March 10, 2025, 6:55PM ET: This story has been updated to add new statements from President Trump, as well as to add details about Reddit founder Alexis Ohanian joining the Project Liberty bid.If you buy something through a link in this article, we may earn commission.",
  "image": "https://s.yimg.com/ny/api/res/1.2/KIo.yyclqIOQBknIbrfdFA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-01/a1dec720-da08-11ef-aff6-1b0f74ef5ab1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eTikTok may be back online and in app stores, but its future in the United States is still far from certain. President Donald Trump’s executive order \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1\" href=\"https://www.engadget.com/big-tech/trump-delays-tiktok-ban-for-at-least-75-days-via-executive-order-014523110.html\" data-ylk=\"slk:delaying enforcement;elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1;itc:0;sec:content-canvas\"\u003edelaying enforcement\u003c/a\u003e of the ban was only a temporary reprieve for the company.\u003c/p\u003e\u003cp\u003eWhile ByteDance was once resistant to the idea of selling TikTok’s US business, that seems to have changed since Trump took office. A ByteDance investor \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1\" href=\"https://www.axios.com/2025/01/22/bytedance-tiktok-ban-deal-china-us-davos\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:said;elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1;itc:0;sec:content-canvas\"\u003esaid\u003c/a\u003e early this year that striking a deal to keep TikTok in the US is “in everybody\u0026#39;s interest.\u0026#34; Officials in China also suggested they were “open” to a deal, \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1\" href=\"https://www.wsj.com/tech/china-signals-it-wont-block-a-deal-to-keep-tiktok-in-the-u-s-54c4d1e8\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:according to;elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1;itc:0;sec:content-canvas\"\u003eaccording to\u003c/a\u003e \u003cem\u003eThe Wall Street Journal\u003c/em\u003e.\u003c/p\u003e\u003cp\u003eA number of people and companies have signaled some interest in TikTok. Trump himself \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1\" href=\"https://www.bbc.com/news/articles/c4g3z55zz7xo\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:has said;elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1;itc:0;sec:content-canvas\"\u003ehas said\u003c/a\u003e he would like to see a “bidding war” for the app and that the US government should own \u003ca data-i13n=\"elm:affiliate_link;sellerN:CNBC;elmt:;cpos:5;pos:1\" href=\"https://shopping.yahoo.com/rdlw?merchantId=34e37b9c-8975-48da-aa39-df8bcd5badc3\u0026amp;siteId=us-engadget\u0026amp;pageId=1p-autolink\u0026amp;contentUuid=0f967f12-8789-470a-b243-b5d5313dc27c\u0026amp;featureId=text-link\u0026amp;merchantName=CNBC\u0026amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5jbmJjLmNvbS8yMDI1LzAxLzE5L3RydW1wLXNheXMtaGUtd2lsbC1yZXZpdmUtdGlrdG9rLWJ1dC13YW50cy01MHBlcmNlbnQtdXMtb3duZXJzaGlwLmh0bWwiLCJjb250ZW50VXVpZCI6IjBmOTY3ZjEyLTg3ODktNDcwYS1iMjQzLWI1ZDUzMTNkYzI3YyIsIm9yaWdpbmFsVXJsIjoiaHR0cHM6Ly93d3cuY25iYy5jb20vMjAyNS8wMS8xOS90cnVtcC1zYXlzLWhlLXdpbGwtcmV2aXZlLXRpa3Rvay1idXQtd2FudHMtNTBwZXJjZW50LXVzLW93bmVyc2hpcC5odG1sIn0\u0026amp;signature=AQAAAccczjY0KqB_uaso3KYtwba5dbSaVh36FsS6GzN5E033\u0026amp;gcReferrer=https%3A%2F%2Fwww.cnbc.com%2F2025%2F01%2F19%2Ftrump-says-he-will-revive-tiktok-but-wants-50percent-us-ownership.html\u0026amp;refurl=https%3A%2F%2Fwww.engadget.com%2Fsocial-media%2Fwhat-will-happen-to-tiktok-a-look-at-the-potential-buyers-000110723.html\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:a stake;elm:affiliate_link;sellerN:CNBC;elmt:;cpos:5;pos:1;itc:0;sec:content-canvas\"\u003ea stake\u003c/a\u003e in the company. What an eventual deal may look like, though, is unclear. These are the offers we currently know about. On March 9, Trump said the administration was \u0026#34;dealing with four different groups\u0026#34; on a potential deal, though he didn\u0026#39;t name names.\u003c/p\u003e\u003cp\u003eTrump’s executive order gave the company 75 days to come to an agreement, though he has \u003ca data-i13n=\"cpos:6;pos:1\" href=\"https://thehill.com/policy/technology/5180939-trump-considers-extending-tiktok-ban/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:recently said;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003erecently said\u003c/a\u003e he would \u0026#34;probably\u0026#34; extend the deadline if a deal isn\u0026#39;t reached by April 5.\u003c/p\u003e\u003ch2 id=\"oracle\"\u003eOracle\u003c/h2\u003e\u003cp\u003eNPR \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:7;pos:1\" href=\"https://www.npr.org/2025/01/25/g-s1-44779/tiktok-ban-deal-trump-oracle\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:reported;elm:context_link;elmt:doNotAffiliate;cpos:7;pos:1;itc:0;sec:content-canvas\"\u003ereported\u003c/a\u003e in January that Oracle was working with Trump Administration officials on “a plan to save TikTok that involves tapping software company Oracle and a group of outside investors to effectively take control of the app\u0026#39;s global operations.” Under this arrangement, ByteDance “would retain a minority stake in the company” but Oracle would oversee “the app\u0026#39;s algorithm, data collection and software updates.”\u003c/p\u003e\u003cp\u003eHeaded up by Trump pal Larry Ellison, TikTok has an existing partnership with Oracle. The cloud company \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:8;pos:1\" href=\"https://www.engadget.com/tiktok-user-data-us-200500287.html\" data-ylk=\"slk:already hosts;elm:context_link;elmt:doNotAffiliate;cpos:8;pos:1;itc:0;sec:content-canvas\"\u003ealready hosts\u003c/a\u003e TikTok’s US user data and the company was \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:9;pos:1\" href=\"https://www.engadget.com/can-tiktok-convince-the-us-its-not-a-national-security-threat-173030115.html\" data-ylk=\"slk:a key part;elm:context_link;elmt:doNotAffiliate;cpos:9;pos:1;itc:0;sec:content-canvas\"\u003ea key part\u003c/a\u003e of TikTok’s original negotiations to remain operational in the US under a plan called Project Texas. (Those negotiations abruptly \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:10;pos:1\" href=\"https://www.washingtonpost.com/technology/2024/05/29/tiktok-cfius-proposal-rejected/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:fell apart;elm:context_link;elmt:doNotAffiliate;cpos:10;pos:1;itc:0;sec:content-canvas\"\u003efell apart\u003c/a\u003e in 2022.)\u003c/p\u003e\u003cp\u003eTrump also previously \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:11;pos:1\" href=\"https://www.engadget.com/trump-tentatively-approves-tiktok-oracle-walmart-deal-140805501.html\" data-ylk=\"slk:signed off on a deal;elm:context_link;elmt:doNotAffiliate;cpos:11;pos:1;itc:0;sec:content-canvas\"\u003esigned off on a deal\u003c/a\u003e for Oracle and Walmart to acquire a 20 percent stake in TikTok in 2020, when the president tried to ban the app during his first term. That deal never materialized. Now, Trump’s position on Oracle is unclear. He \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:12;pos:1\" href=\"https://www.engadget.com/big-tech/trump-denies-talks-with-oracle-about-a-tiktok-deal-but-says-a-decision-will-likely-be-made-within-30-days-163755199.html\" data-ylk=\"slk:told reporters;elm:context_link;elmt:doNotAffiliate;cpos:12;pos:1;itc:0;sec:content-canvas\"\u003etold reporters\u003c/a\u003e that Oracle was not among the “many people” with whom he had discussed a deal for TikTok. (Ellison, notably, has been at the White House in recent days. He joined Trump and OpenAI CEO Sam Altman for the announcement of the \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:13;pos:1\" href=\"https://www.washingtonpost.com/technology/2024/05/29/tiktok-cfius-proposal-rejected/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Stargate Project;elm:context_link;elmt:doNotAffiliate;cpos:13;pos:1;itc:0;sec:content-canvas\"\u003eStargate Project\u003c/a\u003e.)\u003c/p\u003e\u003ch2 id=\"microsoft\"\u003eMicrosoft\u003c/h2\u003e\u003cp\u003eMicrosoft is reportedly also interested in playing a role in TikTok’s future, according to the same NPR story, which said Microsoft was among the “other potential investors” involved in the talks with Oracle. Trump seemingly confirmed this. When asked directly if Microsoft was interested in buying TikTok, Trump \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:14;pos:1\" href=\"https://www.theguardian.com/technology/2025/jan/28/donald-trump-microsoft-tiktok-purchase-claims\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:responded;elm:context_link;elmt:doNotAffiliate;cpos:14;pos:1;itc:0;sec:content-canvas\"\u003eresponded\u003c/a\u003e “I would say yes.”\u003c/p\u003e\u003cp\u003eAs with Oracle, this isn’t the first time Microsoft has attempted to acquire the social media company. Microsoft was in talks to buy TikTok \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:15;pos:1\" href=\"https://www.engadget.com/microsoft-tiktok-acquisition-september-trump-001655945.html\" data-ylk=\"slk:in 2020;elm:context_link;elmt:doNotAffiliate;cpos:15;pos:1;itc:0;sec:content-canvas\"\u003ein 2020\u003c/a\u003e and take over its US business, but the deal \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:16;pos:1\" href=\"https://www.engadget.com/microsoft-not-buying-tiktok-233257859.html\" data-ylk=\"slk:abruptly fell apart;elm:context_link;elmt:doNotAffiliate;cpos:16;pos:1;itc:0;sec:content-canvas\"\u003eabruptly fell apart\u003c/a\u003e. Microsoft CEO Satya Nadella later \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:17;pos:1\" href=\"https://www.cnbc.com/2021/09/27/microsoft-ceo-calls-trump-tiktok-deal-strangest-thing-worked-on.html\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:described;elm:context_link;elmt:doNotAffiliate;cpos:17;pos:1;itc:0;sec:content-canvas\"\u003edescribed\u003c/a\u003e it as “the strangest thing I’ve ever sort of worked on.”\u003c/p\u003e\u003ch2 id=\"perplexity-ai-and-maybe-the-us-government\"\u003ePerplexity AI (and maybe the US government)\u003c/h2\u003e\u003cp\u003eJust before TikTok briefly \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:18;pos:1\" href=\"https://www.engadget.com/social-media/tiktok-is-no-longer-available-in-the-us-040204115.html\" data-ylk=\"slk:went offline;elm:context_link;elmt:doNotAffiliate;cpos:18;pos:1;itc:0;sec:content-canvas\"\u003ewent offline\u003c/a\u003e, Perplexity AI threw its hat into the ring, offering \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:19;pos:1\" href=\"https://www.engadget.com/social-media/perplexity-ai-has-reportedly-submitted-an-11th-hour-bid-to-save-tiktok-in-the-us-215012514.html\" data-ylk=\"slk:a deal;elm:context_link;elmt:doNotAffiliate;cpos:19;pos:1;itc:0;sec:content-canvas\"\u003ea deal\u003c/a\u003e to ByteDance that “would “create a new entity combining Perplexity, TikTok US and New Capital Partners.”\u003c/p\u003e\u003cp\u003eSince then, Perplexity has reportedly tweaked its proposal. According to the \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:20;pos:1\" href=\"https://apnews.com/article/tiktok-bytedance-trump-perplexity-87988733973760927bb5681f7de9b9af\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Associated Press;elm:context_link;elmt:doNotAffiliate;cpos:20;pos:1;itc:0;sec:content-canvas\"\u003e\u003cem\u003eAssociated Press\u003c/em\u003e\u003c/a\u003e, the AI company floated a plan that calls for the “U.S. government to own up to half of that new structure once it makes an initial public offering of at least $300 billion.” Under this plan, ByteDance would keep a minority stake in the company and “would contribute TikTok’s U.S. business without the proprietary algorithm that fuels what users see on the app.”\u003c/p\u003e\u003ch2 id=\"project-liberty\"\u003eProject Liberty\u003c/h2\u003e\u003cp\u003eAnother set of investors that’s proposed a bid to buy TikTok is a group known as \u003ca data-i13n=\"cpos:21;pos:1\" href=\"https://www.projectliberty.io/peoples-bid-for-tiktok/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Project Liberty;cpos:21;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eProject Liberty\u003c/a\u003e. Led by investor Frank McCourt, it includes \u003ca data-i13n=\"cpos:22;pos:1\" href=\"https://www.projectliberty.io/news/kevin-oleary-joining-the-peoples-bid-for-tiktok/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Kevin O’Leary;cpos:22;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eKevin O’Leary\u003c/a\u003e of \u003cem\u003eShark Tank\u003c/em\u003e fame. The group initially came forward before the ban took effect.\u003c/p\u003e\u003cp\u003eIn March, Reddit cofounder Alexis Ohanian \u003ca data-i13n=\"cpos:23;pos:1\" href=\"https://x.com/alexisohanian/status/1899203761589170198\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:announced;cpos:23;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eannounced\u003c/a\u003e that he was joining the Project Liberty bid to acquire TikTok\u0026#39;s assets. \u0026#34;I\u0026#39;d love to see an app where users actually own their data and where creators have real control,\u0026#34; he wrote in a short post on X that hinted at a potential tie-in with... the blockchain. \u0026#34;Imagine bringing all those users seamlessly onchain...\u0026#34; An accompanying video referenced the possibility of \u0026#34;decentralized distribution,\u0026#34; but disn\u0026#39;t offer details.\u003c/p\u003e\u003cp\u003eO’Leary previously \u003ca data-i13n=\"elm:affiliate_link;sellerN:CNBC;elmt:;cpos:24;pos:1\" href=\"https://shopping.yahoo.com/rdlw?merchantId=34e37b9c-8975-48da-aa39-df8bcd5badc3\u0026amp;siteId=us-engadget\u0026amp;pageId=1p-autolink\u0026amp;contentUuid=0f967f12-8789-470a-b243-b5d5313dc27c\u0026amp;featureId=text-link\u0026amp;merchantName=CNBC\u0026amp;custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL3d3dy5jbmJjLmNvbS8yMDI1LzAxLzIyL2tldmluLW9sZWFyeS1zYXlzLWhlLXdpbGwtbG92ZS10by1kby1hLXRpa3Rvay1kZWFsLWJ1dC1sYXctcHJldmVudHMtaXRzLWFjcXVpc2l0aW9uLmh0bWwiLCJjb250ZW50VXVpZCI6IjBmOTY3ZjEyLTg3ODktNDcwYS1iMjQzLWI1ZDUzMTNkYzI3YyIsIm9yaWdpbmFsVXJsIjoiaHR0cHM6Ly93d3cuY25iYy5jb20vMjAyNS8wMS8yMi9rZXZpbi1vbGVhcnktc2F5cy1oZS13aWxsLWxvdmUtdG8tZG8tYS10aWt0b2stZGVhbC1idXQtbGF3LXByZXZlbnRzLWl0cy1hY3F1aXNpdGlvbi5odG1sIn0\u0026amp;signature=AQAAAQKINfRiCJCB29cl56S4SPS2SInboy4kiKjWj4Gefend\u0026amp;gcReferrer=https%3A%2F%2Fwww.cnbc.com%2F2025%2F01%2F22%2Fkevin-oleary-says-he-will-love-to-do-a-tiktok-deal-but-law-prevents-its-acquisition.html\u0026amp;refurl=https%3A%2F%2Fwww.engadget.com%2Fsocial-media%2Fwhat-will-happen-to-tiktok-a-look-at-the-potential-buyers-000110723.html\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:told CNBC;elm:affiliate_link;sellerN:CNBC;elmt:;cpos:24;pos:1;itc:0;sec:content-canvas\"\u003etold CNBC\u003c/a\u003e that deals involving a government stake may not comply with the law. “That 50/50 deal, I would love to work with Trump on, so would every other potential buyer ... But the problem with some of these ideas is they are inconsistent with the ruling of the Supreme Court,” he said. “I would love to do a deal, if the law provided for it, but I don’t have the luxury of breaching the order of Congress.” Later, \u003ca data-i13n=\"cpos:25;pos:1\" href=\"https://x.com/kevinolearytv/status/1884710008664764806\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:he said;cpos:25;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003ehe said\u003c/a\u003e that the deal \u0026#34;changes by the hour,\u0026#34; writing on X that \u0026#34;it\u0026#39;s clear to me now that we\u0026#39;re going to have to do a dance between the original owners, the founders of ByteDance itself, and interpreting the law of what Congress and Supreme Court has upheld.\u0026#34;\u003c/p\u003e\u003ch2 id=\"mrbeast\"\u003eMrBeast\u003c/h2\u003e\u003cp\u003eYouTuber MrBeast, also known as Jimmy Donaldson, joked \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:26;pos:1\" href=\"https://x.com/MrBeast/status/1878995330731299006\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:on X;elm:context_link;elmt:doNotAffiliate;cpos:26;pos:1;itc:0;sec:content-canvas\"\u003eon X\u003c/a\u003e about buying TikTok ahead of the initial ban. He later \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:27;pos:1\" href=\"https://x.com/MrBeast/status/1879224239485808811\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:said;elm:context_link;elmt:doNotAffiliate;cpos:27;pos:1;itc:0;sec:content-canvas\"\u003esaid\u003c/a\u003e that “so many billionaires” had reached out to him about making an offer that he was going to try to actually pull it off.\u003c/p\u003e\u003cdiv data-embed-anchor=\"6bb293bb-e1aa-5946-b815-33e35b90a8d8\"\u003e\u003cblockquote placeholder=\"\" data-theme=\"light\"\u003e\u003cp\u003eOkay fine, I’ll buy Tik Tok so it doesn’t get banned\u003c/p\u003e\u003cp\u003e— MrBeast (@MrBeast) \u003ca href=\"https://twitter.com/MrBeast/status/1878995330731299006?ref_src=twsrc%5Etfw\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:January 14, 2025;elm:context_link;itc:0;sec:content-canvas\"\u003eJanuary 14, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003c/div\u003e\u003cp\u003eAt least one group has already \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:28;pos:1\" href=\"https://www.paulhastings.com/news/paul-hastings-advises-investor-group-on-all-cash-bid-for-tiktoks-u-s-operations\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:confirmed;elm:context_link;elmt:doNotAffiliate;cpos:28;pos:1;itc:0;sec:content-canvas\"\u003econfirmed\u003c/a\u003e his involvement, along with other “high-net-worth individuals” looking to make an “all-cash offer.” That group, led by employer.com founder Jesse Tinsley also reportedly includes Roblox CEO David Baszucki. According to \u003cem\u003eBloomberg\u003c/em\u003e, together they have put together “significantly” more than \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:29;pos:1\" href=\"https://www.bloomberg.com/news/articles/2025-01-29/tiktok-bidders-to-offer-significantly-more-than-20-billion?sref=10lNAhZ9\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:$20 billion;elm:context_link;elmt:doNotAffiliate;cpos:29;pos:1;itc:0;sec:content-canvas\"\u003e$20 billion\u003c/a\u003e for a bid, though it’s not clear how seriously their offer is being considered. \u003cem\u003eBloomberg\u003c/em\u003e noted that there’s also a possibility that MrBeast may attach himself to other bids.\u003c/p\u003e\u003ch2 id=\"whats-next\"\u003eWhat’s next?\u003c/h2\u003e\u003cp\u003eSo where does all this leave TikTok? For now, the company is still in limbo. Yes, \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:30;pos:1\" href=\"https://www.engadget.com/social-media/tiktok-is-back-in-apples-app-store-in-the-us-014013369.html\" data-ylk=\"slk:it\u0026#39;s available;elm:context_link;elmt:doNotAffiliate;cpos:30;pos:1;itc:0;sec:content-canvas\"\u003eit\u0026#39;s available\u003c/a\u003e in the App Store and Google Play, but the app\u0026#39;s service could be interrupted again if the company is unable to reach some kind of a deal. For now, though, it seems both the government and ByteDance are much more willing to negotiate than they have been in the past, though it\u0026#39;s not at all clear what terms both sides may actually agree on.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate, March 10, 2025, 6:55PM ET:\u003c/strong\u003e This story has been updated to add new statements from President Trump, as well as to add details about Reddit founder Alexis Ohanian joining the Project Liberty bid.\u003c/p\u003e\u003cp\u003eIf you buy something through a link in this article, we may earn commission.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-10T22:55:12Z",
  "modifiedTime": null
}
