{
  "id": "d3f200f1-e083-4b8f-8006-85c46a594683",
  "title": "Ask Bruce Perens Your Questions About How He Hopes to Get Open Source Developers Paid",
  "link": "https://news.slashdot.org/story/24/12/04/0426220/ask-bruce-perens-your-questions-about-how-he-hopes-to-get-open-source-developers-paid?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "Bruce Perens wrote the original Open Source definition back in 1997, and then co-founded the Open Source Initiative with Eric Raymond in 1998. But after resigning from the group in 2020, Perens is now diligently developing an alternative he calls \"Post Open\" to \"meet goals that Open Source fails at today\" — even providing a way to pay developers for their work. To make it all happen, he envisions software developers owning (and controlling) a not-for-profit corporation developing a body of software called \"the Post Open Collection\" and collecting its licensing fees to distribute among developers. The hope? To \"make it possible for an individual developer to stay at home and code all day, and make their living that way without having to build a company.\" The not-for-profit entity — besides actually enforcing its licensing — could also: Provide tech support, servicing all Post-Open software through one entity.Improve security by providing developers with cryptographic-hardware-backed authentication guaranteeing secure software chain-of-custody.Handle onerous legal requirements like compliance with the EU Cyber Resilience Act \"on behalf of all developers in the Post Open Collection\".Compensate documentation writers.Fund lobbying on behalf of developers, along with advocacy for their software's privacy-preserving features. \"We've started to build the team,\" Perens said in a recent interview, announcing weeks ago that attorneys are already discussing the structure of the future organization and its proposed license. But what do you think? Perens has agreed to answer questions from Slashdot readers... He's also Slashdot reader #3,872. (And Perens is also an amateur radio operator, currently on the board of M17 — a community of open source developers and radio enthusiasts — and in general support of Open Source and Amateur Radio projects through his non-profit HamOpen.org.) But more importantly, Perens \"was the person to announce 'Open Source' to the world,\" according to his official site. Now's your chance to ask him about his next new big idea... Ask as many questions as you'd like, but please, one per comment. We'll pick the very best questions — and forward them on to Bruce Perens himself to answer! Read more of this story at Slashdot.",
  "author": "EditorDavid",
  "published": "2024-12-04T23:34:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "opensource"
  ],
  "byline": "",
  "length": 1,
  "excerpt": "×",
  "siteName": "",
  "favicon": "https://a.fsdn.com/sd/m/assets/apple-touch-icon-precomposed2X-e553cba2892b057428cabcdff1a372fc.png",
  "text": "×",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\n\n\n\n\n\u003cdiv id=\"ccpa-modal\"\u003e\n        \u003cp\u003e\u003cspan id=\"modal-close\"\u003e×\u003c/span\u003e\u003c/p\u003e\n    \u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
