{
  "id": "d435a7c8-36fa-4443-8333-62e4e6a79f9e",
  "title": "Daisy Ridley’s Husband Cast in Adaptation of Former Reylo ‘Star Wars’ Fan Fiction",
  "link": "https://gizmodo.com/love-hypothesis-movie-reylo-daisy-ridley-tom-bateman-2000630979",
  "description": "Tom Bateman will star alongside Lili Reinhart in an adaptation of the bestseller 'The Love Hypothesis' by Ali Hazelwood.",
  "author": "Germain Lussier",
  "published": "Thu, 17 Jul 2025 22:00:27 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Movies",
    "Daisy Ridley",
    "Star Wars",
    "The Love Hypothesis",
    "Tom Bateman"
  ],
  "byline": "Germain Lussier",
  "length": 2530,
  "excerpt": "Tom Bateman will star alongside Lili Reinhart in an adaptation of the bestseller 'The Love Hypothesis' by Ali Hazelwood.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "The behind-the-scenes story of an upcoming romantic comedy could, on its own, be a pretty fascinating movie. Here’s the pitch. A young Star Wars fan writes a piece of Reylo (that’s Rey and Kylo Ren for the non-shippers out there) alternative universe fanfiction. The fan is approached about turning the story into a novel, only, it can’t be specific to Star Wars anymore. So the names change, but the intention and romance stay the same. That book becomes a smash hit bestseller, Hollywood comes calling, and when the movie version finally comes to fruition, the filmmakers cast the real-life husband of one of the actors who played the character who originally inspired the story. Roll credits. It’s a little wild, a little convoluted, but exactly what has happened to author Ali Hazelwood with her debut novel, The Love Hypothesis. The story was originally published online as Head Over Feet, a an alternate universe collage romance between Daisy Ridley’s Rey and Adam Driver’s Ben Solo/Kylo Ren. Once it got picked up by an actual publisher, though, the romance stayed the same, but everything Star Wars was removed… save for the male lead being named Adam, after Adam Driver. And now, for the movie adaptation, Adam will be played by Tom Bateman, the British actor married to his Murder on the Orient Express co-star, Daisy Ridley. Yes, the same Daisy Ridley who played Rey in Star Wars. The other lead, named Olive, will be played by Lili Reinhart of Riverdale fame. So was the casting intentional? We don’t know, but the wonderful harmony of it is impossible to ignore. And, frankly, it’s pretty damn delightful too. Sure, most people who read The Love Hypothesis during its 10-month run on the New York Times bestseller list didn’t know its Star Wars roots. And people who eventually see the movie, directed by Claire Scanlon and adapted by Sarah Rothschild, will never realize that either. But the people who do can certainly enjoy it on a whole other level. The Love Hypothesis joins a growing list of stories that started as fan fiction and eventually made their way into the book market, and then beyond to the movie and TV adaptation. The most famous is probably Fifty Shades of Grey, which was inspired by Twilight, though Dakota Johnson isn’t married to Robert Pattinson in real life. At least not yet. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/07/Star-Wars-Reylo-kiss-1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eThe behind-the-scenes story of an upcoming romantic comedy could, on its own, be a pretty fascinating movie. Here’s the pitch. A young \u003cem\u003eStar Wars\u003c/em\u003e fan \u003ca href=\"https://gizmodo.com/daisy-ridley-reylo-kiss-star-wars-rise-of-skywalker-1851205699\"\u003ewrites a piece of Reylo\u003c/a\u003e (that’s Rey and Kylo Ren for the non-shippers out there) alternative universe fanfiction. The fan is approached about turning the story into a novel, only, \u003ca href=\"https://gizmodo.com/daisy-ridley-says-the-rise-of-skywalker-doesnt-treat-re-1839144899\"\u003eit can’t be specific to \u003cem\u003eStar Wars\u003c/em\u003e anymore\u003c/a\u003e. So the names change, but the intention and romance stay the same. That book becomes a smash hit bestseller, Hollywood comes calling, and when the movie version finally comes to fruition, the filmmakers cast the real-life husband of \u003ca href=\"https://gizmodo.com/daisy-ridley-rey-star-wars-movie-update-new-writer-2000561712\"\u003eone of the actors who played\u003c/a\u003e the character who originally inspired the story. Roll credits.\u003c/p\u003e \u003cp\u003eIt’s a little wild, a little convoluted, but exactly what has happened to author Ali Hazelwood with her debut novel, \u003cem\u003eThe Love Hypothesis\u003c/em\u003e. The story was originally published online as \u003cem\u003eHead Over Feet,\u003c/em\u003e a an alternate universe collage romance between Daisy Ridley’s Rey and Adam Driver’s Ben Solo/Kylo Ren. Once it got picked up by an actual publisher, though, the romance stayed the same, but everything \u003cem\u003eStar Wars\u003c/em\u003e was removed… save for the male lead being named Adam, after Adam Driver. And now, for the movie adaptation, \u003ca href=\"https://x.com/AmazonMGMStudio/status/1945906725439099312\"\u003eAdam will be played by\u003c/a\u003e Tom Bateman, the British actor married to his \u003cem\u003eMurder on the Orient Express\u003c/em\u003e co-star, Daisy Ridley. Yes, the same Daisy Ridley who played Rey in \u003cem\u003eStar Wars\u003c/em\u003e. The other lead, named Olive, will be played by Lili Reinhart of \u003cem\u003eRiverdale\u003c/em\u003e fame.\u003c/p\u003e \u003cp\u003eSo was the casting intentional? We don’t know, but the wonderful harmony of it is impossible to ignore. And, frankly, it’s pretty damn delightful too. Sure, most people who read \u003cem\u003eThe Love Hypothesis\u003c/em\u003e during its 10-month run on the New York Times bestseller list didn’t know its\u003cem\u003e Star Wars\u003c/em\u003e roots. And people who eventually see the movie, directed by Claire Scanlon and adapted by Sarah Rothschild, will never realize that either. But the people who do can certainly enjoy it on a whole other level.\u003c/p\u003e\n\n \u003cp\u003e\u003cem\u003eThe Love Hypothesis\u003c/em\u003e joins a growing list of stories that started as fan fiction and eventually made their way into the book market, and then beyond to the movie and TV adaptation. The most famous is probably \u003cem\u003eFifty Shades of Grey,\u003c/em\u003e which was inspired by \u003cem\u003eTwilight\u003c/em\u003e, though Dakota Johnson isn’t married to Robert Pattinson in real life. At least not yet.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-17T22:00:27Z",
  "modifiedTime": "2025-07-17T22:00:27Z"
}
