{
  "id": "d7902786-ddcd-48e9-b5a0-7030f770e60a",
  "title": "Pokémon developer faces major data leak",
  "link": "https://www.theverge.com/2024/10/14/24270226/pokemon-game-freak-data-leak-confirmed",
  "description": "",
  "author": "Adi Robertson",
  "published": "2024-10-14T16:59:22-04:00",
  "source": "https://www.theverge.com/rss/index.xml",
  "categories": null,
  "byline": "Adi Robertson",
  "length": 2735,
  "excerpt": "Pokémon video game developer Game Freak has confirmed a major data leak, which includes information about employees as well as details and source code from past games.",
  "siteName": "The Verge",
  "favicon": "https://www.theverge.com/icons/android_chrome_512x512.png",
  "text": "Hackers released a collection of leaked data from Pokémon game developer Game Freak over the weekend, including personal information about employees. Game Freak — which develops the main lineup of Pokémon video games — confirmed the breach in a statement, saying (per a machine translation from Japanese) that it was the result of “unauthorized access to our servers by a third party” and dated back to August of 2024.Game Freak said the leaked personal information — which it characterizes as names and company email addresses — included around 2,600 items. As Polygon notes, however, the breach appears to include much more than employee information. Redditors and others say they’ve unearthed source code from previous games as well as unused pokémon designs and other things that were scrapped during the development process of those games. They’ve allegedly found more limited detail about future projects, including some codenames for future games.There are no apparent reports of direct leaks from the other companies involved in Pokémon as part of this breach, including Nintendo, Creatures Inc., and the jointly owned Pokémon Company.Game Freak’s statement, which is dated to October 10th but, according to Polygon, appeared on the 13th, says the server has since been secured and that the company is taking steps to bolster its security measures. Here’s the full machine translation:October 10, 2024Game Freak Inc.Notice and apology regarding the leak of personal information due to unauthorized accessGame Freak Inc. (Headquarters: Chiyoda-ku, Tokyo, CEO: Satoshi Tajiri, hereinafter referred to as “the Company”) has discovered that the personal information of our employees and others was leaked in connection with unauthorized access to our server by a third party in August 2024.We sincerely apologize for the great inconvenience and concern caused to all concerned parties.1. Leaked personal informationPersonal data regarding our employees, etc.*Items: Name, company email addressNumber of cases: 2,606*Our employees, contracted business workers (including G-appointed employees and former employees)2. Response to those whose personal information has been confirmed to have been leakedWe are contacting the relevant employees, etc. individually.For those who cannot be contacted individually due to resignation, etc., we will notify them through this announcement and set up a hotline to handle inquiries regarding this matter.3. Measures to prevent recurrenceWe have already rebuilt and re-inspected our servers, but we will work to prevent recurrence by further strengthening our security measures.4. Inquiries regarding this matterInquiries from those affected by this matter can be made through the hotline below.",
  "image": "https://cdn.vox-cdn.com/thumbor/98N-SX4Hfdq24eaA0RJDnKnkBFk=/0x0:1920x1080/1200x628/filters:focal(960x540:961x541)/cdn.vox-cdn.com/uploads/chorus_asset/file/25677371/Switch_PokemonSwordPokemonShield_ExpansionPass_screen_06.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eHackers released a collection of leaked data from Pokémon game developer Game Freak over the weekend, including personal information about employees. Game Freak — which develops the main lineup of \u003cem\u003ePokémon\u003c/em\u003e video games — \u003ca href=\"https://www.gamefreak.co.jp/wordpress/wp-content/uploads/2024/10/info20241010.pdf\"\u003econfirmed the breach\u003c/a\u003e in a statement, saying (per a machine translation from Japanese) that it was the result of “unauthorized access to our servers by a third party” and dated back to August of 2024.\u003c/p\u003e\u003cp\u003eGame Freak said the leaked personal information — which it characterizes as names and company email addresses — included around 2,600 items. \u003ca href=\"https://www.polygon.com/news/465710/pokemon-game-freak-leak-hack\"\u003eAs \u003cem\u003ePolygon\u003c/em\u003e notes\u003c/a\u003e, however, the breach appears to include much more than employee information. Redditors and others say they’ve unearthed source code from previous games as well as unused pokémon designs and other things that were scrapped during the development process of those games. They’ve allegedly found more limited detail about future projects, including some codenames for future games.\u003c/p\u003e\u003cp\u003eThere are no apparent reports of direct leaks from the other companies involved in \u003cem\u003ePokémon\u003c/em\u003e as part of this breach, including Nintendo, Creatures Inc., and the jointly owned Pokémon Company.\u003c/p\u003e\u003cp\u003eGame Freak’s statement, which is dated to October 10th but, according to \u003cem\u003ePolygon,\u003c/em\u003e appeared on the 13th, says the server has since been secured and that the company is taking steps to bolster its security measures. Here’s the full machine translation:\u003c/p\u003e\u003cdiv\u003e\u003cblockquote\u003e\u003cp\u003eOctober 10, 2024\u003c/p\u003e\u003cp\u003eGame Freak Inc.\u003c/p\u003e\u003cp\u003eNotice and apology regarding the leak of personal information due to unauthorized access\u003c/p\u003e\u003cp\u003eGame Freak Inc. (Headquarters: Chiyoda-ku, Tokyo, CEO: Satoshi Tajiri, hereinafter referred to as “the Company”) has discovered that the personal information of our employees and others was leaked in connection with unauthorized access to our server by a third party in August 2024.\u003c/p\u003e\u003cp\u003eWe sincerely apologize for the great inconvenience and concern caused to all concerned parties.\u003c/p\u003e\u003cp\u003e1. Leaked personal information\u003c/p\u003e\u003cp\u003ePersonal data regarding our employees, etc.*\u003c/p\u003e\u003cp\u003eItems: Name, company email address\u003c/p\u003e\u003cp\u003eNumber of cases: 2,606\u003c/p\u003e\u003cp\u003e*Our employees, contracted business workers (including G-appointed employees and former employees)\u003c/p\u003e\u003cp\u003e2. Response to those whose personal information has been confirmed to have been leaked\u003c/p\u003e\u003cp\u003eWe are contacting the relevant employees, etc. individually.\u003c/p\u003e\u003cp\u003eFor those who cannot be contacted individually due to resignation, etc., we will notify them through this announcement and set up a hotline to handle inquiries regarding this matter.\u003c/p\u003e\u003cp\u003e3. Measures to prevent recurrence\u003c/p\u003e\u003cp\u003eWe have already rebuilt and re-inspected our servers, but we will work to prevent recurrence by further strengthening our security measures.\u003c/p\u003e\u003cp\u003e4. Inquiries regarding this matter\u003c/p\u003e\u003cp\u003eInquiries from those affected by this matter can be made through the hotline below.\u003c/p\u003e\u003c/blockquote\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-14T20:59:21.696Z",
  "modifiedTime": "2024-10-14T20:59:21.696Z"
}
