{
  "id": "e54265b7-2ac4-4ce6-ad66-f6381b89c1e4",
  "title": "X Is Giving Away Your Data to Train Third-Party AIs",
  "link": "https://lifehacker.com/tech/x-is-selling-your-data-to-third-parties-for-ai-training",
  "description": "It might finally be time to leave this place.",
  "author": "Jake Peterson",
  "published": "Fri, 18 Oct 2024 21:00:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "AI"
  ],
  "byline": "Jake Peterson",
  "length": 4811,
  "excerpt": "It might finally be time to leave this place.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "It might finally be time to leave this place. Credit: Alexuans / Shutterstock.com Back when it was known as Twitter, the social media app had plenty of its own problems, but I'd wager the share of users who think X is a flourishing, functioning site in comparison is considerably small. The changes implemented under CEO Elon Musk have resulted in a platform that is less secure, more toxic, and, frankly, disrespectful of its users' privacy. You don't need to look very hard to see why X has no regard for your data: Last year, we found out that Circles, a feature explicitly designed for sharing posts to a private circle of followers, was just letting unapproved users see your posts for some reason. Then, back in July, X offered users the option to block the company's AI platform, Grok, from using their data for training—suggesting the company may have been scraping user data without permission before that point.Now, it turns out X user data is again being used for AI training, but this time, for unnamed third-parties—again, without prior consent.X seems to be selling your user data for third-party AI trainingAs reported by TechCrunch, X updated its Privacy Policy on Wednesday, indicating the company will hand over user data to third-party collaborators for AI training purposes. This is the default, not an opt-in situation: If you don't like the sound of your posts and activity being used to train mysterious AI systems out in the world, you need to decidedly say so—assuming you even know that's an option in the first place. While the rule change doesn't say whether X is benefitting financially from these third-party collaborations, that seems likely. After all, other companies have sold user data to other companies to train AI models, includiing both Reddit and Discord, each of which, like X, has an enormous amount of user-generated content to offer to top buyers.The specific portion of the Privacy Policy that calls out this activity is as follows: “Third-party collaborators. Depending on your settings, or if you decide to share your data, we may share or disclose your information with third parties. If you do not opt out, in some instances the recipients of the information may use it for their own independent purposes in addition to those stated in X’s Privacy Policy, including, for example, to train their artificial intelligence models, whether generative or otherwise.”How to opt-out of AI data sharing on XTo opt-out of this data sharing, you need to change your Settings on X. Head to Privacy and safety, then, under Data sharing and personalization, click Data sharing with business partners. Disable this feature to opt-out. What's potentially most egregious about this situation to me, aside from X selling user data in the first place, is that it's not obvious at all how to disable it. Even when you go to this setting's page, it says the following:\"X always shares information with business partners as a way to run and improve its products. When enabled, this allows X to share additional information with those partners to help support running X’s business, including making X’s marketing activities on other sites and apps more relevant for you. Learn more.\"There's no explicit mention of selling your data for AI training. In fact, if you click that \"Learn more\" link, the page it leads to doesn't mention anything about AI training either. TechCrunch posits that X will update these descriptions on Nov. 15, when they officially update their Privacy Policy. Of course, that's speculation, so we'll have to wait and see.X doesn't care about youEither way, X clearly has no desire for the majority of its user base to opt-out of this data sharing, likely because it's in their financial interest to keep them in the dark. X is floundering when it comes to its finances, so the company needs to find ways to make money. Advertisers are fleeing, and most people don't want to pay for something they can get for free, so, sure, let's sell your data instead.TechCrunch also reports the new Privacy Policy removed language that defined the length of time the company would hold onto your data, in favor of language that says they will keep it for basically as long as your account is active, and as long as they see fit. In addition, you can't expect data your delete from X to be gone forever, as the policy says \"public content can exist elsewhere even after it is removed from X.\" While the company uses examples like search engines and third-parties holding your data, you can imagine this also covers those third-parties who are training their AI models with your posts.If you've finally had enough, consider jumping ship to one of the many X alternatives out there. (And if you choose Bluesky, there's a good way to find all of your X followers there.)",
  "image": "https://lifehacker.com/imagery/articles/01JAG4K78ZWNESB6NEV8853JJV/hero-image.fill.size_1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n\u003cdiv data-ga-module=\"content-header\" aria-label=\"Content Header\"\u003e\n\n\n\u003cp\u003eIt might finally be time to leave this place.\u003c/p\u003e\n\u003c/div\u003e\n\u003csection data-ga-module=\"content-body\"\u003e\n\n\u003cimg src=\"https://lifehacker.com/imagery/articles/01JAG4K78ZWNESB6NEV8853JJV/hero-image.fill.size_1248x702.v1729271332.jpg\" alt=\"THe X logo on a building\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01JAG4K78ZWNESB6NEV8853JJV/hero-image.fill.size_400x225.v1729271332.jpg 400w, https://lifehacker.com/imagery/articles/01JAG4K78ZWNESB6NEV8853JJV/hero-image.fill.size_800x450.v1729271332.jpg 800w, https://lifehacker.com/imagery/articles/01JAG4K78ZWNESB6NEV8853JJV/hero-image.fill.size_1248x702.v1729271332.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\n\u003cp\u003e\u003cspan\u003eCredit: Alexuans / Shutterstock.com\u003c/span\u003e\n\u003c/p\u003e\n\u003carticle data-autopogo=\"\"\u003e\n\u003chr/\u003e\n\u003cp\u003eBack when it was known as Twitter, the social media app had plenty of its own problems, but I\u0026#39;d wager the share of users who think X is a flourishing, functioning site in comparison is considerably small. The changes implemented under CEO Elon Musk have resulted in a platform that is less secure, more toxic, and, frankly, disrespectful of its users\u0026#39; privacy. \u003c/p\u003e\u003cp\u003eYou don\u0026#39;t need to look very hard to see why X has no regard for your data: Last year, we found out that Circles, a feature explicitly designed for sharing posts to a private circle of followers, \u003ca href=\"https://lifehacker.com/your-twitter-circle-isn-t-actually-private-right-now-1850320575\" target=\"_blank\"\u003ewas just letting unapproved users see your posts for some reason\u003c/a\u003e. Then, back in July, X offered users the option to block the company\u0026#39;s AI platform, Grok, \u003ca href=\"https://lifehacker.com/tech/hot-to-stop-x-from-training-ai-on-your-posts\" target=\"_blank\"\u003efrom using their data for training\u003c/a\u003e—suggesting the company may have been scraping user data without permission before that point.\u003c/p\u003e\u003cp\u003eNow, it turns out X user data is again being used for AI training, but this time, for unnamed third-parties—again, without prior consent.\u003c/p\u003e\u003ch2 id=\"x-seems-to-be-selling-your-user-data-for-third-party-ai-training\"\u003eX seems to be selling your user data for third-party AI training\u003c/h2\u003e\u003cp\u003e\u003ca href=\"https://techcrunch.com/2024/10/17/elon-musks-x-is-changing-its-privacy-policy-to-allow-third-parties-to-train-ai-on-your-posts/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eAs reported by TechCrunch\u003c/a\u003e, X updated its \u003ca href=\"https://x.com/en/privacy\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ePrivacy Policy\u003c/a\u003e on Wednesday, indicating the company will hand over user data to third-party collaborators for AI training purposes. This is the default, not an opt-in situation: If you don\u0026#39;t like the sound of your posts and activity being used to train mysterious AI systems out in the world, you need to decidedly say so—assuming you even know that\u0026#39;s an option in the first place. \u003c/p\u003e\u003cp\u003eWhile the rule change doesn\u0026#39;t say whether X is benefitting financially from these third-party collaborations, that seems likely. After all, other companies have sold user data to other companies to train AI models, includiing both \u003ca href=\"https://lifehacker.com/tech/reddit-testing-ai-summaries\" target=\"_blank\"\u003eReddit\u003c/a\u003e and \u003ca href=\"https://lifehacker.com/tech/discord-data-sold-to-ai-and-law-enforcement\" target=\"_blank\"\u003eDiscord\u003c/a\u003e, each of which, like X, has an enormous amount of user-generated content to offer to top buyers.\u003c/p\u003e\u003cp\u003eThe specific portion of the Privacy Policy that calls out this activity is as follows: \u003c/p\u003e\u003cp\u003e“\u003cstrong\u003eThird-party collaborators.\u003c/strong\u003e Depending on your \u003ca href=\"https://x.com/settings/account\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003e\u003cu\u003esettings\u003c/u\u003e\u003c/a\u003e, or if you decide to share your data, we may share or disclose your information with third parties. If you do not opt out, in some instances the recipients of the information may use it for their own independent purposes in addition to those stated in X’s Privacy Policy, including, for example, to train their artificial intelligence models, whether generative or otherwise.”\u003c/p\u003e\u003ch2 id=\"how-to-opt-out-of-ai-data-sharing-on-x\"\u003eHow to opt-out of AI data sharing on X\u003c/h2\u003e\u003cp\u003eTo opt-out of this data sharing, you need to change your Settings on X. Head to \u003cstrong\u003ePrivacy and safety\u003c/strong\u003e, then, under \u003cstrong\u003eData sharing and personalization\u003c/strong\u003e, click \u003cstrong\u003eData sharing with business partners\u003c/strong\u003e. Disable this feature to opt-out. \u003c/p\u003e\u003cp\u003eWhat\u0026#39;s potentially most egregious about this situation to me, aside from X selling user data in the first place, is that it\u0026#39;s not obvious at all how to disable it. Even when you go to this setting\u0026#39;s page, it says the following:\u003c/p\u003e\u003cp\u003e\u0026#34;X always shares information with business partners as a way to run and improve its products. When enabled, this allows X to share additional information with those partners to help support running X’s business, including making X’s marketing activities on other sites and apps more relevant for you. \u003ca href=\"https://support.x.com/articles/20175379\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eLearn more\u003c/a\u003e.\u0026#34;\u003c/p\u003e\u003cp\u003eThere\u0026#39;s no explicit mention of selling your data for AI training. In fact, if you click that \u0026#34;Learn more\u0026#34; link, the page it leads to doesn\u0026#39;t mention anything about AI training either. TechCrunch posits that X will update these descriptions on Nov. 15, when they officially update their Privacy Policy. Of course, that\u0026#39;s speculation, so we\u0026#39;ll have to wait and see.\u003c/p\u003e\u003ch2 id=\"x-doesnt-care-about-you\"\u003eX doesn\u0026#39;t care about you\u003c/h2\u003e\u003cp\u003eEither way, X clearly has no desire for the majority of its user base to opt-out of this data sharing, likely because it\u0026#39;s in their financial interest to keep them in the dark. X is \u003ca href=\"https://finance.yahoo.com/news/elon-musk-financial-woes-x-125351398.html\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003efloundering when it comes to its finances\u003c/a\u003e, so the company needs to find ways to make money. \u003ca href=\"https://www.cnn.com/2024/09/05/business/advertisers-x-withdrawal/index.html\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eAdvertisers are fleeing\u003c/a\u003e, and most people don\u0026#39;t want to pay for something they can get for free, so, sure, let\u0026#39;s sell your data instead.\u003c/p\u003e\u003cp\u003eTechCrunch also reports the new Privacy Policy removed language that defined the length of time the company would hold onto your data, in favor of language that says they will keep it for basically as long as your account is active, and as long as they see fit. In addition, you can\u0026#39;t expect data your delete from X to be gone forever, as the policy says \u0026#34;public content can exist elsewhere even after it is removed from X.\u0026#34; While the company uses examples like search engines and third-parties holding your data, you can imagine this also covers those third-parties who are training their AI models with your posts.\u003c/p\u003e\u003cp\u003eIf you\u0026#39;ve finally had enough, consider jumping ship to one of \u003ca href=\"https://lifehacker.com/the-five-best-twitter-alternatives-1850607746\" target=\"_blank\"\u003ethe many X alternatives out there\u003c/a\u003e. (And if you choose Bluesky, \u003ca href=\"https://lifehacker.com/tech/use-this-extension-to-find-all-your-x-followers-on-bluesky\" target=\"_blank\"\u003ethere\u0026#39;s a good way to find all of your X followers there\u003c/a\u003e.)\u003c/p\u003e\n\u003c/article\u003e\n\n\u003c/section\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-18T21:00:00Z",
  "modifiedTime": "2024-10-18T21:00:00Z"
}
