{
  "id": "f3cefbcf-a3a0-4aae-a0c2-c4d124570e4b",
  "title": "Brian Cox Is Totally Cool With Anthony Hopkins’ Greater Hannibal Lecter Fame",
  "link": "https://gizmodo.com/brian-cox-is-totally-cool-with-anthony-hopkins-greater-hannibal-lecter-fame-2000539556",
  "description": "Cox played the infamous cannibal in 1986's Manhunter, two years before Hopkins' Oscar-winning take on the character in The Silence of the Lambs.",
  "author": "Cheryl Eddy",
  "published": "Mon, 16 Dec 2024 23:30:34 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Movies",
    "Anthony Hopkins",
    "Brian Cox",
    "Hannibal Lecter",
    "Silence of the Lambs"
  ],
  "byline": "Cheryl Eddy",
  "length": 2426,
  "excerpt": "Cox played the infamous cannibal in 1986's Manhunter, two years before Hopkins' Oscar-winning take on the character in The Silence of the Lambs.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "In a new interview tied to The Lord of the Rings: The War of the Rohirrim that ends up being mostly about Succession (perhaps unsurprisingly), Brian Cox spoke about what it was like to be the guy who played Hannibal Lecter on screen first… a few years before Anthony Hopkins’ Oscar-winning performance in The Silence of the Lambs made everyone think he’d originated the role. The veteran actor, who since 1986 has carved out his own share of legendary performances, has made peace with what could’ve been an epic thespian feud. “Well, it’s a different character,” he told the Hollywood Reporter. “I mean, it’s like playing Hamlet. Everybody’s going to have their own Hamlet. I chose to play it the way the director Michael Mann and I decided to play it. Tony played it brilliantly. I mean, I had to go to Paris to see it because I couldn’t bring myself to see it in London.” Asked for clarification on the last part of his answer, Cox explained, “Because people knew that I was the other Hannibal, and I was worried about them saying, ‘You’re comparing Hannibal Lecters’ and all that. But we played it the way we played it. Tony decided to take it down another route. And of course, Tony’s was a huge success, and he got the Oscar and he made a lot of money out of it. I made something like 10 grand.” But the one rule that’s stuck with both, apparently, is that Cox and Hopkins do not talk about Hannibal Lecter. “I did an interview with a newspaper, and the headline in the newspaper was that I was the first Hannibal Lecter. Well, that was true, but it sounded like I was boasting about it and I wasn’t. And then I woke up one afternoon and the phone started ringing and all hell broke loose … Tony’s then-missus rang my agent and said, ‘Tony’s a bit upset about that.’ So I rang my agent and I said, ‘Look, I apologize.’ Tony and I have worked together a couple of times since. We never talk about it. And that’s a rule that we never would.” For those wondering, THR didn’t bring up Mads Mikkelsen’s take on the character on the TV series Hannibal—so we’re still wondering what Cox thought of that version of the sophisticated serial killer. With that in mind, you can head to THR to read the full interview. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2024/12/hannibals_lecter.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eIn a new interview tied to \u003ca href=\"https://gizmodo.com/lord-of-the-rings-anime-review-war-of-rohirrim-2000535428\"\u003e\u003cem\u003eThe Lord of the Rings: The War of the Rohirrim\u003c/em\u003e\u003c/a\u003e that ends up being mostly about \u003cem\u003eSuccession\u003c/em\u003e (\u003ca href=\"https://gizmodo.com/kraven-lord-of-the-rings-box-office-2000539033\"\u003eperhaps unsurprisingly\u003c/a\u003e), Brian Cox spoke about what it was like to be the guy who played Hannibal Lecter on screen first… a few years before Anthony Hopkins’ Oscar-winning performance in \u003ca href=\"https://gizmodo.com/the-hottest-horror-movie-of-summer-2024-is-the-silence-1851575606\"\u003e\u003cem\u003eThe Silence of the Lambs\u003c/em\u003e\u003c/a\u003e made everyone think he’d originated the role.\u003c/p\u003e \u003cp\u003eThe veteran actor, who since 1986 has carved out his own share of legendary performances, has made peace with what could’ve been an epic thespian feud. “Well, it’s a different character,” he told \u003ca href=\"https://www.hollywoodreporter.com/tv/tv-features/brian-cox-interview-succession-oscars-kevin-spacey-jeremy-strong-1236085831/\"\u003ethe Hollywood Reporter\u003c/a\u003e. “I mean, it’s like playing Hamlet. Everybody’s going to have their own Hamlet. I chose to play it the way the director Michael Mann and I decided to play it. Tony played it brilliantly. I mean, I had to go to Paris to see it because I couldn’t bring myself to see it in London.”\u003c/p\u003e \u003cp\u003eAsked for clarification on the last part of his answer, Cox explained, “Because people knew that I was the other Hannibal, and I was worried about them saying, ‘You’re comparing Hannibal Lecters’ and all that. But we played it the way we played it. Tony decided to take it down another route. And of course, Tony’s was a huge success, and he got the Oscar and he made a lot of money out of it. I made something like 10 grand.”\u003c/p\u003e\n\n \u003cp\u003eBut the one rule that’s stuck with both, apparently, is that Cox and Hopkins \u003cem\u003edo not talk\u003c/em\u003e about Hannibal Lecter. “I did an interview with a newspaper, and the headline in the newspaper was that I was the first Hannibal Lecter. Well, that was true, but it sounded like I was boasting about it and I wasn’t. And then I woke up one afternoon and the phone started ringing and all hell broke loose … Tony’s then-missus rang my agent and said, ‘Tony’s a bit upset about that.’ So I rang my agent and I said, ‘Look, I apologize.’ Tony and I have worked together a couple of times since. We never talk about it. And that’s a rule that we never would.”\u003c/p\u003e \u003cp\u003eFor those wondering, THR didn’t bring up Mads Mikkelsen’s take on the character on the TV series \u003cem\u003eHannibal\u003c/em\u003e—so we’re still wondering what Cox thought of \u003cem\u003ethat\u003c/em\u003e version of the sophisticated serial killer. With that in mind, you can head to \u003ca href=\"https://www.hollywoodreporter.com/tv/tv-features/brian-cox-interview-succession-oscars-kevin-spacey-jeremy-strong-1236085831/\"\u003eTHR\u003c/a\u003e to read the full interview.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-16T23:30:34Z",
  "modifiedTime": "2024-12-16T23:30:34Z"
}
